{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Stu Woo, Karen Langley, Heard Editors, Deepa Seetharaman, WSJ Staff, Dan Gallagher, Jack Pitcher, David Uberti, Krystal Hur, Ryan Dezember, Chelsey Dulaney, Drew FitzGerald, Joseph Walker, Ben Fritz, Alexander Osipovich, Vicky Ge Huang", "title": "Stock Market Today: Nasdaq Closes 300 Points Lower; Nvidia Sinks on DeepSeek Threat — Live Updates - The Wall Street Journal", "description": "After China's DeepSeek prompts AI rethink, Nvidia stock slides. Follow along for live updates on stocks and other markets, including the Dow Jones Industrial Average, S&P 500 and Nasdaq Composite.", "url": "https://www.wsj.com/livecoverage/stock-market-today-dow-sp500-nasdaq-live-01-27-2025", "urlToImage": "https://images.wsj.net/im-925349/social", "publishedAt": "2025-01-27T22:15:00Z", "content": "Technology stocks tumbled Monday on news that Chinas DeepSeek had trained a sophisticated artificial-intelligence model at a fraction of the cost of its Silicon Valley rivals, triggering a sudden rev… [+2082 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Hayden Field", "title": "DeepSeek hit with large-scale cyberattack, says it's limiting registrations - CNBC", "description": "DeepSeek on Monday said it would temporarily limit user registrations \"due to large-scale malicious attacks\" on its services.", "url": "https://www.cnbc.com/2025/01/27/deepseek-hit-with-large-scale-cyberattack-says-its-limiting-registrations.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/108092650-17379831282025-01-27t125916z_1171719196_rc2cica8vist_rtrmadp_0_deepseek-markets.jpeg?v=1737983192&w=1920&h=1080", "publishedAt": "2025-01-27T16:26:34Z", "content": "DeepSeek on Monday said it would temporarily limit user registrations \"due to large-scale malicious attacks\" on its services, though existing users will be able to log in as usual.\r\nThe Chinese artif… [+2298 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": "Barron's", "title": "Nvidia Stock, Broadcom Plummet as China's DeepSeek AI Sparks Big Chip Selloff - Barron's", "description": null, "url": "https://www.barrons.com/articles/nvidia-stock-deepseek-ai-chip-selloff-9a1c1a77", "urlToImage": null, "publishedAt": "2025-01-27T10:28:00Z", "content": null}]}