{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Variety"}, "author": "Joe Otterson", "title": "‘Last of Us’ Shocker: Neil Druckmann Exits HBO Series Ahead of Season 3 - Variety", "description": "Neil Druckmann has announced he is stepping away from \"The Last of Us\" TV series at HBO.", "url": "https://variety.com/2025/tv/news/neil-druckmann-exits-the-last-of-us-season-3-hbo-1236446316/", "urlToImage": "https://variety.com/wp-content/uploads/2025/07/Neil.jpg?w=1000&h=563&crop=1", "publishedAt": "2025-07-02T17:50:00Z", "content": "UPDATED: Neil Druckmann has announced he is stepping away from “The Last of Us” TV series at HBO.\r\n“I’ve made the difficult decision to step away from my creative involvement in The Last of Us on HBO… [+3233 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, Issy Ronald", "title": "Catherine, Princess of Wales makes first public appearance after dropping out of Royal Ascot - CNN", "description": "Catherine, Princess of Wales visited a wellbeing garden at Colchester Hospital on Wednesday, marking her first public appearance since she unexpectedly dropped out of an appearance at Royal Ascot two weeks ago.", "url": "https://www.cnn.com/2025/07/02/uk/catherine-first-public-appearance-royal-ascot-intl-scli", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2222465148.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-07-02T12:54:00Z", "content": "Catherine, Princess of Wales has reflected on the really difficult aftermath of chemotherapy during her first public appearance since unexpectedly withdrawing from Royal Ascot two weeks ago.\r\nDuring … [+2936 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Nellie Andreeva", "title": "‘South Park’ Season 27 Premiere Date Pushed By Comedy Central Amid Streaming Deal Uncertainty - Deadline", "description": "The Season 27 premiere of South Park, originally slated for July 9, has been moved to July 23 amid tension over the show's lucrative streaming deal.", "url": "http://deadline.com/2025/07/south-park-season-27-premiere-date-change-streaming-deal-1236447487/", "urlToImage": "https://deadline.com/wp-content/uploads/2025/07/SP_S27_1920x1080_July.png?w=1024", "publishedAt": "2025-07-02T12:45:00Z", "content": "UPDATED with Trey Parker and Matt Stone‘s statement: South Park fans who have waited for more than two years to get a new season of the hit animated comedy, will have to wait a little bit longer — th… [+3032 chars]"}, {"source": {"id": null, "name": "MovieWeb"}, "author": "Jonathan Fuge", "title": "'The Old Guard 2' Reviews & Rotten Tomatoes Rating Reveal if Long-Awaited Netflix Action Sequel Was Worth the Wait - MovieWeb", "description": "After five years of waiting, Charlize Theron returns as an immortal warrior in &#039;The Old Guard 2&#039;..and the Rotten Tomatoes score has now been revealed.", "url": "https://movieweb.com/the-old-guard-2-reviews-rotten-tomatoes-action-superhero-netflix/", "urlToImage": "https://static1.moviewebimages.com/wordpress/wp-content/uploads/2025/05/the-old-guard-2-1.jpg", "publishedAt": "2025-07-02T09:25:00Z", "content": "Action movie fans have been waiting patiently for five years for the follow-up to the Netflix superhero hit, The Old Guard. Well, the glorious day has finally arrived, as Charlize Theron and her band… [+4349 chars]"}]}