{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Miracle, Josh Campbell, Mark Morales", "title": "A suspect is in custody in connection with the investigation into the killings of four University of Idaho students, sources say - CNN", "description": "A suspect was taken into custody in connection with the investigation into the murders of four University of Idaho students, two federal law enforcement sources confirmed to CNN on Friday. The arrest was made by the FBI in northeastern Pennsylvania, the sourc…", "url": "https://www.cnn.com/2022/12/30/us/university-of-idaho-student-killings-investigation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221201113344-idaho-victims-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-30T16:46:00Z", "content": "A suspect was taken into custody in connection with the investigation into the murders of four University of Idaho students, two federal law enforcement sources confirmed to CNN on Friday.\r\nThe arres… [+1948 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "Riverside County sheriff says suspect in slaying of Deputy Isaiah Cordero had violent criminal history - KABC-TV", "description": "The suspect \"should have been immediately sentenced to 25 years to life,\" after being convicted of a \"third strike\" last year, the Riverside County sheriff said.", "url": "https://abc7.com/riverside-isaiah-cordero-sheriff-deputy-shooting/12630631/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12630709_rivco_bianco.jpg?w=1600", "publishedAt": "2022-12-30T15:45:00Z", "content": "RIVERSIDE, Calif. (KABC) -- A Riverside County sheriff's deputy was shot and killed Thursday by a man with a violent criminal history during a traffic stop and the suspect later died in a shootout on… [+2796 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Andrew Tate detained in Romania over rape and human trafficking case - BBC", "description": "The controversial online influencer has been detained in Romania alongside his brother Tristan.", "url": "https://www.bbc.com/news/world-europe-64122628", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/267F/production/_128155890_tate-index-reuters.jpg", "publishedAt": "2022-12-30T15:41:07Z", "content": "Media caption, Andrew Tate: Police release raid video after influencer arrested\r\nControversial online influencer Andrew Tate has been detained in Romania as part of a human trafficking and rape inves… [+4469 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Philip van Doorn", "title": "These 20 stocks were the biggest losers of 2022 - MarketWatch", "description": "Valuations for the most expensive Big Tech stocks finally fell to more reasonable levels in 2022, as a very big name suffered the biggest decline in market capitalization", "url": "https://www.marketwatch.com/story/these-20-stocks-were-the-biggest-losers-of-2022-11672360725", "urlToImage": "https://images.mktw.net/im-694330/social", "publishedAt": "2022-12-30T14:45:00Z", "content": "This has been the year of reckoning for Big Tech stocks even those of companies that have continued to grow sales by double digits.Below is a list of the 20 stocks in the S&amp;P 500 \r\n SPX,\r\n -0.80%… [+8367 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "'Thank you, King': Brazil lights up in honour of Pelé - BBC", "description": "Brazil begins its first day of mourning the late footballing legend as landmarks are lit up in tribute.", "url": "https://www.bbc.com/news/world-latin-america-64125254", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/139C6/production/_128162308_pele-index-gettyimages-1245877553.jpg", "publishedAt": "2022-12-30T14:26:35Z", "content": "Brazil has woken up to its first day without footballing legend Pelé.\r\n\"The King\", who won three World Cups and was widely considered the greatest footballer of all time, died at the age of 82 in São… [+3971 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "Greg Auman", "title": "Bucs QB Blaine Gabbert helped in rescue of helicopter passengers, saving 4 - FOX Sports", "description": "Four people were rescued after their helicopter landed in water near Tampa, Fl. Thursday. One of the men instrumental in the rescue: Bucs QB Blaine Gabbert, who arrived on a jet ski.", "url": "https://www.foxsports.com/stories/nfl/bucs-qb-blaine-gabbert-helped-in-rescue-of-helicopter-passengers-saving-4", "urlToImage": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2022/12/1408/814/GettyImages-1448687752.jpg?ve=1&tl=1", "publishedAt": "2022-12-30T14:25:04Z", "content": "Floating in open water after the helicopter he and his parents had taken a tour on made an emergency landing into the water off Davis Islands on Thursday evening, Hunter Hupp had no idea who the thre… [+3616 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Top 10 Movies of 2022 | A CineFix Movie List - CineFix - IGN Movies and TV", "description": "Another trip around the sun means it’s time for another CineFix Best Movies of the Year list. 2022 saw a ton of movies back in theaters and a ton of butts ba...", "url": "https://www.youtube.com/watch?v=WdH3M3iOx2k", "urlToImage": "https://i.ytimg.com/vi/WdH3M3iOx2k/hqdefault.jpg", "publishedAt": "2022-12-30T14:00:14Z", "content": null}, {"source": {"id": "nfl-news", "name": "NFL News"}, "author": "NFL", "title": "NFL Week 17 bold predictions: DROY candidates Sauce Gardner, Tariq Woolen each record INT - NFL.com", "description": "How will Defensive Rookie of the Year candidates Sauce Gardner and Tariq Woolen fare when their teams face off in Seattle? NFL Network analysts provide bold predictions for Week 17 of the 2022 season.", "url": "https://www.nfl.com/news/nfl-week-17-bold-predictions-droy-candidates-sauce-gardner-tariq-woolen-each-rec", "urlToImage": "https://static.www.nfl.com/image/private/t_editorial_landscape_12_desktop/league/xch3s6xdfrbolgmrn2ij", "publishedAt": "2022-12-30T13:38:00Z", "content": "Von Miller terrorized Joe Burrow while playing for the Rams in Super Bowl LVI, and it was that kind of performance that led Buffalo to sign the future Hall of Fame pass rusher. But with no Miller -- … [+353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget, Caroll Alvarado, Jeanne Bonner", "title": "'He was an angel in our community.' These are the stories of the victims of the Buffalo blizzard - CNN", "description": "Most of the victims in Erie County, New York, were found dead either outside or in their homes, while others died in their cars, as the result of delayed emergency medical service, and while removing snow or from cardiac arrest, officials said.", "url": "https://www.cnn.com/2022/12/29/us/buffalo-blizzard-victims-stories/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221229145206-01-buffalo-snow-stories.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-30T13:25:00Z", "content": "Abdul Sharifu, 26, left his home in Buffalo Saturday afternoon in blizzard conditions to get milk and other supplies. He never made it back. \r\nSharifu is among at least 39 fatalities in Erie County, … [+8392 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Vivienne Westwood: Tributes for 'Queen of British Fashion' after her death - BBC", "description": "The \"undisputed Queen of British fashion\" who never failed to surprise or shock dies at 81.", "url": "https://www.bbc.com/news/uk-64122181", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/4033/production/_128153461_1785ac6d0ca52795c035519121ca67fc6992ea600_103_3000_16881000x563.jpg", "publishedAt": "2022-12-30T12:03:16Z", "content": "Tributes to Dame Vivienne Westwood have poured in following the death of the \"undisputed Queen of British fashion\".\r\nShe died \"peacefully and surrounded by her family\" in London, her fashion house sa… [+5154 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "2022 space stories that are out of this world - Fox News", "description": "From the scientific discoveries of the James Webb Space Telescope to the operation of the Perseverance rover, here are the year's most out-of-this-world space stories.", "url": "https://www.foxnews.com/science/2022-space-out-of-this-world", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/07/Carina.jpg", "publishedAt": "2022-12-30T11:22:07Z", "content": "From the successful scientific operations of NASAs James Webb Space Telescope to the splashdown of the Orion space capsule, 2022 has seen a lot of wins.\r\nHere are the biggest moments to remember:\r\nDo… [+4984 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Special Report: Boy Scouts, Catholic dioceses find haven from sex abuse suits in bankruptcy - Reuters", "description": "Lawmakers around the United States have tried to grant justice to victims of decades-old incidents of child sexual abuse by giving them extra time to file lawsuits. Now some of the defendants in these cases, including church and youth organizations, are findi…", "url": "https://www.reuters.com/world/us/boy-scouts-catholic-dioceses-find-haven-sex-abuse-suits-bankruptcy-2022-12-30/", "urlToImage": "https://www.reuters.com/resizer/XO_GQmgN0UjkxQuV3mCuaC5jDZM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/DH36EBNJ5BOMPAEIT2IMKTZY4Q.jpg", "publishedAt": "2022-12-30T11:07:00Z", "content": "Dec 30 (Reuters) - Lawmakers around the United States have tried to grant justice to victims of decades-old incidents of child sexual abuse by giving them extra time to file lawsuits. Now some of the… [+17410 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Briley Lewis", "title": "The most distant spacecraft in the solar system — Where are they now? - Space.com", "description": "What have Voyager 1 and 2, Pioneer 10 and 11 and New Horizons been up to in 2022?", "url": "https://www.space.com/most-distant-spacecraft-voyagers-new-horizons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MGtKagLuXcvPWkAv8rMtXX-1200-80.jpeg", "publishedAt": "2022-12-30T11:00:30Z", "content": "Humans have been flinging things into deep space for 50 years now, since the 1972 launch of Pioneer 10. We now have five spacecraft that have either reached the edges of our solar system or are fast … [+7644 chars]"}, {"source": {"id": null, "name": "Gothamist"}, "author": "https://gothamist.com/staff/clayton-guse", "title": "Here's a list of NY Rep.-elect George Santos' lies, deceptions and fabrications - Gothamist", "description": "Gothamist is a non-profit local newsroom, powered by WNYC.", "url": "https://gothamist.com/news/heres-a-list-of-ny-rep-elect-george-santos-lies-deceptions-and-fabrications", "urlToImage": "https://cms.prod.nypr.digital/images/335829/fill-1200x650|format-jpeg|jpegquality-85", "publishedAt": "2022-12-30T10:00:00Z", "content": "Days away from being sworn in as a member of Congress, Rep.-elect George Santos' candidacy has come under increased scrutiny after the Republican admitted to embellishing his resume and fabricating h… [+3157 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Marielle Descalsota", "title": "A Buffalo couple who lives on a church campus stocked up on food to spend Christmas with their 9 kids — but when the storm hit, they opened their doors to 130 strangers instead - Yahoo News", "description": "Al and Vivien Robinson were planning to spend Christmas with their kids — until they heard that locals were \"freezing to death.\"", "url": "https://www.insider.com/buffalo-couple-feeds-strangers-blizzard-snowstorm-2022-12", "urlToImage": "https://i.insider.com/63ae656d3e42ed001855ec85?width=1200&format=jpeg", "publishedAt": "2022-12-30T09:03:39Z", "content": "A couple in Buffalo is being hailed as heroes for feeding more than 100 people during the blizzard that has left at least 39 dead.\r\nAl Robinson is a pastor with the Spirit Of Truth Urban Ministry in … [+2762 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sean O'grady", "title": "Shirtless Mark Wahlberg, 51, enjoys trip to the beach in Barbados - Daily Mail", "description": "The actor, 51, went for a dip in the Caribbean as he enjoyed some quality time with his wife Rhea Durham on their sun-kissed holiday.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-11584991/Shirtless-Mark-Walhberg-51-enjoys-trip-beach-wife-Rhea-Durham-Barbados.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/30/08/66041729-0-image-a-48_1672389316007.jpg", "publishedAt": "2022-12-30T08:55:36Z", "content": "Mark Wahlberg showed off his gym-honed physique as he enjoyed a day at the beach near the Sandy Lane Hotel in Barbados on Thursday.\r\nThe actor, 51, went for a dip in the Caribbean as he enjoyed some … [+4183 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul", "title": "Myanmar court extends Aung San Suu Kyi's prison sentence to 33 years - CNN", "description": "A court in military-run Myanmar has sentenced Aung San Suu Kyi to seven years in prison for corruption, a source familiar with the case told CNN, bringing an end to a string of secretive and highly-politicized proceedings against the ousted former leader.", "url": "https://www.cnn.com/2022/12/30/asia/myanmar-aung-san-suu-kyi-court-verdict-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220902133407-aung-san-suu-kyi-file-081816.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-30T07:13:00Z", "content": "A court in military-run Myanmar has sentenced Aung San Suu Kyi to seven years in prison for corruption, a source familiar with the case told CNN, bringing an end to a string of secretive and highly-p… [+2853 chars]"}, {"source": {"id": null, "name": "Rolling Stone"}, "author": "Ethan Millman", "title": "Steven Tyler Accused of Sexual Assault of a Minor in New Lawsuit Over a Decades-Old Claim - Rolling Stone", "description": "Julia Holcomb claims the Aerosmith singer, who is not named in the suit, engaged in a sexual relationship with her in the mid-1970s, starting when she was 16 years old", "url": "https://www.rollingstone.com/music/music-news/steven-tyler-sexual-assault-minor-lawsuit-1234653817/", "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2022/12/steven-tyler.jpg?w=1600&h=900&crop=1", "publishedAt": "2022-12-30T05:03:37Z", "content": "A woman who claims to have had an illicit relationship with Steven Tyler in the Seventies when she was a minor has filed a lawsuit against the Aerosmith singer, accusing him of sexual assault, sexual… [+6904 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Namita Singh", "title": "Pope Benedict news - latest: Vatican gives update on former Pope’s condition - The Independent", "description": "Pope Benedict XVI is very ill, with Pope Francis asking for prayers ‘to accompany him in these difficult hours’", "url": "https://www.independent.co.uk/news/world/europe/pope-benedict-xvi-emeritus-francis-vatican-b2253348.html", "urlToImage": "https://static.independent.co.uk/2022/12/28/09/SEI138674643.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-12-30T04:00:00Z", "content": "The major events of Pope Benedicts papacy and retirement\r\n19 April 2005 - German Cardinal Joseph Ratzinger, the head of the Vaticans doctrinal office, is elected to succeed Pope John Paul II as the 2… [+3134 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Something Strange Happens to The Temperature Around Freshly Formed Bubbles - ScienceAlert", "description": "When you stop and think about bubbles, you realize that they're everywhere: in the dishwasher, on the top of your beer, on the crests of waves, in the saliva between your teeth, and, of course, in bubble gun toys.", "url": "https://www.sciencealert.com/something-strange-happens-to-the-temperature-around-freshly-formed-bubbles", "urlToImage": "https://www.sciencealert.com/images/2022/12/FloatingBubble.jpg", "publishedAt": "2022-12-30T03:51:33Z", "content": "When you stop and think about bubbles, you realize that they're everywhere: in the dishwasher, on the top of your beer, on the crests of waves, in the saliva between your teeth, and, of course, in bu… [+2856 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "We May Finally Know Why Some People Don't Recover Their Sense of Smell After COVID - ScienceAlert", "description": "(It's well known that having COVID-19 can affect your sense of smell, but in some cases, that olfactory function doesn't properly return.", "url": "https://www.sciencealert.com/we-may-finally-know-why-some-people-dont-recover-their-sense-of-smell-after-covid", "urlToImage": "https://www.sciencealert.com/images/2022/12/UpNoseShot.jpeg", "publishedAt": "2022-12-30T03:20:38Z", "content": "(It's well known that having COVID-19 can affect your sense of smell, but in some cases, that olfactory function doesn't properly return. Now new research explains why.\r\nThe SARS-CoV-2 infection prom… [+2581 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona", "title": "McCarthy offers his critics a key concession in effort to clinch House speakership - CNN", "description": "House Republican Leader Kevin McCarthy has offered a key concession to critics of his bid for the House speakership during private conversations this week: reducing the threshold that is required to force a floor vote on ousting the sitting speaker, according…", "url": "https://www.cnn.com/2022/12/29/politics/kevin-mccarthy-house-speaker-bid/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221230115820-kevin-mccarthy-122322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-30T03:02:00Z", "content": "House Republican Leader Kevin McCarthy has offered a key concession to critics of his bid for the House speakership during private conversations this week: reducing the threshold that is required to … [+2545 chars]"}, {"source": {"id": null, "name": "Nintendo Life"}, "author": "Liam Doolan", "title": "A New Limited-Time Pokémon Scarlet & Violet Tera Raid Battle Starts Today - Nintendo Life", "description": "Catch a special Cinderace", "url": "https://www.nintendolife.com/news/2022/12/a-new-limited-time-pokemon-scarlet-and-violet-tera-raid-battle-starts-today", "urlToImage": "https://images.nintendolife.com/c1b440bb1f663/1280x720.jpg", "publishedAt": "2022-12-30T02:00:00Z", "content": "Gonna post this to help others. Courtesy to r/Far_Reach5275 for posting this first\r\nEspathra w OpportunistShell Bell252 Hp / 252 Sp Atk / 4 DefRain DanceLuminia CrashPsychic or Stored Power (just dis… [+971 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Officials advise residents about the potential for flooding - FOX40 News", "description": "Flood watches have been issued across most of Northern California, from the Delta region to the Greater Lake Tahoe area.", "url": "https://www.youtube.com/watch?v=IKyhw5Xr6Co", "urlToImage": "https://i.ytimg.com/vi/IKyhw5Xr6Co/hqdefault.jpg", "publishedAt": "2022-12-30T01:20:13Z", "content": null}, {"source": {"id": null, "name": "Benzinga"}, "author": "Shivdeep Dhaliwal", "title": "Bitcoin, Ethereum, Dogecoin Show Resilience As 2022 Fades Away, Analyst Says 'Plenty More Twists And Turns To Come Early Next Year' - Bitcoin (BTC/USD), Ethereum (ETH/USD), Dogecoin (DOGE/USD) - Benzinga", "description": "Large cryptocurrencies were in the green on Thursday evening as the global cryptocurrency market cap rose 0.4% to $798.2 billion at 7:13 p.m. EST.  ​​", "url": "https://www.benzinga.com/markets/cryptocurrency/22/12/30233139/bitcoin-ethereum-dogecoin-show-resilience-as-2022-fades-away-analyst-says-plenty-more-twis", "urlToImage": "https://cdn.benzinga.com/files/images/story/2022/12/29/andre-francois-mckenzie-igyibhdntpe-unsplash.jpg?width=1200&height=800&fit=crop", "publishedAt": "2022-12-30T01:00:00Z", "content": "Large cryptocurrencies were in the green on Thursday evening as the global cryptocurrency market cap rose 0.4% to $798.2 billion at 7:13 p.m. EST. \r\n<table>Price Performance Of Major Coins\r\n<tr><th>C… [+2420 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Irina Ivanova", "title": "Here's what tax pros are looking for in Donald Trump's returns - CBS News", "description": "A House committee investigating the former president is set to release more details of his returns on Friday.", "url": "https://www.cbsnews.com/news/trump-tax-returns-heres-what-tax-pros-are-looking-for/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/11/14/438b44df-0cb3-4c07-8f2a-73f1ba62715c/thumbnail/1200x630/f1476b33753d083712187b710054b83e/gettyimages-1244627968.jpg", "publishedAt": "2022-12-29T23:54:06Z", "content": "Donald Trump's tax returns — long the subject of speculation and a bitter legal fight — are set to be made public. After last week releasing a summary of the IRS' efforts to audit the former presiden… [+7094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger", "title": "Diabetes rates may surge in US young people, study finds - CNN", "description": "The number of people under age 20 with type 2 diabetes in the US may increase nearly 675% by 2060 if trends continue, researchers say, with an increase of up to 65% in young people with type 1 diabetes.", "url": "https://www.cnn.com/2022/12/29/health/diabetes-young-people/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220328094959-diabetes.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-29T21:03:00Z", "content": "The number of people under age 20 with type 2 diabetes in the US may increase nearly 675% by 2060 if trends continue, researchers say, with an increase of up to 65% in young people with type 1 diabet… [+2246 chars]"}, {"source": {"id": null, "name": "Siliconera"}, "author": "Graham Russell", "title": "Siliconera's Nintendo Switch Game of the Year 2022 - Siliconera", "description": "", "url": "https://www.siliconera.com/siliconeras-nintendo-switch-game-of-the-year-2022/", "urlToImage": "https://www.siliconera.com/wp-content/uploads/2022/12/goty2022-ns.jpg", "publishedAt": "2022-12-29T20:00:17Z", "content": "Whether they were testing the limits of the hardware or focusing on gameplay over tech, our Nintendo Switch Game of the Year 2022 selections all stand out through fun and mechanical polish. Check out… [+1563 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Kenneth Shepard", "title": "PlayStation Decided Games Weren't Enough In 2022 - Kotaku", "description": "As Sony prepares to fully shift its focus from the PS4 to the PS5, it's also building the PlayStation brand in other ways", "url": "https://kotaku.com/sony-2022-ps5-ps4-year-in-review-playstation-plus-1849934363", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/01d49ef1ce353f712f4e7e9821045a71.jpg", "publishedAt": "2022-12-29T17:00:00Z", "content": "The decision-makers behind Sonys console juggernaut spent a lot of 2022 putting down railway for 2023 and beyond, dumping money and time into growing the PlayStation brand beyond the funky-looking de… [+9853 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rong-Gong Lin II, Luke Money", "title": "Strep infections in children that can result in 'flesh-eating' disease becoming a concern - Yahoo News", "description": "Shortly before Christmas, the CDC issued an advisory on the recent increase in pediatric invasive Group A streptococcal infections, otherwise known as iGAS.", "url": "https://news.yahoo.com/strep-infections-children-result-flesh-154801428.html", "urlToImage": "https://media.zenfs.com/en/la_times_articles_853/a3014d649db8e6054ad901ec0abe7117", "publishedAt": "2022-12-29T15:48:01Z", "content": "A computer-generated image of a group of Gram-positive group A Streptococcus bacteria. (Jennifer Oosthuizen / CDC)\r\nDoctors should be on the lookout for a particular kind of invasive strep infection … [+4857 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Stunning photo shows every planet in the solar system lining up across the night sky - Daily Mail", "description": "Stargazers from around the world have shared  images of Mercury, Venus, Mars, Jupiter and Saturn lining up in the night sky over the course of this week.", "url": "https://www.dailymail.co.uk/sciencetech/article-11581887/Stunning-photo-shows-planet-solar-lining-night-sky.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/29/08/66012583-0-image-a-45_1672303276027.jpg", "publishedAt": "2022-12-29T14:08:43Z", "content": "Stargazers have been capturing some spectacular images of a rare astronomical event that means every planet in the solar system is visible in the night sky at the same time.\r\nMercury, Venus, Mars, Ju… [+8648 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Patrick Hearn", "title": "'Beats AirPods by a mile' Sennheiser CX True Wireless earbuds are more than 50% off - Yahoo Life", "description": "Are you looking for superior audio quality? Sennheiser delivers with a wide range of earbuds and headphones, and they're all on sale now.", "url": "https://www.yahoo.com/lifestyle/sennheiser-earbuds-sale-amazon-231409143.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ygWkhVB0CzUMjHK3FC0mEg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2022-12/3d767290-86ec-11ed-bcaf-479f0cb3ad3c", "publishedAt": "2022-12-28T23:14:09Z", "content": "Cheap earbuds are a dime a dozen on Amazon, but they don't all deliver the best audio quality. If you just need something for phone calls, that's fine but if you want audiophile-worthy sound, you wan… [+3288 chars]"}]}