{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "John Rosevear", "title": "Luxury EV maker Lucid appears to have a demand problem - CNBC", "description": "Lucid plans to build just 10,000 to 14,000 vehicles in 2023, despite factory capacity to build more.", "url": "https://www.cnbc.com/2023/02/24/lucid-ev-demand-problem.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106949031-16328667852021-09-28t213931z_1307921229_rc27zp9k9cej_rtrmadp_0_lucid-electric.jpeg?v=1677260189&w=1920&h=1080", "publishedAt": "2023-02-24T17:36:29Z", "content": "Luxury electric vehicle maker Lucid appears to have a demand problem.\r\nThe company said during its fourth-quarter earnings report Wednesday that it had \"over 28,000\" reservations for its Air sedan as… [+3222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell", "title": "Alex Murdaugh faces second day of cross-examination Friday in trial over 2021 killings of his wife and son - CNN", "description": "Disgraced former lawyer Alex Murdaugh is expected to face a second day of cross-examination in a South Carolina courtroom Friday morning, after telling prosecutors he previously lied about not being at the scene of his wife's and son's deaths before they were…", "url": "https://www.cnn.com/2023/02/24/us/alex-murdaugh-murder-trial-friday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230223145752-11-murdaugh-trial-0223.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-24T07:28:00Z", "content": "Disgraced former lawyer Alex Murdaugh is expected to face a second day of cross-examination in a South Carolina courtroom Friday morning, after telling prosecutors he previously lied about not being … [+4516 chars]"}, {"source": {"id": null, "name": "Positive.News"}, "author": null, "title": "What went right this week: how to stay healthy, plus more good news - Positive.News", "description": "Studies revealed the secrets to good health, the four-day week had a breakthrough, and Spain introduced menstrual leave, plus more good news", "url": "https://www.positive.news/society/good-news-stories-from-week-8-of-2023/", "urlToImage": "https://www.positive.news/wp-content/uploads/2023/02/hans-isaacson-d7i2YWBFaE4-unsplash.jpg", "publishedAt": "2023-02-23T17:29:25Z", "content": "Studies unraveled the secrets to good health Having satisfying relationships boosts your health in old age, but youll still need to exercise regularly.\r\nThose are the findings of two unrelated studie… [+836 chars]"}]}