{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Eatthis.com"}, "author": "Toby Amidor, MS, RD, CDN", "title": "Your 5-Day Heart-Healthy Meal Plan—Built by a Dietitian - Eat This, Not That", "description": "A dietitian breaks down a five-day heart-healthy meal plan with delicious recipes to help improve and fortify your heart.", "url": "https://www.eatthis.com/heart-healthy-meal-plan/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/01/turkey-two-bean-chili.jpg?quality=82&strip=all", "publishedAt": "2023-02-24T13:04:37Z", "content": "According to the American Heart Association, plaque buildup in your arteries begins when you're young and progresses slowly into adulthood. As you get older, this can lead to hypertension, stroke, an… [+11812 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Reversed With a Single Drug – “Incurable” Liver Disease May Be Curable - SciTechDaily", "description": "A new study from Sanford Burnham Prebys has discovered a drug that can spur liver regeneration in patients with Alagille syndrome. For the first time, research conducted by Associate Professor Duc Dong, Ph.D. has revealed that the detrimental effects of Alagi…", "url": "https://scitechdaily.com/?p=250924", "urlToImage": "https://scitechdaily.com/images/Human-Body-Liver.Pain-Disease.jpg", "publishedAt": "2023-02-24T04:09:43Z", "content": "Alagille syndrome is a genetic disorder that affects the liver, heart, and other parts of the body. It is characterized by a reduction in the number of bile ducts within the liver, leading to bile ac… [+4272 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Digital Markers Near-Perfect for Predicting Dementia - Neuroscience News", "description": "Researchers have created an accurate, easily interpretable new algorithm for predicting mild cognitive impairment and dementia in older adults.", "url": "https://neurosciencenews.com/ai-alzheimers-22559/", "urlToImage": "https://neurosciencenews.com/files/2023/02/digital-marker-depression-neurosicences-public.jpg", "publishedAt": "2023-02-24T00:29:03Z", "content": "Summary: Researchers have created an accurate, easily interpretable new algorithm for predicting mild cognitive impairment and dementia in older adults.\r\nSource: Columbia University\r\nUsing ensemble l… [+6964 chars]"}]}