{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Faith Geiger", "title": "Cardiologists Agree: These Are The High-Sugar Foods You Have To Stop Buying ASAP - Yahoo Life", "description": "When you think of foods to avoid for heart health, some obvious offenders probably pop into your head: greasy meals from McDonald’s, fried food, red meat...", "url": "https://www.yahoo.com/lifestyle/cardiologists-agree-high-sugar-foods-090016026.html", "urlToImage": "https://media.zenfs.com/en/shefinds_255/c328b2e7be3cc4f615c2c36f6d09ca8d", "publishedAt": "2022-11-05T09:00:16Z", "content": "packaged aisle at grocery store\r\nWhen you think of foods to avoid for heart health, some obvious offenders probably pop into your head: greasy meals from McDonalds, fried food, red meat, etc. However… [+3516 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "We May Finally Know How Many Nerve Endings Are in The Human Clitoris - ScienceAlert", "description": "The human clitoris is a scientific iceberg, both physically and figuratively.", "url": "https://www.sciencealert.com/we-may-finally-know-how-many-nerve-endings-are-in-the-human-clitoris", "urlToImage": "https://www.sciencealert.com/images/2022/11/HumanHandHolding3DPrintedModelOfHumanClitoris.jpg", "publishedAt": "2022-11-05T05:03:07Z", "content": "The human clitoris is a scientific iceberg, both physically and figuratively.\r\nIn the past, research on our species' clitoris has been superficial at best, and even the tiny bit that we think we know… [+3333 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Teens' Brains Develop Differently Depending on if They're Night Owls or Early Birds - ScienceAlert", "description": "It's 11 pm on a weeknight and your teenager still has their bedroom light on.", "url": "https://www.sciencealert.com/teens-brains-develop-differently-depending-on-if-theyre-night-owls-or-early-birds", "urlToImage": "https://www.sciencealert.com/images/2022/11/TeenStaresAtTabletWithBlanketPulledOverTheirHead.jpg", "publishedAt": "2022-11-05T02:06:22Z", "content": "It's 11 pm on a weeknight and your teenager still has their bedroom light on. You want them to get enough sleep for school the next day, but it's a struggle.\r\nOur new research shows what happens to t… [+4921 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "US hospital flu cases hit 10-year high as vaccinations fall - BBC", "description": "Five million fewer influenza doses have been administered this year to US adults than this time last year.", "url": "https://www.bbc.com/news/world-us-canada-63522871", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/74F6/production/_127524992_gettyimages-1229079269.jpg", "publishedAt": "2022-11-05T00:33:18Z", "content": "US influenza hospital admissions have hit the highest rate in a decade as vaccinations sag, US officials say.\r\nHealth experts are worried a so-called tripledemic of flu, respiratory syncytial virus (… [+1532 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Michael Mosley", "title": "DR MICHAEL MOSLEY: How I'm training myself to stop having nightmares to cut risk of getting dementia - Daily Mail", "description": "DR MICHAEL MOSLEY: Do you have recurring nightmares, such as being chased by wolves, drowning or being attacked? If so, you may be interested in a fascinating new study.", "url": "https://www.dailymail.co.uk/health/article-11392243/DR-MICHAEL-MOSLEY-Im-training-stop-having-nightmares-cut-risk-getting-dementia.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/04/22/64209903-0-image-a-17_1667599847524.jpg", "publishedAt": "2022-11-04T22:11:31Z", "content": "Do you have recurring nightmares, such as being chased by wolves, drowning or being attacked?\r\nIf so, you may be interested in a fascinating new study in which researchers in Switzerland showed that … [+6524 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Trauma During Childhood Triples the Risk of Suffering a Serious Mental Disorder in Adulthood - Neuroscience News", "description": "Childhood trauma significantly increases the risk of being diagnosed with a mental health disorder later in life. For children who experienced emotional abuse, the most prevalent disorder reported was anxiety. Trauma also increased the risks for psychosis, OC…", "url": "https://neurosciencenews.com/trauma-childhood-mental-health-21792/", "urlToImage": "https://neurosciencenews.com/files/2022/11/child-trauma-mental-health-neurosinces-public.jpg", "publishedAt": "2022-11-04T20:55:22Z", "content": "Summary: Childhood trauma significantly increases the risk of being diagnosed with a mental health disorder later in life. For children who experienced emotional abuse, the most prevalent disorder re… [+6405 chars]"}, {"source": {"id": null, "name": "GMA"}, "author": "GMA Team", "title": "6-year-old with RSV dies as hospitals see alarming rise in new virus cases - GMA", "description": "", "url": "https://www.goodmorningamerica.com/wellness/story/year-rsv-dies-hospitals-alarming-rise-virus-cases-92658106", "urlToImage": "https://s.abcnews.com/images/GMA/child-respiratory-hospital-01-sh-iwb-220930_1664549945522_hpMain_16x9_608.jpg", "publishedAt": "2022-11-04T20:04:31Z", "content": "Michigan health officials this week confirmed a 6-year-old has died after developing complications from RSV or respiratory syncytial virus.\r\nThe child is reportedly a young boy from the Detroit area.… [+2485 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Micaela Den Hartog, PharmD Candidate", "title": "Let's Not Sugar Coat It: HbA1c is the Imperfect Diabetes Diagnostic - Pharmacy Times", "description": "When diabetes is uncontrolled, higher percentages of hemoglobin become glycated, which causes elevated HbA1c and glucose levels to rise within the body.", "url": "https://www.pharmacytimes.com/view/let-s-not-sugar-coat-it-hba1c-is-the-imperfect-diabetes-diagnostic", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/833b0b697dbfde071ab3599374d25dc6cf0f842e-1480x994.png?fit=crop&auto=format", "publishedAt": "2022-11-04T19:39:04Z", "content": "Purpose of HbA1c as a clinical marker for diabetes\r\nHemoglobin A1c (HbA1c) is an accepted measure for both the diagnosis and chronic management of diabetes.1 Hemoglobin is the protein responsible for… [+7108 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "SARS-CoV-2 Omicron's newest subvariant BQ.1.1 shows extraordinary immune evasion potential against vaccine sera - News-Medical.Net", "description": "In a new study, researchers pursued immunological evidence of why BQ.1.1 prevalence swiftly increased in areas where Omicron BA.5 was dominant in the United States (US).", "url": "https://www.news-medical.net/news/20221104/SARS-CoV-2-Omicrons-newest-subvariant-BQ11-shows-extraordinary-immune-evasion-potential-against-vaccine-sera.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_730144_16675866594324298.jpg", "publishedAt": "2022-11-04T18:42:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers pursued immunological evidence of why BQ.1.1 prevalence swiftly increased in areas where Omicron BA.5 was dominant in the United … [+3028 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Impaired Kidney Function Linked to Cognitive Disorders - Neuroscience News", "description": "Of patients with dementia, 7% had chronic kidney disease while 9% had albuminuria, a urinary marker for kidney disease. Chronic kidney disease was associated with a 51% increased risk of developing dementia.", "url": "https://neurosciencenews.com/kidney-function-dementia-21786/", "urlToImage": "https://neurosciencenews.com/files/2022/11/kidney-disease-cognition-neurosinces-public.jpg", "publishedAt": "2022-11-04T18:07:45Z", "content": "Summary: Of patients with dementia, 7% had chronic kidney disease while 9% had albuminuria, a urinary marker for kidney disease. Chronic kidney disease was associated with a 51% increased risk of dev… [+1504 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Average American believes they hit peak health at 34 - and old age begins at just 42, survey claims - Daily Mail", "description": "Three in ten respondents also they felt stressed or anxious about aging. Survey of 2,000 Americans was done by a New York based pollster for a weight loss company.", "url": "https://www.dailymail.co.uk/health/article-11390775/Average-American-believes-hit-peak-health-34-old-age-begins-just-42-survey-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/04/17/64203825-0-image-a-16_1667583857773.jpg", "publishedAt": "2022-11-04T17:46:06Z", "content": "They say 40 is the new 20 but most Americans believe they peaked physically at 34, according to a survey.\r\nAnd the majority of people start to feel old at just 42.\r\nThat is according to a poll of 2,0… [+3451 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "Getting a flu vaccine lowers your risk of a STROKE years later, study shows - Daily Mail", "description": "Researchers analyzed the health records of more than 4million adults in Alberta, Canada, over a 10-year period in the biggest study of its kind into the link between flu and strokes.", "url": "https://www.dailymail.co.uk/health/article-11390895/Getting-flu-vaccine-lowers-risk-STROKE-years-later-study-shows.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/04/17/64203673-0-image-a-20_1667583508919.jpg", "publishedAt": "2022-11-04T17:40:36Z", "content": "Getting a flu shot might be more important than ever a study indicates it also lowers the risk of a stroke years later.\r\nResearchers say health officials should push harder for everyone to get routin… [+4986 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Longitudinal study identifies reactivity to marital discord as an important predictor of depression - PsyPost", "description": "It probably comes as no surprise that an unhappy marriage can contribute to depression, but what does this look like on day-to-day level? A study published in the Journal of Social and Personal Relationships shows that short-term conflict patterns can have lo…", "url": "https://www.psypost.org/2022/11/longitudinal-study-identifies-reactivity-to-marital-discord-as-an-important-predictor-of-depression-64219", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/11/couple-having-argument-fighting-marital-discord.jpg", "publishedAt": "2022-11-04T13:22:20Z", "content": "It probably comes as no surprise that an unhappy marriage can contribute to depression, but what does this look like on day-to-day level? A study published in the Journal of Social and Personal Relat… [+4024 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "'Ground Breaking' Patient Who Survived 12 Different Types of Cancer Could Hold Key to Detection and Treating - Good News Network", "description": "A unique patient who has survived a dozen different types of cancer tumors has scientists looking to harness their powers for treatments.", "url": "https://www.goodnewsnetwork.org/ground-breaking-patient-who-survived-12-different-types-of-cancer-could-hold-key-to-detection-and-treating/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2022/11/cancer-doctors-swns.jpg", "publishedAt": "2022-11-04T12:30:34Z", "content": "CNIO researchers and lead authors Marcos Malumbres and Carolina Villarroya\r\nA unique patient who has survived a dozen different types of cancer tumors over a lifetime could provide the key for resear… [+3779 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Marissa Matozzo", "title": "Why People Who Drink These Sugary Beverages After 30 Struggle With Fine Lines And Wrinkles Later - Yahoo Life", "description": "To prevent premature aging, it’s vital to nourish your skin with both a well-balanced diet and routine using skincare products recommended by a dermatologist...", "url": "https://www.yahoo.com/lifestyle/why-people-drink-sugary-beverages-123000559.html", "urlToImage": "https://media.zenfs.com/en/shefinds_255/11f09d60371299f8ee615a62de868032", "publishedAt": "2022-11-04T12:30:00Z", "content": "To prevent premature aging, its vital to nourish your skin with both a well-balanced diet and routine using skincare products recommended by a dermatologist. With that said, we checked in with skinca… [+3104 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Marissa Matozzo", "title": "3 Life-Changing Habits Health Experts Swear By For Losing Weight In Your Midsection Over 40 - Yahoo Life", "description": "While losing weight in a specific area (midsection or elsewhere) may not be as easy as we may hope, losing weight healthily can mean reducing belly fat and...", "url": "https://www.yahoo.com/lifestyle/3-life-changing-habits-health-120058365.html", "urlToImage": "https://media.zenfs.com/en/shefinds_255/b323926f89db534e095f463943fd240b", "publishedAt": "2022-11-04T12:00:58Z", "content": "While losing weight in a specific area (midsection or elsewhere) may not be as easy as we may hope, losing weight healthily can mean reducing belly fat and seeing noticeable changes with a balanced d… [+3890 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: 8 lesser-known reasons behind your blood sugar spikes - Hindustan Times", "description": "Even with all the lifestyle changes, medication, and best practices you may experience spike in your glucose levels and that could leave you all confused. Here are some lesser-known reasons of blood sugar spike in diabetes. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-8-lesser-known-reasons-behind-your-blood-sugar-spikes-101667560231284.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/04/1600x900/diabetes_thumb_1667560383684_1667560400057_1667560400057.jpg", "publishedAt": "2022-11-04T11:25:18Z", "content": "Dealing with diabetes can be tricky at times considering the blood sugar levels can behave strangely at times. Even with all the lifestyle changes, medication, and best practices you may experience s… [+2757 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Faith Geiger", "title": "Nutritionists Agree: 3 Foods You Should Eat This Fall If You Struggle With High Blood Pressure - Yahoo Life", "description": "High blood pressure can stem from a range of issues. From unhealthy lifestyle choices to plain old genetics, there are many reasons you may be dealing with...", "url": "https://www.yahoo.com/lifestyle/nutritionists-agree-3-foods-eat-110002207.html", "urlToImage": "https://media.zenfs.com/en/shefinds_255/9f937dda43a4e35d8186ba9991183625", "publishedAt": "2022-11-04T11:00:02Z", "content": "High blood pressure can stem from a range of issues. From unhealthy lifestyle choices to plain old genetics, there are many reasons you may be dealing with hypertension. However, there are also many … [+3608 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jillian Wilson", "title": "The Most Common RSV Symptoms Doctors Are Seeing Right Now - HuffPost", "description": "Adults and children can both get the highly contagious respiratory syncytial virus. Here's what to know about symptoms in each age group.", "url": "https://www.huffpost.com/entry/rsv-symptoms-doctors-most-common_l_6362db52e4b08fd5e95877f9", "urlToImage": "https://img.huffingtonpost.com/asset/636413422300005900610c95.jpeg?cache=6auJgJnC43&ops=1200_630", "publishedAt": "2022-11-04T09:45:01Z", "content": "RSV is surging in children, but adults are catching the virus, too.\r\nThis fall is shaping up to be a bad season for viruses. The flu is spreading at a high rate, COVID-19 continues to kill more than … [+7086 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": "Isabella Cueto", "title": "Microbiome research is starting to find links to chronic diseases - STAT", "description": "Microbiome research is starting to move fast: A long-sought DNA-damaging culprit. A link between a bacterium and rheumatoid arthritis. A skin microbe that causes lupus-like symptoms.", "url": "https://www.statnews.com/2022/11/04/microbiome-links-to-chronic-disease/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/11/AdobeStock_480993123-1024x576.jpeg", "publishedAt": "2022-11-04T08:38:10Z", "content": "We never walk alone. Across the landscape of our bodies, trillions of microbes accompany us on the journey of life, some of them riding it out in the body’s soft bits from first to dying breath. \r\nA … [+450 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Andrea Michelson", "title": "Woman's stroke mistaken for ear infection after dizziness, tingling - Insider", "description": "Danielle Lance, 34, said her right side began tingling one day. The next morning, she was partially paralyzed and had trouble speaking.", "url": "https://www.insider.com/young-mom-stroke-mistaken-for-ear-infection-2022-11", "urlToImage": "https://i.insider.com/63643636ff27460018ed8a21?width=1200&format=jpeg", "publishedAt": "2022-11-04T06:19:21Z", "content": "Danielle Lance, a paramedic and mother of four, was recovering from a painful double ear infection when her symptoms took a turn for the worse.\r\nThe 34-year-old woke up dizzy after a long shift in la… [+2935 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "High blood sugar causes: 7 surprising, daily things that can increase your insulin levels - Zee News", "description": "What causes high blood sugar? Overconsumption of sugar  processed food  carbs - yes  we know the drill! But there are some surprising factors that can lead to a spike in insulin levels. Let s find out!", "url": "https://zeenews.india.com/health/high-blood-sugar-causes-7-surprising-daily-things-that-can-increase-your-insulin-levels-2527521", "urlToImage": null, "publishedAt": "2022-11-04T04:14:00Z", "content": "High blood sugar remains one of the most serious health ailments, and unfortunately, very common. It can directly lead to other diseases like heart or kidney ailments, damage eyes, and so on. Not jus… [+2460 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter", "title": "What you should know about getting a flu vaccine this year, according to an expert - CNN", "description": "This year's flu strain has already begun spreading across the US, according to new data from the CDC. Not since 2009, during the height of the H1N1 swine flu pandemic, have there been this many cases of influenza so early in the season.", "url": "https://www.cnn.com/2022/11/03/health/influenza-vaccine-covid-health-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221102191507-01-influenza-vaccine-covid-health-wellness.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-04T02:05:00Z", "content": "Welcome to this years flu season. \r\nThis years flu strain has already begun spreading across the United States, according to new data from the US Centers for Disease Control and Prevention. There hav… [+7482 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Teens with obesity lose 15% of body weight in trial of repurposed diabetes drug - Ars Technica", "description": "The drug could be a useful new tool for treating childhood obesity.", "url": "https://arstechnica.com/science/2022/11/repurposed-diabetes-drug-helps-teens-with-obesity-lose-15-of-body-weight/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/12/GettyImages-629405043-760x380.jpg", "publishedAt": "2022-11-03T22:42:42Z", "content": "Enlarge/ Woman on a kg weight scale \r\n206 with 126 posters participating\r\nA repurposed Type 2 diabetes drug helped teens with obesity lose a significant amount of body weight, lowered their risk fact… [+3059 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "Ebola could have leaked from US biofacility causing 2014 West Africa outbreak, scientists claim - Daily Mail", "description": "EXCLUSIVE: Virologist Dr Jonathan Latham - a former researcher at the University of Wisconsin - and journalist Sam Husseini say there are a number of inconsistencies in the official timeline.", "url": "https://www.dailymail.co.uk/health/article-11383611/Ebola-leaked-biofacility-causing-2014-West-Africa-outbreak-scientists-claim.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/03/19/64168367-0-image-a-16_1667504006276.jpg", "publishedAt": "2022-11-03T21:53:09Z", "content": "The 2014 Ebola outbreak may have been borne out of an accidental lab leak at a US Government-funded facility, according to a bombshell analysis.\r\nVirologist Dr Jonathan Latham a former researcher at … [+12925 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christine Rousselle", "title": "Nose picking was always gross — now a study says it may lead to late-onset Alzheimer's - Fox News", "description": "A study on mice done in Australia suggests that nose picking or plucking the nose hairs may increase a risk of developing Alzheimer's disease later in life. More study is needed, the authors note.", "url": "https://www.foxnews.com/lifestyle/nose-picking-gross-study-may-lead-late-onset-alzheimers", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/nose2.jpg", "publishedAt": "2022-11-03T21:20:50Z", "content": "Nose picking may be more than just a social faux pas.\r\nA study out of Australia suggests there may be a link between nose picking and developing late-onset Alzheimer's disease. \r\nThe study titled \"Ch… [+4328 chars]"}, {"source": {"id": null, "name": "Parade"}, "author": "Emily Laurence", "title": "If You Haven’t Gotten COVID Yet, This Might Be Why - Yahoo Life", "description": "According to new research, 10 percent of the population has a gene mutation that makes their COVID symptoms asymptomatic.", "url": "https://parade.com/health/why-some-people-do-not-test-positive-covid", "urlToImage": "https://parade.com/.image/t_share/MTkzNDg5NTE0OTc3NTY4NDQ1/negative-covid-test.jpg", "publishedAt": "2022-11-03T21:00:00Z", "content": "At the dawn of the pandemic, it was shocking—and terrifying—to hear when someone you knew tested positive for COVID. While the pandemic should certainly still be taken seriously, thanks to COVID vacc… [+5345 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Study Sheds New Light on Brain Activity Related to Dissociative Symptoms - Neuroscience News", "description": "Dissociation often occurs following trauma, and affects more women than men. A new study found different dissociative symptoms are uniquely associated with connections in areas of brain networks linked to cognition and emotional processing.", "url": "https://neurosciencenews.com/dissociation-brain-21780/", "urlToImage": "https://neurosciencenews.com/files/2022/11/dissociation-brain-activity-neurosucences.jpg", "publishedAt": "2022-11-03T20:45:16Z", "content": "Summary: Dissociation often occurs following trauma, and affects more women than men. A new study found different dissociative symptoms are uniquely associated with connections in areas of brain netw… [+5813 chars]"}, {"source": {"id": null, "name": "KARE11.com"}, "author": "Alexandra Simon", "title": "MDH report: Flu outbreaks in schools on the rise - KARE11.com", "description": "The weekly respiratory illness report for the week ending on Oct. 29, shows total flu hospitalizations nearly tripled from the week before, up to 72.", "url": "https://www.kare11.com/article/news/health/plymouth-middle-school-student-illness/89-a88b5e33-8272-4638-a612-d533dc3d5e3c", "urlToImage": "https://media.kare11.com/assets/KARE/images/e0403485-0063-4a3a-b013-19cf672f46a3/e0403485-0063-4a3a-b013-19cf672f46a3_1140x641.jpg", "publishedAt": "2022-11-03T19:26:00Z", "content": "PLYMOUTH, Minnesota Minnesota is starting to see an uptick in flu cases, according to new data from the state department of health.\r\nThe Weekly Influenza and Respiratory Illness Report for the week e… [+2563 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Could coffee offer protection from catching COVID-19? - Phys.org", "description": "Could consuming a cup of coffee be an effective way to protect yourself against infection with coronavirus? What has not yet been proven in practice is at least very plausible according to biochemical research.", "url": "https://phys.org/news/2022-11-coffee-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/coffee-could-offer-pro.jpg", "publishedAt": "2022-11-03T19:14:26Z", "content": "Could consuming a cup of coffee be an effective way to protect yourself against infection with coronavirus? What has not yet been proven in practice is at least very plausible according to biochemica… [+2769 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A multinational Delphi consensus to end the COVID-19 public health threat - Nature.com", "description": "A diverse, multidisciplinary panel of 386 experts in COVID-19 response from 112 countries provides health and social policy actions to address inadequacies in the pandemic response and help to bring this public health threat to an end.", "url": "https://www.nature.com/articles/s41586-022-05398-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-05398-2/MediaObjects/41586_2022_5398_Fig1_HTML.png", "publishedAt": "2022-11-03T16:03:36Z", "content": "<li>Barcelona Institute for Global Health (ISGlobal), Barcelona, Spain\r\nJeffrey V. Lazarus, Quique Bassat, Gonzalo Fanjul, Alberto L. Garcia-Basteiro, Manolis Kogevinas, Denise Naniche, Rafael Vilasa… [+28165 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The long-term impact of COVID-19 severity on health-related quality of life - News-Medical.Net", "description": "A recent study conducted on the residents of Amsterdam, the Netherlands, describes that people with mild COVID-19 experience better health-related quality of life after one year of disease onset than those with moderate or severe COVID-19.", "url": "https://www.news-medical.net/news/20221103/The-long-term-impact-of-COVID-19-severity-on-health-related-quality-of-life.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_730007_16674884936807967.jpg", "publishedAt": "2022-11-03T15:19:00Z", "content": "A recent study conducted on the residents of Amsterdam, the Netherlands, describes that people with mild coronavirus disease 2019 (COVID-19) experience better health-related quality of life after one… [+4804 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "James Kingsland", "title": "Hair loss: The latest research on causes and treatments - Medical News Today", "description": "In this Special Feature, we offer an overview of the latest research on hair loss causes and treatments, and expert tips on prevention and management.", "url": "https://www.medicalnewstoday.com/articles/hair-loss-the-latest-science-on-causes-treatment-and-prevention", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/11/Hair_loss_GettyImages1239558165_Thumb.jpg", "publishedAt": "2022-11-03T15:16:14Z", "content": "In the past decade, biologists have disentangled many of the complexities of how hair grows and how it is lost in conditions such as pattern baldness and alopecia areata. In this Special Feature, we … [+11408 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Renin–Angiotensin System Inhibition in Advanced Chronic Kidney Disease | NEJM - nejm.org", "description": "Original Article from The New England Journal of Medicine — Renin–Angiotensin System Inhibition in Advanced Chronic Kidney Disease", "url": "https://www.nejm.org/doi/pdf/10.1056/NEJMoa2210639", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmoa2210639/20221102/images/img_small/nejmoa2210639_f1.jpeg", "publishedAt": "2022-11-03T14:02:32Z", "content": "Background\r\nReninangiotensin system (RAS) inhibitors including angiotensin-convertingenzyme (ACE) inhibitors and angiotensin-receptor blockers (ARBs) slow the progression of mild or moderate chronic … [+2235 chars]"}, {"source": {"id": null, "name": "Cleaneatingmag.com"}, "author": "Lisa Turner", "title": "7 Immune-Boosting Foods to Get You Through Cold & Flu Season - Yahoo Life", "description": "Add these antiviral foods to your plate this cold and flu season to improve immune response and fight sickness.", "url": "https://www.cleaneatingmag.com/clean-diet/immunity/7-immune-boosting-foods-for-cold-and-flu/?utm_campaign=discover_rss&utm_source=yahoo&utm_medium=CLEAN_EATING", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/knSx9NNawt9TNLPV44YCKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/clean_eating_outside_articles_989/a24461703797e29d4bf84ce5389d0513", "publishedAt": "2022-11-03T14:00:45Z", "content": "This article originally appeared on Clean Eating\r\nDont want to catch a cold - or flu - when the temperatures drop? Its hard to avoid the sneezes, coughs, and sinus woes of cold and flu season. Millio… [+6244 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Catherine Schuster-Bruce", "title": "Woman, 29, diagnosed with skin cancer thought she couldn't get it - Insider", "description": "Courtney Mangan, now 36, told Insider that she was naive in her twenties as to how dangerous melanoma can be.", "url": "https://www.insider.com/woman-tan-diagnosed-aggressive-skin-cancer-melanoma-risks-2022-10", "urlToImage": "https://i.insider.com/6363f853ff27460018ed7389?width=1200&format=jpeg", "publishedAt": "2022-11-03T10:21:28Z", "content": "A 29-year-old woman who thought she couldn't get cancer because she didn't have fair features was \"completely shocked\" when doctors told her a mole on her right shoulder had become an aggressive canc… [+6324 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alice Clifford", "title": "Mouth cancer causes grow as cases skyrocket in UK - The Independent", "description": "HPV now a major concern alongside smoking, say doctors", "url": "https://www.independent.co.uk/news/health/mouth-cancer-symptoms-disease-cause-b2215796.html", "urlToImage": "https://static.independent.co.uk/2022/11/02/08/newFile-1.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-11-03T09:36:15Z", "content": "Sign up for our free Health Check email to receive exclusive analysis on the week in health\r\nGet our free Health Check email\r\nCases of mouth cancer in the UK have increased by more than one-third in … [+6625 chars]"}]}