{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Engineers Develop Ultrasound Stickers That Can See Inside the Body - SciTechDaily", "description": "New stamp-sized ultrasound adhesives deliver clear images of the heart, lungs, and other internal organs. When clinicians need live images of a patient’s internal organs, they often turn to ultrasound imaging for a safe and noninvasive window into the body’s …", "url": "https://scitechdaily.com/mit-engineers-develop-ultrasound-stickers-that-can-see-inside-the-body/", "urlToImage": "https://scitechdaily.com/images/Adhesive-Patch-Produces-Ultrasound-Images-of-Body-scaled.jpg", "publishedAt": "2022-07-30T19:49:55Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 30, 2022\r\nMIT engineers designed an adhesive patch that produces ultrasound images of the body. The stamp-sized device sticks to skin and can… [+8372 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Matt Higgins", "title": "Why Brushing Teeth Is Key To Long Life: 6 Ways Gum Disease Can Lead To Major Health Problems - Study Finds", "description": "Research reveals links between gum disease to everything from heart and blood pressure complications to mental health problems.", "url": "https://www.studyfinds.org/gum-disease-health-brushing-teeth-long-life/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2022/02/caroline-lm-8BkF0sTC6Uo-unsplash-scaled.jpg", "publishedAt": "2022-07-30T16:34:53Z", "content": "If you thought that preventing gum disease is only to the benefit of your oral hygiene, think again. Gum disease, also called periodontitis, can be a prelude to more serious health problems far beyon… [+9290 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Renée Onque", "title": "#Guttok: 4 ways to support or improve your gut health - CNBC", "description": "Gut health, and remedies for it, are trending on TikTok. Here are some ways that gut health affects your overall health and how to maintain a healthy gut.", "url": "https://www.cnbc.com/2022/07/30/guttok-4-ways-to-support-or-improve-your-gut-health.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107095491-1659024453244-gutTok_2022_0728.png?v=1659027523&w=1920&h=1080", "publishedAt": "2022-07-30T16:00:01Z", "content": "You might be surprised to learn that gut health is the latest buzzy topic on TikTok.\r\nUnder hashtags like #guttok, #guthealth and #guthealing,influencers and every day users alike are posting thousan… [+6226 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Identify a Baffling New Type of Diabetes That Affects Millions - SciTechDaily", "description": "A new study investigates a mysterious form of diabetes. Malnutrition-related diabetes is a mysterious form of diabetes that affects tens of millions of individuals in sub-Saharan Africa and Asia. Rarely do its victims, who are mostly skinny and poor teens and…", "url": "https://scitechdaily.com/researchers-identify-a-baffling-new-type-of-diabetes-that-affects-millions/", "urlToImage": "https://scitechdaily.com/images/Human-Body-Metabolism-Energy-Concept.jpg", "publishedAt": "2022-07-30T15:20:06Z", "content": "Malnutrition-related diabetes is a puzzling form of diabetes that affects tens of millions of individuals in sub-Saharan Africa and Asia.\r\nA new study investigates a mysterious form of diabetes.\r\nMal… [+4847 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "David Robinson, USA TODAY", "title": "New York declares state disaster emergency for monkeypox outbreak - USA TODAY", "description": "Gov. Kathy Hochul declared New York's monkeypox outbreak a disaster emergency, citing spikes in cases.", "url": "https://www.usatoday.com/story/news/nation/2022/07/30/ny-declares-state-disaster-emergency-monkeypox/10191232002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/07/24/USAT/a0156922-d047-4bff-9467-1d5a0f5ac64a-AP_Canada_Monkeypox_Tourists.jpeg?auto=webp&crop=4955,2788,x0,y455&format=pjpg&width=1200", "publishedAt": "2022-07-30T15:13:27Z", "content": "New York Gov. Kathy Hochul late Friday declared New York's rapidly spreading monkeypox outbreak a state disaster emergency as authorities raced to distribute vaccines to curb the virus' spread.\r\nThe … [+2803 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "David Kaufman", "title": "Political correctness helped turn monkeypox into a global emergency - New York Post ", "description": "Even though the majority of monkeypox cases back in May were already connected to gay male social venues, most media outlets not only refused to acknowledge it, they said doing so would encourage d…", "url": "https://nypost.com/2022/07/30/monkeypox-became-a-global-emergency-due-to-political-correctness/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/07/gay-dance-floor.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-07-30T14:04:00Z", "content": "In late May, Conde Nasts LGBT sitethem.us went out of its way to distance a nascent viral scourge known as monkeypox from the main demographic who was catching it gay men. \r\nThe piece headlined, The … [+5070 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen U.S.", "title": "Brain eating amoeba are hiding in rivers and lakes throughout America this summer - Daily Mail", "description": "Brain eating amoeba are lurking in fresh water rivers and lakes all across America this summer, experts warn. Two infections have already been recorded this year.", "url": "https://www.dailymail.co.uk/health/article-11062301/Brain-eating-amoeba-hiding-rivers-lakes-America-summer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/29/22/60856323-0-image-a-19_1659129620781.jpg", "publishedAt": "2022-07-30T11:09:51Z", "content": "Freshwater lakes and rivers across America may have a deadly parasite lurking in them this summer that rapidly eats away at the brain - and experts warn that if it gets into your nose, it has a 97 pe… [+6807 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "Sharon Kirkey", "title": "Is COVID prematurely aging our immune systems? - National Post", "description": "Repeated SARS-CoV-2 infections may be prematurely aging human immune systems, research suggests", "url": "https://nationalpost.com/health/is-covid-prematurely-aging-our-immune-systems", "urlToImage": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2022/07/GettyImages-1227233494.jpg", "publishedAt": "2022-07-30T11:01:56Z", "content": "Repeated SARS-CoV-2 infections may be prematurely aging human immune systems, research suggests \r\nIllustration of a T lymphocyte, or T cell, white blood cells targeting SARS-CoV-2 coronavirus particl… [+7473 chars]"}, {"source": {"id": null, "name": "Kstp.com"}, "author": null, "title": "Monkeypox patient shares warning about the illness, encourages vaccination - KSTP", "description": "Minnesota is ramping up its response to monkeypox as cases increase. State officials say they are expecting more vaccines.", "url": "https://kstp.com/kstp-news/top-news/monkeypox-patient-shares-warning-about-the-illness-encourages-vaccination/", "urlToImage": "https://kstp.com/wp-content/uploads/2022/07/MDH-MONKEYPOX-UPDATE_VO_00.00.18.30.jpg", "publishedAt": "2022-07-30T10:12:16Z", "content": "Monkeypox cases continue to rise in Minnesota and across the country. There are now 5,189 infections nationwide across all but three states.\r\nI feel like I heard the word monkeypox and I got it and t… [+4353 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Dr. Catherine Schuster-Bruce", "title": "What does monkeypox look like compared to 7 other skin conditions - Insider", "description": "A monkeypox rash can take the form of pimples or blisters. The rash looks similar to other illnesses, like genital herpes and syphilis.", "url": "https://www.insider.com/what-does-monkey-pox-look-like-rash-symptoms-2022-7", "urlToImage": "https://i.insider.com/62e417c7205f75001879f71a?width=1200&format=jpeg", "publishedAt": "2022-07-30T10:11:55Z", "content": "Monkeypox can cause a rash that looks similar to other illnesses, including herpes or syphilis   but there are some key differences, dermatologists told Insider. \r\nAlongside a fever, a rash is one of… [+1567 chars]"}, {"source": {"id": null, "name": "Foxweather.com"}, "author": "Chris Oberholtz", "title": "3-year-old Pennsylvania boy contracts rare illness from tick bite - Fox Weather ", "description": "The transmission of a rare, dangerous and debilitating tick-borne disease seriously sickened an energetic, witty and generally healthy 3-year-old Pennsylvania boy.", "url": "https://www.foxweather.com/lifestyle/powassan-tick-borne-disease-meningoencephalitis", "urlToImage": "https://images.foxweather.com/static.foxweather.com/www.foxweather.com/content/uploads/2022/07/1024/512/295762911_5642939322418195_7788381534429166705_n.jpg?ve=1&tl=1", "publishedAt": "2022-07-30T10:08:56Z", "content": "HARVEYS LAKE, Pa. – Fifteen minutes. \r\nThat’s all it took to transmit a rare, dangerous and debilitating tick-borne disease that seriously sickened an energetic, witty and generally healthy 3-year-ol… [+6670 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Hepatitis in children: Scientists have found a possible cause for the mystery outbreak - The Indian Express", "description": "A new study suggests the spate of severe hepatitis cases seen in children may be the result of three factors: adenovirus, adeno-associated virus 2 (AAV2) and an underlying genetic predisposition to the disease.", "url": "https://indianexpress.com/article/parenting/health-fitness/hepatitis-in-children-scientists-have-found-a-possible-cause-for-the-mystery-outbreak-8056212/", "urlToImage": "https://images.indianexpress.com/2021/07/GettyImages-world-hepatitis-day-1200.jpg", "publishedAt": "2022-07-30T09:52:53Z", "content": "Between April and July of this year, 1,010 cases of severe hepatitis without any explainable cause were reported in children in more than 35 countries. Nearly half of these cases were in Europe, incl… [+4828 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "This doctor reversed heart disease. Now he wants to do it for Alzheimer's - CNN", "description": "Using a strict vegan diet, exercise, stress reduction and social support, Dr. Dean Ornish reversed heart disease in a 1990 clinical trial. Today he's trying to use the same approach on dementia.", "url": "https://www.cnn.com/2022/07/30/health/dean-ornish-lifestyle-study-alzheimers-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516142927-01-reversing-alzheimers-life-itself-wellness-super-tease.jpg", "publishedAt": "2022-07-30T07:04:00Z", "content": "(CNN)In 1990, internal medicine specialist Dr. Dean Ornish did what no other doctor had been able to do: He published results of a randomized clinical trial that used advanced imagery scans to show c… [+7275 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Julia Métraux", "title": "Prednisone may cause mental-health crises and hospitalizations - Insider", "description": "Prednisone is prescribed to millions of Americans. While mood swings are a known side effect, some patients say they experienced much worse.", "url": "https://www.insider.com/prednisone-mental-health-danger-suicide-crisis-depression-mania-2022-6", "urlToImage": "https://i.insider.com/62d194e8b0ab4f001853ea34?width=1200&format=jpeg", "publishedAt": "2022-07-30T06:54:17Z", "content": "I was convinced everyone would be better off without me.\r\nIt was the spring of 2018, and a few days earlier I had been admitted to the emergency room for a flare-up of vasculitis, a blood-vessel-infl… [+14394 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Maria Cheng", "title": "In race for monkeypox vaccines, experts see repeat of COVID - The Associated Press", "description": "LONDON (AP) — Moves by rich countries to buy large quantities of monkeypox vaccine, while declining to share doses with Africa, could leave millions of people unprotected against a more dangerous version of the disease and risk continued spillovers of the vir…", "url": "https://apnews.com/article/covid-health-pandemics-28285b483cfd77c49edaa915ca383769", "urlToImage": "https://storage.googleapis.com/afs-prod/media/f1520ef6c2c549b9b20d25fd27f817c9/3000.jpeg", "publishedAt": "2022-07-30T06:40:08Z", "content": "LONDON (AP) Moves by rich countries to buy large quantities of monkeypox vaccine, while declining to share doses with Africa, could leave millions of people unprotected against a more dangerous versi… [+6251 chars]"}, {"source": {"id": null, "name": "NBC Chicago"}, "author": null, "title": "How Long Are You Contagious With COVID-19? Here's What to Know as BA.5 Subvariant Circulates - NBC Chicago", "description": "Have you recently experienced a bout of COVID-19, but are still testing positive despite following federal recommendations for isolation and masking? With the…", "url": "https://www.nbcchicago.com/news/local/how-long-are-you-contagious-with-covid-19-heres-what-to-know-as-ba-5-subvariant-circulates/2902208/", "urlToImage": "https://media.nbcchicago.com/2019/09/covid-testing.png?resize=1200%2C675&quality=85&strip=all", "publishedAt": "2022-07-30T04:58:35Z", "content": "Have you recently experienced a bout of COVID-19, but are still testing positive despite following federal recommendations for isolation and masking? With the quickly-spreading BA.5 subvariant expand… [+2300 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Denise Roland", "title": "Monkeypox Vaccine Demand Soars, and Just One Small Danish Company Makes It - The Wall Street Journal", "description": "Bavarian Nordic worked for decades on a vaccine and suddenly, orders are coming in now.", "url": "https://www.wsj.com/articles/monkeypox-vaccine-supply-bavarian-nordic-fda-11659121737", "urlToImage": "https://images.wsj.net/im-592387/social", "publishedAt": "2022-07-30T04:00:00Z", "content": "A Copenhagen company worked for nearly two decades to develop a vaccine and only six governments bought it. Within the last few weeks, orders have come in from dozens of countries around the globe an… [+178 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Lindsay Bottoms, The Conversation", "title": "An Expert Explains How Nordic Walking Can Level Up Your Daily Stroll - ScienceAlert", "description": "Have you ever noticed people out walking with poles even on flat surfaces and wondered why they are doing it? This is known as Nordic walking, which is a little bit like cross-country skiing but without the snow.", "url": "https://www.sciencealert.com/7-reasons-why-nordic-walking-is-a-better-workout-than-your-usual-walk", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/TwoPeopleNordicWalkingInMountainValley_1024.jpg", "publishedAt": "2022-07-30T03:30:30Z", "content": "Have you ever noticed people out walking with poles even on flat surfaces and wondered why they are doing it? This is known as Nordic walking, which is a little bit like cross-country skiing but with… [+4697 chars]"}, {"source": {"id": null, "name": "FOX 32 Chicago"}, "author": "Tia Ewing", "title": "Man suffering with monkeypox speaks out as cases rise in Chicago area - FOX 32 Chicago", "description": "Monkeypox is causing extreme oral, anal, and genital pain so extreme that it's leading to issues eating, urinating and defecating.", "url": "https://www.fox32chicago.com/news/man-suffering-with-monkeypox-speaks-out-as-cases-rise-in-chicago-area", "urlToImage": "https://images.foxtv.com/static.fox32chicago.com/www.fox32chicago.com/content/uploads/2022/07/1280/720/3ad0f1af-snapshot-4.jpg?ve=1&tl=1", "publishedAt": "2022-07-30T02:30:33Z", "content": "CHICAGO - Health officials have been calling monkeypox a major concern here in the U.S. and around the world.\r\nNow, FOX 32 Chicago is hearing from a man in recovery from the virus. He talks about the… [+2258 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Children who lack sleep may experience detrimental impact on brain and cognitive development that persists over time - EurekAlert", "description": "Elementary school-age children who get less than nine hours of sleep per night have significant differences in certain brain regions responsible for memory, intelligence and well-being compared to those who get the recommended nine to 12 hours of sleep per ni…", "url": "https://www.eurekalert.org/news-releases/960270", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/654007cd-e3b5-45f0-b47b-baea79a05d71/Rendition/thumbnail/Content/Public", "publishedAt": "2022-07-29T23:31:41Z", "content": "image: The images show the differences in gray matter volume (red areas) between children with sufficient sleep and those lacking sleep at both the beginning of the study and at a two-year follow-up … [+7016 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "'We need vaccines, and we need them yesterday': Frustration builds in LGBTQ community over government response to monkeypox - CNN", "description": "When Samuel Garrett-Pate went to get a monkeypox vaccine a couple of weeks ago, it took hours in line, filling out paperwork, running home to get more paperwork and standing in line again at the Los Angeles County Public Health Department. In total, he says, …", "url": "https://www.cnn.com/2022/07/29/health/monkeypox-lgbtq-slow-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220721142208-monkeypox-vaccine-los-angeles-0720-super-tease.jpg", "publishedAt": "2022-07-29T23:21:00Z", "content": "(CNN)When Samuel Garrett-Pate went to get a monkeypox vaccine a couple of weeks ago, it took hours in line, filling out paperwork, running home to get more paperwork and standing in line again atthe … [+12683 chars]"}, {"source": {"id": null, "name": "KWTX"}, "author": "KWTX Staff", "title": "Bell County Public Health District announces first confirmed case of Monkeypox in Bell County - KWTX", "description": "Bell County Public Health District has reported the first confirmed case of Monkeypox in Bell County today.", "url": "https://www.kwtx.com/2022/07/29/bell-county-public-health-district-announces-first-confirmed-case-monkeypox-bell-county/", "urlToImage": "https://gray-kwtx-prod.cdn.arcpublishing.com/resizer/RmIABUz3yiwvGdpII2Gtu0wca1E=/980x0/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/A47WAQQ3XJD55GSZIYVRFS6II4.jpg", "publishedAt": "2022-07-29T22:42:00Z", "content": "TEMPLE, Texas (KWTX) - Bell County Public Health District has reported the first confirmed case of Monkeypox in Bell County. \r\nThe Bell County Public Health District is working with local healthcare … [+3630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Model Helps Unravel Complex Psychiatric Disorders Such As Autism and Schizophrenia - SciTechDaily", "description": "A Mount Sinai stem cell model may be able to shed light on the complex biology behind certain psychiatric disorders. In order to map disease risk variants in human neurons, researchers from the Icahn School of Medicine at Mount Sinai used a unique stem cell m…", "url": "https://scitechdaily.com/new-model-helps-unravel-complex-psychiatric-disorders-such-as-autism-and-schizophrenia/", "urlToImage": "https://scitechdaily.com/images/Brain-Disease-Alzheimers-Treatment.jpg", "publishedAt": "2022-07-29T22:22:43Z", "content": "ByThe Mount Sinai Hospital / Mount Sinai School of MedicineJuly 29, 2022\r\nThe research focuses on mapping cis-regulatory components in human neurons that may be connected to the heredity of psychiatr… [+3958 chars]"}, {"source": {"id": null, "name": "Health.com"}, "author": "https://www.facebook.com/Health/", "title": "CDC: Bacteria That Causes Melioidosis Now Endemic Along Gulf Coast - Health.com", "description": "The bacteria that causes melioidosis, a rare but serious disease, is now considered endemic along parts of the Gulf Coast region, the CDC said Wednesday. What to know about melioidosis symptoms, treatment, and prevention.", "url": "https://www.health.com/news/cdc-melioidosis-bacteria-endemic-gulf-coast", "urlToImage": "https://www.health.com/thmb/UxlR6guYHhJAJRrSd3g8o_74PFA=/2000x1333/filters:fill(auto,1)/1-Melioidosis-GettyImages-1210431954-cdad710897c149faa1d4a90f2b02bb1c.jpg", "publishedAt": "2022-07-29T21:56:18Z", "content": "A new environmental bacteria has been found in U.S. soil and water for the first time, and in some cases it can cause a rare but serious disease called melioidosis, the Centers for Disease Control an… [+7242 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen U.S.", "title": "NYC Doctors perform first ever heart transplant from an HIV-positive donor - Daily Mail", "description": "The first ever HIV-positive heart transplant was performed in the Bronx, New York, during spring. The unnamed patient is in her 60s and also received a new kidney from the same donor.", "url": "https://www.dailymail.co.uk/health/article-11063129/NYC-Doctors-perform-heart-transplant-HIV-positive-donor.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/29/22/60857753-0-image-a-81_1659130927682.jpg", "publishedAt": "2022-07-29T21:48:01Z", "content": "Doctors in New York City have performed the first ever heart transplant from a person who is HIV positive.\r\nAn unnamed woman in her 60s who was suffering from advanced heart failure received both a h… [+5264 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": null, "title": "U.S. polio case tied to viruses detected in U.K., Israel, suggesting silent spread - STAT", "description": "Genetic analysis of the virus responsible for the first case of polio in the United States in nearly a decade shows it is linked to vaccine-derived viruses recently detected in Jerusalem and London.", "url": "https://www.statnews.com/2022/07/29/u-s-polio-case-tied-to-viruses-detected-in-u-k-israel-suggesting-silent-spread/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/07/AP22202632231570-1024x576.jpg", "publishedAt": "2022-07-29T21:47:36Z", "content": "Genetic analysis of the virus responsible for the first case of polio in the United States in nearly a decade shows it is linked to vaccine-derived viruses recently detected in Jerusalem and London, … [+4429 chars]"}, {"source": {"id": null, "name": "WBAY"}, "author": "WBAY news staff", "title": "Salmonella cases traced to loose peas at Wisconsin farmers markets - WBAY", "description": "The peas were sold at local farmers markets in Green Bay, Fond du Lac, Ripon and Madison and a Green Valley Acres Farm stand in Neenah.", "url": "https://www.wbay.com/2022/07/29/salmonella-cases-traced-loose-peas-wisconsin-farmers-markets/", "urlToImage": "https://gray-wbay-prod.cdn.arcpublishing.com/resizer/L0oOn9lS8q5yWIbxJ1vviuKYvR4=/980x0/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/VAEPDXUUGVBTDPO5PYS6WG67XY.png", "publishedAt": "2022-07-29T21:30:00Z", "content": "NEENAH, Wis. (WBAY) - The Wisconsin Department of Health Services says at least six people in Wisconsin were sickened by salmonella linked to shelled peas. Three people were hospitalized.\r\nThe loose … [+598 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Chickenpox Virus May Trigger the Onset of Alzheimer’s Disease - Neuroscience News", "description": "Varicella zoster virus (VZV), the virus that causes chickenpox and shingles, may activate the herpes simplex virus and trigger the onset of Alzheimer's disease, a new mouse study found.", "url": "https://neurosciencenews.com/chickenpox-virus-alzheimers-21145/", "urlToImage": "https://neurosciencenews.com/files/2022/07/chickenpox-virus-alzheimers-neurosicences.jpg", "publishedAt": "2022-07-29T21:21:45Z", "content": "Summary: Varicella zoster virus (VZV), the virus that causes chickenpox and shingles, may activate the herpes simplex virus and trigger the onset of Alzheimer’s disease, a new mouse study found.\r\nSou… [+8453 chars]"}, {"source": {"id": null, "name": "Verifythis.com"}, "author": "Erin Jones", "title": "Yes, monkeypox can spread by trying on clothing or changing bed sheets - VERIFYThis.com", "description": "While monkeypox can spread through touching contaminated clothing and linens, there are ways to clean and disinfect these items.", "url": "https://www.verifythis.com/article/news/verify/monkeypox-verify/monkeypox-transmission-spread-through-contiminated-clothes-bed-linens-fact-check/536-3a4ea57d-bbd4-4d3b-9d35-9b264a440264", "urlToImage": "https://media.tegna-media.com/assets/VERIFY/images/ecec0a2e-7df8-495d-91dc-33ffadf04c7d/ecec0a2e-7df8-495d-91dc-33ffadf04c7d_1140x641.jpg", "publishedAt": "2022-07-29T21:19:00Z", "content": "The World Health Organization (WHO) has declared the global monkeypox outbreak a public health emergency of international concern. As of July 28, monkeypox has been detected in at least 78 countries,… [+5606 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Chris Melore", "title": "Vitamin D supplements are a waste when it comes to bone health, study says - Study Finds", "description": "According to a new study, taking vitamin D supplements does nothing to prevent bone fractures in most healthy individuals.", "url": "https://www.studyfinds.org/vitamin-d-supplements-bone-health/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2020/11/AdobeStock_224280766-scaled.jpeg", "publishedAt": "2022-07-29T21:00:28Z", "content": "BOSTON — Vitamin D may provide a number of health benefits, but strengthening your bones isn’t one of them. According to a new study, taking vitamin D supplements does nothing to prevent bone fractur… [+1943 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Marie Holmes", "title": "6 Reasons Parents Won’t Vaccinate Their Kids Against COVID — And How Experts Respond - HuffPost", "description": "According to a survey, 43% of parents of children 6 months to 4 years old will “definitely not” get them vaccinated. Here is what experts would tell them.", "url": "https://www.huffpost.com/entry/parents-vaccination-children-covid_l_62e1ab84e4b00fd8d83bbcc1", "urlToImage": "https://img.huffingtonpost.com/asset/62e1afc1210000b0a35f0f8b.jpeg?ops=1778_1000", "publishedAt": "2022-07-29T20:28:37Z", "content": "It seems that the longer weve waited for a COVID-19 vaccine to be approved for certain age groups, the less likely kids in those age groups are to actually end up getting vaccinated. \r\nThe Food and D… [+8981 chars]"}, {"source": {"id": null, "name": "WCAX"}, "author": "WCAX News Team", "title": "1st monkey pox infection confirmed in Vermont - WCAX", "description": "State health officials say the infection was in an adult from Franklin County and that lab results confirmed the disease.", "url": "https://www.wcax.com/2022/07/29/1st-monkey-pox-infection-confirmed-vermont/", "urlToImage": "https://gray-wcax-prod.cdn.arcpublishing.com/resizer/ZDXJuJCsnblpBAR57krLsKMdrxk=/980x0/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/HBEGC2UD75HVZPC7TP5XQOMKYQ.png", "publishedAt": "2022-07-29T20:22:00Z", "content": "BURLINGTON, Vt. (WCAX) - The first case of monkeypox has been detected in Vermont.\r\nState health officials say the infection was in an adult from Franklin County and that lab results confirmed the di… [+757 chars]"}, {"source": {"id": null, "name": "WESH Orlando"}, "author": "Deanna Williamson", "title": "First monkeypox case confirmed in Volusia County, health officials say - WESH 2 Orlando", "description": "According to the Florida Department of Health in Volusia County, the first monkeypox case in the county has been confirmed.", "url": "https://www.wesh.com/article/volusia-county-first-monkeypox-case/40756546", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/monkeypox-1655465736.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2022-07-29T20:12:00Z", "content": "VOLUSIA COUNTY, Fla. —According to the Florida Department of Health in Volusia County, the first monkeypox case in the county has been confirmed.\r\nHealth officials said this case is isolated. \r\nThe D… [+1292 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "Covid-19, Gender And Immune Response: What's The Relationship? - Forbes", "description": "This is the first installment in a two part series which analyzes biological sex differences in immune responses to SARS-CoV-2 infection. This article focuses on Covid-19 related viral entry as well as innate and adaptive immune responses Covid-19 and their c…", "url": "https://www.forbes.com/sites/williamhaseltine/2022/07/29/covid-19-gender-and-immune-response-whats-the-relationship/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62e42ffe966d0841f29932d6/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-07-29T20:02:10Z", "content": "This is the first installment in a two part series which analyzes biological sex differences in immune responses to SARS-CoV-2 infection. This article focuses primarily on Covid-19 related viral entr… [+8442 chars]"}, {"source": {"id": null, "name": "FDA.gov"}, "author": "Office of the Commissioner", "title": "FDA Provides Update on Agency Response to Monkeypox Outbreak - FDA.gov", "description": "Today, the FDA is providing an update on its multipronged response to monkeypox in the United States, including its efforts in the areas of diagnostics, vaccine", "url": "https://www.fda.gov/news-events/press-announcements/fda-provides-update-agency-response-monkeypox-outbreak", "urlToImage": "https://www.fda.gov/themes/custom/preview/img/FDA-Social-Graphic.png", "publishedAt": "2022-07-29T18:35:00Z", "content": "For Immediate Release:\r\nJuly 29, 2022\r\nToday, the U.S. Food and Drug Administration is providing an update on its multipronged response to monkeypox in the United States, including its efforts in the… [+6313 chars]"}, {"source": {"id": null, "name": "WBNG-TV"}, "author": "Matthew Benninger", "title": "Officials: Monkeypox detected in Broome County - WBNG", "description": "A case of monkeypox has been detected in Broome County, health officials announced Friday afternoon.", "url": "https://www.wbng.com/2022/07/29/officials-monkeypox-detected-broome-county/", "urlToImage": "https://gray-wbng-prod.cdn.arcpublishing.com/resizer/3UGg0yvidbVv3Lj0NA1J7_C8Qjc=/980x0/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/US5GYHJ35ZE3RDR7QEHPM5F3LQ.jpg", "publishedAt": "2022-07-29T18:19:00Z", "content": "(WBNG) -- A case of monkeypox has been detected in Broome County, county health officials announced Friday afternoon.\r\nThe Broome County Health Department said the person who tested positive for the … [+644 chars]"}, {"source": {"id": null, "name": "Alaskasnewssource.com"}, "author": "Joey Klecka", "title": "First monkeypox case reported in Alaska - Alaska's News Source", "description": "The infected person was an Anchorage resident, the health department said, who did not require hospitalization and is isolating at home.", "url": "https://www.alaskasnewssource.com/2022/07/29/first-monkeypox-case-reported-alaska/", "urlToImage": "https://gray-ktuu-prod.cdn.arcpublishing.com/resizer/ZDXJuJCsnblpBAR57krLsKMdrxk=/980x0/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/HBEGC2UD75HVZPC7TP5XQOMKYQ.png", "publishedAt": "2022-07-29T18:11:00Z", "content": "ANCHORAGE, Alaska (KTUU) - The first case of monkeypox was recorded in Alaska on Friday, according to the state Department of Health.\r\nThe infected person was an Anchorage resident, the health depart… [+2079 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "Canada: Global AIDS conference kicks off amid fury over visas - DW (English)", "description": "Canada is hosting this year's International AIDS Conference. The event has been billed as a chance for \"the world to come together.\" However, visa issues are causing frustration for would-be attendees from Africa.", "url": "https://www.dw.com/en/canada-global-aids-conference-kicks-off-amid-fury-over-visas/a-62633067", "urlToImage": "https://static.dw.com/image/58278227_6.jpg", "publishedAt": "2022-07-29T18:00:35Z", "content": "Philomena Gori had a lot riding on her attendance at the 24th International AIDS Conference, which kicks off in the Canadian city of Montreal on Friday. The biennial event brings together thousands o… [+6223 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Hannah Docter-Loeb", "title": "COVID smell loss: The people who could never smell since birth have a warning. - Slate", "description": "“I've lived like this my whole life.”", "url": "https://slate.com/technology/2022/07/congenital-anosmia-coronavirus-symptom-smell-loss.html", "urlToImage": "https://compote.slate.com/images/79712180-c75e-4fc1-bfca-fc070c09eff0.jpeg?width=780&height=520&rect=6000x4000&offset=0x0", "publishedAt": "2022-07-29T17:59:00Z", "content": "Dia Kline was 4 years old when she first realized there was a thing called smell, and she couldnt do it.\r\nI remember walking into my home with my father and brother, and as soon as we walked through … [+10114 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Alex Traub", "title": "Parechovirus Sickened 23 Infants in Tennessee, C.D.C. Says - The New York Times", "description": "The common pathogen frequently produces the mild symptoms of a cold, but it can cause severe illness and death in babies under 3 months old, health officials say, warning doctors to be vigilant.", "url": "https://www.nytimes.com/2022/07/29/science/parechovirus-nashville-infants-children.html", "urlToImage": "https://static01.nyt.com/images/2022/07/29/multimedia/29xp-virus2/29xp-virus2-facebookJumbo.jpg", "publishedAt": "2022-07-29T17:08:43Z", "content": "Not long after this cluster, the C.D.C. alerted doctors this month that the type of parechovirus most associated with serious illness had been circulating nationally since May. It suggested parechovi… [+838 chars]"}, {"source": {"id": null, "name": "FOX 31 Denver"}, "author": "Dara Bitler", "title": "68 cases of monkeypox confirmed in Colorado - FOX 31 Denver", "description": "The Colorado Department of Public Health and Environment says two cases of monkeypox have been identified in Weld County.", "url": "https://kdvr.com/news/local/59-cases-of-monkeypox-confirmed-in-colorado/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2022/07/GettyImages-1398845578.jpg?w=1280", "publishedAt": "2022-07-29T16:27:18Z", "content": "WELD COUNTY, Colo. (KDVR) — The Colorado Department of Public Health and Environment says two cases of monkeypox have been identified in Weld County.\r\nThe newest cases bring the state’s total to 68 c… [+1951 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "What Science Says About the Eating Habits That Actually Slow Aging — Eat This Not That - Eat This, Not That", "description": "There is a lot of talk going around about how to eat in a way that slows your aging process. But what does the science actually say?", "url": "http://www.eatthis.com/eating-habits-slow-aging-evidence/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/My-project-2022-03-15T094042.402.jpg?quality=82&strip=all", "publishedAt": "2022-07-29T16:04:14Z", "content": "Conversations about \"staying young\" and \"slowing the aging process\" are everywhere, and all this talk can become overwhelmingespecially when you're trying to decipher what is true and what isn't.\r\nMo… [+4605 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "This 10-Minute Workout Will Get Rid of Your Belly Overhang, Trainer Says — Eat This Not That - Eat This, Not That", "description": "We linked up with Laura Endres, a personal trainer on Fyt, about the most effective workout that'll help get rid of your belly overhang.", "url": "http://www.eatthis.com/10-minute-workout-get-rid-of-belly-overhang/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/07/man-squat-exercise.jpg?quality=82&strip=all", "publishedAt": "2022-07-29T16:00:52Z", "content": "Are you getting fed up with that unwanted belly fat that's hanging over your jeans? We understand the struggle can be real, so we linked up with Laura Endres, a personal trainer on Fyt, about the mos… [+3220 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "Everything we thought about the origins of lactose tolerance is wrong, study says - DW (English)", "description": "Only a third of adults today can digest lactose. For many years, researchers assumed humans adopted this ability when our prehistoric ancestors started drinking milk. A new study points to a different story.", "url": "https://www.dw.com/en/everything-we-thought-about-the-origins-of-lactose-tolerance-is-wrong-study-says/a-62603291", "urlToImage": "https://static.dw.com/image/62177412_6.jpg", "publishedAt": "2022-07-29T15:26:48Z", "content": "There is a good chance you have lactose intolerance. You are not alone  5,000 years ago, most humans were lactose intolerant too.\r\nA new study published on Wednesday in the journal Nature by Universi… [+3925 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Prostate cancer: Surgical robot cuts hospital stays - BBC", "description": "A surgical robot is helping patients with prostate cancer leave hospital 24 hours after surgery.", "url": "https://www.bbc.com/news/uk-england-cambridgeshire-62345888", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/AD0C/production/_126100344_addenbrooke'srobotpic1.png", "publishedAt": "2022-07-29T14:47:34Z", "content": "Prostate cancer patients are able to return home days sooner than previously thanks to the use of a robot in surgery, a hospital says.\r\nSurgeons at Addenbrooke's Hospital in Cambridge use the robot t… [+1812 chars]"}, {"source": {"id": null, "name": "KTVB.com"}, "author": "KTVB Staff", "title": "Rabid bat found in downtown Boise - KTVB.com", "description": "People and their pets should stay away from bats in the area.", "url": "https://www.ktvb.com/article/news/local/rabid-bat-found-downtown-boise/277-d934fa07-7d0d-41c9-bd6e-ff75976cde77", "urlToImage": "https://media.ktvb.com/assets/KTVB/images/169063196/169063196_1140x641.jpg", "publishedAt": "2022-07-29T14:46:00Z", "content": "BOISE, Idaho A bat tested positive for rabies when it was found on July 26 on a sidewalk on Bannock Street in downtown Boise, across from Cecil D. Andrus Park.\r\nTwo other dead bats were seen in the s… [+2296 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Christina Caron", "title": "How to Spot ‘Medical Gaslighting’ and What to Do About It. - The New York Times", "description": "Experts share tips on advocating for yourself in a health care setting.", "url": "https://www.nytimes.com/2022/07/29/well/mind/medical-gaslighting.html", "urlToImage": "https://static01.nyt.com/images/2022/08/01/well/01Well-Gaslighting-Service/01Well-Gaslighting-Service-facebookJumbo.jpg", "publishedAt": "2022-07-29T14:00:07Z", "content": "Switch providers.A study using data from 2006 and 2007 estimated that approximately 12 million adults were misdiagnosed in the United States every year and about half of those errors could be harmful… [+1397 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Stephen Johnson", "title": "The Out-of-Touch Adults' Guide to Kid Culture: What Are Vabbing and Mucus Fishing? - Lifehacker", "description": "This week kids are learning how to fish for mucus and attract a mate.", "url": "https://lifehacker.com/the-out-of-touch-adults-guide-to-kid-culture-what-are-1849346193", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/f12415a4f20893e1857c772e768729ad.png", "publishedAt": "2022-07-29T14:00:00Z", "content": "Whether theyre toddlers, teenagers, or 23-year-olds, young people are disgusting. Old people are disgusting too of course, because being gross is the human condition. So lets celebrate it by digging … [+5059 chars]"}, {"source": {"id": null, "name": "Brownstone.org"}, "author": "Mark Oshinskie", "title": "Now We Know What It’s like To Live Among Lunatics - Brownstone Institute", "description": "Day after day, week after week, month after month for 28 months, I heard people invoke the shibboleth, and parrot the mantra: “Pandemic!” Uttering this magic word was intended to justify any disruption of normal life, to excuse the failure to fulfill a wide r…", "url": "https://brownstone.org/articles/now-we-know-what-its-like-to-live-among-lunatics/", "urlToImage": "https://brownstone.org/wp-content/uploads/2022/07/Shutterstock_1932040952.jpg", "publishedAt": "2022-07-29T12:43:31Z", "content": "From 1965-71, CBS aired a sitcom entitled Green Acres. The shows protagonist, Oliver Wendell Douglas, was an NYC lawyer who bought a farm and, several years ahead of the zeitgeist, went back to the l… [+10391 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Hannah Flynn", "title": "Type 2 diabetes: 10-hour eating window may improve blood sugar - Medical News Today", "description": "", "url": "https://www.medicalnewstoday.com/articles/type-2-diabetes-10-hour-eating-window-may-improve-blood-sugar", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/07/food_intake_GettyImages1326085736_Thumb.jpg", "publishedAt": "2022-07-29T12:23:27Z", "content": "<ul><li>Time-restricted eating is a form of intermittent fasting that some believe could bring metabolic benefits. </li><li>Animal studies on time-restricted eating that have demonstrated weight loss… [+5985 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "If you're high risk, do not wait for updated COVID vaccines, experts say - Reuters.com", "description": "People at high risk of severe disease who have yet to get a second COVID-19 booster should not wait for next-generation, Omicron-targeted vaccines expected in the fall, five vaccine experts told Reuters.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/if-youre-high-risk-do-not-wait-updated-covid-vaccines-experts-say-2022-07-29/", "urlToImage": "https://www.reuters.com/resizer/q3wDVp9VvJzO7QFtKQWxYVBo_x0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/DFMQ5RHZANK35LPVGH7V2J2MRU.jpg", "publishedAt": "2022-07-29T11:52:00Z", "content": "CHICAGO, July 29 (Reuters) - People at high risk of severe disease who have yet to get a second COVID-19 booster should not wait for next-generation, Omicron-targeted vaccines expected in the fall, f… [+4381 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Amy McKeever", "title": "How multiple COVID-19 infections can harm the body - National Geographic", "description": "With reinfections on the rise, scientists warn that each bout increases your risk of troubling outcomes, from long COVID to heart disease.", "url": "https://www.nationalgeographic.com/magazine/article/how-multiple-covid-19-infections-can-harm-the-body", "urlToImage": "https://i.natgeofe.com/n/532dbca2-8657-43af-8592-2901033d518b/GettyImages-1363199780_16x9.jpg?w=1200", "publishedAt": "2022-07-29T11:02:25Z", "content": "Ziyad Al-Aly noticed that more and more patients were coming to his Missouri clinic with what he describes as an air of invincibility. It was March 2022, and these patients were vaccinated and booste… [+868 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Akvile Petraityte 🇺🇦", "title": "“I Don't Need Sunscreen”: 50 People Who Thought So And Ended Up Looking Like Dorks (New Pics) - Bored Panda", "description": "Always wear sunscreen, stay hydrated, and try to avoid direct sunlight when it’s super hot outside. It’s the middle of the summer right now and one of the biggest joys for many folks is soaking up some rays and stocking up on vitamin D. Sunlight is important …", "url": "https://www.boredpanda.com/funny-sunburn-fails/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2022/07/funny-sunburn-fails-fb-62e3db1130e7f.png", "publishedAt": "2022-07-29T10:56:25Z", "content": null}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "Can you judge your COVID immunity with an antibody test? Israeli research says yes - The Times of Israel", "description": "Team says such tests could be used as a screening tool for the allocation of the first batches of updated vaccines, once these arrive", "url": "https://www.timesofisrael.com/can-you-judge-your-covid-immunity-with-an-antibody-test-israeli-research-says-yes/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2022/07/AP21235498054673-1024x640.jpg", "publishedAt": "2022-07-29T10:39:33Z", "content": "Throughout the coronavirus pandemic, scientists have been reticent about using results of standard antibody tests to judge COVID immunity levels. But new Israeli research suggests such tests can be a… [+3307 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Ken Alltucker and Karen Weintraub, USA TODAY", "title": "Alzheimer's theory under scrutiny after accusation of research fraud - USA TODAY", "description": "A new report casts doubt on a 2006 Alzheimer’s study, but researchers say it does not undercut the prevailing theory into the origin of the disease.", "url": "https://www.usatoday.com/story/news/health/2022/07/29/alzheimers-theory-scrutinized-accusation-fabricated-research/10142926002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/70b4cd59be29df8697308165711948ed641c0add/c=0-111-2119-1303/local/-/media/2022/01/12/USATODAY/usatsports/MotleyFool-TMOT-2b5cdf03-alzheimers-disease.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2022-07-29T10:00:37Z", "content": "A year ago, Alzheimer’s researchers expressed guarded optimism. The first new drug in nearly two decades was about to hit the market, and pharmaceutical companies had potentially stronger drugs in th… [+8965 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jillian Wilson", "title": "These Simple Tasks Can Cut Your Risk Of Dementia, Study Finds - HuffPost", "description": "Basic activities (some of which you're probably already doing) can cut your risk of dementia by up to 35%.", "url": "https://www.huffpost.com/entry/dementia-risk-study-exercise-chores_l_62e2aa34e4b006483a9b42ae", "urlToImage": "https://img.huffingtonpost.com/asset/62e2aa65210000adb35f108c.jpeg?cache=HSigJt2EKI&ops=1778_1000", "publishedAt": "2022-07-29T09:45:04Z", "content": "The simple task of doing chores is now linked with a reduction in the risk of developing dementia. \r\nNew research is offering some actionable steps we can take to protect our minds from memory loss. … [+4378 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Death by Napping? The Frightening Link to High Blood Pressure and Increased Stroke Risk - SciTechDaily", "description": "American Heart Association study shows link between frequent naps and high blood pressure. Frequent or usual daytime napping in adults was associated with a 24% high risk of having a stroke and a 12% higher risk of developing high blood pressure compared to n…", "url": "https://scitechdaily.com/death-by-napping-the-frightening-link-to-high-blood-pressure-and-increased-stroke-risk/", "urlToImage": "https://scitechdaily.com/images/Man-Napping-Laptop.jpg", "publishedAt": "2022-07-29T02:19:55Z", "content": "According to new research, napping on a regular basis is associated with higher risks for high blood pressure and stroke.\r\nAmerican Heart Association study shows link between frequent naps and high b… [+6004 chars]"}, {"source": {"id": null, "name": "Quillette.com"}, "author": "Daniel Kriegman", "title": "Guilty and Insane - Quillette", "description": "Dissociative Identity Disorder and the riddle of human responsibility.", "url": "https://quillette.com/2022/07/29/guilty-and-insane/", "urlToImage": "https://s3.amazonaws.com/prod.static-content.quillette.com/2022/07/GettyImages-514869694.jpg", "publishedAt": "2022-07-29T01:31:10Z", "content": "How much of our lives, good and bad, should we credit to our personal decisions, and how much is just the inheritance of our culture, our families, and our parents who have failed their children? Whe… [+31128 chars]"}, {"source": {"id": null, "name": "KING5.com"}, "author": "Kristin Goodwillie", "title": "'It was super scary': First Washington resident diagnosed with monkeypox talks about his experience - KING5.com", "description": "Ryan said he was experiencing \"odd\" symptoms five days after returning from a trip. He detailed his struggle to get the correct diagnosis from healthcare providers.", "url": "https://www.king5.com/article/news/health/monkeypox/monkeypox-first-person-diagnosed-washington/281-0b98d132-8089-4ce6-840a-ecbdf1e2de35", "urlToImage": "https://media.king5.com/assets/KING/images/64d16829-db6b-4036-9e4e-538de53fd765/64d16829-db6b-4036-9e4e-538de53fd765_1140x641.jpg", "publishedAt": "2022-07-29T00:42:00Z", "content": "SEATTLE The first person to be diagnosed with monkeypox in Washington state sat down for an exclusive interview with KING 5. \r\nThe World Health Organization recently declared monkeypox a global healt… [+2641 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Catherine Ho", "title": "How bad could monkeypox get in the Bay Area? Experts weigh trajectories - San Francisco Chronicle", "description": "More than two months after the first case was detected in the United States, the...", "url": "https://www.sfchronicle.com/bayarea/article/How-bad-could-monkeypox-get-in-the-Bay-Area-17337005.php", "urlToImage": "https://s.hdnux.com/photos/01/26/51/41/22714432/6/rawImage.jpg", "publishedAt": "2022-07-29T00:27:06Z", "content": "More than two months after the first case was detected in the United States, an outbreak of monkeypox virus is continuing to spread quickly nationwide and in the Bay Area, mostly among gay and bisexu… [+6695 chars]"}, {"source": {"id": null, "name": "KOIN.com"}, "author": "Jenny Young", "title": "Portland man quarantines after testing positive for monkeypox - KOIN.com", "description": "While monkeypox cases have spread across the Pacific Northwest — with 51 confirmed cases in Oregon and 103 in Washington — KOIN 6 News spoke to a Portland man who has tested positive for the virus.", "url": "https://www.koin.com/news/health/portland-man-quarantines-after-monkeypox-symptoms-test-result-delay/", "urlToImage": "https://www.koin.com/wp-content/uploads/sites/10/2022/07/Marco-Reyes-Rojas-rash-on-face-Marco-Reyes-Rojas-7282022.png?w=1280", "publishedAt": "2022-07-28T23:04:06Z", "content": "Editor’s note: KOIN 6 News originally reported that Marco Reyes Rojas had delayed test results after a local clinic reportedly told him he would receive his results in three days. Reyes Rojas has sin… [+3608 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "Genetic heart conditions could be cured for first time in ‘defining moment’ - The Guardian", "description": "Team of experts from UK, US and Singapore to design jab to save thousands of lives by rewriting DNA", "url": "https://amp.theguardian.com/society/2022/jul/29/genetic-heart-conditions-could-be-cured-first-time-defining-moment", "urlToImage": null, "publishedAt": "2022-07-28T23:01:00Z", "content": "Heart diseaseTeam of experts from UK, US and Singapore to design jab to save thousands of lives by rewriting DNA\r\nFri 29 Jul 2022 00.01 BST\r\nScientists are to develop the worlds first cure for geneti… [+3756 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Study Provides Better Insight Into the Vagus Nerve’s Link to the Brain - Neuroscience News", "description": "Using stimulation, researchers found a direct connection between the vagus nerve and learning centers of the brain. Vagus nerve stimulation, they discovered, increases learning in a healthy nervous system.", "url": "https://neurosciencenews.com/vagus-nerve-learning-21145/", "urlToImage": "https://neurosciencenews.com/files/2022/07/vagus-nerve-brain-neurosicnce-public.jpg", "publishedAt": "2022-07-28T22:36:01Z", "content": "Summary: Using stimulation, researchers found a direct connection between the vagus nerve and learning centers of the brain. Vagus nerve stimulation, they discovered, increases learning in a healthy … [+5010 chars]"}, {"source": {"id": null, "name": "WFMZ Allentown"}, "author": "John J. Moser", "title": "Hospitals confirm monkeypox now in the Lehigh Valley area; Doylestown Hospital reports 6 cases - 69News WFMZ-TV", "description": "ALLENTOWN, Pa. - Monkeypox is now in the Lehigh Valley area.", "url": "https://www.wfmz.com/news/area/lehighvalley/hospitals-confirm-monkeypox-now-in-the-lehigh-valley-area-bucks-county-reports-6-cases/article_e9d853f4-0eb6-11ed-81a7-f732412c14ad.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/wfmz.com/content/tncms/assets/v3/editorial/e/d3/ed3bcb8d-a505-53cd-91e6-100f62d166b5/62e342cb7a973.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-07-28T20:50:00Z", "content": "ALLENTOWN, Pa. - Monkeypox is now in the Lehigh Valley area.\r\nSix cases of the disease have been diagnosed in Bucks County, including one at Doylestown Hospital, where the patient was treated and rel… [+1283 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Nancy Lapid", "title": "Reinfection, severe outcome more common with BA.5 variant; virus spike protein toxic to heart cells - Yahoo! Voices", "description": "Compared with the earlier Omicron BA.2 subvariant, currently dominant Omicron BA.5 is linked with higher odds of causing a second SARS-COV-2 infection...", "url": "https://news.yahoo.com/reinfection-severe-outcome-more-common-202427422.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/2GDc07mpg.LgN0VhZHiqwg--~B/aD01Mjg7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/e3595462755aba0ceab4c10142ec1230", "publishedAt": "2022-07-28T20:24:27Z", "content": "(Reuters) The following is a summary of some recent studies on COVID-19. They include research that warrants further study to corroborate the findings and that has yet to be certified by peer review.… [+4970 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jordyn Beazley", "title": "Marburg virus disease: what is it, what are the symptoms and how worried should we be? - The Guardian", "description": "Ghana is working to contain an outbreak of the highly infectious Marburg virus, or MVD, which has no treatment and can be fatal", "url": "https://amp.theguardian.com/science/2022/jul/28/what-is-marburg-virus-symptoms-disease-mvd-cases-causes-treatment-outbreak-ghana-2022", "urlToImage": null, "publishedAt": "2022-07-28T04:03:00Z", "content": "Infectious diseasesGhana is working to contain an outbreak of the highly infectious Marburg virus, or MVD, which has no treatment and can be fatal\r\nThu 28 Jul 2022 05.03 BST\r\nTwo people have died in … [+3743 chars]"}]}