{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nadia Kounang, Katherine Dillinger", "title": "CDC warns of severe illnesses from monkeypox as Ohio reports death of a monkeypox patient - CNN", "description": "The US Centers for Disease Control and Prevention issued a new warning to health care providers Thursday about severe illnesses in people with monkeypox.", "url": "https://www.cnn.com/2022/09/29/health/ohio-monkeypox-death-cdc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220916153733-monkeypox-deaths-difficult-to-confirm.jpg?q=w_800,c_fill", "publishedAt": "2022-09-30T02:50:00Z", "content": "The US Centers for Disease Control and Prevention issued a new warning to health care providers Thursday about severe illnesses in people with monkeypox. \r\nThe alert comes as Ohio reported that an in… [+3846 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rachel Grumman Bender", "title": "Confused about COVID right now? Here’s what you need to know about emerging variants and vaccines. - Yahoo Life", "description": "If you're confused about the many COVID variants, you're not alone. Here's what experts are telling us.", "url": "https://www.yahoo.com/lifestyle/confused-about-covid-right-now-heres-what-you-need-to-know-about-emerging-variants-and-vaccines-234328450.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hkH9NjyZGzgFVXBgJMTwhA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTA-/https://s.yimg.com/os/creatr-uploaded-images/2022-09/8fbab920-4025-11ed-bfcb-86f059be879f", "publishedAt": "2022-09-29T23:43:28Z", "content": "As COVID variants continue to emerge, it's easy to get confused about what's circulating. (Photo: Getty Images)\r\nWith several COVID variants circulating at once, and as new ones continue to emerge, i… [+5712 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Linda Codega", "title": "The Stars Undying Reimagines Ancient Roman Drama Through a Sci-Fi Lens - Gizmodo", "description": "Read the first two chapters of Emery Robin's upcoming novel in this exclusive expert.", "url": "https://gizmodo.com/the-stars-undying-exclusive-excerpt-sci-fi-debut-novel-1849596853", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/add7bbc1d13af26b85a2c1f816edb41e.png", "publishedAt": "2022-09-29T22:00:00Z", "content": "The Stars Undying, the upcomingsci-fi debut from Emery Robin, introduces an interstellar princess forced into circumstances thatll require every bit of royal strength she can muster to overcome. Itll… [+29149 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Long Older Adults Will Live Comes Down to 17 Often Surprising Factors - Neuroscience News", "description": "Researchers have designed a new model of life expectancy that's based less on disease diagnosis, and more on other factors including cholesterol levels and lifestyle.", "url": "https://neurosciencenews.com/aging-life-expectancy-model-21555/", "urlToImage": "https://neurosciencenews.com/files/2022/09/old-people-aging-neurosinces-public.jpg", "publishedAt": "2022-09-29T20:42:34Z", "content": "Summary: Researchers have designed a new model of life expectancy that’s based less on disease diagnosis, and more on other factors including cholesterol levels and lifestyle.\r\nSource: Duke Universit… [+6148 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Kelly Rissman", "title": "I was diagnosed with a vitamin B12 deficiency when my limbs went numb - Insider", "description": "Before I was diagnosed with a vitamin B12 deficiency, I had no idea the symptoms could be so severe. Five months later, I'm finally feeling better.", "url": "https://www.insider.com/diagnosed-with-vitamin-b12-deficiency-when-my-limbs-went-numb-2022-9", "urlToImage": "https://i.insider.com/6336080425c9a90018a63071?width=1200&format=jpeg", "publishedAt": "2022-09-29T20:00:16Z", "content": "On a Wednesday morning in May, I went for my regular run around lower Manhattan. I enjoyed the breezy weather, ate my usual meals, and went to work. Then, as I was settling in for the night, somethin… [+4371 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "What Parents Need to Know About Enterovirus D68 - Lifehacker", "description": "EV-D68 can occasionally cause paralysis in children.", "url": "https://lifehacker.com/what-parents-need-to-know-about-enterovirus-d68-1849598002", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/d4be3790b99086f8a5ede585e2d9545e.jpg", "publishedAt": "2022-09-29T19:30:00Z", "content": "The CDC recently issued an alert to healthcare providers about enterovirus D68, which has turned up in children who were hospitalized with severe respiratory illnesses. This virus can also cause a fo… [+2727 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Taking a Dip in Cold Water May Cut “Bad” Body Fat - SciTechDaily", "description": "Review of current science indicates that an icy swim may cut ‘bad’ body fat, but further health benefits unclear. Taking a dip in cold water may cut ‘bad’ body fat in men and decrease the risk of disorders such as diabetes. These are the findings suggested by…", "url": "https://scitechdaily.com/taking-a-dip-in-cold-water-may-cut-bad-body-fat/", "urlToImage": "https://scitechdaily.com/images/Young-Man-Cold-Water-Bath-Outside.jpg", "publishedAt": "2022-09-29T18:24:30Z", "content": "A major scientific suggests that taking a dip in cold water may cut bad body fat in men and reduce the risk of disorders such as diabetes.\r\nReview of current science indicates that an icy swim may cu… [+4804 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Birth Weight Could Help Identify Children at Higher Risk of Psychological Issues - Neuroscience News", "description": "A child's weight at birth could determine their risk of being diagnosed with a mental health disorder later in life. Researchers found for every kilogram below average birth weight, the more likely a child was to experience mental health problems through chil…", "url": "https://neurosciencenews.com/birth-weight-mental-health-21551/", "urlToImage": "https://neurosciencenews.com/files/2022/09/birth-weight-psychaitry-neurosicnes-public.jpg", "publishedAt": "2022-09-29T17:46:02Z", "content": "Summary: A child’s weight at birth could determine their risk of being diagnosed with a mental health disorder later in life. Researchers found for every kilogram below average birth weight, the more… [+6335 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen U.S.", "title": "Experts anticipate dual Covid AND flu outbreak as influenza cases begin to rise in southern states - Daily Mail", "description": "Experts are warning that a 'twindemic' may erupt this year as both COVID-19 and the common flu are set to surge in the coming months. States like Texas are already experiencing a surge of the flu.", "url": "https://www.dailymail.co.uk/health/article-11263137/Experts-anticipate-dual-Covid-flu-outbreak-influenza-cases-begin-rise-southern-states.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/29/19/62940293-0-image-a-16_1664477425636.jpg", "publishedAt": "2022-09-29T17:23:03Z", "content": "Both Covid and flu could surge this winter causing a dreaded 'twindemic', experts fear with some southern states already feeling the early stages of an influenza resurgence.\r\nThe flu was largely wipe… [+8815 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Metabolism Linked to Brain Health - Neuroscience News", "description": "Researchers have identified a link between metabolism and dementia-related brain measures. Obesity related to inflammation, kidney stress, or liver stress had the biggest impact on adverse brain health.", "url": "https://neurosciencenews.com/metabolism-brain-health-21550/", "urlToImage": "https://neurosciencenews.com/files/2022/09/metabolism-brain-health-neuroscience-public.jpg", "publishedAt": "2022-09-29T17:06:07Z", "content": "Summary: Researchers have identified a link between metabolism and dementia-related brain measures. Obesity related to inflammation, kidney stress, or liver stress had the biggest impact on adverse b… [+4964 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Intranasal Vaccines: A Potential Off-Ramp For Coronavirus Pandemics - Hackaday", "description": "An interesting and also annoying aspect about the human immune system is that it is not a neat, centralized system where you input an antigen pattern in one spot and suddenly every T and B lymphocy…", "url": "https://hackaday.com/2022/09/29/intranasal-vaccines-a-potential-off-ramp-for-coronavirus-pandemics/", "urlToImage": "https://hackaday.com/wp-content/uploads/2022/09/2020FluVax3.jpg", "publishedAt": "2022-09-29T17:00:00Z", "content": "An interesting and also annoying aspect about the human immune system is that it is not a neat, centralized system where you input an antigen pattern in one spot and suddenly every T and B lymphocyte… [+9468 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Catherine Schuster-Bruce", "title": "Symptoms of Mycoplasma genitalium, STD linked to infertility - Insider", "description": "Most people with Mycoplasma genitalium don't experience symptoms, but it can cause pain when peeing in both men and women.", "url": "https://www.insider.com/std-infertility-scientists-warn-mycoplasma-genitalium-signs-symptoms-2022-9", "urlToImage": "https://i.insider.com/6335764cd0bea6001869a710?width=1200&format=jpeg", "publishedAt": "2022-09-29T16:49:32Z", "content": "Scientists warn Mycoplasma genitalium, a little-understood sexually transmitted disease linked to infertility, could be silently spreading amid a lack of testing and research.\r\n The STD isn't tracked… [+3125 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Andrea Michelson", "title": "Man's cancer vanished after he was injected with weakened herpes virus - Insider", "description": "The 39-year-old patient told the BBC that he was preparing for the end of his life when he learned about the experimental cancer drug.", "url": "https://www.insider.com/mans-cancer-vanished-after-injection-with-weakened-herpes-virus-2022-9", "urlToImage": "https://i.insider.com/6335f750d0bea6001869c8d9?width=1200&format=jpeg", "publishedAt": "2022-09-29T16:05:54Z", "content": "A new cancer therapy that uses a modified herpes virus to attack tumor cells showed promise in early clinical trials abroad.\r\nThe drug, called RP2, completely obliterated one patient's oral cancer. T… [+3213 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Jane Ridley", "title": "Woman diagnosed with breast cancer when she was 8 months pregnant - Insider", "description": "Jennifer Deus was devastated by her breast-cancer diagnosis at almost nine months pregnant. She vowed to beat the disease for her kids.", "url": "https://www.insider.com/breast-cancer-pregnancy-baby-diagnosis-birth-chemotherapy-2022-09", "urlToImage": "https://i.insider.com/6334cbc043e88400185da5ac?width=1200&format=jpeg", "publishedAt": "2022-09-29T15:51:03Z", "content": "This as-told-to essay is based on a conversation with Jennifer Deus. It has been edited for length and clarity\r\nI enjoyed every minute of my baby shower when I was eight months pregnant with my third… [+4340 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Do fungi lurking inside cancers speed their growth? - Nature.com", "description": "Studies that scrutinized thousands of tumour samples provide the clearest link yet between cancer and fungi — but more research is needed.", "url": "https://www.nature.com/articles/d41586-022-03074-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03074-z/d41586-022-03074-z_23552142.jpg", "publishedAt": "2022-09-29T15:37:16Z", "content": "The fungus Candida shown here growing under laboratory conditions has been found in some tumour samples.Credit: Nicolas Armer/dpa/Alamy\r\nFor years, evidence has been mounting that bacteria are linked… [+4896 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "Experts advise against giving your restless child melatonin over poisoning fears - Daily Mail", "description": "Melatonin is classed as a food supplement which means it have less oversight, according to the American Academy of Sleep Medicine (AASM).\nIt means doses are not uniform.", "url": "https://www.dailymail.co.uk/health/article-11262357/Experts-advise-against-giving-restless-child-melatonin-poisoning-fears.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/29/17/62934031-0-image-a-18_1664467916592.jpg", "publishedAt": "2022-09-29T15:25:55Z", "content": "Parents are being warned against giving children melatonin following a surge in accidental poisonings.\r\nExperts said there is no evidence the over-the-counter supplement helps them get to sleep and t… [+5017 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Identifying disease-critical cell types and cellular processes by integrating single-cell RNA-sequencing and human genetics - Nature.com", "description": "The sc-linker is an analysis framework that combines genome-wide association study summary statistics, epigenomics and single-cell transcriptomes to identify disease-critical cell types and cellular processes across tissues and states.", "url": "https://www.nature.com/articles/s41588-022-01187-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-022-01187-9/MediaObjects/41588_2022_1187_Fig1_HTML.png", "publishedAt": "2022-09-29T15:22:24Z", "content": "Overview of sc-linker\r\nWe developed a framework to link gene programs derived from scRNA-seq with diseases and complex traits (Fig. 1a). First, we use scRNA-seq to construct gene programs, defined as… [+34040 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "How Many Cups of Coffee You Should Drink Per Day, According to 'Science' - Lifehacker", "description": "Coffee may have health benefits, but we're still figuring out the optimal amount.", "url": "https://lifehacker.com/how-many-cups-of-coffee-you-should-drink-per-day-accor-1849596302", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/3b52059b1092b0d106fab43ee9883321.jpg", "publishedAt": "2022-09-29T15:00:00Z", "content": "A study thats in the news right now claims that people who drink two to three cups of coffee per day live longer than people who avoid coffee. So should we all be drinking two to three cups? Not nece… [+4351 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Davies", "title": "From raising your risk of diabetes to ageing you quicker than SMOKING: All the dangers of loneliness - Daily Mail", "description": "Loneliness has been associated with an increased risk of heart disease, obesity and depression. A Florida State University study suggested it might increase the chances of dementia.", "url": "https://www.dailymail.co.uk/health/article-11259619/From-raising-risk-diabetes-ageing-quicker-SMOKING-dangers-loneliness.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/29/10/62919625-0-image-a-2_1664443009966.jpg", "publishedAt": "2022-09-29T14:54:42Z", "content": "Everyone feels lonely from time to time.\r\nWhile the crushing feeling can be isolating, it is far different to chronic loneliness, a rapidly growing problem described as a public health emergency.\r\nIt… [+13138 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Loneliness Associated With Double the Risk of Developing Diabetes - Neuroscience News", "description": "Higher rates of loneliness were associated with an increased risk of developing Type 2 diabetes during a twenty-year follow-up, a new study reveals.", "url": "https://neurosciencenews.com/loneliness-diabetes-21546/", "urlToImage": "https://neurosciencenews.com/files/2022/09/loneliness-diabetes-neurosicences-public.jpg", "publishedAt": "2022-09-29T14:53:40Z", "content": "Summary: Higher rates of loneliness were associated with an increased risk of developing Type 2 diabetes during a twenty-year follow-up, a new study reveals.\r\nSource: Diabetologia\r\nA new study publis… [+7960 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Hilary Brueck", "title": "When to get the flu shot: Vaccine expert getting his in October - Insider", "description": "There are two key reasons experts are concerned the flu could hit early this year. A top expert explains why he's getting his shot very soon.", "url": "https://www.insider.com/when-to-get-flu-shot-vaccine-expert-getting-his-october-2022-9", "urlToImage": "https://i.insider.com/6335cf9dd0bea6001869bbbb?width=1200&format=jpeg", "publishedAt": "2022-09-29T14:15:48Z", "content": "Richard Webby knows what the flu is up to.\r\nAs one of the world's leading influenza experts, he makes recommendations to the World Health Organization every year to help vaccine makers decide which f… [+3840 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Getting a Flu Shot May Reduce Your Risk of Stroke - SciTechDaily", "description": "Annual flu shots are linked to a lower risk of stroke. According to research recently published in the journal Neurology getting an annual flu vaccination may reduce the risk of stroke. “Studies have shown that getting the flu increases your risk of having a …", "url": "https://scitechdaily.com/getting-a-flu-shot-may-reduce-your-risk-of-stroke/", "urlToImage": "https://scitechdaily.com/images/Vaccine-Flu-Shot.jpg", "publishedAt": "2022-09-29T13:06:33Z", "content": "The study found that people who got a flu shot had a 12% lower risk of stroke.\r\nAnnual flu shots are linked to a lower risk of stroke.\r\nAccording to research recently published in the journal Neurolo… [+2835 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Angelica Stabile", "title": "5 simple and healthy diet swaps to manage your cholesterol levels - Fox News", "description": "Compass Nutrition lead dietitian Nikita Kapur offers expert tips on how to manage cholesterol levels and make easy diet and lifestyle changes for better health.", "url": "https://www.foxnews.com/lifestyle/5-simple-healthy-diet-swaps-manage-cholesterol-levels", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/woman-eating-ntus.jpg", "publishedAt": "2022-09-29T11:11:52Z", "content": "Managing cholesterol is an essential part of maintaining overall health, especially for those who struggle with keeping their numbers in the right place.  \r\nBoston-based registered dietitian-nutritio… [+6440 chars]"}, {"source": {"id": null, "name": "Detroit Free Press"}, "author": ", Detroit Free Press", "title": "Black Michiganders got 60% of monkeypox cases, only 17% of vaccines - Detroit Free Press", "description": "Even though 60% of the people who have gotten monkeypox in Michigan so far are Black, 70% of vaccines have gone to white Michiganders.", "url": "https://www.freep.com/story/news/health/2022/09/29/monkeypox-disparities-black-michiganders-vaccines/69524613007/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/06/07/PDTF/4c364ef3-5d04-4bf0-b88e-9076e233cac1-C0557808-Monkeypox_virus_illustration.jpg?auto=webp&crop=899,506,x0,y45&format=pjpg&width=1200", "publishedAt": "2022-09-29T10:14:15Z", "content": "Even though 60% of the people who have gotten monkeypox in Michigan so far are Black, 70% of the doses of the vaccine that can prevent infection or limit symptoms after exposure have gone to white Mi… [+9884 chars]"}, {"source": {"id": null, "name": "GMA"}, "author": "Katie Kindelan", "title": "New study confirms that COVID-19 vaccines can temporarily affect menstruation - GMA", "description": "", "url": "https://www.goodmorningamerica.com/wellness/story/study-confirms-covid-19-vaccines-temporarily-affect-menstruation-90639903", "urlToImage": "https://s.abcnews.com/images/GMA/covid-vaccine-file-gty-jef-220928_1664389516618_hpMain_16x9_608.jpg", "publishedAt": "2022-09-29T09:52:04Z", "content": "When COVID-19 vaccines became widely available, some women reported changes in the timing and length of their menstrual cycles after getting vaccinated.\r\nNow, nearly two years later, a global study h… [+3387 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Popular Erectile Dysfunction Treatment Eases Symptoms in Lung Disease - ScienceAlert", "description": "You may be surprised to learn that the medication sildenafil – better known by its brand name Viagra – has other medical purposes aside from treating male erectile dysfunction.", "url": "https://www.sciencealert.com/popular-erectile-dysfunction-treatment-eases-symptoms-in-lung-disease", "urlToImage": "https://www.sciencealert.com/images/2022/09/ManHoldingABluePill.jpg", "publishedAt": "2022-09-29T07:40:32Z", "content": "You may be surprised to learn that the medication sildenafil better known by its brand name Viagra has other medical purposes aside from treating male erectile dysfunction. It can also be used to tre… [+4784 chars]"}, {"source": {"id": null, "name": "The Federalist"}, "author": "Adrian Gaty", "title": "'Vaccine-Derived Poliovirus' Is The New Thing You Can't Talk About - The Federalist", "description": "Polio is making a reemergence in the wastewater of America. What's causing it, and what happens next?", "url": "https://thefederalist.com/2022/09/29/vaccine-derived-poliovirus-is-the-next-public-health-issue-you-cant-talk-about/", "urlToImage": "https://thefederalist.com/wp-content/uploads/2022/09/A-young-Indian-girl-receiving-a-dose-of-oral-polio-vaccine-by-a-trained-healthcare-worker.jpg", "publishedAt": "2022-09-29T07:09:36Z", "content": "Polio, a virus once thought to be a thing of the past, recently reemerged in New York states wastewater. Politico helpfully explained that this recent emergence is, in fact, a form of vaccine-derived… [+3680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Healthy eating: Four best protein sources your body needs - The Indian Express", "description": "A lot of people who are confused about what kinds of foods to add to their diet so as to meet their daily protein requirement should know that plant-based proteins are easy to digest as compared to animal proteins", "url": "https://indianexpress.com/article/lifestyle/food-wine/healthy-eating-four-protein-sources-plant-based-body-health-8134310/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-protein-sources-1200.jpg", "publishedAt": "2022-09-29T06:00:30Z", "content": "There are many reasons why one should add plenty of protein-rich foods to their diet. It is understood that proteins help to structure and support the cells, build immunity and are useful for hormone… [+3259 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Fenit Nirappil, Lena H. Sun", "title": "What happened to monkeypox? Answers to your most pressing questions. - The Washington Post", "description": "Monkeypox vaccines appear to be working in stemming the outbreak. But severe symptoms and inequality persist.", "url": "https://www.washingtonpost.com/health/2022/09/28/monkeypox-vaccine-symptoms-cases/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YMTFK2BBRYI63JZPDZYUSBZPXQ.jpg&w=1440", "publishedAt": "2022-09-28T23:45:00Z", "content": "New monkeypox cases are declining in the United States, a trend public health officials and clinicians attribute to vaccination and changes in behavior.\r\nEligible individuals who did not receive the … [+873 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Isabel Shaw", "title": "Taking antidepressants long-term ‘increases your risk of killer condition’... - The US Sun", "description": "", "url": "https://www.the-sun.com/health/6325780/antidepressants-risk-of-killer-condition/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/09/NINTCHDBPICT000527170784.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-09-28T23:01:00Z", "content": "TAKING antidepressants long-term could increase your risk of a silent killer, experts have warned.\r\nThe drugs, used to treat clinical depression, as well as other conditions like OCD and PTSD, are ta… [+6206 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Annie Lennon", "title": "Diabetes: 2 common drugs outperform others, study finds - Medical News Today", "description": "Researchers found that popular diabetes drugs glargine and liraglutide are most effective for reducing blood glucose levels, while liraglutide and sitagliptin induced the most weight loss.", "url": "https://www.medicalnewstoday.com/articles/2-common-diabetes-drugs-more-effective-than-others-study", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/09/diabetes_drugs-_GettyImages1158361787_Thumb.jpg", "publishedAt": "2022-09-28T22:30:26Z", "content": "<ul><li>Researchers compared the efficacy of four diabetes drugs in reducing blood glucose levels. </li><li>They found that glargine and liraglutide are most effective for reducing blood glucose leve… [+7361 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Chris Melore", "title": "Stress can actually protect the body from injury and disease, study reveals - Study Finds", "description": "“This one of the few studies showing that chronic stress could have beneficial effect instead of negative effect,” researchers say.", "url": "https://studyfinds.org/stress-can-protect-the-body/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2020/04/close-up-composition-conceptual-creativity-626165-scaled.jpg", "publishedAt": "2022-09-28T22:10:21Z", "content": "CLEVELAND — Although stress plays a role in the onset of a number of health issues, a new study finds it may also protect the body in certain circumstances.\r\nResearchers from the Case Western Reserve… [+3252 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Gastroesophageal Reflux Disease | NEJM - nejm.org", "description": "Clinical Practice from The New England Journal of Medicine — Gastroesophageal Reflux Disease", "url": "https://www.nejm.org/doi/full/10.1056/NEJMcp2114026", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/2022/nejm_2022.387.issue-13/nejmcp2114026/20220926/images/img_small/nejmcp2114026_f1.jpeg", "publishedAt": "2022-09-28T21:09:42Z", "content": "From the Esophageal and Swallowing Center, Division of Gastroenterology and Hepatology, MetroHealth Medical Center, and Case Western Reserve University both in Cleveland.\r\nDr. Fass can be contacted a… [+133 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Obesity May Be a Neurodevelopmental Disorder - Neuroscience News", "description": "Obesity is, in part, determined by epigenetic development in the arcuate nucleus of the hypothalamus. Findings suggest developmental epigenetics plays a significant role in both environmental and genetic influences on obesity risk.", "url": "https://neurosciencenews.com/obesity-epigenetic-neurodevelopment-21543/", "urlToImage": "https://neurosciencenews.com/files/2022/09/obestity-neurodevelopment-neurosicnes-public.jpg", "publishedAt": "2022-09-28T20:37:15Z", "content": "Summary: Obesity is, in part, determined by epigenetic development in the arcuate nucleus of the hypothalamus. Findings suggest developmental epigenetics plays a significant role in both environmenta… [+5960 chars]"}, {"source": {"id": null, "name": "SheKnows"}, "author": "Rachel Garlinghouse", "title": "Three Friends Ghosted Me When They Learned I Had Breast Cancer & It’s Taken Me A Long Time To Let Them Go - SheKnows", "description": "The first time I was diagnosed with breast cancer, I only told a handful of people. I was faced with the decision between a lumpectomy and radiation or a mastectomy. I wanted to make this choice with as little “noise” as possible. Instead, I wanted to rely on…", "url": "https://www.sheknows.com/health-and-wellness/articles/2623709/breast-cancer-friends-ghosting-support-system/", "urlToImage": "https://www.sheknows.com/wp-content/uploads/2022/09/hard-to-get-over-friends-ghosting-after-cancer-diagnosis-1.jpg?w=1024", "publishedAt": "2022-09-28T19:59:00Z", "content": "The first time I was diagnosed with breast cancer, I only told a handful of people. I was faced with the decision between a lumpectomy and radiation or a mastectomy. I wanted to make this choice with… [+5465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katia Hetter", "title": "Cancer is the No. 2 cause of death in US. What you should know about screenings - CNN", "description": "Many people postponed routine medical care because of disruptions related to the Covid-19 pandemic. That includes a decline in cancer screenings. Why is cancer screening so important and what are guidelines for who should be screened for what cancer? CNN Medi…", "url": "https://www.cnn.com/2022/09/28/health/cancer-screenings-prwen-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220927161810-01-cancer-screenings-prevention-wellness-stock.jpg?q=w_800,c_fill", "publishedAt": "2022-09-28T17:30:00Z", "content": "Many people postponed routine medical care because of disruptions related to the Covid-19 pandemic. That includes a decline in cancer screenings, such as mammograms and colonoscopies. In the meantime… [+7151 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Omega-3 Fatty Acids, and in Particular DHA, Are Associated With Increased Attention Scores in Adolescents - Neuroscience News", "description": "DHA consumption was associated with improved capacity for selective and sustained attention in adolescents, while ALA lowered impulsive behaviors.", "url": "https://neurosciencenews.com/dha-attention-21539/", "urlToImage": "https://neurosciencenews.com/files/2022/09/dha-omega-3-attention-neuroswicences-public.jpg", "publishedAt": "2022-09-28T16:49:18Z", "content": "Summary: DHA consumption was associated with improved capacity for selective and sustained attention in adolescents, while ALA lowered impulsive behaviors.\r\nSource: ISGLOBAL\r\nDocosahexaenoic acid (DH… [+5502 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Macy Meyer", "title": "Everyone Should Know Their Blood Type: 3 Ways to Find Out Yours - CNET", "description": "Most people don't know their blood type. Here's easy steps to figure it out.", "url": "https://www.cnet.com/health/medical/everyone-should-know-their-blood-type-3-ways-to-find-out-yours/", "urlToImage": "https://www.cnet.com/a/img/resize/f3fca64d0a4f3f4cb8d970b48b4a71a440c0b224/hub/2022/09/22/289c99fd-1dc0-4ea4-9f13-77822a566993/gettyimages-606979941.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-09-28T15:15:07Z", "content": "Knowing your blood type is important. I was recently filling out a volunteer application and was asked to provide my blood type. Luckily, I knew off the top of my head that I'm type O-positive, but I… [+4687 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Daryl Perry, USA TODAY", "title": "What is a dangerous heart rate? A look at normal ranges for adults. - USA TODAY", "description": "An adult's heart rate is normally between 60 and 100 bpm. Stress, hormones, medication, activity levels and anxiety, can impact your heart rate.", "url": "https://www.usatoday.com/story/life/health-wellness/2022/09/28/normal-heart-rate-zones-adults-bpm/10252507002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2022/02/25/USATODAY/usatsports/imageforentry4-hum.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2022-09-28T13:03:14Z", "content": "A quick way to get your heart rate up is to do a form of cardiovascular exercise, like going for a run.  But at certain points, the rate at which your heart is beating could become dangerous.\r\nYour h… [+3208 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gretchen Reynolds", "title": "How exercising now could benefit your future grandchildren - The Washington Post", "description": "A fascinating new study in rodents suggests that the exercise you do now can carry through your genes and benefit future grandchildren.", "url": "https://www.washingtonpost.com/wellness/2022/09/28/exercise-genetics-grandchildren/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MAFP32CXKFDM7MACDQ25PZAAGE.png&w=1440", "publishedAt": "2022-09-28T13:00:00Z", "content": "Exercising now is good for you. But could it also be good for your future children and grandchildren?\r\nA provocative new study says it might be. The findings, based on research in mice, suggest that … [+6015 chars]"}, {"source": {"id": null, "name": "Celebwell.com"}, "author": "Ferozan Mast", "title": "Cassie Lee in Bathing Suit is \"Still Me\" — Celebwell - Celebwell", "description": "Cassie Lee is expecting her first child, but the pro wrestler has been posting amazing throwback bathing suit photos, to the delight of fans.", "url": "https://celebwell.com/news-cassie-lee-in-bathing-suit-is-still-me/", "urlToImage": "https://celebwell.com/wp-content/uploads/sites/2/2022/09/casse-lee-1.jpg?quality=82&strip=all", "publishedAt": "2022-09-28T12:20:53Z", "content": "Cassie Lee (real name Cassandra McIntosh) is currently expecting her first childbut the professional wrestler has been posting amazing throwback photos, to the delight of her many fans. \"Still me \", … [+3130 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Jacob Livesay, USA TODAY", "title": "What is the healthiest fish to eat? What fish should I avoid? - USA TODAY", "description": "Salmon, cod, herring and mahi-mahi are among the healthiest fish to eat. The worst fish to eat are those high in mercury, according to WebMD.", "url": "https://www.usatoday.com/story/news/health/2022/09/28/what-healthiest-fish-to-eat-types-to-avoid/8039194001/", "urlToImage": "https://www.gannett-cdn.com/-mm-/d8d0774057d19139d16e6ede624d76e89947662d/c=1-0-1365-767/local/-/media/2021/04/02/USATODAY/usatsports/imageforentry16-0bn.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2022-09-28T10:00:57Z", "content": "Fish is generally a healthy food high in omega-3 fatty acids, which our bodies do not naturally produce, according to Healthline.\r\nIn addition to protein content, the American Heart Association says … [+2267 chars]"}]}