{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "How psilocybin, the psychedelic in mushrooms, may rewire the brain to ease depression, anxiety and more - CNN", "description": "Scientists are learning more about how psychedelic mushrooms may alter the brain, potentially leading to long-lasting reversals of depression, anxiety, cluster headaches and more.", "url": "https://www.cnn.com/2022/06/11/health/psilocybin-brain-changes-life-itself-wellness-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220525185941-cultivated-mushrooms-restricted-super-tease.jpg", "publishedAt": "2022-06-11T06:15:00Z", "content": "(CNN)Shrooms, Alice, tweezes, mushies, hongos, pizza toppings, magic mushrooms -- everyday lingo for psychedelic mushrooms seems to grow with each generation. Yet leading mycologist Paul Stamets beli… [+12119 chars]"}, {"source": {"id": null, "name": "KOMO News"}, "author": "Denise Whitaker, KOMO News reporter", "title": "Retired Tacoma pastors lean on faith, family support after wife's Alzheimer's diagnosis - KOMO News", "description": "It's not always easy or quick to get a diagnosis for certain diseases, but a Tacoma couple said they likely misinterpreted a few signs along their path. Sylvia Lee Thompson was diagnosed with Alzheimer's disease two years ago. &ldquo;I don&rsquo;t want people…", "url": "https://komonews.com/news/local/tacoma-couple-dont-ignore-memory-mistakes-see-a-doctor", "urlToImage": "https://komonews.com/resources/media/91c221ea-3516-437a-ad17-24399323f5cd-large16x9_thumb_103241.png?1654927604649", "publishedAt": "2022-06-10T23:04:11Z", "content": null}, {"source": {"id": null, "name": "New York Post"}, "author": "Emily Lefroy", "title": "I ignored a lump on my face — then was diagnosed with incurable lymphoma - New York Post ", "description": "The woman shared her story to TikTok, revealing she initially thought it was just a bump and was shocked when she found out what was wrong.", "url": "https://nypost.com/2022/06/10/i-ignored-a-lump-in-my-face-then-was-diagnosed-with-incurable-lymphoma/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/06/lump-face-lymphoma-99.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-06-10T23:03:00Z", "content": "A woman is urging people to be vigilant with their health after she discovered a bump on her face was actually an incurable lymphoma.\r\nMelea Patton shared her story on TikTok, saying she had noticed … [+2740 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Drumming Improves Behavior and Brain Function in Autistic Adolescents - Neuroscience News", "description": "Drumming for 90 minutes per week helps adolescents with ASD to overcome hyperactivity and attention deficits. Learning drumming patterns also tunes brain connectivity in areas associated with inhibitory control and self regulation.", "url": "https://neurosciencenews.com/drumming-asd-attention-20802/", "urlToImage": "https://neurosciencenews.com/files/2022/06/drumming-asd-neurosicences-public.jpg", "publishedAt": "2022-06-10T21:14:46Z", "content": "Summary: Drumming for 90 minutes per week helps adolescents with ASD to overcome hyperactivity and attention deficits. Learning drumming patterns also tunes brain connectivity in areas associated wit… [+6897 chars]"}, {"source": {"id": null, "name": "POPSUGAR"}, "author": null, "title": "\"Lightning Crotch\" During Pregnancy Is Real - Here's What to Know - msnNOW", "description": "Pregnancy comes with a whole host of side effects, including nausea, vomiting, swelling, and sleep loss.", "url": "https://www.popsugar.com/fitness/lightning-crotch-pain-during-pregnancy-causes-treatment-48844671?utm_source=msn&amp;utm_medium=partner&amp;utm_campaign=feed", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAYkc0C.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-06-10T20:59:11Z", "content": "© Getty / DjelicS\r\n \"Lightning Crotch\" During Pregnancy Is Real - Here's What to Know\r\nPregnancy comes with a whole host of side effects, including nausea, vomiting, swelling, and sleep loss. But one… [+4069 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard, CNN", "title": "The ah-ha moment when doctors realized first US patient in global outbreak had monkeypox: 'It wasn't initially on our radar screen' - CNN", "description": "When Dr. Nesli Basgoz met her patient for the first time in May, he had been admitted to Massachusetts General Hospital with symptoms that were quite common for many infectious diseases -- fever, rash, fatigue, sweats.", "url": "https://www.cnn.com/2022/06/10/health/monkeypox-symptoms-us-outbreak/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220529191557-monkeypox-microscope-file-super-tease.jpg", "publishedAt": "2022-06-10T20:40:00Z", "content": "(CNN)When Dr. Nesli Basgoz met her patient for the first time in May, he had been admitted to Massachusetts General Hospital with symptoms that were quite common for many infectious diseases -- fever… [+8116 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Multiple Heart-Related Conditions Linked to Triple Dementia Risk, Regardless of Genetics - Neuroscience News", "description": "People who suffer cardiometabolic disorders, such as stroke, diabetes, or a heart attack, either as stand-alone conditions or a combination of the conditions, have an increased risk of developing dementia regardless of whether or not they have a genetic predi…", "url": "https://neurosciencenews.com/dementia-cardiometabolic-health-20801/", "urlToImage": "https://neurosciencenews.com/files/2022/06/heart-conditions-dementia-neurosicences-public.jpg", "publishedAt": "2022-06-10T20:06:10Z", "content": "Summary: People who suffer cardiometabolic disorders, such as stroke, diabetes, or a heart attack, either as stand-alone conditions or a combination of the conditions, have an increased risk of devel… [+8290 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Emily Anthes", "title": "Study Shows Case of Likely Cat-to-Human Virus Spread, but Risk Remains Low - The New York Times", "description": "People are far more likely to give the virus to cats than cats are to pass it to humans, experts stress.", "url": "https://www.nytimes.com/2022/06/10/health/cat-human-covid-transmission.html", "urlToImage": "https://static01.nyt.com/images/2022/06/10/science/10virus-briefing-cat-transmission-b/10virus-briefing-cat-transmission-facebookJumbo.jpg", "publishedAt": "2022-06-10T20:03:37Z", "content": "Previous research has shown that pet owners can infect their cats and that, in certain conditions, cats can transmit the virus to each other.But it has been difficult to prove that cat-to-human trans… [+1167 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen U.S.", "title": "Girls are going through puberty earlier now - setting them up for lifelong problems - Daily Mail", "description": "American girls are going through puberty earlier now than in previous generations, and experts cannot pin-point exactly why.", "url": "https://www.dailymail.co.uk/health/article-10902139/Girls-going-puberty-earlier-setting-lifelong-problems.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/10/13/58891865-0-image-a-3_1654862806194.jpg", "publishedAt": "2022-06-10T18:38:17Z", "content": "Young girls in America are going through puberty at earlier ages than before, and while the causes are still in question, some experts fear this could have negative effects on young women's health la… [+17717 chars]"}, {"source": {"id": null, "name": "Coleandmarmalade.com"}, "author": "Corbin Black", "title": "Great News About Potential Breakthroughs for FIV+ Cats Like Marmalade - Cole & Marmalade", "description": "We shared some promising news for FIV+ cancer survivors like Marmalade. One is a new diagnostic test and another is a gel to help treat cats.", "url": "https://coleandmarmalade.com/2022/06/10/great-news-about-potential-breakthroughs-for-fiv-cats-like-marmalade/", "urlToImage": "https://coleandmarmalade.com/wp-content/uploads/2022/06/FIV-cats-Marmalade-media.png", "publishedAt": "2022-06-10T18:25:05Z", "content": "Sharing is caring!\r\nAs many of you know, Marmalade is FIV+, acquired from his mother at birth. Despite this, our favorite ginger tabby named after British jam has enjoyed a spectacular life. He kicke… [+3914 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ABC News", "title": "Connecticut woman dies from rare tick-borne virus in 2nd fatality this year in US - ABC News", "description": "A Connecticut woman has died of Powassan virus, making her the second fatality from the rare tick-borne illness recorded in the U.S. this year.", "url": "https://abcnews.go.com/Health/connecticut-woman-dies-rare-tickborne-virus-2nd-fatality/story?id=85308162", "urlToImage": "https://s.abcnews.com/images/Health/deer-tick-stock-gty-jef-220421_1650567285336_hpMain_16x9_992.jpg", "publishedAt": "2022-06-10T18:22:39Z", "content": "A Connecticut woman has died from the rare tick-borne disease Powassan virus, the state's Department of Public Health announced.\r\nThis is the first fatality recorded in the state and the second in th… [+2747 chars]"}, {"source": {"id": null, "name": "WYFF4 Greenville"}, "author": null, "title": "COVID-19 levels 'spike' in some counties; South Carolina health officials send warning - WYFF4 Greenville", "description": "SCDHEC sent out a plea Friday as COVID-19 levels across the state begin to rise: Get vaccinated, boosted and wear a mask if you live in areas with rising risk.", "url": "https://www.wyff4.com/article/covid-19-levels-spike-south-carolina-health-warning/40251870", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/covid-south-carolina-1630065356.jpg?crop=1.00xw:0.920xh;0,0.0559xh&resize=1200:*", "publishedAt": "2022-06-10T18:03:00Z", "content": "COLUMBIA, S.C. — The South Carolina Department of Health and Environmental Control sent out a plea Friday as COVID-19 levels across the state and the nation begin to rise: Get vaccinated, boosted and… [+2819 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "When we'll be able to 3D-print organs and who will be able to afford them - CNN", "description": "Thousands of people wait for donor organs every year, but there aren't nearly enough organs to go around. Bioprinting organs using patients' own cells could change that problem.", "url": "https://www.cnn.com/2022/06/10/health/3d-printed-organs-bioprinting-life-itself-wellness-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220601171740-01-3d-printed-organs-super-tease.jpg", "publishedAt": "2022-06-10T17:42:00Z", "content": "(CNN)What if doctors could just print a kidney, using cells from the patient, instead of having to find a donor match and hope the patient's body doesn't reject the transplanted kidney? \r\nThe soonest… [+8996 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Spencer Kimball", "title": "Some monkeypox patients also have sexually transmitted diseases, CDC says - CNBC", "description": "CDC Director Rochelle Walensky said some patients with monkeypox also had syphilis, herpes, gonorrhea or chlamydia infections.", "url": "https://www.cnbc.com/2022/06/10/some-monkeypox-patients-also-have-sexually-transmitted-diseases-cdc-says.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106808217-16074624522020-12-08t204842z_581347166_rc28jk92jzgu_rtrmadp_0_usa-biden.jpeg?v=1654880243&w=1920&h=1080", "publishedAt": "2022-06-10T17:35:22Z", "content": "Some people recently diagnosed with sexually transmitted diseases may also have monkeypox, the Centers for Disease Control and Prevention said, warning physicians that they need to watch and test for… [+6027 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ann Schmidt", "title": "Rectal cancer drug trial of dostarlimab cures all patients: report - Fox News", "description": "A clinical trial of dostarlimab, done by Memorial Sloan Kettering Cancer Center, found the drug appears to have completely cured 12 patients of rectal cancer.", "url": "https://www.foxnews.com/lifestyle/rectal-cancer-drug-trial-dostarlimab-cure", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/06/Clinical-trial-iStock.jpg", "publishedAt": "2022-06-10T17:14:23Z", "content": "The results of a small clinical trial have found that there could be a cure for rectal cancer. \r\nThe trial conducted by Memorial Sloan Kettering Cancer Center in Manhattan involved at least 12 rectal… [+2873 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Hawaii reports third case of probable monkeypox; nationwide tally hits 45 - Fox News", "description": "Health officials in Hawaii reported the state's third case of probable monkeypox virus as Rhode Island announced its first, bringing the national tally up to 45.", "url": "https://www.foxnews.com/health/hawaii-third-cases-probable-monkeypox-nationwide-tally-45", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/06/CDC-POX.jpg", "publishedAt": "2022-06-10T16:18:40Z", "content": "The Hawaii Department of Health (DOH) has identified a third probable case of monkeypox. \r\nIn a release, officials said that the individual is a resident of Oahu who had attended a social gathering.\r… [+2813 chars]"}, {"source": {"id": null, "name": "KXAN.com"}, "author": "Grace Reader, Christopher Adams", "title": "COVID might be spreading as fast now as it was during previous surges, testing company says - KXAN.com", "description": "We’re not seeing lines around the block at testing sites in downtown Austin right now, but the co-founder of Curative says the positivity rate he’s seeing in their patients is higher than it was during the first three COVID-19 surges and is approaching omicro…", "url": "https://www.kxan.com/news/coronavirus/covid-might-be-spreading-as-fast-right-now-as-it-was-during-previous-surges-testing-company-says/", "urlToImage": "https://www.kxan.com/wp-content/uploads/sites/40/2021/01/0b75a3f171ad48b99945f4e5330bf502.jpg?w=1280", "publishedAt": "2022-06-10T15:55:40Z", "content": "AUSTIN (KXAN) — We’re not seeing lines around the block at testing sites in downtown Austin right now, but the co-founder of Curative says the positivity rate they’re seeing in patients is higher tha… [+3656 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "5 Best Eating Habits for Men Over 50 — Eat This Not That - Eat This, Not That", "description": "Unfortunately, your risk of certain diseases increases as you age. Here are the best eating habits to keep men healthy over 50.", "url": "http://www.eatthis.com/best-eating-habits-for-men-over-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/Man-eating-a-sandwich.jpg?quality=82&strip=all", "publishedAt": "2022-06-10T15:35:03Z", "content": "Men's health undergoes plenty of changes when they turn 50; their risk of issues such as type 2 diabetes, high blood pressure, heart disease, colon cancer, and prostate cancer increase significantly.… [+3268 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Deena Theresa", "title": "Scientists discovered a new molecule that kills even the deadliest cancer - Interesting Engineering", "description": "A team from UT Dallas has discovered a molecule that destroys adamant cancer cells. Experiments on mice and human tissue found that the compound was effective even in the most aggressive tumors, offering hope.", "url": "https://interestingengineering.com/new-molecule-kills-deadliest-cancer", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/nWOVXPR16o/sizes/untitled-2-12_md.jpg", "publishedAt": "2022-06-10T13:47:55Z", "content": "Recently, a tiny group of people with rectal cancer saw their disease vanish after experimental treatment.It was a very small trial done by doctors at New York's Memorial Sloan Kettering Cancer Cente… [+5814 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Amy Graff", "title": "San Francisco reports three more monkeypox cases - SFGATE", "description": "The risk of monkeypox to the general population remains low.", "url": "https://www.sfgate.com/bayarea/article/Alameda-County-reports-first-confirmed-monkeypox-17231629.php", "urlToImage": "https://s.hdnux.com/photos/01/25/76/64/22539570/3/rawImage.jpg", "publishedAt": "2022-06-10T13:42:48Z", "content": "LATEST June 10, 6:30 a.m. Three additional probable cases of monkeypox were identified in San Francisco residents, bringing the total number of cases reported to four, the San Francisco Department of… [+2870 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Kayla Garritano", "title": "5 Best Foods To Eat for Achy Bones, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "Whether you're dealing with bone pain or bad joints, achy bones are a nuisance. Our dietitians give you advice on foods that can help.", "url": "http://www.eatthis.com/best-foods-achy-bones/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/Man-gripping-elbow.jpg?quality=82&strip=all", "publishedAt": "2022-06-10T11:19:54Z", "content": "If your body is feeling off, and your joints and bones feel sensitive or weak, there could be an underlying issue. Most of the time, it could be from an illness like the flu, and in time it will go a… [+5497 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "The #1 Best Breakfast Habit to Lower Cholesterol, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "You can help manage your cholesterol by eating healthy foods. One of the best foods you can eat for cholesterol is something high in fiber.", "url": "http://www.eatthis.com/best-breakfast-habit-lower-cholesterol/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/woman-holding-oatmeal-fruit.jpg?quality=82&strip=all", "publishedAt": "2022-06-10T10:43:06Z", "content": "Managing your cholesterol levels can be a difficult task, especially if you're genetically prone to having high cholesterol or struggle with other health underlying health issues. There are many thin… [+2818 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": null, "title": "The 16 Best Memory Supplements, According To Nutrition Experts - mindbodygreen.com", "description": "Easily retain and recall memories with these nootropic supplements.*", "url": "https://www.mindbodygreen.com/articles/best-memory-supplements", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_201,w_1920,h_1079/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/sujjfgi9ik0ig0d2e.jpg", "publishedAt": "2022-06-10T10:02:30Z", "content": "Whether we realize it or not, memory is an essential cognitive function we use every day as were driving to the store, dialing a phone number we know by heart, or recalling a new coworkers name so we… [+23978 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "France 24", "title": "The age of outbreaks: Experts warn of more animal disease threats - FRANCE 24 English", "description": "With the spread of monkeypox across the world coming hot on the heels of Covid-19, there are fears that increasing outbreaks of diseases that jump from animals to humans could spark another pandemic.", "url": "https://www.france24.com/en/live-news/20220610-the-age-of-outbreaks-experts-warn-of-more-animal-disease-threats", "urlToImage": "https://s.france24.com/media/display/72f496f6-e8a2-11ec-bd7c-005056bfb2b6/w:1280/p:16x9/1738625b11e1ebbcf1cb118b044a7b9b16642dc3.jpg", "publishedAt": "2022-06-10T09:48:15Z", "content": "Paris (AFP) With the spread of monkeypox across the world coming hot on the heels of Covid-19, there are fears that increasing outbreaks of diseases that jump from animals to humans could spark anoth… [+4433 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": null, "title": "If You Have Crepey Skin, Make Sure You're Getting Enough Of This Ingredient - mindbodygreen.com", "description": "Treating crepey skin isn't impossible.", "url": "https://www.mindbodygreen.com/articles/how-coq10-can-help-with-crepey-skin", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/utzqo7scjkns0otmi.png", "publishedAt": "2022-06-10T09:38:39Z", "content": "All that to say: CoQ10 is an all-star ingredient for healthy skin aging, which is exactly why we included the powerful antioxidant in our postbiotic body lotion. Many lotions for crepey skin include … [+665 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": null, "title": "Are these Cocoa Krispies-loving hamsters a key to cracking long Covid? - STAT", "description": "“Just saying the words ‘animal model of long Covid’ really blows out of the water these claims that aim to psychologize long Covid or tell people it’s just stress or anxiety.”", "url": "https://www.statnews.com/2022/06/10/hamsters-as-animal-model-for-long-covid/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/06/AdobeStock_168830140-1024x576.jpeg", "publishedAt": "2022-06-10T08:39:40Z", "content": "NEW YORK In late 2020, Justin Frere, a wiry M.D./Ph.D. student dressed in head-to-toe white Tyvek, picked up a clear pipette, methodically reached into the cages of 30 unsuspecting, sedated hamsters … [+9826 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Allana Akhtar", "title": "Signs you have a vitamin B12 deficiency: fatigue, sensory problems - Insider", "description": "Though more research is needed on vitamin B12 and neurological behavior, the nutrient is essential for giving the body energy.", "url": "https://www.insider.com/signs-you-have-a-vitamin-b12-deficiency-fatigue-sensory-problems-2022-6", "urlToImage": "https://i.insider.com/62a21f1b4d33760019867d82?width=1200&format=jpeg", "publishedAt": "2022-06-10T08:34:47Z", "content": "Vitamin B12 is an easy vitamin to get, whether through foods or supplements which is good because deficiency may cause long-lasting damage to your nerves and cognition.\r\nRecent research has found hig… [+3457 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Associated Press", "title": "Bird flu arrives in Southwest after millions of birds die - New York Post ", "description": "Bird flu arrives in he disease was spotted after tests by federal wildlife officials in three wild cormorants that had been found dead in a park in the Phoenix suburb of Scottsdale, Arizona Game an…", "url": "https://nypost.com/2022/06/10/arizona-officials-confirm-bird-flu-cases-in-southwest/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/06/AP22161019281752-e1654842877683.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-06-10T06:52:00Z", "content": "Arizona officials have confirmed the first cases in the Southwest of a bird flu that has led to the deaths of 37 million birds from commercial farms in the central and eastern U.S.\r\nThe disease was s… [+4037 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "High Omega-3 DHA Level in Blood Linked With 49% Lower Risk of Alzheimer’s Disease - SciTechDaily", "description": "Simple dietary intervention could amount to billions in health care cost savings. Alzheimer’s disease is the most common cause of dementia in older adults and the 7th leading cause of death in the United States according to the National Institute on Aging. It…", "url": "https://scitechdaily.com/high-omega-3-dha-level-in-blood-linked-with-49-lower-risk-of-alzheimers-disease/", "urlToImage": "https://scitechdaily.com/images/Omega-3-Supplement-Capsules.jpg", "publishedAt": "2022-06-10T06:03:41Z", "content": "ByFatty Acid Research Institute (FARI)June 9, 2022\r\nNew research suggests that providing extra dietary omega-3 DHA could slow the development of Alzheimers disease.\r\nSimple dietary intervention could… [+4753 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Karen Gilchrist", "title": "Diseases suppressed during Covid are coming back in new and peculiar ways - CNBC", "description": "The Covid-19 pandemic has abated in much of the world. But in its place have emerged a series of viruses behaving in new and peculiar ways.", "url": "https://www.cnbc.com/2022/06/10/flu-hepatitis-monkeypox-diseases-suppressed-during-covid-are-back.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107071556-1654530822898-gettyimages-1208505324-20200221viurs_0035__a.jpeg?v=1654530882&w=1920&h=1080", "publishedAt": "2022-06-10T05:16:05Z", "content": "The Covid-19 pandemic has abated in much of the world and, with it, many of the social restrictions implemented to curb its spread, as people have been eager to return to pre-lockdown life.\r\nBut in i… [+7263 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nosheen Iqbal, Ruth Abrahams, Solomon King, Elizabeth Cassin, Phil Maynard, Hannah Devlin", "title": "Sudden infant death syndrome: will parents finally get answers? – podcast - The Guardian", "description": "Sudden infant death syndrome (Sids), also known as cot death, affects 200 families a year in the UK. Hannah Devlin reports on a new study that has raised hopes of an explanation for parents", "url": "https://www.theguardian.com/news/audio/2022/jun/10/sudden-infant-death-syndrome-will-parents-finally-get-answers-podcast", "urlToImage": "https://i.guim.co.uk/img/media/394b05c8abcc7a6415ff846b1e77c0864717780f/0_257_2032_1219/master/2032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=edd7f2a66558332dc9dc600a0bfc7eb9", "publishedAt": "2022-06-10T02:00:09Z", "content": "In 2003, Louise Barrett lost her baby Ellis when he was just four days old. When a baby dies of sudden infant death syndrome (Sids), there is no medical explanation. Although our understanding of the… [+887 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Shiv Sudhakar", "title": "Higher fish consumption associated with increased risk of malignant melanoma in US, study suggests - Fox News", "description": "A recent study indicates that consuming large amounts of tuna and non-fried fish has a chance of leading to a great risk of developing malignant melanoma", "url": "https://www.foxnews.com/health/higher-fish-consumption-risk-malignant-melanoma-study", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/01/iStock-511643765.jpg", "publishedAt": "2022-06-09T23:05:42Z", "content": "A new study warns consuming higher amounts of tuna and non-fried fish appears to be associated with a greater likelihood of malignant melanoma and state 0 melanoma, according to a recent report publi… [+4362 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Does Shingles Increase a Person's Risk of Dementia? - Neuroscience News", "description": "Despite speculation that inflammation associated with the shingles virus can increase dementia risk, researchers found little evidence to substantiate the claim.", "url": "https://neurosciencenews.com/shingles-dementia-20798/", "urlToImage": "https://neurosciencenews.com/files/2022/06/shingles-dementia-neurosicences-publoc.jpg", "publishedAt": "2022-06-09T22:27:31Z", "content": "Summary: Despite speculation that inflammation associated with the shingles virus can increase dementia risk, researchers found little evidence to substantiate the claim.\r\nSource: AAN\r\nShingles, a vi… [+2827 chars]"}, {"source": {"id": null, "name": "Upworthy"}, "author": null, "title": "For years, several doctors told woman her clitoral pain was just a UTI. Then, it ruptured. - Upworthy", "description": "", "url": "https://scoop.upworthy.com", "urlToImage": "https://d34zrgnx1tq8w.cloudfront.net/572720/uploads/c69ec360-e7f5-11ec-bc79-2dd7a9a27357_1200_630.png", "publishedAt": "2022-06-09T22:22:28Z", "content": "A 23-year-old woman recently took to TikTok with yet another chilling example of the devastating effects of doctors dismissing women's pain. Melita Stutsman, who goes by @mjgamesalot on the platform,… [+4886 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "New Genetic Eye Disease Discovered - Neuroscience News", "description": "Researchers have identified a new genetic eye disease that affects the macula.", "url": "https://neurosciencenews.com/eye-disease-genetics-20797/", "urlToImage": "https://neurosciencenews.com/files/2022/06/genetic-eye-disease-neurosicnes-public.jpg", "publishedAt": "2022-06-09T22:07:26Z", "content": "Summary: Researchers have identified a new genetic eye disease that affects the macula.\r\nSource: NIH\r\nResearchers from the National Eye Institute (NEI) have identified a new disease that affects the … [+5145 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Drinking sweetened coffee not only boosts your energy, but your life - Yahoo Entertainment", "description": "The 1995 live-action adaptation of Casper introduced not only a tragic backstory, explaining how the titular friendly ghost died, but also provided a...", "url": "https://www.syfy.com/syfy-wire/study-shows-drinking-sweetened-coffee-reduces-mortality", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/VviMg0CHcnH7j5Qu7.XF_w--~B/aD02ODE7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/syfy_655/a30d720112e80b4ad7e816844d0183b8", "publishedAt": "2022-06-09T21:30:48Z", "content": "The 1995 live-action adaptation of Casper introduced not only a tragic backstory, explaining how the titular friendly ghost died, but also provided a potential mechanism through which he might be res… [+3071 chars]"}, {"source": {"id": null, "name": "Peoplespharmacy.com"}, "author": "undefined", "title": "Show 1304: Fixing Your Foot Problems - The People's Pharmacy", "description": "On our Saturday broadcast, Dr. Jane Andersen will discuss your foot problems and how you can fix them. Call in your question–888-472-3366", "url": "https://www.peoplespharmacy.com/articles/show-1304-fixing-your-foot-problems", "urlToImage": "https://peoplespharmacy.imgix.net/andersen_square.jpg?auto=compress%2Cformat&ixlib=php-3.3.1", "publishedAt": "2022-06-09T21:27:01Z", "content": "In our nationally syndicated radio show this week, we have a guest live in the studio. Podiatrist Jane Andersen will be ready to answer your questions about foot problems and what you can do about th… [+2621 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Angela Epstein", "title": "Are we on the verge of a cure for cancer? This week, scientists announced breakthroughs with vaccine - Daily Mail", "description": "Every day, around a thousand people in the UK are diagnosed with cancer. And although those dealt this blow come from all walks of life, they will be united by one terrifying question: is there a cure?", "url": "https://www.dailymail.co.uk/sciencetech/article-10902055/Are-verge-cure-cancer-week-scientists-announced-breakthroughs-vaccine.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/09/22/58890949-0-image-a-93_1654809735150.jpg", "publishedAt": "2022-06-09T21:24:41Z", "content": "BREAST\r\nThe most common cancer in the UK more than 55,000 people are diagnosed with breast cancer every year.\r\nAround 85 per cent of women diagnosed with it in England survive for five years or more,… [+7341 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Victoria Allen", "title": "First meal of the day should be mid-morning as most have dinner later in the evening, expert says - Daily Mail", "description": "Waiting a few hours for breakfast is better for those who are trying to lose weight, according to Tim Spector, professor of genetic epidemiology at King's College London.", "url": "https://www.dailymail.co.uk/health/article-10902017/First-meal-day-mid-morning-dinner-later-evening-expert-says.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/09/21/58889025-0-image-a-30_1654806793208.jpg", "publishedAt": "2022-06-09T21:00:38Z", "content": "It is bad news for those who wake up ravenous but the best time to have breakfast is 11am.\r\nWaiting a few hours for breakfast is better for those who are trying to lose weight, according to Tim Spect… [+2379 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Brain Changes Linked to Emotion Discovered in Mysterious 'Broken Heart Syndrome' - Neuroscience News", "description": "Takotsubo syndrome, a sudden form of acute heart failure often brought on by emotional or physical stress, is associated with changes in brain regions associated with emotion and emotional processing.", "url": "https://neurosciencenews.com/emotion-broken-heart-syndrome-20793/", "urlToImage": "https://neurosciencenews.com/files/2022/06/emotion-broken-heart-syndrom-neuroscicenc-public.jpg", "publishedAt": "2022-06-09T20:27:19Z", "content": "Summary: Takotsubo syndrome, a sudden form of acute heart failure often brought on by emotional or physical stress, is associated with changes in brain regions associated with emotion and emotional p… [+4622 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Good Bacteria to Tackle Depression - Neuroscience News", "description": "Probiotics can support the effects of antidepressants to help relieve symptoms of depression.", "url": "https://neurosciencenews.com/probiotics-depression-20791/", "urlToImage": "https://neurosciencenews.com/files/2022/06/bacteria-depression-neurosicens-public.jpg", "publishedAt": "2022-06-09T19:28:16Z", "content": "Summary: Probiotics can support the effects of antidepressants to help relieve symptoms of depression.\r\nSource: University of Basel\r\nIntestinal flora plays an important role in health including menta… [+7032 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Social Isolation Is Directly Associated With Later Dementia - Neuroscience News", "description": "Social isolation has been directly linked to structural changes in brain areas associated with memory and cognitive function. Researchers report socially isolated people are 26% more likely to develop dementia later in life.", "url": "https://neurosciencenews.com/social-isolation-dementia-20890/", "urlToImage": "https://neurosciencenews.com/files/2022/06/social-isolation-dementia-neurosicences-public.jpg", "publishedAt": "2022-06-09T19:06:59Z", "content": "Summary: Social isolation has been directly linked to structural changes in brain areas associated with memory and cognitive function. Researchers report socially isolated people are 26% more likely … [+6305 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Want To Reduce Stroke Risk? Researchers Discover Simple Secret - SciTechDaily", "description": "Vacuuming, mopping, walking a pet or playing catch may be enough activity to avoid a stroke, according to a San Diego State University (SDSU) research study. Strokes can be extremely serious. According to the CDC 1 in 6 deaths from cardiovascular disease in 2…", "url": "https://scitechdaily.com/want-to-reduce-stroke-risk-researchers-discover-simple-secret/", "urlToImage": "https://scitechdaily.com/images/Brain-Bleeding-Stroke-Hemorrhage.jpg", "publishedAt": "2022-06-09T18:43:44Z", "content": "Researchers found that doing lighter-intensity daily activities such as household chores can significantly reduce the risk of stroke.\r\nVacuuming, mopping, walking a pet or playing catch may be enough… [+4056 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Nancy Lapid", "title": "Diabetes may increase long COVID risk; COVID while pregnant linked to baby brain development issues - Yahoo! Voices", "description": "Diabetes may increase the risk of long COVID, new analyses of seven previous studies suggest.  Researchers reviewed studies that tracked people for at least ...", "url": "https://news.yahoo.com/diabetes-may-increase-long-covid-183212832.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/5FwT7lZn_gexINR0Qck6Sw--~B/aD01MzA7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/0dbc0189958a7cb49ca8d3b8a94e595e", "publishedAt": "2022-06-09T18:32:12Z", "content": "By Nancy Lapid\r\n(Reuters) - The following is a summary of some recent studies on COVID-19. They include research that warrants further study to corroborate the findings and that has yet to be certifi… [+4284 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Leonie Heilbronn, The Conversation", "title": "Salad Before Carbs? Here's The Science of 'Food Sequencing' And Your Health - ScienceAlert", "description": "Biochemist and author of the Glucose Revolution Jessie Inchauspé says tweaking your diet can change your life.", "url": "https://www.sciencealert.com/salad-before-carbs-here-s-the-science-of-food-sequencing-and-your-health", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/CarrotAvocadoAndCucumberRollsInRicepaper_1024.jpg", "publishedAt": "2022-06-09T18:02:43Z", "content": "Biochemist and author of the Glucose Revolution Jessie Inchauspé says tweaking your diet can change your life.\r\nAmong her recommendations in the mainstream media and on Instagram, the founder of the … [+4698 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New screening test for those at risk of sudden cardiac arrest - Medical Xpress", "description": "New research from the Victor Chang Cardiac Research Institute will allow families around the world to discover if they are carrying genetic mutations that cause sudden cardiac arrest—a condition that kills 9 out of 10 victims.", "url": "https://medicalxpress.com/news/2022-06-screening-sudden-cardiac.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-screening-test-for-1.jpg", "publishedAt": "2022-06-09T18:02:01Z", "content": "New research from the Victor Chang Cardiac Research Institute will allow families around the world to discover if they are carrying genetic mutations that cause sudden cardiac arresta condition that … [+5536 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Patrick Waechter", "title": "Monkeypox Cases Are On The Rise, Particularly In Queer Men. Here's What It's Like To Get The Infection. - BuzzFeed News", "description": "Monkeypox is not a “gay disease,” but experts are concerned about currently rising cases among men who have sex with men. Here's how to avoid infection and what it's like to have monkeypox, including symptoms and pictures of the lesions.", "url": "https://www.buzzfeednews.com/article/patrickwaechter/monkeypox-symptoms-case-pictures", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2022-06/9/19/campaign_images/174b0d96d076/monkeypox-cases-are-on-the-rise-particularly-in-q-2-1974-1654803481-43_dblbig.jpg", "publishedAt": "2022-06-09T17:22:28Z", "content": "Marco, 40, lives with his partner in Edmonton, Alberta. Marcos partner had been feeling off for a couple days a low fever, some fatigue, and a few little bumps on his hands, which he didnt give much … [+9685 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Connor Boyd", "title": "Another 18 British children are struck down with mysterious hepatitis 'of unknown origin' - Daily Mail", "description": "Health officials announced the new cases today, bringing the cumulative UK total to  240 since the first was spotted in January. Cases have been predominantly in children under five.", "url": "https://www.dailymail.co.uk/health/article-10901329/Another-25-British-children-struck-mysterious-hepatitis-unknown-origin.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/09/18/58022291-0-Scientists_are_still_puzzled_about_what_is_causing_the_illness_w-a-24_1654794339325.jpg", "publishedAt": "2022-06-09T17:05:45Z", "content": "Another 18 British children have fallen ill with the mystery hepatitis that has caused a spate of cases around the world.\r\nHealth officials announced the new cases today, bringing the cumulative UK t… [+5159 chars]"}, {"source": {"id": null, "name": "Austin American-Statesman"}, "author": "Fiza Kuzhiyil", "title": "Monkeypox has been spotted in Texas. Here's what you need to know about this disease - Austin American-Statesman", "description": "Flulike symptoms, blisters, rash some of the signs of disease similar to smallpox", "url": "https://www.statesman.com/story/news/2022/06/09/monkeypox-texas-heres-what-you-need-know-health-safety/7558796001/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/06/02/NAUG/7d1c4ede-3be4-4010-8295-51220a79753e-monkeypox-colorized.png?crop=1466,825,x0,y0&width=1466&height=825&format=pjpg&auto=webp", "publishedAt": "2022-06-09T15:37:11Z", "content": "Dallas County on Tuesday reported Texass first monkeypox case this year. The case was identified in a resident who had traveled internationally, according to the Texas Department of State Health Serv… [+5405 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Mia Salas", "title": "I Tried Patrick Schwarzenegger's 'Brain Boost' Protein Bars—Here's What I Thought — Eat This Not That - Eat This, Not That", "description": "Patrick Schwarzenegger and Maria Shriver recently launched protein bars \"made for your brain.\" Here's what our writer thought of the product.", "url": "http://www.eatthis.com/news-patrick-schwarzeneggers-protein-bars-taste-test/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/mosh-protein-bars.jpg?quality=82&strip=all", "publishedAt": "2022-06-09T15:30:42Z", "content": "There are a lot of protein bars on the shelves these days, so it's not easy figuring out which brand is best for you. Some are secretly loaded with sugar, others contain artificial ingredients that o… [+5810 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Mane Kara-Yakoubian", "title": "Early life adversity impacts cognitive function in later adulthood - PsyPost", "description": "New findings suggest that allostatic load mediates the association between early life adversity and global cognition, as well as executive function. This research was published in the scientific journal Psychoneuroendocrinology. ...", "url": "https://www.psypost.org/2022/06/early-life-adversity-impacts-cognitive-function-in-later-adulthood-63306", "urlToImage": "https://www.psypost.org/wp-content/uploads/2021/11/brain.jpg", "publishedAt": "2022-06-09T15:11:45Z", "content": "New findings suggest that allostatic load mediates the association between early life adversity and global cognition, as well as executive function. This research was published in the scientific jour… [+4863 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "What Does a COVID-19 Headache Feel Like? - Verywell Health", "description": "Some patients experience persistent daily headaches after recovering from an acute COVID-19 infection.", "url": "https://www.verywellhealth.com/covid-headache-5324696", "urlToImage": "https://www.verywellhealth.com/thmb/rENv-0RAJgNlTs7tJrIXQy3s__0=/1068x601/filters:fill(87E3EF,1)/headaches-tout-a2f8dca44f2442c5902a4b95b768cc77.jpg", "publishedAt": "2022-06-09T14:20:52Z", "content": "<ul><li>A headache associated with COVID-19 can feel like a tension headache or a migraine.</li><li>Some patients can also experience persistent daily headaches after recovering from an acute COVID-1… [+4359 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Kayla Garritano", "title": "The Worst Cheeses for Cholesterol, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "If you're running the risk of high cholesterol, it might be time to put down the cheese. Well, maybe certain types for the time being.", "url": "http://www.eatthis.com/worst-cheeses-cholesterol/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/different-types-cheese.jpg?quality=82&strip=all", "publishedAt": "2022-06-09T14:02:35Z", "content": "Did you ever go to your primary doctor to have them tell you your cholesterol is too high? You're not alone. In the United States, nearly 94 million adults ages 20 or older have total cholesterol lev… [+2497 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Kayla Garritano", "title": "6 Foods Proven To Slow the Aging Process at Any Age, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "Aging is inevitable, but there are ways that you can slow down its process. Our dietitians tell you foods that can help take back some years.", "url": "http://www.eatthis.com/foods-slow-aging/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/Foods-to-Slow-Aging.jpg?quality=82&strip=all", "publishedAt": "2022-06-09T13:40:31Z", "content": "As your numerical age climbs the ladder, you want to do anything to keep your mental, emotional, and physical ages lowered. Although you're technically getting older, there are ways you can help your… [+4158 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "Mosquito Repelling Plants Are a Lie - Lifehacker", "description": "No, you can't keep mosquitoes away from your porch just by planting lavender.", "url": "https://lifehacker.com/mosquito-repelling-plants-are-a-lie-1849036607", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8f5a675f860aba22368ede2976dbcc75.jpg", "publishedAt": "2022-06-09T13:30:00Z", "content": "You really cant go anywhere on the internet without running into lists of the 17 or 25 best mosquito repelling plants, or mosquito repelling plants that are good in the shade, or that are nontoxic to… [+3474 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The #1 Best Food That Lowers Your Risk of a Fatty Liver, New Research Finds — Eat This Not That - Eat This, Not That", "description": "New research shows that participants who regularly ate this food had a lower chance of developing nonalcoholic fatty liver disease.", "url": "http://www.eatthis.com/news-best-food-lower-risk-fatty-liver/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/04/making-oatmeal.jpg?quality=82&strip=all", "publishedAt": "2022-06-09T12:32:40Z", "content": "If you want to keep your liver in great working condition, which is an important factor when it comes to living a long and healthy life, then you may want to adopt a certain diet and incorporate a sp… [+1698 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Julia Ranney", "title": "What is Cushing's disease? Experts warn of 'rare but serious' condition - Yahoo Life", "description": "Experts explain what you need to know about Cushing's disease, a hormonal disorder that causes weight gain, depression and fatigue.", "url": "https://www.yahoo.com/lifestyle/what-is-cushings-disease-experts-warn-rare-serious-condition-120015725.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7T.F8O.mUd__vYZc0.hZvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2022-04/77db58f0-c960-11ec-bd7f-51d20bde5b11", "publishedAt": "2022-06-09T12:00:15Z", "content": "A rapid heartbeat is a common symptom of Cushing's disease. (Photo via Getty Images)\r\nThis article is for informational purposes only and is not a substitute for professional medical advice, diagnosi… [+5622 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dani Blum", "title": "Walking May Prevent New Knee Pain for Some, Study Suggests - The New York Times", "description": "Encouraging new research suggests walking could help prevent new bouts of knee pain in people with osteoarthritis.", "url": "https://www.nytimes.com/2022/06/08/well/move/walking-knee-pain-relief.html", "urlToImage": "https://static01.nyt.com/images/2022/06/08/well/08WELL-WALKING-IS-GOOD-FOR-KNEES/08WELL-WALKING-IS-GOOD-FOR-KNEES-facebookJumbo.jpg", "publishedAt": "2022-06-08T19:18:11Z", "content": "Instead, they may be able to turn to exercise. For decades, health experts saw walking primarily as a way to boost cardiovascular health, said Dr. Elaine Husni, a rheumatologist at Cleveland Clinic w… [+1850 chars]"}]}