{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger", "title": "Monkeypox outbreak reaches 257 confirmed cases worldwide, WHO says - CNN", "description": "The World Health Organization has received reports of 257 confirmed monkeypox cases and about 120 suspected cases in 23 nations where the virus is not endemic as of Thursday, it said in a Sunday update.", "url": "https://www.cnn.com/2022/05/29/health/monkeypox-outbreak-worldwide-cases/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220529191557-monkeypox-microscope-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-30T00:07:00Z", "content": "The World Health Organization has received reports of 257 confirmed monkeypox cases and about 120 suspected cases in 23 nations where the virus is not endemic as of Thursday, it said in a Sunday upda… [+2276 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Andrew Adams, KSL-TV", "title": "Logan homeowner concerned about avian flu risk after finding dead turkey vultures - KSL.com", "description": "Bruce Jorgensen said he was already aware of an avian flu outbreak when he found two of the birds dead on his property last week. He said testing subsequently determined the deceased turkey vultures had the disease.", "url": "https://www.ksl.com/article/50413526/-logan-homeowner-concerned-about-avian-flu-risk-after-finding-dead-turkey-vultures", "urlToImage": "https://img.ksl.com/slc/2878/287859/28785989.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-05-29T19:15:40Z", "content": "Estimated read time: 2-3 minutes\r\nLOGAN A Cache County homeowner hoping a solution will emerge over a potential avian flu hazard in his backyard as he cautions others about the potential risk.\r\nBruce… [+2670 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Study finds a bidirectional relationship between children's hyperactivity and harsh parenting - PsyPost", "description": "What came first: harsh parenting techniques or conduct problems in children? This can seem like a chicken and egg problem. A new study published in Child Development finds that there is a reciprocal relationship between parenting style and child behaviors, su…", "url": "https://www.psypost.org/2022/05/study-finds-a-bidirectional-relationship-between-childrens-hyperactivity-and-harsh-parenting-63234", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/05/angry-father-yelling-at-and-scolding-son.jpg", "publishedAt": "2022-05-29T18:08:09Z", "content": "What came first: harsh parenting techniques or conduct problems in children? This can seem like a chicken and egg problem. A new study published in Child Development finds that there is a reciprocal … [+3516 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "CDC Raises Travel Alert for Monkeypox - The Epoch Times", "description": "The Centers for Disease Control and Prevention (CDC) recently revised its travel advisory from Level 1 to Level ...", "url": "https://www.theepochtimes.com/cdc-raises-travel-alert-for-monkeypox_4498496.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/05/20/Monkeypox-1200x790.jpg", "publishedAt": "2022-05-29T16:43:59Z", "content": "The Centers for Disease Control and Prevention (CDC) recently revised its travel advisory from Level 1 to Level 2 due to the recent monkeypox outbreak around the world.\r\nAn update posted to the agenc… [+2408 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Reverse Engineering” Brain Tissue Reveals Sugar-Studded Protein Linked to Alzheimer's Disease - SciTechDaily", "description": "In a bit of “reverse engineering” research using brain tissues from five people who died with Alzheimer’s disease, Johns Hopkins Medicine researchers say they have discovered that a special sugar molecule could play an important role in the development of Alz…", "url": "https://scitechdaily.com/reverse-engineering-brain-tissue-reveals-sugar-studded-protein-linked-to-alzheimers-disease/", "urlToImage": "https://scitechdaily.com/images/Alzheimers-Dementia-Brain-Disease-Concept.jpg", "publishedAt": "2022-05-29T15:32:26Z", "content": "ByJohns Hopkins MedicineMay 29, 2022\r\nA special sugar molecule has been discovered by Johns Hopkins Medicine researchers that could play a key role in the development of Alzheimers disease.\r\nIn a bit… [+5774 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "The #1 Best Fruit For a Sharper Brain, New Research Says — Eat This Not That - Eat This, Not That", "description": "According to a new study from Frontiers in Nutrition, you can boost your brain health with this type of popular fruit.", "url": "http://www.eatthis.com/the-1-best-fruit-for-a-sharper-brain-new-research-says/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/04/Fruit-Jar.jpg?quality=82&strip=all", "publishedAt": "2022-05-29T15:00:52Z", "content": "You probably know that the foods you eat can have an impact on your brain over time. In fact, some foods can actually impair your memory and increase your risk of neurodegenerative disorders, while o… [+2752 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Hilary Achauer", "title": "What happened when I zapped my brain to assess my cognitive health. - Slate", "description": "I wondered: Should I mess with a brain that, while not perfect, functions reasonably well?", "url": "https://slate.com/technology/2022/05/does-transcranial-magnetic-stimulation-work.html", "urlToImage": "https://compote.slate.com/images/ae320266-ef04-42a6-9585-7f08ea9911c1.jpeg?width=780&height=520&rect=1560x1040&offset=0x0", "publishedAt": "2022-05-29T14:00:00Z", "content": "I sat in a dark room, eyes closed, with a device strapped to my head that looked like a futuristic bike helmet. For 10 minutes, while I concentrated on not accidentally opening my eyes, the prongs st… [+12630 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Rachel Nuwer", "title": "A Balm for Psyches Scarred by War - The New York Times", "description": "MDMA-assisted treatment for post-traumatic stress disorder “represents real hope for long-term healing,” health experts say.", "url": "https://www.nytimes.com/2022/05/29/health/mdma-therapy-ptsd.html", "urlToImage": "https://static01.nyt.com/images/2022/05/31/science/00SCI-MDMA-promo/00SCI-MDMA-promo-facebookJumbo.jpg", "publishedAt": "2022-05-29T13:55:26Z", "content": "Two months into his deployment, Mr. McCourry was caught in a firefight. Amid a hail of bullets and mortar rounds, he spotted a white truck approaching from the opposite direction. Despite signaling t… [+2320 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Jeff Csatari", "title": "The Worst Drinking Habits for Arthritis Symptoms, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "If you suffer from arthritis symptoms like pain and inflammation, here's how your drinking habits could be impacting your joints.", "url": "http://www.eatthis.com/worst-drinking-habits-arthritis-symptoms/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/04/men-drinking-beer-bar.jpg?quality=82&strip=all", "publishedAt": "2022-05-29T12:13:57Z", "content": "If you suffer from sore, inflamed, arthritic joints (knees, hips, hands, you name it), you probably have read that a glass of wine or a margarita might be just what the doctor ordered to ease your pa… [+3571 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Lauren Gray", "title": "Taking This Medication Can Raise Your Dementia Risk — Best Life - Best Life", "description": "The anti-anxiety medication benzodiazepine is linked with dementia risk, a new report warns—and even short term use could pose a threat.", "url": "http://bestlifeonline.com/benzodiazepine-dementia-risk-news/", "urlToImage": "https://bestlifeonline.com/wp-content/uploads/sites/3/2021/10/woman-standing-up-dizzy-headache-dementia-risk.jpg?quality=82&strip=all", "publishedAt": "2022-05-29T11:04:25Z", "content": "Your risk of developing dementia is determined by a wide range of factorssome of which you can control, and others you can't. Your family history, for instance, is simply the luck of the draw, and mu… [+3824 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Gora", "title": "Coconut milk: nutrition facts and health benefits - Livescience.com", "description": "A complete guide to coconut milk nutrition and how this plant-based drink stacks up against other milk alternatives", "url": "https://www.livescience.com/coconut-milk-nutrition", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rhVRzqv6V5vKff8hTqVFof-1200-80.jpg", "publishedAt": "2022-05-29T11:00:39Z", "content": "Due to its distinctive flavor and creamy texture, coconut milk can add a nice twist to coffees, protein shakes and desserts. Although it’s nowhere near as popular as other plant-based milk alternativ… [+6565 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Monkeypox outbreaks: A list of countries that recorded cases recently. Will it be like COVID-19 pandemic? - WION", "description": "As per a recent statement released on May 20, WHO stated that there are about 80 confirmed monkeypox cases so far, and 50 pending investigations. It also added that more cases are likely to be reported as surveillance expands. \r\n\r\nHere's the list of countries…", "url": "https://www.wionews.com/photos/monkeypox-outbreaks-list-of-countries-where-cases-found-recently-will-it-be-like-covid-19-pandemic-480924", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2022/05/28/265813-monkeypox-12.jpg", "publishedAt": "2022-05-29T10:34:01Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Eric Berger", "title": "As the pandemic ebbs, long-haul Covid still drains patients and confounds doctors - The Guardian", "description": "Researchers still don’t know precisely how many get long Covid, what causes it or how best to treat it", "url": "https://amp.theguardian.com/world/2022/may/29/long-covid-causes-how-many-treatment", "urlToImage": null, "publishedAt": "2022-05-29T09:01:00Z", "content": "CoronavirusResearchers still dont know precisely how many get long Covid, what causes it or how best to treat it\r\nSun 29 May 2022 10.00 BST\r\nEmily Caffee, a physical therapist and lifelong athlete, c… [+7257 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Emily Anthes", "title": "Can I Stop Isolating If I’m Still Testing Positive for the Virus? - The New York Times", "description": "Some people may test positive for the coronavirus for 10 days or longer, but interpreting those results remains difficult, experts said.", "url": "https://www.nytimes.com/2022/05/29/health/coronavirus-testing-positive.html", "urlToImage": "https://static01.nyt.com/images/2022/05/27/science/27virus-testing1/27virus-testing1-facebookJumbo.jpg", "publishedAt": "2022-05-29T07:00:09Z", "content": "Tests also differ in their sensitivity, and people differ in how they perform them. Some people do a swab test and its like they barely touch their nose, Dr. Gordon said. Whereas with other individua… [+1771 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "A new research suggests HIV drug could combat middle-aged memory loss - Interesting Engineering", "description": "A team of researchers from the University of California, Los Angeles, have discovered a critical molecular mechanism behind memory linking and found a way to restore this brain function in middle-aged mice through an FDA-approved HIV drug.", "url": "https://interestingengineering.com/hiv-drug-middle-aged-memory-loss", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/V0OyABW4OQ/sizes/istock-1215350205_md.jpg", "publishedAt": "2022-05-29T00:40:00Z", "content": "Do you ever find yourself heading to the fridge only to forget why you went there in the first place? That's a common occurrence as we age and our memory worsens.\r\nNow, there could be a new treatment… [+2951 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Link Between Exercise Intensity and Risk of Infection - Neuroscience News", "description": "Researchers identify the exertion level where aerosol particle emission increases exponentially, offering an explanation as to why exercise intensity may be linked to the transmission of infections.", "url": "https://neurosciencenews.com/exercise-intensity-infection-20686/", "urlToImage": "https://neurosciencenews.com/files/2022/05/exercise-infection-neurosicences-public.jpg", "publishedAt": "2022-05-29T00:28:09Z", "content": "Summary: Researchers identify the exertion level where aerosol particle emission increases exponentially, offering an explanation as to why exercise intensity may be linked to the transmission of inf… [+6817 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "In Long COVID, Blood Markers Are Linked to Neuropsychiatric Symptoms - Neuroscience News", "description": "Researchers have identified elevated levels of a biomarker in the blood that persists for months in long COVID patients who experience neuropsychiatric symptoms.", "url": "https://neurosciencenews.com/long-covid-psychology-20684/", "urlToImage": "https://neurosciencenews.com/files/2022/05/long-covid-neuropsychology-neurosicences-public.jpg", "publishedAt": "2022-05-28T22:34:59Z", "content": "Summary: Researchers have identified elevated levels of a biomarker in the blood that persists for months in long COVID patients who experience neuropsychiatric symptoms.\r\nSource: UCSF\r\nIn a new stud… [+8205 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Boosting Brain Function in Later Life Through Singing - Neuroscience News", "description": "Singing in a social group such as a choir may help protect cognitive function and treat aphasia in older adults.", "url": "https://neurosciencenews.com/singing-aging-brain-20682/", "urlToImage": "https://neurosciencenews.com/files/2022/05/aging-singing-brain-neurosicensc-1-2.jpg", "publishedAt": "2022-05-28T21:35:34Z", "content": "Summary: Singing in a social group such as a choir may help protect cognitive function and treat aphasia in older adults.\r\nSource: Horizon\r\nAsk anyone in a choir why they enjoy it, and they will tell… [+8246 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Latest US Data Shows Vaccine Injuries Skyrocketed; How Will We Recover? - The Epoch Times", "description": "At present, the adverse events brought about by the COVID-19 vaccines are getting more and more attention from ...", "url": "https://www.theepochtimes.com/vaers-autophagy_4497753.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/05/23/shutterstock_735742660-1200x734.jpg", "publishedAt": "2022-05-28T21:03:24Z", "content": "At present, the adverse events brought about by the COVID-19 vaccines are getting more and more attention from the public. If vaccination causes injury or damage, how can the body heal itself?\r\nJulia… [+12083 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Pat Hagan", "title": "Holiday How to avoid the deadly legionnaire's bug - Daily Mail", "description": "Scientists have found that up to two-thirds of hotels in destinations including Greece, the Canary Islands and Morocco risk spreading the infection - called legionella, or legionnaires' disease.", "url": "https://www.dailymail.co.uk/health/article-10863653/Holiday-avoid-deadly-legionnaires-bug.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/28/17/58400185-0-image-a-7_1653757086546.jpg", "publishedAt": "2022-05-28T21:00:46Z", "content": "Popular holiday resorts could be putting Britons at risk of a serious bacterial infection that can lead to life-threatening pneumonia, a series of new studies have revealed.\r\nScientists have found th… [+4546 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Biologists May Have Solved a 30-Year-Old Mystery on Why Touch Stresses Plants Out - ScienceAlert", "description": "Scientists have long known that touching plants can set off a stress reaction in them – but until now it hasn't been exactly clear how that worked at a molecular level, something that a new study hopes to shed light on.", "url": "https://www.sciencealert.com/study-shows-exactly-how-touch-can-stress-plants-out", "urlToImage": "https://www.sciencealert.com/images/2022-05/processed/PlantInSoil_1024.jpg", "publishedAt": "2022-05-28T20:02:34Z", "content": "Scientists have long known that touching plants can set off a stress reaction in them but until now it hasn't been exactly clear how that worked at a molecular level, something that a new study hopes… [+3046 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "Eating At This Time of Day May Be Aging You Faster, New Study Says — Eat This Not That - Eat This, Not That", "description": "A new study has shown that the times in which you eat your meals may be just as important as the food you eat.", "url": "http://www.eatthis.com/news-meal-time-aging-faster/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/04/Snacking-Clock.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T20:00:25Z", "content": "When life gets busy, it can be difficult to stick to a strict schedule which means that you may end up eating whenever you happen to get a few free minutes. You might even delay your meals until the … [+2319 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sophie Reardon", "title": "650 cases of severe hepatitis in children reported in the past 2 months, WHO reports - CBS News", "description": "The cases, which have so far puzzled health officials, have been reported in 33 different countries since early April.", "url": "https://www.cbsnews.com/news/severe-acute-hepatitis-children-world-health-organization/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2020/04/28/f022d495-c3d8-416c-a0ac-cdcd94110086/thumbnail/1200x630/568ac98356834b2cf7a55e7914832f6a/GettyImages-1210872967.jpg", "publishedAt": "2022-05-28T18:30:53Z", "content": "At least 650 children have been diagnosed with a mysterious and severe hepatitis infection since early April, according to the World Health Organization. The cases, which have so far puzzled health o… [+2447 chars]"}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "Israel reports second case of monkeypox, in 30-year-old man - The Times of Israel", "description": "Around 200 cases have been diagnosed globally since May 7; WHO unsure if outbreak has reached 'peak of the iceberg' but says spread containable", "url": "https://www.timesofisrael.com/israel-reports-second-case-of-monkeypox-in-30-year-old-man/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2022/05/iStock-1398150624-e1653260412289-1024x640.jpg", "publishedAt": "2022-05-28T18:12:00Z", "content": "Israel has confirmed a second case of the rare monkeypox virus, in a 30-year-old man who recently returned from an overseas trip.\r\nThe man was hospitalized on Friday at the Sheba Medical Center in Te… [+2449 chars]"}, {"source": {"id": null, "name": "Boston.com"}, "author": null, "title": "A local epidemiologist says we shouldn’t ‘wait and see’ with monkeypox - Boston.com", "description": "Dr. Michael Mina says inaction didn’t work for COVID-19 — and it won’t work for monkeypox. Read more at Boston.com.", "url": "https://www.boston.com/news/health/2022/05/28/a-local-epidemiologist-says-we-shouldnt-wait-and-see-with-monkeypox/", "urlToImage": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png", "publishedAt": "2022-05-28T18:10:00Z", "content": "Skip to Main Content"}, {"source": {"id": null, "name": "New York Post"}, "author": "Rich Calder", "title": "New monkeypox case suspected in Colorado - New York Post ", "description": "The Colorado Department of Public Health and Environment said Friday that the new case involves a “young adult male who sought care in the Denver area and is improving and isolating at home.”", "url": "https://nypost.com/2022/05/28/new-monkey-pox-case-suspected-in-colorado/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/05/monkey-pox-getty-01.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-05-28T17:27:00Z", "content": "The number of reported monkeypox cases in the United States is now up to 12 as a second presumptive case has been identified in Colorado.\r\nThe Colorado Department of Public Health and Environment sai… [+1175 chars]"}, {"source": {"id": null, "name": "nj.com"}, "author": "Deion Johnson | NJ Advance Media for NJ.com", "title": "N.J. reports 4,053 new cases, 15 COVID deaths. Cases remain consistent as Memorial Day Weekend is underway. - NJ.com", "description": "New Jersey's seven-day average for confirmed cases was 3,731 on Saturday, down 6% from a week ago and up 86% from a month ago", "url": "https://www.nj.com/coronavirus/2022/05/nj-reports-4053-new-cases-15-covid-deaths-cases-remain-consistent-as-memorial-day-weekend-is-underway.html", "urlToImage": "https://www.nj.com/resizer/Q3PocnNs-VxC1Hph_ILyMm7hTVY=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/IXFGYKC2FJF27JTWQG3XHJEW4Q.jpg", "publishedAt": "2022-05-28T16:29:00Z", "content": "New Jersey on Saturday reported 4,053 COVID-19 confirmed positive tests and 15 deaths as cases have leveled off at the start of the holiday weekend.\r\nThe states seven-day average for confirmed cases … [+5378 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Erin Yarnall", "title": "One Major Effect of Drinking Tomato Juice, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "Thanks to its rich source of lycopene—a powerful antioxidant—drinking tomato juice has been shown to have this effect.", "url": "http://www.eatthis.com/major-effect-drinking-tomato-juice/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/tomato-juice.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T13:13:29Z", "content": "Tomato juice can save a tomato soup recipe from being just average soup. It can save your beverage choice from being bland, and it can also save your life, as one of the nutrients in found tomato jui… [+2565 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Ferozan Mast", "title": "If You Have This Blood Type, You May Be More Stressed — Eat This Not That - Eat This, Not That", "description": "Wile your blood type may put you at a higher risk for certain conditions, nothing is definitive. Read on to ensure your health.", "url": "http://www.eatthis.com/news-this-blood-type-may-be-more-stressed/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/12/stressed-woman-e1649891683134.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T12:03:56Z", "content": "How important is blood type to your overall health? While many aspects of health and wellness are within our control, blood type isn'tso knowing the health conditions associated with our blood type c… [+4480 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lou Mudge", "title": "Keto diet for beginners: Meal ideas, safety & expert tips - Livescience.com", "description": "New to keto? Our guide to the keto diet for beginners will help you to get started", "url": "https://www.livescience.com/keto-diet-for-beginners", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BGW4E2HKxv87NYJDV3j6s8-1200-80.jpg", "publishedAt": "2022-05-28T12:00:59Z", "content": "Originally designed to treat medication-resistant epilepsy in children, the ketogenic diet has become popular in recent years due to evidence that it can help with weight loss. Whatever the reason yo… [+6524 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The #1 Worst Drinking Habit for Your Heart, Suggests New Study — Eat This Not That - Eat This, Not That", "description": "A new study suggests that even a moderate amount of alcohol consumed can be dangerous to your heart's health.", "url": "http://www.eatthis.com/the-1-worst-drinking-habit-for-your-heart-suggests-new-study/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/draft-beer-size-1.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T12:00:47Z", "content": "While you might enjoy having a few beers while hanging out with friends or a couple of glasses of wine to unwind at the end of the day, you might also do your best to limit how much alcohol you drink… [+1988 chars]"}, {"source": {"id": null, "name": "Vox"}, "author": "Kelsey Piper", "title": "Stop scolding people for worrying about monkeypox - Vox.com", "description": "The obsession with managing public opinion gets in the way of managing public health.", "url": "https://www.vox.com/future-perfect/23140258/monkeypox-pandemic-covid-public-health", "urlToImage": "https://cdn.vox-cdn.com/thumbor/dnAYHTBwW-JmgrnuW9L2pUvvaMM=/0x275:3840x2285/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23590546/1144024287.jpg", "publishedAt": "2022-05-28T11:30:00Z", "content": "In the past few weeks, more than 350 cases of monkeypox a viral disease thats a much milder cousin of smallpox have been reported in more than 20 countries worldwide. Thats a surprise, and an unpleas… [+12557 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Ferozan Mast", "title": "Ways to Not Look Older After 50, Say Experts — Eat This Not That - Eat This, Not That", "description": "50 is by no means old—but it’s certainly the right time to start being proactive about looking your best as you age.", "url": "http://www.eatthis.com/news-ways-to-not-look-older-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/woman-good-posture-yoga-e1653445872830.jpg?quality=82&strip=all", "publishedAt": "2022-05-28T11:15:42Z", "content": "Fifty is by no means oldbut it's certainly the right time to start being proactive about looking your best as you age. Certain lifestyle factors and daily habits can take years off your appearance an… [+3581 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Monkeypox outbreak could be just ‘the peak of the iceberg’, WHO warns - The Guardian", "description": "Pandemic preparedness chief Sylvie Briand says ‘unusual’ spread of virus can be easily contained with the right measures", "url": "https://amp.theguardian.com/world/2022/may/28/monkeypox-outbreak-could-be-just-the-peak-of-the-iceberg-who-warns", "urlToImage": "https://i.guim.co.uk/img/media/fd76b3f2d94f1b540a096f809587e51e43f6281b/0_48_4174_2505/master/4174.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=54e9d17c2e80669d3c1a55aa32d95489", "publishedAt": "2022-05-28T03:31:00Z", "content": "The World Health Organization has warned that 200 monkeypox cases found in recent weeks outside countries where the virus usually circulates could be just the beginning.\r\nWe dont know if we are just … [+2710 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Mark Hay", "title": "Monkeypox Is Here and COVID Truthers Are Losing It - The Daily Beast", "description": "Hundreds of cases and chatter about vaccines has sent conspiracy theorists into a full-on meltdown.", "url": "https://www.thedailybeast.com/monkeypox-is-here-and-covid-truthers-are-losing-it", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1653683577/052722-hay-monkeypox-hero_tdlcbr", "publishedAt": "2022-05-28T02:42:28Z", "content": "Public health experts and most mainstream media outlets havespent much of the last week or two assuring people that monkeypox is not the new COVID-19.\r\nSure, the global outbreak of a couple hundred c… [+14558 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Where Monkeypox Is Spreading In The U.S. And Around the World - NBC News", "description": "Hundreds of cases of monkeypox have been reported around the world with the virus reaching eight U.S. states. NBC News’ Isa Gutiérrez has the details on what...", "url": "https://www.youtube.com/watch?v=cb8DcAgMPYE", "urlToImage": "https://i.ytimg.com/vi/cb8DcAgMPYE/maxresdefault.jpg", "publishedAt": "2022-05-28T02:30:06Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vitamin B12 deficiency: Signs of 'neurologic damage' caused by low vitamin B12 in the body - Times of India", "description": "Vitamin B12 is one of the most essential nutrients that your body requires. It is a water-soluble vitamin that is present in many foods and is also available in the form of supplements.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vitamin-b12-deficiency-signs-of-neurologic-damage-caused-by-low-vitamin-b12-in-the-body/photostory/91694159.cms", "urlToImage": "https://static.toiimg.com/photo/91694169.cms", "publishedAt": "2022-05-27T04:40:00Z", "content": "Ideally, dietary supplements are for people who suffer from some kind of deficiency, which cannot be fulfilled by the food they eat. From age, stress to unhealthy eating habits, the reasons can be wi… [+292 chars]"}]}