{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Eating a diet rich in protein and iron can prevent hair loss in men, expert says - Daily Mail", "description": "Dr Susan Massick, a dermatologist at Ohio State University, urged men to act as soon as their hairline starts to recede in order to slow hair loss.", "url": "https://www.dailymail.co.uk/health/article-11193793/Eating-diet-rich-protein-iron-prevent-hair-loss-men-expert-says.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/08/16/62206995-0-image-a-3_1662649506739.jpg", "publishedAt": "2022-09-08T15:47:54Z", "content": "Eating a diet rich in protein and iron while avoiding shampoos that contain potentially hair-damaging chemicals can help men avoid hair loss, experts say.\r\nMassick (pictured) said that hair loss ofte… [+6052 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'World-changing' malaria vaccine developed – BBC News - BBC News", "description": "A malaria vaccine with “world-changing” potential has been developed by UK scientists.The team at the University of Oxford expect it to be rolled out next ye...", "url": "https://www.youtube.com/watch?v=bHATMZF6AFc", "urlToImage": "https://i.ytimg.com/vi/bHATMZF6AFc/maxresdefault.jpg", "publishedAt": "2022-09-08T14:27:40Z", "content": null}, {"source": {"id": null, "name": "CNBC"}, "author": "Renée Onque", "title": "6 exercises that keep your brain active and help reduce the risk of dementia - CNBC", "description": "Physical exercise may help reduce your risk for the onset of dementia. Here are some exercises to consider from a neurologist and a fitness trainer.", "url": "https://www.cnbc.com/2022/09/08/6-exercises-to-keep-your-brain-active-and-reduce-the-risk-of-dementia.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107094681-1658932893780-gettyimages-135537861-bld090074.jpeg?v=1662574618&w=1920&h=1080", "publishedAt": "2022-09-08T13:55:37Z", "content": "Physical exercise may be helpful in lowering the risk of the onset of dementia, and experts say the best time to start adding them to your routine is now.\r\nHealth information of over 500,000 people, … [+3326 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Three Amazing Caffeine Alternatives for Quick, Clean Energy – And the Science Behind Them - SciTechDaily", "description": "If you're anything like the vast majority of Americans, you've probably consumed caffeine nearly every day of your adult life. The question is, do you do it because you like it, or because you need it? In a March 2022 survey carried out by the International F…", "url": "https://scitechdaily.com/three-amazing-caffeine-alternatives-for-quick-clean-energy-and-the-science-behind-them/", "urlToImage": "https://scitechdaily.com/images/Man-Energy-Boost-Illustration.jpg", "publishedAt": "2022-09-08T12:43:30Z", "content": "If youre anything like the vast majority of Americans, youve probably consumed caffeine nearly every day of your adult life.\r\nThe question is, do you do it because you like it, or because you need it… [+8534 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Schizophrenia and Bipolar Disorder May Be Detectable Years Before Illnesses Begin - Neuroscience News", "description": "Researchers report bipolar depression and schizophrenia may be detectable several years before symptoms appear. A new study reports 50% of patients diagnosed with schizophrenia or bipolar disorder attended specialist child and adolescent mental health service…", "url": "https://neurosciencenews.com/schizophrenia-bipolar-detection-21375/", "urlToImage": "https://neurosciencenews.com/files/2022/09/bipolar-schizophrenia-neurosicces-public.jpg", "publishedAt": "2022-09-08T10:48:41Z", "content": "Summary: Researchers report bipolar depression and schizophrenia may be detectable several years before symptoms appear. A new study reports 50% of patients diagnosed with schizophrenia or bipolar di… [+3770 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jillian Wilson", "title": "Nordic Walking Can Improve Your Heart Function. Here's How It Works. - HuffPost", "description": "A recent study found people with coronary artery disease saw improved health outcomes after committing to the workout for 12 weeks.", "url": "https://www.huffpost.com/entry/nordic-walking-poles-benefits_l_6318bfb7e4b0eac9f4d29872", "urlToImage": "https://img.huffingtonpost.com/asset/6318ff6a2400003500102fbb.jpeg?cache=2PcoxCgvce&ops=1200_630", "publishedAt": "2022-09-08T09:45:13Z", "content": "You can up your walking game and help your heart health by adding Nordic poles to your workout.\r\nIts widely known that walking is great for you. Research shows that walking can cut your risk of heart… [+5465 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientific Breakthrough Against COVID-19: Antibodies Identified That May Make Coronavirus Vaccines Unnecessary - SciTechDaily", "description": "Tel Aviv University scientists have isolated two antibodies that neutralize all known strains of COVID-19 – including Omicron – with up to 95% efficiency. The researchers: Targeted treatment with antibodies and their delivery to the body in high concentration…", "url": "https://scitechdaily.com/scientific-breakthrough-against-covid-19-antibodies-identified-that-may-make-coronavirus-vaccines-unnecessary/", "urlToImage": "https://scitechdaily.com/images/Beating-COVID-19-Coronavirus.jpg", "publishedAt": "2022-09-08T09:32:44Z", "content": "The researchers: Targeted treatment with antibodies and their delivery to the body in high concentrations may serve as an effective substitute for vaccines, especially for at-risk populations such as… [+3518 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Fiona MacDonald", "title": "Cancers in Adults Under 50 Have Increased Dramatically Around The Globe - ScienceAlert", "description": "Cancer has long been part of the human story.", "url": "https://www.sciencealert.com/cancers-in-adults-under-50-have-increased-dramatically-around-the-globe", "urlToImage": "https://www.sciencealert.com/images/2022/09/WomanFeelingGlands.jpg", "publishedAt": "2022-09-08T07:37:18Z", "content": "Cancer has long been part of the human story. But a new review has shown that, recently, something has shifted.\r\nSince 1990, the number of adults under the age of 50 developing cancer has increased d… [+5177 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Risk of BA.5 Infection among Persons Exposed to Previous SARS-CoV-2 Variants | NEJM - nejm.org", "description": "Correspondence from The New England Journal of Medicine — Risk of BA.5 Infection among Persons Exposed to Previous SARS-CoV-2 Variants", "url": "https://www.nejm.org/doi/full/10.1056/NEJMc2209479", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/2022/nejm_2022.387.issue-10/nejmc2209479/20220906/images/img_medium/nejmc2209479_f1.jpeg", "publishedAt": "2022-09-08T03:03:38Z", "content": "In recent months, omicron (B.1.1.529) became the dominant variant of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), displaying some degree of immune evasion.1 The initial omicron subva… [+6132 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Manuka honey could help to clear deadly drug-resistant lung infection, research suggests - Phys.org", "description": "A potential new treatment combining natural manuka honey with a widely used drug has been developed by scientists at Aston University to treat a potentially lethal lung infection and greatly reduce side effects of one of the current drugs used for its treatme…", "url": "https://phys.org/news/2022-09-manuka-honey-deadly-drug-resistant-lung.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/manuka-honey.jpg", "publishedAt": "2022-09-07T23:50:33Z", "content": "A potential new treatment combining natural manuka honey with a widely used drug has been developed by scientists at Aston University to treat a potentially lethal lung infection and greatly reduce s… [+5889 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Artificial sweeteners and risk of cardiovascular diseases: results from the prospective NutriNet-Santé cohort - The BMJ", "description": "Objectives To study the associations between artificial sweeteners from all dietary sources (beverages, but also table top sweeteners, dairy products, etc), overall and by molecule (aspartame, acesulfame potassium, and sucralose), and risk of cardiovascular d…", "url": "https://www.bmj.com/content/378/bmj-2022-071204", "urlToImage": "", "publishedAt": "2022-09-07T23:34:03Z", "content": "Abstract\r\nObjectives To study the associations between artificial sweeteners from all dietary sources (beverages, but also table top sweeteners, dairy products, etc), overall and by molecule (asparta… [+6999 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Prevention of covid-19 and other acute respiratory infections with cod liver oil supplementation, a low dose vitamin D supplement: quadruple blinded, randomised placebo controlled trial - The BMJ", "description": "Objective To determine if daily supplementation with cod liver oil, a low dose vitamin D supplement, in winter, prevents SARS-CoV-2 infection, serious covid-19, or other acute respiratory infections in adults in Norway.\n\nDesign Quadruple blinded, randomised p…", "url": "https://www.bmj.com/content/378/bmj-2022-071245", "urlToImage": "", "publishedAt": "2022-09-07T22:52:55Z", "content": "Abstract\r\nObjective To determine if daily supplementation with cod liver oil, a low dose vitamin D supplement, in winter, prevents SARS-CoV-2 infection, serious covid-19, or other acute respiratory i… [+9899 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Amanda Seitz", "title": "Monkeypox cases dropping, but racial disparities growing - The Associated Press", "description": "WASHINGTON (AP) — The White House said Wednesday it's optimistic about a decline in monkeypox cases and an uptick in vaccinations against the infectious virus, despite worsening racial disparities in reported cases .", "url": "https://apnews.com/article/monkeypox-health-government-and-politics-7343de5ab515b9f09a5862ca284b6ea2", "urlToImage": "https://storage.googleapis.com/afs-prod/media/cf80f36dfc254e73b26b51e2e05673de/3000.jpeg", "publishedAt": "2022-09-07T22:39:51Z", "content": "WASHINGTON (AP) The White House said Wednesday its optimistic about a decline in monkeypox cases and an uptick in vaccinations against the infectious virus, despite worsening racial disparities in re… [+3482 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Three Autism Subgroups With Distinct Prenatal Risk Factors - Neuroscience News", "description": "Using large data sets, researchers determined children on the autism spectrum can be broken into three subgroups based upon co-occurring conditions, and those subgroups are associated with different prenatal risk factors. Infections, anti-inflammatory and oth…", "url": "https://neurosciencenews.com/asd-pregnancy-21371/", "urlToImage": "https://neurosciencenews.com/files/2022/09/asd-pregnancy-neurosicnecces-publoc.jpg", "publishedAt": "2022-09-07T22:03:00Z", "content": "Summary: Using large data sets, researchers determined children on the autism spectrum can be broken into three subgroups based upon co-occurring conditions, and those subgroups are associated with d… [+5935 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "A Single Protein Could Unlock Age-Related Vision Loss - Neuroscience News", "description": "Determining the structure of vitronectin, a protein implicated in age-related macular degeneration and some neurodegenerative disorders, and using pressure to alter the protein shape may help in the development of new treatments for AMD.", "url": "https://neurosciencenews.com/amd-vision-protein-21369/", "urlToImage": "https://neurosciencenews.com/files/2022/09/amd-protein-neurosinces-public.jpg", "publishedAt": "2022-09-07T21:15:32Z", "content": "Summary: Determining the structure of vitronectin, a protein implicated in age-related macular degeneration and some neurodegenerative disorders, and using pressure to alter the protein shape may hel… [+5017 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Personality Disorders | NEJM - nejm.org", "description": "Review Article from The New England Journal of Medicine — Personality Disorders", "url": "https://www.nejm.org/doi/full/10.1056/NEJMra2120164", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/2022/nejm_2022.387.issue-10/nejmra2120164/20220906/images/img_medium/nejmra2120164_t1.jpeg", "publishedAt": "2022-09-07T21:03:30Z", "content": "From the Department of Psychology, University of Houston, Houston.\r\nDr. Sharp can be contacted at the Department of Psychology, 126 Heyne Bldg., University of Houston, Houston, TX 77204."}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Durability of Booster mRNA Vaccine against SARS-CoV-2 BA.2.12.1, BA.4, and BA.5 Subvariants | NEJM - nejm.org", "description": "Correspondence from The New England Journal of Medicine — Durability of Booster mRNA Vaccine against SARS-CoV-2 BA.2.12.1, BA.4, and BA.5 Subvariants", "url": "https://www.nejm.org/doi/full/10.1056/NEJMc2210546", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmc2210546/20220907/images/img_small/nejmc2210546_f1.jpeg", "publishedAt": "2022-09-07T21:01:39Z", "content": "Mounting concern about the long-term efficacy of messenger RNA (mRNA) booster vaccines against coronavirus disease 2019 (Covid-19)1 has been exacerbated by the recent emergence of the B.1.1.529 (omic… [+8143 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "Everything You Need to Know About This Year's Flu Shot - Lifehacker", "description": "This year, there are egg-free and nasal vaccine options, to name a few.", "url": "https://lifehacker.com/everything-you-need-to-know-about-this-years-flu-shot-1849507118", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/216615caeb7117fa6522d4115583c7bf.jpg", "publishedAt": "2022-09-07T21:00:00Z", "content": "Its flu shot season and, once again, the influenza vaccine is an important one to get. With mask-wearing on the decline, theres likely to be more of every common respiratory virus around. So you migh… [+3782 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Jake Johnson", "title": "4 lifestyle changes men can make now to prevent early hair loss - Insider", "description": "Dermatologist Dr. Susan Massick said that hair growth shampoos are not worth your money, but medications like minoxidil can help.", "url": "https://www.insider.com/prevent-male-pattern-baldness-early-hair-loss-prevention-lifestyle-changes-dermatologist-advice", "urlToImage": "https://i.insider.com/63177749023509001aecf3ce?width=1200&format=jpeg", "publishedAt": "2022-09-07T20:40:54Z", "content": "Although there is no cure for male-pattern baldness, some treatments can help slow hair loss and potentially regrow hair if caught early, according to Dr. Susan Massick, clinical associate professor … [+3971 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Scientists glean new insights into how tardigrades can survive dehydration - Ars Technica", "description": "Proteins form gel-like filaments that stiffen into networks to support dried-out cells.", "url": "https://arstechnica.com/science/2022/09/scientists-glean-new-insights-into-how-tardigrades-can-survive-dehydration/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/12/tardigradeTOP-760x380.jpg", "publishedAt": "2022-09-07T19:44:53Z", "content": "Enlarge/ SEM Micrograph of a tardigrade, more commonly known as a water bear or \"moss piglet.\"\r\n10 with 10 posters participating\r\nTardigrades are micro-animals that can survive in the harshest condit… [+6546 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Bird flu forces egg farm to euthanize 3 million chickens - ABC News", "description": "An outbreak of bird flu that has led to the deaths of 43 million chickens and turkeys this year across the U.S. has been found at a giant egg-laying operation in Ohio", "url": "https://abcnews.go.com/US/wireStory/bird-flu-forces-egg-farm-euthanize-million-chickens-89478783", "urlToImage": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "publishedAt": "2022-09-07T19:40:07Z", "content": "TOLEDO, Ohio -- An outbreak of bird flu that has led to the deaths of 43 million chickens and turkeys this year across the U.S. has been found at a giant egg-laying operation in Ohio, state and feder… [+996 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "Stress during pregnancy may have a negative emotional impact on babies, study finds - CNN", "description": "Pregnant women face a lot of stress, which can harm their newborn's emotions, a new study has shown.", "url": "https://www.cnn.com/2022/09/07/health/pregnancy-stress-babies-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220906100819-pregnancy-stress-super-tease.jpeg", "publishedAt": "2022-09-07T18:06:00Z", "content": "(CNN)Being pregnant is tough enough, but with the added pressure of work, a shaky economy and the risks of Covid-19, it can seem overwhelming. But if it's possible, expectant mothers should try to ta… [+5676 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Asia Grace", "title": "My doctor told me I was just a lazy teenager — turns out I have cancer - New York Post ", "description": "When Courtney Nettleton found herself feeling “uncontrollably” tired, the 21-year-old was at first told by her doctor that she had nothing to worry about.", "url": "https://nypost.com/2022/09/07/doctors-misdiagnosed-womans-cancer-as-teenage-laziness/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/09/neck.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-09-07T17:24:00Z", "content": "This womans doctor allegedly shrugged off her ailments and said laziness was the answer but it turns out she had cancer.  \r\nWhen Courtney Nettleton, a 21-year-old from Wakefield, West Yorkshire, foun… [+5092 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Ben Cost", "title": "Mom's 'hairbrush scratch' turned out to be cancer: It's like a 'volcanic crater' - New York Post ", "description": "A woman’s harmless-looking forehead scratch turned out to be cancerous.", "url": "https://nypost.com/2022/09/07/moms-hairbrush-scratch-turned-out-to-be-cancer/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/09/cancer1.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-09-07T17:23:00Z", "content": "It was as serious as cancer.\r\nA United Kingdom woman who blamed her scratch on a hairbrush was horrified after finding out she had skin cancer which left her with a “volcanic crater” in her forehead.… [+5238 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genomics to select treatment for patients with metastatic breast cancer - Nature.com", "description": "Targeted therapies matched to genomics improved progression-free survival when genomic alterations were classified as level I/II (according to ESCAT), and genomics should thus be driven by target actionability in patients with metastatic breast cancer.", "url": "https://www.nature.com/articles/s41586-022-05068-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-05068-3/MediaObjects/41586_2022_5068_Fig1_HTML.png", "publishedAt": "2022-09-07T15:41:31Z", "content": "Competing interests\r\nF.A. received research funding and served as a speaker/advisor (compensated by the hospital) for Pfizer, Roche, Lilly, Daiichi Sankyo, AstraZeneca and Novartis. T.B. received res… [+2649 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Gut-Brain Circuits for Fat Preference - Nature.com", "description": "Nature - Gut-Brain Circuits for Fat Preference", "url": "https://www.nature.com/articles/s41586-022-05266-z", "urlToImage": null, "publishedAt": "2022-09-07T15:41:31Z", "content": "The perception of fat evokes strong appetitive and consummatory responses1. Here we show that fat stimuli can induce behavioural attraction even in the absence of a functional taste system2,3. We dem… [+930 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "A Good Memory or a Bad One? One Brain Molecule Decides. - Quanta Magazine", "description": "When the brain encodes memories as positive or negative, one molecule determines which way they will go.", "url": "https://www.quantamagazine.org/a-good-memory-or-a-bad-one-one-brain-molecule-decides-20220907/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/09/Memory_Valence_1200_Social.jpg", "publishedAt": "2022-09-07T14:13:31Z", "content": "The researchers knew that the neurons in the amygdala did not make neurotensin, so they first had to figure out where the peptide was coming from. When they scanned the brain, they found neurons in t… [+7007 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Madeleine Haase", "title": "Study: Your Blood Type May Predict Risk of Stroke Before 60 - Prevention Magazine", "description": "Plus, the blood types that may put you at a lower risk for stroke.", "url": "https://www.prevention.com/health/health-conditions/a41095805/study-some-blood-types-at-higher-risk-of-stroke/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/businesswoman-with-headache-royalty-free-image-1631801493.jpg?crop=1.00xw:0.754xh;0,0&resize=1200:*", "publishedAt": "2022-09-07T13:38:26Z", "content": "<ul><li>A new study links blood type to risk of stroke before 60. </li><li>The study found that people with blood type A are more likely to suffer a stroke before the age of 60 than those with blood … [+5819 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Arielle Weg", "title": "Studies: Ultra-Processed Foods Linked to Cancer and Early Death - Prevention Magazine", "description": "Your go-to frozen meal or cold cuts could be amplifying your risk of cancer or premature death.", "url": "https://www.prevention.com/food-nutrition/a41095021/ultra-processed-foods-may-lead-to-cancer-early-death-cardiovascular-disease/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/man-transferring-fresh-cooked-pizza-to-plate-royalty-free-image-1662488521.jpg?crop=1.00xw:0.752xh;0,0.240xh&resize=1200:*", "publishedAt": "2022-09-07T12:36:13Z", "content": "<ul><li>Two new large research studies found that ultra-processed foods can increase the risk for colorectal cancer, premature death, and heart disease.</li><li>The first study found men who ate in t… [+7568 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "The Best Cardio Exercises To Lose Visceral Fat and Slow Aging, Trainer Says — Eat This Not That - Eat This, Not That", "description": "We chatted with Steve Theunissen of Smart Fitness Results, who shares the best cardio exercises to lose visceral fat and slow aging.", "url": "https://www.eatthis.com/best-cardio-exercises-to-lose-visceral-fat-and-slow-aging/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/09/man-biking-scenic-roads-exercise.jpg?quality=82&strip=all", "publishedAt": "2022-09-07T11:00:58Z", "content": "Dealing with excess fat in your midsection can not only be frustrating, but it's also hazardous to your health. To stress just how dangerous this type of fat can be, research reveals that extra belly… [+3310 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Terri-Ann Williams", "title": "I kissed someone for the first time in a year and was left in a devastating state... - The US Sun", "description": "", "url": "https://www.the-sun.com/health/6167086/kissed-someone-first-time-year-devastating-state/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/09/newspress-collage-19733107-1662556135040.jpg?1662541917&strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-09-07T09:11:03Z", "content": "WE all have to kiss a few frogs before we find our charming.\r\nBut one woman has now revealed how she was left in a 'devastating state' after kissing someone for the first time in a year.\r\nCamilla pos… [+2682 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Emell Derra Adolphus", "title": "New York Gay Sex Parties Put on Hold Amid Monkeypox Outbreak, CDC Says It Has Helped Stop the Spread - The Daily Beast", "description": "The organizers of gay hookup parties have had their events on pause, and as monkeypox transmission rates slow in New York City, they may be unlikely heroes.", "url": "https://www.thedailybeast.com/new-york-gay-sex-parties-put-on-hold-amid-monkeypox-outbreak-cdc-says-it-has-helped-stop-the-spread", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1662527220/090722-adolphus-sexparties-hero_nhbjpx", "publishedAt": "2022-09-07T08:52:14Z", "content": "By the time the Centers for Disease Control and Prevention (CDC) released its monkeypox guidelines in Julywarning men who have sex with men to avoid skin-to-skin contact, sharing cups, casual hookups… [+9403 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "‘Woman who can smell Parkinson’s’ helps scientists develop test - The Guardian", "description": "Scientists drew on 72-year-old Scot’s rare condition to help identify people with neurological condition", "url": "https://amp.theguardian.com/society/2022/sep/07/woman-who-can-smell-parkinsons-helps-scientists-develop-test", "urlToImage": "https://i.guim.co.uk/img/media/60ec93a56d18d1542a538abbf03f14451c6c07ce/0_226_2055_1233/master/2055.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e58c625865afe43444357ea2ce46d24f", "publishedAt": "2022-09-07T08:34:00Z", "content": "Scientists have harnessed the power of a womans hyper-sensitive sense of smell to develop a test to determine whether people have Parkinsons disease.\r\nThe test has been years in the making after acad… [+6073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Is the Keto diet safe for diabetics? Is it only good for short-term weight loss? Does it increase cholesterol? - The Indian Express", "description": "In patients with Type 2 or recent onset diabetes, blood sugar levels and sensitivity to insulin are likely to improve. The need for anti-diabetic medications may decrease. But work with your nutritionist and watch out for side effects. For Type 1, it is a no-…", "url": "https://indianexpress.com/article/lifestyle/health-specials/keto-diet-safe-diabetics-weight-loss-cholestrol-8135583/", "urlToImage": "https://images.indianexpress.com/2022/09/Anoop-keto.jpg", "publishedAt": "2022-09-07T04:00:48Z", "content": "I recently saw a 23-year-old obese (weight 92 kg, BMI 33 kg/m2) girl. She was smiling but looked unsettled. She told me, Doc, I have been on a Keto dietfor the last two months and have lost 4 kg of w… [+4595 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Popular Medicines Including Ibuprofen and Naproxen Have Been Linked to Heart Failure in Diabetics - SciTechDaily", "description": "Researchers discover new side effects of non-steroidal anti-inflammatory drugs. According to a study presented at ESC Congress 2022, short-term use of non-steroidal anti-inflammatory drugs (NSAIDs) is linked to a first-time hospitalization for heart failure i…", "url": "https://scitechdaily.com/popular-medicines-including-ibuprofen-and-naproxen-have-been-linked-to-heart-failure-in-diabetics/", "urlToImage": "https://scitechdaily.com/images/Heart-Attack-Concept.jpg", "publishedAt": "2022-09-07T00:10:56Z", "content": "The study found that NSAID use was associated with an increased risk of first-time heart failure hospitalization.\r\nResearchers discover new side effects of non-steroidal anti-inflammatory drugs.\r\nAcc… [+4802 chars]"}, {"source": {"id": null, "name": "9News.com KUSA"}, "author": "Jaleesa Irizarry", "title": "'September epidemic' could make a comeback - 9News.com KUSA", "description": "9NEWS spoke with National Jewish Health pulmonologist Dr. Anthony Gerber to discuss why we may see the epidemic come back for the first time in three years.", "url": "https://www.9news.com/article/news/health/september-epidemic/73-4326ddd8-f30a-4d06-986f-64c9a4e682c7", "urlToImage": "https://media.9news.com/assets/KUSA/images/d84687ef-d44a-4945-a903-f181e34251ff/d84687ef-d44a-4945-a903-f181e34251ff_1140x641.jpg", "publishedAt": "2022-09-06T23:49:00Z", "content": "DENVER This may be the year we see the return of the \"September epidemic\" -- the back-to-school time when a wave of viruses hits kids, especially those who have asthma. \r\n9NEWS spoke with National Je… [+4223 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Inhaling Whippits Left a Man Unable to Walk - Gizmodo", "description": "Doctors detail how nitrous oxide use caused a degenerative spinal condition, though the man did eventually recover.", "url": "https://gizmodo.com/nitrous-oxide-whippits-paralysis-1849502376", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/9da0532139a5d33b23b62bbd3d259f14.jpg", "publishedAt": "2022-09-06T23:00:00Z", "content": "In a new paper this month, doctors describe how a 32-year-old mans habit of inhaling nitrous oxide via whippits left him partially paralyzed. Following treatment and the end of his nitrous oxide use,… [+2751 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Arielle Mitropoulos", "title": "Mystery as to why new COVID variants have stalled in growth - ABC News", "description": "BA.5 currently estimated to account for about 88.6% of new infections, CDC says.", "url": "https://abcnews.go.com/Health/growth-covid-19-variants-stagnates-health-experts-ahead/story?id=89407750", "urlToImage": "https://s.abcnews.com/images/Health/covid-vaccine-01-gty-jt-220906_1662482916344_hpMain_16x9_992.jpg", "publishedAt": "2022-09-06T22:06:01Z", "content": "Throughout much of the pandemic, there has been a constant shifting in terms of which COVID-19 variants are most dominant, at a given time, in the U.S.\r\nHowever, for the last five weeks, federal data… [+3519 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Stimulation of the Vagus Nerve Strengthens the Communication Between the Stomach and the Brain - Neuroscience News", "description": "Non-invasive stimulation of the vagus nerve can help strengthen communication between the stomach and brain within minutes.", "url": "https://neurosciencenews.com/vagus-nerve-stimulation-gut-brain-21367/", "urlToImage": "https://neurosciencenews.com/files/2022/09/vagus-nerve-stimulation-gut-neurosicencces-public.jpg", "publishedAt": "2022-09-06T21:40:48Z", "content": "Summary: Non-invasive stimulation of the vagus nerve can help strengthen communication between the stomach and brain within minutes.\r\nSource: University of Tubingen\r\nThe nervous system takes in senso… [+5630 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen U.S.", "title": "Children born from frozen embryos are more likely to develop cancer later in life - Daily Mail", "description": "A child that was born from an embryo that was previously frozen is more likely to develop cancer, a new study from a Swedish research team finds.", "url": "https://www.dailymail.co.uk/health/article-11185871/Children-born-frozen-embryos-likely-develop-cancer-later-life.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/06/21/62132921-0-image-a-8_1662496917147.jpg", "publishedAt": "2022-09-06T20:42:02Z", "content": "Children that are born from embryos placed in frozen storage are at an increased risk of developing cancer, an alarming new study finds.\r\nResearchers at the University of Gothenburg in Sweden, found … [+5315 chars]"}, {"source": {"id": null, "name": "Health.com"}, "author": "https://www.facebook.com/Health/", "title": "Steroids Used for Asthma and Allergies Linked to Changes in Brain Structure - Health.com", "description": "Experts explain the ramifications of a new study surrounding oral and inhaled steroid use.", "url": "https://www.health.com/news/oral-inhaled-steroids-brain-changes", "urlToImage": "https://www.health.com/thmb/hU788i7tH4MKrivA7kmGuPfVnz4=/1731x1156/filters:fill(auto,1)/Out-Of-Breath-Runner-Stocksy_txp7e32cabd2lV300_Medium_2128216-8281b4d4fadc46d3ac852a2ebce97ebf.jpg", "publishedAt": "2022-09-06T20:39:09Z", "content": "Glucocorticoids, a common steroid used to address inflammation associated with asthma and allergies, has been linked to changes in the white matter of the brain and cognitive decline, according to ne… [+5656 chars]"}, {"source": {"id": null, "name": "Hartford Courant"}, "author": "Ed Stannard", "title": "A hair growth medicine that comes in a pill? Yes, according to this CT doctor. - Hartford Courant", "description": "Minoxidil, sold as Rogaine, is a topical hair growth medication. Oral minoxidil, at lower doses, does a better job of growing hair, a Yale School of Medicine doctor says.", "url": "https://www.courant.com/news/connecticut/hc-news-oral-rogaine-prevents-hair-loss-20220906-dyi242iojzd2npjcm2ufbs56w4-story.html", "urlToImage": "https://www.courant.com/resizer/5PJk0TZ1ToHalzhVTPX_ijOq3pw=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/73SOUXPQBNCI5KMLU3PYWFNS4Q.jpg", "publishedAt": "2022-09-06T19:07:16Z", "content": "Sometimes a solution will be right in front of you and youll miss seeing it. It can even happen to physicians.\r\nMinoxidil, with the brand name Rogaine, has been sold as a topical treatment to reverse… [+4376 chars]"}, {"source": {"id": null, "name": "Heart.org"}, "author": null, "title": "Myocarditis from COVID-19 booster rare, but risk highest among teen boys, young men - American Heart Association News", "description": "Cases of myocarditis &ndash; an inflammation of the heart muscle &ndash; following a third dose of the Pfizer vaccine are rare and typically mild, research from Israel shows.", "url": "https://www.heart.org/en/news/2022/09/06/myocarditis-from-covid-19-booster-rare-but-risk-highest-among-teen-boys-young-men", "urlToImage": "https://www.heart.org/-/media/Images/News/2022/September-2022/0906RRCoronavirusMyocarditisBooster_SC.jpg", "publishedAt": "2022-09-06T18:30:00Z", "content": "(Jolygon/iStock via Getty Images)\r\nThe risk of developing myocarditis – an inflammation of the heart muscle – following a booster dose of the Pfizer COVID-19 vaccine is low, according to new research… [+3475 chars]"}]}