{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Virus Found in the Brain: Autopsies Reveal Startling New Information - SciTechDaily", "description": "An analysis of tissue samples from the autopsies of 44 people who died with COVID-19 shows that SAR-CoV-2 virus spread throughout the body—including into the brain—and that it lingered for almost 8 months. The study was published on December 14 in the journal…", "url": "https://scitechdaily.com/covid-19-virus-found-in-the-brain-autopsies-reveal-startling-new-information/", "urlToImage": "https://scitechdaily.com/images/Medical-Examiner-Autopsy-Concept.jpg", "publishedAt": "2023-01-02T10:25:41Z", "content": "ByJim Wappes, University of MinnesotaJanuary 2, 2023\r\nAn analysis of autopsied tissue samples from 44 individuals who passed away with COVID-19 revealed that the SAR-CoV-2 virus spread throughout the… [+6388 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Lesley Stahl", "title": "Recognizing and treating obesity as a disease - 60 Minutes - CBS News", "description": "Lesley Stahl reports on how obesity is misunderstood, and the struggle to get new weight loss drugs to people who need them.", "url": "https://www.cbsnews.com/news/weight-loss-obesity-drug-2023-01-01/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2019/02/05/b25017d1-075e-493d-a22a-b369cab3dfe0/thumbnail/1200x630/bd3af6c77ebdb14f77740aeaf5f0d613/s101241697.jpg", "publishedAt": "2023-01-02T00:29:52Z", "content": "Almost half of American adults have obesity, a condition that was a fraction of that just 40 years ago and scientists don't agree on what's caused the dramatic increase. What everyone does agree on i… [+11770 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research: Intermittent Fasting Might Not Be As Safe as We Thought - SciTechDaily", "description": "The popular dietary trend has been linked to dangerous eating disorder attitudes and behaviors among adolescents and young adults. A recent study published in the journal Eating Behaviors has shed light on the potential negative effects of intermittent fastin…", "url": "https://scitechdaily.com/new-research-intermittent-fasting-might-not-be-as-safe-as-we-thought/", "urlToImage": "https://scitechdaily.com/images/Intermittent-Fasting.jpg", "publishedAt": "2023-01-01T21:51:37Z", "content": "Intermittent fasting is a popular dietary trend that involves cycling between periods of eating and fasting. It is believed to have various health benefits such as weight loss, improved insulin sensi… [+2554 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Oliver Price", "title": "Mother warns parents of her daughter's 'sunburn-like' Strep A symptoms which left doctors stumped - Daily Mail", "description": "Sadie Learmonth said her daughter Khloe (pictured), six from Irvine, North Ayrshire, Scotland, was struck with Strep A in September - and doctors were unable to diagnose her for weeks.", "url": "https://www.dailymail.co.uk/news/article-11590571/Mother-warns-parents-daughters-sunburn-like-Strep-symptoms-left-doctors-stumped.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/01/22/66104119-0-image-a-4_1672612855365.jpg", "publishedAt": "2023-01-01T21:37:13Z", "content": "A Scottish mother has revealed her six-year-old daughter looked 'sunburned' and broke out in a 'head to toe rash' as an unusual symptom after she contracted Strep A.\r\nSadie Learmonth said her daughte… [+2782 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Korin Miller", "title": "8 Reasons You're Doing Strength Training But Not Losing Weight, According To Experts - Women's Health", "description": "Experts say one of these factors could be to blame.", "url": "https://www.womenshealthmag.com/weight-loss/a42259003/strength-training-not-losing-weight/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/athletic-woman-exercising-strength-with-hand-weight-royalty-free-image-1671554751.jpg?crop=1.00xw:0.753xh;0,0.0360xh&resize=1200:*", "publishedAt": "2023-01-01T13:35:31Z", "content": "While there are *so* many benefits to \r\nstrength training that go way beyond changing your body composition, lifting weights is a key habit to get into if you want to lose weight. After all, you can … [+7624 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "A Single Hormone in Men May Predict Their Future Health - ScienceAlert", "description": "A variety of age-related illnesses – including bone weakness, sexual dysfunction, diabetes, cancer, and cardiovascular disease – can be predicted by a single hormone that appears at a steady level in men across the course of their lives, new research...", "url": "https://www.sciencealert.com/a-single-hormone-in-men-may-predict-their-future-health", "urlToImage": "https://www.sciencealert.com/images/2022/11/MaleGenerations.jpg", "publishedAt": "2023-01-01T13:30:37Z", "content": "A variety of age-related illnesses including bone weakness, sexual dysfunction, diabetes, cancer, and cardiovascular disease can be predicted by a single hormone that appears at a steady level in men… [+3928 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Andrew Steele", "title": "A Drug to Treat Aging May Not Be a Pipe Dream - WIRED", "description": "New approaches to the biology of senescence can make lives longer and healthier.", "url": "https://www.wired.com/story/drugs-aging-medicine-biotech/", "urlToImage": "https://media.wired.com/photos/63a119cfe07d189669191b3c/191:100/w_1280,c_limit/02_Making-age-related-disease-a-thing-of-the-past.jpg", "publishedAt": "2023-01-01T12:00:00Z", "content": "Life expectancy in the best-performing countries has been increasing by three months per year every year since the early 1800s. Throughout most of human history, you had a roughly 5050 chance of maki… [+4505 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Secrets to Aging Gracefully: Researchers Uncover Factors Linked to Optimal Aging - SciTechDaily", "description": "Findings underline the importance of a strength-based rather than a deficit-based focus on aging and older adults. What are the keys to “successful” or optimal aging? A new study followed more than 7,000 middle-aged and older Canadians for approximately three…", "url": "https://scitechdaily.com/secrets-to-aging-gracefully-researchers-uncover-factors-linked-to-optimal-aging/", "urlToImage": "https://scitechdaily.com/images/Rejuvenation-Anti-Aging-Concept.jpg", "publishedAt": "2022-12-31T22:49:34Z", "content": "A new study aimed to uncover the key factors that contribute to successful or optimal aging by following more than 7,000 middle-aged and older Canadians for approximately three years. The researchers… [+6274 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Christine Rousselle", "title": "Type 2 diabetes: Study predicts 'startling' rise of the condition among America's young people - Fox News", "description": "A new modeling study is raising alarm bells after finding that the number of young people in the United States with diabetes will increase by nearly 700% over the next 40 years.", "url": "https://www.foxnews.com/health/type-2-diabetes-study-predicts-startling-rise-condition-america-young-people", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/diabetes-istock.jpg", "publishedAt": "2022-12-31T18:16:54Z", "content": "A new modeling study is raising alarm bells after it determined that the number of young people in the United States with diabetes will increase by nearly 700% over the next 40 years. \r\nThe study, ti… [+4300 chars]"}]}