{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "US cases of child hepatitis reach 11 with global toll hitting 169, including one death - Daily Mail", "description": "North Carolina has spotted two cases among school-age children, alongside the nine that were detected among under-6s in Alabama since October. Doctors say it may be Covid linked.", "url": "https://www.dailymail.co.uk/health/article-10751175/US-cases-child-hepatitis-reach-11-global-toll-hitting-169-including-one-death.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/25/12/57020957-0-image-a-4_1650885948332.jpg", "publishedAt": "2022-04-25T13:37:18Z", "content": "The United States has now recorded 11 cases of unexplained hepatitis in children, as the global toll hits 169 and the first death is registered with doctors warning Covid infections may be behind the… [+14028 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Julia Ries", "title": "My At-Home Rapid Test Is Negative, But Could I Still Have COVID? - HuffPost", "description": "Some people with omicron or its subvariants aren't testing positive right away, even with symptoms. Here are few theories why.", "url": "https://www.huffpost.com/entry/covid-symptoms-negative-rapid-test_l_62618a22e4b04adcef043535", "urlToImage": "https://img.huffingtonpost.com/asset/6261ac892300002bf413a35a.jpeg?ops=1778_1000", "publishedAt": "2022-04-25T09:45:10Z", "content": "In the age of omicron, where COVIDs attack rate is higher than previous variants, entire households and friend groups are getting sick. If one person gets COVID, theres a good chance others in their … [+5714 chars]"}, {"source": {"id": null, "name": "CMAJ"}, "author": null, "title": "Impact of population mixing between vaccinated and unvaccinated subpopulations on infectious disease dynamics: implications for SARS-CoV-2 transmission - CMAJ", "description": "Background: The speed of vaccine development has been a singular achievement during the COVID-19 pandemic, although uptake has not been universal. Vaccine opponents often frame their opposition in terms of the rights of the unvaccinated. We sought to explore …", "url": "https://www.cmaj.ca/content/194/16/E573", "urlToImage": "https://www.cmaj.ca/sites/default/files/highwire/cmaj/194/16.cover-source.jpg", "publishedAt": "2022-04-25T04:34:01Z", "content": "Abstract\r\nBackground: The speed of vaccine development has been a singular achievement during the COVID-19 pandemic, although uptake has not been universal. Vaccine opponents often frame their opposi… [+17988 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "One Grim Statistic Lays Bare The Truly Relentless Grip of Long COVID - ScienceAlert", "description": "Not even one in four people have completely recovered from COVID a full year after being hospitalized with the disease, a UK study indicated Sunday, warning that long COVID could become a common condition.", "url": "https://www.sciencealert.com/one-grim-statistic-lays-bare-the-truly-relentless-grip-of-long-covid", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/HandOnHospitalBed_1024.jpg", "publishedAt": "2022-04-25T02:54:30Z", "content": "Not even one in four people have completely recovered from COVID a full year after being hospitalized with the disease, a UK study indicated Sunday, warning that long COVID could become a common cond… [+1455 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Antibiotic-resistant superbug found in pigs and humans: study - CTV News", "description": "Scientists studying the C. difficile superbug say that its antibiotic-resistant genes have been found in pigs and humans, meaning that not only is transmission of the bacteria possible on a wider scale, but the genes that resist antibodies themselves might be…", "url": "https://www.ctvnews.ca/health/antibiotic-resistant-superbug-found-in-pigs-could-be-vector-for-human-transmission-study-1.5874460", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/4/24/pig-1-5874462-1650845688918.jpeg", "publishedAt": "2022-04-25T00:15:34Z", "content": "Scientists studying the C. difficile superbug say that its antibiotic-resistant genes have been found in pigs and humans, meaning that not only is transmission of the bacteria possible on a wider sca… [+6029 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Colin Fernandez  Environment Correspondent", "title": "Humans have an instinct for healthy food and select diet for specific micronutrients, study finds - Daily Mail", "description": "Humans select foods to meet our need for vitamins and minerals - challenging notions that we favour starchy ones. It has long been thought that humans seek out energy-dense foods.", "url": "https://www.dailymail.co.uk/sciencetech/article-10749595/Humans-instinct-healthy-food-select-diet-specific-micronutrients-study-finds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/25/00/57003571-0-image-a-79_1650843801587.jpg", "publishedAt": "2022-04-25T00:04:18Z", "content": "Humans select foods to meet our need for vitamins and minerals challenging notions that we favour starchy ones.\r\nIt has long been thought we seek out energy-dense foods and get vitamins and minerals … [+1555 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Third Dose Vaccine Protection Against Hospitalization Wanes After 3 Months - SciTechDaily", "description": "Kaiser Permanente finds the Pfizer COVID-19 third dose vaccine protection against hospitalization from omicron wanes after 3 months. A research study released on April 22, 2022, in The Lancet Respiratory Medicine shows that a booster dose of the Pfizer COVID-…", "url": "https://scitechdaily.com/covid-19-third-dose-vaccine-protection-against-hospitalization-wanes-after-3-months/", "urlToImage": "https://scitechdaily.com/images/Three-COVID-19-Vaccine-Doses.jpg", "publishedAt": "2022-04-24T19:13:44Z", "content": "ByKaiser PermanenteApril 24, 2022\r\nA new research study published in The Lancet Respiratory Medicine shows that protection against the omicron variant deteriorates over time even after a third vaccin… [+3947 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Linda Searing", "title": "Exercise may help prevent depression - The Washington Post", "description": "Already known to help ease depression, regular exercise may also help prevent it, with people who exercised just half the recommended weekly amount lowering their risk for depression by 18 percent, according to new research.", "url": "https://www.washingtonpost.com/health/2022/04/24/exercise-depression/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZC4QQNCFCEI6TFFL2LO2HQG7KI.jpg&w=1440", "publishedAt": "2022-04-24T12:01:53Z", "content": "Placeholder while article actions load\r\nAlready known to help ease depression, regular exercise may also help prevent it, with people who exercised just half the recommended weekly amount lowering th… [+1754 chars]"}, {"source": {"id": null, "name": "mlive.com"}, "author": "Emily Bingham | ebingham@mlive.com", "title": "Why you can expect more ticks this summer in Michigan - MLive.com", "description": "Ticks are increasing across Michigan, making tick-season forecasting feel bleak.", "url": "https://www.mlive.com/news/2022/04/why-you-can-expect-more-ticks-this-summer-in-michigan.html", "urlToImage": "https://www.mlive.com/resizer/g4LbSRSMMt_bcl0T1pSp5Mi_kKM=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/542N2AOGPZFVBKQYFPU4GXH33I.png", "publishedAt": "2022-04-24T11:30:00Z", "content": "As Michigan enters another spring tick season, the overall outlook feels a bit bleak.\r\nOver the past decade these biting arachnids have been expanding their range across the state, and while certain … [+4487 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "San Franciscans React to News of Rise in COVID Infections - KPIX CBS SF Bay Area", "description": "The COVID-19 test positivity rate in San Francisco has risen above 5 percent for the first time in two months. Max Darrow reports. (4-23-22)", "url": "https://www.youtube.com/watch?v=4vjQ47zfZ4o", "urlToImage": "https://i.ytimg.com/vi/4vjQ47zfZ4o/hqdefault.jpg", "publishedAt": "2022-04-24T01:19:50Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Connor Sephton", "title": "Ebola: New outbreak declared as officials warn 'time is not on our side' - Sky News", "description": "", "url": "https://news.sky.com/story/ebola-new-outbreak-declared-as-officials-warn-time-is-not-on-our-side-12597624", "urlToImage": "https://e3.365dm.com/22/04/1600x900/skynews-ebola-congo_5749560.jpg?20220423232035", "publishedAt": "2022-04-24T00:01:15Z", "content": "An outbreak of Ebola has been declared in the Democratic Republic of the Congo - four months after the last one ended.\r\nA case was confirmed in a 31-year-old man on 5 April. He was admitted to an Ebo… [+1320 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Antidepressants Are Not Associated With Improved Quality of Life in the Long Run - Neuroscience News", "description": "Overall, people who used antidepressants to manage depression long-term did not have a better quality of physical or mental health than those with depression who did not use prescription medication to manage their symptoms.", "url": "https://neurosciencenews.com/antidepressants-life-quality-20451/", "urlToImage": "https://neurosciencenews.com/files/2022/04/antidepressant-life-quality-neurosinces.jpg", "publishedAt": "2022-04-23T22:48:39Z", "content": "Summary: Overall, people who used antidepressants to manage depression long-term did not have a better quality of physical or mental health than those with depression who did not use prescription med… [+5076 chars]"}, {"source": {"id": null, "name": "Reading Eagle"}, "author": "Keith Mayer", "title": "University of Virginia study gives nod to Moderna vaccine for the most at risk of COVID - Reading Eagle", "description": "Antibodies maintain a high level longer than Pfizer, that study found", "url": "http://www.readingeagle.com/2022/04/23/university-virginia-study-moderna-vaccine-most-risk-covid/", "urlToImage": "https://www.readingeagle.com/wp-content/uploads/2022/02/CDCCOVID19VirusModel.jpg?w=1024&h=512", "publishedAt": "2022-04-23T16:49:59Z", "content": "The University of Virginia recently tracked its COVID-vaccinated employees who wanted to participate in a study, then monitored the antibodies that the vaccinations produced.\r\nThe study produced thes… [+7831 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Patricia Bannan", "title": "A nutritionist shares the 35 best foods to boost mood and brain energy levels: 'Put these on your grocery list' - CNBC", "description": "The foods you eat can affect your mood, brain function, immunity and energy levels. Dietitian and nutritionist Patricia Bannon shares 35 essential grocery items that will keep you energized, healthy and happy.", "url": "https://www.cnbc.com/2022/04/23/a-nutritionist-shares-the-best-grocery-foods-to-boost-mood-brain-energy-happiness.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107049081-1650476784972-gettyimages-1192233786-_nm10620.jpeg?v=1650641817&w=1920&h=1080", "publishedAt": "2022-04-23T14:40:01Z", "content": "Food and mood are so intricately connected that they've inspired a new area of brain study: Nutritional psychiatry, which examines how what we eat impacts how we feel.\r\nAs a dietitian and nutritionis… [+3340 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Knvul Sheikh", "title": "Allergy Season Is About to Get Worse. Here's How to Prepare. - Yahoo News", "description": "Springtime comes with an uptick in stuffy noses and scratchy throats, and for many it has nothing to do with Covid-19. There are 19.2 million adults and 5.2 ...", "url": "https://www.nytimes.com/2022/04/21/well/live/allergies-symptoms-season.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pkbN3Wi30XDYYmLqjMow7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-images/2020-05/7af2e990-a027-11ea-a9de-efa694db7470", "publishedAt": "2022-04-23T14:20:20Z", "content": "Springtime comes with an uptick in stuffy noses and scratchy throats, and for many it has nothing to do with Covid-19. There are 19.2 million adults and 5.2 million children in the United States who … [+7380 chars]"}]}