{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "SheFinds"}, "author": "faith geiger", "title": "The One Fried Food No One Over 40 Should Be Eating Anymore Because It Ruins Your Metabolism - Yahoo Life", "description": "Discover the one fried food experts warn against eating if you want a faster metabolism, only on SheFinds.", "url": "https://www.shefinds.com/collections/fried-food-stop-eating-over-40-ruins-metabolism-french-fries/", "urlToImage": "https://www.shefinds.com/files/2022/11/hot-deep-fryer-with-bubbling-oil.jpg", "publishedAt": "2022-11-12T10:00:26Z", "content": "Maintaining a balanced diet should always be a top priority, but it’s especially important to consider if you’re trying to shed some pounds. Unfortunately, while not typically an easy feat, weight lo… [+2425 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Is Muscle Weakness the New Smoking? Grip Strength Tied to Accelerated Biological Age - Neuroscience News", "description": "Muscle weakness marked by grip strength was associated with accelerated biological aging, a new study reports.", "url": "https://neurosciencenews.com/muscle-weakness-aging-21825/", "urlToImage": "https://neurosciencenews.com/files/2022/11/muscle-strenght-aging-neurosinces-.jpg", "publishedAt": "2022-11-12T07:23:00Z", "content": "Summary: Muscle weakness marked by grip strength was associated with accelerated biological aging, a new study reports.\r\nSource: University of Michigan\r\nEveryone ages at a different pace. That’s why … [+7693 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Alzheimer’s Disease Can Be Diagnosed Before Symptoms Emerge - Neuroscience News", "description": "A new study reveals it is not only possible to determine Alzheimer's risks before symptoms appear, but it is also possible to determine who will deteriorate within the next few years.", "url": "https://neurosciencenews.com/alzheimers-disease-prediction-21825/", "urlToImage": "https://neurosciencenews.com/files/2022/11/alzheimers-before-symptoms-neuroscience-public.jpg", "publishedAt": "2022-11-12T02:29:50Z", "content": "Summary: A new study reveals it is not only possible to determine Alzheimer’s risks before symptoms appear, but it is also possible to determine who will deteriorate within the next few years.\r\nSourc… [+5969 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "What Happens to the Dopamine System When We Experience Aversive Events? - Neuroscience News", "description": "The dopamine system helps the brain anticipate the occurrence and duration of unpleasant events, but without taking errors into account.", "url": "https://neurosciencenews.com/dopamine-aversive-event-21824/", "urlToImage": "https://neurosciencenews.com/files/2022/11/domaine-aversive-events-neurosinces-public.jpg", "publishedAt": "2022-11-12T00:14:30Z", "content": "Summary: The dopamine system helps the brain anticipate the occurrence and duration of unpleasant events, but without taking errors into account.\r\nSource: Netherlands Institute for Neuroscience\r\nA ne… [+4921 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Popular Dietary Supplement Causes Cancer Risk and Brain Metastasis - Neuroscience News", "description": "The commercial dietary supplement nicotinamide riboside, touted to improve cardiovascular and neurological health, may actually increase the risk of developing breast cancer that metastasizes to the brain.", "url": "https://neurosciencenews.com/cancer-dietary-supplements-21823/", "urlToImage": "https://neurosciencenews.com/files/2022/11/dietary-supplements-cancer-neurosinces-public.jpg", "publishedAt": "2022-11-11T23:31:07Z", "content": "Summary: The commercial dietary supplement nicotinamide riboside, touted to improve cardiovascular and neurological health, may actually increase the risk of developing breast cancer that metastasize… [+5440 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Southeast US has hit the roof of CDC’s respiratory illness level scale - Ars Technica", "description": "Uptake of flu shots is lagging this year, CDC says.", "url": "https://arstechnica.com/science/2022/11/southeast-us-has-hit-the-roof-of-cdcs-respiratory-illness-level-scale/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/11/ili-map-760x380.jpg", "publishedAt": "2022-11-11T23:26:33Z", "content": "31 with 0 posters participating\r\nThe US continues to see a dramatic and early surge in respiratory illnesses, which is hitting young children particularly hard and setting records for the decade.\r\nTh… [+2701 chars]"}, {"source": {"id": null, "name": "KATU"}, "author": "Megan Allison", "title": "Portland hospitals battle spike in RSV cases - KATU", "description": "Portland hospitals said they're facing a shortage of ICU beds for kids during a spike in RSV cases.At Legacy, doctors said the number of pediatric ICU patients", "url": "https://katu.com/news/local/portland-hospitals-battle-spike-in-rsv-cases", "urlToImage": "https://katu.com/resources/media/7356a952-a487-492b-9db2-99d75dde5f7c-large16x9_thumbnail_rsv1.jpg?1666997897262", "publishedAt": "2022-11-11T23:11:41Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Researchers Pinpoint ‘Depressing’ Gut Microbe With Potential for Psychobiotic Drugs - Neuroscience News", "description": "Examining the gut microbiome of those with major depressive disorder, researchers identify the presence of the bacteria Faecalibacterium prausnitzii as being responsible for the functional discrepancies between healthy individuals and those with MDD.", "url": "https://neurosciencenews.com/depression-microbiome-21821/", "urlToImage": "https://neurosciencenews.com/files/2022/11/depressing-gut-microbe-neuroscines-public.jpg", "publishedAt": "2022-11-11T23:06:12Z", "content": "Summary: Examining the gut microbiome of those with major depressive disorder, researchers identify the presence of the bacteria Faecalibacterium prausnitzii as being responsible for the functional d… [+5572 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "A Previously Unknown Ability of the Autonomic Nervous System - Neuroscience News", "description": "The autonomic nervous system has the ability to spontaneously restore muscle function following nerve injury.", "url": "https://neurosciencenews.com/ans-muscle-function-21820/", "urlToImage": "https://neurosciencenews.com/files/2022/11/autonomic-nervous-system-neurosicences-public.jpg", "publishedAt": "2022-11-11T22:35:55Z", "content": "Summary: The autonomic nervous system has the ability to spontaneously restore muscle function following nerve injury.\r\nSource: Medical University of Vienna\r\nThe autonomic nervous system is known as … [+5146 chars]"}, {"source": {"id": null, "name": "fox8.com"}, "author": "Maia Belay", "title": "Flu season expected to hit Ohio hard, first local pediatric death reported - WJW FOX 8 News Cleveland", "description": "Health officials warn this flu season is already showing signs that it will be worse than in recent, previous years.", "url": "https://fox8.com/news/flu-season-expected-to-hit-ohio-hard-first-local-pediatric-death-reported/", "urlToImage": "https://fox8.com/wp-content/uploads/sites/12/2022/11/374F05DE05DF9210FA6998AB2D620C40_1.jpg?w=1280", "publishedAt": "2022-11-11T22:08:27Z", "content": "CLEVELAND (WJW) — Health officials warn this flu season is already showing signs that it will be worse than in recent, previous years.\r\nThursday, the Cuyahoga County Board of Health confirmed a 13-ye… [+1500 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Do We Experience the Pain of Other People? - Neuroscience News", "description": "The ability to empathize, or share the pain of others is mapped onto neurons in the insula, a new study reports.", "url": "https://neurosciencenews.com/insula-empathy-pain-21818/", "urlToImage": "https://neurosciencenews.com/files/2022/11/empathy-insula-neurosicences-public.jpg", "publishedAt": "2022-11-11T21:26:23Z", "content": "Summary: The ability to empathize, or share the pain of others is mapped onto neurons in the insula, a new study reports.\r\nSource: Netherlands Institute for Neuroscience\r\nA new study from the Netherl… [+8875 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanne Lewsley", "title": "Seven benefits of vitamin D - Livescience.com", "description": "Discover all the important benefits of vitamin D, from building strong bones and teeth to improving your mental wellbeing", "url": "https://www.livescience.com/benefits-of-vitamin-d", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6A9LKwtHi3b97V3TNhjHCJ-1200-80.jpg", "publishedAt": "2022-11-11T21:00:37Z", "content": "The benefits of vitamin D have long been reported, but are you getting enough of this nutrient in your everyday diet for optimal health and wellbeing? Whether you opt for a daily dose of sunshine, a … [+7334 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "Seven ways to lose weight with minimal effort, according to science - Daily Mail", "description": "Weight loss experts recommend making small changes to your daily routine that add up over time like parking far from the store to sneak in some cardio or serving your food on smaller plates.", "url": "https://www.dailymail.co.uk/health/article-11409871/Seven-ways-lose-weight-minimal-effort-according-science.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/11/20/64451855-0-image-a-15_1668199388622.jpg", "publishedAt": "2022-11-11T20:56:42Z", "content": "If you want to lose weight but know full well you can't keep up with a crazy fitness fad and celebrity crash diet you're in luck.\r\nStudies show that, contrary to popular belief, tiny modifications to… [+13987 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Effectively Reducing Stress and Treating Anxiety Disorders Without Antidepressant Drugs - SciTechDaily", "description": "Mindfulness-based stress reduction is as effective as an antidepressant drug for treating anxiety disorders. A guided mindfulness-based stress reduction program was as effective as the use of the gold-standard drug – the common antidepressant drug escitalopra…", "url": "https://scitechdaily.com/effectively-reducing-stress-and-treating-anxiety-disorders-without-antidepressant-drugs/", "urlToImage": "https://scitechdaily.com/images/Happy-Woman-Stress-Free.jpg", "publishedAt": "2022-11-11T20:28:08Z", "content": "According to a randomized clinical trial out of Georgetown University Medical Center, mindfulness-based stress reduction is as effective at treating anxiety disorders as a common antidepressant drug.… [+7189 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Andrea Michelson", "title": "Young mom has terminal cancer after doctors misdiagnosed her bone pain - Insider", "description": "After a diagnosis of osteosarcoma, Reanna Tillman had her knee and shoulder bone removed, and became paralyzed. Now 23, she had a baby girl in 2021.", "url": "https://www.insider.com/young-mom-has-terminal-cancer-doctors-misdiagnosed-her-bone-pain-2022-11", "urlToImage": "https://i.insider.com/636e71bef5877200181c77fe?width=1200&format=jpeg", "publishedAt": "2022-11-11T18:35:19Z", "content": "At age 16, Reanna Tillman started experiencing leg pain so severe that she said she wanted to chop off her limb.\r\nTillman, now 23, told Insider that her leg would give out seemingly out of nowhere, c… [+4613 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mary Kekatos", "title": "Michigan children's hospital says it's 100% full due to RSV surge - ABC News", "description": "The hospital says RSV cases are 46% higher than last year.", "url": "https://abcnews.go.com/Health/michigan-childrens-hospital-100-full-due-rsv-surge/story?id=93116061", "urlToImage": "https://s.abcnews.com/images/Health/ann-arbor-hospital-ht-ps-221111_1668180047263_hpMain_16x9_992.jpg", "publishedAt": "2022-11-11T17:33:35Z", "content": "A Michigan pediatric hospital is reporting it is completely full due to a surge of cases linked to respiratory syncytial virus, or RSV.\r\nC.S. Mott Children's Hospital in Ann Arbor -- which is about 4… [+3043 chars]"}, {"source": {"id": null, "name": "Queerty.com"}, "author": "Daniel Villarreal", "title": "Gay men are twice as likely than straight men to have this painful disease - Queerty", "description": "Researchers said they want to study the issue more closely to find the root cause.", "url": "https://www.queerty.com/gay-men-twice-likely-straight-men-painful-disease-20221111", "urlToImage": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/11/bowel-diseases-gay-men-high-risk-sexual-activity-scaled.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&force_format=jpeg&wat=1&wat_gravity=southeast&wat_pad=70", "publishedAt": "2022-11-11T16:00:39Z", "content": "A recent study has found that gay men who participate in high-risk sexual activity are about twice as likely to be diagnosed with inflammatory bowel diseases (IBD) than straight men who participate i… [+2152 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "COVID vaccines: “We flew the aeroplane while we were still building it” - Nature.com", "description": "Recently retired head of vaccine R&D at Pfizer, Kathrin Jansen, discusses the lightning speed development of SARS-CoV-2 vaccines — and the implications for vaccine platforms.", "url": "https://www.nature.com/articles/d41573-022-00191-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41573-022-00191-2/d41573-022-00191-2_23701468.jpg", "publishedAt": "2022-11-11T15:50:55Z", "content": "Credit: Pfizer\r\nThe unique power of vaccines to prevent disease captured Kathrin Jansens imagination at an early age. I remember lining up in the school auditorium for my smallpox vaccine. I thought … [+11646 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "RSV responsible for 1 in 50 child deaths under age 5, study estimates - CNN", "description": "A new study estimates that 1 in 50 deaths of otherwise healthy children under age 5 around the world is due to a common virus that's currently surging in the US: respiratory syncytial virus, or RSV. And in high-income countries, 1 in 56 babies who are born on…", "url": "https://www.cnn.com/2022/11/10/health/rsv-deaths-study/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221110153105-rsv-young-children-deaths.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-11T13:53:00Z", "content": "A new study estimates that 1 in 50 deaths of otherwise healthy children under age 5 around the world is due to a common virus thats currently surging in the US: respiratory syncytial virus, or RSV. A… [+6564 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Tinker", "title": "What parents should watch for with respiratory illness and when it's time to go to the ER - CNN", "description": "Respiratory viruses including flu and RSV are circulating across the United States at high levels, overwhelming children's hospitals and prompting concern among parents of young children. Most kids who get sick this season will recover quickly with home care,…", "url": "https://www.cnn.com/2022/11/11/health/respiratory-illness-symptoms-hospital-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221111085246-child-flue-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-11T13:48:00Z", "content": "Respiratory viruses including flu and RSV are circulating across the United States at high levels, overwhelming childrens hospitals and prompting concern among parents of young children. Most kids wh… [+6360 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "marissa matozzo", "title": "4 Of The Worst Carbs That Almost Always Stall Your Weight Loss Efforts, According To Dietitians - SheFinds", "description": "We reached out to health experts to learn more about the four worst carbs that often prevent weight loss progress. Read more at SheFinds.com", "url": "https://www.shefinds.com/collections/4-worst-carbs-stall-weight-loss-efforts/", "urlToImage": "https://www.shefinds.com/files/2022/11/woman-eating-pasta-and-pizza.jpg", "publishedAt": "2022-11-11T13:00:58Z", "content": "Not all carbohydrates are bad, and many foods that contain carbs can help add balance and nutrients to a healthy, weight loss-friendly diet. However, there are several kinds of foods with carbs that … [+5482 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "What works better to lower cholesterol, statins or dietary supplements? - The Indian Express", "description": "As LDL cholesterol is produced inside the liver, diet plays a small role. If your LDL level is 140, it may come down to 125 with lifestyle changes. But if you give statins, it switches off the production of LDL, and bang, your reading will come down to 80, sa…", "url": "https://indianexpress.com/article/lifestyle/health-specials/what-works-better-to-lower-cholesterol-statins-or-dietary-supplements-8263276/", "urlToImage": "https://images.indianexpress.com/2022/11/doc.jpeg", "publishedAt": "2022-11-11T12:27:38Z", "content": "A recent study from the US compared the effects of statins drugs used to lower cholesterol level in the blood and commonly used supplements such as fish oil, cinnamon, garlic and turmeric. It found t… [+5272 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "World Diabetes Day 2022: 5 amazing seeds to control your blood sugar levels - Hindustan Times", "description": "From methi seeds to sabja seeds, manage your blood glucose levels with these amazing seeds that can also add flavour and fibre to your food. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-diabetes-day-2022-5-amazing-seeds-to-control-your-blood-sugar-levels-101668168131412.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/diabetes_seeds_thumb_1668168649092_1668168690172_1668168690172.jpg", "publishedAt": "2022-11-11T12:19:15Z", "content": "When it comes to managing diabetes, it is always advised to add low GI foods to your diet that prevent sudden sugar spikes. Eating non-starchy vegetables like broccoli, green leafy veggies, carrots a… [+2475 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Well+Good Editors", "title": "These 2 Superfoods Will Give Any Smoothie an Antioxidant Boost, According to an RD - Well+Good", "description": "Prepare to feature them in your go-to smoothie recipe.", "url": "https://www.wellandgood.com/antioxidant-superfoods-vitamin-shoppe/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/10/993790_VitaminShoppe_Shop_CCA_Feature-1.png", "publishedAt": "2022-11-11T11:26:15Z", "content": null}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Jessica Knibbs", "title": "Khloe Kardashian's rumoured weight loss secret slammed by doctors as drug supplies stall - The Mirror", "description": "Diabetes drugs have shot to popularity in recent years as weight loss supplements. Ozempic in particular has been rumoured to be behind Kim and Khloe Kardashian's recent weight loss - despite neither of the sisters mentioning it", "url": "https://www.mirror.co.uk/3am/celebrity-news/khloe-kardashians-rumoured-weight-loss-28464478", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article28458281.ece/ALTERNATES/s1200/1_FILE-Khlo-Kardashian-And-Tristan-Thompson-Expecting-Second-Child-Via-Surrogate.jpg", "publishedAt": "2022-11-11T11:23:32Z", "content": "Ozempic is a prescription drug used to help Type 2 diabetics to manage their blood sugar levels. \r\nBy lowering these levels, their risk for serious health outcomes linked with diabetes is also reduce… [+3192 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jillian Wilson", "title": "COVID, Flu Or RSV? Here's How To Tell The Difference. - HuffPost", "description": "It can be pretty hard to tell these circulating viruses apart, but experts share some tips for deciphering your symptoms.", "url": "https://www.huffpost.com/entry/covid-flu-rsv-symptoms_l_636c0ddbe4b01727bbd44f18", "urlToImage": "https://img.huffingtonpost.com/asset/636c15cd25000060009e9670.jpeg?cache=gKzb3sMlm7&ops=1200_630", "publishedAt": "2022-11-11T10:45:03Z", "content": "There aren't many different telltale signs for these viruses, but there are a few.\r\nThree respiratory viruses are circling at a high rate right now the flu, COVID-19 and RSV (or respiratory syncytial… [+8382 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Caroline Bologna", "title": "Does Cracking Your Knuckles Give You Arthritis? - HuffPost", "description": "Doctors weigh in on this common warning from parents.", "url": "https://www.huffpost.com/entry/crack-knuckles-arthritis_l_63613b49e4b045895a96c4a2", "urlToImage": "https://img.huffingtonpost.com/asset/636d6c052200005c00f91ee5.jpeg?cache=67rZiFijBk&ops=1200_630", "publishedAt": "2022-11-11T10:45:03Z", "content": "I dont remember how old I was when I first heard someone say, Dont crack your knuckles! Itll give you arthritis! But I do know that ever since then, Ive felt a weird pang of guilt any time I do it. \r… [+6545 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Way To Lose Weight Could Change Your Metabolism - SciTechDaily", "description": "According to new research, protein restriction is effective in combating obesity and diabetes. According to a study comparing the effects of protein and calorie restriction diets in humans, reducing protein consumption may help control metabolic syndrome and …", "url": "https://scitechdaily.com/a-new-way-to-lose-weight-could-change-your-metabolism/", "urlToImage": "https://scitechdaily.com/images/Weight-Loss-Concept-Before-and-After.jpg", "publishedAt": "2022-11-11T10:40:21Z", "content": "BySão Paulo Research FoundationNovember 11, 2022\r\nThe study involved twenty-one different patients with metabolic syndrome. They were given either a calorie-restricted or protein-restricted diet.\r\nAc… [+7030 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Davies", "title": "Evening primrose oil may help women orgasm, study claims - Daily Mail", "description": "EXCLUSIVE: An Iranian study of 60 married women found those who took primrose oil nightly rated their sex higher after eight weeks than those who were given a placebo pill.", "url": "https://www.dailymail.co.uk/health/article-11413385/Evening-primrose-oil-help-women-orgasm-study-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/10/18/64418277-0-image-a-5_1668105884408.jpg", "publishedAt": "2022-11-11T10:03:57Z", "content": "It's typically taken by menopausal women who are trying to deal with hot flushes while they sleep.\r\nBut experts claim evening primrose oil could actually heat up the nights of women yet to go through… [+3722 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "This Cancer Treatment Actually Works Better After COVID Vaccination - ScienceAlert", "description": "Clinicians have been concerned that COVID-19 vaccines would lessen the effectiveness of drugs used to treat nasopharyngeal cancer, a type of cancer that affects the throat, but a new study shows the opposite: The COVID-19 vaccine actually helps with...", "url": "https://www.sciencealert.com/this-cancer-treatment-actually-works-better-after-covid-vaccination", "urlToImage": "https://www.sciencealert.com/images/2022/11/CovidVaccine.jpg", "publishedAt": "2022-11-11T06:13:15Z", "content": "Clinicians have been concerned that COVID-19 vaccines would lessen the effectiveness of drugs used to treat nasopharyngeal cancer, a type of cancer that affects the throat, but a new study shows the … [+3051 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "A Bone-Eating Pathogen From Thousands of Years Ago Is Still Circulating Inside Us - ScienceAlert", "description": "Tuberculosis (TB) is usually found in the lungs, but there's an ancient lineage of TB that specializes in spreading to the bones and damaging them from the inside, researchers have discovered.", "url": "https://www.sciencealert.com/a-bone-eating-pathogen-from-thousands-of-years-ago-is-still-circulating-inside-us", "urlToImage": "https://www.sciencealert.com/images/2022/11/MycobacteriumTuberculosisCloseup.jpg", "publishedAt": "2022-11-11T05:55:53Z", "content": "Tuberculosis (TB) is usually found in the lungs, but there's an ancient lineage of TB that specializes in spreading to the bones and damaging them from the inside, researchers have discovered.\r\nSpina… [+3321 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "High cholesterol early symptom: Spasms or leg cramps could be the first noticeable sign of clogged arteries - Times of India", "description": "When there is too much cholesterol in your blood, it starts accumulating in your arteries and can lead to some bodily signals which should not be ignored.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/high-cholesterol-early-symptom-spasms-or-leg-cramps-could-be-the-first-noticeable-sign-of-clogged-arteries/photostory/95305291.cms", "urlToImage": "https://static.toiimg.com/photo/95305316.cms", "publishedAt": "2022-11-11T05:09:09Z", "content": "In order to lower your cholesterol levels, avoid foods of animal origin, such as liver and other organ meats, egg yolks, and whole milk dairy products. Fill up your daily diet with whole-grain cereal… [+362 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Ipsita Bhattacharya", "title": "High blood sugar: Fruit juice to French fries - 7 food items to avoid in Type 2 diabetes - Zee News", "description": "Diabetes or high blood sugar plagues so many across the world and according to the  World Health Organization (WHO), the number of people with diabetes rose from 108 million in 1980 to 422 million in 2014.", "url": "https://zeenews.india.com/health/high-blood-sugar-fruit-juice-to-french-fries-7-food-items-to-avoid-in-type-2-diabetes-2533511", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/10/1115160-french-fries-pixabay.jpg", "publishedAt": "2022-11-11T01:53:00Z", "content": "Foods to avoid with Type 2 diabetes: Diabetes or high blood sugar plagues so many across the world and according to the  World Health Organization (WHO), the number of people with diabetes rose from … [+3035 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Measles outbreak erupts among unvaccinated children in Ohio daycare - Ars Technica", "description": "Officials reportedly expect that more cases will be identified.", "url": "https://arstechnica.com/science/2022/11/measles-outbreak-erupts-among-unvaccinated-children-in-ohio-daycare/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2019/02/132_lores-700x380.jpg", "publishedAt": "2022-11-10T22:33:05Z", "content": "Enlarge/ This child, who had been ill with measles, exhibited the characteristic rash on the fourth day of its evolution. Measles can cause hearing loss, brain damage, and be fatal to young children.… [+4824 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Connecting unhealthy lifestyles to COVID-19 deaths - Medical Xpress", "description": "The American Journal of Medicine has published an article recognizing the link between unhealthy lifestyle behaviors and the one million COVID-19 deaths in the United States. Dr. Carl \"Chip\" Lavie, Medical Director Cardiac Rehabilitation and Prevention at the…", "url": "https://medicalxpress.com/news/2022-11-unhealthy-lifestyles-covid-deaths.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/connecting-unhealthy-l.jpg", "publishedAt": "2022-11-10T22:09:02Z", "content": "The American Journal of Medicine has published an article recognizing the link between unhealthy lifestyle behaviors and the one million COVID-19 deaths in the United States. Dr. Carl \"Chip\" Lavie, M… [+2230 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Blood Stem Cell Transplant Could Reboot Immune System in Multiple Sclerosis Patients - Neuroscience News", "description": "80% of patients with multiple sclerosis remain disease-free for the long term following an autologous hematopoietic stem cell transplant.", "url": "https://neurosciencenews.com/blood-stem-cell-multiple-sclerosis-21816/", "urlToImage": "https://neurosciencenews.com/files/2022/11/blood-transplant-ms-immune-neurosinces-public.jpg", "publishedAt": "2022-11-10T21:34:11Z", "content": "Summary: 80% of patients with multiple sclerosis remain disease-free for the long term following an autologous hematopoietic stem cell transplant.\r\nSource: University of Zurich\r\nEvery day, one person… [+6395 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Yahoo Canada Lifestyle Editors", "title": "8 celebrities who have opened up about prostate cancer: What you need to know - Yahoo Life", "description": "From Robert De Niro to Ian McKellan, these eight celebrities have opened up about their experience with prostate cancer.", "url": "https://www.yahoo.com/lifestyle/8-celebrities-who-opened-up-prostate-cancer-210045384.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7GJFi2cFHU_3r7fWWijskA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NTE-/https://s.yimg.com/os/creatr-uploaded-images/2022-11/b693bb60-6126-11ed-bd7f-54fed5a0fb5f", "publishedAt": "2022-11-10T21:00:45Z", "content": "Prostate cancer is a serious health issue among men. These eight celebrities have opened up about their experiences with the disease. (Photos via Getty Images)\r\nIt's November, which means Movember is… [+5076 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gabriele Regalbuto, Zoe Szathmary", "title": "Flu symptoms and prevention: Everything you need to know about common signs, treatment, and avoiding influenza - Fox News", "description": "Prevent the flu by washing your hands, taking supplements recommended by your doctor, exercising, and more. Here is how to keep the flu away all winter.", "url": "https://www.foxnews.com/health/flu-symptoms-prevention-avoid-treat-common-signs-influenza", "urlToImage": "http://media2.foxnews.com/BrightCove/694940094001/2017/10/09/694940094001_5603217429001_5603210356001-vs.jpg", "publishedAt": "2022-11-10T20:41:00Z", "content": "Muscle aches, fevers, chills: influenza can be an unpleasant experience during chilly weather. Chances are many of you have already been feeling the flus nasty effects.\r\nThe respiratory illness can a… [+8158 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "World’s Largest Autism Whole Genome Sequencing Study Reveals 134 Autism-Linked Genes - Neuroscience News", "description": "Researchers have identified 134 genes associated with autism and a range of genetic alterations associated with ASD. Notably, the study identified changes in copy number variations with likely associations with ASD, including autism-associated variants in 14%…", "url": "https://neurosciencenews.com/asd-genetics-21814/", "urlToImage": "https://neurosciencenews.com/files/2022/11/asd-genetics-neurosicnes-public.jpg", "publishedAt": "2022-11-10T20:21:36Z", "content": "Summary: Researchers have identified 134 genes associated with autism and a range of genetic alterations associated with ASD. Notably, the study identified changes in copy number variations with like… [+6741 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Cortney Moore", "title": "CDC warns dental patients of rare bacterial infections via waterlines - Fox News", "description": "Dental patients can be at risk of contracting nontuberculous mycobacteria or other infections from dental waterlines that have a high amount of bacteria in their water supple, the CDC warns.", "url": "https://www.foxnews.com/health/cdc-warns-dental-patients-rare-bacterial-infections-waterlines", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/10/iStock-1250434172.jpg", "publishedAt": "2022-11-10T19:24:46Z", "content": "The U.S. Centers for Disease Control and Prevention (CDC) has issued an emergency response and preparedness health advisory about outbreaks of nontuberculous mycobacteria infections that have happene… [+5335 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Why Eye Contact Is Rare Among People With Autism - Neuroscience News", "description": "During eye contact, those with ASD have significantly reduced activity in the dorsal parietal cortex compared to those who are not on the autism spectrum.", "url": "https://neurosciencenews.com/asd-eye-contact-21813/", "urlToImage": "https://neurosciencenews.com/files/2022/11/eye-contact-asd-neurosicnecce-public.jpg", "publishedAt": "2022-11-10T19:05:22Z", "content": "Summary: During eye contact, those with ASD have significantly reduced activity in the dorsal parietal cortex compared to those who are not on the autism spectrum.\r\nSource: Yale\r\nA hallmark of autism… [+3042 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Post-COVID-19-associated morbidity in children, adolescents, and adults: A matched cohort study including more than 157000 individuals with COVID-19 in Germany - PLOS", "description": "In a matched cohort study from Germany, including more than 157,000 individuals with COVID-19, Dr. Martin Roessler and colleagues investigate post COVID-19 associated morbidity in children, adolescents, and adults.", "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004122", "urlToImage": "https://journals.plos.org/plosmedicine/article/figure/image?id=10.1371/journal.pmed.1004122.g003&size=inline", "publishedAt": "2022-11-10T19:04:26Z", "content": "Citation: Roessler M, Tesch F, Batram M, Jacob J, Loser F, Weidinger O, et al. (2022) Post-COVID-19-associated morbidity in children, adolescents, and adults: A matched cohort study including more th… [+49289 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Donuts, chips and pizza should be redefined as DRUGS, scientist say - Daily Mail", "description": "Researchers from Michigan and Virginia found that highly processed foods match the same definitions of addictions set by US health officials for nicotine in the 1980s.", "url": "https://www.dailymail.co.uk/health/article-11413339/Donuts-chips-pizza-redefined-DRUGS-scientist-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/10/19/64276649-0-In_2019_over_10_per_cent_of_deaths_among_Brazilians_aged_30_69_w-a-6_1668106815195.jpg", "publishedAt": "2022-11-10T18:48:52Z", "content": "Highly-processed foods should be reclassified as drugs because they are as addictive and harmful as cigarettes, scientists argue.\r\nResearchers claim items like donuts, sugary cereals and pizza meet t… [+8088 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jack Hobbs", "title": "I'm a dentist and these four signs could indicate oral cancer - New York Post ", "description": "A dentist explained the four things people should be looking out for.", "url": "https://nypost.com/2022/11/10/im-a-dentist-and-these-four-signs-could-indicate-oral-cancer/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/11/thelondondentist-94-1.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-11-10T18:31:00Z", "content": "Open wide!\r\nA dentist has gone viral on TikTok by explaining the four different warning signs of oral cancer people should look out for.\r\nDr. Vikas Prinja posted the video Wednesday and it has receiv… [+1442 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "Do This to Avoid 'Protein Hunger' - Lifehacker", "description": "A new study suggests we overeat because our bodies are hungry for protein.", "url": "https://lifehacker.com/do-this-to-avoid-protein-hunger-1849768279", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/988695d530f397534705a07eac1a80b2.jpg", "publishedAt": "2022-11-10T18:30:00Z", "content": "Protein is great. Our bodies are largely made of protein, and if you lift weights, I bet you already know that eating enough protein is important for building muscle. But what if you just want to be … [+5737 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Louise Bond", "title": "Is there a link between vitamin D and depression? - Livescience.com", "description": "Discover what emerging research tells us about the relationship between vitamin D and depression", "url": "https://www.livescience.com/vitamin-d-and-depression", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mzqpSh9GTv2sM5oVvJCn8b-1200-80.jpg", "publishedAt": "2022-11-10T18:00:26Z", "content": "Vitamin D has long been known to be essential when it comes to keeping bones strong and boosting the immune system, but is there a link between vitamin D and depression? While the research findings a… [+6954 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Hypertension linked to increased risk for severe COVID-19 - Medical Xpress", "description": "Hypertension is a risk factor for severe COVID-19, with a dose-response relationship for elevated systolic blood pressure (SBP) with severe COVID-19, according to a study published online Nov. 9 in PLOS ONE.", "url": "https://medicalxpress.com/news/2022-11-hypertension-linked-severe-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/hypertension-linked-to.jpg", "publishedAt": "2022-11-10T17:50:01Z", "content": "Hypertension is a risk factor for severe COVID-19, with a dose-response relationship for elevated systolic blood pressure (SBP) with severe COVID-19, according to a study published online Nov. 9 in P… [+1777 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Karen Weintraub, USA TODAY", "title": "New cancer therapy takes personalized medicine to a new level - Yahoo", "description": "New research combines several cutting-edge technologies to deliver personalized cancer care, offering future hope for-hard-to treat patients.", "url": "https://www.usatoday.com/story/news/health/2022/11/10/new-cancer-treatment-personalized-medicine/8313827001/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3HumY_moBMUIlLoox3tZFg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://media.zenfs.com/en/usa_today_news_641/e8e5333b571a3fc40cae3d6f50164e48", "publishedAt": "2022-11-10T16:47:43Z", "content": "Personalized care has been a buzzword in medicine for years, but new research on cancer treatment is taking it to a new level.\r\nDetailed in a study published Thursday in Nature, the new approach comb… [+5927 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Divergent SARS-CoV-2 variant emerges in white-tailed deer with deer-to-human transmission - Nature.com", "description": "White-tailed deer are a potential reservoir of SARS-CoV-2 variants.", "url": "https://www.nature.com/articles/s41564-022-01268-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41564-022-01268-9/MediaObjects/41564_2022_1268_Fig1_HTML.png", "publishedAt": "2022-11-10T16:28:00Z", "content": "Deer sample collection and study area\r\nBetween 1 November and 31 December 2021, adult and yearling free-ranging white-tailed deer were sampled as part of the Ontario Ministry of Natural Resources and… [+25506 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genome–microbiome interplay provides insight into the determinants of the human blood metabolome - Nature.com", "description": "Diener and Dai et al. analyse blood metabolites from 1,569 individuals and identify metabolites associated with the microbiome, host genetics or under hybrid genetic–microbiome control.", "url": "https://www.nature.com/articles/s42255-022-00670-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs42255-022-00670-1/MediaObjects/42255_2022_670_Fig1_HTML.png", "publishedAt": "2022-11-10T16:06:20Z", "content": "<li>Bar, N. et al. A reference map of potential determinants for the human serum metabolome. Nature588, 135140 (2020).\r\nArticle \r\n PubMed \r\nGoogle Scholar \r\n</li><li>Wang, X. &amp; Paigen, B. Genetic… [+11644 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Experimental cancer vaccine shows promise in animal studies - EurekAlert", "description": "An experimental therapeutic cancer vaccine induced two distinct and desirable immune system responses that led to significant tumor regression in mice, report investigators from the National Institute of Allergy and Infectious Diseases (NIAID), part of the Na…", "url": "https://www.eurekalert.org/news-releases/970898", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/34e2f929-cc92-4ff7-a0fd-3cd21d4a1e37/Rendition/thumbnail/Content/Public", "publishedAt": "2022-11-10T15:44:43Z", "content": "image: Colorized scanning electron micrograph of a T lymphocyte.view more \r\nCredit: NIAID\r\nWHAT:An experimental therapeutic cancer vaccine induced two distinct and desirable immune system responses t… [+3122 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Savannah Tryens-Fernandes | stryens-fernandes@al.com", "title": "Two adults, one child dead from flu as virus surges through Alabama - AL.com", "description": "According to ADPH, influenza is especially severe in young children resulting in “a surge of admissions” at Children’s of Alabama.", "url": "https://www.al.com/news/2022/11/two-adults-one-child-dead-from-flu-as-virus-surges-through-alabama.html", "urlToImage": "https://www.al.com/resizer/QFd9ZH57JE_e_18DFKc_L_6MGnM=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/F2L5BYNDJZDI3DBZQBWQQM2WLQ.PNG", "publishedAt": "2022-11-10T15:33:00Z", "content": "The Alabama Department of Health reported two adults and one child have died of influenza-like illness this season as the virus continues to circulate throughout the state.\r\nIn its weekly influenza r… [+2580 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Beth Ellwood", "title": "Exercise can reduce feelings of hopelessness among patients in suicide crisis, pilot study finds - PsyPost", "description": "A new study published in the Journal of Psychiatric Research found preliminary evidence that exercise can alleviate distress among patients in suicide crisis. Inpatients in a psychiatric short stay unit reported reduced feelings of hopelessness after particip…", "url": "https://www.psypost.org/2022/11/exercise-can-reduce-feelings-of-hopelessness-among-patients-in-suicide-crisis-pilot-study-finds-64257", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/11/woman-jogging-nature.jpg", "publishedAt": "2022-11-10T14:18:10Z", "content": "A new study published in the Journal of Psychiatric Research found preliminary evidence that exercise can alleviate distress among patients in suicide crisis. Inpatients in a psychiatric short stay u… [+5789 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Debbie Holloway", "title": "Trouble Swallowing May Indicate Esophageal Cancer — Best Life - Best Life", "description": "Trouble swallowing is a common early sign of esophageal cancer. Here's what to watch for, and why to take it seriously if you notice it.", "url": "https://bestlifeonline.com/esophageal-cancer-swallowing-symptom-news/", "urlToImage": "https://bestlifeonline.com/wp-content/uploads/sites/3/2022/11/shutterstock_2035212296.jpg?quality=82&strip=all", "publishedAt": "2022-11-10T13:05:16Z", "content": "These days, it seems like everyone's life has been touched by cancer in some way. Most people could make a list of friends and family members who have suffered from breast cancer, melanoma, or colon … [+5441 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "marissa matozzo", "title": "3 Rules Doctors Say You Should Follow If You Want To Lose Weight And Not Gain It Back - Yahoo Life", "description": "We checked in with health and weight loss experts for tips and suggestions related to dieting and preventing weight gain at SheFinds.com", "url": "https://www.shefinds.com/collections/doctors-snacking-mistakes-weight-gain/", "urlToImage": "https://www.shefinds.com/files/2022/09/woman-stepping-on-a-scale.jpg", "publishedAt": "2022-11-10T13:00:49Z", "content": "This article has been updated since it was originally published to include more expert insight. \r\nMaintaining a healthy weight is all about creating a balanced diet for yourself, hydrating frequently… [+5605 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "'We're Not Permitted to Make the Connection': Social Worker Shares Aftermath of COVID Vaccine Injury - The Epoch Times", "description": "As a social worker known for her expertise when handling high-stress conflict management cases, Angela Loerzel Swafford figured ...", "url": "https://www.theepochtimes.com/health/were-not-permitted-to-make-the-connection-social-worker-shares-aftermath-of-covid-vaccine-injury_4853372.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/11/10/3835464102845116993-2-1200x720.jpg", "publishedAt": "2022-11-10T13:00:25Z", "content": "As a social worker known for her expertise when handling high-stress conflict management cases, Angela Loerzel Swafford figured shed navigate her own concerns when it came to addressing her employers… [+8846 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: The right way to follow a low-carb diet for controlling blood sugar - Hindustan Times", "description": "In order to maintain a low-carb diet, you should consider both what you add to your diet and what you eliminate for health benefits. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-the-right-way-to-follow-a-low-carb-diet-for-controlling-blood-sugar-101668083295454.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/10/1600x900/low_carb_diet_1668083391455_1668083398445_1668083398445.jpg", "publishedAt": "2022-11-10T12:38:26Z", "content": "Low-carb diets have been traditionally used as a treatment for diabetes and are effective in keeping your blood sugar levels in control. According to a study, people with type 2 diabetes who consumed… [+1847 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Teddy Amenabar", "title": "Crossword puzzles may benefit people with mild cognitive impairment - The Washington Post", "description": "New study finds that regularly trying the daily crossword may help slow decline in some people with mild cognitive impairment, an early stage of faltering memory.", "url": "https://www.washingtonpost.com/wellness/2022/11/10/crossword-memory-loss-brain-games/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XBCLHP6JD5BN3MI5KBHBFA7GSM.jpg&w=1440", "publishedAt": "2022-11-10T12:36:56Z", "content": "Comment on this story\r\nRichard Sima will return next week.\r\nFor years, scientists have been trying to figure out whether brain workouts such as puzzles and online cognitive games could strengthen our… [+6203 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "How To Regain Muscle Mass: 6 Everyday Habits To Do After 60 - Eat This, Not That", "description": "Aging means losing lean muscle mass, but you can prevent the decline with these six everyday habits to regain muscle mass after 60.", "url": "https://www.eatthis.com/how-to-regain-muscle-mass-after-60/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/11/older-man-rowing-machine.jpg?quality=82&strip=all", "publishedAt": "2022-11-10T11:01:11Z", "content": "Growing older doesn't only mean pesky gray hairs and sneaky wrinkles shocking the heck out of you when you look in the mirror. There are a lot of changes your body endures underneath the surfaceone o… [+4337 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Aivaras Kaziukonis", "title": "40 Weird Allergies That Might Sound Unbelievable But Are Real - Bored Panda", "description": "As a person with an unexplained allergy that causes me to look like a toad and itch after napping in a field of nettles from time to time, I find these weird allergies so very relatable. Really, you can never know what your not-so-loyal body will throw at you…", "url": "https://www.boredpanda.com/weird-allergies/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2022/11/weird-allergies-fb38.png", "publishedAt": "2022-11-10T08:51:42Z", "content": null}]}