{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Aap.org"}, "author": null, "title": "Managing Acute and Chronic Pain and Substance Use Disorders in Pediatrics - AAP - American Academy of Pediatrics", "description": "This course will meet the government mandated requirement for all DEA registered practitioners to complete eight hours of training on the treatment and man", "url": "https://shop.aap.org/Managing-Acute-and-Chronic-Pain-and-Substance-Use-Disorders-in-Pediatrics/", "urlToImage": "https://shop.aap.org/globalassets/inriver/resources/13126-60570-Managing-Acute-Pain-042023-Product.png", "publishedAt": "2023-04-25T00:27:10Z", "content": "This course will meet the government mandated requirement for all DEA registered practitioners to complete eight hours of training on the treatment and management of patients with opioid or other sub… [+1895 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Alex Mitchell", "title": "This sleeping pill may be key to battling Alzheimer's disease - New York Post ", "description": "A new study stresses the importance of a good night’s sleep in staving off cognitive decline.", "url": "https://nypost.com/2023/04/24/this-sleeping-pill-may-be-key-to-battling-alzheimers/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/sleeping-bill-comp.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-04-24T23:52:00Z", "content": "New data further points to a connection between poor sleep and Alzheimer’s disease, according to researchers at Washington University School of Medicine in St. Louis, Missouri.\r\nThe FDA-approved inso… [+2985 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Link Found Between Common Ear, Nose, and Throat Infections in Preschoolers and Increased Risk of Autism - Neuroscience News", "description": "Preschoolers with common ear, nose, and throat (ENT) issues may be at risk of autism or high levels of autism traits, according to a study published in BMJ Open. The research, which tracked over 10,000 children from birth, suggests that early identification a…", "url": "https://neurosciencenews.com/asd-ent-infections-23099/", "urlToImage": "https://neurosciencenews.com/files/2023/04/childhood-infection-asd-neurosincnes-public.jpg", "publishedAt": "2023-04-24T22:49:08Z", "content": "Summary: Preschoolers with common ear, nose, and throat (ENT) issues may be at risk of autism or high levels of autism traits, according to a study published in BMJ Open. The research, which tracked … [+6315 chars]"}, {"source": {"id": null, "name": "TODAY"}, "author": "Marguerite Ward", "title": "6 ways to calm anxiety in 5 minutes - AOL", "description": "Need a break? Use these tips to press pause and de-stress.", "url": "https://www.today.com/health/how-deal-stress-daily-basis-t126882", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LQ6a3eo0SF2BtTWhNaRckA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/aol_the_today_show_594/732aea4e5ba71ed790aa7205a2b4128e", "publishedAt": "2023-04-24T22:05:40Z", "content": "Stress is an an avoidable fact of life. And some of it is actually good for us, helping us develop resilience and fueling motivation and productivity. But the constant stream of somber news and a nev… [+4671 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Prioritizing Brain Health: Blood Pressure Control Reduces Alzheimer's Risk and Minimizes Brain Aging - Neuroscience News", "description": "A recent study suggests that intensive blood pressure treatment with a target of less than 120 mm Hg can reduce the risk of adverse cerebrovascular events and improve overall brain health in adults over 50. Patients who more intensely managed their hypertensi…", "url": "https://neurosciencenews.com/blood-pressure-brain-aging-23097/", "urlToImage": "https://neurosciencenews.com/files/2023/04/blood-pressure-brain-health-neurosinces-public.jpg", "publishedAt": "2023-04-24T21:51:27Z", "content": "Summary: A recent study suggests that intensive blood pressure treatment with a target of less than 120 mm Hg can reduce the risk of adverse cerebrovascular events and improve overall brain health in… [+6616 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Males with Neurodevelopmental Disorders Face Higher Risk of Testicular Cancer - Neuroscience News", "description": "Men with neurodevelopmental disorders, such as autism or ADHD, have a slightly higher risk of developing testicular cancer than those without such disorders. The research is the first to provide a link between neurodevelopmental disorders and testicular cance…", "url": "https://neurosciencenews.com/neurodevelopment-testicular-cancer-23097/", "urlToImage": "https://neurosciencenews.com/files/2023/04/neurodevelopment-testicular-cancer-neurosinces-public.jpg", "publishedAt": "2023-04-24T21:31:08Z", "content": "Summary: Men with neurodevelopmental disorders, such as autism or ADHD, have a slightly higher risk of developing testicular cancer than those without such disorders. The research is the first to pro… [+5580 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Deadlines Don't Cut It: Stress Levels Remain Unchanged, Regardless of Timelines - Neuroscience News", "description": "Researchers have discovered that deadlines may not be as stressful as previously believed. The study found that high sympathetic activation, which indicates how much people are \"on the tips of their toes\" and leads to stress, remains about the same with or wi…", "url": "https://neurosciencenews.com/stress-deadlines-23096/", "urlToImage": "https://neurosciencenews.com/files/2023/04/stress-deadlines-neurosciences-public.jpg", "publishedAt": "2023-04-24T21:16:54Z", "content": "Summary: Researchers have discovered that deadlines may not be as stressful as previously believed. The study found that high sympathetic activation, which indicates how much people are “on the tips … [+5649 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "High-Fat Diets During Early Life Lead to Cravings for Salty Foods Later On - Neuroscience News", "description": "In utero and early life exposure to high-fat diets result in a preference for foods that are higher in salt later in life, a new study reports. Researchers say high-fat diets increase the expression of the AT1 protein in the taste buds. This occurs as early a…", "url": "https://neurosciencenews.com/salt-craving-high-fat-diet-23095/", "urlToImage": "https://neurosciencenews.com/files/2023/04/early-diet-salty-food-neurosinces-public.jpg", "publishedAt": "2023-04-24T20:51:03Z", "content": "Summary: In utero and early life exposure to high-fat diets results in a preference for foods that are higher in salt later in life, a new study reports. Researchers say high-fat diets increase the e… [+5330 chars]"}, {"source": {"id": null, "name": "Real Simple"}, "author": "https://www.facebook.com/realsimple/", "title": "What Is Processed Food vs. Ultra-Processed Food? - Real Simple", "description": "What counts as processed food—and how is it different from ultra-processed food? Registered dietitians explain the difference, plus guiding principles to help you make smart, nutritious choices when eating and food shopping.", "url": "https://www.realsimple.com/what-are-processed-foods-and-ultra-processed-foods-7484243", "urlToImage": "https://www.realsimple.com/thmb/gIEfRRCN-navXPcFxX7SLZqUpmM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultra-processed-foods-GettyImages-1366682523-b70d866409024226ba82b4c8a24b3ecb.jpg", "publishedAt": "2023-04-24T20:24:58Z", "content": "Youve heard of processed foods before, but what about ultra-processed foods? This descriptor is gaining more attention as research around this food category unfolds. What are ultra-foods, anywayand w… [+7540 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "New Gel Treatment Wipes Out Deadly Brain Cancer in Mice - Offers Hope For Defeating Glioblastoma in Humans - Neuroscience News", "description": "Combining an anticancer drug with an antibody, researchers developed a novel gel that cured glioblastoma brain cancer in 100% of mouse models. The findings offer new hope in the fight against the most deadly form of brain cancer in humans. The gel triggers an…", "url": "https://neurosciencenews.com/brain-cancer-gel-23093/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-cancer-gel-neurosicences-public.jpg", "publishedAt": "2023-04-24T20:11:35Z", "content": "Summary: Combining an anticancer drug with an antibody, researchers developed a novel gel that cured glioblastoma brain cancer in 100% of mouse models. The findings offer new hope in the fight agains… [+4908 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "What Is Potassium Bromate—and Should You Avoid It? - EatingWell", "description": "California proposed a ban on certain food additives, including potassium bromate. Read on to learn what it is and what it means for your health.", "url": "https://www.eatingwell.com/article/8043588/what-is-potassium-bromate-should-you-avoid-it/", "urlToImage": "https://www.eatingwell.com/thmb/3j6onzqRlWhMZPG9Rph29OxUYIU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/What-Is-Potassium-Bromate-and-Should-You-Avoid-It-c8cf99c6c5734a32b2326e326761733a.jpg", "publishedAt": "2023-04-24T20:06:17Z", "content": "If you've been keeping up with the latest food news, you might have heard about California's proposed ban on certain food additives, including potassium bromate. But what exactly is potassium bromate… [+4911 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Roger Dobson", "title": "Have scientists found a way to reverse sight loss? A jab of skin cells could hold the key - Daily Mail", "description": "An estimated 250,000 people in the UK live with severe visual problems due to dry age-related macular degeneration (AMD) and there is no treatment.", "url": "https://www.dailymail.co.uk/health/article-12008141/Have-scientists-way-reverse-sight-loss-jab-skin-cells-hold-key.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/24/17/70177169-0-image-a-5_1682352527494.jpg", "publishedAt": "2023-04-24T19:42:29Z", "content": "A jab of stem cells from a patient's own skin could be the first treatment for a leading cause of sight loss.\r\nAn estimated 250,000 people in the UK live with severe visual problems due to dry age-re… [+6203 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleep Better, Live Better: Machine-Learning Method Can Predict Your Body Clock - Neuroscience News", "description": "New machine-learning method predicts body clock, helping to improve sleep and health. The technology offers personalized sleep and meal plans aligned to our personal biology, reducing risks of illness. The approach uses blood samples to predict circadian timi…", "url": "https://neurosciencenews.com/machine-learning-circadian-rhythm-23092/", "urlToImage": "https://neurosciencenews.com/files/2023/04/machine-learning-body-clock-neurosicnes-public.jpg", "publishedAt": "2023-04-24T19:40:17Z", "content": "Summary: New machine-learning method predicts the body clock, helping to improve sleep and health. The technology offers personalized sleep and meal plans aligned to our personal biology, reducing ri… [+4314 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Antiviral Pathway a Potential New Target for Alzheimer’s Treatment - Neuroscience News", "description": "Inhibiting cGAS, an innate immune system enzyme allows neurons to become more resilient to tau fibrils. The new finding may serve in the development of new therapies to help treat Alzheimer's disease and frontotemporal dementia, two neurodegenerative disorder…", "url": "https://neurosciencenews.com/ftd-alzheimers-antiviral-pathway-23091/", "urlToImage": "https://neurosciencenews.com/files/2023/04/antiviral-pathway-dementia-neurosicnes-public.jpg", "publishedAt": "2023-04-24T19:21:12Z", "content": "Summary: Inhibiting cGAS, an innate immune system enzyme allows neurons to become more resilient to tau fibrils. The new finding may serve in the development of new therapies to help treat Alzheimer’… [+6265 chars]"}, {"source": {"id": null, "name": "Bicycling"}, "author": "Elizabeth Millard", "title": "This Is the Type of Exercise You Need for a Healthier Gut - Yahoo Life", "description": "New research suggests it’s duration, not intensity, that makes a big difference in your gut health. Plus, you need to move more, more often to gain benefits.", "url": "https://www.bicycling.com/health-nutrition/a43687134/exercise-gut-health-study/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/XJ6gMd.h9vt8wkQSmNveEw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/hearst_bicycling_275/70a3566c151e3ec35737ac39bbff0f4b", "publishedAt": "2023-04-24T19:18:00Z", "content": "Do This Form of Exercise to Improve Gut HealthWestend61 - Getty Images\r\n<ul><li>New research supports the idea that physical activity can improve gut health.\r\n</li><li>The study, however, says its le… [+3032 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Nicioli", "title": "New research suggests that french fries may be linked to depression - CNN", "description": "A research team in China has found that consumption of fried food, specifically fried potatoes, could increase the risk of anxiety and depression, possibly due to the chemical acrylamide.", "url": "https://www.cnn.com/2023/04/24/health/fried-food-anxiety-depression-risk-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230423212337-02-french-fries-stock-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-24T19:01:00Z", "content": "French fries theyre greasy, starchy and a comfort food for many. \r\nBut reaching for fried foods may have a negative impact on mental health.\r\nA research team in Hangzhou, China, found that frequent c… [+5620 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JUDY SIEGEL-ITZKOVICH", "title": "3D printed microneedle patches can help bring vaccines to the masses - The Jerusalem Post", "description": "The researchers decided to work with a novel type of vaccine delivery based on patches about the size of a thumbnail that contain hundreds of microneedles.", "url": "https://www.jpost.com/health-and-wellness/article-740178", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/484227", "publishedAt": "2023-04-24T18:55:00Z", "content": "Getting vaccines to people around the world who need them is often complicated, as many need to be put in cold storage – making it difficult to ship them to remote areas that don’t have the necessary… [+6003 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Aaron Hutcherson", "title": "5 radish recipes that put their versatility on display - The Washington Post", "description": "There's a wide world of radishes. Here are recipes that feature them in soups, salads and more.", "url": "https://www.washingtonpost.com/food/2023/04/24/radish-recipes/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BIA6UPBYTSUILLT6AROGTUZ7CY.jpg&w=1440", "publishedAt": "2023-04-24T18:23:35Z", "content": "Comment on this story\r\nComment\r\nTheres a wide world of radishes. In the United States, popular radish varieties include Easter egg which can be white, pink, purple or crimson French breakfast, daikon… [+1503 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Anthea Levi, RD", "title": "I’m an RD—If You Don’t Prefer the Taste of These 4 ‘Healthier’ Low-Carb Swaps, Know That They’re Not Actually Any Better for You - Well+Good", "description": "Can we get a moment of silence for all the bagels we’ve scooped out (read: eviscerated) over the years?", "url": "https://www.wellandgood.com/low-carb-substitutes/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2023/04/Stocksy_txpc912961c2Fg300_Small_1385524.jpg", "publishedAt": "2023-04-24T18:00:36Z", "content": null}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nada Hassanein", "title": "Tinnitus and COVID vaccine: Link, symptoms, treatment explained - USA TODAY", "description": "Thousands have reported ringing in the ears, called tinnitus, after receiving a COVID-19 vaccine. Experts are exploring whether there’s a link.", "url": "https://www.usatoday.com/story/news/health/2023/04/24/tinnitus-covid-vaccine-what-we-know/11727081002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/02/28/NREP/8c1a52f6-095c-4151-a863-cdba781d01be-ChoiceHearing_Article1_1.jpg?crop=2120,1193,x0,y0&width=2120&height=1193&format=pjpg&auto=webp", "publishedAt": "2023-04-24T17:46:06Z", "content": "Thousands of people have reported ringing in the ears, called tinnitus, after being infected with COVID-19 or receiving a vaccine, and researchers are exploring whether theres a link.\r\nThe Centers fo… [+3661 chars]"}, {"source": {"id": null, "name": "Parkinson's News Today"}, "author": "Marisa Wexler, MS", "title": "New findings on brain electrodes might improve DBS in Parkinson's... - Parkinson's News Today", "description": "A new study on implanting electrodes in the brain could lead to ways to improve deep brain stimulation for Parkinson's and other disorders.", "url": "https://parkinsonsnewstoday.com/?p=89074&preview=true&preview_id=89074", "urlToImage": "https://parkinsonsnewstoday.com/wp-content/uploads/2023/04/BrainLightning.png", "publishedAt": "2023-04-24T17:42:53Z", "content": "Implanting electrodes into the brain triggers inflammation by activating a group of immune signaling proteins called the inflammasome which detects infection and, in turn, prompts a strong inflammato… [+4933 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Classical Conditioning Through Brain Stimulation - Neuroscience News", "description": "Brain activity can be conditioned through external brain stimulation, researchers discovered. The findings have implications for using TMS as a therapeutic approach, potentially leading to more straightforward treatment for conditions such as Parkinson's dise…", "url": "https://neurosciencenews.com/tms-classical-conditioning-23087/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-stimulation-classical-conditioning-neurosines-ppublic.jpg", "publishedAt": "2023-04-24T17:37:26Z", "content": "Summary: Brain activity can be conditioned through external brain stimulation, researchers discovered. The findings have implications for using TMS as a therapeutic approach, potentially leading to m… [+4821 chars]"}, {"source": {"id": null, "name": "Sun Sentinel"}, "author": "Cindy Krischer Goodman", "title": "New COVID variant arcturus arrives in Florida — with a new, odd symptom - South Florida Sun Sentinel", "description": "A new omicron subvariant is spreading in Florida,  with the potentially odd symptom of conjunctivitis.", "url": "https://www.sun-sentinel.com/health/fl-ne-arcturus-in-florida-20230424-ox5jwhg3fjbkboqp523pgcamee-story.html", "urlToImage": "https://www.sun-sentinel.com/resizer/QG7bMm1eLTz7sIpQ_535e-_nMNA=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/XK2NN7DJVREYTNH6H5JQPO2P5U.jpg", "publishedAt": "2023-04-24T17:22:03Z", "content": "A new omicron subvariant is spreading in Florida with an odd potential symptom: conjunctivitis.\r\nHelix, a surveillance company that tracks emerging variants across the nation for the Centers for Dise… [+2339 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "How Much Sugar Should You Really Have a Day? - Verywell Health", "description": "A new study confirms the negative health effects of eating too much sugar and lays out exactly how much sugar you should limit yourself to each day.", "url": "https://www.verywellhealth.com/daily-sugar-intake-study-7482959", "urlToImage": "https://www.verywellhealth.com/thmb/SsNJLxQuDcs-0_QyTI2__RlkrHY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/pexels-stas-knop-2916450-c89727cfcb1f433e86b7ebb5aacf1cdc.jpg", "publishedAt": "2023-04-24T17:14:05Z", "content": "<ul><li>Research has shown that consuming too much sugar is harmful to your health.</li><li>A new study has provided more evidence that the recommendation to limit your added sugar intake to no more … [+6485 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Study explores link between attachment styles and sexual dysfunction in young adults - PsyPost", "description": "Young adulthood is often associated with exciting developments in intimacy and relationships, but research showing increased sexual dysfunction among the 18-25 age group has emerged in recent years. A study published in The Journal of Sex Research explores ho…", "url": "https://www.psypost.org/2023/04/study-explores-link-between-attachment-styles-and-sexual-dysfunction-in-young-adults-77874", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/08/unhappy-couple-in-bed.jpg", "publishedAt": "2023-04-24T17:10:34Z", "content": "Young adulthood is often associated with exciting developments in intimacy and relationships, but research showing increased sexual dysfunction among the 18-25 age group has emerged in recent years. … [+4043 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Pandemic officially over? US Covid deaths hit record new record low - Daily Mail", "description": "Figures from the Centers for Disease Control and Prevention ( CDC ) revealed there were 1,160 deaths over the week to April 19, 2023, the latest available.", "url": "https://www.dailymail.co.uk/health/article-12007739/US-Covid-deaths-hit-lowest-point-pandemic-began.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/24/17/70177881-0-image-a-25_1682353703513.jpg", "publishedAt": "2023-04-24T16:08:01Z", "content": "America's Covid deaths have fallen to a new record low and their lowest levels since March 2020, official data shows.\r\nFigures from the Centers for Disease Control and Prevention (CDC) revealed there… [+4325 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "'Truly gobsmacked': Ancient-human genome count surpasses 10,000 - Nature.com", "description": "The majority of sequences come from people who lived in Western Eurasia, but samples from other regions are on the rise.", "url": "https://www.nature.com/articles/d41586-023-01403-4", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01403-4/d41586-023-01403-4_25275042.jpg", "publishedAt": "2023-04-24T16:08:01Z", "content": "These 2000-year-old human remains were found in a stone chambered cairn in Greenland. Advances in DNA sequencing have prompted to a rapid increase in ancient-genome research.Credit: Ashley Cooper/Get… [+3529 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Lockdown's cancer bomb may soon be worse than Covid itself - msnNOW", "description": "Lockdown’s cancer bomb may soon be worse than Covid itself", "url": "https://www.telegraph.co.uk/news/2023/04/24/lockdowns-cancer-bomb-may-soon-be-worse-than-covid-itself/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1agNwp.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-04-24T16:05:34Z", "content": "Turning the NHS into a Covid service during the pandemic was always going to end in catastrophe. Dealing with a stage one cancer is infinitely easier and consumes far fewer resources than a tumour wh… [+4662 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Philip Finkelstein", "title": "Why long COVID could be a ticking time bomb for public health - Salon", "description": "Long COVID isn't novel: other viruses in history have had similar “long” arcs — with devastating repercussions", "url": "https://www.salon.com/2023/04/24/long-parkinsons/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/04/research_long_covid_protest_sign_1239063745.jpg", "publishedAt": "2023-04-24T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Newser"}, "author": "John Johnson", "title": "Alcohol's 'Health Halo' Is Losing Its Luster - Newser", "description": "Slate digs into the shifting sentiment, offers context for those who imbibe", "url": "https://www.newser.com/story/334397/alcohols-health-halo-is-finally-fading.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1468880-12-20230424104342.jpeg", "publishedAt": "2023-04-24T15:30:00Z", "content": "Those who drink alcohol might well be \"feeling a fair bit of whiplash\" these days, writes Tim Requarth at Slate. Starting in the 1990s, the consensus of health studies suggested that moderate drinkin… [+1636 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Cameron Jones", "title": "While Alzheimer's Might Seem Out of Your Hands, There Are a Few Risk Factors You Might Be Able To Control - Yahoo Life", "description": "Take a look at your lifestyle.", "url": "https://www.yahoo.com/lifestyle/while-alzheimers-might-seem-hands-152634711.html", "urlToImage": "https://media.zenfs.com/en/woman_s_world_418/d9bbab5e803864ffadd2014f7b9ef8b7", "publishedAt": "2023-04-24T15:26:34Z", "content": "Christine Bryden was gobsmacked in 1995, when doctors diagnosed her with Alzheimers. Only a year before, the 46-year-old biochemist had won Australias Public Service Medal for outstanding work in sci… [+10178 chars]"}, {"source": {"id": null, "name": "Health.com"}, "author": "https://www.facebook.com/Health/", "title": "10 Carbs You Need in Your Diet, According to a Dietitian - Health.com", "description": "Carbs aren't the enemy. These 10 high-carb foods are nutrient rich and protect your health.", "url": "https://www.health.com/carbs-you-need-in-your-diet-7482393", "urlToImage": "https://www.health.com/thmb/-BtMxAikOBuYiWGy6agJVD5z6D0=/2194x0/filters:no_upscale():max_bytes(150000):strip_icc()/BestCarbsForYourHealth-e1966f39da9c420a95fb7e228a192500.jpg", "publishedAt": "2023-04-24T15:03:32Z", "content": "Although carbohydrates get a bad rap for causing your blood glucose to rise too quickly, not all carbs are created equal. While a diet high in refined carbohydrates and added sugar (such as white ric… [+13234 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Carbon monoxide deaths are climbing, putting families in peril: ‘My son is lucky to be alive’ - Fox News", "description": "Kristie Dusenberry, an Idaho mother and grandmother, nearly lost her son to carbon monoxide poisoning recently. Experts share safety tips to combat rising rates of exposure and to stay healthy.", "url": "https://www.foxnews.com/health/carbon-monoxide-deaths-climbing-putting-families-peril-son-lucky-alive", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/brenden-dusenberry-split.jpg", "publishedAt": "2023-04-24T15:02:00Z", "content": "Often dubbed \"the silent killer,\" carbon monoxide is colorless and odorless its been shown to cause severe injury or death in hours or even minutes.\r\nBetween 2009 and 2019, deaths from non-fire-relat… [+9987 chars]"}, {"source": {"id": null, "name": "Delish.com"}, "author": null, "title": "Best Lemon Butter Feta Chicken Pasta Recipe - How To Make Butter Feta Pasta - Delish", "description": "Feta and pasta strike again.", "url": "https://www.delish.com/cooking/recipe-ideas/a43604316/lemon-butter-feta-chicken-pasta-recipe/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/lemonbutterfetachickenpasta-index-6442fb419fa42.jpeg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2023-04-24T14:50:02Z", "content": "A creamy, rich pasta sauce with fresh lemon and tangy feta, plus juicy chicken thighs all come together in one pot for a very simple but satisfying meal. Its the even easier version of everyones favo… [+410 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Microplastics Can Enter The Brain After Ingestion, Finds Breakthrough Animal Study - IFLScience", "description": "Microplastics have previously been found in human placentas, but it could be even worse.", "url": "https://www.iflscience.com/microplastics-detected-entering-the-brain-just-2-hours-after-ingestion-68593", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68593/aImg/67439/microplastics-meta.jpg", "publishedAt": "2023-04-24T14:42:20Z", "content": "Microplastics can cross the blood-brain barrier and enter the brain after being ingested, a new study on mice reveals. The brains of mice fed micro- and nano-plastics (MNPs) were found to contain the… [+2753 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn, Luke Andrews", "title": "Florida boy nicknamed 'ninja turtle' by his parents after being born with a 'shell' on his back - Daily Mail", "description": "Nicknamed a 'little ninja-turtle' by his parents, James from Clearwater in Florida, waited two months for a diagnosis as the mass grew into what looked like a large mole.", "url": "https://www.dailymail.co.uk/health/article-12006765/Florida-boy-nicknamed-ninja-turtle-parents-born-shell-back.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/24/17/70174713-0-image-a-5_1682352086880.jpg", "publishedAt": "2023-04-24T14:07:59Z", "content": "A baby born with a 'shell' growth on his back due to a rare skin condition has been nicknamed the 'little ninja turtle' by his parents. \r\nEighteen-month-old James McCallum from Clearwater, Florida, s… [+6742 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "First-time experiences with alcohol and cannabis appear to predict future substance abuse - PsyPost", "description": "A recent study provides evidence that the initial subjective effects of alcohol and cannabis can vary greatly among individuals and may be indicative of future substance abuse problems. The new findings have been published in Experimental and Clinical Psychop…", "url": "https://www.psypost.org/2023/04/first-time-experiences-with-alcohol-and-cannabis-appear-to-predict-future-substance-abuse-77707", "urlToImage": "https://www.psypost.org/wp-content/uploads/2021/02/brain-1.jpg", "publishedAt": "2023-04-24T14:00:24Z", "content": "A recent study provides evidence that the initial subjective effects of alcohol and cannabis can vary greatly among individuals and may be indicative of future substance abuse problems. The new findi… [+5198 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Be well: Catch skin cancer warning signs early with regular self-exams - Fox News", "description": "Early detection and treatment is key to catching and treating skin cancer successfully. Doctors recommend performing regular self-exams. Here is the latest \"Be Well\" series article.", "url": "https://www.foxnews.com/health/be-well-catch-skin-cancer-signs-regular-self-exams", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/skin-checks-split.jpg", "publishedAt": "2023-04-24T14:00:00Z", "content": "Every day, more than 9,500 people in the U.S. are diagnosed with skin cancer\r\n, according to the Skin Cancer Foundation, a New York City-based nonprofit. \r\nEarly detection and treatment is the key to… [+3144 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Developing cells likely can 'change their mind' about their destiny - Phys.org", "description": "A neural crest cell (a type of stem cell) begins with the ability to differentiate into any number of specialist cell types, but it also appears to retain the capacity to \"change its mind\" and differentiate anew when the circumstances are right, according to …", "url": "https://phys.org/news/2023-04-cells-mind-destiny.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/developing-cells-likel.jpg", "publishedAt": "2023-04-24T13:17:25Z", "content": "Inhibition of Ltk activity during early and late treatments results in 2 distinct phenotypes. Schematic showing time window treatment (a). Embryos were treated with DMSO (b and c) or 17.5M TAE-684 (d… [+6139 chars]"}, {"source": {"id": null, "name": "menshealth.com"}, "author": "Perri O. Blumberg", "title": "Here's Everything You Need to Know About Glutathione - Men's Health", "description": "This little molecule packs a big punch.", "url": "https://www.menshealth.com/nutrition/a43669848/glutathione-benefits/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/man-searching-pills-dosage-instruction-on-royalty-free-image-1682094157.jpg?crop=1.00xw:0.752xh;0,0.0385xh&resize=1200:*", "publishedAt": "2023-04-24T13:13:40Z", "content": "AMERICAN MEDICAL DOCTOR and \r\npegan diet\r\n creator, Mark Hyman, M.D., once said\r\n, \"glutathione is the mother of all antioxidants, the master detoxifier and maestro of the immune system.\" Well, gluta… [+5442 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "David Oliver", "title": "Narcan, naloxone: Save lives at music festivals like Coachella - USA TODAY", "description": "The availability of naloxone saves lives, experts and advocates say, and is integral to harm reduction efforts. But it shouldn't stop there.", "url": "https://www.usatoday.com/story/life/health-wellness/2023/04/24/naloxone-narcan-save-lives-music-festivals/11577378002/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/04/21/USAT/23e8dd04-d9a4-40cb-94ca-69a2d2a90f8d-IMG_4350.JPEG?crop=2315,1302,x0,y1191&width=2315&height=1302&format=pjpg&auto=webp", "publishedAt": "2023-04-24T12:18:03Z", "content": "It's festival season, meaning fabulous flower crowns, loud live music and Narcan.\r\nYes, the overdose-reversing drug Narcan (naloxone) will be available at music festivals near you this year  and with… [+6248 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Netana H. Markovitz", "title": "Sexual side effects of cancer, treatments rarely discussed by doctors - The Washington Post", "description": "Cancer and cancer treatments can have significant effects on sexuality and patients' ability to enjoy sex, but these issues are often not mentioned by doctors.", "url": "https://www.washingtonpost.com/wellness/2023/04/24/cancer-sexual-side-effects/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NUEKT5Y2AKE6NF6KZINO7SQC3Y.jpg&w=1440", "publishedAt": "2023-04-24T11:42:30Z", "content": "Comment on this story\r\nComment\r\nBrenna Gatimu, 34, of Casper, Wyo., was diagnosed with Stage 3 breast cancer in 2020. She quickly had chemoradiation, and both her breasts and ovaries were removed. Sh… [+8591 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Karen Weintraub", "title": "Gene therapy fails for Danish child treated for Sandhoff disease - USA TODAY", "description": "Alissa Feldborg, a 3-year-old with an ultra rare genetic disease called Sandhoff, died this month after participating in a gene therapy trial.", "url": "https://www.usatoday.com/story/news/health/2023/04/24/gene-therapy-rare-disease-alissa-feldborg/11665320002/", "urlToImage": "https://www.gannett-cdn.com/presto/2021/04/18/USAT/be00d182-a24b-4d7b-b58e-121b7ae5fdcd-XXX_Feldborg_Gene_Therapy_rd116.JPG?crop=5143,2893,x0,y197&width=3200&height=1801&format=pjpg&auto=webp", "publishedAt": "2023-04-24T10:30:22Z", "content": "New medical treatments, such as gene therapies, have the potential to save lives or transform them completely, to provide hope where there is none and to justify years of scientific research.\r\nUnfort… [+8168 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Noa Leach", "title": "Here's how you can reverse your biological age, according to breakthrough new study - BBC Science Focus Magazine", "description": "Your biological age is ticking, but this study shows how you can slow it down – and even turn it around.", "url": "https://www.sciencefocus.com/news/reverse-ageing-caused-by-stress/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/04/ageing-eyes-b95b158.jpg?resize=960,413", "publishedAt": "2023-04-24T10:27:26Z", "content": "Humans can effectively de-age after recovering from stressful events, a new study from Harvard Medical School and Duke University School of Medicine has found.\r\nThe breakthrough research shows that w… [+6016 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Linda Searing", "title": "Chronic pain affects millions, more prevalent in women, elderly - The Washington Post", "description": "And 17 million Americans also experienced high-impact chronic pain severe enough to substantially restrict their daily activities.", "url": "https://www.washingtonpost.com/wellness/2023/04/24/chronic-pain-affects-millions/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F74IOPP6DNHZ7PWVJJPKN2YMEI.jpg&w=1440", "publishedAt": "2023-04-24T10:11:48Z", "content": "Comment on this story\r\nComment\r\nAbout 52 million adults in the United States more than 1 in 5 were living with chronic pain in 2021, according to a report from the Centers for Disease Control and Pre… [+1489 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Laurie McGinley", "title": "Alzheimer’s patients are fighting disease earlier with new treatments - The Washington Post", "description": "For years, doctors and patients thought there was little to do when dementia was diagnosed, even at an early stage. Now, potentially sweeping changes loom.", "url": "https://www.washingtonpost.com/health/2023/04/24/alzheimers-early-symptoms-treatment/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3DZATHLP4TEI45ZXLTKADGJV74.jpg&w=1440", "publishedAt": "2023-04-24T10:07:35Z", "content": "Comment on this story\r\nComment\r\nBROOMFIELD, Colo. When Rebecca Chopp was diagnosed with early stage Alzheimers disease, she and her husband did the only thing that seemed to make sense: They went to … [+17060 chars]"}, {"source": {"id": null, "name": "The Detroit News"}, "author": "Dr. Keith Roach", "title": "Dr. Roach: People who get COVID vaccine less likely to die from any cause - Detroit News", "description": "A study found that getting the COVID-19 vaccine reduced the likelihood of dying from COVID and non-COVID causes.", "url": "https://www.detroitnews.com/story/life/advice/2023/04/24/dr-roach-people-who-get-covid-vaccine-less-likely-to-die-from-any-cause/70139629007/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/09/08/PDTN/48a1731f-5678-4d20-a2cd-0aaf0471dae6-Dr_Keith_Roach_with_bkg.jpg?crop=1491,839,x0,y263&width=1491&height=839&format=pjpg&auto=webp", "publishedAt": "2023-04-24T04:06:56Z", "content": "Dear Dr. Roach: In a recent column, you referred to a U.K. source that stated all-cause mortality is very significantly reduced in people who have had the COVID vaccine, compared to unvaccinated peop… [+3412 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Camille Bello", "title": "German scientists make a 'major discovery' that could slow down the ageing process - Euronews", "description": "At last, a new study has found the answers to “basic biology questions” that could help explain what drives ageing and what can we do to reverse it.", "url": "https://www.euronews.com/next/2023/04/20/german-scientists-make-a-major-discovery-that-could-slow-down-the-ageing-process", "urlToImage": "https://static.euronews.com/articles/stories/07/54/82/80/1000x563_cmsv2_c63c23ae-1e2e-5d23-96b6-9dc2d21ef977-7548280.jpg", "publishedAt": "2023-04-24T00:29:25Z", "content": "Despite centuries of research and progress in medicine, there are still many mysteries that remain unresolved, chief among them being an understanding of what causes ageing and how can we slow it dow… [+5377 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Worm Model Weeds Out New Insight Into Endocannabinoid System - Neuroscience News", "description": "A new study of worms brings new insight into the workings of the endocannabinoid system and helps answer the question of why cannabis consumption enhances mood and gives people \"the munchies\". Researchers found cannabis consumption activates the endocannabino…", "url": "https://neurosciencenews.com/endocannabinoid-worms-23086/", "urlToImage": "https://neurosciencenews.com/files/2023/04/endocannabinoid-system-worm-neurosicnes-.jpg", "publishedAt": "2023-04-23T21:54:55Z", "content": "Summary: A new study of worms brings new insight into the workings of the endocannabinoid system and helps answer the question of why cannabis consumption enhances mood and gives people “the munchies… [+8043 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Strep throat infections have spiked above pre-COVID highs, says report: 'We've missed cases' - Fox News", "description": "After plummeting in the early days of the COVID-19 pandemic, strep throat infections skyrocketed in February 2023 and remain elevated, according to a report from Epic Research.", "url": "https://www.foxnews.com/health/strep-throat-infections-spiked-above-pre-covid-highs-report-weve-missed-cases", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/strep-test-child.jpg", "publishedAt": "2023-04-23T21:17:00Z", "content": "After plummeting during the COVID pandemic in 2020 and 2021, strep throat infections skyrocketed in February 2023, according to a report from Epic Research, a health analytics firm. \r\nThe rate of inf… [+5087 chars]"}, {"source": {"id": null, "name": "Channel3000.com - WISC-TV3"}, "author": "", "title": "Free screenings give doctors chance to detect cancer early - Channel3000.com - WISC-TV3", "description": "MADISON, Wis. -- Speech therapist Sarah Simon has seen the impacts of head and neck cancer firsthand. Now, she wants to help her community avoid them.", "url": "https://www.channel3000.com/news/free-screenings-give-doctors-chance-to-detect-cancer-early/article_7847c89a-e210-11ed-8f96-4bd004559ec3.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/channel3000.com/content/tncms/assets/v3/editorial/4/be/4be6727b-c7db-5688-a84f-347f810a79f5/64454f08c5b51.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2023-04-23T19:53:00Z", "content": "The best way to stop cancer is to catch it early. That was the goal for doctors at SSM Health on Saturday\r\nCOPYRIGHT 2023 BY CHANNEL 3000. ALL RIGHTS RESERVED. THIS MATERIAL MAY NOT BE PUBLISHED, BRO… [+1158 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dual Pathways of Pain: How Drinking Alcohol Fuels Chronic Pain - SciTechDaily", "description": "A Scripps Research team showed how both alcohol intake and alcohol withdrawal can lead to increased pain and hypersensitivity. Chronic alcohol consumption may make people more sensitive to pain through two different molecular mechanisms—one driven by alcohol …", "url": "https://scitechdaily.com/?p=270915", "urlToImage": "https://scitechdaily.com/images/Abstract-Pain-Concept.jpg", "publishedAt": "2023-04-23T19:44:33Z", "content": "Scripps Research scientists have discovered two distinct molecular mechanisms by which chronic alcohol consumption increases sensitivity to pain. The findings, published in the British Journal of Pha… [+4924 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": "nejm.org", "title": "Decompressive Craniectomy versus Craniotomy for Acute Subdural Hematoma - nejm.org", "description": null, "url": "https://www.nejm.org/doi/pdf/10.1056/NEJMoa2214172", "urlToImage": null, "publishedAt": "2023-04-23T19:30:11Z", "content": null}, {"source": {"id": null, "name": "WPVI-TV"}, "author": null, "title": "ACCT Philadelphia closed to public while it works to contain canine flu outbreak in kennels - WPVI-TV", "description": "By clearing out, the nonprofit can isolate dogs who are sick or have been exposed to canine flu.", "url": "https://6abc.com/acct-philadelphia-dog-adoption-canine-flu-70-dogs-fostering-donating/13170939/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13178919_042423-wpvi-acct-philly-monday-530am-video-vid.jpg?w=1600", "publishedAt": "2023-04-23T17:00:49Z", "content": "PHILADELPHIA (WPVI) -- ACCT Philly is closed to the public on Monday and Tuesday so workers can give the shelter a deep cleaning as the shelter deals with an outbreak of canine flu.\r\nStarting Monday,… [+908 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Method of Stopping Hair From Going Gray Might Finally Have Been Discovered - Good News Network", "description": "Gray hair is something that many women—and men—have tried to hide for generations. A new study may have found a way to prevent it.", "url": "https://www.goodnewsnetwork.org/method-of-stopping-hair-from-going-gray-might-have-been-discovered/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/04/graying-curly-hair-woman-pubdomain-Dragisa-Braunovic.jpg", "publishedAt": "2023-04-23T16:49:53Z", "content": "By Dragisa Braunovic\r\nThe tell-tale sign of aginggray hairis something that many women and men have tried to hide for generations. Now, researchers have found that certain stem cells have a unique ab… [+4979 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Alix Martichoux", "title": "If Candida auris is drug-resistant, how do you kill it? - The Hill", "description": "A deadly fungus spreading in more than half of U.S. states is so concerning in part because of the way it has evolved to be resistant to both antimicrobial cleaning products and anti-fungal drugs, the Centers for Disease Control and Prevention recently warned.", "url": "https://thehill.com/homenews/nexstar_media_wire/3964161-if-candida-auris-is-drug-resistant-how-do-you-kill-it/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/04/GettyImages-1387469732.jpg?w=1280", "publishedAt": "2023-04-23T16:41:00Z", "content": "Skip to content\r\n(NEXSTAR) – A deadly fungus spreading in more than half of U.S. states is so concerning in part because of the way it has evolved to be resistant to both antimicrobial cleaning produ… [+2569 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "John Johnson", "title": "Health Studies on Ice Cream Are 'Pretty Bonkers' - Newser", "description": "'Atlantic' explores how researchers keep finding health benefits but don't believe it", "url": "https://www.newser.com/story/334083/health-studies-on-ice-cream-are-pretty-bonkers.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1467957-12-20230423111728.jpeg", "publishedAt": "2023-04-23T16:05:00Z", "content": "The headline of David Merritt Johns' story in the Atlantic refers to it as \"nutrition science's most preposterous result.\" And in the story itself, Merritt Johns calls it \"pretty bonkers.\" It seems t… [+1596 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore, Special To The Washington Post", "title": "Scientists identify thousands of unknown viruses in babies' diapers - Yahoo! Voices", "description": "Research involving Danish babies' dirty diapers has provided a plethora of information on previously unknown viruses - and the best view yet of the makeup of...", "url": "https://www.washingtonpost.com/health/2023/04/23/babies-gut-diaper-study/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/50m1A4RhoIaszfIYuXY8Ig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05Njk-/https://s.yimg.com/os/creatr-uploaded-images/2023-04/2c8894a0-e221-11ed-9fff-b7c730928ccb", "publishedAt": "2023-04-23T13:29:50Z", "content": "Research involving Danish babies' dirty diapers has provided a plethora of information on previously unknown viruses - and the best view yet of the makeup of the infant gut microbiome.\r\nWriting in th… [+1875 chars]"}, {"source": {"id": null, "name": "Pressenterprise.com"}, "author": "Contributing Writer", "title": "Worst mosquito infestation in years could soon hit Inland Empire - The Press-Enterprise", "description": "Recent rains create perfect breeding conditions, prompting experts to seek the public’s help.", "url": "https://www.pressenterprise.com/2023/04/23/worst-mosquito-infestation-in-years-could-soon-hit-inland-empire/", "urlToImage": "https://www.pressenterprise.com/wp-content/uploads/2023/04/RPE-L-MOSQUITO-0420-01-WL.jpg?w=1024&h=693", "publishedAt": "2023-04-23T13:02:22Z", "content": "By David Downey | Contributing Writer\r\nHeavy rain has transformed normally dry fields and numerous backyards across the Inland Empire into soggy breeding grounds for mosquitoes.\r\nAs a result, bug exp… [+10715 chars]"}, {"source": {"id": null, "name": "GoodHousekeeping.com"}, "author": "Zee Krstic", "title": "A New COVID Variant May Trigger a Never-Before-Seen Symptom, Especially in Kids - Yahoo Life", "description": "Here's what doctors want you to know about the newest SARS variant, 'Arcturus' or XBB.1.16, including potential symptoms to watch for, such as pink eye.", "url": "https://www.goodhousekeeping.com/health/a43670209/arcturus-symptoms-xbb-1-16-covid/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7up.xhabUIuFWes5IX0vTg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/good_housekeeping_561/4d7190a1f3760d8c77732dae7a5480c9", "publishedAt": "2023-04-23T12:00:00Z", "content": "<ul><li>A new COVID-19 subvariant, known as XBB.1.16 but often called \"Arcturus,\" has progressively become more viral here in the United States, accounting for 10% of infections through late April. \r… [+11171 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Brett Arends", "title": "Two breakthroughs on dementia -- one that's useful right now - MarketWatch", "description": "When it comes to dementia and the aging brain, any news is good news", "url": "https://www.marketwatch.com/story/two-breakthroughs-on-dementia-maybe-7831be4e", "urlToImage": "https://images.mktw.net/im-768230/social", "publishedAt": "2023-04-23T11:01:00Z", "content": "Six million among us have full-blown Alzheimers disease, including 10% of those over 65 and half of everyone over 80.And many more have other types of dementia, or cognitive impairment typically asso… [+6165 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ever heard of type 1.5 diabetes or LADA? 5 things to know about this rare form of diabetes - Indiatimes.com", "description": "​LADA is an autoimmune diabetes condition just like type 1 diabetes. It happens when the body's antibodies attack the insulin making cells of the pancreas.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/ever-heard-of-type-1-5-diabetes-or-lada-5-things-to-know-about-this-rare-form-of-diabetes/photostory/99673007.cms", "urlToImage": "https://static.toiimg.com/photo/99673065.cms", "publishedAt": "2023-04-23T10:30:00Z", "content": "LADA is an autoimmune diabetes condition just like type 1 diabetes. It happens when the body's antibodies attack the insulin making cells of the pancreas.\r\n\"Many researchers believe LADA, sometimes c… [+379 chars]"}, {"source": {"id": null, "name": "Detroit Free Press"}, "author": "Keith Matheny", "title": "Blastomycosis outbreak inquiry goes on at Billerud's Escanaba mill - Detroit Free Press", "description": "A Billerud employee spent 23 days in the hospital struggling to breathe from blastomycosis. &#34;I&#39;m being optimistic,&#34; he said as he tries to recover.", "url": "https://www.freep.com/in-depth/news/local/michigan/2023/04/23/billeruds-escanaba-mill-blastomycosis-outbreak/70138253007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/04/19/PAPN/8a94b332-0464-46c2-8c56-1fe37b15f43f-USAT_Billerud_Eric_Phillips_23382_041923_wag.jpg?crop=4278%2C2406%2Cx0%2Cy0&width=1200", "publishedAt": "2023-04-23T10:04:31Z", "content": "ESCANABA As sudden, excruciating pain ripped through Eric Phillips' chest in mid-February, he was sure he was having a heart attack. The paramedics believed he was, too.\r\nBut when the 46-year-old rea… [+16915 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bethany Dawson", "title": "The worst bird-flu outbreak in US history is 'wiping out everything in numbers we've never seen before.' Here's what you need to know. - Yahoo News", "description": "The new, more contagious bird-flu virus, H5N1, has decimated wild-bird populations and contributed to the mass deaths of millions of poultry.", "url": "https://www.businessinsider.com/bird-flu-avian-influenza-outbreak-us-h5n1-wiping-out-everything-2023-4", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/tcx_J5ZGXNFar.26kQOFYg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/abb983c9ead8c9714bdc1c514519c7c7", "publishedAt": "2023-04-23T09:41:53Z", "content": "A dead pelican on the beach in Lima, Peru on December 7, 2022.Klebher Vasquez/Anadolu Agency via Getty Images\r\n<ul><li>A new strain of bird flu, also known as avian influenza, is spreading across the… [+3884 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Excessive screen time is changing our eyes faster than we can blink - CBC.ca", "description": "Eye specialists say they are seeing excessive screen use driving up rates of myopia, dry eye and other vision problems — even in children. Some of the progressive conditions are irreversible and put people at higher risk for even more debilitating eye problem…", "url": "https://www.cbc.ca/news/canada/excessive-screen-use-eyes-myopia-1.6815857", "urlToImage": "https://i.cbc.ca/1.6817628.1682111090!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/dr-taji-myopia.jpg", "publishedAt": "2023-04-23T08:00:00Z", "content": "Pedram Mousavi's work is all about detail, so his vision must be sharp. The luxury auto detailing studio owner says in addition to looking at glossy reflective paints, he spends hours staring at his … [+7307 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "Allison Aubrey", "title": "Unraveling a hidden cause of UTIs — plus how to prevent them - WUSF Public Media", "description": "New research shows that one of the most common infections in women may be linked to our food supply. Here's what to know to protect yourself.", "url": "https://wusfnews.wusf.usf.edu/2023-04-23/unraveling-a-hidden-cause-of-utis-plus-how-to-prevent-them", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/7811815/2147483647/strip/true/crop/1883x989+0+212/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2023%2F04%2F21%2Fgettyimages-642110159-0e2ffc407f141d2257f90528749704160fd93fab.jpg", "publishedAt": "2023-04-23T08:00:00Z", "content": "If you've had a urinary tract infection, you're in good company. About 60% of women will develop one in their lifetime. UTIs lead to more than a million emergency room visits each year and more than … [+10046 chars]"}]}