{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Deidre McPhillips", "title": "US surpasses 1,000 measles cases in 2025, second worst year since disease was declared eliminated - CNN", "description": "This is only the second year cases have been this high since the disease was declared eliminated in the US a quarter-century ago, and a large multistate outbreak continues to grow, putting the nation on track for what could be the worst year since 2000.", "url": "https://www.cnn.com/2025/05/07/health/measles-cases-one-thousand-us", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25099777431187.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-05-07T23:29:00Z", "content": "More than 1,000 measles cases have been reported in the United States in 2025, according to a CNN tally. This is only the second year cases have been this high since the disease was declared eliminat… [+2008 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "6 \"Bad\" Foods You Should Be Eating for Better Gut Health, According to Dietitians - EatingWell", "description": "These foods may have a bad rap, but they’re full of good-for-your-gut nutrients like fiber, prebiotics, probiotics and antioxidants.", "url": "https://www.eatingwell.com/bad-foods-you-should-be-eating-for-better-gut-health-according-to-dietitians-11728949", "urlToImage": "https://www.eatingwell.com/thmb/FJ3YmFYiG_RiwvrER70Gl99JH_o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/6-Bad-Foods-You-Should-Be-Eating-for-Better-Gut-Health-e702c04ac07045c6b348995ee29c7d40.jpg", "publishedAt": "2025-05-07T22:29:00Z", "content": "Key Takeaways\r\n<ul><li>Dietitians love these six bad foods because theyre good for your gut and overall health.</li><li>Prebiotics, probiotics, antioxidants and resistant starch are gut-friendly nutr… [+7195 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Aria Bendix", "title": "Mysterious brain diseases in Canada weren’t a mystery after all - NBC News", "description": "Six years ago, a Canadian neurologist claimed to notice strange symptoms in a cluster of patients in New Brunswick, a province bordering Maine.", "url": "https://www.nbcnews.com/health/health-news/mysterious-brain-diseases-canada-werent-mystery-rcna205134", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250506-brain-scan-vl-412p-13d577.jpg", "publishedAt": "2025-05-07T22:25:39Z", "content": "Six years ago, a Canadian neurologist claimed to notice strange symptoms in a cluster of patients in New Brunswick, a province bordering Maine.  \r\nAccording to the neurologist, Dr. Alier Marrero, the… [+6053 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleep Apnea May Harm Brain Areas Key to Memory - Neuroscience News", "description": "A new study has linked obstructive sleep apnea to brain damage in areas critical for memory, likely due to low oxygen levels during REM sleep.", "url": "https://neurosciencenews.com/sleep-apnea-memory-brain-28842/", "urlToImage": "https://neurosciencenews.com/files/2025/05/sleep-apnea-memory-neuroscience.jpg", "publishedAt": "2025-05-07T21:32:14Z", "content": "Summary: A new study has linked obstructive sleep apnea to brain damage in areas critical for memory, likely due to low oxygen levels during REM sleep. Researchers found that people with lower oxygen… [+4600 chars]"}, {"source": {"id": null, "name": "WBIR.com"}, "author": "John North", "title": "10Investigates: Surgery center faces lawsuits over infections following 2023 procedures - WBIR", "description": "The complaints target Parkwest Surgery Center LLC among several defendants. The center changed management after the 2023 surgeries and infections.", "url": "https://www.wbir.com/article/news/local/parkwest-surgery-center-faces-lawsuits-over-infections/51-7daf1a25-bcee-41b7-becd-fdb222ebccc9", "urlToImage": "https://media.wbir.com/assets/WBIR/images/e33fa949-e9c4-4e1d-ae71-fee601c04b42/20250506T230502/e33fa949-e9c4-4e1d-ae71-fee601c04b42_1140x641.jpg", "publishedAt": "2025-05-07T20:53:00Z", "content": "KNOXVILLE, Tenn. For Mary-Beth Molitor, it's a longed-for walk on the beach. For Rick Stimac, it's simply a matter of adjusting mentally and physically to the new life he's been handed.\r\nThat's what … [+18881 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "New Micropipette Precisely Controls Brain Ion Signals Without Disruption - Neuroscience News", "description": "Researchers have developed a micropipette capable of delivering ions directly to individual neurons without disturbing the delicate extracellular environment.", "url": "https://neurosciencenews.com/micropipette-ion-signalling-28840/", "urlToImage": "https://neurosciencenews.com/files/2025/05/micropipette-ion-signalling-neurosicence.jpg", "publishedAt": "2025-05-07T20:36:17Z", "content": "Summary: Researchers have developed a micropipette capable of delivering ions directly to individual neurons without disturbing the delicate extracellular environment. This new iontronic micropipette… [+7087 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Kate Seamons", "title": "Study Hints at Easier Way to Get Medicine to Our Lungs - Newser", "description": "Microrobots made of algae can sneak medicine past lung defenses, researchers find", "url": "https://www.newser.com/story/368322/study-hints-at-easier-way-to-get-medicine-to-our-lungs.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1609348-12-20250507155432.jpeg", "publishedAt": "2025-05-07T20:28:00Z", "content": "Breathing in medicine-carrying microrobots may sound like the stuff of science fiction, but researchers at UC San Diego are testing a way to send microscopic algae into the lungs to fight disease rig… [+1964 chars]"}, {"source": {"id": null, "name": "WSOC Charlotte"}, "author": "WSOCTV.com News Staff", "title": "Teens see success with weight loss drugs, but doctors say long-term effects are unknown - WSOC TV", "description": "Weight loss drugs are getting more popular, even for teenagers and pre-teens -- but while many doctors have reported successful results, the long-term impact is still a mystery.", "url": "https://www.wsoctv.com/news/local/teens-see-success-with-weight-loss-drugs-doctors-say-long-term-effects-are-unknown/BURR6JNHXVD77HFCPX3ZL2GMFA/", "urlToImage": "https://cmg-cmg-tv-10030-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FGG36EIYXBNCRFP6XOSJNESQRXA.jpeg?auth=dd2abe4d4ba407c6db0b5245ecef93327fddc107fc1e7a9768a16c6f541e5daa&width=1200&height=630&smart=true", "publishedAt": "2025-05-07T20:13:47Z", "content": "CHARLOTTE — Weight loss drugs are getting more popular, even for teenagers and pre-teens -- but while many doctors have reported successful results, the long-term impact is still a mystery.\r\nThe Food… [+2950 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Midlife Hearing Loss Linked to Faster Brain Aging - Neuroscience News", "description": "A Brazilian study of over 800 adults in their 50s shows that hearing loss is strongly linked to accelerated cognitive decline.", "url": "https://neurosciencenews.com/hearing-loss-brain-aging-cognition-28839/", "urlToImage": "https://neurosciencenews.com/files/2025/05/hearing-loss-brain-aging-neuroscience.jpg", "publishedAt": "2025-05-07T20:10:15Z", "content": "Summary: A Brazilian study of over 800 adults in their 50s shows that hearing loss is strongly linked to accelerated cognitive decline. Participants with hearing loss experienced faster reductions in… [+6991 chars]"}, {"source": {"id": null, "name": "FlaglerLive.com"}, "author": "FlaglerLive", "title": "Broadband Company's Contractor Severs Flagler Beach's Main Water Line on SR100, Cutting Off City's Supply - FlaglerLive", "description": "A contractor laying down broadband cables for Metronet, the Evansville, Ind.-based high-speed internet company, struck Flagler Beach's main water line on State Road 100 late this morning, cutting off supply to the city.", "url": "https://flaglerlive.com/broadband-companys-contractor-severs/", "urlToImage": "https://flaglerlive.com/wp-content/uploads/water-main.jpg", "publishedAt": "2025-05-07T19:49:49Z", "content": "Flagler Beach crews working on repairing the water main break on State Road 100 this afternoon. (© FlaglerLive)\r\nLast Updated: 2:39 p.m.\r\n2:39 p.m. update:Repairs are complete, water service has been… [+2936 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Dopamine’s Hidden Role in Anxiety Revealed - Neuroscience News", "description": "Dopamine receptors in the ventral hippocampus play a critical role in balancing approach and avoidance behaviors, expanding understanding beyond dopamine’s known functions in reward and motivation.", "url": "https://neurosciencenews.com/dopamine-anxiety-28838/", "urlToImage": "https://neurosciencenews.com/files/2025/05/dopamine-anxiety-neuroscience.jpg", "publishedAt": "2025-05-07T19:33:41Z", "content": "Summary: Dopamine receptors in the ventral hippocampus play a critical role in balancing approach and avoidance behaviors, expanding understanding beyond dopamines known functions in reward and motiv… [+6838 chars]"}, {"source": {"id": null, "name": "Multiple Sclerosis News Today"}, "author": "Lila Levinson, PhD", "title": "Wim Hof method shows significant benefits for MS patients: Study - Multiple Sclerosis News Today", "description": "A holistic 12-week therapy program based on the Wim Hof method was seen to help ease cognitive fatigue and other MS symptoms in a pilot study.", "url": "https://multiplesclerosisnewstoday.com/news-posts/2025/05/07/wim-hof-method-shows-significant-benefit-ms-patients-study/", "urlToImage": "https://multiplesclerosisnewstoday.com/wp-content/uploads/2025/04/Meditation-1.png", "publishedAt": "2025-05-07T18:17:27Z", "content": "A 12-week program based on the Wim Hof method (WHM) which combines cold exposure, breathing exercises, and mindfulness was found to significantly ease cognitive fatigue, anxiety, and depression, as w… [+5219 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "SSRI Exposure in the Womb May Rewire Brain Circuits - Neuroscience News", "description": "New research suggests that prenatal exposure to SSRIs may alter brain development in ways that increase the risk of depression and anxiety later in life.", "url": "https://neurosciencenews.com/ssri-neurodevelopment-pregnancy-28837/", "urlToImage": "https://neurosciencenews.com/files/2025/05/SSRI-brain-development-neuroscience.jpg", "publishedAt": "2025-05-07T16:50:04Z", "content": "Summary: New research suggests that prenatal exposure to SSRIs may alter brain development in ways that increase the risk of depression and anxiety later in life. Using mice and human data, scientist… [+10331 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Low Blood Sugar Triggers Retinal Damage, Vision Loss - Neuroscience News", "description": "New research reveals that hypoglycemia may worsen diabetic retinopathy by breaking down the blood-retinal barrier.", "url": "https://neurosciencenews.com/low-blood-vision-retina-28836/", "urlToImage": "https://neurosciencenews.com/files/2025/05/blood-sugar-retina-vision-neuroscinec.jpg", "publishedAt": "2025-05-07T16:26:57Z", "content": "Summary: New research reveals that hypoglycemia may worsen diabetic retinopathy by breaking down the blood-retinal barrier. In diabetic mice, low blood sugar increased levels of hypoxia-inducible fac… [+6946 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Gut Microbiome Reveals Chronic Pain Risk, AI Study Finds - Neuroscience News", "description": "New research shows that AI can identify complex regional pain syndrome (CRPS) with over 90% accuracy by analyzing gut microbiome patterns.", "url": "https://neurosciencenews.com/ai-microbiome-pain-28835/", "urlToImage": "https://neurosciencenews.com/files/2025/05/AI-microbiome-pain-neuroscience.jpg", "publishedAt": "2025-05-07T15:59:00Z", "content": "Summary: New research shows that AI can identify complex regional pain syndrome (CRPS) with over 90% accuracy by analyzing gut microbiome patterns. Despite differences in geography and diet, a shared… [+6414 chars]"}, {"source": {"id": null, "name": "Common Dreams"}, "author": "https://www.facebook.com/32109457015", "title": "South Carolina Abortion Ban Forced Woman to Carry Fetus With No Heartbeat for Weeks - Common Dreams", "description": "Elisabeth Weber's heartbreaking experience of being denied standard miscarriage care under South Carolina's abortion ban highlights the devastating impact of restrictive laws on women's health.", "url": "https://www.commondreams.org/news/south-carolina-abortion-ban", "urlToImage": "https://www.commondreams.org/media-library/image.jpg?id=60152800&width=1200&height=600&coordinates=0%2C62%2C0%2C63", "publishedAt": "2025-05-07T15:37:35Z", "content": "Weeks after sharing an emotional video on TikTok about her experience being told by doctors that they couldn't provide her with standard miscarriage care under South Carolina's abortion ban, Elisabet… [+4191 chars]"}, {"source": {"id": null, "name": "Wichita Eagle"}, "author": "Lindsay Smith", "title": "Sedgwick County confirms measles case in unvaccinated child. It’s the first since 2017 - Wichita Eagle", "description": "Sedgwick County reports first measles case since 2017 in unvaccinated child between 5 & 10. Health officials working to trace exposure and contact others.", "url": "https://www.kansas.com/news/local/article305901991.html", "urlToImage": "https://www.kansascity.com/latest-news/sdlkln/picture305826586/alternates/LANDSCAPE_1140/vaccination.jpg", "publishedAt": "2025-05-07T15:26:00Z", "content": "Local\r\nSedgwick County health officials have confirmed the areas first case of measles in eight years, officials announced Wednesday morning.\r\nThe virus was identified in a child between the ages of … [+2403 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Sanjukta Mondal", "title": "Natural short sleepers have a genetic mutation, finds new study - Medical Xpress", "description": "Not everyone needs 8 hours of sleep to function properly. Some people can feel well-rested and show no negative effects of sleep deprivation, even after just 4 hours of sleep, which is likely the result of a genetic mutation.", "url": "https://medicalxpress.com/news/2025-05-natural-short-sleepers-genetic-mutation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/natural-short-sleepers.jpg", "publishedAt": "2025-05-07T15:20:01Z", "content": "Not everyone needs 8 hours of sleep to function properly. Some people can feel well-rested and show no negative effects of sleep deprivation, even after just 4 hours of sleep, which is likely the res… [+3710 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Startling New Research Links Plastic Chemical to Hundreds of Thousands of Heart Disease Deaths - SciTechDaily", "description": "A global study estimates that exposure to the plastic additive DEHP caused over 356,000 heart disease deaths in 2018, with most deaths occurring in rapidly industrializing regions. A new analysis of global population data suggests that daily exposure to certa…", "url": "https://scitechdaily.com/startling-new-research-links-plastic-chemical-to-hundreds-of-thousands-of-heart-disease-deaths/", "urlToImage": "https://scitechdaily.com/images/Microplastic-Tweezers.jpg", "publishedAt": "2025-05-07T15:04:15Z", "content": "A recent global analysis examines the potential health effects of exposure to a widely used plastic additive, focusing on its connection to cardiovascular outcomes. Drawing on environmental and morta… [+6583 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Can Genetics Predict Autism Intellectual Disabilities? - Neuroscience News", "description": "A new predictive model combining genetics with developmental milestones may help forecast which autistic children are at risk of developing intellectual disabilities.", "url": "https://neurosciencenews.com/genetics-asd-intellectual-disability-28833/", "urlToImage": "https://neurosciencenews.com/files/2025/05/autism-intellect-genetics-neuroscience.jpg", "publishedAt": "2025-05-07T14:59:15Z", "content": "Summary: A new predictive model combining genetics with developmental milestones may help forecast which autistic children are at risk of developing intellectual disabilities. In a large study of ove… [+8354 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Hilary Brueck", "title": "A 20-cent 'wonder drug' is being studied as a colon cancer-stopping supplement, and it looks promising - Business Insider", "description": "Metformin is a go-to diabetes drug, and researchers are looking at whether it can be used as a cancer-stopping supplement, too.", "url": "https://www.businessinsider.com/metformin-being-studied-colon-cancer-stopping-supplement-2025-5", "urlToImage": "https://i.insider.com/681b8e883fe8d39283653154?width=1200&format=jpeg", "publishedAt": "2025-05-07T14:52:00Z", "content": "A cheap, widely-prescribed diabetes drug that some doctors have called a \"wonder drug\" may hold promise as a colon-cancer-stopping supplement.\r\nScientists who presented at the American Association fo… [+3660 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "The #1 Food You Should Limit to Reduce Stroke Risk, According to Dietitians - EatingWell", "description": "Added sugars can increase stroke risk by increasing inflammation, blood sugar and more. Learn why, plus dietitian-approved stroke prevention tips.", "url": "https://www.eatingwell.com/food-you-should-limit-to-reduce-stroke-risk-11728448", "urlToImage": "https://www.eatingwell.com/thmb/gjA5NN49yOvysJFB87YTc4g4bTo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/number-1-Food-You-Should-Limit-to-Reduce-Stroke-Risk-b68a8a89e71c4ca491b0c6a13533c073.jpg", "publishedAt": "2025-05-07T14:00:00Z", "content": "We often talk about our brain and heart health separately. Yet, the two are closely related. Your brain depends on the oxygenated blood from your heart to carry out all its functions. However, when a… [+5401 chars]"}, {"source": {"id": null, "name": "Seven Days"}, "author": "Rachel Hellman", "title": "Northern Vermont Is a Hot Spot for a Rare Fungal Infection - Seven Days", "description": "Blastomycosis, a fungal disease, has been cropping up around the Green Mountain State, particularly in three northern counties.", "url": "https://www.sevendaysvt.com/news/northern-vermont-is-a-hot-spot-for-a-rare-fungal-infection-43475233", "urlToImage": "https://media2.sevendaysvt.com/sevendaysvt/imager/u/facebook/43475231/health2-1-68a6db11c4926567.webp", "publishedAt": "2025-05-07T14:00:00Z", "content": "Beth Foy started feeling sick a few months after floodwaters inundated Johnson. She had spent summer 2023 in crisis mode as Johnson's selectboard chair and a member of the town's emergency management… [+9125 chars]"}, {"source": {"id": null, "name": "AOL"}, "author": "Ani Freedman", "title": "2 major lifestyle changes can drastically reduce your microplastics exposure - AOL.com", "description": "Making these two lifestyle shifts is a manageable way to cut down your microplastics exposure.", "url": "https://www.aol.com/finance/2-major-lifestyle-changes-drastically-114800679.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/FeR_uCNgiizaso_xQE4N3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTg-/https://media.zenfs.com/en/aol_fortune_385/6c11870160d70d746f4ceebad3f527a5", "publishedAt": "2025-05-07T13:28:44Z", "content": "It seems that more and more sources of microplastics are being discovered every day from tea bags to clothing and chewing gum. Since plastic doesnt biodegrade, it continues to break down into smaller… [+3389 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Why Noisy Rooms Are Harder for Some Brains to Handle - Neuroscience News", "description": "New research reveals that the insula, a key brain region, shows altered connectivity in people who struggle to understand speech in noisy environments.", "url": "https://neurosciencenews.com/insula-noise-speech-hearing-28829/", "urlToImage": "https://neurosciencenews.com/files/2025/05/noise-conversation-neurosciencce.jpg", "publishedAt": "2025-05-07T13:24:50Z", "content": "Summary: New research reveals that the insula, a key brain region, shows altered connectivity in people who struggle to understand speech in noisy environments. Using resting-state MRI, scientists fo… [+6941 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "1,000 adults reveal how marijuana alters DNA methylation - Earth.com", "description": "Northwestern study reveals that cumulative marijuana use leaves epigenetic marks on DNA associated with potential psychiatric risks.", "url": "https://www.earth.com/news/1000-adults-reveal-how-marijuana-alters-dna-methylation/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/06234519/1000-adults-marijuana-dna-methylation-study.jpg", "publishedAt": "2025-05-07T13:06:11Z", "content": "Marijuana has intrigued people for decades, especially as more places allow it for medical or recreational use. Many see it as a natural product with relaxing properties, yet scientists have been eag… [+4841 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Girls' diets strongly influence when they begin puberty - Earth.com", "description": "A study links childhood diets to the timing of menarche, with healthier diets delaying puberty and reducing health risks later in life.", "url": "https://www.earth.com/news/girls-diets-strongly-influence-when-they-begin-puberty/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07064156/Girls-puberty.jpg", "publishedAt": "2025-05-07T12:51:07Z", "content": "The foods consumed during childhood may hold more power than previously thought. While body size and genetics have long been scrutinized for their roles in the onset of puberty, a recent study shifts… [+5700 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Want to Know Your Alzheimer’s Risk? Many Change Their Minds - Neuroscience News", "description": "New research reveals a striking gap between people’s theoretical desire to know their Alzheimer’s disease risk and their real-life decisions when results are actually offered.", "url": "https://neurosciencenews.com/alzheimers-risk-mind-change-28829/", "urlToImage": "https://neurosciencenews.com/files/2025/05/Alzheimers-risk-mind-change-neuroscience.jpg", "publishedAt": "2025-05-07T12:51:00Z", "content": "Summary: New research reveals a striking gap between peoples theoretical desire to know their Alzheimers disease risk and their real-life decisions when results are actually offered. In a study of co… [+11649 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "How do I know if I am having a stroke? 3 unmissable symptoms - Times of India", "description": "Strokes are a leading cause of death and disability worldwide, striking suddenly and often without warning. About 15 million people worldwide suffer a stroke every year, according to the World Health Organization (WHO). Of this, 5 million die, and 5 million a…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/how-do-i-know-if-i-am-having-a-stroke-3-unmissable-symptoms/photostory/120963953.cms", "urlToImage": "https://static.toiimg.com/photo/120964422.cms", "publishedAt": "2025-05-07T12:30:00Z", "content": "A stroke, sometimes called a brain attack, happens when blood flow to the brain is blocked or there is sudden bleeding in the brain. There are two types of strokes: Ischemic stroke and hemorrhagic st… [+593 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Western Diet Blocks Gut Microbiome Recovery After Antibiotics - Neuroscience News", "description": "New research shows that a Western-style diet rich in processed foods disrupts the gut microbiome’s ability to recover after antibiotic treatment.", "url": "https://neurosciencenews.com/western-diet-microbiome-antibiotics-28827/", "urlToImage": "https://neurosciencenews.com/files/2025/05/western-diet-microbiome-neuroscience.jpg", "publishedAt": "2025-05-07T12:25:52Z", "content": "Summary: New research shows that a Western-style diet rich in processed foods disrupts the gut microbiomes ability to recover after antibiotic treatment. In mice, this diet prevented the regrowth of … [+9364 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Groundbreaking new discovery predicts early onset of Alzheimer’s disease - AOL.com", "description": "The slow loss of memory, thinking, and independence that defines Alzheimer’s disease continues to affect millions worldwide. One rare but revealing form of t...", "url": "https://www.thebrighterside.news/post/groundbreaking-new-discovery-predicts-early-onset-of-alzheimers-disease/", "urlToImage": "https://media.zenfs.com/en/the_brighter_side_of_news_971/359cc0a21b48a15b57bce44ae35578d6", "publishedAt": "2025-05-07T10:58:49Z", "content": "Scientists have discovered how genetic mutations in Alzheimers disease affect the timing of symptoms. (CREDIT: Getty Images)\r\nThe slow loss of memory, thinking, and independence that defines Alzheime… [+7033 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "What to know about vaccines in the do-your-own-research era - Big Think", "description": "For centuries, vaccines have been the top life-saving, expert medical intervention known to humans. How can individuals make the right call?", "url": "https://bigthink.com/starts-with-a-bang/vaccines-do-your-own-research/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/05/jab.jpg?resize=1200,630", "publishedAt": "2025-05-07T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Marin Independent Journal"}, "author": "Cameron Macdonald", "title": "Marin County reports rise in tuberculosis cases - Marin Independent Journal", "description": "The public health office has confirmed 14 active cases so far this year, compared to 13 cases in 2024.", "url": "https://www.marinij.com/2025/05/06/marin-county-reports-rise-in-tuberculosis-cases/", "urlToImage": "https://www.marinij.com/wp-content/uploads/2024/02/20151211__tuberculosis1.jpg?w=645&h=430", "publishedAt": "2025-05-07T01:18:45Z", "content": "The Marin County public health office is tracking an uptick in active tuberculosis cases in Marin.\r\nThe county had 13 reported cases in 2024, a 44% increase from the previous year. So far this year, … [+3974 chars]"}, {"source": {"id": null, "name": "INFORUM"}, "author": "Wendy Reuer", "title": "5 more cases of measles found in western North Dakota, bringing state total to 9 - InForum", "description": "The NDHHS is warning those who may have been at the Williston Walmart or in Williston schools may have been exposed.", "url": "https://www.inforum.com/news/north-dakota/5-more-cases-of-measles-found-in-western-north-dakota-bringing-state-total-to-9", "urlToImage": "https://cdn.forumcomm.com/dims4/default/3e0bf7a/2147483647/strip/true/crop/860x484+0+0/resize/1894x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Ffccnn%2Fbinary%2Fcopy%2Fde%2Fbc%2Fea42a034558d45519a348879914f%2F3343850-measles-binary-788648.jpg", "publishedAt": "2025-05-07T00:56:00Z", "content": "WILLISTON, N.D. An additional five measles cases have been identified in Williams County, bringing North Dakota's 2025 total to nine cases. \r\nAccording to the North Dakota Health and Human Services, … [+3491 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How old are you, really? New tool measures aging from the inside out - Earth.com", "description": "A new health-assessment method calculates a person’s biological age. This health tool may predict a person’s risk of disability and death.", "url": "https://www.earth.com/news/how-old-are-you-really-new-tool-measures-aging-from-the-inside-out/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/06153906/Measure-aging.jpg", "publishedAt": "2025-05-06T21:43:10Z", "content": "A new health-assessment method, called the Health Octo Tool, uses eight measures drawn from physical exams and routine lab tests to calculate a persons biological age. \r\nThe tool may predict an indiv… [+4453 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ABC News", "title": "Why it feels like allergy season is getting longer, more severe - ABC News", "description": null, "url": "https://abcnews.go.com/Health/feels-allergy-season-longer-severe/story?id\\\\u003d121511143", "urlToImage": null, "publishedAt": "2025-05-06T21:05:50Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Emotional Regulation Offers a New Path to Relief - Neuroscience News", "description": "A new study shows that improving emotional processing can significantly reduce chronic pain and improve quality of life.", "url": "https://neurosciencenews.com/emotional-regulation-pain-28825/", "urlToImage": "https://neurosciencenews.com/files/2025/05/emotional-regulation-pain-neurosciecne.jpg", "publishedAt": "2025-05-06T20:51:06Z", "content": "Summary: A new study shows that improving emotional processing can significantly reduce chronic pain and improve quality of life. Researchers developed Pain and Emotion Therapy, an online interventio… [+10735 chars]"}, {"source": {"id": null, "name": "Healthimaging.com"}, "author": null, "title": "PET imaging reveals long-term heart and lung damage from COVID-19 - Health Imaging", "description": "New data highlight the long-lasting effects of the coronavirus, revealing changes that are not detectable by standard medical assessments.", "url": "https://healthimaging.com/topics/medical-imaging/nuclear-medicine/pet-ct/pet-imaging-reveals-long-term-heart-and-lung-damage-covid-19", "urlToImage": "https://healthimaging.com/sites/default/files/styles/facebook/public/2021-01/iStock-1255835319.jpg?h=9d96f97f&itok=QZXNWdrc", "publishedAt": "2025-05-06T20:23:39Z", "content": "On imaging, more than half displayed inflammation of the heart muscle, pericardium, heart valvesespecially the mitral valveand aortic and pulmonary blood vessels. Scarring and thickening of the heart… [+1134 chars]"}, {"source": {"id": null, "name": "TODAY"}, "author": "Meghan Holohan", "title": "Woman, 22, Recalls Early Signs of Stroke That Doctors Dismissed As Vertigo - TODAY.com", "description": "Aubrey Hasley, 22, experienced ringing in her ears, headache, dizziness, muscle weakeness, slurred speech. She felt shocked she had a stroke.", "url": "https://www.today.com/health/womens-health/woman-22-stroke-details-1st-signs-tinnitus-headache-rcna204814", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/rockcms/2025-05/Aubrey-Hasley-ringing-ears-stroke-mc-250505-03-594cc8.jpg", "publishedAt": "2025-05-06T20:03:42Z", "content": "In June last year, Aubrey Hasley, then 22, began experiencing really loud ringing in her ears. \r\nIt was pretty hard to ignore. It scared me for a few seconds, Hasley, now 23, of the Chicago area, tel… [+7608 chars]"}, {"source": {"id": null, "name": "Ascopost.com"}, "author": null, "title": "Two- vs 8-Week Course of Radiotherapy for Prostate Cancer: 10-Year Follow-up - The ASCO Post", "description": "The phase III HYPO-RT-PC reported 10-year follow-up exploring shorter course radiotherapy for localized prostate cancer. The findings were presented at ESTRO 2025", "url": "https://ascopost.com/news/may-2025/two-vs-8-week-course-of-radiotherapy-for-prostate-cancer-10-year-follow-up/", "urlToImage": "https://ascopost.com/media/14024061/prostate.jpeg", "publishedAt": "2025-05-06T19:52:30Z", "content": "The phase III HYPO-RT-PC trial has shown that a shorter course of radiotherapy (2 weeks) for localized prostate cancer is just as safe and effective as the traditional 8-week scheduleeven 10 years af… [+2872 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Dave Scheiber", "title": "Developing a probiotic cocktail that may help ward off dementia - Medical Xpress", "description": "Hariom Yadav, Ph.D., can't get a particular cocktail off his mind—especially because our aging population potentially could benefit from the benefits for brain health that this punch may pack.", "url": "https://medicalxpress.com/news/2025-05-probiotic-cocktail-ward-dementia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/health-researchers-dev-1.jpg", "publishedAt": "2025-05-06T19:50:04Z", "content": "Hariom Yadav, Ph.D., can't get a particular cocktail off his mindespecially because our aging population potentially could benefit from the benefits for brain health that this punch may pack.\r\nThe dr… [+9172 chars]"}, {"source": {"id": null, "name": "KVUE.com"}, "author": "Britny Eubank", "title": "Person with measles visited Terry Black's last month, APH says - KVUE", "description": "This case is separate from a measles exposure reported in April involving a local resident who visited several restaurants and other businesses.", "url": "https://www.kvue.com/article/news/health/austin-measles-exposure-el-paso/269-77fc9dc0-67de-44c4-bbc2-488ce6609c3d", "urlToImage": "https://media.kvue.com/assets/KVUE/images/6bc189e0-806f-41bb-adc7-827f895b67f7/20250428T230822/6bc189e0-806f-41bb-adc7-827f895b67f7_1140x641.jpg", "publishedAt": "2025-05-06T18:55:00Z", "content": "AUSTIN, Texas An El Paso resident who was infectious with measles visited a popular Austin barbecue restaurant late last month, Austin Public Health (APH) announced Tuesday.\r\nThe agency said it was r… [+2557 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Scientists estimate higher rate of new-onset diabetes after COVID than in general population - CIDRAP", "description": "Of 4.4 million COVID-19 patients, 1.4% had new-onset diabetes, with 0.8% being type 2 and 0.02% type 1.", "url": "https://www.cidrap.umn.edu/covid-19/scientists-estimate-higher-rate-new-onset-diabetes-after-covid-general-population", "urlToImage": "https://www.cidrap.umn.edu/themes/custom/cidrap_theme/images/cidrap-og-image.jpg", "publishedAt": "2025-05-06T18:35:00Z", "content": null}, {"source": {"id": null, "name": "KSDK.com"}, "author": "Jennifer Somers", "title": "Confusion grows over measles exposure at St. Louis Aquarium - KSDK", "description": "The infected individual's story has been \"not the most concrete,\" investigators said.", "url": "https://www.ksdk.com/article/news/health/st-louis-measles-exposure-aquarium-confusion-grows/63-ab2f8375-d5f3-4ac0-9822-f29ba4fb9e52", "urlToImage": "https://media.ksdk.com/assets/KSDK/images/77c5947b-949a-47b9-bae3-b8c7bc21ae1d/20250505T170323/77c5947b-949a-47b9-bae3-b8c7bc21ae1d_1140x641.jpg", "publishedAt": "2025-05-06T17:55:00Z", "content": "ST. LOUIS Confusion and gaps in communication are complicating efforts to track potential measles exposure at a popular St. Louis tourist attraction.\r\nThe Missouri Department of Health and Senior Ser… [+3790 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Left-Handed People More Common In Certain Mental Disorders, Major Study Finds - Study Finds", "description": "Coonditions like schizophrenia, autism, and intellectual disability show notably higher rates of left-handedness compared to the general population, according to a new study.", "url": "https://studyfinds.org/left-handed-mental-neurological-disorders/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2025/05/Left-handed-painting-scaled.jpg", "publishedAt": "2025-05-06T17:44:36Z", "content": "(Photo by Olga Donchuk on Shutterstock)\r\n<ul><li>Left-handed and mixed-handed people appear significantly more often in certain mental and neurodevelopmental disorders like autism and schizophrenia, … [+6056 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Emily Weaver", "title": "If You're Over 50, This Common Vaccine Can Lower Your Risk of Stroke and Heart Disease by 23% - bestlifeonline.com", "description": "Protect your heart and mind - get your shingles vaccine now! New research shows a 23% lower risk of cardiovascular events and reduced dementia risk. Are you willing to take the step towards a healthier future? #ShinglesVaccine #HeartHealth #DementiaPrevention", "url": "https://bestlifeonline.com/shingles-vaccine-and-stroke/", "urlToImage": "https://bestlifeonline.com/media-library/doctor-filling-vaccine.jpg?id=53414500&width=1200&height=600&coordinates=0%2C100%2C0%2C101", "publishedAt": "2025-05-06T17:37:53Z", "content": "Looking to stay healthy? Plenty of research shows that keeping up with immunizations is crucial for your overall wellness. In fact, many medical experts advise prioritizing the shingles vaccine if yo… [+4559 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "WSJ", "title": "‘Super Agers’ Review: Living the Good Life - WSJ", "description": null, "url": "https://www.wsj.com/health/wellness/super-agers-review-living-the-good-life-9a38c55c", "urlToImage": null, "publishedAt": "2025-05-06T16:45:00Z", "content": null}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Newser", "title": "They Released Thousands of Mosquitoes, Then Waited - Newser", "description": null, "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPblVhWVlKQnBIUlFiM0czb2NCRVYtamdQZXVGTTRidTFaSC1BbXFyTGQ4M1A4NWRMUUQ4UlAwcVNuTlNpNWtjcTdKOG0xYzM4dEU4YlpBSkRma2UtSXF2am0wZXR6a3FHbkJralhOY3J3M1B3M1U2Z1VqdXFaV3ZlQ2tzd196ODVQTnZ2dHo5eFFvQXB6aXZV?oc=5", "urlToImage": null, "publishedAt": "2025-05-06T16:00:00Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Hazel Flight", "title": "Aspartame: the artificial sweetener is calorie-free but not risk-free – a nutritionist explains - The Conversation", "description": "From weight loss to possible health concerns, discover the science – and controversy – behind one of the world’s most popular sugar substitutes.", "url": "https://theconversation.com/aspartame-the-artificial-sweetener-is-calorie-free-but-not-risk-free-a-nutritionist-explains-254318", "urlToImage": "https://images.theconversation.com/files/661022/original/file-20250410-62-t9cbde.jpg?ixlib=rb-4.1.0&rect=0%2C679%2C8256%2C4128&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-06T15:12:14Z", "content": "Sugar sweet, satisfying, and everywhere. From fresh fruit and honey to processed table sugar and drinks, it sneaks into nearly everything we eat. While delicious, sugar delivers what nutritionists ca… [+4424 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Finger Movements Offer New Clues for Autism Detection - Neuroscience News", "description": "Subtle hand movements during grasping tasks may help diagnose autism spectrum disorder (ASD) with high accuracy.", "url": "https://neurosciencenews.com/asd-grasping-neuroscience-28822/", "urlToImage": "https://neurosciencenews.com/files/2025/05/ASD-grasping-neuroscience.jpg", "publishedAt": "2025-05-06T14:42:57Z", "content": "Summary: Subtle hand movements during grasping tasks may help diagnose autism spectrum disorder (ASD) with high accuracy. Using machine learning, researchers analyzed how autistic and non-autistic in… [+5422 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Marni Ellery", "title": "Household drinking water identified as key pathway for bacterial transmission - Phys.org", "description": "Worldwide, more than 500,000 children under age 5 die each year from gastrointestinal bacterial infections, largely in communities with limited access to safe drinking water, sanitation and hygiene infrastructure. But to alleviate this public health threat, s…", "url": "https://phys.org/news/2025-05-household-key-pathway-bacterial-transmission.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-finds-stored-dri.jpg", "publishedAt": "2025-05-06T13:36:45Z", "content": "Worldwide, more than 500,000 children under age 5 die each year from gastrointestinal bacterial infections, largely in communities with limited access to safe drinking water, sanitation and hygiene i… [+4623 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Lauren Leffer", "title": "Death is the policy - The Verge", "description": "RFK Jr.‘s measles response is junk science and social Darwinism.", "url": "https://www.theverge.com/health/661362/rfk-jr-measles-autism", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/257715_RFK_jr_HHS_CVirginia_F.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "publishedAt": "2025-05-06T13:00:00Z", "content": "Under RFK Jr., Make America Healthy Again means junk science like survival of the fittest.\r\nDo your own research, Robert F. Kennedy Jr. advised parents considering vaccination for their children duri… [+14190 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "The 17 best strategies to protect your brain from stroke, dementia, and depression, according to science - Earth.com", "description": "A large-scale study has highlighted ways to protect your brain health, reducing the likelihood of suffering a stroke, dementia, depression.", "url": "https://www.earth.com/news/17-best-strategies-to-protect-your-brain-from-stroke-dementia-and-depression/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/05082034/17-best-strategies-protect-brain-stroke-dementia-depression.jpg", "publishedAt": "2025-05-06T12:57:17Z", "content": "In a world filled with advice about how to stay sharp, a large-scale study has highlighted ways to protect your brain health, reducing the likelihood of suffering a stroke, dementia, and depression. … [+4237 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Vagus Nerve Stimulation Erases PTSD - Neuroscience News", "description": "A pioneering clinical study found that pairing vagus nerve stimulation (VNS) with traditional therapy eliminated PTSD diagnoses in all participants up to six months post-treatment.", "url": "https://neurosciencenews.com/vagus-nerve-stimulation-ptsd-28818/", "urlToImage": "https://neurosciencenews.com/files/2025/05/vagus-nerve-stimulation-PTSD-neuroscience.jpg", "publishedAt": "2025-05-06T12:49:45Z", "content": "Summary: A pioneering clinical study found that pairing vagus nerve stimulation (VNS) with traditional therapy eliminated PTSD diagnoses in all participants up to six months post-treatment. The trial… [+9200 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Science Confirms It: To Be The Happiest, You Must Wake Up at This Precise Hour of the Day - The Daily Galaxy", "description": "Small changes in your sleep routine could have a big impact on your health. A unique Japanese practice might hold the key to feeling more", "url": "https://dailygalaxy.com/2025/05/science-confirms-it-to-be-the-happiest-you-must-wake-up-at-this-precise-hour-of-the-day/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Woman-sleeping-with-basset-hound.jpg", "publishedAt": "2025-05-06T12:15:00Z", "content": "The importance of sleep cannot be overstated. Recent studies in chronobiology suggest that the time you wake up is crucial for your mental and physical well-being. \r\nIn fact, aligning your wake-up ti… [+3629 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Adam Collins", "title": "Intermittent fasting: is it the calories or carbs that count? - The Conversation", "description": "Our study found that restricting carbs can elicit the same favourable metabolic effects as fasting.", "url": "https://theconversation.com/intermittent-fasting-is-it-the-calories-or-carbs-that-count-254752", "urlToImage": "https://images.theconversation.com/files/663972/original/file-20250425-56-ligi1t.jpg?ixlib=rb-4.1.0&rect=747%2C1187%2C4126%2C2063&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-06T11:59:57Z", "content": "Intermittent fasting is not only a useful tool for weight loss, its also shown to have many benefits for metabolic health independent of weight loss. Yet many people may find intermittent fasting to … [+4825 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Molecules Target Root Cause of Chronic Pain Without Opioids - SciTechDaily", "description": "Ahmed receives NIH grant to investigate inhibitors targeting peripheral neuropathic pain. Chronic pain is a widespread and debilitating condition that often prompts healthcare providers to prescribe increasingly higher doses of opioids. This reliance on opioi…", "url": "https://scitechdaily.com/new-molecules-target-root-cause-of-chronic-pain-without-opioids/", "urlToImage": "https://scitechdaily.com/images/Neck-Pain-Spinal-Cord-Anatomy.jpg", "publishedAt": "2025-05-06T08:55:11Z", "content": "Researchers at Texas Tech are developing a new class of non-opioid compounds that target a key protein involved in chronic neuropathic pain. Backed by a $1.94 million NIH grant, their work could lead… [+6598 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Turmeric to cinnamon: Common herbs and spices you shouldn't mix with your medicine - Times of India", "description": "Certain herbs and spices, while beneficial, can interact negatively with medications. Cinnamon may reduce drug effectiveness by speeding up metabolism", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/turmeric-to-cinnamon-common-herbs-and-spices-you-shouldnt-mix-with-your-medicine/articleshow/120879406.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120879417,width-1070,height-580,imgsize-57052,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-05-06T04:33:00Z", "content": null}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "Cutting This One Food Could Drastically Reduce Your Cancer Risk, Mainly in the Colon - EatingWell", "description": "Research shows that eating processed meats can increase your cancer risk. Here's all you need to know, plus how to reduce your intake.", "url": "https://www.eatingwell.com/processed-meats-and-cancer-11728821", "urlToImage": "https://www.eatingwell.com/thmb/Fqoom9L2eEbaaODltaOyYjuFbqI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/when-it-comes-to-cancer-risk-are-all-processed-meats-the-same-12e9b60a897e4fcf8929190a6eae2060.jpg", "publishedAt": "2025-05-06T04:04:08Z", "content": "Key Takeaways\r\n<ul><li>Eating 50 grams of processed meats every day may increase your cancer risk by 18%.</li><li>Occasionally consuming processed meats may be safe if you don't have other risk facto… [+11361 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Alarming rise in bowel cancer among the young: Surprising reasons fueling the surge - Times of India", "description": "Bowel cancer is increasing among young people. Cases have doubled in the last 20 years. Lifestyle and diet are major factors. A toxin from E. coli bac", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/alarming-rise-in-bowel-cancer-among-the-young-surprising-reasons-fueling-the-surge/articleshow/120828672.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120828698,width-1070,height-580,imgsize-125108,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-05-02T15:14:00Z", "content": null}]}