{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": "usa-today", "name": "USA Today"}, "author": "Laura Berman, USA TODAY", "title": "Casual sex, one-night-stands are on the decline for women. Here's why. - USA TODAY", "description": "In 2021, research showed that causal sex (meaning one-night stands and random hookups) has steadily decreased in recent years. Why? Less alcohol.", "url": "https://www.usatoday.com/story/life/health-wellness/2023/04/19/casual-sex-one-night-stands-decline-women-heres-why/11686614002/", "urlToImage": "https://www.gannett-cdn.com/presto/2019/01/01/USAT/822a1715-33bb-404a-af0c-e37aafea9837-NYEVE002.JPG?auto=webp&crop=2440,1367,x0,y243&format=pjpg&width=1200", "publishedAt": "2023-04-19T11:36:34Z", "content": "Today’s young people are swiping left on the idea of casual sex.\r\nIn 2021, research from Rutgers University-New Brunswick showed that causal sex has steadily decreased in recent years. Though many wo… [+3119 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Ashley Broadwater", "title": "Experiencing Cold Symptoms Around Your Period? It May Be 'Period Flu.' - HuffPost", "description": "If you have a runny nose, itchy eyes, dizziness or other issues near that time of the month, this is for you.", "url": "https://www.huffpost.com/entry/period-flu-cold-symptoms_l_643eb32be4b04997b56d81ba", "urlToImage": "https://img.huffingtonpost.com/asset/643f01e8220000370070ecad.jpeg?cache=if7yoDqnT8&ops=1200_630", "publishedAt": "2023-04-19T09:45:33Z", "content": "Some people experience cold- or flu-like symptoms during their menstrual cycle.\r\nPeople with periods know how terrible that time of the month can be, even without reaching the level of something like… [+5137 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "AI health care platform predicts diabetes with high accuracy but 'won't replace patient care' - Fox News", "description": "Cedar Gate Technologies announced an artificial intelligence-based solution for health care providers said to predict diabetes risk with 80% accuracy. Fox News Digital spoke to company executives.", "url": "https://www.foxnews.com/health/ai-health-care-platform-predicts-diabetes-with-high-accuracy-wont-replace-patient-care", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/medical-researchers-AI.jpg", "publishedAt": "2023-04-19T06:00:00Z", "content": "With 37.3 million people in the U.S. living with diabetes 8.5 million of whom are undiagnosed, per the Centers for Disease Control and Prevention the disease is one of the deadliest and most expensiv… [+6086 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nikolas Lanum", "title": "AI vs. cancer: Mount Sinai scientist says breakthrough tech has ‘drastic impact’ on diagnosis, treatment - Fox News", "description": "A Mount Sinai computational pathologist detailed a new artificial intelligence and how the tech is helping to improve the speed and accuracy of cancer diagnosis.", "url": "https://www.foxnews.com/media/ai-vs-cancer-mount-sinai-scientist-breakthrough-tech-drastic-impact-diagnosis-treatment", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Paige_Breast_Neoplasm.png", "publishedAt": "2023-04-19T06:00:00Z", "content": "Artificial intelligence (AI) is helping physicians to diagnose cancer more accurately at much faster rates and at a lower cost than previously possible, according to a scientist working in computatio… [+7768 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "77% of Americans have used one of these 'unhealthy coping mechanisms' - Daily Mail", "description": "Over three-quarters of Americans engage in what they know are unhealthy means of coping with unpleasant situations such as drinking and drug use, according to a genetic testing firm in Utah.", "url": "https://www.dailymail.co.uk/health/article-11987467/77-Americans-used-one-unhealthy-coping-mechanisms.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/19/04/69982477-0-image-a-7_1681876510684.jpg", "publishedAt": "2023-04-19T04:01:46Z", "content": "More than three-quarters of Americans knowingly engage in unhealthy coping habits, a study suggests.\r\nA survey conducted by Myriad Genetics in Salt Lake City, Utah, found that 77 percent of Americans… [+3502 chars]"}, {"source": {"id": null, "name": "Quillette.com"}, "author": "Mark Alan Smith", "title": "Masking Uncertainty in Public Health - Quillette", "description": "Had it actually been “following the science,” the CDC would have transparently communicated its uncertainty at every step.", "url": "https://quillette.com/2023/04/18/masking-uncertainty-in-public-health/", "urlToImage": "https://s3.amazonaws.com/prod.static-content.quillette.com/2023/04/Quillette-Weekly-1.png", "publishedAt": "2023-04-18T23:30:10Z", "content": "Lets travel back to simpler times, 2019 and earlier. In the years Before COVID (BC), beliefs about respiratory viruses were not intertwined with peoples core identities. Preventions and treatments co… [+19420 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Long COVID symptoms keeping many Americans from returning to work - PBS NewsHour", "description": "Three years after the start of the pandemic, some 16 million Americans have long COVID, meaning their symptoms continue well after the initial infection. An ...", "url": "https://www.youtube.com/watch?v=wUSi9abgmfs", "urlToImage": "https://i.ytimg.com/vi/wUSi9abgmfs/maxresdefault.jpg", "publishedAt": "2023-04-18T22:46:13Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Alexander Tin, Kolbe Nelson", "title": "Source of deadly fungal outbreak at Michigan paper mill may be impossible to determine, says union chief - CBS News", "description": "At least one person has died and nearly 100 have been sickened in an outbreak of blastomycosis at a northwest Michigan paper mill.", "url": "https://www.cbsnews.com/news/deadly-fungal-outbreak-michigan-paper-mill-cause/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/04/18/d6dea369-992c-4809-8174-26869292b8f4/thumbnail/1200x630/852c889b0632ca9607ddd6a8873848c1/michiganpapermill.jpg", "publishedAt": "2023-04-18T22:40:00Z", "content": "Workers at a northwest Michigan paper mill shuttered by a deadly fungal outbreak may never know how the outbreak started, according to the head of their union local.\r\nGerald Kell, president of the Un… [+6214 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "The Mechanism That Regulates Activity of Memory Gene - Neuroscience News", "description": "DNA methylation regulates the expression of PKMzeta, a gene implicated in long-term memory formation. Reduced levels of PKMzeta in the brain are associated with Alzheimer's disease and other memory deficit disorders.", "url": "https://neurosciencenews.com/genetic-memory-methylation-23047/", "urlToImage": "https://neurosciencenews.com/files/2023/04/memory-gene-neurosicnes-public.jpg", "publishedAt": "2023-04-18T22:12:32Z", "content": "Summary: DNA methylation regulates the expression of PKMzeta, a gene implicated in long-term memory formation. Reduced levels of PKMzeta in the brain are associated with Alzheimer’s disease and other… [+7311 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Slowing Early-Stage ALS With Microbiota Transplantations - Neuroscience News", "description": "Fecal microbiota transplantation from healthy individuals can help slow the progression of early ALS by altering a patient's microbiome and intervening in the inflammation process.", "url": "https://neurosciencenews.com/fecal-transplant-als-23045/", "urlToImage": "https://neurosciencenews.com/files/2023/04/microbiota-transplant-als-neurosicnes-public.jpg", "publishedAt": "2023-04-18T21:14:48Z", "content": "Summary: Fecal microbiota transplantation from healthy individuals can help slow the progression of early ALS by altering a patient’s microbiome and intervening in the inflammation process.\r\nSource: … [+5803 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Could Fixing a Problem With the Heart Be Good for Your Brain? - Neuroscience News", "description": "People with atrial fibrillation who were treated with catheter ablation may be at lower risk of cognitive decline and dementia than those who did not receive the treatment.", "url": "https://neurosciencenews.com/heart-brain-dementia-23044/", "urlToImage": "https://neurosciencenews.com/files/2023/04/heart-brain-health-neurosciences-public.jpg", "publishedAt": "2023-04-18T21:00:59Z", "content": "Summary: People with atrial fibrillation who were treated with catheter ablation may be at lower risk of cognitive decline and dementia than those who did not receive the treatment.\r\nSource: AAN\r\nPeo… [+2656 chars]"}, {"source": {"id": null, "name": "MyNorthwest.com"}, "author": "", "title": "An urgent plea for King County women to get tested for syphilis - MyNorthwest", "description": "190 cases were reported last year, according to Washington State Department of Health and Public Health, a sizable increase from the 117 cases in 2021.", "url": "https://mynorthwest.com/3877376/urgent-plea-king-county-women-tested-syphilis/", "urlToImage": "https://mynorthwest.com/wp-content/uploads/2023/04/Untitled-design-2023-04-18T131603.842.png", "publishedAt": "2023-04-18T20:57:18Z", "content": "King County health officials are warning women under 45 to test for syphilis, especially if they haven’t tested since January 2021. 190 cases were reported last year, according to Washington State De… [+2283 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Early Signs That May Help Predict ADHD Risk - Neuroscience News", "description": "Combining data about pregnancy and birth with machine learning technology, researchers identified 17 out of 40 factors that are particularly strong when predicting the number of ADHD symptoms in childhood.", "url": "https://neurosciencenews.com/adhd-early-signs-23041/", "urlToImage": "https://neurosciencenews.com/files/2023/04/early-adhd-signs-neurosicnes-public.jpg", "publishedAt": "2023-04-18T20:08:39Z", "content": "Summary: Combining data about pregnancy and birth with machine learning technology, researchers identified 17 out of 40 factors that are particularly strong when predicting the number of ADHD symptom… [+5735 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Melinh Lai", "title": "Exercise boosts brain health with chemical signals, study shows - Medical Xpress", "description": "Physical activity is frequently cited as a means of improving physical and mental health. Researchers at the Beckman Institute for Advanced Science and Technology have shown that it may also improve brain health more directly. They studied how the chemical si…", "url": "https://medicalxpress.com/news/2023-04-boosts-brain-health-chemical.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/exercise-boosts-brain.jpg", "publishedAt": "2023-04-18T20:07:03Z", "content": "Physical activity is frequently cited as a means of improving physical and mental health. Researchers at the Beckman Institute for Advanced Science and Technology have shown that it may also improve … [+4299 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "A Brain Network for Social Perception - Neuroscience News", "description": "Different people have similar neural activity when processing social information. Researchers reveal the occipital and temporal lobes are important hubs for social information processing.", "url": "https://neurosciencenews.com/social-information-processing-brain-23039/", "urlToImage": "https://neurosciencenews.com/files/2023/04/social-perception-network-neurosciences.png", "publishedAt": "2023-04-18T19:09:01Z", "content": "Summary: Different people have similar neural activity when processing social information. Researchers reveal the occipital and temporal lobes are important hubs for social information processing.\r\nS… [+6161 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jane Herz", "title": "Allergies, pollen could send you to ER this year, Health Dept. warns - New York Post ", "description": "A notice warned that this season will worsen symptoms in those patients allergic to tree pollen, causing asthma attacks and allergic rhinoconjunctivitis.", "url": "https://nypost.com/2023/04/18/allergies-pollen-could-send-you-to-er-this-year-health-dept-warns/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/newspress-collage-26641139-1681839271902.jpg?quality=75&strip=all&1681830286&w=1024", "publishedAt": "2023-04-18T19:09:00Z", "content": "You’ve got to be pollen our legs.\r\nAllergy season is in full swing and it could send some New Yorkers to the emergency room, according to a new bulletin from the New York City Department of Health an… [+3893 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "TikToker Chronicles HIV Diagnosis Online to Educate Others - Inside Edition", "description": "When Zachary Willmore got diagnosed with HIV earlier this year, he did something many don’t do. He shared his journey on TikTok with his almost 2 million fol...", "url": "https://www.youtube.com/watch?v=uswu9OK0qNE", "urlToImage": "https://i.ytimg.com/vi/uswu9OK0qNE/maxresdefault.jpg", "publishedAt": "2023-04-18T18:57:35Z", "content": null}, {"source": {"id": null, "name": "New York Post"}, "author": "Brooke Kato", "title": "Teens are abusing Adderall bought online amid national shortage: alert - New York Post ", "description": "Researchers analyzed how many middle and high school students abuse the ADHD medication.", "url": "https://nypost.com/2023/04/18/teens-abusing-aderrall-bought-online-amid-national-shortage/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/newspress-collage-26641103-1681843449600.jpg?quality=75&strip=all&1681829404&w=1024", "publishedAt": "2023-04-18T18:47:00Z", "content": "Up to 25% of middle and high school students are abusing prescription stimulants such as Adderall amid a national shortage of the ADHD drug, according to a sobering new study published Tuesday in Jou… [+4771 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Reuters", "title": "Argentina sterilizes mosquitoes with radiation to battle devastating dengue outbreak - Fox News", "description": "Biologists in Argentina are battling one of the country’s worst dengue outbreaks by sterilizing male mosquitos with atomic radiation. They plan to release the insects outdoors in November.", "url": "https://www.foxnews.com/health/argentina-sterilizes-mosquitoes-radiation-battle-devastating-dengue-outbreak", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/dengue.jpg", "publishedAt": "2023-04-18T18:00:00Z", "content": "Argentine, fighting one of its worst outbreaks of dengue in recent years, is sterilizing mosquitoes using radiation that alters their DNA before releasing them into the wild.\r\nThe South American coun… [+1440 chars]"}, {"source": {"id": null, "name": "Nytlicensing.com"}, "author": "Roni Caryn Rabin", "title": "COVID May Increase the Risk of Type 2 Diabetes, Researchers Find - Yahoo News", "description": "People infected with the coronavirus were significantly more likely to be diagnosed with Type 2 diabetes within a year of their infection, compared with...", "url": "https://nytlicensing.com/stories/avT7ozox", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Z2zolTd.lF50_Up5AoJCsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://s.yimg.com/os/creatr-uploaded-images/2023-04/21998440-de12-11ed-9dfb-b68cda220e84", "publishedAt": "2023-04-18T17:46:21Z", "content": "People infected with the coronavirus were significantly more likely to be diagnosed with Type 2 diabetes within a year of their infection, compared with those who had not been exposed to the virus, r… [+4258 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "How electricity can heal wounds three times faster - Medical Xpress", "description": "Chronic wounds are a major health problem for diabetic patients and the elderly—in extreme cases they can even lead to amputation. Using electric stimulation, researchers in a project at Chalmers University of Technology, Sweden, and the University of Freibur…", "url": "https://medicalxpress.com/news/2023-04-electricity-wounds-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/how-electricity-can-he.jpg", "publishedAt": "2023-04-18T17:19:05Z", "content": "Chronic wounds are a major health problem for diabetic patients and the elderlyin extreme cases they can even lead to amputation. Using electric stimulation, researchers in a project at Chalmers Univ… [+4861 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ashley Lyles", "title": "Optimal Time Period for Weight Loss Drugs: Debate Continues - Medscape", "description": "Newer weight loss drugs are useful tools for patients with obesity, including those who have had bariatric surgery. But debate continues as to how long people should stay on them.", "url": "https://www.medscape.com/viewarticle/990922", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230418_debate_hands_800x450.jpg", "publishedAt": "2023-04-18T16:47:59Z", "content": "After bariatric surgery in 2014, Kristal Hartman still struggled to manage her weight long term. It took her over a year to lose 100 pounds, a loss she initially maintained, but then gradually her bo… [+9751 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "After 8 Years of Research World-Changing Malaria Vaccine Approved in Africa - Good News Network", "description": "Ghana, the first country to approve it for use, is also constructing a factory in Accra, where R21 will cost a few dollars per dose.", "url": "https://www.goodnewsnetwork.org/after-8-years-of-research-world-changing-malaria-vaccine-approved-in-africa/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/04/Tom-Wilkinson-University-of-Oxford.jpg", "publishedAt": "2023-04-18T16:30:14Z", "content": "After 8 years of testing and trials, the long-awaited decision on whether or not Oxford’s R21 malaria vaccine would be approved has been made.\r\nTwo of West Africa’s biggest economies, Ghana and Niger… [+1844 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "The Fascinating and Evolving Story of Bacteria and Cancer - Slashdot - Slashdot", "description": "Dr Eric Topol, a cardiologist and director of the Scripps Translational Science Institute, writing over the weekend: It was medical dogma: cancer tissue is sterile. That's what we had learned and taught in medical school for decades even though bacteria were …", "url": "https://science.slashdot.org/story/23/04/18/1350256/the-fascinating-and-evolving-story-of-bacteria-and-cancer", "urlToImage": "https://a.fsdn.com/sd/topics/science_64.png", "publishedAt": "2023-04-18T16:14:39Z", "content": "I get the sense there is a tremendous amount of medical dogma that gets passed on even to today's MDs. The most famous example of course was the cause of ulcers (dogmatically due to stress, found in … [+874 chars]"}, {"source": {"id": null, "name": "Deseret News"}, "author": "Hanna Seariac", "title": "Refined carbs contribute to diabetes. Here’s how to eat whole grains. - Deseret News", "description": "These 3 factors included red meat, process meat and refined carbohydrates", "url": "https://www.deseret.com/2023/4/18/23687234/refined-carbs-lead-to-diabetes-cases", "urlToImage": "https://deseret.brightspotcdn.com/dims4/default/c88bff9/2147483647/strip/true/crop/2649x1512+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2Fxu14K4MoQa3CLzA-3IrMlOK-p-s%3D%2F0x0%3A2649x2044%2F2649x2044%2Ffilters%3Afocal%281230x744%3A1231x745%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F23685535%2FAP070613035313.jpg", "publishedAt": "2023-04-18T15:18:00Z", "content": "Refined carbohydrates have been revealed to be a main driver behind Type 2 diabetes. \r\nA study from Tufts University tracked worldwide growth of Type 2 diabetes and found consumption of refined carbo… [+3946 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Catherine Ho", "title": "Here's how much soda sales dropped after Oakland taxed sugary drinks - San Francisco Chronicle", "description": "Purchases of soda and other sugary drinks dropped 27% in Oakland in the first 2½ years after the city adopted a tax on sugar-sweetened beverages.", "url": "https://www.sfchronicle.com/eastbay/article/oakland-soda-tax-17898408.php", "urlToImage": "https://s.hdnux.com/photos/01/32/27/46/23689660/3/rawImage.jpg", "publishedAt": "2023-04-18T15:03:20Z", "content": "Purchases of soda and other sugary drinks dropped 27% in Oakland in the first 2½ years after the city adopted a tax on sugar-sweetened beverages, according to a new study by UCSF researchers. That de… [+3162 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary Brain Tumor Treatment Discovered in Traditional Chinese Medicine - SciTechDaily", "description": "Researchers found that a derivative of the natural compound indirubin offers a new approach to treating glioblastoma in mice, which will inform future research in humans. Scientists have discovered that a drug derived from the natural compound indirubin shows…", "url": "https://scitechdaily.com/?p=269285", "urlToImage": "https://scitechdaily.com/images/Traditional-Chinese-Medicine.jpg", "publishedAt": "2023-04-18T13:56:18Z", "content": "ByBrown UniversityApril 18, 2023\r\nA new study has revealed the potential of a drug derived from indirubin, a natural compound used in traditional Chinese medicine, in treating malignant brain tumors … [+6148 chars]"}, {"source": {"id": null, "name": "WBIW.com"}, "author": "Terri Box", "title": "Ticks and Lyme Disease: Symptoms, Treatment, and Prevention - WBIW.com", "description": "INDIANA - Tick-borne diseases, such as Lyme disease, are on the rise in people and dogs. Reported cases of people in the U.S. increased from about 12,000 annually in 1995 to approximately 35,000 in 2019, according to the Centers for Disease Control and Preven…", "url": "https://www.wbiw.com/2023/04/18/ticks-and-lyme-disease-symptoms-treatment-and-prevention/", "urlToImage": "https://www.wbiw.com/wordpress/wp-content/uploads/2020/04/ticks-2.jpg", "publishedAt": "2023-04-18T12:23:43Z", "content": "INDIANA – Tick-borne diseases, such as Lyme disease, are on the rise in people and dogs. Reported cases of people in the U.S. increased from about 12,000 annually in 1995 to approximately 35,000 in 2… [+8022 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "georgia dodd", "title": "These Are The Worst Foods That Contribute To Visceral Fat Accumulation, Heart Disease, And Diabetes - SheFinds", "description": "Learn about the worst foods for visceral fat, heart disease, and diabetes, only on SheFinds!", "url": "https://www.shefinds.com/collections/worst-foods-visceral-fat-heart-disease-diabetes/", "urlToImage": "https://www.shefinds.com/files/2023/04/woman-holding-a-fast-food-burger.jpg", "publishedAt": "2023-04-18T12:00:41Z", "content": "A healthy diet is one of the most crucial factors to prioritize when you’re trying to lose weight or simply follow a healthy lifestyle. In addition to eating a range of nutritious whole foods, health… [+5301 chars]"}, {"source": {"id": null, "name": "KPRC Click2Houston"}, "author": "Haley Hernandez", "title": "Why your menopause treatment may be outdated and ways you can find relief - KPRC Click2Houston", "description": "A survey of healthcare providers found that many do not feel adequately trained to manage menopause symptoms and may not be familiar with the latest research and guidelines.", "url": "https://www.click2houston.com/news/local/2023/04/18/going-through-menopause-see-treatment-options-and-how-you-can-benefit-from-them/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/arc-cf/04-18-2023/t_a6d56b55712b4ae080c51058fa59a0d6_name_image.jpg?_a=ATCqVhC0", "publishedAt": "2023-04-18T11:15:47Z", "content": "HOUSTON A survey of healthcare providers found that many do not feel adequately trained to manage menopause symptoms and may not be familiar with the latest research and guidelines.\r\nDr. Terri-Ann Sa… [+3676 chars]"}, {"source": {"id": null, "name": "WHIO"}, "author": "WHIO Staff", "title": "WHIO-TV morning anchor faces big challenges after rare cancer diagnosis - WHIO", "description": "One of WHIO-TV's morning anchors revealed this morning a rare cancer diagnosis.", "url": "https://www.whio.com/news/local/whio-tv-morning-anchor-faces-big-challenges-after-rare-cancer-diagnosis/JQEDABHXXRH4JPF37XIX6DBVGY/", "urlToImage": "https://cmg-cmg-tv-10040-prod.cdn.arcpublishing.com/resizer/3fgYBrwramONlPsF8X82DSuMh0g=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/XQN6GAEBHZAYFAE3ZR35ENEVO4.jpg", "publishedAt": "2023-04-18T11:07:00Z", "content": "DAYTON — One of WHIOs newest faces now faces the biggest fight of his life. Anchor Nick Foley was recently diagnosed with Multiple Myeloma, which is a cancer of the plasma cells and typically affects… [+1530 chars]"}, {"source": {"id": null, "name": "WGME"}, "author": "Christian Bridges, WGME", "title": "Attention allergy sufferers: Pollen levels ramp up in Maine this week - WGME", "description": "Pollen levels really begin to ramp up Wednesday as plants bloom from Monday and Tuesday’s rain.", "url": "https://wgme.com/news/local/allergy-sufferers-beware-pollen-levels-ramp-up-in-maine-this-week", "urlToImage": "https://wgme.com/resources/media/03e6e89b-be06-40b5-b116-bf89e7d7c1f8-large16x9_ssdd.png?1681814102515", "publishedAt": "2023-04-18T10:41:11Z", "content": null}, {"source": {"id": null, "name": "NBC4 WCMH-TV"}, "author": "David Rees", "title": "How access to HIV medication, preventative healthcare could change in Ohio - NBC4 WCMH-TV", "description": "COLUMBUS, Ohio (WCMH) — A federal ruling has struck down provisions requiring health insurance to provide free preventive care services, jeopardizing access in Ohio to screenings for cancer and medications that prevent HIV infection.  U.S. District Judge Reed…", "url": "https://www.nbc4i.com/news/local-news/columbus/how-access-to-hiv-medication-preventative-healthcare-could-change-in-ohio/", "urlToImage": "https://www.nbc4i.com/wp-content/uploads/sites/18/2023/04/GettyImages-107091586.jpg?w=1280", "publishedAt": "2023-04-18T10:30:00Z", "content": "COLUMBUS, Ohio (WCMH) — A federal ruling has struck down provisions requiring health insurance to provide free preventive care services, jeopardizing access in Ohio to screenings for cancer and medic… [+4369 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nada Hassanein, USA TODAY", "title": "COVID during pregnancy: Does it cause baby brain development problems? - USA TODAY", "description": "Authors of recent studies said longer follow-up is needed to fully understand how and if COVID-19 in pregnant people affects infant neurodevelopment.", "url": "https://www.usatoday.com/story/news/health/2023/04/18/covid-pregnancy-neurodevelopment/11613918002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/12/07/USAT/c264e2ed-435e-4ef3-b0ed-afdb69edc04a-221013_KIND_HOKD_Nurses_crochet_outfits_for_newborns_Tmobile_16x9_thumbnail_3.jpg?auto=webp&crop=1911,1075,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-04-18T10:00:30Z", "content": "Researchers are still trying to discern whether a COVID-19 infection during pregnancy can lead to long-term problems for the child.\r\nSome studies find no difference between babies born to mothers inf… [+5832 chars]"}, {"source": {"id": null, "name": "FierceBiotech"}, "author": "FierceBiotech", "title": "New test detects Parkinson's biomarker before movement symptoms start - FierceBiotech", "description": null, "url": "https://www.fiercebiotech.com/research/new-test-detects-parkinsons-biomarker-movement-symptoms-start", "urlToImage": null, "publishedAt": "2023-04-18T10:00:00Z", "content": null}, {"source": {"id": null, "name": "Vox"}, "author": "Julia Belluz", "title": "Ozempic, Wegovy pregnancy risks need more attention - Vox.com", "description": "Semaglutide users, and even researchers, have to dig to learn about risks. Why is this information so hard to find?", "url": "https://www.vox.com/science/23683383/ozempic-pregnancy-risks-semaglutide-wegovy", "urlToImage": "https://cdn.vox-cdn.com/thumbor/obIAL7yam_c9nwcwYf8GuWamb98=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24585403/VOX_ozempic_2.png", "publishedAt": "2023-04-18T10:00:00Z", "content": "After neuroscientist Martha Bagnall read a recent New Yorker article about Ozempic the buzzycelebrity weight loss jab thats upending obesity medicine she emailed a colleague to dish on what she felt … [+15067 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Intracranial Hemorrhage After Pfizer-BioNTech (BNT162b2) mRNA COVID-19 Vaccination: A Case Report - Cureus", "description": "The Coronavirus 2019 (COVID-19) pandemic has affected over 700 million people worldwide and caused nearly 7 million deaths. Vaccines currently developed or in development are the most effective tools for curbing the pandemic and mitigating its impacts. In Tur…", "url": "https://www.cureus.com/articles/147265-intracranial-hemorrhage-after-pfizer-biontech-bnt162b2-mrna-covid-19-vaccination-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/588814/article_river_53cd2070d3ef11eda51b6fff58af74e5-asienguncel1__23_13_29600.png", "publishedAt": "2023-04-18T08:46:40Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "KARE11.com"}, "author": "Eva Andersen", "title": "Keeping your pets safe during Minnesota's canine influenza outbreak - KARE11.com", "description": "As the initial outbreak appeared to wind down, the Minnesota Board of Animal Health received notice that a dog in the community tested positive for canine influenza.", "url": "https://www.kare11.com/article/news/local/kare11-sunrise/canine-influenza-outbreak-minnesota-merck-vaccine/89-c792e105-9b6f-4f8a-8814-f76f611096a8", "urlToImage": "https://media.kare11.com/assets/KARE/images/fb452b1f-cbdd-4f15-99bc-7367582b0949/fb452b1f-cbdd-4f15-99bc-7367582b0949_1140x641.jpg", "publishedAt": "2023-04-18T07:34:00Z", "content": "MINNEAPOLIS Just as the initial outbreak of nearly 200 dogs across three Animal Humane Society shelters in Minnesota appeared to wind down, there is concern that canine influenza has spread into the … [+1907 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert", "title": "Could Psychedelics Replace Antidepressants In Patients With Advanced Cancer? - ScienceAlert", "description": null, "url": "https://www.sciencealert.com/could-psychedelics-replace-antidepressants-in-patients-with-advanced-cancer", "urlToImage": null, "publishedAt": "2023-04-18T05:35:01Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "Most US adults and a third of children use dietary supplements, survey finds - CNN", "description": "Most American adults and more than a third of children use dietary supplements, according to a new study from the US Centers for Disease Control and Prevention, and those numbers have remained steady or been on the rise.", "url": "https://www.cnn.com/2023/04/18/health/supplement-use-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230417183625-supplement-use-in-the-us-wellness-stock-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-18T04:03:00Z", "content": "Most American adults and more than a third of children use dietary supplements, according to a new study from the US Centers for Disease Control and Prevention, and those numbers have remained steady… [+5401 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Neuroscientists Find Long COVID Smell Loss Linked to Changes in the Brain - SciTechDaily", "description": "People living with long COVID who suffer from loss of smell show different patterns of activity in certain regions of the brain, a new study led by University College London (UCL) researchers has found. The research used MRI scanning to compare the brain acti…", "url": "https://scitechdaily.com/neuroscientists-find-long-covid-smell-loss-linked-to-changes-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Front-Brain-Scan-MRI-Image.jpg", "publishedAt": "2023-04-18T02:32:40Z", "content": "ByUniversity College LondonApril 17, 2023\r\nA recent study led by UCL researchers has found that people living with long COVID and experiencing anosmia (loss of smell) show different brain activity pa… [+4661 chars]"}, {"source": {"id": null, "name": "NBC Chicago"}, "author": "Matt Stefanski, NBC 5 Staff", "title": "Chicago's Top Doctor Discusses Highly-Transmissible Arcturus' COVID-19 Variant - NBC Chicago", "description": "Since the pandemic began more than three years ago, numerous variants have emerged as the virus that causes COVID-19 evolved, and as a new subvariant catches…", "url": "https://www.nbcchicago.com/news/local/chicagos-top-doctor-discusses-highly-transmissible-arcturus-covid-19-variant/3121142/", "urlToImage": "https://media.nbcchicago.com/2022/05/GettyImages-1238512840.jpg?quality=85&strip=all&resize=1200%2C675", "publishedAt": "2023-04-18T01:38:05Z", "content": "Since the pandemic began more than three years ago, numerous variants have emerged as the virus that causes COVID-19 evolved, and as a new subvariant catches the eye of scientists, the city's top doc… [+3796 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "ChatGPT answered 25 breast cancer screening questions, but it's 'not ready for the real world' — here's why - Fox News", "description": "Researchers from the University of Maryland created a list of 25 questions related to breast cancer screening guidelines — then submitted them to ChatGPT to gauge their accuracy. Here's what happened.", "url": "https://www.foxnews.com/health/chatgpt-answered-25-breast-cancer-screening-questions-not-ready-real-world-heres-why", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/woman-texting-on-phone.jpg", "publishedAt": "2023-04-17T23:57:00Z", "content": "ChatGPT, the artificial intelligence chatbot from OpenAI, could potentially rival Google one day as an online health resource, many people say but how reliable are its responses right now?\r\nResearche… [+5785 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Emily Lefroy", "title": "42M have HPV — and it causes more cancers than you realize: discovery - New York Post ", "description": "It’s the most common type of sexually transmitted disease — but apparently not common knowledge that it can cause various types of cancer.", "url": "https://nypost.com/2023/04/17/42m-have-hpv-and-it-causes-more-cancers-than-you-realize-survey/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/newspress-collage-26630537-1681770017925.jpg?quality=75&strip=all&1681760305&w=1024", "publishedAt": "2023-04-17T23:50:00Z", "content": "It’s the most common type of sexually transmitted disease — but apparently not common knowledge that it can cause various types of cancer.\r\nA survey by the American Association for Cancer Research ha… [+1998 chars]"}, {"source": {"id": null, "name": "Commercial Appeal"}, "author": ", The Commercial Appeal", "title": "HIV federal funds will reroute to Tennessee nonprofits, state cut out - Commercial Appeal", "description": "After Tennessee officials refused federal funds in January, nonprofits sought direct funding from the U.S. Centers for Disease Control.", "url": "https://www.commercialappeal.com/story/news/local/2023/04/17/hiv-federal-funds-will-reroute-to-tennessee-nonprofits-state-cut-out/70116510007/", "urlToImage": "https://www.gannett-cdn.com/presto/2019/02/21/PPAS/014edd23-fe55-49e3-aa13-977d6a89b19c-PrEP-4.jpg?auto=webp&crop=5471,3077,x1,y349&format=pjpg&width=1200", "publishedAt": "2023-04-17T22:52:48Z", "content": "Nearly three months after the Tennessee Health Department said it would no longer accept and distribute federal funding for HIV prevention-related services, the U.S. Centers for Disease Control and P… [+4673 chars]"}, {"source": {"id": null, "name": "WDIV ClickOnDetroit"}, "author": "Victor Williams, Brandon Carr", "title": "Deadly drug-resistant infections caused by 'Candida Auris' are rising in Michigan hospitals - WDIV ClickOnDetroit", "description": "The fungal infection attacks wounds, ears and the bloodstream and are primarily known to victimize the elderly in nursing homes, hospitals, or hospice care.", "url": "https://www.clickondetroit.com/news/local/2023/04/17/deadly-drug-resistant-infections-caused-by-candida-auris-are-rising-in-michigan-hospitals/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/arc-cf/04-17-2023/t_5a0a87c149d54b4d805159b0dca3da45_name_image.jpg?_a=ATCqVhC0", "publishedAt": "2023-04-17T22:34:38Z", "content": "The rapidly spreading fungus Candida auris poses a severe health risk to people in long-term care facilities and hospitals.\r\nRecently, it has infected and killed some of the nations most vulnerable p… [+1706 chars]"}, {"source": {"id": null, "name": "Womansworld.com"}, "author": "Ann Green", "title": "Eat These 3 Things Daily For a Healthy Heart - Woman's World", "description": "It's the only heart you have — so protect it!", "url": "https://www.womansworld.com/posts/health/eat-these-3-things-for-a-healthy-heart", "urlToImage": "https://www.womansworld.com/wp-content/uploads/2023/04/heart-healthy.jpg", "publishedAt": "2023-04-17T21:30:00Z", "content": "Keeping your blood pressure, triglycerides, and cholesterol in a healthy range may cut your heart attack risk, sharpen your memory, and even add some healthy years to your life, suggests JAMA researc… [+1801 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Emotion-Focused Therapy for Bipolar Disorder Targets the Amygdala - Neuroscience News", "description": "Bipolar patients who received emotion-focused therapy showed increased connectivity and activation in the amygdala post-intervention compared to those who received cognitive behavioral therapy.", "url": "https://neurosciencenews.com/bipolar-emotion-therapy-amygdala-23035/", "urlToImage": "https://neurosciencenews.com/files/2023/04/amgydala-bipolar-disorder-neurosicences-public.jpg", "publishedAt": "2023-04-17T20:52:35Z", "content": "Summary: Bipolar patients who received emotion-focused therapy showed increased connectivity and activation in the amygdala post-intervention compared to those who received cognitive behavioral thera… [+5993 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Amanda Morris", "title": "Graphene 'tattoo' treats cardiac arrhythmia with light - Medical Xpress", "description": "Researchers led by Northwestern University and the University of Texas at Austin (UT) have developed the first cardiac implant made from graphene, a two-dimensional super material with ultra-strong, lightweight and conductive properties.", "url": "https://medicalxpress.com/news/2023-04-graphene-tattoo-cardiac-arrhythmia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/graphene-tattoo-treats.jpg", "publishedAt": "2023-04-17T20:41:20Z", "content": "Researchers led by Northwestern University and the University of Texas at Austin (UT) have developed the first cardiac implant made from graphene, a two-dimensional super material with ultra-strong, … [+6731 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Rapid Test Could Tell You If There's Salmonella in Your Chicken - Gizmodo", "description": "The low-tech test returns results in less than a hour and might be able to replace current methods that can take up to a day or longer.", "url": "https://gizmodo.com/researchers-create-rapid-salmonella-test-food-1850345457", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/82779a179163d0e0231dd7893dc0104d.jpg", "publishedAt": "2023-04-17T20:26:00Z", "content": "Scientists in Canada say theyve developed a cheap and easy way to find out if Salmonella is lurking in food. Their method can apparently detect the bacteria within an hours time and with less set-up … [+3021 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Hilary Brueck", "title": "Lifespan Calculator Predicts Age and Gives Factors You Can Change - Insider", "description": "A brief online questionnaire said I would live until almost 100, and then suggested science-backed ways to lengthen my lifespan.", "url": "https://www.insider.com/lifespan-calculator-doctor-science-backed-live-until-96-2023-4", "urlToImage": "https://i.insider.com/643d8725cd8ca000191905fd?width=1200&format=jpeg", "publishedAt": "2023-04-17T20:18:23Z", "content": "Dr. Thomas Perls, who created the free \"Living to 100 Life Expectancy Calculator\" says people often complain to him that \"we don't know yet how to get people to these very old ages in good health\"   … [+6118 chars]"}, {"source": {"id": null, "name": "PhillyVoice.com"}, "author": null, "title": "Is brown rice really healthier than white rice? Here's what nutrition experts say - PhillyVoice.com", "description": "Though brown rice is higher in fiber, protein and fat, it's a misnomer to believe that white rice is 'bad' for the body", "url": "https://www.phillyvoice.com/brown-white-rice-health-benefits/", "urlToImage": "https://media.phillyvoice.com/media/images/031723_Brown_vs_White_Rice_.2e16d0ba.fill-1200x630-c0.jpg", "publishedAt": "2023-04-17T20:04:04Z", "content": "White rice often gets a bad rap for not being as healthy as brown rice, but dietitians say both options offer important nutrients. But people need to be mindful to eat in moderation. \r\nMore than 3.5 … [+4085 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Poverty is the fourth greatest cause of U.S. deaths, analysis published in JAMA finds. - EurekAlert", "description": "University of Californian, Riverside, paper published Monday in the Journal of the American Medical Association associated poverty with an estimated 183,000 deaths in the United States in 2019 among people 15 years and older. It is first know such estimate.\nA", "url": "https://www.eurekalert.org/news-releases/986177", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/93b6d396-769c-49b0-8513-e4549f58604d/Rendition/thumbnail/Content/Public", "publishedAt": "2023-04-17T18:46:35Z", "content": "image: David Bradyview more \r\nCredit: University of California, Riverside\r\nPoverty has long been linked to shorter lives. But just how many deaths in the United States are associated with poverty? Th… [+3033 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Tara Parker-Pope, Caitlin Gilbert", "title": "A crisis in men’s health is getting worse - The Washington Post", "description": "Across the lifespan -- from infancy to the teen years, midlife and old age -- boys and men are more likely to die at every age compared to girls and women.", "url": "https://www.washingtonpost.com/wellness/2023/04/17/mens-health-longevity-gap/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HCVN5BCNQVE3VEXAVYBDOW6Y6E.jpg&w=1440", "publishedAt": "2023-04-17T18:29:00Z", "content": "Comment on this story\r\nComment\r\nA silent crisis in mens health is shortening the life spans of fathers, husbands, brothers and sons.\r\nFor years, the conventional wisdom has been that a lack of sex-sp… [+9102 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JUDY SIEGEL-ITZKOVICH", "title": "Modified Mediterranean diet twice as healthy as original - Israeli study - The Jerusalem Post", "description": "The Green Mediterranean/high polyphenols diet is even better for protecting the heart and other vital organs.", "url": "https://www.jpost.com/health-and-wellness/nutrition/article-739497", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/453903", "publishedAt": "2023-04-17T18:03:00Z", "content": "The Mediterranean diet has been praised by clinical dietitians around the world as being the most healthful of all. But now, a modified Mediterranean diet called the “Green Mediterranean/high polyphe… [+6266 chars]"}, {"source": {"id": null, "name": "Lifesavvy.com"}, "author": "Stacey Koziel", "title": "Wait, Sourdough Bread Is Good for You? - LifeSavvy", "description": "Have loaves of sourdough taken over your Instagram feed? Have you found yourself on #BreadTok?Sourdough saw a major movement throughout the pandemic, and its popularity is still holding strong today.", "url": "https://www.lifesavvy.com/166048/wait-sourdough-bread-is-good-for-you/", "urlToImage": "https://www.lifesavvy.com/p/uploads/2023/04/15d24b9e.jpg", "publishedAt": "2023-04-17T18:00:59Z", "content": "SMarina/Shutterstock.com\r\nHave loaves of sourdough taken over your Instagram feed? Have you found yourself on #BreadTok?Sourdough saw a major movement throughout the pandemic, and its popularity is s… [+1638 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Kelly Burch", "title": "Mom got stiff person syndrome diagnosis after kids' dad died - Insider", "description": "Stiff person syndrome is very rare, but singer Celine Dion was recently diagnosed. The disease's symptoms made it hard for a mom to care for her kids.", "url": "https://www.insider.com/stiff-person-syndrome-diagnosis-celine-dion-disease-2023-4", "urlToImage": "https://i.insider.com/643c2a337cdf0f00185cc82c?width=1200&format=jpeg", "publishedAt": "2023-04-17T17:55:59Z", "content": "Lif\r\nThis as-told-to essay is based on a conversation with Tara Zier. It has been edited for length and clarity.\r\nWhen my children were 11 and 13, their dad my ex died. It was tragic and sent me into… [+4121 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Music Can Prevent Cognitive Decline - Neuroscience News", "description": "Listening to or practicing music had positive implications on cognitive decline in older adults by stimulating the production of gray matter in key brain areas, a new study reveals.", "url": "https://neurosciencenews.com/music-cognitive-decline-23029/", "urlToImage": "https://neurosciencenews.com/files/2023/04/music-cognitive-decline-neurosciences-.jpg", "publishedAt": "2023-04-17T17:49:09Z", "content": "Summary: Listening to or practicing music had positive implications on cognitive decline in older adults by stimulating the production of gray matter in key brain areas, a new study reveals.\r\nSource:… [+6927 chars]"}, {"source": {"id": null, "name": "Intheknow.com"}, "author": "Kaitlin Stanford", "title": "‘Here is the real tea about quitting vaping’: TikTokers are documenting their vaping cessation experiences online - Yahoo Life", "description": "The hashtag #quittingvaping has more than 18.3 million views and seems to be growing more popular by the day.", "url": "https://www.intheknow.com/post/tiktokers-quitting-vaping/", "urlToImage": "https://media.zenfs.com/en/in_the_know_500/330f9dacd1a5723511bd99124e387e21", "publishedAt": "2023-04-17T17:44:30Z", "content": "Vaping has been on the rise for years now especially among younger Americans. In fact, according to the FDA, its estimated that 2.5 million middle and high school students actively vape, and 1 in 4 h… [+4797 chars]"}, {"source": {"id": null, "name": "Theeverygirl.com"}, "author": "haileyb", "title": "30+ Narcissist Red Flags You Need to Be Aware Of - The Everygirl", "description": "from first dates to family members 👀", "url": "http://theeverygirl.com/narcissist-red-flags/", "urlToImage": "https://media.theeverygirl.com/wp-content/uploads/2023/04/the-everygirl-social-narcissist-red-flags.jpg", "publishedAt": "2023-04-17T16:06:59Z", "content": "Watch out, readers. We have narcissists among us, and we must keep our eyes and ears wide open to spot them. They are present in families, work environments, friend circles, and, quite possibly the w… [+5173 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The gut microbiota contributes to the pathogenesis of anorexia nervosa in humans and mice - Nature.com", "description": "Faecal metagenomics and serum metabolomics reveal compositional and functional alterations in the gut microbiota of women with anorexia nervosa, and faecal transplants could transfer an anorexia-associated phenotype to germ-free mice.", "url": "https://www.nature.com/articles/s41564-023-01355-5", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41564-023-01355-5/MediaObjects/41564_2023_1355_Fig1_HTML.png", "publishedAt": "2023-04-17T15:42:40Z", "content": "Study participants\r\nThe AN patients were all diagnosed by an experienced consultant psychiatrist and they met the DSM-5 criteria for the restricting or binge/purging subtypes of AN1. Since 9095% of i… [+27580 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Ex vivo prime editing of patient haematopoietic stem cells rescues sickle-cell disease phenotypes after engraftment in mice - Nature.com", "description": "Prime editing can efficiently correct the sickle-cell allele to produce wild-type haemoglobin in patient haematopoietic stem cells that engraft efficiently in mice, yielding erythrocytes resistant to hypoxia-induced sickling.", "url": "https://www.nature.com/articles/s41551-023-01026-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41551-023-01026-0/MediaObjects/41551_2023_1026_Fig1_HTML.png", "publishedAt": "2023-04-17T15:08:09Z", "content": "Optimizing prime editing systems for HSPCs\r\nWe previously reported the use of prime editing to correct HBBS by plasmid transfection in HEK293T cells containing the SCD mutation, reaching up to 58% ef… [+33526 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Robby Berman", "title": "Type 2 diabetes and cognitive decline: Is Tai chi more effective than walking? - Medical News Today", "description": "Older adults with type 2 diabetes who practiced Tai Chi Chuan showed increased cognitive function compared to those who did fitness walking, according to a new study.", "url": "https://www.medicalnewstoday.com/articles/type-2-diabetes-and-cognitive-decline-is-tai-chi-more-effective-than-walking", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/04/tai_chi_senior_woman_732x549_thumb.jpg", "publishedAt": "2023-04-17T15:01:22Z", "content": "<ul><li>A study shows that people with type 2 diabetes-related mild cognitive impairment experienced a slowing of their cognitive decline after participating in Tai chi chuan sessions.</li><li>The se… [+5812 chars]"}, {"source": {"id": null, "name": "Deseret News"}, "author": "Margaret Darby", "title": "Ice cream might have surprising health benefits, Harvard research suggests - Yahoo News", "description": "Ice Cream healthy. Is Ice Cream good for you? Impacts of Ice Cream on health. What does Ice Cream do to your body? Ice Cream research.", "url": "https://www.deseret.com/23683767/ice-cream-health-benefits", "urlToImage": "https://media.zenfs.com/en/deseret_news_992/102eb0401bb16fbb69354a5bfbb31573", "publishedAt": "2023-04-17T14:25:50Z", "content": "Can ice cream actually be good for you? Harvard research might suggest it is. | Screenshot, Instagram user usuaggielife\r\nIf you asked someone to describe ice cream to you, its highly unlikely healthy… [+2778 chars]"}, {"source": {"id": null, "name": "Stanford.edu"}, "author": null, "title": "Durable, low-cost COVID-19 vaccine could help fill in gaps around the world - Stanford Medical Center Report", "description": "In a study led by Stanford Medicine researchers, a low-cost COVID-19 vaccine that does not require refrigeration provided immunity in rhesus monkeys for one year.", "url": "https://med.stanford.edu/news/all-news/2023/04/covid-vaccine.html", "urlToImage": "http://med.stanford.edu/content/dam/sm-news/images/2023/02/omicron.jpg", "publishedAt": "2023-04-17T14:14:46Z", "content": "Kim anticipates that the vaccine would work well as the initial version infants receive. An infants immune response could be more protective, Kim said, if the infant is first vaccinated with a broad-… [+3713 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "I'm a stomach doctor: Here is what the shape of your poop means about your bowel health - Daily Mail", "description": "Dr Nigma Talib (at left), a naturopathic doctor, went viral after explaining what different shapes of poop signify for health. While some effects are minor, others could point to serious health problems.", "url": "https://www.dailymail.co.uk/health/article-11973595/Im-stomach-doctor-shape-poop-means-bowel-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/14/18/69842169-0-image-a-5_1681495172770.jpg", "publishedAt": "2023-04-17T13:41:57Z", "content": "Dr Nigma Talib is a naturopathic doctor and gut health expert who shared on TikTok what different stool shapes show about overall health\r\nA doctor has revealed the shocking reason our stools are diff… [+4001 chars]"}, {"source": {"id": null, "name": "KERA News"}, "author": "Sam Baker", "title": "A new study says a widely-used artificial sweetener may cause heart problems - KERA News", "description": "Erythritol is used as a sugar substitute in a variety of foods. Dr. Brandie Williams, a cardiologist with Texas Health Stephenville, told KERA’s Sam Baker consuming large amounts may lead to serious problems.", "url": "https://www.keranews.org/health-wellness/2023-04-17/a-new-study-says-a-widely-used-artificial-sweetener-may-cause-heart-problems", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/8cbc925/2147483647/strip/true/crop/1000x525+0+62/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4e%2Fb7%2F91f29e6f4964a580357434b01799%2Ferythritol-2-ingredients.jpg", "publishedAt": "2023-04-17T13:15:00Z", "content": "About the study results\r\nIncreased amounts, when they were studied, showed an increased level of platelets in the blood. This makes it easier to form clots which can then lead to heart attack and str… [+3729 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dave A. Chokshi, MD, MS", "title": "Can diabetes be reversed? What to know about managing type 2 diabetes. - The Washington Post", "description": "Lifestyle changes and weight-loss surgery can lower weight and lead to reversal of Type 2 diabetes for some people.", "url": "https://www.washingtonpost.com/wellness/2023/04/17/diabetes-reverse-weight-loss/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CLA5DZDDTRCNHOMCVVOPTILKQE.gif&w=1440", "publishedAt": "2023-04-17T13:00:00Z", "content": "Comment on this story\r\nComment\r\nQ. Can I reverse my diabetes? Can I get off my medications, or will I have to stay on them for my whole life?\r\nA. There is no cure for diabetes, but it is reversible i… [+8382 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "georgia dodd", "title": "Dietitians Agree: The One Nut You Should Start Snacking On Immediately For Weight Loss And Belly Fat Reduction - SheFinds", "description": "Discover which nut dietitians say you should start snacking on for weight loss, only on SheFinds!", "url": "https://www.shefinds.com/collections/nut-weight-loss-belly-fat-reduction/", "urlToImage": "https://www.shefinds.com/files/2023/04/bow-of-yogurt-with-almonds-and-honey.jpg", "publishedAt": "2023-04-17T12:00:12Z", "content": "Everyone enjoys snacking between meals. Reaching for a nutritious snack can be just what you need to tide you over in between meals or give you a boost of energy for that workout. But not all snacks … [+2894 chars]"}]}