{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lisa Mulcahy", "title": "White vision is often benign, but can signal heart or other conditions - The Washington Post", "description": "Vision whiteouts are usually benign, but it's always worth making sure by consulting with your physician.", "url": "https://www.washingtonpost.com/wellness/2022/11/27/when-vision-goes-white/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YKACIZR6V4I63DDOSODL27GYEY.jpg&w=1440", "publishedAt": "2022-11-27T14:07:18Z", "content": "Comment on this story\r\nIf youve ever had your vision white out (or gray out), youve probably felt a little unnerved by the experience.\r\nYoull see a bright light, and your vision will go pale, says Te… [+4387 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Why Certain Types of Music Make Our Brains Sing, and Others Don’t - Neuroscience News", "description": "Music can induce a range of emotions and help us to better understand different cultures. But what is it that makes us tune in to some songs more than others? Researchers say when we listen to a song, our brains predict what happens next, and that prediction …", "url": "https://neurosciencenews.com/music-preference-prediction-21946/", "urlToImage": "https://neurosciencenews.com/files/2022/11/music-emotion-neurosiccences-public.jpg", "publishedAt": "2022-11-27T01:01:49Z", "content": "Summary: Music can induce a range of emotions and help us to better understand different cultures. But what is it that makes us tune in to some songs more than others? Researchers say when we listen … [+7821 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Educational Background and Previous Brain Injury May Be Associated With Higher Risk of Frontotemporal Dementia - Neuroscience News", "description": "Previous TBI increased the risk of frontotemporal dementia in those without a genetic risk factor for FTD. Additionally, researchers found those with FTD tend to be less educated than those with Alzheimer's disease.", "url": "https://neurosciencenews.com/ftd-tbi-education-21944/", "urlToImage": "https://neurosciencenews.com/files/2022/11/ftd-education-tbi-neurosicnes-public.jpg", "publishedAt": "2022-11-26T23:54:21Z", "content": "Summary: Previous TBI increased the risk of frontotemporal dementia in those without a genetic risk factor for FTD. Additionally, researchers found those with FTD tend to be less educated than those … [+6484 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Yahoo Canada Lifestyle Editors", "title": "10 of the worst foods for high blood pressure: Deli meat, bread & more - Yahoo Life", "description": "High blood pressure is a common condition in which the force of blood pushing against the body’s arteries is too high.", "url": "https://www.yahoo.com/lifestyle/worst-foods-for-high-blood-pressure-180034256.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.6.FpYcS7sawXLcErYVarw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDU-/https://s.yimg.com/os/creatr-uploaded-images/2022-11/e74a7a50-6da6-11ed-bed3-96ad1a78b43b", "publishedAt": "2022-11-26T18:00:34Z", "content": "From bread to deli meat, here's the worst foods you can eat for high blood pressure. (Photos via Getty Images)\r\nThis article is for informational purposes only and is not a substitute for professiona… [+5759 chars]"}, {"source": {"id": null, "name": "The Daily Dot"}, "author": null, "title": "'You handled that thing for 4 years': Woman says boyfriend asked her to Venmo him $7 for cold medicine he bought her - msnNOW", "description": "TikToker Jackie (@jackieli852) went viral after sharing a story about the time her former boyfriend sent her a Venmo request after picking up some cold medicine for her when she was sick. Commenters were shocked at the man's audacity, with many stating that i…", "url": "https://www.dailydot.com/irl/boyfriend-venmo-request-7-dollars/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14AjIh.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=472&y=212", "publishedAt": "2022-11-26T17:39:39Z", "content": "TikToker Jackie (@jackieli852) went viral after sharing a story about the time her former boyfriend sent her a Venmo request after picking up some cold medicine for her when she was sick.\r\n© Provided… [+3033 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": null, "title": "When Is Your Heart Rate Considered Dangerous? - msnNOW", "description": "Your heart rate will go up and down as you go about your day. However, it could be dangerous for your heart rate to go too high under certain circumstances.", "url": "https://www.healthdigest.com/1116919/when-is-your-heart-rate-considered-dangerous/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14AnrM.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-26T17:25:49Z", "content": "It may seem like your heart is beating with regularity throughout the day unless you are exercising, but that's not true. Your heart rate will go up and down as you go about your day. Doing something… [+2113 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Amy Yurkanin | ayurkanin@al.com", "title": "2 children, 9 adults have died from flu in Alabama, report says - AL.com", "description": "In its latest weekly influenza report, the Alabama Department of Public Health reported 11 deaths from influenza. But it also shows decreases in the number of medical visits for flu-like symptoms.", "url": "https://www.al.com/news/2022/11/two-children-and-nine-adults-have-died-from-flu-in-alabama-report-says.html", "urlToImage": "https://www.al.com/resizer/bKHIAIHisFqTUKcvyHI-hxFmnoc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/6A3VUZDZLZDZFAUSJICRNPNRHI.jpg", "publishedAt": "2022-11-26T16:40:00Z", "content": "An outbreak of influenza that has hit the South particularly hard has now taken the lives of two children and nine adults in Alabama, according to the state department of public health.\r\nThe report f… [+1609 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Tom Polansek, Reuters", "title": "Avian flu outbreak wipes out 50M US birds, a record - KSL.com", "description": "Avian flu has wiped out 50.54 million birds in the United States this year, making it the country's deadliest outbreak in history, U.S. Department of Agriculture data showed on Thursday.", "url": "https://www.ksl.com/article/50525609/avian-flu-outbreak-wipes-out-50m-us-birds-a-record", "urlToImage": "https://img.ksl.com/slc/2903/290396/29039691.JPG?filter=kslv2/responsive_story_lg", "publishedAt": "2022-11-26T15:11:56Z", "content": "Estimated read time: 2-3 minutes\r\nCHICAGO Avian flu has wiped out 50.54 million birds in the United States this year, making it the country's deadliest outbreak in history, U.S. Department of Agricul… [+2134 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "New longitudinal research highlights how grave the effects of childhood trauma can be for anxiety and depression - PsyPost", "description": "Childhood trauma is well-known to have adverse effects on mental health into adulthood, but the nuances of these outcomes are not well understood. A study published in the Journal of Affective Disorders explores how childhood trauma impacts specific aspects o…", "url": "https://www.psypost.org/2022/11/new-longitudinal-research-highlights-how-grave-the-effects-of-childhood-trauma-can-be-for-anxiety-and-depression-64380", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/11/sad-depressed-girl.jpg", "publishedAt": "2022-11-26T14:15:00Z", "content": "Childhood trauma is well-known to have adverse effects on mental health into adulthood, but the nuances of these outcomes are not well understood. A study published in the Journal of Affective Disord… [+4090 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Adam Meyer", "title": "The Link Between Grocery Shopping and Dementia — Best Life - Best Life", "description": "A new study just found a surprising connection between grocery shopping and dementia, especially in older people. Here's what to know now.", "url": "https://bestlifeonline.com/grocery-shopping-dementia-risk-link-news/", "urlToImage": "https://bestlifeonline.com/wp-content/uploads/sites/3/2022/11/shutterstock_1986050114.jpg?quality=82&strip=all", "publishedAt": "2022-11-26T12:05:05Z", "content": "Every three seconds, someone in the world develops dementia, according to Alzheimer's Disease International (ADI). That means by the time you finish this article, 40 or more new people will be facing… [+4810 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte", "title": "Secrets of 'SuperAgers' with superior memories into their 80s - CNN", "description": "Are you destined to become a 'SuperAger,\" with a memory as sharp in your 80s as it was in your 50s? Here's what science knows about those who keep their ability to remember as they age.", "url": "https://www.cnn.com/2022/11/26/health/superager-secrets-good-memory-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221125162214-carol-seigler.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-26T10:02:00Z", "content": "Editors Note: Sign up for CNNs Fitness, But Better newsletter series. Our seven-part guide will help you ease into a healthy routine, backed by experts.\r\nDespite volunteering and working out at the g… [+6483 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Elmira Tanatarova", "title": "Dr Alnajjar tells FEMAIL about underlying conditions which could be causing erectile dysfunction - Daily Mail", "description": "British doctor Dr Hussain Alnajjar told FEMAIL about the possible underlying issues which could bring about erectile dysfunction, from stress and obesity to heart disease.", "url": "https://www.dailymail.co.uk/femail/article-11361999/Dr-Alnajjar-tells-FEMAIL-underlying-conditions-causing-erectile-dysfunction.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/03/11/64150363-0-image-a-49_1667476310303.jpg", "publishedAt": "2022-11-26T09:36:22Z", "content": "It can feel humiliating or shameful to suffer from erectile dysfunction - despite the fact it affects half the male population of the UK between the ages of 40 and 70.\r\nBut experts have now revealed … [+6412 chars]"}, {"source": {"id": null, "name": "Ynetnews"}, "author": "Laurie Shtatmaor", "title": "'Most don't know what their vagina looks like': Sneak peek inside Israel's female anatomy course - Ynetnews", "description": "24 women meet up in a workshop hall in the north of the country to learn about their pelvic floors, their vaginas and the pleasure they can get out of them for some women, it’s the first time they’d ever seen their own vaginas", "url": "https://www.ynetnews.com/magazine/article/rkokmkvis", "urlToImage": "https://ynet-images1.yit.co.il/picserver5/crop_images/2022/09/20/rJSo9mgPWs/rJSo9mgPWs_295_256_2706_1524_0_large.jpg", "publishedAt": "2022-11-26T06:41:31Z", "content": "Some 24 women sit in a circle in a spacious, bright and colorful workshop venue in the Yarok Az farm in Ilaniya in northern Israel. They shyly look at one another, knowing that over the next two days… [+16769 chars]"}, {"source": {"id": null, "name": "YourTango"}, "author": "Megan  Quinn", "title": "Mom Wants To Send Daughter To 'Fat Camp' After She Gained Weight — But Her Ex-Husband Refuses - YourTango", "description": "A concerned mother took to Reddit to share that her daughter has gained an unhealthy amount of weight for her age after her ex-husband fed her large portions of junk food. she wants to send their daughter to a sports camp to manage her weight, but her husband…", "url": "https://www.yourtango.com/entertainment/mom-wants-send-daughter-fat-camp-gained-weight-ex-husband-refusing", "urlToImage": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/mom-daughter-fat-camp.png?itok=divSEsct", "publishedAt": "2022-11-26T00:17:51Z", "content": "A mother is seeking advice after an argument with her ex-husband over their daughters weight.\r\nThe mother wants to send their overweight daughter to a sports camp geared toward helping her achieve a … [+3985 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Michael Mosley", "title": "DR MICHAEL MOSLEY: The simple steps I'm taking to help ward off cancer - Daily Mail", "description": "DR MICHAEL MOSLEY: As anyone who has seen a friend or loved one die from cancer knows, it can be a terrible disease. Half of us will develop cancer at some point in our lives, so most will be affected.", "url": "https://www.dailymail.co.uk/health/article-11470823/DR-MICHAEL-MOSLEY-simple-steps-Im-taking-help-ward-cancer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/25/23/64951079-0-image-a-14_1669418202316.jpg", "publishedAt": "2022-11-25T23:17:30Z", "content": "As anyone who has seen a friend or loved one die from cancer knows, it can be a terrible disease.\r\nHalf of us will develop cancer at some point in our lives, so most will be affected in some way.\r\nOv… [+6497 chars]"}]}