{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Common Food Additives Linked to an Increased Risk of Type 2 Diabetes - SciTechDaily", "description": "A new study has found a link between consuming nitrites from drinking water and diet and the risk of developing type 2 diabetes. Nitrates and nitrates are naturally found in water and soil and are used as food preservatives to extend shelf life. The research …", "url": "https://scitechdaily.com/common-food-additives-linked-to-an-increased-risk-of-type-2-diabetes/", "urlToImage": "https://scitechdaily.com/images/Bacon-Concept.jpg", "publishedAt": "2023-02-01T03:39:18Z", "content": "Foods that commonly use nitrite preservatives include processed meats such as bacon, ham, hot dogs, sausages, corned beef, and cured meats. Additionally, some cheeses, smoked fish, and pickled produc… [+3461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger", "title": "CDC advises against using EzriCare eye drops as it investigates dozens of infections and one death in 11 states - CNN", "description": "The US Centers for Disease Control and Prevention is urging health care providers and consumers to stop using EzriCare Artificial Tears as it conducts an investigation into at least 50 infections in 11 states that have led to instances of permanent vision los…", "url": "https://www.cnn.com/2023/01/31/health/ezricare-eye-drops-infections-cdc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230131175412-ezricare-eye-drops-products.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-01T03:07:00Z", "content": "The US Centers for Disease Control and Prevention is urging health care providers and consumers to stop using EzriCare Artificial Tears as it conducts an investigation into at least 50 infections in … [+1628 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Infants Exposed to Excessive Screen Time Show Differences in Brain Function Beyond Eight Years of Age - Neuroscience News", "description": "Greater exposure to screen time during infancy was linked to poor self-regulation and brain immaturity at age eight.", "url": "https://neurosciencenews.com/screen-time-brain-maturity-22410/", "urlToImage": "https://neurosciencenews.com/files/2023/01/child-screentime-brain-neurosicnes-public.jpg", "publishedAt": "2023-02-01T00:48:28Z", "content": "Summary: Greater exposure to screen time during infancy was linked to poor self-regulation and brain immaturity at age eight.\r\nSource: Agency for Science, Technology, and Research\r\nMore children are … [+9134 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Ultra-Processed Foods May Be Linked to Increased Risk of Cancer - Neuroscience News", "description": "High consumption of ultra-processed foods, including soda, chips, and some white bread products, was associated with an increased risk of developing and dying from certain kinds of cancer, including brain cancer.", "url": "https://neurosciencenews.com/brain-cancer-ultra-processed-food-22417/", "urlToImage": "https://neurosciencenews.com/files/2023/01/ultra-processed-food-cancer-neurosciences-public.jpg", "publishedAt": "2023-01-31T23:59:09Z", "content": "Summary: High consumption of ultra-processed foods, including soda, chips, and some white bread products, was associated with an increased risk of developing and dying from certain kinds of cancer, i… [+6196 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "'Reverse Dieting' Is Not a Weight Loss Cheat Code - Lifehacker", "description": "Fitness influencers are all about reverse dieting, but their approach isn't the opposite of a diet at all.", "url": "https://lifehacker.com/reverse-dieting-is-not-a-weight-loss-cheat-code-1850056077", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bc1f122c8ba19813925b7ac5ea324b9f.jpg", "publishedAt": "2023-01-31T23:00:00Z", "content": "To hear the TikTok girlies tell it, theres a hack that will let you EAT MORE FOOD! While NOT GAINING WEIGHT! And its great if you are SICK OF DIETING! Never mind that one can achieve all those goals … [+8652 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Tuning Into Brainwave Rhythms Speeds up Learning in Adults - Neuroscience News", "description": "Tuning into a person's brain wave cycle before they perform a learning task can dramatically improve the speed at which cognitive skills improve.", "url": "https://neurosciencenews.com/brain-waves-learning-22415/", "urlToImage": "https://neurosciencenews.com/files/2023/01/brain-waves-learning-neurosicences.png", "publishedAt": "2023-01-31T22:52:28Z", "content": "Summary: Tuning into a person’s brain wave cycle before they perform a learning task can dramatically improve the speed at which cognitive skills improve.\r\nSource: University of Cambridge\r\nScientists… [+7970 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Haslett", "title": "Doctor Megan Rossi: These are the foods you need to eat together to increase the health benefits - Daily Mail", "description": "Harley Street dietitian Dr Megan Rossi, from Queensland, has revealed the foods you should eat together in order to boost the absorption of vitamins and minerals and give you the best health benefits.", "url": "https://www.dailymail.co.uk/femail/health/article-11698365/Doctor-Megan-Rossi-foods-need-eat-increase-health-benefits.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/31/22/67183051-0-image-a-4_1675203711945.jpg", "publishedAt": "2023-01-31T22:40:49Z", "content": "A doctor has revealed the foods you should eat together in order to boost the absorption of vitamins and minerals and give you the best health benefits.\r\nLeading Harley Street dietitian and King's Co… [+4883 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Anthony Robledo", "title": "Celebs Who've Addressed The Ozempic Weight Loss Trend - BuzzFeed News", "description": "Chelsea Handler, Remi Bader, and Elon Musk are among the celebs who've shared their thoughts.", "url": "https://www.buzzfeednews.com/article/anthonyrobledo/celebrities-ozempic-weight-loss-drug-trend-quotes", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2023-01/31/21/tmp/ac5c1ff92b81/tmp-name-3-1125-1675199830-0_dblbig.jpg", "publishedAt": "2023-01-31T21:55:16Z", "content": "Semaglutide, the injectable drug sold under brand names like Ozempic\r\n and Wegovy, has apparently become popular with an unintended crowd: celebrities looking to dramatically lose weight.\r\nThis is a … [+893 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Reveal New Potential Therapeutic Targets for Mental and Neurological Disorders - SciTechDaily", "description": "UCI researchers have discovered the crucial role of cilia in the striatum of the brain in time perception. A recent study from researchers at the University of California, Irvine found that the removal of cilia from the striatum region of the brain negatively…", "url": "https://scitechdaily.com/scientists-reveal-new-potential-therapeutic-targets-for-mental-and-neurological-disorders/", "urlToImage": "https://scitechdaily.com/images/Brain-Skull-Illustration.jpg", "publishedAt": "2023-01-31T20:51:44Z", "content": "ByUniversity of California - IrvineJanuary 31, 2023\r\nCilia are small, hair-like structures found on the surface of cells in the body. They are known to play important roles in various bodily function… [+4324 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Beta-Blocker Use Associated With Lower Rates of Violence - Neuroscience News", "description": "Beta-blockers, a class of drugs commonly used to treat hypertension and cardiovascular disorders, appear to reduce aggressive and violent behaviors, and can reduce suicidal behaviors.", "url": "https://neurosciencenews.com/beta-blocker-violence-22409/", "urlToImage": "https://neurosciencenews.com/files/2023/01/beta-blocker-violence-neurosicences-public.jpg", "publishedAt": "2023-01-31T20:39:26Z", "content": "Summary: Beta-blockers, a class of drugs commonly used to treat hypertension and cardiovascular disorders, appear to reduce aggressive and violent behaviors, and can reduce suicidal behaviors.\r\nSourc… [+7297 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Do Sleep Medications Increase Your Chances of Dementia? - Neuroscience News", "description": "People who frequently take sleeping medications are 79% more likely to develop dementia than those who never use sleeping pills to aid their rest.", "url": "https://neurosciencenews.com/dementia-sleeping-medications-22408/", "urlToImage": "https://neurosciencenews.com/files/2023/01/dementia-sleep-medications-neuroscience-public.jpg", "publishedAt": "2023-01-31T20:22:03Z", "content": "Summary: People who frequently take sleeping medications are 79% more likely to develop dementia than those who never use sleeping pills to aid their rest.\r\nSource: UCSF\r\nA new study shows that sleep… [+5909 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "A man bought seeds online to brew tea for his chronic pain. It led to an opioid addiction. - msnNOW", "description": "The 65-year-old patient used poppy seed tea for chronic pain and struggled to stop drinking it on his own, according to a case report.", "url": "https://www.insider.com/man-brewed-poppy-seed-tea-for-pain-relief-opioid-addiction-2023-1", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA16XSMj.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-01-31T20:05:37Z", "content": "© Elena Poppova/Getty Images\r\n Unwashed seeds from the poppy flower may contain intoxicating substances. Elena Poppova/Getty Images\r\nA man who was originally prescribed opioids for pain relief turned… [+8833 chars]"}, {"source": {"id": null, "name": "WOODTV.com"}, "author": "Anna Skog", "title": "Doctor: Check for symptoms, family history of thyroid disease - WOODTV.com", "description": "Over 12% of the U.S. population will develop some form of thyroid condition during their lifetime, according to the American Thyroid Association. A West Michigan doctor recommends keeping an eye on yours.", "url": "https://www.woodtv.com/news/grand-rapids/doctor-check-for-symptoms-family-history-of-thyroid-disease/", "urlToImage": "https://www.woodtv.com/wp-content/uploads/sites/51/2019/08/generic20doctor27s20office_1521596390549-1.jpg_37858888_ver1.0-1.jpg?w=1280", "publishedAt": "2023-01-31T19:54:51Z", "content": "GRAND RAPIDS, Mich. (WOOD) Over 12% of the U.S. population will develop some form of thyroid condition during their lifetime, according to the American Thyroid Association. A West Michigan doctor rec… [+1464 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": "Jack Phillips", "title": "MSNBC Anchor Hospitalized With Severe Myocarditis, Pericarditis - The Epoch Times", "description": "An MSNBC anchor revealed in a recent segment that she was hospitalized with heart inflammation in December, leading her to miss work for about a month. Yasmin Vossoughian said that the health scare started on Dec. 20 when she started to experience chest pains…", "url": "https://www.theepochtimes.com/msnbc-anchor-hospitalized-with-severe-myocarditis-pericarditis_5023449.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2023/01/31/psdpaspdusadpasudpsaduaspd-1200x702.jpg", "publishedAt": "2023-01-31T18:31:24Z", "content": "An MSNBC anchor revealed in a recent segment that she was hospitalized with heart inflammation in December, leading her to miss work for about a month.\r\nYasmin Vossoughian said that the health scare … [+3247 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rachel Grumman Bender", "title": "A 'concerning' number of women 65 and older are dying from cervical cancer, according to a new study - Yahoo Life", "description": "More older women are being diagnosed with late-stage cervical cancer, which experts say is concerning. Here's what you need to know.", "url": "https://www.yahoo.com/lifestyle/cervical-cancer-deaths-65-and-older-171230507.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/lXZEa2Da3wCMWf4Sfv4Zig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2023-01/dec3f7d0-9e84-11ed-9e3d-2d75122e3e80", "publishedAt": "2023-01-31T17:12:30Z", "content": "More older women are being diagnosed with late-stage cervical cancer, which has lower survival rates. (Getty Images)\r\nNearly one in five new cervical cancers diagnosed from 2009 to 2018 were in women… [+7931 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "L'Oreal Thompson Payton", "title": "Valley fever could be spreading across the U.S. Here are the symptoms and what you need to know - Fortune", "description": "Infection most commonly found in the southwestern United States.", "url": "https://fortune.com/well/2023/01/31/valley-fever-fungal-infection-symptoms/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/01/Valley-Fever-GettyImages-1386022761.jpg?resize=1200,600", "publishedAt": "2023-01-31T17:03:00Z", "content": "Valley fever, a fungal infection most notably found in the Southwestern United States, is now likely to spread east, throughout the Great Plains and even north to the Canadian border because of clima… [+3951 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Brooke Steinberg", "title": "My hormones were feeding my unborn baby -- and a melon-sized cyst - New York Post ", "description": "A pregnant mom discovered her baby wasn’t the only thing growing in her stomach.", "url": "https://nypost.com/2023/01/31/my-hormones-were-feeding-my-unborn-baby-and-a-cyst/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/01/comp6-1.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-01-31T17:03:00Z", "content": "A pregnant mom discovered her baby wasnt the only thing growing in her stomach.\r\nEve Lincoln from Hudson Valley, New York, found out her unborn baby was sharing a space with a melon-sized cyst and he… [+4667 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte", "title": "Adult drug use rose during pandemic, but dropped dramatically in youth, study says - CNN", "description": "Adult use of marijuana and alcohol rose when Covid-19 struck, but use of any substance dropped in teenagers, a new study finds.", "url": "https://www.cnn.com/2023/01/31/health/drug-use-pandemic-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210917002113-02-marijuana-smoking-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-01-31T16:04:00Z", "content": "Editors Note: Sign up for CNNs Stress, But Less newsletter. Our six-part mindfulness guide will inform and inspire you to reduce stress while learning how to harness it.\r\nUse of marijuana and other s… [+3904 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Beth Ellwood", "title": "Study finds that poor sleep quality increases aggression, possibly by affecting emotional cognition - PsyPost", "description": "A lack of quality sleep can cause aggressive behavior, according to recent longitudinal findings published in the journal Biological Psychology. Brain imaging data revealed that the effect may be related to reduced activity in the prefrontal cortex and increa…", "url": "https://www.psypost.org/2023/01/study-finds-that-poor-sleep-quality-increases-aggression-possibly-by-affecting-emotional-cognition-67250", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/01/angry-aggressive-asian-man.jpg", "publishedAt": "2023-01-31T16:01:56Z", "content": "A lack of quality sleep can cause aggressive behavior, according to recent longitudinal findings published in the journal Biological Psychology. Brain imaging data revealed that the effect may be rel… [+4935 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "A Physical Theory For When the Brain Performs Best - Quanta Magazine", "description": "The critical brain hypothesis suggests that neural networks do their best work when connections are not too weak or too strong.", "url": "https://www.quantamagazine.org/a-physical-theory-for-when-the-brain-performs-best-20230131/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/01/CriticalityVide-byMyriamWares-Social.webp", "publishedAt": "2023-01-31T16:00:54Z", "content": "Over the last few decades, an idea called the critical brain hypothesis has been helping neuroscientists understand how the human brain operates as an information-processing powerhouse. It posits tha… [+7542 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tara Swart Bieber", "title": "MIT neuroscientist: 4 things I never do to avoid 'brain fog and forgetfulness' - CNBC", "description": "Brain fog can be caused by stress or eating the wrong foods. Neuroscientist Tara Swart Bieber shares how she boosts mental clarity, memory and concentration.", "url": "https://www.cnbc.com/2023/01/31/neuroscientist-how-to-avoid-brain-fog.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107186004-1675103639261-GettyImages-1438632563.jpg?v=1675179655&w=1920&h=1080", "publishedAt": "2023-01-31T15:40:55Z", "content": "The alarm goes off. You get dressed, grab your coffee, and head to work. But by lunchtime, you start to feel disorganized. You reread emails because you lack focus and mental clarity.\r\nThere's nothin… [+3959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Discovery: Obesity Causes Neurodegeneration Similar to Alzheimer's Disease - SciTechDaily", "description": "Controlling excess weight could lead to improved health outcomes and slow cognitive decline. A correlation between neurodegeneration in obese people and Alzheimer’s disease (AD) patients has been found in a new study led by scientists at The Neuro (Montreal N…", "url": "https://scitechdaily.com/shocking-discovery-obesity-causes-neurodegeneration-similar-to-alzheimers-disease/", "urlToImage": "https://scitechdaily.com/images/Obesity-Related-Brain-Neurodegeneration.jpg", "publishedAt": "2023-01-31T14:00:37Z", "content": "ByMcGill UniversityJanuary 31, 2023\r\nA comparison of cortical thickness between the brains of obese patients to those with Alzheimers disease. Darker colors indicate similarities in cortical thicknes… [+3358 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Jane McGuire", "title": "I did 100 plank jacks every day for a week — here's what happened to my body - Tom's Guide", "description": "Is this move the secret to a stronger core?", "url": "https://www.tomsguide.com/news/i-did-100-plank-jacks-every-day-for-a-week-heres-what-happened", "urlToImage": "https://cdn.mos.cms.futurecdn.net/z5kfeXDL8KP7wgA7dB2dHL-1200-80.jpg", "publishedAt": "2023-01-31T13:04:32Z", "content": "What do you get if you cross a jumping jack with a plank? A plank jack. This killer dynamic core move is as intense as it sounds, as you engage your stabilizer muscles to secure your body as you jump… [+4703 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "Mpox is almost gone in the US, leaving lessons and mysteries in its wake - CNN", "description": "The US public health emergency declaration for mpox, formerly known as monkeypox, ends Tuesday.", "url": "https://www.cnn.com/2023/01/31/health/mpox-public-health-emergency-lessons/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230130131037-mpox-miscrograph-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-01-31T13:04:00Z", "content": "The US public health emergency declaration for mpox, formerly known as monkeypox, ends Tuesday.\r\nThe outbreak, which once seemed to be spiraling out of control, has quietly wound down. The virus isnt… [+15115 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Maria Cohut, Ph.D.", "title": "Depression and the gut: Can diet help improve mental health? - Medical News Today", "description": "Dr. Najaf Amin and mental health advocate Rachel Kelly join Medical News Today in conversation about why and how diet might help fight symptoms of depression.", "url": "https://www.medicalnewstoday.com/articles/in-conversation-can-diet-help-improve-depression-symptoms", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/01/1200x630-Facebook-inconvo-diet-1200x628.jpg", "publishedAt": "2023-01-31T11:02:08Z", "content": "Many people around the world live with depression, which can have a severe impact on their quality of life. While approaches like therapy and medication can help some people manage their symptoms, fo… [+15252 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jodi Helmer", "title": "The 4 best diets for healthy aging that experts say will keep your brain sharp and your body healthy - Yahoo Finance", "description": "“Diet is a key determinant of healthy aging.”", "url": "https://finance.yahoo.com/news/4-best-diets-healthy-aging-110000227.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/N.vr8jOSRHKz5iyjTgxdsw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/fortune_175/834852a31b8a85287360d8a452a694e0", "publishedAt": "2023-01-31T11:00:00Z", "content": "You cant change the number of candles on your birthday cake, but you can change how you feel and function as you get olderno injections, serums, or surgeries required. In fact, the latest science sho… [+5954 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Tim Requarth", "title": "Does getting COVID really make your immune system worse? - Slate", "description": "The research sounds scary—but it’s complicated.", "url": "https://slate.com/technology/2023/01/immunity-covid-research-airborne-aids-debunk.html", "urlToImage": "https://compote.slate.com/images/78841589-5317-4cd2-b672-1e4043436987.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2023-01-31T10:45:00Z", "content": "When the immune system goes awry, its bad news. A wonky immune system might mean that youre more likely to catch colds and flus, or be infected by other pathogensand less likely to shake them off. It… [+14723 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "Researchers discover the fast food link to fatty liver disease - KABC-TV", "description": "A first-of-its-kind study suggests fast food can have a direct impact on your liver health as well.", "url": "https://abc7.com/liver-disease-fast-food-eating-habits-new-study/12752281/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12752436_013023-kabc-5pm-fast-food-liver-disease-vid.jpg?w=1600", "publishedAt": "2023-01-31T08:24:45Z", "content": "LOS ANGELES (KABC) -- Too much alcohol can cause liver disease, and now a first-of-its-kind study suggests fast food can have a direct impact on your liver health as well.\r\nAbout 30% of people in the… [+2074 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Mustafa Javid Qadri", "title": "What is Kawasaki disease? Symptoms, treatments and when to seek help - The Independent", "description": "The disease can cause blood vessels around the heart to expand if not treated in time and could lead to heart complications", "url": "https://www.independent.co.uk/news/uk/home-news/kawasaki-disease-symptoms-contagious-adults-b2272516.html", "urlToImage": "https://static.independent.co.uk/2023/01/30/17/newFile.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-01-31T07:55:29Z", "content": "Get the free Morning Headlines email for news from our reporters across the world\r\nSign up to our free Morning Headlines email\r\nKawasaki disease is one of the leading causes of heart failure for chil… [+2513 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "", "title": "'I still want to have hope': images inspired by terminal cancer – in pictures - The Guardian", "description": "After receiving a diagnosis of stage four lung cancer, Stephen Starkman was determined to document his final days, from hospital wards to calming nature", "url": "https://www.theguardian.com/artanddesign/gallery/2023/jan/31/i-still-want-to-have-hope-images-inspired-by-terminal-cancer-in-pictures", "urlToImage": "https://i.guim.co.uk/img/media/ce121952cd0bd3106afc821067d528c82accf1b8/0_54_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=418608e34ff46e39816627ab3da54a18", "publishedAt": "2023-01-31T07:00:40Z", "content": "After receiving a diagnosis of stage four lung cancer, Stephen Starkman was determined to document his final days, from hospital wards to calming nature"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Laura Simmons", "title": "Long COVID Linked To Just 7 Symptoms, Scientists Surprised To Find - IFLScience", "description": "Despite the catalog of symptoms reported by long-haulers, researchers identified just seven that were specifically associated with COVID-19.", "url": "https://www.iflscience.com/long-covid-linked-to-just-7-symptoms-scientists-surprised-to-find-67327", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67327/aImg/65317/long-covid-meta.jpg", "publishedAt": "2023-01-31T04:42:00Z", "content": "Only seven symptoms can be specifically linked to long COVID, according to the results of new study in over 50,000 patients. The researchers were surprised by the finding, given the massive number of… [+3148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Can dates help diabetics lower blood sugar? Know how much, which variety and ripeness suits you - The Indian Express", "description": "Put together by Dr Anoop Misra, Chairman, Fortis CDOC Hospital for Diabetes and Allied Sciences, and Dr Meenakshi Bajaj, dietician, Tamil Nadu Government Multi-Super Speciality Hospital, Chennai, a review of several studies shows how dates, had the right way,…", "url": "https://indianexpress.com/article/health-wellness/dates-diabetics-lower-blood-sugar-how-much-which-variety-and-ripeness-8414079/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200_getty.jpg", "publishedAt": "2023-01-31T03:40:46Z", "content": "There is a common belief that people with Type 2 diabetes must avoid consumption of dates. But a recent review of research findings shows that the intake of dates does not have a significant effect o… [+5686 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Angela Epstein", "title": "Could taking a depression pill prevent lasting agony of shingles? - Daily Mail", "description": "Sitting in A&E, with piercing pain radiating across his forehead and his left eye, David Hadfield clutched his head, struggling to work out what was going wrong.", "url": "https://www.dailymail.co.uk/health/article-11693731/Could-taking-depression-pill-prevent-lasting-agony-shingles.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/30/21/67133567-0-image-a-38_1675113577366.jpg", "publishedAt": "2023-01-31T01:34:00Z", "content": "Sitting in A&amp;E, with piercing pain radiating across his forehead and his left eye, David Hadfield clutched his head, struggling to work out what was going wrong.\r\nThe answer emerged during his ho… [+10572 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Martin Scurr", "title": "My heart rate is 100 beats a minute when I wake up. Would an ablation help? DR MARTIN SCURR answers - Daily Mail", "description": "MARTIN SCURR: Your rapid heartbeat is most likely a feature of your atrial fibrillation (AF), the most common abnormal heart rhythm disorder that affects 1.4 million people in the UK.", "url": "https://www.dailymail.co.uk/health/article-11693493/My-heart-rate-100-beats-minute-wake-ablation-help-DR-MARTIN-SCURR-answers.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/30/19/67133421-0-image-a-10_1675106009374.jpg", "publishedAt": "2023-01-31T01:31:00Z", "content": "My heartbeat is rapid very seldom below 100 beats per minute, even after a good nights sleep. I have atrial fibrillation and am prescribed bisoprolol, but I am still not cured. Would an ablation help… [+5887 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Isabelle Gerretsen", "title": "Should you sing when suffering from a cold? - BBC", "description": "Respiratory infections such as the common cold or flu can play havoc with our voices, but is it still safe to sing? And does Covid-19 represent a new threat?", "url": "https://www.bbc.com/future/article/20230130-should-you-sing-when-suffering-from-a-cold", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0dzwy2z.jpg", "publishedAt": "2023-01-31T01:04:52Z", "content": "Vocal fold nodules are another concern for many singers, but they aren't caused by colds or infections, according to Costello.\r\n\"Nodules develop over time when a singer brings their vocal folds toget… [+2354 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Boston ER doctor reacts to new study on pediatric COVID-19 deaths - WCVB Channel 5 Boston", "description": "Kids are significantly less likely to die of COVID-19 than any other age group, but federal data now shows they are also more likely to die from COVID than p...", "url": "https://www.youtube.com/watch?v=OAo5x_Ni6po", "urlToImage": "https://i.ytimg.com/vi/OAo5x_Ni6po/hqdefault.jpg", "publishedAt": "2023-01-31T00:10:44Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Dangers of concussion laid bare by major new study - Daily Mail", "description": "The study of more than 15,000 Brits people found the risk was cumulative - meaning the more times a person injures their brain, the worse their brain function could be as they age.", "url": "https://www.dailymail.co.uk/health/article-11692569/Dangers-concussion-laid-bare-major-new-study.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/30/14/67123689-0-image-a-5_1675088492254.jpg", "publishedAt": "2023-01-31T00:01:00Z", "content": "Just one serious concussion can damage memory and brain power in later life, major new research has revealed.\r\nIn the largest of its kind, Oxford University researchers found three or more moderate b… [+3341 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Amanda Gardner", "title": "Here's What The Cordyceps Fungus Is Like In Real Life, According to Scientists - BuzzFeed News", "description": "“For decades, science fiction writers have taken basic ideas to an extreme. That’s part of the fun.”", "url": "https://www.buzzfeednews.com/article/amandagardner/cordyceps-last-of-us-zombie-fungus", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2023-01/30/22/asset/c2a066eb4b29/sub-buzz-1330-1675117074-19.jpg?crop=627:328;270,17%26downsize=1250:*", "publishedAt": "2023-01-30T23:45:32Z", "content": "If were to believe HBOs zombie apocalypse series The Last of Us\r\n, the end of humankind comes via the tentacles of a creepy-looking, brain-infecting fungus called cordyceps.\r\nAs with so many terrifyi… [+5949 chars]"}, {"source": {"id": null, "name": "Q13 News Seattle"}, "author": "FOX 13 Seattle", "title": "Woman with tuberculosis refusing treatment; health department could seek court order to force her hand - FOX 13 Seattle", "description": "The Tacoma-Pierce County Health Department is monitoring a case of active tuberculosis (TB) in a woman in Tacoma, who is currently declining treatment.", "url": "https://www.q13fox.com/news/health-department-tacoma-woman-with-tuberculosis-refusing-treatment", "urlToImage": "https://images.foxtv.com/static.q13fox.com/www.q13fox.com/content/uploads/2020/06/1280/720/thinkstockphotos-476620740.jpg?ve=1&tl=1", "publishedAt": "2023-01-30T23:30:43Z", "content": "TACOMA, Wash. - The Tacoma-Pierce County Health Department is monitoring a case of active tuberculosis (TB) in a woman in Tacoma, who is currently declining treatment. \r\nTB is curable with medication… [+1850 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Jocelyn Solis-Moreira", "title": "Sitting in traffic for just 2 hours can lead to brain damage - Study Finds", "description": "A team at the University of British Columbia say brain scans show increased impairments in brain function after exposure to traffic pollution.", "url": "https://studyfinds.org/sitting-in-traffic-brain-damage/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/01/roger-victorino-88xF_b0hmg-unsplash-scaled.jpg", "publishedAt": "2023-01-30T23:02:44Z", "content": "VANCOUVER, British Columbia — Breathing in diesel exhaust fumes while sitting in traffic could be disastrous for your brain, a new neuroscience study warns. A team at the University of British Columb… [+2890 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Rikki Schlott", "title": "Why more women, like me, are abandoning the pill over emerging health concerns - New York Post ", "description": "More Gen-Z women are abandoning the birth control pill — even in the wake of Roe v. Wade being overturned — because of research correlations between the pill and a decreased sex drive as well as hi…", "url": "https://nypost.com/2023/01/30/young-women-abandoning-birth-control-pills-for-mental-health/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/01/newspress-collage-25472697-1675112593162.jpg?quality=75&strip=all&1675094683&w=1024", "publishedAt": "2023-01-30T21:59:00Z", "content": "I started taking the birth control pill as a sophomore in high school to help with my acne. Most of my friends got prescriptions around then, too.\r\nI never thought twice about birth control let alone… [+11835 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Calcium Channels Regulate Neuroinflammation and Neuropathic Pain - Neuroscience News", "description": "The Orai1 class of calcium channels regulates sex differences in the functioning of immune cells associated with neuroinflammation and neuropathic pain.", "url": "https://neurosciencenews.com/neuroinflammation-neuropathy-orai1-22401/", "urlToImage": "https://neurosciencenews.com/files/2023/01/calcium-channels-pain-neurosinces.jpg", "publishedAt": "2023-01-30T21:12:54Z", "content": "Summary: The Orai1 class of calcium channels regulates sex differences in the functioning of immune cells associated with neuroinflammation and neuropathic pain.\r\nSource: Northwestern University\r\nNor… [+6919 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Ketamine Acts as Antidepressant in Chronic Pain - Neuroscience News", "description": "Chronic pain in mice activates Tiam1 in pyramidal neurons in the anterior cingulate cortex, increasing the number of dendritic spines and inducing synaptic plasticity. Ketamine's antidepressant effect in chronic pain is mediated by the drug blocking Tiam1-dep…", "url": "https://neurosciencenews.com/pain-ketamine-antidepressant-22399/", "urlToImage": "https://neurosciencenews.com/files/2023/01/ketamine-antidepressant-pain-neurosicences.jpg", "publishedAt": "2023-01-30T20:54:34Z", "content": "Summary: Chronic pain in mice activates Tiam1 in pyramidal neurons in the anterior cingulate cortex, increasing the number of dendritic spines and inducing synaptic plasticity. Ketamine’s antidepress… [+7569 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Maki Yazawa", "title": "The #1 Drink a Sleep Doctor Says To Sip During the Day for a Better Night’s Rest - Well+Good", "description": "Research has shown that a number of beverages can help you sleep better, like tart cherry juice and chamomile tea. But there's one expert-recommended sleepy-time drink we definitely didn’t anticipate until now. We caught up with Michael Breus, PhD, leading sl…", "url": "https://www.wellandgood.com/green-tea-for-sleep/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2023/01/Stocksy_txp1a9945c3k7c300_Small_4553129.jpg", "publishedAt": "2023-01-30T20:39:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Completely New Way To Kill Cancer: Artificial DNA - SciTechDaily", "description": "Hairpin-shaped DNA interacts with microRNA in cancer cells, activating an immune response. University of Tokyo researchers have made a breakthrough in the fight against cancer with the use of artificial DNA. In laboratory tests, the method effectively targete…", "url": "https://scitechdaily.com/?p=247244", "urlToImage": "https://scitechdaily.com/images/Artificial-DNA-Concept-Art.jpg", "publishedAt": "2023-01-30T20:26:27Z", "content": "ByUniversity of TokyoJanuary 30, 2023\r\nScientists in Japan have made a breakthrough in the fight against cancer using artificial DNA. Lab tests successfully targeted and destroyed human cervical and … [+6808 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "How healthy are YOU? Take this simple test to calculate your risk of an early death - Daily Mail", "description": "A Bluepring Income calculator uses a person's age, height, weight, disease genetic risk, and other life factors, to estimate long a person will live.", "url": "https://www.dailymail.co.uk/health/article-11693451/How-healthy-simple-test-calculate-risk-early-death.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/30/20/67134247-0-image-a-39_1675110130346.jpg", "publishedAt": "2023-01-30T20:23:14Z", "content": "An online calculator can help Americans estimate their life expectancy.\r\nUsing a person's age, height, weight, disease genetic risk factors, and other life factors such as education, marital status, … [+2571 chars]"}, {"source": {"id": null, "name": "Tamu.edu"}, "author": "Caitlin Clark", "title": "What You Need To Know About XBB.1.5, COVID's Latest Variant - Texas A&M University Today", "description": "Texas A&M experts explain how the subvariant of Omicron has become the dominant strain in parts of the U.S.", "url": "https://today.tamu.edu/2023/01/30/what-you-need-to-know-about-xbb-1-5-covids-latest-variant/", "urlToImage": "https://today.tamu.edu/wp-content/uploads/2023/01/GettyImages-1455668983-2.jpg", "publishedAt": "2023-01-30T20:19:40Z", "content": "The XBB 1.5 variant currently makes up more than half of U.S. COVID-19 cases.\r\nA new variant of the novel coronavirus now makes up more than half of U.S. COVID-19 cases, according to the latest data … [+7517 chars]"}, {"source": {"id": null, "name": "KLAS - 8 News Now"}, "author": "Ana Gutierrez, Ryan Matthey, Vanessa Murphy", "title": "Health district investigates after numerous elementary students reported ill - KLAS - 8 News Now", "description": "LAS VEGAS (KLAS) — Several Las Vegas elementary students went home sick last week due to an illness, the Clark County School District confirmed Monday. Numerous students at Wayne N. Tanaka Elementary school were throwing up and sent home, according to a sourc…", "url": "https://www.8newsnow.com/news/local-news/health-district-investigates-after-numerous-elementary-students-reported-ill/", "urlToImage": "https://www.8newsnow.com/wp-content/uploads/sites/59/2023/01/IMG_0324.jpg?w=1280", "publishedAt": "2023-01-30T19:45:09Z", "content": "LAS VEGAS (KLAS) — Several Las Vegas elementary students went home sick last week due to an illness, the Clark County School District confirmed Monday.\r\nNumerous students at Wayne N. Tanaka Elementar… [+3902 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Stephanie Mansour", "title": "Boost your heart health with this 28-day walking and strength training plan - Yahoo News", "description": "Build muscle and improve heart health with this 28-day walking and strength training plan for upper body, lower body and core.", "url": "https://news.yahoo.com/boost-heart-health-28-day-191100375.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yeOmsGCR.5F2wknG9U3Nkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/nbc_today_217/3ea0866aed8a9cdfb088604ac9b74c81", "publishedAt": "2023-01-30T19:11:00Z", "content": "Welcome to Start TODAY. Sign up for our free Start TODAY newsletter to receive daily workouts and inspiration sent to your inbox. Then, join us on the Start TODAY Facebook group for tips and motivati… [+9920 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Caroline Igo", "title": "Mediterranean Diet for Beginners: Benefits, Foods and How It Works - CNET", "description": "Your new sustainable eating plan is here. Find out if the Mediterranean diet is right for you.", "url": "https://www.cnet.com/health/nutrition/mediterranean-diet-for-beginners-benefits-foods-and-how-it-works/", "urlToImage": "https://www.cnet.com/a/img/resize/e546bc40500554dc1f2e9a9473a699ecfec4c3ef/hub/2023/01/27/a53b4a95-f889-4b68-807b-a79bcfba1f81/gettyimages-664653031.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-01-30T19:00:02Z", "content": "Ever fantasized about living along the beautiful Mediterranean Sea? Me too. You may not be able to pack your bags and move to Greece, but you can eat Mediterranean cuisine from the comfort of your ow… [+6795 chars]"}, {"source": {"id": null, "name": "Bisnow"}, "author": "Maddy McCarty", "title": "Landlord, Others Face Lawsuit After Janitor Spread Disease By Tampering With Water Bottles - Bisnow", "description": "A Houston medical office building's ownership and management are named in a lawsuit alleging a janitor spread herpes by tampering with water bottles.", "url": "https://www.bisnow.com/national/news/commercial-real-estate/building-management-ownership-face-lawsuit-after-janitor-tampered-with-water-bottles-spreading-disease-117424", "urlToImage": "https://cdn.bisnow.net/fit?height=1200&type=jpeg&url=https%3A%2F%2Fs3.amazonaws.com%2Fcdn.bisnow.net%2Fcontent%2Fimages%2F2023%2F01%2F63d7fa06accc4-steve-johnson-n-mqwxxzvny-unsplash.jpeg&width=1200&sign=GzzRQh5BPSiCRu13Rkq00Il2vbKMvjdbg7PhRODnx6Q", "publishedAt": "2023-01-30T18:16:12Z", "content": "Multiple real estate companies are facing a $1M lawsuit alleging they were negligent when handling a bizarre, unprecedented situation: A janitor gave medical office building employees herpes by tampe… [+3611 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Marburg vaccine shows promising results in first-in-human study - National Institutes of Health (.gov)", "description": "An experimental vaccine against Marburg virus (MARV) was safe and induced an immune response in a small, first-in-human clinical trial.", "url": "https://www.nih.gov/news-events/news-releases/marburg-vaccine-shows-promising-results-first-human-study", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2023/20230130-marburg.jpg", "publishedAt": "2023-01-30T17:01:05Z", "content": null}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "New study shows how mindfulness can benefit our romantic relationships - PsyPost", "description": "New research published in the Journal of Social and Personal Relationships provides evidence that mindfulness can help to enhance attachment security among romantic couples. The new findings deepen our understanding of the longitudinal interplay between partn…", "url": "https://www.psypost.org/2023/01/new-study-shows-how-mindfulness-can-benefit-our-romantic-relationships-67191", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/01/happy-couple.jpg", "publishedAt": "2023-01-30T16:06:00Z", "content": "New research published in the Journal of Social and Personal Relationships provides evidence that mindfulness can help to enhance attachment security among romantic couples. The new findings deepen o… [+4459 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Gareth Thomas: Former Wales rugby star settles HIV case with ex - BBC", "description": "Former British and Irish Lions captain Gareth Thomas says he has agreed to pay £75,000.", "url": "https://www.bbc.com/news/uk-wales-64453783", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11B11/production/_128456427_hi057392797.jpg", "publishedAt": "2023-01-30T14:45:16Z", "content": "Former Wales rugby captain Gareth Thomas has settled a legal dispute with an ex-partner who accused him of \"deceptively\" transmitting HIV to him.\r\nIan Baum alleged Mr Thomas hid his HIV status and \"f… [+2014 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Coffee with milk may have an anti-inflammatory effect - Phys.org", "description": "Can something as simple as a cup of coffee with milk have an anti-inflammatory effect in humans? Apparently so, according to a new study from the University of Copenhagen. A combination of proteins and antioxidants doubles the anti-inflammatory properties in …", "url": "https://phys.org/news/2023-01-coffee-anti-inflammatory-effect.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/coffee-with-milk-1.jpg", "publishedAt": "2023-01-30T14:36:04Z", "content": "Can something as simple as a cup of coffee with milk have an anti-inflammatory effect in humans? Apparently so, according to a new study from the University of Copenhagen. A combination of proteins a… [+6273 chars]"}, {"source": {"id": null, "name": "VinePair"}, "author": "VinePair Staff", "title": "The States That Drink the Most Alcohol in America (2022) [Map] - VinePair", "description": "Check out our color-coded maps to see just how much alcohol the residents of each state and Washington, D.C., drink each year.", "url": "https://vinepair.com/articles/map-states-drink-alcohol-america-2022/", "urlToImage": "https://vinepair.com/wp-content/uploads/2023/01/states-that-drink-the-most-alcohol-in-america-infographic-social.jpg", "publishedAt": "2023-01-30T13:04:06Z", "content": "Americans love their alcohol. According to data published by the National Institute on Alcohol Abuse and Alcoholism, U.S. residents consumption of alcoholic beverages has been on a steady incline sin… [+8276 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "A TIA is serious, not just a 'mini-stroke,' organization says - The Washington Post", "description": "Transient ischemic attacks occur when a temporary blockage of blood to the brain produces stroke-like symptoms that swiftly resolve.", "url": "https://www.washingtonpost.com/wellness/2023/01/30/tia-emergencies-not-mini-strokes/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G22PJONW3SGNZOG26YTINBEWGE.jpg&w=1440", "publishedAt": "2023-01-30T12:04:05Z", "content": "Comment on this story\r\nTransient ischemic attacks, or TIAs, should no longer be thought of as mere mini-strokes, but rather harbingers of a bigger stroke to come, according to the American Heart Asso… [+2719 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Katie MacBride", "title": "Does the Best Workout Exist? Exercise Scientists All Agree on One Thing - Inverse", "description": "Researchers are increasingly understanding how exercise affects the body and, in doing so,  finding smarter ways for people to exercise smarter.", "url": "https://www.inverse.com/mind-body/best-way-to-workout", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/1/18/289b29a2-fc9b-4244-a4e3-c68962420f24-inv_optimizedworkout_wip_v1.jpg?w=1200&h=630&fit=crop&crop=focalpoint&fm=jpg&fp-x=0.4533&fp-y=0.398", "publishedAt": "2023-01-30T11:00:25Z", "content": "Regular exercise is\r\n among the most important things a person can do to maintain good health and increase longevity. This is a real bummer for people like me, who are both innately unathletic and ha… [+8701 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Karen Weintraub, USA TODAY", "title": "CRISPR gene editing turns 10. How's it transforming medicine and more? - USA TODAY", "description": "Over the next decade, scientists predict CRISPR will yield multiple medical treatments and be used to modify crops.", "url": "https://www.usatoday.com/story/news/health/2023/01/30/crispr-gene-editing-technology-turns-10/11080787002/", "urlToImage": "https://www.gannett-cdn.com/presto/2020/10/07/USAT/7150b95f-52fc-4b6d-9573-d9dab1dc41f8-AP20281354555898.jpg?auto=webp&crop=3917,2204,x0,y231&format=pjpg&width=1200", "publishedAt": "2023-01-30T10:00:27Z", "content": "Medical innovations typically take 17 years from the time a lightbulb goes off in a scientist's head until the first person benefits.\r\nBut every once in a while, an idea is so powerful and so profoun… [+12686 chars]"}]}