{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Radzicki McManus", "title": "Try this interval workout to avoid HIIT burnout or injuries - CNN", "description": "High-intensity interval training, or HIIT workouts, has been a top 10 fitness trend since 2014. Yet there are similar forms of interval training that may be a better fit for your training goals and needs, experts say. Here are the three variations.", "url": "https://www.cnn.com/2022/11/27/health/interval-training-avoid-hiit-injuries-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221124081627-plank-position.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-27T11:02:00Z", "content": "Editors Note: Before beginning any new exercise program, consult your doctor. Stop immediately if you experience pain.\r\nFor many people aiming to burn a lot of calories, high-intensity interval train… [+6502 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Why Certain Types of Music Make Our Brains Sing, and Others Don’t - Neuroscience News", "description": "Music can induce a range of emotions and help us to better understand different cultures. But what is it that makes us tune in to some songs more than others? Researchers say when we listen to a song, our brains predict what happens next, and that prediction …", "url": "https://neurosciencenews.com/music-preference-prediction-21946/", "urlToImage": "https://neurosciencenews.com/files/2022/11/music-emotion-neurosiccences-public.jpg", "publishedAt": "2022-11-27T01:01:49Z", "content": "Summary: Music can induce a range of emotions and help us to better understand different cultures. But what is it that makes us tune in to some songs more than others? Researchers say when we listen … [+7821 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Educational Background and Previous Brain Injury May Be Associated With Higher Risk of Frontotemporal Dementia - Neuroscience News", "description": "Previous TBI increased the risk of frontotemporal dementia in those without a genetic risk factor for FTD. Additionally, researchers found those with FTD tend to be less educated than those with Alzheimer's disease.", "url": "https://neurosciencenews.com/ftd-tbi-education-21944/", "urlToImage": "https://neurosciencenews.com/files/2022/11/ftd-education-tbi-neurosicnes-public.jpg", "publishedAt": "2022-11-26T23:54:21Z", "content": "Summary: Previous TBI increased the risk of frontotemporal dementia in those without a genetic risk factor for FTD. Additionally, researchers found those with FTD tend to be less educated than those … [+6484 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Yahoo Canada Lifestyle Editors", "title": "10 of the worst foods for high blood pressure: Deli meat, bread & more - Yahoo Life", "description": "High blood pressure is a common condition in which the force of blood pushing against the body’s arteries is too high.", "url": "https://www.yahoo.com/lifestyle/worst-foods-for-high-blood-pressure-180034256.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/.6.FpYcS7sawXLcErYVarw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDU-/https://s.yimg.com/os/creatr-uploaded-images/2022-11/e74a7a50-6da6-11ed-bed3-96ad1a78b43b", "publishedAt": "2022-11-26T18:00:34Z", "content": "From bread to deli meat, here's the worst foods you can eat for high blood pressure. (Photos via Getty Images)\r\nThis article is for informational purposes only and is not a substitute for professiona… [+5759 chars]"}, {"source": {"id": null, "name": "The Daily Dot"}, "author": null, "title": "'You handled that thing for 4 years': Woman says boyfriend asked her to Venmo him $7 for cold medicine he bought her - msnNOW", "description": "TikToker Jackie (@jackieli852) went viral after sharing a story about the time her former boyfriend sent her a Venmo request after picking up some cold medicine for her when she was sick. Commenters were shocked at the man's audacity, with many stating that i…", "url": "https://www.dailydot.com/irl/boyfriend-venmo-request-7-dollars/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14AjIh.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=472&y=212", "publishedAt": "2022-11-26T17:39:39Z", "content": "TikToker Jackie (@jackieli852) went viral after sharing a story about the time her former boyfriend sent her a Venmo request after picking up some cold medicine for her when she was sick.\r\n© Provided… [+3033 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": null, "title": "When Is Your Heart Rate Considered Dangerous? - msnNOW", "description": "Your heart rate will go up and down as you go about your day. However, it could be dangerous for your heart rate to go too high under certain circumstances.", "url": "https://www.healthdigest.com/1116919/when-is-your-heart-rate-considered-dangerous/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14AnrM.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-26T17:25:49Z", "content": "It may seem like your heart is beating with regularity throughout the day unless you are exercising, but that's not true. Your heart rate will go up and down as you go about your day. Doing something… [+2113 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jacob Geanous", "title": "You dirty rats! Researchers find COVID-19 in NYC sewer rodents - New York Post ", "description": "New Yorkers may have a new reason to loathe rats.", "url": "https://nypost.com/2022/11/26/researchers-find-covid-19-in-nyc-sewer-rats/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/11/covid-rats-comp.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-11-26T17:18:00Z", "content": "New Yorkers may have a new reason to loathe rats.\r\nResearchers investigating mysterious COVID-19 mutations found signs of the virus in the city’s massive rat population — sparking concerns the diseas… [+3253 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Amy Yurkanin | ayurkanin@al.com", "title": "2 children, 9 adults have died from flu in Alabama, report says - AL.com", "description": "In its latest weekly influenza report, the Alabama Department of Public Health reported 11 deaths from influenza. But it also shows decreases in the number of medical visits for flu-like symptoms.", "url": "https://www.al.com/news/2022/11/two-children-and-nine-adults-have-died-from-flu-in-alabama-report-says.html", "urlToImage": "https://www.al.com/resizer/bKHIAIHisFqTUKcvyHI-hxFmnoc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/6A3VUZDZLZDZFAUSJICRNPNRHI.jpg", "publishedAt": "2022-11-26T16:40:00Z", "content": "An outbreak of influenza that has hit the South particularly hard has now taken the lives of two children and nine adults in Alabama, according to the state department of public health.\r\nThe report f… [+1609 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Tom Polansek, Reuters", "title": "Avian flu outbreak wipes out 50M US birds, a record - KSL.com", "description": "Avian flu has wiped out 50.54 million birds in the United States this year, making it the country's deadliest outbreak in history, U.S. Department of Agriculture data showed on Thursday.", "url": "https://www.ksl.com/article/50525609/avian-flu-outbreak-wipes-out-50m-us-birds-a-record", "urlToImage": "https://img.ksl.com/slc/2903/290396/29039691.JPG?filter=kslv2/responsive_story_lg", "publishedAt": "2022-11-26T15:11:56Z", "content": "Estimated read time: 2-3 minutes\r\nCHICAGO Avian flu has wiped out 50.54 million birds in the United States this year, making it the country's deadliest outbreak in history, U.S. Department of Agricul… [+2134 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "New longitudinal research highlights how grave the effects of childhood trauma can be for anxiety and depression - PsyPost", "description": "Childhood trauma is well-known to have adverse effects on mental health into adulthood, but the nuances of these outcomes are not well understood. A study published in the Journal of Affective Disorders explores how childhood trauma impacts specific aspects o…", "url": "https://www.psypost.org/2022/11/new-longitudinal-research-highlights-how-grave-the-effects-of-childhood-trauma-can-be-for-anxiety-and-depression-64380", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/11/sad-depressed-girl.jpg", "publishedAt": "2022-11-26T14:15:00Z", "content": "Childhood trauma is well-known to have adverse effects on mental health into adulthood, but the nuances of these outcomes are not well understood. A study published in the Journal of Affective Disord… [+4090 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "'Triple demic': What is it? Joe Biden admin. resists American Academy of Pediatrics call for RSV, flu and COVID national emergency - KABC-TV", "description": "Declaration of a national emergency would give providers additional funding as well as more flexibility from regulations to deal with what call a \"crisis.\"", "url": "https://abc7.com/triple-demic-2022-covid-symptoms-rsv-flu/12496441/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12496442_112622-wls-biden-flu-emergency-5avo-vid.jpg?w=1600", "publishedAt": "2022-11-26T12:41:57Z", "content": "WASHINGTON -- The Biden administration has been resisting calls from pediatric health groups to declare a national emergency because of the \"Triple-demic.\"\r\nThe American Academy of Pediatrics and the… [+760 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Adam Meyer", "title": "The Link Between Grocery Shopping and Dementia — Best Life - Best Life", "description": "A new study just found a surprising connection between grocery shopping and dementia, especially in older people. Here's what to know now.", "url": "https://bestlifeonline.com/grocery-shopping-dementia-risk-link-news/", "urlToImage": "https://bestlifeonline.com/wp-content/uploads/sites/3/2022/11/shutterstock_1986050114.jpg?quality=82&strip=all", "publishedAt": "2022-11-26T12:05:05Z", "content": "Every three seconds, someone in the world develops dementia, according to Alzheimer's Disease International (ADI). That means by the time you finish this article, 40 or more new people will be facing… [+4810 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte", "title": "Secrets of 'SuperAgers' with superior memories into their 80s - CNN", "description": "Are you destined to become a 'SuperAger,\" with a memory as sharp in your 80s as it was in your 50s? Here's what science knows about those who keep their ability to remember as they age.", "url": "https://www.cnn.com/2022/11/26/health/superager-secrets-good-memory-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221125162214-carol-seigler.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-26T10:02:00Z", "content": "Editors Note: Sign up for CNNs Fitness, But Better newsletter series. Our seven-part guide will help you ease into a healthy routine, backed by experts.\r\nDespite volunteering and working out at the g… [+6483 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Faith Geiger", "title": "The One Ultra-Processed Food No One Over 40 Should Be Eating Anymore Because It Ruins Your Metabolism - Yahoo Life", "description": "Losing weight is all about making healthy choices, from finding time to exercise daily to providing your body with nutritious meals. This means we sometimes ...", "url": "https://www.shefinds.com/collections/ultra-processed-food-over-40-white-bread/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/5750f85b749a9c9138590f15dd47988f", "publishedAt": "2022-11-26T10:00:04Z", "content": "woman adding peanut butter to white toast\r\nLosing weight is all about making healthy choices, from finding time to exercise daily to providing your body with nutritious meals. This means we sometimes… [+2809 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Elmira Tanatarova", "title": "Dr Alnajjar tells FEMAIL about underlying conditions which could be causing erectile dysfunction - Daily Mail", "description": "British doctor Dr Hussain Alnajjar told FEMAIL about the possible underlying issues which could bring about erectile dysfunction, from stress and obesity to heart disease.", "url": "https://www.dailymail.co.uk/femail/article-11361999/Dr-Alnajjar-tells-FEMAIL-underlying-conditions-causing-erectile-dysfunction.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/03/11/64150363-0-image-a-49_1667476310303.jpg", "publishedAt": "2022-11-26T09:36:22Z", "content": "It can feel humiliating or shameful to suffer from erectile dysfunction - despite the fact it affects half the male population of the UK between the ages of 40 and 70.\r\nBut experts have now revealed … [+6412 chars]"}, {"source": {"id": null, "name": "Ynetnews"}, "author": "Laurie Shtatmaor", "title": "'Most don't know what their vagina looks like': Sneak peek inside Israel's female anatomy course - Ynetnews", "description": "24 women meet up in a workshop hall in the north of the country to learn about their pelvic floors, their vaginas and the pleasure they can get out of them for some women, it’s the first time they’d ever seen their own vaginas", "url": "https://www.ynetnews.com/magazine/article/rkokmkvis", "urlToImage": "https://ynet-images1.yit.co.il/picserver5/crop_images/2022/09/20/rJSo9mgPWs/rJSo9mgPWs_295_256_2706_1524_0_large.jpg", "publishedAt": "2022-11-26T06:41:31Z", "content": "Some 24 women sit in a circle in a spacious, bright and colorful workshop venue in the Yarok Az farm in Ilaniya in northern Israel. They shyly look at one another, knowing that over the next two days… [+16769 chars]"}, {"source": {"id": null, "name": "YourTango"}, "author": "Megan  Quinn", "title": "Mom Wants To Send Daughter To 'Fat Camp' After She Gained Weight — But Her Ex-Husband Refuses - YourTango", "description": "A concerned mother took to Reddit to share that her daughter has gained an unhealthy amount of weight for her age after her ex-husband fed her large portions of junk food. she wants to send their daughter to a sports camp to manage her weight, but her husband…", "url": "https://www.yourtango.com/entertainment/mom-wants-send-daughter-fat-camp-gained-weight-ex-husband-refusing", "urlToImage": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/mom-daughter-fat-camp.png?itok=divSEsct", "publishedAt": "2022-11-26T00:17:51Z", "content": "A mother is seeking advice after an argument with her ex-husband over their daughters weight.\r\nThe mother wants to send their overweight daughter to a sports camp geared toward helping her achieve a … [+3985 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Michael Mosley", "title": "DR MICHAEL MOSLEY: The simple steps I'm taking to help ward off cancer - Daily Mail", "description": "DR MICHAEL MOSLEY: As anyone who has seen a friend or loved one die from cancer knows, it can be a terrible disease. Half of us will develop cancer at some point in our lives, so most will be affected.", "url": "https://www.dailymail.co.uk/health/article-11470823/DR-MICHAEL-MOSLEY-simple-steps-Im-taking-help-ward-cancer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/25/23/64951079-0-image-a-14_1669418202316.jpg", "publishedAt": "2022-11-25T23:17:30Z", "content": "As anyone who has seen a friend or loved one die from cancer knows, it can be a terrible disease.\r\nHalf of us will develop cancer at some point in our lives, so most will be affected in some way.\r\nOv… [+6497 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Wolves infected with a common parasite may be much more likely to become pack leaders - Phys.org", "description": "A team of researchers with the Yellowstone Wolf Project at the Yellowstone Center for Resources, in Yellowstone National Park, in Wyoming, has found that wolves in the park who become infected with Toxoplasma gondii, a common parasite, are much more likely to…", "url": "https://phys.org/news/2022-11-wolves-infected-common-parasite-leaders.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/wolves-infected-with-a.jpg", "publishedAt": "2022-11-25T18:29:41Z", "content": "A team of researchers with the Yellowstone Wolf Project at the Yellowstone Center for Resources, in Yellowstone National Park, in Wyoming, has found that wolves in the park who become infected with T… [+2839 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "Hope for long Covid sufferers as Pfizer antiviral for patients left with lingering symptoms trialed - Daily Mail", "description": "Paxlovid, the pharma giant's flagship Covid drug, gained emergency approval in the US last December to treat  high-risk patients - slashing their risk of death by 90 per cent.", "url": "https://www.dailymail.co.uk/health/article-11469591/Hope-long-Covid-sufferers-Pfizer-antiviral-patients-left-lingering-symptoms-trialed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/25/17/64942263-0-image-a-5_1669395695885.jpg", "publishedAt": "2022-11-25T17:50:39Z", "content": "Paxlovid - an antiviral made by Pfizer - is now being looked at as a possible long Covid treatment.\r\nThe pharma giant's flagship Covid drug gained emergency approval in the US last December to treat … [+4090 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Gabby Landsverk", "title": "New weight loss drugs that became popular in 2022: risks, side effects - Insider", "description": "Medications like semaglutide and tirzeptide are part of a new era of weight loss drugs, helping to curb cravings for junk food and even alcohol.", "url": "https://www.insider.com/new-weight-loss-drugs-popularity-evidence-and-side-effects-2022-11", "urlToImage": "https://i.insider.com/637d3365f678a70018d2a32f?width=1200&format=jpeg", "publishedAt": "2022-11-25T17:00:10Z", "content": "A new category of weight loss medications, repurposed from diabetes treatment, are seriously changing how we think about and approach weight management.\r\nIn 2021 the medication semaglutide, called a … [+4118 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Nora Miller", "title": "Combining Olive Oil and Lemon Juice May Have Exponential Health Benefits, According to Science - Yahoo Life", "description": "A combo that's delicious and nutritious.", "url": "https://www.yahoo.com/lifestyle/combining-olive-oil-lemon-juice-164436161.html", "urlToImage": "https://media.zenfs.com/en/first_for_women_876/aa22719252b1ce376318e5c4511f0c07", "publishedAt": "2022-11-25T16:44:36Z", "content": "Lemon juice and olive oil are ingredients that appear in many of our favorite dishes. But did you know that the two when paired have tremendous health benefits? On its own, lemon juice supports every… [+7309 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Beth JoJack", "title": "CRISPR vs breast, colon, lung cancer: First human trial goes well - Medical News Today", "description": "A small human trial has tested CRISPR gene editing technology in the treatment of solid cancer tumors, including breast, colon, and lung cancer, with promising results.", "url": "https://www.medicalnewstoday.com/articles/cancer-single-step-crispr-treatment-may-provide-lifelong-protection", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/11/genome-CRISPR-treatment-cancer-thumb.jpg", "publishedAt": "2022-11-25T16:11:41Z", "content": "<ul><li>For the first time, researchers have used CRISPR technology to substitute genes in patients immune cells to treat cancer. </li><li>Participants included 16 patients with different solid cance… [+6299 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Dissociative symptoms are common among individuals with depression, study finds - PsyPost", "description": "“Dissociating” has become an internet buzzword, but what does it mean and how common is it really? A study published in the Journal of Psychiatric Research suggests that this mental disconnect may be very common among people with depressive symptoms. ...", "url": "https://www.psypost.org/2022/11/dissociative-symptoms-are-common-among-individuals-with-depression-study-finds-64377", "urlToImage": "https://www.psypost.org/wp-content/uploads/2021/03/sad-man-1.jpg", "publishedAt": "2022-11-25T16:01:50Z", "content": "Dissociating has become an internet buzzword, but what does it mean and how common is it really? A study published in the Journal of Psychiatric Research suggests that this mental disconnect may be v… [+3405 chars]"}, {"source": {"id": null, "name": "Buckinhamshire Free Press"}, "author": "Isabella Perrin", "title": "Four-year-old Wycombe nursery pupil dies after catching Strep A bacteria - Bucks Free Press", "description": "A High Wycombe pupil has died after contracting the Strep A bacteria virus.", "url": "https://www.bucksfreepress.co.uk/news/23150443.high-wycombe-pupil-dies-catching-strep-bacteria/", "urlToImage": "https://www.bucksfreepress.co.uk/resources/images/16197962/?type=og-image", "publishedAt": "2022-11-25T15:16:53Z", "content": "A FOUR-year-old High Wycombe pupil has died after contracting an invasive bacterial virus.\r\nThe Oakridge School and Nursery reception pupil caught the Group A streptococcal (iGAS) infection, his fami… [+2050 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Allana Akhtar", "title": "What vitamin B12 does to your brain, body, DNA and red blood cells - Insider", "description": "Vitamin B12 plays a particularly important role in creating red blood cells, which transport oxygen throughout the body, and DNA.", "url": "https://www.insider.com/what-vitamin-b12-does-to-your-brain-and-body-2022-11", "urlToImage": "https://i.insider.com/6376af3822e13d0011938d97?width=1200&format=jpeg", "publishedAt": "2022-11-25T14:30:17Z", "content": "The 8 \"B\" vitamins help the body convert food into energy, and all of them play an essential role maintaining healthy hair, nails, eyes, liver, and nervous system, according to Mount Sinai. \r\nVitamin… [+3534 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rebecca Sohn", "title": "Brown recluse bites caused two people's blood cells to self-destruct - Livescience.com", "description": "Bites from brown recluse spiders can cause an autoimmune form of hemolytic anemia, in which red blood cells are destroyed by the immune system.", "url": "https://www.livescience.com/brown-recluse-spider-bite-hemolytic-anemia", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rAcbdWRqm4EJ2ZoMwffANo-1200-80.jpg", "publishedAt": "2022-11-25T13:08:24Z", "content": "Two people who were bitten by brown recluse spiders\r\n developed a rare condition in which their immune systems destroyed their red blood cells, a new case report shows. \r\nIn the first case, a 30-year… [+3391 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "marissa matozzo", "title": "Nutritionists Swear By This Fiber Smoothie Recipe To Boost Digestion After Thanksgiving - SheFinds", "description": "We reached out to nutritionists for one great smoothie recipe to try if boosting your digestion is your goal. Read more at SheFinds.com", "url": "https://www.shefinds.com/collections/nutritionists-fiber-smoothie-recipe-boost-digestion-after-thanksgiving/", "urlToImage": "https://www.shefinds.com/files/2022/11/blender-making-a-smoothie.jpg", "publishedAt": "2022-11-25T13:00:22Z", "content": "If you’re feeling stuffed after the big Thanksgiving meal, utilizing fiber and protein can help you not only de-bloat, but also keep you satiated and energized for longer. We reached out to nutrition… [+2641 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Ferozan Mast", "title": "7 Symptoms of Pancreatic Cancer You're Most Likely to Ignore, Including Weight Loss — Eat This Not That - Eat This, Not That", "description": "Here are seven symptoms of pancreatic cancer that are easy to overlook, according to experts. Read on to ensure your health.", "url": "https://www.eatthis.com/symptoms-of-pancreatic-cancer-youre-most-likely-to-ignore/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/shutterstock_1381662893-e1655350429929.jpg?quality=82&strip=all", "publishedAt": "2022-11-25T12:15:29Z", "content": "Pancreatic cancer is responsible for 3% of all cancers and and 7% of all cancer deaths in the US. Known as the \"silent killer,\" pancreatic cancer is notoriously difficult to spot. \"Research shows tha… [+11363 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Universal flu vaccine may be available within two years, says scientist - The Guardian", "description": "Vaccine against all strains of virus hailed as major step in protecting against potentially devastating flu pandemic", "url": "https://www.theguardian.com/society/2022/nov/25/universal-flu-vaccine-may-be-available-within-two-years-says-scientist", "urlToImage": "https://i.guim.co.uk/img/media/ab526dec4a7a7bb978bcd47ceabd2043ed465a14/0_10_2611_1566/master/2611.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=66d85b1aee512aaf7f8662d12f344e2d", "publishedAt": "2022-11-25T11:45:00Z", "content": "A universal flu vaccine that protects against all strains of the virus could be available in the next two years, according to a leading scientist.\r\nAn experimental vaccine based on the same mRNA tech… [+3148 chars]"}]}