{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ozempic shortage fueled by people using the drug for weight loss - TODAY", "description": "Ozempic, a drug developed to treat diabetes, has become known for its weight-loss side effects. This growing popularity has led to a shortage of the medicati...", "url": "https://www.youtube.com/watch?v=Rt_4WbnHdKs", "urlToImage": "https://i.ytimg.com/vi/Rt_4WbnHdKs/maxresdefault.jpg", "publishedAt": "2023-01-12T15:30:05Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard", "title": "US cancer death rate falls 33% since 1991, partly due to advances in treatment, early detection and less smoking, report says - CNN", "description": "The rate of people dying from cancer in the United States has continuously declined over the past three decades, according to a new report from the American Cancer Society.", "url": "https://www.cnn.com/2023/01/12/health/us-cancer-deaths-decline-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230111142126-cancer-patient-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-01-12T15:01:00Z", "content": "The rate of people dying from cancer in the United States has continuously declined over the past three decades, according to a new report from the American Cancer Society.\r\nThe US cancer death rate … [+7438 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "What do your fingernails say about you? - Key signs can reveal clues to your overall health - Daily Mail", "description": "Dermatologists in New York and Connecticut said that your fingernails could give warnings that all is not well. They were described as a 'canary in a coalmine' for some illnesses.", "url": "https://www.dailymail.co.uk/health/article-11623977/What-fingernails-say-Key-signs-reveal-clues-overall-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/12/14/66501293-0-image-a-50_1673534479833.jpg", "publishedAt": "2023-01-12T13:29:40Z", "content": "We may often look past our bruised, ridged or pitted nails. \r\nBut these can be warning signs of severe conditions, including arthritis, inflammation and, in extreme cases, cancer.\r\nDailyMail.com spok… [+10485 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Six Minutes of Daily High-Intensity Exercise Could Delay the Onset of Alzheimer’s Disease - Neuroscience News", "description": "Researchers report six minutes of high-intensity exercise on a regular basis can slow brain aging and delay the onset of neurodegenerative diseases such as Alzheimer's and Parkinson's disease. High-intensity exercise increases the production of BDNF, a protei…", "url": "https://neurosciencenews.com/exercise-bdnf-alzheimers-22229/", "urlToImage": "https://neurosciencenews.com/files/2023/01/high-intensity-exercise-dementia-neurosucence-public.jpg", "publishedAt": "2023-01-12T06:11:59Z", "content": "Summary: Researchers report six minutes of high-intensity exercise on a regular basis can slow brain aging and delay the onset of neurodegenerative diseases such as Alzheimer’s and Parkinson’s diseas… [+6757 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Long covid outcomes at one year after mild SARS-CoV-2 infection: nationwide cohort study - The BMJ", "description": "Objectives To determine the clinical sequelae of long covid for a year after infection in patients with mild disease and to evaluate its association with age, sex, SARS-CoV-2 variants, and vaccination status.\n\nDesign Retrospective nationwide cohort study.\n\nSe…", "url": "https://www.bmj.com/content/380/bmj-2022-072529", "urlToImage": "https://www.bmj.com/sites/default/files/highwire/bmj/380/8366.cover-source.jpg", "publishedAt": "2023-01-11T23:45:22Z", "content": "Abstract\r\nObjectives To determine the clinical sequelae of long covid for a year after infection in patients with mild disease and to evaluate its association with age, sex, SARS-CoV-2 variants, and … [+8077 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Anna Kaplan", "title": "What happens when you stop taking Ozempic? Remi Bader shares her experience - Yahoo News", "description": "TikToker and model Remi Bader shared her experience when she stopped taking Ozempic, a drug used to treat Type 2 diabetes that has quickly become one of the", "url": "https://news.yahoo.com/happens-stop-taking-ozempic-remi-230101405.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/OVHMki9_qMCn4r509CSzUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD0xNTcx/https://media.zenfs.com/en/nbc_today_217/db5ded8b32005fa7ecb4f4e889d70767", "publishedAt": "2023-01-11T23:01:01Z", "content": "TikToker and model Remi Bader shared her experience when she stopped taking Ozempic, a drug used to treat Type 2 diabetes that has quickly become one of the latest weight loss trends.\r\nBader, 27, sai… [+3245 chars]"}, {"source": {"id": null, "name": "KTLA Los Angeles"}, "author": "Travis Schlepp", "title": "Regular fast food consumption linked to liver disease, USC study says - KTLA Los Angeles", "description": "A new study from the University of Southern California’s Keck School of Medicine has linked the regular consumption of fast food with a potentially life-threatening liver disease. The study published this week posits that eating fast food can increase the lik…", "url": "https://ktla.com/health/regular-fast-food-consumption-linked-to-liver-disease-study-says/", "urlToImage": "https://ktla.com/wp-content/uploads/sites/4/2021/04/GettyImages-844466808.jpg?w=1280", "publishedAt": "2023-01-11T22:21:00Z", "content": "A new study from the University of Southern California’s Keck School of Medicine has linked the regular consumption of fast food with a potentially life-threatening liver disease.\r\nThe study publishe… [+2750 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sarah Rumpf", "title": "4 healthy diets that could extend your life: study - Fox News", "description": "Regardless of your race, ethnicity or gender, eating healthy appears to be a smart way to improve your odds of living a longer life, according to Harvard researchers.", "url": "https://www.foxnews.com/health/4-healthy-diets-that-could-extend-life-study", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/heart-healthy-4.jpg", "publishedAt": "2023-01-11T21:44:00Z", "content": "You can reduce the risk of an early death by nearly 20%, just by eating more foods from four healthy eating patterns, according to researchers who analyzed decades of data collected on more than 119,… [+3698 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joel Achenbach", "title": "Boston University coronavirus experiment reveals new weak spot in omicron - The Washington Post", "description": "Lab work that created a chimera virus has demonstrated for the first time that a protein other than the infamous spike affects the virus's ability to sicken and kill.", "url": "https://www.washingtonpost.com/science/2023/01/11/coronavirus-boston-lab-experiment/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CPMAKLU3PFATVNARRALYF7O2FY.jpg&w=1440", "publishedAt": "2023-01-11T19:00:00Z", "content": "Comment on this story\r\nA controversial coronavirus experiment at Boston University has identified a mutation in the omicron variant that might help explain why it doesnt appear to be as likely to sic… [+4937 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Can Neuroimaging Reveal the Roots of Psychiatric Disorders? Not Just Yet - Neuroscience News", "description": "While neuroimaging holds great potential in helping researchers link specific patterns of brain activity to mental health disorders, a new study finds there is still a way to go to effectively link neuroimaging results to specific mental health disorders.", "url": "https://neurosciencenews.com/mental-health-neuroimaging-22228/", "urlToImage": "https://neurosciencenews.com/files/2023/01/psychiatry-neuroimaging-neurosciences-public.jpg", "publishedAt": "2023-01-11T18:00:47Z", "content": "Summary: While neuroimaging holds great potential in helping researchers link specific patterns of brain activity to mental health disorders, a new study finds there is still a way to go to effective… [+3205 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Cough Medicine Could Be Used in New Treatment for Parkinson’s Disease - Neuroscience News", "description": "Ambroxol, a common medicine used to treat respiratory illnesses shows promise as a treatment to slow the progression of Parkinson's disease. Researchers report ambroxol increases the level of GCase, a protein that allows cells to remove waste proteins includi…", "url": "https://neurosciencenews.com/parkinsons-ambroxol-22227/", "urlToImage": "https://neurosciencenews.com/files/2023/01/parkinsons-cough-medicine-neurosinces-public.jpg", "publishedAt": "2023-01-11T17:45:48Z", "content": "Summary: Ambroxol, a common medicine used to treat respiratory illnesses shows promise as a treatment to slow the progression of Parkinson’s disease. Researchers report ambroxol increases the level o… [+3852 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Pancreas Developed That Can Help Maintain Healthy Glucose Levels in Type 2 Diabetes Patients - SciTechDaily", "description": "Artificial Pancreas Successfully Trialed for Use by Type 2 Diabetes Patients Scientists at the University of Cambridge have successfully trialed an artificial pancreas for use by patients living with type 2 diabetes. The device – powered by an algorithm devel…", "url": "https://scitechdaily.com/artificial-pancreas-developed-that-can-help-maintain-healthy-glucose-levels-in-type-2-diabetes-patients/", "urlToImage": "https://scitechdaily.com/images/Human-Pancreas-Illustration.jpg", "publishedAt": "2023-01-11T15:00:42Z", "content": "The pancreas is an organ located in the abdomen, behind the stomach. It is an endocrine and exocrine gland that secretes hormones such as insulin and glucagon into the bloodstream to regulate blood s… [+7352 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Youri Benadjaoud, Mary Kekatos", "title": "More than 24K people have reported COVID test results to new NIH website - ABC News", "description": "There may be a bias in who is inclined to report test results, experts say.", "url": "https://abcnews.go.com/Health/24k-people-reported-covid-test-results-new-nih/story?id=96266401", "urlToImage": "https://s.abcnews.com/images/Health/covid-home-test-gty-mz-11-230109_1673273144634_hpMain_16x9_992.jpg", "publishedAt": "2023-01-11T13:13:54Z", "content": "Tens of thousands of Americans have reported a COVID-19 test result to the National Institutes of Health's website that launched in November.\r\nThe site, MakeMyTestCount.org, allows people to anonymou… [+3988 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "georgia dodd", "title": "Want To Lose Weight In 2023? This Is The Best Diet You Should Try, Health Experts Say - SheFinds", "description": "Find out which diet health experts recommend for losing weight in 2023, only on SheFinds!", "url": "https://www.shefinds.com/collections/best-diet-to-lose-weight-in-2023/", "urlToImage": "https://www.shefinds.com/files/2023/01/woman-holding-a-healthy-salad-and-green-juice.jpg", "publishedAt": "2023-01-11T13:00:34Z", "content": "When it comes to weight loss, there’s plenty of advice. Magazines, books, and blogs promise that you can lose all the weight you want for good if you just try this new diet. With so many diets out th… [+5811 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Free Symptom Questionnaire May Help Indicate Whether a Child Has Autism - Neuroscience News", "description": "A freely available new questionnaire of measures of autism symptoms can help screen for ASD and monitor symptoms over time.", "url": "https://neurosciencenews.com/asd-questionnaire-22223/", "urlToImage": "https://neurosciencenews.com/files/2023/01/autism-questionaire-neurosicnes-public.jpg", "publishedAt": "2023-01-11T09:32:56Z", "content": "Summary: A freely available new questionnaire of measures of autism symptoms can help screen for ASD and monitor symptoms over time.\r\nSource: Wiley\r\nInvestigators have developed a freely available me… [+1195 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "This Prescription Drug Appears to Recover Lost Memories in Mice - ScienceAlert", "description": "A name on the tip of your tongue.", "url": "https://www.sciencealert.com/this-prescription-drug-appears-to-recover-lost-memories-in-mice", "urlToImage": "https://www.sciencealert.com/images/2023/01/MouseHippocampusWithNeuronsEncodingEventsLableledInRed.jpg", "publishedAt": "2023-01-11T06:31:37Z", "content": "A name on the tip of your tongue. That fuzzy feeling when the fact you learned just yesterday has floated out of reach. Recalling memories and tidbits of information can be exasperating at the best o… [+4421 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Childhood Maltreatment Linked With Multiple Mental Health Problems - Neuroscience News", "description": "Researchers have identified a causal effect between childhood maltreatment and an increased risk of mental health disorders.", "url": "https://neurosciencenews.com/childhood-maltreatment-mental-health-22221/", "urlToImage": "https://neurosciencenews.com/files/2023/01/child-maltreatment-mental-health-neurosicences-public.jpg", "publishedAt": "2023-01-11T05:12:40Z", "content": "Summary: Researchers have identified a causal effect between childhood maltreatment and an increased risk of mental health disorders.\r\nSource: UCL\r\nExperiencing abuse or neglect as a child can cause … [+4289 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Lab-Grown Retinas to Restore Vision Are a Step Closer to Human Trials - ScienceAlert", "description": "Scientists from the University of Wisconsin–Madison in the US have coaxed light-sensitive eye cells grown in a lab to reconnect after separation, an important step for transplantation into patients to treat various eye diseases.", "url": "https://www.sciencealert.com/lab-grown-retinas-to-restore-vision-are-a-step-closer-to-human-trials", "urlToImage": "https://www.sciencealert.com/images/2023/01/EyeRainbow.jpg", "publishedAt": "2023-01-11T02:35:02Z", "content": "Scientists from the University of WisconsinMadison in the US have coaxed light-sensitive eye cells grown in a lab to reconnect after separation, an important step for transplantation into patients to… [+3109 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alexa Mikhail", "title": "The ‘Kraken’ COVID variant taking hold in the U.S. Here’s how many vaccine shots there are—and what experts recommend to protect yourself - Yahoo Finance", "description": "The highly transmissible 'Kraken' COVID variant is here. Experts say getting boosted is your best protection.", "url": "https://finance.yahoo.com/news/kraken-covid-variant-taking-hold-210456826.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/G0lOJNX.ZUO6Fsa2CosGOg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzI-/https://media.zenfs.com/en/fortune_175/882216f6450d85ab5c2bd715066082cf", "publishedAt": "2023-01-10T21:04:56Z", "content": "Another highly contagious COVID-19 variant called XBB.1.5 has made its way to the U.S. with the World Health Organization (WHO) calling it the most transmissible variant to date.\r\nCoined Kraken by a … [+6891 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Trisha Thadani, Kevin Fagan", "title": "S.F. on high alert over new drug 'tranq' that could make fentanyl crisis even worse - San Francisco Chronicle", "description": "While it has not yet landed at obvious scale in San Francisco, the Medical Examiner said...", "url": "https://www.sfchronicle.com/bayarea/article/S-F-on-high-alert-over-new-drug-tranq-that-17708511.php", "urlToImage": "https://s.hdnux.com/photos/01/31/05/47/23353826/3/rawImage.jpg", "publishedAt": "2023-01-10T21:03:56Z", "content": "As San Francisco struggles to tackle its fentanyl-driven overdose crisis, officials are on high alert that another drug colloquially known as tranq an animal sedative typically used in large cattle c… [+8082 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Links COVID-19 Infection – and Vaccination – to a Debilitating Heart Condition - SciTechDaily", "description": "Smidt Heart Institute researchers show the risk of developing postural orthostatic tachycardia syndrome, or POTS, is five times higher after COVID-19 than after vaccination. A team of investigators from the Smidt Heart Institute at Cedars-Sinai has published …", "url": "https://scitechdaily.com/new-research-links-covid-19-infection-and-vaccination-to-a-debilitating-heart-condition/", "urlToImage": "https://scitechdaily.com/images/Human-Heart-Anatomy-1.jpg", "publishedAt": "2023-01-10T18:26:59Z", "content": "ByCedars-Sinai Medical CenterJanuary 10, 2023\r\nPostural Orthostatic Tachycardia Syndrome (POTS) is a disorder that affects the autonomic nervous system and is characterized by an abnormal increase in… [+5441 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Experts Recommend Drugs, Surgery for Teen Obesity in New Guidelines - Gizmodo", "description": "The American Academy of Pediatrics' guidelines are the first to emphasize proactive measures for treating childhood obesity, which has risen in recent years.", "url": "https://gizmodo.com/pediatric-obesity-treatment-guidelines-surgery-1849970109", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8f8ef648777f6a6d579e1b6142c26dc3.jpg", "publishedAt": "2023-01-10T17:37:00Z", "content": "For the first time ever, experts with the American Academy of Pediatrics are recommending proactive medical intervention against childhood obesity. The organizations new guidelines will no longer ask… [+3842 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Hearing Loss Linked to Dementia in Older Adults - Neuroscience News", "description": "Older adults with more severe hearing loss are more likely to suffer from dementia, but the likelihood of developing dementia was lower for those who use hearing aids.", "url": "https://neurosciencenews.com/hearing-loss-dementia-22218/", "urlToImage": "https://neurosciencenews.com/files/2023/01/hearing-loss-dementia-neurosicnes-public.jpg", "publishedAt": "2023-01-10T17:27:30Z", "content": "Summary: Older adults with more severe hearing loss are more likely to suffer from dementia, but the likelihood of developing dementia was lower for those who use hearing aids.\r\nSource: Johns Hopkins… [+4988 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "One of The Deadliest Human Diseases Is Far Older Than We Ever Realized - ScienceAlert", "description": "Smallpox has left an unmistakable mark on human history, killing at least 300 million people in the 20th century alone.", "url": "https://www.sciencealert.com/one-of-the-deadliest-human-diseases-is-far-older-than-we-ever-realized", "urlToImage": "https://www.sciencealert.com/images/2023/01/MicroscopeImageofVariolaSmallpoxViruse.jpg", "publishedAt": "2023-01-10T17:00:42Z", "content": "Smallpox has left an unmistakable mark on human history, killing at least 300 million people in the 20th century alone. In spite of its notoriety, the virus's origins still remain elusive.\r\nNow, a te… [+4043 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: Leftover swabs to be tested for other viruses in the UK - BBC", "description": "A UK project plans large-scale genetic surveillance of risky respiratory viruses, such as flu and RSV.", "url": "https://www.bbc.com/news/health-64209168", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1216D/production/_128239047_gettyimages-1298110721-1.jpg", "publishedAt": "2023-01-10T16:05:53Z", "content": "Millions of UK Covid test samples will be analysed for other serious respiratory viruses, including flu, in a new disease-tracking project. \r\nThe Wellcome Sanger Institute team will run detailed gene… [+2475 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Solen Le Net", "title": "‘Almost everyone with advanced cancer’ reports the same ‘unbearable’ symptom - warning - Express", "description": "The words 'unbearable' and 'paralysing' are often used to describe symptoms in the advanced stages of cancer.", "url": "https://www.express.co.uk/life-style/health/1717318/cancer-symptoms-advanced-fatigue-unbearable-weakness", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4490231.jpg?r=1673252272270", "publishedAt": "2023-01-09T08:16:00Z", "content": null}]}