{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Victoria Allen", "title": "Statins' success may be fuelling obesity crisis by discouraging patients from losing weight - Daily Mail", "description": "Around eight million Britons take statins to lower their cholesterol, and up to nine million are on medications to lower blood pressure. But it may distract people from tackling their waistlines.", "url": "https://www.dailymail.co.uk/health/article-11501127/Statins-success-fuelling-obesity-crisis-discouraging-patients-losing-weight.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/04/20/65230385-0-image-a-6_1670185811334.jpg", "publishedAt": "2022-12-04T22:04:19Z", "content": "Statins and blood pressure tablets may be fuelling obesity because they work so well some patients may no longer try to lose weight, experts warn.\r\nAround eight million Britons take statins to lower … [+2447 chars]"}, {"source": {"id": null, "name": "fox8.com"}, "author": "Nexstar Media Wire, Alix Martichoux", "title": "Why are so many people sick right now? - WJW FOX 8 News Cleveland", "description": "One week after the Thanksgiving holiday, and chances are good that you are sniffling, coughing or feeling a little scratch in your throat. What’s behind the seemingly omnipresent illness?", "url": "https://fox8.com/news/why-are-so-many-people-sick-right-now/", "urlToImage": "https://fox8.com/wp-content/uploads/sites/12/2022/12/GettyImages-1124732633-1.jpg?w=1280", "publishedAt": "2022-12-04T20:20:00Z", "content": "(NEXSTAR) One week after the Thanksgiving holiday, and chances are good that you are sniffling, coughing or feeling a little scratch in your throat. It’s not just you  the country is contending with … [+2725 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": "Jack Phillips", "title": "CDC Alert: 44 States Experiencing High Levels of Respiratory Illness - The Epoch Times", "description": "Data from the Centers for Disease Control and Prevention (CDC) shows that influenza is on the rise across the United States, and 44 states are experiencing high levels. The agency said that 31 U.S. jurisdictions, which include territories and the District of …", "url": "https://www.theepochtimes.com/cdc-alert-44-states-experiencing-high-levels-of-respiratory-illness_4903359.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/12/04/flu-99-1200x649.jpg", "publishedAt": "2022-12-04T19:24:16Z", "content": "Data from the Centers for Disease Control and Prevention (CDC) shows that influenza is on the rise across the United States, and 44 states are experiencing high levels.\r\nThe agency said that 31 U.S. … [+4465 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen, Joe Davies", "title": "Come down with a bug? Use DailyMail.com's guide to tell whether it's Covid, flu or RSV - Daily Mail", "description": "DailyMail.com created a guide to inform Americans which respiratory virus is responsible for any flu-like symptoms they may be feeling this winter, whether a cold, RSV or COVID-19.", "url": "https://www.dailymail.co.uk/health/article-11496857/Come-bug-Use-DailyMail-coms-guide-tell-Covid-flu-RSV.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/03/00/65193373-0-image-a-111_1670027718632.jpg", "publishedAt": "2022-12-04T18:19:01Z", "content": "Flu season is back this year with a vengeance.\r\nAfter Covid wiped out a majority of other respiratory illnesses in 2020 and 2021, more familiar viruses are returning this year at rates officials have… [+7336 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Deidre McPhillips, CNN", "title": "As respiratory viruses strain US health care systems, White House offers assistance - KSL.com", "description": "Nearly 20,000 people in the United States were admitted to the hospital for flu last week, almost double the number of admissions from the week before, according to data updated Friday by the CDC.", "url": "https://www.ksl.com/article/50531138/as-respiratory-viruses-strain-us-health-care-systems-white-house-offers-assistance", "urlToImage": "https://img.ksl.com/slc/2905/290511/29051148.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-12-04T16:40:30Z", "content": "Estimated read time: 4-5 minutes\r\nWASHINGTON Nearly 20,000 people in the United States were admitted to the hospital for flu last week, almost double the number of admissions from the week before, ac… [+4873 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Researchers Find COVID-19 Pandemic Stress Physically Aged Teens’ Brains - SciTechDaily", "description": "The brains of adolescents who were assessed after the COVID pandemic shutdowns ended appeared several years older than those of teens who were assessed before the pandemic. Until now, such accelerated changes in “brain age” have only been seen in children exp…", "url": "https://scitechdaily.com/stanford-researchers-find-covid-19-pandemic-stress-physically-aged-teens-brains/", "urlToImage": "https://scitechdaily.com/images/3D-Brain-Scan-Side-View.gif", "publishedAt": "2022-12-04T16:33:22Z", "content": "ByStanford UniversityDecember 4, 2022\r\nThe brains of adolescents who were assessed after the pandemic shutdowns ended appeared several years older than those of teens who were assessed before the pan… [+7187 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Elizabeth Yuko", "title": "These Are Signs That Your Dog Is Allergic to People - Lifehacker", "description": "Is your dog sick, or dealing with a human allergy?", "url": "https://lifehacker.com/maybe-dogs-are-allergic-to-you-have-you-ever-thought-o-1849842681", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/53d20d70cf358a6216f4f808e307a874.jpg", "publishedAt": "2022-12-04T16:00:00Z", "content": "Anyone who lives with allergies knows how deeply unpleasant they can be, knocking you out with a range of symptoms affecting you from head-to-toe. Dogs feel our pain, too, and can be allergic to a nu… [+2988 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Renée Onque", "title": "Exercise may increase the effectiveness of your Covid-19 vaccine, a new study found: Here's how to get the most benefit - CNBC", "description": "New research suggests that exercise is associated with higher effectiveness of Covid-19 vaccines and more protection from severe outcomes. Here's what we know.", "url": "https://www.cnbc.com/2022/12/04/study-exercise-may-increase-the-effectiveness-of-covid-19-vaccines.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107160548-1670008386580-gettyimages-143133452-314c5bde-4221-4d77-9822-7b5781ed488d.jpeg?v=1670158801&w=1920&h=1080", "publishedAt": "2022-12-04T13:00:01Z", "content": "Having the most protection from severe outcomes following Covid-19 infection is largely attributed to vaccination. But, the shot's effectiveness may be enhanced by physical activity, a new study foun… [+4121 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": null, "title": "4 Common Medications That Spike Your Dementia Risk, According to a Pharmacist - msnNOW", "description": "These drugs can have a serious effect on your brain health.", "url": "https://bestlifeonline.com/medications-dementia-risk-news/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14T9sh.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-12-04T12:04:07Z", "content": "Kevin Hwang, MD, tells GoodRx that research has found a possible link between anticholinergic drugs and dementia. Anticholinergics treat different conditions that include urinary incontinence. But Hw… [+865 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Peter Loftus, Denise Roland", "title": "Why You Can't Find Wegovy, the Weight-Loss Drug - The Wall Street Journal", "description": "Novo Nordisk underestimated demand for drug that went viral on TikTok and YouTube", "url": "https://www.wsj.com/articles/why-you-cant-find-wegovy-the-weight-loss-drug-11670108199", "urlToImage": "https://images.wsj.net/im-678147/social", "publishedAt": "2022-12-04T11:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientific Weight Loss Study: Green Mediterranean Diet Reduces Twice As Much Visceral Fat - SciTechDaily", "description": "The Green Mediterranean diet reduces twice as much visceral fat as the Mediterranean diet. Reducing visceral fat is the true goal of weight loss. The green Mediterranean diet (MED) significantly reduces visceral adipose tissue, a type of fat around internal o…", "url": "https://scitechdaily.com/scientific-weight-loss-study-green-mediterranean-diet-reduces-twice-as-much-visceral-fat/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss.jpg", "publishedAt": "2022-12-04T10:49:59Z", "content": "According to a study in the peer-reviewed medical journal BMC Medicine, the green Mediterranean diet significantly reduces visceral fat. In fact, it reduced visceral fat by twice as much as the regul… [+4433 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "Male birth control research is starting to make progress : Shots - Health News - NPR", "description": "For decades birth control research focused on women. Now there's a new push to develop gels, pills or other products that could keep men from getting their partners pregnant.", "url": "https://www.npr.org/sections/health-shots/2022/12/04/1140512789/birth-control-male-contraceptive-sperm", "urlToImage": "https://media.npr.org/assets/img/2022/12/02/malecontraception1_wide-691791e739880a65ae02d8f4a603b2984d8d07eb-s1400-c100.jpg", "publishedAt": "2022-12-04T10:01:05Z", "content": "Condoms have been used to prevent pregnancy since the Middle Ages, with the rubber version arriving in the industrial mid-1800s. Over the years, they've become more effective and comfortable to use. … [+8686 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Explained: Why vitamin D deficiency is very high in Kashmir? Study sheds light - Times of India", "description": "Many factors can cause vitamin D deficiency including insufficient exposure to sunlight and lack of vitamin D-rich foods in your diet. Other reasons could be your kidneys' inability to convert vitamin D into its active form and because your digestive tract ca…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/explained-why-vitamin-d-deficiency-is-very-high-in-kashmir-study-sheds-light/photostory/95824723.cms", "urlToImage": "https://static.toiimg.com/photo/95824752.cms", "publishedAt": "2022-12-04T07:59:00Z", "content": "As per the study, the prevalence of vitamin D deficiency ranged from 58% in the farmers’ group to 93% in the employee group.\r\n“Further, vitamin D deficient subjects had a significantly lower mean wee… [+417 chars]"}, {"source": {"id": null, "name": "YourTango"}, "author": "Joy Nordenstrom", "title": "The 3 Most Effective Aphrodisiacs To Make A Man Fall For You - YourTango", "description": "For men and women trying to increase their sex drive, natural aphrodisiac foods are a great way to stimulate the necessary neurochemicals, so here are 3 types of aphrodisiacs essential for increasing male or female libido quickly.", "url": "https://www.yourtango.com/love/most-effective-aphrodisiacs-make-man-fall-for-you", "urlToImage": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/the-3-most-effective-aphrodisiacs.png?itok=2Y_z4R5C", "publishedAt": "2022-12-04T01:02:20Z", "content": "People have been talking about aphrodisiac foods and their ability to increase sex drive in men and women for hundreds of years.\r\nBut not many have honed in on the scientifically-based reasons natura… [+7991 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Palm e-Tattoo Can Tell When You’re Stressed Out - Neuroscience News", "description": "A newly developed \"e-tattoo\" monitors electrodermal activity, revealing when a person is experiencing elevated stress levels. The \"tattoo\" attaches to the user's palm and connects to a smartwatch.", "url": "https://neurosciencenews.com/stress-e-tattoo-21995/", "urlToImage": "https://neurosciencenews.com/files/2022/12/e-tattoo-stress-neurosincecs.jpg", "publishedAt": "2022-12-03T23:06:42Z", "content": "Summary: A newly developed “e-tattoo” monitors electrodermal activity, revealing when a person is experiencing elevated stress levels. The “tattoo” attaches to the user’s palm and connects to a smart… [+4433 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ethan Ennals", "title": "Spinal tap test offers new hope to patients with early dementia - Daily Mail", "description": "A spinal tap, currently undergoing a pilot study, uses a long needle to remove fluid from the spinal cord and has been proved to correctly identify 90 per cent of dementia cases.", "url": "https://www.dailymail.co.uk/health/article-11498919/Spinal-tap-test-offers-new-hope-patients-early-dementia.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/03/21/65210245-0-image-a-67_1670101405617.jpg", "publishedAt": "2022-12-03T22:00:49Z", "content": "A spinal tap test to spot early-stage Alzheimers disease could soon be brought in by the NHS so a radical new treatment can be started in time.\r\nAlmost one million Britons have dementia with Alzheime… [+2777 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Ryan Merrifield", "title": "Boy, 12, is first secondary school pupil to die in wave of Strep A cases - The Mirror", "description": "A Year 8 pupil from private Colfe’s School in Lewisham, south east London, has died after contracting Strep A, after at least six other children have died amid the outbreak", "url": "https://www.mirror.co.uk/news/uk-news/boy-12-first-secondary-school-28648494", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article28648620.ece/ALTERNATES/s1200/0_THP_CHP_031222Slug_344JPG.jpg", "publishedAt": "2022-12-03T21:47:44Z", "content": "A 12-year-old boy has become the first secondary school pupil to die from Strep A as the killer infection spreads across Britain. \r\nThe Year 8 student at private Colfes School in Lewisham, south east… [+4393 chars]"}, {"source": {"id": null, "name": "NBC4 WCMH-TV"}, "author": "Orri Benatar, Karina Cheung", "title": "Health officials: Westerville store exposed to measles Thursday - NBC4 WCMH-TV", "description": "WESTERVILLE, Ohio (WCMH) — A fourth public location in central Ohio has been listed by Columbus Public Health as being exposed to measles. CPH announced Saturday afternoon that they are investigating a confirmed case of measles that visited the Dollar Tree st…", "url": "https://www.nbc4i.com/news/local-news/westerville/health-officials-westerville-store-exposed-to-measles-thursday/", "urlToImage": "https://www.nbc4i.com/wp-content/uploads/sites/18/2022/04/22110554624308.jpg?w=1280", "publishedAt": "2022-12-03T19:26:52Z", "content": "WESTERVILLE, Ohio (WCMH) — A fourth public location in central Ohio has been listed by Columbus Public Health as being exposed to measles. \r\nCPH announced Saturday afternoon that they are investigati… [+1604 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Scientists Just Caught Bacteria Using a Never-Before-Seen Trick to Avoid Antibiotics - ScienceAlert", "description": "Researchers have just caught bacteria sidestepping antibiotic treatment with a never-before-seen trick.", "url": "https://www.sciencealert.com/scientists-just-caught-bacteria-using-a-never-before-seen-trick-to-avoid-antibiotics", "urlToImage": "https://www.sciencealert.com/images/2022/12/RedChainsOfStrepBacteriaUnderTheMicroscope.jpg", "publishedAt": "2022-12-03T17:00:23Z", "content": "Researchers have just caught bacteria sidestepping antibiotic treatment with a never-before-seen trick.\r\nBacteria's troublesome talent for developing resistance against antibiotics is a rapidly growi… [+3698 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Athena Stavrou", "title": "‘Fit and healthy’ mother who fought thyroid cancer at 27 shares 4 symptoms she ignored - Yahoo Sports", "description": "Christina McKnight, now 35, thought little of her symptoms and was only diagnosed after her husband ‘forced’ her to see a doctor", "url": "https://www.independent.co.uk/life-style/health-and-families/what-are-the-symptoms-of-thyroid-cancer-b2238333.html", "urlToImage": "https://media.zenfs.com/en/the_independent_635/310a03704f2fb45b2eba714fbb67af11", "publishedAt": "2022-12-03T16:16:42Z", "content": "A mother who battled thyroid cancer aged 27 has revealed the symptoms she ignored weeks before her diagnosis, from dry skin to brittle hair.\r\nChristina McKnight, now 35, thought little of the signs f… [+3477 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Karen Weintraub, USA TODAY", "title": "Is monkeypox still in the US? Cases drop amid vaccine. What's next? - USA TODAY", "description": "Cases of the disease formerly known as monkeypox are down as the Biden administration declares an end to the public health emergency.", "url": "https://www.usatoday.com/story/news/health/2022/12/03/monkeypox-mpox-cases-vaccine-emergency-lifted/10809588002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/08/17/USAT/5703d5a7-5d1d-4833-a956-d46c4cb51c4e-AP_Monkeypox_Vaccine.jpg?auto=webp&crop=5260,2959,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-12-03T15:00:05Z", "content": "<ul><li>Monkeypox was recently renamed mpox to get rid of the stigma that associated the disease with monkeys.</li><li>The US is reporting an average of six mpox cases a week, down from over 600 in A… [+7376 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Amy McGorry", "title": "Alzheimer's experimental drug may slow progression of disease, but there are risks: experts - Fox News", "description": "A study just published in the New England Journal of Medicine indicates that the experimental drug lecanemab showed a slowing of cognitive decline progression by 27% in those with early Alzheimer's.", "url": "https://www.foxnews.com/health/alzheimers-experimental-drug-may-slow-progression-disease-risks-experts", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Alzheimers-Scan.jpg", "publishedAt": "2022-12-03T14:38:49Z", "content": "The experimental drug lecanemab has indicated a slowing of cognitive decline progression by 27% in patients with early-stage Alzheimers, according to a study published this week in the New England Jo… [+8963 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Marissa Matozzo", "title": "A Dermatologist Tells Us How Peptides Support Collagen And Tighten Sagging Skin - Yahoo Life", "description": "Collagen is the most abundant protein in the human body, and it promotes skin elasticity and a supple, radiant complexion. When creating a healthy skincare...", "url": "https://www.shefinds.com/collections/dermatologist-peptides-collagen-tighten-sagging-skin/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/09b01c929b5842e01bdd1d504790ea2a", "publishedAt": "2022-12-03T13:30:37Z", "content": "Collagen is the most abundant protein in the human body, and it promotes skin elasticity and a supple, radiant complexion. When creating a healthy skincare routine, smoothing fine lines, wrinkles and… [+2324 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Root Vegetables To Add To Your Diet To Control Your Blood Sugar Level - News18", "description": "Root Vegetables not just improve the immunity system, but they can also help in lowering your blood sugar level.", "url": "https://www.news18.com/news/lifestyle/5-root-vegetables-to-add-to-your-diet-to-control-your-blood-sugar-level-6530575.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-1-39-167007394416x9.jpg", "publishedAt": "2022-12-03T13:25:52Z", "content": "If you have high blood sugar levels then it is of utmost importance to add root vegetables to your diet. Eating a nutritious and healthy diet is crucial for maintaining bodily health and avoiding dis… [+2084 chars]"}, {"source": {"id": null, "name": "GoodHousekeeping.com"}, "author": "Alyssa Jung", "title": "Here's What a COVID-19 Headache Feels Like - Yahoo Life", "description": "A headache is a common COVID-19 symptom. Here's what it feels like, and more importantly, how to get relief from a COVID-19 headache.", "url": "https://www.goodhousekeeping.com/health/wellness/a42099775/covid-headache-relief/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/KEYjjDgtiaVOmVk9tYaZVQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/good_housekeeping_561/ed163ed169b42e1e56999a66c3a0a4d5", "publishedAt": "2022-12-03T13:00:00Z", "content": "Cough, fever and shortness of breath used to be some of the most common signs (besides a positive test) that youd been infected with COVID-19. But the latest variants have brought another rising symp… [+6971 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Which diet is best for me? DailyMail.com weighs the pros and cons of seven top fad diets - Daily Mail", "description": "DailyMail.com dug deep into seven popular fad diets to find which is best, and what benefit each can provide to you - and what risks each one comes with over time.", "url": "https://www.dailymail.co.uk/health/article-11478085/Which-diet-best-DailyMail-com-weighs-pros-cons-seven-fad-diets.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/03/00/65192591-0-image-a-133_1670025880439.jpg", "publishedAt": "2022-12-03T12:32:25Z", "content": "With the glutenous Thanksgiving break out of the way and New Year's resolutions around the corner, many Americans will be considering starting a new diet.\r\nBut deciding which type is best for you can… [+21494 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": "Neal Templin", "title": "How Far Should You Walk to Improve Your Health? You Won't Like the Answer. - Barron's", "description": "A study that looked for associations between step count and disease found the biggest protections against most diseases among those who walked close to 10,000 steps a day. For example, the research found that increasing your step count to 10,000 from 6,000 re…", "url": "https://www.barrons.com/articles/how-far-should-you-walk-51670023596", "urlToImage": "https://images.barrons.com/im-676852/social", "publishedAt": "2022-12-03T11:30:00Z", "content": "Walking 10,000 steps a day is one of those mysteriously decided good things we should all do, much like drinking eight glasses of water a day. I read it comes from a Japanese marketing campaign in th… [+1838 chars]"}, {"source": {"id": null, "name": "The Philadelphia Inquirer"}, "author": "Tom Avril", "title": "Penn scientists made a universal flu vaccine using mRNA, and they plan to test it in humans - The Philadelphia Inquirer", "description": "The vaccine relies on messenger RNA (mRNA), just like the Pfizer and Moderna vaccines for COVID.", "url": "https://www.inquirer.com/health/flu-vaccine-mrna-penn-scott-hensley-20221203.html", "urlToImage": "https://www.inquirer.com/resizer/7XHfYgzV7KYTXvnKQ0pOrKX2Z94=/0x0:2398x1600/760x507/filters:format(webp)/cloudfront-us-east-1.images.arcpublishing.com/pmn/ZI5EEHLNANBHXGXA7S55O5C3MY.jpg", "publishedAt": "2022-12-03T10:05:57Z", "content": "For years, scientists have tried, and failed, to make a one-and-done vaccine that would provide at least partial protection against all types of the flu.\r\nA University of Pennsylvania scientist now t… [+4310 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Faith Geiger", "title": "These Are Actually The Best Superfoods To Eat For Weight Loss, Nutritionists Say - Yahoo Life", "description": "With so much buzz around superfoods in recent years, you may be wondering exactly what a superfood is, and what the best options are when it comes to your...", "url": "https://www.shefinds.com/collections/best-superfoods-weight-loss-kale-quinoa/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/92b16f20762a4561748b4bc69fb33862", "publishedAt": "2022-12-03T10:00:57Z", "content": "With so much buzz around superfoods in recent years, you may be wondering exactly what a superfood is, and what the best options are when it comes to your overall healthespecially when it comes to we… [+3357 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "The 'tripledemic' may mean kids' fever-reducing medicines are harder to find : Shots - Health News - NPR", "description": "Makers of products like Children's Tylenol say they're trying to keep up with big demand as RSV, flu, and COVID spread. But medical experts note that kids' fevers don't always call for medicine.", "url": "https://www.npr.org/sections/health-shots/2022/12/03/1140185521/children-fever-medicine-tylenol-motrin-hard-to-find", "urlToImage": "https://media.npr.org/assets/img/2022/12/02/img_7952_wide-d665f4f8de5f9aeb0d1c4ebd0a4c97485deef428-s1400-c100.jpg", "publishedAt": "2022-12-03T10:00:37Z", "content": "It can be hard to find children's fever-reducing medication in some areas. At a Bed Bath &amp; Beyond in Washington, D.C., on Thursday, a few products were in stock while others were sold out.\r\nLaure… [+6731 chars]"}, {"source": {"id": null, "name": "TribLIVE"}, "author": "Julia Maruca", "title": "RSV, flu, covid put pressure on pediatric providers - TribLIVE", "description": "Every day about 3 p.m., nurses, doctors and staff in the emergency room at UPMC Children&rsquo;s Hospital of Pittsburgh brace for impact. That hour marks the beginning of an eight-hour stretch that in recent months has been the busiest time of day for the dep…", "url": "https://triblive.com/local/westmoreland/rsv-flu-covid-put-pressure-on-pediatric-providers/", "urlToImage": "https://assets-varnish.triblive.com/2022/12/5672970_web1_gtr-hospitalstatus-120222-pediatrician.jpg", "publishedAt": "2022-12-03T10:00:00Z", "content": "Every day about 3 p.m., nurses, doctors and staff in the emergency room at UPMC Children’s Hospital of Pittsburgh brace for impact.\r\nThat hour marks the beginning of an eight-hour stretch that in rec… [+8932 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Mysterious Tendrils Inside The Brain May Control Our Perception of Time - ScienceAlert", "description": "Tiny antenna-like organelles once thought to be holdovers from our ancient past appear to play a crucial role in keeping track of time, according to a recent study on mice by researchers from the University of California, Irvine (UCI), in the US.", "url": "https://www.sciencealert.com/mysterious-tendrils-inside-the-brain-may-control-our-perception-of-time", "urlToImage": "https://www.sciencealert.com/images/2022/12/PinkCiliaTendrilsInsideBrain.jpg", "publishedAt": "2022-12-03T05:00:45Z", "content": "Tiny antenna-like organelles once thought to be holdovers from our ancient past appear to play a crucial role in keeping track of time, according to a recent study on mice by researchers from the Uni… [+3547 chars]"}]}