{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover That a Certain Nutrient Promotes Anti-Aging - SciTechDaily", "description": "According to the study, the amino acid taurine could be employed in anti-aging therapies. Our cells produce potentially toxic by-products known as \"free radicals\" when they break down the oxygen we breathe and the food we consume each day in order to exist. S…", "url": "https://scitechdaily.com/scientists-discover-that-a-certain-nutrient-promotes-anti-aging/", "urlToImage": "https://scitechdaily.com/images/Rejuvenation-Anti-Aging-Concept.jpg", "publishedAt": "2022-09-04T01:31:12Z", "content": "ByFundação de Amparo à Pesquisa do Estado de São PauloSeptember 3, 2022\r\nAccording to a clinical trial involving 55 to 70-year-old women, adding this nutrient to the diet can strengthen the bodys ant… [+4019 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain Processes Sensory Information From Internal Organs - Neuroscience News", "description": "A new mouse study provides clues as to how the brain processes sensory information from internal organs, revealing feedback from organs activates different clusters of neurons in the brain stem.", "url": "https://neurosciencenews.com/sensory-processing-internal-organs-21356/", "urlToImage": "https://neurosciencenews.com/files/2022/09/sensory-processing-internal-organs-neurosicences-public.jpg", "publishedAt": "2022-09-03T23:06:04Z", "content": "Summary: A new mouse study provides clues as to how the brain processes sensory information from internal organs, revealing feedback from organs activates different clusters of neurons in the brain s… [+10935 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Axolotls Can Regenerate Their Brains - Neuroscience News", "description": "Axolotls have the ability to regenerate brain areas following an injury. Researchers have mapped cell types and genes associated with neurodegeneration in the axolotl brain, discovering some similarities in the human brain. The findings could pave the way for…", "url": "https://neurosciencenews.com/axolotls-brain-regeneration-21355/", "urlToImage": "https://neurosciencenews.com/files/2022/09/axolotl-brain-regeneration-neurosicences-public.jpg", "publishedAt": "2022-09-03T22:49:03Z", "content": "Summary: Axolotls have the ability to regenerate brain areas following an injury. Researchers have mapped cell types and genes associated with neurodegeneration in the axolotl brain, discovering some… [+6678 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Steroids Linked to Structural and Volume Changes in Brain White and Grey Matter - Neuroscience News", "description": "Steroids prescribed for a range of inflammatory conditions alter the structure and volume of grey and white matter in the brain. The findings shed light on why people who use medical steroids may experience psychological problems, including anxiety, mania, an…", "url": "https://neurosciencenews.com/steroids-grey-white-matter-21354/", "urlToImage": "https://neurosciencenews.com/files/2022/09/steriods-white-matter-neurosicences-public.jpg", "publishedAt": "2022-09-03T21:52:05Z", "content": "Summary: Steroids prescribed for a range of inflammatory conditions alter the structure and volume of grey and white matter in the brain. The findings shed light on why people who use medical steroid… [+7927 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Mystery respiratory illness kills two health care workers and patient at clinic, sickens six others in Argentina - CBS News", "description": "The mystery disease claimed its first victim among health personnel at the clinic on Monday and a second two days later.", "url": "https://www.cbsnews.com/news/mystery-pneumonia-deaths-argentina/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2022/09/03/0fce0f9f-2c16-4812-8075-869568f9840a/thumbnail/1200x630/8986284196fe8aa22efe9a55dcf6cb8c/a5f4u0zc.jpg", "publishedAt": "2022-09-03T19:52:27Z", "content": "A third person has died this week in Argentina from a type of pneumonia of unknown origin, with the fatalities thus far limited to a single clinic, health authorities said Thursday.\r\nNine people in n… [+2758 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Laura Ungar, Associated Press", "title": "Zombie cells central to the quest for active, vital old age - KSL.com", "description": "A growing number of scientists is trying to help people reach a goal humans have been chasing throughout history: staying active and vital in old age.", "url": "https://www.ksl.com/article/50466909/zombie-cells-central-to-the-quest-for-active-vital-old-age", "urlToImage": "https://img.ksl.com/slc/2891/289101/28910187.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-09-03T17:51:05Z", "content": "Estimated read time: 9-10 minutes\r\nCINCINNATI In an unfinished part of his basement, 95-year-old Richard Soller zips around a makeshift track encircling boxes full of medals he's won for track and fi… [+11635 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "3 Types of Leisure Activities That Can Lower Your Risk of Dementia - SciTechDaily", "description": "Scientists answer: Which leisure activities are associated with a lower risk of dementia? According to a recent meta-analysis recently published in Neurology, the medical journal of the American Academy of Neurology, leisure activities like reading a book, pr…", "url": "https://scitechdaily.com/3-types-of-leisure-activities-that-can-lower-your-risk-of-dementia/", "urlToImage": "https://scitechdaily.com/images/Alzheimers-Dementia-Brain-Disease-Concept.jpg", "publishedAt": "2022-09-03T14:55:56Z", "content": "The scientists found that people who engaged in leisure activities had a 17% lower risk of dementia.\r\nScientists answer: Which leisure activities are associated with a lower risk of dementia?\r\nAccord… [+3641 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Why Your Natural Immunity Against COVID Is so Durable and How to Boost It - The Epoch Times", "description": "With some countries rolling out their 5th booster shot against COVID-19, many are putting the necessity of the ...", "url": "https://www.theepochtimes.com/why-your-natural-immunity-against-covid-is-so-durable-and-how-to-boost-it_4707965.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/09/02/shutterstock_1847840281.jpg", "publishedAt": "2022-09-03T13:30:05Z", "content": "With some countries rolling out their 5th booster shot against COVID-19, many are putting the necessity of the next dose in question. For some, the extra shots are recommended by the CDC, but this do… [+8758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Black and Hispanic people are more likely to get monkeypox but less likely to be vaccinated - CNN", "description": "The organizers of Atlanta Black Pride, an LGBTQ celebration held each Labor Day weekend, have big plans. There will be parties and performances, workshops and financial literacy classes, brunches and a boat ride. This year also brings an event that no one eve…", "url": "https://www.cnn.com/2022/09/03/health/monkeypox-inequities/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220902131718-monkeypox-vaccine-220823-restricted-super-tease.jpg", "publishedAt": "2022-09-03T12:11:00Z", "content": "(CNN)The organizers of Atlanta Black Pride, an LGBTQ celebration held each Labor Day weekend, have big plans. There will be parties and performances, workshops and financial literacy classes, brunche… [+11774 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Covid: The 'most significant' symptoms in the eyes - how to spot the 'common' signs - Express", "description": "OMICRON has been linked to symptoms that slightly differ from the traditional three Covid signs such as cough, fever and loss or change to taste and smell. One lesser-known but 'significant' symptom can appear in your eyes instead, according to research.", "url": "https://www.express.co.uk/life-style/health/1663083/covid-omicron-symptoms-signs-sore-itchy-eyes-photophobia", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1663083_1.jpg", "publishedAt": "2022-09-03T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Theeverygirl.com"}, "author": "Josie Santi", "title": "Wellness Supplements Our Editor Swears By - The Everygirl", "description": "tested and approved", "url": "http://theeverygirl.com/editors-favorite-wellness-supplements/", "urlToImage": "https://media.theeverygirl.com/wp-content/uploads/2022/09/the-everygirl-social-go-to-supplements.jpg", "publishedAt": "2022-09-03T05:05:52Z", "content": "The Everygirls product selections are curated by the editorial team. If you buy something through our links, we may earn an affiliate commission, at no cost to you. We only recommend products we genu… [+2307 chars]"}, {"source": {"id": null, "name": "Martha Stewart"}, "author": "Devorah Lev-Tov", "title": "How Food Affects Your Mood - Martha Stewart", "description": "Medical experts explain this connection—and share what to eat to boost your mood.", "url": "https://www.marthastewart.com/8308198/how-food-impacts-your-mood", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=3000&h=1500&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F34%2F2019%2F06%2F12164136%2Fwoman-eating-in-kitchen-0619-getty.jpg", "publishedAt": "2022-09-02T23:36:30Z", "content": "Moods are a driving force in our daily lives. Good or bad, whatever you're feeling will probably impact your entire day. While most of us have a handle on how we feel (and understand why we feel it),… [+7754 chars]"}, {"source": {"id": null, "name": "WGN TV Chicago"}, "author": "Andy Koval, Alyssa Donovan", "title": "‘Cluster’ of Legionnaires’ disease reported in Burbank; 4 cases linked to church - WGN TV Chicago", "description": "BURBANK, Ill. — The Illinois Department of Public Health is investigating a “cluster” of Legionnaires’ disease cases in Burbank. Three cases were epidemiologically linked and one case was geographically linked to St. Albert the Great Church in Burbank, locate…", "url": "https://wgntv.com/news/cluster-of-legionnaires-disease-reported-in-burbank-4-cases-linked-to-church/", "urlToImage": "https://wgntv.com/wp-content/uploads/sites/5/2022/09/snapshot-2022-09-02T173245.138.jpg?w=1280", "publishedAt": "2022-09-02T22:23:21Z", "content": "BURBANK, Ill. The Illinois Department of Public Health is investigating a “cluster” of Legionnaires disease cases in Burbank.\r\nThree cases were epidemiologically linked and one case was geographicall… [+1174 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Unlocking the Mystery of ”Chemo Brain” - Neuroscience News", "description": "Researchers have uncovered the molecular mechanisms behind cognitive deficits and brain fog associated with chemotherapy, and identified a current FDA-approved drug for multiple sclerosis that can help reduce chemotherapy-induced cognitive impairments.", "url": "https://neurosciencenews.com/chemo-brain-drug-21353/", "urlToImage": "https://neurosciencenews.com/files/2022/09/chemo-brain-neurosicences-public.jpg", "publishedAt": "2022-09-02T21:58:59Z", "content": "Summary: Researchers have uncovered the molecular mechanisms behind cognitive deficits and brain fog associated with chemotherapy, and identified a current FDA-approved drug for multiple sclerosis th… [+6941 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Kristina Fiore | MedPage Today", "title": "Are EDs bombarded with Apple Watch Afib alerts? - ABC News", "description": "Arrhythmia alerts can be nerve-wracking, but they're not usually an emergency.", "url": "https://abcnews.go.com/Health/eds-bombarded-apple-watch-afib-alerts/story?id=89229659", "urlToImage": "https://s.abcnews.com/images/Health/apple-watch-heart-ekg-gty-jt-220902_1662148198031_hpMain_16x9_992.jpg", "publishedAt": "2022-09-02T21:41:12Z", "content": "This is a MedPage Today story.\r\nPaul Chernoff was in the middle of a Zoom call this past June when his Apple Watch sent him an alert.\r\nHis heart rate had jumped to 142 beats per minute, and he might … [+7937 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mary Kekatos", "title": "Monkeypox cases are on the decline in New York City, data shows - ABC News", "description": "The 7-day rolling average has fallen from 50 to 9 in two weeks.", "url": "https://abcnews.go.com/Health/monkeypox-cases-decline-york-city-data-shows/story?id=89220920", "urlToImage": "https://s.abcnews.com/images/Health/monkeypox-file-ap-ml-220902_1662131091107_hpMain_16x9_992.jpg", "publishedAt": "2022-09-02T21:20:25Z", "content": "Monkeypox cases appear to be on the decline in the epicenter of the country's outbreak.\r\nData from the New York City Department of Health &amp; Mental Hygiene shows that as of Aug. 30, the latest dat… [+3447 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Rikki Loftus", "title": "Mum whose eczema was so bad she didn’t leave the house shares ‘unbelievable’ cure she found on YouTube - The Independent", "description": "Lisa Dispirito, 54, from Bideford, Devon, had always had clear skin and thought she was allergic to her new perfume at first.", "url": "https://www.independent.co.uk/life-style/health-and-families/eczema-cure-cream-youtube-review-b2158286.html", "urlToImage": "https://static.independent.co.uk/2022/09/02/07/01153414-459c75c6-ba73-4264-944e-6019783c04eb.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-09-02T21:00:48Z", "content": "A mum who blames the menopause for causing eczema to break out across her face and neck and was so embarrassed by her red raw skin she didnt leave the house for three weeks is sharing her £9.50 wonde… [+6914 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Exercising Isn't Just About Weight Loss, Say Cardiologists. It's About a Healthy Heart - ScienceAlert", "description": "Exercise is about so much more than weight loss, but in a world where obesity is so strongly associated with poor health, it's hard not to make shedding pounds the primary goal.", "url": "https://www.sciencealert.com/exercising-isnt-just-about-weight-loss-say-cardiologists-its-about-a-healthy-heart", "urlToImage": "https://www.sciencealert.com/images/2022/09/ExerciseHeartHealth.jpg", "publishedAt": "2022-09-02T20:01:31Z", "content": "Exercise is about somuchmore than weight loss, but in a world where obesity is so strongly associated with poor health, it's hard not to make shedding pounds the primary goal.\r\nA new editorial from t… [+4008 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover a Surprising Connection Between Appetite and Sun Exposure - SciTechDaily", "description": "Visiting the beach? Going on a hike? Be ready: Men will be hungrier! According to recent research from Tel Aviv University, exposure to the sun makes men more hungry but not women. The research, which was conducted using lab models, reveals how the metabolic …", "url": "https://scitechdaily.com/scientists-uncover-a-surprising-connection-between-appetite-and-sun-exposure/", "urlToImage": "https://scitechdaily.com/images/Fat-Man-Eating-Fast-Food.jpg", "publishedAt": "2022-09-02T19:33:03Z", "content": "ByTel-Aviv UniversitySeptember 2, 2022\r\nThe study found that sun exposure activates a protein that stimulates the appetite.\r\nVisiting the beach? Going on a hike? Be ready: Men will be hungrier!\r\nAcco… [+4444 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Circadian Rhythm Disruption Found to Be Common Among Mental Health Disorders - Neuroscience News", "description": "Circadian rhythm disruption is a psychopathological factor shared by a broad range of mental illnesses.", "url": "https://neurosciencenews.com/circadian-rhythm-mental-health-21347/", "urlToImage": "https://neurosciencenews.com/files/2022/09/mental-health-circadian-rhythm-neuroscinecen-public.jpg", "publishedAt": "2022-09-02T18:34:52Z", "content": "Summary: Circadian rhythm disruption is a psychopathological factor shared by a broad range of mental illnesses.\r\nSource: UC Irvine\r\nAnxiety, autism, schizophrenia and Tourette syndrome each have the… [+6560 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Patrick Waechter", "title": "Monkeypox Has Been Linked To Serious Heart Inflammation In A 31-Year-Old Man - BuzzFeed News", "description": "A monkeypox patient in Portugal was hospitalized with heart inflammation, and this week a severely immunocompromised person diagnosed with monkeypox died in Texas. Here’s what we know so far about the worst risks of the virus.", "url": "https://www.buzzfeednews.com/article/patrickwaechter/monkeypox-may-cause-myocarditis-heart-inflammation", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2022-09/2/17/asset/d14d37dc16ae/sub-buzz-4646-1662138067-25.jpg?crop=1600:838;0,123%26downsize=1250:*", "publishedAt": "2022-09-02T18:07:06Z", "content": "This week has offered two stark reminders that monkeypox infections can be more than skin-deep.\r\nA person diagnosed with monkeypox died this week in Harris County, Texas, according to the Department … [+6118 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Protect Yourself Against Heart Attack and Stroke – Train Your Blood Vessels - SciTechDaily", "description": "Short, repeated bouts of restricted circulation using a blood pressure cuff may be beneficial to one's health. The majority of heart attacks and strokes worldwide are ischemic, meaning that a clot or accumulation of plaque in an artery stops oxygen-rich blood…", "url": "https://scitechdaily.com/protect-yourself-against-heart-attack-and-stroke-train-your-blood-vessels/", "urlToImage": "https://scitechdaily.com/images/Young-Myocarditis-Heart-Concept.jpg", "publishedAt": "2022-09-02T16:32:19Z", "content": "A heart attack occurs when an artery carrying blood and oxygen to the heart becomes obstructed.\r\nShort, repeated bouts of restricted circulation using a blood pressure cuff may be beneficial to ones … [+4958 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Could testosterone supplements keep men from being hospitalized for COVID? - Study Finds", "description": "Compared to men with regular testosterone levels, men with low counts of the sex hormone were 2.4 times more likely end up in the hospital.", "url": "https://studyfinds.org/testosterone-supplements-covid/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2020/09/AdobeStock_332909584-scaled.jpeg", "publishedAt": "2022-09-02T16:23:11Z", "content": "ST. LOUIS — Men with low testosterone levels see their risk of hospitalization due to COVID-19 more than double, according to a new study.\r\nCompared to men with regular testosterone levels, men with … [+3877 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Second monkeypox strain found in the UK - The Guardian", "description": "Individual hospitalised with the virus had recently travelled to west Africa, say public health officials", "url": "https://amp.theguardian.com/world/2022/sep/02/second-monkeypox-strain-found-in-the-uk", "urlToImage": "https://i.guim.co.uk/img/media/0a3b65a67e0e1beae51bed1358180bd803144894/0_106_3203_1923/master/3203.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1a7e653626210fa82c4a173c4d4444a8", "publishedAt": "2022-09-02T16:22:00Z", "content": "A second monkeypox strain has been identified in the UK, linked with travel to west Africa, public health officials have said.\r\nAccording to the UK Health Security Agency (UKHSA), an individual who h… [+2228 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Liz Moughon, Tristen Rouse", "title": "Photographer documents Type 1 diabetes - The Washington Post", "description": "Photographer Liz Moughon was in the hospital, struggling to breathe. That's when she learned she had Type 1 diabetes.", "url": "https://www.washingtonpost.com/photography/2022/09/02/tracking-type-one-diabetes/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K2MVVAQZQUI63OMYWKVWR5MENA.jpg&w=1440", "publishedAt": "2022-09-02T16:00:00Z", "content": "Comment on this story\r\nFor days, Liz Moughon had been struggling to breathe. Now she was on her way to an emergency room, prodded by a concerned sister and the realization that, in the past 24 hours,… [+5563 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Doctors Discover a Link Between a Certain Type of Diet, Depression, and Frailty - SciTechDaily", "description": "The impact of dietary inflammation on the development of frailty and other health problems may be more pronounced in middle-aged and older people who are depressed. According to recent research published in The Journal of Gerontology: Medical Sciences, there …", "url": "https://scitechdaily.com/harvard-doctors-discover-a-link-between-a-certain-type-of-diet-depression-and-frailty/", "urlToImage": "https://scitechdaily.com/images/Depression-Sad-Old-Man.jpg", "publishedAt": "2022-09-02T13:45:30Z", "content": "ByHebrew SeniorLife Hinda and Arthur Marcus Institute for Aging ResearchSeptember 2, 2022\r\nAn inflammatory diet often has a low intake of fruits, vegetables, and other healthy foods while having a hi… [+4338 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Andi Breitowich", "title": "MS Tingling: What To Know And How To Cope With This Symptom - Women's Health", "description": "Here's what you need to know.", "url": "https://www.womenshealthmag.com/health/a40884295/ms-tingling/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/painful-repetitive-strain-injury-royalty-free-image-1660335368.jpg?crop=1xw:0.79188xh;center,top&resize=1200:*", "publishedAt": "2022-09-02T11:30:29Z", "content": "You know that feeling when you sleep on your arm in a weird position and a tingling sensation \r\nwakes you up? What happens if that feeling lasts for days or even weeks at a time? Getting rid of the u… [+8636 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The 5 Most Nutrient-Dense Vegetables Based on Science - SciTechDaily", "description": "Vegetables of all colors are packed with vitamins, minerals, fiber, and phytonutrients. You can't go wrong by adding more colorful produce to your plate. There are, however, vegetables with a higher nutrient content relative to their calories, making them exc…", "url": "https://scitechdaily.com/the-5-most-nutrient-dense-vegetables-based-on-science/", "urlToImage": "https://scitechdaily.com/images/Supermarket-Vegetables.jpg", "publishedAt": "2022-09-02T10:42:25Z", "content": "BySciTechDaily.comSeptember 2, 2022\r\nVegetables of all colors are packed with vitamins, minerals, fiber, and phytonutrients. You cant go wrong by adding more colorful produce to your plate. There are… [+6963 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Cady Stanton, USA TODAY", "title": "As monkeypox cases spread, AIDs epidemic history surfaces old wounds - USA TODAY", "description": "Monkeypox and HIV are largely different viruses, but their impact on gay men has picked at old wounds for HIV survivors and advocates.", "url": "https://www.usatoday.com/story/news/nation/2022/09/02/monkeypox-hiv-aids-activists-lessons-learned/10297826002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/09/01/USAT/046e8ddc-48d5-44f8-ae99-5e166ae0734f-GTY_1413703747.jpg?auto=webp&crop=5999,3375,x0,y305&format=pjpg&width=1200", "publishedAt": "2022-09-02T10:00:30Z", "content": "When 55-year-old Ken Pinkela was first navigating his coming out process as a gay man, the community he emerged into was no stranger to crisis.\r\nIn the throes of deadly HIV infections, gay men turned… [+9248 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Study says onion lowers blood sugar but then why are so many Indians diabetic still? - The Indian Express", "description": "Till we get details about the mechanism by which the onion extract brought about the blood glucose reduction, the desired amount of the effective nutrient needed to be ingested by a human and a sample is tested through human trials, it will be too hasty to dr…", "url": "https://indianexpress.com/article/lifestyle/health-specials/study-onion-lowers-blood-sugar-indians-diabetic-8127058/", "urlToImage": "https://images.indianexpress.com/2022/08/onion1200.jpg", "publishedAt": "2022-09-02T09:56:15Z", "content": "Should we always believe studies that gain traction in the West just because they go viral or do we contextualise them in the local scenario? This question follows a new study that has revealed that … [+3801 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "9 signs you're having a heart attack that you probably don't know - Insider", "description": "Chest pain is the most common heart attack symptom, but women are more likely to have additional signs, according to the American Heart Association.", "url": "https://www.insider.com/heart-attack-signs-symptoms-chest-pain-short-breath-tired-nausea-2022-9", "urlToImage": "https://i.insider.com/63108c1a3fe7c40019e4cf7a?width=1200&format=jpeg", "publishedAt": "2022-09-02T09:41:58Z", "content": "Common and lesser-known heart attack symptoms, including those more likely to affect women, have been highlighted in a report by the American Heart Association (AHA).\r\nThe review, published in the jo… [+2510 chars]"}]}