{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Inflammation Triggers Repetitive Behaviors in ASD and OCD - Neuroscience News", "description": "New research reveals that chronic brain inflammation can directly lead to repetitive behaviors, often seen in conditions like autism spectrum disorder (ASD) and obsessive-compulsive disorder (OCD).", "url": "https://neurosciencenews.com/inflammation-asd-ocd-behavior-28978/", "urlToImage": "https://neurosciencenews.com/files/2025/05/inflammation-behavior-OCD-ASD-neurosciencce.jpg", "publishedAt": "2025-05-19T21:04:23Z", "content": "Summary: New research reveals that chronic brain inflammation can directly lead to repetitive behaviors, often seen in conditions like autism spectrum disorder (ASD) and obsessive-compulsive disorder… [+5712 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Insomnia Isn’t Just About Sleep,Your Personality Plays a Role - Neuroscience News", "description": "People with high levels of neuroticism—a trait linked to emotional instability—were much more likely to experience sleep disturbances.", "url": "https://neurosciencenews.com/insomnia-personality-neuroticism-28977/", "urlToImage": "https://neurosciencenews.com/files/2025/05/personality-insomnia-neuroscience.jpg", "publishedAt": "2025-05-19T20:27:28Z", "content": "Summary: Certain personality traits significantly influence the risk of developing insomnia. People with high levels of neuroticisma trait linked to emotional instabilitywere much more likely to expe… [+11992 chars]"}, {"source": {"id": null, "name": "TODAY"}, "author": "Maura Hohman", "title": "A Dietitian's Go-To Snack Combo For An Energy Burst After A Workout - TODAY.com", "description": "Eating a carb along with your protein can help your muscles recover faster and give you more energy after workouts, a dietitian says", "url": "https://www.today.com/health/diet-fitness/dietitian-tip-carbs-protein-muscle-recovery-rcna207356", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/rockcms/2025-05/ask-a-dietitian-blue-24470a.png", "publishedAt": "2025-05-19T19:12:27Z", "content": "Lagging in energy a little bit after a workout isn't uncommon, nor is feeling a little lethargic at the gym when you exercised rigorously the day before. But you don't have to feel this way, says reg… [+2859 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Sleeping 8 Hours Every Night Can Actually Worsen Your Heart Health — If You’re Doing This - Study Finds", "description": "People with irregular sleep schedules had a 26% higher risk of major cardiovascular events, even if they got the recommended amount of sleep.", "url": "https://studyfinds.org/irregular-sleep-risk-heart-disease/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2024/12/shutterstock_1608735547.jpg", "publishedAt": "2025-05-19T18:04:41Z", "content": "Getting enough sleep doesn't ensure heart health without having a regular sleep schedule. (Maridav/Shutterstock)\r\n<ul><li>People with irregular sleep schedules had a 26% higher risk of major cardiova… [+9645 chars]"}, {"source": {"id": null, "name": "TODAY"}, "author": "Meghan Holohan", "title": "Boy, 15, With Melanoma Says Doctors Dismissed Early Symptom as Sign of Puberty - TODAY.com", "description": "Referee points out spot to wrestler, 15. A dermatologists diagnoses the teen with Stage 3 melanoma. Immunotherapy, surgery treats melanoma that has spread.", "url": "https://www.today.com/health/disease/boy-15-melanoma-says-doctors-dismissed-early-symptom-sign-puberty-rcna207285", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/rockcms/2025-05/sam-gee-melanoma-mc-250519-04-974a2c.jpg", "publishedAt": "2025-05-19T17:33:59Z", "content": "Before a wrestling tournament in early 2020, Samuel Gee, then 15, underwent a skin check to make sure he didnt have ringworm that could spread to others. During the inspection, a referee pointed some… [+6549 chars]"}, {"source": {"id": null, "name": "PennLive"}, "author": "Sean Adams | sadams@pennlive.com", "title": "Common energy drink, protein powder ingredient linked to cancer in new study - PennLive.com", "description": "According to researchers, the energy benefits may cause the acceleration of leukemia by fueling the cancerous cells.", "url": "https://www.pennlive.com/health/2025/05/common-energy-drink-protein-powder-ingredient-linked-to-cancer-in-new-study.html", "urlToImage": "https://www.pennlive.com/resizer/v2/OKCEPI35DRFZLMC4R346RAIQE4.jpg?auth=bb3cff8101c6bf8481ce0ea4371a3b0638db70b81ad80878e815b924579baa8f&width=1280&quality=90", "publishedAt": "2025-05-19T17:25:00Z", "content": "A new study has drawn links between cancer and a common ingredient in energy drinks and dietary supplements. \r\nMens Journal reports that the new study, published in Nature, has linked the ingredient … [+1080 chars]"}, {"source": {"id": null, "name": "The-independent.com"}, "author": "Amber Raiken", "title": "TikTok’s protein obsession has us lacking another key nutrient - The Independent", "description": "Amid the protein craze on social media, are we neglecting the need for fiber in our diets? Amber Raiken speaks with dietitians and nutritionists about how protein has dominated the conversation too much", "url": "https://www.the-independent.com/life-style/food-and-drink/protein-drink-fiber-sources-diet-healthy-b2753889.html", "urlToImage": "https://static.the-independent.com/2025/05/07/21/23/iStock-1644746219.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800", "publishedAt": "2025-05-19T15:38:00Z", "content": "Your support helps us to tell the story\r\nFrom reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financia… [+5129 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Rewiring Memory: A New Model That Learns Like a Human Brain - Neuroscience News", "description": "A new memory model called Input-Driven Plasticity (IDP) offers a more human-like explanation for how external stimuli help us retrieve memories, building on the foundations of the classic Hopfield network.", "url": "https://neurosciencenews.com/ai-memory-idp-28975/", "urlToImage": "https://neurosciencenews.com/files/2025/05/AI-memory-neuroscience-human.jpg", "publishedAt": "2025-05-19T14:59:56Z", "content": "Summary: A new memory model called Input-Driven Plasticity (IDP) offers a more human-like explanation for how external stimuli help us retrieve memories, building on the foundations of the classic Ho… [+8587 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Low Newborn Vitamin D Linked to Autism and Schizophrenia - Neuroscience News", "description": "Babies born with low vitamin D levels are more likely to develop mental disorders like ADHD, schizophrenia, and autism later in life.", "url": "https://neurosciencenews.com/vitamin-d-asd-newborns-28974/", "urlToImage": "https://neurosciencenews.com/files/2025/05/ASD-vitamin-d-neuroscience.jpg", "publishedAt": "2025-05-19T14:33:50Z", "content": "Summary: Babies born with low vitamin D levels are more likely to develop mental disorders like ADHD, schizophrenia, and autism later in life. Researchers analyzed data from over 71,000 individuals, … [+6649 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Can vitamin B12 damage kidneys? 5 things to know before regularly taking this supplement - Times of India", "description": "Vitamin B12 gets hailed as a magic nutrient; a booster for energy, brain function, and overall health. It’s present in multivitamins, injected in clinics, and recommended generously. But somewhere in the middle of all this praise, a quiet concern goes unnotic…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/can-vitamin-b12-damage-kidneys-5-things-to-know-before-regularly-taking-this-supplement/photostory/121268747.cms", "urlToImage": "https://static.toiimg.com/photo/121268880.cms", "publishedAt": "2025-05-19T14:30:00Z", "content": "In recent years, B12 injections have become trendy. Theyre advertised for fatigue, weight loss, and even skin glow. But when used without medical guidance, they can quietly stress the kidneys especia… [+511 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "The #1 Habit You Should Start If You Have IBS, According to Dietitians - EatingWell", "description": "Slowing down when you eat is the top habit dietitians recommend for managing IBS. Read to see how this strategy and others can improve IBS symptoms.", "url": "https://www.eatingwell.com/habit-you-should-start-if-you-have-ibs-11736761", "urlToImage": "https://www.eatingwell.com/thmb/X5ZXfOrSu6iCnBQwI7-hyHBeSvY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1-Habit-You-Should-Start-If-You-Have-IBS-2ffe20b7c11540759466edb7200dc2ed.jpg", "publishedAt": "2025-05-19T14:01:21Z", "content": "A diagnosis of irritable bowel syndrome (IBS) may have you flipping your diet upside down trying to manage symptoms. Too many people with IBS start by excluding foods, says Kim Kulp, RDN. Many try cu… [+5124 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Amy McGorry", "title": "Simple dietary change could lower your risk of colon cancer, study says - AOL.com", "description": "A recent study found that consuming walnuts can reduce inflammation markers and may lower the risk of colon cancer. The study author spoke to Fox News Digital.", "url": "https://www.foxnews.com/food-drink/simple-dietary-change-could-lower-your-risk-colon-cancer-study", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/05/walnuts-1.jpg", "publishedAt": "2025-05-19T13:47:17Z", "content": "Walnuts may lower your risk of colon cancer and reduce overall inflammation in the body, according to a study recently published in the journal Cancer Prevention Research.  \r\n\"The study shows that a … [+4602 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Reading Fiction Boosts Empathy and Fights Loneliness - Neuroscience News", "description": "While AI companions are marketed as a fix for loneliness, research shows that reading offers far more meaningful benefits.", "url": "https://neurosciencenews.com/reading-emapthy-loneliness-28972/", "urlToImage": "https://neurosciencenews.com/files/2025/05/reading-loneliness-neurosciencce.jpg", "publishedAt": "2025-05-19T13:34:28Z", "content": "Summary: While AI companions are marketed as a fix for loneliness, research shows that reading offers far more meaningful benefits. Reading fiction can foster social connection, reduce stress, enhanc… [+6133 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Therapy Rewires the Brain to Ease Chronic Pain - Neuroscience News", "description": "Chronic pain affects one in five adults, and medication alone doesn’t always offer relief. A new review reveals that psychological treatments—particularly cognitive behavioral therapy (CBT)—can reduce pain through measurable changes in the brain.", "url": "https://neurosciencenews.com/therapy-pain-brain-28971/", "urlToImage": "https://neurosciencenews.com/files/2025/05/pain-therapy-brain-neuroscience.jpg", "publishedAt": "2025-05-19T12:54:07Z", "content": "Summary: Chronic pain affects one in five adults, and medication alone doesnt always offer relief. A new review reveals that psychological treatmentsparticularly cognitive behavioral therapy (CBT)can… [+6851 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sound-Powered Microbubbles Halt Brain Lesion Growth - Neuroscience News", "description": "A new, noninvasive technique using focused ultrasound and microbubbles has halted the growth of cerebral cavernous malformations (CCMs) in mice, offering hope for safer treatment options.", "url": "https://neurosciencenews.com/ccms-focused-ultrasound-neurology-28970/", "urlToImage": "https://neurosciencenews.com/files/2025/05/focused-ultrasound-brain-lesions-neuroscience.jpg", "publishedAt": "2025-05-19T12:38:13Z", "content": "Summary: A new, noninvasive technique using focused ultrasound and microbubbles has halted the growth of cerebral cavernous malformations (CCMs) in mice, offering hope for safer treatment options. CC… [+8515 chars]"}, {"source": {"id": null, "name": "News12.com"}, "author": null, "title": "Growing number of patients claim Ozempic can come with irreversible vision loss - News 12", "description": "A growing number of patients claim Ozempic can come with a terrifying side effect: Irreversible vision loss.", "url": "https://newjersey.news12.com/growing-number-of-patients-claim-ozempic-can-come-with-irreversible-vision-loss", "urlToImage": "https://images-cf.news12static.com/3kqcuzntcg31/25JOTXzKlb6ivG4OrY499k/dcd0219fda49f1e8cc98ed567e760e73/53970a57-0a10-48be-8519-5d75e4cdded2.jpg?fit=thumb&w=600&h=340&q=80&fm=webp", "publishedAt": "2025-05-19T10:20:29Z", "content": "Topics you care about, straight to your inbox"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Scientists finds altered attention-related brain connectivity in youth with anxiety - PsyPost", "description": "A large neuroimaging study has found that generalized anxiety disorder in youth is linked to increased connectivity in brain circuits involved in attention and emotion, and that these patterns may change with symptom remission.", "url": "https://www.psypost.org/scientists-finds-altered-attention-related-brain-connectivity-in-youth-with-anxiety/", "urlToImage": "https://www.psypost.org/wp-content/uploads/2025/05/brain-8.jpg", "publishedAt": "2025-05-19T10:14:12Z", "content": "A new study published in the journal Biological Psychiatry: Cognitive Neuroscience and Neuroimaging highlights how brain connectivity patterns differ in children and adolescents diagnosed with genera… [+8624 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Luiz Pessoa", "title": "How the human brain is like a murmuration of starlings - Aeon", "description": "The brain is much less like a machine than it is like the murmurations of a flock of starlings or an orchestral symphony", "url": "https://aeon.co/essays/how-the-human-brain-is-like-a-murmuration-of-starlings", "urlToImage": "https://images.aeonmedia.co/images/adc1d977-9800-4e87-ba93-2a799af95711/essay-final-gettyimages-1455831463.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-05-19T10:04:16Z", "content": "When thousands of starlings swoop and swirl in the evening sky, creating patterns called murmurations, no single bird is choreographing this aerial ballet. Each bird follows simple rules of interacti… [+24732 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Paul Von Zielbauer", "title": "Just 5 minutes a day of these exercises can sharpen your brain as you age - Yahoo", "description": "A recent study found that 'huff-and-puff' movements, like running or lap swimming, were associated with better brain functions including information...", "url": "https://www.yahoo.com/lifestyle/just-5-minutes-day-exercises-100000301.html", "urlToImage": "https://media.zenfs.com/en/la_times_articles_853/18a154f6e11a1b922fba896a378f113c", "publishedAt": "2025-05-19T10:00:00Z", "content": "(Photo illustration by Jim Cooke / photos by Getty Images)\r\nExercise has long been linked with stronger brains and reduced risk of dementia and other cognitive diseases. But new research suggests tha… [+5711 chars]"}, {"source": {"id": null, "name": "KVUE.com"}, "author": "Isabella Basco", "title": "'I was scared to death' | Wimberley resident recalls fox attack inside her home - KVUE", "description": "Linda Hasselberg shared her experience after a rabid fox entered her home and attacked her dogs.", "url": "https://www.kvue.com/article/news/local/fox-attack-wimberley-texas-home-dogs/269-5392df47-a33e-4469-adec-96c340c409e9", "urlToImage": "https://media.kvue.com/assets/KVUE/images/22ed2657-e84e-4606-95ea-4faf9f8ebbcb/20250519T103704/22ed2657-e84e-4606-95ea-4faf9f8ebbcb_1140x641.jpg", "publishedAt": "2025-05-19T09:27:00Z", "content": "WIMBERLEY, Texas \"Freaky Friday\" is how Wimberley resident Linda Hasselberg describes Friday, May 9. She said she had opened the door to let out her dogs, Chico and Mindy, when a fox entered her home… [+1841 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Reveals 56 Modifiable Risk Factors for Sudden Cardiac Arrest - SciTechDaily", "description": "A groundbreaking study identifies the most influential modifiable non-clinical risk factors for enhancing heart health. A new study has identified 56 non-clinical risk factors associated with sudden cardiac arrest (SCA), encompassing lifestyle behaviors, phys…", "url": "https://scitechdaily.com/?p=473510", "urlToImage": "https://scitechdaily.com/images/Anatomy-Human-Heart-Man-Computer-Illustration.jpg", "publishedAt": "2025-05-19T09:06:53Z", "content": "A new study reveals that over half of sudden cardiac arrest (SCA) cases could be prevented by addressing modifiable non-clinical risk factors, including lifestyle choices, environmental conditions, a… [+6604 chars]"}, {"source": {"id": null, "name": "Massgeneralbrigham.org"}, "author": null, "title": "Don’t Hit Snooze on New Research About Waking Up Each Morning - Mass General Brigham", "description": "Sleep experts recommend against snoozing after a wake-up alarm, but a study led by researchers at Mass General Brigham shows the practice is common, with more than 50% of sleep sessions logged ending in a snooze alarm and users spending 11 minutes on average …", "url": "https://www.massgeneralbrigham.org/en/about/newsroom/press-releases/dont-hit-snooze-on-new-research-about-waking-up-each-morning", "urlToImage": null, "publishedAt": "2025-05-19T09:03:42Z", "content": "&lt;b&gt;Sleep experts recommend against snoozing after a wake-up alarm, but a study led by researchers at Mass General Brigham shows the practice is common, with more than 50% of sleep sessions logg… [+8427 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Barry Gordemer", "title": "Want to cut back on meat without going vegetarian? Then mostly meatless cooking might be right for you - NPR", "description": "Be prepared to be fooled. A new cookbook from America's Test Kitchen features mostly meatless recipes that taste, look and feel pretty meaty.", "url": "https://www.npr.org/2025/05/19/nx-s1-5354793/dan-souza-mostly-meatless", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2500x1406+0+572/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2b%2Fc3%2F3d88be714ab19eaa43c48bdd542f%2Fmushroom-cropped.jpg", "publishedAt": "2025-05-19T09:00:00Z", "content": "Eating healthy sounds great, but cutting back on meat, let alone going vegetarian is way easier said than done.\r\nBut the road to healthy eating doesn't have to include dramatic changes or big sacrifi… [+2695 chars]"}, {"source": {"id": null, "name": "Heraldtimesonline.com"}, "author": "Carol Kugler", "title": "'Tons' of ticks are being found all over Indiana. Here's which ones can make you sick - The Herald-Times", "description": "Protect yourself from ticks, caution health experts, to all Hoosiers outside in their yards or hiking in the woods.", "url": "https://www.heraldtimesonline.com/story/news/regional/2025/05/19/ticks-abundant-in-indiana-transmitting-new-diseases-illnesses-to-people/83520299007/", "urlToImage": "https://www.heraldtimesonline.com/gcdn/authoring/authoring-images/2024/06/01/USAT/73940241007-lonestartick-16-x-91.jpeg?crop=2047,1151,x0,y0&width=2047&height=1151&format=pjpg&auto=webp", "publishedAt": "2025-05-19T08:54:03Z", "content": "<ul><li>Ticks are prevalent in Indiana, but reported illnesses remain low.</li><li>Nymph stage ticks are currently the most common, posing a higher risk of disease transmission due to their small siz… [+9865 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "MIKE STOBBE, JONEL ALECCIA", "title": "The US hasn't seen a human bird flu case in 3 months. Experts are wondering why - Medical Xpress", "description": "Health officials are making a renewed call for vigilance against bird flu, but some experts are puzzling over why reports of new human cases have stopped.", "url": "https://medicalxpress.com/news/2025-05-hasnt-human-bird-flu-case.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-us-hasnt-seen-a-hu.jpg", "publishedAt": "2025-05-19T08:50:14Z", "content": "Health officials are making a renewed call for vigilance against bird flu, but some experts are puzzling over why reports of new human cases have stopped.\r\nHas the search for cases been weakened by g… [+6718 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Even a Few Meals High in Saturated Fats Can Cause Inflammation - Technology Networks", "description": "A WEHI-led study has become the first in the world to unravel the immediate effects of a high-fat diet on our gut health. Researchers were able to detect microscopic changes to the gut health and function in mice even after a few high-fat meals.", "url": "https://www.technologynetworks.com/immunology/news/even-a-few-meals-high-in-saturated-fats-can-cause-inflammation-399798", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/399798/even-a-few-meals-high-in-saturated-fats-can-cause-inflammation-399798-640x360.jpg?cb=20250519", "publishedAt": "2025-05-19T08:07:07Z", "content": "In the study, with senior author and WEHI Laboratory Head Professor Stephen Nutt, researchers also found short-term exposure to high-fat diets can reduce the production of IL-22, a crucial protein th… [+1260 chars]"}, {"source": {"id": null, "name": "Ourworldindata.org"}, "author": "Saloni Dattani, Fiona Spooner", "title": "Measles vaccines save millions of lives each year - Our World in Data", "description": "Measles once killed millions every year. Vaccines changed this, preventing disease, long-term immune damage, and deadly outbreaks.", "url": "https://ourworldindata.org/measles-vaccines-save-lives", "urlToImage": "https://ourworldindata.org/cdn-cgi/imagedelivery/qLq-8BTgXU8yG0N6HnOy8g/5f66d86d-91f5-4839-caa7-d6c5ce64e300/public", "publishedAt": "2025-05-19T06:24:38Z", "content": "Measles vaccines save millions of lives each year\r\nMeasles once killed millions every year. Vaccines changed this, preventing disease, long-term immune damage, and deadly outbreaks.\r\nMeasles used to … [+14769 chars]"}, {"source": {"id": null, "name": "Fitandwell.com"}, "author": "Sam Rider", "title": "Don’t neglect these two things if you want to maintain your mobility, strength and independence as you age, says a certified trainer - Fit&Well", "description": "Act today to look after tomorrow", "url": "https://www.fitandwell.com/exercise/cardio-strength-workouts/dont-neglect-these-two-things-if-you-want-to-maintain-your-mobility-strength-and-independence-as-you-age-says-a-certified-trainer", "urlToImage": "https://cdn.mos.cms.futurecdn.net/A3sGfRV6zKXvwUqCXfjWDF.jpg", "publishedAt": "2025-05-19T05:00:00Z", "content": "Nobody likes to think about aging, but it’s a fact of life.\r\nWith every passing year from your mid-40s, muscle mass tends to become harder to maintain, bones weaken, joints stiffen and cardiovascular… [+3739 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Jane McGuire", "title": "I’ve walked 5,000 steps every day for 5 years — here’s what it’s done for my physical and mental health - Tom's Guide", "description": "It’s a game changer.", "url": "https://www.tomsguide.com/wellness/fitness/ive-walked-5-000-steps-every-day-for-5-years-heres-what-its-done-for-my-physical-and-mental-health", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cv8LypV5W9oT67RYms8eE9.jpg", "publishedAt": "2025-05-19T04:30:00Z", "content": "I’ve walked 5,000 steps every single morning for the last five years, and it’s changed my life. Some mornings I’ve walked alone, other mornings I’ve walked with my spaniel, and more recently, I’ve be… [+4989 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Expert Reveals a Drug-Free Way to Mimic The Effects of Ozempic - ScienceAlert", "description": "Despite the popularity of semaglutide drugs like Ozempic and Wegovy for weight loss, surveys suggest that most people still prefer to lose weight without using medications.", "url": "https://www.sciencealert.com/expert-reveals-a-drug-free-way-to-mimic-the-effects-of-ozempic", "urlToImage": "https://www.sciencealert.com/images/2025/05/woman_eating_breakfast_header.jpg", "publishedAt": "2025-05-19T03:49:52Z", "content": "Despite the popularity of semaglutide drugs like Ozempic and Wegovy for weight loss, surveys suggest that most people still prefer to lose weight without using medications.\r\nFor those preferring a dr… [+6027 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETimes.in", "title": "5 vegetarian foods that lower bad cholesterol (LDL) levels naturally - Times of India", "description": "A rise in bad cholesterol (LDL) in the arteries leads to plaque formation, reduced blood flow, and increased risk of heart disease and stroke. And as per experts, while it might be genetic, our daily lifestyle and eating habits also play a role in it. Hence, …", "url": "https://timesofindia.indiatimes.com/life-style/food-news/5-vegetarian-foods-that-lower-bad-cholesterol-ldl-levels-naturally/photostory/121170575.cms", "urlToImage": "https://static.toiimg.com/photo/121170582.cms", "publishedAt": "2025-05-19T03:44:00Z", "content": "Berries are great for naturally reducing bad cholesterol (LDL). These tiny, vibrant fruits are full of soluble fiber, antioxidants, and polyphenols, all of which help protect your heart and lower LDL… [+632 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "The US Just Approved The First Blood Test For Alzheimer's Disease - ScienceAlert", "description": "The United States on Friday approved the first blood test for Alzheimer's, a move that could help patients begin treatment earlier with newly approved drugs that slow the progression of the devastating neurological disease.", "url": "https://www.sciencealert.com/the-us-just-approved-the-first-blood-test-for-alzheimers-disease", "urlToImage": "https://www.sciencealert.com/images/2022/11/BloodVialHeldByGlovedFingers.jpg", "publishedAt": "2025-05-19T01:52:35Z", "content": "The United States on Friday approved the first blood test for Alzheimer's, a move that could help patients begin treatment earlier with newly approved drugs that slow the progression of the devastati… [+2631 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Isadora Baum", "title": "6 Higher-Sodium Foods That Are Actually Good for You - AOL.com", "description": "Yes, you can enjoy saltier foods in moderation.", "url": "https://www.eatingwell.com/higher-sodium-foods-that-are-good-for-you-11735405", "urlToImage": "https://s.yimg.com/cv/apiv2/aolfp/images/og-image.png", "publishedAt": "2025-05-19T01:26:46Z", "content": "<ul><li>Sodium is an essential mineral thats beneficial when enjoyed in moderation.\r\n</li><li>Opt for high-sodium foods that are nutrient-dense and minimally processed, like nuts, olives, fermented f… [+7055 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Explained: People living closer to golf course have higher risk of Parkinson's disease - Times of India", "description": "A recent study reveals a significant link between living near golf courses and an increased risk of Parkinson's disease. Individuals residing within a", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/explained-people-living-closer-to-golf-course-have-higher-risk-of-parkinsons-disease/articleshow/121256761.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-121256756,width-1070,height-580,imgsize-73594,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-05-19T00:27:00Z", "content": null}, {"source": {"id": null, "name": "Parade"}, "author": "Ashley Broadwater", "title": "Why Your Hands and Feet Are Always Cold—and What Your Body’s Trying To Tell You - AOL.com", "description": "Several common conditions that have similar symptoms could be at play.", "url": "https://parade.com/health/why-your-hands-and-feet-are-always-cold", "urlToImage": "https://media.zenfs.com/en/aol_parade_744/1c5b397496f3acb7f1f9e512bed0ec2b", "publishedAt": "2025-05-19T00:25:48Z", "content": "Whether youre lying on the sofa, sitting at work or walking around outside, your hands and feet are always cold. Maybe your partner has commented on this, too, when they held your hand. Maybe youve n… [+5526 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "11 Best Pantry Staples for Healthy Aging, Recommended by Dietitians - EatingWell", "description": "What you eat can impact your longevity and quality of life. Learn about 11 pantry staples recommended by dietitians for healthy longevity.", "url": "https://www.eatingwell.com/best-pantry-staples-for-healthy-aging-11730036", "urlToImage": "https://www.eatingwell.com/thmb/6itgQiM4GR2I7Tj0HelxIDS5B5o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Tk-Best-Pantry-Staples-for-Longevity-95d3d8b05e114504ab9ef50edff5d352.jpg", "publishedAt": "2025-05-18T22:36:00Z", "content": "Pantry food items can make meal prep and planning more convenient, cost-effective and nutritious (when you have the right ingredients). What you eat regularly has a significant impact on your health.… [+8476 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Lauren David", "title": "If You Struggle With Frequent Bathroom Breaks, Consider Cutting These Foods And Drinks From Your Diet - BuzzFeed", "description": "You probably expected to see coffee on the list, but you may be surprised at the some of the others.", "url": "https://www.buzzfeed.com/laurendavid1/food-and-drinks-that-are-hard-on-your-bladder-sc", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2023-12/4/20/enhanced/06ffb1661d11/original-463-1701722935-2.jpg?crop=1245:830;0,0&resize=1250:830", "publishedAt": "2025-05-18T22:31:04Z", "content": "Although people might not often talk about peeing-related problems, there are lots of common bladder health issues.\r\nIncontinence (or leaky bladder) that accidentally loses urine when you dont want i… [+2428 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Durgesh Nandan Jha", "title": "Hospital superbug ‘eating’ medical plastics, devices & implants: Study - Times of India", "description": "India News: A new study reveals that Pseudomonas aeruginosa, a common hospital bacteria in India, can degrade medical-grade plastic. This bacteria breaks down mat", "url": "https://timesofindia.indiatimes.com/india/hospital-superbug-eating-medical-plastics-devices-implants-study/articleshow/121254815.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-121254813,width-1070,height-580,imgsize-1567634,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-05-18T20:29:00Z", "content": "12 hill stations in North India perfect for summer vacations"}, {"source": {"id": null, "name": "Newser"}, "author": "Jenn Gidman", "title": "In US, 1 in 4 Kids Has Parent Struggling With Addiction - Newser", "description": "New study links parental addiction to higher risks for children", "url": "https://www.newser.com/story/368631/in-us-1-in-4-kids-has-parent-struggling-with-addiction.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1610653-12-20250518153002.jpeg", "publishedAt": "2025-05-18T20:00:00Z", "content": "A new study in JAMA Pediatrics finds that nearly 19 million US children under the age of 18—about 1 in 4—live with at least one parent with a substance use disorder, a figure notably higher than earl… [+470 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Mother’s childhood trauma linked to emotional and behavioral issues in her children, study finds - PsyPost", "description": "A recent study suggests that childhood trauma doesn’t end with the individual—it can influence the next generation. Maternal adversity was linked to children’s conduct, emotions, and cognition through economic strain, depression, relationship conflict, and pa…", "url": "https://www.psypost.org/mothers-childhood-trauma-linked-to-emotional-and-behavioral-issues-in-her-children-study-finds/", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/08/sad-mother-with-child.jpg", "publishedAt": "2025-05-18T18:01:22Z", "content": "A new longitudinal study published in the Journal of Child Psychology and Psychiatry provides compelling evidence that a mothers exposure to adversity in childhood can influence the emotional, behavi… [+6860 chars]"}, {"source": {"id": null, "name": "Parade"}, "author": "Jocelyn Solis-Moreira", "title": "You Should *Never* Leave This Item in the Shower, Dermatologists Warn - AOL.com", "description": "It's a common mistake people make.", "url": "https://parade.com/health/never-leave-this-item-in-the-shower-according-to-dermatologists", "urlToImage": "https://media.zenfs.com/en/aol_parade_744/994b96b4d64762b53517af7bee557251", "publishedAt": "2025-05-18T17:50:00Z", "content": "Most people don't think twice about keeping shower items in the bathtub or in a shower caddy. Which makes sense, because who really wants to step out of the shower halfway through to grab a bar of so… [+2817 chars]"}, {"source": {"id": null, "name": "Archaeologymag.com"}, "author": "Dario Radley", "title": "Viking age DNA reveals 9,000-year-old HIV-resistant gene originating near the Black Sea - Archaeology News Online Magazine", "description": "Ancient DNA reveals the origin of a rare gene mutation that protects against HIV, tracing back to a person near the Black Sea 9,000 years ago", "url": "https://archaeologymag.com/2025/05/viking-age-dna-reveals-9000-year-old-hiv-resistant-gene/", "urlToImage": "https://archaeologymag.com/wp-content/uploads/viking-dna-reveals-hiv-resistant-gene-1.jpg", "publishedAt": "2025-05-18T17:03:48Z", "content": "A recent study published last year in the journal Cell has identified the ancient origins of a genetic mutation that confers resistance to HIV, and how it first appeared in an individual who lived ne… [+3727 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "etimes.in", "title": "10 benefits of doing 20 squats every morning - Times of India", "description": "Beginning your day with a mere 20 squats can improve strength, mood, and overall health. This simple exercise engages several muscles, is good for the heart, and improves daily functioning. Let us look at the benefits of doing 20 squats daily.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/10-benefits-of-doing-20-squats-every-morning/photostory/120930292.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120930767,imgsize-854061,width-900,height-1200,resizemode-6/120930767.jpg", "publishedAt": "2025-05-18T16:28:00Z", "content": "Squats also strengthen the hip, lower back, and core muscles, which enhances posture. This increased muscular support enables a more stable, upright posture, reduces slouching, and assists in alignin… [+11 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Rich Juzwiak", "title": "A Key Feature of My Boyfriend’s Appearance Turns Me Off. He Refuses to Alter It. - Slate Magazine", "description": "I don't love having my genitals abraded.", "url": "https://slate.com/advice/2025/05/beard-sex-advice-shave-facial-hair-boyfriend-libido.html", "urlToImage": "https://compote.slate.com/images/f53c3e29-7944-4b06-a52c-7b1ceb957f12.gif?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2025-05-18T16:00:00Z", "content": "How to Do It is Slates sex advice column. Have a question? Send it to Stoya and Rich here. Its anonymous!\r\nDear How to Do It,\r\nMy boyfriend and I are at odds because he has grown out his beard and I … [+8761 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "The #1 Nutrient You Should Be Eating to Reduce Your Skin Cancer Risk, According to a Dermatologist - EatingWell", "description": "Antioxidants work in multiple ways to reduce skin cancer risk. Learn how, plus easy ways to get the antioxidants you need for healthy skin.", "url": "https://www.eatingwell.com/best-nutrient-to-reduce-skin-cancer-risk-11736017", "urlToImage": "https://www.eatingwell.com/thmb/Cg5L9GXdw_i_4wGKciAysUmJsdY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/The-1-Nutrient-You-Should-Be-Eating-to-Reduce-Your-Skin-Cancer-Risk-According-to-a-Dermatologist-c7845c781c7a4b1ea715d8655c9afdaa.jpg", "publishedAt": "2025-05-18T14:45:00Z", "content": "Spending time outside can boost your mood, promote better sleep and support your immune system (plus, its free!). The only drawback is that outdoor time also exposes you to the suns skin-damaging UV … [+5295 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Light Exercise Boosts Memory via Dopamine and Noradrenaline - Neuroscience News", "description": "New research reveals that even light exercise, like jogging or yoga, activates key neurotransmitter systems that enhance memory by stimulating the hippocampus.", "url": "https://neurosciencenews.com/light-exercise-memory-dopamine-28966/", "urlToImage": "https://neurosciencenews.com/files/2025/05/exercise-synaptic-plasticity-neurosciecnce.jpg", "publishedAt": "2025-05-18T14:32:56Z", "content": "Summary: New research reveals that even light exercise, like jogging or yoga, activates key neurotransmitter systems that enhance memory by stimulating the hippocampus. In a rat model mimicking human… [+5922 chars]"}, {"source": {"id": null, "name": "WSET"}, "author": "Sam Becker", "title": "Fox tests positive for rabies in Amherst County, health officials urge caution - WSET", "description": "The Amherst County Health Department has received confirmation that a fox tested positive for rabies.", "url": "https://wset.com/news/local/fox-tests-positive-for-rabies-in-amherst-county-health-officials-urge-caution-may-2025", "urlToImage": "https://wset.com/resources/media/77105537-538e-490d-8d98-e9f10db90c3e-large16x9_FOXCDC.jpg?1597059620539", "publishedAt": "2025-05-18T14:04:19Z", "content": "AMHERST COUNTY, Va. (WSET) The Amherst County Health Department has received confirmation that a fox tested positive for rabies.\r\nAccording to the Central Virginia Health District, the fox was submit… [+1542 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Ingrid Fadelli", "title": "Glial cells may play key role in managing sleep and metabolism, fruit fly study suggests - Medical Xpress", "description": "Homeostasis is the ability of living organisms to maintain stable internal conditions, such as temperature, hydration and blood sugar levels, irrespective of any changes in their surroundings. Homeostatic mechanisms also regulate behaviors that are central to…", "url": "https://medicalxpress.com/news/2025-05-glial-cells-play-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-sheds-new-light-5.jpg", "publishedAt": "2025-05-18T13:40:01Z", "content": "Homeostasis is the ability of living organisms to maintain stable internal conditions, such as temperature, hydration and blood sugar levels, irrespective of any changes in their surroundings. Homeos… [+4386 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Mark Travers", "title": "3 Signs Your Partner Is A Keeper — By A Psychologist - Forbes", "description": "If your partner displays even just one (let alone all) of these three behaviors, you’ve definitely got a good thing going.", "url": "https://www.forbes.com/sites/traversmark/2025/05/18/3-signs-your-partner-is-a-keeper---by-a-psychologist/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6829aff036c8dc84586f0cc0/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-05-18T13:30:52Z", "content": "If your partner displays even just one (let alone More\r\n all) of these three behaviors, youve definitely got a good thing going.Less\r\ngetty\r\nIn too many areas of life, were inclined to search for neg… [+6921 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Common Parasite Rips The Face From Your Cells to Wear as a Disguise - ScienceAlert", "description": "New research has shown how the parasitic amoeba Entamoeba histolytica takes bites from your cells to use as a disguise, hiding them from the immune system.", "url": "https://www.sciencealert.com/common-parasite-rips-the-face-from-your-cells-to-wear-as-a-disguise", "urlToImage": "https://www.sciencealert.com/images/2025/05/parasite-wears-your-cells-as-a-disguise.jpg", "publishedAt": "2025-05-18T13:01:39Z", "content": "New research has shown how the parasitic amoeba Entamoeba histolytica takes bites from your cells to use as a disguise, hiding them from the immune system.\r\nEntering the body via contaminated food or… [+3891 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Type 2 Diabetes Linked to Brain Thinning - Neuroscience News", "description": "A new study reveals that type 2 diabetes is associated with thinning of the brain’s cortex in older adults, particularly in regions responsible for memory and cognition.", "url": "https://neurosciencenews.com/diabetes-brain-thinning-28961/", "urlToImage": "https://neurosciencenews.com/files/2025/05/brain-thinning-diabetes-neuroscience.jpg", "publishedAt": "2025-05-18T12:58:53Z", "content": "Summary: A new study reveals that type 2 diabetes is associated with thinning of the brains cortex in older adults, particularly in regions responsible for memory and cognition. Using brain scans fro… [+7065 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Parents’ Age, Ancestry, and Habits Shape New DNA Mutations - Neuroscience News", "description": "A massive genomic study has revealed that parental age, ancestry, and smoking habits subtly influence the number of new genetic mutations (de novo mutations) passed from parents to children.", "url": "https://neurosciencenews.com/parents-lifestyle-ancestry-genetics-28960/", "urlToImage": "https://neurosciencenews.com/files/2025/05/genetics-ancestry-lifestyle-neurosciecnce.jpg", "publishedAt": "2025-05-18T12:36:24Z", "content": "Summary: A massive genomic study has revealed that parental age, ancestry, and smoking habits subtly influence the number of new genetic mutations (de novo mutations) passed from parents to children.… [+8904 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Kayla Blanton", "title": "Scientists Say This Common Appliance Increases Cancer Risk—and It May Be Lurking in Your Kitchen - Yahoo", "description": "A study linked gas stove usage to increased cancer risk, especially in children. Experts explain why they may increase cancer risk and how to protect...", "url": "https://www.prevention.com/health/health-conditions/a64758314/gas-stoves-increase-children-cancer-risk-study/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j2t1Us9M4tFm3WIu6thBsw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/hearst_prevention_66/2a23113aae652884796980c8d29f234b", "publishedAt": "2025-05-18T12:30:00Z", "content": "<ul><li>A new study explored the link between gas stove usage and cancer risk. \r\n</li><li>It found that gas stove usage without proper ventilation raises cancer risk in adults, but especially in chil… [+5584 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "Scientists '3D Print' Material Deep Inside The Body Using Ultrasound - ScienceAlert", "description": "Scientists in the US have created a way to 3D print materials inside the body using ultrasound.", "url": "https://www.sciencealert.com/scientists-3d-print-material-deep-inside-the-body-using-ultrasound", "urlToImage": "https://www.sciencealert.com/images/2025/05/3Dprintedmaterial.jpg", "publishedAt": "2025-05-18T12:01:37Z", "content": "Scientists in the US have created a way to 3D print materials inside the body using ultrasound. Tests in mice and rabbits suggest the technique could deliver cancer drugs directly to organs and repai… [+3555 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Amphetamine scrambles the brain's sense of time by degrading prefrontal neuron coordination - PsyPost", "description": "Researchers have found that amphetamine alters how the brain processes time, increasing variability in the activity of neurons that encode temporal information. The study provides insight into how the drug affects executive function and decision-making at the…", "url": "https://www.psypost.org/amphetamine-scrambles-the-brains-sense-of-time-by-degrading-prefrontal-neuron-coordination/", "urlToImage": "https://www.psypost.org/wp-content/uploads/2025/05/neurons-1.jpg", "publishedAt": "2025-05-18T12:00:53Z", "content": "A new study published in Neuropharmacology sheds light on how amphetamine, a stimulant often misused and prescribed to treat attention-related conditions, affects brain activity linked to executive c… [+9065 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Coventry mum's relief over 'brutally unfair' drug access - BBC", "description": "Phoebe wants other children to be able to have the same treatment for Batten disease as her daughter.", "url": "https://www.bbc.com/news/articles/c3rpnrng3zqo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7800/live/2ff516b0-3498-11f0-8947-7d6241f9fce9.jpg", "publishedAt": "2025-05-18T11:05:59Z", "content": "Josh Sandiford\r\nListen on BBC Sounds: Mum's relief over drug access\r\nA woman has said she feels \"massively relieved\" after being told her daughter will now have access to a life-enhancing drug indefi… [+2829 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Little-Know Tropical Virus Is Quietly Exploding Across Latin America — Scientists See Early Signs of Another Global Pandemic - The Daily Galaxy", "description": "A little-known tropical virus is spreading fast across Latin America, mimicking dengue and Zika. Thousands are already infected, but few have even heard its name. Scientists now warn it could be just the beginning.", "url": "https://dailygalaxy.com/2025/05/a-little-know-tropical-virus-is-quietly-exploding-across-latin-america-scientists-see-early-signs-of-another-global-pandemic/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Worker-fogging-residential-area-with-insecticides-to-kill-aedes-mosquito-carrier-of-dengue-virus.jpg", "publishedAt": "2025-05-18T11:05:00Z", "content": "A virus largely unknown outside scientific circles is spreading rapidly across parts of Latin America, drawing comparisons to Zika and dengue and prompting concern from epidemiologists. Known as the … [+4115 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Ashley Broadwater", "title": "Dietitians Share A Surprising Food That Can Help When You’re Sick - HuffPost", "description": "This kid-friendly favorite is healthy, hydrating and soothing.", "url": "https://www.huffpost.com/entry/dietitians-share-a-surprising-food-that-can-help-when-youre-sick-goog_l_68264abee4b029d8a6109dc2", "urlToImage": "https://img.huffingtonpost.com/asset/676315b01b00002500fe934a.jpeg?cache=nizIAGXcxY&ops=1200_630", "publishedAt": "2025-05-18T11:00:00Z", "content": "Surprise!\r\nWhen youre confined to your bed with the flu or feeling annoyed about a cough that wont go away, you may be more intentional about incorporating health-promoting foods (the ones you can st… [+5521 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Healthy diet in childhood linked to later first menstrual period - The Washington Post", "description": "Researchers assessed diets using a score based on a participants’ adherence to a healthy diet, and a score that identifies diets linked to inflammation.", "url": "https://www.washingtonpost.com/health/2025/05/18/healthy-diet-menstruation-inflammation/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CEGZ2F6ARLMHDMAE3Z6VMDZDCQ.jpg&w=1440", "publishedAt": "2025-05-18T10:32:19Z", "content": "Eating an unhealthy diet is tied to an earlier first period, a new analysis suggests.\r\nThe study linked a girls first menstrual period a milestone known as menarche to what she ate, showing ties betw… [+2308 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Chris Woolston", "title": "Matching mindfulness methods to anxiety symptoms may boost mental well-being, study finds - Medical Xpress", "description": "If you're anxious about work, finances, the state of the world, or anything else, you might try a moment of mindfulness. Paying close attention to the present moment without judgment—the basic idea behind all mindfulness techniques—can help calm anxiety and i…", "url": "https://medicalxpress.com/news/2025-05-mindfulness-methods-anxiety-symptoms-boost.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/mindful.jpg", "publishedAt": "2025-05-18T10:12:00Z", "content": "If you're anxious about work, finances, the state of the world, or anything else, you might try a moment of mindfulness. Paying close attention to the present moment without judgmentthe basic idea be… [+5899 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": null, "title": "Does your body need a parasite purge? Probably not - Salon.com", "description": "", "url": "https://www.salon.com/2025/05/18/does-your-body-need-a-parasite-purge-probably-not/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2025/05/woman_gut_health_parasites_gettyimages-1333123445.jpg", "publishedAt": "2025-05-18T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Real Simple"}, "author": "https://www.facebook.com/realsimple/", "title": "This Everyday Herb Has Major Anti-Inflammatory Benefits, Experts Say - Real Simple", "description": "Discover the everyday herb that has some serious anti-inflammatory benefits, according to nutrition experts.", "url": "https://www.realsimple.com/everyday-herb-anti-inflammatory-benefits-11734257", "urlToImage": "https://www.realsimple.com/thmb/fS4-4peoSd5PuwmlVBXxflGVMIs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/herbs-for-inflamation-GettyImages-1131640531-e1bb4a58249540719ced426f981cff0d.jpg", "publishedAt": "2025-05-18T09:01:00Z", "content": "If youre on a mission to reduce inflammation, youre not alone. Chronic inflammation is at the root of many health symptoms, including fatigue, joint pain, and stomach upsetjust to name a few examples… [+3881 chars]"}, {"source": {"id": null, "name": "Fitandwell.com"}, "author": "Sam Rider", "title": "I’m a personal trainer and whenever I lack motivation to exercise I do these three simple things to get back on track - Fit&Well", "description": "Make working out second nature and you’ll never miss a training session again", "url": "https://www.fitandwell.com/exercise/im-a-personal-trainer-and-whenever-i-lack-motivation-to-exercise-i-do-these-three-simple-things-to-get-back-on-track", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kLSk4VXrmQcg2ecpCDXdAg.jpg", "publishedAt": "2025-05-18T06:02:44Z", "content": "Jack Claxton has been at the sharp end of personal training for over a decade, yet even someone as well-versed in its benefits can occasionally lack the drive to exercise. “Motivation is huge,” says … [+3833 chars]"}]}