{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research: Eating Grapes Can Protect Against UV Damage to Skin - SciTechDaily", "description": "A recent study highlights the potential of grapes in providing photoprotection. A recent study published in the journal Antioxidants has shown that consuming grapes can protect against UV damage to the skin. The study participants who consumed 2 ¼ cups of gra…", "url": "https://scitechdaily.com/?p=245362", "urlToImage": "https://scitechdaily.com/images/Person-Holding-Grapes.jpg", "publishedAt": "2023-01-22T22:36:26Z", "content": "UV damage to the skin is caused by exposure to ultraviolet radiation from the sun or artificial sources such as tanning beds. UV radiation can cause a variety of skin problems, including sunburn, pre… [+3350 chars]"}, {"source": {"id": null, "name": "KOMO News"}, "author": "Danny Schmidt, KOMO News", "title": "Woman with measles was recently in Sea-Tac airport, Seattle Swedish - KOMO News", "description": "The health department of King County and Seattle is investigating a new case of measles.", "url": "https://komonews.com/news/local/king-county-seattle-measles-woman-confirmed-case-tacoma-international-airport-seatac-providence-swedish-hospital-doctor-first-hill-vaccine-vaccinated-investigation-symptoms", "urlToImage": "https://komonews.com/resources/media/e45e4aaa-5dd6-4326-a45a-1b54d08b72bd-large16x9_measles.jpg?1674415427087", "publishedAt": "2023-01-22T19:24:44Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify New Potential Benefits of Statins Beyond Lowering Cholesterol - SciTechDaily", "description": "Recent research links the cholesterol-lowering drugs to a lower risk of bleeding stroke. According to recent research individuals who use statins, a class of drugs that decrease cholesterol levels may have a decreased risk of an intracerebral hemorrhage. Intr…", "url": "https://scitechdaily.com/scientists-identify-new-potential-benefits-of-statins-beyond-lowering-cholesterol/", "urlToImage": "https://scitechdaily.com/images/Statins-Medicine-Pills.jpg", "publishedAt": "2023-01-22T17:17:40Z", "content": "Statins are a class of drugs that lower cholesterol levels in the blood. They work by blocking an enzyme in the liver that is responsible for producing cholesterol.\r\nRecent research links the cholest… [+3503 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Hannah Mcdonald", "title": "What you should eat BEFORE a morning work-out, according to an ex-marine turned fitness freak - Daily Mail", "description": "Morning workouts can leave you feeling energised, if you can be bothered to drag yourself to the gym. But what you eat before exercising can determine how much progress you make.", "url": "https://www.dailymail.co.uk/health/article-11640069/What-eat-morning-work-according-ex-marine-turned-fitness-freak.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/17/08/66653821-0-image-a-3_1673942835804.jpg", "publishedAt": "2023-01-22T16:15:07Z", "content": "Morning workouts can leave you feeling energised for the day, that is, if you can be bothered to drag yourself to the gym. \r\nBut what you eat before you break a sweat can determine how much progress … [+5722 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "World's fattest countries REVEALED in new interactive map - Daily Mail", "description": "The Pacific island of Nauru doesn't just top the chart for being one of the most luxurious holiday destinations. For data suggests it's actually the fattest country in the world.", "url": "https://www.dailymail.co.uk/health/article-11657927/Worlds-fattest-countries-REVEALED-new-interactive-map.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/20/17/66796757-0-image-a-30_1674236219927.jpg", "publishedAt": "2023-01-22T16:12:43Z", "content": "It's one of the world's most remote islands, home to picturesque beaches, golden sands and even an underground lake. \r\nYet the Pacific island of Nauru doesn't just top the chart for being one of the … [+4847 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "New research indicates signs of depression can be detected in speech patterns - PsyPost", "description": "New research published in BMC Psychiatry finds that changes in speech like speed, pitch, number of pauses, and intensity can predict who may report more depressive symptoms. The research team found they could predict with 93% accuracy who would have scores on…", "url": "https://www.psypost.org/2023/01/new-research-indicates-signs-of-depression-can-be-detected-in-speech-patterns-65196", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/01/depressed-woman-sad.jpg", "publishedAt": "2023-01-22T15:04:34Z", "content": "New research published in BMC Psychiatry finds that changes in speech like speed, pitch, number of pauses, and intensity can predict who may report more depressive symptoms. The research team found t… [+3464 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Fenit Nirappil", "title": "Covid, flu, RSV declining in hospitals as 'tripledemic' threat fades - The Washington Post", "description": "The third pandemic winter is nowhere near as bad as the previous two, likely because most Americans have some immunity from shots and previous infections.", "url": "https://www.washingtonpost.com/health/2023/01/22/covid-declining-flu-rsv-tripledemic/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6YTLS2GEWQK2YMFO5JBEZVVRRQ.JPG&w=1440", "publishedAt": "2023-01-22T14:00:00Z", "content": "Comment on this story\r\nSo manypatients sick with RSV had inundated Connecticut Childrens Medical Center that they had to be treated in hallways and playrooms. Facing their busiest season in memory la… [+6871 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Natural Immunity Superior to Vaccination Against Infection in Children: Study - The Epoch Times", "description": "Children with natural immunity were better protected from COVID-19 infection and hospitalization than children who were vaccinated, according ...", "url": "https://www.theepochtimes.com/health/natural-immunity-superior-to-vaccination-against-infection-in-children-study_5001168.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/02/16/sars-cov-2-1200x973.jpg", "publishedAt": "2023-01-22T13:42:29Z", "content": "Children with natural immunity were better protected from COVID-19 infection and hospitalization than children who were vaccinated, according to a new study.\r\nChildren aged 5 to 11 with post-infectio… [+5522 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Adam Meyer", "title": "5 Bad Fitness Habits That Cause You To Lose Muscle Mass - Eat This, Not That", "description": "An expert shares five bad fitness habits that cause you to lose muscle mass that you should avoid like the plague.", "url": "https://www.eatthis.com/bad-fitness-habits-lose-muscle-mass/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/01/man-holding-dumbbells-intense-workout-overtraining.jpg?quality=82&strip=all", "publishedAt": "2023-01-22T12:00:55Z", "content": "The foundation of any successful fitness regimen is built upon healthy habits. Whether your goal is to run your first marathon, set a deadlift personal record, or commit to a daily walking routine, t… [+4942 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Devineé Lingo, M.S., RDN", "title": "What Happens to Your Body When You Eat Avocado Every Day - EatingWell", "description": "Can an avocado a day keep your health at bay? What does the research have to say?", "url": "https://www.eatingwell.com/article/8026117/avocados-benefits/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=960&h=480&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2019%2F08%2F27113711%2F63430051.jpg", "publishedAt": "2023-01-22T11:53:01Z", "content": "Native to the warmer regions of Mexico and Central America, avocados–originally referred to as aguacate or alligator pears–are fruits unlike any other. Avocados are characterized by a large central s… [+7244 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Tom Scotson", "title": "Chronic pain conditions can be triggered by human emotions, research shows - Daily Mail", "description": "Georgie Oldfield MCSP, from Huddersfield, has for decades dealt with patients who could not link their pain or recurring health problems to any physical cause.", "url": "https://www.dailymail.co.uk/femail/article-11562621/Chronic-pain-conditions-triggered-human-emotions-research-shows.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/22/16/65856103-0-image-a-9_1671725148258.jpg", "publishedAt": "2023-01-22T11:02:25Z", "content": "Common illnesses ranging from sciatica, Fibromyalgia and other chronic pain conditions can be triggered by human emotions, leading researchers have suggested.\r\nGeorgie Oldfield MCSP, from Huddersfiel… [+8033 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Long-lasting coughs may be a sign of one infection after another, warn experts - Indiatimes.com", "description": "According to the expert, one influencing factor could be that people’s resistance to infections has reduced due to being more socially isolated from COVID restrictions in the past two years.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/long-lasting-coughs-may-be-a-sign-of-one-infection-after-another-warn-experts/photostory/97163833.cms", "urlToImage": "https://static.toiimg.com/photo/97163848.cms", "publishedAt": "2023-01-22T10:30:00Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Spinal Cord Injury: Can Brain and Nerve Stimulation Restore Movement? - Neuroscience News", "description": "Nerve stimulation therapy has shown promise in the treatment of spinal cord injuries in animal models. Researchers hope the treatment will be used in humans with SCI to help restore movement to limbs.", "url": "https://neurosciencenews.com/sci-nerve-stimulation-22321/", "urlToImage": "https://neurosciencenews.com/files/2023/01/spinal-cord-injury-brain-stimulation-neurosinces-public.jpg", "publishedAt": "2023-01-22T06:20:37Z", "content": "Summary: Nerve stimulation therapy has shown promise in the treatment of spinal cord injuries in animal models. Researchers hope the treatment will be used in humans with SCI to help restore movement… [+7762 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Motion capture tech from Avatar films used in disease research - BBC", "description": "Motion capture suits used to create alien characters can track the onset of diseases of movement, researchers say.", "url": "https://www.bbc.com/news/science-environment-64326125", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/46C2/production/_128341181_avatarindex.png", "publishedAt": "2023-01-22T02:04:12Z", "content": "Motion capture suits that bring characters to life in films like Avatar are helping researchers track the onset of diseases which impair movement. \r\nIn many cases, the quicker such conditions are ass… [+5081 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Haslett", "title": "Personal trainer: These are the signs you have a slow metabolism and quick ways you can boost it - Daily Mail", "description": "Personal trainer Rachael Attard, from Sydney, has shared the 13 signs you have a slow metabolism, and how you can boost yours to achieve your goal weight fast.", "url": "https://www.dailymail.co.uk/femail/health/article-11662309/Personal-trainer-signs-slow-metabolism-quick-ways-boost-it.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/22/01/66828347-0-image-a-27_1674349226314.jpg", "publishedAt": "2023-01-22T01:49:00Z", "content": "A personal trainer has shared the 13 signs you have a slow metabolism, and how you can boost yours to achieve your goal weight fast.\r\nRachael Attard, from Sydney, said while you might not think about… [+4473 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Close Relationships With Parents Promote Healthier Brain Development in High-Risk Teens, Buffering Against Alcohol Use Disorder - Neuroscience News", "description": "Close and supportive parental relationships can help mitigate the genetic and environmental risk of developing alcohol use disorder for at-risk teens.", "url": "https://neurosciencenews.com/aud-teen-parent-22319/", "urlToImage": "https://neurosciencenews.com/files/2023/01/parent-teen-relationship-neurosicences-public.jpg", "publishedAt": "2023-01-22T01:39:00Z", "content": "Summary: Close and supportive parental relationships can help mitigate the genetic and environmental risk of developing alcohol use disorder for at-risk teens.\r\nSource: State University of New York\r\n… [+6855 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Exercise Might Mitigate Age-Related Decline in Skeletal Muscle Structure and Function - Neuroscience News", "description": "Study reveals exercise is associated with myonuclear remodeling and may contribute to the protective effects of exercise on muscle function throughout the lifespan.", "url": "https://neurosciencenews.com/exercise-aging-muscles-22318/", "urlToImage": "https://neurosciencenews.com/files/2023/01/age-exercise-muscle-neurosinces-public.jpg", "publishedAt": "2023-01-22T00:10:58Z", "content": "Summary: Study reveals exercise is associated with myonuclear remodeling and may contribute to the protective effects of exercise on muscle function throughout the lifespan.\r\nSource: King’s College L… [+5237 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Species of Gut Microbes That Can Boost the Motivation To Exercise - SciTechDaily", "description": "Researchers have discovered a gut-to-brain pathway in mice that increases exercise performance. According to a study published in Nature, led by researchers at the Perelman School of Medicine at the University of Pennsylvania, certain types of gut bacteria ca…", "url": "https://scitechdaily.com/scientists-discover-species-of-gut-microbes-that-can-boost-the-motivation-to-exercise/", "urlToImage": "https://scitechdaily.com/images/Young-Man-Exercise-Stretching.jpg", "publishedAt": "2023-01-21T22:07:10Z", "content": "ByUniversity of Pennsylvania School of MedicineJanuary 21, 2023\r\nIf the gut-to-brain pathway found in mice also exists in humans, it could be used as an effective method to enhance exercise and promo… [+5405 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Long Covid could be longer – and worse – than we thought, study finds - South China Morning Post", "description": "Lingering symptoms of Covid currently affect 10 per cent of patients, researchers say.", "url": "https://www.scmp.com/news/china/science/article/3207572/long-covid-could-be-longer-and-more-severe-we-thought-study-finds", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2023/01/20/a660f0ee-502d-4117-b5b3-4f9b43ad8cdb_f098b78d.jpg?itok=Q2Ry47Sg&v=1674204100", "publishedAt": "2023-01-21T22:00:11Z", "content": "Published: 6:00am, 22 Jan, 2023\r\nUpdated: 6:00am, 22 Jan, 2023"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Novel mRNA Delivery Method Induces Collagen Repair and Could Replace Fillers for Skin Wrinkles - Neuroscience News", "description": "A novel mRNA delivery method that uses extracellular vesicles initiates collagen replacement in photoaged skin. A single injection increased collagen production and reduced wrinkle formation in targeted areas for two months. Researchers say the new delivery m…", "url": "https://neurosciencenews.com/mrna-collagen-replacement-22315/", "urlToImage": "https://neurosciencenews.com/files/2023/01/mrna-skin-wrinkles-neurosinces-public.jpg", "publishedAt": "2023-01-21T19:44:27Z", "content": "Summary: A novel mRNA delivery method that uses extracellular vesicles initiates collagen replacement in photoaged skin. A single injection increased collagen production and reduced wrinkle formation… [+4776 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": null, "title": "These Healthy Diets Were Associated With Lower Risk of Death, According to a Study of 119,000 People Across Four Decades - Barron's", "description": "People who regularly adhered to at least one of four healthy eating patterns were less likely to die than those who ate less healthily, researchers found.", "url": "https://www.barrons.com/articles/retirement-health-live-longer-diet-51674329972", "urlToImage": "https://images.barrons.com/im-442556/social", "publishedAt": "2023-01-21T19:40:00Z", "content": "Eat healthy, live longer.Thats the takeaway from a major study published this month in JAMA Internal Medicine. Scientists led by a team from the Harvard T.H. Chan School of Public Health found that p… [+3704 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Researchers Synthesize Ocean-Based Molecule That Could Fight Parkinson’s - Neuroscience News", "description": "Researchers have successfully created a synthetic version of a small molecule found in a recently discovered sea sponge that appears to have therapeutic benefits for Parkinson's disease.", "url": "https://neurosciencenews.com/synthetic-molecule-parkinsons-22313/", "urlToImage": "https://neurosciencenews.com/files/2023/01/ocean-molecule-parkinsons-neurosicence-public.jpg", "publishedAt": "2023-01-21T17:58:13Z", "content": "Summary: Researchers have successfully created a synthetic version of a small molecule found in a recently discovered sea sponge that appears to have therapeutic benefits for Parkinson’s disease.\r\nSo… [+5314 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Scientists are beginning to unravel the effects of psilocybin mushrooms on bipolar disorder - PsyPost", "description": "A new study published in the Journal of Psychopharmacology is the first to characterize the psychological impacts of psilocybin among people with bipolar disorder. The findings indicate that many people with bipolar disorder who consume psilocybin, the primar…", "url": "https://www.psypost.org/2023/01/scientists-are-beginning-to-unravel-the-effects-of-psilocybin-mushrooms-on-bipolar-disorder-65142", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/01/psychedelic-psilocybin-magic-mushrooms.jpg", "publishedAt": "2023-01-21T17:15:00Z", "content": "A new study published in the Journal of Psychopharmacology is the first to characterize the psychological impacts of psilocybin among people with bipolar disorder. The findings indicate that many peo… [+7628 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": "Ellen Wan, Weber Lee", "title": "Black Rice to Improve Diabetic Nephropathy and More - The Epoch Times", "description": "Rice varieties can be divided into white, glutinous, purple, and black. Among them, black rice has the most nutritional and medicinal value. In ancient China, black rice was reputed to cure disease, contribute to longevity, and was used as a tribute to the Em…", "url": "https://www.theepochtimes.com/health/black-rice-to-improve-diabetic-nephropathy-and-more_4998508.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2023/01/20/66_FeatureImageSize-1200x720.jpg", "publishedAt": "2023-01-21T16:02:59Z", "content": "Rice varieties can be divided into white, glutinous, purple, and black. Among them, black rice has the most nutritional and medicinal value. In ancient China, black rice was reputed to cure disease, … [+4852 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Sylvia Kang", "title": "It’s already stressful trying to get pregnant. The bias within my own culture made it even more difficult - Yahoo Life", "description": "When I worried about the pain at birth, my mom told me, “Every woman goes through that. Not a big deal.”", "url": "https://www.yahoo.com/lifestyle/already-stressful-trying-pregnant-bias-160000534.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2023-01-21T16:00:00Z", "content": "In Asian culture, the traditional belief is that all women are supposed to have kids. And that trying to conceive, pregnancy, giving birth and postpartum are just normal steps women must go through. … [+6213 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Mark R. O'Brian, Professor and Chair of Biochemistry, Jacobs School of Medicine and Biomedical Sciences, University at Buffalo", "title": "Moderna's experimental cancer vaccine treats but doesn't prevent melanoma – a biochemist explains how it works - Yahoo News", "description": "Moderna is testing an mRNA vaccine in combination with pembrolizumab to treat melanoma. Javier Zayas Photography/Moment via Getty ImagesMedia outlets have...", "url": "https://news.yahoo.com/modernas-experimental-cancer-vaccine-treats-133325400.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/qVb51dXNm9BCODa191SU0w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_conversation_us_articles_815/b48de63f0487e59b31e4efa85b1f4f18", "publishedAt": "2023-01-21T15:04:16Z", "content": "Mediaoutlets have reported the encouraging findings of clinical trials for a new experimental vaccine developed by the biotech company Moderna to treat an aggressive type of skin cancer called melano… [+6788 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Eileen Li", "title": "An acupuncturist and pain expert shares the 2 pressure points she uses to 'quickly relieve headaches' - CNBC", "description": "Acupuncturist, herbal medicine doctor and pain expert Dr. Eileen Li shares two simple acupressure moves that anyone can do at home to relieve tension headaches and migraines — without the needles.", "url": "https://www.cnbc.com/2023/01/21/an-acupuncturist-and-pain-expert-shares-the-2-pressure-points-she-uses-to-quickly-relieve-headaches.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107182058-1674248878357-elderly-woman-holding-hands-to-her-temples-having-2022-11-29-02-41-57-utc.jpg?v=1674312635&w=1920&h=1080", "publishedAt": "2023-01-21T14:50:35Z", "content": "Tension headaches are no joke. They typically feel like a tight band around the head, and can stem from muscle contractions in the head and neck, stress or even poor posture.\r\nMany people take pain m… [+3583 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Georgia Dodd", "title": "4 Foods That Are Slowing Your Metabolism Over 40, According To Registered Dietitians - Yahoo Life", "description": "One of the most important factors when it comes to weight loss is your metabolism. A faster metabolism will naturally help your body to burn more fat and...", "url": "https://www.shefinds.com/collections/foods-are-the-biggest-culprits-for-slowing-your-metabolism/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/c53f101252bf612a58b6ec173542352c", "publishedAt": "2023-01-21T13:00:08Z", "content": "One of the most important factors when it comes to weight loss is your metabolism. A faster metabolism will naturally help your body to burn more fat and increase your calorie deficit. Meanwhile, a s… [+4643 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Faith Geiger", "title": "The Gut-Healthy Ingredients You Should Be Adding To Your Plate Every Day For Better Digestion - Yahoo Life", "description": "You may already know by now that your gut health plays a vital role in your overall wellness–which means helping your digestive system thrive is an essential...", "url": "https://www.shefinds.com/collections/gut-healthy-ingredients-digestion/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/20bd2ee7261e23f3fa3b12d2a6178c7a", "publishedAt": "2023-01-21T12:00:29Z", "content": "bowl of berries beside glasses of kefir\r\nYou may already know by now that your gut health plays a vital role in your overall wellnesswhich means helping your digestive system thrive is an essential p… [+3819 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Harriet Johnston", "title": "My rosacea was so bad I was branded 'a tomato' and endured cosmetic surgery jokes from my ex - Daily Mail", "description": "Natalie Rose, 33, from Shropshire, suffered from rosacea from a young age, and after years of relentless bullying, her self esteem was at an all time low. In 2020, she found a cure for the condition.", "url": "https://www.dailymail.co.uk/femail/article-11644965/My-rosacea-bad-branded-tomato-endured-cosmetic-surgery-jokes-ex.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/17/16/66670081-0-image-a-72_1673972597995.jpg", "publishedAt": "2023-01-21T10:42:42Z", "content": "A woman who was branded a tomato by a cruel workplace bully and told she she was ugly by strangers due to her rosacea has learnt to love her skin again after finding miracle skincare.\r\nNatalie Rose, … [+6684 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Average pregnancy length in the US is shorter than in European countries - Medical Xpress", "description": "Maternal health outcomes continue to worsen in the United States, where maternal and infant mortality rates far exceed rates in European countries and other wealthy nations. Now, a new study led by researchers at Boston University School of Public Health (BUS…", "url": "https://medicalxpress.com/news/2023-01-average-pregnancy-length-shorter-european.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/average-pregnancy-leng.jpg", "publishedAt": "2023-01-21T10:20:20Z", "content": "Maternal health outcomes continue to worsen in the United States, where maternal and infant mortality rates far exceed rates in European countries and other wealthy nations. Now, a new study led by r… [+4656 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "faith geiger", "title": "The One Low-Fiber Food No One Over 40 Should Be Eating Anymore Because It Practically Guarantees Weight Gain - SheFinds", "description": "Learn why health experts say you should stop eating breakfast cereal if you want to lose weight, only on SheFinds.", "url": "https://www.shefinds.com/collections/low-fiber-food-weight-gain-cereal/", "urlToImage": "https://www.shefinds.com/files/2023/01/woman-pouring-milk-into-a-cereal-bowl.jpg", "publishedAt": "2023-01-21T10:00:54Z", "content": "Fiber is an essential component of any healthy diet. It keeps your gut healthy, helps regulate blood sugar, and allows you to stay fuller longerall of which contributes to healthy weight loss. Howeve… [+3386 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Mike Snider, USA TODAY", "title": "Diets for weight loss: Smart eating is a better recipe for your health - USA TODAY", "description": "Considering fasting, the keto diet or Weight Watchers to lose weight? Instead, try to make more nutritious meals, which can help with weight loss.", "url": "https://www.usatoday.com/story/news/health/2023/01/21/diets-weight-loss-smart-eating/11070290002/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/01/03/USAT/dba26ab9-095c-4e83-8962-150ae33e479c-GettyImages-1390699821.jpg?auto=webp&crop=2120,1193,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-01-21T10:00:26Z", "content": "<ul><li>If you want to lose weight and be more healthy, going on a diet may not be the best strategy.</li><li>Making some gradual changes in what you eat could yield better long-term results.</li><li… [+7527 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Catherine Schuster-Bruce", "title": "How a cardiologist keeps his cholesterol levels low - Insider", "description": "Too much of a \"bad\" type of cholesterol can lead to blocked arteries, which puts people at risk of heart disease and stroke.", "url": "https://www.insider.com/cardiologist-food-eat-low-cholesterol-ldl-diet-2023-1", "urlToImage": "https://i.insider.com/63cac489eee94d001a792172?width=1200&format=jpeg", "publishedAt": "2023-01-21T10:00:08Z", "content": "A cardiologist has shared four lifestyle choices that he makes to try to keep his cholesterol low.\r\nToo much of what is known as LDL cholesterol which is considered a \"bad\" type   can block arteries.… [+2957 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "6 foods a dietitian who follows a Mediterranean-style diet always has - Insider", "description": "The Mediterranean diet is considered to be one healthiest ways to eat, thanks to its links with heart health and a lower risk of a number of diseases.", "url": "https://www.insider.com/mediterranean-diet-cheap-foods-list-dietitian-kitchen-2023-1", "urlToImage": "https://i.insider.com/63caba2b2a1e600018b8df78?width=1200&format=jpeg", "publishedAt": "2023-01-21T10:00:08Z", "content": "A registered dietitian who follows the Mediterranean diet, which is lauded for its wide-ranging health benefits, has shared what she always keeps stocked in her kitchen. \r\nThe diet is widely consider… [+1007 chars]"}, {"source": {"id": null, "name": "TwinCities.com-Pioneer Press"}, "author": "Pioneer Press", "title": "2023 Pioneer Press Treasure Hunt Clue 1 - St. Paul Pioneer Press", "description": "The hunt is on!", "url": "https://www.twincities.com/2023/01/21/2023-pioneer-press-treasure-hunt-clue-1/", "urlToImage": "https://www.twincities.com/wp-content/uploads/2023/01/VerticalCubTreasureHunt.jpg?w=472&h=266", "publishedAt": "2023-01-21T06:02:09Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Six Minutes of Intense Exercise Boosts a Crucial Molecule in Your Brain - ScienceAlert", "description": "Six minutes of high-intensity exercise is enough to produce a key protein in the brain, one that's important in brain formation, function, and memory, and which has been implicated in the progress of neurodegenerative disorders such as Alzheimer's disease.", "url": "https://www.sciencealert.com/six-minutes-of-intense-exercise-boosts-a-crucial-molecule-in-your-brain", "urlToImage": "https://www.sciencealert.com/images/2023/01/MaleAthleteCatchesBreathAfterWorkout.jpg", "publishedAt": "2023-01-21T05:00:46Z", "content": "Six minutes of high-intensity exercise is enough to produce a key protein in the brain, one that's important in brain formation, function, and memory, and which has been implicated in the progress of… [+2914 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Olivia Day", "title": "Australians dying from fatal heart attacks due to lingering impacts of Covid lockdowns - Daily Mail", "description": "Up to 10,200 Australians died of ischemic heart disease in the first eight months of 2022 - marking a 17 per cent increase on what would be expected in a 'normal' year.", "url": "https://www.dailymail.co.uk/news/article-11659977/Australians-dying-fatal-heart-attacks-lingering-impacts-Covid-lockdowns.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/21/00/66807107-0-image-a-18_1674260343764.jpg", "publishedAt": "2023-01-21T01:38:00Z", "content": "More Australians than ever are dying from fatal heart attacks due to the lingering effects of the Covid pandemic and the impact of the virus on the heart.\r\nUp to 10,200 Aussies died of ischemic heart… [+2993 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lindsey Bever and Marlene Cimons", "title": "UV dryers for gel nails can harm DNA, study says. Should I use them? - Yahoo! Voices", "description": "Exposure to ultraviolet radiation is known to cause skin damage, including skin cancer. Now, new research has raised questions about the safety of nail...", "url": "https://www.washingtonpost.com/wellness/2023/01/20/gel-nail-polish-uv-lamps-safety-dermatologists/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7SIc8Wm2ILEHH683Y3GVbA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2023-01/35d4bb90-999e-11ed-b93f-3c95c667fa7d", "publishedAt": "2023-01-21T01:30:00Z", "content": "Exposure to ultraviolet radiation is known to cause skin damage, including skin cancer. Now, new research has raised questions about the safety of nail dryers, which use UV light to dry and cure gel … [+7403 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'I really miss school': 71000 children in UK struggling with long Covid | ITV News - ITV News", "description": "The Office for National Statistics estimates 71,000 children under the age of 16 are struggling with a range of debilitating symptoms months after catching C...", "url": "https://www.youtube.com/watch?v=e4YWqtLKqLU", "urlToImage": "https://i.ytimg.com/vi/e4YWqtLKqLU/maxresdefault.jpg", "publishedAt": "2023-01-20T23:36:07Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Some People's Brains Are Wrinklier Than Others, And Now We Know Why - ScienceAlert", "description": "The folds of the human brain are instantly recognizable.", "url": "https://www.sciencealert.com/some-peoples-brains-are-wrinklier-than-others-and-now-we-know-why", "urlToImage": "https://www.sciencealert.com/images/2023/01/HumanBrainWithCharacteristicFoldsOnPinkBackgroundCropped.jpg", "publishedAt": "2023-01-20T23:00:35Z", "content": "The folds of the human brain are instantly recognizable. Snaking ridges and deep furrows give the squishy tissue inside our heads structure and the appearance of a wrinkly walnut.\r\nInto peaks called … [+4672 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Waze leads to brain haze? Here's why using real maps instead of GPS could prevent dementia - Study Finds", "description": "Researchers say orienteering, an outdoor sport that exercises the mind and body through navigation puzzles, can train the brain and stave off cognitive decline.", "url": "https://studyfinds.org/using-real-maps-prevents-alzheimers/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2020/01/person-wearing-beige-sweater-holding-map-inside-vehicle-1252500.jpg", "publishedAt": "2023-01-20T19:15:42Z", "content": "HAMILTON, Ontario — Turning off Waze or your favorite GPS app and using an old-fashioned map may be the best way to fight Alzheimer’s disease, a new study reveals. Researchers at McMaster University … [+3675 chars]"}]}