{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "19-year-old becomes youngest patient to be diagnosed with ALZHEIMER'S - Daily Mail", "description": "Neuroscientists in Beijing have identified the youngest ever case of probable Alzheimer's in a 19-year-old Chinese man. He experienced worsening symptoms for two years, the scientists said.", "url": "https://www.dailymail.co.uk/health/article-11750257/19-year-old-youngest-patient-diagnosed-ALZHEIMERS.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/14/21/67687805-0-image-a-33_1676411644792.jpg", "publishedAt": "2023-02-15T16:40:38Z", "content": "A teenager from China has become the world's youngest patient to be given a probable diagnosis of Alzheimer's.\r\nThe 19-year-old, believed to be from Beijing, had been experiencing symptoms for two ye… [+5068 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Leada Gore | lgore@al.com", "title": "7 most common long COVID symptoms - AL.com", "description": "For most people, a bout with COVID can be an uncomfortable but thankfully brief episode. For others, however, the symptoms and other health problems can exist for much longer in something dubbed “long COVID.”", "url": "https://www.al.com/news/2023/02/7-most-common-long-covid-symptoms.html", "urlToImage": "https://www.al.com/resizer/rrR8SbDfQKIFDYGZQrmJdYvtEW0=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/EK3DSLP2MRF5ZMTO7B3WBCM4YY.jpg", "publishedAt": "2023-02-15T15:00:00Z", "content": "For most people, a bout with COVID can be an uncomfortable but thankfully brief episode. For others, however, the symptoms and other health problems can exist for much longer in something dubbed long… [+1477 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Nada Hassanein, USA TODAY", "title": "Congenital syphilis cases surge among Mississippi babies - USA TODAY", "description": "A surge in babies born with congenital syphilis in Mississippi is calling attention to rising cases throughout the nation, especially the South.", "url": "https://www.usatoday.com/story/news/health/2023/02/13/congenital-syphilis-cases-surge-babies-mississippi/11247501002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/12/07/USAT/c264e2ed-435e-4ef3-b0ed-afdb69edc04a-221013_KIND_HOKD_Nurses_crochet_outfits_for_newborns_Tmobile_16x9_thumbnail_3.jpg?auto=webp&crop=1911,1075,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-02-15T14:44:27Z", "content": "A surge in babies born with congenital syphilis in Mississippi calls attention to rising cases throughout the nation, especially the South, experts say.\r\nIn 2021, the state saw 106 cases, more than n… [+5958 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Drug That Cures Autism? Neuroscience Study Yields Promising Results - SciTechDaily", "description": "The behavioral disorders observed in autism are associated with a multitude of genetic alterations. Scientists from the Hector Institute for Translational Brain Research (HITBR) have now found another molecular cause for this condition. The transcription fact…", "url": "https://scitechdaily.com/?p=252035", "urlToImage": "https://scitechdaily.com/images/Prescription-Drug-Concept.jpg", "publishedAt": "2023-02-15T14:32:04Z", "content": "In a new study, a drug that blocks sodium channels was shown to curb autism-associated behaviors such as hyperactivity in mice. The drug, lamotrigine sold under the brand name Lamictal among others i… [+5089 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cedars-Sinai Confirms Pancreatic Cancer Rates Rising Faster in Women Than Men - SciTechDaily", "description": "Cedars-Sinai investigators verify that rates are trending up for both sexes; younger women and black women see steepest increase. Investigators from Cedars-Sinai Cancer, in a large-scale nationwide study, have confirmed that rates of pancreatic cancer are ris…", "url": "https://scitechdaily.com/?p=252067", "urlToImage": "https://scitechdaily.com/images/Pancreatic-Cancer-Cells.jpg", "publishedAt": "2023-02-15T12:53:00Z", "content": "A recent study by Cedars-Sinai Cancer has found that pancreatic cancer rates are increasing at a quicker pace among younger women, particularly black women, compared to men of the same age. The study… [+4487 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Stacker.com", "title": "The 5 Alabama counties with the highest rates of diabetes - AL.com", "description": "Diabetes was the 8th leading cause of death in 2020, but the disease does not impact all Americans equally.", "url": "https://www.al.com/news/2023/02/the-5-alabama-counties-with-the-highest-rates-of-diabetes.html", "urlToImage": "https://www.al.com/resizer/bpAHcbWQEqnLrBGXjB8lr-QlvwQ=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/SJJ36PLQSVEMXOB3O6FTQTWJ54.jpg", "publishedAt": "2023-02-15T12:50:00Z", "content": "Diabetes rates have been on the rise for the last two decades, and show no sign of abating.\r\nAccording to the Centers for Disease Control and Prevention, roughly 11.3% of the U.S. population suffers … [+2822 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "When You Exercise Might Determine the Amount of Fat You Burn - Technology Networks", "description": "Researchers from the Karolinska Institute and the University of Copenhagen found that the timing of exercise may fine-tune fat metabolism in mice. The study is published in the <i> Proceedings of the National Academy of Science (PNAS)</i>.", "url": "https://www.technologynetworks.com/proteomics/news/when-you-exercise-might-determine-the-amount-of-fat-you-burn-370256", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/370256/when-you-exercise-might-determine-the-amount-of-fat-you-burn-370256-640x360.jpg?cb=20230215", "publishedAt": "2023-02-15T12:19:02Z", "content": "Researchers from the Karolinska Institute and the University of Copenhagen found that the timing of exercise may fine-tune fat metabolism in mice. The study is published in the Proceedings of the Nat… [+3054 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Delthia Ricks", "title": "Scientists decipher how non-resistant forms of Staph aureus thwart antibiotics, almost like a superbug - Phys.org", "description": "Staphylococcus aureus (S. aureus) has a slew of surprises in its bag of dirty tricks and among the most puzzling has been the ability of non-resistant forms of the bacteria to emerge unscathed, even after exposure to high concentrations of chemical warfare fr…", "url": "https://phys.org/news/2023-02-scientists-decipher-non-resistant-staph-aureus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/scientists-decipher-ho.jpg", "publishedAt": "2023-02-15T11:30:01Z", "content": "Staphylococcus aureus (S. aureus) has a slew of surprises in its bag of dirty tricks and among the most puzzling has been the ability of non-resistant forms of the bacteria to emerge unscathed, even … [+8533 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Bird flu spreads to new countries, threatens non-stop \"war\" on poultry - Reuters", "description": "Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that transmit the virus to poultry, according to veterinarians and disease experts, who warn it is now a year-round problem.", "url": "https://www.reuters.com/world/bird-flu-spreads-new-countries-threatens-non-stop-war-poultry-2023-02-15/", "urlToImage": "https://www.reuters.com/resizer/xAB2LEPdEzH4yrLdh8tcIJ1wG8s=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/YPLZR2TYWRJUREZX5VBEVEBCDQ.jpg", "publishedAt": "2023-02-15T11:10:00Z", "content": "CHICAGO, Feb 15 (Reuters) - Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that transmit the virus to poultry, according to veterinarians and … [+6976 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Andrea Michelson", "title": "3 lifestyle changes to lower blood pressure if you have a genetic risk - Insider", "description": "Cutting back on red meat and quitting e-cigarettes can help bring down blood pressure before it becomes a problem, one cardiologist told Insider.", "url": "https://www.insider.com/lifestyle-changes-to-lower-blood-pressure-early-family-history-2023-2", "urlToImage": "https://i.insider.com/63eabddc64d0880018eb163b?width=1200&format=jpeg", "publishedAt": "2023-02-15T10:30:18Z", "content": "It's never too early to start thinking about your heart health, especially when it comes to managing your blood pressure, cardiologist Marc Katz told Insider.\r\nKatz not only treats people with heart … [+3838 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How a pioneering diabetes drug offers hope for preventing autoimmune disorders - Nature.com", "description": "The approval of an antibody therapy that pauses the progression of type 1 diabetes is a first in the field, and some say a model for other drug developers.", "url": "https://www.nature.com/articles/d41586-023-00400-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00400-x/d41586-023-00400-x_24020656.jpg", "publishedAt": "2023-02-15T10:11:08Z", "content": "Her sisters life-threatening experience with diabetes was a wake-up call for Mikayla Olsten.\r\nIn 2016, when Olsten was 14 years old, her youngest sibling Mia landed in intensive care with failing kid… [+15959 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "Michaeleen Doucleff", "title": "How do pandemics begin? There's a new theory — and a new strategy to thwart them - WUSF Public Media", "description": "Animals carry millions of pathogens. So it's a daunting task to find the one with the greatest potential to spark a pandemic. Now scientists are rethinking the way they hunt for that next new virus.", "url": "https://wusfnews.wusf.usf.edu/2023-02-15/how-do-pandemics-begin-theres-a-new-theory-and-a-new-strategy-to-thwart-them", "urlToImage": null, "publishedAt": "2023-02-15T10:00:00Z", "content": "The illness struck the little baby suddenly.\r\nIt was a hot, sticky day late in the summer of 2017. Only 5 months old at the time, her little boy was a peaceful infant, his mother recalls. \"He didn't … [+22257 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Stunning reconstruction reveals 'lonely boy' with deformed skull who died in cave in Norway 8300 years ago - Livescience.com", "description": "A new reconstruction of one of Norway's oldest known skeletons shows a teenager with an unusual skull who may have died alone in a cave.", "url": "https://www.livescience.com/stunning-reconstruction-reveals-lonely-boy-with-deformed-skull-who-died-in-cave-in-norway-8300-years-ago", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WTsmR4fYYHciTyWJHTtN9h-1200-80.gif", "publishedAt": "2023-02-15T10:00:00Z", "content": "About 8,300 years ago, a teenage boy with an unusual skull and short stature may have scampered along the rocky coast of what is now Norway, pausing to regain his balance as he clutched a fishing rod… [+5755 chars]"}, {"source": {"id": null, "name": "inews"}, "author": "Luisa Metcalfe", "title": "Inflammation is modern life's silent killer, here's how to lower it with simple changes - inews", "description": "The slow burn of inflammation is linked with diseases such as cancer, heart disease and dementia - but lifestyle fixes can help your body fight it", "url": "https://inews.co.uk/inews-lifestyle/inflammation-modern-life-silent-killer-how-lower-simple-changes-2147809", "urlToImage": "https://wp.inews.co.uk/wp-content/uploads/2023/02/SEI_144174479.jpg?crop=0px%2C105px%2C1732px%2C978px&resize=1200%2C675", "publishedAt": "2023-02-15T09:00:00Z", "content": "There is much about life in the Western world to be celebrated: food is plentiful, medicine is advanced and high-tech gizmos take manual labour out of our hands. But this lifestyle of bounty, conveni… [+9313 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO intensifies surveillance in E Guinea after Marburg outbreak - Al Jazeera English", "description": "The country officially declared its first outbreak of Marburg virus disease on Monday.", "url": "https://www.aljazeera.com/news/2023/2/15/who-intensifies-surveillance-in-e-guinea-after-marburg-outbreak", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/02/GettyImages-1289422427-1.jpg?resize=1200%2C675", "publishedAt": "2023-02-15T08:46:12Z", "content": "The World Health Organization (WHO) has intensified surveillance after Equatorial Guinea confirmed an outbreak of the Marburg virus, a highly infectious and deadly disease similar to Ebola, which kil… [+2490 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "Neil deGrasse Tyson lets the air out of balloon hype - CNN", "description": "Famed astrophysicist Neil deGrasse Tyson speaks to CNN's Erin Burnett about how much of a threat he believes high-altitude balloons pose to the US.", "url": "https://www.cnn.com/videos/business/2023/02/15/neil-degrasse-tyson-balloon-reax-burnett-intv-ebof-vpx.cnn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230214233318-neil-degrasse-tyson-burnett-vpx.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-15T05:26:15Z", "content": null}, {"source": {"id": null, "name": "fox8.com"}, "author": "Melissa Reid", "title": "Northeast Ohio seeing unusual rise in strep throat infections - WJW FOX 8 News Cleveland", "description": "Doctors at University Hospitals are warning about a rise in strep throat infections among children.", "url": "https://fox8.com/news/northeast-ohio-seeing-unusual-rise-in-strep-throat-infections/", "urlToImage": "https://fox8.com/wp-content/uploads/sites/12/2023/02/C28119D170DF5994301406CAD437AE43_1.jpg?w=1280", "publishedAt": "2023-02-15T03:20:27Z", "content": "CLEVELAND (WJW) – Doctors at University Hospitals are warning about a rise in strep throat infections among children.\r\n“It is certainly a phenomenon that we are seeing and it’s something that is bein… [+1133 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Julie Floyd Jones", "title": "12 Foods to Improve Your Gut Health Overnight - EatingWell", "description": "Simple changes to your diet can quickly impact your gut health—here's how.", "url": "https://www.eatingwell.com/article/8021156/foods-to-improve-gut-health-overnight/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&rect=0%2C316%2C2000%2C1316&poi=%5B1000%2C900%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2022%2F02%2F15%2Fgrilled-artichoke.jpg", "publishedAt": "2023-02-15T00:54:44Z", "content": "Gut health isn't just about keeping tummy troubles away. While improving your gut health can reduce gastrointestinal issues, it is also key in supporting and regulating body functions and keeping you… [+9670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "Too much added sugar could harm your health, study says - CNN", "description": "Eating high amounts of free or added sugars could increase risk for cardiovascular disease, a new study has found.", "url": "https://www.cnn.com/2023/02/14/health/added-free-sugars-cardiovascular-disease-risk-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230214131548-assorted-cookies-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-15T00:15:00Z", "content": "Sign up for CNNs Eat, But Better: Mediterranean Style. Our eight-part guide shows you a delicious expert-backed eating lifestyle that will boost your health for life.\r\nEating a lot of free sugars als… [+6044 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dino Grandoni", "title": "How climate change may already help spread malaria - The Washington Post", "description": "As temperatures rise, malaria-carrying mosquitos have crept to farther from the equator in Africa, according to a new study.", "url": "https://www.washingtonpost.com/climate-environment/2023/02/14/climate-change-malaria-mosquito/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TTF55NSLV4I6ZJ5YT3JIX4RZFE.jpg&w=1440", "publishedAt": "2023-02-15T00:13:17Z", "content": "Comment on this story\r\nAs temperatures rise, many tropical species once confined to the warmest parts of the globe are expected to climb to higher altitudes and creep farther from the equator.\r\nThat … [+3152 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "The UK’s most expensive drug saved one sister, but it is too late for the other - BBC", "description": "A toddler becomes the first to be treated by the NHS with a new gene therapy costing £2.875 million.", "url": "https://www.bbc.com/news/health-64629680", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F175/production/_128631816_1080xnalaandteddiatchristmas.jpg", "publishedAt": "2023-02-15T00:11:50Z", "content": "A toddler with a rare inherited condition has become the first child to be treated by the NHS with a new life-saving gene therapy.\r\nTeddi Shaw was diagnosed in time because her older sister Nala show… [+10947 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain-Wave Data and Hearing Test May Help Diagnose Autism Earlier - Neuroscience News", "description": "Researchers say brain wave data collected during routine hearing tests in newborns could help doctors to spot the signs of neurodevelopmental disorders, including ASD earlier.", "url": "https://neurosciencenews.com/brain-wave-hearing-asd-22508/", "urlToImage": "https://neurosciencenews.com/files/2023/02/brainwave-hearing-asd-neurosicnece-public.jpg", "publishedAt": "2023-02-14T23:52:18Z", "content": "Summary: Researchers say brain wave data collected during routine hearing tests in newborns could help doctors to spot the signs of neurodevelopmental disorders, including ASD earlier.\r\nSource: Rutge… [+5707 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Marissa Matozzo", "title": "Dietitians Agree: These Are The Best Leafy Greens To Eat Every Day For A Healthier Body Over 40 - Yahoo Life", "description": "Experts agree that aging gracefully requires a balanced diet, frequent hydration, regular exercise and a consistent sleep schedule. If your goal is to...", "url": "https://www.shefinds.com/collections/dietitians-best-leafy-greens-healthier-body-over-40/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/3e00016606b53adc8548925dc49bc062", "publishedAt": "2023-02-14T23:30:00Z", "content": "Experts agree that aging gracefully requires a balanced diet, frequent hydration, regular exercise and a consistent sleep schedule. If your goal is to instantly make your meals healthier (and boost y… [+2299 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Brooke Kato", "title": "Binge drinking could be reduced with this cheap pill: study - New York Post ", "description": "The study, published in the American Journal of Psychiatry, focused on people who want to lower their alcohol intake, but wouldn’t be classified as alcoholics.", "url": "https://nypost.com/2023/02/14/binge-drinking-could-be-reduced-with-this-cheap-pill-study/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/02/NYPICHPDPICT000006670649.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-02-14T23:25:00Z", "content": "It might be worth a shot.\r\nA new study from researchers at the University of California, San Francisco, found that swallowing a pill an hour before embarking on a night out could “significantly reduc… [+3575 chars]"}, {"source": {"id": null, "name": "WFSB"}, "author": "Ayah Galal,Evan Sobol", "title": "Hartford County seeing an uptick in Norovirus cases - Eyewitness News 3", "description": "There has been an uptick in Norovirus cases in Hartford County.", "url": "https://www.wfsb.com/2023/02/14/hartford-county-seeing-an-uptick-norovirus-cases/", "urlToImage": "https://gray-wfsb-prod.cdn.arcpublishing.com/resizer/n7Oy-elHrJWMX4bPthI2UBEcKec=/1200x600/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/HWRA5MVLBVA7VFIBW2FUM7MVMY.jpg", "publishedAt": "2023-02-14T22:54:00Z", "content": "HARTFORD, CT (WFSB) - There has been an uptick in Norovirus cases in Hartford County.\r\nMore kids have been getting sick at school.\r\nAt Connecticut Childrens, doctors are seeing more kids coming in wi… [+2227 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Karla Walsh", "title": "A New Study Hints That 38% of Cognitive Decline Is Impacted By These Lifestyle Factors - EatingWell", "description": "Whether you have family history of dementia or not, you'll want to study up.", "url": "https://www.eatingwell.com/article/8029793/study-cognitive-decline-impacted-lifestyle-factors/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C679%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2023%2F02%2F14%2F38-of-cognitive-decline-is-impacted-by-lifestyle-factors-a-new-study-suggests-here-are-the-proven-ways-you-can-reduce-your-risk.jpg", "publishedAt": "2023-02-14T22:04:31Z", "content": "If you can still sing along to every boy band song of the early 2000s and can recite your childhood best friend's phone number, you might be thinking you'll never have to worry about memory challenge… [+4426 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Don Rauf", "title": "What Is the Average Penis Length? - Everyday Health", "description": "The average length of an erect penis has increased 25 percent over the past 3 decades, from 4.8 to to 6 inches, according to new research.", "url": "https://www.everydayhealth.com/sexual-health/penises-have-gotten-surprisingly-longer-over-past-29-years-study-finds/", "urlToImage": "https://images.everydayhealth.com/images/is-an-increase-in-penile-length-cause-for-concern-1440x810.jpg?sfvrsn=e0958577_1", "publishedAt": "2023-02-14T21:52:31Z", "content": "While recent research has shown that average sperm counts and testosterone levels have been in decline for men over the past few decades, erect penile length has surprisingly been trending in the opp… [+4701 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Samantha Vecchiarelli", "title": "TikToker, 52, reveals what life with dementia 'feels like' in viral video - Yahoo Life", "description": "This TikTok creator opened up about \"sharing my journey, my past, and having fun while living [with] dementia.\"", "url": "https://ca.style.yahoo.com/viral-tiktok-living-with-dementia-212520278.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/K.CbX5yTPoUWtmSYYfGWYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://s.yimg.com/os/creatr-uploaded-images/2023-02/37654710-acac-11ed-bf5a-db6d0e6ac596", "publishedAt": "2023-02-14T21:25:20Z", "content": "A TikTok user has gone viral after sharing her experience living with dementia. Image via TikTok/@welcome2dementia.\r\nThis article is for informational purposes only and is not a substitute for profes… [+4579 chars]"}, {"source": {"id": null, "name": "Verifythis.com"}, "author": "Emery Winter", "title": "What to know about dental X-rays and cancer - VERIFYThis.com", "description": "All forms of radiation exposure carry some cancer risk. For a single dental X-ray, that risk is low.", "url": "https://www.verifythis.com/article/news/verify/health-verify/dental-x-ray-cancer-risk-present-but-extremely-low-frequency/536-ee081c58-c443-4854-96c0-aea4f8bbef66", "urlToImage": "https://media.tegna-media.com/assets/VERIFY/images/aa627a56-66e3-4828-b224-9063a95d50f3/aa627a56-66e3-4828-b224-9063a95d50f3_1140x641.jpg", "publishedAt": "2023-02-14T21:10:00Z", "content": "Anyone who regularly visits the dentist has probably had their fair share of dental X-rays over the years. The dental staff drapes a lead apron over your chest, sometimes you have to bite down on a h… [+5312 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Gora", "title": "What are 'Blue Zones,' and do they really hold the secrets to a longer life? - Livescience.com", "description": "Blue Zones were proposed as regions with some of the oldest people in the world, though recent studies cast some doubt on the idea. Do these regions still hold insights about longevity?", "url": "https://www.livescience.com/what-are-the-blue-zones", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4TPQrUCP5p3KiYKyBfQfdk-1200-80.jpg", "publishedAt": "2023-02-14T21:00:31Z", "content": "Is there a key to living a long and healthy life? \r\nA popular answer to this question has looked to so-called Blue Zones, a nonscientific term given to geographic regions where people supposedly have… [+9761 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Annie Lennon", "title": "Hypertension: Regular coffee drinking linked to lower blood pressure - Medical News Today", "description": "A study found that people who drink two or more cups of coffee daily have significantly lower blood pressure compared with non-coffee drinkers.", "url": "https://www.medicalnewstoday.com/articles/hypertension-regular-coffee-consumption-help-lower-blood-pressure", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/02/drinking_coffee_at_ease_blood_pressure_732x549_thumb.jpg", "publishedAt": "2023-02-14T21:00:00Z", "content": "<ul><li>Researchers investigated the effects of coffee consumption on blood pressure. </li><li>Drinking two or more cups of coffee per day was linked to lower blood pressure. </li><li>Further studies… [+7172 chars]"}, {"source": {"id": null, "name": "Cowboystatedaily.com"}, "author": "Greg Johnson", "title": "Wyoming Safe From Super Gonorrhea Strain – So Far - Cowboy State Daily - Cowboy State Daily", "description": "A strain of drug-resistant gonorrhea found in Massachusetts hasn’t made its way to Wyoming yet. In fact, state health officials say Cowboy State gonorrhea cases were down in 2022.", "url": "https://cowboystatedaily.com/2023/02/14/wyoming-safe-from-super-gonorrhea-strain-so-far/", "urlToImage": "https://cowboystatedaily.com/wp-content/uploads/2023/01/Wyoming-has-gonorrhea-1.20.23.jpg", "publishedAt": "2023-02-14T20:44:40Z", "content": "***For All Things Wyoming, Sign-Up For Our Daily Newsletter***\r\nBy Clair McFarland, General Assignment ReporterClair@CowboyStateDaily.com\r\nAuthorities in Wyoming have not detected a drug-resistant go… [+2297 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Deadly case of 'penile gangrene' linked to improperly applied catheter - Livescience.com", "description": "A man developed a rare and fatal case of gangrene of the penis.", "url": "https://www.livescience.com/deadly-case-of-penile-gangrene-linked-to-improperly-applied-catheter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HKK5rx7TyfmGQxnB7HrU9b-1200-80.jpg", "publishedAt": "2023-02-14T20:17:59Z", "content": "A man developed an \"unusual\" case of gangrene, or tissue death, after an improperly applied external catheter cut off blood flow to his penis and led to a serious bacterial infection. Unfortunately, … [+3050 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sarah Toy", "title": "Eye Drops May Stave Off Nearsightedness in Children - The Wall Street Journal", "description": "Researchers found medicated eye drops used over two years reduced incidence of myopia", "url": "https://www.wsj.com/articles/eye-drops-may-stave-off-nearsightedness-in-children-273466c1", "urlToImage": "https://images.wsj.net/im-724435/social", "publishedAt": "2023-02-14T18:16:00Z", "content": null}, {"source": {"id": null, "name": "crawfordcountynow.com"}, "author": null, "title": "OhioHealth specialists care for the hearts of local cancer patients - crawfordcountynow.com", "description": "MANSFIELD—OhioHealth Mansfield Hospital aims to reduce heart and vascular complications in patients undergoing treatment …", "url": "https://crawfordcountynow.com/local/ohiohealth-specialists-care-for-the-hearts-of-local-cancer-patients/", "urlToImage": "https://crawfordcountynow.sagacom.com/files/2023/02/GettyImages-1271118807-1200x768.jpg", "publishedAt": "2023-02-14T17:35:10Z", "content": "MANSFIELDOhioHealth Mansfield Hospital aims to reduce heart and vascular complications in patients undergoing treatment for cancer. The hospitals cardio-oncology program is the only one of its kind i… [+3332 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rebecca Whittaker", "title": "Sex positions that burn the most calories REVEALED (and the top one might surprise you) - Daily Mail", "description": "Want to know how many calories you burn on a steamy Valentine's evening? Some sex positions burn more than 200 calories in 30 minutes, according to data. Even spooning burns 51 calories", "url": "https://www.dailymail.co.uk/health/article-11736203/Sex-positions-burn-calories-REVEALED-one-surprise-you.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/13/10/67624231-0-image-a-6_1676283992356.jpg", "publishedAt": "2023-02-14T16:36:37Z", "content": "Ever wondered how many calories you can burn through on a steamy Valentine's night? \r\nWell, depending on your position, you might not need to worry about getting your 10,000 steps in.  \r\nIn fact, the… [+3743 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": "Dr. Wu Kuo-Pin", "title": "9 Tips to Get Rid of Stomach Pain, Flatulence, and Gastric Acid Reflux - The Epoch Times", "description": "Modern-day living can often be hectic and result in abnormal eating and diet patterns. Coupled with stress from work, outpatient clinics often come across patients who seek treatment for diseases related to the spleen and stomach, such as stomach pain, flatul…", "url": "https://www.theepochtimes.com/health/9-tips-to-get-rid-of-stomach-pain-flatulence-and-gastric-acid-reflux_5050868.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2023/02/13/woman-upset-stomach--1200x800.jpeg", "publishedAt": "2023-02-14T16:01:30Z", "content": "Modern-day living can often be hectic and result in abnormal eating and diet patterns. Coupled with stress from work, outpatient clinics often come across patients who seek treatment for diseases rel… [+10853 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Lingering symptoms common after COVID hospitalization - National Institutes of Health (.gov)", "description": "Many adults experience problems like coughing, chest pain, and fatigue six months after their stay.", "url": "https://www.nih.gov/news-events/news-releases/lingering-symptoms-common-after-covid-hospitalization", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2023/20230214-hospitalization.jpg", "publishedAt": "2023-02-14T15:57:01Z", "content": null}, {"source": {"id": null, "name": "New York Post"}, "author": "Fox News", "title": "Face masks made ‘little to no difference’ in preventing spread of COVID: study - New York Post ", "description": "A new scientific review suggests that widespread masking may have done little to nothing to curb the transmission of COVID-19.", "url": "https://nypost.com/2023/02/14/face-masks-made-little-to-no-difference-in-preventing-covid-study/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/02/newspress-collage-25754862-1676387092011.jpg?quality=75&strip=all&1676369103&w=1024", "publishedAt": "2023-02-14T15:53:00Z", "content": "The stance of the Centers for Disease Control and Prevention on face masks has taken many twists and turns throughout the COVID pandemic.\r\nAfter initially claiming face coverings werent necessary, th… [+4173 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Leada Gore | lgore@al.com", "title": "Norovirus outbreak: Contagious stomach and intestinal virus spreading in Alabama - AL.com", "description": "A highly contagious stomach bug is making the rounds in the U.S., with outbreaks reported in 14 states, including Alabama.", "url": "https://www.al.com/news/2023/02/norovirus-outbreak-contagious-stomach-and-intestinal-virus-spreading-in-alabama.html", "urlToImage": "https://www.al.com/resizer/f-pOVd4rj1SvGfkngxSylHGNhTc=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/IXYZVVDQYRADDBFXOK3FH4RNXY.jpeg", "publishedAt": "2023-02-14T15:46:00Z", "content": "A highly contagious stomach bug is making the rounds in the U.S., with outbreaks reported in 14 states, including Alabama.\r\nThis season, 225 outbreaks of norovirus have been reported between Aug. 1 a… [+1561 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Screening tool aims to help doctors diagnose more people with COPD - National Institutes of Health (.gov)", "description": "NIH-supported researchers are studying how to improve screening criteria to help primary care providers identify and treat more people with chronic obstructive pulmonary disease.", "url": "https://www.nih.gov/news-events/news-releases/screening-tool-aims-help-doctors-diagnose-more-people-copd", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/news-releases/2023/20230214-copd.jpg", "publishedAt": "2023-02-14T15:40:30Z", "content": null}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Taneia Surles", "title": "How Do You Stop Joint Pain in Cold Weather? - AARP", "description": "Low temperatures can lead to stiff, achy joints. Find out why joint pain in cold weather occurs and the best treatments to restore your energy and flexibility.", "url": "https://www.aarp.org/health/conditions-treatments/info-2023/joint-pain-in-cold-weather.html", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/conditions_treatments/2023/02/1140-kneejointpain.jpg", "publishedAt": "2023-02-14T15:07:06Z", "content": "Have you ever noticed that your joints ache more when the temperatures start to dip?\r\nYoure not alone. A handful of surveys and studies show that individuals with the most common form of arthritis kn… [+2154 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/morgan-chamberlain", "title": "Vitamin D Sufficiency Can Decrease Diabetes Risk By Up To 76% | mindbodygreen - mindbodygreen", "description": "This review is a game changer for metabolic health!", "url": "https://www.mindbodygreen.com/articles/vitamin-d-sufficiency-can-significantly-decrease-diabetes-risk", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/87ek1jgevkh5mdi6a.jpg", "publishedAt": "2023-02-14T15:05:59Z", "content": "Vitamin D plays a key role in glucose metabolism and insulin secretion. As such, evidence suggests that this essential fat-soluble vitaminor, more specifically, the amount you have in your bodyimpact… [+916 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Emily Peck", "title": "Mushroom industry \"confident\" that \"The Last of Us\" won't impact fungi demand - Axios", "description": "Mushroom-based zombies are not exactly appetizing.", "url": "https://www.axios.com/2023/02/14/the-last-of-us-wont-have-the-last-word-on-mushroom-appeal", "urlToImage": "https://images.axios.com/EZVSxBYyhau2apQ1BOQ3mYp2EbY=/0x0:1920x1080/1366x768/2023/02/13/1676309799173.jpg", "publishedAt": "2023-02-14T12:29:20Z", "content": "Most industries welcome product placement on TV shows. But what if your product is mushrooms and they're seen atop zombie heads, or threaded through their decomposing bodies, during the apocalypse? N… [+2537 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dementia: Identifying These Early Signs Can Help Slow Down Cognitive Decline - NDTV", "description": "Continue reading for a list of a few dementia's early warning signals.", "url": "https://www.ndtv.com/health/dementia-identifying-these-early-signs-can-help-slow-down-cognitive-decline-3781827", "urlToImage": "https://c.ndtvimg.com/2020-09/ui0mjhug_stress_625x300_21_September_20.jpg", "publishedAt": "2023-02-14T12:05:26Z", "content": "Dementia can cause short-term memory loss\r\nA set of symptoms that substantially impair memory, reasoning, and social skills are referred to be dementia when they significantly interfere with day-to-d… [+3461 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Huckins", "title": "A Little-Known Inflammatory Disease Is Hiding in Plain Sight - WIRED", "description": "Genetic analyses show a newly discovered condition called Vexas is more common than previously thought—and could explain some patients’ undiagnosed symptoms.", "url": "https://www.wired.com/story/vexas-new-disease-genetics/", "urlToImage": "https://media.wired.com/photos/63eadfb968abaa31c3202eb3/191:100/w_1280,c_limit/vexas_manholdingstomach_science_GettyImages-1133769345.jpg", "publishedAt": "2023-02-14T12:00:00Z", "content": "Vexas would have been discovered a long time ago if it were a garden variety genetic disease, caused by an inherited genetic mutation. For instance, the single gene responsible for familial Mediterra… [+3185 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Study Reveals How CBD Counters Epileptic Seizures - Neuroscience News", "description": "Cannabidiol, or CBD, blocks the ability of lysophosphatidylinositol (LPI) to amplify neural signals in the hippocampus. LPI weakens the signals that counter seizures, further explaining the value of CBD to treat epilepsy.", "url": "https://neurosciencenews.com/cbd-epilepsy-22502/", "urlToImage": "https://neurosciencenews.com/files/2023/02/cbd-epilepsy-neurosicnes.jpg", "publishedAt": "2023-02-14T07:19:15Z", "content": "Summary: Cannabidiol, or CBD, blocks the ability of lysophosphatidylinositol (LPI) to amplify neural signals in the hippocampus. LPI weakens the signals that counter seizures, further explaining the … [+7137 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Cocaine Addiction Makes The Human Brain 'Age' Faster, Scientists Warn - ScienceAlert", "description": "Our brains experience a litany of changes as we age, right down to the way its DNA is translated.", "url": "https://www.sciencealert.com/cocaine-addiction-makes-the-human-brain-age-faster-scientists-warn", "urlToImage": "https://www.sciencealert.com/images/2023/02/MRIScansOfBrain.jpg", "publishedAt": "2023-02-14T06:32:44Z", "content": "Our brains experience a litany of changes as we age, right down to the way its DNA is translated. Now a new study has found that in people with cocaine use disorder those changes can accumulate at an… [+4443 chars]"}, {"source": {"id": null, "name": "Hawaii News Now"}, "author": "Lynn Kawano", "title": "Heart disease kills more women in the US than all forms of cancer. One big reason: Delayed care - Hawaii News Now", "description": "The symptoms for women are often different than those for men.", "url": "https://www.hawaiinewsnow.com/2023/02/14/heart-disease-kills-more-women-us-than-all-forms-cancer-one-big-reason-delayed-care/", "urlToImage": "https://gray-khnl-prod.cdn.arcpublishing.com/resizer/ih1gY5PTKBht3CpzSpLODXtubZ8=/1200x600/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/AFOZ6EMS4VEV5FKIE3MNBOXNCM.JPG", "publishedAt": "2023-02-14T03:52:00Z", "content": "HONOLULU (HawaiiNewsNow) - Heart disease kills women in the U.S. more than any other medical condition, including all forms of cancer combined.\r\nAnd women are diagnosed later than men, often because … [+3143 chars]"}, {"source": {"id": null, "name": "Wrtv.com"}, "author": "Marc Mullins, Michelle Kaufman", "title": "Indianapolis cardiologist says \"broken heart syndrome\" isn't just seen at Valentine's Day - WRTV Indianapolis", "description": "Doctors at Ascension St. Vincent say they're seeing cases of \"broken heart syndrome\" about once a week. The syndrome affects women more than men.", "url": "https://www.wrtv.com/lifestyle/health/indianapolis-cardiologist-says-broken-heart-syndrome-isnt-just-seen-at-valentines-day", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/c06094d/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2Fa06%2F53c3dfd52290407986694c1471cfa82a%2Fa06f9bb9b6dc48c78e0c547a046ccf0b%2Fposter_c1c245d9fa1c4c49952fefb5a3b08f2d.jpg", "publishedAt": "2023-02-14T02:04:42Z", "content": "INDIANAPOLIS Valentine's Day can be an emotional holiday for those who have found love or lost it.\r\nThe American Heart Association says February is American Heart Month, but doctors at Ascension St. … [+1325 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jeanette Settembre", "title": "Why Ozempic weight loss could cost you thousands — in plastic surgery bills - New York Post ", "description": "“It leaves the face looking saggy and gaunt,” one expert told The Post.", "url": "https://nypost.com/2023/02/13/ozempics-side-effects-revealed-sagging-faces-wrinkles/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/02/14N.Ozempic-b4-after.c-1.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-02-13T23:47:00Z", "content": "Last fall, Alla started using Ozempic to lose weight. After six months on the drug, the 55-year-old had dropped 55 pounds from her 5-foot-4-inch frame. Her body looked 10 years younger, but her face … [+5940 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Beth Skwarecki", "title": "Calorie Restriction Is Not a Longevity Hack - Lifehacker", "description": "A new study finds that eating less might make you live longer. That's still not a good reason to do it.", "url": "https://lifehacker.com/calorie-restriction-is-not-a-longevity-hack-1850110037", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/9406ebb5d38b5589686d566560e5a0ae.jpg", "publishedAt": "2023-02-13T23:00:00Z", "content": "If you feed mice less food than they normally eat, they tend to live longer. This mostly consistent finding is the basis for a lot of tech bro biohacks about eating less food. But is it really health… [+4603 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Judy George", "title": "Buprenorphine for Chronic Pain, Not Full Agonist Opioids, New VA Guidance Says - Medpage Today", "description": "Unintended consequences of the recommendation need to be evaluated, experts maintain", "url": "https://www.medpagetoday.com/neurology/painmanagement/103090", "urlToImage": "https://assets.medpagetoday.net/media/images/103xxx/103090.jpg", "publishedAt": "2023-02-13T22:33:10Z", "content": "Buprenorphine, rather than a full agonist opioid, should be used for patients taking daily opioids for chronic pain, given its lower risk for overdose or misuse, new guidelines from the Department of… [+4461 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Swallowing this pill-shaped sensor could help you avoid invasive procedures - TechCrunch", "description": "This new project from a joint team at Caltech and MIT crams sensors into a pill-shaped ingestible module full of sensors.", "url": "https://techcrunch.com/2023/02/13/swallowing-this-pill-shaped-sensor-could-help-you-avoid-invasive-procedures/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/02/MIT-GI-Tracking-02-PRESS.jpg", "publishedAt": "2023-02-13T22:11:17Z", "content": "Ingestible robotics has been a fascinating and growing field for the last several years. Weve already seen a handful of startups working to commercialize a technology that could allow for internal mo… [+1874 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lou Mudge", "title": "9 heart disease risk factors, according to experts - Livescience.com", "description": "It's the leading cause of death in the United States, but what are the top heart disease risk factors?", "url": "https://www.livescience.com/heart-disease-risk-factors", "urlToImage": "https://cdn.mos.cms.futurecdn.net/s87bpV5pUAGUKjeK3xocsb-1200-80.jpg", "publishedAt": "2023-02-13T21:15:08Z", "content": "Heart disease is the leading cause of death in the United States, accounting for 1 in 5 deaths, according to the Centers for Disease Control and Prevention (opens in new tab) (CDC). It encompasses a … [+7536 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Changes in how the heart produces energy may be the earliest signal of cardiac deterioration - Medical Xpress", "description": "Heart failure is often identified only when the heart has already deteriorated. This is in large part because the cause is unknown for about 70% of people who experience heart failure.", "url": "https://medicalxpress.com/news/2023-02-heart-energy-earliest-cardiac-deterioration.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/change-in-how-the-hear.jpg", "publishedAt": "2023-02-13T20:37:45Z", "content": "Heart failure is often identified only when the heart has already deteriorated. This is in large part because the cause is unknown for about 70% of people who experience heart failure.\r\nResearchers a… [+4011 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Anna Werner wernera@cbsnews.com", "title": "UV nail dryers used in gel manicures may increase skin cancer risk, study finds - CBS News", "description": "A former Miss Illinois survived melanoma and says her doctors believe her use of UV nail dryers while getting gel manicures may be linked to the diagnosis.", "url": "https://www.cbsnews.com/news/uv-nail-dryer-gel-manicures-skin-cancer-study/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2023/02/13/8bd604b2-807c-4c8f-9c3f-01a55c40f0cf/thumbnail/1200x630/dd4ee8c01b2047540db33365d28631b5/0213-cbsm-uvnaildryer-werner-1709979-640x360.jpg", "publishedAt": "2023-02-13T20:01:06Z", "content": "Before Karolina Jasko won the Miss Illinois contest in 2018, getting gel manicures had been part of her beauty routine all through high school. Not anymore.\r\nJasko, a former Miss Illinois who compete… [+4011 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Teresa Wright", "title": "Paxlovid slashed severe outcomes for at-risk patients after Omicron surge, study finds - Global News", "description": "Canadians at risk of severe illness from COVID-19 who took Paxlovid had a significantly lower risk of being hospitalized or dying as a result of the virus, a new study shows.", "url": "https://globalnews.ca/news/9483204/covid-paxlovid-reduced-hospitalization-death-study/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/04/CP151352834.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2023-02-13T19:56:33Z", "content": "Canadians at risk of severe illness from COVID-19 who took the antiviral medication Paxlovid significantly reduced their likelihood of being hospitalized or killed by the virus after the Omicron surg… [+2720 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Emergence and spread of two SARS-CoV-2 variants of interest in Nigeria - Nature.com", "description": "Data on geographically restricted SARS-CoV-2 variants is lacking in some regions. In this nationwide effort including 18 public health labs, the authors used genomic epidemiology and travel data to understand the origin and spread of 2 variants of interest th…", "url": "https://www.nature.com/articles/s41467-023-36449-5", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-023-36449-5/MediaObjects/41467_2023_36449_Fig1_HTML.png", "publishedAt": "2023-02-13T18:49:24Z", "content": "Lineage dynamics of SARS-CoV-2 in Nigeria over the first three epidemic waves\r\nWe generated a total of 1577 genomes from samples obtained between March 2020 and September 2021, across the first three… [+14712 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Links found between viruses and neurodegenerative diseases - National Institutes of Health (.gov)", "description": "Researchers found associations between certain viral illnesses and the risk of Alzheimer’s and other neurodegenerative diseases.", "url": "https://www.nih.gov/news-events/nih-research-matters/links-found-between-viruses-neurodegenerative-diseases", "urlToImage": "https://www.nih.gov/sites/default/files/news-events/research-matters/2023/20230209-virus-red-3.jpg", "publishedAt": "2023-02-13T18:15:45Z", "content": "At a Glance\r\n<ul><li>Researchers found associations between certain viral illnesses and the risk of Alzheimers and other neurodegenerative diseases.</li><li>The results suggest that some neurodegener… [+3966 chars]"}]}