{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Third Dose Vaccine Protection Against Hospitalization Wanes After 3 Months - SciTechDaily", "description": "Kaiser Permanente finds the Pfizer COVID-19 third dose vaccine protection against hospitalization from omicron wanes after 3 months. A research study released on April 22, 2022, in The Lancet Respiratory Medicine shows that a booster dose of the Pfizer COVID-…", "url": "https://scitechdaily.com/?p=167498", "urlToImage": "https://scitechdaily.com/images/Three-COVID-19-Vaccine-Doses.jpg", "publishedAt": "2022-04-24T19:13:44Z", "content": "A new research study published in The Lancet Respiratory Medicine shows that protection against the omicron variant deteriorates over time even after a third vaccine dose.\r\nKaiser Permanente finds th… [+2986 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "John Bonifield and Emma Tucker, CNN", "title": "1 death, 17 liver transplants in multi-country outbreak of hepatitis in children, WHO says - KSL.com", "description": "At least 169 cases of acute hepatitis in children aged one month to 16 years old have been identified in an outbreak that now involves 11 countries, the World Health Organization (WHO) said on Saturday.", "url": "https://www.ksl.com/article/50392581/1-death-17-liver-transplants-in-multi-country-outbreak-of-hepatitis-in-children-who-says", "urlToImage": "https://img.ksl.com/slc/2873/287368/28736822.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-04-24T17:33:07Z", "content": "Estimated read time: 2-3 minutes\r\nATLANTA At least 169 cases of acute hepatitis in children aged one month to 16 years old have been identified in an outbreak that now involves 11 countries, the Worl… [+2556 chars]"}, {"source": {"id": null, "name": "mlive.com"}, "author": "Emily Bingham | ebingham@mlive.com", "title": "Why you can expect more ticks this summer in Michigan - MLive.com", "description": "Ticks are increasing across Michigan, making tick-season forecasting feel bleak.", "url": "https://www.mlive.com/news/2022/04/why-you-can-expect-more-ticks-this-summer-in-michigan.html", "urlToImage": "https://www.mlive.com/resizer/g4LbSRSMMt_bcl0T1pSp5Mi_kKM=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/542N2AOGPZFVBKQYFPU4GXH33I.png", "publishedAt": "2022-04-24T11:30:00Z", "content": "As Michigan enters another spring tick season, the overall outlook feels a bit bleak.\r\nOver the past decade these biting arachnids have been expanding their range across the state, and while certain … [+4487 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "San Franciscans React to News of Rise in COVID Infections - KPIX CBS SF Bay Area", "description": "The COVID-19 test positivity rate in San Francisco has risen above 5 percent for the first time in two months. Max Darrow reports. (4-23-22)", "url": "https://www.youtube.com/watch?v=4vjQ47zfZ4o", "urlToImage": "https://i.ytimg.com/vi/4vjQ47zfZ4o/hqdefault.jpg", "publishedAt": "2022-04-24T01:19:50Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "How Do Our Eyes Stay Focused on What We Reach For? - Neuroscience News", "description": "When reaching for a target object, we anchor our gaze to the target of the reach moment, thereby looking at the target for longer periods. This helps make our reach more accurate.", "url": "https://neurosciencenews.com/anchor-gaze-movement-20452/", "urlToImage": "https://neurosciencenews.com/files/2022/04/eye-focus-reaching-neurosines-.jpg", "publishedAt": "2022-04-23T23:11:49Z", "content": "Summary: When reaching for a target object, we anchor our gaze to the target of the reach moment, thereby looking at the target for longer periods. This helps make our reach more accurate.\r\nSource: N… [+5619 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Clinical characteristics with inflammation profiling of long COVID and association with 1-year recovery following hospitalisation in the UK: a prospective observational study - The Lancet", "description": "The sequelae of a hospital admission with COVID-19 were substantial 1 year after discharge\nacross a range of health domains, with the minority in our cohort feeling fully recovered.\nPatient-perceived health-related quality of life was reduced at 1 year compar…", "url": "https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(22)00127-8/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/998fe8c7-3135-42be-b809-19b0f66bfc08/gr1.jpg", "publishedAt": "2022-04-23T22:55:35Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Antidepressants Are Not Associated With Improved Quality of Life in the Long Run - Neuroscience News", "description": "Overall, people who used antidepressants to manage depression long-term did not have a better quality of physical or mental health than those with depression who did not use prescription medication to manage their symptoms.", "url": "https://neurosciencenews.com/antidepressants-life-quality-20451/", "urlToImage": "https://neurosciencenews.com/files/2022/04/antidepressant-life-quality-neurosinces.jpg", "publishedAt": "2022-04-23T22:48:39Z", "content": "Summary: Overall, people who used antidepressants to manage depression long-term did not have a better quality of physical or mental health than those with depression who did not use prescription med… [+5076 chars]"}, {"source": {"id": null, "name": "fox8.com"}, "author": "Ben Raymond, Alix Martichoux, Nexstar Media Wire", "title": "Wildlife officials suggest skipping the bird feeder this year - WJW FOX 8 News Cleveland", "description": "To keep birds – and yourself – safe, you may want to reconsider doing things that encourage the animals to gather.", "url": "https://fox8.com/news/wildlife-officials-suggest-skipping-the-bird-feeder-this-year/", "urlToImage": "https://fox8.com/wp-content/uploads/sites/12/2022/04/GettyImages-827739548-e1650753478210.jpg?w=1280", "publishedAt": "2022-04-23T20:21:00Z", "content": "MARQUETTE, Mich. (WJMN) – Following the detection of the highly pathogenic avian influenza in 31 states, some wildlife officials are making suggestions to help prevent the spread of the virus.\r\nAccor… [+3815 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jessica Rendall", "title": "Why Blood Type Matters for Heart Health, According to Science - CNET", "description": "People with type O blood might be less susceptible to heart disease and blood clots than those with type A or B.", "url": "https://www.cnet.com/health/medical/when-it-comes-to-heart-health-science-says-your-blood-type-matters/", "urlToImage": "https://www.cnet.com/a/img/resize/4997f4f5bff8218b313d321eac13ef68276c6102/2022/04/06/09e950cc-6a85-4232-b765-c6a269142c24/gettyimages-1220468162.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-04-23T17:00:08Z", "content": "Naeblys/Getty Images\r\nDo you know your blood type? \r\nYou wouldn't know it by looking on the surface, but coursing through your veins every second of every day are tiny variations that categorize your… [+5770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova and Nimi Princewill, CNN", "title": "New Ebola outbreak declared in DRC after single case confirmed - CNN", "description": "Health authorities in the Democratic Republic of Congo (DRC) declared a new Ebola outbreak on Friday, after a case was confirmed in the city of Mbandaka, in the northwestern Equateur Province, the World Health Organization (WHO) said in a statement Saturday.", "url": "https://www.cnn.com/2022/04/23/africa/new-ebola-outbreak-drc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200414232700-04-drc-deadly-diseases-super-tease.jpg", "publishedAt": "2022-04-23T15:46:00Z", "content": "(CNN)Health authorities in the Democratic Republic of Congo (DRC) declared a new Ebola outbreak on Friday, after a case was confirmed in the city of Mbandaka, in the northwestern Equateur Province, t… [+2497 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Patricia Bannan", "title": "A nutritionist shares the 35 best foods to boost mood and brain energy levels: 'Put these on your grocery list' - CNBC", "description": "The foods you eat can affect your mood, brain function, immunity and energy levels. Dietitian and nutritionist Patricia Bannon shares 35 essential grocery items that will keep you energized, healthy and happy.", "url": "https://www.cnbc.com/2022/04/23/a-nutritionist-shares-the-best-grocery-foods-to-boost-mood-brain-energy-happiness.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107049081-1650476784972-gettyimages-1192233786-_nm10620.jpeg?v=1650641817&w=1920&h=1080", "publishedAt": "2022-04-23T14:40:01Z", "content": "Food and mood are so intricately connected that they've inspired a new area of brain study: Nutritional psychiatry, which examines how what we eat impacts how we feel.\r\nAs a dietitian and nutritionis… [+3340 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jill Rothenberg", "title": "Take it slow when returning to running with long covid - The Washington Post", "description": "If runners don’t have symptoms such as chest pain and shortness of breath, they can return to exercise but should take their time, says one physician.", "url": "https://www.washingtonpost.com/health/2022/04/23/long-covid-return-to-running/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6MXECEV76UI6ZNO7D65GDJTMOU.jpg&w=1440", "publishedAt": "2022-04-23T12:31:55Z", "content": "Placeholder while article actions load\r\nElise McDonnell was slowly trying to return to running after contracting the coronavirus in August.\r\nI was constantly having to stop and huff and puff, said Mc… [+8865 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Lauren Gray", "title": "If You Notice This in Your Arms and Legs, Get a Blood Test — Best Life - Best Life", "description": "If you notice involuntary movements in your arms or legs, it could be a sign of a serious movement disorder, experts warn.", "url": "http://bestlifeonline.com/movement-disorder-test-news/", "urlToImage": "https://bestlifeonline.com/wp-content/uploads/sites/3/2022/04/Holding-legs.jpg?quality=82&strip=all", "publishedAt": "2022-04-23T12:07:24Z", "content": "Movement disorders are a group of neurological conditions that can cause atypical movements, along with other symptoms. One of the most well-known movement disorders is Parkinson's disease (PD), a ne… [+4417 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "AI tool accurately predicts tumour regrowth in cancer patients - The Guardian", "description": "Exclusive: Tool predicts how likely tumours are to grow back in cancer patients after they have undergone treatment", "url": "https://amp.theguardian.com/society/2022/apr/23/cancer-ai-tool-predicts-tumour-regrowth", "urlToImage": null, "publishedAt": "2022-04-23T06:00:00Z", "content": "CancerExclusive: Tool predicts how likely tumours are to grow back in cancer patients after they have undergone treatment\r\nSat 23 Apr 2022 07.00 BST\r\nDoctors and scientists have developed an artifici… [+4730 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "We Finally Know How Deadly Fungal Meningitis Spreads in The Brain, And It's Brutal - ScienceAlert", "description": "Disease-causing pathogens are notoriously dangerous foes that have evolved many tricks to thwart the body's immune system. Among the most terrifying are ones that can sneak into the nervous system, even infecting the brain.", "url": "https://www.sciencealert.com/scientists-figured-out-how-deadly-fungal-meningitis-spreads-in-the-brain-and-it-s-brutal", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/PurpleAndGreenStainedImageOfBloodVessels_1024.jpg", "publishedAt": "2022-04-23T03:01:20Z", "content": "Disease-causing pathogens are notoriously dangerous foes that have evolved many tricks to thwart the body's immune system. Among the most terrifying are ones that can sneak into the nervous system, e… [+4621 chars]"}]}