{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dementia: Identifying These Early Signs Can Help Slow Down Cognitive Decline - NDTV", "description": "Continue reading for a list of a few dementia's early warning signals.", "url": "https://www.ndtv.com/health/dementia-identifying-these-early-signs-can-help-slow-down-cognitive-decline-3781827", "urlToImage": "https://c.ndtvimg.com/2020-09/ui0mjhug_stress_625x300_21_September_20.jpg", "publishedAt": "2023-02-17T12:25:00Z", "content": "Dementia can cause short-term memory loss\r\nA set of symptoms that substantially impair memory, reasoning, and social skills are referred to be dementia when they significantly interfere with day-to-d… [+3486 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jillian Wilson", "title": "The Most Common Norovirus Symptoms Doctors Are Seeing Right Now - HuffPost", "description": "Cases of the highly contagious stomach virus have increased in recent weeks. Here's what to know.", "url": "https://www.huffpost.com/entry/most-common-norovirus-symptoms_l_63ed454ce4b0255caaefec5a", "urlToImage": "https://img.huffingtonpost.com/asset/63ee968e2600003200133976.jpeg?cache=Y8Gqzrv6Qc&ops=1200_630", "publishedAt": "2023-02-17T10:45:15Z", "content": "Stomach issues and headaches can be some of the most common symptoms of norovirus.\r\nIn regions across the U.S., cases of norovirus are rising. Among many people, it is casually known as a stomach bug… [+5731 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Bird flu alarm drives world towards once-shunned vaccines - Reuters.com", "description": "French duck farmer Herve Dupouy has culled his flock four times since 2015 to stop the spread of bird flu but as a wave of deadly outbreaks nears his farm once again, he says it's time to accept a solution once considered taboo: vaccination.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/bird-flu-alarm-drives-world-towards-once-shunned-vaccines-2023-02-17/", "urlToImage": "https://www.reuters.com/resizer/BaezZzZPACKfgkIeHuIbDPU2rOo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/A3L6BJ4JWFP2XBURPQXBF4TT3Y.jpg", "publishedAt": "2023-02-17T08:35:00Z", "content": "CASTELNAU-TURSAN, France, Feb 17 (Reuters) - French duck farmer Herve Dupouy has culled his flock four times since 2015 to stop the spread of bird flu but as a wave of deadly outbreaks nears his farm… [+7485 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "US cancer patient developed 'uncontrollable' Irish accent - BBC", "description": "Despite never having been to Ireland, the North Carolina man spoke with a \"brogue\" until his death, say researchers.", "url": "https://www.bbc.com/news/world-us-canada-64671894", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/C017/production/_128657194_gettyimages-1204666787.jpg", "publishedAt": "2023-02-17T03:49:25Z", "content": "A US man developed an \"uncontrollable Irish accent\" after being diagnosed with prostate cancer, despite having never visited Ireland, researchers say.\r\nThe North Carolina man, who was in his 50s, was… [+2350 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover How Cannabidiol (CBD) Counters Epileptic Seizures - SciTechDaily", "description": "Study findings suggest specific targets for future drugs. A previously unknown way in which cannabidiol (CBD), a substance found in cannabis, reduces seizures in many treatment-resistant forms of pediatric epilepsy has been revealed by a new scientific study.…", "url": "https://scitechdaily.com/researchers-discover-how-cannabidiol-cbd-counters-epileptic-seizures/", "urlToImage": "https://scitechdaily.com/images/Hippocampus-Brain-Region-Microscope-Image.jpg", "publishedAt": "2023-02-17T03:36:38Z", "content": "ByNYU Langone Health / NYU Grossman School of MedicineFebruary 16, 2023\r\nThis microscope image of the brain region called the hippocampus shows the protein targeted by cannabis-derived CBD, GPR55 (re… [+8667 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Shiv Sudhakar", "title": "A pill may curb binge drinking, researchers have found - Fox News", "description": "A study published in the American Journal of Psychiatry found that the oral pill known as naltrexone significantly reduced binge-drinking outcomes when taken on an as-needed basis.", "url": "https://www.foxnews.com/health/pill-may-curb-binge-drinking-researchers-found", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/iStock-drinking.jpg", "publishedAt": "2023-02-17T02:11:00Z", "content": "Many people express remorse after a drinking binge yet a pill that treats alcohol use disorder may help.\r\nBinge drinking is responsible for thousands of alcohol-related deaths every year. Now, resear… [+7554 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Gina Martinez", "title": "Dog flu cases on the rise in some U.S. regions this winter season - CBS News", "description": "Symptoms for dog flu include a cough, runny nose, fever and reduced appetite, according to the CDC.", "url": "https://www.cbsnews.com/news/dog-flu-canine-influenza-rise-winter/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/30/52545fc1-7e65-4c46-9980-3e810ee27a95/thumbnail/1200x630/6e989f4fd5390d64edb896070c2a875b/dogflu.jpg", "publishedAt": "2023-02-17T01:49:00Z", "content": "Veterinarians are advising dog owners to get their pups vaccinated against the canine influenza as cases have surged in several parts of the U.S. this winter. \r\nCanine influenza, also known as the do… [+2114 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Scientists Discover Mirror Neurons in Mice and Find They’re Tuned to Aggression - Neuroscience News", "description": "Study is the first to find mirror neurons in mice and in the hypothalamus, suggesting mirror neurons may have a more primal origin than previously believed.", "url": "https://neurosciencenews.com/hypothalamus-mirror-neurons-aggression-22519/", "urlToImage": "https://neurosciencenews.com/files/2023/02/mouse-mirror-neuron-aggression-neurosicences-public.jpg", "publishedAt": "2023-02-17T01:34:04Z", "content": "Summary: Study is the first to find mirror neurons in mice and in the hypothalamus, suggesting mirror neurons may have a more primal origin than previously believed.\r\nSource: Stanford University\r\nIn … [+7416 chars]"}, {"source": {"id": null, "name": "Loopnews.com"}, "author": "Melissa Wong", "title": "PAHO provides guidance to countries as chikungunya cases increase | Loop Caribbean News - Loop News Caribbean", "description": "The Pan American Health Organization (PAHO) has called on countries of the Americas to strengthen measures to diagnose and manage chikungunya due to an increase in cases in some areas, higher numbers of susceptible persons and the start of peak", "url": "https://caribbean.loopnews.com/content/paho-provides-guidance-countries-chikungunya-cases-increase", "urlToImage": "https://loopnewslive.blob.core.windows.net/liveimage/sites/default/files/2021-05/IUJKnRTsE8.jpg", "publishedAt": "2023-02-17T01:02:37Z", "content": "The Pan American Health Organization (PAHO) has called on countries of the Americas to strengthen measures to diagnose and manage chikungunya due to an increase in cases in some areas, higher numbers… [+2060 chars]"}, {"source": {"id": null, "name": "WFSB"}, "author": "Jill Gilardi", "title": "How unseasonably warm weather could impact allergy season - Eyewitness News 3", "description": "It has been an unseasonably warm winter and with certain plants already blooming, you might be wondering how this might impact allergy season.", "url": "https://www.wfsb.com/2023/02/17/how-unseasonably-warm-weather-could-impact-allergy-season/", "urlToImage": "https://gray-wfsb-prod.cdn.arcpublishing.com/resizer/NztvxOA0qhYuH_cOXc2nmisS2OY=/1200x600/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/OLHJIT3ZRNFCFPRKLHABFKOKZ4.jpg", "publishedAt": "2023-02-17T00:49:00Z", "content": "ROCKY HILL, CT (WFSB) - It has been an unseasonably warm winter and with certain plants already blooming, you might be wondering how this might impact allergy season.\r\nIt seems like we could be punis… [+1170 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Jessica Flores", "title": "Deadly new avian flu strain detected in wild mammal in California - San Francisco Chronicle", "description": "The H5N1 avian influenza strain that has caused a deadly outbreak in birds in the Bay Area and California has been been found in a bobcat, state officials say.", "url": "https://www.sfchronicle.com/bayarea/article/avian-influenza-california-mammal-17789417.php", "urlToImage": "https://s.hdnux.com/photos/01/30/62/74/23277322/3/rawImage.jpg", "publishedAt": "2023-02-17T00:45:11Z", "content": "For the first time, the deadly new strain of avian influenza virus that has caused an unprecedented outbreak among birds in the Bay Area and statewide has been detected in a wild mammal in California… [+2542 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Past SARS-CoV-2 infection protection against re-infection: a systematic review and meta-analysis - The Lancet", "description": "Protection from past infection against re-infection from pre-omicron variants was\nvery high and remained high even after 40 weeks. Protection was substantially lower\nfor the omicron BA.1 variant and declined more rapidly over time than protection against\nprev…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)02465-5/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/d5bd9757-2dd8-4fc0-ad3e-bb460cb26321/gr1.jpg", "publishedAt": "2023-02-16T23:37:47Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "People with long COVID explain how it changed their lives - PBS NewsHour", "description": "The specter of long COVID, with its mysterious cause, no obvious cure and an unknown duration, haunts millions and millions of people. In this report, we hear from some of those who are suffering with it and William Brangham speaks with Dr. David Putrino of M…", "url": "https://www.pbs.org/newshour/show/people-living-with-long-covid-explain-how-the-disease-changed-their-lives", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/02/LongCovid-1024x683.jpg", "publishedAt": "2023-02-16T23:35:22Z", "content": "David Putrino:\r\nRight now, there's a lot of uncertainty about the underlying causes of long COVID.\r\nBut what we know for sure is that long COVID is an organic disease. So, we understand that the viru… [+1082 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Marissa Matozzo", "title": "The One Supplement That Experts Say Is Practically Useless For Weight Loss - Yahoo Life", "description": "When it comes to losing weight healthily, experts often stress that maintaining a balanced diet, hydrating frequently and sticking to a consistent workout...", "url": "https://www.shefinds.com/collections/supplement-experts-practically-useless-weight-loss/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/1214ffe46ce2183019e811709d2b8597", "publishedAt": "2023-02-16T23:30:23Z", "content": "When it comes to losing weight healthily, experts often stress that maintaining a balanced diet, hydrating frequently and sticking to a consistent workout schedule is key. Another way that many suppo… [+3022 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "Covid-19 infection offers strong protection against reinfection for about 10 months, study finds - CNN", "description": "For at least 10 months after a Covid-19 infection, your immune system can provide good protection against symptomatic illness the next time around, a new study found, and the risk of severe illness is even lower.", "url": "https://www.cnn.com/2023/02/16/health/covid-19-infection-immunity/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230105121501-covid-testing-file-2022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-16T23:30:00Z", "content": "For at least 10 months after a Covid-19 infection, your immune system can provide good protection against symptomatic illness the next time around, a new study found, and the risk of severe illness i… [+4072 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Discovery in Zebrafish May Yield Better Understanding of a Range of Mental Health Disorders Related to Stress and Anxiety - Neuroscience News", "description": "Deficiencies in DSCAML1 disrupt normal brain development and increase baseline levels of cortisol, making the hormone less able to function correctly during periods of stress. The findings shed new light on programmed cell death in the developing brain and co…", "url": "https://neurosciencenews.com/stress-anxiety-genetics-22519/", "urlToImage": "https://neurosciencenews.com/files/2023/02/zebrafish-mental-health-neurosines-public.jpg", "publishedAt": "2023-02-16T23:20:43Z", "content": "Summary: Deficiencies in DSCAML1 disrupt normal brain development and increase baseline levels of cortisol, making the hormone less able to function correctly during periods of stress. The findings s… [+7027 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sensory Signals Are Integrated Differently, Underrepresented by Neurons in Autism - Neuroscience News", "description": "Environmental sensory signals are integrated differently in those with Fragile X syndrome, causing them to be underrepresented by cortical pyramidal neurons.", "url": "https://neurosciencenews.com/fxs-asd-sensory-neurons-22518/", "urlToImage": "https://neurosciencenews.com/files/2023/02/sensory-signals-autism-neurosciences-public.jpg", "publishedAt": "2023-02-16T22:45:24Z", "content": "Summary: Environmental sensory signals are integrated differently in those with Fragile X syndrome, causing them to be underrepresented by cortical pyramidal neurons.\r\nSource: University of Montreal\r… [+5907 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Lauren Leffer", "title": "What to Know About the New Marburg Virus Outbreak - Gizmodo", "description": "At least 9 people have died from the Ebola-like hemorrhagic fever in Equatorial Guinea's first known outbreak of the disease, according to the WHO.", "url": "https://gizmodo.com/marburg-virus-outbreak-equatorial-guinea-cases-vaccine-1850123989", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/34d23153dd63ca50270ccdfc86422f7a.jpg", "publishedAt": "2023-02-16T22:15:00Z", "content": "A new outbreak of the deadly Marburg virus has infected a suspected 25 people and potentially killed nine in the Central African country of Equatorial Guinea, the World Health Organization announced … [+4296 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Growing Threat: New Insight Into Deadly Fungal Invasion of the Lungs - SciTechDaily", "description": "The discovery reveals a new target for combating the deadly invader. Aspergillus and other fungi are so ubiquitous in our environment that we inhale hundreds to thousands of spores daily. Usually, they do not pose a danger to healthy individuals, but can prov…", "url": "https://scitechdaily.com/a-growing-threat-new-insight-into-deadly-fungal-invasion-of-the-lungs/", "urlToImage": "https://scitechdaily.com/images/Fungus-Cells.jpg", "publishedAt": "2023-02-16T22:11:00Z", "content": "ByUniversity of CalgaryFebruary 16, 2023\r\nAspergillus is a type of fungus commonly found in soil and decaying organic matter. While some species of Aspergillus are benign, others can cause infections… [+4663 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew Miller", "title": "Florida boy dies from infection after twisting ankle on treadmill: 'Complete disbelief' - Fox News", "description": "An 11-year-old boy in Florida has died after twisting his ankle on a treadmill and then suffering from an infection that caused swelling in his brain.", "url": "https://www.foxnews.com/us/florida-boy-dies-infection-twisting-ankle-treadmill-complete-disbelief", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/Jesse1.jpg", "publishedAt": "2023-02-16T21:54:00Z", "content": "The family of an 11-year-old Florida boy says he died from an infection just weeks after twisting his ankle on a treadmill.\r\nJesse Browns family told Fox 35 Orlando\r\n that he was a healthy fifth-grad… [+2073 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Receptor Location Matters for Psychedelic Drug Effects - Neuroscience News", "description": "Location bias may explain how psychedelic medications work. Researchers found that engaging serotonin 2A receptors inside neurons promotes the growth of new connections, but engaging the same receptor on the outside of a neuron does not. The findings may guid…", "url": "https://neurosciencenews.com/psychedelics-serotonin-neurons-22516/", "urlToImage": "https://neurosciencenews.com/files/2023/02/receptor-location-psychedelics-neurosinces-.jpg", "publishedAt": "2023-02-16T21:49:43Z", "content": "Summary: Location bias may explain how psychedelic medications work. Researchers found that engaging serotonin 2A receptors inside neurons promotes the growth of new connections, but engaging the sam… [+4441 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Adrianna Rodriguez, USA TODAY", "title": "Male birth control study in mice shows promise for fast contraceptive - USA TODAY", "description": "While the road from mice models to humans may take years, the demand for male birth control options will continue to grow, experts say.", "url": "https://www.usatoday.com/story/news/health/2023/02/16/male-birth-control-mice-study/11271075002/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/02/16/USAT/610834b3-45d6-46db-86e1-f554545b3c38-GettyImages-941237896.jpg?auto=webp&crop=2120,1193,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-02-16T21:44:49Z", "content": "When it comes to birth control for men, there are only two options: condoms or surgery. But a recent study in mice shows a promising new alternative.  \r\nResearchers at Weill Cornell Medicine tested a… [+4986 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Using Stool Samples as an Indicator of Early Form of Parkinson’s - Neuroscience News", "description": "Researchers report a greater concentration of alpha-synuclein aggregates was found in stool samples from Parkinson's patients who suffered isolated REM-sleep behavior disorder.", "url": "https://neurosciencenews.com/parkinsons-stool-sample-22515/", "urlToImage": "https://neurosciencenews.com/files/2023/02/stool-sample-parkinsons-neurosicence-spublic.jpg", "publishedAt": "2023-02-16T21:15:42Z", "content": "Summary: Researchers report a greater concentration of alpha-synuclein aggregates was found in stool samples from Parkinson’s patients who suffered isolated REM-sleep behavior disorder.\r\nSource: Hein… [+5734 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Some People Get ADHD? Researchers Link 27 Genetic Variants - SciTechDaily", "description": "A large international study has identified 27 loci in the human genome with genetic variants that increase the risk of ADHD. This is more than twice as many as previous studies have found. Why do some people get ADHD, while others do not? And how early in lif…", "url": "https://scitechdaily.com/why-do-some-people-get-adhd-researchers-link-27-genetic-variants/", "urlToImage": "https://scitechdaily.com/images/Genetics-Engineering-Research-Concept.jpg", "publishedAt": "2023-02-16T20:49:58Z", "content": "ByAarhus UniversityFebruary 16, 2023\r\nA study that examined over six million genetic variants was conducted on 38,691 individuals diagnosed with ADHD and 186,843 individuals without ADHD. This enable… [+8704 chars]"}, {"source": {"id": null, "name": "10News"}, "author": "Pat Mueller", "title": "Trolley riders possibly exposed to tuberculosis, San Diego County says - ABC 10 News San Diego KGTV", "description": "The County of San Diego Health and Human Services Agency and MTS officials are notifying people who used the trolley's blue and orange lines between June 30, 2022, to Dec. 31, 2022.", "url": "https://www.10news.com/news/trolley-riders-may-have-been-exposed-to-tuberculosis-san-diego-county-says", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/72ec0a9/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsharing.10news.com%2Fsharescnn%2Fphoto%2F2018%2F07%2F08%2FGettyImages-1667722_1531059670018_91827494_ver1.0_640_480.jpg", "publishedAt": "2023-02-16T20:11:00Z", "content": "SAN DIEGO (KGTV) San Diego County health officials say Metropolitan Transit System Trolley riders may have been exposed to tuberculosis throughout the second half of 2022.\r\nThe County of San Diego He… [+3349 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Sandra Erwin", "title": "Lockheed Martin completes delivery of 10th GPS 3 satellite - SpaceNews", "description": "Lockheed Martin completes delivery of 10th GPS 3 satellite", "url": "https://spacenews.com/the-u-s-space-force-accepted-delivery-of-the-10th-and-final-gps-3-satellite-made-by-lockheed-martin-under-a-2008-contract/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/02/51200755636_ec30091f78_k.jpg", "publishedAt": "2023-02-16T19:57:09Z", "content": "WASHINGTON The U.S. Space Force accepted delivery of the 10th and final GPS 3 satellite made by Lockheed Martin under a 2008 contract.\r\nOf the 10 satellites built, six have been launched and four are… [+1910 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Korin Miller", "title": "Study: Experts Suggest Irregular Sleep Raises Your Risk of Heart Disease - Prevention Magazine", "description": "So, what counts as “irregular”?", "url": "https://www.prevention.com/health/sleep-energy/a42940071/irregular-sleep-heart-disease-study/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/woman-sleeping-on-bed-royalty-free-image-1676567540.jpg?crop=1.00xw:0.620xh;0,0.301xh&resize=1200:*", "publishedAt": "2023-02-16T18:59:01Z", "content": "For years, health experts have stressed the importance of getting a good nights sleep for your overall health. But a new study found having irregular sleep patterns can be rough on your heart in part… [+10293 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "Diabetes Drug Tied to Lower Dementia Risk - Medscape", "description": "New research supports the potential cognitive benefit of pioglitazone, particularly in the setting of high ischemic burden, suggesting a possible personalized avenue to treatment.", "url": "https://www.medscape.com/viewarticle/988388", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230216_dementia_brain_800x450.jpg", "publishedAt": "2023-02-16T18:30:54Z", "content": "Treatment with the thiazolidinedione pioglitazone may offer the greatest protection against dementia for older adults with newly diagnosed type 2 diabetes mellitus (T2DM) who have a history of stroke… [+5320 chars]"}, {"source": {"id": null, "name": "Theeverygirl.com"}, "author": "katherine", "title": "5 Expert Tips to Combat Chronic Inflammation - The Everygirl", "description": "heal the body from inside out", "url": "http://theeverygirl.com/expert-tips-chronic-inflammation/", "urlToImage": "https://media.theeverygirl.com/wp-content/uploads/2023/02/chronic-inflammation-4.jpg", "publishedAt": "2023-02-16T18:06:34Z", "content": "Theres no denying inflammation has a bad rap: its tied with stress, it usually comes with pain and discomfort, and its the root cause of many diseases. But PSA: not all inflammation is bad. In fact, … [+9109 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Karla Walsh", "title": "Exposure to High Levels of Plastic Compounds May Increase Diabetes Risk by 63%, New Study Finds - EatingWell", "description": "Here's the recycling code number to look for—and try to avoid—if you want to reduce your exposure.", "url": "https://www.eatingwell.com/article/8030030/high-levels-of-phthalates-risk-for-diabetes-study/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B1040%2C666%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2023%2F02%2F16%2FWomen-exposed-to-high-levels-of-phthalates-may-have-63-higher-risk-for-developing-diabetes-a-new-study-suggests.jpg", "publishedAt": "2023-02-16T17:27:47Z", "content": "Although you might not realize it, plastic permeates our lives in many more ways than just those disposable drink straws. Plastic is in the packaging for our foods and drinks, in some clothing produc… [+5707 chars]"}, {"source": {"id": null, "name": "The News Leader"}, "author": "Monique Calello", "title": "Multiple Sclerosis discovery could end disease's chronic inflammation - The News Leader", "description": "UVA finding suggests new treatment approach for MS and other autoimmune diseases.", "url": "https://www.newsleader.com/story/news/2023/02/16/multiple-sclerosis-discovery-could-end-disease-chronic-inflammation-uva-health/69910393007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/02/16/PSTA/e09a479f-aad9-48fd-b632-04c2eeb069a5-Alban_Gaultier_01HR_DA.jpg?crop=5471,3077,x1,y218&width=3200&height=1800&format=pjpg&auto=webp", "publishedAt": "2023-02-16T17:02:56Z", "content": "<ul><li>UVA finding suggests new treatment approach for MS, autoimmune diseases.</li></ul>CHARLOTTESVILLE Multiple sclerosis affects nearly a million Americans.\r\nSymptoms can include muscle spasms, s… [+3455 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Risk of diabetes rises 58% after COVID, even amid omicron, study finds - Ars Technica", "description": "This is the latest study finding COVID infections can spur the development of diabetes.", "url": "https://arstechnica.com/science/2023/02/risk-of-diabetes-rises-58-after-covid-even-amid-omicron-study-finds/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/GettyImages-1208202042-760x380.jpeg", "publishedAt": "2023-02-16T16:57:23Z", "content": "Enlarge/ A woman with diabetes pricks her finger to take a blood sample to measure the glycemia in Paris on March 24, 2020.\r\n66 with \r\nA person's odds of getting a new diabetes diagnosis were 58 perc… [+4193 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Sade Agard", "title": "Singapore releases millions of disease-ridden mosquitoes. Here's why. - Interesting Engineering", "description": "Singapore uses AI and automation to help release millions of disease-ridden mosquitoes in an effort to fight the deadly dengue virus.", "url": "https://interestingengineering.com/science/singapore-releases-millions-diseased-mosquitoes", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/02/16/image/jpeg/9Wx5riooIkMSsKZpCAlKkCpjoBPb5ScEPnglvvdq.jpg", "publishedAt": "2023-02-16T16:10:00Z", "content": "All of the mosquitoes in the NEA are Aedes aegypti, according to Undark, which is a type that may infect humans with viruses like dengue. Each year, up to 400 million people get infected with the den… [+1120 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genetics of sexually dimorphic adipose distribution in humans - Nature.com", "description": "The identification of genes and enhancers associated with waist-to-hip ratio adjusted for body mass index (WHRadjBMI) in women highlights variants within Alu retrotransposons. The WHRadjBMI-linked gene SNX10 plays a role in human adipocyte differentiation and…", "url": "https://www.nature.com/articles/s41588-023-01306-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01306-0/MediaObjects/41588_2023_1306_Fig1_HTML.png", "publishedAt": "2023-02-16T16:03:42Z", "content": "<li>Alexopoulos, N., Katritsis, D. &amp; Raggi, P. Visceral adipose tissue as a source of inflammation and promoter of atherosclerosis. Atherosclerosis233, 104112 (2014).\r\nArticle \r\n CAS \r\n PubMed \r\n… [+14239 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Laura Ramirez-Feldman", "title": "Is it worth removing your fallopian tubes if you're not at an obvious risk of ovarian cancer? A top advocacy group recommends it - Yahoo! Voices", "description": "An ovarian cancer research group is urging women, regardless of risk, to consider removing their fallopian tubes if they are done having children and...", "url": "https://news.yahoo.com/removing-fallopian-tubes-not-obvious-risk-ovarian-cancer-advocacy-group-recommends-144125768.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/fhTGDKWdCKCltf0wxXH8ig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTg-/https://s.yimg.com/os/creatr-uploaded-images/2020-12/57b0ac40-4b82-11eb-9afc-cc8a547b7132", "publishedAt": "2023-02-16T14:41:25Z", "content": "The surgery to remove both fallopian tubes is called a bilateral salpingectomy. (Getty Images)\r\nOvarian cancer is a relatively rare disease that mainly affects older women. However, it is also a cond… [+7327 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "Racial trauma: Causes, symptoms and how to cope - CNN", "description": "Racial trauma isn't an official diagnosis, but it can impact the well-being of individuals and communities. Experts of color share their experiences and how people can cope while racism remains.", "url": "https://www.cnn.com/2023/02/16/health/racial-trauma-meaning-symptoms-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230209152150-02-racial-trauma-wellness-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-16T14:04:00Z", "content": "When CNN Chief Medical Correspondent Dr. Sanjay Gupta was growing up in a small rural town in Michigan, he wanted to change his name to Steve hoping that would put an end to the anti-Asian taunts he … [+8562 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Preventing Dementia and Cognitive Impairment: The Powerful Benefits of More Steps and Moderate Exercise - SciTechDaily", "description": "According to a new study led by the Herbert Wertheim School of Public Health and Human Longevity Science at the University of California San Diego, older women who engage in more daily walking and moderate-to-vigorous physical activity have a lower likelihood…", "url": "https://scitechdaily.com/preventing-dementia-and-cognitive-impairment-the-powerful-benefits-of-more-steps-and-moderate-exercise/", "urlToImage": "https://scitechdaily.com/images/Dementia-Declining-Brain-Cognition.jpg", "publishedAt": "2023-02-16T12:33:01Z", "content": "ByUniversity of California - San DiegoFebruary 16, 2023\r\nDementia is a progressive brain disorder that affects memory, thinking, behavior, and the ability to perform everyday tasks. It is a group of … [+5740 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "Stevia a “Sweeter” Alternative to Sugar for Planet Health - Technology Networks", "description": "A new study from the University of Surrey finds that sweeteners derived from stevia produce ~10% of the greenhouse gas emissions of sugar.", "url": "https://www.technologynetworks.com/applied-sciences/news/stevia-a-sweeter-alternative-to-sugar-for-planet-health-370302", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/370302/stevia-a-sweeter-alternative-to-sugar-for-planet-health-370302-640x360.jpg?cb=20230216", "publishedAt": "2023-02-16T12:13:14Z", "content": "A new study from the University of Surrey finds that sweeteners derived from stevia produce ~10% of the greenhouse gas emissions of sugar. The research is published in The International Journal of Li… [+3721 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "The Slim-Down Workout You Need at 50 To Get Your Body Back to 40 - Eat This, Not That", "description": "An expert shares the ultimate slim-down workout you need at 50 to get your body back to 40, along with the benefits of building muscle.", "url": "https://www.eatthis.com/workout-get-body-back-to-40/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/02/mature-woman-pushups-outdoors.jpg?quality=82&strip=all", "publishedAt": "2023-02-16T12:00:27Z", "content": "With each passing decade, it's natural to compare your current self to your younger self. In your younger years, you had the energy and stamina to run miles, lift heavy weights, and juggle different … [+4864 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Aria Bendix", "title": "The race to an RSV vaccine could soon be over, decades after the first attempt - AOL", "description": "No RSV vaccine has ever been approved in the US. Decades after the first attempt to develop an RSV shot, the FDA is poised to approve several this year.", "url": "https://www.nbcnews.com/health/health-news/rsv-vaccine-candidates-timeline-fda-approval-rcna70777", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6KXfmV3kTjrWwa7zKVQ05w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/aol_nbc_universal_184/6f87fdaa518843de6ada59d510c40194", "publishedAt": "2023-02-16T11:00:00Z", "content": "Roughly six decades after the first attempt to develop a vaccine for respiratory syncytial virus, the Food and Drug Administration is poised to approve several shots by next winter.\r\nNo RSV vaccine h… [+4681 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "Burning fat: Exercising in the morning may give better results - Medical News Today", "description": "Exercising at the right time of the day may be able to increase the amount of fat burned by physical activity, a study in mice suggests.", "url": "https://www.medicalnewstoday.com/articles/can-physical-activity-at-the-right-time-of-day-increase-fat-loss", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/02/Time_exercise_GettyImagesdv484009_Thumb.jpg", "publishedAt": "2023-02-16T10:23:48Z", "content": "<ul><li>Exercise plays an important role in a persons overall health. </li><li>Much debate still exists over what the best time of day is for a person to exercise. </li><li>Researchers have found via… [+5017 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": null, "title": "Will psychedelics become legal for treating mental illness? - CNBC", "description": "Psychedelics such as psilocybin, ketamine, LSD and MDMA are lately being discussed because of their alleged potential to treat mental health disorders.", "url": "https://www.cnbc.com/video/2023/02/16/will-psychedelics-become-legal-for-treating-mental-illness.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107195501-1676543088816-IK_Psychedelics.jpg?v=1676551768&w=1920&h=1080", "publishedAt": "2023-02-16T05:27:00Z", "content": "Global sales of antidepressant drugs are expected to exceed $20 billion by 2030. Now, some investors are betting that psychedelic therapies can grab a share of that enormous market.\r\nDue to their min… [+932 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Neurologists Diagnose The Youngest Case of Alzheimer's Ever Reported - ScienceAlert", "description": "Neurologists at a memory clinic in China have diagnosed a 19-year-old with what they believe to be Alzheimer's disease, making him the youngest person to be diagnosed with the condition in the world.", "url": "https://www.sciencealert.com/neurologists-diagnose-the-youngest-case-of-alzheimers-ever-reported", "urlToImage": "https://www.sciencealert.com/images/2023/02/NeuronGlowsRedInsideBrain.jpg", "publishedAt": "2023-02-16T05:16:28Z", "content": "Neurologists at a memory clinic in China have diagnosed a 19-year-old with what they believe to be Alzheimer's disease, making him the youngest person to be diagnosed with the condition in the world.… [+3298 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Mothers' alcohol consumption before and during pregnancy is linked to changes in children's face shapes - Medical Xpress", "description": "Researchers have used artificial intelligence (AI) and deep learning technology to find a link between alterations in the shape of children's faces and the amount of alcohol their mothers drank, both before becoming pregnant and during pregnancy.", "url": "https://medicalxpress.com/news/2023-02-mothers-alcohol-consumption-pregnancy-linked.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/mothers-alcohol-consum.jpg", "publishedAt": "2023-02-16T00:10:01Z", "content": "Researchers have used artificial intelligence (AI) and deep learning technology to find a link between alterations in the shape of children's faces and the amount of alcohol their mothers drank, both… [+6998 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Megan Cerullo", "title": "Diabetes drug Ozempic is being prescribed for weight loss. Now the drug is in short supply. - CBS News", "description": "Social media buzz is driving up demand for the drug, with celebs like Elon Musk hyping its ability to control weight.", "url": "https://www.cbsnews.com/news/ozempic-type-2-diabetes-drug-weight-loss-supply-shortage/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/02/15/1761d265-c446-4393-b4b9-e0f9466c1793/thumbnail/1200x630/32af3268cebffd0c695e4690e210a38f/gettyimages-1215178650.jpg", "publishedAt": "2023-02-15T22:41:00Z", "content": "A drug used to treat Type 2 diabetes has become wildly popular due to one of its side effects: weight loss. \r\nDemand for semaglutide, the generic form of brand name drugs Ozempic, Wegovy and Rybelsus… [+7274 chars]"}, {"source": {"id": null, "name": "KFOR Oklahoma City"}, "author": "Lauren Daniels/KFOR", "title": "Oklahoma City researcher finds link between certain vegetables, macular degeneration prevention - KFOR Oklahoma City", "description": "We’ve always been told to eat our carrots to keep our eyes sharp, but a local scientist says there’s evidence certain veggies really are the key to better vision.", "url": "https://kfor.com/news/local/okc-researcher-finds-link-between-certain-vegetables-macular-degeneration/", "urlToImage": "https://kfor.com/wp-content/uploads/sites/3/2023/01/0d68dffbf9594fa89d2b9cbcb13ffb48.jpg?w=1280", "publishedAt": "2023-02-15T22:40:00Z", "content": "OKLAHOMA CITY (KFOR) – We’ve always been told to eat our carrots to keep our eyes sharp, but a local scientist says there’s evidence certain veggies really are the key to better vision.\r\nThe local re… [+1537 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gretchen Reynolds", "title": "Does sex count as exercise? - The Washington Post", "description": "Sexual intercourse burns calories, raises the heart rate and rarely causes cardiac arrest.", "url": "https://www.washingtonpost.com/wellness/2023/02/15/sex-exercise-calories-heart/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JEYO7THIBAWHFZDTQ3A4SDWGPM.jpg&w=1440", "publishedAt": "2023-02-15T22:23:52Z", "content": "Comment on this story\r\nWhether its Valentines Day, the next day or pretty much any day throughout the entirety of a typical year, many couples will be indulging in sexual relations. Some, glancing at… [+7191 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Danielle DeAngelis", "title": "Why You Shouldn't Avoid \"Processed\" Foods, According to Dietitians - EatingWell", "description": "Plus, these are the misconceptions you may have about food shopping on a budget.", "url": "https://www.eatingwell.com/article/8029985/why-you-shouldnt-avoid-processed-foods-according-to-dietitians/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B960%2C573%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2023%2F02%2F15%2FThe-Processed-Foods-You-Should-Be-Stocking-Up-On-According-to-Dietitians.jpg", "publishedAt": "2023-02-15T21:54:11Z", "content": "While always having fresh produce on hand may be ideal, constantly keeping your kitchen stocked with fresh ingredients may not be sustainable or affordable for your lifestyle. Fortunately, there are … [+7078 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Elizabeth Shaw, M.S., RDN, CPT", "title": "Can You Eat Dried Fruit If You Have Diabetes? - EatingWell", "description": "Find out from a nutrition expert how to include dried fruit in your diet if you have diabetes.", "url": "https://www.eatingwell.com/article/8029992/can-you-eat-dried-fruit-if-you-have-diabetes/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B1020%2C653%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2023%2F02%2F15%2FCan-You-Eat-Dried-Fruit-If-You-Have-Diabetes.jpg", "publishedAt": "2023-02-15T21:41:58Z", "content": "According to the latest National Diabetes Statistics Report, approximately 11.3% of the U.S. population (or 37.3 million people) have diabetes and another 38% of adults (or 96 million people) over th… [+8917 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Alexa Mikhail", "title": "If you want to live longer, make this the biggest meal of the day - Fortune", "description": "Breakfast really is the most important meal of the day: Research shows it can even help you live longer", "url": "https://fortune.com/well/2023/02/15/longevity-make-breakfast-biggest-meal/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/02/Well-Oatmeal-Blue-Zone-Breakfast-GettyImages-1249206154.jpg?resize=1200,600", "publishedAt": "2023-02-15T20:02:00Z", "content": "Busy mornings can leave us rushing out the door without making time for breakfastnearly 25% of Americans forgo this meal. And that could have negative long-term consequences.Eating on the go and savi… [+4163 chars]"}, {"source": {"id": null, "name": "Coloradoan"}, "author": ", Fort Collins Coloradoan", "title": "Avian flu: What to know about the health risks to people and pets - Coloradoan", "description": "Three mammals in Colorado, including a skunk in Weld County, have contracted the deadly disease.", "url": "https://www.coloradoan.com/story/news/2023/02/15/avian-flu-what-to-know-about-the-health-risks-to-people-and-pets/69904008007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/01/18/PFTC/e2a75c5d-dec6-4320-8dd5-e8062a6c7dac-MicrosoftTeams-image_10.png?auto=webp&crop=1023,576,x0,y94&format=pjpg&width=1200", "publishedAt": "2023-02-15T19:57:34Z", "content": "A mountain lion outside of Gunnison is the most recent of three mammals in Colorado to have died from highly pathogenic avian influenza.\r\nThat prompted Colorado health and wildlife officials to cauti… [+3643 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Increasing Lifespan by 10%: Scientists Identify a New Promising Anti-Aging Drug - SciTechDaily", "description": "Researchers in New Zealand have discovered a drug that has the potential for longer and healthier aging. An Aotearoa New Zealand study, recently published in the renowned journal Nature Aging, has advanced the timeless pursuit of immortality. The University o…", "url": "https://scitechdaily.com/?p=252217", "urlToImage": "https://scitechdaily.com/images/Man-Holding-a-Pill-Medicine-Drug.jpg", "publishedAt": "2023-02-15T19:50:25Z", "content": "However, it is important to note that the researchers do not recommend taking this drug as there are some side effects.\r\nResearchers in New Zealand have discovered a drug that has the potential for l… [+2624 chars]"}, {"source": {"id": null, "name": "Vulture"}, "author": "Jackson McHenry", "title": "Why Not Simply Eat 'The Last of Us' Fungus? - Vulture", "description": "Why not simply eat the fungus from ‘The Last of Us’? It looks tasty. It might be fun to eat. Nobody is considering this.", "url": "http://www.vulture.com/article/why-not-simply-eat-the-last-of-us-fungus.html", "urlToImage": "https://pyxis.nymag.com/v1/imgs/ee7/db7/39b94323360e3ef59fd8d235141e58f206-the-last-of-us-infected-1.1x.rsocial.w1200.jpg", "publishedAt": "2023-02-15T19:00:03Z", "content": "Watching HBOs big Sunday-night video-game adaptation, The Last of Us, makes me feel a lot of things: sadness (most of the time); anxiety about evading capture (even more of the time); bafflement at s… [+1584 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Adrianna Rodriguez, USA TODAY", "title": "Menopause hormone therapy, explained: How treatment can ease symptoms - USA TODAY", "description": "Menopause symptoms can be treated with hormone therapy, but some doctors are hesitant to use it. A report this week explains who is most at risk.", "url": "https://www.usatoday.com/story/news/health/2023/02/15/menopause-hormone-therapy-risks/11247338002/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/02/15/USAT/b8b1fae8-90fc-466e-b714-d61917ecfab0-GettyImages-1396004549.jpg?auto=webp&crop=2159,1215,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-02-15T17:52:53Z", "content": "Hot flashes. Night sweats. Depression and anxiety.   \r\nMenopause symptoms can range from disruptive to debilitating, yet health experts say many clinicians have historically shied away from hormone t… [+5445 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Jeanna D. Smiley", "title": "Healthy, plant-rich diets help lower the risk of early death, new study confirms - Medical News Today", "description": "Recent research confirms that people who follow healthy diets rich in vegetables, legumes, fruit, whole grains, and nuts have a lower risk of premature death.", "url": "https://www.medicalnewstoday.com/articles/psoriasis-treatments-and-studies-update-2", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/02/healthy_eating_prevent_premature_death_732x549_thumb.jpg", "publishedAt": "2023-02-15T17:15:35Z", "content": "<ul><li>Unhealthy eating habits are among the leading causes of early death around the world.</li><li>Harvard researchers have recently found that a variety of healthy diets may help lower the risk o… [+7015 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A NPAS4–NuA4 complex couples synaptic activity to DNA repair - Nature.com", "description": "A neuron-specific activity-dependent DNA repair mechanism is identified, the impairment of which may lead to neurodevelopmental disorders, neurodegeneration and ageing.", "url": "https://www.nature.com/articles/s41586-023-05711-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05711-7/MediaObjects/41586_2023_5711_Fig1_HTML.png", "publishedAt": "2023-02-15T16:03:30Z", "content": "Experimental models\r\nMouse models\r\nAnimal use was approved and overseen by the Harvard University Institutional Animal Care and Use Committee and the Harvard Center for Comparative Medicine. The foll… [+91322 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Drug That Cures Autism? Neuroscience Study Yields Promising Results - SciTechDaily", "description": "The behavioral disorders observed in autism are associated with a multitude of genetic alterations. Scientists from the Hector Institute for Translational Brain Research (HITBR) have now found another molecular cause for this condition. The transcription fact…", "url": "https://scitechdaily.com/?p=252035", "urlToImage": "https://scitechdaily.com/images/Prescription-Drug-Concept.jpg", "publishedAt": "2023-02-15T14:32:04Z", "content": "In a new study, a drug that blocks sodium channels was shown to curb autism-associated behaviors such as hyperactivity in mice. The drug, lamotrigine sold under the brand name Lamictal among others i… [+5089 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Korin Miller", "title": "4 Berberine Benefits For Your Health, According To RDs - Women's Health", "description": "Who should definitely not try it, according to experts.", "url": "https://www.womenshealthmag.com/health/a42779791/berberine-health-benefits/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/cropped-hand-of-woman-holding-capsule-against-blue-royalty-free-image-1675888308.jpg?crop=1xw:0.75035xh;center,top&resize=1200:*", "publishedAt": "2023-02-15T13:13:54Z", "content": "You may already be taking a \r\nmultivitamin and know how important having enough of certain vitamins and minerals (you know, like vitamin D, iron, and zinc) is for your health. But once in a while you… [+7145 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "Too much added sugar could harm your health, study says - CNN", "description": "Eating high amounts of free or added sugars could increase risk for cardiovascular disease, a new study has found.", "url": "https://www.cnn.com/2023/02/14/health/added-free-sugars-cardiovascular-disease-risk-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230214131548-assorted-cookies-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-15T12:10:00Z", "content": "Sign up for CNNs Eat, But Better: Mediterranean Style. Our eight-part guide shows you a delicious expert-backed eating lifestyle that will boost your health for life.\r\nEating a lot of free sugars als… [+6044 chars]"}]}