{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "Chris Baraniuk", "title": "The childhood diseases making a post-lockdown comeback - BBC", "description": "RSV, Strep A, the flu: a range of familiar bugs are worrying doctors and parents with strange new patters. What's behind the mysterious outbreaks?", "url": "https://www.bbc.com/future/article/20221206-why-are-some-childhood-illnesses-spiking", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0dn6110.jpg", "publishedAt": "2022-12-12T01:05:05Z", "content": "\"Everyone is concerned, obviously, because older children tolerate this virus quite well why were they not?\" she says.\r\nWhen Covid-19 rampaged across the world, many countries introduced strict lockd… [+1603 chars]"}, {"source": {"id": null, "name": "WRAL.com"}, "author": "Adam Owens, Josie Zimmer, Cory Dinkel", "title": "Flu, RSV and COVID continue to stress healthcare system - WRAL News", "description": "In a season for spreading holiday cheer, experts say we are spreading so much more.", "url": "https://www.wral.com/coronavirus/flu-rsv-and-covid-continue-to-stress-healthcare-system/20624135/", "urlToImage": "https://wwwcache.wral.com/asset/news/local/2022/12/11/20624322/487158-adam-DMID1-5x7kkkk57-640x480.jpg", "publishedAt": "2022-12-11T21:14:00Z", "content": "FAYETTEVILLE, N.C. In a season for spreading holiday cheer, experts say we are spreading so much more.\r\nOur healthcare system is being tested yet again; This time, three illnesses are behind it.\r\nThe… [+1477 chars]"}, {"source": {"id": null, "name": "McKnight's Long Term Care News"}, "author": "John O'Connor", "title": "To mask or not to mask? That is the question. - McKnight's Long-Term Care News", "description": "Three highly contagious viruses have joined forces to create new health hazards. Is it time to mask all the time again?", "url": "https://www.mcknights.com/daily-editors-notes/to-mask-or-not-to-mask-that-is-the-question/", "urlToImage": "https://www.mcknights.com/wp-content/uploads/sites/5/2022/01/MCK_OConnor_illo_1440x810.jpg", "publishedAt": "2022-12-11T20:29:18Z", "content": "Just in time for the holidays, three highly contagious viruses have joined forces to create new health hazards. As a result, many nursing facilities are grappling with whether to impose mask mandates… [+2490 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Severe COVID Looks Scarily Like Old Age in The Human Brain, Study Finds - ScienceAlert", "description": "Severe COVID-19 looks scarily like old age in the human brain, according to a postmortem analysis of 54 healthy and infected individuals.", "url": "https://www.sciencealert.com/severe-covid-looks-scarily-like-old-age-in-the-human-brain-study-finds", "urlToImage": "https://www.sciencealert.com/images/2022/12/COVID19BrainImpact.jpg", "publishedAt": "2022-12-11T17:01:00Z", "content": "Severe COVID-19 looks scarily like old age in the human brain, according to a postmortem analysis of 54 healthy and infected individuals.\r\nThe authors of the study say their research is the first to … [+4629 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Swelling Along Brain’s Axons May Be True Culprit in Alzheimer’s Disease - Neuroscience News", "description": "The formation of plaques can cause the accumulation of spheroid-shaped swellings along axons near the amyloid plaque deposits. The swellings are caused by lysosomes, which digest cellular waste. As the swelling enlarges, it can block the transmission of signa…", "url": "https://neurosciencenews.com/axon-swelling-alzheimers-22050/", "urlToImage": "https://neurosciencenews.com/files/2022/12/axon-swelling-alzheimers-neurosicences-public.jpg", "publishedAt": "2022-12-11T14:07:18Z", "content": "Summary: The formation of plaques can cause the accumulation of spheroid-shaped swellings along axons near the amyloid plaque deposits. The swellings are caused by lysosomes, which digest cellular wa… [+4470 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "IANS", "title": "More studies needed to prove Covid vax cause heart inflammation: Experts - Greatandhra", "description": "As more studies indicate heart inflammation among the young and healthy adults especially after the second dose, top doctors said on Sunday that this should not raise alarm bells as more conclusive studies are needed to prove that Covid-19 vaccines should be …", "url": "https://www.greatandhra.com/articles/special-articles/more-studies-needed-to-prove-covid-vax-cause-heart-inflammation-experts-125845", "urlToImage": "https://www.greatandhra.com/newphotos10/heartattack11670747596.jpg", "publishedAt": "2022-12-11T08:33:16Z", "content": "As more studies indicate heart inflammation among the young and healthy adults especially after the second dose, top doctors said on Sunday that this should not raise alarm bells as more conclusive s… [+3124 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "43% of stroke patients report the same symptoms 1 week before the event, finds study - Express", "description": "A stroke is one of the leading causes of death and disability in the UK. However, in some cases, patients report symptoms of a stroke one week before the stroke occurs.", "url": "https://www.express.co.uk/life-style/health/1707987/stroke-mini-stroke-tia", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4450162.jpg?r=1670742179241", "publishedAt": "2022-12-11T07:02:00Z", "content": "What causes a TIA\r\nIn common with a full-blooded stroke, a TIA is normally caused by a blood clot that blocks the vessels supplying the brain with oxygen.\r\nSome risk factors can increase your risk of… [+318 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Maureen Mackey", "title": "Teen denied kidney transplant because she's not vaccinated for COVID, say parents - Fox News", "description": "A 14-year-old girl in North Carolina who needs a kidney transplant is not able to move forward because a hospital says she must be vaccinated against COVID-19, her parents shared on \"Fox & Friends.\"", "url": "https://www.foxnews.com/lifestyle/teen-denied-kidney-transplant-not-vaccinated-covid-parents", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/12/Transplant.2.jpeg", "publishedAt": "2022-12-10T22:02:23Z", "content": "Appearing on \"Fox &amp; Friends Weekend\" on Saturday morning to discuss the dire medical dilemma their family is facing, the parents of a teenage girl who is not vaccinated against COVID-19 revealed … [+7750 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Harnessing the Brain’s Immune Cells to Stave off Alzheimer’s and Other Neurodegenerative Diseases - Neuroscience News", "description": "Researchers have identified a protein that could be leveraged to help microglia in the brain stave off Alzheimer's and other neurodegenerative diseases.", "url": "https://neurosciencenews.com/microglia-alzheimers-22045/", "urlToImage": "https://neurosciencenews.com/files/2022/12/immune-cells-neurodegeneration-neurosciene-public.jpg", "publishedAt": "2022-12-10T21:46:24Z", "content": "Summary: Researchers have identified a protein that could be leveraged to help microglia in the brain stave off Alzheimer’s and other neurodegenerative diseases.\r\nSource: The Conversation\r\nMany neuro… [+7546 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "I'm a Doctor and Wish Everyone Knew This About Pancreatic Cancer Signs — Eat This Not That - Eat This, Not That", "description": "Knowing the risk factors and early symptoms can save your life. Here are experts who share what to know about pancreatic cancer.", "url": "https://www.eatthis.com/im-a-doctor-and-wish-everyone-knew-this-about-pancreatic-cancer/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/shutterstock_1381662893-e1655350429929.jpg?quality=82&strip=all", "publishedAt": "2022-12-10T12:31:07Z", "content": "Thanks to screenings that can help detect cancer early and advances in medicine, cancer has become more treatable and the survival rate has increased for several types of cancer. The American Cancer … [+10679 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "A Covid-19 Milestone Attained — A Correlate of Protection for Vaccines | NEJM - nejm.org", "description": "Perspective from The New England Journal of Medicine — A Covid-19 Milestone Attained — A Correlate of Protection for Vaccines", "url": "https://www.nejm.org/doi/full/10.1056/NEJMp2211314", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/0/nejm.ahead-of-print/nejmp2211314/20221209/images/img_small/nejmp2211314_f1.jpeg", "publishedAt": "2022-12-10T12:30:18Z", "content": "The rapid identification of a correlate of protection (CoP) for Covid-19 vaccines on the basis of several harmonized randomized phase 3 trials using common validated assays constitutes an important s… [+10480 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Hilary Brueck", "title": "How to tell if you have flu, COVID, RSV: symptoms, prevalence, signs - Insider", "description": "It's not just flu, COVID, and RSV. At least 10 different infections are spreading around, and they come with a constellation of over 15 symptoms.", "url": "https://www.insider.com/tell-which-virus-you-have-flu-covid-rsv-symptoms-2022-12", "urlToImage": "https://i.insider.com/6393ab8ada18750018f1ee33?width=1200&format=jpeg", "publishedAt": "2022-12-10T12:00:16Z", "content": "The US is ill. Federal health data shows the country is currently red-hot with lots of fevers, sore throats, and coughs popping up from coast to coast.\r\nMost of the sickness out there right now is fl… [+2562 chars]"}]}