{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Alzheimer's surge across America laid bare: Interactive map reveals rise in Alzheimer's death rates - Daily Mail", "description": "Interactive maps reveal states with the highest death rates and fastest growth rates in Alzheimer's predicted in the US. Southern states [dark pink] topped the list while Maine [green] saw a decline.", "url": "https://www.dailymail.co.uk/health/article-11990503/Alzheimers-surge-America-laid-bare-Interactive-map-reveals-rise-Alzheimers-death-rates.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/22/00/70111115-0-image-a-11_1682118556042.jpg", "publishedAt": "2023-04-23T12:23:43Z", "content": "The deadly surge of Alzheimer's across America in the past 20 years has been laid bare in a series of interactive maps.\r\nFatalites have spiraled 168 percent, official figures show, jumping from about… [+6055 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Erika Edwards", "title": "New theories of the possible link between Covid shots and tinnitus are emerging - Yahoo News", "description": "Tinnitus, or ringing in the ears, has been linked to Covid vaccines. The CDC says there's no clear evidence, but researchers point to emerging theories.", "url": "https://news.yahoo.com/theories-possible-between-covid-shots-110000663.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QR4HAfgipFfTEf_YIa4oZA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/nbc_news_122/655d38160f96ee0ee5b6216bfdf64055", "publishedAt": "2023-04-23T11:00:00Z", "content": "Thousands of people say they've developed tinnitus after they were vaccinated against Covid. While there is no proof yet that the vaccines caused the condition, theories for a possible link have surf… [+6598 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Catch a Cold, Catch Dementia? The Surprising Connection Unveiled - SciTechDaily", "description": "A study by Tulane University reveals that frequent illness may accelerate brain aging and increase the risk of dementia or cognitive decline. The findings highlight the importance of maintaining good health to prevent infections, especially among the elderly …", "url": "https://scitechdaily.com/catch-a-cold-catch-dementia-the-surprising-connection-unveiled/", "urlToImage": "https://scitechdaily.com/images/Sick-Senior-Woman-Cold-Flu.jpg", "publishedAt": "2023-04-23T09:44:08Z", "content": "Researchers discovered a link between frequent illness and accelerated brain aging, increasing the risk of dementia or cognitive decline. The study, published in Brain, Behavior and Immunity, used ag… [+3902 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Bethany Dawson", "title": "Bird flu: What's happening with H5N1 that's 'wiping out everything' - Business Insider", "description": "The new, more contagious bird flu virus H5N1 has resulted in the mass slaughter of millions of poultry and has decimated wild bird populations.", "url": "https://www.businessinsider.com/bird-flu-avian-influenza-outbreak-us-h5n1-wiping-out-everything-2023-4", "urlToImage": "https://i.insider.com/64429dca77ecc80019e5bcf0?width=1200&format=jpeg", "publishedAt": "2023-04-23T09:41:00Z", "content": "The US is currently experiencing its worst-ever outbreak of bird flu, also known as avian influenza, and a new strain could become endemic in the US, a new study has found.\r\nThe outbreak is \"wiping o… [+3293 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "Allison Aubrey", "title": "Unraveling a hidden cause of UTIs — plus how to prevent them - WUSF Public Media", "description": "New research shows that one of the most common infections in women may be linked to our food supply. Here's what to know to protect yourself.", "url": "https://wusfnews.wusf.usf.edu/2023-04-23/unraveling-a-hidden-cause-of-utis-plus-how-to-prevent-them", "urlToImage": "https://npr.brightspotcdn.com/dims4/default/7811815/2147483647/strip/true/crop/1883x989+0+212/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmedia.npr.org%2Fassets%2Fimg%2F2023%2F04%2F21%2Fgettyimages-642110159-0e2ffc407f141d2257f90528749704160fd93fab.jpg", "publishedAt": "2023-04-23T08:00:00Z", "content": "If you've had a urinary tract infection, you're in good company. About 60% of women will develop one in their lifetime. UTIs lead to more than a million emergency room visits each year and more than … [+10024 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Neel V. Patel", "title": "Brendan Hall's Movie About Seeing the Moon in SpaceX's Starship Will Be Unforgettable - The Daily Beast", "description": "Brendan Hall is going to take a trip around the moon in a SpaceX rocket with a Japanese billionaire and seven other artists. His next film is sure to be a doozy.", "url": "https://www.thedailybeast.com/brendan-halls-movie-about-seeing-the-moon-in-spacexs-starship-will-be-unforgettable", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1682108125/230421-Patel-Brendan-Hall-tease_xlwu4b", "publishedAt": "2023-04-23T07:34:02Z", "content": "In a crowd, it would be very easy to lose track of Brendan Hall. The 28-year-old Brooklyn filmmaker has a very unassuming presence, and he likes it that way. As someone who makes documentaries, he wo… [+16419 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Patrick Reilly", "title": "Some patients claim popular weight loss drugs are causing hair loss - New York Post ", "description": "Ozempic does not list hair loss as a side effect, however 3% of patients reported hair loss during Wegovy’s clinical trials, according to NBC. While they are the same drug, Wegovy is a higher dose.…", "url": "https://nypost.com/2023/04/22/some-patients-claim-popular-weight-loss-drugs-are-causing-hair-loss/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/NYPICHPDPICT000010023969.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-04-23T00:10:00Z", "content": "Popular new weight loss drugs Ozempic and Wegovy have been helping people to shed pounds, but some users have also reported shedding their hair as well as an alarming side effect.\r\nThe pricey injecta… [+2460 chars]"}, {"source": {"id": null, "name": "Celebwell.com"}, "author": "Anna Bechtel", "title": "Roz Purcell in Bathing Suit Has a \"Sunrise Dip\" - Celebwell", "description": "Former Miss Ireland Roz Purcell loves to explore her country. She recently spent time at the beaches of Donegal in a bathing suit.", "url": "https://celebwell.com/news-roz-purcell-in-bathing-suit-has-a-sunrise-dip/", "urlToImage": "https://celebwell.com/wp-content/uploads/sites/2/2023/04/RozPurcell-b.png", "publishedAt": "2023-04-23T00:01:34Z", "content": "Former Miss Ireland Roz Purcell loves to explore her country. She recently spent time at the beaches of Donegal. Purcell shared a highlight video on Instagram. In it, she went for a swim early mornin… [+2839 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Early Indicators of Autism May Be Identified in Fetal Brain Scans - Neuroscience News", "description": "A study by King's College researchers has identified a link between autism traits and isolated fetal ventriculomegaly - a common antenatal brain abnormality. Using MRI brain scans, the study supports the need for early identification and intervention for fami…", "url": "https://neurosciencenews.com/asd-fetal-scan-23082/", "urlToImage": "https://neurosciencenews.com/files/2023/04/fetal-scan-autism-neurosicences.jpg", "publishedAt": "2023-04-22T22:36:46Z", "content": "Summary: A study by King’s College researchers has identified a link between autism traits and isolated fetal ventriculomegaly – a common antenatal brain abnormality. Using MRI brain scans, the study… [+4373 chars]"}, {"source": {"id": null, "name": "WPVI-TV"}, "author": null, "title": "ACCT Philadelphia still needs help placing 70 dogs by Monday due to sweeping canine flu in kennels - WPVI-TV", "description": "By clearing out, the nonprofit can isolate dogs who are sick or have been exposed to canine flu.", "url": "https://6abc.com/acct-philadelphia-dog-adoption-canine-flu-70-dogs-fostering-donating/13170939/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13171019_042223-wpvi-acct-philly-6pm-video-vid.jpg?w=1600", "publishedAt": "2023-04-22T22:34:10Z", "content": "PHILADELPHIA (WPVI) -- ACCT Philly is still desperately trying to find homes for at least 70 dogs who need to leave the shelter by this Monday.\r\nThe nonprofit says it is grateful for the outpouring o… [+652 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "georgia dodd", "title": "2 Sweet Beverages That Practically Guarantee Bloating And Digestive Issues, Doctors Warn - SheFinds", "description": "Learn about two sweet drinks that practically guarantee bloating and digestive issues, only on SheFinds!", "url": "https://www.shefinds.com/collections/sweet-beverages-guarantee-bloating-digestive-issues-experts-warn/", "urlToImage": "https://www.shefinds.com/files/2023/04/friends-cheersing-cocktails-together.jpg", "publishedAt": "2023-04-22T22:30:07Z", "content": "If you have a sensitive gut, you know that there are so many foods that can trigger digestive issues like gas, bloating, diarrhea, and more. We probably don’t have to tell you twice that staying away… [+5388 chars]"}, {"source": {"id": null, "name": "Mariashriversundaypaper.com"}, "author": "Meghan Rabbitt", "title": "Want to Be More In Control of Your Health and Reverse Disease? The Glucose Goddess Has Simple Hacks That'll Set You on Your Path ASAP - Maria Shriver's Sunday Paper", "description": "For a long time, most of us thought about blood glucose in the context of diabetes. These days, we hear terms like glucose, blood sugar, insulin resistance, and metabolic health a lot more frequently, and more of us realize that lots of spikes and dips in our…", "url": "https://www.mariashriversundaypaper.com/glucose-goddess/", "urlToImage": "https://www.mariashriversundaypaper.com/content/images/2023/04/glucose.png", "publishedAt": "2023-04-22T22:27:24Z", "content": "For a long time, most of us thought about blood glucose in the context of diabetes. These days, we hear terms like glucose, blood sugar, insulin resistance, and metabolic health a lot more frequently… [+7734 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Van Tulleken", "title": "DR CHRIS VAN TULLEKEN reveals why everyone should care about ultra-processed food - Daily Mail", "description": "Far from buying my little daughter a proper ice cream, I'd given her what one scientist later memorably described to me as 'an industrially produced edible substance'.", "url": "https://www.dailymail.co.uk/health/article-12003173/DR-CHRIS-VAN-TULLEKEN-reveals-care-ultra-processed-food.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/22/23/70130873-0-image-a-29_1682201515748.jpg", "publishedAt": "2023-04-22T22:14:42Z", "content": "Ultra-processed foods (or UPFs) make up a shocking 60 per cent of the average diet in the UK and increasing evidence links their high consumption with the rise in obesity, type 2 diabetes and other d… [+19808 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Alcohol Fuels Pain: Study Reveals Link Between Drinking and Chronic Pain - Neuroscience News", "description": "Chronic alcohol consumption can increase sensitivity to pain through two molecular mechanisms. Researchers also identified potential new drug targets for treating alcohol-related chronic pain. Over half of people with alcohol use disorder (AUD) suffer from pe…", "url": "https://neurosciencenews.com/alcohol-chronic-pain-23080/", "urlToImage": "https://neurosciencenews.com/files/2023/04/alcohol-pain-neurosciences-public.jpg", "publishedAt": "2023-04-22T21:38:55Z", "content": "Summary: Chronic alcohol consumption can increase sensitivity to pain through two molecular mechanisms. Researchers also identified potential new drug targets for treating alcohol-related chronic pai… [+7467 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrea Vacchiano", "title": "Young and 'healthy' British doctor died from severe reaction to AstraZeneca COVID vaccine: coroner - Fox News", "description": "A severe reaction to the AstraZeneca COVID-19 vaccine was blamed for the death of Dr. Stephen Wright by a coroner in the United Kingdom. Wright passed away in January 2021.", "url": "https://www.foxnews.com/health/young-healthy-british-doctor-died-severe-reaction-astrazeneca-covid-vaccine-coroner", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/AstraZeneca-Shot.jpg", "publishedAt": "2023-04-22T21:32:00Z", "content": "A British coroner recently determined that a healthy, young doctor in the United Kingdom died from a rare reaction to AstraZeneca's COVID-19 vaccine.\r\nDr. Stephen Wright, 32, passed away in January 2… [+1888 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Adult attachment styles predict maternal gatekeeping among new parents - PsyPost", "description": "The ways in which adults form emotional connections with others are associated with how much a new mother tries to involve or exclude a father in parenting their child, according to a new study published in Personal Relationships. The findings provide evidenc…", "url": "https://www.psypost.org/2023/04/adult-attachment-styles-predict-maternal-gatekeeping-among-new-parents-77724", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/mother-and-father-new-parents-with-infant.jpg", "publishedAt": "2023-04-22T21:18:49Z", "content": "The ways in which adults form emotional connections with others are associated with how much a new mother tries to involve or exclude a father in parenting their child, according to a new study publi… [+6583 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Annita Katee", "title": "Why A Germ Expert Is Begging You To Remove the Foil or Plastic Seal Under the Lid of Your Containers After Opening - Well+Good", "description": "A quick Reddit search will tell you that many households disagree about the purpose of foil or plastic seals on food products like yogurt and sour cream and whether they should be removed or kept on after opening for extra coverage. Here, a microbiologist exp…", "url": "https://www.wellandgood.com/purpose-foil-plastic-seal-food-containers/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2023/04/IMG_2023-4-22-150430.jpg", "publishedAt": "2023-04-22T21:02:37Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify Brain Aging “Sweet Spot” - SciTechDaily", "description": "Indigenous communities residing in the tropical forests of lowland Bolivia have reported some of the lowest rates of heart disease and brain disease in recorded scientific history. Now, research conducted by USC on the Tsimané and Mosetén communities indicate…", "url": "https://scitechdaily.com/scientists-identify-brain-aging-sweet-spot/", "urlToImage": "https://scitechdaily.com/images/Neurons-Brain-Activity-X-ray.jpg", "publishedAt": "2023-04-22T20:22:01Z", "content": "ByUniversity of Southern CaliforniaApril 22, 2023\r\nIndigenous communities in lowland Bolivia, such as the Tsimané and Mosetén, have some of the lowest rates of heart and brain disease due to optimal … [+6801 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Daniel de Visé", "title": "Drinking definitely hurts us. Science may yet prove it helps us, too - The Hill", "description": "Americans who drink alcohol have endured years of ambiguous studies, some telling them moderate drinking might help them, others saying it will definitely hurt them.  So is having a drink with dinner good for our health or bad? After a series of sweeping meta…", "url": "https://thehill.com/policy/healthcare/3963336-drinking-definitely-hurts-us-science-may-yet-prove-it-helps-us-too/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/04/alcohol_texas_040523getty_alcohol.jpg?w=1280", "publishedAt": "2023-04-22T20:00:00Z", "content": "Skip to content\r\nAmericans who drink alcohol have endured years of ambiguous studies, some telling them moderate drinking might help them, others saying it will definitely hurt them. \r\nSo is having a… [+7399 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Bradford Betz", "title": "Narcan maker aims to make overdose reversal drug more affordable, company says - Fox Business", "description": "Emergent BioSolutions is aiming to make Narcan more affordable after the Food and Drug Administration approved sales of the live-saving without a prescription.", "url": "https://www.foxbusiness.com/healthcare/narcan-maker-aims-make-overdose-reversal-drug-more-affordable-company-says", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/04/0/0/Nasal-Spray.jpg?ve=1&tl=1", "publishedAt": "2023-04-22T19:55:27Z", "content": "A manufacturer of Narcan is planning to make the lifesaving overdose reversal drug more affordable after the Food and Drug Administration (FDA) last month approved sales without a prescription. \r\nIn … [+1792 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Shiv Sudhakar", "title": "Secrets of gray hair revealed: Scientists may have figured out why our hair does this - Fox News", "description": "A study published in the journal Nature reveals that a certain type of stem cell gets \"stuck\" in our hair follicles — potentially causing gray hair and leading to a loss of hair color.", "url": "https://www.foxnews.com/lifestyle/secrets-gray-hair-revealed-scientists-may-have-figured-out-why-our-hair-does-this", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/10/iStock-1188768276.jpg", "publishedAt": "2023-04-22T19:26:00Z", "content": "The secret about why hair goes gray may lie in a certain type of stem cell that gets \"stuck\" in our hair follicles, according to a new study.\r\n\"It is the loss of chameleon-like function in melanocyte… [+4498 chars]"}, {"source": {"id": null, "name": "Palm Beach Post"}, "author": ", The Palm Beach Post", "title": "Arcturus COVID strain invades Florida slowly - Palm Beach Post", "description": "Some arcturus cases have seen conjunctivitis, known as pinkeye. The strain is between 4% and 15% of the cases in the Southeast.", "url": "https://www.palmbeachpost.com/story/news/2023/04/22/arcturus-covid-strain-invades-florida-slowly/70130490007/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/08/31/USAT/13a34d77-4735-41b5-b464-bf9911752825-Pfizer_COVID-19_BA4.5_vaccine_vials_3.jpg?auto=webp&crop=2399,1350,x0,y720&format=pjpg&width=1200", "publishedAt": "2023-04-22T19:07:56Z", "content": "As COVID-positive patients continue leaving Floridas hospitals, the latest viral variant thought to cause pink eye has been spreading in the state. Meanwhile, state health officials have yet to resum… [+4317 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Use Electricity to Make Wounds Heal 3x Faster - ScienceAlert", "description": "Scientists have developed a specially engineered biochip that uses electricity to heal wounds up to three times faster than normal.", "url": "https://www.sciencealert.com/scientists-use-electricity-to-make-wounds-heal-3x-faster", "urlToImage": "https://www.sciencealert.com/images/2023/04/WoundHealing.jpg", "publishedAt": "2023-04-22T18:01:10Z", "content": "Scientists have developed a specially engineered biochip that uses electricity to heal wounds up to three times faster than normal.\r\nIt's well known that electric fields can guide the movements of sk… [+3157 chars]"}, {"source": {"id": null, "name": "MyMotherLode.com"}, "author": "Tracey Petersen", "title": "Protect Home And Self From Mosquitos - MyMotherLode.com", "description": "Health officials warn the insect’s numbers could explode due to the recent pouring rains and also raise the risk of exposure to the West Nile Virus.", "url": "https://www.mymotherlode.com/news/local/3056717/protect-home-and-self-from-mosquitos.html", "urlToImage": "https://www.mymotherlode.com/wp-content/uploads/2023/04/Mosqito-biting-person.jpg", "publishedAt": "2023-04-22T17:31:33Z", "content": "San Andreas, CA — Health officials warn that mosquito numbers could explode due to the recent pouring rains and also raise the risk of exposure to the West Nile Virus.\r\nCalaveras County Public Health… [+2074 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Renée Onque", "title": "TikTok's 'Sleepy Girl Mocktail': Can tart cherry juice help you sleep? - CNBC", "description": "CNBC Make It talked to a sleep and circadian sciences expert to help decipher fact from fiction about tart cherry juice's effectiveness as a sleep aid.", "url": "https://www.cnbc.com/2023/04/22/tiktoks-sleepy-girl-mocktail-can-tart-cherry-juice-help-you-sleep.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107227137-1681834900063-2022_0418_infographic_sleepyGirl.png?v=1681835014&w=1920&h=1080", "publishedAt": "2023-04-22T14:00:01Z", "content": "In the endless pursuit of better sleep, many people have turned to unconventional methods like mouth taping, which trended for months on social media, and even hotel rooms designed for the ideal slee… [+4710 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists May Have Figured Out How to Regenerate Lost Hearing - Futurism", "description": "A team of Harvard Medical School scientists has come up with a new drug-like cocktail of molecules that can successfully regenerate hair cells.", "url": "https://futurism.com/neoscope/scientists-figured-out-regenerate-lost-hearing", "urlToImage": "https://wp-assets.futurism.com/2023/04/scientists-figured-out-regenerate-lost-hearing.jpg", "publishedAt": "2023-04-22T13:49:06Z", "content": "A team of Harvard Medical School scientists say they've come up with a new drug cocktail of molecules that they say can successfully regenerate the hair cells in the inner ear that enable hearing a p… [+2611 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jacob Geanous", "title": "Robots with ultra-bright lights deployed in fight against deadly fungus - New York Post ", "description": "The Xenex UV LightingStrike Robots, which have an over 99% success rate of stopping infections of Candida Auris, potentially fatal drug-resistant fungi, according to a study by Netcare Hospitals, a…", "url": "https://nypost.com/2023/04/22/robots-with-ultra-bright-lights-deployed-in-fight-against-deadly-fungus/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/NYPICHPDPICT000009977612.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-04-22T12:55:00Z", "content": "At least half a dozen New York City area hospitals are using $100,000 robots that deploy high-intensity light to combat a deadly drug-resistant fungus spreading across the country and state.\r\nXenex U… [+2679 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrea Blanco", "title": "These two men were consumed by Covid psychosis. Only one survived - The Independent", "description": "Two men developed psychosis after becoming infected with Covid-19. One of them ultimately received treatment after his concerns were repeatedly dismissed, while the other died of a possible suicide. Now, their families are trying to raise awareness about the …", "url": "https://www.independent.co.uk/news/world/americas/covid-psychosis-cdc-long-term-effects-vaccine-b2324848.html", "urlToImage": "https://static.independent.co.uk/2023/04/07/18/Screen%20Shot%202023-04-07%20at%201.53.49%20PM.png?quality=75&width=1200&auto=webp", "publishedAt": "2023-04-22T12:38:34Z", "content": "Sign up to our Evening Headlines email for your daily guide to the latest news\r\nSign up to our free US Evening Headlines email\r\nNatalie Barry and her husband Aaron Bazzone became infected with Covid-… [+9434 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "Georgia Dodd", "title": "Dietitians Say This Fried Food Causes Inflammation And Weight Gain - Yahoo Life", "description": "Inflammation is a hot topic for weight loss and wellness—and for good reason. Research shows that chronic, low-grade inflammation can result in many major...", "url": "https://www.shefinds.com/collections/fried-food-inflammation-weight-gain/", "urlToImage": "https://media.zenfs.com/en/shefinds_255/1efb8f993fc74d0c896ff7f6ad4d40c8", "publishedAt": "2023-04-22T12:00:18Z", "content": "Inflammation is a hot topic for weight loss and wellnessand for good reason. Research shows that chronic, low-grade inflammation can result in many major health issues, including heart disease, cance… [+3846 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "TikToker reveals she has deadly lung disease after vaping for just one YEAR - Daily Mail", "description": "Lucy Turchin, 35, from Oakland, California, was diagnosed with pneumonitis after she had been vaping for only one year. She now shares her story to spread awareness on the dangers of vaping.", "url": "https://www.dailymail.co.uk/health/article-11995409/TikToker-reveals-deadly-lung-disease-vaping-just-one-YEAR.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/21/14/70092591-0-image-a-9_1682084242158.jpg", "publishedAt": "2023-04-22T11:43:46Z", "content": "Before her diagnosis, Ms Turchin worked as a personal trainer. However, her illness now makes it difficult just to walk long distances or get out of bed\r\nA TikToker and personal trainer from Californ… [+5986 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Zoey Steel", "title": "My mother got cancer a month before I went to Lewis & Clark College - Insider", "description": "Zoey Steel struggled to connect with her fellow students at Lewis & Clark College because she was worried about her mother's cancer treatments.", "url": "https://www.insider.com/mother-diagnosed-cancer-month-before-lewis-and-clark-college-2023-4", "urlToImage": "https://i.insider.com/643ee4c50a29b40018810fda?width=1200&format=jpeg", "publishedAt": "2023-04-22T11:08:00Z", "content": "My mother was my greatest cheerleader. She grew up without a lot of money, so she worked tirelessly when she was young to provide for herself. She wasn't able to get a college education, so she insis… [+3672 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Madeleine Haase", "title": "Getting More Of This Mineral Could Stave Off Dementia, New Study Finds - Yahoo Life", "description": "A higher daily dosage of magnesium could lower the risk of developing dementia, per new research. Experts explain how magnesium is essential to brain health.", "url": "https://www.womenshealthmag.com/health/a43623464/higher-magnesium-dose-lowers-dementia-risk-study/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/NpqZydmGPLqqU0e.9MGAYw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/hearst_womens_health_52/05f2f95a50b2a6fbcf7908dc73a8fef3", "publishedAt": "2023-04-22T11:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>New research shows that a higher daily intake of magnesium-rich foods can reduce the risk of de… [+5483 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Korin Miller", "title": "The 'Hormone Diet' May Help You Lose Weight, But Not By Balancing Hormones - Yahoo Life", "description": "The Hormone Diet emphasizes anti-inflammatory foods to help you balance hormones like cortisol and estrogen and lose weight. Here's what doctors think.", "url": "https://www.womenshealthmag.com/weight-loss/a43543559/what-is-hormone-diet/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/gc8WLXPmO7O.MGYFa.pjSA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/hearst_womens_health_52/7b69daf8daa20f49a60f10fce6663fe7", "publishedAt": "2023-04-22T11:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\nYour hormones do a lot for your body, from helping regulate your sex drive to impacting how stressed ou… [+6761 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "The pros and cons of semaglutide for weight loss - Insider", "description": "Common side effects like nausea and constipation are outweighed by benefits like no longer experiencing \"food noise,\" the women told Insider.", "url": "https://www.insider.com/pros-cons-ozempic-semaglutide-before-after-2023-4", "urlToImage": "https://i.insider.com/643587ab2588f70018ce4bb4?width=1200&format=jpeg", "publishedAt": "2023-04-22T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Kells McPhillips", "title": "Logging longer workouts boosts longevity. Experts explain how much to aim for, and tips to do it safely - Yahoo Finance", "description": "As you put more and more strain on your muscles, you’ll need to balance out that effort with rest.", "url": "https://finance.yahoo.com/news/logging-longer-workouts-boosts-longevity-090000708.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/04G2p6RaBiBWYLzr5_m89A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/fortune_175/eb4a30fa6e527f9480343c14ae867c7b", "publishedAt": "2023-04-22T09:00:00Z", "content": "Exercise and longevity go hand-in-hand. Sweating daily can help you dodge severe illness, reduce your risk of a life-threatening cardiac event, and keep your brain healthy as you age. But when youre … [+5713 chars]"}, {"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Newsroom", "title": "Calories key to longevity, study finds - Kathimerini English Edition", "description": "The enzyme responsible for the reliable transcription of cells, as the copying of information from DNA is called, lies behind aging, according to researchers at German institutes.", "url": "https://www.ekathimerini.com/news/1209219/calories-key-to-longevity-study-finds/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2023/04/diet_web-960x600.jpg", "publishedAt": "2023-04-22T08:21:56Z", "content": "The enzyme responsible for the reliable transcription of cells, as the copying of information from DNA is called, lies behind aging, according to researchers at German institutes.\r\nA group of researc… [+1728 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Sugar drinks are tasty but they may be killing you slowly - Geo News", "description": "Study reveales drinks with sugar are associated with increased risk of heart disease and can cause death in some cases", "url": "https://www.geo.tv/latest/483414-sugar-drinks-are-tasty-but-they-may-be-killing-you-slowly", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-22/483414_105606_updates.jpg", "publishedAt": "2023-04-22T08:20:00Z", "content": "People will now think carefully before they opt for any cool and sweet drink in the hot weather after a study revealed that drinks with sugar are associated with an increased risk of heart disease an… [+2975 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  DR. GAL NEUMAN/WALLA!", "title": "Suffering from seasonal allergies? Here's what you should know - The Jerusalem Post", "description": "Spring is the most beautiful time of the year, but for many people, these months aren't so pleasant after all.", "url": "https://www.jpost.com/health-and-wellness/article-739944", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/534448", "publishedAt": "2023-04-22T05:20:00Z", "content": "Spring is here, and in addition to the beautiful flowers, the air is filled with pollen from cypress, grass, sage, olive and pecan trees that cause many people to have annoying allergies that include… [+2931 chars]"}, {"source": {"id": null, "name": "Competitionplus.com"}, "author": null, "title": "LIZZY MUSI DISCUSSES HAVING STAGE 4 BREAST CANCER - Competition Plus", "description": "Standout Pro Mod racer Lizzy Musi unveiled on a YouTube video that she is battling Stage 4 breast cancer. “I’m going to start at the beginning and explain to everyone and give some awareness while speaking about it,” said Musi, 31. “I started out about two ye…", "url": "https://competitionplus.com/drag-racing/news/lizzy-musi-discusses-having-stage-4-breast-cancer", "urlToImage": "https://competitionplus.com/sites/default/files/images/Lizzy-8690_resize_0.jpg", "publishedAt": "2023-04-22T02:09:50Z", "content": "Standout Pro Mod racer Lizzy Musi unveiled on a YouTube video that she is battling Stage 4 breast cancer.\r\nIm going to start at the beginning and explain to everyone and give some awareness while spe… [+5508 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Listen Up: Hearing Aids Could Help Fend Off Dementia - SciTechDaily", "description": "The Lancet Public Health: Hearing aids may protect against a higher risk of dementia associated with hearing loss, study suggests Study of 437,704 people suggests those experiencing hearing loss and not using hearing aids may have a higher risk of dementia th…", "url": "https://scitechdaily.com/listen-up-hearing-aids-could-help-fend-off-dementia/", "urlToImage": "https://scitechdaily.com/images/Man-Holding-Hearing-Aid.jpg", "publishedAt": "2023-04-22T01:03:02Z", "content": "ByThe LancetApril 21, 2023\r\nA study published in The Lancet Public Health suggests that using hearing aids may protect against the higher risk of dementia associated with hearing loss. The study of 4… [+9473 chars]"}, {"source": {"id": null, "name": "Ynetnews"}, "author": "Nitzan Pinko", "title": "Unlocking the power of the Vagus nerve: insights and benefits - Ynetnews", "description": "The Vagus nerve plays a crucial role in our physical and mental health, regulating many bodily functions and influencing our emotional state Its stimulation has been shown to have numerous benefits, including improved digestion, reduced anxiety and depression…", "url": "https://www.ynetnews.com/health_science/article/byo3tl2g3", "urlToImage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2023/02/21/BJbCxGG0s/BJbCxGG0s_0_0_3000_1634_0_large.jpg", "publishedAt": "2023-04-22T00:55:00Z", "content": "Behold the wonder of Vagus nerve stimulation - a seemingly miraculous solution to our stress and anxiety. With just a few simple movements, we can hit the \"restart\" button on our nervous system and f… [+7601 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "B.C. researchers find COVID-19 infections increase risk of diabetes - CTV News Vancouver", "description": "A team of health researchers in British Columbia has come to the same conclusion as other scientists, but in a much larger study, finding people who’d become infected with COVID-19 were at much higher risk of diabetes.", "url": "https://bc.ctvnews.ca/b-c-researchers-find-covid-19-infections-increase-risk-of-diabetes-1.6366415", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/3/22/diabetes-1-5829562-1647968202669.jpg", "publishedAt": "2023-04-22T00:00:00Z", "content": "A team of health researchers in British Columbia has come to the same conclusion as other scientists, but in a much larger study, finding people whod become infected with COVID-19 were at much higher… [+3980 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Flu diagnosis could significantly raise heart attack risk, new study finds - Fox News", "description": "People who get influenza could be six times more susceptible to having a heart attack in the days following the flu diagnosis, a new study from the Netherlands has found.", "url": "https://www.foxnews.com/health/flu-diagnosis-could-significantly-raise-heart-attack-risk-study-finds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/woman-with-flu.jpg", "publishedAt": "2023-04-22T00:00:00Z", "content": "People who get influenza could be six times more susceptible to having a heart attack in the days following a flu diagnosis\r\n, a new study from the Netherlands has found.\r\nThe studys conclusions were… [+4442 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Brain's Sweet Secrets: Glucose Metabolism Holds the Key to Neurodegenerative Diseases - SciTechDaily", "description": "New details on how healthy neurons metabolize glucose have implications for understanding neurodegenerative diseases. The human brain has a sweet tooth, burning through nearly one quarter of the body’s sugar energy, or glucose, each day. Now, researchers at G…", "url": "https://scitechdaily.com/the-brains-sweet-secrets-glucose-metabolism-holds-the-key-to-neurodegenerative-diseases/", "urlToImage": "https://scitechdaily.com/images/Brain-Energy-Boost-Concept.jpg", "publishedAt": "2023-04-21T23:43:49Z", "content": "ByGladstone InstitutesApril 21, 2023\r\nResearchers at Gladstone Institutes and University of California, San Francisco have discovered new details on how neurons metabolize glucose, which could lead t… [+9579 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "justine schwartz", "title": "4 Ingredients That Boost Your Caloric Rate—You Should Have Them Every Day Over 40, Health Experts Say - SheFinds", "description": "Discover the ingredients and foods that boost your caloric rate, metabolism and promote weight loss on SheFinds.", "url": "https://www.shefinds.com/collections/ingredients-boost-your-caloric-rate/", "urlToImage": "https://www.shefinds.com/files/2022/03/woman-eating-breakfast-fruit.jpeg", "publishedAt": "2023-04-21T22:30:05Z", "content": "This post has been updated since its initial publish date to include more expert insight.\r\nIf you’re looking to shed pounds, it’s likely that you want to eat more foods that can boost your metabolism… [+3664 chars]"}, {"source": {"id": null, "name": "Parade"}, "author": "Erica Sweeney", "title": "Backed Up? This Is the Best Fruit To Eat To Help You Poop, According to a GI Doc - Yahoo Life", "description": "This delicious fruit will get things moving ASAP.", "url": "https://parade.com/health/best-fruit-to-help-you-poop", "urlToImage": "https://media.zenfs.com/en/parade_250/d87f728bcca0e7e2c7ab831b9f30842c", "publishedAt": "2023-04-21T22:30:00Z", "content": "This delicious fruit will get things moving ASAP.\r\nYouve probably heard the saying \"an apple a day keeps the doctor away\" dozens of times. And, theres definitely some truth in it, especially if the d… [+4401 chars]"}, {"source": {"id": null, "name": "WBRZ"}, "author": "Chris Nakamoto", "title": "Longtime home for HIV/AIDS patients closing; lawyers fear it could worsen city's homeless problem - WBRZ", "description": "OLOL shutting down home for HIV/AIDS patients, lawyers fear it could exacerbate BR's homeless problem", "url": "https://www.wbrz.com/news/longtime-home-for-hiv-aids-patients-closing-lawyers-fear-it-could-worsen-city-s-homeless-problem/", "urlToImage": "https://dcer237tfveol.cloudfront.net/v2/zY2W-erh44U-2Nxoz7taVQxnG5rJMhj6Y7N1uchCUlLfBJvQcolVxlFa3O8fnZKbKrs1Oktt4nWHeAGSeyZngRXBfyfkVIwjMDQrQ7lNF2_3GuOddtimamfLILEd6AKlA", "publishedAt": "2023-04-21T21:20:03Z", "content": "BATON ROUGE - Lawyers representing residents living at a facility for East Baton Rouge's HIV/AIDS patients believe the homeless problem in the city is about to get worse.\r\nWatch live newscasts here\r\n… [+2214 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Weird SARS-CoV-2 outbreak in mink suggests hidden source of virus in the wild - Ars Technica", "description": "The lineage had not been seen in the area for over two years.", "url": "https://arstechnica.com/science/2023/04/weird-sars-cov-2-outbreak-in-mink-suggests-hidden-source-of-virus-in-the-wild/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1228980027-760x380.jpeg", "publishedAt": "2023-04-21T20:19:26Z", "content": "Enlarge/ Minks are seen at a farm in Gjol, northern Denmark, on October 9, 2020.\r\n35 with \r\nBetween September to January of this year, mink in three Polish farms tested positive for the pandemic coro… [+4832 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Lindsey Bever", "title": "Pinkeye cases rise in allergy season. It might be a covid symptom, too. - Yahoo News", "description": "Pinkeye - an inflamed, itchy and painful eye - is common during allergy season. But now some doctors are concerned the ailment may also be associated with a ...", "url": "https://www.washingtonpost.com/wellness/2023/04/21/conjunctivitis-pinkeye-covid-allergies/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/4j_QBsqe_Ou7PssFQA6m_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-04/698929b0-e130-11ed-9d6b-13c6fb3b0368", "publishedAt": "2023-04-21T19:44:00Z", "content": "Pinkeye - an inflamed, itchy and painful eye - is common during allergy season. But now some doctors are concerned the ailment may also be associated with a new coronavirus subvariant.\r\nHealth expert… [+5589 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Eileen Bailey", "title": "Stress can increase your biological age. How to reverse it - Medical News Today", "description": "Researchers say chronic stress can impact your overall health and increase your biological age, but the process can be reversed by relieving stressors", "url": "https://www.medicalnewstoday.com/articles/biological-age-is-increased-by-stress-and-restored-upon-recovery-emb", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/04/Biological_age_Stocksy_txp4dcb9db5QRg300_Medium_2714732_Thumb.jpg", "publishedAt": "2023-04-21T19:40:01Z", "content": "<ul><li>Stress can temporarily change our biological age, but the process reverses when the stressor is resolved, according to a new study.</li><li>Stress can come from emotional distress, disease, d… [+9102 chars]"}, {"source": {"id": null, "name": "OregonLive"}, "author": "Lizzy Acker | The Oregonian/OregonLive", "title": "Ice cream might actually be good for you, according to science - OregonLive", "description": "An article in The Atlantic goes deep on the unreported link between ice cream and better health.", "url": "https://www.oregonlive.com/trending/2023/04/ice-cream-might-actually-be-good-for-you-according-to-science.html", "urlToImage": "https://www.oregonlive.com/resizer/HTjLAIdkpcBDGRvYhdJ-M2DRobA=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/7IMI2KPGXNCNPNAPPOUVULUUUA.jpeg", "publishedAt": "2023-04-21T19:26:00Z", "content": "This is the kind of science that an ice cream reporter waits a lifetime to read about: Ice cream is probably not that bad for you. Maybe.\r\nAn article in the May issue of The Atlantic goes deep on the… [+1505 chars]"}, {"source": {"id": null, "name": "Womansworld.com"}, "author": "Alexandria Brooks", "title": "What's the Best Diet for IBS Management? - Woman's World", "description": "Irritable bowel syndrome (IBS) can trigger bloating and diarrhea. Here, health experts discuss the best diet to consider for IBS symptoms.", "url": "https://www.womansworld.com/posts/health/whats-the-best-diet-for-ibs-management", "urlToImage": "https://www.womansworld.com/wp-content/uploads/2023/04/Apple-in-human-stomach.jpg", "publishedAt": "2023-04-21T19:26:00Z", "content": "Your diet and digestive system supply your body with the nutrients it needs to function properly. One of the reasons its important to prioritize a balanced diet, especially as you age: an unhealthy d… [+5277 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Youri Benadjaoud, Emma Egan", "title": "Weekly COVID deaths hit new record low, CDC data shows - ABC News", "description": "COVID deaths hit levels not seen since late March 2020,", "url": "https://abcnews.go.com/Health/weekly-covid-deaths-hit-new-record-low-cdc/story?id=98757797", "urlToImage": "https://s.abcnews.com/images/Health/vaccination-texas-gty-ps-230417_1681744991630_hpMain_16x9_992.jpg", "publishedAt": "2023-04-21T19:00:17Z", "content": "COVID-19 deaths hit a new low this week, reaching levels not seen since late March 2020, when the pandemic was just beginning.\r\nAn estimated 1,160 Americans died from the virus this week, according t… [+2015 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "Taking Omega-3 Supplements? This 1 Food Might Be Able to Replace Your Daily Pill, a New Study Suggests - EatingWell", "description": "Learn about a new review published in Frontiers in Nutrition, which recommends eating sardines instead of taking an omega-3 supplement.", "url": "https://www.eatingwell.com/article/8043374/omega-3-supplements-sardines-new-review/", "urlToImage": "https://www.eatingwell.com/thmb/vc5mzP2F1qcg5rs7UOP0jeGZt_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Taking-Omega-3-Supplements-This-1-Food-Might-Be-Able-to-Replace-Your-Daily-Pill-a-New-Study-Suggests-00d08eeb9b2a4ecca1d6127e2d36fa52.jpg", "publishedAt": "2023-04-21T18:40:03Z", "content": "Nearly 6 in 10 American adults pop supplements daily, per the latest data published in the National Health Statistics Report. Multis are a mainstay, along with another nutrient Americans fall short o… [+5006 chars]"}, {"source": {"id": null, "name": "Bring Me The News"}, "author": "Adam Uren", "title": "That's not a vulture: Effort to find eagle seen in frightful condition in Minnesota - Bring Me The News", "description": "The poor bird has been ravaged by sickness.", "url": "https://bringmethenews.com/minnesota-lifestyle/thats-not-a-vulture-effort-to-find-eagle-seen-in-frightful-condition-in-minnesota", "urlToImage": "https://bringmethenews.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MTk3NDExNDMwNTQxMDQyNjk0/screen-shot-2023-04-21-at-125310-pm.jpg", "publishedAt": "2023-04-21T17:56:56Z", "content": "Have you seen this eagle? Yes, it is an eagle, and it's in need of medical attention after being spotted looking in a frightening condition in northwestern Minnesota.\r\nThe sickly bird was spotted in … [+822 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Hospitals and health care facilities should drop mask requirements, medical experts say - Fox News", "description": "In the Annals of Internal Medicine, several physicians — including infectious disease specialists — wrote that it’s time to remove masking requirements in health care facilities.", "url": "https://www.foxnews.com/health/hospitals-health-care-facilities-should-drop-mask-requirements-medical-experts-say", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/patients-in-masks.jpg", "publishedAt": "2023-04-21T17:50:00Z", "content": "Even after mask mandates were dropped across the country amid dwindling COVID-19 cases and deaths\r\n, face coverings have still been required in many doctors offices, hospitals and other health care s… [+8555 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "The woeful history of ADHD, the condition that once got you branded as \"defective\" - Salon", "description": "A reported story on the history of the ADHD diagnosis and the term itself", "url": "https://www.salon.com/2023/04/21/adhd-history/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/04/distracted_child_1023078742.jpg", "publishedAt": "2023-04-21T17:05:00Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "The Associated Press", "title": "NOT REAL NEWS: A look at what didn't happen this week - The Associated Press", "description": "A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these are legit, even though they were shared widely on social media. The Associated Press checked them out.", "url": "https://apnews.com/article/fact-check-misinformation-ukraine-vaccine-778f87275ce4fb2e45d49992e8593d71", "urlToImage": "https://storage.googleapis.com/afs-prod/media/ad62b093e1f04f3295ed993abeaedd6b/2000.webp", "publishedAt": "2023-04-21T16:42:05Z", "content": "A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these are legit, even though they were shared widely on social media. The Associated Press checked… [+11305 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Amanda Loudin", "title": "Rethinking the Goal of 10,000 Steps a Day - WebMD", "description": "A new study rejects the idea that you need 10,000 daily steps to lower all-cause and cardiovascular death. Instead, people who walked at least 8,000 steps 1 to 2 days per week were less likely to die within 10 years.", "url": "https://www.webmd.com/fitness-exercise/news/20230421/rethinking-the-goal-of-10000-steps-a-day", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/articles/health_tools/simple_steps_to_boost_bone_health_slideshow/1800ss_getty_rf_mature_woman_walking.jpg", "publishedAt": "2023-04-21T16:13:27Z", "content": "What to Do With the Data\r\nAll this data can be confusing, especially if youre someone who has been aiming for the 10,000-step goal. Theres no need to back off that number if its something you enjoy a… [+1986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "Here's why your allergies are getting worse and lasting longer - CNN", "description": "If you noticed that your allergies are lasting longer and becoming stronger, you're not alone. We asked an immunologist with the nonprofit Allergy and Asthma Network and a Harvard emergency medicine physician to explain why this trend is occurring.", "url": "https://www.cnn.com/videos/health/2023/04/21/allergies-asthma-cause-earth-day-lbb-orig.cnn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230421101147-allergies-climate-change-4.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-21T15:35:53Z", "content": null}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Allie Yang", "title": "STDs are at a shocking high. How do we reverse the trend? - National Geographic", "description": "More than half of new infections were among people aged 15 to 24, and the pandemic lockdowns only tell part of the story. Here’s a look at how we got here—and what we can do about it.", "url": "https://www.nationalgeographic.com/science/article/stds-are-at-a-shocking-high-how-do-we-reverse-the-trend", "urlToImage": "https://i.natgeofe.com/n/2aeb2201-6f98-486f-b717-2b44db31ca93/C0023202-Syphilis_bacterium_TEM_16x9.jpg?w=1200", "publishedAt": "2023-04-21T14:58:30Z", "content": "Sexually transmitted infections (STIs) are skyrocketing in the United States, according to the latest data, as gonorrhea, syphilis, and congenital syphilis soared above pre-pandemic levels in 2021. A… [+593 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "Delving into the disruptive gut microbiome of anorexia nervosa pathology - Medical Xpress", "description": "Published in Nature Microbiology, a study by researchers at the University of Copenhagen in Denmark has delved into the microbiota of patients with anorexia nervosa (AN) pathology and identifies the mechanistic interplay between restricted eating habits and h…", "url": "https://medicalxpress.com/news/2023-04-delving-disruptive-gut-microbiome-anorexia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/delving-into-the-disru.jpg", "publishedAt": "2023-04-21T14:40:01Z", "content": "Published in Nature Microbiology, a study by researchers at the University of Copenhagen in Denmark has delved into the microbiota of patients with anorexia nervosa (AN) pathology and identifies the … [+3883 chars]"}, {"source": {"id": null, "name": "Health.com"}, "author": "https://www.facebook.com/Health/", "title": "Foods That Boost Testosterone Naturally - Health.com", "description": "Learn about foods that can help boost your testosterone levels naturally (and which ones to avoid).", "url": "https://www.health.com/foods-that-boost-testosterone-naturally-7253553", "urlToImage": "https://www.health.com/thmb/uzN9UjgNZW2M1zrP7MzUZ0P_BcY=/2121x0/filters:no_upscale():max_bytes(150000):strip_icc()/FoodsThatBoostTestosterone-20623aa9efec4e249b64896452124642.jpg", "publishedAt": "2023-04-21T13:45:16Z", "content": "Testosterone is the primary sex hormone in males. Its produced in the Leydig cells in the testes, and it plays an important role in sex drive, bone mass, body composition, muscle mass and strength, v… [+8900 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Dr. Tara Swart Bieber", "title": "MIT neuroscientist shares the No. 1 thing that sets people with 'excellent memory' apart from everyone else: 'It's rare' - CNBC", "description": "Memory skills vary from one person to another. MIT Sloan neuroscientist Dr. Tara Swart Bieber shares how she trains her brain to prevent memory decline as we age.", "url": "https://www.cnbc.com/2023/04/21/mit-neuroscientist-the-no-1-thing-that-sets-people-with-excellent-memory-apart-from-those-who-struggle.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107228583-1681999361217-GettyImages-1478399445_3.jpg?v=1682083898&w=1920&h=1080", "publishedAt": "2023-04-21T13:31:38Z", "content": "Exercising your memory regularly is the key to brain enhancement, especially if you want to ward off memory issues later on. But memory strength varies from one person to another.\r\nWhat separates peo… [+3623 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Korin Miller", "title": "Invasive Strep Infections Are Surging and Could Be Linked to COVID - Prevention Magazine", "description": "New data show cases have skyrocketed.", "url": "https://www.prevention.com/health/a43657968/group-a-strep/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/young-african-american-woman-covered-with-blanket-royalty-free-image-1682007972.jpg?crop=1xw:0.75035xh;center,top&resize=1200:*", "publishedAt": "2023-04-21T13:04:04Z", "content": "<ul><li>Cases of Group A strep have surged in the U.S.</li><li>A new report shows a 30% increase from the previous peak in cases in 2017. </li><li>Experts say the pandemic may be to blame.</li></ul>\r… [+5871 chars]"}]}