{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Newser"}, "author": "Steve Huff", "title": "Dinosaur Predecessors Looked Like They Wore Grins. Nope - Newser", "description": "Pig-sized rhynchosaurs had a physical flaw that wore down their teeth to nubs", "url": "https://www.newser.com/story/336837/dinosaur-predecessors-looked-like-they-wore-grins-nope.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1478775-12-20230625133000.jpeg", "publishedAt": "2023-06-25T18:30:00Z", "content": "In the age before the towering dinosaurs we know so well from textbooks and Jurassic Park movies, an ugly-cute creature about the size of a pig called the rhynchosaur roamed the Earth, chomping on to… [+2168 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can Humans Survive Long-Term in Deep Space? Maybe - SciTechDaily", "description": "Is it possible for humans to survive long-term in deep space? The answer is a lukewarm maybe, according to a new theory that outlines the intricate challenges of maintaining gravity and oxygen, securing water, cultivating food, and managing waste while being …", "url": "https://scitechdaily.com/can-humans-survive-long-term-in-deep-space-maybe/", "urlToImage": "https://scitechdaily.com/images/Astronaut-Spacecraft-Planets.jpg", "publishedAt": "2023-06-25T16:18:03Z", "content": "A new theory suggests that successful long-term human habitation in deep space requires a self-restoring, Earth-like ecosystem to sustain technology, infrastructure, and society. Crucial elements inc… [+3418 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coolest Rocky Exoplanet Ever: James Webb Reveals Surprising Atmosphere of TRAPPIST-1 C - SciTechDaily", "description": "Infrared measurements of TRAPPIST-1 c indicate that it is probably not as Venus-like as once imagined. NASA’s James Webb Space Telescope has successfully measured the heat radiating from TRAPPIST-1 c, an exoplanet orbiting a red dwarf star 40 light-years from…", "url": "https://scitechdaily.com/coolest-rocky-exoplanet-ever-james-webb-reveals-surprising-atmosphere-of-trappist-1-c/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Illustration.jpg", "publishedAt": "2023-06-25T15:25:29Z", "content": "BySpace Telescope Science InstituteJune 25, 2023\r\nNASAs James Webb Space Telescope has discovered that exoplanet TRAPPIST-1 c, despite being the same size as Venus and receiving similar radiation, do… [+18400 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "'Adversarial' search for neural basis of consciousness yields first results - Science", "description": "Two rival theories about the basis of perception went head-to-head in neuroscience experiments, but advocates of", "url": "https://www.science.org/content/article/search-neural-basis-consciousness-yields-first-results", "urlToImage": "https://www.science.org/do/10.1126/science.adj3877/abs/_20230623_on_consciousness_contest.jpg", "publishedAt": "2023-06-25T14:12:35Z", "content": "NEW YORK CITYAmidst rock music, a rap about consciousness, and the calling in of a 25-year-old drunken bet, camps backing two leading theories of how consciousness arises from the brain waited anxiou… [+9088 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "NASA just recycled 98% of all astronaut pee and sweat on the ISS (engineers are thrilled) - Space.com", "description": "Yes, the achievement hinges on better recycling tech for astronaut pee.", "url": "https://www.space.com/astronaut-pee-iss-water-recycling-98-percent-milestone", "urlToImage": "https://cdn.mos.cms.futurecdn.net/m2TXFEEtir7YVvZiyCQczQ-1200-80.jpg", "publishedAt": "2023-06-25T14:10:47Z", "content": "Astronauts aboard the International Space Station have achieved a 98% water recovery rate in a breakthrough achieved by a method that might make the faint of heart slightly squeamish: they hit peak a… [+4716 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "NASA's Jet Propulsion Laboratory and DARPA want to fix your PDFs. Here's how. - Space.com", "description": "NASA's Jet Propulsion Laboratory is helping DARPA with its digital document problems.", "url": "https://www.space.com/nasa-jet-propulsion-laboratory-pdf-cybersecurity", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NsoC7ejXUmzENydWyjVowf-1200-80.jpg", "publishedAt": "2023-06-25T12:58:35Z", "content": "JPL, meet PDF.\r\nWhile NASA's Jet Propulsion Laboratory\r\n (JPL) is renowned for piloting rovers on Mars\r\n and deploying spacecraft to study planets in the solar system\r\n, JPL's latest project is more … [+2329 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "10 best events across the US to celebrate the Oct. 14 annular solar eclipse - Space.com", "description": "From watching out of the window of a steam locomotive to glamping, music and even chucking pumpkins, there are lots of different ways to experience the annular solar eclipse in the U.S. on Oct. 14, 2023.", "url": "https://www.space.com/10-event-celebrations-for-annular-solar-eclipse-october-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QWmzCtSZUiXwXu4ibNFmP-1200-80.jpg", "publishedAt": "2023-06-25T12:58:27Z", "content": "Where will you be for America's 'ring of fire'? \r\nOn Saturday, Oct. 14, 2023, the second of three central eclipses crosses the U.S. in the eight years between 2017 and 2024. For most onlookers, it wi… [+8760 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Pioneers Quantum Light Source for Optical Quantum Computers and Teleportation Devices for Communication - SciTechDaily", "description": "The device emits a stream of single photons and could provide a basis for optical quantum computers. Using novel materials that have been widely studied as potential new solar photovoltaics, researchers at MIT have shown that nanoparticles of these materials …", "url": "https://scitechdaily.com/mit-pioneers-quantum-light-source-for-optical-quantum-computers-and-teleportation-devices-for-communication/", "urlToImage": "https://scitechdaily.com/images/Quantum-Light-Source-Concept-Art.jpg", "publishedAt": "2023-06-25T12:28:46Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyJune 25, 2023\r\nMIT researchers have discovered that novel photovoltaic nanoparticles can emit streams of identical photons, potentially pavin… [+8519 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "See the 'monster' sunspot that launched the Carrington Event, the most devastating solar storm in recorded history - Livescience.com", "description": "What did the sun look like before the devastating 1859 Carrington Event? Sketches from astronomer Richard Carrington hold the answer.", "url": "https://www.livescience.com/space/the-sun/see-the-monster-sunspot-that-launched-the-carrington-event-the-most-devastating-solar-storm-in-recorded-history", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hJCb4qpFTWcqLqDCiKFn5N-1200-80.jpg", "publishedAt": "2023-06-25T12:00:00Z", "content": "On Sept. 1, 1859, British astronomer Richard Carrington was investigating a strange cluster of dark blobs in the sun's atmosphere when a bright blast of light caught his eye. Shining for nearly five … [+3100 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kasha Patel", "title": "The shocking things scientists learned from one of the most powerful volcano eruptions - The Washington Post", "description": "The volcano has already broken several records. Now, a new study reveals more details of this puzzling event by analyzing lightning data.", "url": "https://www.washingtonpost.com/climate-environment/2023/06/25/tonga-volcano-eruption-lightning-record-study/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/06-24-2023/t_0d3e411111234914a870105186d1e2e4_name_1___1920x1080___30p_00_03_18_28_Still022.jpg&w=1440", "publishedAt": "2023-06-25T11:32:57Z", "content": "Comment on this story\r\nComment\r\nLike crime scene investigators, scientists are retracing what exactly happened on Jan. 15, 2022, near the Tonga archipelago in the South Pacific. At the time, the bare… [+5318 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Mane Kara-Yakoubian", "title": "New research links climate change to shrinking brain size in modern humans - PsyPost", "description": "A new study suggests that decreases in brain size in modern humans may be driven by natural selection in response to climate change and environmental stress, starting around 15,000 years ago. The research indicates that the human brain continues to evolve, an…", "url": "https://www.psypost.org/2023/06/new-research-links-climate-change-to-shrinking-brain-size-in-modern-humans-165988", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/06/nature-brain-leaves-blowing-away.jpg", "publishedAt": "2023-06-25T11:05:26Z", "content": "Prior work has linked decreases in the brain size of modern humans to increases in obesity. A new paper published in Brain, Behaviour, and Evolution considers climate change as a potential factor aff… [+3179 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Key Protein Vital for Structural Integrity of Neurons – Without It Axons Break, Synapses Die - SciTechDaily", "description": "Scientists find a protein common to flies and people is essential for supporting the structure of axons that neurons project to make circuit connections. In a study conducted by MIT's Picower Institute for Learning and Memory, researchers found that a protein…", "url": "https://scitechdaily.com/?p=287495", "urlToImage": "https://scitechdaily.com/images/Neuronal-Brain-Cell-Damage-Concept-Illustration.jpg", "publishedAt": "2023-06-25T10:28:18Z", "content": "ByDavid Orenstein, The Picower Institute for Learning and MemoryJune 25, 2023\r\nMIT scientists found that the protein perlecan, found in both flies and humans, is vital for maintaining the structural … [+8249 chars]"}, {"source": {"id": null, "name": "Houston Chronicle"}, "author": "Andrea Leinfelder", "title": "Meet the 4 strangers who will live on 'Mars' for a year in NASA's Johnson Space Center in Houston - Houston Chronicle ", "description": "Four strangers will spend 378 days in NASA’s Johnson Space Center pretending to be on Mars. They will embark on that journey Sunday around 7 p.m.", "url": "https://www.houstonchronicle.com/news/houston-texas/space/article/nasa-mars-simulation-houston-johnson-space-center-18163037.php", "urlToImage": "https://s.hdnux.com/photos/01/33/33/64/23969058/5/rawImage.jpg", "publishedAt": "2023-06-25T10:04:17Z", "content": "Ross Brockwell convinced a lifelong friend to manage his miscellaneous affairs, and Kelly Haston stockpiled videos of friends and family.These three strangers plus Anca Selariu, a backup crew member … [+4811 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "JPL and the Space Age: Triumph at Saturn – Part II (NASA Documentary) - SciTechDaily", "description": "With the Cassini spacecraft, built by NASA’s Jet Propulsion Laboratory, safely in orbit around Saturn, science takes center stage, beginning with the dramatic descent of the European Space Agency’s Huygens probe to the surface of Saturn’s shrouded moon Titan.…", "url": "https://scitechdaily.com/jpl-and-the-space-age-triumph-at-saturn-part-ii-nasa-documentary/", "urlToImage": "https://scitechdaily.com/images/Cassini-Saturn-Orbit-Insertion-scaled.jpg", "publishedAt": "2023-06-25T07:56:52Z", "content": "ByNASAs Jet Propulsion LaboratoryJune 25, 2023\r\nCassini reached Saturn in July 2004 and spent more than 13 years studying the planet. The mission was noted for its many significant discoveries, inclu… [+5131 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Cambridge Study: Current Climate Projections Significantly Underestimate Impact of Volcanic Eruptions - SciTechDaily", "description": "Scientists have discovered that standard climate predictions may undervalue the surface temperature cooling effect of volcanic eruptions by a multiple of two, possibly even four. Despite this, the effect is not substantial enough to counterbalance the global …", "url": "https://scitechdaily.com/new-cambridge-study-current-climate-projections-significantly-underestimate-impact-of-volcanic-eruptions/", "urlToImage": "https://scitechdaily.com/images/Supervolcano-Eruption.gif", "publishedAt": "2023-06-25T05:11:23Z", "content": "A study led by the University of Cambridge suggests that the cooling effect of volcanic eruptions on Earths surface temperature is likely underestimated in standard climate projections, possibly by u… [+5443 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "The Clouds of Venus Could Support Life - Universe Today", "description": "A recent study published in Astrobiology examines the likelihood of the planet Venus being able to support life within the thick cloud layer that envelopes it. This study holds the potential to help us better understand how life could exist under the intense …", "url": "https://www.universetoday.com/162086/the-clouds-of-venus-could-support-life/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/715px-venuspioneeruv_1-750.jpg", "publishedAt": "2023-06-25T04:54:00Z", "content": "A recent study published in Astrobiology examines the likelihood of the planet Venus being able to support life within the thick cloud layer that envelopes it. This study holds the potential to help … [+4062 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily", "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…", "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg", "publishedAt": "2023-06-25T01:30:26Z", "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Study reveals how immune system of astronauts breaks down - KSL.com", "description": "Evidence is growing about the many ways that traveling in the microgravity environment of space tampers with the human body, with new research showing how it dials down the activity of genes in white blood cells crucial to the immune system.", "url": "https://www.ksl.com/article/50671711/study-reveals-how-immune-system-of-astronauts-breaks-down", "urlToImage": "https://img.ksl.com/slc/2935/293570/29357070.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-06-24T22:49:38Z", "content": "Estimated read time: 3-4\r\n minutes\r\nWASHINGTON Evidence is growing about the many ways that traveling in the microgravity environment of space tampers with the human body, with new research showing h… [+3804 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cutting Alcohol Consumption in Half – Scientists Discover Surprising Side Effect of Obesity Drug Semaglutide - SciTechDaily", "description": "The medication Semaglutide, also known by brand names like Ozempic, has been approved to treat obesity, leading to an upsurge in demand that's caused recent procurement issues. Some patients struggling with obesity or diabetes have informally reported that th…", "url": "https://scitechdaily.com/cutting-alcohol-consumption-in-half-scientists-discover-surprising-side-effect-of-obesity-drug-semaglutide/", "urlToImage": "https://scitechdaily.com/images/Alcohol-Self-Medicating.jpg", "publishedAt": "2023-06-24T22:02:22Z", "content": "A new study showed that Semaglutide, a drug used to treat obesity and diabetes, significantly reduced alcohol consumption and the rate of relapses in alcohol-dependent rats, offering promise for its … [+4139 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Space elevators are inching closer to reality - Freethink", "description": "Tremendous progress has been made developing the materials necessary for a space elevator — but our need for one could soon disappear.", "url": "https://www.freethink.com/space/space-elevator", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/06/space-elevator-thumb.jpg?resize=1200,630", "publishedAt": "2023-06-24T22:00:00Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Extending Earth's Internet to Mars With Orbital Data Servers - Universe Today", "description": "More spacecraft is due to fly to Mars and will send their data home. Human explorers will want to access research documents and communicate the findings to Earth. This will require extending Earth's internet to Mars. A new study suggests that Mars will eventu…", "url": "https://www.universetoday.com/162083/extending-earths-internet-to-mars-with-orbital-data-servers/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/dsn-768x432.gif", "publishedAt": "2023-06-24T20:56:46Z", "content": "You’ve done it. After years of effort and training, sacrifice, and pain, you become an astronaut and have finally set foot on Mars. Time to post your triumph on TikTok for that sweet social media cre… [+3368 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New White Dwarf Pulsar Discovery: “Stellar Fossils” Unveil Cosmic Secrets - SciTechDaily", "description": "A research group from the University of Warwick has discovered a rare white dwarf pulsar for only the second time, providing significant insights into stellar evolution. The pulsar's strong magnetic fields, rapid spinning, and cool temperature support the dyn…", "url": "https://scitechdaily.com/?p=287434", "urlToImage": "https://scitechdaily.com/images/Exotic-Binary-Star-System-AR-Scorpii.jpg", "publishedAt": "2023-06-24T20:44:49Z", "content": "ByUniversity of WarwickJune 24, 2023\r\nA research team has made the second-ever discovery of a rare type of white dwarf pulsar system, a significant advancement in understanding stellar evolution. The… [+7407 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Renee Yan", "title": "Is NASA prepared for an 'internet apocalypse'? - Chron", "description": "Some researchers say there is a chance that a solar superstorm could cause a large-scale internet failure within the next decade.", "url": "https://www.chron.com/news/space/article/nasa-internet-apocalypse-18169102.php", "urlToImage": "https://s.hdnux.com/photos/01/32/51/23/23762117/3/rawImage.jpg", "publishedAt": "2023-06-24T20:03:20Z", "content": "Volunteers will listen to low-frequency vibrations space radio picks up when solar eruptions directed toward Earth crash into its magnetic field for space weather research.\r\nNASA/Getty Images\r\nA NASA… [+2987 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists are closer to unlocking the secrets of spider silk - Earth.com", "description": "Scientists are closer to unlocking the secrets of the strongest spider silk in the world • Earth.com", "url": "https://www.earth.com/news/scientists-are-closer-to-unlocking-the-secrets-of-spider-silk/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/24155134/spider-web_rainbow_1medium.jpg", "publishedAt": "2023-06-24T19:50:02Z", "content": "In the world of materials science, spider silk is fascinating. It’s a material that’s super strong, incredibly light, and remarkably flexible. Yet, despite the tireless efforts of many researchers, t… [+6374 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Octo-eyes: Unraveling Octopus Vision with Neural Mapping - Neuroscience News", "description": "Researchers mapped neural activity in an octopus's visual system, revealing striking similarities to humans.", "url": "https://neurosciencenews.com/octopus-vision-neuroscience-23522/", "urlToImage": "https://neurosciencenews.com/files/2023/06/octopus-visual-processing-neurosicences.jpg", "publishedAt": "2023-06-24T19:01:50Z", "content": "Summary: Researchers mapped neural activity in an octopus’s visual system, revealing striking similarities to humans.\r\nThe team observed neural responses to light and dark spots, thereby creating a m… [+7211 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "Astronomers Spot the Same Supernova 4 Times Due to an Einsteinian Effect - Inverse", "description": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it — collectively referred to as the Cosmic Distance Ladder.", "url": "https://www.inverse.com/science/astronomers-see-the-same-supernova-four-times-thanks-to-a-gravitational-lens", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/6/20/41d7f1e2-d38c-443d-87ae-b37032e09f7a-einstein_cross-1915x1200.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-24T18:00:25Z", "content": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it collectively referred to as the Cosmic Distance Ladder. One particularly crucial tool is Type Ia… [+3845 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "Dolphin ancestors had super weird teeth: A new study on the 'grandparents of modern dolphins' - Salon", "description": "Salon spoke with the author of a paleontology study the hints at the evolution of echolocation in dolphins", "url": "https://www.salon.com/2023/06/24/dolphin-ancestors-had-super-weird-teeth-a-new-study-on-the-grandparents-of-modern-dolphins/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/06/life_reconstruction_of_olympicetus_thalassodon_01.jpg", "publishedAt": "2023-06-24T17:59:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Critical Point in Matter Transformation: When the Universe Changes Its Mind - SciTechDaily", "description": "Analysis of lightweight nuclei emerging from gold ion collisions offers insight into primordial matter phase changes. Physicists analyzing data from gold ion smashups at the Relativistic Heavy Ion Collider (RHIC), a U.S. Department of Energy (DOE) Office of S…", "url": "https://scitechdaily.com/critical-point-in-matter-transformation-when-the-universe-changes-its-mind/", "urlToImage": "https://scitechdaily.com/images/Gold-Ion-Particle-Collision-Illustration.jpg", "publishedAt": "2023-06-24T16:27:19Z", "content": "ByBrookhaven National LaboratoryJune 24, 2023\r\nPhysicists at the RHIC are studying phase changes in nuclear matter from gold ion collisions to identify a critical point in these transformations. Thei… [+8253 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Mars Looks Gorgeous in New Images Taken by NASA's MAVEN Spacecraft - Gizmodo", "description": "The red planet donned a new color when captured in ultraviolet wavelengths.", "url": "https://gizmodo.com/nasa-maven-spacecraft-images-mars-seasons-north-south-1850571845", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cfdc251c21ea22cabff00361a68f960d.png", "publishedAt": "2023-06-24T15:30:00Z", "content": "NASAs Martian explorer, MAVEN, captured Earths neighboring planet in fascinating detail, revealing the changing seasons on Mars as it orbits around the Sun. \r\nThe Mars Atmosphere and Volatile Evoluti… [+2604 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "There Could Be Captured Planets in the Oort Cloud - Universe Today", "description": "The early Solar System was a turbulent and chaotic place with icy material hurled far from the Sun, becoming the Oort Cloud. Larger objects and planets were probably hurled into the Oort Cloud too, and some might have been kicked out of the Solar System entir…", "url": "https://www.universetoday.com/162077/there-could-be-captured-planets-in-the-oort-cloud/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/ogle.jpg", "publishedAt": "2023-06-24T15:17:06Z", "content": "Our solar system has had a chaotic past. Earth and the other planets are now in stable orbits, but while they were forming they experienced drastic location shifts. Jupiter was likely much closer to … [+3226 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Spacecraft skims Mercury during close-range flyby - Mashable", "description": "The robotic mission flew less than 150 miles above the scorched planet.", "url": "https://mashable.com/article/mercury-images-closeup-bepicolombo", "urlToImage": "https://helios-i.mashable.com/imagery/articles/05lrArQDYUxuv1QSaTKnXnv/hero-image.fill.size_1200x675.v1687282342.png", "publishedAt": "2023-06-24T14:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Juliette Collen", "title": "Our galaxy's black hole not as sleepy as thought: astronomers - Phys.org", "description": "The supermassive black hole lurking at the center of our Milky Way galaxy is not as dormant as had been thought, a new study shows.", "url": "https://phys.org/news/2023-06-galaxy-black-hole-sleepy-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-first-ever-image-o.jpg", "publishedAt": "2023-06-24T13:20:06Z", "content": "The supermassive black hole lurking at the center of our Milky Way galaxy is not as dormant as had been thought, a new study shows.\r\nThe slumbering giant woke up around 200 years ago to gobble up som… [+3599 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Terrifying Solar storms putting satellites in danger, NASA says - HT Tech", "description": "Earth's thermosphere has experienced its highest temperature in nearly 20 years as a result of intense solar storms.", "url": "https://tech.hindustantimes.com/tech/news/terrifying-solar-storms-putting-satellites-in-danger-nasa-says-71687609561332.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/satellite_1687609880842_1687609881108.jpg", "publishedAt": "2023-06-24T12:33:27Z", "content": "Earth's thermosphere has experienced its highest temperature in nearly 20 years as a result of intense solar storms. These storms, caused by coronal mass ejections and solar wind from the sun, have l… [+2274 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cataclysm in the Cosmos: Princeton Researchers Unmask the Violent Origins of the Geminids Meteor Shower - SciTechDaily", "description": "Princeton researchers used data from NASA's Parker Solar Probe to deduce that a catastrophic event likely created the prolific Geminids meteoroid stream. Unlike most meteor showers which originate from comets, the Geminids appear to stem from the asteroid 320…", "url": "https://scitechdaily.com/cataclysm-in-the-cosmos-princeton-researchers-unmask-the-violent-origins-of-the-geminids-meteor-shower/", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Spacecraft-Approaching-Sun-1.jpg", "publishedAt": "2023-06-24T12:13:01Z", "content": "ByPrinceton UniversityJune 24, 2023\r\nIllustration of the Parker Solar Probe spacecraft approaching the sun. Princeton scientists used NASAs Parker Solar Probe data to deduce a violent, catastrophic e… [+10181 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "What causes the strange green flash at sunset and sunrise on Earth? - Space.com", "description": "There are very special cases, when the sky is very clear and exceptionally transparent, that a green flash can be glimpsed just as the very topmost part of the sun is rising or setting.", "url": "https://www.space.com/green-flash-earth-sunrise-sunset", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WV3Bh8TGjQFCK3YNNtxz3g-1200-80.jpg", "publishedAt": "2023-06-24T12:00:06Z", "content": "Here is something that you might remember from your high school earth science class: As sunlight — which appears to be pure white — passes through a glass prism, it refracts or bends. Different wavel… [+6883 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "The most stunning space images captured in 2023, so far - Mashable", "description": "Jaw-dropping views of the cosmos.", "url": "https://mashable.com/article/space-images-best", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01g0XCwc5BtpHzS0Jt93axM/hero-image.fill.size_1200x675.v1686691089.png", "publishedAt": "2023-06-24T10:30:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "SpaceX to launch Europe's Euclid dark energy probe 1 week from today - Space.com", "description": "The dark energy and dark matter hunter launches on July 1.", "url": "https://www.space.com/dark-energy-euclid-spacex-rocket-launch-one-week-away", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8ruAUk6URTqdRZoJKDFAJn-1200-80.jpg", "publishedAt": "2023-06-24T10:00:47Z", "content": "A European probe is just one week away from launching on its mission to help unveil the dark universe.\r\nEuclid, a dark matter and dark energy hunter, is scheduled to launch atop a SpaceX Falcon 9 roc… [+4362 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Lost World” of Ancient Creatures Discovered – 1.6 Billion-Year-Old Eukaryotic Organisms - SciTechDaily", "description": "Researchers have discovered 1.6 billion-year-old eukaryotic organisms, the Protosterol Biota, believed to be Earth's first predators. These ancient creatures, found through fossil fat molecules in ancient rocks, were more complex than bacteria, predating and …", "url": "https://scitechdaily.com/lost-world-of-ancient-creatures-discovered-1-6-billion-year-old-eukaryotic-organisms/", "urlToImage": "https://scitechdaily.com/images/Protosterol-Biota-illustration.jpg", "publishedAt": "2023-06-24T09:47:29Z", "content": "ByAustralian National UniversityJune 24, 2023\r\nArtists imagination of two primordial eukaryotic organisms of the Protosterol Biota on the ocean floor. Based on molecular fossils, organisms of the Pro… [+5935 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Cameron Duke", "title": "Why did the last ice age end? - Livescience.com", "description": "What caused the last ice age to end around 10,000 years ago?", "url": "https://www.livescience.com/planet-earth/geology/why-did-the-last-ice-age-end", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SzFQpmkeABemCKNNvLWkK-1200-80.jpg", "publishedAt": "2023-06-24T09:00:00Z", "content": "Nearly 10,000 years ago, Earth came out of its most recent ice age. Vast, icy swaths of land around the poles thawed, melting the glaciers that had covered them for nearly 100,000 years. \r\nWhy, after… [+4661 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Meg Duff", "title": "What is the maximum number of biological parents an organism can have? - Livescience.com", "description": "Most organisms have two parents, but not all. Could an individual have three parents, or even more?", "url": "https://www.livescience.com/health/genetics/what-is-the-maximum-number-of-biological-parents-an-organism-can-have", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aC2JvN2tpCj48WqTHaseQP-1200-80.jpg", "publishedAt": "2023-06-24T09:00:00Z", "content": "Families come in all shapes and sizes, and not all parents are biologically related to their children. But most people do have two genetic parents, from whom they inherited their DNA. However, a very… [+6286 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Radio Revelations: Unraveling the Origins of a Supernova - SciTechDaily", "description": "An international team of astronomers has revealed the origin of a thermonuclear supernova explosion. Strong emission lines of helium and the first detection of such a supernova in radio waves show that the exploding white dwarf star had a helium-rich companio…", "url": "https://scitechdaily.com/radio-revelations-unraveling-the-origins-of-a-supernova/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-06-24T08:32:28Z", "content": "ByUniversity of TurkuJune 24, 2023\r\nArtist impression of the double star system with a compact white dwarf star accreting matter from a helium-rich donor companion, surrounded by dense and dusty circ… [+4646 chars]"}, {"source": {"id": null, "name": "Belloflostsouls.net"}, "author": "Larry Vela", "title": "Warhammer 40K: What Is The Astronomican Anyway? - BoLS", "description": "The Astronomican is the Emperor's great beacon. Without which warp travel would be impossible. But watches the astronomical lighthouse?", "url": "https://www.belloflostsouls.net/2023/06/warhammer-40k-what-is-the-astronomican-anyway.html", "urlToImage": "https://www.belloflostsouls.net/wp-content/uploads/2019/07/astronomican.jpg", "publishedAt": "2023-06-24T08:30:37Z", "content": "The Astronomican is the Emperor’s great beacon. Without which warp travel would be impossible. But who watches the astronomical lighthouse?\r\nThe Astronomican\r\nThe Astronomican is a psychic beacon whi… [+7870 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Alexander McNamara", "title": "Science news this week: Asia's tallest tree and mysterious brain spirals - Livescience.com", "description": "June 24, 2023: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/planet-earth/science-news-this-week-asias-tallest-tree-and-mysterious-brain-spirals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cvWdseL23SwpYeC69M56Mc-1200-80.jpg", "publishedAt": "2023-06-24T08:00:00Z", "content": "The news this week was dominated by the search for the OceanGate Titan submersible, which went missing during its descent to the wreckage of the Titanic. Tragically, the U.S. Coast Guard confirmed th… [+3783 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Losing Your Y Chromosome Could Have Drastic Health Consequences - ScienceAlert", "description": "Cancerous bladder cells with a missing Y chromosome are better prepared to evade our immune system, according to a new study using mice and conducted by researchers from Cedars-Sinai Medical Center and The Ohio State University in the US.", "url": "https://www.sciencealert.com/losing-your-y-chromosome-could-have-drastic-health-consequences", "urlToImage": "https://www.sciencealert.com/images/2023/06/y_chromosome_yellow_block.jpg", "publishedAt": "2023-06-24T06:01:11Z", "content": "Cancerous bladder cells with a missing Y chromosome are better prepared to evade our immune system, according to a new study using mice and conducted by researchers from Cedars-Sinai Medical Center a… [+3946 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sun BLASTS another solar flare at Earth; Know the geomagnetic storm warning - HT Tech", "description": "Geomagnetic storm warnings are incoming after another solar flare erupted on the Sun. This time, it was an M 4.9-class solar flare.", "url": "https://tech.hindustantimes.com/tech/news/sun-blasts-another-solar-flare-at-earth-know-the-geomagnetic-storm-warning-71687585642127.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/g55452219aca037399358a816957cb701756ab19a372f2b0d8_1687585682449_1687585682569.png", "publishedAt": "2023-06-24T05:54:22Z", "content": "We are yet to receive an update on the incoming CME cloud that is supposed to deliver a glancing blow to the Earth today. But in the meantime, reports of another solar flare eruption have raised conc… [+2432 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Image of Jupiter's Atmosphere Captured by NASA's Juno Spacecraft Reveals High-Altitude Hazes - SciTechDaily", "description": "On March 1, 2023, NASA's Juno mission completed its 49th close flyby of Jupiter. As the spacecraft flew low over the giant planet's cloud tops, its JunoCam instrument captured this look at bands of high-altitude haze forming above cyclones in an area known at…", "url": "https://scitechdaily.com/stunning-image-of-jupiters-atmosphere-captured-by-nasas-juno-spacecraft-reveals-high-altitude-hazes/", "urlToImage": "https://scitechdaily.com/images/Jupiter-Atmosphere-High-Altitude-Hazes.jpg", "publishedAt": "2023-06-24T04:58:45Z", "content": "ByNASAJune 23, 2023\r\nNASAs Juno mission achieved a significant milestone with the completion of its 49th close flyby of Jupiter on March 1, 2023. The spacecraft, during its flyby, captured remarkable… [+3899 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Sean Thiessen", "title": "A New Study Reveals A Terrifying Truth Of The Early Universe - Giant Freakin Robot", "description": "Scientists used a new mathematical model, based on gravitional waves, to learn more about the origins of the universe.", "url": "https://www.giantfreakinrobot.com/sci/universe-filled-black-holes.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2020/07/blackhole3-e1677771500416.jpeg", "publishedAt": "2023-06-24T03:51:54Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Way To Annihilate a Star: Stellar Demolition Derby Near Black Hole in Ancient Galaxy - SciTechDaily", "description": "Astrophysicists have discovered a new mechanism for star destruction and gamma-ray burst generation, originating from stellar collisions in the dense environments near supermassive black holes in ancient galaxies. This finding, published in Nature Astronomy, …", "url": "https://scitechdaily.com/a-new-way-to-annihilate-a-star-stellar-demolition-derby-near-black-hole-in-ancient-galaxy/", "urlToImage": "https://scitechdaily.com/images/Gamma-Ray-Burst-Artistic-Illustration-scaled.jpg", "publishedAt": "2023-06-24T01:32:33Z", "content": "ByNorthwestern UniversityJune 23, 2023\r\nAn international team of astrophysicists led by Radboud University in the Netherlands discovered a novel mechanism that destroys stars and generates a gamma-ra… [+10936 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling the Catalyst of Life: The Unexpected Role of Sulfate - SciTechDaily", "description": "A recent research study may have discovered a missing link that helps explain Earth's uniquely oxygen-saturated atmosphere and the corresponding evolution of animal life on our planet. The study, led by a Fellow of the Forrest Research Foundation at The Unive…", "url": "https://scitechdaily.com/unveiling-the-catalyst-of-life-the-unexpected-role-of-sulfate/", "urlToImage": "https://scitechdaily.com/images/Planet-Earth-Glowing.jpg", "publishedAt": "2023-06-24T00:18:12Z", "content": "A new study suggests that the weathering of sulfate rocks, not increasing ocean phosphorus levels, was crucial to the oxygenation of Earths atmosphere, influencing the late evolution of animal life, … [+2786 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Physicists Discover a New State of Matter Hidden in The Quantum World - ScienceAlert", "description": "You're familiar with the states of matter we encounter daily – such as solid, liquid, and gas – but in more exotic and extreme conditions, new states can appear, and scientists from the US and China just found one.", "url": "https://www.sciencealert.com/physicists-discover-a-new-state-of-matter-hidden-in-the-quantum-world", "urlToImage": "https://www.sciencealert.com/images/2023/06/ElectronFuzz.jpg", "publishedAt": "2023-06-24T00:01:13Z", "content": "You're familiar with the states of matter we encounter daily such as solid, liquid, and gas but in more exotic and extreme conditions, new states can appear, and scientists from the US and China just… [+3394 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "Our Milky Way Is Somewhat Of An Oddball Galaxy, New Study Confirms - Forbes", "description": "The disk of our Milky Way galaxy formed way early; earlier than most spiral galaxies of its size, but it’s not a complete outlier.", "url": "https://www.forbes.com/sites/brucedorminey/2023/06/23/our-milky-way-is-somewhat-of-an-oddball-galaxy-new-study-confirms/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6496297203a751a3c55d4176/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2023-06-23T23:31:39Z", "content": "386160 01: An image produced by the Hubble telescope of the perfectly \"edge-on\" galaxy, or NGC 4013 ... [+] , March 1, 2001. This new Hubble picture reveals, with great detail, huge clouds of dust an… [+3814 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Strange Objects Found at The Galactic Center Are Like Nothing Else in The Milky Way - ScienceAlert", "description": "There's something really weird in the center of the Milky Way.", "url": "https://www.sciencealert.com/strange-objects-found-at-the-galactic-center-are-like-nothing-else-in-the-milky-way", "urlToImage": "https://www.sciencealert.com/images/2020-01/processed/black-hole-blobs_1024.jpg", "publishedAt": "2023-06-23T23:14:55Z", "content": "There's something really weird in the center of the Milky Way.\r\nThe vicinity of a supermassive black hole is a pretty weird place to start with, but in 2020 astronomers found six objects orbiting Sag… [+4123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unraveling Cosmic Mysteries: Celestial Monsters and the Origins of Globular Clusters - SciTechDaily", "description": "Researchers from the universities of Geneva, Paris, and Barcelona have uncovered strong evidence that the peculiarities seen in sizable star clusters can be explained by supermassive stars. Globular clusters are the universe's most massive and ancient star gr…", "url": "https://scitechdaily.com/unraveling-cosmic-mysteries-celestial-monsters-and-the-origins-of-globular-clusters/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Stars-Globular-Clusters.jpg", "publishedAt": "2023-06-23T22:57:44Z", "content": "ByUniversity of GenevaJune 23, 2023\r\nScientists have found strong evidence that supermassive stars existed within globular clusters when they formed 13 billion years ago. Here, an image of the globul… [+5252 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "TRAPPIST-1c by James Webb // Ancient Echo from Sgr A* // Lightning on Jupiter - Fraser Cain", "description": "JWST Looks at the Next Planet in the TRAPPIST system. Could we detect colliding supermassive black holes. Hot Jupiters that flew too close to their stars. 🦄...", "url": "https://www.youtube.com/watch?v=5jw_cHqT8QU", "urlToImage": "https://i.ytimg.com/vi/5jw_cHqT8QU/maxresdefault.jpg", "publishedAt": "2023-06-23T22:52:41Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": "mars.nasa.gov", "title": "If at First You Don't Succeed… Persevere! - NASA - NASA Mars Exploration", "description": "As discussed in last week’s blog, the Science Team has been attempting to obtain a sample of a conglomerate rock unit on top of the fan in Jezero crater.", "url": "https://mars.nasa.gov/mars2020/mission/status/469/if-at-first-you-dont-succeed-persevere/", "urlToImage": "https://mars.nasa.gov/mars2020-raw-images/pub/ods/surface/sol/00822/ids/edr/browse/cachecam/CCF_0822_0739939369_301ECMUN0400132CACH00227_01_295J01_1200.jpg", "publishedAt": "2023-06-23T22:28:34Z", "content": "As discussed in last weeks blog, the Science Team has been attempting to obtain a sample of a conglomerate rock unit on top of the fan in Jezero crater. The first attempt yielded a sample that was un… [+1736 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA's Parker Solar Probe starts summer with 16th swoop by the sun - Space.com", "description": "The sun-kissing spacecraft is definitely feeling the heat (but its science instruments, thankfully, are not).", "url": "https://www.space.com/nasa-parker-solar-probe-16th-sun-flyby", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SHcYVnfokLECLkasAnhVjc-1200-80.jpg", "publishedAt": "2023-06-23T22:00:17Z", "content": "NASA’s most advanced spacecraft for solar exploration just made another close flyby of the sun. \r\nThe Parker Solar Probe conducted its 16th perihelion pass on Thursday morning (June 22), cruising thr… [+2848 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Star Trek-style invention simultaneously carries out multiple medical tests like Mr. Spock's tricorder - Study Finds", "description": "Scientists have developed a cutting-edge device capable of performing multiple medical tests at the same time", "url": "https://studyfinds.org/star-trek-invention-medical-tests/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/06/4030674840_8c7856b2e6_o-scaled.jpg", "publishedAt": "2023-06-23T21:33:36Z", "content": "WASHINGTON — Science fiction is about to become reality. Scientists have developed a cutting-edge device capable of performing multiple medical tests at the same time. This laser biosensor, reminisce… [+7275 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "The Earth's Rotational Pole has Shifted from All the Groundwater We've Pumped Out - Universe Today", "description": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geological Survey. Glaciers and ice caps make up another 1.74%, but…", "url": "https://www.universetoday.com/162069/the-earths-rotational-pole-has-shifted-from-all-the-groundwater-weve-pumped-out/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/9837.jpg", "publishedAt": "2023-06-23T21:31:39Z", "content": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geologi… [+4136 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Watch a house-size asteroid zoom past Earth live on June 25 - Space.com", "description": "The asteroid will pass between Earth and the moon, but there's no need to worry.", "url": "https://www.space.com/asteroid-2023-mu2-livestream-june-25", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7yL4EpQtmyw4jYuKZXygSM-1200-80.jpg", "publishedAt": "2023-06-23T21:00:05Z", "content": "Earth is about to have a close encounter with a space rock.\r\nOn Sunday (June 25), the near-Earth asteroid 2023 MU2 will pass within 134,000 miles (215,000 kilometers) of Earth, or just about 60% of t… [+2132 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New finding suggests how and why temperatures determine the sex of turtles - Phys.org", "description": "Warmer temperatures are known to make more turtle eggs become female hatchlings, but new research out of Duke University shows that those females also have a higher capacity for egg production, even before their sex is set.", "url": "https://phys.org/news/2023-06-temperatures-sex-turtles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-finding-suggests-h.jpg", "publishedAt": "2023-06-23T20:19:55Z", "content": "Warmer temperatures are known to make more turtle eggs become female hatchlings, but new research out of Duke University shows that those females also have a higher capacity for egg production, even … [+4844 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT's Nematic Leap: Physicists Discover a New Switch for Superconductivity - SciTechDaily", "description": "MIT researchers have found a new mechanism by which the superconductor iron selenide transitions into a superconducting state. Unlike other iron-based superconductors, iron selenide's transition involves a collective shift in atoms' orbital energy, not atomic…", "url": "https://scitechdaily.com/mits-nematic-leap-physicists-discover-a-new-switch-for-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Graphene-2D-Material-Superconductivity-Concept.jpg", "publishedAt": "2023-06-23T20:12:56Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJune 23, 2023\r\nMIT physicists have unveiled a new understanding of how certain superconductors transition into a superconducting state, offering f… [+7372 chars]"}]}