{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "ign", "name": "IGN"}, "author": "Anthony Wood", "title": "Webb Telescope Captures the Most Distant Galaxies Ever Seen - IGN", "description": "NASA's James Webb Space Telescope has identified four of the most distant and ancient galaxies ever discovered, some of which existed just 300 million years after the creation of the cosmos in the Big Bang.", "url": "https://www.ign.com/articles/webb-telescope-captures-the-most-distant-galaxies-ever-seen", "urlToImage": "https://assets-prd.ignimgs.com/2022/12/16/jwst-thumbnail-1671208608257.jpg?width=1280", "publishedAt": "2022-12-27T20:04:25Z", "content": "NASAs James Webb Space Telescope has revealed the most distant galaxies ever discovered, some of which date back to just 300 million years after the creation of the universe in the Big Bang a time wh… [+3794 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Kevin Hurler", "title": "This Asteroid Impact Simulator Lets You Destroy the World - Gizmodo", "description": "A web app from Neal.Fun is a choose-your-own-adventure for planetary annihilation", "url": "https://gizmodo.com/asteroid-impact-simulator-app-neal-fun-1849931088", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/6902313d01920f490c33053e2ff28d61.png", "publishedAt": "2022-12-27T19:35:00Z", "content": "Hundreds of thousands of asteroids lurk in our solar system, and while space agencies track many of them, theres always the chance that one will suddenly appear on a collision course with Earth. A ne… [+1763 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Aylin Woodward", "title": "NASA's Stellar 2022: Spectacular Images From Historic Year in Space - The Wall Street Journal", "description": "The agency completed its Artemis I mission, deflected an asteroid and showed dazzling new images from the James Webb Space Telescope", "url": "https://www.wsj.com/story/nasas-stellar-2022-spectacular-images-from-historic-year-in-space-0ee45fa1", "urlToImage": "https://images.wsj.net/im-688641", "publishedAt": "2022-12-27T16:06:56Z", "content": "NASA launched its new Space Launch System, a rocket designed to help return humans to the moon as part of the agencys Artemis program.\r\nKevin Dietsch/Getty Images"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "John Bett", "title": "Star Wars fans amazed after spotting 'lightsaber' on Mars in new NASA footage - The Mirror", "description": "The item on Mars certainly looks like a 'lightsaber', as it is a thin metal tube with a thick end, which could be a handle. It also has a thinner side, which could form the blade part", "url": "https://www.mirror.co.uk/news/weird-news/star-wars-fans-amazed-after-28822696", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article28822741.ece/ALTERNATES/s1200/0_SWNS_MARS_LIGHTSABER_01.jpg", "publishedAt": "2022-12-27T15:47:50Z", "content": "Star Wars fans thought they'd found proof that there was another Jedi out there, after spotting a 'lightsaber' on Mars in a new picture released by NASA. The image in question shows a thin metal tube… [+3228 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "10 weird things about SpaceX's Starlink internet satellites - Space.com", "description": "While Starlink satellites consistently make headlines, there are plenty of weird facts about Starlink that fly below the radar.", "url": "https://www.space.com/spacex-starlink-satellites-10-weird-things", "urlToImage": "https://cdn.mos.cms.futurecdn.net/khEuyU4NmAqmniwDiPzoUd-1200-80.jpg", "publishedAt": "2022-12-27T11:00:05Z", "content": "SpaceX's Starlink satellites are among the most well-known spacecraft in the world.\r\nThere are currently over 3,000 Starlink satellites in orbit, and SpaceX plans to launch many more. The satellites … [+10823 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "European Space Agency Shares Incredible Image Of Cone Nebula In Deep Space - NDTV", "description": "The photo of the nebula was clicked by the ESO's Very Large Telescope to celebrate its 60th anniversary.", "url": "https://www.ndtv.com/feature/european-space-agency-shares-incredible-image-of-cone-nebula-in-deep-space-3641974", "urlToImage": "https://c.ndtvimg.com/2022-12/50c52et8_cone-nebula-650_625x300_27_December_22.jpg", "publishedAt": "2022-12-27T10:51:50Z", "content": "The cone nebula has a lighthouse-like shape.\r\nA stunning image of a cone nebula in deep space has left the astronomers in shock. The image shows a strange figure in the vast universe that appears to … [+1413 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelsey Neubauer", "title": "A 120 million-year-old dinosaur fossil with the bones of its final snack still inside of it reveals it enjoyed eating our ancestors - Yahoo News", "description": "A McGill professor of paleontology found a tiny fossilized mammal foot inside a winged dinosaur called a Microraptor.", "url": "https://www.businessinsider.com/bones-of-a-dinosaurs-meal-found-in-fossil-2022-12", "urlToImage": "https://media.zenfs.com/en/business_insider_articles_888/aabd03d830e979535de205f09c598c67", "publishedAt": "2022-12-27T02:53:00Z", "content": "The fossil of a Microraptor with the bones of its last meal, a small mammal inside it.Hans Larsson\r\n<ul><li>Paleontologist Hans Larsson found a small mammal foot in the rib of a dinosaur fossil.\r\n</l… [+1663 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Christina Larson, Associated Press", "title": "Glass act: Scientists reveal secrets of frog transparency - KSL.com", "description": "A species of glass frogs found in South and Central America has the rare ability to turn on and off its transparent appearance. Researchers report Thursday in the journal Science that some sleeping glass frogs concentrate, or \"hide,\" nearly 90% of their red b…", "url": "https://www.ksl.com/article/50544970/glass-act-scientists-reveal-secrets-of-frog-transparency", "urlToImage": "https://img.ksl.com/slc/2907/290785/29078586.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-12-26T21:03:51Z", "content": "Estimated read time: 2-3 minutes\r\nWASHINGTON Now you see them, now you don't.\r\nSome frogs found in South and Central America have the rare ability to turn on and off their nearly transparent appearan… [+2609 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Happy New Year on Mars! NASA rings in Red Planet year 37 - Space.com", "description": "Mars years last twice as long as Earth years, and use a different numbering system.", "url": "https://www.space.com/mars-new-year-37-nasa-celebrates", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rFxjRZcHNTZ8Jpw34pthnQ-1200-80.jpg", "publishedAt": "2022-12-26T16:53:24Z", "content": "Martian fans will need to break out their New Year champagne a bit early in 2022.\r\nThe new year on Mars started today (Dec. 26), NASA said, days after the Perseverance rover set a milestone on the Re… [+2168 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Uncovers a Galactic Wonder: Strange Galaxy Captured in Stunning Detail - SciTechDaily", "description": "The peculiar spiral galaxy ESO 415-19, which is located approximately 450 million light-years away from Earth, stretches lazily across this image from the NASA/ESA Hubble Space Telescope. While the center of this object resembles a regular spiral galaxy, long…", "url": "https://scitechdaily.com/?p=238942", "urlToImage": "https://scitechdaily.com/images/Galaxy-ESO-415-19-Crop-scaled.jpg", "publishedAt": "2022-12-26T16:32:40Z", "content": "ByESA/HubbleDecember 26, 2022\r\nHubble Space Telescope image of spiral galaxy ESO 415-19, , which lies around 450 million light-years away. Credit: ESA/Hubble &amp; NASA, J. Dalcanton, Dark Energy Sur… [+3874 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Can we save Mars robots from death by dust? - Space.com", "description": "Some Mars robots get help from nature to fend off dust for longer.", "url": "https://www.space.com/saving-mars-robots-from-death-by-dust", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3bJuDPq6oyCE6A9jz4jS8W-1200-80.jpg", "publishedAt": "2022-12-26T16:00:37Z", "content": "NASA's Mars InSight lander died a slow death by dust last week. For months and months, the robot, built to study the tectonic activity on the Red Planet, has been running on less and less power as it… [+6301 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Scientists plan to hit an asteroid with more than 9.6 million radio waves from HAARP - Interesting Engineering", "description": "Scientists plan to examine the interiors of an asteroid using low-frequency radio waves. This test is crucial for improving our planetary defense.", "url": "https://interestingengineering.com/science/hitting-an-asteroid-with-radio-waves", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/12/26/image/jpeg/xoG2lknq7Q5Kalf8PRQ5gwEgaTZkRDuU8od6XgeX.jpg", "publishedAt": "2022-12-26T15:16:00Z", "content": "The researchers will use the HAARP (High-frequency Active Auroral Research Program) array to shoot 9.6 megahertz radio waves at the 2010 XC15 asteroid. HAARP is a government-funded research program t… [+1184 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Totally Unexpected: Scientists Discover “An Entirely New Way of Designing a Nervous System” - SciTechDaily", "description": "Octopuses are not like humans - they are invertebrates with eight arms and are more closely related to clams and snails. Despite this, they have evolved complex nervous systems with as many neurons as in the brains of dogs, allowing them to exhibit a wide ran…", "url": "https://scitechdaily.com/totally-unexpected-scientists-discover-an-entirely-new-way-of-designing-a-nervous-system/", "urlToImage": "https://scitechdaily.com/images/Octopus.jpg", "publishedAt": "2022-12-26T04:43:09Z", "content": "This groundbreaking discovery offers new insights into the evolution of complex nervous systems in invertebrate species and has the potential to inspire the development of autonomous underwater devic… [+5907 chars]"}]}