{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "WPVI-TV"}, "author": null, "title": "Meteorite hit Mercer County home, The College of New Jersey confirms | See new photos of meteorite in Mercer County - WPVI-TV", "description": "\"We are excited to be able to confirm that the object is a true chondrite meteorite,\" said the chair of TCNJ's physics department.", "url": "https://6abc.com/meteorite-nj-hopewell-township-new-jersey-eta-aquarids-meteor-shower-old-washington-crossing-pennington-road/13234502/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13234817_051123-wpvi-nj-meteorite-TCNJ-img-1.jpg?w=1600", "publishedAt": "2023-05-11T18:46:49Z", "content": "HOPEWELL TOWNSHIP, New Jersey (WPVI) -- Experts at The College of New Jersey have confirmed that it was indeed a meteorite that hit a Hopewell Township, Mercer County home earlier this week.\r\nSpecifi… [+2341 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "First-of-its-kind measurement of the universe's expansion rate weighs in on a longstanding debate - Phys.org", "description": "Thanks to data from a magnified, multiply imaged supernova, a team led by University of Minnesota Twin Cities researchers has successfully used a first-of-its-kind technique to measure the expansion rate of the universe. Their data provide insight into a long…", "url": "https://phys.org/news/2023-05-first-of-its-kind-universe-expansion-longstanding-debate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/first-of-its-kind-meas.jpg", "publishedAt": "2023-05-11T18:00:06Z", "content": "Thanks to data from a magnified, multiply imaged supernova, a team led by University of Minnesota Twin Cities researchers has successfully used a first-of-its-kind technique to measure the expansion … [+3993 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Hubble Space Telescope looks into center of vast galaxy cluster almost 9 billion light-years away - Fox News", "description": "NASA's Hubble Space Telescope captured an image of a galaxy cluster nearly nine billion light-years away in the constellation Draco, as well as its surroundings.", "url": "https://www.foxnews.com/science/hubble-space-telescope-center-galaxy-cluster-nine-billion-light-years-away", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/05/f364cf35-THUMB.jpg", "publishedAt": "2023-05-11T17:25:00Z", "content": "NASA's Hubble Space Telescope peered into the center of a vast galaxy cluster in a beautiful new image. \r\nThe European Space Agency (ESA) said the cosmic giant called eMACS J1823.1+7822 can be identi… [+1922 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Selects Five Teams to Study Lunar Science and Sample Analysis - NASA", "description": "NASA has selected five new research teams to collaborate on lunar science and lunar sample analysis research to support future exploration of the Moon as part of the agency’s Solar System Exploration Research Virtual Institute (SSERVI).", "url": "https://www.nasa.gov/feature/nasa-selects-five-teams-to-study-lunar-science-and-sample-analysis", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/lunar-science.png", "publishedAt": "2023-05-11T17:20:29Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Entanglement Shatters Einstein's Local Causality: The Future of Computing and Cryptography - SciTechDaily", "description": "ETH Zurich researchers have succeeded in demonstrating that quantum mechanical objects that are far apart can be much more strongly correlated with each other than is possible in conventional systems. For this experiment, they used superconducting circuits fo…", "url": "https://scitechdaily.com/quantum-entanglement-shatters-einsteins-local-causality-the-future-of-computing-and-cryptography/", "urlToImage": "https://scitechdaily.com/images/Abstract-Plasma-Quantum-Circuit-Physics.gif", "publishedAt": "2023-05-11T17:20:19Z", "content": "ByETH ZurichMay 11, 2023\r\nETH Zurich researchers performed a loophole-free Bell test with superconducting circuits, confirming quantum mechanics and disproving Einsteins local causality concept. The … [+7020 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "'Lost' bacteria found on Neanderthal teeth could be used to develop new antibiotics - Livescience.com", "description": "Fossilized dental plaque from archaic humans is revealing extinct bacteria that could lead to the development of new medicine.", "url": "https://www.livescience.com/archaeology/lost-bacteria-found-on-neanderthal-teeth-could-be-used-to-develop-new-antibiotics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HZJf6aeDu3PXKuP5fMvVQG-1200-80.jpg", "publishedAt": "2023-05-11T16:58:01Z", "content": "Strange bacteria trapped in Neanderthals' teeth may one day help researchers develop novel antibiotics, according to a study published May 4 in the journal Science\r\n (opens in new tab), which used de… [+4178 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Kevin Hurler", "title": "Newly Identified Deepwater Shark Has White Eyes and Weird Eggs - Gizmodo", "description": "Researchers have named a species of 'demon shark' that lurks off the coast of Australia.", "url": "https://gizmodo.com/newly-identified-deepwater-shark-has-white-eyes-and-wei-1850428290", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/3a769770ba6ef5a996ba77bcda823b70.png", "publishedAt": "2023-05-11T16:54:00Z", "content": "Bizarre egg cases at a museum led scientists to some serious nightmare fuel off the coast of northwestern Australia. The egg cases belonged to a previously misidentified species of deepwater catshark… [+1913 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Astronomers detect unusual galaxy system with a long, highly collimated tail of gas and stars - Phys.org", "description": "An international team of astronomers reports the discovery of a new enigmatic galaxy system as part of the DESI Legacy Imaging Surveys. The newfound system consists of a pair of galaxies and an extended highly collimated tail of gas and stars. The finding was…", "url": "https://phys.org/news/2023-05-astronomers-unusual-galaxy-highly-collimated.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/astronomers-detect-unu.jpg", "publishedAt": "2023-05-11T15:31:40Z", "content": "An international team of astronomers reports the discovery of a new enigmatic galaxy system as part of the DESI Legacy Imaging Surveys. The newfound system consists of a pair of galaxies and an exten… [+3552 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Marcia Dunn", "title": "Stunning mosaic of baby star clusters created from 1 million telescope shots - The Associated Press", "description": "CAPE CANAVERAL, Fla. (AP) — Astronomers have created a stunning mosaic of baby star clusters hiding in our galactic backyard.  The montage, published Thursday, reveals five vast stellar nurseries less than 1,500 light-years away.", "url": "https://apnews.com/25cfadb7455a0c9f8b92e1177eb82b68", "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b33fdedd59843c5ab265ee0e04b87eb/1280.webp", "publishedAt": "2023-05-11T15:09:15Z", "content": "CAPE CANAVERAL, Fla. (AP) Astronomers have created a stunning mosaic of baby star clusters hiding in our galactic backyard. \r\nThe montage, published Thursday, reveals five vast stellar nurseries less… [+1233 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Images From NASA's Perseverance May Show Record of Wild Martian River - NASA", "description": "Evidence left in rocks is leading scientists to rethink what watery environments looked like on ancient Mars.", "url": "https://www.nasa.gov/feature/jpl/images-from-nasa-s-perseverance-may-show-record-of-wild-martian-river", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-pia25829-curved-bands-of-rocks-at-skrinkle-haven-web.jpg", "publishedAt": "2023-05-11T15:05:11Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mysterious dark energy is spread evenly across the cosmos - Space.com", "description": "The anti-gravity force that is driving the accelerating expansion of the universe appears to be distributed uniformly across space and time.", "url": "https://www.space.com/dark-energy-distributed-evenly-across-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4L6sYUFmXX9BmTYhnkx58c-1200-80.jpeg", "publishedAt": "2023-05-11T13:00:11Z", "content": "Dark energy, the mysterious force apparently driving the accelerating expansion of the universe, is spread evenly through space and time, new results suggest.\r\nThe findings also better constrain how … [+4529 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Ashley Capoot", "title": "The human genome scientists use to scout for disease just got a major makeover - CNBC", "description": "The pangenome reference is a new, more inclusive collection of reference human genome sequences from 47 people with diverse backgrounds.", "url": "https://www.cnbc.com/2023/05/11/pangenome-reference-genome-drawn-from-47-people-of-diverse-backgrounds.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107185798-1675086040917-gettyimages-1073823296-is09bp4lf.jpg?v=1683802802&w=1920&h=1080", "publishedAt": "2023-05-11T11:00:02Z", "content": "Scientists have been using the same human genome sequence to study genomics for more than 20 years, but on Wednesday it got a major makeover.\r\nResearchers published a new, more inclusive collection o… [+1923 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Watch China break in new test site for giant moon rocket engines (video) - Space.com", "description": "The remote test stand, the largest in Asia, is designed to handle very high-thrust engine tests.", "url": "https://www.space.com/china-rocket-engine-test-site-moon-program-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qTpK4v2FT4njfpBDnbD7ub-1200-80.jpeg", "publishedAt": "2023-05-11T10:00:57Z", "content": "China has completed a stand for testing huge rocket engines that could power the country's moon exploration efforts.\r\nThe test stand at Tongchuan in the northwestern province of Shaanxi is now Asia's… [+1506 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Scientists discover gigantic 'structure' under the surface of the Moon - indy100", "description": "The Moon has been a subject of awe and fascination for millennia, with its shape-shifting powers and enigmatic dark side.And though it’s the one celestial body on which man has taken (small) steps, we still have big leaps to go in understanding its potential …", "url": "https://www.indy100.com/science-tech/structure-under-moon-surface-scientists-2659988995", "urlToImage": "https://www.indy100.com/media-library/scientists-may-have-just-discovered-a-massive-amount-of-water-on-the.jpg?id=33577866&width=1200&height=600&coordinates=0%2C31%2C0%2C55", "publishedAt": "2023-05-11T09:42:51Z", "content": "The Moon has been a subject of awe and fascination for millennia, with its shape-shifting powers and enigmatic dark side.\r\nAnd though its the one celestial body on which man has taken (small) steps, … [+2002 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Isabel van Brugen", "title": "Former Russian Space Chief Calls for Mobilization: 'The Enemy Is Stronger' - Newsweek", "description": "\"We have problems with personnel...fighters are being killed,\" said Dmitry Rogozin.", "url": "https://www.newsweek.com/dmitry-rogozin-roscosmos-putin-ukraine-war-mobilization-1799611", "urlToImage": "https://d.newsweek.com/en/full/2233280/russian-president-vladimir-putin.jpg", "publishedAt": "2023-05-11T08:48:34Z", "content": "Dmitry Rogozin, the former head of Russia's space agency, called for President Vladimir Putin to declare a general mobilization, saying that Russia has a shortage of personnel in the war in Ukraine.\r… [+3106 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Marine Monsters of the Jurassic Seas Were Twice the Size of Killer Whales - SciTechDaily", "description": "Paleontologists have discovered evidence that pliosaurs could have reached up to 14.4 meters in length, twice the size of a killer whale, after finding four large vertebrae in an Oxfordshire museum. Over 20 years ago, the BBC’s Walking with Dinosaurs TV docum…", "url": "https://scitechdaily.com/marine-monsters-of-the-jurassic-seas-were-twice-the-size-of-killer-whales/", "urlToImage": "https://scitechdaily.com/images/Abingdon-Pliosaur-scaled.jpg", "publishedAt": "2023-05-11T08:28:43Z", "content": "ByUniversity of PortsmouthMay 11, 2023\r\nAn artists impression of the pliosaur. University of Portsmouth paleontologists have discovered evidence suggesting that pliosaurs, closely related to the Liop… [+6255 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Hidden supermassive black holes brought to life by galaxies on collision course - Phys.org", "description": "Astronomers have found that supermassive black holes obscured by dust are more likely to grow and release tremendous amounts of energy when they are inside galaxies that are expected to collide with a neighboring galaxy. The new work, led by researchers from …", "url": "https://phys.org/news/2023-05-hidden-supermassive-black-holes-brought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/hidden-supermassive-bl.jpg", "publishedAt": "2023-05-11T08:19:45Z", "content": "Astronomers have found that supermassive black holes obscured by dust are more likely to grow and release tremendous amounts of energy when they are inside galaxies that are expected to collide with … [+4633 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "250-foot Asteroid HT4 hurtling towards Earth; Gigantic rock speeding at 32166 kmph - HT Tech", "description": "A 250-foot asteroid is set to make a close approach to Earth at a speed of 38102 km per hour. Here’s what NASA said.", "url": "https://tech.hindustantimes.com/tech/news/250foot-asteroid-ht4-hurtling-towards-earth-gigantic-rock-speeding-at-32166-kmph-71683784570772.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/11/cropped/16-9/asteroid-6099696_1280_1682570598551_1683784680098.jpg?impolicy=new-ht-20210112&width=1600", "publishedAt": "2023-05-11T05:59:02Z", "content": "Asteroids, also known as minor planets, are remnants from the early stages of our solar system's formation approximately 4.6 billion years ago. These rocky and airless objects vary in size, with the … [+2719 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "'Sea butterfly' life cycle threatened by climate change may impact Southern Ocean ecosystem - Phys.org", "description": "The world's oceans absorb approximately a quarter of all carbon dioxide (CO2) emissions. During absorption, CO2 reacts with seawater and oceanic pH levels fall. This is known as ocean acidification and results in lower carbon ion concentrations. Certain ocean…", "url": "https://phys.org/news/2023-05-sea-butterfly-life-threatened-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/sea-butterfly-life-cyc.jpg", "publishedAt": "2023-05-11T04:00:02Z", "content": "The world's oceans absorb approximately a quarter of all carbon dioxide (CO2) emissions. During absorption, CO2 reacts with seawater and oceanic pH levels fall. This is known as ocean acidification a… [+4221 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "The Hubble Space Telescope is sinking! Two startups want to save it for free - The Register", "description": "But it's up to NASA to approve a rescue mission. Cue Aerosmith", "url": "https://www.theregister.com/2023/05/11/hubble_space_telescope_rescue/", "urlToImage": "https://regmedia.co.uk/2021/07/19/hubble_shutterstock.jpg", "publishedAt": "2023-05-11T03:28:00Z", "content": "Momentus and Astroscale, two startups specializing in space infrastructure and orbital debris, want to collaborate and help boost NASA's aging Hubble Space Telescope into a safe orbit.\r\nHubble has fa… [+3010 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A “Novel” Discovery: NASA's Curiosity Rover Finds a Book-Like Rock on Mars - SciTechDaily", "description": "On its 3,800th sol, NASA's Curiosity Mars rover photographed a book-like rock, \"Terra Firme,\" a result of water depositing harder minerals and wind erosion shaping it over time. NASA's Curiosity Mars rover took this close-up view of a rock nicknamed \"Terra Fi…", "url": "https://scitechdaily.com/a-novel-discovery-nasas-curiosity-rover-finds-a-book-like-rock-on-mars/", "urlToImage": "https://scitechdaily.com/images/NASA-Curiosity-Mars-Rover-Book-Like-Rock.jpg", "publishedAt": "2023-05-11T00:56:43Z", "content": "ByNASAMay 10, 2023\r\nNASAs Curiosity Mars rover took this close-up view of a rock nicknamed Terra Firme that looks like the open pages of a book, on April 15, 2023, the 3,800th Martian day, or sol, of… [+3544 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jessica Orwig, Morgan McFall-Johnsen", "title": "Video shows a cosmonaut littering in space. NASA says it's harmless. - Business Insider", "description": "The cosmonaut tossed an 11-pound bag of leftover equipment into orbit, but NASA is not concerned about it contributing to Earth's space junk problem.", "url": "https://www.businessinsider.com/video-shows-cosmonaut-space-littering-during-spacewalk-nasa-says-harmless-2023-5", "urlToImage": "https://i.insider.com/645c13a2d391de0019bd776a?width=1200&format=jpeg", "publishedAt": "2023-05-10T23:19:00Z", "content": "Last week, cosmonauts  Sergey Prokopyev and Dmitri Petelin donned their spacesuits and ventured outside the International Space Station for a spacewalk that would last 7 hours and 11 minutes.\r\nThe sp… [+3511 chars]"}, {"source": {"id": null, "name": "Bay News 9"}, "author": "Cait McVey", "title": "USF scientist uncovers cause of massive sea urchin die-off - Bay News 9", "description": "Mya Breitbart quickly gathered a team of researchers.", "url": "https://www.baynews9.com/fl/tampa/news/2023/05/10/usf-scientist-discovers-culprit-behind-massive-sea-urchin-die-off", "urlToImage": "https://s7d2.scene7.com/is/image/TWCNews/0510_bn9_usf_professor_sea_urchins", "publishedAt": "2023-05-10T22:45:00Z", "content": "TAMPA, Fla.  Long-spined sea urchins, from the Caribbean to Florida, were dying off in droves last year, putting scientists in a race against time to find the culprit.\r\nWhat You Need To Know\r\n<ul><li… [+2359 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Evidence of the Beaufort Gyre's Stabilization: A Precursor to a Freshwater Catastrophe? - SciTechDaily", "description": "A recent study has presented the initial observational proof of the stabilization of the anti-cyclonic Beaufort Gyre, which is the dominant circulation in the Canada Basin and the largest store of fresh water in the Arctic Ocean. The research utilizes a recen…", "url": "https://scitechdaily.com/first-evidence-of-the-beaufort-gyres-stabilization-a-precursor-to-a-freshwater-catastrophe/", "urlToImage": "https://scitechdaily.com/images/Collecting-Measurements-at-the-Ice-Edge-scaled.jpg", "publishedAt": "2023-05-10T22:26:29Z", "content": "ByWoods Hole Oceanographic InstitutionMay 10, 2023\r\nCollecting measurements at the ice edge, the western Arctic Ocean. Credit: Peigen Lin/Woods Hole Oceanographic Institution\r\nA recent study has pres… [+6009 chars]"}, {"source": {"id": null, "name": "Washington Examiner"}, "author": "Brady Knox", "title": "Object over 10 million times brighter than sun baffles scientists - Washington Examiner", "description": "Scientists are scrambling to understand a celestial object that glows over 10 million times brighter than the sun and is upending the current understanding of physics.", "url": "https://www.washingtonexaminer.com/policy/space/space-object-10-million-times-brighter-sun", "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/bf3551f/2147483647/strip/true/crop/1320x693+0+1/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fb1%2Fa7%2F7a76b09b42e3b2d0cb5491d51733%2Fultraluminous-x-ray.jpg", "publishedAt": "2023-05-10T22:10:00Z", "content": "Scientistsare scrambling to understand a celestial object that glows over 10 million times brighter than the sun and is upending the current understanding of physics. \r\nScientists have ruled that ult… [+1814 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "See the stunning first photo of Earth from Europe's new MTG-I1 satellite - BGR", "description": "Europe's newest weather satellite, the Meteosat Third Generation Imager, has captured its first images of Earth and they're breathtaking.", "url": "https://bgr.com/science/see-the-stunning-first-photo-of-earth-from-europes-new-mtg-i1-satellite/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/03/AdobeStock_194080021.jpeg?quality=82&strip=all", "publishedAt": "2023-05-10T21:46:00Z", "content": "If you buy through links on BGR, we may receive an affiliate commission. Learn more.One of Europe’s newest weather satellites, the Meteosat Third Generation Imager, is finally getting to work. The sa… [+2034 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aliza Chasan", "title": "Mysterious planet has \"unusually shiny atmosphere\" and may contain water vapor, researchers say - CBS News", "description": "GJ 1214b is covered in a haze that has made studying it a challenge.", "url": "https://www.cbsnews.com/news/mini-neptune-planet-water-vapor-shiny-atmosphere-gj-1214b/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/05/10/4f492744-847a-482d-a5de-462bb759d630/thumbnail/1200x630/c54a54aaacc36d593622e3f03f6101a6/1-hazyminineptune-16-width-1320.jpg", "publishedAt": "2023-05-10T21:41:00Z", "content": "A strange planet that's stymied astronomers for years has an \"unusually shiny atmosphere\" and could be home to large amounts of water vapor, scientists said in a study published Wednesday in the jour… [+3354 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Sound artist eavesdrops on what is thought to be world’s heaviest organism - The Guardian", "description": "Artist records underground sounds generated by Pando, a huge group of aspens in Utah considered to be a single organism", "url": "https://www.theguardian.com/environment/2023/may/10/sound-artist-eavesdrops-on-what-is-thought-to-be-worlds-heaviest-organism-pando-utah", "urlToImage": "https://i.guim.co.uk/img/media/f9e54eff04c9d5760ef2f3fcda256c02a0b62413/0_182_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=12a5f931cc894cbed2f34894960d2e7f", "publishedAt": "2023-05-10T21:09:00Z", "content": "When it comes to the worlds heaviest living organism, it is a forest of one tree that is thought to take the crown. Now a sound expert is listening into the quiet grove in an attempt to hear its secr… [+3392 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "SpaceX launches new Starlink batch from Vandenberg, nails landing - VideoFromSpace", "description": "A SpaceX Falcon 9 rocket launched 51 Starlink satellites from California's Vandenberg Space Force Base on May 10, 2023. The first stage of the rocket landed ...", "url": "https://www.youtube.com/watch?v=TS4sMvF7gg8", "urlToImage": "https://i.ytimg.com/vi/TS4sMvF7gg8/maxresdefault.jpg", "publishedAt": "2023-05-10T20:31:10Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Webb Examined an Asteroid Belt and Found More Than it Bargained For - Universe Today", "description": "Astronomers were surprised when the pointed the powerful JWST at Fomalhaut. They found much more than an asteroid belt.", "url": "https://www.universetoday.com/161280/webb-examined-an-asteroid-belt-and-found-more-than-it-bargained-for/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/weic2312a.jpg", "publishedAt": "2023-05-10T19:25:13Z", "content": "One of the things astronomers would love to see is planets forming around other stars. That would help us understand our own Solar System better. But it all happens behind a veil of obscuring dust. T… [+13337 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ultrafast Magnetism: Intense Lasers Magnetize Solids Within Attoseconds - SciTechDaily", "description": "Intense laser light can create attosecond magnetism in solids with heavy atoms, offering new insights into magnetization and potentially enabling ultrafast memory devices. Intense laser light can induce magnetism in solids on the attosecond scale – the fastes…", "url": "https://scitechdaily.com/ultrafast-magnetism-intense-lasers-magnetize-solids-within-attoseconds/", "urlToImage": "https://scitechdaily.com/images/Intense-Laser-Pulse-Ultrafast-Spin-Flipping-Processes-scaled.jpg", "publishedAt": "2023-05-10T19:07:00Z", "content": "An intense laser pulse is shone onto the material, inducing ultrafast spin flipping processes that occur on a timescale of ~100 attoseconds. Credit: © J. Harms, MPSD\r\nIntense laser light can create a… [+4179 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Accessing the brain with soft deployable electrocorticography arrays - Science", "description": null, "url": "https://www.science.org/doi/10.1126/scirobotics.adg2785", "urlToImage": null, "publishedAt": "2023-05-10T18:52:18Z", "content": null}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "It's Time to Take Quantum Biology Research Seriously - Physics", "description": "Understanding the possible quantum-driven behaviors of biological systems could aid in treating injuries or in developing cures for diseases, but research in the field has been pushed to the sidelines. It’s time for that to change.", "url": "https://physics.aps.org/articles/v16/79", "urlToImage": "https://physics.aps.org/assets/6aac2ef9-ce8f-4b16-8ab7-22f9efbd9308/e79_2_thumb.png", "publishedAt": "2023-05-10T18:24:29Z", "content": "Quantum biologists study the light–matter interactions of living matter with the goal of understanding and controlling these phenomena. But they feel that research on this topic is currently stymied … [+6421 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "ABS-CBN News", "title": "Why is the ice melting so fast? - ABS-CBN News", "description": null, "url": "https://news.abs-cbn.com/spotlight/05/11/23/why-is-the-ice-melting-so-fast", "urlToImage": null, "publishedAt": "2023-05-10T18:21:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mystery solved? Runaway black hole chased by tail of stars may be galaxy in disguise - Space.com", "description": "The supposed tail of stars may actually be an entire galaxy seen in profile, a new study suggests.", "url": "https://www.space.com/runaway-black-hole-tail-stars-mystery-solved", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yQExx838WEGrBrQj8MrW4k-1200-80.jpeg", "publishedAt": "2023-05-10T17:51:59Z", "content": "A 200,000-light-year-long chain of stars originally thought to be trailing a runaway black hole may actually be a galaxy in disguise.\r\nAstronomers announced the inferred existence of the rogue black … [+3580 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "How Desert Dust Nourishes the Growth of Phytoplankton at Sea - NASA", "description": "After a long-distance delivery, nutrients in desert dust nourish life in the ocean.", "url": "https://www.nasa.gov/feature/esnt/2023/how-desert-dust-nourishes-the-growth-of-phytoplankton-at-sea", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/bloomdust_tmo_2011098_hires.jpg", "publishedAt": "2023-05-10T17:49:23Z", "content": null}, {"source": {"id": null, "name": "Big Think"}, "author": "Marcelo Gleiser", "title": "We have to rethink our relationship to technology. Life depends on it - Big Think", "description": "We have become the greatest threat to ourselves and to life on this planet. We need a set of agreed-upon safeguards to preserve our future.", "url": "https://bigthink.com/13-8/life-depends-our-relationship-technology/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/05/Earth-and-tech.jpg?resize=1200,630", "publishedAt": "2023-05-10T17:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Hubble telescope spies 'peek-a-boo' exoplanets amid star's tilted dust rings - Space.com", "description": "The fun and games could teach scientists a thing or two about the early years of the solar system.", "url": "https://www.space.com/hubble-telescope-exoplanets-peekaboo-tilted-rings", "urlToImage": "https://cdn.mos.cms.futurecdn.net/j8F3RHqE8WaHXrJ28DWAv8-1200-80.jpg", "publishedAt": "2023-05-10T16:38:32Z", "content": "A young red dwarf star system has been engaged in a multiple-year-long game of \"peek-a-boo\" with the Hubble Space Telescope. \r\nThis may represent more than mere fun and games, however. The shadows as… [+5776 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Humpback whales caught on film for 1st time treating themselves to a full body scrub on the seafloor - Livescience.com", "description": "New footage shows, for the first time, how humpbacks scrub off dead skin and parasites to stay streamlined and keep their skin healthy.", "url": "https://www.livescience.com/animals/humpback-whales/humpback-whales-caught-on-film-for-1st-time-treating-themselves-to-a-full-body-scrub-on-the-seafloor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/o5VpvDQGDAmqgxkrAMQHZ4-1200-80.png", "publishedAt": "2023-05-10T16:30:15Z", "content": "A sequence of rolls lasted for about five minutes and consisted of four full or side rolls on average.  (Image credit: Griffith University)\r\nHumpback whales have — for the first time ever — been film… [+3866 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Humans and algorithms work together — so study them together - Nature.com", "description": "Adaptive algorithms have been linked to terrorist attacks and beneficial social movements. Governing them requires new science on collective human–algorithm behaviour.", "url": "https://www.nature.com/articles/d41586-023-01521-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01521-z/d41586-023-01521-z_25309396.jpg", "publishedAt": "2023-05-10T15:31:06Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genetic immune escape landscape in primary and metastatic cancer - Nature.com", "description": "A pan-cancer analysis of primary and metastatic tumors highlights the diversity of genetic immune escape mechanisms established during tumor evolution. The authors also present LILAC, a tool to characterize the HLA-I locus from whole-genome sequencing data.", "url": "https://www.nature.com/articles/s41588-023-01367-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01367-1/MediaObjects/41588_2023_1367_Fig1_HTML.png", "publishedAt": "2023-05-10T15:15:48Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "X-ray-to-visible light-field detection through pixelated colour conversion - Nature.com", "description": "Lithographically patterned perovskite nanocrystal arrays were used to determine radiation vectors from X-rays to visible light and the emission colours of the nanoparticles was used to create images of three-dimensional objects and for phase-contrast imaging.", "url": "https://www.nature.com/articles/s41586-023-05978-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05978-w/MediaObjects/41586_2023_5978_Fig1_HTML.png", "publishedAt": "2023-05-10T15:13:00Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Indian Ocean salinity build-up primes deglacial ocean circulation recovery - Nature.com", "description": "Salinity reconstructions show that Indian Ocean surface salinity increased during glacial periods and that the release of this water via the Agulhas Leakage during deglaciation can trigger abrupt changes in the Atlantic Meridional Overturning Circulation.", "url": "https://www.nature.com/articles/s41586-023-05866-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05866-3/MediaObjects/41586_2023_5866_Fig1_HTML.png", "publishedAt": "2023-05-10T15:13:00Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A pan-grass transcriptome reveals patterns of cellular divergence in crops - Nature.com", "description": "Complementary single-cell and single-nucleus transcriptomic analyses of Zea mays, Sorghum bicolor and Setaria viridis root cells provide insights into the evolution of cell types and gene modules that control key traits in these important crop species.", "url": "https://www.nature.com/articles/s41586-023-06053-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-06053-0/MediaObjects/41586_2023_6053_Fig1_HTML.png", "publishedAt": "2023-05-10T15:11:15Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A reflective, metal-rich atmosphere for GJ 1214b from its JWST phase curve - Nature.com", "description": "Nature - A reflective, metal-rich atmosphere for GJ 1214b from its JWST phase curve", "url": "https://www.nature.com/articles/s41586-023-06159-5", "urlToImage": null, "publishedAt": "2023-05-10T15:10:24Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Quantum electrodynamics verified with exotic atoms - Phys.org", "description": "An international collaboration of researchers, including the Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU) has succeeded in a proof-of-principle experiment to verify strong-field quantum electrodynamics with exotic atoms, by per…", "url": "https://phys.org/news/2023-05-quantum-electrodynamics-exotic-atoms.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/quantum-electrodynamic.jpg", "publishedAt": "2023-05-10T15:03:51Z", "content": "An international collaboration of researchers, including the Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU) has succeeded in a proof-of-principle experiment to verify st… [+7991 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "Scientists 'Gobsmacked' About Findings on Moss - Newser", "description": "Lowly plant is 'potentially as significant' as vascular plants, yet often ignored: study", "url": "https://www.newser.com/story/335034/lowly-moss-is-far-more-important-than-you-think.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1471557-12-20230510101236.jpeg", "publishedAt": "2023-05-10T14:50:00Z", "content": "We've underestimated the power of the lowly moss beneath our feet, which fuels the cycling of nutrients in soil, sucks up carbon, and may even prevent the proliferation of pathogens and \"antibiotic r… [+2254 chars]"}, {"source": {"id": null, "name": "Hot Hardware"}, "author": "Tim Sweezy", "title": "Scientists Warn Don't Even Think About Using A Magnet If You Find A Meteorite - Hot Hardware", "description": "Meteorite hunting is a big business, with some fragments selling for thousands of dollars and a small handful garnering over a million dollars.", "url": "https://hothardware.com/news/scientists-warn-about-using-a-magnet-if-you-find-a-meteorite", "urlToImage": "https://images.hothardware.com/contentimages/newsitem/61584/content/hero-small-meteorite.jpg", "publishedAt": "2023-05-10T14:38:00Z", "content": "Scientists are asking meteorite hunters to cease and desist using magnets to verify their finds. Even weak magnets can destroy valuable information concerning the magnetic field of its parent body an… [+2185 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon, wired.com", "title": "The far north is burning—and turning up the heat on the planet - Ars Technica", "description": "The Arctic and surroundings are being transformed from carbon sink to carbon emitter.", "url": "https://www.wired.com/story/the-far-north-is-burning-and-turning-up-the-heat-on-the-planet/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/05/dead-trees-760x380.jpg", "publishedAt": "2023-05-10T14:21:48Z", "content": "Enlarge/ Fire-damaged trees in a boreal forest near the Saskatchewan River in Alberta, Canada. As northern forests burn, they're releasing massive amounts of carbon.\r\n67 with \r\nThe far north is both … [+2515 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Breakthrough research could bring stem cell therapy to the masses - Phys.org", "description": "Researchers at Sana Biotechnology, Inc., in California, have made a significant breakthrough in realizing the promise of stem cell therapy: stem cells that do not trigger an immune response from an immunologically incompatible donor.", "url": "https://phys.org/news/2023-05-breakthrough-stem-cell-therapy-masses.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/breakthrough-research.jpg", "publishedAt": "2023-05-10T13:50:01Z", "content": "Allogeneic HIP islets achieve long-term survival. a, Immunofluorescence pictures of dissociated and reaggregated wtallo and HIPallo islets from rhesus monkeys (representative images). b, In vitro ins… [+5724 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Morgan MacLeod", "title": "Astronomers just saw a star eat a planet – an astrophysicist on the team explains the first-of-its-kind discovery - The Conversation", "description": "Stars begin to expand when they run out of fuel and can become thousands of times larger, consuming any planets in the way. For the first time, astronomers have witnessed one such event.", "url": "https://theconversation.com/astronomers-just-saw-a-star-eat-a-planet-an-astrophysicist-on-the-team-explains-the-first-of-its-kind-discovery-205265", "urlToImage": "https://images.theconversation.com/files/525217/original/file-20230509-17-8m0pr7.jpg?ixlib=rb-1.1.0&rect=11%2C413%2C3184%2C1592&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-05-10T12:28:10Z", "content": "For the first time, astronomers have captured images that show a star consuming one of its planets. The star, named ZTF SLRN-2020, is located in the Milky Way galaxy, in the constellation Aquila. As … [+6196 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Young star shoots out jet like a garden sprinkler in Orion Nebula (photo) - Space.com", "description": "The jet comes from a star in the Orion Nebula, a stellar nursery 1,350 light-years from Earth.", "url": "https://www.space.com/snaking-stellar-jet-binary-system-vlt-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xvqo8bZeK9ZYr3DmxtK274-1200-80.jpeg", "publishedAt": "2023-05-10T11:42:42Z", "content": "The Multi Unit Spectroscopic Explorer (MUSE) instrument on the ESO's Very Large Telescope captured a jet of matter shaped like an S expelled from a stellar object named 244-440.  (Image credit: ESO/K… [+2789 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Small tweak, million years ago, changed human brain forever - India Today", "description": "The tweak in the DNA further led to cascading changes across the genome that changed human features forever, especially the brain.", "url": "https://www.indiatoday.in/science/story/small-tweak-million-years-ago-changed-human-brain-forever-2377346-2023-05-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/brain_tumour-sixteen_nine.jpg?VersionId=PlXMuFd86EDrzcXL_.uJqvGz8K7jqvgb", "publishedAt": "2023-05-10T11:42:41Z", "content": "By India Today Science Desk: The human brain was different in the beginning but then a tweak in the DNA a million years ago separated us from other mammals. The tweak in the DNA is visible in the Chi… [+2819 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Chasms on the flanks of a martian volcano - European Space Agency", "description": "Mars has some of the most impressive volcanoes in the Solar System. ESA’s Mars Express has now imaged the pitted, fissured flank of the planet’s second-tallest: Ascraeus Mons.", "url": "https://www.esa.int/Science_Exploration/Space_Science/Mars_Express/Chasms_on_the_flanks_of_a_martian_volcano", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/05/the_flanks_of_ascraeus_mons/24872695-2-eng-GB/The_flanks_of_Ascraeus_Mons_pillars.jpg", "publishedAt": "2023-05-10T10:00:55Z", "content": "Science &amp; Exploration09/05/20231776 views47 likes\r\nMars has some of the most impressive volcanoes in the Solar System. ESAs Mars Express has now imaged the pitted, fissured flank of the planets s… [+4123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "How the Voyager probes keep going and going decades after launch - CNN", "description": "Both Voyager probes have outlived their original missions and are exploring interstellar space more than 45 years after launch. The mission team has made clever decisions to manage the power supply and instruments on each spacecraft to keep them going.", "url": "https://www.cnn.com/2023/05/10/world/nasa-voyager-probes-power-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/171202144108-03-voyager-spacecraft-concept-art.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-10T08:42:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nPasadena, CaliforniaCNN\r\n  — \r\nWhen the Voyager probes… [+5703 chars]"}, {"source": {"id": null, "name": "Listverse.com"}, "author": "Jamie Frater", "title": "Ten Mysteries from Beneath the Earth's Surface - Listverse", "description": "For years, mankind has looked up at the stars, but in many ways, there is a world just as fascinating below us as there is above us. Beneath our feet, lying under the surface of the Earth, is a whole world of mysteries and strange phenomena. A second hidden c…", "url": "https://listverse.com/2023/05/10/ten-mysteries-from-beneath-the-earths-surface/", "urlToImage": "https://listverse.com/wp-content/uploads/2023/05/shutterstock_536385025.jpg", "publishedAt": "2023-05-10T07:04:22Z", "content": "For years, mankind has looked up at the stars, but in many ways, there is a world just as fascinating below us as there is above us. Beneath our feet, lying under the surface of the Earth, is a whole… [+9792 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nikolas Lanum", "title": "Aerospace Corp. CEO predicts swarm of AI-controlled ‘hyper-intelligence satellites’: ‘Almost like Hal 9000’ - Fox News", "description": "The Aerospace Corp. President and CEO Steve Isakowitz spoke with Fox News Digital about the future of space exploration, including future Mars and Moon missions.", "url": "https://www.foxnews.com/media/aerospace-corp-ceo-predicts-swarm-ai-controlled-hyper-intelligence-satellites-hal-9000", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/05/steve-thumb.png", "publishedAt": "2023-05-10T06:00:00Z", "content": "The Aerospace Corporation President and CEO Steve Isakowitz said he anticipates the future of space exploration and defense will include AI-controlled satellites and permanent living on the surface o… [+4866 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "10 planetary facts that extend beyond our Solar System - Big Think", "description": "Back in 1990, we hadn't discovered a single planet outside of our Solar System. Here are 10 facts that would've surprised every astronomer.", "url": "https://bigthink.com/starts-with-a-bang/10-planetary-facts/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/11/https___specials-images.forbesimg.com_imageserve_5c5cb14da1d1c760511aafd2_Left-an-image-of-Earth-from-the-DSCOVR-EPIC-camera-and-right-degraded-to-3-x-3_960x0.jpg?w=959&h=539&crop=1", "publishedAt": "2023-05-10T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm alert! Double solar flare erupts, triggers blackouts over North America - HT Tech", "description": "A rare double solar flare has erupted on the sunspot AR3296. A CME cloud has escaped, raising fears for a major solar storm on Earth.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-double-solar-flare-erupts-triggers-blackouts-over-north-america-71683691957224.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/10/cropped/16-9/faintyoung_2_1683693253407_1683693253554.jpg?impolicy=new-ht-20210112&width=1600", "publishedAt": "2023-05-10T04:37:12Z", "content": "The Earth-facing side of the Sun has become a hotbed of intense solar activity. Due to the negative polarity of a sunspot complex, a large region has been continuously exploding since the last week. … [+2207 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert", "title": "Your Big Nose Might Be The Result of an Ancient Affair With a Neanderthal - ScienceAlert", "description": null, "url": "https://www.sciencealert.com/your-big-nose-might-be-the-result-of-an-ancient-affair-with-a-neanderthal", "urlToImage": null, "publishedAt": "2023-05-10T03:06:11Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert", "title": "Nearby Civilizations Could Intercept Our Transmissions to Space Probes This Century - ScienceAlert", "description": null, "url": "https://www.sciencealert.com/nearby-civilizations-could-intercept-our-transmissions-to-space-probes-this-century", "urlToImage": null, "publishedAt": "2023-05-10T01:40:56Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Geoscientists Unearth New Insights Into Life's Evolution 800 Million Years Ago - SciTechDaily", "description": "Although the oceans from ancient times have disappeared, the events that occurred in them have been recorded in rocks. By examining these rocks, we can connect Earth's past to its present and future, gaining a deeper understanding of our planet's history. Cou…", "url": "https://scitechdaily.com/geoscientists-unearth-new-insights-into-lifes-evolution-800-million-years-ago/", "urlToImage": "https://scitechdaily.com/images/Carbonate-Rock-Samples-Collected-From-the-North-China-Craton.jpg", "publishedAt": "2023-05-10T00:38:56Z", "content": "ByVirginia TechMay 9, 2023\r\nCarbonate rock samples collected from the North China Craton. Credit: Christina Franusich for Virginia Tech.\r\nAlthough the oceans from ancient times have disappeared, the … [+4792 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Jasmin Fox-Skelly", "title": "Will we ever...hibernate in space? - BBC", "description": "Taking astronauts to Mars or further will take years. Should they be put into hibernation on the way? There are some surprising health benefits….", "url": "https://www.bbc.com/future/article/20230509-will-we-everhibernate-in-space", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0fm990l.jpg", "publishedAt": "2023-05-10T00:04:26Z", "content": "The year is 2039, and you're an astronaut on your way to Mars. You're only three months into the eight-month-long journey, and already your body is facing an onslaught of radiation from outer space. … [+1580 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "The mystery of how Mars meteorites reach Earth may finally be solved - Space.com", "description": "It turns out rocks can be hurled much higher from the Martian surface than previously believed.", "url": "https://www.space.com/mars-meteorites-on-earth-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RqURr5KcdGgREveGAAVGGZ-1200-80.jpg", "publishedAt": "2023-05-09T21:41:50Z", "content": "Scientists have discovered that the force needed to eject rocks from the surface of Mars that eventually pelt Earth as meteorites is actually much lower than previously believed. \r\nMeteorites from a … [+4749 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Demming", "title": "Scientists discover secret 'symmetries' that protect Earth from the chaos of space - Livescience.com", "description": "A new analysis of chaos in the solar system reveals how planetary collisions are avoided over billions of years.", "url": "https://www.livescience.com/space/cosmology/scientists-discover-secret-symmetries-that-protect-earth-from-the-chaos-of-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iov2Z7Vz5k8ufGmfegJPpk-1200-80.jpg", "publishedAt": "2023-05-09T21:15:00Z", "content": "Earth probably shouldn't exist. \r\nThat's because the orbits of the inner solar system planets — Mercury, Venus, Earth and Mars — are chaotic, and models have suggested that these inner planets should… [+4399 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "Starbase repairs proceeding - Ships prepared for future flights - NASASpaceFlight.com - NASASpaceflight.com", "description": "On the heels of last month’s dramatic launch of Booster 7 and Ship 24, repairs…", "url": "https://www.nasaspaceflight.com/2023/05/starbase-repairs-ships-future-flights/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/05/NSF-2023-05-09-19-15-44-213.jpg", "publishedAt": "2023-05-09T18:38:16Z", "content": "35On the heels of last month’s dramatic launch of Booster 7 and Ship 24, repairs on the Orbital Launch Site and tank farm are proceeding at pace. Over at the Production Site, several Ships are in var… [+6323 chars]"}]}