{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This Breathtaking Video Will Take You to The Dawn of The Universe - ScienceAlert", "description": "A deep dive into a deep field captured by the James Webb Space Telescope gives us a sense of impossible spaceflight – and the way galaxies changed over the history of the Universe.", "url": "https://www.sciencealert.com/this-breathtaking-video-will-take-you-to-the-dawn-of-the-universe", "urlToImage": "https://www.sciencealert.com/images/2023/07/jwst-strip.jpg", "publishedAt": "2023-07-14T23:31:15Z", "content": "A deep dive into a deep field captured by the James Webb Space Telescope gives us a sense of impossible spaceflight and the way galaxies changed over the history of the Universe.\r\nFor a survey called… [+1442 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Playing Quantum Billiards With Protons at the Large Hadron Collider - SciTechDaily", "description": "A study conducted by the ATLAS experiment at the Large Hadron Accelerator has gained insights into the properties of strong interactions between protons at ultra-high energies by exploring elastic scattering in proton-proton collisions. The research found dis…", "url": "https://scitechdaily.com/playing-quantum-billiards-with-protons-at-the-large-hadron-collider/", "urlToImage": "https://scitechdaily.com/images/Quantum-Proton-Billiards.jpg", "publishedAt": "2023-07-14T22:12:26Z", "content": "Protons accelerated almost to the speed of light can collide similarly to billiard balls. However, since protons are quantum particles, from measuring such collisions we can learn unobvious things ab… [+19282 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Celebrating the Webb Space Telescope's First Year of Science on This Week @NASA – July 14, 2023 - NASA", "description": "Celebrating the Webb Space Telescope’s first year of science, testing remote possibilities of a NASA humanoid robot, and a fleet of clean new rides for Artem...", "url": "https://www.youtube.com/watch?v=olPdP9zMegE", "urlToImage": "https://i.ytimg.com/vi/olPdP9zMegE/maxresdefault.jpg", "publishedAt": "2023-07-14T21:18:57Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Do fabled 'dark stars' actually exist? James Webb Space Telescope spots 3 candidates - Space.com", "description": "It's hard to say what these possible 'dark stars' really are.", "url": "https://www.space.com/nasa-james-webb-space-telescope-stars-dark-matter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/H6MTsH2uueTYBKMYjDbmU4-1200-80.jpg", "publishedAt": "2023-07-14T21:00:39Z", "content": "NASA's powerful new eye on the universe may have caught sight of dark matter.\r\nThe James Webb Space Telescope (JWST) spotted three candidate \"dark stars\" that may be powered by particles of annihilat… [+2706 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Challenging Conventional Wisdom: New Discovery Transforms Our Understanding of Crystals - SciTechDaily", "description": "Previous beliefs have been overturned by the discovery of irregularly arranged structures. For many, the word \"crystals\" conjures images of shimmering suncatchers that create a prism of rainbow colors or semi-transparent stones thought to possess healing abil…", "url": "https://scitechdaily.com/challenging-conventional-wisdom-new-discovery-transforms-our-understanding-of-crystals/", "urlToImage": "https://scitechdaily.com/images/Colorful-Crystals.jpg", "publishedAt": "2023-07-14T20:46:01Z", "content": "ByRensselaer Polytechnic InstituteJuly 14, 2023\r\nA new study has discovered that crystal structures, crucial in materials science and technologies like semiconductors and solar panels, are not necess… [+5504 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Genetic Origins of Learning and Memory Traced Back 650 Million Years - Neuroscience News", "description": "Researchers have uncovered genes essential for learning, memory, aggression, and other complex behaviors originated around 650 million years ago.", "url": "https://neurosciencenews.com/memory-learning-genetics-evolution-23629/", "urlToImage": "https://neurosciencenews.com/files/2023/07/genetics-memory-learning-neurosicnce.jpg", "publishedAt": "2023-07-14T19:47:59Z", "content": "Summary: Researchers have uncovered genes essential for learning, memory, aggression, and other complex behaviors originated around 650 million years ago.\r\nThe study utilized computational methods to… [+3890 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Troy Farah", "title": "Greener oceans due to climate change, new study suggests - Salon", "description": "Two decades of satellite data show that 56% of the ocean surface is changing in color.", "url": "https://www.salon.com/2023/07/14/greener-oceans-due-to-climate-change-new-study-suggests/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/09/stormy-sea-iceberg-0907221.jpg", "publishedAt": "2023-07-14T18:51:00Z", "content": null}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "This Whale Died Decades Ago. Its Carcass Is Now the Ocean’s Hottest Housing Complex. - Yahoo! Voices", "description": "For more than a decade, a succession of sea creatures have lived off of this whale’s body by stripping it and burrowing into the bones to find nutrients.", "url": "https://www.popularmechanics.com/science/animals/a44508407/how-whale-carcass-houses-animals-in-sea/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_b99W6vrgbp0yReWy_PN7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDI-/https://media.zenfs.com/en/popular_mechanics_642/e210f3dd3de43d4b9b3223eba2b2949b", "publishedAt": "2023-07-14T18:00:00Z", "content": "This Decade-Old Whale Carcass Still Supports Lifeby wildestanimal - Getty Images\r\n<ul><li>When a large marine mammal like a whale dies, its body drifts to the ocean floor in a process known as whale … [+3308 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "A Crucial Part of the San Andreas Fault Has Been Disturbingly Quiet for Too Long - Yahoo Life", "description": "A crucial part of the San Andreas Fault has been disturbingly quiet for too long. Something's gotta give.", "url": "https://www.popularmechanics.com/science/environment/a44131655/why-san-andreas-fault-is-so-quiet/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/AczypNyxu02.UIammy9_Ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDM-/https://media.zenfs.com/en/popular_mechanics_642/f8356bee039c27d3982b73669a8e9309", "publishedAt": "2023-07-14T17:00:00Z", "content": "A Lake May Explain Why San Andreas Fault Is QuietLloyd Cluff - Getty Images\r\n\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>The southern secti… [+4229 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Aristos Georgiou", "title": "Woman Hit by a Meteorite While Having a Coffee With a Friend - Newsweek", "description": "The phenomenon of people being struck by meteorites is extremely rare, with the majority of them falling into the ocean.", "url": "https://www.newsweek.com/woman-hit-meteorite-france-1813076", "urlToImage": "https://d.newsweek.com/en/full/2257483/meteorites-land-france.jpg", "publishedAt": "2023-07-14T16:39:14Z", "content": "A woman in France recently enjoying coffee with her friend was struck by a small meteorite in what is considered an extremely rare event, according to local news.\r\nThe woman was chatting with her fri… [+3061 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Amanda Morris", "title": "Unraveling the tangled evolution of figs - Phys.org", "description": "Containing more than 850 species, fig trees are one of the most diverse groups of plants in the world.", "url": "https://phys.org/news/2023-07-unraveling-tangled-evolution-figs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fig-tree.jpg", "publishedAt": "2023-07-14T16:29:30Z", "content": "Containing more than 850 species, fig trees are one of the most diverse groups of plants in the world.\r\nTo unravel how this plant genus (Ficus in the Moraceae family) evolved to become such a diverse… [+3620 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Famous 'man in the moon' could be 200 million years older than we thought - Space.com", "description": "The new dating system doesn't change estimates of the moon's age as a whole, which remains around 4.53 billion years.", "url": "https://www.space.com/moon-age-craters-200-million-years-older", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZYsbigAzeBfVB6SbGmRcTG-1200-80.png", "publishedAt": "2023-07-14T16:04:55Z", "content": "The \"Man in the Moon\" is older than we thought. \r\nScientists have proposed resetting the lunar clock after reassessing impact craters on the surface of the moon. This means that some features of the … [+4810 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Inhibiting a single gene leads to extended motor function longevity in C. elegans - Phys.org", "description": "Research led by Sichuan University and Huazhong University of Science and Technology, China, has revealed genetic mechanisms that could prolong healthy aging. In the paper, titled \"Partial inhibition of class III PI3K VPS-34 ameliorates motor aging and prolon…", "url": "https://phys.org/news/2023-07-inhibiting-gene-motor-function-longevity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/inhibiting-a-single-ge.jpg", "publishedAt": "2023-07-14T15:40:01Z", "content": "Research led by Sichuan University and Huazhong University of Science and Technology, China, has revealed genetic mechanisms that could prolong healthy aging. In the paper, titled \"Partial inhibition… [+4406 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "We've Got to Go Back to Enceladus. Here's a Mission That Could Get the Science - Universe Today", "description": "Saturn's moon Enceladus is one of the most promising places to look for life in the Solar System. It has an ocean of liquid water venting into space, and evidence from Cassini suggested that it's filled with organic molecules and nutrients for bacteria. A new…", "url": "https://www.universetoday.com/162371/weve-got-to-go-back-to-enceladus-heres-a-mission-that-could-get-the-science/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/enceladus.jpg", "publishedAt": "2023-07-14T15:21:25Z", "content": "In our search for life on other worlds, the one we’ve most explored is Mars. But while Mars has the makings for possible life, it isn’t the best candidate in our solar system. Much better are the icy… [+3355 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mars rivers flowed for long stretches in the ancient past - Space.com", "description": "Rivers likely flowed continuously into the Red Planet's Jezero Crater for at least 1 million years.", "url": "https://www.space.com/ancient-mars-rivers-flowed-long-stretches", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Tx5YcUGy7Zykj7jz4aggAK-1200-80.jpg", "publishedAt": "2023-07-14T15:00:13Z", "content": "Some rivers on ancient Mars flowed for long enough stretches to create bona fide habitable environments on the Red Planet, a new study suggests.\r\nA new technique developed by geologists from the Mass… [+5830 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Harvard claims it found elixir of youth - but biologists have expressed concerns over the claims - Daily Mail", "description": "Biologists and Harvard staff are slamming a study co-authored by David Sinclair with Harvard Medical School that claims to have found a way to reverse ageing - saying it provides no evidence.", "url": "https://www.dailymail.co.uk/sciencetech/article-12295585/Harvard-claims-elixir-youth-biologists-expressed-concerns-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/07/14/00/73197345-0-image-a-17_1689291106479.jpg", "publishedAt": "2023-07-14T14:32:41Z", "content": "Harvard scientists believe they are one step closer to a fountain of youth pill that can de-age people.\r\nThe team discovered six chemical cocktails that reversed the aging process in human and mice s… [+9246 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 35 chickens to pass Earth on Saturday - NASA - The Jerusalem Post", "description": "Asteroid 2023 NY – no relation to the US state of New York – is set to pass Earth on Saturday. At 25 meters, it's around the size of over 35 chickens.", "url": "https://www.jpost.com/science/space/article-750099", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/539173", "publishedAt": "2023-07-14T13:57:00Z", "content": "An asteroid the size of over 35 chickens is set to pass Earth on Saturday, July 15, according to NASA's asteroid tracker.\r\nThe asteroid in question has been designated as 2023 NY, according to the Ce… [+3011 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Life on Mars? NASA's Perseverance Rover Finds Evidence of Diverse Organic Compounds - SciTechDaily", "description": "Scientists gain vital insights into Mars’ history and potential for supporting life. A new study using data from NASA's Mars Perseverance rover has found potential evidence of organic molecules on Mars, indicating a complex organic geochemical cycle and the p…", "url": "https://scitechdaily.com/life-on-mars-nasas-perseverance-rover-finds-evidence-of-diverse-organic-compounds/", "urlToImage": "https://scitechdaily.com/images/SHERLOC-NASA-Perseverance-Mars-Rover.jpg", "publishedAt": "2023-07-14T12:35:48Z", "content": "ByUniversity of FloridaJuly 14, 2023\r\nA study, recently published in Nature and based on data from the SHERLOC instrument on NASAs Mars Perseverance rover, reveals findings potentially indicative of … [+8595 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "A Popular Fish Found in Aquariums Is Actually a Whole New Species - ScienceAlert", "description": "Sometimes it's not necessary to travel far, dig deep, or climb high to find a new species: sometimes they're hiding in plain sight, as is the case with the redtail garra, which has just been classified as a species of its own.", "url": "https://www.sciencealert.com/a-popular-fish-found-in-aquariums-is-actually-a-whole-new-species", "urlToImage": "https://www.sciencealert.com/images/2023/07/GarraTop.jpg", "publishedAt": "2023-07-14T11:01:12Z", "content": "Sometimes it's not necessary to travel far, dig deep, or climb high to find a new species: sometimes they're hiding in plain sight, as is the case with the redtail garra, which has just been classifi… [+2525 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "A nearby supernova nearly blew our solar system to bits 4 billion years ago, new research suggests - Yahoo Life", "description": "A supernova that erupted when a massive star died could have destroyed our infant solar system — if it weren't protected by a cocoon of molecular gas.", "url": "https://www.livescience.com/space/astronomy/a-nearby-supernova-nearly-blew-our-solar-system-to-bits-4-billion-years-ago-new-research-suggests", "urlToImage": "https://media.zenfs.com/en/live_science_953/5186a0e4a77a27cd0cba90a3d2450813", "publishedAt": "2023-07-14T11:00:00Z", "content": "An illustration shows the infant solar system shielded from a supernova blast by a filament of a molecular cloud.\r\nA supernova that exploded close to our newly forming sun could have destroyed what b… [+3703 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Thomas Macaulay", "title": "A world-first spacecraft reentry to Earth is approaching - TNW", "description": "A car-sized spacecraft is falling down to Earth — but there's a plan to catch it.\r\n\r\nAeolus, the first satellite to directly observe wind profiles from space, is almost out of fuel. ...", "url": "https://thenextweb.com/news/esa-aeolus-first-assisted-reentry-sateliite-earth-space", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2023%2F07%2FUntitled-design-8.jpg&signature=4af1c3dd84da37d535118c1709de03f1", "publishedAt": "2023-07-14T10:24:58Z", "content": "A car-sized spacecraft is falling down to Earth but theres a plan to catch it.\r\nAeolus, the first satellite to directly observe wind profiles from space, is almost out of fuel. Earths atmosphere and … [+2985 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Hubble Views a Galactic Monster - NASA", "description": "The NASA/ESA Hubble Space Telescope has captured a monster in the making in this observation of the exceptional galaxy cluster eMACS J1353.7+4329.", "url": "https://www.nasa.gov/image-feature/goddard/2023/hubble-views-a-galactic-monster", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/potw2328a.png", "publishedAt": "2023-07-14T09:15:16Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT's “FrameDiff” – Generative AI Imagines New Protein Structures That Could Transform Medicine - SciTechDaily", "description": "MIT researchers develop \"FrameDiff,\" a computational tool that uses generative AI to craft new protein structures, with the aim of accelerating drug development and improving gene therapy. MIT's CSAIL researchers have developed a computational tool, FrameDiff…", "url": "https://scitechdaily.com/mits-framediff-generative-ai-imagines-new-protein-structures-that-could-transform-medicine/", "urlToImage": "https://scitechdaily.com/images/Generative-AI-Imagines-New-Protein-Structures.jpg", "publishedAt": "2023-07-14T08:16:50Z", "content": "ByRachel Gordon,| MIT CSAILJuly 14, 2023\r\nThe FrameDiff system was tested on the task of building single proteins, and the researchers found that it can create big proteins with up to 500 parts. Unli… [+12394 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Scientists are growing seeds in space to help adapt to climate change on Earth - CNN", "description": "Researchers from the joint laboratories of the International Atomic Energy Agency and the Food and Agriculture Organization sent seeds to the International Space Station to produce plants with genetic mutations.", "url": "https://www.cnn.com/2023/07/14/world/scientists-are-growing-seeds-in-space-climate-change-scn-spc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230712170629-space-seeds-iaea-fao-greenhouse-story.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-07-14T08:05:00Z", "content": "Plants naturally adapt to grow in challenging environments. Spontaneous natural mutations produce new traits, such as drought tolerance and disease resistance, which can help the plant to thrive. But… [+4687 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BEWARE! Solar storm to strike Earth today, NOAA warns - HT Tech", "description": "As per NOAA forecasters, a solar storm is expected to hit Earth today, July 14. The CME was seen leaving the Sun on July 11 by the NASA Solar and Heliospheric Observatory.", "url": "https://tech.hindustantimes.com/tech/news/beware-solar-storm-to-strike-earth-today-noaa-warns-71689319813220.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/14/1600x900/m73-flare-rotated_0_1680256680821_1689319860980.jpeg", "publishedAt": "2023-07-14T07:34:34Z", "content": "A solar storm is coming for the Earth today, July 14. The forecasters of the National Oceanic and Atmospheric Administration (NOAA) have given a warning that a G1-class geomagnetic storm will hit our… [+2639 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Jane Clark", "title": "How to photograph Saturn's rings - Sky at Night Magazine", "description": "Catch the planet this year, as over the next few years Saturn’s rings are going to tilt away from our view.", "url": "https://www.skyatnightmagazine.com/astrophotography/astrophoto-tips/photograph-saturn-rings/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/25/2023/07/saturn-rings-tilt-78caf7e.jpg?resize=620,413", "publishedAt": "2023-07-14T07:30:28Z", "content": "There are few things quite as captivating as seeing the rings of Saturn for the first time.\r\nOn 27 August 2023 Saturn will reach opposition, when it lies directly opposite the Sun relative to Earth a… [+11637 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The Ghosts of Dead Stars Form a Mysterious Alignment, But Why? - ScienceAlert", "description": "There's something weird about the ghostly remnants of dead stars in the middle of the Milky Way.", "url": "https://www.sciencealert.com/the-ghosts-of-dead-stars-form-a-mysterious-alignment-but-why", "urlToImage": "https://www.sciencealert.com/images/2023/07/bipolar-pne-hubble.jpg", "publishedAt": "2023-07-14T06:43:41Z", "content": "There's something weird about the ghostly remnants of dead stars in the middle of the Milky Way. Planetary nebulae of a particular kind all seem to be aligned the same way, close to parallel to the g… [+3627 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "This Meteorite Left Earth. Thousands of Years Later, It Came Back. - ScienceAlert", "description": "They say what goes around comes around, but it's unlikely the saying was supposed to ever refer to meteorites.", "url": "https://www.sciencealert.com/this-meteorite-left-earth-thousands-of-years-later-it-came-back", "urlToImage": "https://www.sciencealert.com/images/2023/07/GreyMeteoriteCloseUp.jpg", "publishedAt": "2023-07-14T06:42:41Z", "content": "They say what goes around comes around, but it's unlikely the saying was supposed to ever refer to meteorites.\r\nAnd yet here we are. Scientists are seeking to confirm that a black rock discovered in … [+3931 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": "Jamie Groh", "title": "SpaceX Starlink launch scrubs seconds before liftoff; set for weekend - Florida Today", "description": "SpaceX targets early Saturday for latest Starlink mission from Cape Canaveral after a first attempt scrubbed Friday.", "url": "https://www.floridatoday.com/story/tech/science/space/2023/07/14/spacex-starlink-launch-scrubs-seconds-before-liftoff-set-for-weekend/70412642007/", "urlToImage": "https://www.floridatoday.com/gcdn/presto/2022/09/15/PBRE/cc2c1b04-afce-43b6-b8bb-c68821015690-SpaceX_Starlink_Falcon_.jpg?crop=839,472,x0,y362&width=839&height=472&format=pjpg&auto=webp", "publishedAt": "2023-07-14T05:20:19Z", "content": "SpaceX's latest attempt at launching another batch of Starlink internet satellites from Cape Canaveral Space Force Station was scrubbed just seconds before liftoff early Friday.\r\nOriginally set to fl… [+1829 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Sawyer Rosenstein", "title": "Inaugural Vulcan Launch Targeting Late 2023 After Anomalies - NASASpaceFlight.com - NASASpaceflight.com", "description": "United Launch Alliance (ULA) says despite recent anomalies involving their Centaur V upper stage and…", "url": "https://www.nasaspaceflight.com/2023/07/vulcan-centaur-anomalies/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/05/52890369216_ea259ac8f1_c.jpg", "publishedAt": "2023-07-14T02:41:21Z", "content": "11United Launch Alliance (ULA) says despite recent anomalies involving their Centaur V upper stage and the BE-4 engines built by Blue Origin, Vulcan should still fly this year, although behind schedu… [+6675 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "Volcanic Hotspot Found on the Moon - Universe Today", "description": "A recent study published in Nature examines a volcanic hotspot that potentially exists beneath a feature on the Moon’s farside (the side facing away from the Earth) called the Compton-Belkovich Thorium Anomaly. Researchers led by the Planetary Science Institu…", "url": "https://www.universetoday.com/162364/volcanic-hotspot-found-on-the-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/Low-Res_Figure-location-of-granite-on-Moon.jpg", "publishedAt": "2023-07-14T02:12:00Z", "content": "A recent study published in Nature examines a volcanic hotspot that potentially exists beneath a feature on the Moons farside (the side facing away from the Earth) called the Compton-Belkovich Thoriu… [+3976 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Apai", "title": "A new, thin-lensed telescope design could far surpass James Webb—goodbye mirrors, hello diffractive lenses - Phys.org", "description": "Astronomers have discovered more than 5,000 planets outside of the solar system to date. The grand question is whether any of these planets are home to life. To find the answer, astronomers will likely need more powerful telescopes than exist today.", "url": "https://phys.org/news/2023-07-thin-lensed-telescope-surpass-james-webbgoodbye.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-new-thin-lensed-tele.jpg", "publishedAt": "2023-07-14T00:10:01Z", "content": "Astronomers have discovered more than 5,000 planets outside of the solar system to date. The grand question is whether any of these planets are home to life. To find the answer, astronomers will like… [+7394 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cryo-EM reveals structure of key enzyme involved in protein production - News-Medical.Net", "description": "Transfer RNAs (tRNAs) are among the most common types of RNA in a cell and are indispensable for protein production in all known organisms.", "url": "https://www.news-medical.net/news/20230713/Cryo-EM-reveals-structure-of-key-enzyme-involved-in-protein-production.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/3D_illustration._Colorful_DNA_molecule._Concept_image_of_a_structure_of_the_genetic_code.-ktsdesign_4c035abf42364e14ad194562cfbdb262-620x480.jpg", "publishedAt": "2023-07-13T23:47:00Z", "content": "Transfer RNAs (tRNAs) are among the most common types of RNA in a cell and are indispensable for protein production in all known organisms. They have an important \"translation\" function: They determi… [+3645 chars]"}, {"source": {"id": null, "name": "VVdailypress.com"}, "author": "Rene Ray De La Cruz", "title": "Rick Piercy of Apple Valley, Lewis Center founder, remembered - VVdailypress.com", "description": "Remembering Rick Piercy, the founder of the Lewis Center for Educational Research and its school the Academy for Academic Excellence in Apple Valley", "url": "https://www.vvdailypress.com/story/news/2023/07/14/rick-piercy-of-apple-valley-lewis-center-founder-remembered/70404897007/", "urlToImage": "https://www.vvdailypress.com/gcdn/presto/2023/07/13/NVIC/893e9c70-31c0-4aa5-a295-a1b7b53cfacc-rick_2.jpg?crop=1538,866,x0,y161&width=1538&height=866&format=pjpg&auto=webp", "publishedAt": "2023-07-13T23:03:09Z", "content": "The community is mourning the death of Rick Piercy, the founder of the Lewis Center for Educational Research and its flagship school, the Academy for Academic Excellence in Apple Valley. \r\nLewis Cent… [+8664 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Ancient 'Outsider' Human Species Pinpointed in Oldest Genetic Study Yet - ScienceAlert", "description": "Researchers have managed the incredible feat of predicting genetic relationships between some of the earliest hominins to live on planet Earth, using little more than some proteins scraped from 2 million year old fossilized teeth.", "url": "https://www.sciencealert.com/ancient-outsider-human-species-pinpointed-in-oldest-genetic-study-yet", "urlToImage": "https://www.sciencealert.com/images/2023/07/ParanthropusRobustus.jpg", "publishedAt": "2023-07-13T23:01:15Z", "content": "Researchers have managed the incredible feat of predicting genetic relationships between some of the earliest hominins to live on planet Earth, using little more than some proteins scraped from 2 mil… [+2713 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "NASA doubles its spacesuit options for Artemis astronauts the moon, ISS crews - Space.com", "description": "Axiom Space and Collins Aerospace will develop up to four new spacesuit designs for the moon and low-Earth orbit..", "url": "https://www.space.com/nasa-orders-more-spacesuits-for-moon-space-station", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YdwMwNhrsaXT9mgjBjFTmd-1200-80.jpg", "publishedAt": "2023-07-13T22:33:01Z", "content": "NASA has put out the call to double its options for new spacesuits on the International Space Station and for future Artemis astronauts to use while walking on the moon.\r\nThe U.S. space agency issued… [+3368 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Stashes Probes After Canceling $50 Million Mission - Gizmodo", "description": "The team behind the Janus mission is trying to find a new use for the spacecraft, which are now sitting in storage.", "url": "https://gizmodo.com/nasa-stashes-probes-canceling-50-million-mission-1850637989", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/f48e6b5012a85b3c9b96f3bc3b4d1082.jpg", "publishedAt": "2023-07-13T20:55:00Z", "content": "NASA is going to store a pair of spacecraft at a facility, awaiting a second chance to go to space should the agency find a new purpose for them.\r\nFollowing months of uncertainty, NASA announced that… [+2226 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Congress prepares to continue throwing money at NASA’s Space Launch System - TechCrunch", "description": "Congress will pour billions more dollars into the Space Launch System (SLS) rocket, even as NASA science missions remain vulnerable to cuts.", "url": "https://techcrunch.com/2023/07/13/congress-prepares-to-continue-throwing-money-at-nasas-space-launch-system/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1239279887.jpg?resize=1200,800", "publishedAt": "2023-07-13T20:52:02Z", "content": "Congress will pour billions more dollars into the Space Launch System (SLS) rocket and its associated architecture, even as NASA science missions remain vulnerable to cuts.\r\nBoth the House and Senate… [+2395 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Amanda Siegfried", "title": "Researchers' sweeping discovery shows how kidney cells self-renew - Phys.org", "description": "University of Texas at Dallas scientists have discovered a previously unknown \"housekeeping\" process in kidney cells that ejects unwanted content, resulting in cells that rejuvenate themselves and remain functioning and healthy.", "url": "https://phys.org/news/2023-07-discovery-kidney-cells-self-renew.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/researchers-sweeping-d.jpg", "publishedAt": "2023-07-13T20:31:04Z", "content": "University of Texas at Dallas scientists have discovered a previously unknown \"housekeeping\" process in kidney cells that ejects unwanted content, resulting in cells that rejuvenate themselves and re… [+6242 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astronomers identify the coldest star yet that emits radio waves - Phys.org", "description": "Astronomers at the University of Sydney have shown that a small, faint star is the coldest on record to produce emission at radio wavelength.", "url": "https://phys.org/news/2023-07-astronomers-coldest-star-emits-radio.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/astronomers-identify-t-1.jpg", "publishedAt": "2023-07-13T20:00:01Z", "content": "Astronomers at the University of Sydney have shown that a small, faint star is the coldest on record to produce emission at radio wavelength.\r\nThe 'ultracool brown dwarf' examined in the study is a b… [+3832 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Toward crack-resistant nanoparticle-based latex films - Phys.org", "description": "Synthetic polymer materials, such as plastics and rubbers, have become ubiquitous in our daily lives. It is, therefore, essential to ensure that they are safe, durable, and sustainable. This is especially true for synthetic latex films, which are widely used …", "url": "https://phys.org/news/2023-07-crack-resistant-nanoparticle-based-latex.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/towards-crack-resistan.jpg", "publishedAt": "2023-07-13T19:48:03Z", "content": "Synthetic polymer materials, such as plastics and rubbers, have become ubiquitous in our daily lives. It is, therefore, essential to ensure that they are safe, durable, and sustainable. This is espec… [+3989 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael O'Boyle", "title": "Researchers establish criterion for nonlocal quantum behavior in networks - Phys.org", "description": "A new theoretical study provides a framework for understanding nonlocality, a feature that quantum networks must possess to perform operations inaccessible to standard communications technology. By clarifying the concept, researchers determined the conditions…", "url": "https://phys.org/news/2023-07-criterion-nonlocal-quantum-behavior-networks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-establish.jpg", "publishedAt": "2023-07-13T19:23:03Z", "content": "A new theoretical study provides a framework for understanding nonlocality, a feature that quantum networks must possess to perform operations inaccessible to standard communications technology. By c… [+3748 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Correlating the charge-transfer gap to the maximum transition temperature in Bi2Sr2Can-1CunO2n+4+δ - Science", "description": null, "url": "https://www.science.org/doi/10.1126/science.add3672", "urlToImage": null, "publishedAt": "2023-07-13T17:57:52Z", "content": null}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Multiplex CRISPR editing of wood for sustainable fiber production - Science", "description": null, "url": "https://www.science.org/doi/10.1126/science.add4514", "urlToImage": null, "publishedAt": "2023-07-13T17:57:39Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Study sets new constraints on the kinetic mixing of hidden photon dark matter - Phys.org", "description": "As dark matter is comprised of particles that do not absorb, emit or reflect light, it cannot be observed directly with the methods used to observe conventional matter. In recent years, astrophysicists worldwide have thus been devising methods that could help…", "url": "https://phys.org/news/2023-07-constraints-kinetic-hidden-photon-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/study-sets-new-constra-3.jpg", "publishedAt": "2023-07-13T17:30:01Z", "content": "As dark matter is comprised of particles that do not absorb, emit or reflect light, it cannot be observed directly with the methods used to observe conventional matter. In recent years, astrophysicis… [+4567 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Riley Black", "title": "Was this prehistoric 'killer shrimp' as fierce as it looked? - National Geographic", "description": "More than 500 million years ago, Earth’s first “super predator” was thought to terrorize other creatures with its menacing arms—but new research raises doubts.", "url": "https://www.nationalgeographic.com/premium/article/was-this-prehistoric-killer-shrimp-as-fierce-as-it-looked", "urlToImage": "https://i.natgeofe.com/n/7c30c292-63e2-4124-ab48-93379923415a/NationalGeographic_2700510_16x9.jpg?w=1200", "publishedAt": "2023-07-13T16:37:56Z", "content": "The invertebrate was thought to be one of Earths first super predators. With compound eyes sitting on stalks, a strange circular mouth, and grasping appendages at the front of its head, Anomalocaris … [+5834 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Extinct Short-Snouted Gator Munched on Snails 230,000 Years Ago - Gizmodo", "description": "The extinct species, uncovered in Thailand, is keying researchers into how and when American and Chinese alligators split apart.", "url": "https://gizmodo.com/extinct-short-snouted-gator-munched-snails-1850636103", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/6fe4f11b1c1798f014539c09a3d86f79.jpg", "publishedAt": "2023-07-13T16:30:00Z", "content": "In 2005, the residents of Ban Si Lam, a village in northeastern Thailand, dug out their local pond. Amid the topsoil they found some pottery, ceramics, andto their surprisean alligator skull.\r\nResear… [+3062 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "ESA mission discovers a shiny exoplanet with clouds made of metal - TechSpot", "description": "LTT9779 b is yet another planetary body that researchers say shouldn't actually exist. Initially discovered in 2020 by NASA's TESS space telescope, the exoplanet has now been...", "url": "https://www.techspot.com/news/99386-esa-mission-discovers-shiny-exoplanet-clouds-made-metal.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/07/2023-07-13-image-10.jpg", "publishedAt": "2023-07-13T16:22:26Z", "content": "In a nutshell: The catalog of known exoplanets is turning into a \"bestiary\" of weird celestial bodies that defy traditional theories on planetary formation. Thanks to JWST and other state-of-the-art … [+2748 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Steve DaSilva", "title": "Elon Musk's Starlink Is Making Life Harder For Astronomers - Jalopnik", "description": "Who knew clogging the sky with satellites would make it harder to see space?", "url": "https://jalopnik.com/elon-musk-starlink-making-life-harder-for-astronomers-1850636498", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/b528f49235ac0afb146655341dc09b0e.jpg", "publishedAt": "2023-07-13T16:17:21Z", "content": "Space is a tricky thing to study. Its hard to physically go there, what with the cost and the distance and the deadly vacuum of it all, so scientists prefer to stay on terra firma and merely look out… [+2106 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Katy Evans", "title": "Watch The Moon Whizz Around Our Home Planet As Seen From Mars - IFLScience", "description": "The Mars Express orbiter celebrated 20 years of science by looking back and taking a picture of its home planet.", "url": "https://www.iflscience.com/watch-the-moon-whizz-around-our-home-planet-as-seen-from-mars-69803", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69803/aImg/69274/you-are-here-meta.png", "publishedAt": "2023-07-13T15:59:14Z", "content": "Its not often we see our planet and satellite from the perspective of another world, and weve never seen them like this before. That little white dot zooming around the slightly bigger white dot, tha… [+2266 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "The Barchan Dunes of Brazil - NASA", "description": "Former NASA astronaut Jack Fischer captured this photograph of Lagoa dos Barros and crescent-shaped barchan dunes on the Atlantic coastline of southern Brazil on July 9, 2017, while aboard the International Space Station.", "url": "https://www.nasa.gov/image-feature/the-barchan-dunes-of-brazil", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/iss052-e-14188_lrg.jpg", "publishedAt": "2023-07-13T15:53:16Z", "content": null}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "Saber-Tooth Cats and Dire Wolves Suffered from Osteochondrosis, New Study Shows - Sci.News", "description": "Skeletal disease may hamper the behavior of large predators both living and extinct. In new research, paleontologists from Evidensia Academy and the La", "url": "https://www.sci.news/paleontology/saber-tooth-cats-dire-wolves-osteochondrosis-12091.html", "urlToImage": "https://cdn.sci.news/images/2021/01/image_9230f-Smilodon-fatalis.jpg", "publishedAt": "2023-07-13T15:47:43Z", "content": "Skeletal disease may hamper the behavior of large predators both living and extinct. In new research, paleontologists from Evidensia Academy and the La Brea Tar Pits and Museum investigated the preva… [+3947 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Mend Mariwany, Nehal El-Hadi", "title": "The bacteria and microbes in your gut can affect your body and mental health – engineering them promises new forms of treatment. Podcast - The Conversation", "description": "In the past two decades, technology has allowed scientists to learn so much more about the human body and its microbiomes. These discoveries may pave the way to new therapies.", "url": "https://theconversation.com/the-bacteria-and-microbes-in-your-gut-can-affect-your-body-and-mental-health-engineering-them-promises-new-forms-of-treatment-podcast-209506", "urlToImage": "https://images.theconversation.com/files/536725/original/file-20230711-27-vnioxr.jpg?ixlib=rb-1.1.0&rect=0%2C502%2C6989%2C3489&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-07-13T15:38:46Z", "content": "The human body is a complex organism, made up of trillions of cells. But not all of them are human about half of them are fungi, microbes and bacteria. Scientists are starting to understand how and w… [+4210 chars]"}, {"source": {"id": null, "name": "Trailrunnermag.com"}, "author": "Trail Runner Magazine", "title": "This Israeli Olympian's Go-To Endurance Salad Couldn't Be Easier - Trail Runner Magazine", "description": null, "url": "https://www.trailrunnermag.com/nutrition/this-israeli-olympians-go-to-endurance-salad-couldnt-be-easier/", "urlToImage": null, "publishedAt": "2023-07-13T15:33:00Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Emily Mae Czachor", "title": "\"Exceptionally rare\" dinosaur fossils discovered in Maryland - CBS News", "description": "Paleontologists revealed the discovery of a \"bone bed\" with fossils estimated to be between 100 and 145 million years old.", "url": "https://www.cbsnews.com/news/dinosaur-fossils-discovered-maryland-dinosaur-park/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/13/f17803ea-4f7e-4718-b6bf-ec232e6ac3f1/thumbnail/1200x630/fef28dd701be8e1b82c40e60ba8b8872/dsc-0154-dinosaur-park-7-11-2023-720x480.jpg?v=b9ad248140817530b57bedd1355bcccb", "publishedAt": "2023-07-13T15:26:00Z", "content": "Rare dinosaur fossils found in Maryland bone bed \r\nRare dinosaur fossils found in Maryland bone bed00:46\r\nPaleontologists and volunteers at Maryland's Dinosaur Park discovered a \"bone bed\" with rare … [+3128 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "How The Sun Saved Us From A 65-Hour Day - IFLScience", "description": "You might think you’d love a few extra hours in the day, but do you really want one this long?", "url": "https://www.iflscience.com/how-the-sun-saved-us-from-a-65-hour-day-69808", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69808/aImg/69270/earth-and-sun-and-moon-meta.png", "publishedAt": "2023-07-13T15:23:15Z", "content": "The Earths rotation is gradually slowing down, thanks to interactions with the Moon. Two billion years ago, there was a pause in those changes that lasted about a billion years. A new study not only … [+4112 chars]"}, {"source": {"id": null, "name": "Colossal"}, "author": "Grace Ebert", "title": "Crows and Magpies Are Building Nests with Anti-Bird Spikes — Colossal - Colossal", "description": "A new paper highlights examples of magpies and carrion crows building nests with strips of anti-bird spikes in both Rotterdam and Antwerp.", "url": "https://www.thisiscolossal.com/2023/07/crows-magpies-spike-nests/", "urlToImage": "https://www.thisiscolossal.com/wp-content/uploads/2023/07/birds-2.jpg", "publishedAt": "2023-07-13T14:45:52Z", "content": "All images courtesy of Denisea\r\nHostile architecture is a design strategy that restricts access to public space. Spikes protruding from doorways, fences under stairs, and curved benches that require … [+1816 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Sade Agard", "title": "Video: First-of-its-kind microscope captures stunning views of the brain - Interesting Engineering", "description": "You can watch it being engineered right here.", "url": "https://interestingengineering.com/innovation/first-of-its-kind-microscope-brain", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/13/image/jpeg/4eP9BkpRY17BxF2WpxeEtmo0Y5SAeYsLHk9zu1pW.jpg", "publishedAt": "2023-07-13T13:44:00Z", "content": "Impressively, they could image specific features, such as corticospinal neurons in the motor cortex of macaque monkeys and trace axons in human white matter.\r\nThe researchers utilized special fluores… [+2213 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Euclid's large halo around indefinitely small point - European Space Agency", "description": null, "url": "https://www.esa.int/Enabling_Support/Operations/Euclid_s_large_halo_around_indefinitely_small_point", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2023/07/euclid_s_orbit_from_launch_to_lagrange_point_2/24988621-1-eng-GB/Euclid_s_orbit_from_launch_to_Lagrange_point_2_pillars.png", "publishedAt": "2023-07-13T13:43:27Z", "content": "Enabling &amp; Support13/07/2023286 views7 likes\r\nThis animation, created using Gaia Sky, shows Euclids path from Earth to this unique and useful position in space. Located about 1.5 million kilometr… [+4164 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "80-year-old principles incompletely explain turbulent flows, study shows - Phys.org", "description": "Experiments at the unique wind tunnel of the Max Planck Institute for Dynamics and Self-Organization (MPI-DS) in Göttingen show that laws formulated more than 80 years ago and their extensions only incompletely explain turbulent flows.", "url": "https://phys.org/news/2023-07-year-old-principles-incompletely-turbulent.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-better-understanding.jpg", "publishedAt": "2023-07-13T12:47:32Z", "content": "Experiments at the unique wind tunnel of the Max Planck Institute for Dynamics and Self-Organization (MPI-DS) in Göttingen show that laws formulated more than 80 years ago and their extensions only i… [+3050 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Quantum drive that draws 'limitless power' from Sun will fly to orbit this year - Interesting Engineering", "description": "IVO Ltd. believes its new 'Quantum Drive' defies the laws of motion, and it aims to put it to the test by sending it to orbit on a SpaceX rocket.", "url": "https://interestingengineering.com/innovation/quantum-drive-that-draws-limitless-power-from-sun-will-fly-to-orbit-this-year", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/13/image/jpeg/6ty4No6pEIOgl2h4aB5IJw3qVHt5CVykrPRZ6i3o.jpg", "publishedAt": "2023-07-13T12:38:00Z", "content": "These laws of motion have been precious to the space and rocket industry, but that hasn't deterred IVO. The company has built its Quantum Drive based on principles from McCulloch's QI theory, and the… [+1340 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "DNA element with a murky past is borrowing cell's repair machinery - Phys.org", "description": "Like its viral cousins, a somewhat parasitic DNA sequence called a retrotransposon has been found borrowing the cell's own machinery to achieve its goals.", "url": "https://phys.org/news/2023-07-dna-element-murky-cell-machinery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/dna-element-with-a-mur.jpg", "publishedAt": "2023-07-13T08:33:14Z", "content": "Like its viral cousins, a somewhat parasitic DNA sequence called a retrotransposon has been found borrowing the cell's own machinery to achieve its goals.\r\nIn a new work appearing online Wednesday in… [+4546 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Francisco Tutella", "title": "Size does matter: Group size and mating preferences drive deeper male voices - Phys.org", "description": "Deeper male voices in primates, including humans, offer more than sex appeal—they may have evolved as another way for males to drive off competitors in large groups that favored polygyny, or mating systems where a male has multiple mates, according to researc…", "url": "https://phys.org/news/2023-07-size-group-deeper-male-voices.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/chimpanzee.jpg", "publishedAt": "2023-07-13T07:13:23Z", "content": "Deeper male voices in primates, including humans, offer more than sex appealthey may have evolved as another way for males to drive off competitors in large groups that favored polygyny, or mating sy… [+5871 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": null, "title": "'Ice worlds' study finds there are more water worlds out there than previously thought - Euronews", "description": "Scientists estimate that one rocky planet per star in our galaxy could hold liquid water - the key to life.", "url": "https://www.euronews.com/next/2023/07/13/ice-worlds-study-finds-there-are-more-water-worlds-out-there-than-previously-thought", "urlToImage": "https://static.euronews.com/articles/stories/07/74/72/14/1000x563_cmsv2_95296baf-3a51-52c5-9347-d6ec8637f1a5-7747214.jpg", "publishedAt": "2023-07-13T05:01:09Z", "content": "Scientists estimate that one rocky planet per star in our galaxy could hold liquid water - the key to life.\r\n Nobody is giving up on our planet just yet, though sometimes the lack of action on climat… [+3880 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Candice Zhu", "title": "China reveals how it plans to put astronauts on the moon by 2030 - CNN", "description": "Chinese officials on Wednesday unveiled new details about their plans for a manned lunar mission, as China attempts to become only the second nation to put citizens on the moon.", "url": "https://www.cnn.com/2023/07/13/china/china-crewed-moon-landing-2030-intl-hnk-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230712230643-china-crewed-moon-landing-2030-intl-hnk-scn.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-07-13T04:04:00Z", "content": "Chinese officials on Wednesday unveiled new details about their plans for a manned lunar mission, as China attempts to become only the second nation to put citizens on the moon. \r\nZhang Hailian, depu… [+2789 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "Magnetar Glitches, Fast Radio Bursts, And...Asteroids??? - Universe Today", "description": "And now new research suggests that the cause of both of these is the destruction of an asteroid by a magnetar.", "url": "https://www.universetoday.com/161797/we-just-saw-an-asteroid-hit-a-magnetar/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/02/Magnetar_Burst_Torsional_Waves_1080.jpg", "publishedAt": "2023-07-13T02:21:48Z", "content": "Recently astronomers have been able to associate two seemingly unrelated phenomena: an explosive event known as a fast radio burst and the change in speed of a spinning magnetar. And now new research… [+2971 chars]"}]}