{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Monster Black Hole Jets in a Spiral Galaxy Could Forecast the Milky Way’s Frightening Future - SciTechDaily", "description": "Astronomers have uncovered a spiral galaxy nearly a billion light-years away that hosts a supermassive black hole launching colossal jets of energy, something once thought possible only in elliptical galaxies. This revelation not only challenges our current m…", "url": "https://scitechdaily.com/?p=464443", "urlToImage": "https://scitechdaily.com/images/Cosmic-Cataclysm-Art-Concept-Illustration.jpg", "publishedAt": "2025-03-25T22:02:03Z", "content": "A gigantic spiral galaxy with powerful black hole jets has shocked scientists, showing that even galaxies like ours could unleash dangerous radiation one day. It challenges how we think galaxies evol… [+6790 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jonathan Edwards", "title": "Two killer whales are hunting great white sharks — to eat their livers - The Washington Post", "description": "Two killer whales have killed dozens — if not hundreds — of sharks, including the vaunted great whites, with an ease that has stunned marine biologists.", "url": "https://www.washingtonpost.com/science/2025/03/25/killer-whales-great-white-sharks-south-africa/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AH34UJAVTZE43BCDCUTLWPOYUE_size-normalized.jpg&w=1440", "publishedAt": "2025-03-25T20:37:14Z", "content": "Esther Jacobs smelled murder on the water. As the pungent odor of shark liver filled the air and an oily sheen spread across the surface, Jacobs had come upon an aquatic crime scene and two notorious… [+9863 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Alien-Like Microbes May Have Carved Tunnels Into Solid Rock Millions of Years Ago - Indian Defence Review", "description": "Deep beneath desert stone, scientists have uncovered tiny, perfectly aligned tunnels that may have been carved by ancient microbes", "url": "https://indiandefencereview.com/alien-like-microbes-tunnels-solid-rock/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/alien-like-microbes-may-have-carved-tunnels-into-solid-rock-millions-of-years-ago.jpg", "publishedAt": "2025-03-25T20:10:00Z", "content": "Deep inside marble and limestone formations in the deserts of Namibia, Oman, and Saudi Arabia, scientists have uncovered something astonishing: thin, perfectly aligned tunnelscarved through solid sto… [+5389 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Chimpanzees select the best materials for termite fishing - Earth.com", "description": "Chimpanzees in Tanzania choose flexible materials for termite tools, revealing clues about the origins of human intelligence and tool use.", "url": "https://www.earth.com/news/chimpanzees-select-the-best-materials-for-termite-fishing/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/25125549/Chimpanzees-fishing.jpg", "publishedAt": "2025-03-25T18:58:26Z", "content": "In the forests of Tanzania, chimpanzees have long been known to fish for termites using handmade tools crafted from local plants. But what makes this behavior even more fascinating is how carefully t… [+4409 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "NASA Armstrong Internal Email: Latest on Executive Orders Etc. - NASA Watch", "description": "this email \"Latest on Executive Orders, Etc.\" was sent to the NASA Armstrong workforce by Center Director Brad Flick on 24 March 2025", "url": "https://nasawatch.com/personnel-news/nasa-armstrong-internal-email-latest-on-executive-orders-etc/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/03/afrc_entrance.jpg", "publishedAt": "2025-03-25T18:33:44Z", "content": "NASA Armstrong Flight Research Center \r\nKeith’s note: this email “Latest on Executive Orders, Etc.” was sent to the NASA Armstrong workforce by Center Director Brad Flick on 24 March 2025 . Of all th… [+3651 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dust Devils on Mars Create Lightning-like Zaps That Could Endanger Rovers - The Daily Galaxy --Great Discoveries Channel", "description": "Martian dust devils may be more than just swirling storms—they could be generating lightning-like electrical discharges that pose a serious risk to rovers.", "url": "https://dailygalaxy.com/2025/03/dust-devils-mars-lightning-like-zaps/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Dust-Devils-on-Mars-Create-Lightning-like-Zaps-That-Could-Endanger-Rovers.jpg", "publishedAt": "2025-03-25T17:00:00Z", "content": "Mars has always captured the imagination of space explorers, and now new findings are showing that the Red Planets dust devils might be even more dangerous than we thought. These familiar whirlwinds … [+3305 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "An Astronomer Calculated the Exact Day a Star Will Blow—and It’s This Week - Gizmodo", "description": "The rare nova explosion—once it happens—will be so bright that you'll be able to spot it without a telescope.", "url": "https://gizmodo.com/an-astronomer-calculated-the-exact-day-a-star-will-blow-and-its-this-week-2000580309", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/nova-star-explosion.jpeg", "publishedAt": "2025-03-25T16:35:53Z", "content": "Astronomers have been watching a small constellation in the night sky, waiting for a nearby binary star system to explode. The wait may finally be over: A numerical estimate predicts the rare nova er… [+4110 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Curiosity Mars rover discovers largest organic molecules ever seen on Red Planet - Space.com", "description": "While the presence of these molecules is not proof of ancient life on Mars, scientists say it shows we could detect chemical signatures of past life, if it ever existed.", "url": "https://www.space.com/the-universe/mars/curiosity-mars-rover-discovers-largest-organic-molecules-ever-seen-on-red-planet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vckNRmQs9YA4X68zfASzM7-1200-80.jpg", "publishedAt": "2025-03-25T16:00:00Z", "content": "Scientists have announced the discovery of the largest organic molecules ever found on Mars.\r\nThese molecules could have come from the breakdown of fatty acids that existed 3.7 billion years ago befo… [+5627 chars]"}, {"source": {"id": null, "name": "Home.cern"}, "author": null, "title": "A new piece in the matter–antimatter puzzle - CERN", "description": "Yesterday, at the annual Rencontres de Moriond conference taking place in La Thuile, Italy, the LHCb collaboration at CERN reported a new milestone in our understanding of the subtle yet profound differences between matter and antimatter. In its analysis of l…", "url": "https://home.cern/news/press-release/physics/new-piece-matter-antimatter-puzzle", "urlToImage": "https://cds.cern.ch/images//file?size=medium", "publishedAt": "2025-03-25T16:00:00Z", "content": "The LHCb experiment at CERN has revealed a fundamental asymmetry in the behaviour of particles called baryons\r\n Yesterday, at the annual Rencontres de Moriond conference taking place in La Thuile, It… [+4748 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Where To Buy Solar Eclipse Glasses (And Our Top Picks) - The Weather Channel", "description": "Buy your solar eclipse glasses now to watch the partial solar eclipse on Saturday, March 29. Learn what to look out for, and check out our top picks for solar eclipse glasses and smartphone lenses.", "url": "https://weather.com/commerce", "urlToImage": "https://s.w-x.co/KessephSolarEclipseGlasses-HERO-Amazon.png", "publishedAt": "2025-03-25T15:43:12Z", "content": "Atmosphere by The Weather Channel curates products and services for all seasons. If you buy something from one of our links, we may earn a commission.\r\nTheres a rare sunrise solar eclipse coming Satu… [+3698 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt", "title": "Previously unknown dinosaur species resembled prehistoric ‘Edward Scissorhands’ - CNN", "description": "Paleontologists unearthed the fossil in Mongolia’s Gobi Desert, and the find is unique because of a sheath preserved on one of the digits, which reveals the claw’s true length.", "url": "https://www.cnn.com/2025/03/25/science/two-fingered-claw-dinosaur-duonychus-tsogtbaatari-mongolia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/7-duonychus-hand-reconstruction-illustration-credit-masoto-hattori.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-25T15:40:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith distinctive two-fingered claws, the remains of a … [+3962 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Elliot Williams", "title": "2024 Hackaday Supercon Talk: Killing Mosquitoes With Freaking Drones, And Sonar - Hackaday", "description": "Suppose that you want to get rid of a whole lot of mosquitoes with a quadcopter drone by chopping them up in the rotor blades. If you had really good eyesight and pretty amazing piloting skills, yo…", "url": "https://hackaday.com/2025/03/25/2024-hackaday-supercon-talk-killing-mosquitoes-with-freaking-drones-and-sonar/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/03/toussaint_feat.png", "publishedAt": "2025-03-25T14:00:00Z", "content": "Suppose that you want to get rid of a whole lot of mosquitoes with a quadcopter drone by chopping them up in the rotor blades. If you had really good eyesight and pretty amazing piloting skills, you … [+3132 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Spot a New Giant Molecular Cloud in the Milky Way, 23,000 Light Years Away - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a new giant molecular cloud (GMC) in the Milky Way, a finding that has expanded our understanding of the galaxy's structure and", "url": "https://dailygalaxy.com/2025/03/astronomers-molecular-cloud-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Astronomers-Spot-a-New-Giant-Molecular-Cloud-in-the-Milky-Way-23000-Light-Years-Away.jpg", "publishedAt": "2025-03-25T14:00:00Z", "content": "Astronomers have discovered a new giant molecular cloud (GMC) in the Milky Way, a finding that has expanded our understanding of the galaxy’s structure and star formation processes. This new cloud, d… [+3067 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laura Mgrdichian-West", "title": "'Half ice, half fire': Physicists discover new phase of matter in a magnetic material - Phys.org", "description": "Two scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have discovered a new phase of matter while studying a model system of a magnetic material.", "url": "https://phys.org/news/2025-03-ice-physicists-phase-magnetic-material.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/brookhaven-physicists.jpg", "publishedAt": "2025-03-25T13:39:04Z", "content": "Two scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have discovered a new phase of matter while studying a model system of a magnetic material.\r\nThe phase is a neve… [+5184 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Marathon runners undergo reversible reductions in myelin in the brain during a race, study reveals - Medical Xpress", "description": "A team of neurologists, neuroradiologists and biomaterials specialists affiliated with several institutions in Spain has found that marathon runners undergo a reversible reduction in myelin in the brain during a race. In their study published in the journal N…", "url": "https://medicalxpress.com/news/2025-03-marathon-runners-reversible-reductions-myelin.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/marathon-runners-under.jpg", "publishedAt": "2025-03-25T13:13:01Z", "content": "A team of neurologists, neuroradiologists and biomaterials specialists affiliated with several institutions in Spain has found that marathon runners undergo a reversible reduction in myelin in the br… [+2618 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "A 'Star Grinder' Swarm of Black Holes Could Lurk in Our Galaxy's Dusty Core - ScienceAlert", "description": "There is a supermassive black hole at the center of our galaxy.", "url": "https://www.sciencealert.com/a-star-grinder-swarm-of-black-holes-could-lurk-in-our-galaxys-dusty-core", "urlToImage": "https://www.sciencealert.com/images/2025/03/TwoBlackHolesMerging.jpg", "publishedAt": "2025-03-25T12:01:17Z", "content": "There is a supermassive black hole at the center of our galaxy. There is also a lot of other stuff there as well. Young stars, gas, dust, and stellar-mass black holes. It's a happening place.\r\nIt is … [+3570 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Kylie Mohr", "title": "'It's incredibly dynamic': Geologists find new Yellowstone thermal vent - SFGATE", "description": "Yellowstone National Park geologists have discovered a hot new geothermal feature.", "url": "https://www.sfgate.com/national-parks/article/yellowstone-geologists-find-hydrothermal-feature-20234304.php", "urlToImage": "https://s.hdnux.com/photos/01/47/61/51/27204170/3/rawImage.jpg", "publishedAt": "2025-03-25T11:09:19Z", "content": "On an August day in 2024, a Yellowstone National Park ranger driving south between Mammoth Hot Springs and Norris Geyser Basin noticed a plume of steam. Was it really steam, the ranger wondered, or w… [+6194 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Spiral in the sky spotted in sky above the North West - BBC.com", "description": "An unusual light appeared in the sky on Monday evening and was captured across the North West", "url": "https://www.bbc.com/news/articles/c2kgengk732o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/a4bd/live/196e5df0-095c-11f0-9401-656920122950.jpg", "publishedAt": "2025-03-25T11:03:37Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Innsbruck", "title": "How an unconventional type of quantum computer opens a new door to the world of elementary particles - Phys.org", "description": "The standard model of particle physics is our best theory of the elementary particles and forces that make up our world: particles and antiparticles, such as electrons and positrons, are described as quantum fields. They interact through other force fields, s…", "url": "https://phys.org/news/2025-03-unconventional-quantum-door-world-elementary.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-type-of-quantum-co.jpg", "publishedAt": "2025-03-25T10:50:41Z", "content": "The standard model of particle physics is our best theory of the elementary particles and forces that make up our world: particles and antiparticles, such as electrons and positrons, are described as… [+4342 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Dazzling photos of this month's total lunar eclipse showcase a blood red moon near the Milky Way's heart - Space.com", "description": "NOIRLab shared stunning views of the total lunar eclipse in the night sky over Chile, complete with a blood red moon and beautiful, star-studded Milky Way.", "url": "https://www.space.com/stargazing/astrophotography/dazzling-photos-of-this-months-total-lunar-eclipse-showcase-a-blood-red-moon-near-the-milky-ways-heart", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aS7aU5fiSceQyNu4D8TyiZ-1200-80.jpg", "publishedAt": "2025-03-25T10:00:00Z", "content": "Breathtaking photos of the total lunar eclipse from earlier this month capture a glowing, blood red moon and star-studded heart of the Milky Way in the night skies over Chile.\r\nA total lunar eclipse\r… [+2750 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "'Unlike any objects we know': Scientists get their best-ever view of 'space tornadoes' howling at the Milky Way's center - Livescience.com", "description": "Scientists have gotten the best-ever view of 'space tornadoes' howling near the Milky Way's black hole. The cosmic twisters could play an important role in distributing organic molecules throughout the galaxy.", "url": "https://www.livescience.com/space/unlike-any-objects-we-know-scientists-get-their-best-ever-view-of-space-tornadoes-howling-at-the-milky-ways-center", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mzrcdFMF77RjapT6JJeL6C-1200-80.jpg", "publishedAt": "2025-03-25T10:00:00Z", "content": "\"Space tornadoes\" are swirling near the supermassive black hole\r\n at the heart of our Milky Way galaxy, new telescope observations have revealed in unprecedented detail.\r\nAstronomers recently zoomed … [+2770 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Tentacled Microbes That Might Have Sparked Complex Life - SciTechDaily", "description": "New research sheds light on one of the biggest questions in biology: where did complex life come from? The answer may lie with Asgard archaea, a group of ancient single-celled microbes that share surprising similarities with more complex organisms. By closely…", "url": "https://scitechdaily.com/the-tentacled-microbes-that-might-have-sparked-complex-life/", "urlToImage": "https://scitechdaily.com/images/Asgard-Archaeon.jpg", "publishedAt": "2025-03-25T08:22:48Z", "content": "An artist’s depiction of an Asgard archaeon, based on cryo-electron tomography data: the cell body and appendages feature thread-like skeletal structures, similar to those found in complex cells with… [+8213 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Javier Carbajal", "title": "Scientists Observe Carbon Dioxide on Planets Outside the Solar System for the First Time - WIRED", "description": "The findings provide strong evidence that four giant exoplanets 130 light-years from Earth formed much like Jupiter and Saturn.", "url": "https://www.wired.com/story/scientists-observe-for-the-first-time-carbon-dioxide-on-other-planets-outside-the-solar-system/", "urlToImage": "https://media.wired.com/photos/67daf71f91fcdb9ee3fd125a/191:100/w_1280,c_limit/jameswebb.jpeg", "publishedAt": "2025-03-25T08:00:00Z", "content": "Carbon dioxide has been detected on a planet outside our solar system for the first time. The gas has been observed directly by the James Webb Space Telescope on four exoplanets, all belonging to the… [+3982 chars]"}, {"source": {"id": null, "name": "ABC10.com KXTV"}, "author": "Staff (ABC10)", "title": "Fireball over California sky was no meteor. It was likely SpaceX Dragon debris, AMS says - ABC10.com KXTV", "description": "Californians likely witnessed SpaceX Dragon mission debris, not a meteor, lighting up the night sky.", "url": "https://www.abc10.com/article/news/local/california/fireball-over-california-sky-was-no-meteor-it-was-likely-spacex-dragon-debris/103-86b8628a-6f1e-4e0d-9f29-c2934bc2251e", "urlToImage": "https://media.abc10.com/assets/KXTV/images/4086be2b-e2de-4b80-bc0d-48dacc634c54/20250325T062919/4086be2b-e2de-4b80-bc0d-48dacc634c54_1140x641.jpg", "publishedAt": "2025-03-25T06:42:00Z", "content": "CALIFORNIA, USA If you looked up toward the sky in California around 9 p.m., it wasn't a fireball. It wasn't a plane. And it wasn't a meteor. The American Meteor Society said what Californians saw wa… [+1267 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Tiny Particle is Redefining Our View of the Atomic Nucleus - SciTechDaily", "description": "University of Queensland scientists have cracked a long-standing puzzle in nuclear physics, showing that nuclear polarization, once thought to hinder experiments with muonic atoms, has a much smaller effect than expected. This surprising result clears a major…", "url": "https://scitechdaily.com/this-tiny-particle-is-redefining-our-view-of-the-atomic-nucleus/", "urlToImage": "https://scitechdaily.com/images/Physics-Atom-Nucleus-Art.jpg", "publishedAt": "2025-03-24T23:33:35Z", "content": "Muonic atoms can now unlock nuclear secrets, thanks to a breakthrough that minimizes polarization concerns. Credit: SciTechDaily.com\r\nUniversity of Queensland scientists have cracked a long-standing … [+2792 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "As preps continue, it’s looking more likely NASA will fly the Artemis II mission - Ars Technica", "description": "The core stage of NASA’s Space Launch System is now integrated with the rocket’s twin boosters.", "url": "https://arstechnica.com/space/2025/03/as-preps-continue-its-looking-more-likely-nasa-will-fly-the-artemis-ii-mission/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/KSC-20250323-PH-FMX01_0159orig-copy-1152x648.jpg", "publishedAt": "2025-03-24T23:08:43Z", "content": null}, {"source": {"id": null, "name": "Allthatsinteresting.com"}, "author": "Amber Morgan", "title": "What Is Quantum Immortality? Inside The Strange Theory That Consciousness Never Dies - All That's Interesting", "description": "Quantum immortality is a quantum mechanics theory that suggests when someone dies in one reality, their consciousness continues to survive in another one.", "url": "https://allthatsinteresting.com/quantum-immortality", "urlToImage": "https://allthatsinteresting.com/wordpress/wp-content/uploads/2025/03/quantum-immortality-featured.jpg", "publishedAt": "2025-03-24T23:01:48Z", "content": "The many-worlds interpretation of quantum mechanics suggests that you would never perceive your own death, because if you were to die in one reality, your consciousness would simply transfer to a dif… [+8171 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Sandra Erwin", "title": "NRO expands spy satellite network with back-to-back SpaceX launches - SpaceNews", "description": "The NROL-69 mission launched from Cape Canaveral Space Force Station.", "url": "http://spacenews.com/nro-expands-spy-satellite-network-with-back-to-back-spacex-launches/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDNcL0xhdW5jaC1FbnRyeS1MYW5kaW5nLTEwMjR4NjgzLmpwZyIsInR4dCI6Ik5STyBleHBhbmRzIHNweSBzYXRlbGxpdGUgbmV0d29yayB3aXRoIGJhY2stdG8tYmFjayBTcGFjZVggbGF1bmNoZXMiLCJ0ZW1wbGF0ZSI6ImZ1bGxzY3JlZW4iLCJibG9nX2lkIjo4MDY4MTk3OX0.8ihWRZEKpYS8p0hnB6XvYrHqZXOyP3vekE0ecj_O3mAMQ", "publishedAt": "2025-03-24T22:59:39Z", "content": "WASHINGTON A SpaceX Falcon 9 rocket on March 24 successfully launched the classified NROL-69 mission for the National Reconnaissance Office, putting the agency on a path to build the largest ever U.S… [+1462 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Martin Smith", "title": "Launch Roundup: Alpha, Spectrum, Electron, and Falcon 9 set to fly - NASASpaceflight.com", "description": "The week ahead includes four launches scheduled for Wednesday and the third Electron rocket to…", "url": "https://www.nasaspaceflight.com/2025/03/launch-roundup-032425/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/11/Nov.-3-2023-Falcon-9-Starlink-6-26-Streak-Shot.jpg", "publishedAt": "2025-03-24T22:19:44Z", "content": "39The week ahead includes four launches scheduled for Wednesday and the third Electron rocket to fly within 12 days. SpaceX kicked off the week with the launch of a classified mission on Monday. Fire… [+10131 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MARCIA DUNN AP aerospace writer", "title": "Webb Space Telescope captures a star in the making and a galaxy far, far away - ABC News", "description": "The Webb Space Telescope has captured a plume of gas and dust streaming from a star in the making, with a spiral galaxy as a stunning backdrop", "url": "https://abcnews.go.com/Technology/wireStory/webb-space-telescope-captures-star-making-galaxy-120111583", "urlToImage": "https://i.abcnewsfe.com/a/9c80030f-c9f5-4104-899e-d4873b1962d6/wirestory_7886dfa1e5e946384e435a2561761cca_16x9.jpg?w=1600", "publishedAt": "2025-03-24T21:48:42Z", "content": "CAPE CANAVERAL, Fla. -- The Webb Space Telescope has captured a plume of gas and dust streaming from a star in the making, with a spiral galaxy as a stunning backdrop. \r\nThe composite image makes it … [+1080 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carolyn Collins Petersen", "title": "We're one step closer to a giant interferometer on the moon - Phys.org", "description": "What's on and in a star? What happens in an active galactic nucleus? Answering those questions is the goal of a proposed giant interferometer on the moon. It's called the Artemis-enabled Stellar Imager (AeSI) and would deploy a series of 15–30 optical/ultravi…", "url": "https://phys.org/news/2025-03-closer-giant-interferometer-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/were-one-step-closer-t.jpg", "publishedAt": "2025-03-24T21:17:18Z", "content": "What's on and in a star? What happens in an active galactic nucleus? Answering those questions is the goal of a proposed giant interferometer on the moon. It's called the Artemis-enabled Stellar Imag… [+8765 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Queen Mary, University of London", "title": "Biologists discover ancient neurohormone that controls appetite - Phys.org", "description": "A team of biologists at Queen Mary University of London has discovered that a neurohormone controlling appetite in humans has an ancient evolutionary origin, dating back over half a billion years. The findings, published in Proceedings of the National Academy…", "url": "https://phys.org/news/2025-03-biologists-ancient-neurohormone-appetite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/appetite.jpg", "publishedAt": "2025-03-24T19:57:09Z", "content": "A team of biologists at Queen Mary University of London has discovered that a neurohormone controlling appetite in humans has an ancient evolutionary origin, dating back over half a billion years. Th… [+4754 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Amanda Kooser", "title": "NASA Mars Rover Spots ‘Shocking Spherules’ In Strange Rock - Forbes", "description": "NASA's Perseverance Mars rover photographed a weird, bubbly-looking rock. Scientists are investigating its formation and trying to figure out where it came from.", "url": "https://www.forbes.com/sites/amandakooser/2025/03/24/nasa-mars-rover-spots-shocking-spherules-in-strange-rock/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67e1aa6aaf0a569a7cb0db3b/0x0.jpg?format=jpg&crop=1131,637,x496,y305,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-24T19:16:15Z", "content": "NASA's Perseverance rover spotted this spherule-packed rocked in March. \r\nNASA/JPL-Caltech/ASU\r\nIt takes a lot to astonish a Mars rover team that has seen everything from an ancient beach to a rock t… [+3365 chars]"}, {"source": {"id": null, "name": "KTLA Los Angeles"}, "author": "Will Conybeare", "title": "NASA takes to the skies for ‘first-of-a-kind’ study of California wildflower blooms - KTLA Los Angeles", "description": "There’s more to the California wildflower blooms than meets the human eye, experts say.  NASA’s Caltech Jet Propulsion Laboratory released findings on Monday surrounding a “first-of-a-kind” study of flower cycles in the Golden State that could serve as a pote…", "url": "https://ktla.com/news/california/nasa-takes-to-the-skies-for-first-of-a-kind-study-of-california-wildflower-blooms/", "urlToImage": "https://ktla.com/wp-content/uploads/sites/4/2019/04/superbloom.jpg?w=1280", "publishedAt": "2025-03-24T19:12:08Z", "content": "Theres more to the California wildflower blooms than meets the human eye, experts say. \r\nNASAs Caltech Jet Propulsion Laboratory released findings on Monday surrounding a first-of-a-kind” study of fl… [+2508 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Chu | MIT News", "title": "Mathematicians uncover the logic behind how people walk in crowds - MIT News", "description": "Mathematicians studied the flow of human crowds and developed a way to predict when pedestrian paths will transition from orderly to entangled. Their findings may help inform the design of public spaces that promote safe and efficient thoroughfares.", "url": "https://news.mit.edu/2025/mathematicians-uncover-logic-behind-how-crowds-walk-0324", "urlToImage": "https://news.mit.edu/sites/default/files/images/202503/MIT-CrowdFlow-01.jpg", "publishedAt": "2025-03-24T19:00:00Z", "content": "Next time you cross a crowded plaza, crosswalk, or airport concourse, take note of the pedestrian flow. Are people walking in orderly lanes, single-file, to their respective destinations? Or is it a … [+7497 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Asteroid 2024 YR4 May Miss Earth in 2032, But It’s Not Gone for Good - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers confirm that asteroid 2024 YR4 won't hit Earth in 2032, but its return could still pose a threat in the future, according to a recent study.", "url": "https://dailygalaxy.com/2025/03/asteroid-2024-yr4-miss-earth-2032-not-gone/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Asteroid-2024-YR4.jpg", "publishedAt": "2025-03-24T18:30:00Z", "content": "In a cosmic twist of fate, scientists have confirmed that asteroid 2024 YR4, a near-Earth asteroid previously thought to pose a significant threat, will not collide with our planet in 2032. However, … [+3051 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Delft University of Technology", "title": "Scalable nanotechnology-based lightsails developed for next-generation space exploration - Phys.org", "description": "Researchers at TU Delft and Brown University have developed scalable nanotechnology-based lightsails that could support future advances in space exploration and experimental physics. Their research, published in Nature Communications, introduces new materials…", "url": "https://phys.org/news/2025-03-scalable-nanotechnology-based-lightsails-generation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/delft-university-of-te.jpg", "publishedAt": "2025-03-24T18:27:03Z", "content": "Researchers at TU Delft and Brown University have developed scalable nanotechnology-based lightsails that could support future advances in space exploration and experimental physics. Their research, … [+5757 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "17-Year-Old Discovers Black Hole Echo Bigger Than the Milky Way - The Daily Galaxy --Great Discoveries Channel", "description": "A 17-year-old student searching for dying stars made a discovery that left astronomers speechless — a mysterious glow stretching far beyond our galaxy. What he found wasn't what anyone expected.", "url": "https://dailygalaxy.com/2025/03/17-year-old-discovers-black-hole-echo-bigger-than-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/17-Year-Old-Discovers-Black-Hole-Echo-Bigger-Than-the-Milky-Way-.jpg", "publishedAt": "2025-03-24T18:00:00Z", "content": "A high school student in New York has stumbled onto a massive discovery a cosmic light echo possibly spanning twice the width of the Milky Way. While scanning space for signs of dying stars, 17-year-… [+2771 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "'Potentially hazardous' pyramid-size asteroid will make its closest flyby of Earth for more than 100 years this Wednesday - Livescience.com", "description": "The hefty space rock 2014 TN17 is large enough to wipe out a city, but it will pose no risk to our planet when it sails by this Wednesday (March 26). Researchers will monitor it carefully during its close approach.", "url": "https://www.livescience.com/space/asteroids/potentially-hazardous-pyramid-size-asteroid-will-make-its-closest-flyby-of-earth-for-more-than-100-years-this-wednesday", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FasZ27BnUtAKBFpoFfHLhV-1200-80.jpg", "publishedAt": "2025-03-24T17:51:59Z", "content": "A \"potentially hazardous\" pyramid-size asteroid\r\n is about to zoom past Earth at around 48,000 mph (77,300 km/h) this week as it reaches its closest point to our planet in more than 100 years. But th… [+3530 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Invites Media to SpaceX’s 32nd Resupply Launch to Space Station - NASA", "description": "NASA and SpaceX are targeting no earlier than Monday, April 21, to launch the SpaceX Dragon spacecraft on the company’s Falcon 9 rocket from Launch Complex", "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-spacexs-32nd-resupply-launch-to-space-station/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/ksc-20241104-ph-spx01-0001large.jpg", "publishedAt": "2025-03-24T17:34:47Z", "content": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station.\r\nNASA and SpaceX are targeting no earlier than Mond… [+2719 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Three Hundred Years Later, a Tool from Isaac Newton Gets an Update - Quanta Magazine", "description": "A simple, widely used mathematical technique can finally be applied to boundlessly complex problems.", "url": "https://www.quantamagazine.org/three-hundred-years-later-a-tool-from-isaac-newton-gets-an-update-20250324/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-Social.jpg", "publishedAt": "2025-03-24T17:34:22Z", "content": "Every day, researchers search for optimal solutions. They might want to figure out where to build a major airline hub. Or to determine how to maximize return while minimizing risk in an investment po… [+10881 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Katherine Bryant, Rogier Mars", "title": "What makes the human brain unique? We compared it with monkeys and apes to find out - The Conversation Indonesia", "description": "Advances in technology are making it easier to explore this question.", "url": "https://theconversation.com/what-makes-the-human-brain-unique-we-compared-it-with-monkeys-and-apes-to-find-out-252331", "urlToImage": "https://images.theconversation.com/files/657157/original/file-20250324-68-hionxf.jpg?ixlib=rb-4.1.0&rect=0%2C377%2C9000%2C4500&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-03-24T17:31:02Z", "content": "Scientists have long tried to understand the human brain by comparing it to other primates. Researchers are still trying to understand what makes our brain different to our closest relatives. Our rec… [+5310 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Prehistoric Fish Was Declared Extinct for 60 Million Years— And It’s Still Alive Today - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists were stunned when a bizarre ancient fish, thought to have vanished with the dinosaurs, suddenly reappeared. Its survival challenges everything we thought we knew about extinction.", "url": "https://dailygalaxy.com/2025/03/fish-extinct-60-million-years-still-alive/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/This-Prehistoric-Fish-Was-Declared-Extinct-for-60-Million-Years—-And-Its-Still-Alive-Today.jpg", "publishedAt": "2025-03-24T17:30:00Z", "content": "For decades, the coelacanthexisted only in fossil recordsuntil one turned up in a South African fishing net. It was 1938 when a museum curator in East London noticed an unfamiliar fish in a haul from… [+2845 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Is Firing Rockets Into the Northern Lights - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s Launching 3 Rockets Into the Aurora — What They Might Discover Could Rewrite Space Weather Science", "url": "https://dailygalaxy.com/2025/03/nasa-firing-rockets-northern-lights/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/NASA-Is-Firing-Rockets-Into-the-Northern-Lights.jpg", "publishedAt": "2025-03-24T16:30:00Z", "content": "In a mission designed to challenge longstanding theories about the upper atmosphere, NASA is preparing to launch three sounding rockets from the Poker Flat Research Range in Fairbanks, Alaska. \r\nThe … [+3051 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kevin Stacey", "title": "Updated physical model helps reconstruct sudden, dramatic sea level rise after last ice age - Phys.org", "description": "Around 14,500 years ago, toward the end of the last ice age, melting continental ice sheets drove a sudden and cataclysmic sea level rise of up to 65 feet in just 500 years or less. Despite the scale of the event, known as Meltwater Pulse 1a, scientists still…", "url": "https://phys.org/news/2025-03-physical-reconstruct-sudden-sea-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-research-helps-rec.jpg", "publishedAt": "2025-03-24T16:18:05Z", "content": "Around 14,500 years ago, toward the end of the last ice age, melting continental ice sheets drove a sudden and cataclysmic sea level rise of up to 65 feet in just 500 years or less. Despite the scale… [+6042 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "DNA study reveals modern humans evolved from two ancient groups - The Brighter Side of News", "description": "Genetic research uncovers two ancestral groups merging 300,000 years ago, reshaping our understanding of human evolution.", "url": "https://www.thebrighterside.news/post/dna-study-reveals-modern-humans-evolved-from-two-ancient-groups/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/03/cobraa-main.webp?auto=webp", "publishedAt": "2025-03-24T16:07:00Z", "content": "Scientists have long debated how modern humans evolved. For decades, most researchers agreed that Homo sapiens came from one ancestral group in Africa, dating back 200,000 to 300,000 years. \r\nBut new… [+6725 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Chicken Embryos Grow Dinosaur-like Feathers After Gene Switch - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have triggered ancient traits in chicken embryos, causing them to grow dinosaur-like feathers. But what happened next surprised even the researchers—hinting at evolution’s hidden backup plans.", "url": "https://dailygalaxy.com/2025/03/chicken-embryos-dinosaur-gene-switch/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Chicken-Embryos-Grow-Dinosaur-like-Feathers-After-Gene-Switch.jpg", "publishedAt": "2025-03-24T16:00:00Z", "content": "Feathers may define birds today, but their story began millions of years ago in creatures that looked very different from modern avians. A new study has just pushed the boundary of evolutionary biolo… [+3214 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Norbert Junkes", "title": "Event Horizon Telescope allows close study of accelerating jets from black holes - Phys.org", "description": "An international team of researchers used multi-wavelength observations of active galactic nuclei to study how black holes launch relativistic jets. The sixteen sources were observed with the Event Horizon Telescope during its first campaign in 2017. The extr…", "url": "https://phys.org/news/2025-03-event-horizon-telescope-jets-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/accelerating-jets-from.jpg", "publishedAt": "2025-03-24T15:12:04Z", "content": "An international team of researchers used multi-wavelength observations of active galactic nuclei to study how black holes launch relativistic jets. The sixteen sources were observed with the Event H… [+6816 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious 'Death Star' on The Verge of Exploding Is Hiding a Secret - ScienceAlert", "description": "Thousands of light-years from Earth, the dramatic death throes of a giant star are playing out.", "url": "https://www.sciencealert.com/mysterious-death-star-on-the-verge-of-exploding-is-hiding-a-secret", "urlToImage": "https://www.sciencealert.com/images/2025/03/wr-104.jpg", "publishedAt": "2025-03-24T15:02:35Z", "content": "Thousands of light-years from Earth, the dramatic death throes of a giant star are playing out.\r\nIt's part of a star system called Wolf-Rayet 104 (WR 104), also known famously as the Pinwheel Nebula.… [+4777 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Captured the Stunning Process That Shapes Chromosomes - SciTechDaily", "description": "Scientists at EMBL have captured how human chromosomes fold into their signature rod shape during cell division, using a groundbreaking method called LoopTrace. By observing overlapping DNA loops forming in high resolution, they revealed that large loops form…", "url": "https://scitechdaily.com/scientists-just-captured-the-stunning-process-that-shapes-chromosomes/", "urlToImage": "https://scitechdaily.com/images/Cell-Division-Illustration.jpg", "publishedAt": "2025-03-24T15:00:23Z", "content": "By using a new imaging method, EMBL scientists observed DNA folding in real time, uncovering how loops stack to create rod-shaped chromosomes during cell division.\r\nScientists at EMBL have captured h… [+7483 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Private SpaceX Fram2 mission ready for world's 1st crewed flight over Earth's polar regions (photos) - Space.com", "description": "SpaceX will launch the first crewed mission orbit over the North and South Poles no earlier than March 31.", "url": "https://www.space.com/space-exploration/missions/private-spacex-fram2-mission-ready-for-worlds-1st-crewed-flight-over-earths-polar-regions-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LVzSbUS4buvwG2txPD8zVX-1200-80.jpg", "publishedAt": "2025-03-24T14:58:36Z", "content": "SpaceX's mission to launch the first astronauts into polar orbit is quickly approaching.\r\nNamed for the Norwegian seafaring ship Fram, which completed expeditions of the Arctic and Antarctic regions … [+3211 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Drake Passage: The Most Treacherous Ocean Crossing Where Waves Reach 80 Feet - The Daily Galaxy --Great Discoveries Channel", "description": "The Drake Passage, located between the southern tip of South America and the West Antarctic Peninsula, is known for being one of the most dangerous stretches", "url": "https://dailygalaxy.com/2025/03/drake-passage-the-most-dreaded-bit-of-ocean-on-the-globe-where-waves-reach-up-to-80-feet/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/The-Drake-Passage-–-Worlds-Most-Dangerous-Ocean-Crossing-Where-Waves-Soar-to-80-Feet.jpg", "publishedAt": "2025-03-24T14:40:00Z", "content": "The Drake Passage, located between the southern tip of South America and the West Antarctic Peninsula, is known for being one of the most dangerous stretches of ocean on Earth. With waves reaching up… [+3225 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Gorgeous Hubble telescope image was 20 years in the making: Space photo of the day - Space.com", "description": "The Hubble Space Telescope captured an image of a star and a spiral galaxy, both in the constellation Virgo. But the photo is an optical illusion.", "url": "https://www.space.com/space-exploration/hubble-space-telescope/gorgeous-hubble-telescope-image-was-20-years-in-the-making-space-photo-of-the-day", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PRkaAXuZgK3SxokyT9rE9E-1200-80.jpg", "publishedAt": "2025-03-24T14:32:49Z", "content": "This Hubble Space Telescope image of NGC 4900 appears to show a bright star overlapping the spiral galaxy. But while both celestial objects appear to be in the constellation Virgo as viewed from Eart… [+2815 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": "Rick Neale, Florida Today", "title": "321 Launch: Space news you may have missed over the past week (March 24) - Yahoo", "description": "321 Launch: Space news you may have missed over the past week (March 24)", "url": "https://www.floridatoday.com/story/tech/science/space/2025/03/24/321-launch-space-news-you-may-have-missed-over-the-past-week-march-24/82634220007/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5NkV.3fgxRRGWW_k2LhNTw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NzE-/https://media.zenfs.com/en/florida-today/b36c910e43295b81035bef8b9f1b2d31", "publishedAt": "2025-03-24T14:04:53Z", "content": "SpaceX rocket launch, Boeing Starliner astronaut splashdown scheduled for Tuesday afternoon\r\nA SpaceX Starlink rocket launch from Cape Canaveral and the splashdown return-to-Earth of Boeing Starliner… [+6299 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Abbey A. Donaldson", "title": "NASA’s SpaceX Crew-9 Astronauts to Discuss Science Mission - NASA", "description": "After completing a long-duration stay aboard the International Space Station, NASA’s SpaceX Crew-9 astronauts will discuss their science mission during a", "url": "https://www.nasa.gov/news-release/nasas-spacex-crew-9-astronauts-to-discuss-science-mission/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/54394869292-9cc1f8ca6c-k.jpg", "publishedAt": "2025-03-24T14:04:36Z", "content": "After completing a long-duration stay aboard the International Space Station, NASAs SpaceX Crew-9 astronauts will discuss their science mission during a postflight news conference at 2:30 p.m. EDT Mo… [+3662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Might the proton decay in other places or at other times? - Phys.org", "description": "Does the proton decay? While this was a famous prediction of Grand Unified Theories (GUTS) developed in the 1970s and 1980s, experimentalists have ruled it out—or rather, put lower limits on its mean lifetime of about 1034 years. That's 20 orders of magnitude…", "url": "https://phys.org/news/2025-03-proton-decay.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/might-the-proton-decay.jpg", "publishedAt": "2025-03-24T14:00:03Z", "content": "Does the proton decay? While this was a famous prediction of Grand Unified Theories (GUTS) developed in the 1970s and 1980s, experimentalists have ruled it outor rather, put lower limits on its mean … [+5698 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jackson K Njau", "title": "1.5 million-year-old bone tools discovered in Tanzania rewrite the history of human evolution - The Conversation", "description": "By 1.5 million years ago, Homo erectus was able to transfer tool-making skills from stone to bone.", "url": "https://theconversation.com/1-5-million-year-old-bone-tools-discovered-in-tanzania-rewrite-the-history-of-human-evolution-251826", "urlToImage": "https://images.theconversation.com/files/654350/original/file-20250311-56-t75tk1.jpg?ixlib=rb-4.1.0&rect=15%2C81%2C1039%2C518&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-03-24T13:24:41Z", "content": "The ancestors of humans started making tools about 3.3 million years ago. First they made them out of stone, then they switched to bone as a raw material. Until recently, the earliest clear evidence … [+5404 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious Golden Orb Found at The Bottom of The Ocean - ScienceAlert", "description": "At around 3,300 meters (2 miles) below the surface of the ocean off the coast of Alaska, where the warm light of the Sun never penetrates, an NOAA Ocean Exploration remotely operated underwater vehicle came across a strange, golden orb.", "url": "https://www.sciencealert.com/mysterious-golden-orb-found-at-the-bottom-of-the-ocean", "urlToImage": "https://www.sciencealert.com/images/2023/09/golden-orb-header.jpg", "publishedAt": "2025-03-24T13:01:19Z", "content": "At around 3,300 meters (2 miles) below the surface of the ocean off the coast of Alaska, where the warm light of the Sun never penetrates, an NOAA Ocean Exploration remotely operated underwater vehic… [+3131 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Jackie Appel", "title": "A Shocking Discovery Shows Dark Energy Is Weakening—and We Might Be Wrong About How the Universe Ends - Yahoo", "description": "Well… not everything. But also, not not everything", "url": "https://www.popularmechanics.com/space/deep-space/a64245003/desi-dark-energy/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7V.CbNRyeGvk9dsvHsd9uQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/4ee85aeea23aeb669b34dfef17a7c02e", "publishedAt": "2025-03-24T13:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>The Dark Energy Spectroscopic Instrument (DESI) collaboration just dropped their first official… [+7515 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "“We Can Finally See the Very First Moment”: Scientists Capture the Birth of the Universe with Unprecedented Precision - The Daily Galaxy --Great Discoveries Channel", "description": "The ACT telescope has been a key player in these breakthroughs, capturing incredibly detailed images of the universe’s earliest structures.", "url": "https://dailygalaxy.com/2025/03/we-can-finally-see-the-very-first-moment-scientists-capture-the-birth-of-the-universe-with-unprecedented-precision/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/the-new-half-sky-image-from-the-Atacama-Cosmology-Telescope.jpg", "publishedAt": "2025-03-24T12:00:00Z", "content": "In a major breakthrough for cosmology, scientists have captured an image that reveals the universes earliest moments with remarkable precision. Thanks to advanced telescopes, particularly the Atacama… [+3145 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rick Kazmer", "title": "Scientists mystified by alarming changes to lakes at the 'roof of the world' — and they're racing to understand the consequences - Yahoo", "description": "It stands in stark contrast to observations elsewhere on the planet.", "url": "https://www.yahoo.com/news/scientists-mystified-alarming-changes-lakes-110047767.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sAKawMpfOASdvn04ZTc1hQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/the_cool_down_737/eb4664433537409ef530944e727e24c9", "publishedAt": "2025-03-24T11:00:47Z", "content": "An interesting phenomenon is unfolding at the top of the world. Lakes on the Tibetan Plateau sitting at more than 14,700 feet above sea level are refilling, bucking lake-drying trends elsewhere on th… [+3518 chars]"}, {"source": {"id": null, "name": "Usgs.gov"}, "author": null, "title": "Ash plume heights, hazards, and ashfall projections, oh my! What do volcanologists learn from ashfall maps? - United States Geological Survey", "description": "How do volcanologists determine the height of eruptive plumes from Yellowstone’s past explosive eruptions? Ironically, you have to dig into the ground to get the answer.", "url": "https://www.usgs.gov/observatories/yvo/news/ash-plume-heights-hazards-and-ashfall-projections-oh-my-what-do", "urlToImage": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/styles/teaser/public/media/images/Wilson_Basin_Wyoming.jpg?itok=VFFtxXnz", "publishedAt": "2025-03-24T10:07:06Z", "content": "Yellowstone Caldera Chronicles is a weekly column written by scientists and collaborators of the Yellowstone Volcano Observatory. This week's contribution is from Dr. Madison Myers, Associate Profess… [+5941 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Euclid 'dark universe detective' spacecraft discovers 2,674 new dwarf galaxies - Space.com", "description": "\"This work highlights Euclid’s remarkable ability to detect and characterize dwarf galaxies, enabling a comprehensive view of galaxy formation and evolution across diverse mass scales, distances, and environments.\"", "url": "https://www.space.com/the-universe/euclid-dark-universe-detective-spacecraft-discovers-2-674-new-dwarf-galaxies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/L5FpuXtLHDDJtoBPUgcZ7X-1200-80.png", "publishedAt": "2025-03-24T10:00:00Z", "content": "The latest wide-scale analysis of data from the Euclid Space Telescope has demonstrated just how big of an impact this European Space Agency (ESA) spacecraft is set to have on science. Importantly, i… [+4218 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Black holes may obey the laws of physics after all, new theory suggests - Space.com", "description": "\"The singularity is the most mysterious and problematic part of a black hole. It's where our concepts of space and time literally no longer make sense.\"", "url": "https://www.space.com/the-universe/black-holes/black-holes-may-obey-the-laws-of-physics-after-all-new-theory-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rMKRkQMGhfEeiUBrMCSTzB-1200-80.png", "publishedAt": "2025-03-24T09:00:00Z", "content": "A team of scientists has developed a recipe for black holes that eliminates one of the most troubling aspects of physics: the central singularity, the point at which all our theories, laws and models… [+9338 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Extreme 'Feast And Famine' Cycle Sparked Explosion of Life on Earth - ScienceAlert", "description": "Imagine a world where the oxygen you need changes dramatically between day and night.", "url": "https://www.sciencealert.com/extreme-feast-and-famine-cycle-sparked-explosion-of-life-on-earth", "urlToImage": "https://www.sciencealert.com/images/2022/12/IllustrationOfBrightOrangeVolcanoEruptionUnderwater.jpg", "publishedAt": "2025-03-24T02:56:13Z", "content": "Imagine a world where the oxygen you need changes dramatically between day and night.\r\nYour world shifts from being rich in oxygen (oxic) in the day, so you have energy to hunt for food, to suffocati… [+6099 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Scientist Who Discovered 'Dark Oxygen' Ignored It For Years. Here's Why. - ScienceAlert", "description": "Children are always asking \"Why?\" As they experience things for the first time, it's natural to want to find out more.", "url": "https://www.sciencealert.com/scientist-who-discovered-dark-oxygen-ignored-it-for-years-heres-why", "urlToImage": "https://www.sciencealert.com/images/2025/03/dark_oxygen_debate_header.jpg", "publishedAt": "2025-03-24T02:30:25Z", "content": "Children are always asking \"Why?\" As they experience things for the first time, it's natural to want to find out more. But as children grow into adults, they often dismiss something new that challeng… [+4658 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Speed of quantum entanglement is measured, but it's too fast for humans to understand - Earth.com", "description": "Even when particles seem to shift in the blink of an eye, as with quantum entanglement, there are measurable intervals involved.", "url": "https://www.earth.com/news/quantum-entanglement-speed-is-measured-first-time-too-fast-for-humans-minds/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/22120305/quantum-entanglement_speed-measured_first-time_attoseconds_1m.jpg", "publishedAt": "2025-03-22T18:24:37Z", "content": "In the past, events that took place in a flash were considered instantaneous. Yet modern experiments show that even when particles seem to shift in the blink of an eye, as with quantum entanglement, … [+5914 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou", "title": "NASA websites no longer promote ‘first woman’ on the moon for Artemis - Orlando Sentinel", "description": "NASA websites have dropped references to landing the first woman on the moon as part of the goals for its Artemis program.", "url": "https://www.orlandosentinel.com/2025/03/21/nasa-websites-no-longer-promoting-first-woman-on-the-moon-for-artemis/", "urlToImage": "https://www.orlandosentinel.com/wp-content/uploads/2024/01/tos-l-orion-media-day0757-2.jpg?w=1024&h=683", "publishedAt": "2025-03-21T19:18:45Z", "content": "NASA websites have dropped references to landing the first woman on the moon as part of the goals for its Artemis program.\r\nUpdated pages as of Friday for the program no longer feature the statement:… [+4410 chars]"}]}