{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Create “Extraordinary” Mouse Using Gene Older Than Animal Life Itself - SciTechDaily", "description": "New research unveils the evolutionary origins of stem cells through a groundbreaking experiment that successfully created a mouse using ancient genetic tools. Published in Nature Communications, an international team of researchers has achieved a groundbreaki…", "url": "https://scitechdaily.com/?p=434330", "urlToImage": "https://scitechdaily.com/images/Scientists-Recreate-Mouse-From-Gene-Older-Than-Animal-Life-scaled.jpg", "publishedAt": "2024-11-20T03:22:03Z", "content": "The mouse on the left is a chimeric with dark eyes and patches of black fur, a result of stem cells derived from a choanoflagellate Sox gene. The wildtype mouse on the right has red eyes and all whit… [+4975 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "The space station just had to pull a maneuver to avoid space debris - Digital Trends", "description": "The space station had to undergo another repositioning maneuver to move it out of the way of approaching space debris, NASA announced.", "url": "https://www.digitaltrends.com/space/space-station-avoidance-maneuver/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/12/iss-25.jpeg?resize=1200%2C630&p=1", "publishedAt": "2024-11-20T02:00:36Z", "content": "The International Space Station (ISS) was repositioned on Tuesday, November 19, to move it well out of the way of approaching space debris, NASA reported.\r\nStation operators fired the thrusters on th… [+1691 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ADITHI RAMAKRISHNAN", "title": "The dark energy pushing our universe apart may not be what it seems, scientists say - The Associated Press", "description": "Distant, ancient galaxies are giving scientists more hints that a mysterious force called dark energy may not be what they thought. Astronomers know the universe is expanding at an accelerating rate and they have long thought that a constant force called dark…", "url": "https://apnews.com/article/dark-energy-desi-cosmology-astronomy-7856ae96fab5cb42e6b4a6fd7c3555ec", "urlToImage": "https://dims.apnews.com/dims4/default/fbf5071/2147483647/strip/true/crop/6960x3915+0+363/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F38%2Ffbc6c077a6b4dfd46ed14acc93b5%2F7799fbb7eb194b74a17d4d7f484fa936", "publishedAt": "2024-11-20T01:13:00Z", "content": "NEW YORK (AP) Distant, ancient galaxies are giving scientists more hints that a mysterious force called dark energy may not be what they thought.\r\nAstronomers know that the universe is being pushed a… [+3802 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Mind-blowing' dark energy instrument results show Einstein was right about gravity — again - Space.com", "description": "\"Studying the rate at which galaxies formed lets us directly test our theories and, so far, we’re lining up with what general relativity predicts at cosmological scales.\"", "url": "https://www.space.com/desi-einstein-gravity-dark-energy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/q5gWeFvQRDqThzoaNwaXSg-1200-80.png", "publishedAt": "2024-11-20T01:02:04Z", "content": "General relativity has passed one of its most precise tests ever thanks to observations of the past 11 billion years of cosmic evolution collected by the Dark Energy Spectroscopic Instrument, or DESI… [+6442 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Texas at Austin", "title": "Enormous cache of rare earth elements hidden inside coal ash waste, study suggests - Phys.org", "description": "Coal ash—the chalky remnants of coal that has been burned for fuel—has been piling up across the United States for decades. But new research led by The University of Texas at Austin has found that the national coal ash supply contains enough rare earth elemen…", "url": "https://phys.org/news/2024-11-enormous-cache-rare-earth-elements.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/enormous-cache-of-rare.jpg", "publishedAt": "2024-11-19T22:40:04Z", "content": "Coal ashthe chalky remnants of coal that has been burned for fuelhas been piling up across the United States for decades. But new research led by The University of Texas at Austin has found that the … [+5773 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Models Reveal How We Process Life’s Small Surprises - Neuroscience News", "description": "Researchers trained computer models to predict everyday events, revealing that responding to uncertainty, rather than just prediction errors, improved understanding.", "url": "https://neurosciencenews.com/neuroscience-memory-surprises-28084/", "urlToImage": "https://neurosciencenews.com/files/2024/11/surprises-memory-neurosceince.jpg", "publishedAt": "2024-11-19T22:27:11Z", "content": "Summary: Researchers trained computer models to predict everyday events, revealing that responding to uncertainty, rather than just prediction errors, improved understanding. This challenges the idea… [+8051 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Life on Mars Found—Then Killed? Scientist Warns of Fatal NASA Error - The Daily Galaxy --Great Discoveries Channel", "description": "Could NASA's Viking missions have wiped out life on Mars before we even knew it existed? A startling theory suggests that our search for Martian life may have drowned it in the process.", "url": "https://dailygalaxy.com/2024/11/life-on-mars-found-then-killed-scientist-warns-of-fatal-nasa-error/", "urlToImage": "https://bunny-wp-pullzone-eduayjtzy5.b-cdn.net/wp-content/uploads/2024/11/Mars-Rover-Vehicle.jpg", "publishedAt": "2024-11-19T22:16:10Z", "content": "Could we have already found life on Marsand accidentally destroyed it in the process? A jaw-dropping theory from a leading scientist suggests that NASAs search for extraterrestrial life may have back… [+2250 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mystery Solved: Magnetars in Massive Galaxies Behind Cosmic Radio Flashes - SciTechDaily", "description": "Researchers have linked the origins of fast radio bursts to magnetars, highly magnetized neutron stars, which often arise from the mergers of massive stars in star-forming galaxies. By utilizing the Deep Synoptic Array-110, they've localized 70 FRBs, discover…", "url": "https://scitechdaily.com/mystery-solved-magnetars-in-massive-galaxies-behind-cosmic-radio-flashes/", "urlToImage": "https://scitechdaily.com/images/Magnetar-FRB-Art-Concept.jpg", "publishedAt": "2024-11-19T21:49:46Z", "content": "Fast radio bursts are linked to massive, metal-rich galaxies, hinting at their origins in magnetars formed from stellar mergers.\r\nResearchers have linked the origins of fast radio bursts to magnetars… [+6905 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Plans to Assign Missions for Two Future Artemis Cargo Landers - NASA", "description": "NASA, along with its industry and international partners, is preparing for sustained exploration of the lunar surface with the Artemis campaign to advance", "url": "https://www.nasa.gov/news-release/nasa-plans-to-assign-missions-for-two-future-artemis-cargo-landers/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/11/human-lunar-landing-systems-cargo-variants-conceptual-renderings.jpg", "publishedAt": "2024-11-19T21:07:25Z", "content": "NASA, along with its industry and international partners, is preparing for sustained exploration of the lunar surface with the Artemis campaign to advance science and discovery for the benefit of all… [+3182 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Limerick", "title": "New method of generating eco-friendly energy uses piezoelectricity - Phys.org", "description": "Researchers at University of Limerick in Ireland have developed a new method of growing organic crystals that can be used for energy-harvesting applications.", "url": "https://phys.org/news/2024-11-method-generating-eco-friendly-energy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/crystals.jpg", "publishedAt": "2024-11-19T20:56:13Z", "content": "Researchers at University of Limerick in Ireland have developed a new method of growing organic crystals that can be used for energy-harvesting applications.\r\nThe energy that is being harvested as pa… [+3339 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Single Cells Exhibit Learning Behaviors - Neuroscience News", "description": "A new study suggests that individual cells may exhibit learning-like behaviors, previously thought exclusive to organisms with nervous systems.", "url": "https://neurosciencenews.com/cell-learning-genetics-28081/", "urlToImage": "https://neurosciencenews.com/files/2024/11/cell-learning-nneurosceince.jpg", "publishedAt": "2024-11-19T20:35:27Z", "content": "Summary: A new study suggests that individual cells may exhibit learning-like behaviors, previously thought exclusive to organisms with nervous systems. Researchers used computational modeling to sho… [+8884 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Andrea Guzmán", "title": "Study: SpaceX's Starship could cause structural damage in Texas - Chron", "description": "Researchers at Brigham Young University found that one Starship launch produces loud noises that could cause glass to break and other damage.", "url": "https://www.chron.com/culture/article/spacex-starship-noise-study-19928851.php", "urlToImage": "https://s.hdnux.com/photos/01/46/07/66/26770837/3/rawImage.jpg", "publishedAt": "2024-11-19T20:18:07Z", "content": "The SpaceX Starship sits on the launch pad ahead of its sixth flight test from Starbase in Boca Chica, Texas, on November 17, 2024. \r\nChandan Khanna/AFP via Getty Images\r\nSouth Texans have spoken out… [+4337 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Riley Black", "title": "The world’s first saber-toothed cat mummy has been found in Siberia - National Geographic", "description": "This remarkably well-preserved cub could help scientists answer questions about sabertooth anatomy, hunting, and even coat color.", "url": "https://www.nationalgeographic.com/science/article/sabertooth-cat-mummy-first-cub", "urlToImage": "https://i.natgeofe.com/n/06c8aa76-3a9e-4d9d-8888-514258128669/Fig-2NG.1_16x9.jpg?w=1200", "publishedAt": "2024-11-19T19:55:03Z", "content": "The frozen cub not only provides the first look at what a saber-toothed cat looked like in real life, Reynolds notes, but also represents a life stage that paleontologists know less about, as most fo… [+2096 chars]"}, {"source": {"id": null, "name": "kottke.org"}, "author": null, "title": "Purple Isn’t Real - kottke.org", "description": "So we all know the color purple has always been associated with royalty because the dye used to make it was extremely limited beca", "url": "https://kottke.org/24/11/purple-isnt-real", "urlToImage": "", "publishedAt": "2024-11-19T19:32:58Z", "content": "×Hello! In order to leave a comment, you need to be a current kottke.org member. If you'd like to sign up for a membership to support the site and join the conversation, you can explore your options … [+394 chars]"}, {"source": {"id": null, "name": "syracuse.com"}, "author": "Steve Billmyer | sbillmyer@syracuse.com", "title": "Driver who caused horrific fatal crash in Clay suffered a medical episode, troopers say - syracuse.com", "description": "Autopsy reveals the driver suffered extensive heart disease, troopers said.", "url": "https://www.syracuse.com/crime/2024/11/driver-who-caused-horrific-fatal-crash-in-clay-suffered-a-medical-episode-troopers-say.html", "urlToImage": "https://www.syracuse.com/resizer/v2/4R6R33XMIZGM7AYQKHFAJADAPU.jpg?auth=9bde151f00ce2d45e6ca8bb71a3719e62e54e9e4e7adc4d7e402e5ce4fed1eef&width=1280&quality=90", "publishedAt": "2024-11-19T19:16:00Z", "content": "Syracuse, N.Y. A man who drove at a high speed through a red light in Clay last month, colliding with another car, killing himself and another person, suffered a medical episode prior to the crash, t… [+1115 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "James Webb telescope uncovers 1st-ever 'Einstein zig-zag' hiding in plain sight — and it could help save cosmology - Livescience.com", "description": "A new JWST study has revealed the true origins of a luminous quasar that has been duplicated six times as its light \"zig-zags\" through space-time via a phenomenon first predicted by Albert Einstein. The unusual light show could help tackle one of cosmology's …", "url": "https://www.livescience.com/space/cosmology/james-webb-telescope-uncovers-1st-ever-einstein-zig-zag-hiding-in-plain-sight-and-it-could-help-save-cosmology", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bLszkyWHj6Cra28CvxxgNe-1200-80.jpg", "publishedAt": "2024-11-19T18:58:57Z", "content": "For the first time, researchers have used data from the James Webb Space Telescope\r\n (JWST) to uncover an example of a previously hypothetical phenomenon known as an \"Einstein zig-zag\" — where light … [+5622 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Hunter-Gatherer Kids Learn Lifelong Skills by Age Six - Neuroscience News", "description": "Hunter-gatherer children in the Congo Basin learn critical skills like hunting, gathering, and childcare by age six or seven, thanks to a unique social learning environment.", "url": "https://neurosciencenews.com/culture-environment-learning-28078/", "urlToImage": "https://neurosciencenews.com/files/2024/11/learning.jpg", "publishedAt": "2024-11-19T18:55:22Z", "content": "Summary: Hunter-gatherer children in the Congo Basin learn critical skills like hunting, gathering, and childcare by age six or seven, thanks to a unique social learning environment. Unlike Western s… [+7116 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Geminid meteor shower begins tonight. Here's what to expect from one of the best meteor showers of the year - Space.com", "description": "The Geminids are regarded to be one of the most reliable meteor showers each year.", "url": "https://www.space.com/stargazing/meteors-showers/geminid-meteor-shower-begins-tonight-heres-what-to-expect-from-one-of-the-best-meteor-showers-of-the-year", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fR4EppA9bPpxf8Nvncuh2D-1200-80.jpg", "publishedAt": "2024-11-19T18:00:00Z", "content": "One of the most reliable meteor showers to light up our night sky each year begins tonight.\r\nThe annual Geminid meteor shower runs from Nov. 19 through Dec. 24, with the peak coming overnight on Dec.… [+4148 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Adam Frank", "title": "The pre-life puzzle: Tracing the rise of complexity in a lifeless world - Big Think", "description": "We need a \"theory that explains the evolution of evolution,\" argues theoretical physicist Sara Imari Walker.", "url": "https://bigthink.com/13-8/the-pre-life-puzzle-tracing-the-rise-of-complexity-in-a-lifeless-world/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/11/Sara-walker-pt-2_compressed.jpg?resize=1200,630", "publishedAt": "2024-11-19T17:42:54Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "New Roadmap Sets the Stage for Nuclear-Powered Spacecraft by the 2030s - Gizmodo", "description": "Space agencies and companies are pinning their hopes for spaceflight's future on nuclear electric propulsion.", "url": "https://gizmodo.com/new-roadmap-sets-the-stage-for-nuclear-powered-spacecraft-by-the-2030s-2000526338", "urlToImage": "https://gizmodo.com/app/uploads/2024/11/nuclear-space-tug.jpg", "publishedAt": "2024-11-19T17:35:24Z", "content": "A consortium of companies just completed its initial foray into an 11-year project that could put the first nuclear-powered space tug into space. The project is called RocketRoll, and it paves the wa… [+4452 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Physicists Shed Light on Precise Shape of Single Photon - Sci.News", "description": "New research from the University of Birmingham explores the nature of photons -- individual particles of light -- in unprecedented detail.", "url": "https://www.sci.news/physics/photon-shape-13438.html", "urlToImage": "https://cdn.sci.news/images/2024/11/image_13438f-Photon.jpg", "publishedAt": "2024-11-19T17:07:14Z", "content": "New research from the University of Birmingham explores the nature of photons — individual particles of light — in unprecedented detail.\r\nBen Yuen &amp; Angela Demetriadou define the precise shape of… [+2642 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "SpaceX Starlink satellites seen as ‘wonky streaks’ by ISS astronaut (photos) - Space.com", "description": "\"Starlink satellites look like a miniature version of the monolith from '2001: A Space Odyssey.' \"", "url": "https://www.space.com/space-exploration/international-space-station/spacex-starlink-satellites-seen-as-wonky-streaks-by-iss-astronaut-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6sCuXGh7kNbPUuiWUQbgCa-1200-80.jpg", "publishedAt": "2024-11-19T17:00:00Z", "content": "A veteran NASA astronaut caught SpaceX satellites in action from the space station.\r\nNASA astronaut Don Pettit snapped shots of some SpaceX Starlink satellites from the International Space Station (I… [+2262 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Woman accidentally discovers 280 million-year-old lost world while hiking in Italian Alps - Livescience.com", "description": "Stunningly preserved fossils of reptilian footprints and underbellies discovered last year in the Italian Alps have helped researchers unearth a tropical lakeside ecosystem that predates dinosaurs.", "url": "https://www.livescience.com/planet-earth/fossils/woman-accidentally-discovers-280-million-year-old-lost-world-while-hiking-in-italian-alps", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZZVUwpHmnZ98khVohtPQdQ-1200-80.jpg", "publishedAt": "2024-11-19T16:56:03Z", "content": "A woman hiking in the Italian Alps discovered a fragment of a 280 million-year-old ecosystem, complete with footprints, plant fossils and even the imprints of raindrops, researchers have confirmed.\r\n… [+4276 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Sean Keach", "title": "Earth’s ‘second moon’ is about to vanish from skies and won’t be back until 2055 – exact time space rock wi... - The US Sun", "description": "A BUS-SIZED “mini moon” is in the final days of its trip to Earth’s skies – and will soon vanish until 2055. The holidaying asteroid turned up in Earth’s orbit on September …", "url": "https://www.the-sun.com/tech/12925949/earth-mini-moon-asteroid-2024-pt5-date-time/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2024/11/minimoon-op.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2024-11-19T15:55:56Z", "content": "A BUS-SIZED \"mini moon\" is in the final days of its trip to Earth's skies and will soon vanish until 2055.\r\nThe holidaying asteroid turned up in Earth's orbit on September 29 this year.\r\nThe so-calle… [+5866 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Paul Sutter", "title": "Emergent gravity may be a dead idea, but it’s not a bad one - Ars Technica", "description": "Gravity may not emerge, but some interesting ideas did.", "url": "https://arstechnica.com/science/2024/11/emergent-gravity-may-be-a-dead-idea-but-its-not-a-bad-one/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/01/bulletcluster_comp_f2048-1152x648.jpg", "publishedAt": "2024-11-19T15:19:31Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover ‘Jedi Rats’ Power: Moving Matter Without Touching It - The Daily Galaxy --Great Discoveries Channel", "description": "Can rats really move matter without touching it? New research reveals these rodents may have a hidden superpower in ways we never imagined. The truth behind this phenomenon is more astonishing than fiction.", "url": "https://dailygalaxy.com/2024/11/scientists-uncover-jedi-rats-power-moving-matter-without-touching-it/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/Photograph-of-a-Rat.jpg", "publishedAt": "2024-11-19T15:12:43Z", "content": "Could rats possess a power that seems ripped from science fiction? Researchers from Harvard University and the University at Buffalo have unveiled a startling phenomenon: these rodents appear capable… [+3668 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Satellite Photo Captures Sacred Volcano Surrounded by ‘Goblin Forest’ - PetaPixel", "description": "This volcano has human rights.", "url": "https://petapixel.com/2024/11/19/satellite-photo-captures-sacred-volcano-surrounded-by-goblin-forest/", "urlToImage": "https://petapixel.com/assets/uploads/2024/11/Volcano-1.jpg", "publishedAt": "2024-11-19T14:12:04Z", "content": "The satellite captured a perfectly dark green circle around Mount Taranaki which is known as the ‘Goblin Forest’.\r\nThe Landsat 8 satellite captured an exquisite image of the snow-capped Mount Taranak… [+2144 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Who Are These Hominins?” – Paleontologists Uncover Mysterious Butchering of 300,000 Year Old Elephant - SciTechDaily", "description": "The discovery of 300,000 to 400,000-year-old elephant fossils and stone tools in India provides evidence of early human butchery, highlighting significant early human activities and the presence of extinct elephants. In the late middle Pleistocene, approximat…", "url": "https://scitechdaily.com/who-are-these-hominins-paleontologists-uncover-mysterious-butchering-of-300000-year-old-elephant/", "urlToImage": "https://scitechdaily.com/images/Elephant-Skull-Excavated-From-Quarry-in-Kashmir.jpg", "publishedAt": "2024-11-19T14:08:18Z", "content": "The elephant skull was excavated from the quarry in Kashmir in 2000. Credit: Advait Jukar\r\nThe discovery of 300,000 to 400,000-year-old elephant fossils and stone tools in India provides evidence of … [+7206 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "For the First Time in Human History, the Global Water Cycle Is Out of Balance - The Daily Galaxy --Great Discoveries Channel", "description": "The Earth's water cycle, a complex system that distributes water across our planet, is experiencing an unprecedented imbalance. This disruption, caused by human activities and climate change, threatens global ecosystems and poses significant challenges for fu…", "url": "https://dailygalaxy.com/2024/11/for-the-first-time-in-human-history-the-global-water-cycle-is-out-of-balance/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/for-the-first-time-in-human-history-the-global-water-cycle-is-out-of-balance.jpg", "publishedAt": "2024-11-19T13:00:00Z", "content": "For the first time in human history, the delicate balance of the Earth’s water system has been thrown off kilter. The Global Commission on the Economics of Water recently released a landmark report h… [+3798 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Watch Mars and the Moon Align for a Dazzling Night Sky Spectacle - The Daily Galaxy --Great Discoveries Channel", "description": "The night sky this month brings an unmissable cosmic spectacle as two of the brightest celestial bodies come together in a rare and mesmerizing display. Visible to the naked eye, this stunning alignment offers a unique opportunity for stargazers to witness th…", "url": "https://dailygalaxy.com/2024/11/watch-mars-and-the-moon-align-for-a-dazzling-night-sky-spectacle/", "urlToImage": "https://bunny-wp-pullzone-eduayjtzy5.b-cdn.net/wp-content/uploads/2024/11/Watch-Mars-and-the-Moon-Align-for-a-Dazzling-Night-Sky-Spectacle.jpg", "publishedAt": "2024-11-19T12:00:00Z", "content": "This week, the night sky will dazzle stargazers with a rare cosmic alignment as Mars and the Moon come together for a striking celestial display. On Wednesday, November 20, Mars, often referred to as… [+3939 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Was There Water on Mars? Scientists Believe They’ve Found Evidence\" - The Daily Galaxy --Great Discoveries Channel", "description": "The Red Planet has long captivated scientists and space enthusiasts alike, with its rusty hues and mysterious past. Recent discoveries have reignited the debate about Mars' ancient environment, particularly the possibility of a vast ocean that once covered it…", "url": "https://dailygalaxy.com/2024/11/scientists-uncover-evidence-ancient-water-mars-new-findings-reveal-planets-wet-past/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/scientists-uncover-evidence-ancient-water-mars-new-findings-reveal-planets-wet-past.jpg", "publishedAt": "2024-11-19T12:00:00Z", "content": "A team of scientists has recently published groundbreaking findings in the journal Nature, suggesting that Mars was not always the arid, inhospitable world we see today. The study, based on data coll… [+4177 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Ellie Kemp", "title": "Asteroid worth $10,000,000,000,000,000,000 NASA is capturing would give everyone on Earth $1,246,105,919 each - UNILAD", "description": "A SpaceX rocket was launched to explore the 16 Psyche asteroid last month", "url": "https://www.unilad.com/technology/space/nasa-psyche-16-asteroid-mission-money-503039-20241119", "urlToImage": "https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/blt215c30203685142e/673c748fc2a38b7bd1a737f8/asteroid-worth-10-trillion-nasa-probing-would-make-us-all-billionaires.png", "publishedAt": "2024-11-19T11:36:44Z", "content": "An asteroid worth $10,000,000,000,000,000,000 could turn every single one of us into billionaires. Hypothetically. \r\nLast month, NASA sent a SpaceX Falcon Heavy rocket to go and probe 16 Psyche, one … [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Aakanksha Sharma", "title": "8 animals that have more than 2 eyes - The Times of India", "description": "Most living beings, humans and animals alike, have two eyes to see the world around them. And while some animals do have the special ability to see more than humans do, others take the ability up a notch by having more than 2 eyes! Here we mention some of the…", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/web-stories/8-animals-that-have-more-than-2-eyes/photostory/115447786.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-115447803,imgsize-1433063,width-900,height-1200,resizemode-6/115447803.jpg", "publishedAt": "2024-11-19T09:35:28Z", "content": "Leading the list of more than 2 eyes are Spiders. Most spiders have about eight eyes, two large eyes at the top, and then smaller ones below, in rows. Their eyes help them detect movement and light c… [+39 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "World First As Top Quarks Created In Collision Between Lead Atoms Observed - IFLScience", "description": "The detection was seen in an experiment recreating the conditions right after the Big Bang", "url": "https://www.iflscience.com/world-first-as-top-quarks-created-in-collision-between-lead-atoms-observed-76828", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76828/aImg/80286/top-meta.jpg", "publishedAt": "2024-11-19T07:21:50Z", "content": "The ATLAS collaboration at the Large Hadron Collider (LHC), the particle accelerator at CERN, has a big announcement: They have observed top quarks in the collision between lead ions for the very fir… [+2276 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2024-11-19T05:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "RochesterFirst"}, "author": "Eric Snitil", "title": "Winter Weather Week: Solar flare 25 explained - Yahoo! Voices", "description": "ROCHESTER, N.Y. (WROC) – Every 11 years the sun goes through a natural uptick in activity as its magnetic poles, like those that we have on earth at the...", "url": "https://www.rochesterfirst.com/weather/winter-weather-week-solar-flare-25-explained/", "urlToImage": "https://media.zenfs.com/en/wroc_rochester_articles_306/9b20eee5cfe4343d01df2881f7f2529a", "publishedAt": "2024-11-19T04:08:00Z", "content": "ROCHESTER, N.Y. (WROC) Every 11 years the sun goes through a natural uptick in activity as its magnetic poles, like those that we have on earth at the north and south poles, flip in orientation. Its … [+3449 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Discover Monster Galaxies Lurking in The Early Universe - ScienceAlert", "description": "In the early Universe, long before they should have had time to grow, astronomers have found what they're calling 'red monsters': three large galaxies, almost as big as the Milky Way.", "url": "https://www.sciencealert.com/scientists-discover-monster-galaxies-lurking-in-the-early-universe", "urlToImage": "https://www.sciencealert.com/images/2024/11/red-monsters.jpg", "publishedAt": "2024-11-19T03:17:24Z", "content": "In the early Universe, long before they should have had time to grow, astronomers have found what they're calling 'red monsters': three large galaxies, almost as big as the Milky Way.\r\nIt's a challen… [+4021 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Watch this stunning aurora unfold from 257 miles above Earth - Digital Trends", "description": "Stunning footage captured from the International Space Station shows a glorious-looking aurora shimmering above Earth.", "url": "https://www.digitaltrends.com/space/watch-this-stunning-aurora-captured-from-space/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2024/11/iss-aurora.jpg?resize=1200%2C630&p=1", "publishedAt": "2024-11-19T01:20:34Z", "content": "Stunning footage from the International Space Station (ISS) shows a glorious-looking aurora shimmering above our planet.\r\nCaptured last month and shared by the ISS on X over the weekend, the footage … [+1793 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "Mysterious Signal Preceded The Most Powerful Eruption of Modern Times - Yahoo! Voices", "description": "A seismic precursor we never knew about.", "url": "https://www.sciencealert.com/mysterious-signal-preceded-the-most-powerful-eruption-of-modern-times", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/b6aed27498645775a27b7f335460f5d3", "publishedAt": "2024-11-18T23:23:34Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nI… [+4186 chars]"}, {"source": {"id": null, "name": "THE CITY"}, "author": "Jonathan Custodio", "title": "Plan for City’s First Public Celestial Observatory Comes Crashing Down - THE CITY", "description": "The Amateur Astronomers Association said the city’s demands for its insurance coverage proved unworkable.", "url": "https://www.thecity.nyc/2024/11/18/jermone-park-observatory-crashesamateur-astronomy-association/", "urlToImage": "https://www.thecity.nyc/wp-content/uploads/2023/08/897baf5323b2ed298a6af9cf4a6c542f93c3-scaled.jpg", "publishedAt": "2024-11-18T23:18:31Z", "content": "Support local news today!\r\nOur nonprofit newsroom relies on readers like you to power investigations like these.\r\nJoin the community that powers NYC’s independent local news.\r\nA city known for produc… [+6262 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Confined Spaces Change How We Smell and Experience Food - Neuroscience News", "description": "Researchers found that confined environments, like the International Space Station, alter the way people perceive food aromas, with emotions significantly coloring their responses.", "url": "https://neurosciencenews.com/confined-spaces-taste-olfaction-28072/", "urlToImage": "https://neurosciencenews.com/files/2024/11/confined-space-olfaction-taste-neuroscience.jpg", "publishedAt": "2024-11-18T21:56:58Z", "content": "Summary: Researchers found that confined environments, like the International Space Station, alter the way people perceive food aromas, with emotions significantly coloring their responses. Using vir… [+5200 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: Hawaiian Volcano Showed Signs Two Months before Exploding - VOA Learning English", "description": "Scientists say they were able to identify signs that Hawaii’s Mauna Loa volcano might erupt about two months before it exploded. They hope their methods might one day be used to help government agencies predict future volcanic activity.", "url": "https://learningenglish.voanews.com/a/study-hawaiian-volcano-showed-signs-two-months-before-exploding/7865155.html", "urlToImage": "https://gdb.voanews.com/b4539f6a-c3a9-4e85-a076-3179d66cd507_cx0_cy4_cw0_w1200_r1.jpg", "publishedAt": "2024-11-18T21:55:00Z", "content": "Scientists say they were able to identify signs that Hawaiis Mauna Loa volcano might erupt about two months before it exploded.\r\nA new study explains the signs they discovered and how their method mi… [+3149 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "New Species of Triassic Marine Reptile Discovered - Sci.News", "description": "Paleontologists have described a new species of pachypleurosaur from the Middle Triassic of southwestern China.", "url": "https://www.sci.news/paleontology/dianmeisaurus-mutaensis-13434.html", "urlToImage": "https://cdn.sci.news/images/2023/01/image_11551f-Wumengosaurus.jpg", "publishedAt": "2024-11-18T21:47:24Z", "content": "Paleontologists have described a new species of pachypleurosaur from the Middle Triassic of southwestern China.\r\nThe holotype of Dianmeisaurus mutaensis from the Guanling Formation, China: (A) the sk… [+3362 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "International Space Station Leak: NASA Warns of Disastrous Failure - The Daily Galaxy --Great Discoveries Channel", "description": "A persistent air leak in the ISS has reached alarming levels, raising fears of a critical failure. With growing challenges and uncertain solutions, the station's future faces an unprecedented test. What’s behind the crisis—and can it be resolved in time?", "url": "https://dailygalaxy.com/2024/11/international-space-station-leak-nasa-warns-of-disastrous-failure/", "urlToImage": "https://bunny-wp-pullzone-eduayjtzy5.b-cdn.net/wp-content/uploads/2024/11/The-International-Space-Station-orbiting-the-Earth.jpg", "publishedAt": "2024-11-18T21:35:42Z", "content": "The International Space Station (ISS), humanity’s symbol of collaboration in space, is facing a chilling crisis. A persistent air leak in the Russian-controlled Zvezda module has ignited fears of pot… [+3686 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Astronomers: Earth Had Saturn-Like Rings 466 Million Years Ago - ExtremeTech", "description": "The temporary ring system may explain some strange geological happenings during the Ordovician Period.", "url": "https://www.extremetech.com/science/astronomers-earth-had-saturn-like-rings-466-million-years-ago", "urlToImage": "https://i.extremetech.com/imagery/content-types/043tK9C0xYJeLPbnI7xsG5s/hero-image.fill.size_1200x675.jpg", "publishedAt": "2024-11-18T21:09:40Z", "content": "Today, only the largest planets in the solar system have rings, but a new study suggests Earth may have been a ringed planet in the distant past. Scientists studying the geology of the Ordovician Per… [+2724 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "Crowdsourcing Ionosphere Data With Phones - Hackaday", "description": "How do you collect a lot of data about the ionosphere? Well, you could use sounding rockets or specialized gear. Or maybe you can just conscript a huge number of cell phones. That was the approach …", "url": "https://hackaday.com/2024/11/18/crowdsourcing-ionosphere-data-with-phones/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/11/tec.png", "publishedAt": "2024-11-18T21:00:00Z", "content": "How do you collect a lot of data about the ionosphere? Well, you could use sounding rockets or specialized gear. Or maybe you can just conscript a huge number of cell phones. That was the approach ta… [+1042 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The Amazing Camouflage of The Octopus Comes at a Heavy Cost - ScienceAlert", "description": "Octopuses are masters of camouflage and disguise.", "url": "https://www.sciencealert.com/the-amazing-camouflage-of-the-octopus-comes-at-a-heavy-cost", "urlToImage": "https://www.sciencealert.com/images/2024/11/octopus354.jpg", "publishedAt": "2024-11-18T20:01:34Z", "content": "Octopuses are masters of camouflage and disguise. An alarmed octopus can vanish even while you watch, flawlessly transforming into what looks like a piece of coral-encrusted rock, or another species … [+3986 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Magnetic North Pole Shifts in ‘Unprecedented’ Ways Never Seen Before by Scientists - The Daily Galaxy --Great Discoveries Channel", "description": "The Earth's Magnetic North Pole is moving faster than ever before, in a way that scientists have never observed before. This unprecedented movement could have far-reaching consequences for modern navigation systems and everyday technology.", "url": "https://dailygalaxy.com/2024/11/magnetic-north-pole-shifts-in-an-unprecedented-ways-never-seen-before-by-scientists/", "urlToImage": "https://bunny-wp-pullzone-eduayjtzy5.b-cdn.net/wp-content/uploads/2024/11/Magnetic-North-Pole-Shifting.jpg", "publishedAt": "2024-11-18T19:28:23Z", "content": "The Earth’s North Magnetic Pole is approaching Russia at a speed never seen before, which could spell disaster for your smartphone and GPS Devices. Whats behind this unprecedented shift, and how does… [+3484 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Man Turns Old Mobile Home into a Log Cabin with Just $13k–and DIY Charm (LOOK) - Good News Network", "description": "Benn Berkeley lost all his work prospects as a freelance filmmaker in 2020 due to business closures and other restrictions in England.", "url": "https://www.goodnewsnetwork.org/man-turns-old-mobile-home-into-a-log-cabin-with-just-13k-and-diy-charm-look/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2024/11/Benn-Berkeley-next-to-his-caravan-SWNS.jpg", "publishedAt": "2024-11-18T19:00:42Z", "content": "Benn Berkeley next to his caravan – SWNS\r\nWhat would you prefer to live in, a trailer or a log cabin? An out-of-work English filmmaker picked the latter over the former by way of his own two hands an… [+2291 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Roxana Bardan", "title": "NASA Selects New Leader of Space Technology - NASA", "description": "Clayton P. Turner will serve as the associate administrator of the Space Technology Mission Directorate (STMD) at the agency’s headquarters in Washington,", "url": "https://www.nasa.gov/news-release/nasa-selects-new-leader-of-space-technology/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/11/c-turner.png", "publishedAt": "2024-11-18T18:07:44Z", "content": "Clayton P. Turner will serve as the associate administrator of the Space Technology Mission Directorate (STMD) at the agencys headquarters in Washington, NASA Administrator Bill Nelson announced Mond… [+3015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brendan M. Lynch", "title": "Theoretical astrophysicist proposes solution to enigma of Crab Nebula's 'zebra' pattern - Phys.org", "description": "A theoretical astrophysicist from the University of Kansas may have solved a nearly two-decade-old mystery over the origins of an unusual \"zebra\" pattern seen in high-frequency radio pulses from the Crab Nebula.", "url": "https://phys.org/news/2024-11-theoretical-astrophysicist-solution-enigma-crab.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-idea-may-crack-eni-1.jpg", "publishedAt": "2024-11-18T18:07:03Z", "content": "A theoretical astrophysicist from the University of Kansas may have solved a nearly two-decade-old mystery over the origins of an unusual \"zebra\" pattern seen in high-frequency radio pulses from the … [+5682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Colgate University", "title": "New study reveals possible origins of dark matter in 'Dark Big Bang' scenario - Phys.org", "description": "Recent research by a student-faculty team at Colgate University unlocks new clues that could radically change the world's understanding of the origin of dark matter.", "url": "https://phys.org/news/2024-11-reveals-dark-big-scenario.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-study-reveals-poss.jpg", "publishedAt": "2024-11-18T17:54:03Z", "content": "Recent research by a student-faculty team at Colgate University unlocks new clues that could radically change the world's understanding of the origin of dark matter.\r\nAssistant Professor of Physics a… [+3921 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "NASA wants ideas on how to haul injured moonwalkers - The Register", "description": "$45K says you can do it without a lunar rover", "url": "https://www.theregister.com/2024/11/18/nasa_injured_astronaut_transport/", "urlToImage": "https://regmedia.co.uk/2023/11/30/moon_shutterstock.jpg", "publishedAt": "2024-11-18T17:11:00Z", "content": "How do you rescue an injured crew member on the lunar surface? NASA is looking for ideas, and a share of a $45,000 prize pot is up for grabs.\r\nThe problem has vexed the US space agency for some time.… [+1841 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Symmetry Spotted in Statistical Mechanics - Physics", "description": "The identification of a new type of symmetry in statistical mechanics could help scientists derive and interpret fundamental relationships in this branch of physics.", "url": "https://physics.aps.org/articles/v17/163", "urlToImage": "https://physics.aps.org/assets/7d66ce27-fa8a-435b-aa17-c8b6fde890b5/e163_2_thumb.png", "publishedAt": "2024-11-18T16:24:12Z", "content": "Figure 1: (Left) In the so-called grand-canonical ensemble, a system of particles (blue) is in contact with a heat and particle reservoir (gray). The system retains a constant temperature and chemica… [+9598 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Can Lasers Cast a Shadow? Scientists Just Made It Happen - Gizmodo", "description": "Scientists have shown that laser light, under certain conditions, can behave like an object and cast a shadow.", "url": "https://gizmodo.com/can-lasers-cast-a-shadow-scientists-just-made-it-happen-2000525826", "urlToImage": "https://gizmodo.com/app/uploads/2024/11/laser-shadow.jpg", "publishedAt": "2024-11-18T15:25:40Z", "content": "If you think you know what a shadow is, think again. An international team of scientists has just demonstrated a phenomenon that could be straight out of a science fiction book: a shadow cast by ligh… [+2756 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Conor Feehly", "title": "Hubble Telescope witnesses Milky Way strip its galactic neighbor of gas - Yahoo! Voices", "description": "The Hubble Space Telescope may have captured our Milky Way galaxy being a bit of a bully.", "url": "https://www.space.com/space-exploration/hubble-space-telescope/hubble-telescope-witnesses-milky-way-strip-its-galactic-neighbor-of-gas", "urlToImage": "https://media.zenfs.com/en/space_311/b08dd0dbbd235ff28fbb81f9e970f8a0", "publishedAt": "2024-11-18T15:06:22Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nW… [+3672 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "India plans to build a moon-orbiting space station by 2040 - Space.com", "description": "\"This is an enormous task.\"", "url": "https://www.space.com/the-universe/moon/india-plans-to-build-a-moon-orbiting-space-station-by-2040", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XZ4AeBY9KM3xfMgEaRe47G-1200-80.jpg", "publishedAt": "2024-11-18T15:00:00Z", "content": "India plans to build a moon-orbiting space station by 2040 as part of its ambitious roadmap to establish a long-term presence beyond Earth orbit.\r\nThe outpost will support crewed missions to the surf… [+2938 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Science and Technology of China", "title": "Long-lived Schrödinger's-cat state achieves Heisenberg-limited sensitivity - Phys.org", "description": "A team led by Prof. Lu Zhengtian and Researcher Xia Tian from the University of Science and Technology of China (USTC) realized a Schrödinger-cat state with minute-scale lifetime using optically trapped cold atoms, significantly enhancing the sensitivity of q…", "url": "https://phys.org/news/2024-11-schrdinger-cat-state-heisenberg-limited.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/long-lived-schrdingers.jpg", "publishedAt": "2024-11-18T14:45:03Z", "content": "A team led by Prof. Lu Zhengtian and Researcher Xia Tian from the University of Science and Technology of China (USTC) realized a Schrödinger-cat state with minute-scale lifetime using optically trap… [+2542 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Elizabeth A. Thomson", "title": "Physicists predict exotic form of matter with potential for quantum computing - Phys.org", "description": "MIT physicists have shown that it should be possible to create an exotic form of matter that could be manipulated to form the qubit (quantum bit) building blocks of future quantum computers that are even more powerful than the quantum computers in development…", "url": "https://phys.org/news/2024-11-physicists-exotic-potential-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/mit-physicists-predict.jpg", "publishedAt": "2024-11-18T14:38:03Z", "content": "MIT physicists have shown that it should be possible to create an exotic form of matter that could be manipulated to form the qubit (quantum bit) building blocks of future quantum computers that are … [+4656 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Spots Black Holes Sharing a Meal in an Unprecedented Cosmic Encounter - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers, using NASA’s Swift Observatory and the Zwicky Transient Facility, have captured an extraordinary cosmic event—two supermassive black holes sharing a meal from the same colossal gas cloud. Located a billion light-years away in the heart of the gal…", "url": "https://dailygalaxy.com/2024/11/nasa-spots-black-holes-sharing-a-meal/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/NASA-Spots-Black-Holes-Sharing-a-Meal-in-an-Unprecedented-Cosmic-Encounter.jpg", "publishedAt": "2024-11-18T14:35:44Z", "content": "Astronomers have witnessed a rare cosmic event a billion light-years away: two supermassive black holes orbiting each other and sharing a single gas cloud. This spectacular discovery, made with NASAs… [+4543 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Humans are walking ecosystems and microbes rule their evolution - Earth.com", "description": "Microbes profoundly impact evolution, shaping traits alongside genes. Holobiont biology highlights how hosts and microbes form ecosystems.", "url": "https://www.earth.com/news/humans-are-walking-ecosystems-and-microbes-rule-their-evolution/", "urlToImage": "https://cff2.earth.com/uploads/2024/11/18072207/Microbes-evolution2.jpg", "publishedAt": "2024-11-18T14:24:47Z", "content": "We might like to think of ourselves as autonomous entities but, in reality, we’re more like walking ecosystems, teeming with bacteria, viruses, and other microbes. It turns out that differences in th… [+5514 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Comet Explosion That Shattered Climates and Caused Extinctions 12,800 Years Ago - SciTechDaily", "description": "Research supports the Younger Dryas Impact hypothesis, suggesting a comet fragment caused significant climatic changes and species extinctions 12,800 years ago through high-pressure, high-temperature airbursts, evidenced by materials like platinum and shocked…", "url": "https://scitechdaily.com/the-comet-explosion-that-shattered-climates-and-caused-extinctions-12800-years-ago/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Striking-Earth-Explosion.jpg", "publishedAt": "2024-11-18T14:14:25Z", "content": "New evidence supports the theory that a fragmented comet triggered the Younger Dryas period through destructive airbursts, leading to dramatic climatic shifts and widespread extinctions.\r\nResearch su… [+7051 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Groundbreaking AI enables 20-minute human-whale dialogue, revolutionizing interspecies communication - The Daily Galaxy --Great Discoveries Channel", "description": "In a groundbreaking development, artificial intelligence (AI) has enabled a 20-minute conversation between humans and a humpback whale, marking a significant milestone in interspecies communication. This extraordinary encounter, which took place off the Alask…", "url": "https://dailygalaxy.com/2024/11/groundbreaking-ai-enables-20-minute-human-whale-dialogue-revolutionizing-interspecies-communication/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/groundbreaking-ai-enables-20-minute-human-whale-dialogue-revolutionizing-interspecies-communication.jpg", "publishedAt": "2024-11-18T14:00:00Z", "content": "The remarkable interaction occurred when Dr. Brenda McCowan and her team from the University of California Davis engaged with a humpback whale named Twain. Using sophisticated underwater speakers, th… [+4070 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "NASA's Parker Solar Probe is solving long-standing mysteries about the sun. Here's what we've learned so far. - Space.com", "description": "The goal of the Parker Solar Probe mission is to investigate the mysteries of the sun's corona, its outer atmosphere. What has it learned so far?", "url": "https://www.space.com/the-universe/sun/nasas-parker-solar-probe-is-solving-long-standing-mysteries-about-the-sun-heres-what-weve-learned-so-far", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qKgu3KU9x4CSQWkH8s57tP-1200-80.png", "publishedAt": "2024-11-18T13:00:00Z", "content": "On Nov. 6, NASA's Parker Solar Probe passed within 234 miles (376 kilometers) of Venus' surface. The purpose of this close flyby was to accomplish a gravity-assist maneuver, in which the probe would … [+5300 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Measure the Speed of Quantum Entanglement in a Groundbreaking Experiment - The Daily Galaxy --Great Discoveries Channel", "description": "In a groundbreaking experiment, scientists have achieved the remarkable feat of measuring the speed of quantum entanglement for the first time. This milestone in quantum physics research unveils new insights into one of nature's most perplexing phenomena, ope…", "url": "https://dailygalaxy.com/2024/11/scientists-measure-quantum-entanglement-speed-groundbreaking-experiment/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/scientists-measure-quantum-entanglement-speed-groundbreaking-experiment.jpg", "publishedAt": "2024-11-18T13:00:00Z", "content": "Prof. Joachim Burgdörfer from the Institute of Theoretical Physics at TU Wien explains, “Entangled particles possess no individual properties, only common ones. Mathematically, they are inextricably … [+4424 chars]"}]}