{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Mindy Weisberger, CNN", "title": "An ancient ‘terror crocodile’ became a dinosaur-eating giant. Scientists say they now know why - AOL.com", "description": "One of the largest crocodilians that ever lived preyed on dinosaurs. New research has found the fearsome Deinosuchus had a key trait that modern alligators l...", "url": "https://www.cnn.com/2025/04/23/science/terror-crocodile-dinosaur-eating-saltwater", "urlToImage": "https://media.zenfs.com/en/aol_cnn_articles_945/617c3104c6603d655710e28e3eb99b53", "publishedAt": "2025-04-25T07:12:18Z", "content": "An artist's illustration shows Deinosuchus riograndensis swimming with an early alligator relative in the wetlands of the Western Interior Seaway in southwestern North America, during the Late Cretac… [+7399 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": null, "title": "Presidential Message on the 35th Anniversary of the Hubble Space Telescope - The White House (.gov)", "description": "Today, we celebrate the 35th anniversary of the Hubble Space Telescope, an awe-inspiring testament to America’s longstanding ingenuity, leadership, and", "url": "https://www.whitehouse.gov/briefings-statements/2025/04/presidential-message-on-the-35th-anniversary-of-the-hubble-space-telescope/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2025/03/WH47-Social-Share-Card.jpg", "publishedAt": "2025-04-25T01:17:42Z", "content": "Today, we celebrate the 35th anniversary of the Hubble Space Telescope, an awe-inspiring testament to Americas longstanding ingenuity, leadership, and innovation.\r\nSince its launch in 1990, Hubble ha… [+1542 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Justine McDaniel", "title": "Scientists made ‘tiny earthquakes’ to find where Yellowstone’s magma begins - The Washington Post", "description": "For the first time, geoscientists detected the top of Yellowstone’s magma reservoir. It is active and dynamic, but not in danger of erupting, they found.", "url": "https://www.washingtonpost.com/nation/2025/04/24/yellowstone-magma-cap/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FGXKVZACEAI63C7LFNHEQGYVAA.jpg&w=1440", "publishedAt": "2025-04-25T00:30:09Z", "content": "Underneath Yellowstone National Park, magma bubbles and flows. But exactly how close it is to the surface has long been a mystery to scientists until now.\r\nFor the first time, researchers have detect… [+4470 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "At the Magic Angle, a Mysterious Vibration Emerges – And It Might Explain Superconductivity - SciTechDaily", "description": "Scientists have unveiled a cutting-edge quantum microscope that allows them to observe how electrons interact with strange atomic vibrations in twisted graphene, including a newly revealed “phason.” This phenomenon could help explain mysterious behaviors like…", "url": "https://scitechdaily.com/at-the-magic-angle-a-mysterious-vibration-emerges-and-it-might-explain-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Graphene-Vibration-Art-Concept.jpg", "publishedAt": "2025-04-25T00:07:59Z", "content": "A revolutionary cryogenic microscope has revealed how electrons couple with atomic vibrations in graphene, offering new clues about the origin of superconductivity and strange metal behaviors. Credit… [+4900 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Reusable rockets are here, so why is NASA paying more to launch stuff to space? - Ars Technica", "description": "Something appears to be broken in how NASA procures launch services.", "url": "https://arstechnica.com/space/2025/04/reusable-rockets-are-here-so-why-is-nasa-paying-more-to-launch-stuff-to-space/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/52723746397_8777ce86ce_k-1152x648.jpg", "publishedAt": "2025-04-24T23:15:41Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Scientists Spotted Signs of a Hidden Structure Inside Earth's Core - ScienceAlert", "description": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history.", "url": "https://www.sciencealert.com/scientists-spotted-signs-of-a-hidden-structure-inside-earths-core", "urlToImage": "https://www.sciencealert.com/images/2023/02/EarthsInnermostInnerCore.jpg", "publishedAt": "2025-04-24T22:43:21Z", "content": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history. Our history.\r\nResearch shows there are little-known cha… [+3389 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Mars is covered in evidence of ancient lakes, rain and snow — but scientists aren't sure how that's possible - Space", "description": "\"You could pull up Google Earth images of places like Utah, zoom out, and you’d see the similarities to Mars.\"", "url": "https://www.space.com/the-universe/mars/mars-is-covered-in-evidence-of-ancient-lakes-rain-and-snow-but-scientists-arent-sure-how-thats-possible", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rFxjRZcHNTZ8Jpw34pthnQ.jpg", "publishedAt": "2025-04-24T22:00:00Z", "content": "Though Mars, the Red Planet, is a vast and inhospitable land today, scientists think it once resembled our very own Earth — the Blue Planet, if you will. More specifically, experts say Mars once had … [+4323 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "AI Still Falls Short in Understanding Human Social Interactions - Neuroscience News", "description": "Humans significantly outperform AI models in interpreting dynamic social interactions, a skill critical for technologies like autonomous vehicles and assistive robots.", "url": "https://neurosciencenews.com/ai-human-interaction-28721/", "urlToImage": "https://neurosciencenews.com/files/2025/04/AI-social-interaction-neuroscience.jpg", "publishedAt": "2025-04-24T21:25:26Z", "content": "Summary: Humans significantly outperform AI models in interpreting dynamic social interactions, a skill critical for technologies like autonomous vehicles and assistive robots. In a new study, partic… [+4695 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tudor Tarita", "title": "These 400,000-Year-Old Mammoth Tusks Carved by Early Humans May Be the Oldest Evidence of Prehistoric Intelligence - ZME Science", "description": "Ancient tusk fragments hint at early social learning 400,000 years ago", "url": "https://www.zmescience.com/science/anthropology/these-400000-year-old-mammoth-tusks-carved-by-early-humans-may-be-the-oldest-evidence-of-prehistoric-intelligence/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/04/fig-ivory-tools.png", "publishedAt": "2025-04-24T20:59:10Z", "content": "The ivory fragments show signs of manipulation by early humans. Credit: Vadim N. Stepanchuk\r\nIn the plains of western Ukraine, researchers digging through ancient soil found a handful of small, broke… [+4575 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Megan Watzke", "title": "Super-Earths are common outside the solar system, new study shows - Phys.org", "description": "An international team including astronomers from the Center for Astrophysics | Harvard & Smithsonian (CfA) has announced the discovery of a planet about twice the size of Earth orbiting its star farther out than Saturn is to the sun.", "url": "https://phys.org/news/2025-04-super-earths-common-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/planets-bigger-than-ea-1.jpg", "publishedAt": "2025-04-24T20:04:43Z", "content": "An international team including astronomers from the Center for Astrophysics | Harvard &amp; Smithsonian (CfA) has announced the discovery of a planet about twice the size of Earth orbiting its star … [+4229 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Mars orbiter snaps 1st image of Curiosity rover driving on the Red Planet (photo) - Space", "description": "\"Curiosity was captured in what is believed to be the first orbital image of the rover mid-drive across the Red Planet.\"", "url": "https://www.space.com/space-exploration/mars-rovers/mars-orbiter-snaps-1st-image-of-curiosity-rover-driving-on-the-red-planet-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mnbGe8igJidZx8YqHebTkP.jpg", "publishedAt": "2025-04-24T19:30:00Z", "content": "NASA's Mars Reconnaissance Orbiter (MRO) just snapped an off-Earth action shot the likes of which we've never seen before.\r\nOn Feb. 28, MRO's HiRISE (High-Resolution Imaging Science Experiment) camer… [+2139 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Widest high-resolution photo of the Sun ever captured - Earth.com", "description": "Solar Orbiter began routine science operations in 2021 and has since looped ever closer to the Sun, stealing bits of speed from Venus.", "url": "https://www.earth.com/news/widest-high-resolution-photo-of-the-sun-ever-captured-solar-orbiter/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/24130819/Sun_Solar-Orbiter_widest-view-yet_ESA_1.jpg", "publishedAt": "2025-04-24T19:23:07Z", "content": "The Suns newest portrait is not the fiery disc we remember from textbooks. Instead, it sprawls across a mosaic so detailed that you could stack a dozen Earths end to end inside a single pixel and sti… [+4355 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "See a cosmic 'smiley face' in the early morning sky as the moon greets Saturn and Venus tomorrow - Space", "description": "Nobody knows it, but the universe has a secret smile, and it uses it only for Earth.", "url": "https://www.space.com/stargazing/see-a-cosmic-smiley-face-in-the-early-morning-sky-as-the-moon-greets-saturn-and-venus-tomorrow", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iEDLnUrfjcruaAgNiBwoik.jpg", "publishedAt": "2025-04-24T19:00:00Z", "content": "Do you ever feel like the universe is smiling down on you? Well, in the predawn hours of April 25 it literally will be thanks to a double conjunction that will see Saturn, Venus and the moon combine … [+3429 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "‘Extraordinary’ fossil reveals the oldest ant species known to science - Yahoo", "description": "A prehistoric hell ant that lived among dinosaurs 113 million years ago had an unusual way to kill its prey and sheds new light on insect evolution...", "url": "https://www.cnn.com/2025/04/24/science/fossil-oldest-known-ant", "urlToImage": "https://media.zenfs.com/en/cnn_articles_875/b9a908ef13eaf8a8ef0a9fa6a689034b", "publishedAt": "2025-04-24T18:39:38Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAn almost overlooked fossil discovered in a Brazilian … [+4438 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Massive Hole the Size of Switzerland Opens in Antarctica - The Daily Galaxy", "description": "A massive polynya the size of Switzerland has recently appeared in Antarctica, leaving scientists baffled. Uncover the surprising factors driving this phenomenon and what it means for the future of our planet's climate.", "url": "https://dailygalaxy.com/2025/04/massive-hole-size-switzerland-antarctica/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Massive-Hole-the-Size-of-Switzerland-Opens-in-Antarctica.jpg", "publishedAt": "2025-04-24T18:30:00Z", "content": "A surprising event that has caught the attention of scientists around the world. This large gap in the sea ice remained open for several weeks, raising questions about the underlying mechanisms drivi… [+3384 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "Solar wind might be making water on the moon, groundbreaking NASA study reveals - Live Science", "description": "Lunar samples show evidence that solar wind could be behind the water molecules on the moon's surface, according to NASA. The results could shine a light on how water ice collects in cold traps formed by patches of permanent darkness at the moon's poles.", "url": "https://www.livescience.com/space/astronomy/solar-wind-might-be-making-water-on-the-moon-groundbreaking-nasa-study-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6FgnrK9DfEsS57N5zgTt3K.gif", "publishedAt": "2025-04-24T18:05:28Z", "content": "Constant gusts of particles from the sun may be creating water molecules on the moon, a new NASA-led experiment hints.\r\nScientists have detected traces of water molecules — as well as hydroxyl (OH) m… [+3699 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "'Bone Collector' Caterpillar Wears Dead Bugs to Steal Prey From Spiders - ScienceAlert", "description": "We all need a way to get along in this wild, wicked world, and a rare insect found only on a mountainside on O'ahu has found an incredible strategy.", "url": "https://www.sciencealert.com/bone-collector-caterpillar-wears-dead-bugs-to-steal-prey-from-spiders", "urlToImage": "https://www.sciencealert.com/images/2025/04/BoneCollectorCaterpillarAndSpider.jpg", "publishedAt": "2025-04-24T18:01:23Z", "content": "We all need a way to get along in this wild, wicked world, and a rare insect found only on a mountainside on O'ahu has found an incredible strategy.\r\nA species of caterpillar that scientists are call… [+4411 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Big Bang Theory Debunked? A Physicist Presents An Alternative - The Daily Galaxy", "description": "What if the universe didn’t begin with a Big Bang? A groundbreaking new theory suggests it evolved through a series of rapid, unseen bursts of energy.", "url": "https://dailygalaxy.com/2025/04/big-bang-theory-debunked/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Big-Bang-Theory-Debunked-A-Physicist-Presents-An-Alternative.jpg", "publishedAt": "2025-04-24T18:00:00Z", "content": "A groundbreaking cosmological theory is taking the scientific community by storm, suggesting that the universe did not originate from a single Big Bang. Instead, this bold idea proposes that the cosm… [+3022 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Why Mars’ Molten Core May Hold the Key to the Planet’s Ancient Magnetic Field Mystery - The Daily Galaxy", "description": "Mars' ancient magnetic field has puzzled scientists for years, but new research suggests a molten core could be the key to this mystery. Could temperature differences across the planet’s hemispheres have caused a lopsided magnetic shield?", "url": "https://dailygalaxy.com/2025/04/why-mars-molten-core-may-hold-the-key-to-the-planets-ancient-magnetic-field-mystery/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Why-Mars-Molten-Core-May-Hold-the-Key-to-the-Planets-Ancient-Magnetic-Field-Mystery.jpg", "publishedAt": "2025-04-24T18:00:00Z", "content": "New research published by the University of Texas Institute for Geophysics offers a compelling explanation for the strange nature of Mars ancient magnetic field. The study suggests that the Red Plane… [+2934 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matthew Williams", "title": "A novel concept for a multiplanetary crewed mission to Mars and Ceres - Phys.org", "description": "For NASA, sending a crewed mission to Mars has been the long-term goal for over two decades. China has joined the club in recent years, with plans to send crewed missions to the red planet ahead of NASA. In both cases, the plans envision a stepping stone appr…", "url": "https://phys.org/news/2025-04-concept-multiplanetary-crewed-mission-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-novel-concept-for-a.jpg", "publishedAt": "2025-04-24T17:30:01Z", "content": "For NASA, sending a crewed mission to Mars has been the long-term goal for over two decades. China has joined the club in recent years, with plans to send crewed missions to the red planet ahead of N… [+8094 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Ancient Fossil Was Mistaken for a Fungus - The Daily Galaxy", "description": "A bizarre fossil has scientists rethinking everything they know about ancient life. Once thought to be a tree or fungus, new research reveals Prototaxites might be a whole new form of life entirely.", "url": "https://dailygalaxy.com/2025/04/this-ancient-fossil-was-mistaken-fungus/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/This-Ancient-Fossil-Was-Mistaken-for-a-Fungus.jpg", "publishedAt": "2025-04-24T17:30:00Z", "content": "A peculiar fossil discovery has raised eyebrows in the scientific community, prompting researchers to rethink the boundaries of life on Earth. This fossil, identified as Prototaxites, was once believ… [+3113 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "11 Million-Year-Old Panda Fossil Found in Germany Reveals Shocking Detail about Their Diet - Indian Defence Review", "description": "Paleontologists have uncovered the 11 million-year-old fossil of an ancestor of the giant panda in Germany, revealing surprising insights into the panda's evolutionary past.", "url": "https://indiandefencereview.com/11-million-year-old-panda-fossil-germany/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/04/11-million-year-old-panda-fossil-found-in-germany-reveals-shocking-detail-about-their-diet.jpg", "publishedAt": "2025-04-24T17:10:00Z", "content": "A groundbreaking discovery in southern Germany has provided remarkable insights into the evolutionary history of the giant panda. Paleontologists recently uncovered the fossil of Kretzoiarctos beatri… [+3691 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "California Institute of Technology", "title": "Quantum sensors tested for next-generation particle physics experiments - Phys.org", "description": "To learn more about the nature of matter, energy, space, and time, physicists smash high-energy particles together in large accelerator machines, creating sprays of millions of particles per second of a variety of masses and speeds. The collisions may also pr…", "url": "https://phys.org/news/2025-04-quantum-sensors-generation-particle-physics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/quantum-sensors-tested.jpg", "publishedAt": "2025-04-24T17:09:25Z", "content": "To learn more about the nature of matter, energy, space, and time, physicists smash high-energy particles together in large accelerator machines, creating sprays of millions of particles per second o… [+6417 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Briley Lewis", "title": "World's largest solar telescope turns on powerful new camera, revealing breathtaking image of a continent-size sunspot - Live Science", "description": "The Daniel K. Inouye Solar Telescope, the world's largest solar telescope, can see the sun in unprecedented detail. Here is the first image from its newly-activated camera.", "url": "https://www.livescience.com/space/the-sun/worlds-largest-solar-telescope-turns-on-powerful-new-camera-revealing-breathtaking-image-of-a-continent-size-sunspot", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vu2q9of8jwioPQqpuJKH48.jpg", "publishedAt": "2025-04-24T16:58:26Z", "content": "Weather on Earth can be wild, but it's not the only kind of weather we have to deal with. Space weather — all the winds and particles streaming off the sun — can have major impacts on Earth and human… [+3364 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "High velocity gas-clump in Milky Way neighborhood may be a dark galaxy - Phys.org", "description": "A team of astronomers and astrophysicists at the Chinese Academy of Science's National Astronomical Observatories has found evidence suggesting that a \"gas clump\" in a fast-moving cloud in the neighborhood of the Milky Way may be a dark galaxy. Their findings…", "url": "https://phys.org/news/2025-04-high-velocity-gas-clump-milky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/high-velocity-gas-clum.jpg", "publishedAt": "2025-04-24T16:42:56Z", "content": "A team of astronomers and astrophysicists at the Chinese Academy of Science's National Astronomical Observatories has found evidence suggesting that a \"gas clump\" in a fast-moving cloud in the neighb… [+2348 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Unearth the Largest Snake Ever—Is It Bigger Than a T-Rex? - The Daily Galaxy", "description": "A massive snake, longer than a T-rex, has been uncovered in India—its fossils suggest it could have grown up to 15 meters long!", "url": "https://dailygalaxy.com/2025/04/scientists-unearth-the-largest-snake-ever/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Scientists-Unearth-the-Largest-Snake-Ever—Is-It-Bigger-Than-a-T-Rex.jpg", "publishedAt": "2025-04-24T16:30:00Z", "content": "In a groundbreaking discovery in western India, scientists have uncovered fossil vertebrae from the largest snake ever to live, a creature that could have reached lengths up to 15 meterslonger than t… [+3384 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope finds a wild black hole growth spurt in galaxies at 'cosmic noon' - Space", "description": "\"We want to understand how these galaxies are forming stars, how many stars they’re forming, and especially how the black holes at their centers are growing.\"", "url": "https://www.space.com/space-exploration/james-webb-space-telescope/james-webb-space-telescope-finds-a-wild-black-hole-growth-spurt-in-galaxies-at-cosmic-noon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QQSAhjc3DboS4MeWpL6Y3k.png", "publishedAt": "2025-04-24T16:08:53Z", "content": "Astronomers have used the James Webb Space Telescope (JWST) to peer back in time over 10 billion years, observing an early era in cosmic history. In doing so, the team from the University of Kansas (… [+6320 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Emily Cooke", "title": "Ancient DNA and modern genomes can reveal stories of past peoples, from the Iron Age to Chernobyl, geneticist says - Live Science", "description": "Ingrida Domarkienė, a geneticist at Vilnius University in Lithuania, discusses the exciting developments made possible by studying ancient and modern DNA.", "url": "https://www.livescience.com/health/genetics/ancient-dna-and-modern-genomes-can-reveal-stories-of-past-peoples-from-the-iron-age-to-chernobyl-geneticist-says", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vW2FSxZpmycPwkuGPBsqmL.png", "publishedAt": "2025-04-24T16:00:00Z", "content": "Ingrida Domarkienė\r\n studies ancient DNA, weaving together fragments of genetic material from modern humans and our long-extinct human relatives to retell their stories.\r\nFrom a background in molecul… [+8561 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Glowing Lava Lakes Erupt Simultaneously – Africa’s Most Dangerous Volcano About to Blow? - The Daily Galaxy", "description": "A 10,700-year-old mummy discovered in a Nevada cave has rewritten Native American history. DNA tests confirm the ancient remains are directly linked to modern tribes, challenging long-held beliefs about America's first inhabitants.", "url": "https://dailygalaxy.com/2025/04/lava-lakes-erupt-africa-most-dangerous-volcano/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Glowing-Lava-Lakes-Erupt-Simultaneously-–-Africas-Most-Dangerous-Volcano-About-to-Blow.jpg", "publishedAt": "2025-04-24T16:00:00Z", "content": "A satellite image has captured the simultaneous eruptions of Africas most active volcanoes, Mount Nyamuragira and Mount Nyiragongo, located in the Democratic Republic of the Congo. \r\nTaken in 2014 by… [+3451 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Alaska’s Volcanic Region Is More Active Than Expected – A Major Geologic Force at Play - The Daily Galaxy", "description": "Alaska’s volcanic region is far more active than most realize, with frequent eruptions shaping its landscape and posing global implications.", "url": "https://dailygalaxy.com/2025/04/alaska-volcanic-region-active-expected/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Alaskas-Volcanic-Region-Is-More-Active-Than-Expected-–-A-Major-Geologic-Force-at-Play.png", "publishedAt": "2025-04-24T15:30:00Z", "content": "Beneath Alaska’s breathtaking landscapes and pristine wilderness lies one of the most geologically active regions on the planet. The Alaska Peninsula and Aleutian Islands form a volcanic arc that rep… [+5052 chars]"}, {"source": {"id": null, "name": "Lbl.gov"}, "author": "jennynuss", "title": "Scientists Develop Artificial Leaf That Uses Sunlight to Produce Valuable Chemicals - Berkeley Lab News Center (.gov)", "description": "Researchers built a device made of perovskite and copper that mimics a green leaf.", "url": "https://newscenter.lbl.gov/2025/04/24/scientists-develop-artificial-leaf-that-uses-sunlight-to-produce-valuable-chemicals/", "urlToImage": "https://newscenter.lbl.gov/wp-content/uploads/2025/04/Newscenter_featured_1190px_XBD-202503-035-001.jpg", "publishedAt": "2025-04-24T15:05:52Z", "content": "Previous experiments have successfully replicated photosynthesis through the use of biological materials, but this work incorporated an inorganic material, copper. While the selectivity of copper is … [+1306 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Tethys Seaway — The Vanished Ocean That Completely Altered the Course of Life on Earth! - The Daily Galaxy", "description": "The Tethys Seaway, Earth's lost ocean, vanished and sparked epic changes—shaping deserts, evolution, and the planet’s future in ways you won’t believe!", "url": "https://dailygalaxy.com/2025/04/tethys-seaway-ocean-altered-life-on-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Tethys-Seaway-The-Vanished-Ocean-That-Reshaped-Life-on-Earth.jpg", "publishedAt": "2025-04-24T14:30:00Z", "content": "The closure of the ancient Tethys Seaway has left an indelible mark on Earth’s history. As tectonic forces slowly reshaped the planet over millions of years, this ocean’s disappearance altered climat… [+4273 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Scotty Hendricks", "title": "5 classic science fiction novels written by scientists - Big Think", "description": "What happens when scientists \"write what they know\"? Some amazing science fiction stories.", "url": "https://bigthink.com/books/science-fiction-novels-by-scientists/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/04/5-Classic-Sci-Fi-Books.jpg?resize=1200,630", "publishedAt": "2025-04-24T14:30:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Image Unveils One of the World’s Rarest Geologic Wonders Hidden in Boston Harbor - The Daily Galaxy", "description": "NASA's stunning new image of Boston Harbor reveals the rare drumlin islands, a geological marvel shaped by glaciers over 20,000 years ago.", "url": "https://dailygalaxy.com/2025/04/nasa-image-geologic-wonders-boston-harbor/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/NASA-Image-Unveils-One-of-the-Worlds-Rarest-Geologic-Wonders-Hidden-in-Boston-Harbor.jpg", "publishedAt": "2025-04-24T14:00:00Z", "content": "NASAs latest image of Boston Harbor, showcasing its remarkable drumlin islands, has captivated both scientists and nature enthusiasts. Captured on July 19, 2024, by the Landsat 8 Operational Land Ima… [+4188 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Why Snow in New Zealand’s Alps Turned an Alarming Shade of Red - Gizmodo", "description": "Several years ago, snow in New Zealand's Southern Alps turned red, and while many blamed wildfires at the time, new research uncovers the true culprit.", "url": "https://gizmodo.com/why-snow-in-new-zealands-alps-turned-an-alarming-shade-of-red-2000593615", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/red-new-zealand-alps.jpg", "publishedAt": "2025-04-24T13:35:15Z", "content": "During the Southern Hemisphere’s summer of 20192020, mountains in New Zealand turned red. New research finally explains why.\r\nResearchers have revealed that New Zealand’s Southern Alps turned red aft… [+2657 chars]"}, {"source": {"id": null, "name": "Sustainability-times.com"}, "author": "Eirwen Williams", "title": "“NASA Says We’re on the Brink”: Alarming New Report Reveals Imminent Emergency Crash Risk for the Entire Space Station - Sustainability Times", "description": "IN A NUTSHELL 🚀 The International Space Station (ISS) faces rising safety concerns due to structural cracks and air leaks. 💰 Proposed NASA budget cuts by the Trump administration threaten the safe deorbiting of the ISS by 2030. 🛰️ SpaceX is contracted to d…", "url": "https://www.sustainability-times.com/sustainable-business/policy/nasa-says-were-on-the-brink-alarming-new-report-reveals-imminent-emergency-crash-risk-for-the-entire-space-station/", "urlToImage": "https://www.sustainability-times.com/wp-content/uploads/2025/04/we-wont-surrender-nasa-sounds-alarm-on-iss-safety-crisis-with-dire-emergency-deorbit-warning-to-earthlings.jpg", "publishedAt": "2025-04-24T13:12:51Z", "content": "<table><tr><td>IN A NUTSHELL</td></tr><tr><td><ul><li> The International Space Station (ISS) faces rising safety concerns due to structural cracks and air leaks.</li><li> Proposed NASA budget cuts by… [+5073 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Northern Lights Forecast: 8 States May See Aurora Borealis Tonight - Forbes", "description": "The aurora borealis has become more visible to more states in recent months, after activity on the sun’s surface peaked.", "url": "https://www.forbes.com/sites/tylerroush/2025/04/24/northern-lights-forecast-8-states-may-see-aurora-borealis-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/680a356b44126f150591665e/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-04-24T12:59:21Z", "content": "The aurora borealis may be visible again to several states along the Canadian border on Thursday, and it may be the last opportunity this week to catch the phenomenon, according to the National Ocean… [+3012 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Sea slugs flash bright colors in sunlight to scare off predators - Earth.com", "description": "Sea slugs use bold, bright colors under sunlight to warn predators of their toxic traits. These colors are easier for fish to see.", "url": "https://www.earth.com/news/sea-slugs-flash-bright-colors-to-scare-off-predators/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/24084510/sea-slug_Bonisa-nakaza_1m.jpg", "publishedAt": "2025-04-24T12:52:56Z", "content": "Sea slugs are famous for their unusual shapes and colors, but their habit of shining during daylight is still surprising to many. They refuse to hide and instead display bright spots, stripes, or swi… [+4569 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A continent is splitting in two, the rift is already visible, and a new ocean is set to form. - Farmingdale Observer", "description": "The African continent is experiencing a remarkable geological transformation right before our eyes. Scientists have confirmed that East Africa is gradually splitting apart, with visible evidence of this continental fracture already appearing. This extraordina…", "url": "https://farmingdale-observer.com/2025/04/24/a-continent-is-splitting-in-two-the-rift-is-already-visible-and-a-new-ocean-is-set-to-form/", "urlToImage": null, "publishedAt": "2025-04-24T12:21:00Z", "content": "The African continent is experiencing a remarkable geological transformation right before our eyes. Scientists have confirmed that East Africa is gradually splitting apart, with visible evidence of t… [+4124 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Perseverance Rover Discovers a Strange 'Skull Hill' Rock on Mars, Suspects It Came From 'Elsewhere' - The Daily Galaxy", "description": "A mysterious rock has been discovered on Mars, unlike anything we've seen before. With its dark tone and unusual features, it could hold the key to understanding Mars' ancient past. NASA's Perseverance rover is now investigating this strange formation.", "url": "https://dailygalaxy.com/2025/04/nasas-perseverance-rover-discovers-a-strange-skull-hill-rock-on-mars-suspects-it-came-from-elsewhere/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Skull-Hill-rock-on-Mars.jpg", "publishedAt": "2025-04-24T12:00:00Z", "content": "NASA’s Perseverance rover has recently discovered a remarkable rock on Mars that could potentially rewrite the story of the planets geological history. \r\nSituated on the rim of the Jezero Crater, the… [+3984 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ross Kelly", "title": "EVs could charge 500% faster in sub-freezing weather thanks to simple new manufacturing trick - Live Science", "description": "New research shows how coating a battery with a razor-thin layer of lithium borate-carbonate can lead to a 500% boost in charging rates when temperatures fall below freezing.", "url": "https://www.livescience.com/technology/electric-vehicles/evs-could-charge-500-percent-faster-in-sub-freezing-weather-thanks-to-simple-new-manufacturing-trick", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZMyzY5GahbuNbsDXYcjqDL.png", "publishedAt": "2025-04-24T12:00:00Z", "content": "Electric vehicles could charge 500% faster in cold weather thanks to a new manufacturing process, research suggests.\r\nIn a new study published March 17 in the journal Joule\r\n, scientists explained ho… [+3503 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Stunning Photos Show Construction of World’s Largest Telescope - PetaPixel", "description": "Building work has reached its highest point.", "url": "https://petapixel.com/2025/04/24/stunning-photos-show-construction-of-extremely-large-telescope-eso/", "urlToImage": "https://petapixel.com/assets/uploads/2025/04/ELT2.jpg", "publishedAt": "2025-04-24T11:52:21Z", "content": "A side-by-side view of the Extremely Large Telescope in August 2023, left, and April 12, 2025, right. | E. Garcés/ESO\r\nThe European Southern Observatory (ESO) has shared spectacular progress photos o… [+2720 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Thanks to the SWOT satellite, NASA has revealed the most precise map of the ocean floor ever created! - Farmingdale Observer", "description": "The NASA's SWOT satellite has revolutionized how we understand the ocean floor, creating unprecedented detailed seafloor maps that reveal hidden underwater landscapes. Launched in December 2022, the Surface Water and Ocean Topography mission has transformed m…", "url": "https://farmingdale-observer.com/2025/04/24/thanks-to-the-swot-satellite-nasa-has-revealed-the-most-precise-map-of-the-ocean-floor-ever-created/", "urlToImage": null, "publishedAt": "2025-04-24T11:46:00Z", "content": "The NASA‘s SWOT satellite has revolutionized how we understand the ocean floor, creating unprecedented detailed seafloor maps that reveal hidden underwater landscapes. Launched in December 2022, the … [+4497 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Still Body, Submerged in Layers of Sediment… Could This Cougar Be Fossilizing? - The Daily Galaxy", "description": "A cougar found eerily preserved beneath a frozen Canadian lake has sparked viral fascination online. Its peaceful pose and sediment-covered body suggest something far more ancient at play.", "url": "https://dailygalaxy.com/2025/04/a-still-body-submerged-in-layers-of-sediment-could-this-cougar-be-fossilizing/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/a-cougar-lying-serenely-at-the-bottom-of-a-lake.jpg", "publishedAt": "2025-04-24T11:00:00Z", "content": "An arresting photograph showing a cougar lying serenely at the bottom of a lake has circulated widely online, with many believing it captures the first steps in the animals fossilization. While visua… [+3722 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Dark matter search: Dimming starlight may signal passage of dark compact objects - Phys.org", "description": "The detection of dark matter, an elusive form of matter believed to account for most of the universe's mass, remains a long-standing goal within the physics research community. As this type of matter can only emit, reflect or absorb light very weakly, it cann…", "url": "https://phys.org/news/2025-04-dark-dimming-starlight-passage-compact.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-new-approach-to-sear-1.jpg", "publishedAt": "2025-04-24T10:40:01Z", "content": "The detection of dark matter, an elusive form of matter believed to account for most of the universe's mass, remains a long-standing goal within the physics research community. As this type of matter… [+4180 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Brandon Boesch", "title": "When AIs do science, it will be strange and incomprehensible - Aeon", "description": "When AI takes over the practice of science we will likely find the results strange and incomprehensible. Should we worry?", "url": "https://aeon.co/essays/when-ais-do-science-it-will-be-strange-and-incomprehensible", "urlToImage": "https://images.aeonmedia.co/images/03742822-3ab0-4169-97a7-aacc6d38eaae/essay-gettyimages-499163175.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-04-24T10:00:35Z", "content": "The science of our age is computational. Without models, simulations, statistical analysis, data storage and so on, our knowledge of the world would grow far more slowly. For decades, our fundamental… [+17732 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Katarina Zimmer", "title": "'Its strength is its simplicity': The benefits of cleaning with vinegar - BBC", "description": "Katarina Zimmer put vinegar to the test as a cleaning product and discovered a wide range of benefits, for people and the planet.", "url": "https://www.bbc.com/future/article/20250423-is-vinegar-safer-and-more-sustainable-than-other-cleaning-products", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0l616zp.jpg", "publishedAt": "2025-04-24T09:02:26Z", "content": "Katarina Zimmer put vinegar to the test as a cleaning product and discovered a wide range of benefits, for people and the planet.\r\nA few months ago in my new Berlin apartment, my toilet and I were at… [+11087 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Iceberg tracks found off UK coast could shed light on Antarctica - BBC", "description": "Deep tracks gouged in the seafloor off the coast of Scotland could help us understand Antarctica today.", "url": "https://www.bbc.com/news/articles/cm2xz664r2do", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/c8d6/live/a83c2fa0-20ed-11f0-9c65-a5c3dc449bf3.jpg", "publishedAt": "2025-04-24T09:00:09Z", "content": "Mark Poynting and Georgina Rannard\r\nIcebergs as large as cities, potentially tens of kilometres wide, once roved the coasts of the UK, according to scientists.\r\nResearchers found distinctive scratch … [+4598 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "One Orbit, One Everest Lost: A Planet Evaporates Into a 9-Million-Kilometer Tail - SciTechDaily", "description": "Astronomers from MIT have uncovered a dramatic celestial spectacle: a Mercury-sized exoplanet that is rapidly disintegrating as it orbits perilously close to its star. The small and rocky lava world sheds an amount of material equivalent to the mass of Mount …", "url": "https://scitechdaily.com/?p=471900", "urlToImage": "https://scitechdaily.com/images/Disintegrating-Planet-Art-Concept.jpg", "publishedAt": "2025-04-24T08:24:39Z", "content": "A planet 140 light-years away is rapidly disintegrating, shedding mineral-rich debris as it orbits its star in just 30.5 hours. Discovered by MIT researchers via NASA’s TESS, it offers a rare chance … [+7781 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Moonscapes of Idaho - NASA Earth Observatory (.gov)", "description": "The volcanic features and otherworldly landscape of Craters of the Moon National Monument and Preserve are apt training grounds for planetary exploration.", "url": "https://earthobservatory.nasa.gov/images/154207/moonscapes-of-idaho", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/154000/154207/idaho_cratersmoonnp_oli2_20250123_th.jpg", "publishedAt": "2025-04-23T22:07:30Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "JooHyeon Heo", "title": "Video game-inspired algorithm rapidly detects high-energy particle collisions for future fusion reactors - Phys.org", "description": "An innovative algorithm for detecting collisions of high-speed particles within nuclear fusion reactors has been developed, inspired by technologies used to determine whether bullets hit targets in video games. This advancement enables rapid predictions of co…", "url": "https://phys.org/news/2025-04-video-game-algorithm-rapidly-high.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/video-game-inspired-al-1.jpg", "publishedAt": "2025-04-23T20:59:03Z", "content": "An innovative algorithm for detecting collisions of high-speed particles within nuclear fusion reactors has been developed, inspired by technologies used to determine whether bullets hit targets in v… [+3878 chars]"}, {"source": {"id": null, "name": "Sustainability-times.com"}, "author": "Rosemary Potter", "title": "“Faster Than Anything Ever Seen”: Mind-Blowing Speed of Quantum Entanglement Measured for the First Time in Scientific History - Sustainability Times", "description": "IN A NUTSHELL 🔬 Scientists have measured the speed of quantum entanglement for the first time, marking a major milestone in quantum physics. 💡 The study uses attosecond precision to track electron motion, offering unprecedented insight into quantum dynamics…", "url": "https://www.sustainability-times.com/in-depth/faster-than-anything-ever-seen-mind-blowing-speed-of-quantum-entanglement-measured-for-the-first-time-in-scientific-history/", "urlToImage": "https://www.sustainability-times.com/wp-content/uploads/2025/04/faster-than-light-scientists-measure-mind-blowing-speed-of-quantum-entanglement-for-the-first-time-in-history.jpg", "publishedAt": "2025-04-23T20:05:17Z", "content": "<table><tr><td>IN A NUTSHELL</td></tr><tr><td><ul><li> Scientists have measured the speed of quantum entanglement for the first time, marking a major milestone in quantum physics.</li><li> The study … [+5966 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "However Life Got Started on Earth, it Didn't Take Long - Universe Today", "description": "At some early point in Earth's history, a collection of increasingly complex chemicals performed a new trick. They transformed themselves somehow into an energy-producing and self-replicating cell. The timing of this critical moment in Earth's history is hidd…", "url": "https://www.universetoday.com/articles/however-life-got-started-on-earth-it-didnt-take-long", "urlToImage": "https://www.universetoday.com/assets/earlyearth.jpg__1240x510_q85_subject_location-350,345_subsampling-2.jpg", "publishedAt": "2025-04-23T20:00:01Z", "content": "At some early point in Earth's history, a collection of increasingly complex chemicals performed a new trick. They somehow transformed themselves, with help from a jolt of energy, into an energy-prod… [+6836 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "TESS detects new sub-Neptune exoplanet more than three times larger than Earth - Phys.org", "description": "Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers have detected a new sub-Neptune exoplanet orbiting a bright G-type star. The newfound alien world, designated TOI-3493 b is more than three times larger and about …", "url": "https://phys.org/news/2025-04-tess-neptune-exoplanet-larger-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/tess-detects-new-sub-n.jpg", "publishedAt": "2025-04-23T18:59:25Z", "content": "Using NASA's Transiting Exoplanet Survey Satellite (TESS), an international team of astronomers have detected a new sub-Neptune exoplanet orbiting a bright G-type star. The newfound alien world, desi… [+3068 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "NASA Takes Advantage of Planetary Alignment to Take a Peek at Uranus - Gizmodo", "description": "A stellar occultation this month gave scientists an opportunity to scrutinize the seventh planet from the Sun.", "url": "https://gizmodo.com/nasa-takes-advantage-of-planetary-alignment-to-take-a-peek-at-uranus-2000593355", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/uranus-webb.jpg", "publishedAt": "2025-04-23T17:35:31Z", "content": "On April 7, Uranus passed in front of a distant star located 400 light-years away, giving NASA scientists a rare cosmic alignment in which to investigate the distant ice giant.\r\nDuring the hour-long … [+2735 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Bacteria Found in Earth’s Ice Could Mean Life Exists on Mars – Here’s How! - The Daily Galaxy", "description": "Could Mars be harboring life beneath its icy surface? New research suggests that microbial life might be surviving in the planet's mid-latitude ice, opening up exciting possibilities for future missions.", "url": "https://dailygalaxy.com/2025/04/bacteria-found-earth-ice-life-exists-mars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Bacteria-Found-in-Earths-Ice-Could-Mean-Life-Exists-on-Mars-–-Heres-How.jpg", "publishedAt": "2025-04-23T17:00:00Z", "content": "Mars, today a cold, irradiated, and dry world, once had a much warmer and wetter environment. The planet was covered by lakes, rivers, and even an ocean in its northern hemisphere. The latest researc… [+2801 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dark Matter May Be Older Than the Universe—And It Might Live Forever - The Daily Galaxy", "description": "Is dark matter the key to unlocking the universe's deepest mysteries? New research hints that this invisible force might be older than the universe and could live forever.", "url": "https://dailygalaxy.com/2025/04/dark-matter-may-be-older-than-the-universe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Dark-Matter-May-Be-Older-Than-the-Universe—And-It-Might-Live-Forever.jpg", "publishedAt": "2025-04-23T16:30:00Z", "content": "Dark matter, the invisible substance that makes up a significant portion of the universe, continues to puzzle scientists. For years, weve known it exists due to its gravitational effects on stars and… [+3260 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "NASA's Lucy spacecraft gets first images of 'strikingly complicated' asteroid that will shed light on early solar system - Live Science", "description": "NASA has released the Lucy spacecraft's first close-up images of asteroid Donaldjohanson, revealing a peanut-shaped rock that could shed light on how planets formed in our solar system.", "url": "https://www.livescience.com/space/asteroids/nasas-lucy-spacecraft-snaps-first-close-ups-of-weird-peanut-shaped-asteroid", "urlToImage": "https://cdn.mos.cms.futurecdn.net/teqXVr92pXcW9XgmhZ9fEn.gif", "publishedAt": "2025-04-23T16:09:58Z", "content": "NASA's Lucy spacecraft has captured its first high-resolution images of an asteroid, revealing a bizarrely shaped 150-million-year-old space rock.\r\nThe asteroid Donaldjohanson formed when two smaller… [+3717 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA Airborne Sensor’s Wildfire Data Helps Firefighters Take Action - NASA (.gov)", "description": "Data from the AVIRIS-3 sensor was recently used to create detailed fire maps in minutes, enabling firefighters in Alabama to limit the spread of wildfires and", "url": "https://www.nasa.gov/science-research/earth-science/nasa-airborne-sensors-wildfire-data-helps-firefighters-take-action/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/04/1-pia26497-castleberry.jpg", "publishedAt": "2025-04-23T15:48:16Z", "content": "Data from the AVIRIS-3 sensor was recently used to create detailed fire maps in minutes, enabling firefighters in Alabama to limit the spread of wildfires and save buildings. \r\nA NASA sensor recently… [+5862 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Republican space officials criticize “mindless” NASA science cuts - Ars Technica", "description": "“Heliophysics is the most unknown—and underrated—part of NASA’s science program.”…", "url": "https://arstechnica.com/space/2025/04/republican-space-officials-criticize-mindless-nasa-science-cuts/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2013/03/the_sun-670x648.jpg", "publishedAt": "2025-04-23T14:55:17Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Extreme 'zombie star' capable of ripping human atoms apart is shooting through the Milky Way - Live Science", "description": "Astronomers have discovered that the magnetar SGR 0501+4516 is speeding through our galaxy at more than 110,000 mph. This unusually fast speed hints that it was not born as expected, which could help explain the puzzling origin of some fast radio bursts.", "url": "https://www.livescience.com/space/astronomy/extreme-zombie-star-capable-of-ripping-human-atoms-apart-is-shooting-through-the-milky-way-and-nobody-knows-where-it-came-from", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PevV32SyhwxdCCojNCkacU.jpg", "publishedAt": "2025-04-23T14:37:28Z", "content": "Astronomers have spotted an immensely powerful \"zombie star\" shooting through the Milky Way at more than 110,000 mph (177,000 km/h). The stellar cannonball, which has a magnetic field capable of ripp… [+4112 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "\"Incredible Dinosaur Discovery\": Three Boys Found A Teenage T. Rex On A Simple Hike - The Daily Galaxy", "description": "Three young boys uncovered a rare teenage T.Rex fossil during a hike in the North Dakota Badlands, leading to an astonishing paleontological discovery.", "url": "https://dailygalaxy.com/2025/04/three-boys-found-t-rex-on-a-simple-hike/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Incredible-Dinosaur-Discovery-Three-Boys-Found-A-Teenage-T.-Rex-On-A-Simple-Hike.jpg", "publishedAt": "2025-04-23T13:36:48Z", "content": "In an unexpected turn of events, three young boys uncovered the remains of a teenage Tyrannosaurus rex while hiking in the North Dakota Badlands. What initially seemed like a simple outdoor adventure… [+3038 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Lyrid meteor shower 2025 delights stargazers with the help of a dramatic fireball display (photos) - Space", "description": "The Lyrids 2025 did not disappoint, and we've got the photos to prove it!", "url": "https://www.space.com/stargazing/meteors-showers/lyrid-meteor-shower-2025-delights-stargazers-with-the-help-of-a-dramatic-fireball-display-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7BTWHYqssULWaP5v2xK3Dm.jpg", "publishedAt": "2025-04-23T13:29:12Z", "content": "The Lyrid meteor shower put on a spectacular show, delighting sky watchers overnight with a peak rate of 10 to 20 meteors per hour.\r\nThe Lyrids occur each year between April 16-25 as Earth passes thr… [+5751 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chicago Tribune Editorial Board", "title": "The Webb Telescope is making incredible discoveries: It may go dark - Phys.org", "description": "The political news these days is enough to make some Chicagoans wish they were a million miles away. But consider this: Even in the depths of space, there's no escape from politics.", "url": "https://phys.org/news/2025-04-webb-telescope-incredible-discoveries-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/james-webb-space-teles-2.jpg", "publishedAt": "2025-04-23T13:20:35Z", "content": "The political news these days is enough to make some Chicagoans wish they were a million miles away. But consider this: Even in the depths of space, there's no escape from politics.\r\nThe $10 billion … [+5703 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "American Chemical Society", "title": "Scientists have found a way to 'tattoo' tardigrades - Phys.org", "description": "If you haven't heard of a tardigrade before, prepare to be wowed. These clumsy, eight-legged creatures, nicknamed water bears, are about half a millimeter long and can survive practically anything: freezing temperatures, near starvation, high pressure, radiat…", "url": "https://phys.org/news/2025-04-scientists-tattoo-tardigrades.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/scientists-have-found.jpg", "publishedAt": "2025-04-23T13:20:04Z", "content": "If you haven't heard of a tardigrade before, prepare to be wowed. These clumsy, eight-legged creatures, nicknamed water bears, are about half a millimeter long and can survive practically anything: f… [+3820 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kirstin Werner", "title": "It's about (space-)time: Scientists explore new dimension for light - Phys.org", "description": "By breaking a decades-old paradigm and rethinking the role that the dimension of time plays in physics, researchers from the University of Rostock and the University of Birmingham have discovered novel flashes of light that come from and go into nothingness—l…", "url": "https://phys.org/news/2025-04-space-scientists-explore-dimension.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/its-about-space-time-s.jpg", "publishedAt": "2025-04-23T12:53:03Z", "content": "By breaking a decades-old paradigm and rethinking the role that the dimension of time plays in physics, researchers from the University of Rostock and the University of Birmingham have discovered nov… [+3601 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "daniel.graham@ourmedia.co.uk", "title": "\"I thought, what's that?\" Hiker makes extraordinary discovery in Sequoia National Park - BBC Wildlife Magazine", "description": "Ecologist Professor Hugh Safford was walking in California's High Sierra when he stumbled across a truly unlikely thing.", "url": "https://www.discoverwildlife.com/plant-facts/trees/jeffrey-pine-sequoia-national-park", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2025/04/Jeffrey-pine-in-Sequoia-National-Park.jpeg?w=1200", "publishedAt": "2025-04-23T12:22:47Z", "content": "While hiking on the slopes of Mount Kaweah in Sequoia National Park last September, Professor Hugh Safford, a forest ecologist at the University of California Davis, made a surprising discovery. At o… [+4836 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Miguel Claro", "title": "Gorgeous deep space photo captures the Andromeda Galaxy surrounded by glowing gas - Space", "description": "Spanning approximately 220,000 light-years across, the Andromeda Galaxy is the largest galaxy of the Local Group, which also contains the Milky Way.", "url": "https://www.space.com/stargazing/gorgeous-deep-space-photo-captures-andromeda-galaxy-surrounded-by-stars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yC3vfyjSoYFvJsu3Ln3nSD.jpg", "publishedAt": "2025-04-23T10:00:00Z", "content": "Miguel Claro is a professional photographer, author and science communicator based in Lisbon, Portugal, who creates spectacular images of the night sky. As a European Southern Observatory Photo Ambas… [+3356 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Climate change is now impacting Earth's rotation - Earth.com", "description": "Climate change is shifting Earth’s spin axis. Melting ice sheets and groundwater loss cause the pole to drift, possibly by 27 meters by 2100.", "url": "https://www.earth.com/news/climate-change-is-now-impacting-earths-rotation/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/22014344/Climate-change-is-now-impacting-the-Earths-rotation-1.jpg", "publishedAt": "2025-04-23T09:04:47Z", "content": "Earth’s rotation feels steady, but beneath that illusion of constancy lies a subtle truth: the planets spin is shifting. The axis around which Earth rotates isnt fixed. It wanders, sways, and drifts.… [+7458 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Astronomers discover dark matter 'bridge' linking colliding galaxies: 'This is the missing piece we've been looking for.' - Space", "description": "\"All the odd shapes and swirling gas observed in the Perseus cluster now make sense within the context of a major merger.\"", "url": "https://www.space.com/the-universe/astronomers-discover-dark-matter-bridge-linking-colliding-galaxies-this-is-the-missing-piece-weve-been-looking-for", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UF5pqxymgkzmhuAvBTdeJA.png", "publishedAt": "2025-04-23T09:00:00Z", "content": "Astronomers have discovered a long-missing element of a galactic collision involving the Perseus galaxy cluster, located 240 million light-years from Earth. \r\nThis element, a newly detected \"subclust… [+3851 chars]"}]}