{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Farmersalmanac.com"}, "author": "Joe Rao, Joe Rao", "title": "How To See The New \"Green\" Comet - Farmers' Almanac", "description": "A \"super rare\" and \"bright green\" comet will soon be visible, but will Comet ZTF live up to the hype? Learn when and where to ...", "url": "https://www.farmersalmanac.com/how-to-see-the-new-green-comet", "urlToImage": "https://www.farmersalmanac.com/wp-content/uploads/2023/01/comet-rare-sky-event.jpg", "publishedAt": "2023-01-16T10:43:48Z", "content": "Newly-discovered Comet ZTF is coming the closest to the Sun in 50,000 years, becoming visible to the naked eye, and making big headlines. Some are calling it a “super rare” and “bright green” comet, … [+5782 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Can humanity's new giant leap into space succeed? - BBC", "description": "Humanity is set for its next big leap into space with nations and private companies racing to build outposts on other worlds", "url": "https://www.bbc.com/news/science-environment-64039146", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/100C/production/_128080140_mediumrocket.jpg", "publishedAt": "2023-01-16T00:05:13Z", "content": "There is a new order emerging in space - a race between America and China. But with the demands of space exploration, even these great superpowers won't be able to do it alone. \r\nHugely technically c… [+9152 chars]"}, {"source": {"id": null, "name": "WESH Orlando"}, "author": "Scott Heidler", "title": "SpaceX launches Falcon Heavy from Cape Canaveral - WESH 2 Orlando", "description": "This is the fifth Falcon Heavy launch and there are four more planned for this year.", "url": "https://www.wesh.com/article/spacex-falcon-heavy-launch-florida/42513969", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/falconheavy-jpg-1673824741.jpg?crop=0.837xw:1.00xh;0.0881xw,0&resize=1200:*", "publishedAt": "2023-01-15T23:56:00Z", "content": "BREVARD COUNTY, Fla. —SpaceX completed the launch of the Falcon Heavy rocket from the Space Coast. \r\nWith five million pounds of thrust, experts say the Heavy is the largest and most powerful rocket … [+1265 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA’s Webb Telescope Confirms First Exoplanet - VOA Learning English", "description": "NASA’s James Webb Space Telescope has made its first confirmation of an exoplanet.", "url": "https://learningenglish.voanews.com/a/nasa-s-webb-telescope-confirms-first-exoplanet/6916060.html", "urlToImage": "https://gdb.voanews.com/03370000-0aff-0242-85ab-08daf4e3be7f_w1200_r1.jpg", "publishedAt": "2023-01-15T22:01:04Z", "content": "NASAs James Webb Space Telescope has made its first confirmation of an exoplanet. An exoplanet is a planet that orbits a star outside our solar system.\r\nThe American space agency says the exoplanet i… [+4698 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Orbit of Doom: The Surprising Connection Between Earth's Orbital Patterns and an Ancient Warming Event - SciTechDaily", "description": "An international team of scientists has suggested that changes in Earth's orbit that resulted in hotter conditions may have played a role in triggering a rapid global warming event that occurred 56 million years ago. This event, known as the Paleocene-Eocene …", "url": "https://scitechdaily.com/orbit-of-doom-the-surprising-connection-between-earths-orbital-patterns-and-an-ancient-warming-event/", "urlToImage": "https://scitechdaily.com/images/Future-Earth-Global-Warming.jpg", "publishedAt": "2023-01-15T17:33:28Z", "content": "ByPenn StateJanuary 15, 2023\r\nAn international team of scientists has found that changes in Earths orbit that favored hotter conditions may have helped trigger a rapid global warming event 56 million… [+5845 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ramish Zafar", "title": "NASA Captures Star Eaten By Black Hole 300 Million Light Years Away - Wccftech", "description": "NASA captures a black hole eating up a start 300 million light years away. Take a look here for more details!", "url": "https://wccftech.com/nasa-captures-star-eaten-by-black-hole-300-million-light-years-away/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/01/NASA-BLACK-HOLE-STAR-SUCK.png", "publishedAt": "2023-01-15T12:47:00Z", "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\r\nThe National Aeronautics and Space Administration (NASA) ha… [+3484 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "NASA's Lunar Gateway space station will be so tiny that astronauts won't be able to stand - Daily Mail", "description": "René Waclavicek, a space architect and design researcher at Austria-based LIQUIFER Space Systems, said the Lunar Gateway living quarters would total about 280 cubic feet.", "url": "https://www.dailymail.co.uk/sciencetech/article-11624059/NASAs-Lunar-Gateway-space-station-tiny-astronauts-wont-able-stand.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/13/19/66555369-0-image-a-21_1673637406967.jpg", "publishedAt": "2023-01-15T09:40:43Z", "content": "Orbiting at 250 miles above the Earth, the International Space Station (ISS) has been integral to a bucket load of research over the past 25 years.\r\nSurrounded by a dizzying number of controls and ex… [+9431 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "NASA Satellite Shows How We Can Track Local CO2 Emissions From Space - ScienceAlert", "description": "In 2013, the National Oceanic and Atmospheric Administration (NOAA) reported that atmospheric concentrations of carbon dioxide (CO2) had reached 400 parts per million (ppm) for the first time since the Pliocene Era (ca.", "url": "https://www.sciencealert.com/nasa-satellite-shows-how-we-can-track-local-co2-emissions-from-space", "urlToImage": "https://www.sciencealert.com/images/2023/01/CarbonDioxideEmissionsMapASwirlOfRedsBluesYellows.jpg", "publishedAt": "2023-01-15T02:01:00Z", "content": "In 2013, the National Oceanic and Atmospheric Administration (NOAA) reported that atmospheric concentrations of carbon dioxide (CO2) had reached 400 parts per million (ppm) for the first time since t… [+5151 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New MIT Research Indicates That Automation Is Responsible for Income Inequality - SciTechDaily", "description": "Recent data suggests that the majority of the increase in the wage gap since 1980 can be attributed to automation replacing less-educated workers. When using self-checkout machines in supermarkets and drugstores, it is unlikely that you are bagging your purch…", "url": "https://scitechdaily.com/new-mit-research-indicates-that-automation-is-responsible-for-income-inequality/", "urlToImage": "https://scitechdaily.com/images/Income-Inequality-Concept.jpg", "publishedAt": "2023-01-14T23:07:34Z", "content": "ByPeter Dizikes, Massachusetts Institute of TechnologyJanuary 14, 2023\r\nA newly published paper quantifies the extent to which automation has contributed to income inequality in the U.S., simply by r… [+7345 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Julia Musto", "title": "NASA unveils plan for next-gen telescope to search space for signs of life: reports - Yahoo News", "description": "NASA reportedly unveiled a plan to construct a successor to the James Webb Space Telescope, announcing the Habitable Worlds Observatory early last week at a ...", "url": "https://news.yahoo.com/nasa-unveils-plan-next-gen-184646839.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/UsVrKjLoLU50KVI4o0Pc2w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_news_text_979/93b0cc148be99eeeb989169a3ac38e8a", "publishedAt": "2023-01-14T18:46:46Z", "content": "NASA has reportedly shed light on a new plan to build a successor to the James Webb Space Telescope,\r\nThe Habitable Worlds Observatory was announced Monday at the latest American Astronomical Society… [+1979 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Reuters", "title": "Russia sets new contingency plan for crew of damaged space capsule - KSL.com", "description": "Russia's space agency Roscosmos announced new contingency plans on Saturday for the three crew of a damaged capsule docked to the International Space Station, saying the U.S. member of the trio would return to Earth in a separate SpaceX vessel if they needed …", "url": "https://www.ksl.com/article/50557739/russia-sets-new-contingency-plan-for-crew-of-damaged-space-capsule", "urlToImage": "https://img.ksl.com/slc/2910/291086/29108653.JPG?filter=kslv2/responsive_story_lg", "publishedAt": "2023-01-14T17:22:51Z", "content": "Estimated read time: 2-3 minutes\r\nMOSCOW Russia's space agency Roscosmos announced new contingency plans on Saturday for the three crew of a damaged capsule docked to the International Space Station,… [+1957 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Briley Lewis", "title": "After the James Webb Space Telescope, what's the next big thing for astronomers? - Space.com", "description": "John Mather spent decades making the James Webb Space Telescope a reality. Here's what he thinks could come next.", "url": "https://www.space.com/james-webb-space-telescope-what-next-john-mather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/X8irpHempBixL3nUN8nqtV-1200-80.jpg", "publishedAt": "2023-01-14T15:00:32Z", "content": "What takes over 20,000 engineers and hundreds of scientists to build? A space telescope — specifically, the James Webb Space Telescope. \r\nThankfully, the effort was well worthwhile, with a plethora o… [+4269 chars]"}]}