{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope peers into lonely dwarf galaxy with sparkling results - Space.com", "description": "At 3 million light-years from Earth, the isolated dwarf galaxy Wolf–Lundmark–Melotte has remained unchanged by interactions with other galaxies.", "url": "https://www.space.com/james-webb-space-telescope-wlm-dwarf-galaxy-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pAp9tyrNAVaAbXrHvtNWNV-1200-80.png", "publishedAt": "2022-11-11T15:00:05Z", "content": "The most powerful space telescope currently operating has zoomed in on a lonely dwarf galaxy in our galactic neighborhood, imaging it in stunning detail. \r\nAt around 3 million light-years from Earth,… [+4535 chars]"}, {"source": {"id": null, "name": "WESH Orlando"}, "author": null, "title": "Artemis, NASA’s moon rocket, gets hammered by 100 mph wind gusts from Nicole - WESH 2 Orlando", "description": "“That’s beyond the design limits of the rocket to ride out a storm.”", "url": "https://www.wesh.com/article/nicole-nasa-artemis-rocket-florida/41922479", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/gettyimages-1668091035.jpg?crop=1.00xw:0.846xh;0,0&resize=1200:*", "publishedAt": "2022-11-11T14:30:00Z", "content": "BREVARD COUNTY, Fla. —Powerful wind gusts from Tropical Storm Nicole have pounded NASAs moon rocket, creating a cause for concern for the safety of the ship. \r\nNASAs Artemis moon rocket was left outs… [+1235 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Scientists discover massive 'extragalactic structure' behind the Milky Way - Livescience.com", "description": "An uncharted region of space known as the \"zone of avoidance\" lurks behind the Milky Way's center – and astronomers just found an enormous, multi-galaxy structure there.", "url": "https://www.livescience.com/zone-of-avoidance-giant-structure", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7gjkofEhz8tjKZF6QgQRKg-1200-80.jpg", "publishedAt": "2022-11-11T13:00:00Z", "content": "Astronomers have detected an enormous extragalactic structure hiding in an uncharted region of space far beyond the Milky Way\r\n's center.\r\nThis phantom region, known as the zone of avoidance, is a bl… [+2469 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Nicioli", "title": "Northern Taurid fireballs can be seen all November long - CNN", "description": "The Taurid \"swarm\" is still going strong this month, with bright meteors known as fireballs visible across the world in the night sky. The Northern Taurids, the second stream of the shower, are predicted to peak this Saturday.", "url": "https://www.cnn.com/2022/11/11/world/north-taurids-meteor-shower-fireballs-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221108103159-north-taurids-meteor-shower-fireballs-2015-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-11T12:29:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe Taurid swarm is still going strong this month, wit… [+3510 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Murphy", "title": "'One of the greatest damn mysteries of physics': The most precise astronomical test of electromagnetism yet - Phys.org", "description": "There's an awkward, irksome problem with our understanding of nature's laws which physicists have been trying to explain for decades. It's about electromagnetism, the law of how atoms and light interact, which explains everything from why you don't fall throu…", "url": "https://phys.org/news/2022-11-greatest-damn-mysteries-physics-precise.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/one-of-the-greatest-da.jpg", "publishedAt": "2022-11-11T08:01:19Z", "content": "There's an awkward, irksome problem with our understanding of nature's laws which physicists have been trying to explain for decades. It's about electromagnetism, the law of how atoms and light inter… [+5630 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Scientists Tested Einstein's Relativity on a Cosmic Scale, And Found Something Odd - ScienceAlert", "description": "Everything in the Universe has gravity – and feels it too.", "url": "https://www.sciencealert.com/scientists-tested-einsteins-relativity-on-a-cosmic-scale-and-found-something-odd", "urlToImage": "https://www.sciencealert.com/images/2022/11/GalaxyWhirlpoolMap.jpg", "publishedAt": "2022-11-11T00:04:03Z", "content": "Everything in the Universe has gravity and feels it too. Yet this most common of all fundamental forces is also the one that presents the biggest challenges to physicists.\r\nAlbert Einstein's theory o… [+6351 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Strange Mystery of 'Missing' Planets Across Space May Be Solved - ScienceAlert", "description": "Today, the number of confirmed exoplanets stands at 5,197 in 3,888 planetary systems, with another 8,992 candidates awaiting confirmation.", "url": "https://www.sciencealert.com/strange-mystery-of-missing-planets-across-space-may-be-solved", "urlToImage": "https://www.sciencealert.com/images/2022/11/GasGiantPlanetsOrbitingAStar.jpg", "publishedAt": "2022-11-10T23:44:01Z", "content": "Today, the number of confirmed exoplanets stands at 5,197 in 3,888 planetary systems, with another 8,992 candidates awaiting confirmation.\r\nThe majority have been particularly massive planets, rangin… [+4654 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Squid and Octopus Get Their Big Brains - Neuroscience News", "description": "Neural stem cells of cephalopods act in a similar way to those of vertebrates during nervous system development.", "url": "https://neurosciencenews.com/cephalopod-brain-21817/", "urlToImage": "https://neurosciencenews.com/files/2022/11/octopus-brain-neurosicnes-public.jpg", "publishedAt": "2022-11-10T22:40:58Z", "content": "Summary: Neural stem cells of cephalopods act in a similar way to those of vertebrates during nervous system development.\r\nSource: Harvard\r\nCephalopods which include octopus, squid, and their cuttlef… [+7070 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Telescope, Moon Rocket Named TIME Inventions of 2022 - NASA", "description": "NASA’s James Webb Space Telescope and Space Launch System (SLS) rocket were named 2022 TIME Inventions of the Year.", "url": "https://www.nasa.gov/feature/nasa-telescope-moon-rocket-named-time-inventions-of-2022/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/48936479373_aedba34e60_o.jpg", "publishedAt": "2022-11-10T22:24:42Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "'Fuzzy' dark matter might make stars form in giant 'pancakes' - Space.com", "description": "A model of exotic dark matter suggests that the first stars may have formed not as individuals, but as tiny pockets embedded in gigantic, pancake-like sheets.", "url": "https://www.space.com/fuzzy-dark-matter-oldest-star-formation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/o7mWzkqvJ2JXNAoPtdvcS3-1200-80.jpg", "publishedAt": "2022-11-10T21:00:38Z", "content": "A model of exotic dark matter suggests that the first stars may have formed not as individuals, but as tiny pockets embedded in gigantic, pancake-like sheets. This would have led to the formation of … [+5539 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Footprints indicate human presence in Spain in Middle Pleistocene, 200,000 years earlier than previously thought - Phys.org", "description": "Researcher and GRS Radioisotopes technician Jorge Rivera, from the University of Seville, has participated in an incredible discovery that is unique in Europe. After applying an optically-stimulated luminescence technique at the Center for Research, Technolog…", "url": "https://phys.org/news/2022-11-footprints-human-presence-spain-middle.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/footprints-indicate-hu.jpg", "publishedAt": "2022-11-10T20:44:59Z", "content": "Researcher and GRS Radioisotopes technician Jorge Rivera, from the University of Seville, has participated in an incredible discovery that is unique in Europe. After applying an optically-stimulated … [+5791 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Find That Gay Men Are Twice As Likely To Have This Disease - SciTechDaily", "description": "The research will enable the development of individualized, precision medicine for the management of inflammatory bowel disease in this underrepresented minority patient group. According to a recent study from Case Western Reserve University and University Ho…", "url": "https://scitechdaily.com/scientists-find-that-gay-men-are-twice-as-likely-to-have-this-disease/", "urlToImage": "https://scitechdaily.com/images/Stomach-Pain-Crohns-Bowel-Diarrhea.jpg", "publishedAt": "2022-11-10T20:44:15Z", "content": "The study found that 0.8% of same-sex patients with high-risk sexual activity were diagnosed with Crohns disease, while only 0.49 heterosexual men who engaged in high-risk sexual activity had Crohns … [+3942 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Single Hubble image captured supernova at three different times - Ars Technica", "description": "An image taken in 2010 captured the lensed supernova, but nobody noticed.", "url": "https://arstechnica.com/science/2022/11/single-hubble-image-captured-supernova-at-three-different-times/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/11/image-760x380.png", "publishedAt": "2022-11-10T20:27:24Z", "content": "Enlarge/ On the left, the full Hubble image. On the right, different images of the gravitationally lensed object.\r\n0 with 0 posters participating\r\nOver the last few decades, we've gotten much better … [+5195 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Anthony Wood", "title": "NASA's Inflatable Heat Shield Survives Atmospheric Trial by Fire - IGN", "description": "NASA has successfully completed an orbital test of the inflatable heat shield that could one day help land humans on Mars.", "url": "https://www.ign.com/articles/nasa-inflatable-heat-shield-atmospheric-reentry", "urlToImage": "https://assets-prd.ignimgs.com/2022/11/10/loftid-blogroll-1668106540179.jpg?width=1280", "publishedAt": "2022-11-10T19:14:05Z", "content": "NASA has successfully flown an inflatable heat shield down through Earths atmosphere, in a technology demonstration that could one day help safely land spacecraft on the surface of Mars and beyond.\r\n… [+4176 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's IXPE Finds Magnetar Has Powerful Magnetic Fields, Solid Crust - NASA", "description": "Observations of a neutron star have led to confirmation of what scientists have only previously theorized: magnetars have ultra-strong magnetic fields and are highly polarized.", "url": "https://www.nasa.gov/mission_pages/ixpe/news/2022/nasa-s-ixpe-finds-powerful-magnetic-fields-and-solid-crust-at-neutron-star.html", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ixpelocation4u.jpg", "publishedAt": "2022-11-10T18:27:46Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Devlin", "title": "‘Overweight’ neutron star defies a black hole theory, say astronomers - The Guardian", "description": "Exclusive: Gamma-ray burst from colliding stars unexpectedly gave way to day-long sight of hypermassive body", "url": "https://www.theguardian.com/science/2022/nov/10/overweight-neutron-star-defies-a-black-hole-theory-say-astronomers", "urlToImage": "https://i.guim.co.uk/img/media/3df6b440ffa42a6fb3869b519408f73f22c65f62/0_225_6739_4044/master/6739.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cc8e12e794ecd5cb4730ca60997843f0", "publishedAt": "2022-11-10T16:25:00Z", "content": "An overweight neutron star has been observed by astronomers, who say the mysterious object confounds astronomical theories.\r\nThe hypermassive star was produced by the merger of two smaller neutron st… [+3585 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "3.5 billion-year-old rock structures are one of the oldest signs of life on Earth - Livescience.com", "description": "Fossils called stromatolites from Western Australia were created by microbes 3.48 billion years ago.", "url": "https://www.livescience.com/oldest-stromatolites-australia", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QXGRNP9UjshtXMr43yCVGo-1200-80.jpg", "publishedAt": "2022-11-10T15:57:38Z", "content": "Layered rocks in Western Australia are some of Earth's earliest known life, according to a new study. \r\nThe fossils in question are stromatolites, layered rocks that are formed by the excretions of p… [+3704 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "An early universe analog built in a lab in Germany - Phys.org", "description": "A team of researchers at Universität Heidelberg has built an early universe analog in their laboratory using chilled potassium atoms. In their paper published in the journal Nature, the group describes their simulator and how it might be used. Silke Weinfurtn…", "url": "https://phys.org/news/2022-11-early-universe-analog-built-lab.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/big-bang-1.jpg", "publishedAt": "2022-11-10T14:50:01Z", "content": "A team of researchers at Universität Heidelberg has built an early universe analog in their laboratory using chilled potassium atoms. In their paper published in the journal Nature, the group describ… [+2783 chars]"}, {"source": {"id": null, "name": "Stanford.edu"}, "author": "Stanford University", "title": "An epic 'gap decade' - Stanford Report - Stanford University News", "description": "Anna Mattinger spent her 20s traveling the world, living in the wilderness, training under a Shaolin monk, and creating pyrotechnics at Burning Man – among other adventures – before enrolling at Stanford this fall to study computer science and artificial inte…", "url": "https://news.stanford.edu/report/2022/11/10/stanford-students-epic-gap-decade/", "urlToImage": "https://news.stanford.edu/report/wp-content/uploads/sites/3/2022/11/N6A5634.jpg", "publishedAt": "2022-11-10T13:59:41Z", "content": "Growing up in the suburbs of Silicon Valley, Anna Mattinger felt like an aberration. She said she was a problem kid who was often restless, belligerent, and rebellious.\r\nAnna Mattinger took a gap dec… [+7033 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Atlas 5 launches weather satellite, reentry tech demo mission - SpaceNews", "description": "An Atlas 5 successfully launched a polar-orbiting weather satellite and a reentry technology demonstrator on its final flight from California.", "url": "https://spacenews.com/atlas-5-launches-weather-satellite-reentry-tech-demo-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/11/a5-jpss2.jpg", "publishedAt": "2022-11-10T12:42:35Z", "content": "Updated 7:50 a.m. Eastern with LOFTID splashdown, JPSS-2 array issue.\r\nWASHINGTON An Atlas 5 successfully launched a polar-orbiting weather satellite and a reentry technology demonstrator on the fina… [+3630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Future Sea-Level Rise May Be Much Higher Than Thought – Ice Loss in Greenland “Vastly Underestimated” - SciTechDaily", "description": "A new study combined GPS, satellite data, and numerical modeling. It found ice loss from northeast Greenland could be six times greater by the end of the century than previously thought. Ice is continuously streaming off Greenland's melting glaciers at an acc…", "url": "https://scitechdaily.com/future-sea-level-rise-may-be-much-higher-than-thought-ice-loss-in-greenland-vastly-underestimated/", "urlToImage": "https://scitechdaily.com/images/Ice-Loss-From-Northeastern-Greenland-Significantly-Underestimated.gif", "publishedAt": "2022-11-10T10:15:02Z", "content": "River of meltwater on the Zachariae Glacier, northeast Greenland. Credit: Shfaqat Abbas Khan, DTU Space\r\nA new study combined GPS, satellite data, and numerical modeling. It found ice loss from north… [+5086 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Haunting Nebula Looks Like It Wants to Consume Your Soul - CNET", "description": "The eerie image represents a spectacular way to celebrate the European Southern Observatory's 60th anniversary.", "url": "https://www.cnet.com/science/space/haunting-nebula-looks-like-it-wants-to-consume-your-soul/", "urlToImage": "https://www.cnet.com/a/img/resize/6ec28166b02f0eb7a0d2e61ab83b9bbc50727cf1/hub/2022/11/09/670041e5-045c-44e5-a10e-2b2cb0e80b09/eso2215a16x9.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-11-10T10:00:02Z", "content": "Dang, European Southern Observatory, you sure know how to celebrate an anniversary in style. Congratulations on 60 years and on the image you chose to mark the occasion: a gloriously spooky new view … [+1556 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Why Do Temperatures Get As High As 1 Billion Degrees But Only As Low As −273°C? - IFLScience", "description": "Absolute zero is very close to our comfortable range… but we wouldn’t do well there.", "url": "https://www.iflscience.com/why-do-temperatures-get-as-high-as-1-billion-degrees-but-only-as-low-as-273-c-66151", "urlToImage": "https://assets.iflscience.com/assets/articleNo/66151/aImg/63358/hot-hot-hot-meta.jpg", "publishedAt": "2022-11-10T08:37:00Z", "content": "Temperature is one of those fundamental concepts that despite our everyday experience with it, we can easily be baffled by. And this is not just true for non-experts. Temperature has been a crucial s… [+3573 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Create Crystals That Generate Electricity From Heat - SciTechDaily", "description": "A synthetic sulfide mineral with thermoelectric properties. In the effort to efficiently convert heat into electricity, easily accessible materials from harmless raw materials open up new perspectives in the development of safe and inexpensive so-called therm…", "url": "https://scitechdaily.com/scientists-create-crystals-that-generate-electricity-from-heat/", "urlToImage": "https://scitechdaily.com/images/Abstract-Red-Crystals.gif", "publishedAt": "2022-11-10T05:08:57Z", "content": "ByWileyNovember 9, 2022\r\nPrevious thermoelectric devices use expensive and toxic elements. Now scientists have created inexpensive crystals composed of copper, manganese, germanium, and sulfur that c… [+2886 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid, bigger than A 380 Airbus aircraft, heads towards Earth! NASA issues warning - HT Tech", "description": "NASA has revealed that an aircraft-sized asteroid is heading straight for Earth today! Danger looming?", "url": "https://tech.hindustantimes.com/tech/news/asteroid-bigger-than-a-380-airbus-aircraft-heads-towards-earth-nasa-issues-warning-71668055055477.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/10/1600x900/meteorite-6059746_1920_1651229787922_1668055161970_1668055161970.jpg", "publishedAt": "2022-11-10T04:39:47Z", "content": "Although smaller asteroids often make close approaches to Earth, none of them have the potential to cause any major damage if they impact the surface. According to NASA, every 2000 years, an asteroid… [+2014 chars]"}, {"source": {"id": null, "name": "Nautil.us"}, "author": "Paul M. Sutter", "title": "How I Learned to Stop Worrying and Love Uncertainty - Nautilus Magazine", "description": "I now realize Heisenberg and Schrödinger are less like physicists and more like therapists.", "url": "https://nautil.us/how-i-learned-to-stop-worrying-and-love-uncertainty-245816/", "urlToImage": "https://assets.nautil.us/sites/3/nautilus/l96ppv7l-Sutter_HERO.png?auto=compress&fm=png&ixlib=php-3.3.1", "publishedAt": "2022-11-09T23:35:43Z", "content": "Like most physicists, I spent much of my career ignoring the majority of quantum mechanics. I was taught the theory in graduate school and applied the mechanics here and there when an interesting pro… [+18582 chars]"}]}