{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Florida Today"}, "author": "Emre Kelly, Jamie Groh", "title": "SpaceX explosion: Behind the causes of Starship launch explosion - Florida Today", "description": "After SpaceX's massive Starship launched from Texas on its first full test Thursday, it began to tumble and broke apart. Here's why.", "url": "https://www.floridatoday.com/story/tech/science/space/2023/04/23/spacex-starship-explosion-what-caused-rocket-explode/70135134007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/04/20/PBRE/42fa354a-de96-49c6-a4f7-436e2f166214-SpaceX_Starship_launch_crash_1.jpg?crop=1023,576,x0,y54&width=1023&height=576&format=pjpg&auto=webp", "publishedAt": "2023-04-25T01:40:01Z", "content": "Space is important to us and thats why we're working to bring you top coverage of the industry and Florida launches. Journalism like this takes time and resources. Please support it with a subscripti… [+5520 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Falcon Heavy delay affects space station manifest - SpaceNews", "description": "A delayed launch of commercial satellites on a Falcon Heavy could upend the schedule of flights to the International Space Station.", "url": "https://spacenews.com/falcon-heavy-delay-affects-space-station-manifest/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/04/crew6-dusk.jpg", "publishedAt": "2023-04-25T01:00:03Z", "content": "WASHINGTON A delayed launch of commercial satellites on a Falcon Heavy could upend the schedule of flights to the International Space Station, including a private astronaut mission that was scheduled… [+3797 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Dhananjay Khadilkar", "title": "The people replicating Moon dust - BBC", "description": "With humanity looking to set foot on the Moon again for the first time in 50 years, space agencies around the world need lunar soil – lots of it.", "url": "https://www.bbc.com/future/article/20230424-the-people-creating-fake-moon-dust", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0fjjph3.jpg", "publishedAt": "2023-04-25T00:06:15Z", "content": "Even with the walls of a volcanic crater looming behind the white-washed single-storey buildings, it would be easy to miss the sleepy town of Tao. It only takes a few moments to pass through it as yo… [+2713 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Marcia Dunn", "title": "Severe solar storm creates dazzling auroras farther south - The Associated Press", "description": "CAPE CANAVERAL, Fla. (AP) — An intense solar storm has the northern lights gracing the skies farther south than usual.  A blast of superhot material from the sun late last week hurled scorching gases known as plasma toward Earth at nearly 2 million mph (3 mil…", "url": "https://apnews.com/article/auroras-northern-lights-solar-storm-9a3399d88ec0e14293f06e77d61099c4", "urlToImage": "https://storage.googleapis.com/afs-prod/media/3f92cf2966494cbf9ae79236c94d819a/3000.webp", "publishedAt": "2023-04-24T22:36:41Z", "content": "CAPE CANAVERAL, Fla. (AP) An intense solar storm has the northern lights gracing the skies farther south than usual. \r\nA blast of superhot material from the sun late last week hurled scorching gases … [+1806 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mary Durlak", "title": "Searching for ancient bears in an Alaskan cave leads to an important human discovery - Phys.org", "description": "The first people to live in the Americas migrated from Siberia across the Bering land bridge more than 20,000 years ago. Some made their way as far south as Tierra del Fuego, at the tip of South America. Others settled in areas much closer to their place of o…", "url": "https://phys.org/news/2023-04-ancient-alaskan-cave-important-human.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/searching-for-ancient.jpg", "publishedAt": "2023-04-24T21:07:54Z", "content": "The first people to live in the Americas migrated from Siberia across the Bering land bridge more than 20,000 years ago. Some made their way as far south as Tierra del Fuego, at the tip of South Amer… [+5042 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "This is our 1st detailed look at Mars' most mysterious moon Deimos (photos) - Space.com", "description": "The debate over the moon's origin story is not over yet.", "url": "https://www.space.com/mars-moon-deimos-image-origin-story", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HjYvBKaXq4XqaJPDncpED6-1200-80.png", "publishedAt": "2023-04-24T21:00:40Z", "content": "Deimos, a moon of Mars, is seen in front of the red planet in a high-resolution image from the United Arab Emirates' Emirates Mars Mission spacecraft. (Image credit: Emirates Mars Mission)\r\nA moon of… [+3103 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Neural Nanotechnology: Nanowire Networks Learn and Remember Like a Human Brain - SciTechDaily", "description": "Human-Like Intelligence Could Be Physical In a groundbreaking study, an international team has shown that nanowire networks can mimic the short- and long-term memory functions of the human brain. This breakthrough paves the way for replicating brain-like lear…", "url": "https://scitechdaily.com/?p=271255", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-Neural-Network-Concept-Art.jpg", "publishedAt": "2023-04-24T20:22:52Z", "content": "ByUniversity of SydneyApril 24, 2023\r\nScientists have demonstrated that nanowire networks can exhibit short- and long-term memory, similar to the human brain. These networks, comprised of highly cond… [+7554 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Richard Angle", "title": "SpaceX aims to launch Falcon Heavy and two Falcon 9 rockets this week - TESLARATI", "description": "SpaceX will aim to complete three launches this week, starting with Falcon Heavy and finishing with two Falcon 9 launches afterward.", "url": "https://www.teslarati.com/spacex-aims-launch-falcon-heavy-two-falcon-9-rockets/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2023/04/Falcon-Heavy-Sunset-scaled.jpg", "publishedAt": "2023-04-24T20:01:40Z", "content": "Following the very next day, Falcon Heavy is currently scheduled to launch the Boeing-built Viasat-3 communications satellite into Geostationary Earth Orbit from Launch Complex 39-A at Kennedy Space … [+1404 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "SpaceX launches world's 1st 5G satellite to bring global connectivity to Internet of Things - Space.com", "description": "The Sateliot \"GroundBreaker\" is the first of a constellation of over 250 spacecraft.", "url": "https://www.space.com/spacex-launches-1st-5g-satellite-internet-of-things", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E42e3BPwgJqzHNZAqufsrC-1200-80.png", "publishedAt": "2023-04-24T20:00:18Z", "content": "SpaceX has launched what is reportedly the first satellite in low Earth orbit (LEO) to operate on the 5G cellular standard.\r\nKnown as \"The GroundBreaker,\" the relatively small, 22-pound (10-kilogram)… [+2873 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Building better superconductors with palladium - Phys.org", "description": "It is one of the most exciting races in modern physics: How can we produce the best superconductors that remain superconducting even at the highest possible temperatures and ambient pressure? In recent years, a new era of superconductivity has begun with the …", "url": "https://phys.org/news/2023-04-superconductors-palladium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/3-superconduct.jpg", "publishedAt": "2023-04-24T19:53:56Z", "content": "It is one of the most exciting races in modern physics: How can we produce the best superconductors that remain superconducting even at the highest possible temperatures and ambient pressure? In rece… [+4661 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers reveal an ancient mechanism for wound repair - Phys.org", "description": "It's a dangerous world out there. From bacteria and viruses to accidents and injuries, threats surround us all the time. And nothing protects us more steadfastly than our skin. The barrier between inside and out, the body's largest organ is also its most seam…", "url": "https://phys.org/news/2023-04-reveal-ancient-mechanism-wound.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-reveal-an-1.jpg", "publishedAt": "2023-04-24T19:45:42Z", "content": "It's a dangerous world out there. From bacteria and viruses to accidents and injuries, threats surround us all the time. And nothing protects us more steadfastly than our skin. The barrier between in… [+6153 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Using Hubble, researchers accidentally discover ejected black hole forcing star creation - NASASpaceFlight.com - NASASpaceflight.com", "description": "Throughout the universe, supermassive black holes can typically be found at the center of massive…", "url": "https://www.nasaspaceflight.com/2023/04/runaway-black-hole/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/04/hubble_runawayblackhole_stsci-01gx657xta7kn3a8rpsdxs9d07.png", "publishedAt": "2023-04-24T19:25:14Z", "content": "2Throughout the universe, supermassive black holes can typically be found at the center of massive galaxies that stretch tens of light years across. However, using Hubble, a team of researchers has d… [+6026 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A blinking fish reveals clues to how our ancestors evolved from water to land - Phys.org", "description": "An unusual blinking fish, the mudskipper, spends much of the day out of the water and is providing clues as to how and why blinking might have evolved during the transition to life on land in our own ancestors. New research shows that these amphibious fish ha…", "url": "https://phys.org/news/2023-04-fish-reveals-clues-ancestors-evolved.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-blinking-fish-reveal-1.jpg", "publishedAt": "2023-04-24T19:00:14Z", "content": "An unusual blinking fish, the mudskipper, spends much of the day out of the water and is providing clues as to how and why blinking might have evolved during the transition to life on land in our own… [+5592 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Watch NASA assemble the massive Artemis 2 rocket that will take humans back to the moon (video) - Space.com", "description": "NASA is targeting November 2024 for the launch of Artemis 2.", "url": "https://www.space.com/nasa-assemble-artemis-2-moon-rocket-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zmegGitRuGgaxLcqwm4feJ-1200-80.jpg", "publishedAt": "2023-04-24T19:00:12Z", "content": "Teams across NASA are working towards the first launch of astronauts to the moon in over 50 years. \r\nThe crew assigned to launch aboard an Orion spacecraft for the historic mission was recently revea… [+2328 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "NASA mission detects first seismic waves traveling through the center of Mars - CNN", "description": "Seismic waves generated by quakes and a meteorite strike on Mars allowed NASA's InSight lander to collect data that helped reveal secrets of the Martian interior.", "url": "https://www.cnn.com/2023/04/24/world/mars-seismic-waves-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221220100152-mars-insight-lander-1211.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-24T19:00:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWhen quakes rumbled on Mars and a meteorite smacked in… [+4244 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jeannie Kever", "title": "Using superconductors to move people, cargo and energy through one combined system - Phys.org", "description": "The promise of superconductivity for electrical power transmission and transportation has long been held back by high costs. Now researchers from the University of Houston and Germany have demonstrated a way to cut the cost and upend both the transit and ener…", "url": "https://phys.org/news/2023-04-superconductors-people-cargo-energy-combined.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/transforming-highways.jpg", "publishedAt": "2023-04-24T18:40:48Z", "content": "The promise of superconductivity for electrical power transmission and transportation has long been held back by high costs. Now researchers from the University of Houston and Germany have demonstrat… [+4731 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "James Burch", "title": "Watch live: NASA holds press briefing on upcoming spacewalk - AOL", "description": "NASA officials on Monday will preview the spacewalk from the International Space Station (ISS) slated for later this week. The extravehicular activity (EVA) ...", "url": "https://thehill.com/homenews/3966522-watch-live-nasa-holds-press-briefing-on-upcoming-spacewalk/", "urlToImage": "https://media.zenfs.com/en/aol_the_hill_articles_315/53480f76b0a1d745186b8dac7bf91a50", "publishedAt": "2023-04-24T17:53:00Z", "content": "NASA officials on Monday will preview the spacewalk from the International Space Station (ISS) slated for later this week.\r\nThe extravehicular activity (EVA) to be taken on Friday will be the first e… [+606 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alan Flurry", "title": "Researchers use AI to discover new planet outside solar system - Phys.org", "description": "A University of Georgia research team has confirmed evidence of a previously unknown planet outside of our solar system, and they used machine learning tools to detect it.", "url": "https://phys.org/news/2023-04-ai-planet-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/researchers-use-ai-to-1.jpg", "publishedAt": "2023-04-24T16:53:45Z", "content": "A University of Georgia research team has confirmed evidence of a previously unknown planet outside of our solar system, and they used machine learning tools to detect it.\r\nA recent study by the team… [+3151 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Ben Cost", "title": "Massive blue hole discovered off coast of Mexico: Window into new lifeforms? - New York Post ", "description": "Researchers flabbergasted the science community after discovering the world’s second largest blue hole — which could potentially provide a window into life on other planets.", "url": "https://nypost.com/2023/04/24/massive-blue-hole-discovered-off-the-coast-of-mexico/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/04/NYPICHPDPICT000010084502.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-04-24T15:59:00Z", "content": "It could fill a massive knowledge “gap” on alien life. \r\nResearchers flabbergasted the science community after discovering the world’s second largest blue hole in Mexico which could potentially provi… [+3819 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hubble's 33rd Year in Orbit - NASA Goddard", "description": "The Hubble Space Telescope celebrated its 33rd year in orbit by premiering a stunning new Hubble image of a nearby star-forming region named NGC 1333. Even a...", "url": "https://www.youtube.com/watch?v=g4hWcpEEbNo", "urlToImage": "https://i.ytimg.com/vi/g4hWcpEEbNo/maxresdefault.jpg", "publishedAt": "2023-04-24T15:32:17Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Efficient evolution of human antibodies from general protein language models - Nature.com", "description": "A general protein language model guides protein evolution with 20 or fewer variants needed for testing.", "url": "https://www.nature.com/articles/s41587-023-01763-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41587-023-01763-2/MediaObjects/41587_2023_1763_Fig1_HTML.png", "publishedAt": "2023-04-24T15:14:53Z", "content": "Acquiring amino acid substitutions via language model consensus\r\nWe select amino acid substitutions recommended by a consensus of language models. We take as input a single wild-type sequence x=(x1,,… [+36114 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "Incredibly Rare Fossil Chilies Reveal These Peppers Emerged 50 Million Years Ago - IFLScience", "description": "Plants were spicing things up as far back as the Eocene.", "url": "https://www.iflscience.com/incredibly-rare-fossil-chilies-reveal-they-emerged-50-million-years-ago-68594", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68594/aImg/67442/fossil-chili-pepper-meta.png", "publishedAt": "2023-04-24T15:04:54Z", "content": "The spicy history of the chili pepper may have just been rewritten following the discovery of a rare fossilized berry, Lycianthoides calycina. Its a member of the chili pepper tribe Capsiceae, which … [+2464 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "JWST spots planetary building blocks in a surprising galaxy - Nature.com", "description": "Planets might be more common throughout the Universe than previously thought, suggest results from the James Webb Space Telescope.", "url": "https://www.nature.com/articles/d41586-023-01418-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01418-x/d41586-023-01418-x_25274496.jpg", "publishedAt": "2023-04-24T15:04:39Z", "content": "Scientists found the ingredients for planet formation in a star cluster called NGC 346, which lies in the Small Magellanic Cloud. Credit: NASA, ESA, CSA, O. Jones (UK ATC), G. De Marchi (ESTEC), and … [+4068 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A general theory to realize bilayer stacking ferroelectricity - Phys.org", "description": "Two-dimensional (2D) ferroelectrics, planar materials that have a spontaneous and reversible electric polarization, are extremely rare and yet could be extremely advantageous for the development of new nanoelectronics. Due to their ferroelectric properties an…", "url": "https://phys.org/news/2023-04-general-theory-bilayer-stacking-ferroelectricity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/a-general-theory-to-re.jpg", "publishedAt": "2023-04-24T15:04:30Z", "content": "Two-dimensional (2D) ferroelectrics, planar materials that have a spontaneous and reversible electric polarization, are extremely rare and yet could be extremely advantageous for the development of n… [+5043 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "NASA's Perseverance rover loses its hitchhiking 'pet rock' after more than a year together on Mars - Livescience.com", "description": "The rover has finally lost a pesky rock that had become lodged in its front left wheel \"like a pebble in its shoe.\" The stone had accompanied the rover for more than half its time on the Red Planet.", "url": "https://www.livescience.com/space/mars/nasas-perseverance-rover-loses-its-hitchhiking-pet-rock-after-more-than-a-year-together-on-mars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XsjJyxgv4FEdmj3snWyhzR-1200-80.png", "publishedAt": "2023-04-24T14:17:40Z", "content": "An image of Perseverance's \"pet rock\" stuck in the rover's front left wheel taken on May 26. (Image credit: NASA/JPL-Caltech)\r\nAfter more than a year together on the Red Planet, NASA's Perseverance r… [+2334 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Tiny Jets on the Sun Power the Colossal Solar Wind - Quanta Magazine", "description": "A new analysis argues that ubiquitous eruptions in the sun’s corona explain the vast flow of charged particles seen streaming out through the solar system.", "url": "https://www.quantamagazine.org/tiny-jets-on-the-sun-power-the-colossal-solar-wind-20230424/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/04/SolarWind-NASA-Social.jpg", "publishedAt": "2023-04-24T14:07:03Z", "content": "Torrents of charged particles continuously lift off the suns atmosphere and radiate outward at millions of kilometers per hour, yielding a solar wind so immense that its limit defines the outer edge … [+2483 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Astronomers explore multiple stellar populations in Messier 92 - Phys.org", "description": "Using the James Webb Space Telescope (JWST) and the Hubble Space Telescope (HST), astronomers from the University of Padua, Italy, and elsewhere have observed a metal-poor globular cluster known as Messier 92. The observations deliver crucial information rega…", "url": "https://phys.org/news/2023-04-astronomers-explore-multiple-stellar-populations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astronomers-explore-mu.jpg", "publishedAt": "2023-04-24T14:00:01Z", "content": "Using the James Webb Space Telescope (JWST) and the Hubble Space Telescope (HST), astronomers from the University of Padua, Italy, and elsewhere have observed a metal-poor globular cluster known as M… [+3359 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": null, "title": "Webb Reveals Early-Universe Prequel to Huge Galaxy Cluster - WebbTelescope.org", "description": "", "url": "https://webbtelescope.org/contents/news-releases/2023/news-2023-118", "urlToImage": "//stsci-opo.org/STScI-01GYAMC52BD85EDF4DYRZQKGH5.png", "publishedAt": "2023-04-24T14:00:00Z", "content": "Full Article\r\nEvery giant was once a baby, though you may never have seen them at that stage of their development. NASAs James Webb Space Telescope has begun to shed light on formative years in the h… [+4502 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "This Week in Spaceflight: A SpaceX Falcon Heavy Flies Again and the First Arab Spacewalk - Gizmodo", "description": "History could be made this week, as Japan's ispace seeks to become the first private mission to land successfully on the Moon.", "url": "https://gizmodo.com/first-arab-spacewalk-japan-ispace-moon-landing-spacex-1850362451", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8ffde2c147678151422b82b03924b83f.jpg", "publishedAt": "2023-04-24T14:00:00Z", "content": "The inaugural launch of SpaceXs Starship captured our imagination, but the coming week reminds us of the companys other heavy-lift launch vehicle: Falcon Heavy. Were also anticipating a historic spac… [+2723 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "90-foot, 88-foot asteroids zooming towards Earth at mind boggling speed, reveals NASA - HT Tech", "description": "A 90-foot and 88-foot asteroids and more are set to come close to planet Earth on April 25, 2023. Here is what NASA informs.", "url": "https://tech.hindustantimes.com/tech/news/90foot-88-foot-asteroids-zooming-towards-earth-at-mind-boggling-speed-reveals-nasa-71682336925935.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/24/1600x900/asteroid-6010220_960_720_1669362561139_1679319215140_1682337072833.jpg", "publishedAt": "2023-04-24T11:53:04Z", "content": "Tuesday, April 25, 2023, will witness four asteroids approaching very close to planet Earth. Out of these four asteroids, two are as large as 90-foot and 88-foot. Will these asteroids be dangerous to… [+2046 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Paul Sutter", "title": "The Universe sucks: The mysterious Great Attractor that’s pulling us in - Ars Technica", "description": "We're headed toward something we can't clearly see—and we'll never get there.", "url": "https://arstechnica.com/science/2023/04/the-universe-sucks-the-mysterious-great-attractor-thats-pulling-us-in/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/the-great-attractor-760x380.jpg", "publishedAt": "2023-04-24T11:45:21Z", "content": "21 with \r\nOur Milky Way galaxy is speeding through the emptiness of space at 600 kilometers per second, headed toward something we cannot clearly see. The focal point of that movement is the Great At… [+3032 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Jack Murtagh", "title": "Gizmodo Monday Puzzle: 83% of People Got at Least One Question Wrong on This Psychology Test - Gizmodo", "description": "Do you tend to follow your gut when faced with a new problem? Or do you take a methodical approach?", "url": "https://gizmodo.com/gizmodo-monday-puzzle-cognitive-reflection-test-1850185711", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/040906db41277ec8f105880ae29fdab3.png", "publishedAt": "2023-04-24T11:30:00Z", "content": "Its best to solve this weeks puzzle (really, three mini-puzzles) without an introduction. Ill explain why after youve given it a shot.\r\nDid you miss last weeks puzzle? Check it out here, and find its… [+3277 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Super Alloy: A Breakthrough in 3D Printing Technology - SciTechDaily", "description": "NASA has developed a new superalloy called GRX-810, which is twice as strong and more than 1,000 times more durable than the state-of-the-art 3D printed superalloys. The high-temperature alloy could be used to build stronger and more durable parts for airplan…", "url": "https://scitechdaily.com/nasas-super-alloy-a-breakthrough-in-3d-printing-technology/", "urlToImage": "https://scitechdaily.com/images/NASA-3D-Printed-Superalloy-scaled.jpg", "publishedAt": "2023-04-24T11:11:51Z", "content": "ByBrian Newbacher, NASAs Glenn Research CenterApril 24, 2023\r\nNASA and The Ohio State University have developed a new superalloy that is twice as strong, more than 1,000 times more durable and twice … [+4978 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lloyd Coombes", "title": "The Celestron NexStar 8SE is our top-ranked telescope and it's currently $200 off - Livescience.com", "description": "Pick up the fantastic Celestron NexStar 8SE Telescope at a steep discount.", "url": "https://www.livescience.com/space/the-celestron-nexstar-8se-is-our-top-ranked-telescope-and-its-currently-dollar200-off", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6EZkwUKjSMe3URmNa5nRLk-1200-80.jpg", "publishedAt": "2023-04-24T11:00:16Z", "content": "The Celestron NexStar 8SE Telescope is our top-rated telescope, and it's reduced at Amazon.\r\nWhen looking for the best telescope deals, it never hurts to aim high and consider checking out some of th… [+1644 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Say what? The principal investigators who pass down wisdom through humour - Nature.com", "description": "Wit can convey important truths about critical thinking and the scientific method, especially when group leaders poke fun at themselves in the process.", "url": "https://www.nature.com/articles/d41586-023-01373-7", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01373-7/d41586-023-01373-7_25267146.jpg", "publishedAt": "2023-04-24T10:02:45Z", "content": "Why cant a dinosaur use a pipette? Because its extinct. (Greg Beatty and his PhD student Jesse Lee try to prove otherwise.)Credit: Kelly Markowitz \r\nThe unofficial rules of Derek Pociasks immunology … [+10369 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "This 'tarantula' in space could teach us the secrets of dark matter - Space.com", "description": "'If dark matter goes \"crunch\", or if bits are chipped off, we could finally start to learn what it's made of.'", "url": "https://www.space.com/dark-matter-secrets-nasa-balloon-images", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tfha8MK3jwPDrV5eteY8SQ-1200-80.png", "publishedAt": "2023-04-24T10:00:48Z", "content": "A balloon-based telescope may help astronomers unravel the mysteries of dark matter after its first images of the cosmos from the edge of space. \r\nThe Super Pressure Balloon Imaging Telescope (SuperB… [+5558 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Harry Baker", "title": "Ethereal whirlpool of light grows into a giant, perfect spiral above Alaska. What was it? - Space.com", "description": "A mystifying swirl of light recently appeared in the night sky above Alaska, briefly outshining a vibrant auroral display.", "url": "https://www.space.com/https://www.livescience.com/space/astronomy/ethereal-whirlpool-of-light-grows-into-a-giant-perfect-spiral-above-alaska-what-was-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/K4V5s4ePuGANhqrRaEZD54-1200-80.jpg", "publishedAt": "2023-04-24T10:00:08Z", "content": "The bizarre spiral appeared above Alaska on April 15. (Image credit: Todd Salat/AuroraHunter.com)\r\nAn ethereal whirlpool of light recently appeared in the night sky above Alaska, briefly stealing the… [+3722 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of Aging: Sirtuin Enzymes in the Spotlight - SciTechDaily", "description": "Penn State researchers have revealed how sirtuin enzymes interact with nucleosomes to regulate aging and metabolic processes. Their findings, using cryo-electron microscopy, may inform drug discovery efforts targeting sirtuins for biomedical applications. New…", "url": "https://scitechdaily.com/?p=269280", "urlToImage": "https://scitechdaily.com/images/SIRT6-in-Complex-With-Nucleosome.jpg", "publishedAt": "2023-04-24T08:27:13Z", "content": "ByPenn State UniversityApril 24, 2023\r\nNew images of the SIRT6 sirtuin enzymewhich regulates aging and other metabolic processeshelp explain how it is able to access genetic material within the cell.… [+6656 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "China to test out 3D printing technology on moon to build habitats - Reuters", "description": "China will explore using 3D printing technology to construct buildings on the moon, the official China Daily reported on Monday, as Beijing solidifies plans for long-term lunar habitation.", "url": "https://www.reuters.com/technology/space/china-test-out-3d-printing-technology-moon-build-habitats-2023-04-24/", "urlToImage": "https://www.reuters.com/resizer/phompa_5v5Z12_ed7A5y2D3ljb4=/1181x618/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/IQTJ2EQPYVN55NKA5WLISVAM6A.jpg", "publishedAt": "2023-04-24T08:26:00Z", "content": "BEIJING, April 24 (Reuters) - China will explore using 3D printing technology to construct buildings on the moon, the official China Daily reported on Monday, as Beijing solidifies plans for long-ter… [+1634 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China releases first Mars global color images obtained from country's first mission on Space Day - Global Times", "description": "China on Monday released the first Mars global images obtained from its first Mars exploration mission, providing an improved quality base map for future scientific and exploration tasks on the Red Planet, the China National Space Administration (CNSA) announ…", "url": "https://www.globaltimes.cn/page/202304/1289690.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2023/2023-04-24/a0c565b5-6f95-4168-8035-b0b82620d411_s.png", "publishedAt": "2023-04-24T06:47:00Z", "content": "An orthographic projection of the eastern and western hemispheres of Mars. Photo: CNSA\r\nChina on Monday released the first Mars global images obtained from its first Mars exploration mission, providi… [+4201 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Frightening new supernova discovery would obliterate life on Earth - indy100", "description": "Supernovae (or supernovas, if you prefer) have long been a subject of intense interest and intensive research owing to the spectacular outbursts of energy they produce.But new evidence collected by NASA’s Chandra Observatory suggest they could pose an even gr…", "url": "https://www.indy100.com/science-tech/supernova-threat-to-earth-2659898859", "urlToImage": "https://www.indy100.com/media-library/nasa-s-james-webb-telescope-spies-star-on-the-verge-of-exploding-into.jpg?id=33522302&width=1200&height=600&coordinates=0%2C188%2C0%2C28", "publishedAt": "2023-04-24T06:28:28Z", "content": "Supernovae (or supernovas, if you prefer) have long been a subject of intense interest and intensive research owing to the spectacular outbursts of energy they produce.\r\nBut new evidence collected by… [+3313 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "How \"bound together\" is our Universe? - Big Think", "description": "From quarks and gluons to giant galaxy clusters, everything that exists in our Universe is determined by what is (and isn't) bound together.", "url": "https://bigthink.com/starts-with-a-bang/bound-together-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/07/bggals3.jpg?resize=1200,630", "publishedAt": "2023-04-24T06:00:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Richard Luscombe", "title": "Scientists discover why sea urchins are dying off from US to the Caribbean - The Guardian", "description": "A research team has discovered a parasite that’s been killing off sea urchins, but there’s no method to eliminate it yet", "url": "https://www.theguardian.com/environment/2023/apr/24/scientists-discover-why-sea-urchins-are-dying-off-from-us-to-the-caribbean", "urlToImage": "https://i.guim.co.uk/img/media/ccd3efb75fd3c771860836c9320175890aa690d6/0_152_4600_2761/master/4600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=996ce417904f638d4aa71923302108af", "publishedAt": "2023-04-24T05:00:00Z", "content": "Marine biologists at a Florida university say they have solved the mystery of a mass die-off of long-spined sea urchins from the US to the Caribbean.\r\nThe scientists blame a microscopic, single-cell … [+2736 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China to build gigawatt-level space power station: leading expert - Global Times", "description": "China is eyeing completing a gigawatt-level space-based power station, the Global Times learned from the Chinese Society of Astronautics space solar power commission on Sunday.", "url": "https://www.globaltimes.cn/page/202304/1289677.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-06-16/e27d0101-c9ee-4197-83e5-abf6b990ef9a_s.jpeg", "publishedAt": "2023-04-24T02:32:00Z", "content": "The ground recipient verification system of China's space-based solar power station Photo: Weibo account of the Xidian University\r\nChina is eyeing completing a gigawatt-level space-based power statio… [+5975 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nuts About Science: The Brazil Nut Effect Shakes Up Physics - SciTechDaily", "description": "Physicists from the University of Utrecht and the Faculty of Physics at the University of Warsaw have observed — for the first time experimentally — the Brazil nut effect in a mixture of charged colloidal particles. Until now, it was thought that an influx of…", "url": "https://scitechdaily.com/nuts-about-science-the-brazil-nut-effect-shakes-up-physics/", "urlToImage": "https://scitechdaily.com/images/Brazil-Nut-Effect.jpg", "publishedAt": "2023-04-24T01:38:57Z", "content": "In a bag of mixed nuts, after shaking, smaller nuts fill in the gaps created at the bottom, pushing the larger Brazil nuts to the top. Credit: Melchoir, CC BY-SA 3.0, via Wikimedia Commons\r\nPhysicist… [+4250 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "Chinese scientists calculate the Milky Way's mass as 805 billion times that of our Sun - The Register", "description": "ALSO: Australia says offensive hacking is working; DJI hit with $279m patent suit; Philippines Police leak data; and more", "url": "https://www.theregister.com/2023/04/24/asia_tech_news_roundup/", "urlToImage": "https://regmedia.co.uk/2021/03/25/shutterstock_scotland_milky_way.jpg", "publishedAt": "2023-04-24T00:29:00Z", "content": "Asia In Brief Chinese scientists have estimated the mass of the Milky Way.\r\nTo do so the authors considered 260,000 stars a larger number than has previously been used for a study of this type many o… [+6623 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fat Quantum Cats: Physicists' Record-Breaking Schrödinger Cat Experiment - SciTechDaily", "description": "Researchers at ETH Zurich have created the heaviest Schrödinger cat to date by putting a crystal in a superposition of two oscillation states. Their results could lead to more robust quantum bits and help to explain why quantum superpositions are not observed…", "url": "https://scitechdaily.com/fat-quantum-cats-physicists-record-breaking-schrodinger-cat-experiment/", "urlToImage": "https://scitechdaily.com/images/Fat-Quantum-Cats.jpg", "publishedAt": "2023-04-24T00:24:43Z", "content": "ByETH ZurichApril 23, 2023\r\nScientists at ETH Zurich have made progress in creating heavier Schrödinger cats, which can be alive (top) and dead (bottom) at the same time. Credit: Yiwen Chu / ETH Zuri… [+5717 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ian Atkinson", "title": "As megaconstellations grow, scientists become concerned with their impacts on astronomy - NASASpaceFlight.com - NASASpaceflight.com", "description": "Since their initial launch in 2019, SpaceX’s Starlink internet satellites have become infamous for photobombing…", "url": "https://www.nasaspaceflight.com/2023/04/megaconstellations-effects-on-astronomy/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2018/12/2018-12-07-23_28_59-hubble-photos-Google-Search.jpg", "publishedAt": "2023-04-23T20:23:11Z", "content": "11Since their initial launch in 2019, SpaceX’s Starlink internet satellites have become infamous for photobombing observations from ground-based telescopes. While Starlink — along with other satellit… [+7943 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cerium's Photocatalytic Superpower: Unlocking Titanium Dioxide's Visible Light Absorption - SciTechDaily", "description": "Visible Light Absorption of Titanium Dioxide Through Cerium Synchronous Doping in Anatase The introduction of rare earth elements into TiO2 can effectively improve the electron-hole separation of TiO2 and prolong the visible light response of TiO2. Cerium (Ce…", "url": "https://scitechdaily.com/ceriums-photocatalytic-superpower-unlocking-titanium-dioxides-visible-light-absorption/", "urlToImage": "https://scitechdaily.com/images/Waves-Energy-Physics-Tunnel-Concept-Art.jpg", "publishedAt": "2023-04-23T18:01:08Z", "content": "A research group from the Chinese Academy of Sciences has significantly improved visible light absorption in Ce/TiO2 by doping cerium in the TiO2 lattice, resulting in a high photocurrent density and… [+2814 chars]"}, {"source": {"id": null, "name": "Reviewgeek.com"}, "author": "Cory Gunther", "title": "Airbus Teases Space Station Concept With Simulated Gravity - Review Geek", "description": "Airbus, the European aerospace company, has unveiled a wild new concept for its version of a space station that could head to the last frontier and orbit Earth (or Mars) in the future.", "url": "https://www.reviewgeek.com/151849/airbus-teases-space-station-concept-with-simulated-gravity/", "urlToImage": "https://www.reviewgeek.com/p/uploads/2023/04/089272a8.jpg", "publishedAt": "2023-04-23T17:13:55Z", "content": "Airbus\r\nAirbus, the European aerospace company, has unveiled a wild new concept for its version of a space station that could head to the last frontier and orbit Earth (or Mars) in the future.\r\nWith … [+1647 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Some News About Our Moon to Mars Architecture on This Week @NASA – April 21, 2023 - NASA", "description": "Some news about our Moon to Mars Architecture, chalk up another one for our frequent flyer on Mars, and yes, this spacecraft “scan” find things in the sky … ...", "url": "https://www.youtube.com/watch?v=dH_VIeB8jvU", "urlToImage": "https://i.ytimg.com/vi/dH_VIeB8jvU/maxresdefault.jpg", "publishedAt": "2023-04-23T15:30:07Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/andrew-tarantola", "title": "Hitting the Books: We'd likely have to liquidate Jupiter to build a Dyson Sphere around the Sun - Engadget", "description": "In \"The Possibility of Life,\" science journalist Jaime Green examines humanity's intriguing history of looking to the stars and finding ourselves reflected in them..", "url": "https://www.engadget.com/hitting-the-books-the-possibility-of-life-jaime-greene-hanover-square-press-113047089.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/tBlVx0HoZD7Wm.5WaZCCsA--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-04/e031f740-dd70-11ed-adaf-bbd8f41a3f8c.cf.jpg", "publishedAt": "2023-04-23T14:32:26Z", "content": "The gargantuan artificial construct enveloping your local star is going to be rather difficult to miss, even from a few light years away. And given the literally astronomical costs of resources neede… [+14718 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Curious Tracks Criss-Cross an Icy Fjord - nasa.gov", "description": "Paths that cut across the still-frozen Tunulliarfik Fjord in southern Greenland were likely made by people.", "url": "https://earthobservatory.nasa.gov/images/151243/curious-tracks-criss-cross-an-icy-fjord", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/151000/151243/greenlandice_oli2_2023072_th.jpg", "publishedAt": "2023-04-23T14:15:02Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Vice President Kamala Harris talks with the NASA Artemis II Crew About How They Became Astronauts - NASA", "description": "The Artemis II crew shared with Vice President Kamala Harris their journey and inspirations that lead them to become astronauts. NASA astronauts Reid Wiseman...", "url": "https://www.youtube.com/watch?v=_r1aWHWJCUU", "urlToImage": "https://i.ytimg.com/vi/_r1aWHWJCUU/maxresdefault.jpg", "publishedAt": "2023-04-23T14:00:18Z", "content": null}, {"source": {"id": null, "name": "Foxweather.com"}, "author": "Scott Sistek", "title": "'Carbon-negative' concrete invention removes CO2 from the air during manufacture - Fox Weather ", "description": "What if the billions of tons of concrete poured around the globe each year could also help battle climate change emissions at the same time?", "url": "https://www.foxweather.com/weather-news/carbon-negative-concrete-biochar-wsu-research", "urlToImage": "https://images.foxweather.com/static.foxweather.com/www.foxweather.com/content/uploads/2023/04/1024/512/Biochar.jpg?ve=1&tl=1", "publishedAt": "2023-04-23T13:00:00Z", "content": "PULLMAN, Wash. -- What if the billions of tons of concrete poured around the globe each year could also help battle climate change emissions at the same time?\r\nResearchers at Washington State Univers… [+1821 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Geomagnetic Storm alert! STRONG G3-class storm may hit Earth tomorrow - HT Tech", "description": "A stream of CMEs may trigger a strong geomagnetic storm on Earth tomorrow, NOAA forecasters suggested. What impact will it have on Earth? Read on.", "url": "https://tech.hindustantimes.com/tech/news/geomagnetic-storm-alert-strong-g3-class-storm-may-hit-earth-tomorrow-71682253056536.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/matt-houghton-q_X-lyHxcdk-unsplash_1648564105696_1682253532609.jpg", "publishedAt": "2023-04-23T12:39:54Z", "content": "Earth-directed explosion on the Sun left the planet in the strike zone! A massive magnetic filament that was slithering across the southern hemisphere of the sun erupted on April 21st, hurling a clus… [+1989 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Lyrids Meteor Shower to peak today! - HT Tech", "description": "Lyrids Meteor Shower to peak today All you need to know about the Lyrids Meteor Shower as it peaks on April 2223. Check it out. In this year the Lyrids Meteor Shower would peak in the predawn hours of April 23. According to NASA on average the shower can prod…", "url": "https://tech.hindustantimes.com/web-stories/lyrids-meteor-shower-to-peak-today-71682250424021.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/Geminids_Wirtanen_1682252006547_1682252093254.jpg/", "publishedAt": "2023-04-23T12:15:44Z", "content": "Photo Credit: NASA\r\n All you need to know about the Lyrids Meteor Shower as it peaks on April 22-23. Check it out.\r\nPhoto Credit: Pixabay\r\n In this year the Lyrids Meteor Shower would peak in the pre… [+1101 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kenna Hughes-Castleberry", "title": "How physicist Sameera Moussa went from a role model to a target - Ars Technica", "description": "Research success and \"Atoms for Peace\" activism left Sameera Moussa a murder victim.", "url": "https://arstechnica.com/science/2023/04/the-strange-tragic-story-of-egypts-foremost-female-nuclear-scientist/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/SameeraMoussa-760x380.jpg", "publishedAt": "2023-04-23T12:08:58Z", "content": "13 with \r\nScience and the technology it enables have always had a close relationship with warfare. But World War II saw science's destructive power raised to new levels. As the threat of nuclear anni… [+3935 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Thomas Lewton", "title": "Researchers Argue Black Holes Will Destroy All Quantum States - WIRED", "description": "New calculations suggest that the event horizons will eventually “decohere” quantum possibilities—even those that are far away.", "url": "https://www.wired.com/story/black-holes-will-destroy-all-quantum-states/", "urlToImage": "https://media.wired.com/photos/6442b08390167265276c8583/191:100/w_1280,c_limit/quanta_KillingHorizons-byKristinaArmitage-Lede-scaled-copy.jpg", "publishedAt": "2023-04-23T12:00:00Z", "content": "Intriguingly, this kind of decoherence will occur anywhere there is a horizon that only allows information to travel in one direction, creating the potential for causality paradoxes. The edge of the … [+3102 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ameya Paleja", "title": "Berkeley researcher deploys robots and AI to increase pace of research by 100 times - Interesting Engineering", "description": "By assigning robots and AI to do repetitive tasks, the researchers aim to increase the output of the lab greatly.", "url": "https://interestingengineering.com/innovation/ai-robots-work-accelerate-materials-research", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/23/image/jpeg/rMmiw9uLkDxtiUBKKvzanLUrwbNOAfXEJVRKWcTL.jpg", "publishedAt": "2023-04-23T10:16:00Z", "content": "A research team led by Yan Zeng, a scientist at the Department of Energys Lawrence Berkeley National Laboratory (Berkeley Lab), has built a new material research laboratory where robots do the work a… [+1328 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "NASA wants help listening to collisions with Earth’s magnetic field - The Washington Post", "description": "When the solar wind and plasma from coronal ejections strike Earth’s magnetic field lines, our invisible shield vibrates like the strings of a harp.", "url": "https://www.washingtonpost.com/science/2023/04/23/space-sound-nasa-research/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BF2OCUJLIP4F2JB3OHIRFSKUXU_size-normalized.jpeg&w=1440", "publishedAt": "2023-04-23T10:10:30Z", "content": "Comment on this story\r\nComment\r\nNote to citizen scientists: NASA wants your help listening in on the universe specifically, on the sounds of low-frequency waves generated by solar particles colliding… [+2178 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Daniel Strain", "title": "Grad student helps design 'artificial muscles' you can toss in the compost bin - Tech Xplore", "description": "Say \"hello\" to the robots of the future: They're soft and flexible enough to bounce off walls or squeeze into tight spaces. And when you're done with them, you can toss these machines into a compost bin to decompose.", "url": "https://techxplore.com/news/2023-04-grad-student-artificial-muscles-toss.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/grad-student-helps-des.jpg", "publishedAt": "2023-04-23T10:10:01Z", "content": "Say \"hello\" to the robots of the future: They're soft and flexible enough to bounce off walls or squeeze into tight spaces. And when you're done with them, you can toss these machines into a compost … [+6152 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laurel Hamers", "title": "Why are deserts dry? - Livescience.com", "description": "Deserts are found around the world, including next to oceans. But why are these regions dry?", "url": "https://www.livescience.com/planet-earth/why-are-deserts-dry", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wGn3z97jSGqzHceeqxWnAc-1200-80.jpg", "publishedAt": "2023-04-23T09:00:00Z", "content": "Deserts can take many forms — including sweeping sand dunes, rocky canyons, sagebrush steppes and polar ice fields. But they're united by one thing: a lack of rainfall. Generally speaking, anywhere t… [+4112 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hydrogen's Hidden Phase: Machine Learning Unlocks the Secrets of the Universe's Most Abundant Element - SciTechDaily", "description": "Putting hydrogen on solid ground: simulations with a machine learning model predict a new phase of solid hydrogen. A machine-learning technique developed by University of Illinois Urbana-Champaign researchers has revealed a previously undiscovered high-pressu…", "url": "https://scitechdaily.com/hydrogens-hidden-phase-machine-learning-unlocks-the-secrets-of-the-universes-most-abundant-element/", "urlToImage": "https://scitechdaily.com/images/New-Phase-of-Solid-Hydrogen-Predicted.jpg", "publishedAt": "2023-04-23T08:34:36Z", "content": "ByUniversity of Illinois Grainger College of EngineeringApril 23, 2023\r\nPhases of solid hydrogen. The left is the well-studied hexagonal close packed phase, while the right is the new phase predicted… [+7400 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Trillions of Miles Away – Distant Supernovae May Impact the Diversity of Life on Earth - SciTechDaily", "description": "A new study published in Ecology and Evolution by Henrik Svensmark of DTU Space has shown that the explosion of stars, also known as supernovae, has greatly impacted the diversity of marine life over the past 500 million years. The fossil record has been exte…", "url": "https://scitechdaily.com/trillions-of-miles-away-distant-supernovae-may-impact-the-diversity-of-life-on-earth/", "urlToImage": "https://scitechdaily.com/images/Supernova-Biodiversity-Illustration-scaled.jpg", "publishedAt": "2023-04-23T05:49:35Z", "content": "The extraterrestrial processes responsible for influencing the diversity of life forms are usually invisible to the human eye. The Milky Way is where large stars explode, leading to supernova remnant… [+3946 chars]"}]}