{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Carl Zimmer", "title": "Webb Telescope Will Look for Signs of Life Way Out There - The New York Times", "description": "The first question astronomers want to answer about exoplanets: Do they have atmospheres friendly to life?", "url": "https://www.nytimes.com/2022/07/02/science/webb-telescope-exoplanets-atmosphere.html", "urlToImage": "https://static01.nyt.com/images/2022/07/01/science/01SCI-exoplanets4/01SCI-exoplanets4-facebookJumbo.jpg", "publishedAt": "2022-07-04T21:03:37Z", "content": "We have no idea what these atmospheres are made of, said Alexander Rathcke, an astronomer at the Technical University of Denmark. We have ideas, simulations, and all this stuff, but we really have no… [+1113 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Significant Progress in NASA’s Lucy Spacecraft Solar Array Deployment Fix - SciTechDaily", "description": "Beginning on May 6 and continuing through June 16, NASA’s Lucy mission team carried out a multi-stage effort intended to further deploy the spacecraft’s unlatched solar array.Throughout the meticulous process, the team commanded the spacecraft to operate the …", "url": "https://scitechdaily.com/significant-progress-in-nasas-lucy-spacecraft-solar-array-deployment-fix/", "urlToImage": "https://scitechdaily.com/images/Lucy-Deployment.gif", "publishedAt": "2022-07-04T20:38:46Z", "content": "ByErin Morton, NASAJuly 4, 2022\r\nNASAs Lucy spacecraft deploying its solar arrays. Credit: NASAs Goddard Space Flight Center\r\nBeginning on May 6 and continuing through June 16, NASA\r\nEstablished in 1… [+2498 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "NASA’s CAPSTONE Probe Is Officially en Route to the Moon - Gizmodo", "description": "The microwave-sized satellite is on a pathfinder mission to evaluate a unique orbit for an eventual space station at the Moon.", "url": "https://gizmodo.com/nasas-capstone-heading-to-moon-1849140591", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/b57746145a2e8526c7d87a77b9aa887c.jpg", "publishedAt": "2022-07-04T19:30:00Z", "content": "An important milestone has been reached in the newly launched CAPSTONE mission, as the tiny probe, moving in excess of 24,000 miles per hour, has escaped low Earth orbit and begun its four-month trek… [+3036 chars]"}, {"source": {"id": null, "name": "Digital Camera World"}, "author": "Beth Nicholls", "title": "James Webb Space Telescope images are so beautiful they bring scientists to tears - Digital Camera World", "description": "The James Webb Space Telescope is set to drop its first gallery of deep-space astronomy shots on July 12 and we can't wait", "url": "https://www.digitalcameraworld.com/uk/news/james-webb-space-telescope-images-are-so-beautiful-they-bring-scientists-to-tears", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mr2HmjAd589nkpsCdx6LGP-1200-80.jpg", "publishedAt": "2022-07-04T16:23:10Z", "content": "NASA's acclaimed $10 billion James Webb Space Telescope was launched on 25 December 2021, in replacement of the Hubble Space telescope. Nearly seven months after its launch has finally produced image… [+5254 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Anna Rollins", "title": "My family visited a town where cellphones aren't allowed. Not having service made me a more present parent. - Yahoo! Voices", "description": "The area is considered a quiet zone, and cellphones are illegal. The mom of two realized that without distractions, she's a better parent.", "url": "https://www.insider.com/watoga-state-park-phones-not-allowed-made-my-parenting-better-2022-7", "urlToImage": "https://i.insider.com/62bf14749b16eb0018021860?width=1200&format=jpeg", "publishedAt": "2022-07-04T11:15:00Z", "content": "We started the summer by taking a trip to the \"Quiet Zone.\" After a month of shift work, elusive toddler fevers, and canine diarrhea, my husband rented a cabin in Watoga State Park, West Virginia, fo… [+3270 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Pierre CELERIER", "title": "Large Hadron Collider revs up to unprecedented energy level - Phys.org", "description": "Ten years after it discovered the Higgs boson, the Large Hadron Collider is about to start smashing protons together at unprecedented energy levels in its quest to reveal more secrets about how the universe works.", "url": "https://phys.org/news/2022-07-large-hadron-collider-revs-unprecedented.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-worlds-largest-and.jpg", "publishedAt": "2022-07-04T09:19:15Z", "content": "Ten years after it discovered the Higgs boson, the Large Hadron Collider is about to start smashing protons together at unprecedented energy levels in its quest to reveal more secrets about how the u… [+3879 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Anderson Cooper", "title": "NASA begins search for ancient life on Mars after arrival of Perseverance, Ingenuity spacecrafts - 60 Minutes - CBS News", "description": "Anderson Cooper reports on the nerve-wracking Mars landing of the rover Perseverance, the painstaking process of launching the tiny helicopter Ingenuity, and the extraordinary images the two have already sent back to Earth.", "url": "https://www.cbsnews.com/news/mars-life-ingenuity-helicopter-perseverance-rover-60-minutes-2022-07-03/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2021/05/09/4c529582-7e4c-4817-91a6-f60cd9697b1f/thumbnail/1200x630/4330c4e89659bf5615f1ec37ca2e57af/perseverancearticle.jpg", "publishedAt": "2022-07-03T22:56:48Z", "content": "It's been nearly two years since the tiny helicopter Ingenuity and the one-ton rover Perseverance left planet Earth and they've come a very long way since then. In February, last year, they landed in… [+14186 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jacinta Bowler", "title": "Nearly 1,000 Microbe Species Have Just Been Discovered in 'Extreme' Tibetan Glaciers - ScienceAlert", "description": "Living as a microbe on the Tibetan Plateau isn't easy. Frigid temperatures, high levels of solar radiation, not a lot to eat, and you'd regularly get frozen and then thawed depending on the time of year.", "url": "https://www.sciencealert.com/scientists-found-968-species-of-bacteria-in-the-extreme-environments-of-tibetan-glaciers", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/SatelliteImageOfIcyTibetianPlateu_1024.jpg", "publishedAt": "2022-07-03T18:02:25Z", "content": "Living as a microbe on the Tibetan Plateau isn't easy. Frigid temperatures, high levels of solar radiation, not a lot to eat, and you'd regularly get frozen and then thawed depending on the time of y… [+2974 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fixing Shoulder Pain: Harvard Scientists Develop a Method To Restore Damaged Tendons and Muscles - SciTechDaily", "description": "The new complex tissue platform can restore damaged rotator cuffs The typical office worker often has soreness throughout their body as a result of their sedentary desk jobs. Even young individuals may develop shoulder pain, which was previously primarily an …", "url": "https://scitechdaily.com/fixing-shoulder-pain-harvard-scientists-develop-a-method-to-restore-damaged-tendons-and-muscles/", "urlToImage": "https://scitechdaily.com/images/Human-Shoulder-Muscles.jpg", "publishedAt": "2022-07-03T15:59:24Z", "content": "After the use of their tissue platform, the researchers observed regeneration of tissues and shoulder function recovery.\r\nThe new complex tissue platform can restore damaged rotator cuffs\r\nThe typica… [+2820 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "The Sun", "title": "Two ways life on Mars may be hiding from scientists - New York Post ", "description": "Despite the scientific community’s best efforts, however, no proof of past or present life has been found on Mars.", "url": "https://nypost.com/2022/07/03/two-ways-life-on-mars-may-be-hiding-from-scientists/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/07/mars-getty-comp.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-07-03T15:02:00Z", "content": "The possibility of alien life on Mars is a topic that has captivated astronomers for decades.\r\nDespite the scientific community’s best efforts, however, no proof of past or present life has been foun… [+2860 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dennis Overbye", "title": "James Bardeen, an Expert on Unraveling Einstein’s Equations, Dies at 83 - The New York Times", "description": "A scion of a renowned family of physicist, he helped set the stage for what has been called the golden age of black hole astrophysics.", "url": "https://www.nytimes.com/2022/07/03/science/space/james-bardeen-an-expert-on-unraveling-einsteins-equations-dies-at-83.html", "urlToImage": "https://static01.nyt.com/images/2022/07/01/obituaries/01Bardeen1/01Bardeen1-facebookJumbo.jpg", "publishedAt": "2022-07-03T14:40:28Z", "content": "After holding postdoctoral positions at Caltech and the University of California, Berkeley, he joined the astronomy department at the University of Washington in 1967. An avid hiker and mountain clim… [+994 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "The Sun", "title": "Solar storm ‘snowplows’ past Earth, could cause problems with power grid - New York Post ", "description": "The nearby solar eruption snowplowed dense plasma towards the Earth triggering geomagnetic storms in at least two US states, according to weather data.", "url": "https://nypost.com/2022/07/03/solar-storm-could-cause-power-grid-and-satellite-problems/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/07/solar-storm-sun-getty-03.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-07-03T14:32:00Z", "content": "A solar storm that zoomed past Earth recently might create problems for satellites and the countrys power grid, experts say.\r\nThe nearby solar eruption snowplowed dense plasma towards the Earth trigg… [+2240 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Perseverance Mars rover wind sensor damaged by pebbles, but still operational - Space.com", "description": "Higher-than-expected wind speeds struck elements on the Red Planet rover's weather station.", "url": "https://www.space.com/perseverance-rover-wind-sensor-damaged", "urlToImage": "https://cdn.mos.cms.futurecdn.net/abrjxh72WUo4ehNhxeL4LD-1200-80.jpeg", "publishedAt": "2022-07-03T10:00:49Z", "content": "Mars can be an awfully windy place, it turns out.\r\nThe Perseverance rover touched down on the Red Planet in February 2021 carrying, among other instruments, a weather station dubbed Mars Environmenta… [+3285 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Aphelion 2022: Earth will be farthest from the sun on the Fourth of July - Space.com", "description": "At aphelion, Earth will be 94.51 million miles (152.1 million kilometers) away from the sun.", "url": "https://www.space.com/aphelion-july-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dtCbApaNJ2hhRMTNmU3ypU-1200-80.jpg", "publishedAt": "2022-07-03T10:00:41Z", "content": "On Monday (July 4), Earth celebrates Independence Day by getting as far away from the sun as possible — reaching what astronomers call aphelion at 3 a.m. EDT (0700 GMT).\r\nAt aphelion, Earth\r\n will be… [+1948 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "James Webb Space Telescope has comets to catch when science begins - Space.com", "description": "One might even be an interstellar visitor.", "url": "https://www.space.com/james-webb-space-telescope-comet-observations", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zwCmiEtaUidG37zts6Cw4A-1200-80.jpg", "publishedAt": "2022-07-03T10:00:16Z", "content": "Comets have mystified humanity for millennia, but with the James Webb Space Telescope beginning science operations this month, scientists hope to unravel secrets about these icy objects.\r\nIn a study … [+3161 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Create Continuous Time Crystal for the First Time - SciTechDaily", "description": "Scientists have succeeded for the first time in realizing a time crystal that spontaneously breaks continuous time translation symmetry. The researchers, from the Institute of Laser Physics at the University of Hamburg, reported their observation in a study p…", "url": "https://scitechdaily.com/physicists-create-continuous-time-crystal-for-the-first-time/", "urlToImage": "https://scitechdaily.com/images/Abstract-Red-Crystals.gif", "publishedAt": "2022-07-03T08:08:31Z", "content": "Researchers observe continuous time crystal for the first time. (Artists concept.)\r\nScientists have succeeded for the first time in realizing a time crystal that spontaneously breaks continuous time … [+2171 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Explosion of life on Earth linked to heavy metal act at planet’s centre - The Guardian", "description": "Formation of solid iron core 550m years ago restored magnetic field and protected surface", "url": "https://amp.theguardian.com/science/2022/jul/03/explosion-of-life-on-earth-linked-to-heavy-metal-act-at-planets-centre", "urlToImage": null, "publishedAt": "2022-07-03T07:45:00Z", "content": "EvolutionFormation of solid iron core 550m years ago restored magnetic field and protected surface\r\nAt the centre of the Earth, a giant sphere of solid iron is slowly swelling. This is the inner core… [+4131 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "The Largest Alcohol Molecule Found in Space Yet May Be The Key to Star Formation - ScienceAlert", "description": "There's alcohol up in space. No, it's not bottles of wine discarded by careless astronauts; rather, it's in microscopic molecular form. Now researchers think they've discovered the largest alcohol molecule in space yet, in the form of propanol.", "url": "https://www.sciencealert.com/this-is-the-largest-alcohol-molecule-we-ve-found-in-space-yet", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/MilkyWay_1024.jpg", "publishedAt": "2022-07-03T06:02:40Z", "content": "There's alcohol up in space. No, it's not bottles of wine discarded by careless astronauts; rather, it's in microscopic molecular form. Now researchers think they've discovered the largest alcohol mo… [+3626 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genome Analysis Now Allows Scientists To Predict if You Will Have a Miscarriage - SciTechDaily", "description": "In order to shed light on the genetic cause of female infertility, Rutgers researchers have combined genomic sequencing with machine learning techniques According to Rutgers University research, specialized analysis of a woman's genome may be used to predict …", "url": "https://scitechdaily.com/genome-analysis-now-allows-scientists-to-predict-if-you-will-have-a-miscarriage/", "urlToImage": "https://scitechdaily.com/images/Fetus-in-Womb.jpg", "publishedAt": "2022-07-02T22:01:35Z", "content": "ByRutgers UniversityJuly 2, 2022\r\nThe researchers discovered three genes, MCM5, FGGY, and DDX60L, that are strongly linked to the risk of developing eggs with an abnormal number of chromosomes when t… [+4078 chars]"}, {"source": {"id": null, "name": "19fortyfive.com"}, "author": "Harrison Kass", "title": "X-38: The NASA 'Space Plane' Built for a Special Purpose - 19FortyFive", "description": "NASA’s X-38 was an experimental re-entry vehicle, designed to serve as an emergency crew return vehicle for the International Space Station.", "url": "https://www.19fortyfive.com/2022/07/x-38-the-nasa-space-plane-built-for-a-special-purpose/", "urlToImage": "https://www.19fortyfive.com/wp-content/uploads/2022/06/X-38.jpg", "publishedAt": "2022-07-02T21:50:37Z", "content": "NASAs X-38 was an experimental re-entry vehicle, designed to serve as an emergency crew return vehicle (CRV) for the International Space Station (ISS). The program was conceived in 1995 and first fle… [+3802 chars]"}]}