{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Have gravitational waves provided the first hint of primordial black holes born during the Big Bang? - Space", "description": "\"If this turns out to be real, then it’s enormous.\"", "url": "https://www.space.com/astronomy/black-holes/have-gravitational-waves-provided-the-first-hint-of-primordial-black-holes-born-during-the-big-bang", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E7CXgoY2rqbTvyftzcSSL3-1600-80.png", "publishedAt": "2025-11-30T13:00:00Z", "content": "Scientists may have \"heard\" the first tantalizing hints of long-theorized primordial black holes born during the Big Bang. The potential detection of these tiny black holes that could be the size of … [+7112 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Stephen DiKerby", "title": "How will the universe end? - Space", "description": "Depending on how you look at it, the universe might not have an \"end,\" after all.", "url": "https://theconversation.com/how-will-the-universe-end-269678", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ch6UzG9HNMzzYQnxuHd3kL-1920-80.jpg", "publishedAt": "2025-11-30T13:00:00Z", "content": "This article was originally published at The Conversation.\r\n The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights\r\n. \r\nWhether the universe will \"end\" at all is … [+6539 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Are the Jets from 3I/ATLAS Pulsed Like a Heartbeat? - Avi Loeb – Medium", "description": "Following its detection on July 1, 2025, the light from the interstellar object 3I/ATLAS showed pulsating variability with a period of…", "url": "https://avi-loeb.medium.com/are-the-jets-from-3i-atlas-pulsed-like-a-heartbeat-fe39dc583d25", "urlToImage": "https://miro.medium.com/v2/resize:fit:768/1*2uQ1Ia-35ug50gMpO9xUhw.jpeg", "publishedAt": "2025-11-30T11:46:40Z", "content": "Image of 3I/ATLAS on November 28, 2025 from KalopaStars in Hawaii. (Image credit: Bobby Howe)\r\nImage of 3I/ATLAS on November 29, 2025 at 21:53 UTC, taken with a 0.26-meter telescope in Rayong, Thaila… [+5671 chars]"}, {"source": {"id": null, "name": "Grist"}, "author": "Matt Simon", "title": "Antarctica's Southern Ocean might be gearing up for a thermal 'burp' that could last a century - Live Science", "description": "Even if humans cut emissions enough to reduce global temperatures, new research shows the Southern Ocean could kick warming back into gear.", "url": "https://grist.org/oceans/hey-so-one-day-the-ocean-might-burp-up-a-bunch-of-heat/", "urlToImage": "https://grist.org/wp-content/uploads/2025/11/southern-ocean-warming-burp-heat-emissions-climate.jpeg?quality=75&strip=all", "publishedAt": "2025-11-30T11:45:00Z", "content": "Consider your morning cup of coffee. Your kettles heating element or flame on a stove warms up water that you infuse with beans and pour into a mug. Maybe you get busy and the cup of joe sits there f… [+5168 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Chernobyl Fungus Appears to Have Evolved an Incredible Ability - ScienceAlert", "description": "The Chernobyl exclusion zone may be off-limits to humans, but ever since the Unit Four reactor at the Chernobyl Nuclear Power Plant exploded nearly 40 years ago, other forms of life have not only moved in but survived, adapted, and appeared to thrive.", "url": "https://www.sciencealert.com/chernobyl-fungus-appears-to-have-evolved-an-incredible-ability", "urlToImage": "https://www.sciencealert.com/images/2025/11/melanized-fungus.jpg", "publishedAt": "2025-11-30T11:01:32Z", "content": "The Chernobyl exclusion zone may be off-limits to humans, but ever since the Unit Four reactor at the Chernobyl Nuclear Power Plant exploded nearly 40 years ago, other forms of life have not only mov… [+5542 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Shreejaya Karantha", "title": "Scientists mapped the shape of a supernova for the first time ever – and it's not what we expected: Space photo of the week - Live Science", "description": "Astronomers using data from the Very Large Telescope (VLT) have revealed that the initial \"breakout\" phase of a supernova is elongated, not perfectly spherical.", "url": "https://www.livescience.com/space/scientists-mapped-the-shape-of-a-supernova-for-the-first-time-ever-and-its-not-what-we-expected-space-photo-of-the-week", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dJ2wmqY2EBg8sCd7EdP4Wn-1600-80.png", "publishedAt": "2025-11-30T11:00:00Z", "content": "What it is: An artist’s impression of the supernova explosion SN 2024ggi\r\nWhere it is: 22 million light-years away in the constellation Hydra.\r\nWhen it was shared: Nov. 12, 2025\r\nOn April 10, 2024, t… [+3401 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Dinosaur mummy found with hooves and a hidden crest - ScienceDaily", "description": "Scientists have reconstructed the most complete and lifelike profile of Edmontosaurus annectens thanks to an extraordinary preservation process called clay templating, in which a thin clay film captured the dinosaur’s skin, scales, spikes, and even hooves in …", "url": "https://www.sciencedaily.com/releases/2025/11/251129044518.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/edmontosaurus-annectens.webp", "publishedAt": "2025-11-30T08:47:57Z", "content": "In a new paper in Science, researchers from the University of Chicago describe how, about 66 million years ago, the bodies of the duck-billed dinosaur Edmontosaurus annectens were transformed into re… [+7925 chars]"}, {"source": {"id": null, "name": "AZ Big Media"}, "author": "Experience AZ", "title": "Arizona ranks No. 2 in U.S. to see December’s Cold Moon Supermoon - AZ Big Media", "description": "Arizona residents can see one of the most striking sky events as the state ranks No. 2 in U.S. to see December’s Cold Moon Supermoon.", "url": "https://azbigmedia.com/lifestyle/arizona-ranks-no-2-in-u-s-to-see-decembers-cold-moon-supermoon/", "urlToImage": "https://azbigmedia.com/wp-content/uploads/2025/10/supermoon.jpeg", "publishedAt": "2025-11-30T01:16:52Z", "content": "Arizona residents can look forward to one of the most striking sky events of the year. On Thursday, December 4, 2025, the Cold Moon Supermoon will rise over red rock canyons, saguaro forests, and des… [+2886 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Invisible barrier discovered in the ocean that jellyfish won’t cross - Earth.com", "description": "The way Botrynema jellyfish is distributed across the ocean may reveal a previously unknown biogeographic barrier in the North Atlantic.", "url": "https://www.earth.com/news/invisible-barrier-discovered-in-the-ocean-that-jellyfish-botrynema-wont-cross/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/29135956/jellyfish_Botrynema-brucei_NOAA_1m.jpg", "publishedAt": "2025-11-29T23:15:00Z", "content": "Life in the deep ocean often sorts into hidden zones shaped by temperature, salt, and moving water. Many animals, like Botrynema jellyfish, stay within a narrow band of conditions, almost like having… [+7359 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Polly Davis Doig", "title": "Behold, the Butterfly Nebula - Newser", "description": "Telescope in Chile captures stunning new picture of a cosmic butterfly", "url": "https://www.newser.com/story/379448/telescope-captures-stunning-picture-of-a-cosmic-butterfly.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1649174-12-20251129162102.jpeg", "publishedAt": "2025-11-29T21:51:00Z", "content": "A telescope in Chile has captured a stunning new picture of a grand and graceful cosmic butterfly. The National Science Foundation's NoirLab released the picture, which was snapped last month by the … [+246 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Simon Alvarez", "title": "SpaceX’s Starship FL launch site will witness scenes once reserved for sci-fi films - Teslarati", "description": "A Starship that launches from the Florida site could touch down on the same site years later.", "url": "https://www.teslarati.com/spacex-starship-fl-launch-site-witness-scenes-sci-fi-films/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2025/08/starship-flight-10-stacking-1000x600.jpeg", "publishedAt": "2025-11-29T21:06:42Z", "content": "Elon Musk has proposed a high-profile gaming challenge for xAIs upcoming Grok 5. As per Musk, it would be interesting to see if the large language model could beat the world best human League of Lege… [+5406 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Scientists Reveal When Earth Will Stop Supporting Life—And It’s Sooner Than You Think! - The Daily Galaxy", "description": "Scientists predict a catastrophic future for Earth where a \"triple whammy\" of extinction events will eventually wipe out all life.", "url": "https://dailygalaxy.com/2025/11/earth-will-stop-supporting-life-sooner/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Scientists-Reveal-When-Earth-Will-Stop-Supporting-Life—And-Its-Sooner-Than-You-Think-scaled.png", "publishedAt": "2025-11-29T20:30:00Z", "content": "A groundbreaking study conducted by scientists at the University of Bristol has made a chilling prediction about Earth’s distant future. According to their research published in Nature Geoscience, al… [+3940 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "Why being in the 'right place' isn't enough for life - Phys.org", "description": "A planet's habitability is determined by a confluence of many factors. So far, our explorations of potentially habitable worlds beyond our solar system have focused exclusively on their position in the \"Goldilocks Zone\" of their solar system, where their temp…", "url": "https://phys.org/news/2025-11-isnt-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/why-being-in-the-right.jpg", "publishedAt": "2025-11-29T18:00:46Z", "content": "A planet's habitability is determined by a confluence of many factors. So far, our explorations of potentially habitable worlds beyond our solar system have focused exclusively on their position in t… [+7511 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics’ Strangest Prediction: Researchers Propose Way to Finally “See” the Warmth of the Vacuum - SciTechDaily", "description": "A subtle timing flash may expose the Unruh effect. The approach ties ordinary lab tools to deep quantum physics. Researchers at Stockholm University and the Indian Institute of Science Education and Research (IISER) Mohali have identified a practical method f…", "url": "https://scitechdaily.com/physics-strangest-prediction-researchers-propose-way-to-finally-see-the-warmth-of-the-vacuum/", "urlToImage": "https://scitechdaily.com/images/AI-Illustration-of-Unruh-Experiment-Setup.jpg", "publishedAt": "2025-11-29T17:50:24Z", "content": "AI illustration of the proposed experiment – Time-Resolved and Superradiantly Amplified Unruh Effect. Credit: Stockholm University\r\nA subtle timing flash may expose the Unruh effect. The approach tie… [+2816 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Watch live as near-Earth asteroid Eros buzzes the Andromeda Galaxy on Nov. 30 (video) - Space", "description": "Eros will pass within 2 degrees of the Andromeda Galaxy's core on Nov. 30.", "url": "https://www.space.com/stargazing/watch-live-as-near-earth-asteroid-eros-buzzes-the-andromeda-galaxy-on-nov-30-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xAwK3yiZEkcFM8Ps6PUZp8-1884-80.jpg", "publishedAt": "2025-11-29T17:00:00Z", "content": "(Image credit: Amazon)\r\nThe Celestron NexStar 8SE is a great choice for exploring distant solar system objects and you can currently get it for $200 off during the Black Friday sales! Check out our B… [+2697 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bernd Ebeling", "title": "Rapid X-ray pulses enable 100-fold efficiency boost for photoionization - Phys.org", "description": "Speed matters. When an X-ray photon excites an atom or ion, making a core electron jump onto a higher energy level, a short-lived window of opportunity opens. For just a few femtoseconds, before an electron fills the void in the lower energy level, a second p…", "url": "https://phys.org/news/2025-11-rapid-ray-pulses-enable-efficiency.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-100-fold-efficiency.jpg", "publishedAt": "2025-11-29T16:20:01Z", "content": "Speed matters. When an X-ray photon excites an atom or ion, making a core electron jump onto a higher energy level, a short-lived window of opportunity opens. For just a few femtoseconds, before an e… [+2994 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "JWST spots a strange red dot so extreme scientists can’t explain it - ScienceDaily", "description": "The discovery of strange, ultra-red objects—especially the extreme case known as The Cliff—has pushed astronomers to propose an entirely new type of cosmic structure: black hole stars. These exotic hybrids could explain rapid black hole growth in the early un…", "url": "https://www.sciencedaily.com/releases/2025/11/251127102115.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/black-hole-star.webp", "publishedAt": "2025-11-29T14:51:24Z", "content": "In the summer of 2022, only a few weeks after the James Webb Space Telescope (JWST) began delivering its first scientific images, astronomers noticed an unexpected pattern: tiny red points scattered … [+10705 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Scientists Find Fossilized Swim Traces, Revealing That T. rex Was More Than Just a Land Predator - The Daily Galaxy", "description": "While T. rex is best known for its fearsome presence on land, scientists are starting to believe it may have been more of a water-loving creature than we previously imagined.", "url": "https://dailygalaxy.com/2025/11/fossilized-swim-traces-t-rex-swim/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Scientists-Find-Fossilized-Swim-Traces-Revealing-That-T.-rex-Was-More-Than-Just-a-Land-Predator-scaled.jpg", "publishedAt": "2025-11-29T14:45:00Z", "content": "Its easy to picture T.rex stomping through forests, roaring at the top of its lungs as it hunted down its prey. But what if this terrifying predator was also capable of swimming? It might sound stran… [+3030 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "Asteroid loaded with amino acids offers new clues about the origin of life on Earth - Phys.org", "description": "One of the most elegant theories about the origins of life on our planet is that it was kick-started by a delivery from outer space. This idea suggests that prebiotic molecules—the building blocks of life—were transported here by asteroids or other celestial …", "url": "https://phys.org/news/2025-11-asteroid-amino-acids-clues-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/asteroid-loaded-with-a.jpg", "publishedAt": "2025-11-29T14:30:01Z", "content": "One of the most elegant theories about the origins of life on our planet is that it was kick-started by a delivery from outer space. This idea suggests that prebiotic moleculesthe building blocks of … [+3417 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover How To “Hack” Bacterial Conversations To Prevent Gum Disease - SciTechDaily", "description": "Disrupting the chemical messages that oral bacteria use to coordinate growth may help prevent disease by keeping plaque communities in a healthier state. Like all living things, bacteria adapt in order to survive. Over time, many have become resistant to wide…", "url": "https://scitechdaily.com/scientists-discover-how-to-hack-bacterial-conversations-to-prevent-gum-disease/", "urlToImage": "https://scitechdaily.com/images/Computer-Rendered-Split-Image-of-Bacteria-on-a-Tooth-Surface.jpg", "publishedAt": "2025-11-29T14:24:13Z", "content": "Computer-rendered split image of bacteria on a tooth surface. When microbial communication is “on”, disease-associated species grow (left). Disrupting this communication (right) promotes health-assoc… [+4285 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists may have found dark matter after 100 years of searching - ScienceDaily", "description": "Nearly a century after astronomers first proposed dark matter to explain the strange motions of galaxies, scientists may finally be catching a glimpse of it. A University of Tokyo researcher analyzing new data from NASA’s Fermi Gamma-ray Space Telescope has d…", "url": "https://www.sciencedaily.com/releases/2025/11/251129053349.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/astrophysics-dark-matter-particle-mystery.webp", "publishedAt": "2025-11-29T14:22:53Z", "content": "In the early 1930s, Swiss astronomer Fritz Zwicky noticed that many galaxies were moving far faster than their visible mass should permit. This unusual motion led him to propose that some kind of inv… [+3747 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: Cute squid with scary name; potential detection of dark matter; fate of the AMOC - Phys.org", "description": "This week, researchers reported that weight and health markers may rebound when patients stop using some of the new hormonal gastric inhibitory polypeptide drugs. A prototype device can restore lost olfactory sense. And a new universal law predicts how brittl…", "url": "https://phys.org/news/2025-11-saturday-citations-cute-squid-scary.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/saturday-citations-cut.jpg", "publishedAt": "2025-11-29T14:00:01Z", "content": "This week, researchers reported that weight and health markers may rebound when patients stop using some of the new hormonal gastric inhibitory polypeptide drugs. A prototype device can restore lost … [+5101 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "Two Massive 'Continents' Found Above Earth's Core Could Be Traces of a Lost, Molten World - The Daily Galaxy", "description": "Hidden beneath Earth’s surface lie two massive structures that defy everything we thought we knew about our planet’s formation. Now, a groundbreaking discovery reveals they may be far older—and far stranger—than anyone imagined.", "url": "https://dailygalaxy.com/2025/11/two-massive-continents-found-above-earths-core-could-be-traces-of-a-lost-molten-world/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Scientists-Just-Linked-Mysterious-Mantle-Blobs-to-Earths-Fiery-Origins-scaled.jpg", "publishedAt": "2025-11-29T13:45:00Z", "content": "Buried nearly 1,800 miles below Earths surface are two vast, continent-sized structures that continue to challenge our understanding of the planets formation. Theselarge low shear velocity provinceso… [+4904 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "Probing the quantum nature of black holes through entropy - Phys.org", "description": "In a study published in Physical Review Letters, physicists have demonstrated that black holes satisfy the third law of thermodynamics, which states that entropy remains positive and vanishes at extremely low temperatures, just like ordinary quantum systems. …", "url": "https://phys.org/news/2025-11-probing-quantum-nature-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/probing-the-quantum-na.jpg", "publishedAt": "2025-11-29T13:20:03Z", "content": "In a study published in Physical Review Letters, physicists have demonstrated that black holes satisfy the third law of thermodynamics, which states that entropy remains positive and vanishes at extr… [+8646 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Satellite Images Expose Eye of the Sahara: A Mysterious Geological Wonder - The Daily Galaxy", "description": "The Eye of the Sahara, a vast geological formation in Mauritania, holds secrets that scientists are only beginning to understand, with new insights provided by ESA's stunning satellite imagery.", "url": "https://dailygalaxy.com/2025/11/satellite-images-expose-eye-of-the-sahara/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Satellite-Images-Expose-Eye-of-the-Sahara-A-Mysterious-Geological-Wonder-scaled.png", "publishedAt": "2025-11-29T12:15:00Z", "content": "Hidden in the golden sands of the Sahara Desert lies a geological marvel that has captured the attention of astronauts and scientists alike. Known as the “Eye of the Sahara,” this natural formation, … [+3221 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Science news this week: An enigmatic human relative, dark matter discovery and mysterious lights in the sky during nuclear weapons tests - Live Science", "description": "Nov. 29, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/health/science-news-this-week-an-enigmatic-human-relative-dark-matter-discovery-and-mysterious-lights-in-the-sky-during-nuclear-weapons-tests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BWaQZUCL92xS2rpUxtcFBi-1600-80.jpg", "publishedAt": "2025-11-29T12:00:00Z", "content": "This week’s biggest science news took us on a journey through human prehistory, with the discovery that the mysterious, 3.4 million-year-old \"Burtele foot\" in Ethiopia may have belonged to an enigmat… [+7097 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "He Tried Everything to Crack Open a ‘Gold Nugget’—Then He Learned It Was Worth Billions! - The Daily Galaxy", "description": "A rock thought to be gold turns out to be a meteorite that’s more valuable than you can imagine.", "url": "https://dailygalaxy.com/2025/11/he-thought-it-was-gold-but-its-meteorite/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/He-Tried-Everything-to-Crack-Open-a-‘Gold-Nugget—Then-He-Learned-It-Was-Worth-Billions-scaled.jpg", "publishedAt": "2025-11-29T11:45:00Z", "content": "In 2015, a resident of Maryborough, Victoria, named David Hole, thought he had found a gold nugget in the Maryborough Regional Park. He spent years trying to crack it open, convinced it contained gol… [+3264 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "RJ Mackenzie", "title": "Scientists Detect “Switchback” Phenomenon In Earth’s Magnetosphere For The First Time - IFLScience", "description": "A probe detected a zigzag-like disturbance in the magnetic frontier between the Earth and the Sun.", "url": "https://www.iflscience.com/scientists-detect-switchback-phenomenon-in-earths-magnetosphere-for-the-first-time-81739", "urlToImage": "https://assets.iflscience.com/assets/articleNo/81739/aImg/87791/earth-s-magnetosphere-meta.jpg", "publishedAt": "2025-11-29T09:23:21Z", "content": "The Earths magnetosphere is a protective shroud that blocks charged particles and cosmic rays blasted out by the Sun. The four unmanned spacecraft that make up NASAs Magnetospheric Multiscale Mission… [+2347 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Baikonur pad damaged in Soyuz launch to ISS - SpaceNews", "description": "The Baiknour pad used for the launch of the latest crew to the ISS has sustained damage, raising questions about its ability to support upcoming missions.", "url": "http://spacenews.com/baikonur-pad-damaged-in-soyuz-launch-to-iss/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/11/54953022444_8e0647b78d_k.jpg", "publishedAt": "2025-11-29T09:15:54Z", "content": "BERLIN The Baiknour pad used for the launch of the latest crew to the International Space Station has sustained damage, raising questions about its ability to support upcoming missions to the station… [+2266 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Create 7 Remarkable New Ceramic Materials by Simply Removing Oxygen - SciTechDaily", "description": "Penn State scientists discovered seven new ceramics by simply removing oxygen—opening a path to materials once beyond reach. Sometimes, less truly is more. By removing oxygen during the synthesis process, a team of materials scientists at Penn State successfu…", "url": "https://scitechdaily.com/scientists-create-7-remarkable-new-ceramic-materials-by-simply-removing-oxygen/", "urlToImage": "https://scitechdaily.com/images/Three-Newly-Synthesized-High-Entropy-Oxide-Ceramic-Pellets.jpg", "publishedAt": "2025-11-28T23:20:25Z", "content": "Three of the seven newly synthesized high-entropy oxide ceramic pellets are pictured here. Credit: David Kubarek/Penn State\r\nPenn State scientists discovered seven new ceramics by simply removing oxy… [+6596 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Morgan Underwood", "title": "Beyond the habitable zone: Exoplanet atmospheres are the next clue to finding life on planets orbiting distant stars - Space", "description": "But being in this sweet spot doesn't automatically mean a planet is hospitable to life.", "url": "https://theconversation.com/beyond-the-habitable-zone-exoplanet-atmospheres-are-the-next-clue-to-finding-life-on-planets-orbiting-distant-stars-267498", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yrqfMcZuxgPgQBUAT3G6FQ-1280-80.jpg", "publishedAt": "2025-11-28T23:00:00Z", "content": "This article was originally published at The Conversation.\r\n The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights\r\n. \r\nWhen astronomers search for planets that c… [+7778 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Maps of the world look much different than reality in people's minds - Earth.com", "description": "A global game reveals that our idea of the size of continents is more accurate than classic maps and their distortions suggest.", "url": "https://www.earth.com/news/maps-of-the-world-look-much-different-than-reality-in-peoples-minds/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/27043510/how-people-perceive-world-size-africa-europe-canada.jpg", "publishedAt": "2025-11-28T22:14:16Z", "content": "Almost 100,000 people around the world played an online map projection game that asked them to judge land areas. Their guesses showed that most peoples inner picture of the planet is closer to realit… [+5440 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA probe captures stunning photos of Earth and moon on the way to infamous asteroid Apophis - Space", "description": "These images mark an early milestone in the mission, confirming that OSIRIS-APEX is healthy and on course for its 2029 encounter with Apophis.", "url": "https://www.space.com/astronomy/asteroids/nasa-probe-captures-stunning-photos-of-earth-and-moon-on-the-way-to-infamous-asteroid-apophis", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S9HwEbiVVN9ec3evi5Qsqb-1536-80.jpg", "publishedAt": "2025-11-28T22:00:00Z", "content": "NASA's OSIRIS-APEX spacecraft captured stunning new images of Earth recently as it whipped past the planet during a high-speed slingshot maneuver, sending the probe on a fast track toward the famous … [+3217 chars]"}, {"source": {"id": null, "name": "Avon, CT Patch"}, "author": "Chris Lindahl", "title": "Did You Hear A Sonic Boom? SpaceX Warns That Launch May Cause Multiple Booms Over SoCal - Patch", "description": "SpaceX's latest rocket launch may cause multiple sonic booms, the company warned.", "url": "https://patch.com/california/los-angeles/did-you-hear-sonic-boom-spacex-warns-launch-may-cause-multiple-booms-over", "urlToImage": "https://patch.com/img/cdn20/shutterstock/26494162/20251128/021938/styles/patch_image/public/shutterstock-2414661627___28141923292.jpg", "publishedAt": "2025-11-28T19:39:12Z", "content": "Did you hear that boom? SpaceX completed its latest rocket launch from Vandenberg Space Force Base Friday morning and the company said some California resident may have heard one or more sonic booms … [+1249 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kimberley Lane, Jase Parnell-Brookes", "title": "World's smallest image-stabilized binoculars now cheaper for Black Friday - Live Science", "description": "The Nikon 12x25 S image-stabilized binoculars may be small and compact, but they provide shake-free views of wildlife and the night sky that fit in your pocket.", "url": "https://www.livescience.com/technology/these-tiny-image-stabilized-binoculars-are-great-for-wildlife-and-theyre-on-sale-for-black-friday", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R9mhrfcKHixTcN979xnX9g-2133-80.jpg", "publishedAt": "2025-11-28T19:34:41Z", "content": "The best image-stabilized binoculars are typically pretty massive and heavy, but these Nikon 12x25 S IS binos change the game completely. They're currently $62 cheaper at Newegg than on Amazon.\r\nNiko… [+2029 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "AI-Guided Robot Plants ‘Baby Corals’ Across the Great Barrier Reef - Good News Network", "description": "A robotic assistant called the Deployment Guidance System (DGS) scans the seafloor and determines the best place for a coral to spawn.", "url": "https://www.goodnewsnetwork.org/ai-guided-robot-plants-baby-corals-across-the-great-barrier-reef/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/11/Coral-on-the-Great-Barrier-Reef-Toby-Hudson-CC-3.0.jpg", "publishedAt": "2025-11-28T19:30:53Z", "content": "Coral on the Great Barrier Reef – Toby Hudson CC 3.0.\r\nAt the Australian Institute of Marine Science, artificial intelligence is being leveraged to help restore coral reefs after recent bleaching eve… [+2421 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "Dark matter-dark energy interaction shapes cosmic halo spin and alignment, simulations show - Phys.org", "description": "A cosmological simulation study by researchers from the Shanghai Astronomical Observatory of the Chinese Academy of Sciences has systematically revealed, for the first time, how the interaction between dark matter and dark energy significantly influences the …", "url": "https://phys.org/news/2025-11-dark-energy-interaction-cosmic-halo.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-study-reveals-key-3.jpg", "publishedAt": "2025-11-28T18:11:29Z", "content": "A cosmological simulation study by researchers from the Shanghai Astronomical Observatory of the Chinese Academy of Sciences has systematically revealed, for the first time, how the interaction betwe… [+4672 chars]"}]}