{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Study: Hot Vesuvian ash cloud really did turn a brain to glass - Ars Technica", "description": "Fresh analysis with calorimetry, X-rays, electron microscopy lend support to hotly debated theory.", "url": "https://arstechnica.com/science/2025/02/study-hot-vesuvian-ash-cloud-really-did-turn-a-brain-to-glass/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/glass4-1152x648-1740664312.jpg", "publishedAt": "2025-02-27T16:00:26Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "NASA set to deliver a knock-out PUNCH to mysteries of the solar wind - Space.com", "description": "\"We expect we'll revolutionize how space weather is forecasted.\"", "url": "https://www.space.com/the-universe/sun/nasa-set-to-deliver-a-knock-out-punch-to-mysteries-of-the-solar-wind", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PPeWimsm9BVKGVfPeWCr7P-1200-80.jpg", "publishedAt": "2025-02-27T14:00:10Z", "content": "The secrets of the solar wind will soon come under renewed scrutiny thanks to the launch of an upcoming NASA mission that will gaze at the sun and the inner solar system.\r\nThe mission, called PUNCH, … [+5821 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Giant Flying Squirrel Discovered in Tennessee - SciTechDaily", "description": "A prehistoric giant flying squirrel once glided over ancient Appalachia but went extinct as the climate cooled. Its fossils, found at the Gray Fossil Site, reveal a surprising connection to Eurasian species. A giant flying squirrel, roughly the size of a mode…", "url": "https://scitechdaily.com/?p=458117", "urlToImage": "https://scitechdaily.com/images/Giant-Flying-Squirrel.jpg", "publishedAt": "2025-02-27T13:55:12Z", "content": "Researchers uncovered fossils of a giant, cat-sized flying squirrel that glided over prehistoric Southern Appalachia alongside mastodons, rhinos, and other ancient creatures. This unexpected find lin… [+3510 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Professor Brian Cox Reveals the One Terrifying Mystery in the Universe That “Keeps Him Up” at Night - The Daily Galaxy --Great Discoveries Channel", "description": "Brian Cox has revealed the one terrifying thought about the universe that keeps him awake at night. It’s not black holes, supernovas, or even alien invasions. The truth is far more unsettling than anyone expected.", "url": "https://dailygalaxy.com/2025/02/professor-brian-cox-reveals-the-one-terrifying-mystery-in-the-universe-that-keeps-him-up-at-night/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Brian-Cox-bbc-interview.jpg", "publishedAt": "2025-02-27T13:25:00Z", "content": "The universe is vast, mysterious, and ever-expanding, holding countless unanswered questions. For centuries, scientists have gazed at the stars, trying to unravel its secrets. \r\nWhile weve made incre… [+2334 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX delays Flight 8 of Starship megarocket to March 3 - Space.com", "description": "Liftoff had been targeted for Friday (Feb. 28).", "url": "https://www.space.com/space-exploration/private-spaceflight/spacex-delays-flight-8-of-starship-megarocket-to-march-3", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jg2wh3tRF3yspHKPaXbH3Z-1200-80.jpg", "publishedAt": "2025-02-27T13:00:30Z", "content": "SpaceX has pushed the eighth test flight of its Starship megarocket back a few days.\r\nElon Musk's company had been targeting Friday (Feb. 28) for Flight 8 of Starship, the biggest and most powerful r… [+2227 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "\"Humanity’s ‘Biggest Lie’: The ‘Lightbulb Moment’ That Forever Changed a NASA Astronaut’s Perspective About Our World - Indian Defence Review", "description": "A former NASA astronaut’s experience in space led to a profound realization about Earth’s fragile existence. His \"lightbulb moment\" exposed a hidden truth about humanity’s priorities.", "url": "https://indiandefencereview.com/humanitys-biggest-lie-the-lightbulb-moment-that-forever-changed-a-nasa-astronauts-perspective-about-our-world/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/Ronald-Garan-a-former-NASA-astronaut.jpg", "publishedAt": "2025-02-27T12:45:00Z", "content": "Ronald Garan, a former NASA astronaut, gained a profound perspective on life during his time aboard the International Space Station. After spending 178 days in orbit, Garan was struck by a powerful r… [+2932 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Days Before Landing, \"Blue Ghost\" Just Sent Back Mind-Blowing Footage of Moon’s Hidden Side in Stunning Detail - The Daily Galaxy --Great Discoveries Channel", "description": "A spacecraft is closing in on the moon, capturing eerie, high-resolution images of its hidden side. With just days left before its landing attempt, the mission is already revealing secrets buried in lunar craters.", "url": "https://dailygalaxy.com/2025/02/days-before-landing-blue-ghost-just-sent-back-mind-blowing-footage-of-moons-hidden-side-in-stunning-detail/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Blue-Ghost-moons-footage.jpg", "publishedAt": "2025-02-27T12:25:00Z", "content": "The Blue Ghost lunar lander, operated by Firefly Aerospace, has captured stunning new footage of the moons far side, revealing an intricate landscape of impact craters and rugged terrain never before… [+3082 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Man Saves Boatloads Of ‘Stunned’ Animals After He Spotted Shadows in the Waves - Good News Network", "description": "Every winter since then, Upton has remained vigilant for potential cold-stunning events when the water temperatures start to fall too low.", "url": "https://www.goodnewsnetwork.org/man-saves-boatloads-of-stunned-animals-after-he-spotted-shadows-in-the-waves/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/credit-Sea-Tow-Corpus-Christi-via-Facebook.jpg", "publishedAt": "2025-02-27T12:00:54Z", "content": "Captain Brandon Upton rescuing turtles – credit Sea Tow Corpus Christi, via Facebook\r\nFrom Corpus Christi comes the story of a commercial mariner who developed a passion for saving livescold, imperil… [+2580 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Plants rely on quantum mechanics to transfer energy from sunlight - Earth.com", "description": "Plants use quantum mechanics to optimize photosynthesis, inspiring new artificial light-harvesting technologies.", "url": "https://www.earth.com/news/plants-rely-on-quantum-mechanics-to-transfer-energy-from-sunlight/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/26152211/photosynthesis_quantum-mechanics_plants_process_1m.jpg", "publishedAt": "2025-02-27T11:15:45Z", "content": "When sunlight streams onto a leaf, something remarkable happens. Energy from those rays flows through molecular pathways with an efficiency that has sparked curiosity for generations.\r\nThe new study … [+6069 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Largest structure ever found in the universe is 1.4 billion light years long - Earth.com", "description": "Seen as a long strand with smaller threads branching, the Quipu superstructure contains 68 galaxy clusters spanning 1.4 billion light years.", "url": "https://www.earth.com/news/largest-structure-in-universe-is-1-4-billion-light-years-long-quipu-superstructure/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/22101915/open-cluster_wide-field_superstructure_universe_Webb_1m.jpg", "publishedAt": "2025-02-27T09:25:23Z", "content": "The Universe contains many types of massive formations that shape our understanding of how stars and galaxies group together. Astronomers have long studied these sprawling patterns, which give valuab… [+5833 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik, Josh Dinner", "title": "SpaceX launches 21 Starlink satellite on new Falcon 9 rocket, aces nighttime landing - Space.com", "description": "A new SpaceX rocket launched a pristine batch of Starlink internet satellites into orbit late Wednesday (Feb. 26) in a dazzling nighttime liftoff.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-21-starlink-satellite-on-new-falcon-9-rocket-aces-nighttime-landing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Jg33edDzrYki2w5sxBbnd5-1200-80.jpg", "publishedAt": "2025-02-27T05:37:26Z", "content": "CAPE CANAVERAL, Fla. — A new SpaceX rocket launched a pristine batch of Starlink internet satellites into orbit late Wednesday (Feb. 26) in a dazzling nighttime liftoff.\r\nA Falcon 9 rocket carrying 2… [+2227 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "House hearing debates ways to improve Artemis - SpaceNews", "description": "Two former government officials offered conflicting advice to a House committee on how to change NASA’s Artemis lunar exploration campaign", "url": "http://spacenews.com/house-hearing-debates-ways-to-improve-artemis/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcLzU0MzM5NzI0MDU5XzUwMDA3Nzk0Y2Ffay0xMDI0eDY4My5qcGciLCJ0eHQiOiJIb3VzZSBoZWFyaW5nIGRlYmF0ZXMgd2F5cyB0byBpbXByb3ZlIEFydGVtaXMiLCJ0ZW1wbGF0ZSI6ImZ1bGxzY3JlZW4iLCJibG9nX2lkIjo4MDY4MTk3OX0.oVy-MGss3_g8taScUKUNWsFN5kCale3X5O58Cm4TSWkMQ", "publishedAt": "2025-02-27T04:01:40Z", "content": "HOUSTON Two former government officials offered conflicting advice to a House committee on how to change NASAs Artemis lunar exploration campaign, but agreed that a return to the moon was a prerequis… [+4935 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "40,000-Year-Old Tech? Scientists Discover Mysterious Clues of Ancient Technology in the Philippines - SciTechDaily", "description": "Ancient seafarers in the Philippines and ISEA built sophisticated boats and mastered deep-sea fishing 40,000 years ago, challenging the view that Paleolithic technology was limited to Europe and Africa. Ancient peoples of the Philippines and Island Southeast …", "url": "https://scitechdaily.com/40000-year-old-tech-scientists-discover-mysterious-clues-of-ancient-technology-in-the-philippines/", "urlToImage": "https://scitechdaily.com/images/Philippines-Boat-Rope.jpg", "publishedAt": "2025-02-27T03:53:28Z", "content": "New archaeological evidence suggests that ancient inhabitants of the Philippines and Island Southeast Asia had the advanced plant-working technology needed for sophisticated boat building and open-se… [+4077 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Researchers discover thousands of giant living eggs in an ancient underwater volcano. - farmingdale-observer.com", "description": "Researchers exploring an ancient underwater volcano off the Pacific coast of Canada have discovered that it is still active. It also appears to be home to thousands of giant eggs belonging to a little-known species of skate. An extraordinary discovery Since 2…", "url": "https://farmingdale-observer.com/2025/02/26/researchers-discover-thousands-of-giant-living-eggs-in-an-ancient-underwater-volcano/", "urlToImage": null, "publishedAt": "2025-02-27T03:36:00Z", "content": "Researchers exploring an ancient underwater volcano off the Pacific coast of Canada have discovered that it is still active. It also appears to be home to thousands of giant eggs belonging to a littl… [+3675 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "Straight out of a sci-fi movie, Elon Musk clashes with an astronaut and tells Donald Trump he wants to deorbit the International Space Station within two years. - Stewartville Star", "description": "In a bizarre turn of events that seems ripped from the pages of a science fiction novel, tech mogul Elon Musk has found himself embroiled in a heated dispute with an astronaut while simultaneously proposing to expedite the decommissioning of the International…", "url": "https://thinkstewartville.com/2025/02/26/straight-out-of-a-sci-fi-movie-elon-musk-clashes-with-an-astronaut-and-tells-donald-trump-he-wants-to-deorbit-the-international-space-station-within-two-years/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/02/thinkstewartville.com-auto-draft-98a4zfda.webp", "publishedAt": "2025-02-27T02:36:00Z", "content": "Show table of content Hide table of content \r\nIn a bizarre turn of events that seems ripped from the pages of a science fiction novel, tech mogul Elon Musk has found himself embroiled in a heated dis… [+6372 chars]"}, {"source": {"id": null, "name": "KGW.com"}, "author": "Daisy Caballero", "title": "Reed College student discovers 8 new possible exoplanets - KGW.com", "description": "Mohamed Jassim Munavar Hussain is an international student from India studying physics. It's been a longtime dream of his to find new planets in our galaxy.", "url": "https://www.kgw.com/article/tech/science/aerospace/reed-college-student-discovers-new-possible-exoplanets/283-91fa7407-bf91-48f4-a6fe-14a9de37eab2", "urlToImage": "https://media.kgw.com/assets/KGW/images/b6c400b4-73c0-491e-9bc8-e07e00cd4be8/20250227T011425/b6c400b4-73c0-491e-9bc8-e07e00cd4be8_1140x641.jpg", "publishedAt": "2025-02-27T01:22:00Z", "content": "PORTLAND, Ore. A physics student at Reed College has discovered eight new possible exoplanets in the Milky Way. His name is Mohamed Jassim Munavar Hussain, and he's an international student from Chen… [+2646 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Rapidly Evolving DNA May Explain Human Brain Complexity - Neuroscience News", "description": "A new study reveals that human accelerated regions (HARs)—segments of DNA that evolved much faster than expected—may be key to the brain’s advanced cognitive abilities.", "url": "https://neurosciencenews.com/genetics-evolution-cognition-28441/", "urlToImage": "https://neurosciencenews.com/files/2025/02/genetics-brain-evolution-neurosicence.jpg", "publishedAt": "2025-02-26T22:46:06Z", "content": "Summary: A new study reveals that human accelerated regions (HARs)segments of DNA that evolved much faster than expectedmay be key to the brains advanced cognitive abilities. Researchers compared hum… [+5374 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Organic Compounds Discovered Over 7,500 Feet Underground in Finland - SciTechDaily", "description": "Volatile organic compounds were found in Finland within a borehole extending over two kilometers deep. Volatile organic compounds (VOCs), commonly associated with poor indoor air quality and industrial pollution, have been discovered in a borehole more than t…", "url": "https://scitechdaily.com/mysterious-organic-compounds-discovered-over-7500-feet-underground-in-finland/", "urlToImage": "https://scitechdaily.com/images/The-Outokumpu-Borehole-From-Above.jpg", "publishedAt": "2025-02-26T22:16:53Z", "content": "The Outokumpu borehole from above. It is a 2,516-meter deep vertical window, 22 cm in diameter, to crystalline bedrock dating back 1.9 billion years. Credit: Riikka Kietäväinen\r\nVolatile organic comp… [+4815 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "These dwarf galaxies in the Hydra cluster are baffling scientists: 'We found something we didn't expect' - Space.com", "description": "\"By putting together the individual results, like in a puzzle, we reconstruct the formation history of these systems.\"", "url": "https://www.space.com/the-universe/these-dwarf-galaxies-in-the-hydra-cluster-are-baffling-scientists-we-found-something-we-didnt-expect", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FGFvmYKUx2KcESYWy6TrRB-1200-80.png", "publishedAt": "2025-02-26T22:00:00Z", "content": "Astronomers have discovered something surprising about the universe's smallest and faintest class of galaxies: Ultra-Diffuse Galaxies (UDGs).\r\nA research team studying these galaxies found that aroun… [+4773 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Neanderthal 'population bottleneck' around 110,000 years ago may have contributed to their extinction - Livescience.com", "description": "A study of the inner ear bones of Neanderthals shows a significant loss of diversity in their shape around 110,000 years ago, suggesting a genetic bottleneck that contributed to Neanderthals' decline.", "url": "https://www.livescience.com/archaeology/neanderthal-population-bottleneck-around-110-000-years-ago-may-have-contributed-to-their-extinction", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XwokLExLBzHdwDtizNXjFb-1200-80.png", "publishedAt": "2025-02-26T21:28:44Z", "content": "Neanderthals\r\n may have been headed toward their demise much earlier than experts previously thought, new research suggests.\r\nIn the study, published online Feb. 20 in the journal Nature Communicatio… [+3529 chars]"}, {"source": {"id": null, "name": "WKMG News 6 & ClickOrlando"}, "author": "Jonathan Kegges", "title": "The moon will turn blood red over Central Florida. Here’s when - WKMG News 6 & ClickOrlando", "description": "You’ll have to stay up late or get up early, but Central Floridians will soon have the chance to see a total lunar eclipse.", "url": "https://www.clickorlando.com/weather/2025/02/26/the-moon-will-turn-blood-red-during-total-lunar-eclipse-over-central-florida-heres-when/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/ABFSU5QYSFAKTJXEAXPPGIHNPA.JPG?_a=DATAdtfiZAA0", "publishedAt": "2025-02-26T21:06:36Z", "content": "ORLANDO, Fla. Youll have to stay up late -- or get up early -- but Central Floridians will soon have the chance to see a total lunar eclipse. \r\nAlso known as the blood moon, the sphere that reflects … [+1452 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Ancient glacier finding reveals clues to how complex life on Earth evolved, scientists say - CNN", "description": "Glaciers once inched toward the sea, gouging rocks. When the ice masses melted, they infused oceans with nutrients that may have shaped how life evolved, a study found.", "url": "https://www.cnn.com/2025/02/26/science/ancient-glaciers-complex-life-on-earth/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-175634038.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-26T20:33:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nMore than half a billion years ago on a frigid, ice-co… [+8443 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Public Library of Science", "title": "Researchers find Bluesky is similarly structured to other social media, but with some unusual features - Phys.org", "description": "A comprehensive analysis of social media platform Bluesky provides insights into its structure, polarization and political leanings, in a new study published in PLOS One by Dorian Quelle and Alexandre Bovet, from the University of Zurich, Switzerland.", "url": "https://phys.org/news/2025-02-bluesky-similarly-social-media-unusual.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/bluesky-is-similarly-s.jpg", "publishedAt": "2025-02-26T19:00:13Z", "content": "A comprehensive analysis of social media platform Bluesky provides insights into its structure, polarization and political leanings, in a new study published in PLOS One by Dorian Quelle and Alexandr… [+3283 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Watch asteroid 2024 YR4 zoom harmlessly through space after risk of hitting Earth falls to near zero (video) - Space.com", "description": "The ESO's Very Large Telescope provided crucial data needed to calculate the asteroid's orbit.", "url": "https://www.space.com/asteroid-yr-2024-very-large-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pcYjGJfGnHPbfVJqsPiA6L-1200-80.jpg", "publishedAt": "2025-02-26T19:00:10Z", "content": "The potential risk of Asteroid 2024 YR4 impacting Earth in 2032 dropped to nearly zero following new observations that helped better predict the asteroid's trajectory.\r\nMeasuring about 131 to 295 fee… [+3891 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Hubble Captures the Expanding Ghost of a 10,000-Year-Old Supernova - The Daily Galaxy --Great Discoveries Channel", "description": "A massive star exploded 10,000 years ago, leaving behind the breathtaking Veil Nebula, a glowing remnant stretching across space. Hubble’s latest image reveals stunning new details—but what secrets does this ancient supernova hold?", "url": "https://dailygalaxy.com/2025/02/hubble-captures-the-expanding-ghost-of-a-10000-year-old-supernova/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Hubble-Captures-the-Expanding-Ghost-of-a-10000-Year-Old-Supernova.jpg", "publishedAt": "2025-02-26T19:00:00Z", "content": "A new image captured by the Hubble Space Telescope offers a fresh look at the Veil Nebula, a vast supernova remnant that has been expanding for over 10,000 years. \r\nThis nebula is the remains of a ma… [+2490 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Frozen in Time: Scientists Revive a 46,000-Year-Old Worm From Siberian Permafrost - Indian Defence Review", "description": "A 46,000-year-old worm frozen in Siberian permafrost has been brought back to life, revealing new insights into survival in extreme conditions.", "url": "https://indiandefencereview.com/scientists-revive-a-46000-year-old-worm/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Frozen-in-Time-Scientists-Revive-a-46000-Year-Old-Worm-From-Siberian-Permafrost.jpg", "publishedAt": "2025-02-26T18:55:00Z", "content": "It seems unbelievable that anything could survive tens of thousands of years trapped in ice, but scientists have now confirmed that a tiny nematode worm has been successfully revived after being froz… [+3593 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "John Etnyre", "title": "What's the shape of the universe? Mathematicians use topology to study its shape and everything in it - Phys.org", "description": "When you look at your surrounding environment, it might seem like you're living on a flat plane. After all, this is why you can navigate a new city using a map: a flat piece of paper that represents all the places around you. This is likely why some people in…", "url": "https://phys.org/news/2025-02-universe-mathematicians-topology.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/universe.jpg", "publishedAt": "2025-02-26T18:23:06Z", "content": "When you look at your surrounding environment, it might seem like you're living on a flat plane. After all, this is why you can navigate a new city using a map: a flat piece of paper that represents … [+5696 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "See Mercury at its best in the night sky over the next 2 weeks - Space.com", "description": "Despite its reputation, Mercury is not really that difficult to spot. But March 2025", "url": "https://www.space.com/mercurcy-elusive-easily-visible-winter-spring-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jxVkuMRQfoGnu8BxYrfJWR-1200-80.jpg", "publishedAt": "2025-02-26T18:00:00Z", "content": "We now have a fine opportunity to view the planet that many astronomy guide books refer to as the most difficult of the naked-eye planets to see. The planet in question is Mercury.\r\nBeginning now and… [+8163 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Chinese scientists reveal plans for near-invisible stealth missiles that could 'redefine modern warfare' - Yahoo", "description": "Chinese scientists claim to have found a new way of injecting helium into rocket engines, which could be used to make missiles that are much harder to detect...", "url": "https://www.livescience.com/space/space-exploration/chinese-scientists-reveal-plans-for-near-invisible-stealth-missiles-that-could-redefine-modern-warfare", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/F2CNT9Y9.0ZNTzKqzjJp7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/2d06139e43dbfb959859c8912203953b", "publishedAt": "2025-02-26T17:55:02Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nChinese researchers have designed a new type of rocket engine that could be used to make advanc… [+5540 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Princeton University", "title": "Hofstadter's butterfly: Quantum fractal patterns visualized - Phys.org", "description": "A team of scientists from Princeton University has measured the energies of electrons in a new class of quantum materials and has found them to follow a fractal pattern. Fractals are self-repeating patterns that occur on different length scales and can be see…", "url": "https://phys.org/news/2025-02-hofstadter-butterfly-quantum-fractal-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/quantum-fractal-patter-1.jpg", "publishedAt": "2025-02-26T17:53:00Z", "content": "A team of scientists from Princeton University has measured the energies of electrons in a new class of quantum materials and has found them to follow a fractal pattern. Fractals are self-repeating p… [+7226 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Srishti Gupta", "title": "China shrinks jet antenna to 0.047 times wavelength to boost fighter’s stealth power - Interesting Engineering", "description": "With an impressive low profile of just 0.047 times the low-frequency wavelength, the prototype presents an efficient radiation pattern.", "url": "https://interestingengineering.com/military/china-shrinks-jet-antenna-stealth-power", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/Untitled-design-2.jpg", "publishedAt": "2025-02-26T17:14:00Z", "content": "The research team constructed a circular configuration composed of two closely spaced dipole antennas to achieve uniform electrical characteristics across a broad spectrum. To further increase the el… [+735 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "NASA’s Lucy Spacecraft Snaps First Look at Upcoming Asteroid Target - Gizmodo", "description": "The main belt asteroid Donaldjohanson is now in sight as the Discovery Program mission prepares for a flyby of the object in April.", "url": "https://gizmodo.com/nasas-lucy-spacecraft-snaps-first-look-at-upcoming-asteroid-target-2000568592", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/lucy-spacecraft-asteroid-mission.jpg", "publishedAt": "2025-02-26T16:55:28Z", "content": "The Lucy spacecraft just got its first good look at the main belt asteroid Donaldjohanson as the NASA mission prepares to explore the Trojan asteroids as far out as Jupiter.\r\nDonaldjohanson is not a … [+2646 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "Fossil discovery in Australia reveals 'upside down' dinosaur ecosystem with 2 giant predators - Livescience.com", "description": "A new study has revealed that \"hug of death\" megaraptorids and previously unknown carcharodontosaurs shared Australia's unique Antarctic dinosaur ecosystem during the Cretaceous.", "url": "https://www.livescience.com/animals/dinosaurs/fossil-discovery-in-australia-reveals-upside-down-dinosaur-ecosystem-with-2-giant-predators", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uFEkKLZcU86DY94gGRtMta-1200-80.jpg", "publishedAt": "2025-02-26T16:42:15Z", "content": "Researchers in Australia have discovered fossils of two enormous predators that lived alongside one another, upending ideas about how the ancient ecosystem operated down under 120 million years ago. … [+4141 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Early Humans Returned to the Rainforests Far Earlier Than Previously Thought - Gizmodo", "description": "A new study challenges the notion that anatomically modern humans began inhabiting rainforest habitats just 70,000 years ago.", "url": "https://gizmodo.com/early-humans-returned-to-the-rainforests-far-earlier-than-previously-thought-2000567820", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/original-trench.jpg", "publishedAt": "2025-02-26T16:02:07Z", "content": "Modern humans evolved around 300,000 years ago, but only began inhabiting rainforests much later. In fact, the earliest archaeological evidence of humans living in rainforest habitats is only about 7… [+3368 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": "Max G. Levy", "title": "The ‘Elegant’ Math Model That Could Help Rescue Coral Reefs - Quanta Magazine", "description": "Physicists and marine biologists built a quantitative framework that predicts how coral polyps collectively construct a variety of coral shapes.", "url": "https://www.quantamagazine.org/the-elegant-math-model-that-could-help-rescue-coral-reefs-20250226/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/02/Coral-Math_crMark-Belan_Shutterstock-Social.jpg", "publishedAt": "2025-02-26T15:54:29Z", "content": "Since before she could remember, Eva Llabrés was a snorkeler. Her grandfather, a fishmonger from the Spanish island of Menorca, bought Llabrés her first mask and fins; throughout childhood, she was i… [+2264 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "These 7 Wild Concepts Are in the Running For NASA’s Next Big Mission - Gizmodo", "description": "The document builds on the academies' decadal survey, outlining recommended missions for NASA's next New Frontiers program.", "url": "https://gizmodo.com/these-7-wild-concepts-are-in-the-running-for-nasas-next-big-mission-2000568254", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/dragonfly-landing-titan.jpg", "publishedAt": "2025-02-26T15:10:25Z", "content": "What should NASA explore next? The National Academies of Sciences, Engineering, and Medicine just published its proposed science themes for NASA’s fifth New Frontiers mission, outlining key prioritie… [+4096 chars]"}, {"source": {"id": null, "name": "Howstuffworks.com"}, "author": "Ada Tseng", "title": "There Are 300 Types of Octopus Species, Some With Internal Shells - Animals | HowStuffWorks", "description": "Octopuses are known their eight legs, squishy bodies and impressive problem-solving skills. But did you know there are over 300 types of octopus species?", "url": "https://animals.howstuffworks.com/marine-life/types-of-octopus.htm", "urlToImage": "https://media.hswstatic.com/eyJidWNrZXQiOiJjb250ZW50Lmhzd3N0YXRpYy5jb20iLCJrZXkiOiJnaWZcL2dldHR5aW1hZ2VzLTUwNzgwNTQ3Ni5qcGciLCJlZGl0cyI6eyJyZXNpemUiOnsid2lkdGgiOiIxMjAwIn19fQ==", "publishedAt": "2025-02-26T15:10:02Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists discover a protein that reverses cellular aging - Earth.com", "description": "Researchers discovered AP2A1, a protein controlling cellular aging. Lower AP2A1 reversed aging effects, while higher levels sped aging.", "url": "https://www.earth.com/news/scientists-discover-a-protein-that-reverses-cellular-aging/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/26075017/proteins_ap2a1_controls-cellular-aging_1m.jpg", "publishedAt": "2025-02-26T15:00:00Z", "content": "Throughout history, humanity has chased the elusive promise of eternal youth. From mythical fountains to today’s anti-aging creams, the pursuit of staying forever young remains constant. But beneath … [+5309 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Strange connection between deep space cosmic rays and Earth virus evolution - Earth.com", "description": "A supernova explosion about 2.5 million years ago sent cosmic rays to Earth. Around that time, virus diversity in Lake Tanganyika increased.", "url": "https://www.earth.com/news/did-cosmic-rays-shape-the-evolution-of-ancient-viruses/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/26072411/Cosmic-rays.jpg", "publishedAt": "2025-02-26T14:36:03Z", "content": "More than two million years ago, something unusual happened to the viruses that infect fish in Lake Tanganyika, East Africa. The different types of viruses diversified rapidly indicating heightened m… [+5669 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Rush", "title": "Keep NASA’s innovation engine going - SpaceNews", "description": "In every vibrant technology company, the efforts of talented engineers and technicians are divided between two equally important areas: research and development (R&D) and operations. Both areas…", "url": "http://spacenews.com/keep-nasas-innovation-engine-going/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvaTAud3AuY29tXC9zcGFjZW5ld3MuY29tXC93cC1jb250ZW50XC91cGxvYWRzXC8yMDI1XC8wMlwvbW9vbi1taXNzaW9uLndlYnA_Zml0PTkwNyUyQzUxMCZxdWFsaXR5PTgwJnNzbD0xIiwidHh0IjoiS2VlcCBOQVNBXHUyMDE5cyBpbm5vdmF0aW9uIGVuZ2luZSBnb2luZyIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.wEnKZ-34Y7vv9eOsrh6cbAolT-im-E2Vy4haPHjQJYcMQ", "publishedAt": "2025-02-26T14:30:00Z", "content": "In every vibrant technology company, the efforts of talented engineers and technicians are divided between two equally important areas: research and development (R&amp;D) and operations. Both areas r… [+6434 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Have Discovered a New Hidden Galaxy Near Andromeda—And It’s Unlike Anything Seen Before - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a new hidden dwarf galaxy near Andromeda, revealing a faint, ancient relic that could reshape our understanding of galaxy formation.", "url": "https://dailygalaxy.com/2025/02/astronomers-discover-new-galaxy-andromeda/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Astronomers-Have-Discovered-a-New-Hidden-Galaxy-Near-Andromeda—And-Its-Unlike-Anything-Seen-Before.jpg", "publishedAt": "2025-02-26T14:30:00Z", "content": "A previously unknown dwarf galaxy has been discovered on the outskirts of the Andromeda Galaxy, adding to the growing list of mysterious satellite galaxies lurking in our cosmic neighborhood. Named P… [+3469 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Tokyo", "title": "Discovery suggests there could be huge amounts of helium in Earth's core - Phys.org", "description": "Researchers from Japan and Taiwan reveal for the first time that helium, usually considered chemically inert, can bond with iron under high pressures. They used a laser-heated diamond anvil cell to find this, and the discovery suggests there could be huge amo…", "url": "https://phys.org/news/2025-02-discovery-huge-amounts-helium-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/helium-in-the-earths-c.jpg", "publishedAt": "2025-02-26T14:24:28Z", "content": "Researchers from Japan and Taiwan reveal for the first time that helium, usually considered chemically inert, can bond with iron under high pressures. They used a laser-heated diamond anvil cell to f… [+3860 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Astrophotographer captures 'rare' planetary parade as 7 planets align in the night sky (photo) - Space.com", "description": "Seven worlds align under one sky in a breathtaking photograph captured by astrophotographer Josh Dury.", "url": "https://www.space.com/astrophotographer-captures-rare-planetary-alignment-seven-planets-february-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v28U7kaa2Sb33QDHzrndMn-1200-80.jpg", "publishedAt": "2025-02-26T14:00:00Z", "content": "Seven planets align across the sky above the Mendip Hills, U.K. An annotated version of the image can be found further down in the article. (Image credit: Josh Dury)\r\nAstrophotographer Josh Dury capt… [+3577 chars]"}, {"source": {"id": null, "name": "The Seattle Times"}, "author": "Dahlia Bazzaz", "title": "Best nights this year to look skyward in WA — and one is soon - The Seattle Times", "description": "To map out the best nights for skywatching, we turned to three seasoned stargazers to tell us about the best nights of the year to look upward in Washington.", "url": "https://www.seattletimes.com/life/outdoors/lunar-eclipse-meteor-showers-and-more-seattle-area-guide-to-stargazing/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2025/02/02242025_TZR_Lunar_Eclipse-2022-AP_tzr_141721.jpg?d=1200x630", "publishedAt": "2025-02-26T14:00:00Z", "content": "The universe has a dazzling itinerary lined up for Seattle this year. \r\nIn just a couple of weeks, we’ll have prime-time viewing hours for the first total lunar eclipse anywhere in the world since 20… [+6687 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "'Utterly cataclysmic': James Webb telescope spots 2 alien planets disintegrating before our eyes - Livescience.com", "description": "In world-first observations, the James Webb Space Telescope is watching two distant alien planets \"spilling their guts into space\" as they rapidly disintegrate — and scientists are elated at what they've found.", "url": "https://www.livescience.com/space/exoplanets/utterly-cataclysmic-james-webb-telescope-spots-2-alien-planets-disintegrating-before-our-eyes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RGRtpEtLcSLfyfWWdsSSYB-1200-80.jpg", "publishedAt": "2025-02-26T13:00:00Z", "content": "Astronomers have directly observed two worlds beyond our solar system\r\n shedding their outer layers into space for the first time. The new observations offer an unprecedented glimpse into the interio… [+3786 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "David Hone", "title": "How palaeontologists are uncovering dinosaur behaviour - The Conversation", "description": "If we struggle to work out what the whole animal looked like most of the time, how can we begin to piece together their lives and how they behaved?", "url": "https://theconversation.com/how-palaeontologists-are-uncovering-dinosaur-behaviour-246702", "urlToImage": "https://images.theconversation.com/files/648840/original/file-20250213-15-ej4yt6.jpg?ixlib=rb-4.1.0&rect=31%2C99%2C3508%2C1754&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-02-26T12:53:13Z", "content": "How do scientists study the behaviour of dinosaurs, who died 65 million years ago? After all, dinosaur fossils are rare enough as it is, and most are fragments and difficult to work with. \r\nThis is s… [+5013 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Lived for 400 Years in Greenland’s Icy Waters, This 6-Meter Shark Could Hold the Secret to Defying Aging - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath Greenland’s icy waters, a massive 6-meter shark has been silently roaming for centuries. Scientists recently uncovered surprising clues in its DNA that could reshape what we know about aging.", "url": "https://dailygalaxy.com/2025/02/lived-for-400-years-in-greenlands-icy-waters-this-6-meter-shark-could-hold-the-secret-to-defying-aging/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Greenland-Shark.jpg", "publishedAt": "2025-02-26T12:45:00Z", "content": "Deep beneath the icy waters of the North Atlantic and Arctic, a mysterious predator glides silently through the darkness. The Greenland shark, one of the longest-living vertebrates on Earth, has baff… [+3374 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Trending Desk", "title": "Newly discovered exoplanet turns time upside down– 1 year equals 30 days - The Times of India", "description": "For the first time, scientists have discovered an exoplanet that defies the usual pace of time. WASP-121b, located 900 light-years away, has a year t", "url": "https://timesofindia.indiatimes.com/etimes/trending/newly-discovered-exoplanet-turns-time-upside-down-1-year-equals-30-days/articleshow/118580682.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-118580722,width-1070,height-580,imgsize-92626,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-02-26T12:24:00Z", "content": "8 unique animals that were discovered in recent years"}, {"source": {"id": null, "name": "Supercarblondie.com"}, "author": "https://facebook.com/alessandro.renesis", "title": "Secret US spaceplane Boeing X-37B returns to Earth after 908 days and finally shares first declassified photo - Supercar Blondie", "description": "After 908 days in orbit, the US Space Force has finally shared the first declassified photograph taken from the mysterious Boeing X-37B spacecraft", "url": "https://supercarblondie.com/us-space-force-boeing-x-37b/", "urlToImage": "https://supercarblondie.com/wp-content/uploads/USAF-1.webp", "publishedAt": "2025-02-26T11:56:00Z", "content": "The US Space Force (USSF) has just shared its first declassified photo taken from the Boeing X-37B.\r\nThe X-37B is a military spacecraft designed for longer missions in space, also due to its incredib… [+2081 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Robot watches itself like humans do in a mirror to master movements, self-repair - Interesting Engineering", "description": "An autonomous robotic arm has been created that learns its physical form and movement through self-observation via camera.", "url": "https://interestingengineering.com/innovation/robot-watches-in-mirror-like-humans", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/IE_82e637.jpg", "publishedAt": "2025-02-26T09:18:00Z", "content": "Researchers at Columbia Engineering say this new technique allows the robot to adapt to damage, and learn new skills.\r\n“Like humans learning to dance by watching their mirror reflection, robots now u… [+629 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Biofluorescence in Birds-of-Paradise, Revealing a Hidden Layer of Mating Displays - SciTechDaily", "description": "Birds-of-paradise have long fascinated scientists with their dazzling courtship displays, but new research reveals they have an even more striking secret—they glow under ultraviolet light! Scientists have discovered widespread biofluorescence in these birds, …", "url": "https://scitechdaily.com/scientists-discover-biofluorescence-in-birds-of-paradise-revealing-a-hidden-layer-of-mating-displays/", "urlToImage": "https://scitechdaily.com/images/Emperor-Bird-of-Paradise-Biofluorescence.jpg", "publishedAt": "2025-02-26T03:33:38Z", "content": "Scientists have uncovered a hidden layer of visual communication in birds-of-paradise—biofluorescence. Nearly all species in this group glow under UV light, with males displaying vibrant flashes to a… [+4804 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Scientists say they’ve discovered why Mars is red - CNN", "description": "A study suggests Mars takes its red hue from a type of mineral that forms in cool water, which could reveal insights about whether Mars was ever able to support life.", "url": "https://www.cnn.com/2025/02/25/science/why-mars-is-red/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/near-ir-green-and-near-uv-colour-view-of-mars.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-26T02:57:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith its iconic rusty hue, Mars has long been called t… [+9088 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "US’ new method extracts 14 liters drinking water from thin air daily using food scraps - Interesting Engineering", "description": "UT Austin researchers create hydrogels from biomass like food waste, pulling clean drinking water from air, even in dry climates.", "url": "https://interestingengineering.com/innovation/us-drinking-water-from-air", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/water.jpg", "publishedAt": "2025-02-25T21:53:00Z", "content": "This temperature threshold is significant, as it can be achieved through sustainable means such as solar energy or waste heat from industrial processes.\r\nThis makes the new system distinct from tradi… [+874 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "One of the most massive black holes in the universe lurks at the center of the Cosmic Horseshoe - Phys.org", "description": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about 5.5 billion light-years away. The foreground galaxy's mass magnifies and distorts the image of a distant background galaxy whose light has traveled for bil…", "url": "https://phys.org/news/2025-02-massive-black-holes-universe-lurks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/one-of-the-most-massiv.jpg", "publishedAt": "2025-02-25T21:38:04Z", "content": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about 5.5 billion light-years away. The foreground galaxy's mass magnifies and distorts the image of … [+7952 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "This Is Getting To Be Frustrating - NASA Watch", "description": "My bullshit meter has pegged again.", "url": "https://nasawatch.com/personnel-news/this-is-getting-to-be-frustrating/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/02/bullshit-meter.png", "publishedAt": "2025-02-25T21:29:58Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Sci.news"}, "author": "Natali Anderson", "title": "Our Solar System Crossed ‘Radcliffe Wave’ during Miocene Epoch, Astronomers Say - Sci.News", "description": "As our Solar System orbits the Milky Way, it encounters various environments, including dense regions of the interstellar medium.", "url": "https://www.sci.news/astronomy/solar-system-radcliffe-wave-passage-miocene-epoch-13698.html", "urlToImage": "https://cdn.sci.news/images/2020/01/image_7995f-Radcliffe-Wave.jpg", "publishedAt": "2025-02-25T20:49:36Z", "content": "As our Solar System orbits the Milky Way, it encounters various environments, including dense regions of the interstellar medium. These encounters can expose parts of the Solar System to the interste… [+4956 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Scientists Just Found a Faster, Cheaper Way to Store Carbon Permanently - SciTechDaily", "description": "A team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals. By enhancing the natural weathering process, their technique creates reactive materials that absorb carbon at unprecedented rates. This scalable appr…", "url": "https://scitechdaily.com/stanford-scientists-just-found-a-faster-cheaper-way-to-store-carbon-permanently/", "urlToImage": "https://scitechdaily.com/images/Olivine-Aerolie-Weathering-Naturally.jpg", "publishedAt": "2025-02-25T20:12:01Z", "content": "Olivine aérolie weathering naturally. Credit: Renhour48 via Wikimedia\r\nA team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals.\r\nBy enhancing the … [+7943 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "SpaceX says its Falcon 9 rocket debris crash over Europe was caused by propellant leak - Space.com", "description": "\"A small liquid oxygen leak developed, which ultimately drove higher-than-expected vehicle body rates.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/fiery-falcon-9-rocket-debris-crash-over-europe-caused-by-propellant-leak-spacex-says", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E4Ad8EwVNgrMoigSdJvfzm-1200-80.jpg", "publishedAt": "2025-02-25T20:00:00Z", "content": "A propellant leak was to blame for the upper stage of a Falcon 9 rocket crashing to Earth over Europe last week, SpaceX says.\r\nThe Falcon 9 launched on Feb. 1 from California\r\n, carrying 22 Starlink\r… [+2684 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Geologists Have Long Searched for Gold Hydrogen. A New Study Finally Shows Where It’s Hiding. - Yahoo", "description": "Now we just have to find it.", "url": "https://www.popularmechanics.com/science/environment/a63905035/hydrogen-mountains/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kk8k_HfM7qTRVe_Qf277ug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/popular_mechanics_642/e969cd1a49dac19e68c21b028ab2d8fb", "publishedAt": "2025-02-25T19:00:00Z", "content": "<ul><li>While hydrogen is on the verge of being a world-changing fuel source, its creation still relies largely on natural gas, making the fuel less-than-ideal in a world increasingly focused on deca… [+4303 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Russ Nelson", "title": "Breakthrough enables measurement of local dark matter density using direct acceleration measurements - Phys.org", "description": "Dr. Sukanya Chakrabarti, the Pei-Ling Chan Endowed Chair in the College of Science at The University of Alabama in Huntsville (UAH), and her team have pioneered the use of gravitational acceleration measurements of binary pulsars to help illuminate just how m…", "url": "https://phys.org/news/2025-02-breakthrough-enables-local-dark-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/uah-breakthrough-enabl.jpg", "publishedAt": "2025-02-25T18:26:45Z", "content": "Dr. Sukanya Chakrabarti, the Pei-Ling Chan Endowed Chair in the College of Science at The University of Alabama in Huntsville (UAH), and her team have pioneered the use of gravitational acceleration … [+6307 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Something Shook Titan’s Orbit, and Scientists Are Racing to Solve the Mystery - SciTechDaily", "description": "Scientists are investigating Saturn’s moon Titan to understand how tidal forces affect its orbit, revealing clues about its internal structure and past changes. This research indicates Titan’s orbit is evolving rapidly on a geologic timescale, implying an eve…", "url": "https://scitechdaily.com/something-shook-titans-orbit-and-scientists-are-racing-to-solve-the-mystery/", "urlToImage": "https://scitechdaily.com/images/Titan-Moon-Orbits-Saturn.jpg", "publishedAt": "2025-02-25T18:08:47Z", "content": "SwRI studied Saturn’s moon Titan to assess its tidal dissipation rate, the energy lost as it orbits the ringed planet with its massive gravitational force. Understanding tidal dissipation helps scien… [+4329 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jorge Garay", "title": "Something Unexpected Is Spewing Stars Into the Milky Way - WIRED", "description": "Fast-moving stars in the Milky Way indicate there could be a supermassive black hole in the neighboring Large Magellanic Cloud—something that has never been detected in a smaller galaxy.", "url": "https://www.wired.com/story/large-magellanic-cloud-supermassive-black-hole/", "urlToImage": "https://media.wired.com/photos/67b6196d3a2dde1bc2bc31fa/191:100/w_1280,c_limit/galaxia%20gran%20nube%20de%20magallanes.jpg", "publishedAt": "2025-02-25T18:05:01Z", "content": "New research from a team at the Harvard Center for Astrophysics suggests that the Large Magellanic Cloud, a dwarf galaxy neighboring the Milky Way, hosts a gravitational structure hundreds of thousan… [+3163 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of North Carolina at Chapel Hill", "title": "Bubbles that break rules: A fluid discovery that defies logic - Phys.org", "description": "A team led by researchers at UNC-Chapel Hill have made an extraordinary discovery that is reshaping our understanding of bubbles and their movement. Picture tiny air bubbles inside a container filled with liquid. When the container is shaken up and down, thes…", "url": "https://phys.org/news/2025-02-fluid-discovery-defies-logic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/bubbles-that-break-the.jpg", "publishedAt": "2025-02-25T17:11:01Z", "content": "A team led by researchers at UNC-Chapel Hill have made an extraordinary discovery that is reshaping our understanding of bubbles and their movement. Picture tiny air bubbles inside a container filled… [+6442 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Nasas Europa Clipper Uses Mars To Go The Distance - NASA Jet Propulsion Laboratory", "description": "The orbiter bound for Jupiter’s moon Europa will investigate whether the moon is habitable, but it first will get the help of Mars’ gravitational force to get to deep space.", "url": "https://www.jpl.nasa.gov/news/nasas-europa-clipper-uses-mars-to-go-the-distance/", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1-Clipper_MGA.png", "publishedAt": "2025-02-25T16:48:35Z", "content": "Mission controllers have performed three TCMs to set the stage for the Mars gravity assist in early November, late January, and on Feb. 14. They will conduct another TCM about 15 days after the Mars … [+2155 chars]"}]}