{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Massive Gravity Hole Discovered in the Indian Ocean—And What’s Beneath Could Redefine Earth’s Evolution - Indian Defence Review", "description": "A massive gravity anomaly beneath the Indian Ocean, known as the Indian Ocean Geoid Low, has baffled scientists for years.", "url": "https://indiandefencereview.com/gravity-hole-discovered-indian-ocean/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/massive-gravity-hole-discovered-in-the-indian-oceanand-whats-beneath-could-redefine-earths-evolution.jpg", "publishedAt": "2025-05-08T18:15:00Z", "content": "Beneath the vast expanse of the Indian Ocean lies a strange and puzzling phenomenona massive gravitational anomaly that has stumped scientists for decades. This anomaly, known as the Indian Ocean Geo… [+5321 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Denise Chow", "title": "An underwater volcano off the coast of Oregon may be about to erupt - NBC News", "description": "A recent study found increased seismicity and swelling at Axial Seamount, suggesting an eruption could occur sometime this year.", "url": "https://www.nbcnews.com/science/science-news/underwater-volcano-coast-oregon-may-erupt-rcna205369", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250507-axial-seamount-se-1110a-12a0b3.jpg", "publishedAt": "2025-05-08T18:12:30Z", "content": "About 300 miles off the coast of Oregon, an underwater volcano appears to be rumbling to life.\r\nScientists who have been monitoring the vast submarine volcano for decades say a flurry of recent activ… [+4543 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Gravity could be the definitive clue that the universe is one giant computer - Earth.com", "description": "Physicist Melvin Vopson proposes gravity might emerge from cosmic information processing, hinting the universe runs on a computational code.", "url": "https://www.earth.com/news/gravity-could-be-the-definitive-clue-that-the-universe-is-a-computer-storing-information/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07042804/gravity-definitive-clue-universe-computer.jpg", "publishedAt": "2025-05-08T17:59:46Z", "content": "Modern ideas about reality sometimes sound like a wild story. The notion that everything around us might be bits and bytes is easy to brush aside, yet it continues to intrigue many curious minds.\r\nTh… [+5136 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Rare 100-Million-Year-Old Amber Fossil Reveals Ferocious Spider Attack - Indian Defence Review", "description": "A 100-million-year-old amber fossil captures an extraordinary moment, showing a spider attacking a wasp.", "url": "https://indiandefencereview.com/100-million-year-old-amber-fossil-spider/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/rare-100-million-year-old-amber-fossil-reveals-ferocious-spider-attack.jpg", "publishedAt": "2025-05-08T16:05:00Z", "content": "A new paleontological discovery, as reported in theHistorical Biology journal, has shed light on a fascinating scene from the Cretaceous perioda spiders predatory attack on a wasp, preserved in amber… [+5327 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers May Have Just Discovered the Smallest Galaxy Ever - The Daily Galaxy", "description": "Could this tiny object in the Ursa Major constellation be the smallest galaxy ever discovered, or is it just an ancient star cluster hiding a dark-matter mystery?", "url": "https://dailygalaxy.com/2025/05/astronomers-discovered-smallest-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Astronomers-May-Have-Just-Discovered-the-Smallest-Galaxy-Ever.jpg", "publishedAt": "2025-05-08T15:36:00Z", "content": "Astronomers have made a fascinating discovery in the Ursa Major constellation that could potentially challenge our understanding of galaxies and star clusters. The object in question, UMa3/U1, has sp… [+4814 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "A stadium-sized asteroid will fly past Earth on May 9, and you can watch it live (video) - Space", "description": "The 950-foot hunk of primordial matter is classified as a \"potentially hazardous asteroid,\" but that doesn't mean it has a chance of hitting Earth.", "url": "https://www.space.com/stargazing/a-stadium-sized-asteroid-will-fly-past-earth-on-may-9-and-you-can-watch-it-live-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Mqj4SSBhzHx6ZQJtLMMs9.jpg", "publishedAt": "2025-05-08T15:00:00Z", "content": "On May 9, a stadium-sized potentially hazardous asteroid will pass by Earth, and you can watch the flyby happen in real time courtesy of a livestream from The Virtual Telescope Project.\r\nThe main bel… [+3415 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Earth’s Poles Are Moving Faster Than Ever—And Scientists Say This Could Trigger Global Crisis - The Daily Galaxy", "description": "A new study reveals that Earth's North and South Poles are shifting faster than ever before.", "url": "https://dailygalaxy.com/2025/05/earths-poles-are-moving-faster-than-ever/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Earths-Poles-Are-Moving-Faster-Than-Ever—And-Scientists-Say-This-Could-Trigger-Global-Crisis.jpg", "publishedAt": "2025-05-08T13:30:00Z", "content": "A groundbreaking study published inGeophysical Research Letters has revealed that Earth’s North and South Poles are shifting faster than ever before, with projections showing a potential shift of mor… [+4061 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Earth Gets Its First Deep-Space Laser Message—From 16 Million Kilometers Away! - Indian Defence Review", "description": "NASA has just pulled off a groundbreaking achievement that feels straight out of science fiction. A laser message from space has traveled a staggering 16 million kilometers, setting the stage for a new era in space communication.", "url": "https://indiandefencereview.com/earth-gets-its-first-deep-space-laser-message-from-16-million-kilometers-away/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/deep-space-laser.jpg", "publishedAt": "2025-05-08T13:10:00Z", "content": "In a groundbreaking development that feels straight out of science fiction, NASA has made a giant leap in space communication by successfully transmitting a laser message from the Psyche spacecraft t… [+2605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Elon Musk's big warning: 'All life on Earth will be destroyed eventually...' - The Economic Times", "description": "Elon Musk, head of DOGE, has warned of Earth's eventual destruction in a new interview, advocating for Mars colonization as humanity's long-term survival strategy. He emphasized the need for a self-sustaining Martian civilization, viewing it as 'life insuranc…", "url": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musks-big-warning-all-life-on-earth-will-be-destroyed-eventually-/articleshow/120999694.cms", "urlToImage": "https://img.etimg.com/thumb/msid-120999781,width-1200,height-630,imgsize-17956,overlay-economictimes/articleshow.jpg", "publishedAt": "2025-05-08T13:02:28Z", "content": "Tech mogul and billionaire Elon Musk, who also heads Donald Trump's Department of Government Efficiency (DOGE), has outlined reasons why he wants to get humanity to Mars so badly. He has issued a sta… [+3416 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "T. rex’s ancestors may have walked from Asia to North America - Earth.com", "description": "Researchers trace T. rex origins to Asia and megaraptors to Gondwana. Climate changes and predator extinction fueled their rise as predators.", "url": "https://www.earth.com/news/t-rexs-ancestors-may-have-walked-from-asia-to-north-america/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/08061535/T.-Rex-Asia.jpg", "publishedAt": "2025-05-08T12:18:44Z", "content": "A new study led by UCL researchers has traced the roots of Tyrannosaurus rex back to Asia. Before ruling North America as a colossal predator, T. rex likely crossed a land bridge from Asia more than … [+4834 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA backtracks on VIPER commercial partnership - SpaceNews", "description": "NASA has canceled plans to find a commercial partner to launch a robotic lunar rover and will instead pursue “alternative approaches” to fly the mission.", "url": "http://spacenews.com/nasa-backtracks-on-viper-commercial-partnership/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyMlwvMDdcL3ZpcGVyX2Nkcl9oZXJvXzA4X2xyZy1zY2FsZWQtMS0xMDI0eDU3Ni5qcGciLCJ0eHQiOiJOQVNBIGJhY2t0cmFja3Mgb24gVklQRVIgY29tbWVyY2lhbCBwYXJ0bmVyc2hpcCIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.sq-i_olX2gy4Le4LAXrR_9VCx3-VGm1wnzPGuC3e4GEMQ", "publishedAt": "2025-05-08T11:47:06Z", "content": "WASHINGTON NASA has canceled plans to find a commercial partner to launch a robotic lunar rover and will instead pursue alternative approaches to fly the mission.\r\nIn a May 7 statement, NASA said it … [+4843 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "People Can’t Stop Freaking Out Over This Asteroid Photo from Space—And It’s Hard to Look Away - Indian Defence Review", "description": "The Hayabusa2 mission captured the asteroid with eerie clarity against a pitch-black backdrop. The unsettling darkness of space brings new perspective on the unknown.", "url": "https://indiandefencereview.com/people-cant-stop-freaking-out-over-this-asteroid-photo-from-space-and-its-hard-to-look-away/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/a-recent-photograph-of-the-asteroid-ryugu.jpg", "publishedAt": "2025-05-08T11:30:00Z", "content": "A recent photograph of the asteroid Ryugu, taken by the Japanese space probe Hayabusa2, has resurfaced online and is gaining renewed attention. This image is being described by some as the clearest e… [+3104 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "iain.todd@ourmedia.co.uk", "title": "A 1970s Soviet spacecraft built to withstand Venus's thick atmosphere could crash to Earth this weekend - BBC Sky at Night Magazine", "description": "Kosmos 482 is an old Soviet spacecraft that was originally destined for Venus, and which could fall to Earth on 10 May 2025.", "url": "https://www.skyatnightmagazine.com/news/kosmos-482", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2025/05/kosmo-482.jpg?w=1200", "publishedAt": "2025-05-08T11:03:09Z", "content": "An old Soviet spacecraft that was originally destined for Venus could fall to Earth this weekend, according to NASA.\r\nThe probe, named Kosmos 482, was launched on 31 March 1972 and was intended to en… [+5232 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "How do archaeologists figure out the sex of a skeleton? - Live Science", "description": "Archaeologists can estimate a person's sex with 95% accuracy, but many experts are focused on what can be learned about humans outside the male/female gender binary.", "url": "https://www.livescience.com/archaeology/how-do-archaeologists-figure-out-the-sex-of-a-skeleton", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pb7zDuQJKhsRmpvkdCNA9i.jpg", "publishedAt": "2025-05-08T10:00:00Z", "content": "When archaeologists find ancient human remains, they often try to determine if the person was male or female based on their bones.\r\nSo how do archaeologists figure out the sex of the individual from … [+6908 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Snaps Stunning First Photos of Atoms Interacting in Open Space - SciTechDaily", "description": "MIT scientists have snapped the first-ever images of individual atoms interacting freely in space, making visible the elusive quantum effects that govern their behavior. Using a unique technique that briefly traps atoms in place with a lattice of light, the r…", "url": "https://scitechdaily.com/mit-snaps-stunning-first-photos-of-atoms-interacting-in-open-space/", "urlToImage": "https://scitechdaily.com/images/Imaging-Free-Range-Atoms.jpg", "publishedAt": "2025-05-08T09:29:53Z", "content": "Using single-atom-resolved microscopy, ultracold quantum gases composed of two types of atoms reveal distinctly different spatial correlations — the bosons on the left exhibit bunching, while the fer… [+8750 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Proba-3 achieves precise formation flying - European Space Agency", "description": "For the first time, two spacecraft in orbit were aligned in formation with millimetre precision and maintained their relative position for several hours without any control from the ground.", "url": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Proba-3_achieves_precise_formation_flying", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/11/proba-3_occulter_eclipsing_sun_for_coronagraph_spacecraft/26474797-1-eng-GB/Proba-3_Occulter_eclipsing_Sun_for_Coronagraph_spacecraft_pillars.jpg", "publishedAt": "2025-05-08T08:12:18Z", "content": "Enabling &amp; Support08/05/20251255 views17 likes\r\nFor the first time, two spacecraft in orbit were aligned in formation with millimetre precision and maintained their relative position for several … [+4811 chars]"}, {"source": {"id": null, "name": "Home.cern"}, "author": null, "title": "ALICE detects the conversion of lead into gold at the LHC - Home | CERN", "description": "In a paper published in Physical Review Journals, the ALICE collaboration reports measurements that quantify the transmutation of lead into gold in CERN’s Large Hadron Collider (LHC). Transforming the base metal lead into the precious metal gold was a dream o…", "url": "https://home.cern/news/news/physics/alice-detects-conversion-lead-gold-lhc", "urlToImage": "https://cds.cern.ch/images//file?size=medium", "publishedAt": "2025-05-08T07:00:00Z", "content": "Near-miss collisions between high-energy lead nuclei at the LHC generate intense electromagnetic fields that can knock out protons and transform lead into fleeting quantities of gold nuclei\r\n In a pa… [+5118 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Sarah Johnson", "title": "Study Suggests Mars Colonization May Be Impossible! - Glass Almanac", "description": "Through his company SpaceX, Elon Musk harbors an exceedingly ambitious dream: to herald the arrival of humans on Mars. According to Musk, this is a crucial ... Continue Reading →", "url": "https://glassalmanac.com/study-suggests-mars-colonization-may-be-impossible/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/05/Study-Suggests-Mars-Colonization-May-Be-Impossible.jpg", "publishedAt": "2025-05-08T06:13:35Z", "content": "Through his company SpaceX, Elon Musk harbors an exceedingly ambitious dream: to herald the arrival of humans on Mars. According to Musk, this is a crucial step for space colonization. However, a rec… [+2562 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Adam Zewe | MIT News", "title": "System lets robots identify an object’s properties through handling - MIT News", "description": "Robots developed at MIT can now learn about an object’s weight, softness, or contents by picking it up and gently shaking it. A robot can accurately guess parameters like an object’s mass in a matter of seconds, without the need for cameras or other external …", "url": "https://news.mit.edu/2025/system-lets-robots-identify-objects-properties-through-handling-0508", "urlToImage": "https://news.mit.edu/sites/default/files/images/202505/MIT-Differentiable-Interaction-01.jpg", "publishedAt": "2025-05-08T04:00:00Z", "content": "A human clearing junk out of an attic can often guess the contents of a box simply by picking it up and giving it a shake, without the need to see whats inside. Researchers from MIT, Amazon Robotics,… [+6209 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Discover New Bacteria That Conduct Electricity Like a Wire - ScienceAlert", "description": "A newly discovered bacterium wiggling about in the mudflats of the Oregon coast could advance a new era of bioelectric devices.", "url": "https://www.sciencealert.com/scientists-discover-new-bacteria-that-conduct-electricity-like-a-wire", "urlToImage": "https://www.sciencealert.com/images/2025/05/cable-bacteria.jpg", "publishedAt": "2025-05-08T02:34:50Z", "content": "A newly discovered bacterium wiggling about in the mudflats of the Oregon coast could advance a new era of bioelectric devices.\r\nIt's been named Ca. Electrothrix yaqonensis, in honor of the First Nat… [+3344 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "John Elliot V", "title": "Superconductivity News: What Makes Floquet Majorana Fermions Special For Quantum Computing? - Hackaday", "description": "Researchers from the USA and India have proposed that Floquet Majorana fermions may improve quantum computing by controlling superconducting currents, potentially reducing errors and increasing sta…", "url": "https://hackaday.com/2025/05/07/superconductivity-news-what-makes-floquet-majorana-fermions-special-for-quantum-computing/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/05/ettore-majorana-featured.jpg", "publishedAt": "2025-05-08T02:00:00Z", "content": "Researchers from the USA and India have proposed that Floquet Majorana fermions may improve quantum computing by controlling superconducting currents, potentially reducing errors and increasing stabi… [+2068 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Cracks 30-Year X-ray Mystery With Blazing Black Hole Light Show - SciTechDaily", "description": "Astronomers using NASA’s IXPE satellite have finally cracked a cosmic mystery—how X-rays are produced in the energetic jets of supermassive black holes like the blazar BL Lacertae. The blazar BL Lacertae—a type of active galaxy powered by a supermassive black…", "url": "https://scitechdaily.com/?p=474049", "urlToImage": "https://scitechdaily.com/images/Blazar-BL-Lacertae-Concept-scaled.jpg", "publishedAt": "2025-05-08T01:54:52Z", "content": "This artist’s concept depicts the central region of the blazar BL Lacertae, a supermassive black hole surrounded by a bright disk and a jet oriented toward Earth. The galaxy’s central black hole is s… [+9831 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "A Big NASA Moon To Mars Pivot – Next Year? - NASA Watch", "description": "According to \"NASA, in surprise shift, may launch rockets to Mars next year\" in Politico:", "url": "https://nasawatch.com/artemis/a-big-nasa-moon-to-mars-pivot-next-year/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/05/MoonMars.png", "publishedAt": "2025-05-08T00:47:24Z", "content": "Time to change course. Again. \r\nKeith’s note: According to “NASA, in surprise shift, may launch rockets to Mars next year” in Politico: We are evaluating every opportunity, including launch windows i… [+582 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Uh Oh, There's a Problem With Psyche's Propulsion System - Universe Today", "description": "NASA’s Psyche mission is on its way to explore a metal-rich asteroid in the asteroid belt between Mars and Jupiter. All was going well since its launch in October 2023 until nasa announced a decrease in fuel pressure for the propulsion system. It uses a solar…", "url": "https://www.universetoday.com/articles/uh-oh-theres-a-problem-with-psyches-propulsion-system", "urlToImage": "https://www.universetoday.com/assets/psyche_spacecraft.jpeg", "publishedAt": "2025-05-07T22:36:09Z", "content": "Asteroid Psyche (formally designated 16 Psyche) is one of the most intriguing objects in our Solar System's asteroid belt. Unlike most asteroids composed primarily of rock or ice, Psyche is believed … [+2963 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "This Bold New Theory Could Finally Unite Gravity and Quantum Physics - ZME Science", "description": "A bold new theory could bridge quantum physics and gravity at last.", "url": "https://www.zmescience.com/science/physics/finland-unifying-gravity-quantum-mechanics/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/05/assets_task_01jtp1pcaxfv1t0ccvwd85bx1k_1746644266_img_0.webp", "publishedAt": "2025-05-07T22:13:07Z", "content": "Credit: ZME Science/SORA.\r\nAt Aalto University in Finland, two physicists believe they may have cracked a puzzle that has defied generations of scientists: how to reconcile the physics of the very bi… [+5761 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Learning Reshapes Your Brain’s Connections - Neuroscience News", "description": "New research reveals that learning doesn't just alter brain activity — it physically rewires the connections between key brain regions to make communication faster and more precise.", "url": "https://neurosciencenews.com/learning-brain-connectivity-28842/", "urlToImage": "https://neurosciencenews.com/files/2025/05/learning-brain-connectivity-neuroscience.jpg", "publishedAt": "2025-05-07T21:51:44Z", "content": "Summary: New research reveals that learning doesn’t just alter brain activity it physically rewires the connections between key brain regions to make communication faster and more precise. Scientists… [+8142 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“It Made No Sense” – Scientist Discovers California’s New Highest Tree - SciTechDaily", "description": "The highest recorded elevations of Jeffrey pines provide new evidence of a warming climate in the High Sierra. UC Davis Professor Hugh Safford was hiking for enjoyment in California’s High Sierra when he unexpectedly documented a new elevation record for the …", "url": "https://scitechdaily.com/it-made-no-sense-scientist-discovers-californias-new-highest-tree/", "urlToImage": "https://scitechdaily.com/images/Jeffrey-Pine-on-Mount-Kaweah.jpg", "publishedAt": "2025-05-07T21:50:03Z", "content": "Sandwiched between a lodgepole pine on the left and a foxtail pine on the right is the first Jeffrey pine tree UC Davis Professor Hugh Safford observed in September 2024 on a hike on the south slope … [+6097 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Retired Air Force officer nominated to be NASA deputy administrator - SpaceNews", "description": "The White House has nominated a former Air Force officer and advocate for the Space Force to be the deputy administrator of NASA.", "url": "http://spacenews.com/retired-air-force-officer-nominated-to-be-nasa-deputy-administrator/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNFwvMTJcL1NjcmVlbnNob3QtMjAyNC0xMi0xMS1hdC0yLjQ3LjU1JWUyJTgwJWFmUE0tZTE3MzM5NTYzNDI2MjMtMTAyNHg1ODQucG5nIiwidHh0IjoiUmV0aXJlZCBBaXIgRm9yY2Ugb2ZmaWNlciBub21pbmF0ZWQgdG8gYmUgTkFTQSBkZXB1dHkgYWRtaW5pc3RyYXRvciIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.leyL2hKnPhtpt_hlogQPIWsA71exV5x7_MOSrRPE0J8MQ", "publishedAt": "2025-05-07T21:44:48Z", "content": "WASHINGTON The White House has nominated a former Air Force officer and advocate for the Space Force to be the deputy administrator of NASA.\r\nThe White House formally transmitted the nomination of Ma… [+2777 chars]"}, {"source": {"id": null, "name": "Carsonnow.org"}, "author": "admin", "title": "Northern Nevada backyards and gardens: Beware of this small invader - Carson Now", "description": "By JoAnne Skelly — I was out walking this morning in a grassy area south of Little Washoe Lake. My friend and I had been discussing ticks as we walked […]", "url": "http://www.carsonnow.org/05/07/2025/northern-nevada-backyards-and-gardens-beware-of-this-small-invader", "urlToImage": "https://www.carsonnow.org/wp-content/uploads/2025/05/Amblyomma_americanum_tick.jpg", "publishedAt": "2025-05-07T21:33:18Z", "content": "By JoAnne Skelly I was out walking this morning in a grassy area south of Little Washoe Lake. My friend and I had been discussing ticks as we walked through the grass. After about five minutes, she l… [+2411 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Say That Something Very Weird Is Going on With the Universe - futurism.com", "description": "Astronomers have made an intriguing discovery that could upend everything we know about the structure of the universe and its expansion.", "url": "https://futurism.com/weird-universe-dark-energy-model", "urlToImage": "https://wordpress-assets.futurism.com/2025/05/weird-universe-dark-energy-model.jpg", "publishedAt": "2025-05-07T21:29:22Z", "content": "Astronomers have made an intriguing discovery that could upend everything we know about the structure of the universe and its expansion.\r\nScientists recently found that dark energy, the mysterious fo… [+2789 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "South Africa Is Getting Lifted out of the Ocean and Scientists Believe They Know Why - SciTechDaily", "description": "According to a study conducted by the University of Bonn, droughts caused the land in Germany to rise by six millimeters between 2012 and 2020. South Africa is gradually rising by as much as two millimeters per year depending on the region. Until now, scienti…", "url": "https://scitechdaily.com/south-africa-is-getting-lifted-out-of-the-ocean-and-scientists-believe-they-know-why/", "urlToImage": "https://scitechdaily.com/images/South-Africa-Space.jpg", "publishedAt": "2025-05-07T21:27:08Z", "content": "South Africa is slowly rising, and for years, scientists assumed this uplift was caused by movements deep within the Earth. But new research offers a surprising explanation: drought-driven water loss… [+5672 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Hours before a solar eclipse, spruce trees 'talk' to each other - Yahoo", "description": "A new study suggests trees in the forest can access ancient memories and \"talk\" to each other hours before a solar eclipse.", "url": "https://www.space.com/stargazing/solar-eclipses/hours-before-a-solar-eclipse-spruce-trees-talk-to-each-other", "urlToImage": "https://media.zenfs.com/en/space_311/94ade6e7400bf1e5c65b9a66d717840c", "publishedAt": "2025-05-07T21:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nStudy location in the Dolomite mountains in Italy. | Credit: Monica Gagliano/Southern Cross Uni… [+2714 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Princeton University", "title": "Physicists discover an unusual chiral quantum state in a topological material - Phys.org", "description": "Chirality—the property of an object that is distinct from its mirror image—has long captivated scientists across biology, chemistry, and physics. The phenomenon is sometimes called \"handedness,\" because it refers to an object possessing a distinct left- or ri…", "url": "https://phys.org/news/2025-05-physicists-unusual-chiral-quantum-state.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-an.jpg", "publishedAt": "2025-05-07T20:46:04Z", "content": "Chiralitythe property of an object that is distinct from its mirror imagehas long captivated scientists across biology, chemistry, and physics. The phenomenon is sometimes called \"handedness,\" becaus… [+7510 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "NASA just sent a giant balloon around the world in 16 days. Here's why. - Live Science", "description": "NASA's massive super-pressure balloon has completed a 16-day trip around the Southern Hemisphere — a milestone in high-altitude flight and atmospheric research.", "url": "https://www.livescience.com/space/space-exploration/nasa-just-sent-a-giant-balloon-around-the-world-in-16-days-heres-why", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HV9K87CBnRncgm2iLb4yiJ.jpg", "publishedAt": "2025-05-07T20:19:32Z", "content": "NASA just pulled off a sky-high feat: One of its massive super-pressure balloons completed a full lap around the Southern Hemisphere in just over 16 days.\r\nThe globe-trotting balloon crossed the 169.… [+2869 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Wageningen University", "title": "Fish may be smarter than previously believed - Phys.org", "description": "Often studied in sterile laboratory conditions far removed from the natural habitats of rivers, lakes and seas, the cognitive abilities of fish have long been underestimated. Now, researchers at Wageningen University & Research have developed a simple and cos…", "url": "https://phys.org/news/2025-05-fish-smarter-previously-believed.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/fish-found-to-be-smart.jpg", "publishedAt": "2025-05-07T20:13:03Z", "content": "Often studied in sterile laboratory conditions far removed from the natural habitats of rivers, lakes and seas, the cognitive abilities of fish have long been underestimated. Now, researchers at Wage… [+2950 chars]"}, {"source": {"id": null, "name": "Thedesignfiles.net"}, "author": null, "title": "A Textural Backyard Wonderland For A Preston Family Home - The Design Files", "description": "Filled with whispering grasses, textural perennials and colourful natives, this Preston garden enchants from every angle.", "url": "https://thedesignfiles.net/2025/05/gardens-glint-garden-mcnuttndorf-landscapes", "urlToImage": "https://thedesignfiles.wpenginepowered.com/wp-content/uploads/2025/05/glinthouse-tdf-gardens5-2200x2860.jpg", "publishedAt": "2025-05-07T20:07:21Z", "content": "This Preston property has one thing that’s valued highly in the suburbs it backs onto a park.\r\nWith an expansive grass area beyond its back gates and endless space to for the kids to run and play, pi… [+2571 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "NASA diagnoses fracture in a 'huge cosmic bone' using X-ray observatory - Space", "description": "The \"bone\" is actually a galactic center filament, and it's about 230 light-years long.", "url": "https://www.space.com/astronomy/galaxies/nasa-diagnoses-fracture-in-a-huge-cosmic-bone-using-x-ray-observatory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BoegToC7Z4wENo8EDJTaD9.jpg", "publishedAt": "2025-05-07T20:00:00Z", "content": "A composite of X-ray and radio data showing galactic center filament G359.13142-0.20005. (Image credit: X-ray: NASA/CXC/Northwestern Univ./F. Yusef-Zadeh et al; Radio: NRF/SARAO/MeerKat; Image Proces… [+2606 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "'Largest structure in the universe' is even bigger than astronomers imagined and still a huge mystery - Earth.com", "description": "Astronomers reconsider the Great Wall Hercules-Corona Borealis: cosmic superstructure seems to be bigger and closer than imagined.", "url": "https://www.earth.com/news/largest-structure-in-universe-great-wall-hercules-corona-borealis-bigger-than-imagined/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07032920/astronomers-cosmic-superwall-ten-billion-light-years.jpg", "publishedAt": "2025-05-07T19:53:37Z", "content": "Astronomers have spotted something that appears to stretch around ten billion light years across. This so-called HerculesCorona Borealis Great Wall is being reevaluated, and it might be more extensiv… [+4843 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ashley Balzer", "title": "Key portion of Nancy Grace Roman Space Telescope clears thermal vacuum test - Phys.org", "description": "A major part of NASA's nearly complete Nancy Grace Roman Space Telescope just passed a lengthy thermal test to ensure it will function properly in the space environment.", "url": "https://phys.org/news/2025-05-key-portion-nancy-grace-roman.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/key-portion-of-nasas-r-1.jpg", "publishedAt": "2025-05-07T19:15:02Z", "content": "A major part of NASA's nearly complete Nancy Grace Roman Space Telescope just passed a lengthy thermal test to ensure it will function properly in the space environment.\r\n\"This milestone tees us up t… [+2891 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Witness the World’s Biggest Telescope Rising Under a Sky Full of Stars - The Daily Galaxy", "description": "At the Paranal Observatory, a giant telescope is using lasers to create artificial stars and capture images sharper than those from space", "url": "https://dailygalaxy.com/2025/05/telescope-creates-stars-delivers-space-like-images-from-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Witness-the-Worlds-Biggest-Telescope-Rising-Under-a-Sky-Full-of-Stars.jpg", "publishedAt": "2025-05-07T19:00:00Z", "content": "At the Paranal Observatory in Chile, the UT4 telescope doesnt just observe the starsit actively creates artificial stars to combat atmospheric interference. \r\nBy shooting powerful lasers into the sky… [+2698 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "We've Only Glimpsed 0.001% of Earth's Deep Seafloor, Study Reveals - ScienceAlert", "description": "Earth's surface is mostly deep ocean, but a new study reveals just how little we have glimpsed of the floor of our planet's largest ecosystem.", "url": "https://www.sciencealert.com/weve-only-glimpsed-0-001-of-earths-deep-seafloor-study-reveals", "urlToImage": "https://www.sciencealert.com/images/2025/05/ROVExploration.jpg", "publishedAt": "2025-05-07T18:01:54Z", "content": "Earth's surface is mostly deep ocean, but a new study reveals just how little we have glimpsed of the floor of our planet's largest ecosystem.\r\nResearchers at the non-profit Ocean Discovery League, t… [+4433 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": null, "title": "New Visualization From NASA's Webb Telescope Explores Cosmic Cliffs - Webb Home", "description": "", "url": "https://webbtelescope.org/contents/news-releases/2025/news-2025-123", "urlToImage": "//stsci-opo.org/STScI-01JT15JCG8AHE8PEE50V308N7D.png", "publishedAt": "2025-05-07T18:00:00Z", "content": "In July 2022, NASA’s James Webb Space Telescope made its public debut with a series of breathtaking images. Among them was an ethereal landscape nicknamed the Cosmic Cliffs. This glittering realm of … [+4137 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "James Webb Space Telescope finds water in the air of exotic 'sub-Neptune' exoplanet - Space", "description": "\"I had been waiting my entire career for Webb so that we could meaningfully characterize the atmospheres of these smaller planets.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-finds-water-in-the-air-of-exotic-sub-neptune-exoplanet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hRXx8GNspzfWe2vBqUKH5Q.jpg", "publishedAt": "2025-05-07T18:00:00Z", "content": "NASA's James Webb Space Telescope (JWST) has found water swirling in the air of a distant alien planet, a new study reports.\r\nThat exotic world is TOI-421 b, a boiling-hot \"sub-Neptune\r\n\" orbiting a … [+4824 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Space Telescope Just Captured the Most Detailed Look Ever at Planets Being Born - The Daily Galaxy", "description": "Astronomers have captured the most detailed images yet of distant planetary nurseries—revealing swirling gas, dust rings, and the invisible hands of worlds in the making.", "url": "https://dailygalaxy.com/2025/05/space-telescope-captured-detailed-planets/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/This-Space-Telescope-Just-Captured-the-Most-Detailed-Look-Ever-at-Planets-Being-Born.jpg", "publishedAt": "2025-05-07T18:00:00Z", "content": "In a groundbreaking study published on April 30, 2025, in Popular Science, astronomers from the exoALMA project have captured some of the sharpest images ever seen of protoplanetary disks in young st… [+3250 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "NASA gets keys to Orion photo of the day for May 7, 2025 - Space", "description": "Lockheed Martin officials handed over the \"keys\" to the Artemis 2 Orion spacecraft to NASA, marking the start of its processing for launch.", "url": "https://www.space.com/space-exploration/artemis/nasa-gets-keys-to-orion-space-photo-of-the-day-for-may-7-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4h7x4UeSUwP5ZnRakBuQQG.jpg", "publishedAt": "2025-05-07T17:31:00Z", "content": "NASA and Lockheed Martin officials pose together during a handover ceremony for the Artemis 2 Orion spacecraft at Kennedy Space Center in Florida on May 1, 2025. (Image credit: NASA/Cory S. Huston)\r\n… [+2746 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "NASA Mars satellite uncovers markings 'like paint dripping down a wall' on Martian surface - Yahoo", "description": "Wave-like soil patterns on the Martian surface match those found in Earth's cold, mountain regions, which could help scientists better understand the Red Planet's climate history and search for signs of life.", "url": "https://www.livescience.com/space/mars/nasa-mars-satellite-uncovers-markings-like-paint-dripping-down-a-wall-on-martian-surface", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BefafqhVkahi49pQH29GfR.jpg", "publishedAt": "2025-05-07T17:17:58Z", "content": "High-resolution satellite images have revealed dripping paint-like patterns on Mars that match those found on Earth, according to a new study.\r\nThe familiar soil patterns suggest that Mars and Earth … [+3688 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Nighthawk: This Mars Helicopter Is Set to Find Proof of Life on Mars - The Daily Galaxy", "description": "NASA’s Nighthawk helicopter is ready to soar over Mars, aiming to unlock its most mysterious regions. This ambitious mission could be the key to discovering life on the Red Planet.", "url": "https://dailygalaxy.com/2025/05/nasas-nighthawk-this-mars-helicopter-is-set-to-find-proof-of-life-on-mars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/NASAs-Nighthawk-This-Mars-Helicopter-Is-Set-to-Find-Proof-of-Life-on-Mars.jpg", "publishedAt": "2025-05-07T17:00:00Z", "content": "NASA is planning to push the boundaries of space exploration with its new Nighthawk Mars helicopter, a cutting-edge mission that promises to reveal new details about the Red Planet. The mission is ai… [+3703 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Dave Gallagher Named 11th Director of JPL as Laurie Leshin Steps Down - NASA Jet Propulsion Laboratory (JPL) (.gov)", "description": "The change in leadership will take place at the start of June.", "url": "https://www.jpl.nasa.gov/news/dave-gallagher-named-11th-director-of-jpl-as-laurie-leshin-steps-down/", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/Dave-Gallagher_thumb.jpg", "publishedAt": "2025-05-07T16:41:45Z", "content": "Laurie Leshin has decided to step down as director of NASAs Jet Propulsion Laboratory on Sunday, June 1. David Gallagher, who has been serving as the Labs associate director for Strategic Integration… [+3084 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Sun unleashes jaw-dropping filament eruption — but Earth dodges the blast (photo) - Space", "description": "GOES-19 satellite captures breathtaking footage as a towering solar filament erupts over the sun's eastern limb.", "url": "https://www.space.com/astronomy/sun/sun-unleashes-jaw-dropping-filament-eruption-but-earth-dodges-the-blast-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZVreVQbukKJtSezvTdjkhQ.jpg", "publishedAt": "2025-05-07T16:30:00Z", "content": "The filament erupted from the sun on May 7. (Image credit: NOAA Space Weather Prediction Center)\r\nA massive solar filament erupted today (May 7), producing a stunning display that spanned the sun's e… [+2426 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "3D-print a realistic supernova remnant with NASA's new models of Chandra X-ray images - Space", "description": "You can now hold a star in your hands.", "url": "https://www.space.com/astronomy/3d-print-a-realistic-supernova-remnant-with-nasas-new-models-of-chandra-x-ray-images", "urlToImage": "https://cdn.mos.cms.futurecdn.net/We2A9VcQY928YonRJMqri9.jpg", "publishedAt": "2025-05-07T16:00:00Z", "content": "Using cutting-edge theoretical models and data from NASA's Chandra X-ray Observatory, scientists have transformed astronomical observations into detailed 3D models of cosmic objects — models that any… [+4794 chars]"}, {"source": {"id": null, "name": "WKRC TV Cincinnati"}, "author": "WKRC", "title": "NASA has used supercomputers to learn when all life on Earth will end - WKRC", "description": "Supercomputers used by NASA scientists and researchers from Japan's University of Toho have figured out when all life on Earth will end.", "url": "https://local12.com/news/offbeat/nasa-supercomputers-learn-when-all-life-on-earth-will-end-planet-destruction-done-finished-finale-resilient-organisms-sun-hotter-oxygen-fall-temperatures-air-quality-worsen-surface-conditions-technological-advancements-support-systems-habitable", "urlToImage": "https://local12.com/resources/media2/16x9/3934/986/0x205/90/57d00226-dfe0-4061-a2c5-87916375656d-AP25029779028259.jpg", "publishedAt": "2025-05-07T15:49:15Z", "content": "UNDATED (WKRC) - Supercomputers used by NASA scientists and researchers from Japan's University of Toho have figured out when all life on Earth will end.\r\nBGR reported that the study says the Sun wil… [+815 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "NASA scrambles to cut ISS activity after Trump budget—its options are not great - Ars Technica", "description": "“The Budget reduces the space station’s crew size and onboard research.”…", "url": "https://arstechnica.com/space/2025/05/nasa-scrambles-to-cut-iss-activity-after-trump-budget-its-options-are-not-great/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/04/iss028e016134-1152x648.jpg", "publishedAt": "2025-05-07T15:16:39Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Discover Wild Birds Behaving Suspiciously Like Friends - ScienceAlert", "description": "The ability to cooperate and work together is not unique to humans; indeed, it's one of the most successful strategies for collective survival in the whole tree of life, from the give-and-take between symbionts, to the kindness of strangers in the street.", "url": "https://www.sciencealert.com/scientists-discover-wild-birds-behaving-suspiciously-like-friends", "urlToImage": "https://www.sciencealert.com/images/2025/05/birb-besties.jpg", "publishedAt": "2025-05-07T15:01:21Z", "content": "The ability to cooperate and work together is not unique to humans; indeed, it's one of the most successful strategies for collective survival in the whole tree of life, from the give-and-take betwee… [+4366 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Lunar laser: China makes 1st daytime laser-ranging measurement from Earth to the moon - Space", "description": "The laser test needed to overcome major technical challenges posed by sunlight. interference.", "url": "https://www.space.com/astronomy/moon/lunar-laser-china-makes-1st-daytime-laser-ranging-measurement-from-earth-to-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6JZPPiMWeKXj6hk8mSXAoQ.jpg", "publishedAt": "2025-05-07T15:00:00Z", "content": "China has achieved a milestone feat, making the first-ever laser ranging measurement from Earth to the moon during the daytime.\r\nResearchers at Yunnan Observatories under the Chinese Academy of Scien… [+2120 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Exceptionally rare radio sources detected in the distant universe - Mashable", "description": "Giant ripples in space?", "url": "https://mashable.com/article/galaxy-collision-rare-radio-relics-image", "urlToImage": "https://helios-i.mashable.com/imagery/articles/02f5PQ3N1A6a92V5VJSneag/hero-image.fill.size_1200x675.v1746558338.jpg", "publishedAt": "2025-05-07T14:56:08Z", "content": null}, {"source": {"id": null, "name": "Best Life"}, "author": "Zachary Mack", "title": "\"Miracle\" Anti-Aging Supplement Hyped By Celebs Is a Waste of Money, Scientists Warn - bestlifeonline.com", "description": "Is NAD+ really the anti-aging miracle it's cracked up to be? Despite celebrity endorsements and a booming market, a new study suggests it may not live up to the hype. Are supplements worth the investment, or can you get the same benefits from natural sources?…", "url": "https://bestlifeonline.com/nad-supplement-2671900796/?utm_campaign=post-teaser&utm_content=sj23igqd", "urlToImage": "https://bestlifeonline.com/media-library/image.jpg?id=60148791&width=1200&height=600&coordinates=0%2C105%2C0%2C105", "publishedAt": "2025-05-07T14:37:13Z", "content": "At the surface, supplements claim to be able to provide all kinds of health and wellness benefitsincluding helping you age\r\n in reverse. While plenty of pills and powders are touted as \"anti-aging\" i… [+5804 chars]"}, {"source": {"id": null, "name": "Parkinson's News Today"}, "author": "Steve Bryson, PhD", "title": "New insights into motor control in brain may help in Parkinson’s - Parkinson's News Today", "description": "New insights into motor control in the brain may help researchers develop better Parkinson's treatments, according to a study.", "url": "https://parkinsonsnewstoday.com/?p=110776&preview=true&preview_id=110776", "urlToImage": "https://parkinsonsnewstoday.com/wp-content/uploads/2024/12/BrainProfile.png", "publishedAt": "2025-05-07T14:04:49Z", "content": "Switching actions and stopping movements involve two distinct cognitive motor processes, according to a study that combined computer modeling with tasks performed by healthy people. The findings have… [+5020 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Ellie Kemp", "title": "People can't believe what they're seeing after real distance between Earth and Moon is laid bare - UNILAD", "description": "NASA's OSIRIS-REx probe captured the Earth and Moon 249,000 miles apart", "url": "https://www.unilad.com/technology/space/earth-moon-distance-nasa-reddit-reaction-373260-20250507", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt98be4490f037557a/681b42d3f5af756747c1ab06/moon-earth-distance-reddit.jpg", "publishedAt": "2025-05-07T13:56:45Z", "content": "A photo capturing the true scale of the distance between the Earth and the Moon has blown people's minds. \r\nA viral Reddit post has reminded us once again just how tiny and ultimately insignificant o… [+2241 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Molecular Bond That Helps Secure Your Memories - Quanta Magazine", "description": "How do memories last a lifetime when the molecules that form them turn over within days, weeks or months? An interaction between two proteins points to a molecular basis for memory.", "url": "https://www.quantamagazine.org/the-molecular-bond-that-helps-secure-your-memories-20250507/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/05/MolecularMemory_crCarlos-Arrojo-Social.jpg", "publishedAt": "2025-05-07T13:52:10Z", "content": "To find out if KIBRA and PKM work together in response to synaptic activity, the researchers used a technique that makes interacting proteins glow. When they applied electrical pulses to hippocampal … [+4215 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Maria Merano", "title": "Starlink grows: 28 new satellites deployed - Teslarati", "description": "SpaceX launched Starlink 6-93, adding 28 satellites to its vast constellation. Starlink’s global role is only expanding.", "url": "https://www.teslarati.com/spacex-starlink-constellation-global-demand/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2025/05/SpaceX-expands-Starlink-constellation-amid-surging-global-demand--1000x600.jpg", "publishedAt": "2025-05-07T13:06:56Z", "content": "A number of Cybertruck owners on social media recently shared screenshots of a new promotion that Tesla seems to be offering to customers of its all-electric pickup truck. Based on images shared onli… [+2508 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "Private Japanese lunar lander enters orbit around moon ahead of a June touchdown - NBC News", "description": "A private lunar lander from Japan is now circling the moon, with just another month to go before it attempts a touchdown.", "url": "https://www.nbcnews.com/science/space/private-japanese-lunar-lander-enters-orbit-moon-ahead-june-touchdown-rcna205308", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250507-ispace-resilience-moon-mn-0845-c1b238.jpg", "publishedAt": "2025-05-07T13:06:14Z", "content": "A private lunar lander from Japan is now circling the moon, with just another month to go before it attempts a touchdown.\r\nTokyo-based ispace said Wednesday morning its Resilience lander entered luna… [+894 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Particle Originating From the Edge of the Universe Detected at the Bottom of the Mediterranean Sea - The Daily Galaxy", "description": "This rare event could unlock new mysteries of the universe. What scientists uncovered could change everything we know about neutrinos.", "url": "https://dailygalaxy.com/2025/05/a-particle-originating-from-the-edge-of-the-universe-detected-at-the-bottom-of-the-mediterranean-sea/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Completed-Digital-Optical-Module.jpg", "publishedAt": "2025-05-07T11:45:00Z", "content": "In an unprecedented breakthrough, scientists have detected a neutrino with the highest energy ever recorded, deep in the Mediterranean Sea. This discovery could provide vital clues to understanding t… [+2795 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rose Nigam", "title": "10 animals that live today but have dinosaur traits - Times of India", "description": "​Though dinosaurs vanished 66 million years ago, their legacy lives on. Common traits include armoured bodies, sharp claws and beaks. And some modern animals still carry these traits that link them to their past. Here are 10 living creatures that share dinosa…", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/web-stories/10-animals-that-live-today-but-have-dinosaur-traits/photostory/120961647.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120961672,imgsize-83488,width-900,height-1200,resizemode-6/120961672.jpg", "publishedAt": "2025-05-07T11:30:00Z", "content": "With long claws, muscular bodies, and sharp teeth, monitor lizards, much like the Komodo dragon, resemble mini carnivorous dinosaurs. Their predatory behaviour and build make them similar to ancient … [+8 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Mysterious substance spotted swirling across the surface of the Baltic Sea — Earth from space - Live Science", "description": "This 2018 satellite photo shows an unknown substance swirling across the Gulf of Gdańsk in Poland. Scientists were shocked to later discover what it really was.", "url": "https://www.livescience.com/planet-earth/rivers-oceans/mysterious-substance-spotted-swirling-across-the-surface-of-the-baltic-sea-earth-from-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ngxep2zG4o83mXH5ZDFNzb.jpg", "publishedAt": "2025-05-07T11:05:09Z", "content": "Where is it? Gulf of Gdańsk, Poland [54.49454424, 19.056185969]\r\nWhat's in the photo? Slicks of organic material swirling on the ocean surface\r\nWhich satellite took the photo? European Space Agency’s… [+4027 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Forest satellite’s big antenna opens up - European Space Agency", "description": "Just a week after its launch, ESA’s Biomass mission has reached another critical milestone on its path to delivering unprecedented insights into the world’s forests and their vital role in Earth’s carbon cycle – the satellite’s 12-metre-diameter antenna is no…", "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/Biomass/Forest_satellite_s_big_antenna_opens_up", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/05/biomass_antenna_opens/26690929-1-eng-GB/Biomass_antenna_opens_pillars.gif", "publishedAt": "2025-05-07T08:52:29Z", "content": "Applications07/05/20256792 views78 likes\r\nJust a week after its launch, ESAs Biomass mission has reached another critical milestone on its path to delivering unprecedented insights into the worlds fo… [+3428 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "daniel.graham@ourmedia.co.uk", "title": "The mysterious ‘Asian unicorn’ hasn't been seen since 2013 – here's why scientists are desperate to find it - BBC Wildlife Magazine", "description": "The almost mythical, horned saola has only been sighted a handful of times in the remote highland forests of Vietnam and Laos.", "url": "https://www.discoverwildlife.com/animal-facts/saola-annamite-mountains-vietnam-laos", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2025/05/Forest.jpeg?w=1200", "publishedAt": "2025-05-07T08:39:59Z", "content": "Deep in the mist-shrouded forests of the Annamite Mountains, on the border between Vietnam and Laos, lives a mysterious, horned creature. At least, that's where it used to live.\r\nNicknamed the 'Asian… [+4711 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Bizarre 113-Million-Year-Old Hell Ant With Killer Scythe Jaws - SciTechDaily", "description": "Imaging of a 113-million-year-old ant fossil reveals complex, specialized mandibles, showing advanced predatory traits much earlier in ant evolution than expected. A 113-million-year-old hell ant that once inhabited northeastern Brazil is now recognized as th…", "url": "https://scitechdaily.com/scientists-discover-bizarre-113-million-year-old-hell-ant-with-killer-scythe-jaws/", "urlToImage": "https://scitechdaily.com/images/Hell-Ant-Fossil.jpg", "publishedAt": "2025-05-07T08:21:10Z", "content": "Photograph of Haidomyrmecinae fossil. Credit: Anderson Lepeco\r\nImaging of a 113-million-year-old ant fossil reveals complex, specialized mandibles, showing advanced predatory traits much earlier in a… [+4352 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "90-Million-Year-Old Mammal Fossil Found in Gobi Desert - Sci.News", "description": "A new genus and species of zhelestid mammal has been identified from the fossilized remains found in the Bayanshiree Formation in Mongolia’s Gobi Desert.", "url": "https://www.sci.news/paleontology/ravjaa-ishiii-13884.html", "urlToImage": "https://cdn.sci.news/images/2025/05/image_13884f-Ravjaa-ishiii.jpg", "publishedAt": "2025-05-06T22:40:04Z", "content": "A new genus and species of zhelestid mammal has been identified from the fossilized remains found in the Bayanshiree Formation in Mongolias Gobi Desert.\r\nLife reconstruction of Ravjaa ishiii (foregro… [+2351 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Find ‘Impossible’ Crystal Created by World’s First Nuclear Bomb - Indian Defence Review", "description": "A crystal, formed during the first nuclear bomb test at Trinity, offers new insights into nuclear explosions and could pave the way for future nuclear forensics.", "url": "https://indiandefencereview.com/scientists-crystal-created-nuclear-bomb/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/scientists-find-impossible-crystal-created-by-worlds-first-nuclear-bomb.jpg", "publishedAt": "2025-05-06T20:25:00Z", "content": "In an extraordinary discovery, scientists have revealed that a quasicrystal, a rare and once-thought-to-be-impossible form of matter, was created during the worlds first nuclear bomb test. This groun… [+4200 chars]"}]}