{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": "axios", "name": "Axios"}, "author": "Kelly Tyko", "title": "\"Double sunrise\" eclipse: How, when and where to see the partial solar eclipse Saturday - Axios", "description": "Taking a glimpse at the eclipse without the right protective eyewear can cause severe eye injury.", "url": "https://www.axios.com/2025/03/29/solar-eclipse-double-sunrise-time-saturday", "urlToImage": "https://images.axios.com/QVcJxrwtZSl5yTunbc6Ug5VisKo=/0x0:3982x2240/1366x768/2025/03/28/1743172887696.jpg", "publishedAt": "2025-03-29T00:01:03Z", "content": "Saturday's partial solar eclipse offers the rare chance to see a \"double sunrise\" in the northeastern part of the country.\r\nWhy it matters: It's the only solar eclipse visible from the U.S. this year… [+3734 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "'Totally unexpected' galaxy discovered by James Webb telescope defies our understanding of the early universe - Livescience.com", "description": "Scientists studying one of the earliest known galaxies using the James Webb Space Telescope have found that the universe's Era of Reionization may have occurred much earlier than previously thought.", "url": "https://www.livescience.com/space/astronomy/totally-unexpected-galaxy-discovered-by-james-webb-telescope-defies-our-understanding-of-the-early-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fbFDkqxh4cfi4eDryfpZHL-1200-80.jpg", "publishedAt": "2025-03-28T20:39:07Z", "content": "An ancient galactic lighthouse is shining through the fog of the early universe, new James Webb Space Telescope\r\n (JWST) observations reveal.\r\nResearchers discovered bright ultraviolet (UV) light com… [+3308 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Legendary U.S. Particle Collider Is About to Perform Its Final Smash - Gizmodo", "description": "Brookhaven National Laboratory's Relativistic Heavy Ion Collider kicked off its final year of operations this week, marking a quarter century of discoveries in particle physics.", "url": "https://gizmodo.com/legendary-u-s-particle-collider-is-about-to-perform-its-final-smash-2000582038", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/rhic-brookhaven.jpg", "publishedAt": "2025-03-28T20:00:21Z", "content": "After 25 years of smashing gold nuclei together at light speeds, Brookhaven National Laboratory’s Relativistic Heavy Ion Collider is hanging up its bootserm, superconducting magnets.\r\nThe collider’s … [+3615 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "40-Year Barrier Broken: Scientists Discover New High-Temperature Superconductor - SciTechDaily", "description": "NUS scientists created the first copper-free superconductor to work above 30 K under ambient pressure, marking a major scientific leap. This discovery may revolutionize energy-efficient electronics. Professor Ariando and Dr Stephen Lin Er Chow from the Nation…", "url": "https://scitechdaily.com/40-year-barrier-broken-scientists-discover-new-high-temperature-superconductor/", "urlToImage": "https://scitechdaily.com/images/Superconductor-Illustration.jpg", "publishedAt": "2025-03-28T19:26:46Z", "content": "Scientists from NUS have synthesized a copper-free superconducting oxide that operates at around 40 K under ambient pressure, advancing the field beyond traditional copper oxides. This breakthrough d… [+5703 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Some sharks make sounds - despite not having vocal cords - Earth.com", "description": "Researchers have recorded rig sharks producing clicking sounds by snapping their teeth together, likely as a stress or defense response.", "url": "https://www.earth.com/news/some-sharks-make-sounds-despite-not-having-vocal-cords/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/28131828/Shark-sounds.jpg", "publishedAt": "2025-03-28T19:21:31Z", "content": "For centuries, sharks have stirred fear and fascination. They glide through water with quiet power. Unlike whales or dolphins, they never seem to speak. Scientists assumed that sharks lived in a worl… [+6522 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "NASA to put Starliner’s thrusters through an extensive workout before next launch - Ars Technica", "description": "“We’ll continue to work through certification toward the end of this year.”…", "url": "https://arstechnica.com/space/2025/03/nasa-to-put-starliners-thrusters-through-an-extensive-workout-before-next-launch/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/52096151366_1f97fed2cc_k-1152x648.jpg", "publishedAt": "2025-03-28T18:47:14Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianna Bragg", "title": "Fossilized fish up to 16 million years old found in Australia, with last meal still intact - CNN", "description": "Paleontologists in Australia discovered a remarkably preserved fish species, revealing its last meal and offering new insights into the region’s historic ecosystem.", "url": "https://www.cnn.com/2025/03/28/science/fossilized-fish-16-million-meal-australia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/stomach-contents-of-fish-showing-that-that-it-fed-predominantly-on-phantom-midge-salty-dingo-2020-038a7561.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-28T18:28:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nSummary\r\n<ul><li>Paleontologists discovered a fossiliz… [+4852 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Howard University", "title": "Physicist revisits the computational limits of life and Schrödinger's essential question in the era of quantum computing - Phys.org", "description": "More than 80 years ago, Erwin Schrödinger, a theoretical physicist steeped in the philosophy of Schopenhauer and the Upanishads, delivered a series of public lectures at Trinity College, Dublin, which eventually came to be published in 1944 under the title \"W…", "url": "https://phys.org/news/2025-03-physicist-revisits-limits-life-schrdinger.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/quantum-computer.jpg", "publishedAt": "2025-03-28T18:00:01Z", "content": "More than 80 years ago, Erwin Schrödinger, a theoretical physicist steeped in the philosophy of Schopenhauer and the Upanishads, delivered a series of public lectures at Trinity College, Dublin, whic… [+9719 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mars May Kill Astronauts — And It’s Not How You Think - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s biggest challenge on Mars might not be radiation or distance — but something far more insidious underfoot. New research uncovers a silent threat that could jeopardize astronaut survival long before the return trip.", "url": "https://dailygalaxy.com/2025/03/mars-may-kill-astronauts/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Mars-May-Kill-Astronauts-—-And-Its-Not-How-You-Think.jpg", "publishedAt": "2025-03-28T18:00:00Z", "content": "As the race to send humans to Mars intensifies, scientists are sounding the alarm about a silent threat that could undermine every mission plan: toxic Martian dust. \r\nA new study from the Keck School… [+2836 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Giant, Ancient Life Form Doesn’t Fit Into Any Known Branch of Life - Gizmodo", "description": "Scientists have debated where Prototaxites belong in the tree of life for over a century, but now a new study suggests it might represent a whole new branch.", "url": "https://gizmodo.com/giant-ancient-life-form-doesnt-fit-into-any-known-branch-of-life-2000582118", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/painting-of-prototaxites.jpg", "publishedAt": "2025-03-28T17:55:06Z", "content": "Hundreds of millions of years ago, mysterious life forms called Prototaxites towered toward the sky. Believed to be the first giant organisms to thrive on dry land, some species of Prototaxites grew … [+3207 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "Scientists uncover 'inside-out, legless, headless wonder' that lived long before the dinosaurs - Livescience.com", "description": "Fossils of 444 million-year-old creatures whose bodies were preserved \"inside-out\" have been discovered in South Africa.", "url": "https://www.livescience.com/animals/extinct-species/scientists-uncover-inside-out-legless-headless-wonder-that-lived-long-before-the-dinosaurs", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GugvyuJLNHqHRGmgEmjE7T-1200-80.jpg", "publishedAt": "2025-03-28T17:40:17Z", "content": "Scientists have found two specimens of a 444 million-year-old \"inside-out\" fossil with well-preserved soft tissue, according to a new study. Unlike most fossils, the creature's muscles and guts — but… [+3829 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "99-million-year-old Amber Reveals Wasp With Venus Flytrap Rear End - The Daily Galaxy --Great Discoveries Channel", "description": "Trapped in 99-million-year-old amber, a newly discovered wasp species hides a strange secret: a rear end shaped like a Venus flytrap. Scientists say it's unlike anything ever seen before—but what was it really used for?", "url": "https://dailygalaxy.com/2025/03/99-million-year-old-wasp-venus-flytrap/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/99-million-year-old-Amber-Reveals-Wasp-With-Venus-Flytrap-Rear-End.jpg", "publishedAt": "2025-03-28T17:30:00Z", "content": "A new study, published in BMC Biology, discovered prehistoric wasp preserved in amber is turning heads in the world of entomology with a rear end straight out of a science fiction movie. With a bizar… [+3217 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA astronaut who gave up seat for Starliner crew takes command of SpaceX Crew-11 flight to ISS - Space.com", "description": "Zena Cardman will command the Crew-11 mission to the ISS, which could launch as soon as July.", "url": "https://www.space.com/space-exploration/international-space-station/nasa-astronaut-who-gave-up-seat-for-starliner-rescue-mission-takes-command-of-spacex-crew-11-flight-to-iss", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AoVc7PdYnxFSJDPRtNwvfY-1200-80.jpg", "publishedAt": "2025-03-28T17:00:00Z", "content": "Zena Cardman didn't have to wait too long to get a seat on another spacecraft after being removed from SpaceX's Crew-9 mission last year.\r\nThe NASA astronaut is one of the four members of SpaceX's Cr… [+2472 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Just Found Proof That Neanderthals and Homo Sapiens Were More Than Neighbors - The Daily Galaxy --Great Discoveries Channel", "description": "A mysterious cave in Israel is shaking up everything we thought we knew about Neanderthals and early humans. What archaeologists uncovered suggests a surprising connection between Neanderthals and Homo sapiens—and it's not what you think.", "url": "https://dailygalaxy.com/2025/03/proof-neanderthals-homo-sapiens-neighbors/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Scientists-Just-Found-Proof-That-Neanderthals-and-Homo-Sapiens-Were-More-Than-Neighbors.jpg", "publishedAt": "2025-03-28T17:00:00Z", "content": "A recent study published in Nature Human Behaviour shows that a cave in central Israel suggest that Neanderthals and early Homo sapiens not only coexisted but also collaborated, rewiring long-held as… [+2983 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Broken Moon Lander Caught a Cosmic Signal No One Expected - The Daily Galaxy --Great Discoveries Channel", "description": "A NASA experiment on the moon has picked up strange radio signals from deep space — despite a botched landing. What it uncovered could change how we search for life beyond Earth.", "url": "https://dailygalaxy.com/2025/03/nasas-broken-moon-lander-caught-a-cosmic-signal-no-one-expected/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/NASAs-Broken-Moon-Lander-Caught-a-Cosmic-Signal-No-One-Expected.jpg", "publishedAt": "2025-03-28T16:30:00Z", "content": "A groundbreaking NASA experiment has delivered the first successful radio astronomy observations from the lunar surface, signaling the beginning of a new phase in space-based exploration of the early… [+2847 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "James Webb Space Telescope discovers 2 galaxies forming breathtaking 'cosmic lens': Space photo of the day - Space.com", "description": "The space telescope's image of a odd-looking spiral galaxy is, in reality, two distant galaxies overlapping each other.", "url": "https://www.space.com/space-exploration/james-webb-space-telescope/james-webb-space-telescope-discovers-2-galaxies-forming-breathtaking-cosmic-lens-space-photo-of-the-day", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eHMvCKpE8KdMCuGvkeHpW6-1200-80.jpg", "publishedAt": "2025-03-28T15:36:21Z", "content": "An elliptical galaxy (at center) is seen being wrapped by a spiral galaxy forming a single \"Einstein ring,\" but in reality is the result of a cosmic lens overlapping the two distant celestial structu… [+2550 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Ellsworth Toohey", "title": "The Incredible Shrinking Man would need to eat his body weight daily just to survive - Boing Boing", "description": "When King Kong climbs the Empire State Building or a giant octopus pulls down the Golden Gate Bridge, they're not just breaking box office records — they're breaking the laws…", "url": "https://boingboing.net/2025/03/28/the-incredible-shrinking-man-would-need-to-eat-his-body-weight-daily-just-to-survive.html", "urlToImage": null, "publishedAt": "2025-03-28T15:16:02Z", "content": "When King Kong climbs the Empire State Building or a giant octopus pulls down the Golden Gate Bridge, they're not just breaking box office records they're breaking the laws of physics. In biologist M… [+2884 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "This spacecraft swarm could spot interstellar visitors zipping through our solar system - Space.com", "description": "\"We're trying to encounter an astronomical object that streaks through our solar system just once and we don’t want to miss the opportunity.\"", "url": "https://www.space.com/space-exploration/tech/this-spacecraft-swarm-could-spot-interstellar-visitors-zipping-through-our-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2kbPLhGVRFxv4SEafkhLe4-1200-80.png", "publishedAt": "2025-03-28T15:00:00Z", "content": "In 2017, scientists spotted our solar system's first confirmed interstellar visitor: 'Oumuamua. While not an alien spacecraft, 'Oumuamua was an interstellar object (ISO), which came from another plan… [+2780 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leibniz-Institut für Ostseeforschung Warnemünde", "title": "After 7,000 years without light and oxygen in Baltic Sea mud, researchers bring prehistoric algae back to life - Phys.org", "description": "A research team led by the Leibniz Institute for Baltic Sea Research Warnemünde (IOW) was able to revive dormant stages of algae that sank to the bottom of the Baltic Sea almost 7,000 years ago. Despite thousands of years of inactivity in the sediment without…", "url": "https://phys.org/news/2025-03-years-oxygen-baltic-sea-mud.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/after-7000-years-witho.jpg", "publishedAt": "2025-03-28T14:27:05Z", "content": "A research team led by the Leibniz Institute for Baltic Sea Research Warnemünde (IOW) was able to revive dormant stages of algae that sank to the bottom of the Baltic Sea almost 7,000 years ago. Desp… [+6937 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Experiment shows theory describing formation of interstellar benzene does not actually produce benzene - Phys.org", "description": "Astrophysicists at the University of Colorado's JILA, National Institute of Science and Technology, have conducted an experiment to produce benzene the way theories have predicted it is produced in interstellar space and found it did not produce any benzene. …", "url": "https://phys.org/news/2025-03-theory-formation-interstellar-benzene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/experiment-shows-theor.jpg", "publishedAt": "2025-03-28T14:10:01Z", "content": "Astrophysicists at the University of Colorado's JILA, National Institute of Science and Technology, have conducted an experiment to produce benzene the way theories have predicted it is produced in i… [+2789 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Just Uncovered What Earth Looked Like Before It Was Even Fully Formed - The Daily Galaxy --Great Discoveries Channel", "description": "Crystals forged in Earth’s fiery youth are revealing how our planet took shape in its first 100 million years.", "url": "https://dailygalaxy.com/2025/03/scientists-uncovered-earth-looked-before/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Scientists-Just-Uncovered-What-Earth-Looked-Like-Before-It-Was-Even-Fully-Formed.jpg", "publishedAt": "2025-03-28T14:00:00Z", "content": "New research is reshaping how scientists understand the earliest days of Earths formationsuggesting that the deep interior of our planet locked in its defining features just 100 million years after i… [+3574 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Quantum Teleportation Achieved Over Internet For The First Time - ScienceAlert", "description": "A quantum state of light was successfully teleported through more than 30 kilometers (around 18 miles) of fiber optic cable amid a torrent of internet traffic – a feat of engineering once considered impossible.", "url": "https://www.sciencealert.com/quantum-teleportation-achieved-over-internet-for-the-first-time", "urlToImage": "https://www.sciencealert.com/images/2024/12/swparkly_light_waves_header.jpg", "publishedAt": "2025-03-28T13:02:44Z", "content": "A quantum state of light was successfully teleported through more than 30 kilometers (around 18 miles) of fiber optic cable amid a torrent of internet traffic a feat of engineering once considered im… [+3739 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Owen Hughes", "title": "Flat, razor-thin telescope lens could change the game in deep space imaging — and production could start soon - Livescience.com", "description": "Scientists have developed an impossibly thin telescope lens that addresses a key astronomical challenge in a new study funded by NASA and DARPA.", "url": "https://www.livescience.com/technology/engineering/flat-razor-thin-telescope-lens-could-change-the-game-for-deep-space-imaging-and-production-could-start-soon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iRDYYuoRbVQRPfHqCVW5EC-1200-80.jpg", "publishedAt": "2025-03-28T13:02:05Z", "content": "A new type of flat, razor-thin telescope lens could transform deep-space stargazing by making it possible to mount lightweight but powerful telescopes onto aircraft and satellites, scientists say.\r\nR… [+4475 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Rick Tumlinson", "title": "Artemis 2.0: A model for really winning the new moon race - SpaceNews", "description": "Right now, the remains of three private spacecraft rest on the moon, with one more lost in Earth orbit. And that is incredible. First came Israel’s Beresheet, which crashed on the lunar surface in …", "url": "http://spacenews.com/artemis-2-0-a-model-for-really-winning-the-new-moon-race/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvaTAud3AuY29tXC9zcGFjZW5ld3MuY29tXC93cC1jb250ZW50XC91cGxvYWRzXC8yMDI1XC8wM1wvbW9vbi1taXNzaW9uLndlYnA_Zml0PTkwNyUyQzUxMCZxdWFsaXR5PTgwJnNzbD0xIiwidHh0IjoiQXJ0ZW1pcyAyLjA6IEEgbW9kZWwgZm9yIHJlYWxseSB3aW5uaW5nIHRoZSBuZXcgbW9vbiByYWNlIiwidGVtcGxhdGUiOiJmdWxsc2NyZWVuIiwiYmxvZ19pZCI6ODA2ODE5Nzl9._VvnsW42KPJfh0sq8tsVQsH81LPQ7DsipayGCFZu6eoMQ", "publishedAt": "2025-03-28T13:00:00Z", "content": "Right now, the remains of three private spacecraft rest on the moon, with one more lost in Earth orbit. And that is incredible.\r\nFirst came Israels Beresheet, which crashed on the lunar surface in 20… [+8352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mindy Weisberger", "title": "Scientists redid an experiment that showed how life on Earth could have started. They found a new possibility - CNN", "description": "New research suggests “microlightning” exchanges among water droplets in Earth’s early atmosphere may have sparked the building blocks of life.", "url": "https://www.cnn.com/2025/03/28/science/microlightning-water-droplets-life-on-earth/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-936033518.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-28T12:53:00Z", "content": "Summary\r\n<ul><li>Scientists suggest microlightning in water droplets could have sparked the creation of Earth's earliest organic molecules.</li><li>The new research, published in Science Advances, bu… [+7464 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Discovered by Perseverance Rover, an Enigmatic Martian Rock with Hollow Spherules Intrigues NASA - The Daily Galaxy --Great Discoveries Channel", "description": "A strange rock spotted by NASA’s Perseverance rover is stirring debate among scientists. Its bizarre surface is covered with hundreds of mysterious gray spheres.", "url": "https://dailygalaxy.com/2025/03/discovered-by-perseverance-rover-an-enigmatic-martian-rock-with-hollow-spherules-intrigues-nasa/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Letonnante-roche-couverte-de-spherules-parfois-trouees-decouverte-par-le-rover-Perseverance-le-11-mars-2025.jpg", "publishedAt": "2025-03-28T11:15:00Z", "content": "Earlier this month, NASAs Perseverance rovermade an unexpected discovery on the outer rim of Marss Jezero Crater: a rock so unusual in appearance and structure that it has left planetary scientists s… [+4782 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Rocket Report: Stoke is stoked; sovereignty is the buzzword in Europe - Ars Technica", "description": "“The idea that we will be able to do it through America… I think is very, very doubtful.”…", "url": "https://arstechnica.com/space/2025/03/rocket-report-stoke-is-stoked-sovereignty-is-the-buzzword-in-europe/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/Gj_q6cnWcAAkjpz-1152x648.jpg", "publishedAt": "2025-03-28T11:00:14Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Pain Relief Without Addiction: Researchers Develop New Oxytocin-Based Oral Drug - SciTechDaily", "description": "Researchers have developed a new type of oral painkiller for chronic abdominal pain, inspired by the peptide hormone oxytocin, which is known for triggering contractions during childbirth. Researchers at the University of Queensland have developed a new type …", "url": "https://scitechdaily.com/pain-relief-without-addiction-researchers-develop-new-oxytocin-based-oral-drug/", "urlToImage": "https://scitechdaily.com/images/Young-Man-Stomach-Pain.jpg", "publishedAt": "2025-03-28T09:37:41Z", "content": "UQ scientists created gut-stable oxytocin-based pills to treat chronic abdominal pain safely and effectively, offering a new alternative to opioids and anti-inflammatories.\r\nResearchers have develope… [+3340 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Captures Neptune’s Long-Hidden Auroras in Stunning Detail - SciTechDaily", "description": "Long-Sought Auroral Glow Finally Emerges Under Webb’s Powerful Gaze Neptune lies in the cold, dark reaches of the outer edges of our solar system, about 3 billion miles from the Sun, at the farthest edge of the planetary lineup. Only one spacecraft has ever f…", "url": "https://scitechdaily.com/?p=465174", "urlToImage": "https://scitechdaily.com/images/Neptune-Auroras-Hubble-and-Webb-Image.jpg", "publishedAt": "2025-03-28T08:13:05Z", "content": "Neptune’s elusive auroras have finally been captured in stunning detail by NASA’s James Webb Space Telescope. Using its powerful infrared capabilities, scientists detected glowing auroral activity un… [+9240 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Ask Ethan: What does it mean to live in a quantum universe? - Big Think", "description": "Over a century after we first unlocked the secrets of the quantum universe, people find it more puzzling than ever. Can we make sense of it?", "url": "https://bigthink.com/starts-with-a-bang/live-quantum-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/12/3794835939_33f850bb40_o.jpg?resize=1200,630", "publishedAt": "2025-03-28T06:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Did Life Ever Exist on Venus? Scientists Develop New Equation to Find Out. - ScienceAlert", "description": "What drives us to send probes throughout the Solar System and rovers and landers to Mars? It's not cheap, and it's not easy.", "url": "https://www.sciencealert.com/did-life-ever-exist-on-venus-scientists-develop-new-equation-to-find-out", "urlToImage": "https://www.sciencealert.com/images/2025/03/venus_cloudtops_header.jpg", "publishedAt": "2025-03-28T03:17:03Z", "content": "What drives us to send probes throughout the Solar System and rovers and landers to Mars? It's not cheap, and it's not easy. It's because we live inside a big, natural puzzle, and we want to understa… [+7608 chars]"}, {"source": {"id": null, "name": "SpacePolicyOnline.com"}, "author": null, "title": "Artemis II on Track, But NASA Awaits Starship Milestones for Artemis III - SpacePolicyOnline.com", "description": "Posted: March 27, 2025 10:08 pm ET | Last Updated: March 27, 2025 10:11 pm ET | Lori Glaze, acting head of Exploration Systems Development at NASA, is optimistic that Artemis II will launch in April 2026, but SpaceX needs to achieve a number of Starship miles…", "url": "https://spacepolicyonline.com/news/artemis-ii-on-track-but-nasa-awaits-starship-milestones-for-artemis-iii/", "urlToImage": null, "publishedAt": "2025-03-28T03:08:00Z", "content": "NASA’s Artemis II crewed test flight is just over a year away.  That April 2026 mission appears to be on track, but questions remain about whether the next flight, Artemis III, will be ready to put a… [+8773 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Ginormous Claws Found in The Gobi Desert Belong to a Never-Before-Seen Species - ScienceAlert", "description": "A newly discovered species of feathered, bipedal dinosaur with \"exceptionally preserved and atypical hands\" had just two fingers, each one tipped with a gigantic, claw-like talon.", "url": "https://www.sciencealert.com/ginormous-claws-found-in-the-gobi-desert-belong-to-a-never-before-seen-species", "urlToImage": "https://www.sciencealert.com/images/2025/03/gr1_lrg-1.jpg", "publishedAt": "2025-03-28T02:46:16Z", "content": "A newly discovered species of feathered, bipedal dinosaur with \"exceptionally preserved and atypical hands\" had just two fingers, each one tipped with a gigantic, claw-like talon.\r\nA remarkable fossi… [+3927 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Giant 'Space Tornadoes' Discovered Raging in Milky Way's Turbulent Heart - ScienceAlert", "description": "In the absolute omnishambles of the Milky Way galactic center, we've just found a new kind of turbulent structure.", "url": "https://www.sciencealert.com/giant-space-tornadoes-discovered-raging-in-milky-ways-turbulent-heart", "urlToImage": "https://www.sciencealert.com/images/2021-09/processed/meerkat-gc_1024.jpg", "publishedAt": "2025-03-28T01:27:03Z", "content": "In the absolute omnishambles of the Milky Way galactic center, we've just found a new kind of turbulent structure.\r\nPeering into the Central Molecular Zone (CMZ) that surrounds the galactic supermass… [+4346 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Simple Way To Boost Students’ Math Scores - SciTechDaily", "description": "Researchers from Penn’s Behavior Change for Good Initiative, along with their collaborators, carried out am megastudy to explore whether low-cost, behaviorally-informed nudges could support teachers in boosting students' progress in math. American students ha…", "url": "https://scitechdaily.com/scientists-discover-simple-way-to-boost-students-math-scores/", "urlToImage": "https://scitechdaily.com/images/Good-Grade-Math-Test.jpg", "publishedAt": "2025-03-28T01:01:49Z", "content": "A large-scale study led by the University of Pennsylvania found that behaviorally informed email nudges to teachers slightly improved elementary students’ math progress, especially when messages incl… [+6693 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover Brain Growth Trigger Found Only in Humans - SciTechDaily", "description": "New insights have emerged into how the human brain develops. Two genes that are unique to humans work together to influence the development of the cerebrum, according to a recent study by researchers at the German Primate Center – Leibniz Institute for Primat…", "url": "https://scitechdaily.com/researchers-discover-brain-growth-trigger-found-only-in-humans/", "urlToImage": "https://scitechdaily.com/images/Chimpanzee-Brain-Organoid-scaled.jpg", "publishedAt": "2025-03-27T23:51:18Z", "content": "Microscopic image, section of an electroporated, genetically modified chimpanzee brain organoid. Cell nuclei in blue, progenitor cells in magenta, electroporated, genetically modified cells in green … [+2469 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Suggests Earth’s First Oceans Weren’t Blue: They Were Green - SciTechDaily", "description": "Scientists have discovered evidence that Earth's oceans were once green, hinting that this could be a marker of early life, both on our planet and potentially on alien worlds. Imagine the world’s oceans with their beautiful blue color. Now, imagine those same…", "url": "https://scitechdaily.com/new-research-suggests-earths-first-oceans-werent-blue-they-were-green/", "urlToImage": "https://scitechdaily.com/images/Green-Ocean-Iwo-Island.jpg", "publishedAt": "2025-03-27T21:33:40Z", "content": "The photo was taken by the research team on Iwo Island in the Satsunan Archipelago, Kyushu, in 2023. The team measured the underwater transmission spectrum, iron oxide concentration, and the cyanobac… [+4852 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Astronauts can survive a trip to Mars, but this vital organ will be permanently damaged - Earth.com", "description": "With evidence pointing to serious kidney challenges, careful planning will be needed to keep crews healthy on space journeys to Mars.", "url": "https://www.earth.com/news/astronauts-can-survive-mars-space-journey-but-their-kidneys-will-be-permanently-damaged/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/27145540/mars_humans_trip-survival_kidney-damage_spacecraft_1m.jpg", "publishedAt": "2025-03-27T21:03:58Z", "content": "Space journeys that stretch far beyond home are on the horizon. Crews heading for Mars will face conditions quite different from those on Earth, and researchers have been working to figure out what m… [+5505 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kimm Fesenmaier", "title": "New superconducting state discovered: Cooper-pair density modulation - Phys.org", "description": "Superconductivity is a quantum physical state in which a metal is able to conduct electricity perfectly without any resistance. In its most familiar application, it enables powerful magnets in MRI machines to create the magnetic fields that allow doctors to s…", "url": "https://phys.org/news/2025-03-superconducting-state-cooper-pair-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/team-finds-new-superco.jpg", "publishedAt": "2025-03-27T21:00:04Z", "content": "Superconductivity is a quantum physical state in which a metal is able to conduct electricity perfectly without any resistance. In its most familiar application, it enables powerful magnets in MRI ma… [+5232 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA cancels cargo launch to ISS due to damaged Cygnus spacecraft - Space.com", "description": "\"The International Space Station Program will continue working with Northrop Grumman to assess whether the Cygnus cargo module is able to safely fly to the space station on a future flight.\"", "url": "https://www.space.com/space-exploration/international-space-station/nasa-cancels-cargo-launch-to-iss-due-to-damaged-cygnus-spacecraft", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LEb27HseD2QYTH9weTakmN-1200-80.jpg", "publishedAt": "2025-03-27T21:00:00Z", "content": "NASA has called off a planned cargo mission to the International Space Station (ISS) due to a damaged spacecraft.\r\nThe spacecraft is a robotic Cygnus freighter, built by the Virginia-based company No… [+2299 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lehigh University", "title": "Nanostructured copper alloy rivals superalloys in strength and stability - Phys.org", "description": "Researchers from the U.S. Army Research Laboratory (ARL) and Lehigh University have developed a nanostructured copper alloy that could redefine high-temperature materials for aerospace, defense, and industrial applications.", "url": "https://phys.org/news/2025-03-nanostructured-copper-alloy-rivals-superalloys.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-material-gives-cop.jpg", "publishedAt": "2025-03-27T20:49:38Z", "content": "Researchers from the U.S. Army Research Laboratory (ARL) and Lehigh University have developed a nanostructured copper alloy that could redefine high-temperature materials for aerospace, defense, and … [+4821 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Forrest McFarland", "title": "'Spare' human bodies to be grown in artificial wombs & can serve as 'MEAT' - The US Sun", "description": "CUTTING-EDGE scientists have unveiled a disturbing plan to grow soulless “spare” human bodies that can be used for medical experiments and even meat. The so-called bodyoids would be gro…", "url": "https://www.the-sun.com/tech/13885342/spare-human-bodies-bodyoid-meat-grow-lab/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2025/03/JL_CADA-OP.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2025-03-27T20:27:20Z", "content": "CUTTING-EDGE scientists have unveiled a disturbing plan to grow soulless \"spare\" human bodies that can be used for medical experiments and even meat.\r\nThe so-called bodyoids would be grown in artific… [+3451 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "NASA's daredevil solar spacecraft survives 2nd close flyby of our sun - Space.com", "description": "\"This mission's trailblazing research is rewriting the textbooks on solar science by going to a place no human-made object has ever been.\"", "url": "https://www.space.com/the-universe/sun/nasas-daredevil-solar-spacecraft-survives-2nd-close-flyby-of-our-sun", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mfRCivryH64RDPokhYpWDj-1200-80.jpg", "publishedAt": "2025-03-27T20:26:40Z", "content": "NASA's Parker Solar Probe has successfully completed its second close flyby of the sun, the space agency announced earlier this week.\r\nThe car-sized spacecraft swooped within 8 million miles (6.1 mil… [+3592 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "So long, Gaia: Europe officially retires prolific star-mapping space telescope - Space.com", "description": "\"We will never forget Gaia, and Gaia will never forget us.\"", "url": "https://www.space.com/space-exploration/missions/so-long-gaia-europe-officially-retires-prolific-star-mapping-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TENadAxKbBJXGtkHEm4CnJ-1200-80.jpg", "publishedAt": "2025-03-27T20:00:00Z", "content": "Europe's star-mapping Gaia space observatory has entered its final orbit, after gathering valuable cosmic data for more than a decade.\r\nThe spacecraft's control team at the European Space Operations … [+3891 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Some birds use biofluorescence to attract mates, glowing in colors that humans can't see - Earth.com", "description": "Biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances.", "url": "https://www.earth.com/news/some-birds-use-biofluorescence-glowing-brightly-to-attract-mates-birds-of-paradise/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/27132123/bird-of-paradise_Paradisaea-guilielmi_Biofluorescence_mating_credit-Rene-Martin_1m.jpg", "publishedAt": "2025-03-27T19:38:31Z", "content": "Animals love to show off with color, especially when it comes to mating. Birds, in particular, often use bright feathers to catch the eye of a potential mate. But lately, scientists have noticed some… [+6106 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "They Thought It Was Just Ice… Then the Robot Sent Back These Images - The Daily Galaxy --Great Discoveries Channel", "description": "A robot vanished beneath Antarctica after capturing eerie, never-before-seen ice formations under the Dotson Ice Shelf. What it revealed before disappearing could reshape our understanding of how glaciers melt.", "url": "https://dailygalaxy.com/2025/03/they-thought-it-was-just-ice-then-the-robot-sent-back-these-images/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/They-Thought-It-Was-Just-Ice…-Then-the-Robot-Sent-Back-These-Images.jpg", "publishedAt": "2025-03-27T19:00:00Z", "content": "Scientists have unveiled unprecedented ice shapes under Antarcticas Dotson Ice Shelf, using an autonomous submersible called Ran. This first-of-its-kind mission has delivered high-resolution sonar ma… [+2946 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "2 newly found exoplanets reignite an outstanding question about our solar system - Space.com", "description": "Why don't we have a super-Earth or sun-Neptune?", "url": "https://www.space.com/the-universe/exoplanets/2-newly-found-exoplanets-reignite-an-outstanding-question-about-our-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mdKz6tXNPaqkMSMBitZrbc-1200-80.jpg", "publishedAt": "2025-03-27T19:00:00Z", "content": "Astronomers have discovered two new exoplanets that are similar to other worlds found in the Milky Way, but are unlike any in our own solar system.\r\nThe two exoplanets\r\n, or planets outside of our so… [+4955 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Horses Pulled Off a Genetic Trick Only Viruses Were Thought to Use - SciTechDaily", "description": "Scientists have discovered that horses owe their legendary stamina to a unique genetic mutation. This mutation supercharges energy production in muscle cells while cleverly keeping oxidative stress in check – a remarkable evolutionary hack that helps explain …", "url": "https://scitechdaily.com/?p=465173", "urlToImage": "https://scitechdaily.com/images/Horse-Galloping.jpg", "publishedAt": "2025-03-27T18:00:41Z", "content": "A genetic twist in horses allows them to convert a typical gene-stopping signal into a power-boosting feature, driving their elite stamina without causing cellular damage.\r\nScientists have discovered… [+3461 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Michigan", "title": "A genetic tree as a movie: Moving beyond the still portrait of ancestry - Phys.org", "description": "University of Michigan researchers have developed a statistical method that can be used for such wide-ranging applications as tracing your ancestry, modeling disease spread and studying how animals spread through geographic regions. Their results are publishe…", "url": "https://phys.org/news/2025-03-genetic-tree-movie-portrait-ancestry.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-genetic-tree-as-a-mo.jpg", "publishedAt": "2025-03-27T18:00:02Z", "content": "University of Michigan researchers have developed a statistical method that can be used for such wide-ranging applications as tracing your ancestry, modeling disease spread and studying how animals s… [+7992 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "23,000-Year-Old Footprints in New Mexico Reveal the Oldest Known Human Activity in North America - Indian Defence Review", "description": "A trail of 23,000-year-old footprints in New Mexico is rewriting the story of when—and how—humans first arrived in North America.", "url": "https://indiandefencereview.com/23000-year-old-footprints-in-new-mexico/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/23000-year-old-footprints-in-new-mexico-reveal-the-oldest-known-human-activity-in-north-america.jpg", "publishedAt": "2025-03-27T17:30:00Z", "content": "New research has confirmed what may be the oldest known evidence of humans in North Americaa set of 23,000-year-old fossilized footprints found in White Sands National Park, New Mexico. These prints,… [+3843 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "China sets dates for some of its most ambitious planetary missions - Ars Technica", "description": "These grand Chinese plans come as NASA faces budget cuts.", "url": "https://arstechnica.com/space/2025/03/china-sets-dates-for-some-of-its-most-ambitious-planetary-missions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/tianwen1_mars.jpg", "publishedAt": "2025-03-27T17:13:23Z", "content": null}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jeremy Gray", "title": "An Astrophotographer’s 20-Day Adventure Under the Darkest Skies in the World - PetaPixel", "description": "'It was a unique experience,' astrophotographer Mihail Minkov says of his incredible 20-day journey in South America.", "url": "https://petapixel.com/2025/03/27/an-astrophotographers-20-day-adventure-under-the-darkest-skies-in-the-world/", "urlToImage": "https://petapixel.com/assets/uploads/2025/03/mihail-minkov-south-america-trip-2025-featured.jpg", "publishedAt": "2025-03-27T17:00:05Z", "content": "Award-winning astrophotographer Mihail Minkov recently returned home to Bulgaria following an incredible 20-day journey across South America, where Minkov visited some of the world’s most spectacular… [+8737 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mysterious Microbes Dug These Tunnels Millions of Years Ago - The Daily Galaxy --Great Discoveries Channel", "description": "Beneath desert stone, scientists have uncovered ancient tunnels likely carved by unknown microbes. What kind of life could have left such a mark millions of years ago?", "url": "https://dailygalaxy.com/2025/03/microbes-dug-tunnels-millions-years-ago/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Mysterious-Microbes-Dug-These-Tunnels-Millions-of-Years-Ago.jpg", "publishedAt": "2025-03-27T17:00:00Z", "content": "A discovery in the deserts of Namibia, Oman, and Saudi Arabia has opened new doors in the world of geomicrobiology. Mysterious micro-burrows carved into ancient marble and limestone have been uncover… [+3271 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Meet Enaiposha: The New Planet That Defies What We Know About Our Solar System - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a new exoplanet, Enaiposha, that challenges everything we thought we knew about mini-Neptunes. With its thick, haze-filled atmosphere and signs of carbon dioxide, this super-Venus could reshape how we understand planetary evolution.", "url": "https://dailygalaxy.com/2025/03/enaiposha-new-planet-solar-system/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Meet-Enaiposha-The-New-Planet-That-Defies-What-We-Know-About-Our-Solar-System.jpg", "publishedAt": "2025-03-27T16:30:00Z", "content": "Astronomers have recently unveiled an extraordinary discovery in the cosmos: a new exoplanet named Enaiposha, located 47 light-years from our solar system. Initially thought to be a mini-Neptune, thi… [+3007 chars]"}, {"source": {"id": null, "name": "Sustainability-times.com"}, "author": "Steeve Lapierre", "title": "\"Miracle in the Pacific\": This massive 1,000-mile life-saving rescue of an ocean-stranded sailor defies all odds - Sustainability Times", "description": "IN A NUTSHELL 🚁 The 129th Rescue Wing executed a perilous mission to save a patient 500 miles off the coast of San Francisco. 🌊 Equipped with HC-130J aircraft and HH-60G helicopters, the team demonstrated expertise in open-ocean rescues. 🗣️ Communication w…", "url": "https://www.sustainability-times.com/in-depth/miracle-in-the-pacific-this-massive-1000-mile-life-saving-rescue-of-an-ocean-stranded-sailor-defies-all-odds/", "urlToImage": "https://www.sustainability-times.com/wp-content/uploads/2025/03/miracle-in-the-pacific-this-massive-1000-mile-life-saving-rescue-of-an-ocean-stranded-sailor-defies-all-odds.jpg", "publishedAt": "2025-03-27T15:50:42Z", "content": "<table><tr><td>IN A NUTSHELL</td></tr><tr><td><ul><li> The 129th Rescue Wing executed a perilous mission to save a patient 500 miles off the coast of San Francisco.</li><li> Equipped with HC-130J air… [+6290 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Neanderthal Faces Were Bigger Than Ours. Turns Out We’re the Weirdos - Gizmodo", "description": "By comparing modern human, Neanderthal, and chimpanzee skulls, researchers have uncovered a unique trait having to do with our faces.", "url": "https://gizmodo.com/neanderthal-faces-were-bigger-than-ours-turns-out-were-the-weirdos-2000581553", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/human-versus-neanderthal-face.jpg", "publishedAt": "2025-03-27T15:27:01Z", "content": "While closely related, Neanderthals and modern humans split from our last common ancestor between 650,000 and 500,000 years ago and evolved into distinct species. Among other contrasts, Neanderthal f… [+3752 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Finding Clues in Ruins of Ancient Dead Star With NASA’s Chandra - NASA", "description": "People often think about archaeology happening deep in jungles or inside ancient pyramids. However, a team of astronomers has shown that they can use stars", "url": "https://www.nasa.gov/image-article/finding-clues-in-ruins-of-ancient-dead-star-with-nasas-chandra/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/j1655-illus.jpg", "publishedAt": "2025-03-27T15:15:02Z", "content": "People often think about archaeology happening deep in jungles or inside ancient pyramids. However, a team of astronomers has shown that they can use stars and the remains they leave behind to conduc… [+5327 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Robert Sanders-UC Berkeley", "title": "Watch: Robot leaps and lands like a squirrel - Futurity: Research News", "description": "No robot can match a squirrel’s ability to leap from limb to limb—until now. Check out video of the robot in action.", "url": "https://www.futurity.org/salto-robot-jumping-landing-squirrels-3274772/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2025/03/squirrel-jump-land-robot-1600.jpg", "publishedAt": "2025-03-27T14:55:54Z", "content": "Based on studies of leaping squirrels, researchers have designed a robot that can stick a landing on a branch.\r\nEngineers have designed robots that crawl, swim, fly, and even slither like a snake, bu… [+8298 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Archaeology Breakthrough Reveals Interbreeding Between Two Species at the Root of Human Origins - Indian Defence Review", "description": "The interbreeding event contributed around 20% of modern human DNA, with these genes predominantly found in regions associated with brain function and neural", "url": "https://indiandefencereview.com/interbreeding-between-species-root-human/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/a-cast-of-a-neanderthal-skul.jpg", "publishedAt": "2025-03-27T14:35:00Z", "content": "A recent study from Cambridge University has revealed new insights into human evolution, casting doubt on the long-standing belief about the origins of Homo sapiens. According to the research, publis… [+4596 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Earth’s Longest Volcanic Ridge Is on the Move—and Scientists Didn’t See It Coming - The Daily Galaxy --Great Discoveries Channel", "description": "A massive volcanic ridge hidden beneath the Indian Ocean is drifting—and scientists now say it may upend decades of what we thought we knew about Earth’s tectonic past.", "url": "https://dailygalaxy.com/2025/03/earths-longest-volcanic-ridge-on-the-move/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Earths-Longest-Volcanic-Ridge-Is-on-the-Move—and-Scientists-Didnt-See-It-Coming.jpg", "publishedAt": "2025-03-27T14:30:00Z", "content": "A massive volcanic ridge beneath the Indian Ocean has just delivered a major surprise to geologists. According to a new study published in Nature Communications, the Kerguelen hotspotthe volcanic sou… [+3272 chars]"}, {"source": {"id": null, "name": "Sustainability-times.com"}, "author": "Darunee Sukanan", "title": "\"Elon Musk lit up the sky\": A mysterious blue spiral stuns Europe as SpaceX fuel dump creates dazzling celestial vortex - Sustainability Times", "description": "IN A NUTSHELL 🌌 A mysterious blue spiral appeared in the skies over Europe, sparking widespread interest and speculation. 🚀 The phenomenon was linked to a SpaceX rocket, specifically the release of its fuel at high altitudes, which froze and reflected sunli…", "url": "https://www.sustainability-times.com/in-depth/elon-musk-lit-up-the-sky-a-mysterious-blue-spiral-stuns-europe-as-spacex-fuel-dump-creates-dazzling-celestial-vortex/", "urlToImage": "https://www.sustainability-times.com/wp-content/uploads/2025/03/a-celestial-mystery-unfolds-a-dazzling-blue-spiral-amazes-onlookers-as-it-lights-up-the-skies-over-france-this-week.jpg", "publishedAt": "2025-03-27T14:03:45Z", "content": "<table><tr><td>IN A NUTSHELL</td></tr><tr><td><ul><li> A mysterious blue spiral appeared in the skies over Europe, sparking widespread interest and speculation.</li><li> The phenomenon was linked to … [+5421 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rebeka Selmeczki", "title": "New discovery promises to reveal hidden black holes across the universe - Phys.org", "description": "Scientists have detected radio signals from hot gas surrounding a supermassive black hole that existed 12.9 billion years ago, according to new research published in Nature Astronomy from an international team of scientists including researchers from The Aust…", "url": "https://phys.org/news/2025-03-discovery-reveal-hidden-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-discovery-promises.jpg", "publishedAt": "2025-03-27T13:24:03Z", "content": "Scientists have detected radio signals from hot gas surrounding a supermassive black hole that existed 12.9 billion years ago, according to new research published in Nature Astronomy from an internat… [+3473 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National Radio Astronomy Observatory", "title": "Small star, mighty flares: ALMA shares new view of Proxima Centauri - Phys.org", "description": "At a distance of just over four light years, Proxima Centauri is our nearest stellar neighbor and is known to be a very active M dwarf star. Its flare activity has been well-known to astronomers using visible wavelengths of light, but a new study using observ…", "url": "https://phys.org/news/2025-03-small-star-mighty-flares-alma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/small-star-mighty-flar.jpg", "publishedAt": "2025-03-27T12:48:03Z", "content": "At a distance of just over four light years, Proxima Centauri is our nearest stellar neighbor and is known to be a very active M dwarf star. Its flare activity has been well-known to astronomers usin… [+4892 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Archaeologists Discover Forgotten Foods Hidden in 15,000-Year-Old Kitchens - SciTechDaily", "description": "Microscopic plant residues found on bedrock metates offer new insights into the diets and cultural practices of ancient Indigenous communities in the American West. The mortar, pestle, and cutting board in your kitchen are modern descendants of ancient tools …", "url": "https://scitechdaily.com/archaeologists-discover-forgotten-foods-hidden-in-15000-year-old-kitchens/", "urlToImage": "https://scitechdaily.com/images/Lisbeth-Loutderback-Extracting-Plant-Residue-scaled.jpg", "publishedAt": "2025-03-27T11:11:36Z", "content": "Anthropologist Lisbeth Loutderback extracting plant residues from a metate at an archaeological site on public land in southcentral Oregon. Credit: Stefania Wilks, University of Utah\r\nMicroscopic pla… [+6587 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "US breakthrough recycles stubborn tire waste into high-value material - Interesting Engineering", "description": "US researchers developed a groundbreaking method to recycle rubber waste into epoxy resins, offering a sustainable solution to tire disposal.", "url": "https://interestingengineering.com/science/scientists-recycle-tire-waste-into-high-value-material", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/03/Plastic-rubber.jpg", "publishedAt": "2025-03-27T10:25:00Z", "content": "The resulting amine-modified poly-dienes can be used to create epoxy resins, which are widely used in adhesives, coatings, and composites and have strength comparable to commercial resins.\r\nIt is fas… [+682 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DNA Microscopy Creates 3D Maps of Life From the Inside Out - SciTechDaily", "description": "What if you could take a picture of every gene inside a living organism—not with light, but with DNA itself? Scientists at the University of Chicago have pioneered a revolutionary imaging technique called volumetric DNA microscopy. It builds intricate 3D maps…", "url": "https://scitechdaily.com/dna-microscopy-creates-3d-maps-of-life-from-the-inside-out/", "urlToImage": "https://scitechdaily.com/images/DNA-Microscopy-Creates-3D-Maps-of-Life.jpg", "publishedAt": "2025-03-27T10:00:39Z", "content": "A new 3D genetic imaging method uses DNA itself to map out the molecular structure inside living organisms. This breakthrough could unlock new insights into cancer, immunity, and development. (Artist… [+5013 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "When's the next 'parade of planets'? The past, present and future of planetary alignments - Space.com", "description": "Just how rare are planetary alignments?", "url": "https://www.space.com/stargazing/when-is-next-planetary-parade-how-rare-are-they", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ovF3rpHvPJFANYSdQrbnnB-1200-80.jpg", "publishedAt": "2025-03-27T10:00:00Z", "content": "The recent and much-ballyhooed \"planetary parade\r\n\" was an interesting celestial event that likely spurred even infrequent skywatchers to seek out the seven planets stretched out across the sky.\r\nSom… [+9940 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Sheon Han", "title": "Inside arXiv—the Most Transformative Platform in All of Science - WIRED", "description": "Modern science wouldn’t exist without the online research repository known as arXiv. Three decades in, its creator still can’t let it go.", "url": "https://www.wired.com/story/inside-arxiv-most-transformative-code-science/", "urlToImage": "https://media.wired.com/photos/67daacb4360bbd90c85131e2/191:100/w_1280,c_limit/reverse-diptych.jpg", "publishedAt": "2025-03-27T10:00:00Z", "content": "On the librarys side, some people thought Ginsparg was too hands-on. Others said he wasnt patient enough. A good lower-level manager, according to someone long involved with arXiv, but his sense of m… [+7583 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Unknown physics may help dark energy act as 'antigravity' throughout the universe - Space.com", "description": "\"There are more questions than answers at this point.\"", "url": "https://www.space.com/the-universe/unknown-physics-may-help-dark-energy-act-as-antigravity-throughout-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2Tz372nbuLMBGDYZuV4vkF-1200-80.png", "publishedAt": "2025-03-27T09:00:00Z", "content": "Dark energy could have an accomplice that helps it slow the growth of large cosmic structures, such as vast superclusters made up of clusters of galaxies.\r\nA new analysis of astronomical data suggest… [+8509 chars]"}]}