{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Older Than Stonehenge? Groundbreaking Discovery at “Unusual” Ancient Burial Site Rewrites Neolithic History - SciTechDaily", "description": "New research reveals that Flagstones in Dorset dates back to 3,200 BC, offering new insight into the origins of monumental architecture in the Neolithic period. Archaeological research at the prehistoric Dorset burial site known as Flagstones has identified i…", "url": "https://scitechdaily.com/older-than-stonehenge-groundbreaking-discovery-at-unusual-ancient-burial-site-rewrites-neolithic-history/", "urlToImage": "https://scitechdaily.com/images/Flagstones-Enclosure-Reconstruction.jpg", "publishedAt": "2025-04-06T21:22:13Z", "content": "Flagstones enclosure seen shortly after construction in the middle Neolithic period. Credit: Reconstruction by Jennie Anderson\r\nNew research reveals that Flagstones in Dorset dates back to 3,200 BC, … [+4099 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "AI proves that fingerprints are not unique, upending the legal system - Earth.com", "description": "Fingerprints have long been the cornerstone of law enforcement, linking suspects to crimes. Now, AI has disrupted this 100-year-old system.", "url": "https://www.earth.com/news/ai-proves-that-fingerprints-are-not-unique-shattering-long-held-belief-legal-implications/", "urlToImage": "https://cff2.earth.com/uploads/2024/01/03130557/fingerprints-not-unique_AI-analysis_legal-issues_1m.jpg", "publishedAt": "2025-04-06T20:32:43Z", "content": "Fingerprint analysis has been a dependable tool in crime-solving for more than a century. Investigators lean on fingerprint evidence to identify suspects or connect them to specific crime scenes, bel… [+5536 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Worst Fear? Martian Dust Is Way Deadlier Than You Think - The Daily Galaxy", "description": "Astronomers have spotted a mysteriously “dead” galaxy that stopped forming stars just 700 million years after the Big Bang. Its discovery is shaking up everything we thought we knew about how galaxies evolve.", "url": "https://dailygalaxy.com/2025/04/nasas-worst-fear-martian-dust-is-way-deadlier-than-you-think/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/NASAs-Worst-Fear-Martian-Dust-Is-Way-Deadlier-Than-You-Think.jpg", "publishedAt": "2025-04-06T17:00:00Z", "content": "With ambitions for human missions to Mars gaining momentum, scientists are raising red flags over a stealthy and potentially dangerous adversary: Martian dust. Recent research reveals that the planet… [+2685 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Lingamgunta Nirmitha Rao", "title": "New study reveals why North America is slowly ‘dripping’ into Earth's mantle - Hindustan Times", "description": "Geodynamic models say deep mantle flow from the long-subducted Farallon slab is likely behind the massive underground “drips” forming beneath North America. | World News", "url": "https://www.hindustantimes.com/world-news/new-study-reveals-why-north-america-is-slowly-dripping-into-earths-mantle-101743952810245.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2025/04/06/1600x900/north_america_1743954224188_1743954224454.png", "publishedAt": "2025-04-06T16:49:23Z", "content": "A new study led by researchers at the University of Texas at Austin has revealed that an ancient piece of Earth's crust buried deep beneath the Midwest is actively drawing down large sections of toda… [+3372 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Were Earth’s First Continents Born in Cosmic Chaos? New Study Sheds Light on Early Crust Formation - The Daily Galaxy", "description": "Earth’s primordial crust didn’t need tectonics to form its continental traits—and new research reveals why. Dive into the surprising role of early cosmic collisions in shaping our planet.", "url": "https://dailygalaxy.com/2025/04/were-earths-first-continents-cosmic-chaos/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Earths-First-Continents-Were-Born-in-Cosmic-Chaos.jpg", "publishedAt": "2025-04-06T16:30:00Z", "content": "Earths earliest crust, formed over 4.5 billion years ago, has long been thought to have lacked the complex chemical features associated with continental crust. However, a recent study published in Na… [+3760 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Channels “Stopped in Time” Reveal How We Think and Learn - SciTechDaily", "description": "Scientists used advanced cryo-EM imaging to reveal how glutamate activates brain receptors, paving the way for new neurological treatments. To better understand how brain cells communicate using chemical signals, scientists have used a highly specialized micr…", "url": "https://scitechdaily.com/brain-channels-stopped-in-time-reveal-how-we-think-and-learn/", "urlToImage": "https://scitechdaily.com/images/AMPA-Receptor-and-Glutamate.jpg", "publishedAt": "2025-04-06T15:25:34Z", "content": "Illustration of an AMPA receptor and glutamate. Credit: Edward Twomey, Johns Hopkins Medicine\r\nScientists used advanced cryo-EM imaging to reveal how glutamate activates brain receptors, paving the w… [+4209 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "35 Years Later, Hubble’s Latest Image Still Leaves Astronomers Speechless - The Daily Galaxy", "description": "A vibrant cluster of newborn stars is tearing through a nearby galaxy — and Hubble just captured it in unprecedented detail. What these stellar giants are doing might change how we understand the early universe.", "url": "https://dailygalaxy.com/2025/04/hubble-latest-image/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/35-Years-Later-Hubbles-Latest-Image-Still-Leaves-Astronomers-Speechless.jpg", "publishedAt": "2025-04-06T15:00:00Z", "content": "On the occasion of the 35th anniversary of the NASA/ESA Hubble Space Telescope, astronomers have unveiled a striking new image of NGC 346, a vigorous star-forming region located in the Small Magellan… [+3201 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "When two neutron stars collide, very bad things happen - Earth.com", "description": "Kilonova explosions from neutron star collisions may damage atmospheres and threaten life if nearby, according to a new study.", "url": "https://www.earth.com/news/when-two-neutron-stars-collide-kilonova-explosion-very-bad-things-happen/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/06083318/kilonova-event_xray-spectrum_NASA_1.jpg", "publishedAt": "2025-04-06T14:38:17Z", "content": "There has been a growing focus on celestial explosions called kilonova events. These eruptions happen when two dense stars, known as neutron stars, crash into each other and release bursts of matter,… [+6075 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "Lyrid meteor shower 2025 peaks this month: Could we be in for a surprise outburst this year? - Space.com", "description": "The Lyrids are also known for occasional surprises.", "url": "https://www.space.com/stargazing/meteors-showers/lyrid-meteor-shower-2025-peaks-this-month-could-we-be-in-for-a-surprise-outburst-this-year", "urlToImage": "https://cdn.mos.cms.futurecdn.net/m9RpqpqegqjAhuDFw9Ldmk-1200-80.jpg", "publishedAt": "2025-04-06T14:00:00Z", "content": "After a lull of some three and a half months, enthusiasts who watch the night sky specifically for \"shooting\" or \"falling\" stars will have something to look forward to this month. It will be the retu… [+7341 chars]"}, {"source": {"id": null, "name": "The-express.com"}, "author": "Hannah Broughton", "title": "'Once-in-a-lifetime' star explosion set to be visible from earth - Daily Express US", "description": "A cosmic marvel is on the brink of unfolding, as astronomers eagerly await the explosive spectacle of T Coronae Borealis, a star system 3,000 lightyears away.", "url": "https://www.the-express.com/news/space-news/168288/once-in-a-lifetime-star-explosion-blaze-nasa-nova-astronomers", "urlToImage": "https://cdn-images.the-express.com/img/dynamic/16/1200x630/354425.jpg", "publishedAt": "2025-04-06T12:57:41Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Adam Kovac", "title": "Miso Fermented in Space Has an Entirely Different Taste - Gizmodo", "description": "The experiment could go a long way towards helping space travelers make their own nutritious, delicious ingredients.", "url": "https://gizmodo.com/miso-fermented-in-space-has-an-entirely-different-taste-2000584531", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/space-miso-fermentation-food-experiment-iss.jpg", "publishedAt": "2025-04-06T12:00:23Z", "content": "Forget chalky freeze-dried ice cream or some individually packaged mashed potatoes. Astronauts aboard the International Space Station have now proved that delectable fermented delicacies like the Jap… [+3641 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "‘Dancing molecule’ therapy regenerates damaged cartilage within a few hours - The Brighter Side of News", "description": "Cartilage loss is a key factor in osteoarthritis, a disease that impacts nearly 530 million people leading to the breakdown of joint tissues.", "url": "https://www.thebrighterside.news/health/dancing-molecule-therapy-regenerates-damaged-cartilage-within-a-few-hours", "urlToImage": "https://www.thebrighterside.news/uploads/2025/04/knee-cartilage.webp?auto=webp&width=2000&height=1334", "publishedAt": "2025-04-06T11:52:00Z", "content": "A new therapy that first made headlines in 2021 is now showing potential to heal human cartilage. Developed by scientists at Northwestern University, the technique was initially created to repair spi… [+6529 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Reveal Why the Human Face Is Smaller Than a Neanderthal’s - SciTechDaily", "description": "Facial growth stops at puberty in Homo sapiens. Humans differ from chimpanzees and Neanderthals in how their faces grow. In humans, facial growth slows down during childhood and stops after adolescence. This is mainly due to a decrease in skull bone cell acti…", "url": "https://scitechdaily.com/scientists-reveal-why-the-human-face-is-smaller-than-a-neanderthals/", "urlToImage": "https://scitechdaily.com/images/CT-Scan-Neanderthal-Fossil-and-Human.jpg", "publishedAt": "2025-04-06T11:44:29Z", "content": "Left: computed tomographic (CT) scan of a Neanderthal fossil (La Ferrassie 1). Right: CT scan of a modern human. Credit: Philipp Gunz, License: CC BY-NC-ND 4.0\r\nFacial growth stops at puberty in Homo… [+2104 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Avery Schuyler Nunn, Grist", "title": "World’s ‘Loneliest Whale’ Might Be a Sterile Hybrid—and a Dire Warning - Gizmodo", "description": "A mysterious whale that has puzzled scientists for decades may not be an anomaly, but a clue to what climate change is doing beneath the waves.", "url": "https://gizmodo.com/worlds-loneliest-whale-might-be-a-sterile-hybrid-and-a-dire-warning-sign-2000583975", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Blue_whale_tail.jpg", "publishedAt": "2025-04-06T10:00:32Z", "content": "Almost 40 years ago, deep in the Pacific, a single voice called out a song unlike any other. The sound reverberated through the depths at 52 Hertz, puzzling those listening to this solo ringing out f… [+8014 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "How bacteria could help build and maintain cities on the moon - Space.com", "description": "An experiment designed to test the technique could launch on India's first crewed space mission.", "url": "https://www.space.com/the-universe/moon/how-bacteria-could-help-build-and-maintain-cities-on-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/djEGcnwA8UYPSfQgXqdkVP-1200-80.jpg", "publishedAt": "2025-04-06T10:00:00Z", "content": "If all goes to plan, scientists may someday begin building outposts on the moon — and some experts believe that these outposts could be constructed with bricks made out of lunar regolith. And now, a … [+5016 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Century-Old Cosmic Mystery Solved – Four Hidden Planets Found Near Earth - SciTechDaily", "description": "Astronomers have confirmed the existence of four rocky planets orbiting Barnard’s Star, our nearest solitary stellar neighbor just six light-years away. Using ultra-sensitive instruments, scientists detected subtle wobbles in the star’s light caused by the gr…", "url": "https://scitechdaily.com/a-century-old-cosmic-mystery-solved-four-hidden-planets-found-near-earth/", "urlToImage": "https://scitechdaily.com/images/Exoplanets-Orbiting-Barnards-Star-scaled.jpg", "publishedAt": "2025-04-06T08:26:37Z", "content": "This artist’s concept pictures the planets orbiting Barnard’s Star, as seen from close to the surface of one of them. Credit: International Gemini Observatory/NOIRLab/NSF/AURA/P. Marenfeld\r\nAstronome… [+4441 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 28 Starlink satellites to orbit from Florida's Space Coast (video, photos) - Space.com", "description": "The mission launched Saturday (April 5) at 11:07 p.m. ET.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-28-starlink-satellites-to-orbit-from-floridas-space-coast-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Z9vrvBBjE2WbuAQ6iyPekT-1200-80.jpg", "publishedAt": "2025-04-06T05:24:34Z", "content": "SpaceX sent another big batch of its Starlink internet satellites to orbit from Florida on Saturday night (April 5).\r\nA Falcon 9 rocket carrying 28 Starlink craft lifted off from Cape Canaveral Space… [+1525 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Bizarre “Immortal” Creature Could Hold the Secret to Reversing Aging - SciTechDaily", "description": "Uncovering the secrets behind their immortality could provide valuable insights into aging in mammals, including humans. As we age, the body undergoes natural changes, including the gradual loss of neurons and muscle mass, along with a decline in fertility an…", "url": "https://scitechdaily.com/?p=467789", "urlToImage": "https://scitechdaily.com/images/Clock-Aging-Time-Old.jpg", "publishedAt": "2025-04-06T03:28:14Z", "content": "Regenerating planarians can reverse signs of aging, offering insights into whole-organism age reversal that may extend to other species.\r\nUncovering the secrets behind their immortality could provide… [+3689 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Americans once again make headlines in computing with the discovery of a “quantum highway” that raises great hopes. - Farmingdale Observer", "description": "A major breakthrough in quantum computing has just been achieved by American researchers at MIT. This innovation, dubbed the “quantum superhighway”, revolutionizes communication between quantum processors and opens up promising new prospects for the developme…", "url": "https://farmingdale-observer.com/2025/04/05/americans-once-again-make-headlines-in-computing-with-the-discovery-of-a-quantum-highway-that-raises-great-hopes/", "urlToImage": null, "publishedAt": "2025-04-06T02:36:00Z", "content": "A major breakthrough in quantum computing has just been achieved by American researchers at MIT. This innovation, dubbed the quantum superhighway, revolutionizes communication between quantum process… [+3934 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "Denial At The Space Symposium - NASA Watch", "description": "For all of you Space Symposium fans who think we're on the verge", "url": "https://nasawatch.com/trumpspace/denial-at-the-space-symposium/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/04/Screenshot-2025-04-05-at-8.09.43 PM.png", "publishedAt": "2025-04-06T00:15:55Z", "content": "Heat map of the U.S. Stock market at the close of trading on 4 April 2025. \r\nKeith’s note: For all of you Space Symposium fans who think we’re on the verge of a commerce golden age in space or that U… [+267 chars]"}, {"source": {"id": null, "name": "Newsnationnow.com"}, "author": "Ashley N. Soriano", "title": "New ecosystem found after Chicago-sized chunk of Antarctica breaks off - NewsNation", "description": "They found animal and marine life as deep as nearly 4,300 feet. The species in the newly discovered ecosystem include crustaceans, sponges, corals and octopus.", "url": "https://www.newsnationnow.com/world/new-ecosystem-found-after-chicago-sized-chunk-of-antarctica-breaks-off/", "urlToImage": "https://www.newsnationnow.com/wp-content/uploads/sites/108/2025/04/FKt250110-20250126-IceScanningCollectionAndIcebergViewing-Ingle-0202.jpg?w=1280", "publishedAt": "2025-04-05T23:22:36Z", "content": "(NewsNation) An ecosystem in Antarctica may have existed for hundreds of years, researchers learned after an iceberg the size of Chicago broke off the continent, exposing an area previously inaccessi… [+2261 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "New discovery identifies the billion-year-old source of Earth’s water - AOL.com", "description": "Water is essential to life, yet its true origin on Earth still stirs debate. Scientists have long wondered whether it came from icy comets, rocky asteroids, ...", "url": "https://www.thebrighterside.news/post/researchers-discover-the-origin-of-earths-water-billions-of-years-ago-2/", "urlToImage": "https://media.zenfs.com/en/the_brighter_side_of_news_971/96765586f5ec1bfd275fb7db007f4d19", "publishedAt": "2025-04-05T23:17:09Z", "content": "Water is essential to life, yet its true origin on Earth still stirs debate. (CREDIT: NASA)\r\nWater is essential to life, yet its true origin on Earth still stirs debate. Scientists have long wondered… [+6484 chars]"}, {"source": {"id": null, "name": "Snopes.com"}, "author": "Jordan Liles", "title": "Striking image and video of 'Steeple Mountain' on Jupiter's moon Io are concept art — but authentic pics do exist - Snopes", "description": "", "url": "https://www.snopes.com//news/2025/04/05/steeple-mountain-jupiter-io-image/", "urlToImage": "https://mediaproxy.snopes.com/width/1200/https://media.snopes.com/2025/04/steeple_mountain_jupiter_io.jpg", "publishedAt": "2025-04-05T23:01:37Z", "content": "In March and April 2025, internet users shared a striking image that they claimed showed \"Steeple Mountain,\" a massive point of interest on Jupiter's moon Io.\r\nFor example, one X user posted (archive… [+4495 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rivaling TNT: Scientists Discover Bizarre “Magic Molecules” With Explosive Potential - SciTechDaily", "description": "Skoltech scientists discovered over 200 carbon-oxygen compounds with high energy potential, some rivaling TNT, offering new insights into non-nitrogen-based explosives and applications in energy, space, and chemical research. Skoltech researchers have conduct…", "url": "https://scitechdaily.com/rivaling-tnt-scientists-discover-bizarre-magic-molecules-with-explosive-potential/", "urlToImage": "https://scitechdaily.com/images/Explosive-Molecules-Chemistry.jpg", "publishedAt": "2025-04-05T22:51:20Z", "content": "Skoltech researchers have identified over 220 carbon-oxygen compounds, many previously unknown, with some showing explosive energy close to that of TNT, despite lacking nitrogen. Their findings on ox… [+5534 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Dying Cells Play a Vital, Unexpected Role in Healing, Study Shows - ScienceAlert", "description": "A new study reveals some surprising discoveries about healing processes that are potentially triggered by the process of necrosis, or premature cell death.", "url": "https://www.sciencealert.com/dying-cells-play-a-vital-unexpected-role-in-healing-study-shows", "urlToImage": "https://www.sciencealert.com/images/2025/03/DrosophilaWing.jpg", "publishedAt": "2025-04-05T20:01:22Z", "content": "A new study reveals some surprising discoveries about healing processes that are potentially triggered by the process of necrosis, or premature cell death.\r\nNecrosis can be triggered by illness or in… [+3071 chars]"}, {"source": {"id": null, "name": "County10.com"}, "author": "Scott Fuller", "title": "Prehistoric site discovered near Dubois tells 230 million-year-old tale - County 10", "description": "(Dubois, WY) – Just outside of Dubois, a team of scientists has uncovered a 230-million-year-old mass grave of giant amphibians. Known as the Nobby Knob bonebed, this fossil site is now the oldest known gathering of Buettnererpeton bakeri – a crocodile-sized,…", "url": "https://county10.com/prehistoric-site-discovered-near-dubois-tells-230-million-year-old-tale/", "urlToImage": "https://cdn.county10.com/cdn-cgi/image/quality=80,format=auto,onerror=redirect,metadata=none/wp-content/uploads/2025/04/Nobby-Knob-Dig.jpg", "publishedAt": "2025-04-05T19:45:00Z", "content": "(Dubois, WY) – Just outside of Dubois, a team of scientists has uncovered a 230-million-year-old mass grave of giant amphibians. Known as the Nobby Knob bonebed, this fossil site is now the oldest kn… [+1099 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Incredible photo shows supermassive black hole blowing a jet of matter into interstellar space - Live Science", "description": "This galaxy's central black hole appears to be a \"messy eater\" as its interstellar scraps are strewn into space.", "url": "https://www.space.com/the-universe/galaxies/incredible-photo-shows-supermassive-black-hole-blowing-a-jet-of-matter-into-interstellar-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/35c22wPzi2xH3wHhJus7g6-1200-80.jpg", "publishedAt": "2025-04-05T19:00:00Z", "content": "A distant galaxy is home to a ravenous supermassive black hole that appears to be playing with its food in a lively new image from the Very Large Telescope.\r\nLocated over 12 million light-years from … [+3162 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Razvan Calin", "title": "Car Nut Has Countless Brand-New Toys in Garage, Drives Dad's 12-Year-Parked 1977 Camaro RS - autoevolution", "description": "The classic Chevy was abandoned when the former owner had a heart attack; there’s a ’79 Z28 in there, together with a huge surprise collection of iconic models", "url": "https://www.autoevolution.com/news/car-nut-has-countless-brand-new-toys-in-garage-drives-dad-s-12-year-parked-1977-camaro-rs-249522.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/car-nut-has-countless-brand-new-toys-in-garage-dad-s-1977-camaro-rs-is-out-after-12-years-249522_1.jpg", "publishedAt": "2025-04-05T17:52:34Z", "content": "The seventies started under shady auspices for the Camaro's second iteration, with delays in production marring its debut year and dropping sales almost by 50% compared to 1969. Numbers tanked and hi… [+5440 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Cardiac arrest deaths among marathoners have decreased, study finds - The Washington Post", "description": "The study authors credit early bystander CPR and the immediate use of AED devices for the increased survival rate.", "url": "https://www.washingtonpost.com/health/2025/04/05/marathon-running-cardiac-arrest-cpr/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GKVUIGO42J5IMDSTMJV6NJ74OI_size-normalized.jpg&w=1440", "publishedAt": "2025-04-05T17:30:13Z", "content": "Though more people are participating in long-distance-running events than ever before, a recent analysis found that the incidence of cardiac arrest among those running such races remains stable and d… [+1752 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Euclid Captures 26 Million Galaxies in Its First Glimpse of the Dark Universe - SciTechDaily", "description": "Euclid is on a quest to unravel one of the universe’s greatest mysteries: why it's expanding faster and faster. With help from NASA, this space telescope is capturing sweeping views of billions of galaxies, allowing scientists to peer into the deep past. Usin…", "url": "https://scitechdaily.com/euclid-captures-26-million-galaxies-in-its-first-glimpse-of-the-dark-universe/", "urlToImage": "https://scitechdaily.com/images/Galaxies-in-Different-Shapes-Captured-by-Euclid-scaled.jpg", "publishedAt": "2025-04-05T17:03:07Z", "content": "This image shows examples of galaxies in different shapes, all captured by Euclid during its first observations of the Deep Field areas. Credit: ESA/Euclid/Euclid Consortium/NASA, image processing by… [+9585 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Unveil Sustainable Solution to Vitamin B12 Deficiency - SciTechDaily", "description": "Scientists have bioengineered Spirulina to produce active vitamin B12, previously found only in animal products, offering a sustainable, carbon-neutral alternative to meat and dairy. New research published in Discover Food highlights a breakthrough in biotech…", "url": "https://scitechdaily.com/scientists-unveil-sustainable-solution-to-vitamin-b12-deficiency/", "urlToImage": "https://scitechdaily.com/images/Vitamin-B12-Paper.jpg", "publishedAt": "2025-04-05T15:54:19Z", "content": "Researchers have engineered Spirulina to produce carbon-neutral biomass containing active vitamin B12 at levels similar to beef meat, potentially offering a sustainable alternative to animal-based fo… [+4472 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Biochemists Uncover How Cells Eliminate RNA Splicing Errors - SciTechDaily", "description": "Heidelberg biochemists and structural biologists from Shanghai unravel the roles of two key regulatory factors in mRNA splicing. Two molecular control factors play a key role in splicing, the process by which precursor messenger RNA (pre-mRNA) is cut and reas…", "url": "https://scitechdaily.com/biochemists-uncover-how-cells-eliminate-rna-splicing-errors/", "urlToImage": "https://scitechdaily.com/images/Quality-Control-Spliceosome.jpg", "publishedAt": "2025-04-05T14:45:25Z", "content": "Aided by two molecular control factors, the spliceosome rejects pre-mRNA that could be incorrectly spliced. While GPATCH1 detects the defective pre-mRNA, DHX35 removes it from the spliceosome, which … [+4435 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Fram2 astronaut mission's West Coast splashdown opens new era for SpaceX - Space.com", "description": "From here on out, all SpaceX Dragons will come back to Earth off the Pacific coast.", "url": "https://www.space.com/space-exploration/private-spaceflight/fram2-astronaut-missions-west-coast-splashdown-opens-new-era-for-spacex", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nDbMg8yDthtcDzNg2pXJ7M-1200-80.jpg", "publishedAt": "2025-04-05T14:00:10Z", "content": "The West Coast is the best coast for Dragon landings, at least in SpaceX's books.\r\nThe company's four-person Fram2 mission came to a successful end on Friday (April 4) with the splashdown of the Crew… [+2142 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Two Dead Stars, Just 150 Light Years Away, Are Set to Explode - The Daily Galaxy", "description": "Astronomers have uncovered a rare binary star system, located just 150 light-years away, where two white dwarf stars are destined to collide. When these stars eventually explode in 23 billion years, the supernova will outshine the moon by ten times, providing…", "url": "https://dailygalaxy.com/2025/04/two-dead-stars-are-set-to-explode/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Two-Dead-Stars-Just-150-Light-Years-Away-Are-Set-to-Explode.jpg", "publishedAt": "2025-04-05T14:00:00Z", "content": "Astronomers have uncovered an extraordinary discovery in the cosmos: a binary star system consisting of two white dwarf stars, located just 150 light-years away from Earth. These stars are on a colli… [+2539 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "The moon joins Mars and Jupiter in a 'mini planet parade' tonight. Here's how to see it - Space.com", "description": "Mars and the moon will also be in conjunction tonight.", "url": "https://www.space.com/stargazing/the-moon-joins-mars-and-jupiter-in-a-mini-planet-parade-tonight-heres-how-to-see-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8toPVyJ7m5SemP4mSbPRVb-1200-80.jpg", "publishedAt": "2025-04-05T13:00:00Z", "content": "If you're lucky enough to have clear skies tonight, you can catch a \"mini planet parade\" as Mars and Jupiter appear alongside a half-lit moon in the southwestern sky.\r\nAll three bodies will be visibl… [+2024 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "New NASA Space Telescope Unveils Its First-Ever Images - ScienceAlert", "description": "SPHEREx stands for the Spectro-Photometer for the History of the Universe, Epoch of Reionization, and Ices Explorer.", "url": "https://www.sciencealert.com/new-nasa-space-telescope-unveils-its-first-ever-images", "urlToImage": "https://www.sciencealert.com/images/2025/04/SPHERExNASAinfraredTelescopeFirstPics.jpg", "publishedAt": "2025-04-05T12:03:13Z", "content": "SPHEREx stands for the Spectro-Photometer for the History of the Universe, Epoch of Reionization, and Ices Explorer.\r\nYou can see why NASA came up with a natty name for it! It's their new infrared sp… [+3491 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lydia Smith", "title": "Northern giant mouse lemur: The bug-eyed fluff ball with the biggest testicles of all known primates - Live Science", "description": "If humans had a similar body ratio to the northern giant mouse lemur, their testicles would be the size of grapefruits.", "url": "https://www.livescience.com/animals/northern-giant-mouse-lemur-the-bug-eyed-fluff-ball-with-the-biggest-testicles-of-all-known-primates", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ad4UJJStyqkgvWisBgCnGj-1200-80.jpg", "publishedAt": "2025-04-05T12:00:00Z", "content": "Name: Northern giant mouse lemur (Mirza zaza)\r\nWhere it lives: NorthernMadagascar\r\nWhat it eats: Fruits, flowers, nectar, tree sap and small insects\r\nWhy it's awesome: Northern giant mouse lemurs may… [+2682 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Say There May Be Life on the Moon - Futurism", "description": "The permanently shadowed regions of the Earth's Moon could shelter microbial lifeforms, according to new research.", "url": "https://futurism.com/scientists-life-on-moon", "urlToImage": "https://wordpress-assets.futurism.com/2025/04/scientists-life-on-moon.jpg", "publishedAt": "2025-04-05T10:00:50Z", "content": "The dark nooks and crannies of the lunar surface just might harbor life, according to new research.\r\nIn a preprint study presented at the 56th Lunar and Planetary Science Conference last month, scien… [+2698 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Meet 'Nighthawk': Mars helicopter mission could be big leap for exploration - Space.com", "description": "A proposed Mars helicopter mission would search for signs of life, water and future human footholds in a vast volcanic canyon network.", "url": "https://www.space.com/the-universe/mars/meet-nighthawk-mars-helicopter-mission-could-be-big-leap-for-exploration", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GhcwqSwUHK7fGe78K9B47C-1200-80.jpg", "publishedAt": "2025-04-05T10:00:00Z", "content": "The little Ingenuity drone proved that helicopters can play a revolutionary role in Mars exploration. Now, NASA is thinking ahead to bigger and better things.\r\nOn the back of the success of Ingenuity… [+3520 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Anish Vij", "title": "The Moon is moving away from the Earth and is causing shocking changes to time - Yahoo News UK", "description": "The Moon is slowly spinning away from Earth", "url": "https://www.ladbible.com/news/science/moon-moving-away-earth-effects-044418-20250405", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Vx177CC7Py3S9I44HOEwVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/ladbible_826/789fa7ee29434acde72d3f1d1f0827ca", "publishedAt": "2025-04-05T09:59:25Z", "content": "The Moon is, very slowly, moving away from the Earth and one day, it's going to impact time as we know it.\r\nThe reason why it's been gradually pulling away from our planet is all because of gravity a… [+2581 chars]"}, {"source": {"id": null, "name": "MassLive.com"}, "author": "Ryan Mancini | RMancini@masslive.com", "title": "Ever wonder how Mass. looks from space? Here’s 10 photos from Earth’s orbit - MassLive.com", "description": "From radar imaging to photos shot aboard space shuttles, here's a collection of NASA's photos of Massachusetts taken since the 1970s.", "url": "https://www.masslive.com/weather/2025/04/say-cheese-here-are-10-photos-of-massachusetts-from-space.html", "urlToImage": "https://www.masslive.com/resizer/v2/QYRBPQJ6PREVLLI4RFXA7KF24Q.jpg?auth=23b6eff465a80dd96664b98bc8d000f11957b138d5a5a926d4716c768781b1cb&width=1280&quality=90", "publishedAt": "2025-04-05T09:20:00Z", "content": "With a peninsula coming out of its side like a fishing hook, Massachusetts is easy to distinguish when viewed from space. \r\nOnce one of the original 13 colonies before the founding of the United Stat… [+1580 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Maryland", "title": "Young plants' vulnerability linked to growth-energy trade-off - Phys.org", "description": "From toddlers in daycare to seedlings in forests, young organisms tend to get sick more easily than adults—a phenomenon that has long puzzled parents and scientists alike.", "url": "https://phys.org/news/2025-04-young-vulnerability-linked-growth-energy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-reveal-why-1.jpg", "publishedAt": "2025-04-05T08:43:56Z", "content": "From toddlers in daycare to seedlings in forests, young organisms tend to get sick more easily than adultsa phenomenon that has long puzzled parents and scientists alike.\r\nUniversity of Maryland biol… [+5205 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Iain Thomson", "title": "NASA doubles odds of Moon hitting near-Earth asteroid - theregister.com", "description": ": Heads up to those living on lunar base in 2032: DUCK!!", "url": "https://www.theregister.com/2025/04/05/nasa_moon_asteroid/", "urlToImage": "https://regmedia.co.uk/2025/04/04/shutterstock_moon_asteroid.jpg", "publishedAt": "2025-04-05T07:18:00Z", "content": "The likelihood of asteroid 2024 YR4 hitting the Moon, during Christmas 2032, has more than doubled.\r\nThe space rock made headlines in February when it was said to be the most dangerous object of its … [+2307 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "iain.todd@ourmedia.co.uk", "title": "Want to know what it sounds like on Mars? You can, courtesy of this NASA rover and its powerful microphones - BBC Sky at Night Magazine", "description": "What does Mars sound like? Scientists have learnt a lot about how sound behaves on Mars versus Earth, and what that tells us about the planet.", "url": "https://www.skyatnightmagazine.com/space-missions/sound-on-mars", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2025/04/sound-on-mars.jpg?w=1200", "publishedAt": "2025-04-05T05:32:56Z", "content": "As humanity edges closer to stepping foot on Mars at least, according to NASA and the private space sector the multiple questions surrounding life on the Red Planet seem ever more relevant.\r\nCan we g… [+4539 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Pandora Dewan", "title": "Science news this week: AI lies and North America's 'dripping' crust - Live Science", "description": "April 5, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/physics-mathematics/science-news-this-week-ai-lies-and-north-americas-dripping-crust", "urlToImage": "https://cdn.mos.cms.futurecdn.net/N92eR8nercPcRU2fWTqf27-1200-80.png", "publishedAt": "2025-04-05T04:01:06Z", "content": "Artificial intelligence (AI) fundamentally lacks our human capacity for making creative mental connections\r\n, new research has found, and this could be a serious problem if we are to rely on AI-based… [+6222 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Real-Life Monster: Scientists Discover Strange Wasp From 99 Million Years Ago - SciTechDaily", "description": "A 99-million-year-old wasp species used a Venus flytrap-like abdomen to capture prey and may represent a new insect family, revealing unexpected diversity in ancient parasitoid behavior. An extinct lineage of parasitic wasps from the mid-Cretaceous period, pr…", "url": "https://scitechdaily.com/real-life-monster-scientists-discover-strange-wasp-from-99-million-years-ago/", "urlToImage": "https://scitechdaily.com/images/Sirenobethylus-charybdis-scaled.jpg", "publishedAt": "2025-04-05T02:34:55Z", "content": "Holotype of Sirenobethylus charybdis. Credit: Qiong Wu\r\nA 99-million-year-old wasp species used a Venus flytrap-like abdomen to capture prey and may represent a new insect family, revealing unexpecte… [+2541 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "NASA finds 'glass-smooth lake of cooling lava' on Jupiter's moon Io - Earth.com", "description": "Io is an incredibly active and extreme place, with glistening lava lakes and volcanic eruptions shooting sulfur and magma to huge heights.", "url": "https://www.earth.com/news/nasa-finds-glass-smooth-lake-of-cooling-lava-on-jupiters-moon-io/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/04181323/Io_lava-lake_jupiter-moon_juno-mission_NASA_1m.jpg", "publishedAt": "2025-04-05T00:36:28Z", "content": "Among all of the moons in our solar system, Jupiter’s Io, stands out for many reasons. Io is an incredibly active and extreme place, with glistening lava lakes and volcanic eruptions sending sulfur a… [+6580 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "Awe-inspiring first: Astronomers capture Jupiter's response to a massive solar wind strike - AOL.com", "description": "Jupiter’s skies can glow with lights more intense than anything on Earth. Its polar auroras shine when charged particles crash into its upper atmosphere, cre...", "url": "https://www.thebrighterside.news/post/awe-inspiring-first-astronomers-captured-jupiters-response-to-a-massive-solar-wind-strike/", "urlToImage": "https://media.zenfs.com/en/the_brighter_side_of_news_971/e7ffac7a6f15e03b7002cece3bd1350b", "publishedAt": "2025-04-04T18:07:00Z", "content": "Jupiter's atmosphere heats globally after solar wind slam, changing how scientists see giant planets. (CREDIT: NASA, ESA, and J. Nichols (University of Leicester))\r\nJupiters skies can glow with light… [+8166 chars]"}]}