{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "The Seattle Times"}, "author": "Catalina Gaitán", "title": "Once-in-a-lifetime comet to be visible in Seattle starting Saturday - The Seattle Times", "description": "The soaring \"snowy dirtball\" known as Tsuchinshan-ATLAS will be visible on clear nights until Halloween. For the next visit, you'll have to wait 80,000 years.", "url": "https://www.seattletimes.com/news/once-in-a-lifetime-comet-to-be-visible-in-seattle-starting-saturday/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2024/10/10082024_tzr2_tzr_183226.jpg?d=1200x630", "publishedAt": "2024-10-09T00:39:49Z", "content": "Stargazing Seattleites could get a once-in-800-centuries chance to see Comet Tsuchinshan-ATLAS on the horizon on Saturday as long as the clouds cooperate.\r\nPeople should be able to see the spectacle,… [+2601 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "The threat of solar storms explained - BBC.com", "description": "What damage could ferocious solar explosions wreak on our vulnerable planet?", "url": "https://www.bbc.com/reel/video/p0jd9cnj/the-threat-of-solar-storms-explained", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024xn/p0jwgt75.jpg", "publishedAt": "2024-10-09T00:04:39Z", "content": null}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2024-10-08T22:24:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "NBC Chicago"}, "author": "NBC Chicago Staff", "title": "Northern Lights may be visible again in Illinois Tuesday - NBC Chicago", "description": "A day after the Northern Lights lit up the skies over Illinois, the spectacle may be visible again as charged particles continue hitting Earth’s atmosphere.", "url": "https://www.nbcchicago.com/weather/northern-lights-may-be-visible-again-in-illinois-tuesday/3568392/", "urlToImage": "https://media.nbcchicago.com/2024/05/NORTH-LIGHTS-CT.jpg?quality=85&strip=all&resize=1200%2C675", "publishedAt": "2024-10-08T22:15:22Z", "content": "A day after the Northern Lights lit up the skies over Illinois, the spectacle may be visible again as charged particles continue hitting Earths atmosphere.\r\nAccording to the Space Weather Prediction … [+2143 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Record-breaking ancient spinning galaxy challenges cosmic evolution theories - Space.com", "description": "'Seeing a galaxy with such similarities to our own Milky Way, that is strongly rotation-dominated, challenges our understanding of how quickly galaxies in the early universe evolve into the orderly galaxies of today's cosmos.'", "url": "https://www.space.com/the-universe/record-breaking-ancient-galaxy-challenges-cosmic-evolution-theories", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QYfzrpcQoXWyw74zWnbHr9-1200-80.png", "publishedAt": "2024-10-08T22:00:05Z", "content": "The most distant and thus earliest rotating disk galaxy ever spotted has surprised astronomers and could challenge our theories of galactic evolution. Not only does it seemingly exist too early in th… [+5037 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "John Sharp", "title": "Launch Roundup: Starship to fly? Europa Clipper – Hurricane delays, Falcon 9s on hold - NASASpaceflight.com", "description": "SpaceX plans a SpaceX Starship-Super Heavy launch on Sunday, Oct. 13, pending regulatory approval. This…", "url": "https://www.nasaspaceflight.com/2024/10/launch-roundup-100824/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/10/IMG_1913.jpeg", "publishedAt": "2024-10-08T20:38:26Z", "content": "25SpaceX plans a SpaceX Starship-Super Heavy launch on Sunday, Oct. 13, pending regulatory approval. This will be the fifth test flight of the full Starship-Super Heavy stack and the first attempt at… [+7262 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "How Long Will Life Exist on Earth? - Slashdot", "description": "An anonymous reader shares a report: Wikipedia's \"Timeline of the Far Future\" is one of my favorite webpages from the internet's pre-slop era. A Londoner named Nick Webb created it on the morning of December 22, 2010. \"Certain events in the future of the univ…", "url": "https://news.slashdot.org/story/24/10/08/1114222/how-long-will-life-exist-on-earth", "urlToImage": "https://a.fsdn.com/sd/topics/earth_64.png", "publishedAt": "2024-10-08T20:15:43Z", "content": "Wikipedia's \"Timeline of the Far Future\" is one of my favorite webpages from the internet's pre-slop era. A Londoner named Nick Webb created it on the morning of December 22, 2010. \"Certain events in… [+1884 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Immune Response Linked to Lewy Body Formation - Neuroscience News", "description": "New research reveals that immune responses play a crucial role in the formation of Lewy bodies, protein aggregates that mark Parkinson's disease and other neurological conditions.", "url": "https://neurosciencenews.com/immune-response-lewy-bodies-27812/", "urlToImage": "https://neurosciencenews.com/files/2024/10/lewy-body-immune-response-neuroscience.jpg", "publishedAt": "2024-10-08T19:57:26Z", "content": "Summary: New research reveals that immune responses play a crucial role in the formation of Lewy bodies, protein aggregates that mark Parkinson’s disease and other neurological conditions. Using huma… [+6072 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Zo Ahmed", "title": "NASA laser-based data transmission demonstrates serviceable internet 290 million miles from Earth - TechSpot", "description": "In late July, the Deep Space Optical Communications (DSOC) transmitted laser data across 290 million miles from the Psyche spacecraft back to Earth. That's roughly the maximum...", "url": "https://www.techspot.com/news/105054-nasa-laser-comms-demonstrates-serviceable-internet-290-million.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/10/2024-10-08-image-22.jpg", "publishedAt": "2024-10-08T19:22:00Z", "content": "Pushing the envelope: NASA is boldly going where no one has gone before with laser communications. The space agency's Deep Space Optical Communications experiment hitched a ride on the Psyche asteroi… [+2495 chars]"}, {"source": {"id": null, "name": "YourTango"}, "author": "Jen Anderson", "title": "The Silly Phrase That Stops Every Argument With My Husband - YourTango", "description": "Arguments can ruin a marriage. Here's one silly phrase writer Jen Anderson uses to end every argument with her husband.", "url": "https://www.yourtango.com/love/silly-phrase-that-stops-arguments-with-husband", "urlToImage": "https://www.yourtango.com/sites/default/files/image_blog/2024-10/phrase-end-argument-husband.png", "publishedAt": "2024-10-08T18:07:12Z", "content": "I come by my hot temper honestly. In more than 40 years of marriage, my parents have honed their arguing skills so well they could win an Olympic gold medal in couples bickering. Growing up, I was su… [+4571 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "NASA’s Next Big Thing: These Space Telescopes Could Reveal the Secrets of Black Holes - Gizmodo", "description": "NASA selected two space observatory proposals for additional review, and one is expected to be cleared for a 2032 launch.", "url": "https://gizmodo.com/one-of-these-two-space-observatories-could-be-nasas-next-big-thing-2000509113", "urlToImage": "https://gizmodo.com/app/uploads/2024/10/swift-observatory.jpg", "publishedAt": "2024-10-08T17:45:27Z", "content": "Last week, NASA selected two mission proposals for further review, paving the way for one of them to eventually be made into a real nuts-and-bolts spacecraft.\r\nThese proposals come out of NASA’s Expl… [+2890 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Terry Eliasen, Exec. Weather Producer", "title": "The Draconid meteor shower peaks tonight. Here's where to look in Massachusetts. - CBS Boston", "description": "The Draconid meteor shower peaks tonight. Here's when and where you should look for a chance to see meteors.", "url": "https://www.cbsnews.com/boston/news/draconid-meteor-shower-location/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/08/3a3f8159-506e-4369-8c90-2515e6ea4c02/thumbnail/1200x630/3174287ca111bdee309021ccf4f8c7a9/draconid-meteor-shower.jpg?v=3a0e65dbe151135b3f2e1627f423e21b", "publishedAt": "2024-10-08T16:53:06Z", "content": "BOSTON - The Draconid meteor shower peaks tonight. While this is not typically one of the better shows of the year, there are a few reasons why you shouldn't completely write this one off if you're v… [+1956 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": null, "title": "Why the James Webb Space Telescope has been a gift to humanity - Salon", "description": "Astrophysicist Ethan Siegel explained why government investments have made scientific discoveries possible", "url": "https://www.salon.com/2024/10/08/why-the-james-webb-space-telescope-has-been-a-gift-to-humanity/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2022/10/james_webb_telescope_and_pillars_of_creation_nasa.jpg", "publishedAt": "2024-10-08T16:52:00Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jacek Krywko", "title": "Comb jellies can fuse to heal injuries - Ars Technica", "description": "Ctenophores merge with neighbors at wound sites, making animals with duplicate parts.", "url": "https://arstechnica.com/science/2024/10/injured-comb-jellies-can-fuse-into-a-single-organism/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-1471271102.jpg", "publishedAt": "2024-10-08T16:38:09Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Richard Pallardy", "title": "Ancient piece of driftwood hidden for thousands of years could hold secrets for combating climate change - Livescience.com", "description": "A 3,775-year-old log found in Canada had barely lost any of its carbon content since being buried, indicating \"wood vaulting\" is a viable means of carbon storage.", "url": "https://www.livescience.com/planet-earth/climate-change/ancient-piece-of-driftwood-hidden-for-thousands-of-years-could-hold-secrets-for-combating-climate-change", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vGS3eRiYiBKMPFu8P7ACoP-1200-80.jpg", "publishedAt": "2024-10-08T16:27:29Z", "content": "A really old and remarkably well-preserved log buried almost 4,000 years ago provides key evidence to support a simple and effective way of locking away carbon to reduce greenhouse gas emissions — bu… [+3975 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Nasa astronaut captures timelapse of auroras from space - BBC.com", "description": "Astronaut Matthew Dominick filmed the phenomenon from the Dragon Endeavour spacecraft.", "url": "https://www.bbc.com/news/videos/ckg01913nxqo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/b21a/live/3a7b6620-859d-11ef-83dd-fbf1b9732cf0.jpg", "publishedAt": "2024-10-08T16:09:28Z", "content": "Astronaut Matthew Dominick filmed the phenomenon from the Dragon Endeavour spacecraft, while a Chicago photographer captured the lights dancing over the city.\r\nThe spectacle is rarely visible from po… [+495 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Abbey A. Donaldson", "title": "Journey Through Stars with NASA in New Minecraft Game - NASA", "description": "NASA invites gamers, educators, and students to grab their pickaxe and check out its latest collaboration with Minecraft exploring a new world inspired by the", "url": "https://www.nasa.gov/learning-resources/hubble-new-minecraft-game/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/nasa-jw-still01-1920x1080-1.png", "publishedAt": "2024-10-08T16:00:16Z", "content": "NASA invites gamers, educators, and students to grab their pickaxe and check out its latest collaboration with Minecraft exploring a new world inspired by the agencys James Webb Space Telescope. The … [+2767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Trinity College Dublin", "title": "Physics team uncovers a quantum Mpemba effect with a host of 'cool' implications - Phys.org", "description": "Initially investigating out of pure curiosity, researchers have made a discovery that bridges the gap between Aristotle's observations two millennia ago and modern-day understanding, while opening the door to a whole host of \"cool\"—and \"cooling\"—implications.", "url": "https://phys.org/news/2024-10-physics-team-uncovers-quantum-mpemba.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/physics-team-uncovers.jpg", "publishedAt": "2024-10-08T15:55:04Z", "content": "Initially investigating out of pure curiosity, researchers have made a discovery that bridges the gap between Aristotle's observations two millennia ago and modern-day understanding, while opening th… [+5006 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Astronauts Stranded in Space Due to Hurricane Milton - Futurism", "description": "Four people were meant to head home from the ISS this week on a SpaceX shuttle — and are now stuck thanks to Hurricane Milton.", "url": "https://futurism.com/the-byte/astronauts-stranded-hurricane-milton", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/astronauts-stranded-hurricane-milton.jpg", "publishedAt": "2024-10-08T15:31:53Z", "content": "At least they have lots of company up there.\r\nStorm Surge\r\nThree astronauts and one cosmonaut were scheduled to head home this week on board a SpaceX spacecraft.\r\nBut thanks to the dangerous mega sto… [+1957 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "“Billionaires, Fund A Mission To The Ice Giants”: Prof Brian Cox On New 'Solar System' Series - IFLScience", "description": "We spoke to Brian Cox about his new BBC series exploring the many peculiar worlds in our corner of the universe.", "url": "https://www.iflscience.com/billionaires-fund-a-mission-to-the-ice-giants-prof-brian-cox-on-new-solar-systems-series-76267", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76267/aImg/79352/triton-meta.jpg", "publishedAt": "2024-10-08T15:30:25Z", "content": "Where in space would you explore if money were no object? What burning scientific question would you want to see answered? Professor Brian Cox has a clear answer about that. He would like to send two… [+3643 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cranfield University", "title": "With advanced scanning technique, confiscated Iron Age Iranian swords proven to be pastiches - Phys.org", "description": "For the first time, an imaging method has been used to investigate Iron Age bronze Iranian swords, revealing significant modern modifications that prove the weapons have been altered to increase their commercial value in the illicit antiquities market.", "url": "https://phys.org/news/2024-10-advanced-scanning-technique-confiscated-iron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/confiscated-iron-age-i.jpg", "publishedAt": "2024-10-08T15:11:03Z", "content": "For the first time, an imaging method has been used to investigate Iron Age bronze Iranian swords, revealing significant modern modifications that prove the weapons have been altered to increase thei… [+4818 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Bennu Asteroid Data Reveals Clues to Life’s Origins and a Potential Fifth Force of the Universe - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s OSIRIS-REx mission has provided groundbreaking insights into asteroid Bennu, revealing key clues about the origins of life on Earth and the potential existence of a fifth fundamental force in the universe. By analyzing Bennu’s composition, researchers …", "url": "https://dailygalaxy.com/2024/10/bennu-asteroid-data-fifth-force-universe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/NASAs-OSIRIS-REx-Mission-Offers-New-Insights-into-Asteroid-Bennu-and-The-Universe.jpg", "publishedAt": "2024-10-08T15:00:34Z", "content": "NASAs OSIRIS-REx mission, which successfully returned a sample from the near-Earth asteroid Bennu in 2023, has provided significant new insights into both the asteroids composition and the broader wo… [+7800 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Ryugu sample analyses show asteroids may have delivered compounds needed to start life on Earth - Phys.org", "description": "An international team of researchers with a wide range of backgrounds has found evidence of asteroids providing the compounds necessary for life to get its start on Earth. In their paper published in the journal Nature Astronomy, the group describes their stu…", "url": "https://phys.org/news/2024-10-ryugu-sample-analyses-asteroids-compounds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/ryugu-sample-analyses.jpg", "publishedAt": "2024-10-08T14:47:01Z", "content": "An international team of researchers with a wide range of backgrounds has found evidence of asteroids providing the compounds necessary for life to get its start on Earth. In their paper published in… [+2626 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Investigating Asteroid Material as Potential Food Source for Astronauts - The Daily Galaxy --Great Discoveries Channel", "description": "A new study from researchers at Western University's Institute for Earth and Space Exploration explores the possibility of using asteroid material to grow edible biomass for astronauts on long-duration space missions. By feeding bacteria carbon-rich compounds…", "url": "https://dailygalaxy.com/2024/10/asteroid-material-food-source-astronauts/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/Investigating-Asteroid-Material-as-Potential-Food-Source-for-Astronauts.jpg", "publishedAt": "2024-10-08T14:30:14Z", "content": "Scientists are exploring the possibility of turning asteroid material into a viable food source for astronauts on long-duration space missions. Researchers from Western University's Institute for Ear… [+5923 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Ashley Balzer", "title": "NASA’s Roman Space Telescope’s ‘Exoskeleton’ Whirls Through Major Test - NASA", "description": "A major component of NASA’s Nancy Grace Roman Space Telescope just took a spin on the centrifuge at NASA’s Goddard Space Flight Center in Greenbelt, Maryland.", "url": "https://www.nasa.gov/missions/roman-space-telescope/nasas-roman-space-telescopes-exoskeleton-whirls-through-major-test/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/oba-copy-1.jpg", "publishedAt": "2024-10-08T14:21:51Z", "content": "A major component of NASAs Nancy Grace Roman Space Telescope just took a spin on the centrifuge at NASAs Goddard Space Flight Center in Greenbelt, Maryland. Called the Outer Barrel Assembly, this pie… [+4044 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chris McMullen", "title": "We've spent years reviewing telescopes: This telescope Prime Day deal is ideal for beginners - Space.com", "description": "Are you new to stargazing or buying for a budding sky-watcher? The Celestron AstroMaster 102AZ is a superb starter telescope and it's 20% off for Prime Day.", "url": "https://www.space.com/we-spent-years-reviewing-telescopes-this-prime-day-deal-perfect-for-beginner-astronomers-october-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Q6GhvpjfTCLkAotEHETC8W-1200-80.jpg", "publishedAt": "2024-10-08T14:20:04Z", "content": "The Celestron AstroMaster 102AZ is a great budget telescope, suitable for beginners and enthusiastic amateurs. It's also great if you don't have time to mess around setting up; we think it's the best… [+3323 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Todd Feathers", "title": "Collider in the Sea: A Particle Accelerator Spanning the Gulf of Mexico Could Unlock New Physics - Gizmodo", "description": "Texas A&M University professor Peter McIntyre and his colleagues want to build a particle accelerator around the rim of the Gulf of Mexico in order to discover the most fundamental building blocks of the universe.", "url": "https://gizmodo.com/collider-in-the-sea-a-particle-accelerator-spanning-the-gulf-of-mexico-could-unlock-new-physics-2000508442", "urlToImage": "https://gizmodo.com/app/uploads/2024/10/gulf-of-mexico.jpg", "publishedAt": "2024-10-08T14:09:09Z", "content": "In 2012, scientists at the European Organization for Nuclear Research, known as CERN, proved the existence of the Higgs boson, the elementary particle that grants other particles their mass. The disc… [+9298 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX rocket snaps amazing views of Earth during Hera asteroid probe launch (photos) - Space.com", "description": "A Falcon 9 upper stage got some gorgeous, faraway looks at our planet.", "url": "https://www.space.com/spacex-falcon-9-hera-launch-earth-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FtWKyWbwtbLgGjFU4az4ic-1200-80.jpg", "publishedAt": "2024-10-08T14:00:33Z", "content": "A SpaceX Falcon 9 rocket snapped a pretty special in-space selfie on Monday (Oct. 7).\r\nThe shot, captured during the launch of the European Space Agency's Hera asteroid-inspecting mission, shows a go… [+2240 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Claire Levin", "title": "Webb allows researchers to use new method of finding atmospheres in distant planets - Phys.org", "description": "It is a major goal of astronomical research to find planets other than Earth that might be suitable for sustaining life. There are a number of factors which many scientists agree are essential to a planet being habitable, but an important one is whether or no…", "url": "https://phys.org/news/2024-10-webb-method-atmospheres-distant-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/researchers-use-new-me.jpg", "publishedAt": "2024-10-08T13:57:47Z", "content": "It is a major goal of astronomical research to find planets other than Earth that might be suitable for sustaining life. There are a number of factors which many scientists agree are essential to a p… [+5514 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Do Boys and Girls See Fairness Differently? - Neuroscience News", "description": "A new study explores how young children perceive fairness and act on it, revealing nuanced gender differences in sharing behaviors.", "url": "https://neurosciencenews.com/neurodevelopment-sharing-psychology-27807/", "urlToImage": "https://neurosciencenews.com/files/2024/10/sharing-neurodevelopment-neuroscience.jpg", "publishedAt": "2024-10-08T13:49:00Z", "content": "Summary: A new study explores how young children perceive fairness and act on it, revealing nuanced gender differences in sharing behaviors. Researchers found that girls tend to show more compassion … [+6230 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Mussel-inspired sticky bacteria breaks down tough plastic waste faster - Interesting Engineering", "description": "The engineered bacteria exhibited a 400-fold increase in adhesion to PET substrates when tested at 37 degrees Celsius.", "url": "https://interestingengineering.com/science/mussel-inspired-sticky-bacteria-breaks-down-tough-plastic-waste-faster", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/iStock-1190512184-2.jpg", "publishedAt": "2024-10-08T13:16:00Z", "content": "Biofouling happens when microorganisms, plants, algae, and small animals attach to submerged surfaces. This can cause damage to ships’ hulls, underwater structures, and pipes, leading to increased ma… [+706 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Jupiter's moon, Io – the most volcanic world in the solar system - BBC - BBC", "description": "Share your videos with friends, family, and the world", "url": "https://www.youtube.com/watch?v\\\\u003dB5FMk3MLTDI", "urlToImage": null, "publishedAt": "2024-10-08T13:00:14Z", "content": null}, {"source": {"id": null, "name": "LA Magazine"}, "author": "Chris Nichols", "title": "L.A. Gets a Second Space Shuttle and You Can Join the Motorcade - Los Angeles Magazine", "description": "The disco-era protoype \"Inspiration\" will cruise the streets of Downey en route to the Columbia Memorial Science Center", "url": "https://lamag.com/news/la-gets-a-second-space-shuttle-and-you-can-join-the-motorcade", "urlToImage": "https://lamag.com/.image/t_share/MjA5NzUxNjU1NDEzOTgyNjcz/062-orbitermock-updei.jpg", "publishedAt": "2024-10-08T13:00:00Z", "content": "The Space Shuttle prototype \"Inspiration\" in 1974\r\nCourtesy Columbia Memorial Space Center\r\nIt’s missing a wing and the tail is a little janky, but jaws are sure to drop when a giant space shuttle cr… [+4446 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Archaeologists found an ancient Egyptian observatory - Ars Technica", "description": "Expedition leader: “Everything we found shattered our expectations.”…", "url": "https://arstechnica.com/science/2024/10/archaeologists-found-an-ancient-egyptian-observatory/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/astro1.jpg", "publishedAt": "2024-10-08T12:15:07Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "4 futuristic space technologies — and when they might happen - Space.com", "description": "Solar farms in orbit, nuclear power on the moon, space elevators and interstellar travel — which might we see happen first?", "url": "https://www.space.com/future-space-technologies-world-space-week", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kZ7Wsso69UWWmfzPXpUcvb-1200-80.jpg", "publishedAt": "2024-10-08T12:00:01Z", "content": "World Space Week this year, which runs between Oct. 4 and Oct. 10,is celebrating how space technology is aiding us in our fight against climate change\r\n on Earth — but sometimes it pays to also look … [+12893 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Research suggests Earth's oldest continental crust is disintegrating - Phys.org", "description": "Earth's continental configurations have changed dramatically over its billions of years' history, transforming not only their positions across the planet, but also their topography as expansion and contraction of the crust made a mark on the landscape. Some a…", "url": "https://phys.org/news/2024-10-earth-oldest-continental-crust-disintegrating.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/earths-oldest-continen.jpg", "publishedAt": "2024-10-08T11:44:25Z", "content": "Models of North China Craton deformation since the middle Jurassic, showing phases of flat slab subduction (a, b) and rollback (c, d). Key: overriding plate (O), downgoing plate (D), trench (T), lead… [+5883 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Largest-Ever Planetary Spacecraft Set for Launch Towards Jupiter to Study the Ocean Moon of Europa - Good News Network", "description": "It's been a long time coming for this spacecraft, and Director of NASA's Jet Propulsion Laboratory says it's akin to a \"modern cathedral.\"", "url": "https://www.goodnewsnetwork.org/largest-ever-planetary-spacecraft-set-for-launch-towards-jupiter-to-study-the-ocean-moon-of-europa/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2024/10/credit-NASAJPL-Caltech.jpg", "publishedAt": "2024-10-08T11:00:41Z", "content": "An impression of the craft arriving at Jupiter – credit, NASA/JPL – Caltech\r\nNASA has seen some outstanding recent successes in robotic exploration over the past 20 years, but now the agency’s flagsh… [+3115 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Mars once had water to support life. Curiosity rover now finds what made it uninhabitable - WION", "description": "The Curiosity rover of NASA is exploring the Gale crater on Mars currently and is providing more details about how the Red Planet's climate turned from potentially suitable for life to inhospitable to terrestrial life. \n\nIt has been known that Mars was holdin…", "url": "https://www.wionews.com/science/mars-once-had-water-to-support-life-curiosity-rover-now-finds-what-made-it-uninhabitable-765590", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/09/08/453615-mars-5.png", "publishedAt": "2024-10-08T10:23:27Z", "content": "The Curiosity rover of NASA is exploring the Gale crater on Mars currently and is providing more details about how the Red Planet's climate turned from potentially suitable for life to inhospitable t… [+2701 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "PLD Space unveils plans for larger launch vehicles and crewed spacecraft - SpaceNews", "description": "Spanish startup PLD Space, currently developing a small launch vehicle, has outlined plans to work on progressively larger, reusable rockets as well as a crewed spacecraft.", "url": "https://spacenews.com/pld-space-unveils-plans-for-larger-launch-vehicles-and-crewed-spacecraft/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/miuranextheavy.jpg?resize=1200%2C1200&ssl=1", "publishedAt": "2024-10-08T10:04:20Z", "content": "ORLANDO, Fla. Spanish startup PLD Space, currently developing a small launch vehicle, has outlined plans to work on progressively larger, reusable rockets as well as a crewed spacecraft.\r\nThe company… [+5421 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Landon Mion", "title": "NASA releases clearest view of Mars, blue rocks seen on landscape - Yahoo! Voices", "description": "NASA has released the clearest view of Mars seen thus far, with a field of blue rocks seen on the Martian landscape on top of an ancient lake.", "url": "https://www.yahoo.com/news/nasa-releases-clearest-view-mars-090718194.html", "urlToImage": "https://media.zenfs.com/en/fox_news_text_979/f4e7a0636b48bf6c10c00822cc37df5f", "publishedAt": "2024-10-08T09:07:18Z", "content": "NASA has released the clearest view of Mars to date, with blue rocks observed across the planet's landscape.\r\nThe images were captured by the Perseverance rover as it explores the planet.\r\nDark blue,… [+1313 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "China builds Mars battery that creates power from atmosphere, thrives in icy cold - Interesting Engineering", "description": "This is a significant advantage as it eliminates the need to transport fuel to Mars, reducing the overall weight and complexity of the mission.", "url": "https://interestingengineering.com/energy/china-mars-battery-creates-power-from-atmosphere", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/iStock-935640494-2.jpg", "publishedAt": "2024-10-08T08:18:00Z", "content": "A team of scientists from the University of Science and Technology of China has presented a novel solution a unique battery designed to harness the Martian atmosphere as its fuel during discharge. \r\n… [+1217 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Kevin Holden Platt", "title": "Ghost Rockets, ASAT Tests Create “A Ticking Time Bomb” For Astronauts - Forbes", "description": "Decades of abandoning rockets in orbit, and firing off anti-satellite missiles, are surrounding Earth with \"time bombs\" that will threaten astronauts into the future.", "url": "https://www.forbes.com/sites/kevinholdenplatt/2024/10/07/ghost-rockets-asat-tests-create-a-ticking-time-bomb-for-astronauts/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66a8418e6dee52cb01f835f6/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-08T02:28:56Z", "content": "Astronauts conducting spacewalks outside the International Space Station could be exposed to tiny ... [+] but lethal chips of shrapnel created during anti-satellite missile tests in orbit (Photo by N… [+10157 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "Smallsats offer lessons for big science missions - SpaceNews", "description": "SAN FRANCISCO – As a group, NASA’s low-cost science missions have improved significantly. “There were lessons learned over the years that helped,” said Charles Norton, NASA Jet Propulsion Laborator…", "url": "https://spacenews.com/smallsats-offer-lessons-for-big-science-missions/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/rsz_tempest-d_rc.png?fit=879%2C571&ssl=1", "publishedAt": "2024-10-08T01:53:30Z", "content": "SAN FRANCISCO As a group, NASAs low-cost science missions have improved significantly.\r\nThere were lessons learned over the years that helped, said Charles Norton, NASA Jet Propulsion Laboratory depu… [+4763 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Discovery Shakes Foundations of Animal Perception: Scientists Uncover Hidden “Sixth Sense” in Geckos - SciTechDaily", "description": "Researchers at the University of Maryland have found that geckos utilize a mechanism typically linked to balance to detect vibrations, providing fresh insights into how animals perceive auditory and tactile stimuli. Biologists at the University of Maryland ha…", "url": "https://scitechdaily.com/?p=421040", "urlToImage": "https://scitechdaily.com/images/Tokay-Gekko-scaled.jpg", "publishedAt": "2024-10-08T01:20:05Z", "content": "University of Maryland biologists have discovered that geckos use a part of their inner ear, the saccule, to detect low-frequency vibrations, offering a new understanding of reptilian hearing. This f… [+4598 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr, Michelle Starr", "title": "Physicists Simulated a Black Hole in The Lab, And Then It Began to Glow. - ScienceAlert", "description": "An elusive radiation takes shape.", "url": "https://www.sciencealert.com/physicists-simulated-a-black-hole-in-the-lab-and-then-it-began-to-glow", "urlToImage": "https://www.sciencealert.com/images/2022/11/black-hole-art.jpg", "publishedAt": "2024-10-07T23:21:22Z", "content": "A black hole analog could tell us a thing or two about an elusive radiation theoretically emitted by the real thing.\r\nUsing a chain of atoms in single-file to simulate the event horizon of a black ho… [+3427 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Surviving a Cosmic Collision | How The Earth Was Made (S2, E3) | Full Episode - HISTORY", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/", "urlToImage": "https://www.youtube.com/img/desktop/yt_1200.png", "publishedAt": "2024-10-07T22:00:01Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "First complete map of every neuron in the brain revealed - Earth.com", "description": "Scientists reveal the first complete neural map of an adult brain, mapping every neuron and connection for new insights into brain function.", "url": "https://www.earth.com/news/first-complete-map-of-every-neuron-in-the-brain-revealed/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/07153853/neurons_50-largest_mapped_fruit-fly-brain_UCambridge_1m.jpg", "publishedAt": "2024-10-07T21:44:16Z", "content": "Imagine gazing at the intricate yet beautiful map of an entire city, but the city is in fact a brain. Sounds fascinating, doesn’t it? Well, scientists have now made this a reality.\r\nExperts have crea… [+4171 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Maggie Harrison Dupré", "title": "Scientists Cracked Open a 2-Billion-Year-Old Stone and Discovered Something Entirely Unexpected - Yahoo! Voices", "description": "Microbes Rock A very old rock — or rather, what's inside of it —might just rewrite what we know about evolution of life on Earth. A new study published in...", "url": "https://futurism.com/the-byte/scientists-2-billion-year-old-stone", "urlToImage": "https://media.zenfs.com/en/futurism_981/9b66b7a467da55e23cd4d33f1bf579ad", "publishedAt": "2024-10-07T21:30:19Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nM… [+2427 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "Vulcan Centaur avoids FAA scrutiny after losing solid rocket booster nozzle - The Register", "description": "Is that a sparkler attached to the bottom of your rocket or just something falling off?", "url": "https://www.theregister.com/2024/10/07/ula_dodges_faa_scrutiny/", "urlToImage": "https://regmedia.co.uk/2024/10/07/vulcan_centaur.jpg", "publishedAt": "2024-10-07T21:15:00Z", "content": "An unusual event occurred during United Launch Alliance's (ULA) second launch of the Vulcan Centaur at the end of last week. One of the twin Solid Rocket Boosters (SRBs) lost its nozzle, but the vehi… [+3199 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Maryland", "title": "New study eases concerns over possible 'doomsday' asteroid swarm - Phys.org", "description": "Astronomers have good news about potentially hazardous asteroids lurking near our planet: There aren't as many as we thought.", "url": "https://phys.org/news/2024-10-eases-doomsday-asteroid-swarm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-study-eases-concer.jpg", "publishedAt": "2024-10-07T19:57:29Z", "content": "Astronomers have good news about potentially hazardous asteroids lurking near our planet: There aren't as many as we thought.\r\nUsing the Zwicky Transient Facility (ZTF) telescope to survey large expa… [+3977 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Artemis Spyrou, Sean Liddick", "title": "Many stable atoms have ‘magic numbers’ of protons and neutrons − 75 years ago, 2 physicists discovered their special properties - The Conversation Indonesia", "description": "All the oxygen in your body is thanks to magic numbers of protons and neutrons in the nucleus.", "url": "https://theconversation.com/many-stable-atoms-have-magic-numbers-of-protons-and-neutrons-75-years-ago-2-physicists-discovered-their-special-properties-239690", "urlToImage": "https://images.theconversation.com/files/623991/original/file-20241007-16-os030b.jpg?ixlib=rb-4.1.0&rect=122%2C634%2C13662%2C6831&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-10-07T18:55:12Z", "content": "The word magic is not often used in the context of science. But in the early 1930s, scientists discovered that some atomic nuclei the center part of atoms, which make up all matter were more stable t… [+6907 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "China Joins SpaceX in Ruining Astronomy for Everybody - Futurism", "description": "In its effort to compete with SpaceX, China has launched the first internet satellites in own constellation — and astronomers are irked.", "url": "https://futurism.com/the-byte/china-spacex-satellites-brightness", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/china-spacex-satellites-brightness.jpg", "publishedAt": "2024-10-07T18:27:15Z", "content": "\"Its difficult to know whether they are listening to the concerns of astronomers.\"\r\nShine Bright\r\nIn its effort to compete with SpaceX, China has launched the first internet satellites in its own, co… [+2469 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "'Any protein you can imagine, it can deliver': AI will help discover the next breakthrough in RNA, says Nobel Prize winner Dr. Drew Weissman - Livescience.com", "description": "Live Science spoke with Nobel laureate Dr. Drew Weissman and engineer Daeyeon Lee about a new RNA research center they're helping to launch.", "url": "https://www.livescience.com/health/any-protein-you-can-imagine-it-can-deliver-ai-will-help-discover-the-next-breakthrough-in-rna-says-nobel-prize-winner-drew-weissman", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CA54xZ7Gbs3jghorRuM4Wf-1200-80.jpg", "publishedAt": "2024-10-07T17:45:00Z", "content": "RNA\r\n, a molecular cousin of DNA, was thrust into the spotlight as the basis of the world's first-ever COVID-19 vaccines. Two key developers of the tech behind the shots won a Nobel prize for their e… [+9447 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Tom Hale", "title": "Strange Ice On Arctic Seafloor Shows It's A Surprisingly Dynamic World Down There - IFLScience", "description": "The icy depths of the Arctic Ocean are an ever-changing world, not a static environment stuck in a deep freeze.", "url": "https://www.iflscience.com/strange-ice-on-arctic-seafloor-shows-its-a-surprisingly-dynamic-world-down-there-76260", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76260/aImg/79339/mbari-meta.jpg", "publishedAt": "2024-10-07T16:46:36Z", "content": "Deep in the Arctic Ocean, a portion of seafloor covered in craters larger than football fields is challenging assumptions about the workings of the icy waters of the planet's far north. \r\nIn the Cana… [+2603 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Victoria Atkinson", "title": "Why do cats 'chatter'? - Livescience.com", "description": "Some cats chatter, oftentimes when they see prey. But why?", "url": "https://www.livescience.com/animals/domestic-cats/why-do-cats-chatter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ufyoQSdzQQHSvqY2RRnfJf-1200-80.jpg", "publishedAt": "2024-10-07T16:20:26Z", "content": "Cats make a variety of sounds to communicate with the people and animals around them. Meowing, principally directed at humans\r\n, is a call for attention (or food), while hissing or growling at other … [+4116 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "Primordial holes could be hiding in planets, asteroids and here on Earth - Phys.org", "description": "Small primordial black holes (PBHs) are one of the hot topics in astronomy and cosmology today. These hypothetical black holes are believed to have formed soon after the Big Bang, resulting from pockets of subatomic matter so dense that they underwent gravita…", "url": "https://phys.org/news/2024-10-primordial-holes-planets-asteroids-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/primordial-holes-could.jpg", "publishedAt": "2024-10-07T15:51:04Z", "content": "Small primordial black holes (PBHs) are one of the hot topics in astronomy and cosmology today. These hypothetical black holes are believed to have formed soon after the Big Bang, resulting from pock… [+6345 chars]"}, {"source": {"id": null, "name": "mlive.com"}, "author": "Justine Lofton | jlofton@mlive.com", "title": "Big meteor seen over Michigan was part of Jupiter comet family, NASA says - MLive.com", "description": "A West Michigan resident captured a video of the passing fireball Saturday night.", "url": "https://www.mlive.com/life/2024/10/big-meteor-seen-over-michigan-was-part-of-jupiter-comet-family-nasa-says.html", "urlToImage": "https://www.mlive.com/resizer/v2/FIFZYDM4DZFEDAROLIKIGTNBM4.png?auth=6d170cc698a204caa4218f62fd81028a64cb7cd17027c3dbe5186b240ab56da6&width=1280&quality=90", "publishedAt": "2024-10-07T15:39:00Z", "content": "A very bright fireball was seen throughout the Midwest on Saturday night, with hundreds of eyewitnesses filing reports, according to NASA. \r\nAround 11:45 p.m. between Covert and Watervliet in West Mi… [+681 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Maggie Harrison Dupré", "title": "Something Massive Is Shifting Deep Inside the Moon - Futurism", "description": "NASA researchers believe that a layer of molten goo, which shifts and moves like ocean tides, sits between the Moon's mantle and core.", "url": "https://futurism.com/the-byte/shifting-deep-inside-moon", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/shifting-deep-inside-moon.jpg", "publishedAt": "2024-10-07T15:25:37Z", "content": "What was that?\r\nMoon Goo\r\nSomething is moving inside of the Moon. Yes, you read that correctly.\r\nA recent study from scientists at NASA and the University of Arizona found that a layer of low-viscosi… [+2453 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Montreal", "title": "Astronomers use Webb to probe a 'steam world' in the constellation Pisces - Phys.org", "description": "A Canadian-led international study has revealed new insights into the atmosphere of GJ 9827 d—an exoplanet orbiting the star GJ 9827 in the constellation Pisces, about 98 light-years from Earth—using the James Webb Space Telescope (JWST).", "url": "https://phys.org/news/2024-10-astronomers-webb-probe-steam-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/astronomers-probe-a-st.jpg", "publishedAt": "2024-10-07T14:28:37Z", "content": "A Canadian-led international study has revealed new insights into the atmosphere of GJ 9827 dan exoplanet orbiting the star GJ 9827 in the constellation Pisces, about 98 light-years from Earthusing t… [+5443 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Dwarf planet Ceres once had a muddy ocean, study suggests - Space.com", "description": "'Ceres, we think, is therefore the most accessible icy world in the universe.'", "url": "https://www.space.com/dwarf-planet-ceres-muddy-ocean", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qnft8kRfeGWWLgaygo4fb9-1200-80.jpg", "publishedAt": "2024-10-07T14:00:00Z", "content": "The outer crust of the dwarf planet Ceres, which at 588 miles (946 kilometers) across is the largest object in the asteroid belt between Mars and Jupiter, is likely made from a dirty frozen ocean, ac… [+3784 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Computer Scientist Who Builds Big Pictures From Small Details - Quanta Magazine", "description": "To better understand how machines learn, Lenka Zdeborová treats them like physical materials.", "url": "https://www.quantamagazine.org/the-computer-scientist-who-builds-big-pictures-from-small-details-20241007/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2024/10/LenkaZdeborova-crSamuelRubio-Social.jpg", "publishedAt": "2024-10-07T13:36:58Z", "content": "What do they have in common?\r\nIn both cases, extracting the macroscopic behavior of a system from a microscopic description is difficult.\r\nEven though Newtons laws and quantum mechanics can give you … [+1226 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "NASA shuts Voyager 2 plasma instrument from 12 billion miles away - Interesting Engineering", "description": "The Plasma Spectrometer (PLS) has been the eyes and ears of Voyager 2, measuring the charged particles that shape our solar system and beyond.", "url": "https://interestingengineering.com/space/nasa-shuts-down-voyager-2-plasma-instrument", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/MIT_Voyager-PLS-Signoff-02-PRESS_627039.jpg", "publishedAt": "2024-10-07T13:35:00Z", "content": "When Voyager 2 left the heliosphere, the solar wind flow to the three cups facing the Sun decreased a lot. The fourth cup’s (used to study planetary magnetospheres) best data is only collected every … [+851 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Joel S. Levine", "title": "NASA wants to send humans to Mars in the 2030s − a crewed mission could unlock some of the red planet’s geologic mysteries - The Conversation", "description": "Before sending humans to Mars, NASA will first return humans to the Moon’s surface to test its technology and train astronauts.", "url": "https://theconversation.com/nasa-wants-to-send-humans-to-mars-in-the-2030s-a-crewed-mission-could-unlock-some-of-the-red-planets-geologic-mysteries-239814", "urlToImage": "https://images.theconversation.com/files/622874/original/file-20241001-16-w1r4jm.jpg?ixlib=rb-4.1.0&rect=463%2C0%2C4599%2C2299&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-10-07T12:20:41Z", "content": "NASA plans to send humans on a scientific round trip to Mars potentially as early as 2035. The trip will take about six to seven months each way and will cover up to 250 million miles (402 million ki… [+5616 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "NASA astronaut Tracy C. Dyson discusses scrubbed spacewalks, Starliner stay-overs and more - Space.com", "description": "'I am going to hang on to those 31 minutes as some of the most character-building moments of my life in space.'", "url": "https://www.space.com/nasa-astronaut-tracy-caldwell-dyson-post-flight-briefing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YXud9By9jEiirv4jJ8uyvZ-1200-80.jpg", "publishedAt": "2024-10-07T12:00:25Z", "content": "Out of the 184 days that NASA astronaut Tracy Caldwell Dyson logged on her most recent mission on board the International Space Station, there are 31 minutes that stand out to her as being among her … [+6090 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Jonathan O'Callaghan", "title": "Stupendously large: How big can black holes get? - BBC.com", "description": "The discovery of ultramassive black holes has raised questions about how these celestial objects first formed in the Universe, how they can grow to such immense sizes.", "url": "https://www.bbc.com/future/article/20241004-ultramassive-black-holes-the-biggest-black-holes-in-the-universe", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0jvpbrl.jpg", "publishedAt": "2024-10-07T10:57:24Z", "content": "Astronomers are spotting a new class of giant black holes that dwarf even the supermassive ones found at the centre of galaxies. Could there be some even more monstrous lurking out there in the darkn… [+13168 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": null, "title": "The ‘cloud’ requires heaps of energy to stay aloft. Could synthetic DNA be the answer? - Aeon", "description": "DNA is nature’s highly efficient mechanism for data storage. Now, scientists are taking note to address our storage crisis", "url": "https://aeon.co/videos/the-cloud-requires-heaps-of-energy-to-stay-aloft-could-synthetic-dna-be-the-answer", "urlToImage": "https://images.aeonmedia.co/images/54a23cfa-27d5-4351-ba7f-b3bbea0dce6f/storing-data-on-dna-landscape-1.jpg?width=1200&quality=75&format=auto", "publishedAt": "2024-10-07T10:02:57Z", "content": "The information age has a data storage problem, and the cloud which is, in reality, a collection of massive data storage centres with enormous carbon footprints likely isnt a viable long-term solutio… [+642 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope studies dusty 'pancakes' feeding baby stars and birthing planets - Space.com", "description": "'How a star accretes mass has a big influence on how the surrounding disk evolves over time, including the way planets form later on.'", "url": "https://www.space.com/james-webb-space-telescope-dusty-pancakes-baby-stars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YXUbhXtGRc5wEoi2vxYLUG-1200-80.png", "publishedAt": "2024-10-07T10:00:05Z", "content": "Using the James Webb Space Telescope (JWST), astronomers have gained a more detailed picture of the turbulent \"pancakes\" of gas and dust surrounding young stars, feeding them and facilitating their g… [+5931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Once-In-A-Lifetime Event\": New Star To Appear In The Night Sky After 80 Years - NDTV", "description": "The Blaze Star was first recorded in 1217 in Germany by a man named Burchard from Ursberg.", "url": "https://www.ndtv.com/science/once-in-a-lifetime-event-new-star-to-appear-in-the-night-sky-after-80-years-6734666", "urlToImage": "https://c.ndtvimg.com/2024-10/j67mt4l_-t-coronae-borealis_625x300_07_October_24.jpeg", "publishedAt": "2024-10-07T08:22:36Z", "content": "Blaze Star, or T Coronae Borealis, is expected to reappear in the night sky\r\nSkygazers are in for a rare treat as a \"once-in-a-lifetime\" celestial event is set to occur. A star known as the Blaze Sta… [+2046 chars]"}, {"source": {"id": null, "name": "Inc."}, "author": "Minda Zetlin", "title": "To Spot a Lie, Pay Close Attention to This, According to New Research - Inc.", "description": "It's a lot easier once you know what to look for.", "url": "https://www.inc.com/minda-zetlin/to-spot-a-lie-pay-close-attention-to-this-new-research-shows.html", "urlToImage": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/images/panoramic/spotting-lies-inc-GettyImages-1340651830_545401_zn0hhm.jpg", "publishedAt": "2024-09-30T07:00:00Z", "content": "How can you tell when someone is lying to you? Ask yourself whether the details of whatever they say are directly relevant to the situation or not. That advice is based on some fascinating new resear… [+2702 chars]"}]}