{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Use Living Human Brain Tissue To Reveal Alzheimer’s Secrets - SciTechDaily", "description": "Live human brain slices show that only a razor‑thin balance of amyloid beta keeps synapses safe. Any disruption, even slight, can rapidly trigger Alzheimer’s-like damage. For the first time, researchers have shown using living human brain tissue how a toxic v…", "url": "https://scitechdaily.com/scientists-use-living-human-brain-tissue-to-reveal-alzheimers-secrets/", "urlToImage": "https://scitechdaily.com/images/Neuroscience-Brain-Organoid-Petri-Dish-Art-Concept.jpg", "publishedAt": "2025-05-13T08:18:59Z", "content": "Researchers have revealed how a toxic form of the amyloid beta protein damages the crucial synaptic connections between brain cells. (Artist’s concept.) Credit: SciTechDaily.com\r\nLive human brain sli… [+6946 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "We Emit a Visible Light That Vanishes When We Die, Says Surprising New Study - ScienceAlert", "description": "Life truly is radiant, according to an experiment conducted by researchers from the University of Calgary and the National Research Council of Canada.", "url": "https://www.sciencealert.com/we-emit-a-visible-light-that-vanishes-when-we-die-says-surprising-new-study", "urlToImage": "https://www.sciencealert.com/images/2025/05/hand_glow_header.jpg", "publishedAt": "2025-05-13T04:23:16Z", "content": "Life truly is radiant, according to an experiment conducted by researchers from the University of Calgary and the National Research Council of Canada.\r\nAn extraordinary experiment on mice and leaves … [+3900 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Ulrik Egede", "title": "Physicists at the Large Hadron Collider turned lead into gold – by accident - The Conversation", "description": "The ancient dream of turning lead into gold is now a reality – but it’s not quite what the alchemists might have hoped for.", "url": "https://theconversation.com/physicists-at-the-large-hadron-collider-turned-lead-into-gold-by-accident-256478", "urlToImage": "https://images.theconversation.com/files/667490/original/file-20250513-62-9i6eko.jpg?ixlib=rb-4.1.0&rect=0%2C779%2C9340%2C4670&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-13T02:58:00Z", "content": "Medieval alchemists dreamed of transmuting lead into gold. Today, we know that lead and gold are different elements, and no amount of chemistry can turn one into the other. \r\nBut our modern knowledge… [+3252 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "James Webb detects three unknown stellar giants, giant \"red monsters\" defy all laws of modern astrophysics. - Farmingdale Observer", "description": "The James Webb Space Telescope (JWST) has once again revolutionized our understanding of the cosmos with a groundbreaking discovery that challenges established astrophysical models. Scientists have identified three colossal stellar formations dubbed \"red mons…", "url": "https://farmingdale-observer.com/2025/05/12/james-webb-detects-three-unknown-stellar-giants-giant-red-monsters-defy-all-laws-of-modern-astrophysics/", "urlToImage": null, "publishedAt": "2025-05-13T02:36:00Z", "content": "The James WebbSpace Telescope (JWST) has once again revolutionized our understanding of the cosmos with a groundbreaking discovery that challenges established astrophysical models. Scientists have id… [+4381 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gravity’s Quantum Secret: \"Theory of Everything\" Could Unite the Forces of Nature - SciTechDaily", "description": "A bold new quantum theory of gravity may finally bridge the long-standing rift between Einstein’s general relativity and quantum field theory. This potential \"Theory of Everything\" could answer some of the deepest mysteries in science—from black hole singular…", "url": "https://scitechdaily.com/?p=474045", "urlToImage": "https://scitechdaily.com/images/Quantum-Gravity-Theory-Art-Concept.jpg", "publishedAt": "2025-05-13T02:13:04Z", "content": "A quantum theory of gravity would clear the path to answering some of the biggest questions in physics. Credit: SciTechDaily.com\r\nA bold new quantum theory of gravity may finally bridge the long-stan… [+6739 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Moon missions: How to avoid a puncture on the Moon - BBC", "description": "Giant tyre firms are testing tyres that can survive conditions on the Moon and Mars.", "url": "https://www.bbc.com/news/articles/czrve1zrlg3o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/f9a1/live/8607cd20-2405-11f0-a686-ebbae6481125.jpg", "publishedAt": "2025-05-12T23:08:33Z", "content": "Padraig Belton\r\nThe Apollo mission lunar rovers were lightweight vehicles\r\nGoing back to the Moon after half a century, and then to Mars, literally means reinventing the wheel.\r\nAfter all, Mars is a … [+5554 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Europe's Proba-3 satellites ace landmark formation-flying test (video) - Space", "description": "The two Proba-3 spacecraft will build on the historic first to simulate and study a total solar eclipse.", "url": "https://www.space.com/space-exploration/satellites/europes-proba-3-satellites-ace-landmark-formation-flying-test-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5DUh8HXQKMsKtHTxKwXXgZ.jpg", "publishedAt": "2025-05-12T22:00:00Z", "content": "A pair of spacecraft have demonstrated ultra-precise formation flying in orbit for the first time, marking a milestone with major implications for both science and future space missions.\r\nThe Europea… [+3314 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Sanders", "title": "Flamingos create water tornados to trap their prey - Phys.org", "description": "Flamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there's a lot going on under the surface.", "url": "https://phys.org/news/2025-05-flamingos-tornados-prey.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/flamingos-create-water.jpg", "publishedAt": "2025-05-12T21:18:05Z", "content": "Flamingos standing serenely in a shallow alkaline lake with heads submerged may seem to be placidly feeding, but there's a lot going on under the surface.\r\nThrough studies of Chilean flamingos in the… [+8433 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Solve “Impossible” Math Problem After 200 Years - SciTechDaily", "description": "A mathematician has developed an algebraic solution to an equation that was long thought to be unsolvable. A groundbreaking discovery from a UNSW Sydney mathematician may finally offer a solution to one of algebra’s toughest problems: how to solve high-degree…", "url": "https://scitechdaily.com/researchers-solve-impossible-math-problem-after-200-years/", "urlToImage": "https://scitechdaily.com/images/Mathematics-Computer-Science-Equations.jpg", "publishedAt": "2025-05-12T20:52:49Z", "content": "A mathematician at UNSW Sydney has introduced a groundbreaking new approach to one of algebra’s oldest unsolved problems.\r\nA mathematician has developed an algebraic solution to an equation that was … [+6226 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "\"Dark photon\" theory of light would completely upend 100 years of quantum physics - Earth.com", "description": "\"Dark photon\" theory says light's interference patterns may emerge from quantum particles, not waves, upending centuries of physics.", "url": "https://www.earth.com/news/dark-photon-theory-casts-doubt-on-double-slit-experiment-quantum-light-interference-pattern/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/10101137/dark-photon-theory_quantum-particles_double-slit-experiment_1m.jpg", "publishedAt": "2025-05-12T20:40:21Z", "content": "For centuries, most scientists have shared the belief that light behaves as both a wave and a particle. This idea, then, became the central component to quantum theory, sprouting the field of science… [+5963 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "King Abdullah University of Science and Technology", "title": "Tough microbes found in NASA cleanrooms hold clues to space survival and biotech - Phys.org", "description": "A new study by scientists at the NASA Jet Propulsion Laboratory and several institutes across India and Saudi Arabia has reported 26 novel bacterial species growing inside cleanrooms associated with NASA space missions. These unknown and newly described speci…", "url": "https://phys.org/news/2025-05-tough-microbes-nasa-cleanrooms-clues.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/tough-microbes-found-i.jpg", "publishedAt": "2025-05-12T20:24:47Z", "content": "A new study by scientists at the NASA Jet Propulsion Laboratory and several institutes across India and Saudi Arabia has reported 26 novel bacterial species growing inside cleanrooms associated with … [+3707 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Only 5 hours from Earth, this planet could be reachable in half a day. - Farmingdale Observer", "description": "Mercury, often overlooked in discussions about our cosmic neighborhood, has emerged as Earth's closest planetary companion according to revolutionary calculations. Contrary to popular belief, neither Venus nor Mars holds this distinction. This revelation chal…", "url": "https://farmingdale-observer.com/2025/05/12/only-5-hours-from-earth-this-planet-could-be-reachable-in-half-a-day/", "urlToImage": null, "publishedAt": "2025-05-12T19:37:00Z", "content": "Mercury, often overlooked in discussions about our cosmic neighborhood, has emerged as Earth’s closest planetary companion according to revolutionary calculations. Contrary to popular belief, neither… [+5045 chars]"}, {"source": {"id": null, "name": "mySA"}, "author": "Melanie Love Salazar", "title": "How to spot May's glowing 'Flower Moon' tonight - MySA", "description": "Texas can catch a stunning sight off the full 'Flower Moon' on Monday, May 12. It will peak around noon and appear bright in the night sky after sunset.", "url": "https://www.mysanantonio.com/lifestyle/outdoors/article/flower-moon-texas-20322698.php", "urlToImage": "https://s.hdnux.com/photos/01/50/25/33/27350755/3/rawImage.jpg", "publishedAt": "2025-05-12T18:44:47Z", "content": "A full Moon is shown on a cool evening.\r\nThang Tat Nguyen/Getty Images\r\nSkygazers can expect a stunning view this evening as a full \"Flower Moon\" will rise today, May 12, coinciding with the active E… [+2751 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Adrianna Nine", "title": "VIDEO: M7.7 Earthquake Leads to First Fault Movement Ever Caught on Film - extremetech.com", "description": "The 'groundbreaking' video makes for a bittersweet milestone amid thousands of casualties, injuries, and property losses.", "url": "https://www.extremetech.com/science/myanmar-earthquake-leads-to-first-fault-movement-ever-caught-on-film-video", "urlToImage": "https://i.extremetech.com/imagery/content-types/02Pl8WugovbQsjGyYiwQjCa/hero-image.fill.size_1200x675.jpg", "publishedAt": "2025-05-12T18:26:09Z", "content": "The magnitude 7.7 earthquake that struck Myanmar and Thailand on March 28 has crossed a bittersweet milestone. As seen in a new video, the quake involved a strike-slip fault in the town of Thazi, whe… [+2140 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "How Fast Is Too Fast to See? Study Reveals Your Visual Speed Limit - Gizmodo", "description": "Researchers suggest that people with faster eye movement can see objects in motion that are invisible to others.", "url": "https://gizmodo.com/how-fast-is-too-fast-to-see-study-reveals-your-visual-speed-limit-2000601005", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/chipmunk-vision-blur.jpg", "publishedAt": "2025-05-12T18:20:35Z", "content": "When a camera whips around from one point to another, most people expect the fast movement to result in a blurry smear. What they don’t realize, however, is that our own eyes engage in a similar kind… [+2633 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Florida Atlantic University", "title": "Twist of light: Non-reciprocity in photon polarization may unlock gravity and quantum mechanics link - Phys.org", "description": "A team of physicists has uncovered a surprising new way to explore one of science's greatest challenges: uniting the two fundamental theories that explain how our universe works—Einstein's theory of gravity and quantum mechanics.", "url": "https://phys.org/news/2025-05-reciprocity-photon-polarization-gravity-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/twist-of-light-new-too.jpg", "publishedAt": "2025-05-12T18:16:28Z", "content": "A team of physicists has uncovered a surprising new way to explore one of science's greatest challenges: uniting the two fundamental theories that explain how our universe worksEinstein's theory of g… [+4341 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "Scientists discover what drives the maximum lifespan potential of mammals - The Brighter Side of News", "description": "Study reveals immune gene expansions and brain size are crucial to understanding mammal lifespan evolution across species.", "url": "https://www.thebrighterside.news/post/scientists-discover-what-drives-the-maximum-lifespan-potential-of-mammals/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/cats-1.jpg?auto=webp", "publishedAt": "2025-05-12T18:07:00Z", "content": "Scientists have long wondered why some mammals live dramatically longer than others. While humans can reach ages beyond a century, certain whales surpass two centuries, and elephants easily live deca… [+7088 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "Renee Straker", "title": "The Moon Is Slowly Drifting Away From The Earth, Could We Eventually Lose It? - Yahoo", "description": "Every year, the moon moves just a little farther away from our planet. Scientists have calculated the rate at which our closest neighbor is slinking away...", "url": "https://weather.com/science/space/news/2025-05-12-scientists-track-moon-movement-away-from-the-earth", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/iNxZRdxT1SevYsuzViJKkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_weather_channel_articles_180/a7e9b6b943c7f3bd2282e248f7391c28", "publishedAt": "2025-05-12T18:03:03Z", "content": "The moon feels like a beautiful constant for many of us, there every night, but Earths satellite is actually slowly moving away from us, albeit very slowly.\r\nBy NASAs calculations the moon is driftin… [+2138 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "Scientists find hint of hidden liquid water ocean deep below Mars' surface - Live Science", "description": "By studying seismic waves, researchers have found a layer deep beneath the surface of Mars that could contain enough liquid water to flood the planet with an ocean thousands of feet deep.", "url": "https://www.livescience.com/space/mars/scientists-find-hint-of-hidden-liquid-water-ocean-deep-below-mars-surface", "urlToImage": "https://cdn.mos.cms.futurecdn.net/M5AsQJ765DN75WEDJZi2Zh.jpg", "publishedAt": "2025-05-12T17:49:55Z", "content": "There might be a hidden ocean's worth of liquid water below the surface of Mars\r\n, seismic evidence suggests.\r\nAccording to a new paper published April 25 in the journal National Science Review\r\n, re… [+4304 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Ryan Erik King", "title": "New GPS-Like System For The Moon Could Be An Astronaut Version Of Waze - Jalopnik", "description": "Spanish tech conglomerate GMV unveiled a GPS-like system for the Moon last week called LUPIN.", "url": "https://www.jalopnik.com/1857707/gmv-new-gps-system-for-moon/", "urlToImage": "https://www.jalopnik.com/img/gallery/new-gps-like-system-for-the-moon-could-be-an-astronaut-version-of-waze/l-intro-1747073478.jpg", "publishedAt": "2025-05-12T17:25:00Z", "content": "GPS-based navigation apps, like Google Maps and Waze, have essentially rendered every prior form of navigation obsolete. While it's difficult to imagine life without these services, imagine being an … [+839 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA’s Europa Clipper Captures Mars in Infrared - NASA (.gov)", "description": "Headed for Jupiter’s moon Europa, the spacecraft did some sightseeing, using a flyby of Mars to calibrate its infrared imaging instrument.", "url": "https://www.nasa.gov/missions/europa-clipper/nasas-europa-clipper-captures-mars-in-infrared/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/1-pia26562-e-themis-mars.png", "publishedAt": "2025-05-12T17:11:42Z", "content": "Headed for Jupiters moon Europa, the spacecraft did some sightseeing, using a flyby of Mars to calibrate its infrared imaging instrument.\r\nOn its recent swing by Mars, NASAs Europa Clipper took the o… [+5760 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Uncontrolled Soviet Probe Crashes to Earth, Hitting Unknown Location - Gizmodo", "description": "Kosmos 482 performed an uncontrolled reentry on May 10, possibly crashing into the Indian Ocean.", "url": "https://gizmodo.com/uncontrolled-soviet-satellite-crashes-to-earth-hitting-unknown-location-2000600923", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Artist_s_view_of_ATV-5_reentry.jpg", "publishedAt": "2025-05-12T17:05:10Z", "content": "A failed Venus mission fell from the sky over the weekend after aimlessly orbiting Earth for the past 53 years. Various agencies closely monitored Kosmos 482’s reentry, but its exact landing site rem… [+3137 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Wild Plan to Collect a Sample from Venus’s Killer Atmosphere - The Daily Galaxy", "description": "A radical plan to sample Venus’s deadly atmosphere could change everything we know about our sister planet. Are we on the verge of a scientific breakthrough?", "url": "https://dailygalaxy.com/2025/05/a-wild-plan-to-collect-a-sample-from-venuss-killer-atmosphere/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Wild-Plan-to-Collect-a-Sample-from-Venuss-Killer-Atmosphere.jpg", "publishedAt": "2025-05-12T17:00:00Z", "content": "A daring and revolutionary plan to sample Venus’s hostile atmosphere was unveiled by a coalition of China’s leading space agencies, including the Chinese Academy of Sciences, the China National Space… [+3703 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Watch flower-like antenna of European forest-watching satellite 'bloom' in space (video) - Space", "description": "\"We're another significant step closer to unlocking unprecedented knowledge about the world's forests.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/watch-flower-like-antenna-of-european-forest-watching-satellite-bloom-in-space-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UA4FjbXxwkkBcPVcbH2EfU.jpg", "publishedAt": "2025-05-12T17:00:00Z", "content": "The huge antenna for the newly launched Biomass forest-monitoring satellite has been successfully deployed, the European Space Agency (ESA) announced on Wednesday (May 7).\r\nThe multi-day deployment w… [+2705 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "World's first gene-edited spiders spin red silk - Earth.com", "description": "Scientists have bred spiders that weave red draglines, proving that the animals’ silk can be genetically re-engineered.", "url": "https://www.earth.com/news/worlds-first-gene-edited-spiders-spin-red-silk/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/12092826/Glowing-threads-Gene-edited-spiders-spin-red-silk.jpg", "publishedAt": "2025-05-12T16:47:09Z", "content": "Scientists have bred spiders that weave bright red, fluorescent draglines, proving that the animals silk can be genetically re-engineered inside the living organism. This finding shows a new path tow… [+4515 chars]"}, {"source": {"id": null, "name": "PCWorld"}, "author": "René Resch, Joel Lee", "title": "NASA calculated when life will end on Earth. It doesn’t look good - pcworld.com", "description": "In collaboration with a Japanese university, NASA researchers used supercomputers to predict when life will no longer be possible on Earth.", "url": "https://www.pcworld.com/article/2778408/nasa-supercomputers-calculated-the-end-of-all-life-on-earth.html", "urlToImage": "https://www.pcworld.com/wp-content/uploads/2025/05/Supererde-Planet-2.png?w=1024", "publishedAt": "2025-05-12T16:21:00Z", "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nIn collaboration wit… [+2614 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "Hidden Beneath Antarctic Ice for Eons, a “Deeply Puzzling” Soviet-era Discovery Finally Reveals Its Secrets - The Debrief", "description": "Scientists reveal new discoveries about a mystery that has remained hidden beneath Antarctic ice for half a billion years.", "url": "https://thedebrief.org/hidden-beneath-antarctic-ice-for-eons-a-deeply-puzzling-soviet-era-discovery-finally-reveals-its-secrets/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/Gamburtsev-mountains.jpg", "publishedAt": "2025-05-12T15:49:36Z", "content": "Deep beneath the thick ice that covers East Antarctica, scientists are revealing new discoveries about a mystery that has been hidden beneath the continents frozen exterior for half a billion years.\r… [+5787 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "Scientists reveal just how little of the deep ocean we've explored - Live Science", "description": "Despite the deep ocean floor coating some 66% of our planet's surface, we haven't explored 99.999% of it, study finds.", "url": "https://www.livescience.com/planet-earth/only-0-001-percent-of-deep-ocean-has-ever-been-explored-by-humans-an-area-equal-the-size-of-rhode-island", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6jdNuRkQuycn4bsifnpixF.jpg", "publishedAt": "2025-05-12T15:36:36Z", "content": "Scientists have revealed how much of the vast deep ocean floor humankind has observed, and it's a staggeringly small amount.\r\nAccording to a new study published May 7 in the journal Science Advances\r… [+4404 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Vertical view of a very large telescope photo of the day for May 12, 2025 - Space", "description": "ESO's Extremely Large Telescope is seen from directly above as construction continues towards the observatory's completion.", "url": "https://www.space.com/astronomy/vertical-view-of-a-very-large-telescope-space-photo-of-the-day-for-may-12-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8HdEcGh4wS8U5XRpG99Q4R.jpg", "publishedAt": "2025-05-12T15:36:08Z", "content": "ESO's Extremely Large Telescope at Cerro Armazones in Chile's Atacama Desert is seen from directly above while its construction continues. (Image credit: ESO/G / Vecchia)\r\nThe European Southern Obser… [+1662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Results of the HAYSTAC Phase II search for dark matter axions - Phys.org", "description": "Axions, hypothetical subatomic particles that were first proposed by theoretical physicists in the late 1970s, remain among the most promising dark matter candidates. Physics theories suggest that the interactions between these particles and regular matter ar…", "url": "https://phys.org/news/2025-05-results-haystac-phase-ii-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/results-of-the-haystac-1.jpg", "publishedAt": "2025-05-12T15:20:01Z", "content": "Axions, hypothetical subatomic particles that were first proposed by theoretical physicists in the late 1970s, remain among the most promising dark matter candidates. Physics theories suggest that th… [+6753 chars]"}, {"source": {"id": null, "name": "Westword"}, "author": "Adam Perry", "title": "Stairways to Heaven: 25 Boulder Bike Rides - Westword", "description": "Over the course of a year, I pushed myself to complete every ride.", "url": "https://www.westword.com/arts/25-boulder-bike-ride-challenge-a-guide-for-first-timers-24426352", "urlToImage": "https://media1.westword.com/den/imager/stairways-to-heaven-25-boulder-bike-rides/u/r-landingfeature/24426644/492409207_3975991145977618_3164663809855879153_n.webp?cb=1746823256", "publishedAt": "2025-05-12T15:01:24Z", "content": "Ive been riding bikes in Boulder since 2008, when I was an English student at Naropa University and rented my first Boulder bike, a sweet black cruiser with a name tag that read \"Zoe.\" Slowly, I grad… [+7232 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Ancient Antler From Stone Age Sweden Reveals Sacred Journey From War to Water - Indian Defence Review", "description": "Ancient antler from Stone Age Sweden reveals unexpected insights into tool use, craftsmanship, and ritual practices.", "url": "https://indiandefencereview.com/ancient-antler-from-stone-age-sweden/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/bronze-age-rock-carvings-from-sweden.jpg", "publishedAt": "2025-05-12T14:30:00Z", "content": "A 7,500-year-old antler unearthed in Sweden is offering a rare glimpse into the ingenuity of Stone Age communities and the symbolic layers their tools may have carried. Far from being a simple fragme… [+3895 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Anne-Laure Le Cunff", "title": "How curiosity rewires your brain for change - Big Think", "description": "Curiosity is often considered a personality quirk. Neuroscience paints a different picture.", "url": "https://bigthink.com/smart-skills/how-curiosity-rewires-your-brain-for-change/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/05/curiosity-rewire-brain_compressed.png?resize=1200,630", "publishedAt": "2025-05-12T14:18:56Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "First Full Map of Fruit Fly Nervous System Reveals Sex Differences - Neuroscience News", "description": "Scientists have completed the first full connectome of the adult fruit fly, including both the brain and ventral nerve cord, revealing how neural signals travel between these two structures.", "url": "https://neurosciencenews.com/fruit-fly-brain-map-sex-differences-28889/", "urlToImage": "https://neurosciencenews.com/files/2025/05/fruit-fly-brain-mapping-neurosicence.jpg", "publishedAt": "2025-05-12T13:39:58Z", "content": "Summary: Scientists have completed the first full connectome of the adult fruit fly, including both the brain and ventral nerve cord, revealing how neural signals travel between these two structures.… [+5790 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "See the reconstructed home of 'polar dinosaurs' that thrived in the Antarctic 120 million years ago - Live Science", "description": "Fossil sites in Australia hold pollen and spores from the dinosaur age, when the island straddled the Antarctic Circle. Now, scientists have re-created the habitat of \"polar dinosaurs,\" using these plant remains.", "url": "https://www.livescience.com/planet-earth/plants/see-the-reconstructed-home-of-polar-dinosaurs-that-thrived-in-the-antarctic-120-million-years-ago", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jveaQhp7hD2fz6BynV5fPR.jpg", "publishedAt": "2025-05-12T13:30:00Z", "content": "Australia is rather isolated\r\n today, but around 120 million years ago, the island straddled the polar circle and formed a giant landmass with Antarctica. At that time, dinosaurs\r\n lived on this land… [+3940 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Two exoplanets discovered orbiting sun-like star - Phys.org", "description": "An international team of astronomers reports the discovery of two new exoplanets, a few times more massive than Earth, orbiting a sun-like star known as HD 35843. The finding was reported in a research paper published May 1 on the arXiv pre-print server.", "url": "https://phys.org/news/2025-05-exoplanets-orbiting-sun-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/two-exoplanets-discove.jpg", "publishedAt": "2025-05-12T13:00:37Z", "content": "An international team of astronomers reports the discovery of two new exoplanets, a few times more massive than Earth, orbiting a sun-like star known as HD 35843. The finding was reported in a resear… [+3239 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "9000-year-old ‘Stonehenge-like’ structure found hidden in Lake Michigan - The Brighter Side of News", "description": "Researchers found a mysterious arrangement of large stones resting on the lake bed. Dubbed \"Michigan’s Stonehenge\" by those who’ve seen it", "url": "https://www.thebrighterside.news/global-good/9000-year-old-stonehenge-like-structure-found-hidden-in-lake-michigan", "urlToImage": "https://www.thebrighterside.news/uploads/2024/07/9000-stonehenge-2-e1746909929857.webp?auto=webp", "publishedAt": "2025-05-12T11:51:00Z", "content": "Beneath the tranquil surface of Grand Traverse Bay lies a secret far older than any shipwreck. Long known for calm waters and a proud seafaring past, the bay is now drawing attention for a prehistori… [+5200 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A size of 1.3 billion light-years, by scanning space, these scientists have discovered the largest structure in the universe. - Farmingdale Observer", "description": "Astronomers have just got their hands on Quipu, a veritable cosmic monster. At 1.3 billion light-years long and 200 quadrillion solar masses, this intergalactic structure is quite simply the largest ever discovered. We thought we had identified the great stru…", "url": "https://farmingdale-observer.com/2025/05/12/a-size-of-1-3-billion-light-years-by-scanning-space-these-scientists-have-discovered-the-largest-structure-in-the-universe/", "urlToImage": null, "publishedAt": "2025-05-12T11:36:00Z", "content": "Astronomers have just got their hands on Quipu, a veritable cosmic monster. At 1.3 billion light-years long and 200 quadrillion solar masses, this intergalactic structure is quite simply the largest … [+2568 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Earth’s Sixth Ocean Is Slowly Forming – And It Will Change the World - Indian Defence Review", "description": "A massive geological transformation is unfolding in Africa, slowly carving out a new ocean. The East African Rift is reshaping the continent in ways that could change everything.", "url": "https://indiandefencereview.com/earths-sixth-ocean-is-slowly-forming-and-it-will-change-the-world/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/the-east-african-rift.jpg", "publishedAt": "2025-05-12T11:00:00Z", "content": "Scientists have confirmed the gradual formation of Earths sixth ocean. This significant geological event is occurring within the East African Rift, a vast crack that stretches across the continent. T… [+2853 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA celebrated this employee's story of resilience, then tried to scrub it from the internet. Then fired her. - Space", "description": "\"It feels like everything that I worked for has been taken down little by little.\"", "url": "https://www.space.com/space-exploration/nasa-celebrated-this-employees-story-of-resilience-then-tried-to-scrub-it-from-the-internet-then-fired-her", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yumnaqUeahy2igBxJrV2NX.jpg", "publishedAt": "2025-05-12T10:00:30Z", "content": "\"People see me now, and they just assume, 'oh, she had it easy,'\" she says, but Rose Ferreira has had it anything but easy. The trajectory of her life has been so turbulent, in fact, that NASA, her p… [+19364 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronaut Unveils Hidden Salt Lake and Ancient Lava Trails on Sahara’s Towering Volcano - SciTechDaily", "description": "From orbit, Emi Koussi’s dramatic caldera and lava-scarred slopes hint at its fiery past, while dried lakebeds and erosion channels whisper of long-lost water.", "url": "https://scitechdaily.com/astronaut-unveils-hidden-salt-lake-and-ancient-lava-trails-on-saharas-towering-volcano/", "urlToImage": "https://scitechdaily.com/images/Emi-Koussi-From-Space-scaled.jpg", "publishedAt": "2025-05-12T08:42:58Z", "content": "In northern Chad, the tallest peak in the Sahara Desert is topped with a patch of salt, not snow.\r\nHigh above the vast Sahara Desert, an astronaut captured a breathtaking image of Emi Koussi—a massiv… [+3011 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "11 NASA astrophysics missions face risk of cancellation - Big Think", "description": "NASA astrophysics, which gave us Hubble, JWST, and so much more, faces its greatest budget cut in history. All future missions are at risk.", "url": "https://bigthink.com/starts-with-a-bang/10-nasa-astrophysics-risk-cancellation/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/11/gas-in-out-galaxy-e1746993890831.jpg?resize=1200,630", "publishedAt": "2025-05-12T06:00:00Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Michael J. I. Brown", "title": "Comet, rocket, space junk or meteor? Here’s how to tell your fireballs apart - The Conversation", "description": "There are telltale clues to help you work out what just blazed overhead.", "url": "https://theconversation.com/comet-rocket-space-junk-or-meteor-heres-how-to-tell-your-fireballs-apart-213083", "urlToImage": "https://images.theconversation.com/files/562275/original/file-20231128-27-1vg0uo.jpg?ixlib=rb-4.1.0&rect=3%2C0%2C2041%2C1020&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-12T02:51:00Z", "content": "Theres a blaze of light across the sky! A fireball is seen by thousands, and mobile phone and dashcam footage soon appears on social media. \r\nBut what have people just seen? A mix of social media has… [+5524 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Just Got a Rare Look Inside Uranus – Here’s What They Found - SciTechDaily", "description": "A rare celestial alignment in April 2025 gave NASA scientists the chance to study Uranus in exceptional detail as it passed in front of a distant star. This stellar occultation, visible only from parts of western North America, allowed researchers to measure …", "url": "https://scitechdaily.com/nasa-just-got-a-rare-look-inside-uranus-heres-what-they-found/", "urlToImage": "https://scitechdaily.com/images/Uranus-Close-up-Webb-NIRCam-image.jpg", "publishedAt": "2025-05-12T02:32:18Z", "content": "This image of Uranus from NIRCam (Near-Infrared Camera) on NASA’s James Webb Space Telescope exquisitely captures Uranus’s seasonal north polar cap and dim inner and outer rings. This Webb image also… [+7748 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A geological anomaly causes the sea level to drop by 100 feet. - Farmingdale Observer", "description": "When we think about sea levels, rising oceans often dominate the conversation. However, a fascinating geological phenomenon once caused the exact opposite effect. Research published by Colleen A. Dalton and her team on the AGU scientific platform reveals that…", "url": "https://farmingdale-observer.com/2025/05/11/a-geological-anomaly-causes-the-sea-level-to-drop-by-100-feet/", "urlToImage": null, "publishedAt": "2025-05-12T01:06:00Z", "content": "When we think about sea levels, rising oceans often dominate the conversation. However, a fascinating geological phenomenon once caused the exact opposite effect. Research published by Colleen A. Dal… [+4070 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Webb's iconic 'Cosmic Cliffs' image transformed into stunning 3D video tour of a star nursery - Earth.com", "description": "The iconic \"Cosmic Cliffs\" image captured by the Webb Telescope was turned into a 3D fly-through, revealing a stunning stellar nursery.", "url": "https://www.earth.com/news/webbs-iconic-cosmic-cliffs-image-transformed-into-stunning-3d-tour-of-star-nursery/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/11162416/cosmic-cliffs_carina-nebula_webb-space-telescope_1m.jpg", "publishedAt": "2025-05-11T22:30:41Z", "content": "A famous James Webb Space Telescope portrait has recently gained a fresh dimension. Scientists have transformed the Cosmic Cliffs image, first revealed in July2022, into a sweeping threedimensional f… [+4926 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Webb telescope gets a clear view of a very hot alien world - Earth.com", "description": "Webb Space Telescope reveals a surprisingly clear atmosphere on planet TOI-421 b, helping scientists understand the evolution of sub-Neptunes.", "url": "https://www.earth.com/news/clear-skies-on-a-distant-planet-reveal-a-hydrogen-rich-atmosphere-toi-421-b/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/11144550/exoplanet_TOI-421-b_hot-neptune_NASA_1m.jpg", "publishedAt": "2025-05-11T20:51:03Z", "content": "Sub-Neptunes may not orbit our Sun, but they are everywhere in our galaxy. These planets – bigger than Earth, smaller than Neptune – make up the most common type of exoplanet weve found so far. \r\nDes… [+5034 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Skye Jacobs", "title": "Wandering supermassive black hole spotted devouring star - TechSpot", "description": "Astronomers have identified a supermassive black hole located on the outskirts of a galaxy 600 million light-years from Earth, where it was observed consuming a nearby star.", "url": "https://www.techspot.com/news/107875-wandering-supermassive-black-hole-spotted-devouring-star.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-11-image.jpg", "publishedAt": "2025-05-11T18:42:12Z", "content": "Through the looking glass: The discovery of a supermassive black hole not only challenges assumptions about where these galactic giants reside but also demonstrates the power of combining observation… [+4879 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Element Wasn’t Discovered Until 1783—so What Was It Doing In This Lab? - The Daily Galaxy", "description": "Tycho Brahe’s alchemical lab just revealed a mystery that could rewrite history—traces of tungsten, an element unknown in the 16th century.", "url": "https://dailygalaxy.com/2025/05/this-element-wasnt-discovered-until-1783-so-what-was-it-doing-in-this-lab/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/This-Element-Wasnt-Discovered-Until-1783—so-What-Was-It-Doing-In-Tycho-Brahes-Lab.jpg", "publishedAt": "2025-05-11T18:00:00Z", "content": "A surprising scientific discovery in the remnants of Tycho Brahes workshop has revealed the presence of tungsten, an element unknown to science until the 18th century. \r\nDuring recent examinations of… [+3395 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The End of the World Could Be Closer Than You Think – And NASA’s Warning! - The Daily Galaxy", "description": "Stephen Hawking’s chilling prediction about Earth’s fiery future is gaining new traction, with NASA backing his alarming environmental warnings. Could humanity be on the brink of disaster?", "url": "https://dailygalaxy.com/2025/05/the-end-of-the-world-could-be-closer-than-you-think-and-nasas-warning/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/The-End-of-the-World-Could-Be-Closer-Than-You-Think-–-And-NASAs-Warning.jpg", "publishedAt": "2025-05-11T17:30:00Z", "content": "In a shocking prediction before his passing in 2018, renowned physicist Stephen Hawking warned of a fiery future for our planet. With NASA aligning with many of Hawking’s environmental concerns, the … [+2983 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "How do you keep reusable spacecraft cool during reentry? Make them 'sweat' - Space", "description": "University researchers are developing some innovative heat-shield tech.", "url": "https://www.space.com/technology/how-do-you-keep-reusable-spacecraft-cool-during-reentry-make-them-sweat", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pGJ5S8iHzx2ApcDSxKSWGJ.jpg", "publishedAt": "2025-05-11T17:00:00Z", "content": "An innovative approach for fully reusable spacecraft suggests making them \"sweat\" to survive the scorching heat during reentry to Earth's atmosphere, allowing them to land ready for another flight.\r\n… [+2786 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "They Opened 40-Year-Old Salmon Cans… What They Found Inside Was Deeply Disturbing - The Daily Galaxy", "description": "They opened 40-year-old salmon cans and found a shocking secret inside. It’s not just about the fish—it's about the worms that reveal startling truths about our oceans.", "url": "https://dailygalaxy.com/2025/05/they-opened-40-year-old-salmon-cans-what-they-found-inside-was-deeply-disturbing/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/They-Opened-40-Year-Old-Salmon-Cans…-What-They-Found-Inside-Was-Deeply-Disturbing.jpg", "publishedAt": "2025-05-11T17:00:00Z", "content": "Old cans of salmon, some sealed since the 1970s, have become unexpected tools in unraveling long-term changes in marine ecosystems. Initially preserved for quality control by Seattle’s Seafood Produc… [+3900 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Calling citizen scientists! Help NASA's Galaxy Zoo classify galaxies seen by James Webb Space Telescope - Space", "description": "\"This is a great opportunity to see images from the newest space telescope.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/calling-citizen-scientists-help-nasas-galaxy-zoo-classify-galaxies-seen-by-james-webb-space-telescope", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fQYxGLYYf3HxRYsjpk3mED.png", "publishedAt": "2025-05-11T16:05:35Z", "content": "NASA is seeking the public's help to classify thousands of galaxies imaged by the James Webb Space Telescope (JWST).\r\nThrough the citizen science project\r\n, called Galaxy Zoo (part of the Zooniverse … [+2078 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "With teeth like knives, this giant kept the young tyrannosaurs at bay - Earth.com", "description": "Ulughbegasaurus, a giant predator from 90 million years ago that eclipsed the first tyrannosaurs, has been discovered.", "url": "https://www.earth.com/news/with-teeth-like-knives-this-giant-kept-the-young-tyrannosaurs-at-bay/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07031615/knife-teeth-giant-ulughbegasaurus-tyrannosaurs.jpg", "publishedAt": "2025-05-11T14:59:17Z", "content": "A massive dinosaur once roamed ancient Central Asia, overshadowing the smaller ancestors of well-known tyrants. Its fossilized jaw left behind clues about a predator that was anything but ordinary.\r\n… [+5017 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Cells That Predict What Comes Next, Even When It’s New - Neuroscience News", "description": "A new study reveals that the brain uses special neurons to track where we are in a sequence of actions—not just where we are in space.", "url": "https://neurosciencenews.com/neurons-prediction-neuroscience-28882/", "urlToImage": "https://neurosciencenews.com/files/2025/05/neuron-prediction-neuroscience.jpg", "publishedAt": "2025-05-11T14:24:34Z", "content": "Summary: A new study reveals that the brain uses special neurons to track where we are in a sequence of actions, not just where we are in space. In mice, researchers found goal-progress cells that fi… [+8246 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "Department of Energy-Funded Fusion Breakthrough Achieves “Paradigm Shift” in Magnetic Confinement - The Debrief", "description": "Scientists have achieved a breakthrough in magnetic confinement that could potentially quicken the advancement for fusion energy.", "url": "https://thedebrief.org/department-of-energy-funded-fusion-breakthrough-achieves-paradigm-shift-in-magnetic-confinement/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/stellarator.jpg", "publishedAt": "2025-05-11T13:36:25Z", "content": "Scientists have achieved a breakthrough in magnetic confinement that could potentially quicken the advancement for fusion energy by enabling faster and more accurate ways to trap high-energy particle… [+4382 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "MIT Physicists Snap the First Ever Images of Atoms–Capturing Them in Their ‘Free-Range’ States - Good News Network", "description": "MIT physicists have captured the first images of individual atoms freely interacting in space— “free-range” particles never seen before.", "url": "https://www.goodnewsnetwork.org/mit-physicists-snap-the-first-images-of-atoms-in-their-free-range-states/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/05/Two-types-of-atoms-bosons-on-the-left-exhibit-bunching-while-the-fermions-on-the-right-display-anti-bunching-Credit-Sampson-Wilcox-MIT-RELEASED.jpg", "publishedAt": "2025-05-11T12:43:56Z", "content": "Two types of atoms, bosons on the left exhibit bunching while the fermions on the right display anti-bunching Credit: Sampson Wilcox / MIT\r\nMIT physicists have captured the first images of individual… [+5463 chars]"}, {"source": {"id": null, "name": "Thequantuminsider.com"}, "author": "Matt Swayne", "title": "Study Suggests Quantum Entanglement May Rewrite the Rules of Gravity - The Quantum Insider", "description": "A new study proposes that quantum information -- encoded in entanglement entropy -- directly influences the curvature of spacetime.", "url": "https://thequantuminsider.com/2025/05/11/study-suggests-quantum-entanglement-may-rewrite-the-rules-of-gravity/", "urlToImage": "https://thequantuminsider.com/wp-content/uploads/2025/05/Entanglement-Study-Image.png", "publishedAt": "2025-05-11T12:27:53Z", "content": null}, {"source": {"id": null, "name": "Www.joe.ie"}, "author": "Seán Crosbie", "title": "Massive volcano in US predicted to erupt today - JOE.ie", "description": "It last erupted in 2015.A massive volcano in the USA is predicted to erupt today. The Axial Seamount is a...", "url": "https://www.joe.ie/news/massive-volcano-in-us-predicted-to-erupt-today-843491", "urlToImage": "https://www.joe.ie/uploads/2025/05/breaking3-2.webp?height=431&width=767", "publishedAt": "2025-05-11T12:19:06Z", "content": "A massive volcano in the USA is predicted to erupt today. \r\nThe Axial Seamount is a mile-wide underwater volcano that sits 300 miles off the coast of Oregon, and according to the National Science Fou… [+1686 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Demosthenes Koutsogeorgis, Matthew Spink", "title": "Scientists clear major roadblocks in mission to build powerful AI photonic chips - Live Science", "description": "Two studies show major progress in the field of photonic microchips.", "url": "https://theconversation.com/next-generation-computer-chips-could-process-data-at-the-speed-of-light-new-research-254104", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eiQAd7gTAJzd4QoK5yvGSh.jpg", "publishedAt": "2025-05-11T11:00:00Z", "content": "Electronic microchips are at the heart of the modern world. They're found in our laptops, our smartphones, our cars and our household appliances. For years, manufacturers have been making them more p… [+4519 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Yasemin Saplakoglu", "title": "Intelligence on Earth Evolved Independently at Least Twice - WIRED", "description": "Complex neural circuits likely arose independently in birds and mammals, suggesting that vertebrates evolved intelligence multiple times.", "url": "https://www.wired.com/story/intelligence-evolved-at-least-twice-in-vertebrate-animals/", "urlToImage": "https://media.wired.com/photos/681b437381ee2abc2ae13f86/191:100/w_1280,c_limit/NeuralIntelligence-crSamanthaMash-Lede.jpeg", "publishedAt": "2025-05-11T11:00:00Z", "content": "How we end up with similar circuitry was more flexible than I would have expected, Zaremba said. You can build the same circuits from different cell types.\r\nZaremba and her team also found that in th… [+4904 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Timothy McGill", "title": "Scientists launch $23 million Arctic mission to uncover what's hidden beneath the ice: 'We have basically no information' - Yahoo", "description": "Studying what is happening in the Arctic is vital.", "url": "https://www.yahoo.com/news/scientists-launch-23-million-arctic-103052421.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ljtXQeX3hSoYzmBdu5Rm4Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/ed92f1a5e43b0ede55f5a9f3e8814422", "publishedAt": "2025-05-11T10:30:52Z", "content": "A drifting science station designed for research in the Arctic is scheduled to carry out 10 successive missions from 2025 to 2046, where it will remain stuck in the ice for 90% of its expedition time… [+3283 chars]"}]}