{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "William Harwood", "title": "Artemis 1 spacecraft heads for Sunday splashdown to wrap up historic mission - CBS News", "description": "Closing out a 25-day flight around the moon, NASA's Orion capsule is on course for Sunday return to Earth.", "url": "https://www.cbsnews.com/news/artemis-1-spacecraft-heads-for-sunday-splashdown-to-wrap-up-historic-mission/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2022/12/10/84e8ebbb-d59c-4505-becf-88702d5ad0ac/thumbnail/1200x630/d4965f70f3724617fb98c18048bbcb95/121022-earth-moona.jpg", "publishedAt": "2022-12-11T02:22:00Z", "content": "Closing out a 25-day voyage around the moon, NASA's Artemis 1 spacecraft closed in on Earth Saturday, on track for a 25,000-mph re-entry Sunday that will subject the unpiloted capsule to a hellish 5,… [+6825 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Oldest known galaxies spotted by James Webb Space Telescope - Fox News", "description": "A group of international astronomers used data from the James Webb Space Telescope's observations to report the discoveries of the earliest known galaxies.", "url": "https://www.foxnews.com/science/oldest-known-galaxies-spotted-james-webb-space-telescope", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/12/NASA-RESEARCH.png", "publishedAt": "2022-12-10T19:41:51Z", "content": "A group of international astronomers has used data from the James Webb Space Telescope to report the discovery of the earliest galaxies confirmed to date. \r\nIn work, which NASA noted has not yet been… [+4992 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Physicist Says the Laws of Physics Don't Actually Exist - Futurism", "description": "Most scientists believe in an immutable set of \"laws of physics\" — but one outlier among their ranks thinks those \"laws\" might not exist at all.", "url": "https://futurism.com/the-byte/physics-laws-not-real", "urlToImage": "https://wp-assets.futurism.com/2022/12/physics.jpg", "publishedAt": "2022-12-10T17:36:35Z", "content": "\"Like peeling an infinite onion, the more we peel, the more there is to peel.\"\r\nGalaxy Brain\r\nThe majority of physicists live under the assumption of a strict and immutable set of laws that govern th… [+2464 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Detects Mysterious Ghostly Glow Surrounding Our Solar System - SciTechDaily", "description": "Exhaust from Infalling Comets Makes Space a Dusty Place Imagine walking into a room at night, turning off all the lights, and closing the shades. Yet an eerie glow comes from the walls, ceiling, and floor. The faint light is barely enough to see your hands be…", "url": "https://scitechdaily.com/mysterious-ghostly-glow-detected-surrounding-our-solar-system/", "urlToImage": "https://scitechdaily.com/images/Hubble-Detects-Ghostly-Glow-Surrounding-Our-Solar-System-Annotated.jpg", "publishedAt": "2022-12-10T11:34:25Z", "content": "BySpace Telescope Science InstituteDecember 10, 2022\r\nThis artists illustration shows the location and size of a hypothetical cloud of dust surrounding our solar system. Credit: NASA, ESA, Andi James… [+11002 chars]"}, {"source": {"id": null, "name": "Dailykos.com"}, "author": null, "title": "The fingernails clinging onto Thwaites Glacier appear to be peeling off. - Daily Kos", "description": "Thwaites glacier front in the vulnerable West Antarctica sector is very broad (70 miles wide where it meets the ocean) and, in its entirety, is the size of Florida. The glacier is the most feared as it decays rapidly and threatens coastal cities...", "url": "https://www.dailykos.com/story/2022/12/9/2140899/-The-fingernails-clinging-onto-Twaites-Glacier-appear-to-be-peeling-off", "urlToImage": "https://images.dailykos.com/images/878860/story_image/121067651_10157242265766372_4274840183611916090_o1.jpg?1604568453", "publishedAt": "2022-12-10T01:08:18Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "This Hellish Planet Orbits its Star Every 18 Hours. How Did it Get There? - Universe Today", "description": "Astronomers discovered 55 Cancri e in 2004. That was five years before NASA’s Kepler planet-hunting spacecraft was launched, and exoplanet science has come a long way in the intervening years. Astronomers discovered the planet with the radial velocity method …", "url": "https://www.universetoday.com/159093/this-hellish-planet-orbits-its-star-every-18-hours-how-did-it-get-there/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/12/ynews-55cnce_shadow.jpg", "publishedAt": "2022-12-09T21:32:59Z", "content": "Astronomers discovered 55 Cancri e in 2004. That was five years before NASA’s Kepler planet-hunting spacecraft was launched, and exoplanet science has come a long way in the intervening years. Astron… [+12631 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Ankylosaurs used their sledgehammer tails to fight each other - CNN", "description": "Armored dinosaurs called ankylosaurs might have wielded sledgehammer-like tail clubs against one another in conflict, in addition to warding off predators like the Tyrannosaurus rex.", "url": "https://www.cnn.com/2022/12/09/world/ankylosaur-weapon-tail-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221209115711-02-ankylosaur-zuul.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-09T19:58:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nArmored dinosaurs called ankylosaurs might have wielde… [+3863 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Maddie Burakoff, Associated Press", "title": "Oldest DNA reveals life in Greenland 2 million years ago - KSL.com", "description": "Scientists discovered the oldest known DNA and used it to reveal what life was like two million years ago in the northern tip of Greenland. Today, it's a barren Arctic desert, but back then it was a lush landscape of trees and vegetation with an array of anim…", "url": "https://www.ksl.com/article/50535614/oldest-dna-reveals-life-in-greenland-2-million-years-ago", "urlToImage": "https://img.ksl.com/slc/2906/290600/29060000.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-12-09T15:56:15Z", "content": "Estimated read time: 4-5 minutes\r\nNEW YORK Scientists discovered the oldest known DNA and used it to reveal what life was like 2 million years ago in the northern tip of Greenland. Today, it's a barr… [+4983 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Best of Last Year: The top Phys.org articles of 2022 - Phys.org", "description": "It was a good year for research of all kinds as three men shared the Nobel Prize in physics for their work that showed that tiny particles separated from one another at great distances can be entangled. Alain Aspect, John Clauser and Anton Zeilinger won the a…", "url": "https://phys.org/news/2022-12-year-articles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/2022.jpg", "publishedAt": "2022-12-09T15:28:30Z", "content": "It was a good year for research of all kinds as three men shared the Nobel Prize in physics for their work that showed that tiny particles separated from one another at great distances can be entangl… [+10403 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Griffin", "title": "Earth has been hit by an 'unusual, intense blast of energy' from nearby galaxy that could change our understanding of the universe - msnNOW", "description": "‘This event looks unlike anything else we have seen before,’ says one scientist", "url": "https://www.independent.co.uk/space/nasa-blast-energy-burst-gamma-ray-grb-b2240729.html", "urlToImage": "https://static.independent.co.uk/2022/12/07/16/Low-Res_Unknown.png.png?quality=75&width=1200&auto=webp", "publishedAt": "2022-12-09T14:24:40Z", "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox\r\nSign up to our free IndyTech newsletter\r\nEarth has been hit by an intense, unusual blast of light that could change ou… [+3631 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Photographer Captures Magical Moment Mars Emerges from Behind the Moon - PetaPixel", "description": "The rare event required lots of planning.", "url": "https://petapixel.com/2022/12/09/photographer-captures-magical-moment-mars-emerges-from-behind-the-moon/", "urlToImage": "https://petapixel.com/assets/uploads/2022/12/marsmoon.jpg", "publishedAt": "2022-12-09T11:35:40Z", "content": "Astrophotographer Andrew McCarthy captured Mars rising behind the full Moon which temporarily eclipsed the Red Planet in the night sky on Wednesday. \r\nMcCarthy tells PetaPixel that he had been monito… [+2197 chars]"}]}