{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "These 7 Wild Concepts Are in the Running For NASA’s Next Big Mission - Gizmodo", "description": "The document builds on the academies' decadal survey, outlining recommended missions for NASA's next New Frontiers program.", "url": "https://gizmodo.com/these-7-wild-concepts-are-in-the-running-for-nasas-next-big-mission-2000568254", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/dragonfly-landing-titan.jpg", "publishedAt": "2025-02-26T15:10:25Z", "content": "What should NASA explore next? The National Academies of Sciences, Engineering, and Medicine just published its proposed science themes for NASA’s fifth New Frontiers mission, outlining key prioritie… [+4096 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Strange connection between deep space cosmic rays and Earth virus evolution - Earth.com", "description": "A supernova explosion about 2.5 million years ago sent cosmic rays to Earth. Around that time, virus diversity in Lake Tanganyika increased.", "url": "https://www.earth.com/news/did-cosmic-rays-shape-the-evolution-of-ancient-viruses/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/26072411/Cosmic-rays.jpg", "publishedAt": "2025-02-26T14:36:03Z", "content": "More than two million years ago, something unusual happened to the viruses that infect fish in Lake Tanganyika, East Africa. The different types of viruses diversified rapidly indicating heightened m… [+5669 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Astrophotographer captures 'rare' planetary parade as 7 planets align in the night sky (photo) - Space.com", "description": "Seven worlds align under one sky in a breathtaking photograph captured by astrophotographer Josh Dury.", "url": "https://www.space.com/astrophotographer-captures-rare-planetary-alignment-seven-planets-february-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v28U7kaa2Sb33QDHzrndMn-1200-80.jpg", "publishedAt": "2025-02-26T14:00:00Z", "content": "Seven planets align across the sky above the Mendip Hills, U.K. An annotated version of the image can be found further down in the article. (Image credit: Josh Dury)\r\nAstrophotographer Josh Dury capt… [+3577 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "'Utterly cataclysmic': James Webb telescope spots 2 alien planets disintegrating before our eyes - Livescience.com", "description": "In world-first observations, the James Webb Space Telescope is watching two distant alien planets \"spilling their guts into space\" as they rapidly disintegrate — and scientists are elated at what they've found.", "url": "https://www.livescience.com/space/exoplanets/utterly-cataclysmic-james-webb-telescope-spots-2-alien-planets-disintegrating-before-our-eyes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RGRtpEtLcSLfyfWWdsSSYB-1200-80.jpg", "publishedAt": "2025-02-26T13:00:00Z", "content": "Astronomers have directly observed two worlds beyond our solar system\r\n shedding their outer layers into space for the first time. The new observations offer an unprecedented glimpse into the interio… [+3786 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Lived for 400 Years in Greenland’s Icy Waters, This 6-Meter Shark Could Hold the Secret to Defying Aging - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath Greenland’s icy waters, a massive 6-meter shark has been silently roaming for centuries. Scientists recently uncovered surprising clues in its DNA that could reshape what we know about aging.", "url": "https://dailygalaxy.com/2025/02/lived-for-400-years-in-greenlands-icy-waters-this-6-meter-shark-could-hold-the-secret-to-defying-aging/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Greenland-Shark.jpg", "publishedAt": "2025-02-26T12:45:00Z", "content": "Deep beneath the icy waters of the North Atlantic and Arctic, a mysterious predator glides silently through the darkness. The Greenland shark, one of the longest-living vertebrates on Earth, has baff… [+3374 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "SpaceX says bad vibes most likely cause of Starship 7 flop - The Register", "description": "All fixed for Flight Test Eight, OK?", "url": "https://www.theregister.com/2025/02/26/spacex_harmonic_response_starship/", "urlToImage": "https://regmedia.co.uk/2023/04/17/starship-first-orbit-launch.jpg", "publishedAt": "2025-02-26T11:45:00Z", "content": "As SpaceX prepares for a Friday launch of its next Starship flight test, Elon Musk's biz has explained that the failure of the previous test was due to a harmonic response.\r\nThe return of the Super H… [+2536 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Justin Housman", "title": "Scientists discover breakthrough method to make fuel cheaper and easier to produce — and it could drastically change the future of global energy - Yahoo", "description": "It throws open the door for expanding ... production at scale, cheaply.", "url": "https://www.yahoo.com/tech/scientists-discover-breakthrough-method-fuel-103044342.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/A73s_fB1KH7LCkkIRL7grg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/e18ebf272c8c02b27d4024da23312682", "publishedAt": "2025-02-26T10:30:44Z", "content": "Researchers at Anemel, a European research organization, have just made a clean energy breakthrough. According to a new study published in the Energy &amp; Environmental Science journal, Anemel's res… [+2347 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Biofluorescence in Birds-of-Paradise, Revealing a Hidden Layer of Mating Displays - SciTechDaily", "description": "Birds-of-paradise have long fascinated scientists with their dazzling courtship displays, but new research reveals they have an even more striking secret—they glow under ultraviolet light! Scientists have discovered widespread biofluorescence in these birds, …", "url": "https://scitechdaily.com/scientists-discover-biofluorescence-in-birds-of-paradise-revealing-a-hidden-layer-of-mating-displays/", "urlToImage": "https://scitechdaily.com/images/Emperor-Bird-of-Paradise-Biofluorescence.jpg", "publishedAt": "2025-02-26T03:33:38Z", "content": "Scientists have uncovered a hidden layer of visual communication in birds-of-paradise—biofluorescence. Nearly all species in this group glow under UV light, with males displaying vibrant flashes to a… [+4804 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "NASA's New Mission Will Create The Most Colorful 3D Map of The Entire Sky - ScienceAlert", "description": "NASA expects to soon launch a mission to create the most colorful 3D map of the entire sky yet.", "url": "https://www.sciencealert.com/nasas-new-mission-will-create-the-most-colorful-3d-map-of-the-entire-sky", "urlToImage": "https://www.sciencealert.com/images/2025/02/SPHEREx-1.jpg", "publishedAt": "2025-02-26T03:19:30Z", "content": "NASA expects to soon launch a mission to create the most colorful 3D map of the entire sky yet. Known as SPHEREx, it will analyze every pixel to see what's there, what it's made of, and how far away … [+4097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Scientists say they’ve discovered why Mars is red - CNN", "description": "A study suggests Mars takes its red hue from a type of mineral that forms in cool water, which could reveal insights about whether Mars was ever able to support life.", "url": "https://www.cnn.com/2025/02/25/science/why-mars-is-red/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/near-ir-green-and-near-uv-colour-view-of-mars.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-26T02:57:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith its iconic rusty hue, Mars has long been called t… [+9088 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "AP", "title": "Asteroid 2024 YR4 Is No Longer A Threat To Earth, Scientists Say - HuffPost", "description": "Scientists have finally given the all-clear to Earth from a newly discovered asteroid.", "url": "https://www.huffpost.com/entry/newly-discovered-asteroid-no-longer-threat_n_67be8125e4b08044e02c045a", "urlToImage": "https://img.huffingtonpost.com/asset/67be812618000024007ba535.jpeg?ops=1200_630", "publishedAt": "2025-02-26T02:50:57Z", "content": "This image made available by University of Hawaii's asteroid impact alert system shows the motion of asteroid 2024 YR4 over about one hour, Dec. 27, 2024. (ATLAS / University of Hawaii / NASA via AP)… [+2878 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Zach Clark", "title": "WATCH LIVE: SpaceX Set for Falcon 9 Rocket Launch Tonight from Cape Canaveral - SpaceCoastDaily.com", "description": "SpaceX is targeting Monday, February 24 for a Falcon 9 launch of 21 Starlink satellites, including 13 with Direct to Cell capabilities, to low-Earth orbit from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station in Florida.", "url": "https://spacecoastdaily.com/2025/02/watch-live-spacex-set-for-falcon-9-rocket-launch-tonight-from-cape-canaveral/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2019/11/SpaceX-Starlink-580-2.jpg", "publishedAt": "2025-02-26T01:20:39Z", "content": "Home » Home » WATCH LIVE: SpaceX Set for Falcon 9 Rocket Launch Tonight from Cape CanaveralBy Space Coast Daily  //  February 25, 2025 \r\nWATCH LIVE:SpaceX Ready to Launch Falcon 9 Rocket Tonight from… [+1186 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "This Is Getting To Be Frustrating - NASA Watch", "description": "My bullshit meter has pegged again.", "url": "https://nasawatch.com/personnel-news/this-is-getting-to-be-frustrating/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/02/bullshit-meter.png", "publishedAt": "2025-02-25T21:29:58Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Katherine Kretke", "title": "Lucy spacecraft takes its first images of asteroid Donaldjohanson - Phys.org", "description": "NASA's Lucy spacecraft has its next flyby target, the small main belt asteroid Donaldjohanson, in its sights. By blinking between images captured by Lucy on Feb. 20 and 22, this animation shows the perceived motion of Donaldjohanson relative to the background…", "url": "https://phys.org/news/2025-02-lucy-spacecraft-images-asteroid-donaldjohanson.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/lucy-spacecraft-takes.jpg", "publishedAt": "2025-02-25T21:23:39Z", "content": "NASA's Lucy spacecraft has its next flyby target, the small main belt asteroid Donaldjohanson, in its sights. By blinking between images captured by Lucy on Feb. 20 and 22, this animation shows the p… [+3182 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Forgotten Eruption That Cooled the Earth and Turned the Sun Green - The Daily Galaxy --Great Discoveries Channel", "description": "In 1831, a mysterious force cooled the planet and turned the Sun an eerie shade of green—but no one knew why. Now, scientists have finally uncovered the hidden volcanic eruption responsible for this bizarre phenomenon. Could another unnoticed volcano be lurki…", "url": "https://dailygalaxy.com/2025/02/eruption-cooled-earth-and-turned-sun-green/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/The-Forgotten-Eruption-That-Cooled-the-Earth-and-Turned-the-Sun-Green.jpg", "publishedAt": "2025-02-25T20:30:00Z", "content": "In 1831, a massive volcanic eruption in the Kuril Islands sent sulfur-laden ash high into the sky, cooling the planet and tinting the Sun green. \r\nThe volcano, known as Zavaritzki, remained a mystery… [+3219 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Scientists Just Found a Faster, Cheaper Way to Store Carbon Permanently - SciTechDaily", "description": "A team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals. By enhancing the natural weathering process, their technique creates reactive materials that absorb carbon at unprecedented rates. This scalable appr…", "url": "https://scitechdaily.com/stanford-scientists-just-found-a-faster-cheaper-way-to-store-carbon-permanently/", "urlToImage": "https://scitechdaily.com/images/Olivine-Aerolie-Weathering-Naturally.jpg", "publishedAt": "2025-02-25T20:12:01Z", "content": "Olivine aérolie weathering naturally. Credit: Renhour48 via Wikimedia\r\nA team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals.\r\nBy enhancing the … [+7943 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Geologists Have Long Searched for Gold Hydrogen. A New Study Finally Shows Where It’s Hiding. - Yahoo", "description": "Now we just have to find it.", "url": "https://www.popularmechanics.com/science/environment/a63905035/hydrogen-mountains/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kk8k_HfM7qTRVe_Qf277ug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/popular_mechanics_642/e969cd1a49dac19e68c21b028ab2d8fb", "publishedAt": "2025-02-25T19:00:00Z", "content": "<ul><li>While hydrogen is on the verge of being a world-changing fuel source, its creation still relies largely on natural gas, making the fuel less-than-ideal in a world increasingly focused on deca… [+4303 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Russ Nelson", "title": "Breakthrough enables measurement of local dark matter density using direct acceleration measurements - Phys.org", "description": "Dr. Sukanya Chakrabarti, the Pei-Ling Chan Endowed Chair in the College of Science at The University of Alabama in Huntsville (UAH), and her team have pioneered the use of gravitational acceleration measurements of binary pulsars to help illuminate just how m…", "url": "https://phys.org/news/2025-02-breakthrough-enables-local-dark-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/uah-breakthrough-enabl.jpg", "publishedAt": "2025-02-25T18:26:45Z", "content": "Dr. Sukanya Chakrabarti, the Pei-Ling Chan Endowed Chair in the College of Science at The University of Alabama in Huntsville (UAH), and her team have pioneered the use of gravitational acceleration … [+6307 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Something Shook Titan’s Orbit, and Scientists Are Racing to Solve the Mystery - SciTechDaily", "description": "Scientists are investigating Saturn’s moon Titan to understand how tidal forces affect its orbit, revealing clues about its internal structure and past changes. This research indicates Titan’s orbit is evolving rapidly on a geologic timescale, implying an eve…", "url": "https://scitechdaily.com/something-shook-titans-orbit-and-scientists-are-racing-to-solve-the-mystery/", "urlToImage": "https://scitechdaily.com/images/Titan-Moon-Orbits-Saturn.jpg", "publishedAt": "2025-02-25T18:08:47Z", "content": "SwRI studied Saturn’s moon Titan to assess its tidal dissipation rate, the energy lost as it orbits the ringed planet with its massive gravitational force. Understanding tidal dissipation helps scien… [+4329 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jorge Garay", "title": "Something Unexpected Is Spewing Stars Into the Milky Way - WIRED", "description": "Fast-moving stars in the Milky Way indicate there could be a supermassive black hole in the neighboring Large Magellanic Cloud—something that has never been detected in a smaller galaxy.", "url": "https://www.wired.com/story/large-magellanic-cloud-supermassive-black-hole/", "urlToImage": "https://media.wired.com/photos/67b6196d3a2dde1bc2bc31fa/191:100/w_1280,c_limit/galaxia%20gran%20nube%20de%20magallanes.jpg", "publishedAt": "2025-02-25T18:05:01Z", "content": "New research from a team at the Harvard Center for Astrophysics suggests that the Large Magellanic Cloud, a dwarf galaxy neighboring the Milky Way, hosts a gravitational structure hundreds of thousan… [+3163 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Vienna", "title": "Solar system's journey through Orion complex 14 million years ago may have altered Earth's climate - Phys.org", "description": "An international research team led by the University of Vienna has discovered that the solar system traversed the Orion star-forming complex, a component of the Radcliffe Wave galactic structure, approximately 14 million years ago. This journey through a dens…", "url": "https://phys.org/news/2025-02-solar-journey-orion-complex-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-galactic-journey-o-1.jpg", "publishedAt": "2025-02-25T17:50:34Z", "content": "An international research team led by the University of Vienna has discovered that the solar system traversed the Orion star-forming complex, a component of the Radcliffe Wave galactic structure, app… [+5225 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Science reveals how to bring gold to the surface from Earth's mantle - Earth.com", "description": "International scientists reveal that magma transports gold from the mantle to the surface by means of a sulfur complex.", "url": "https://www.earth.com/news/science-reveals-how-to-bring-gold-to-the-surface-from-earths-mantle/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/25043029/gold-mantle-extraction-science.jpg", "publishedAt": "2025-02-25T17:31:00Z", "content": "Gold is more abundant in Earths bulk composition than lead. Its presence on the surface, however, has long been a puzzle because gold atoms prefer to stay buried far below. \r\nOn December 29, 2024, a … [+4428 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Technical University Munich", "title": "A completely new type of microscopy based on quantum sensors - Phys.org", "description": "Researchers at the Technical University of Munich (TUM) have invented an entirely new field of microscopy called nuclear spin microscopy. The team can visualize magnetic signals of nuclear magnetic resonance with a microscope. Quantum sensors convert the sign…", "url": "https://phys.org/news/2025-02-microscopy-based-quantum-sensors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-completely-new-type-1.jpg", "publishedAt": "2025-02-25T17:28:03Z", "content": "Researchers at the Technical University of Munich (TUM) have invented an entirely new field of microscopy called nuclear spin microscopy. The team can visualize magnetic signals of nuclear magnetic r… [+2958 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of North Carolina at Chapel Hill", "title": "Bubbles that break rules: A fluid discovery that defies logic - Phys.org", "description": "A team led by researchers at UNC-Chapel Hill have made an extraordinary discovery that is reshaping our understanding of bubbles and their movement. Picture tiny air bubbles inside a container filled with liquid. When the container is shaken up and down, thes…", "url": "https://phys.org/news/2025-02-fluid-discovery-defies-logic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/bubbles-that-break-the.jpg", "publishedAt": "2025-02-25T17:11:01Z", "content": "A team led by researchers at UNC-Chapel Hill have made an extraordinary discovery that is reshaping our understanding of bubbles and their movement. Picture tiny air bubbles inside a container filled… [+6442 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "'Most powerful electromagnet' set for testing to boost space propulsion - Interesting Engineering", "description": "Victoria University researchers are developing powerful superconducting magnets for electric propulsion, set to be tested on the ISS.", "url": "https://interestingengineering.com/innovation/most-powerful-magnet-superconducting-thrusters", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/Heki.jpg", "publishedAt": "2025-02-25T16:52:00Z", "content": "To further test their electromagnet, the Paihau-Robinson team is developing its own thruster, called Kkako, at their lab in Wellington.\r\n“The Kkako thruster offers several advantages over existing el… [+953 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Nasas Europa Clipper Uses Mars To Go The Distance - NASA Jet Propulsion Laboratory", "description": "The orbiter bound for Jupiter’s moon Europa will investigate whether the moon is habitable, but it first will get the help of Mars’ gravitational force to get to deep space.", "url": "https://www.jpl.nasa.gov/news/nasas-europa-clipper-uses-mars-to-go-the-distance/", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1-Clipper_MGA.png", "publishedAt": "2025-02-25T16:48:35Z", "content": "Mission controllers have performed three TCMs to set the stage for the Mars gravity assist in early November, late January, and on Feb. 14. They will conduct another TCM about 15 days after the Mars … [+2155 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "5,000-Year-Old Pollution Discovered—And It Changes Everything We Knew About Ancient Greece! - The Daily Galaxy --Great Discoveries Channel", "description": "Ancient Greece's hidden legacy? New research reveals shocking evidence of pollution over 5,000 years ago—long before the industrial age.", "url": "https://dailygalaxy.com/2025/02/5000-year-old-pollution-ancient-greece/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/5000-Year-Old-Pollution-Discovered—And-It-Changes-Everything-We-Knew-About-Ancient-Greece.jpg", "publishedAt": "2025-02-25T16:00:00Z", "content": "The Ancient Greeks are often celebrated for their advancements in philosophy, democracy, and architecture, but new research reveals a lesser-known legacyenvironmental pollution. \r\nScientists have unc… [+3328 chars]"}, {"source": {"id": null, "name": "Howstuffworks.com"}, "author": "Ada Tseng", "title": "9 Largest Octopus Species Lurking in the Deep Blue Sea - Animals | HowStuffWorks", "description": "Octopuses are cephalopods that have three hearts and eight arms that are covered with suckers. The largest octopus is the giant Pacific octopus. As its name suggests, the Giant Pacific Octopus lives in the North Pacific Ocean.", "url": "https://animals.howstuffworks.com/marine-life/largest-octopus.htm", "urlToImage": "https://media.hswstatic.com/eyJidWNrZXQiOiJjb250ZW50Lmhzd3N0YXRpYy5jb20iLCJrZXkiOiJnaWZcL2dldHR5aW1hZ2VzLTExODUwODQ2NDAuanBnIiwiZWRpdHMiOnsicmVzaXplIjp7IndpZHRoIjoiMTIwMCJ9fX0=", "publishedAt": "2025-02-25T15:25:02Z", "content": null}, {"source": {"id": null, "name": "Binghamton.edu"}, "author": null, "title": "New study reveals Neanderthals experienced population crash 110,000 years ago - Binghamton University", "description": "A new study by an international team of scholars, including faculty at Binghamton University, suggests that Neanderthals experienced a dramatic loss of genetic variation during the course of their evolution, foreshadowing their eventual extinction.", "url": "https://www.binghamton.edu/news/story/5384/new-study-reveals-neanderthals-experienced-population-crash-110000-years-ago", "urlToImage": "https://www.binghamton.edu/news/images/uploads/features/_normal/Neanderthal_%281%29.png", "publishedAt": "2025-02-25T15:04:32Z", "content": "A new study by an international team of scholars, including faculty at Binghamton University, suggests that Neanderthals experienced a dramatic loss of genetic variation during the course of their ev… [+4432 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Alarming Discovery: Some Cities Are Sinking Faster Than the Oceans Are Rising - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s latest discovery reveals that sinking land is accelerating sea level rise, putting coastal cities at risk far sooner than expected.", "url": "https://dailygalaxy.com/2025/02/nasa-alarming-discovery-cities-sink-faster/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/NASAs-Alarming-Discovery-Some-Cities-Are-Sinking-Faster-Than-the-Oceans-Are-Rising.jpg", "publishedAt": "2025-02-25T14:10:00Z", "content": "A new NASA-led study has uncovered a hidden threat worsening sea level rise along the worlds coastlines. While melting glaciers and climate change have long been blamed for rising seas, land itself i… [+5083 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Pesala Bandara", "title": "This AI-Generated Optical Illusion Test Could Replace CAPTCHAs - PetaPixel", "description": "While AI can generate optical illusions, it struggles to recognize them.", "url": "https://petapixel.com/2025/02/25/this-ai-generated-optical-illusion-test-could-replace-captchas/", "urlToImage": "https://petapixel.com/assets/uploads/2025/02/illusion-captcha.jpg", "publishedAt": "2025-02-25T14:09:12Z", "content": "The “IllusionCAPTCHA” test takes an AI-generated image and alters it by incorporating an illusory word or object, such as an apple. AI bots are unable to recognize it.\r\nResearchers have developed a n… [+2430 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Owen Bellwood", "title": "NASA Awards SpaceX $100 Million Contract To Launch Asteroid Hunting Telescope - Jalopnik", "description": "NASA awarded SpaceX a $100 million contract to launch a new satellite that could monitor extraterrestrial threats to the Earth.", "url": "https://www.jalopnik.com/1798966/nasa-awards-spacex-100-million-contract-launch-asteroid-hunting-telescope/", "urlToImage": "https://www.jalopnik.com/img/gallery/nasa-awards-space-x-100-million-contract-to-launch-asteroid-hunting-telescope/l-intro-1740490749.jpg", "publishedAt": "2025-02-25T13:50:15Z", "content": "Once deployed to a site that scientists call the Sun-Earth Lagrange Point 1, NEO Surveyor will form part of our planetary defense system to scan for asteroids that are at least 460 feet across, Space… [+1059 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "When Did Life Appear on Earth? New Evidence Suggests It Started Shockingly Billions of Years Earlier than We Thought - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists once believed life took a billion years to emerge on Earth, but new evidence suggests it may have appeared almost instantly. Clues buried in ancient rocks and genetics are rewriting the timeline of our origins.", "url": "https://dailygalaxy.com/2025/02/when-did-life-appear-on-earth-new-evidence-suggests-it-started-shockingly-billions-of-years-earlier-than-we-thought/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/volcanic-planet-with-glowing-lava.jpg", "publishedAt": "2025-02-25T13:40:00Z", "content": "For decades, scientists believed that life on Earth took at least a billion years to get started. The prevailing idea was that the planets violent early historyespecially a period of intense asteroid… [+2932 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New dwarf galaxy discovered in the halo of Andromeda galaxy - Phys.org", "description": "An international team of astronomers reports the discovery of a new dwarf galaxy, which they have named Pegasus VII. The newfound galaxy, which lies about 2.4 million light years away, was identified in the Ultraviolet Near-Infrared Optical Northern Survey (U…", "url": "https://phys.org/news/2025-02-dwarf-galaxy-halo-andromeda.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-dwarf-galaxy-disco.jpg", "publishedAt": "2025-02-25T13:30:01Z", "content": "An international team of astronomers reports the discovery of a new dwarf galaxy, which they have named Pegasus VII. The newfound galaxy, which lies about 2.4 million light years away, was identified… [+3238 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jacqueline Minerd", "title": "NASA Prepares Gateway Lunar Space Station for Journey to Moon - NASA", "description": "Assembly is underway for Gateway's Power and Propulsion Element, the module that will power the lunar space station's journey to and around the Moon as part of NASA’s Artemis campaign.", "url": "https://www.nasa.gov/missions/artemis/nasa-prepares-gateway-lunar-space-station-for-journey-to-moon/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/jsc2024e081642-1.jpg", "publishedAt": "2025-02-25T13:03:23Z", "content": "Assembly is underway for Gateway's Power and Propulsion Element, the module that will power the lunar space station's journey to and around the Moon as part of NASAs Artemis campaign.\r\nNASAs Artemis … [+1454 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Tom Earnshaw", "title": "US Space Force shares first declassified photo from top secret X-37b mission - LADbible", "description": "The Boeing X-38B, or Orbital Test Vehicle, is used by the US Space Force to conduct secret experiments orbiting the Earth", "url": "https://www.ladbible.com/news/health/usa-secret-space-plane-first-image-released-431655-20250225", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blt4cdcfc2eb7243732/67bdabaf76acd3ac7f406853/Boeing_X-37.jpg", "publishedAt": "2025-02-25T13:01:23Z", "content": "The first image from the USA's secret space plane currently orbiting the world has been released by the United States military.\r\nDubbed X-37B or the Orbital Test Vehicle (OTV), it is the code name fo… [+2543 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "First dark matter search using WINERED spectrograph sets new lifetime constraints - Phys.org", "description": "Dark matter is an elusive type of matter that does not emit, absorb or reflect light and is thus impossible to detect using conventional techniques employed in particle physics. In recent years, groups of physicists worldwide have been trying to observe this …", "url": "https://phys.org/news/2025-02-dark-winered-spectrograph-lifetime-constraints.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-results-of-the-fir.jpg", "publishedAt": "2025-02-25T12:20:01Z", "content": "Dark matter is an elusive type of matter that does not emit, absorb or reflect light and is thus impossible to detect using conventional techniques employed in particle physics. In recent years, grou… [+6522 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "On March 29, a Once-in-a-Lifetime Celestial Event Will Plunge the North Pole and Europe Into Darkness for Almost 4 Hours - The Daily Galaxy --Great Discoveries Channel", "description": "A solar eclipse in 2025 will briefly darken the sky, creating a momentary spectacle for those in the right place at the right time. While not a total eclipse, it will still offer a striking view for millions.", "url": "https://dailygalaxy.com/2025/02/on-march-29-a-once-in-a-lifetime-celestial-event-will-plunge-the-north-pole-and-europe-into-darkness-for-almost-4-hours/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Eclipse.jpg", "publishedAt": "2025-02-25T12:15:00Z", "content": "The year 2025 will bring two solar eclipses, offering skywatchers a chance to witness one of the most awe-inspiring celestial events. The first, a partial eclipse in March, will provide a spectacular… [+3583 chars]"}, {"source": {"id": null, "name": "Umontreal.ca"}, "author": "Heidi White", "title": "JWST Forecasts Partially Cloudy Skies on Ultra-Hot Neptune LTT 9779 b - News | Institute for Research on Exoplanets", "description": "Montréal, Canada—A team of researchers led by Louis-Philippe Coulombe, a graduate student at the Université de Montréal's Trottier Institute for Research on Exoplanets (IREx), has used the James Webb Space Telescope (JWST) to explore the exotic atmosphere of …", "url": "https://exoplanetes.umontreal.ca/en/jwst-forecasts-partially-cloudy-skies-on-ultra-hot-neptune-ltt-9779-b/", "urlToImage": null, "publishedAt": "2025-02-25T12:00:41Z", "content": "Montréal, CanadaA team of researchers led by Louis-Philippe Coulombe, a graduate student at the Université de Montréal’s Trottier Institute for Research on Exoplanets (IREx), has used the James Webb … [+7615 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "Blue Ghost spacecraft captures rare, stunnning views of Earth eclipsing the moon - Livescience.com", "description": "Firefly Aerospace's Blue Ghost spacecraft took some unique photos of our home planet on its Mission 1 flight to the moon in late January and early February. The spacecraft is now in orbit around the moon, with a planned landing date of March 2.", "url": "https://www.livescience.com/space/space-exploration/blue-ghost-spacecraft-captures-rare-stunnning-views-of-earth-eclipsing-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/33sX7vNeGZ7YdNBKWcBoxS-1200-80.jpg", "publishedAt": "2025-02-25T12:00:00Z", "content": "A \"ghostly\" spacecraft has shared a treasure trove of vacation photos from its recent trip into orbit, including a stunning selfie with Earth eclipsing the moon in the background.\r\nThis \"ghost\" isn't… [+3846 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "iain.todd@ourmedia.co.uk", "title": "Mercury and Saturn are close together in the evening sky tonight. Here's how to see them - Sky at Night Magazine", "description": null, "url": "https://www.skyatnightmagazine.com/news/mercury-saturn-25-february-2025", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2025/02/mercury-saturn-25-february-2025.jpg?w=1200", "publishedAt": "2025-02-25T11:51:46Z", "content": "Tonight, in the early evening of 25 February 2025, Mercury and Saturn will be close together in the twilight sky, making for a beautiful conjunction of the two planets.\r\nEveryone's talking about the … [+3253 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Maria Mocerino", "title": "‘Giant’ flying squirrels once soared like bats in prehistoric US - Interesting Engineering", "description": "Researchers in Tennessee discover extremely rare fossil of a giant flying squirrel that arrived during the last Ice Age.", "url": "https://interestingengineering.com/science/5-million-year-old-fossil-reveals-giant-flying-squirrel-in-north-america", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/Screen-Shot-2025-02-25-at-3.48.17-PM.png", "publishedAt": "2025-02-25T11:38:00Z", "content": "When researchers found this curious-looking kite sailing between trees, as WJHL reported, they gathered it wasnt a regular squirrel, but nothing like it had ever been seen in the United States before… [+856 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Ananthapathmanabhan", "title": "‘Now I see you moment’ for Andhra-origin scientist. How her team identified 2,500 potential black holes - ThePrint", "description": "Discovery triples known active black holes in dwarf galaxies, doubles intermediate black hole candidates, and challenges theories on their formation in massive galaxies.", "url": "https://theprint.in/science/now-i-see-you-moment-for-andhra-origin-scientist-how-her-team-identified-2500-potential-black-holes/2510660/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2025/02/Pucha-in-front-of-Subaru-and-Keck-telescopes-in-Maunakea-Hawaii-By-special-arrangement.jpg", "publishedAt": "2025-02-25T11:31:34Z", "content": "But it is the discovery of intermediate mass black hole candidates that has the team buzzing with excitement. While scientists have confirmed the existence of supermassive black holes (imagine an adu… [+5696 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Geysers on Saturn's icy moon Enceladus may form from a 'mushy zone' - Phys.org", "description": "Searching for life on other celestial bodies, or at the very least the necessary components to support it, has been fascinating scientists and enthusiasts for centuries. While planets are the obvious choice, their moons can also harbor the chemical ingredient…", "url": "https://phys.org/news/2025-02-geysers-saturn-icy-moon-enceladus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/geysers-on-saturns-icy.jpg", "publishedAt": "2025-02-25T11:30:01Z", "content": "Searching for life on other celestial bodies, or at the very least the necessary components to support it, has been fascinating scientists and enthusiasts for centuries. While planets are the obvious… [+5612 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joshua Nelken-Zitser", "title": "Mining the moon for minerals could be worth billions, but astronomers warn it's bad news for science - AOL", "description": "The moon has resources like rare earth elements and helium-3. But unfettered mining could be very bad news for scientific research, astronomers warn.", "url": "https://www.businessinsider.com/mining-moon-minerals-lucrative-bad-news-science-research-astronomists-2025-2", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/n7R6OwxZPvXwxPwp9xKRvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/aol_business_insider_articles_308/33e32c5eb17cc77b8fcd4bb8ace2be7f", "publishedAt": "2025-02-25T11:20:43Z", "content": "Mining the moon could be a huge money-making industry in the future.Yunus Turkyilmaz/Anadolu via Getty Images\r\n<ul><li>Moon mining could become a multibillion-dollar industry.\r\n</li><li>The moon hold… [+3613 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China to send a spacecraft out of the ecliptic to study the Sun’s poles - SpaceNews", "description": "HELSINKI — China plans to send a space observatory out of the plane of the ecliptic for a mission to study the poles of the sun. The Solar Polar Orbit Observatory is currently scheduled to launch i…", "url": "http://spacenews.com/china-to-send-a-spacecraft-out-of-the-ecliptic-to-study-the-suns-poles/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcL3N1bi14c3RyZWFtLVBJQTE4OTA2bWVkaXVtLW5hc2EtMTAyNHg1MjAuanBnIiwidHh0IjoiQ2hpbmEgdG8gc2VuZCBhIHNwYWNlY3JhZnQgb3V0IG9mIHRoZSBlY2xpcHRpYyB0byBzdHVkeSB0aGUgU3VuXHUyMDE5cyBwb2xlcyIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.1nzXogkwryGUbVf5XaEg1JgmnZVPlb2QsJvaTNRA3IIMQ", "publishedAt": "2025-02-25T11:17:38Z", "content": "HELSINKI China plans to send a space observatory out of the plane of the ecliptic for a mission to study the poles of the sun.\r\nThe Solar Polar Orbit Observatory is currently scheduled to launch in 2… [+4308 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Created Shape-Shifting Robots That Flow Like Liquid and Harden Like Steel - SciTechDaily", "description": "Researchers have designed a robotic material that transforms like a living organism. Inspired by embryos, these disk-shaped robots use magnets, motors, and light to shift between rigid and fluid states. The result? A self-healing, shape-shifting system that c…", "url": "https://scitechdaily.com/scientists-just-created-shape-shifting-robots-that-flow-like-liquid-and-harden-like-steel/", "urlToImage": "https://scitechdaily.com/images/Robot-Wrench.jpg", "publishedAt": "2025-02-25T11:15:52Z", "content": "An artist’s depiction of a material-like collective of robots forming a rigid device. Credit: Brian Long, University of California Santa Barbara, edited\r\nResearchers have designed a robotic material … [+6124 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "If Mars has microbe fossils, a laser and rock quarry in Algeria could help find them - Space.com", "description": "Scientist is proud to have led \"the first astrobiology study to involve Algeria,\" and believes that his findings are a major step towards finding evidence of life on Mars.", "url": "https://www.space.com/mars-microbes-laser-rock-quarry-algeria", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DkoawzoHm9wReCa4HGH6QX-1200-80.jpg", "publishedAt": "2025-02-25T11:00:00Z", "content": "Scientists searching for the fossilized remains of ancient microbes on Mars now have a better idea of what signs they should be looking for, thanks to a new study of Earthly microbial fossils embedde… [+6010 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Feather-light car heat shield is 100 times light, withstands 1832°F - Interesting Engineering", "description": "The development comes from Aegis FibreTech, a newly formed spin-out company of the University of Birmingham.", "url": "https://interestingengineering.com/innovation/engineers-forge-100-times-lighter-car-heat-shield", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/IE-16_276f28.jpg", "publishedAt": "2025-02-25T09:40:00Z", "content": "It is specifically engineered for high-temperature environments, such as those found around engines and exhaust systems in vehicles.\r\nLab testing of the new material, which is made up of eco-friendly… [+1002 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Earth from space: Rare 'sunglint' transforms the Mediterranean Sea into a swirling, silver mirror - Livescience.com", "description": "This 2022 astronaut photo reveals a menagerie of hidden oceanographic features surrounding a pair of Greek islands, including giant spinning currents and rarely seen \"internal waves.\"", "url": "https://www.livescience.com/planet-earth/rivers-oceans/earth-from-space-rare-sunglint-transforms-the-mediterranean-sea-into-a-swirling-silver-mirror", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bWfDfxGtoLfw43Dt2rgGkG-1200-80.jpg", "publishedAt": "2025-02-25T09:24:59Z", "content": "Where is it? Milos and Antimilos, Greece [36.78052336, 24.355555146]\r\nWhat's in the photo? The sun shining directly off the surface of the Mediterranean Sea\r\nWho took the photo? An unnamed astronaut … [+3151 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Measures of a 'Double Magic' Atom Reveal an Unexpected Surprise Inside - ScienceAlert", "description": "An experiment bludgeoning special lead atoms with high-speed particles has revealed a shocking surprise.", "url": "https://www.sciencealert.com/measures-of-a-double-magic-atom-reveal-an-unexpected-surprise-inside", "urlToImage": "https://www.sciencealert.com/images/2025/02/atomic-nucleus-getty.jpg", "publishedAt": "2025-02-25T06:35:23Z", "content": "An experiment bludgeoning special lead atoms with high-speed particles has revealed a shocking surprise.\r\nFar from the perfect sphere physicists from the University of Surrey expected to find, the he… [+3427 chars]"}, {"source": {"id": null, "name": "Disabilityscoop.com"}, "author": "Shaun Heasley", "title": "Astronaut With Disability Cleared To Go To Space Station - Disability Scoop", "description": "For the first time, an astronaut with a disability has been cleared for a mission to the International Space Station.", "url": "https://www.disabilityscoop.com/2025/02/25/astronaut-with-disability-cleared-to-go-to-space-station/31317/", "urlToImage": "https://www.disabilityscoop.com/wp-content/uploads/2025/02/ds250225_astronaut.jpg", "publishedAt": "2025-02-25T04:34:36Z", "content": "For the first time, an astronaut with a disability has been cleared for a mission to the International Space Station.\r\nThe European Space Agency said this month that John McFall has received medical … [+1250 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Black Hole The Size of 36 Billion Suns Could Lie at The Heart of Cosmic Horseshoe - ScienceAlert", "description": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about five-and-a-half billion light-years away.", "url": "https://www.sciencealert.com/black-hole-the-size-of-36-billion-suns-could-lie-at-the-heart-of-cosmic-horseshoe", "urlToImage": "https://www.sciencealert.com/images/2025/02/horseshoe_lens_header.jpg", "publishedAt": "2025-02-25T01:24:49Z", "content": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about five-and-a-half billion light-years away.\r\nThe foreground galaxy's mass magnifies and distorts … [+7614 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Surprise Spiral Shape Revealed in The Darkness Surrounding The Solar System - ScienceAlert", "description": "The edge of the Solar System is a strange place, full of oddities we've only just begun to probe.", "url": "https://www.sciencealert.com/surprise-spiral-shape-revealed-in-the-darkness-surrounding-the-solar-system", "urlToImage": "https://www.sciencealert.com/images/2025/02/SolarSystemEdge.jpg", "publishedAt": "2025-02-24T23:44:54Z", "content": "The edge of the Solar System is a strange place, full of oddities we've only just begun to probe. But perhaps the oddest of all is the Oort Cloud, a vast field of icy debris extending out to 100,000 … [+4635 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "You Can Ignore That OPM Email - NASA Watch", "description": "According to a variety of emails and postings and TV stories OPM has told everyone that any response to the Saturday OPM memo is \"voluntary\"", "url": "https://nasawatch.com/personnel-news/you-can-ignore-that-opm-email/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/02/cnnemial.png", "publishedAt": "2025-02-24T23:17:22Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Clea Simon", "title": "Accidental discovery may hint at answer to a chicken-or-egg question on evolution - Phys.org", "description": "For biochemists, it's the which-came-first question: oxygen production by photosynthesis or oxygen consumption by aerobic metabolism?", "url": "https://phys.org/news/2025-02-accidental-discovery-hint-chicken-egg.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/accidental-discovery-m.jpg", "publishedAt": "2025-02-24T21:48:04Z", "content": "For biochemists, it's the which-came-first question: oxygen production by photosynthesis or oxygen consumption by aerobic metabolism?\r\nIn photosynthesis, algae and plants take in sunlight to turn car… [+5216 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cheryl Pierce", "title": "Computational solution to model 3D RNA structures could speed medical discoveries by decades - Phys.org", "description": "Ribonucleic acid, commonly known as RNA, is involved in many biological functions, and some, including gene silencing, are utilized to cure diseases. RNA has recently gained attention as a promising drug target. Unfortunately, only a small fraction of RNA str…", "url": "https://phys.org/news/2025-02-solution-3d-rna-medical-discoveries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-advance-rn.jpg", "publishedAt": "2025-02-24T21:28:47Z", "content": "Ribonucleic acid, commonly known as RNA, is involved in many biological functions, and some, including gene silencing, are utilized to cure diseases. RNA has recently gained attention as a promising … [+4914 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "No More Singularities? Quantum Gravity Could Finally Solve the Black Hole Mystery - SciTechDaily", "description": "Scientists have discovered a way to create black holes without the mysterious singularities where physics breaks down. By using pure gravity rather than exotic matter, their new model challenges previous theories and brings us closer to understanding the true…", "url": "https://scitechdaily.com/no-more-singularities-quantum-gravity-could-finally-solve-the-black-hole-mystery/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Gravity-Black-Hole-Concept.jpg", "publishedAt": "2025-02-24T21:19:15Z", "content": "A groundbreaking study has shown that black holes can exist without singularities, eliminating the need for exotic matter. The discovery, based on quantum gravity corrections, offers a more natural e… [+5425 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "This \"blue button jellyfish\" isn't actually a jellyfish, so what is it? - Earth.com", "description": "The Blue Button jellyfish, or Porpita porpita, is not actually a jellyfish at all. It's a community of organisms working together.", "url": "https://www.earth.com/news/this-blue-button-jellyfish-isnt-actually-a-jellyfish-so-what-is-a-porpita/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/24134751/porpita_blue-button-jellyfish_1.jpg", "publishedAt": "2025-02-24T20:59:29Z", "content": "This bright blue creature might look like a single jellyfish drifting on the water, but it is actually a community of specialized polyps all working in unison. This hydrozoan, known as the Blue Butto… [+5818 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of British Columbia", "title": "Hydrogen becomes a superfluid at nanoscale, confirming 50-year-old prediction - Phys.org", "description": "Hydrogen nano-clusters at low temperatures display 'superfluidity'—a quantum state of frictionless flow only previously observed in helium.", "url": "https://phys.org/news/2025-02-hydrogen-superfluid-nanoscale-year.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/hydrogen-becomes-a-sup.jpg", "publishedAt": "2025-02-24T20:35:03Z", "content": "Hydrogen nano-clusters at low temperatures display 'superfluidity'a quantum state of frictionless flow only previously observed in helium.\r\nThe new research is published in Science Advances by an int… [+2913 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Utrecht University", "title": "Mega-iceberg from Antarctica is headed toward South Georgia—here's what could happen - Phys.org", "description": "It is no strange sight to see icebergs break off of the Antarctic ice cap and drift away, like the gigantic sheet of ice that is currently heading for the island of South Georgia. But climate change is making it happen more frequently, with ever-larger iceber…", "url": "https://phys.org/news/2025-02-mega-iceberg-antarctica-south-georgia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/mega-iceberg-from-anta.jpg", "publishedAt": "2025-02-24T20:04:27Z", "content": "It is no strange sight to see icebergs break off of the Antarctic ice cap and drift away, like the gigantic sheet of ice that is currently heading for the island of South Georgia. But climate change … [+7144 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "Powerful X-class solar flare triggers radio blackouts across the Pacific Ocean (video) - Space.com", "description": "An active sunspot region erupted with an X2.0 solar flare this weekend.", "url": "https://www.space.com/the-universe/sun/powerful-x-class-solar-flare-triggers-radio-blackouts-across-the-pacific-ocean-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KtyzWTGusXRpawReC5xmFd-1200-80.gif", "publishedAt": "2025-02-24T20:00:00Z", "content": "The sun ended the weekend with a bang as a sunspot rotating out of our view erupted with a powerful solar flare on Sunday afternoon.\r\nAt 2:27 p.m. EST (1927 GMT) on Sunday, (Feb. 24), a X2.0 solar fl… [+3034 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Mice Discovered Giving ‘First Aid’ to Unconscious Mates in Surprising Display of Empathy - Good News Network", "description": "When presented with an unresponsive acquaintance, a mouse may attempt to revive them by pawing and gently biting at their face, scientists recently reported. A third behavior was also seen, however, and that involved the attendant mouse removing the unconscio…", "url": "https://www.goodnewsnetwork.org/mice-discovered-giving-first-aid-to-unconscious-mates-in-surprising-display-of-empathy/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/A-mouse-tends-to-an-unconscious-peer-by-pulling-its-tongue-credit-Wenjian-Sun-et-al.-2025-e1740405437106.jpg", "publishedAt": "2025-02-24T19:30:17Z", "content": "A mouse tends to an unconscious peer by pulling its tongue – credit: Wenjian Sun et al. 2025, released\r\nWhen presented with an unresponsive acquaintance, a mouse may attempt to revive them by pawing … [+3063 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "Scientists Find Greenland Ice Sheet's Point of No Return - Newser", "description": "Climate modeling study suggests collapse could become inevitable sooner than you might think", "url": "https://www.newser.com/story/364740/scientists-find-greenland-ice-sheets-point-of-no-return.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1594591-12-20250224103547.jpeg", "publishedAt": "2025-02-24T16:21:00Z", "content": "Greenland's ice sheet, one of only two permanent ice sheets on Earth, loses a reported 33 million tons of ice every hour, or almost 290 billion tons per year. Hovering at around 650,000 square miles,… [+1961 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Exoplanet with iron rain has violent winds 'like something out of science fiction' - Livescience.com", "description": "\"Even the strongest hurricanes in the solar system seem calm in comparison.\"", "url": "https://www.space.com/wasp-121b-violent-winds-science-fiction", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ebxa7euHP4toZZ9EJrJRWS-1200-80.jpg", "publishedAt": "2025-02-24T16:00:00Z", "content": "WASP-121 b is the definition of an \"extreme\" exoplanet — it's so hot that it rains droplets of liquid iron. Now, astronomers have discovered that this planet, located around 900 light-years away from… [+4638 chars]"}]}