{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Webb Telescope confirms nearby rocky planet has no significant atmosphere - Ars Technica", "description": "A close look at one of TRAPPIST-1's planets shows it's bare and baking.", "url": "https://arstechnica.com/science/2023/03/webb-telescope-is-sensitive-enough-to-detect-a-star-eclipse-a-planet/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/image-5-760x380.jpeg", "publishedAt": "2023-03-27T19:10:27Z", "content": "Enlarge/ An illustration of what the inner portion of the TRAPPIST-1 system might look like. \r\n8 with \r\nAt this point, we've discovered lots of exoplanets that fall under the general label \"Earth-lik… [+2876 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Scientists discover water inside tiny beads of glass on moon - Al Jazeera English", "description": "Analysis of lunar soil samples shows spheres of glass hold water inside them, scientists have said.", "url": "https://www.aljazeera.com/news/2023/3/27/scientists-find-water-inside-glass-beads-scattered-across-moon", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/03/33AE7T4-highres.jpg?resize=1920%2C1440", "publishedAt": "2023-03-27T17:58:42Z", "content": "Scientists say they have discovered water trapped inside tiny beads of glass scattered across the moon, suggesting a potential reservoir of this precious resource for future human activities on the l… [+2962 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Changes Ahead as NASA's Human Spaceflight Head Plans Retirement - NASA", "description": "Kathryn Lueders, associate administrator of NASA’s Space Operations Mission Directorate, announced Monday she will retire from the agency at the end of April. Lueders’ current deputy and astronaut, Ken Bowersox, will become the new head of Space Operations, e…", "url": "https://www.nasa.gov/press-release/changes-ahead-as-nasa-s-human-spaceflight-head-plans-retirement", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/space-ops.jpg", "publishedAt": "2023-03-27T16:33:30Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Japanese Spacecraft Captures Intimate Photo of the Moon Ahead of Historic Landing Attempt - Gizmodo", "description": "The private lander recently entered lunar orbit and is getting ready to land on the surface of the Moon.", "url": "https://gizmodo.com/japan-hakuto-r-lander-intimate-photo-moon-ispace-1850268425", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/537914b60e0b36ccf7cce742c8d48e50.jpg", "publishedAt": "2023-03-27T15:40:00Z", "content": "A Japanese mission to the Moon seeks to be the first private venture to successfully land on the lunar surface. But before it attempts to touchdown on its dusty surface, the Hakuto-R lunar lander is … [+1958 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A robust quantum memory that stores information in a trapped-ion quantum network - Phys.org", "description": "Researchers at University of Oxford have recently created a quantum memory within a trapped-ion quantum network node. Their unique memory design, introduced in a paper in Physical Review Letters, has been found to be extremely robust, meaning that it could st…", "url": "https://phys.org/news/2023-03-robust-quantum-memory-trapped-ion-network.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/a-robust-quantum-memor.jpg", "publishedAt": "2023-03-27T15:00:03Z", "content": "Researchers at University of Oxford have recently created a quantum memory within a trapped-ion quantum network node. Their unique memory design, introduced in a paper in Physical Review Letters, has… [+5917 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The search for the missing gravitational signal - Phys.org", "description": "Every year, hundreds of thousands of pairs of black holes merge in a cosmic dance that emits gravitational waves in every direction. Since 2015, the large ground-based LIGO, Virgo and KAGRA interferometers have made it possible to detect these signals, althou…", "url": "https://phys.org/news/2023-03-gravitational.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-search-for-the-mis.jpg", "publishedAt": "2023-03-27T14:27:04Z", "content": "Every year, hundreds of thousands of pairs of black holes merge in a cosmic dance that emits gravitational waves in every direction. Since 2015, the large ground-based LIGO, Virgo and KAGRA interfero… [+3884 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Five planets to line up in night sky - BBC", "description": "To spot all five, timing and a clear view of the western horizon will be key.", "url": "https://www.bbc.com/news/science-environment-65056407", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0A9F/production/_125591720_gettyimages-1184379136.jpg", "publishedAt": "2023-03-27T14:24:14Z", "content": "Mercury, Jupiter, Venus, Uranus, Mars, and the Moon will align in an arc across the evening sky on Monday, with some visible to the naked eye.\r\nThis is often called \"a planetary parade\" and will be v… [+2009 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "Second giant 'hole' on the sun will send 1.8 million mph solar winds towards Earth - Business Insider", "description": "The winds, which may trigger auroras, will likely reach our planet on Friday or Saturday, according to Daniel Verscharen from University College London.", "url": "https://www.businessinsider.com/second-giant-coronal-hole-sun-solar-winds-space-weather-aurora-2023-3", "urlToImage": "https://i.insider.com/6421c6300237f90018531b80?width=1200&format=jpeg", "publishedAt": "2023-03-27T10:39:00Z", "content": "A giant \"hole\" has appeared on the surface of the sun and it could send 1.8 million mph solar winds toward Earth by Friday. \r\nIt follows the discovery of a coronal hole on the sun 30 times the size o… [+4103 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Blue-ringed octopus, one of the most toxic animals on Earth, bites woman multiple times - Livescience.com", "description": "An unnamed woman was bitten twice by a blue-ringed octopus, which contains one of the most dangerous neurotoxins on the planet, but she escaped relatively unharmed.", "url": "https://www.livescience.com/blue-ringed-octopus-one-of-the-most-toxic-animals-on-earth-bites-woman-multiple-times", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WfpsHvmJSw2YUAGCE2VKNT-1200-80.jpg", "publishedAt": "2023-03-27T10:12:39Z", "content": "Blue-ringed octopuses contain a powerful neurotoxin called tetrodotoxin, which can be lethal to humans in small doses. (Image credit: James Reynolds)\r\nA woman in Australia was recently bitten multipl… [+3900 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How Nancy Hopkins and her tape measure revealed the extent of sexism in science - Nature.com", "description": "When the MIT molecular biologist quantified how much more lab space men were given, she unleashed a US-wide reckoning about how women are held back in academia.", "url": "https://www.nature.com/articles/d41586-023-00887-4", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00887-4/d41586-023-00887-4_24622420.jpg", "publishedAt": "2023-03-27T10:03:34Z", "content": "Nancy Hopkins showed how the Masschusetts Institute of Technology systematically awarded more lab space to men.Credit: Everett Collection Inc/Alamy \r\nThe Exceptions: Nancy Hopkins, MIT, and the Fight… [+5834 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Why is Mercury so weird? Blame the giant outer planets. - Space.com", "description": "Mercury's weirdness appears to be the fault of the giant planets like Jupiter, Saturn, Uranus and Neptune.", "url": "https://www.space.com/mercury-weird-because-of-jupiter-outer-planets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jQKcQhpHzSq7JSJ2987Hoa-1200-80.jpg", "publishedAt": "2023-03-27T10:00:12Z", "content": "Mercury is a planet that just doesn't make sense. It's incredibly small yet hosts a relatively massive core. Mercury is so strange that astronomers have not been able to explain its properties with s… [+5358 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Interplanetary Weather Observer: Hubble Spies Spectacular Changing Seasons at Jupiter and Uranus - SciTechDaily", "description": "Forecast for Blustery Winds, Smoggy Hazes The outer planets beyond Mars do not have solid surfaces to affect weather as on Earth. And, sunlight is much less able to drive atmospheric circulation. Nevertheless, these are ever-changing worlds. And Hubble – as i…", "url": "https://scitechdaily.com/?p=264005", "urlToImage": "https://scitechdaily.com/images/Hubble-Jupiter-November-2022.jpg", "publishedAt": "2023-03-27T08:29:39Z", "content": "BySpace Telescope Science InstituteMarch 27, 2023\r\nIn this captivating image, Jupiters vibrant cloud tops are interrupted by the orange-hued moon Io, casting a shadow towards the planets western edge… [+11316 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martha McHardy", "title": "Strongest solar storm in years hits Earth catching forecasters by surprise - The Independent", "description": "The storm made auroras visible as far south as New Mexico in the US", "url": "https://www.independent.co.uk/news/world/solar-storm-new-mexico-earth-b2308496.html", "urlToImage": "https://static.independent.co.uk/2023/02/28/10/iStock-1423939850.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-03-27T07:19:15Z", "content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nThe most powerful solar storm in nearly six years ha… [+1989 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Why Earth is the only planet with plate tectonics - Big Think", "description": "Mercury, Venus, and Mars are all uni-plate planets, and always have been. Here are the reasons why Earth, uniquely, has plate tectonics.", "url": "https://bigthink.com/starts-with-a-bang/earth-plate-tectonics/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/03/Mauritius_and_Reunion_at_night.jpg?resize=1200,630", "publishedAt": "2023-03-27T06:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unfathomable Z 229–15: Everything, in One Place, All at Once - SciTechDaily", "description": "This luminous NASA/ESA Hubble Picture of the Week shows Z 229-15 — imaged here in exquisite detail by the Hubble Space Telescope — a celestial object that lies about 390 million light-years from Earth in the constellation Lyra. Z 229-15 is one of those intere…", "url": "https://scitechdaily.com/unfathomable-z-229-15-everything-in-one-place-all-at-once/", "urlToImage": "https://scitechdaily.com/images/Hubble-Space-Telescope-Z-229-15.jpg", "publishedAt": "2023-03-27T04:36:53Z", "content": "ByESA/HubbleMarch 26, 2023\r\nHubble Space Telescope image shows Z 229-15 in beautiful detail. This celestial object that lies about 390 million light-years from Earth in the constellation Lyra. Credit… [+3352 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revealing Quantum Properties of Radiation – 2D Interaction Takes Researchers by Surprise - SciTechDaily", "description": "Technion researchers present the first-ever observation of the Cherenkov radiation phenomenon in a two-dimensional space. The researchers from the Andrew and Erna Viterbi Faculty of Electrical and Computer Engineering at the Technion – Israel Institute of Tec…", "url": "https://scitechdaily.com/revealing-quantum-properties-of-radiation-2d-interaction-takes-researchers-by-surprise/", "urlToImage": "https://scitechdaily.com/images/A-Single-Free-Electron-Propagates-Above-Special-Layered-Structure-scaled.jpg", "publishedAt": "2023-03-27T00:11:58Z", "content": "ByNanyang Technological UniversityMarch 26, 2023\r\nA single free electron propagates above the special layered structure that the researchers engineered, only a few tens of nanometers above it. During… [+6839 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Caltech Engineers Have Developed an Unusually Tough New Material - SciTechDaily", "description": "Caltech engineers have made a significant breakthrough in the field of nano- and micro-architected materials by creating a novel material composed of multiple interconnected microscale knots. Compared to structurally identical but unknotted materials, the pre…", "url": "https://scitechdaily.com/caltech-engineers-have-developed-an-unusually-tough-new-material/", "urlToImage": "https://scitechdaily.com/images/Microscale-Knots.jpg", "publishedAt": "2023-03-26T19:15:36Z", "content": "ByCalifornia Institute of TechnologyMarch 26, 2023\r\nThe knotted materials, which were created out of polymers, exhibit a tensile toughness that far surpasses materials that are unknotted but otherwis… [+5514 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Universe Today, Matt Williams", "title": "A Controversial Rocket Technology Could Challenge a Basic Law of Physics - Inverse", "description": "A sustainable new rocket propulsion system could prove an alternative theory of inertia.", "url": "https://www.inverse.com/science/alternative-inertia-theory-space", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/3/24/12b1df7d-5047-4f27-a919-08221cc9ed1f-2402b73f-29f1-4267-a5d8-3b3cdc3cf8e7-t5cqvxrolxbskxjd11te-768x549.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-03-26T19:00:25Z", "content": "One of the most exciting aspects of the current era of space exploration (Space Age 2.0) is how time-honored ideas are finally being realized. \r\nSome of the more well-known examples include retrievab… [+12871 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ingenious Photosynthesis \"Hack\" Paves Way for Renewable Energy Breakthroughs - SciTechDaily", "description": "Researchers have ‘hacked’ the earliest stages of photosynthesis, the natural machine that powers the vast majority of life on Earth, and discovered new ways to extract energy from the process, a finding that could lead to new ways of generating clean fuel and…", "url": "https://scitechdaily.com/ingenious-photosynthesis-hack-paves-way-for-renewable-energy-breakthroughs/", "urlToImage": "https://scitechdaily.com/images/Photosynthesis-Hack-New-Ways-of-Generating-Renewable-Energy.jpg", "publishedAt": "2023-03-26T15:32:48Z", "content": "ByUniversity of CambridgeMarch 26, 2023\r\nIn a groundbreaking development, researchers have successfully hacked the initial stages of photosynthesis the natural process that fuels the majority of life… [+7340 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 33 armadillos to pass Earth Sunday - NASA - The Jerusalem Post", "description": "Asteroid 2023 FL2 is 35 meters, which is as much as almost 33 nine-banded armadillos lined up tail-to-snout. However, it won't hit us, and armadillos might even be more dangerous.", "url": "https://www.jpost.com/science/article-735473", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/501266", "publishedAt": "2023-03-26T15:27:00Z", "content": "An asteroid around the size of almost 33 armadillos is set to pass by Earth on Sunday, according to NASA's asteroid tracker.\r\nThe asteroid in question has been designated 2023 FL2 and was discovered … [+3271 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jack Hobbs", "title": "Scientists discover supermassive black hole that now faces Earth - New York Post ", "description": "This is a galactic-sized problem.", "url": "https://nypost.com/2023/03/26/a-supermassive-black-hole-now-faces-earth-scientists/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/03/NYPICHPDPICT000008805949.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-03-26T14:29:00Z", "content": "This is a galactic-sized problem. \r\nScientists revealed Tuesday that galaxy PBC J2333.9-2343 has been reclassified after discovering a supermassive black hole that is currently facing our solar syste… [+2292 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "These scientists are convinced that the future can influence the past - BGR", "description": "More and more scientists are turning to the idea of retrocausality to help explain amazing occurences in the world of quantum mechanics.", "url": "https://bgr.com/science/these-scientists-are-convinced-that-the-future-can-influence-the-past/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/01/AdobeStock_330287153.jpeg?quality=82&strip=all", "publishedAt": "2023-03-26T13:02:00Z", "content": "We’ve all heard of the “consequences of our actions,” where something in our past somehow brings about something in our future. Another common way to look at it is through the eyes of sowing seeds. Y… [+2661 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Gemma Lavender", "title": "What equipment do you need to see and photograph the planets - Space.com", "description": "How to achieve the very best views and images of the neighboring worlds in our solar system.", "url": "https://www.space.com/what-equipment-do-you-need-to-see-and-photograph-the-planets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZYuMMSqF6Se9vqPZVTm7Yg-1200-80.jpg", "publishedAt": "2023-03-26T13:00:30Z", "content": "Ever wondered how to view and photograph the planets? Viewing the planets in our solar system is on every observer's hit list during a session under the night sky. Popular with beginners and seasoned… [+14023 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "What do the elements sound like? - Phys.org", "description": "In chemistry, we have He, Fe and Ca—but what about do, re and mi? Hauntingly beautiful melodies aren't the first things that come to mind when looking at the periodic table of the elements. However, using a technique called data sonification, a recent college…", "url": "https://phys.org/news/2023-03-elements.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/what-do-the-elements-s.jpg", "publishedAt": "2023-03-26T12:10:03Z", "content": "In chemistry, we have He, Fe and Cabut what about do, re and mi? Hauntingly beautiful melodies aren't the first things that come to mind when looking at the periodic table of the elements. However, u… [+5656 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Two meteorites are providing a detailed look into outer space - Phys.org", "description": "If you've ever seen a shooting star, you might have actually seen a meteor on its way to Earth. Those that land here are called meteorites and can be used to peek back in time, into the far corners of outer space or at the earliest building blocks of life. To…", "url": "https://phys.org/news/2023-03-meteorites-outer-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/outer-space.jpg", "publishedAt": "2023-03-26T12:00:25Z", "content": "If you've ever seen a shooting star, you might have actually seen a meteor on its way to Earth. Those that land here are called meteorites and can be used to peek back in time, into the far corners o… [+5304 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "NASA selects solar physicist Nicola Fox as its new science chief - Space.com", "description": "Fox previously led the agency's Heliophysics Division.", "url": "https://www.space.com/solar-physicist-nicola-fox-nasa-science-chief", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GDg98m6cFdSbufhTX2XknL-1200-80.jpeg", "publishedAt": "2023-03-26T10:00:17Z", "content": "NASA has selected Nicola Fox as the new associate administrator for its Science Mission Directorate, who oversees more than 100 important missions and projects. \r\nFox previously headed up NASA's Heli… [+3137 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Astrobiologist suggests we look for signs of life from elsewhere in the galaxy by studying space dust - Phys.org", "description": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal International Journal of Astrobiology, he suggests that space dust…", "url": "https://phys.org/news/2023-03-astrobiologist-life-galaxy-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/spacedust.jpg", "publishedAt": "2023-03-26T10:00:01Z", "content": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal Intern… [+2521 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Boeing Starliner's 1st crewed trip to the ISS delayed again over battery overheating risk - The Register", "description": "May fly in the summer, with some presumably pretty nervous pilots", "url": "https://www.theregister.com/2023/03/26/boeing_starliner_iss_delay/", "urlToImage": "https://regmedia.co.uk/2023/03/24/starliner_shutterstock.jpg", "publishedAt": "2023-03-26T09:21:00Z", "content": "Boeing's first mission carrying astronauts to the International Space Station aboard its Starliner capsule, scheduled for April, is now delayed until summer due to the risk of overheating batteries.\r… [+2234 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Race Against Time: NASA Readies for Historic Asteroid Sample Delivery - SciTechDaily", "description": "NASA's OSIRIS-REx spacecraft is cruising back to Earth with a sample it collected from the rocky surface of asteroid Bennu. When its sample capsule parachutes down into the Utah desert on September 24, OSIRIS-REx will become the United States’ first-ever miss…", "url": "https://scitechdaily.com/a-race-against-time-nasa-readies-for-historic-asteroid-sample-delivery/", "urlToImage": "https://scitechdaily.com/images/NASAs-OSIRIS-REx-Asteroid-Sample-Return-Mission.jpg", "publishedAt": "2023-03-26T01:35:04Z", "content": "ByRani Gran, NASA's Goddard Space Flight CenterMarch 25, 2023\r\nNASAs OSIRIS-REx Asteroid Sample Return Mission. Credit: NASAs Goddard Space Flight Center\r\nNASAs OSIRIS-REx spacecraft is cruising back… [+8253 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Bob Cronin", "title": "Scientists: Trash Mess in Space Mirrors Problem in Oceans - Newser", "description": "Cleanup effort must start with a binding global treaty, experts say", "url": "https://www.newser.com/story/332711/to-clean-up-the-mess-in-space-scientists-urge-a-global-treaty.html", "urlToImage": "https:https://img2-azrcdn.newser.com/image/1464039-12-20230325172455.jpeg", "publishedAt": "2023-03-25T21:55:00Z", "content": "There have been calls to action to clean up the trash in the world's oceans, and now researchers are warning of the urgency to do the same thing in space. The efforts are more similar than they might… [+1761 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Chad Langen", "title": "Alpha Centauri Mission Searching For Life, Signals Already Found - Giant Freakin Robot", "description": "Alpha Centauri is our neighboring solar system, but we know little about it, except it's out best shot at finding life beyond Earth.", "url": "https://www.giantfreakinrobot.com/sci/alpha-centauri-mission-searching-life.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2021/01/planets-planetary-protection-scaled.jpg", "publishedAt": "2023-03-25T21:41:05Z", "content": "A team of researchers out of the University of Sydney will search Alpha Centauri for signs of life in the hope of finding another habitable planet. \r\nThe search for extra-terrestrial life has always … [+3119 chars]"}]}