{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco", "title": "Student makes cosmic dust in a lab, shining a light on the origin of life - cnn.com", "description": "A doctoral student recreated a tiny piece of the universe in a bottle to investigate the chemistry that led to life on Earth.", "url": "https://www.cnn.com/2026/02/06/science/cosmic-dust-discovery-life-beginnings", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/phd-candidate-linda-losurdo-in-her-university-of-sydney-lab-landscape-2-photo-fiona-wolf-university-of-sydney.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-02-06T17:30:45Z", "content": "Recreating a piece of the universe in a bottle might sound like science fiction, but its exactly what Linda Losurdo did.\r\nLosurdo, a doctoral student in materials and plasma physics at the University… [+6308 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "John Johnson", "title": "For Jupiter, 'Textbooks Will Need to Be Updated' - Newser", "description": "New measurements reveal the planet is a bit thinner, flatter than believed", "url": "https://www.newser.com/story/383289/jupiter-is-a-smidge-smaller-than-we-thought.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1663275-12-20260206112203.jpeg", "publishedAt": "2026-02-06T16:48:00Z", "content": "Still, \"textbooks will need to be updated,\" says study co-author Yohai Kaspi of the Weizmann Institute of Science in Israel, in a statement. Earlier measurements came from NASA's Voyager and Pioneer … [+862 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "Mankind Just Received a 10-Second Signal from 13 Billion Light-Years Across the Universe - Indian Defence Review", "description": "A 10-second flash from deep space just rewrote what we thought we knew about the early universe.", "url": "https://indiandefencereview.com/mankind-just-received-a-10-second-signal-from-13-billion-light-years-across-the-universe/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/a-10-second-burst-of-light-just-reached-earth-scaled.jpg", "publishedAt": "2026-02-06T12:00:00Z", "content": "A brief, high-energy signal recorded last year has become a focal point in astrophysics. The event, lasting ten seconds, came from a time when the universe was only a fraction of its current age. It … [+5130 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Cellular-level preservation of cutaneous spikes in an Early Cretaceous iguanodontian dinosaur - Nature", "description": "A juvenile iguanodontian from the Lower Cretaceous of China preserves both spikes and scales in its skin that are different from integumentary structures in either non-avian dinosaurs or extant squamates and may have had a defensive function.", "url": "https://www.nature.com/articles/s41559-025-02960-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41559-025-02960-9/MediaObjects/41559_2025_2960_Fig1_HTML.png", "publishedAt": "2026-02-06T11:03:26Z", "content": "<li>Bell, P. R. Standardized terminology and potential taxonomic utility for hadrosaurid skin impressions: a case study for Saurolophus from Canada and Mongolia. PLoS ONE7, e31295 (2012).\r\nArticle \r\n… [+9053 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Does dark matter actually exist? New theory says it could be gravity behaving strangely - Space", "description": "\"It highlights gravity's possible hidden complexity and invites a reevaluation of where dark matter effects originate.\"", "url": "https://www.space.com/astronomy/dark-universe/does-dark-matter-actually-exist-new-theory-says-it-could-be-gravity-behaving-strangely", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ug3qTXVQFJFGSaFGH9hnzh-1600-80.png", "publishedAt": "2026-02-06T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "See Six Planets In The Night Sky This Weekend — When And Where To Look - Forbes", "description": "Look west just after sunset from this weekend for a chance to see some of six planets, though the best views will be had later this month.", "url": "https://www.forbes.com/sites/jamiecartereurope/2026/02/06/see-six-planets-in-the-night-sky-this-weekend---when-and-where-to-look/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68c160e1da4f033ca6fc6af0/0x0.jpg?format=jpg&crop=3769,2118,x272,y272,safe&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-06T09:00:00Z", "content": "A planet parade mistakenly called a planetary alignment by many is set to unfold this weekend as six planets appear together in the night sky. From this weekend until the end of February, skywatchers… [+3504 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Melissa Hobson", "title": "\"Never seen before.” Scientists make astounding discovery on Australian island - BBC Wildlife Magazine", "description": "Researchers in Australia found an endangered species of lamprey far outside its usual range and hope this could help them better understand how to protect it.", "url": "https://www.discoverwildlife.com/animal-facts/fish/australian-brook-lamprey-queensland", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/02/Kgari-in-Australia.jpeg?w=1200", "publishedAt": "2026-02-06T08:59:36Z", "content": "Imagine adding several rings of pointed teeth to a vacuum hose and you've probably got a fairly good idea of what a lamprey looks like. \r\nThese ancient fish have been on the planet since before the t… [+3272 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "A Newly Discovered Comet May Soon Appear Bright in Our Skies - ScienceAlert", "description": "A newly discovered comet has astronomers excited, with the potential to be a spectacular sight in early April.", "url": "https://www.sciencealert.com/a-newly-discovered-comet-may-soon-appear-bright-in-our-skies", "urlToImage": "https://www.sciencealert.com/images/2026/02/comet_lovejoy_2011_header.jpg", "publishedAt": "2026-02-06T01:49:23Z", "content": "A newly discovered comet has astronomers excited, with the potential to be a spectacular sight in early April.\r\nC/2026 A1 (MAPS) was spotted by a team of four amateur astronomers with a remotely oper… [+5874 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Sex in space is finally happening, moving from theory to urgent reality - Earth.com", "description": "As space travel expands, scientists warn that reproductive health risks and ethical gaps can no longer be ignored.", "url": "https://www.earth.com/news/human-reproduction-sex-in-space-is-moving-from-theory-to-urgent-reality/", "urlToImage": "https://cff2.earth.com/uploads/2026/02/04171422/Human-reproduction-space.jpg", "publishedAt": "2026-02-06T00:49:47Z", "content": "As spaceflight shifts from rare government missions to something closer to routine travel and work, one awkward question is getting harder to ignore: what happens to human reproductive health away fr… [+5235 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jorge Garay", "title": "Two Titanic Structures Hidden Deep Within the Earth Have Altered the Magnetic Field for Millions of Years - WIRED", "description": "A team of geologists found for the first time evidence linking regions of low seismic velocity and the shape of the Earth’s magnetic field.", "url": "https://www.wired.com/story/titanic-structures-earth-magnetic-field-millions-of-years/", "urlToImage": "https://media.wired.com/photos/698514546f54668694781045/191:100/w_1280,c_limit/sci-earth-magneticfield-1349223076.jpg", "publishedAt": "2026-02-05T23:58:00Z", "content": "A team of geologists has found for the first time evidence that two ancient, continent-sized, ultrahot structures hidden beneath the Earth have shaped the planet's magnetic field for the past 265 mil… [+2830 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "Baby Giants Were The Fast Food of The Jurassic, Study Reveals - ScienceAlert", "description": "Baby long-necked dinosaurs might have been the fast food of the Jurassic Period.", "url": "https://www.sciencealert.com/baby-giants-were-the-fast-food-of-the-jurassic-study-reveals", "urlToImage": "https://www.sciencealert.com/images/2026/02/baby-brachiosaurus.jpg", "publishedAt": "2026-02-05T23:41:40Z", "content": "Baby long-necked dinosaurs might have been the fast food of the Jurassic Period. A detailed food web of the time, reconstructed from fossil data, shows that the young not-yet-giants almost single-han… [+3126 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matthew Williams", "title": "The \"Little Red Dots\" Observed by Webb Were Direct-Collapse Black Holes - Universe Today", "description": "The discovery by JWST of a substantial population of compact", "url": "https://www.universetoday.com/articles/the-little-red-dots-observed-by-webb-were-direct-collapse-black-holes", "urlToImage": "https://www.universetoday.com/article_images/STScI-01JFJZNJSD2VR3V9ME4RTRG2RD_20260205_232717.png", "publishedAt": "2026-02-05T23:29:00Z", "content": "The James Webb Space Telescope (JWST ) was designed to look back in time and study galaxies that existed shortly after the Big Bang. In so doing, scientists hoped to gain a better understanding of ho… [+6533 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Rania Hadid", "title": "Scientists Just Revealed a Never-Before-Seen Feature Inside Archaeopteryx’s Skull - Indian Defence Review", "description": "Scientists have uncovered something extraordinary inside the skull of an Archaeopteryx fossil.", "url": "https://indiandefencereview.com/never-seen-feature-archaeopteryxs-skull/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-just-revealed-a-never-before-seen-feature-inside-archaeopteryxs-skull-scaled.png", "publishedAt": "2026-02-05T22:30:00Z", "content": "In 2022, a mysterious Archaeopteryx fossil was uncovered at the Field Museum in Chicago, revealing an incredible feature that had never been seen before in the fossil record. The discovery, which too… [+4710 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jim Shelton", "title": "Detection system uses gravitational waves to map merging black holes - Phys.org", "description": "An international collaboration of astrophysicists that includes researchers from Yale has created and tested a detection system that uses gravitational waves to map out the locations of merging black holes—known as supermassive black hole binaries—around the …", "url": "https://phys.org/news/2026-02-gravitational-merging-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/the-beacons-were-lit-a-1.jpg", "publishedAt": "2026-02-05T22:25:18Z", "content": "An international collaboration of astrophysicists that includes researchers from Yale has created and tested a detection system that uses gravitational waves to map out the locations of merging black… [+4371 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Benny Evangelista", "title": "When lasers cross: A brighter way to measure plasma - Phys.org", "description": "Measuring conditions in volatile clouds of superheated gases known as plasmas is central to pursuing greater scientific understanding of how stars, nuclear detonations and fusion energy work. For decades, scientists have relied on a technique called Thomson s…", "url": "https://phys.org/news/2026-02-lasers-brighter-plasma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/when-lasers-cross-a-br.jpg", "publishedAt": "2026-02-05T22:00:01Z", "content": "Measuring conditions in volatile clouds of superheated gases known as plasmas is central to pursuing greater scientific understanding of how stars, nuclear detonations and fusion energy work. For dec… [+9330 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "A Possible Lunar Impact in 2032 Could Spark Days of Meteor Showers on Earth - Gizmodo", "description": "The space rock has a 4.3% chance of striking the Moon in six years—and it could generate a flash nearly as bright as Venus.", "url": "https://gizmodo.com/a-possible-lunar-impact-in-2032-could-spark-days-of-meteor-showers-on-earth-2000718658", "urlToImage": "https://gizmodo.com/app/uploads/2025/09/asteroid-2024-yr4-1200x675.jpg", "publishedAt": "2026-02-05T21:50:42Z", "content": "A large rocky asteroid will make a close approach to Earth in 2032, with the tantalizing prospect of smashing directly into the Moon. If it does, the lunar impact is likely to produce a bright flash … [+2767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Devlin Epding", "title": "NASA Langley makes final preparations for Artemis II mission to launch around the moon - Phys.org", "description": "When Apollo 17 astronauts returned from the moon in 1972, they visited NASA Langley Research Center in Hampton, Virginia, to thank staff for their contributions to the mission, saying \"we stood on the shoulders of giants as we shot for the stars.\"", "url": "https://phys.org/news/2026-02-nasa-langley-artemis-ii-mission.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/moon.jpg", "publishedAt": "2026-02-05T21:45:46Z", "content": "When Apollo 17 astronauts returned from the moon in 1972, they visited NASA Langley Research Center in Hampton, Virginia, to thank staff for their contributions to the mission, saying \"we stood on th… [+5615 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Tiny Antibody Just Crushed the Coronavirus’s Secret Weak Spot - SciTechDaily", "description": "Llama antibodies clamp the coronavirus shut at its weakest spot—leaving the virus powerless to mutate or infect.", "url": "https://scitechdaily.com/a-tiny-antibody-just-crushed-the-coronaviruss-secret-weak-spot/", "urlToImage": "https://scitechdaily.com/images/Antibody-Virus-Molecular-Model.jpg", "publishedAt": "2026-02-05T21:35:35Z", "content": "Scientists have discovered a powerful new class of llama-derived antibodies that act like a molecular clamp, locking down a critical—but rarely targeted—region of the coronavirus spike protein. Credi… [+4938 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Selects Two Earth System Explorers Missions - NASA (.gov)", "description": "These two missions were selected for continued development as part of NASA’s Earth System Explorers Program, which conducts principal investigator-led Earth", "url": "https://www.nasa.gov/news-release/nasa-selects-two-earth-system-explorers-missions/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2022/02/nasa_meatball_large.jpg", "publishedAt": "2026-02-05T21:22:30Z", "content": "Two next-generation satellite missions announced Thursday will help NASA better understand Earth and improve capabilities to foresee environmental events and mitigate disasters.\r\nNASA uses the unique… [+3004 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Ellsworth Toohey", "title": "The fantasy of starships is no more realistic than magic - Boing Boing", "description": "Even at 1/10th light speed, a grain of sand hitting the hull would detonate with nuclear force.", "url": "https://boingboing.net/2026/02/05/the-fantasy-of-starships-is-no-more-realistic-than-magic.html", "urlToImage": "https://boingboing.net/wp-content/uploads/2026/02/bester.jpg", "publishedAt": "2026-02-05T21:16:38Z", "content": "Interstellar travel the kind in Star Trek, Star Wars, Dune will never happen. The fantasy \"exists on the exact same level of plausibility as wizards,\" argues Jason Pargin, author of John Dies at the … [+1889 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Foundational Questions Institute, FQXi", "title": "VIP-2 experiment narrows the search for exotic physics beyond the Pauli exclusion principle - Phys.org", "description": "The Pauli exclusion principle is a cornerstone of the Standard Model of particle physics and is essential for the structure and stability of matter. Now an international collaboration of physicists has carried out one of the most stringent experimental tests …", "url": "https://phys.org/news/2026-02-vip-narrows-exotic-physics-pauli.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/vip-2-experiment-narro-1.jpg", "publishedAt": "2026-02-05T21:10:24Z", "content": "The Pauli exclusion principle is a cornerstone of the Standard Model of particle physics and is essential for the structure and stability of matter. Now an international collaboration of physicists h… [+6276 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chris McMullen", "title": "The 10 bleakest space movies of all time - Space", "description": "From spaghettified convicts to doomed interplanetary liners, these space movies really pile on the misery.", "url": "https://www.space.com/entertainment/space-movies-shows/bleakest-space-movies-of-all-time", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EAnyKvTdAR2m93VHZwkbKT-1920-80.jpg", "publishedAt": "2026-02-05T21:00:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "The largest life-form on land 400 million years ago was one that scientists can’t explain - Yahoo", "description": "A bizarre fossil called Prototaxites, which was the largest life-form on land 400 million years ago, may have been a completely unknown form of multicellular...", "url": "https://www.cnn.com/2026/02/05/science/prototaxites-fossil-analysis-unknown-life-form", "urlToImage": "https://s.yimg.com/os/en/cnn_articles_875/13254afd63d0bc8e64938dcb27f14aff", "publishedAt": "2026-02-05T20:54:25Z", "content": "Some 400 million years ago, long before dinosaurs or even trees had evolved, an enigmatic organism towered over the landscape like a prehistoric monolith.\r\nNow, new research makes the case that the a… [+5286 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brian Maffly", "title": "When Earth's magnetic field took its time flipping - Phys.org", "description": "Earth's magnetic field is generated by the churn of its liquid nickel-iron outer core, but it is not a constant feature. Every so often, the magnetic north and south poles swap places in what are called geomagnetic reversals, and the record of these flips is …", "url": "https://phys.org/news/2026-02-earth-magnetic-field-flipping.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/when-earths-magnetic-f.jpg", "publishedAt": "2026-02-05T20:39:28Z", "content": "Earth's magnetic field is generated by the churn of its liquid nickel-iron outer core, but it is not a constant feature. Every so often, the magnetic north and south poles swap places in what are cal… [+5704 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Whitney Clavin", "title": "A 'crazy' dice proof leads to a new understanding of a fundamental law of physics - Phys.org", "description": "Right now, molecules in the air are moving around you in chaotic and unpredictable ways. To make sense of such systems, physicists use a law known as the Boltzmann distribution, which, rather than describe exactly where each particle is, describes the chance …", "url": "https://phys.org/news/2026-02-crazy-dice-proof-fundamental-law.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/economics-puzzle-leads-2.jpg", "publishedAt": "2026-02-05T20:23:43Z", "content": "Right now, molecules in the air are moving around you in chaotic and unpredictable ways. To make sense of such systems, physicists use a law known as the Boltzmann distribution, which, rather than de… [+8288 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Journal silently removes paper for plagiarism, author claims identity theft - Retraction Watch", "description": "If a plagiarized paper by an author who claims he didn’t write it disappears from a journal’s website with no notice, did it ever exist in the first place? It’s not just a philosophical question fo…", "url": "https://retractionwatch.com/2026/02/05/journal-silently-removes-paper-for-plagiarism-author-claims-identity-theft/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2026/02/isajr-plagiarism-main.png", "publishedAt": "2026-02-05T20:22:34Z", "content": "If a plagiarized paper by an author who claims he didnt write it disappears from a journals website with no notice, did it ever exist in the first place? Its not just a philosophical question for the… [+4582 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Astrophotographer captures the 'Flaming Star Nebula' ablaze in deep-space (photo) - Space", "description": "Ionized clouds give the impression of flames surrounding the star AE Aurigae.", "url": "https://www.space.com/stargazing/astrophotography/astrophotographer-captures-the-flaming-star-nebula-ablaze-in-deep-space-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ByaQtCqSFyUdA2cWceWEQX-1598-80.jpg", "publishedAt": "2026-02-05T20:00:00Z", "content": null}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Drilled So Deep Into the Center of the Earth, They Knocked on the Mantle’s Door - Yahoo", "description": "Scientists drilled the deepest core yet, reaching near Earth's mantle, uncovering unique geological samples and offering new insights into Earth's structure.", "url": "https://www.popularmechanics.com/science/environment/a70259672/scientist-drilled-into-earths-mantle-door/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pV93IkXifrIAJ84RZl_ECQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/7eb1ef8733816bc258c3f2482cdd37af", "publishedAt": "2026-02-05T18:58:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\nHeres what youll learn when you read this story:\r\n<ul><li>To understand the mantlethe largest layer of … [+3921 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Nathan Cranford", "title": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity - NASA (.gov)", "description": "NASA’s SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select", "url": "https://www.nasa.gov/humans-in-space/nasas-spacex-crew-12-to-study-adaptation-to-altered-gravity/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2026/02/55065874866-7c923a326a-k-1.png", "publishedAt": "2026-02-05T18:38:08Z", "content": "NASAs SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select crew members will participate in human healt… [+4273 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Scientists Tried Drilling Into Antarctica’s ‘Doomsday Glacier,’ But the Ice Had Other Plans - Gizmodo", "description": "A project that has been years in the making came to an early halt about 3,000 feet deep in the ice.", "url": "https://gizmodo.com/scientists-tried-drilling-into-the-doomsday-glacier-but-the-ice-had-other-plans-2000718421", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/thwaites-doomsday-glacier-report.jpg", "publishedAt": "2026-02-05T18:05:45Z", "content": "One of Earth’s most dangerous glaciers has claimed a victim: a suite of instruments that became trapped deep within the ice.\r\nA team of researchers from the British Antarctic Survey (BAS) and the Kor… [+3504 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rudy Molinek", "title": "Understanding the hazard potential of the Seattle fault zone: It's 'pretty close to home' - Phys.org", "description": "In the Pacific Northwest, big faults like the Cascadian subduction zone located offshore, get a lot of attention. But big faults aren't the only ones that pose significant hazards, and a new study investigates the dynamics of a complex fault zone that runs ri…", "url": "https://phys.org/news/2026-02-hazard-potential-seattle-fault-zone.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/understanding-the-haza.jpg", "publishedAt": "2026-02-05T17:52:38Z", "content": "In the Pacific Northwest, big faults like the Cascadian subduction zone located offshore, get a lot of attention. But big faults aren't the only ones that pose significant hazards, and a new study in… [+4412 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Barbara Wankerl", "title": "The Amaterasu particle: Cosmic investigation traces its origin - Phys.org", "description": "Cosmic rays are extremely fast, charged particles that travel through space at nearly the speed of light. The Amaterasu particle was detected in 2021 by the Telescope Array experiment in the U.S. It is the second-highest-energy cosmic ray ever observed, carry…", "url": "https://phys.org/news/2026-02-amaterasu-particle-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-amaterasu-particle.jpg", "publishedAt": "2026-02-05T17:50:20Z", "content": "Cosmic rays are extremely fast, charged particles that travel through space at nearly the speed of light. The Amaterasu particle was detected in 2021 by the Telescope Array experiment in the U.S. It … [+3449 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "NASA has been detecting weekly changes in sea level for 33 years and has now made the data public - Earth.com", "description": "NASA releases 33 years of weekly sea level data, revealing key rises and falls for coastal areas around the world that are vulnerable today.", "url": "https://www.earth.com/news/nasa-has-been-detecting-weekly-changes-in-sea-level-for-33-years-rising-faster/", "urlToImage": "https://cff2.earth.com/uploads/2026/02/04120706/nasa-weekly-sea-level-changes-satellite-data-public.jpg", "publishedAt": "2026-02-05T17:48:06Z", "content": "Satellites have tracked week-by-week changes in sea level for 33 years, and NASA has now opened the record.\r\nThat public stream exposes sudden bumps and dips that can worsen coastal flooding well bef… [+5089 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Milky Way’s ‘Central Black Hole’ is Compact Object Composed of Fermionic Dark Matter, Study Says - Sci.News", "description": "For decades, the motions of stars near the center of our Milky Way Galaxy have been treated as some of the clearest evidence for a supermassive black hole.", "url": "https://www.sci.news/astronomy/milky-ways-compact-object-fermionic-dark-matter-14537.html", "urlToImage": "https://cdn.sci.news/images/2026/02/image_14537-Fermionic-Dark-Matter.jpg", "publishedAt": "2026-02-05T17:27:10Z", "content": "For decades, the motions of stars near the center of our Milky Way Galaxy have been treated as some of the clearest evidence for a supermassive black hole. But Dr. Valentina Crespi from the Institute… [+4220 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Martian meteorite that fell to Earth is full of ancient water, new scans reveal - Live Science", "description": "A new study has revealed that the iconic Black Beauty meteorite contains much more hidden water than previously suspected. The rock, which fell to Earth from Mars, could reveal clues about the Red Planet's watery past.", "url": "https://www.livescience.com/space/mars/martian-meteorite-that-fell-to-earth-is-full-of-ancient-water-new-scans-reveal", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8r2N3vPagy3U2oViZxDMSZ-1600-80.jpg", "publishedAt": "2026-02-05T17:06:33Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Zachary Folk", "title": "Northern Lights Forecast: Aurora Could Be Visible From These Northern States Tonight - Forbes", "description": "A coronal mass ejection could interact with the Earth, causing geomagnetic storms and making the aurora potentially visible further south.", "url": "https://www.forbes.com/sites/zacharyfolk/2026/02/05/northern-lights-forecast-aurora-could-be-visible-from-these-northern-states-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/664373804e8820ac8d733cf2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-05T16:38:39Z", "content": "The northern lights could be visible from northern states along the U.S.-Canadian border on Thursday night, forecasters at the National Oceanic and Atmospheric Administration said, as a coronal mass … [+2676 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Woman Discovers Childhood Pen Pal Became Doctor Who Delivered Her 2 Kids: 'My Mouth Dropped' - Good News Network", "description": "Little did Megan Lewis and Suzanne Koziol know it at the time, but their relationship as physician-patient was a little bit deeper than that.", "url": "https://www.goodnewsnetwork.org/woman-discovers-childhood-pen-pal-became-doctor-who-delivered-her-2-kids-my-mouth-dropped/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/A-handwritten-letter-to-her-pen-pal-Megan-Lewis-from-April-1995-–-Courtesy-of-Suzanne-Pugh-cropped.jpg", "publishedAt": "2026-02-05T16:30:37Z", "content": "A handwritten letter to her pen pal Megan Lewis from April 1995 Courtesy of Suzanne Pugh\r\nIt wasn’t quite a reunion; since the women knew each other well.\r\nTheir relationship, so far as they understo… [+1971 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Swansea University", "title": "Finger length could provide vital clue to understanding human brain evolution - Phys.org", "description": "The evolution of the human species is marked by an increase in brain size. Now new research suggests that could be partly dependent on increases in prenatal estrogen—revealed by looking at the length of a person's fingers. Professor John Manning, of Swansea's…", "url": "https://phys.org/news/2026-02-finger-length-vital-clue-human.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/fingers-on-head.jpg", "publishedAt": "2026-02-05T16:20:04Z", "content": "The evolution of the human species is marked by an increase in brain size. Now new research suggests that could be partly dependent on increases in prenatal estrogenrevealed by looking at the length … [+2839 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Could a toxic chemical in Mars dirt help us build a Red Planet base? - Space", "description": "If these new experiments can be replicated on Mars, astronauts could build habitats there using on-site resources.", "url": "https://www.space.com/astronomy/mars/could-a-toxic-chemical-in-mars-dirt-help-us-build-a-red-planet-base", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4GerwzpWZyg6EKiUYa4Xqc-1280-80.png", "publishedAt": "2026-02-05T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Phys.org", "title": "How superconductivity arises: New insights from moiré materials - Phys.org", "description": null, "url": "https://phys.org/news/2026-02-superconductivity-insights-moir-materials.html", "urlToImage": null, "publishedAt": "2026-02-05T15:44:53Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Scientists Discovered a Hidden Cosmic Tunnel Linking Earth to Distant Galaxies - The Daily Galaxy", "description": "Hidden deep within the vastness of interstellar space, a mysterious network of tunnels has been revealed, connecting Earth to distant stars in ways we never imagined.", "url": "https://dailygalaxy.com/2026/02/hidden-tunnel-linking-earth-to-galaxies/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Scientists-Have-Just-Discovered-a-Hidden-Tunnel-Linking-Earth-to-Distant-Galaxies-scaled.jpg", "publishedAt": "2026-02-05T15:15:00Z", "content": "Recently discovered invisible corridors, known as “interstellar tunnels,” have been found connecting regions of hot gas in our galaxy to areas of high stellar activity. This revelation upends our und… [+3083 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Emily Carter", "title": "Scientists Discover New Magnetic Anomaly Hidden Beneath Australia’s Northern Territory - Indian Defence Review", "description": "The discovery of a magnetic anomaly beneath Australia’s Northern Territory is reshaping our understanding of the region’s geological history and could lead to exciting new opportunities for resource exploration.", "url": "https://indiandefencereview.com/scientists-new-magnetic-anomaly-australia/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-discover-new-magnetic-anomaly-hidden-beneath-australias-northern-territory-scaled.png", "publishedAt": "2026-02-05T14:45:00Z", "content": "A recent study from the Commonwealth Scientific and Industrial Research Organisation (CSIRO) has unveiled an intriguing magnetic anomaly beneath Australia’s Northern Territory. The anomaly, shaped li… [+3739 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jacco van Loon, Keiichi Ohnaka", "title": "A giant star is changing before our eyes and astronomers are watching in real time - The Conversation", "description": "The WOH G64 star looked to be accelerating to its end of life. But now astronomers are not sure that’s the case.", "url": "https://theconversation.com/a-giant-star-is-changing-before-our-eyes-and-astronomers-are-watching-in-real-time-274562", "urlToImage": "https://images.theconversation.com/files/715412/original/file-20260130-56-37ctap.png?ixlib=rb-4.1.0&rect=0%2C128%2C1536%2C768&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2026-02-05T14:21:16Z", "content": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more th… [+5494 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope's view of 800,000 galaxies paints a detailed picture of dark matter - Space", "description": "Astronomers used James Webb Space Telescope data to determine the density of the universe's most mysterious \"stuff.\"", "url": "https://www.space.com/astronomy/dark-universe/james-webb-space-telescopes-view-of-800-000-galaxies-paints-a-detailed-picture-of-dark-matter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/L2U66XKRtU8BDoapwXLE6j-1600-80.png", "publishedAt": "2026-02-05T13:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "Record Smashed For Largest Object to Be Seen as a Quantum Wave - ScienceAlert", "description": "A microscopic clump of sodium has become the largest object ever to be observed as a wave, improving upon previous records by thousands of atoms.", "url": "https://www.sciencealert.com/record-smashed-for-largest-object-to-be-seen-as-a-quantum-wave", "urlToImage": "https://www.sciencealert.com/images/2026/02/human_face_blur_header.jpg", "publishedAt": "2026-02-05T12:02:41Z", "content": "A microscopic clump of sodium has become the largest object ever to be observed as a wave, improving upon previous records by thousands of atoms.\r\nQuantum physics defines particles in terms of waves,… [+2890 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Moss Spores Riding on the Outside of the Space Station Survive For 9 Months - Good News Network", "description": "Dr. Fujita said that being able to tolerate these conditions and reproduce could put moss squarely in the astronaut's future toolkit.", "url": "https://www.goodnewsnetwork.org/moss-spores-riding-on-the-outside-of-the-space-station-survive-for-9-months/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2013/10/International_Space_Station_NASA.jpg", "publishedAt": "2026-02-05T12:00:46Z", "content": "NASA\r\nThe reproductive spores of a moss species were able to somehow survive the vacuum of space during a 9-month stint outside the International Space Station.\r\nIn the immortal words of Jeff Goldblu… [+2226 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "100-Year-Old Chemistry Law Proven Wrong Forcing Textbook Revisions Across the Globe - Indian Defence Review", "description": "What happens when a 100-year-old rule collapses? A molecular breakthrough with game-changing implications across science and medicine.", "url": "https://indiandefencereview.com/100-year-chemistry-law-proven-wrong-global-textbook-revision/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/100-year-chemistry-rule-overturned-scaled.jpg", "publishedAt": "2026-02-05T11:30:00Z", "content": "A long-standing boundary in organic chemistry has just been crossed. At the University of California, Los Angeles, researchers have synthesized a class of molecules that had, until now, remained a th… [+5113 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Did astronomers see a black hole explode: An 'impossible' particle that hit Earth in 2023 may tell us - Space", "description": "\"If our hypothesized dark charge is true, then we believe there could be a significant population of primordial black holes, which would be consistent with other astrophysical observations, and account for all the missing dark matter in the universe.\"", "url": "https://www.space.com/astronomy/black-holes/did-astronomers-see-a-black-hole-explode-an-impossible-particle-that-hit-earth-in-2023-may-tell-us", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2zwJQfcoh55WtPyoSDqgc5-2560-80.jpg", "publishedAt": "2026-02-05T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Tamilore Oshikanlu", "title": "Study Solves Century-Old Mystery of ‘Uphill’ River - The Daily Beast", "description": "The phenomenon of the Green River that seemingly defied gravity has been solved.", "url": "https://www.thedailybeast.com/study-solve-century-old-mystery-of-uphill-river/", "urlToImage": "https://www.thedailybeast.com/resizer/v2/3E7YISBZSZESVMDRGBI6NBTT5M.jpg?smart=true&auth=a19d54e339829031fdde35322a691fdbc93b8ae04aed6900b47cc4fb2f16053a&width=1200&height=630", "publishedAt": "2026-02-05T09:00:00Z", "content": "For over a century, scientists have puzzled over why the Green River appears to flow uphill through the Uinta Mountains in Utah before eventually joining the Colorado River. A new study suggests the … [+861 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Justin Hughes", "title": "Mars Rover Can't Escape AI Even On A Whole Separate Planet - Jalopnik", "description": "Driving the rover remotely in real time isn't possible due to the vast distance between the planets.", "url": "https://www.jalopnik.com/2092323/mars-rover-escape-ai/", "urlToImage": "https://www.jalopnik.com/img/gallery/mars-rover-is-on-a-whole-separate-planet-and-still-cant-escape-ai/l-intro-1770144595.jpg", "publishedAt": "2026-02-05T04:45:00Z", "content": "NASA didn't just blindly upload the route to the rover and hope for best. After all, AI models are eager to launch nukes in war simulations, so engineers needed to make sure the route wasn't going to… [+1906 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Imaging the sub-moiré potential using an atomic single electron transistor - Nature", "description": "An&nbsp;atomic single electron transistor, which utilizes a single atomic defect in a van der Waals material as an ultrasensitive, high-resolution potential sensor, is used to image the&nbsp;electrostatic potential&nbsp;within a moiré unit cell.", "url": "https://www.nature.com/articles/s41586-025-10085-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-10085-z/MediaObjects/41586_2025_10085_Fig1_HTML.png", "publishedAt": "2026-02-05T03:56:15Z", "content": "<li>Inbar, A. et al. The quantum twisting microscope. Nature614, 682687 (2023).\r\nArticle \r\n ADS \r\n CAS \r\n PubMed \r\nGoogle Scholar \r\n</li><li>Yankowitz, M. et al. Emergence of superlattice Dirac point… [+8974 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Conrad Duncan", "title": "Exposure to burn injuries played key role in shaping human evolution, study suggests - Phys.org", "description": "Humans' exposure to high temperature burn injuries may have played an important role in our evolutionary development, shaping how our bodies heal, fight infection, and sometimes fail under extreme injury, according to new research.", "url": "https://phys.org/news/2026-02-exposure-injuries-played-key-role.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/caveman-fire.jpg", "publishedAt": "2026-02-05T00:10:06Z", "content": "Humans' exposure to high temperature burn injuries may have played an important role in our evolutionary development, shaping how our bodies heal, fight infection, and sometimes fail under extreme in… [+6408 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Wayne Lewis", "title": "Electron-phonon 'surfing' could help stabilize quantum hardware, nanowire tests suggest - Phys.org", "description": "That low-frequency fuzz that can bedevil cellphone calls has to do with how electrons move through and interact in materials at the smallest scale. The electronic flicker noise is often caused by interruptions in the flow of electrons by various scattering pr…", "url": "https://phys.org/news/2026-02-electron-phonon-surfing-stabilize-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/researchers-discover-h-2.jpg", "publishedAt": "2026-02-04T22:21:01Z", "content": "That low-frequency fuzz that can bedevil cellphone calls has to do with how electrons move through and interact in materials at the smallest scale. The electronic flicker noise is often caused by int… [+6961 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Manchester", "title": "Graphene sealing enables first atomic images of monolayer transition metal diiodides - Phys.org", "description": "Two-dimensional (2D) materials promise revolutionary advances in electronics and photonics, but many of the most interesting candidates degrade within seconds of air exposure, making them nearly impossible to study or integrate into real-world technology. Tra…", "url": "https://phys.org/news/2026-02-graphene-enables-atomic-images-monolayer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/first-atomicscale-imag.jpg", "publishedAt": "2026-02-04T22:05:39Z", "content": "Two-dimensional (2D) materials promise revolutionary advances in electronics and photonics, but many of the most interesting candidates degrade within seconds of air exposure, making them nearly impo… [+3506 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Open-source AI tool beats giant LLMs in literature reviews — and gets citations right - Nature", "description": "Researchers can deploy the cheap and transparent model on their own computer system.", "url": "https://www.nature.com/articles/d41586-026-00347-9", "urlToImage": "https://media.nature.com/lw1200/magazine-assets/d41586-026-00347-9/d41586-026-00347-9_52015400.jpg", "publishedAt": "2026-02-04T20:49:32Z", "content": "OpenScholar is an LLM that performs scientific literature reviews using a database of 45 million open-access articles.Credit: dpa via Alamy\r\nResearchers have published the recipe for an artificial-in… [+2534 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Regulatory grammar in human promoters uncovered by MPRA-based deep learning - Nature", "description": "PARM is a deep-learning model trained on data from massively parallel reporter assays to help predict promoter activity in different human cell types, design synthetic promoters and identify key features of regulatory promoter grammar.", "url": "https://www.nature.com/articles/s41586-025-10093-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-10093-z/MediaObjects/41586_2025_10093_Fig1_HTML.png", "publishedAt": "2026-02-04T20:37:30Z", "content": "TSS selection\r\nThe selection of relevant TSSs was done as previously described60. In brief, we selected GENCODE-defined TSSs62, with the additional requirement that they are active in at least one ce… [+38125 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Are There Ten Trillion Objects Like 3I/ATLAS Within the Solar System Right Now? - Avi Loeb – Medium", "description": "The latest data from the Hubble Space Telescope (reported here) implies that the radius of the nucleus of the interstellar object 3I/ATLAS…", "url": "https://avi-loeb.medium.com/are-there-ten-trillion-objects-like-3i-atlas-within-the-solar-system-right-now-589a833136eb", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*HyZLFX-wMmw0-pRmE-vvwQ.jpeg", "publishedAt": "2026-02-04T20:05:37Z", "content": "An artists illustration of the Solar System, calibrated by the scale of the Earth-Sun separation (1 AU). The outer edge of objects bound to the Sun in the so-called Oort Cloud is estimated to be at a… [+5814 chars]"}]}