{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily", "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…", "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg", "publishedAt": "2023-06-25T01:30:26Z", "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Study reveals how immune system of astronauts breaks down - KSL.com", "description": "Evidence is growing about the many ways that traveling in the microgravity environment of space tampers with the human body, with new research showing how it dials down the activity of genes in white blood cells crucial to the immune system.", "url": "https://www.ksl.com/article/50671711/study-reveals-how-immune-system-of-astronauts-breaks-down", "urlToImage": "https://img.ksl.com/slc/2935/293570/29357070.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-06-24T22:49:38Z", "content": "Estimated read time: 3-4\r\n minutes\r\nWASHINGTON Evidence is growing about the many ways that traveling in the microgravity environment of space tampers with the human body, with new research showing h… [+3804 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New White Dwarf Pulsar Discovery: “Stellar Fossils” Unveil Cosmic Secrets - SciTechDaily", "description": "A research group from the University of Warwick has discovered a rare white dwarf pulsar for only the second time, providing significant insights into stellar evolution. The pulsar's strong magnetic fields, rapid spinning, and cool temperature support the dyn…", "url": "https://scitechdaily.com/?p=287434", "urlToImage": "https://scitechdaily.com/images/Exotic-Binary-Star-System-AR-Scorpii.jpg", "publishedAt": "2023-06-24T20:44:49Z", "content": "ByUniversity of WarwickJune 24, 2023\r\nA research team has made the second-ever discovery of a rare type of white dwarf pulsar system, a significant advancement in understanding stellar evolution. The… [+7407 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Octo-eyes: Unraveling Octopus Vision with Neural Mapping - Neuroscience News", "description": "Researchers mapped neural activity in an octopus's visual system, revealing striking similarities to humans.", "url": "https://neurosciencenews.com/octopus-vision-neuroscience-23522/", "urlToImage": "https://neurosciencenews.com/files/2023/06/octopus-visual-processing-neurosicences.jpg", "publishedAt": "2023-06-24T19:01:50Z", "content": "Summary: Researchers mapped neural activity in an octopus’s visual system, revealing striking similarities to humans.\r\nThe team observed neural responses to light and dark spots, thereby creating a m… [+7211 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Matt Williams, Universe Today", "title": "Astronomers Spot the Same Supernova 4 Times Due to an Einsteinian Effect - Inverse", "description": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it — collectively referred to as the Cosmic Distance Ladder.", "url": "https://www.inverse.com/science/astronomers-see-the-same-supernova-four-times-thanks-to-a-gravitational-lens", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/6/20/41d7f1e2-d38c-443d-87ae-b37032e09f7a-einstein_cross-1915x1200.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-24T18:00:25Z", "content": "Measuring cosmic distances is challenging, and astronomers rely on multiple methods and tools to do it collectively referred to as the Cosmic Distance Ladder. One particularly crucial tool is Type Ia… [+3845 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Critical Point in Matter Transformation: When the Universe Changes Its Mind - SciTechDaily", "description": "Analysis of lightweight nuclei emerging from gold ion collisions offers insight into primordial matter phase changes. Physicists analyzing data from gold ion smashups at the Relativistic Heavy Ion Collider (RHIC), a U.S. Department of Energy (DOE) Office of S…", "url": "https://scitechdaily.com/critical-point-in-matter-transformation-when-the-universe-changes-its-mind/", "urlToImage": "https://scitechdaily.com/images/Gold-Ion-Particle-Collision-Illustration.jpg", "publishedAt": "2023-06-24T16:27:19Z", "content": "ByBrookhaven National LaboratoryJune 24, 2023\r\nPhysicists at the RHIC are studying phase changes in nuclear matter from gold ion collisions to identify a critical point in these transformations. Thei… [+8253 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Mars Looks Gorgeous in New Images Taken by NASA's MAVEN Spacecraft - Gizmodo", "description": "The red planet donned a new color when captured in ultraviolet wavelengths.", "url": "https://gizmodo.com/nasa-maven-spacecraft-images-mars-seasons-north-south-1850571845", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cfdc251c21ea22cabff00361a68f960d.png", "publishedAt": "2023-06-24T15:30:00Z", "content": "NASAs Martian explorer, MAVEN, captured Earths neighboring planet in fascinating detail, revealing the changing seasons on Mars as it orbits around the Sun. \r\nThe Mars Atmosphere and Volatile Evoluti… [+2604 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "There Could Be Captured Planets in the Oort Cloud - Universe Today", "description": "The early Solar System was a turbulent and chaotic place with icy material hurled far from the Sun, becoming the Oort Cloud. Larger objects and planets were probably hurled into the Oort Cloud too, and some might have been kicked out of the Solar System entir…", "url": "https://www.universetoday.com/162077/there-could-be-captured-planets-in-the-oort-cloud/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/ogle.jpg", "publishedAt": "2023-06-24T15:17:06Z", "content": "Our solar system has had a chaotic past. Earth and the other planets are now in stable orbits, but while they were forming they experienced drastic location shifts. Jupiter was likely much closer to … [+3226 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Juliette Collen", "title": "Our galaxy's black hole not as sleepy as thought: astronomers - Phys.org", "description": "The supermassive black hole lurking at the center of our Milky Way galaxy is not as dormant as had been thought, a new study shows.", "url": "https://phys.org/news/2023-06-galaxy-black-hole-sleepy-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-first-ever-image-o.jpg", "publishedAt": "2023-06-24T14:03:22Z", "content": "The supermassive black hole lurking at the center of our Milky Way galaxy is not as dormant as had been thought, a new study shows.\r\nThe slumbering giant woke up around 200 years ago to gobble up som… [+3599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cataclysm in the Cosmos: Princeton Researchers Unmask the Violent Origins of the Geminids Meteor Shower - SciTechDaily", "description": "Princeton researchers used data from NASA's Parker Solar Probe to deduce that a catastrophic event likely created the prolific Geminids meteoroid stream. Unlike most meteor showers which originate from comets, the Geminids appear to stem from the asteroid 320…", "url": "https://scitechdaily.com/cataclysm-in-the-cosmos-princeton-researchers-unmask-the-violent-origins-of-the-geminids-meteor-shower/", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Spacecraft-Approaching-Sun-1.jpg", "publishedAt": "2023-06-24T12:13:01Z", "content": "ByPrinceton UniversityJune 24, 2023\r\nIllustration of the Parker Solar Probe spacecraft approaching the sun. Princeton scientists used NASAs Parker Solar Probe data to deduce a violent, catastrophic e… [+10181 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "What causes the strange green flash at sunset and sunrise on Earth? - Space.com", "description": "There are very special cases, when the sky is very clear and exceptionally transparent, that a green flash can be glimpsed just as the very topmost part of the sun is rising or setting.", "url": "https://www.space.com/green-flash-earth-sunrise-sunset", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WV3Bh8TGjQFCK3YNNtxz3g-1200-80.jpg", "publishedAt": "2023-06-24T12:00:06Z", "content": "Here is something that you might remember from your high school earth science class: As sunlight — which appears to be pure white — passes through a glass prism, it refracts or bends. Different wavel… [+6883 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "The most stunning space images captured in 2023, so far - Mashable", "description": "Jaw-dropping views of the cosmos.", "url": "https://mashable.com/article/space-images-best", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01g0XCwc5BtpHzS0Jt93axM/hero-image.fill.size_1200x675.v1686691089.png", "publishedAt": "2023-06-24T10:30:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "SpaceX to launch Europe's Euclid dark energy probe 1 week from today - Space.com", "description": "The dark energy and dark matter hunter launches on July 1.", "url": "https://www.space.com/dark-energy-euclid-spacex-rocket-launch-one-week-away", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8ruAUk6URTqdRZoJKDFAJn-1200-80.jpg", "publishedAt": "2023-06-24T10:00:47Z", "content": "A European probe is just one week away from launching on its mission to help unveil the dark universe.\r\nEuclid, a dark matter and dark energy hunter, is scheduled to launch atop a SpaceX Falcon 9 roc… [+4362 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Lost World” of Ancient Creatures Discovered – 1.6 Billion-Year-Old Eukaryotic Organisms - SciTechDaily", "description": "Researchers have discovered 1.6 billion-year-old eukaryotic organisms, the Protosterol Biota, believed to be Earth's first predators. These ancient creatures, found through fossil fat molecules in ancient rocks, were more complex than bacteria, predating and …", "url": "https://scitechdaily.com/lost-world-of-ancient-creatures-discovered-1-6-billion-year-old-eukaryotic-organisms/", "urlToImage": "https://scitechdaily.com/images/Protosterol-Biota-illustration.jpg", "publishedAt": "2023-06-24T09:47:29Z", "content": "ByAustralian National UniversityJune 24, 2023\r\nArtists imagination of two primordial eukaryotic organisms of the Protosterol Biota on the ocean floor. Based on molecular fossils, organisms of the Pro… [+5935 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Meg Duff", "title": "What is the maximum number of biological parents an organism can have? - Livescience.com", "description": "Most organisms have two parents, but not all. Could an individual have three parents, or even more?", "url": "https://www.livescience.com/health/genetics/what-is-the-maximum-number-of-biological-parents-an-organism-can-have", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aC2JvN2tpCj48WqTHaseQP-1200-80.jpg", "publishedAt": "2023-06-24T09:00:00Z", "content": "Families come in all shapes and sizes, and not all parents are biologically related to their children. But most people do have two genetic parents, from whom they inherited their DNA. However, a very… [+6286 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Radio Revelations: Unraveling the Origins of a Supernova - SciTechDaily", "description": "An international team of astronomers has revealed the origin of a thermonuclear supernova explosion. Strong emission lines of helium and the first detection of such a supernova in radio waves show that the exploding white dwarf star had a helium-rich companio…", "url": "https://scitechdaily.com/radio-revelations-unraveling-the-origins-of-a-supernova/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-06-24T08:32:28Z", "content": "ByUniversity of TurkuJune 24, 2023\r\nArtist impression of the double star system with a compact white dwarf star accreting matter from a helium-rich donor companion, surrounded by dense and dusty circ… [+4646 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Alexander McNamara", "title": "Science news this week: Asia's tallest tree and mysterious brain spirals - Livescience.com", "description": "June 24, 2023: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/planet-earth/science-news-this-week-asias-tallest-tree-and-mysterious-brain-spirals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cvWdseL23SwpYeC69M56Mc-1200-80.jpg", "publishedAt": "2023-06-24T08:00:00Z", "content": "The news this week was dominated by the search for the OceanGate Titan submersible, which went missing during its descent to the wreckage of the Titanic. Tragically, the U.S. Coast Guard confirmed th… [+3783 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Image of Jupiter's Atmosphere Captured by NASA's Juno Spacecraft Reveals High-Altitude Hazes - SciTechDaily", "description": "On March 1, 2023, NASA's Juno mission completed its 49th close flyby of Jupiter. As the spacecraft flew low over the giant planet's cloud tops, its JunoCam instrument captured this look at bands of high-altitude haze forming above cyclones in an area known at…", "url": "https://scitechdaily.com/stunning-image-of-jupiters-atmosphere-captured-by-nasas-juno-spacecraft-reveals-high-altitude-hazes/", "urlToImage": "https://scitechdaily.com/images/Jupiter-Atmosphere-High-Altitude-Hazes.jpg", "publishedAt": "2023-06-24T04:58:45Z", "content": "ByNASAJune 23, 2023\r\nNASAs Juno mission achieved a significant milestone with the completion of its 49th close flyby of Jupiter on March 1, 2023. The spacecraft, during its flyby, captured remarkable… [+3899 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Decades-long bet on consciousness ends — and it's philosopher 1, neuroscientist 0 - Nature.com", "description": "Christof Koch wagered David Chalmers 25 years ago that researchers would learn how the brain achieves consciousness by now. But the quest continues.", "url": "https://www.nature.com/articles/d41586-023-02120-8", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-02120-8/d41586-023-02120-8_25528942.jpg", "publishedAt": "2023-06-24T04:06:10Z", "content": null}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Sean Thiessen", "title": "A New Study Reveals A Terrifying Truth Of The Early Universe - Giant Freakin Robot", "description": "Scientists used a new mathematical model, based on gravitional waves, to learn more about the origins of the universe.", "url": "https://www.giantfreakinrobot.com/sci/universe-filled-black-holes.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2020/07/blackhole3-e1677771500416.jpeg", "publishedAt": "2023-06-24T03:51:54Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Way To Annihilate a Star: Stellar Demolition Derby Near Black Hole in Ancient Galaxy - SciTechDaily", "description": "Astrophysicists have discovered a new mechanism for star destruction and gamma-ray burst generation, originating from stellar collisions in the dense environments near supermassive black holes in ancient galaxies. This finding, published in Nature Astronomy, …", "url": "https://scitechdaily.com/a-new-way-to-annihilate-a-star-stellar-demolition-derby-near-black-hole-in-ancient-galaxy/", "urlToImage": "https://scitechdaily.com/images/Gamma-Ray-Burst-Artistic-Illustration-scaled.jpg", "publishedAt": "2023-06-24T01:32:33Z", "content": "ByNorthwestern UniversityJune 23, 2023\r\nAn international team of astrophysicists led by Radboud University in the Netherlands discovered a novel mechanism that destroys stars and generates a gamma-ra… [+10936 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling the Catalyst of Life: The Unexpected Role of Sulfate - SciTechDaily", "description": "A recent research study may have discovered a missing link that helps explain Earth's uniquely oxygen-saturated atmosphere and the corresponding evolution of animal life on our planet. The study, led by a Fellow of the Forrest Research Foundation at The Unive…", "url": "https://scitechdaily.com/unveiling-the-catalyst-of-life-the-unexpected-role-of-sulfate/", "urlToImage": "https://scitechdaily.com/images/Planet-Earth-Glowing.jpg", "publishedAt": "2023-06-24T00:18:12Z", "content": "A new study suggests that the weathering of sulfate rocks, not increasing ocean phosphorus levels, was crucial to the oxygenation of Earths atmosphere, influencing the late evolution of animal life, … [+2786 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Physicists Discover a New State of Matter Hidden in The Quantum World - ScienceAlert", "description": "You're familiar with the states of matter we encounter daily – such as solid, liquid, and gas – but in more exotic and extreme conditions, new states can appear, and scientists from the US and China just found one.", "url": "https://www.sciencealert.com/physicists-discover-a-new-state-of-matter-hidden-in-the-quantum-world", "urlToImage": "https://www.sciencealert.com/images/2023/06/ElectronFuzz.jpg", "publishedAt": "2023-06-24T00:01:13Z", "content": "You're familiar with the states of matter we encounter daily such as solid, liquid, and gas but in more exotic and extreme conditions, new states can appear, and scientists from the US and China just… [+3394 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "Our Milky Way Is Somewhat Of An Oddball Galaxy, New Study Confirms - Forbes", "description": "The disk of our Milky Way galaxy formed way early; earlier than most spiral galaxies of its size, but it’s not a complete outlier.", "url": "https://www.forbes.com/sites/brucedorminey/2023/06/23/our-milky-way-is-somewhat-of-an-oddball-galaxy-new-study-confirms/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6496297203a751a3c55d4176/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2023-06-23T23:31:39Z", "content": "386160 01: An image produced by the Hubble telescope of the perfectly \"edge-on\" galaxy, or NGC 4013 ... [+] , March 1, 2001. This new Hubble picture reveals, with great detail, huge clouds of dust an… [+3814 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Strange Objects Found at The Galactic Center Are Like Nothing Else in The Milky Way - ScienceAlert", "description": "There's something really weird in the center of the Milky Way.", "url": "https://www.sciencealert.com/strange-objects-found-at-the-galactic-center-are-like-nothing-else-in-the-milky-way", "urlToImage": "https://www.sciencealert.com/images/2020-01/processed/black-hole-blobs_1024.jpg", "publishedAt": "2023-06-23T23:14:55Z", "content": "There's something really weird in the center of the Milky Way.\r\nThe vicinity of a supermassive black hole is a pretty weird place to start with, but in 2020 astronomers found six objects orbiting Sag… [+4123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unraveling Cosmic Mysteries: Celestial Monsters and the Origins of Globular Clusters - SciTechDaily", "description": "Researchers from the universities of Geneva, Paris, and Barcelona have uncovered strong evidence that the peculiarities seen in sizable star clusters can be explained by supermassive stars. Globular clusters are the universe's most massive and ancient star gr…", "url": "https://scitechdaily.com/unraveling-cosmic-mysteries-celestial-monsters-and-the-origins-of-globular-clusters/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Stars-Globular-Clusters.jpg", "publishedAt": "2023-06-23T22:57:44Z", "content": "ByUniversity of GenevaJune 23, 2023\r\nScientists have found strong evidence that supermassive stars existed within globular clusters when they formed 13 billion years ago. Here, an image of the globul… [+5252 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "TRAPPIST-1c by James Webb // Ancient Echo from Sgr A* // Lightning on Jupiter - Fraser Cain", "description": "JWST Looks at the Next Planet in the TRAPPIST system. Could we detect colliding supermassive black holes. Hot Jupiters that flew too close to their stars. 🦄...", "url": "https://www.youtube.com/watch?v=5jw_cHqT8QU", "urlToImage": "https://i.ytimg.com/vi/5jw_cHqT8QU/maxresdefault.jpg", "publishedAt": "2023-06-23T22:52:41Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": "mars.nasa.gov", "title": "If at First You Don't Succeed… Persevere! - NASA - NASA Mars Exploration", "description": "As discussed in last week’s blog, the Science Team has been attempting to obtain a sample of a conglomerate rock unit on top of the fan in Jezero crater.", "url": "https://mars.nasa.gov/mars2020/mission/status/469/if-at-first-you-dont-succeed-persevere/", "urlToImage": "https://mars.nasa.gov/mars2020-raw-images/pub/ods/surface/sol/00822/ids/edr/browse/cachecam/CCF_0822_0739939369_301ECMUN0400132CACH00227_01_295J01_1200.jpg", "publishedAt": "2023-06-23T22:28:34Z", "content": "As discussed in last weeks blog, the Science Team has been attempting to obtain a sample of a conglomerate rock unit on top of the fan in Jezero crater. The first attempt yielded a sample that was un… [+1736 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA's Parker Solar Probe starts summer with 16th swoop by the sun - Space.com", "description": "The sun-kissing spacecraft is definitely feeling the heat (but its science instruments, thankfully, are not).", "url": "https://www.space.com/nasa-parker-solar-probe-16th-sun-flyby", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SHcYVnfokLECLkasAnhVjc-1200-80.jpg", "publishedAt": "2023-06-23T22:00:17Z", "content": "NASA’s most advanced spacecraft for solar exploration just made another close flyby of the sun. \r\nThe Parker Solar Probe conducted its 16th perihelion pass on Thursday morning (June 22), cruising thr… [+2848 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "The Earth's Rotational Pole has Shifted from All the Groundwater We've Pumped Out - Universe Today", "description": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geological Survey. Glaciers and ice caps make up another 1.74%, but…", "url": "https://www.universetoday.com/162069/the-earths-rotational-pole-has-shifted-from-all-the-groundwater-weve-pumped-out/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/9837.jpg", "publishedAt": "2023-06-23T21:31:39Z", "content": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geologi… [+4136 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Watch a house-size asteroid zoom past Earth live on June 25 - Space.com", "description": "The asteroid will pass between Earth and the moon, but there's no need to worry.", "url": "https://www.space.com/asteroid-2023-mu2-livestream-june-25", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7yL4EpQtmyw4jYuKZXygSM-1200-80.jpg", "publishedAt": "2023-06-23T21:00:05Z", "content": "Earth is about to have a close encounter with a space rock.\r\nOn Sunday (June 25), the near-Earth asteroid 2023 MU2 will pass within 134,000 miles (215,000 kilometers) of Earth, or just about 60% of t… [+2132 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Sckylar Gibby-Brown", "title": "Solar Storms Cause A Terrifying, Record-Breaking Statistic For Earth - Giant Freakin Robot", "description": "Solar storms millions of miles away are impacting Earth and all life on the planet will soon feel the effects.", "url": "https://www.giantfreakinrobot.com/sci/solar-storms-earth-highest-temperatures.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/06/solar-storm-sun.jpg", "publishedAt": "2023-06-23T20:25:13Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New finding suggests how and why temperatures determine the sex of turtles - Phys.org", "description": "Warmer temperatures are known to make more turtle eggs become female hatchlings, but new research out of Duke University shows that those females also have a higher capacity for egg production, even before their sex is set.", "url": "https://phys.org/news/2023-06-temperatures-sex-turtles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-finding-suggests-h.jpg", "publishedAt": "2023-06-23T20:19:55Z", "content": "Warmer temperatures are known to make more turtle eggs become female hatchlings, but new research out of Duke University shows that those females also have a higher capacity for egg production, even … [+4844 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT's Nematic Leap: Physicists Discover a New Switch for Superconductivity - SciTechDaily", "description": "MIT researchers have found a new mechanism by which the superconductor iron selenide transitions into a superconducting state. Unlike other iron-based superconductors, iron selenide's transition involves a collective shift in atoms' orbital energy, not atomic…", "url": "https://scitechdaily.com/mits-nematic-leap-physicists-discover-a-new-switch-for-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Graphene-2D-Material-Superconductivity-Concept.jpg", "publishedAt": "2023-06-23T20:12:56Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJune 23, 2023\r\nMIT physicists have unveiled a new understanding of how certain superconductors transition into a superconducting state, offering f… [+7372 chars]"}, {"source": {"id": null, "name": "Belloflostsouls.net"}, "author": "Larry Vela", "title": "Warhammer 40K: What Is The Astronomican Anyway? - BoLS", "description": "The Astronomican is the Emperor's great beacon. Without which warp travel would be impossible. But watches the astronomical lighthouse?", "url": "https://www.belloflostsouls.net/2023/06/warhammer-40k-what-is-the-astronomican-anyway.html", "urlToImage": "https://www.belloflostsouls.net/wp-content/uploads/2019/07/astronomican.jpg", "publishedAt": "2023-06-23T19:10:33Z", "content": "The Astronomican is the Emperor’s great beacon. Without which warp travel would be impossible. But who watches the astronomical lighthouse?\r\nThe Astronomican\r\nThe Astronomican is a psychic beacon whi… [+7870 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": ", USA TODAY", "title": "Tonga Hunga volcano 2022 produced most intense lightning storm - USA TODAY", "description": "Last year's colossal eruption of the Hunga undersea volcano near Tonga produced Earth's most intense recorded lightning storm, scientists said.", "url": "https://www.usatoday.com/story/news/weather/2023/06/23/tonga-hunga-volcano-2022-produced-most-intense-lightning-storm/70350972007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/06/23/USAT/4448a61c-3fad-466c-bb56-f704f34c7fd5-felix-mittermeier-Zkx_DgMQink-unsplash.jpg?auto=webp&crop=1911,1075,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-06-23T18:54:16Z", "content": "Wow.\r\nLast year's colossal eruption of the Hunga undersea volcano near Tonga produced the most intense lightning storm ever recorded on Earth, scientists announced in a new study published this week.… [+2877 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Nancy Grace Roman Could Detect Supermassive Dark Stars - Universe Today", "description": "Dark stars are hypothetical objects that might have been present in the early Universe before the first stars and even modern supermassive black holes formed. A new study suggests that the upcoming Nancy Grace Roman Telescope could detect them when it comes o…", "url": "https://www.universetoday.com/162063/nancy-grace-roman-could-detect-supermassive-dark-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/dark.jpg", "publishedAt": "2023-06-23T18:51:04Z", "content": "The first stars of the universe were very different than the stars we see today. They were made purely of hydrogen and helium, without heavier elements to help them generate energy in their core. As … [+3074 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Richard Angle", "title": "SpaceX Falcon 9 launches 56 Starlink satellites - TESLARATI", "description": "Lifting off from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida at 11:35 a.m. ET (15:35 UTC), a Falcon 9 successfully deployed 56 Starlink satellites into low Earth orbit. Originally scheduled to launch at 9:56 a.m., thunderstorms in…", "url": "https://www.teslarati.com/spacex-falcon-9-launches-56-starlink-satellites/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/07/SES-22-F9-B1073-LC-40-062922-Richard-Angle-launch-5-c.jpg", "publishedAt": "2023-06-23T18:49:55Z", "content": "Lifting off from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida at 11:35 a.m. ET (15:35 UTC), a Falcon 9 successfully deployed 56 Starlink satellites into low Earth orbit.\r\n… [+2112 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Issam AHMED", "title": "Like dogs, wolves recognize familiar human voices - Phys.org", "description": "Here, wolfie, wolfie, wolfie! Like dogs, wolves recognize and respond to the voices of familiar humans more than strangers, according to a study that has implications both for the story of canine domestication and our broader understanding of the natural worl…", "url": "https://phys.org/news/2023-06-dogs-wolves-familiar-human-voices.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/a-wolf-inside-its-encl.jpg", "publishedAt": "2023-06-23T18:36:00Z", "content": "Here, wolfie, wolfie, wolfie! Like dogs, wolves recognize and respond to the voices of familiar humans more than strangers, according to a study that has implications both for the story of canine dom… [+3725 chars]"}, {"source": {"id": null, "name": "Thenationalnews.com"}, "author": "Thomas Harding", "title": "How long before climate change claims the Thwaites Glacier? - The National", "description": "The National visits the British Antarctic Survey, which plans to use AI to study data that could offer hope for the planet's future", "url": "https://www.thenationalnews.com/weekend/2023/06/23/how-long-before-climate-change-claims-the-thwaites-glacier/", "urlToImage": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/u3E2ijXLjbZMkndD_xXpOx8q4Zc=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/OIFHANO7XLYLIZ7Z4Z2GCR3MVU.jpg", "publishedAt": "2023-06-23T18:03:43Z", "content": "This summer, deep in the crevasses of a glacier the size of Britain, Dr Alex Brisbourne will attempt to uncover information that could affect all humanity.\r\nHidden in the ice of the Thwaites Glacier … [+6708 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Rebecca Dyer", "title": "Horses Used to Have Toes. What Happened to Them? - ScienceAlert", "description": "Horses' ancient ancestors once trotted across the landscape on a small number of hooved toes, evolving over the ages to a single solid hoof we see today.", "url": "https://www.sciencealert.com/horses-used-to-have-toes-what-happened-to-them", "urlToImage": "https://www.sciencealert.com/images/2023/06/HorsesOfVariousColorsInField.jpg", "publishedAt": "2023-06-23T18:01:13Z", "content": "Horses' ancient ancestors once trotted across the landscape on a small number of hooved toes, evolving over the ages to a single solid hoof we see today.\r\nAccording to a comprehensive analysis of hor… [+5153 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jaron Schneider", "title": "Hubble's New High-Res Star Cluster Photo is Your Next Desktop Background - PetaPixel", "description": "Right click -> Save As", "url": "https://petapixel.com/2023/06/23/hubbles-new-high-res-star-cluster-photo-is-your-next-desktop-background/", "urlToImage": "https://petapixel.com/assets/uploads/2023/06/Hubbles-New-High-Res-Star-Cluster-Photo-is-Your-Next-Desktop-Background.jpg", "publishedAt": "2023-06-23T17:33:15Z", "content": "A newly released photo captured by the Hubble Space Telescope shows off a spectacular cluster teeming with bright, glittering stars that is available in greater than 4K resolution. \r\nThe 19-megapixel… [+2441 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Effect of volcanic eruptions significantly underestimated in climate projections, study shows - Phys.org", "description": "Researchers have found that the cooling effect that volcanic eruptions have on Earth's surface temperature is likely underestimated by a factor of two, and potentially as much as a factor of four, in standard climate projections.", "url": "https://phys.org/news/2023-06-effect-volcanic-eruptions-significantly-underestimated.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/effect-of-volcanic-eru.jpg", "publishedAt": "2023-06-23T16:49:04Z", "content": "(a) Annual eruption probability based on ice-core (Sigl et al., 2022) and satellite (S. Carn, 2022) datasets. (b) Empirical cumulative probability density function of the SO2 mass distribution of the… [+5880 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Eleanor Higgs", "title": "The Funky Fossilized Hand Of A New Species Of Theropod Dinosaur Has Been Discovered In Mongolia - IFLScience", "description": "The hand is like nothing we've seen before.", "url": "https://www.iflscience.com/funky-fossilized-hand-of-a-new-species-of-theropod-dinosaur-is-like-no-other-69507", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69507/aImg/68777/dino-hand-meta.png", "publishedAt": "2023-06-23T16:48:51Z", "content": "Some areas of the world are particularly rich in dinosaur fossils, and while some finds are spectacular or of particular scientific importance, some are just downright confusing. A new discovery in M… [+1631 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Monarch butterfly's spots help it migrate - study - BBC", "description": "Researchers say that monarchs with more white spots on their wings migrate more successfully.", "url": "https://www.bbc.com/news/science-environment-65952022", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/757B/production/_130157003_gettyimages-1246834543-1.jpg", "publishedAt": "2023-06-23T16:46:24Z", "content": "What makes for a successful insect migration?\r\nFor a monarch butterfly, the more white spots you have, the better your chances, new research suggests.\r\nResearchers from the University of Georgia stud… [+1544 chars]"}, {"source": {"id": null, "name": "GeekWire"}, "author": "GeekWire", "title": "University of Washington team detects atomic 'breathing' for quantum computing breakthrough - GeekWire", "description": null, "url": "https://www.geekwire.com/2023/university-of-washington-team-detects-atomic-breathing-for-quantum-computing-breakthrough/", "urlToImage": null, "publishedAt": "2023-06-23T16:05:56Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "The Mars Sample Return mission is starting to give NASA sticker shock - Ars Technica", "description": "\"It is better to not do it than to torch the whole science community.\"", "url": "https://arstechnica.com/space/2023/06/the-mars-sample-return-mission-is-starting-to-give-nasa-sticker-shock/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/PIA25277-760x380.jpg", "publishedAt": "2023-06-23T16:01:31Z", "content": "Enlarge/ This illustration shows a concept for a proposed NASA Sample Retrieval Lander, about the size of an average two-car garage, that would carry a small rocket called the Mars Ascent Vehicle to … [+5481 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New era of exoplanet discovery begins with images of 'Jupiter's younger sibling' - Phys.org", "description": "Astronomers using W. M. Keck Observatory on Maunakea, Hawaiʻi Island have discovered one of the lowest-mass planets whose images have been directly captured. Not only were they able to measure its mass, but they were also able to determine that its orbit is s…", "url": "https://phys.org/news/2023-06-era-exoplanet-discovery-images-jupiter.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-era-of-exoplanet-d-2.jpg", "publishedAt": "2023-06-23T15:40:24Z", "content": "Astronomers using W. M. Keck Observatory on Maunakea, Hawaii Island have discovered one of the lowest-mass planets whose images have been directly captured. Not only were they able to measure its mas… [+4940 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Paleontologist Describes New Species of Ancient Toothed Whale - Sci.News", "description": "Olympicetus thalassodon is one of several that are helping us understand the early history and diversification of modern dolphins, porpoises and other toothed whales.", "url": "https://www.sci.news/paleontology/olympicetus-thalassodon-12032.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_12032f-Olympicetus-thalassodon.jpg", "publishedAt": "2023-06-23T14:47:43Z", "content": "Olympicetus thalassodon is one of several that are helping us understand the early history and diversification of modern dolphins, porpoises and other toothed whales.\r\nLife reconstruction of Olympice… [+3076 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Flow of water on a carbon surface is governed by quantum friction, says study - Phys.org", "description": "Water and carbon make a quantum couple: the flow of water on a carbon surface is governed by an unusual phenomenon dubbed quantum friction. A new work published in Nature Nanotechnology experimentally demonstrates this phenomenon—which was predicted in a prev…", "url": "https://phys.org/news/2023-06-carbon-surface-quantum-friction.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/flow-of-water-on-a-car.jpg", "publishedAt": "2023-06-23T14:14:03Z", "content": "Water and carbon make a quantum couple: the flow of water on a carbon surface is governed by an unusual phenomenon dubbed quantum friction. A new work published in Nature Nanotechnology experimentall… [+5153 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Physicists develop a novel quantum theory of light-induced matter - Phys.org", "description": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the \"light-induced phase\" of matter and predicts its novel functionalities. The new theory has the potential to revolutionize the field o…", "url": "https://phys.org/news/2023-06-physicists-quantum-theory-light-induced.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/physicist-develops-a-n.jpg", "publishedAt": "2023-06-23T14:12:03Z", "content": "A team led by a physicist from City University of Hong Kong (CityU) recently developed a new quantum theory that explains the \"light-induced phase\" of matter and predicts its novel functionalities. T… [+4775 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "A new class of interlocking supramolecular systems: MOFaxanes - Phys.org", "description": "A team of chemists and material scientists at the University of Tokyo has developed a new class of interlocking supramolecular systems by combining metal-organic frameworks with rotaxanes. In their study, reported in the journal Nature Communications, the gro…", "url": "https://phys.org/news/2023-06-class-interlocking-supramolecular-mofaxanes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-new-class-of-interlo.jpg", "publishedAt": "2023-06-23T13:50:01Z", "content": "A team of chemists and material scientists at the University of Tokyo has developed a new class of interlocking supramolecular systems by combining metal-organic frameworks with rotaxanes. In their s… [+2544 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Computer Scientists Inch Closer to Major Algorithmic Goal - Quanta Magazine", "description": "A new paper finds a faster method for determining when two mathematical groups are the same.", "url": "https://www.quantamagazine.org/computer-scientists-inch-closer-to-major-algorithmic-goal-20230623/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/06/GroupIsomorphism-byKikiLjung-Social.webp", "publishedAt": "2023-06-23T13:49:11Z", "content": "In other words, Sun said, in order to further improve graph isomorphism, group isomorphism is a big bottleneck.\r\nWhen progress on a problem stalls as long as it did for group isomorphism, invention i… [+4613 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Disputed study claims Betelgeuse is much closer to supernova - Interesting Engineering", "description": "Tohoku University astronomers claim the star's core will collapse in a few years after the carbon exhaustion. Not everyone agrees.", "url": "https://interestingengineering.com/science/disputed-study-betelgeuse-supernova", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/23/image/jpeg/oosFBmp9BrgrTqHjsNZkpDjdxMmu2o93lNgGlD1Z.jpg", "publishedAt": "2023-06-23T13:15:00Z", "content": "Following this major sequence is the usage of carbon as a fuel source from its cores. \r\nNot many experts agree with the results \r\nHowever, the carbon-burning cycle is divided into many stages. As a r… [+2420 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "New navigation system works even when GPS fails - Freethink", "description": "A new navigation system that tracks subatomic particles called “muons” could help us get around indoors, underground, and underwater.", "url": "https://www.freethink.com/hard-tech/navigation-system", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/06/navigation-system-thumb.gif?resize=1200,630", "publishedAt": "2023-06-23T13:00:00Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Media to Cover Asteroid Sample Return, Logistics Call - NASA", "description": "NASA’s OSIRIS-REx (Origins, Spectral Interpretation, Resource Identification and Security – Regolith Explorer) mission will deliver the agency’s first asteroid sample collected in space to Earth on Sept. 24, 2023. Media interested in covering the landing, as …", "url": "https://www.nasa.gov/press-release/nasa-invites-media-to-cover-asteroid-sample-return-logistics-call", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/tag_beauty_shot.png", "publishedAt": "2023-06-23T12:50:29Z", "content": null}, {"source": {"id": null, "name": "Jstor.org"}, "author": "Matthew Wills", "title": "Deimos: A Chip Off the Old Martian Block? - JSTOR Daily", "description": "A new space probe suggests that the moonlet Deimos isn’t a captured asteroid after all.", "url": "https://daily.jstor.org/deimos-a-chip-off-the-old-martian-block/", "urlToImage": "https://daily.jstor.org/wp-content/uploads/2023/06/deimos_a_chip_off_the_old_martian_block_1050x700.jpg", "publishedAt": "2023-06-23T12:32:59Z", "content": "So, it turns out there are new things under the Sun, right here in our solar system. One of Marss lumpy pair of moons looks like it may actually be a piece of Mars itself and not, as was long hypothe… [+3498 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Rocket Report: Electron scoops up Virgin launch, ULA flies first 2023 mission - Ars Technica", "description": "\"In microlaunchers that balance is on a knife’s edge.\"", "url": "https://arstechnica.com/space/2023/06/rocket-report-electron-scoops-up-virgin-launch-ula-flies-first-2023-mission/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/Delta-IV-Heavy-NROL-68-June-22-2023-7-760x380.jpg", "publishedAt": "2023-06-23T11:00:14Z", "content": "Enlarge/ United Launch Alliance's Delta IV Heavy rocket takes flight early on Thursday morning carrying the NROL-68 mission.\r\n43 with \r\nWelcome to Edition 5.43 of the Rocket Report! I am thrilled to … [+3960 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Universe Throws a Curveball: The Dark Matter Distribution Paradox - SciTechDaily", "description": "Astrophysicists found the \"clumpiness\" of Universe's dark matter to be 0.76, a figure conflicting with the Cosmic Microwave Background value of 0.83, indicating possible errors or an incomplete cosmological model. The research used the Hyper Suprime-Cam Subar…", "url": "https://scitechdaily.com/the-universe-throws-a-curveball-the-dark-matter-distribution-paradox/", "urlToImage": "https://scitechdaily.com/images/3D-Distribution-of-Dark-Matter-Derived-From-HSCSSP-scaled.jpg", "publishedAt": "2023-06-23T09:46:01Z", "content": "BySubaru TelescopeJune 23, 2023\r\nFigure 1: An example of an image obtained with HSC-SSP. Credit: HSC-SSP project &amp; NAOJ\r\nAstrophysicists found the clumpiness of Universes dark matter to be 0.76, … [+9804 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! Dangerous CME cloud to strike the Earth today, confirms NOAA - HT Tech", "description": "NOAA forecasters have confirmed the fears that the CME cloud released during the X1-class solar flare eruption will hit the Earth today, June 23, and spark a dangerous solar storm event. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-dangerous-cme-cloud-to-strike-the-earth-today-confirms-noaa-71687500074654.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/23/1600x900/faintyoung_2_1687500224204_1687500224423.jpg", "publishedAt": "2023-06-23T06:13:40Z", "content": "Just yesterday, a NASA model revealed the massive coronal mass ejection (CME) cloud that was released from the blast site of the X1-class solar flare eruption that was going to hit both Mars and Venu… [+2272 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Ask Ethan: Do galaxies appear larger in the past? - Big Think", "description": "The farther away they get, the smaller distant galaxies look. But only up to a point, and beyond that, they appear larger again. Here’s how.", "url": "https://bigthink.com/starts-with-a-bang/galaxies-appear-larger-in-past/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/04/big4.gif?resize=1200,630", "publishedAt": "2023-06-23T06:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "We Asked a NASA Scientist: Is There Weather on the Moon? - SciTechDaily", "description": "Is there weather on the Moon? Well, because the Moon doesn't have a significant atmosphere like Earth, it does not experience weather, like wind or atmospheric temperature or precipitation like rain and snow. However, the Moon does experience what we refer to…", "url": "https://scitechdaily.com/we-asked-a-nasa-scientist-is-there-weather-on-the-moon/", "urlToImage": "https://scitechdaily.com/images/Lunar-Reconnaissance-Orbiter-Moon-scaled.jpg", "publishedAt": "2023-06-23T02:33:06Z", "content": "The Moon, lacking an Earth-like atmosphere, doesnt experience typical weather like wind or rain but does undergo space weather. This is caused by factors such as solar wind and meteoroids, which cont… [+2002 chars]"}]}