{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Jack Tamisiea", "title": "Splitting T. Rex Into 3 Species Becomes a Dinosaur Royal Rumble - The New York Times", "description": "A team of researchers published a rebuttal to an argument advanced by another group earlier in the year. The disagreement over the king of dinosaurs is far from over.", "url": "https://www.nytimes.com/2022/07/25/science/tyrannosaurus-rex-dinosaurs.html", "urlToImage": "https://static01.nyt.com/images/2022/07/25/science/25sci-trex1/25sci-trex1-facebookJumbo.jpg", "publishedAt": "2022-07-25T15:00:16Z", "content": "Several scientists immediately had their doubts. The initial study focused on the bulkiness of Tyrannosaurus femurs and the existence of two sets of incisor teeth poking out of the predators lower ja… [+1960 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Two Weeks In, the Webb Space Telescope Is Reshaping Astronomy - Quanta Magazine", "description": "In the days after the mega-telescope started delivering data, astronomers reported new discoveries about galaxies, stars, exoplanets and even Jupiter.", "url": "https://www.quantamagazine.org/two-weeks-in-the-webb-space-telescope-is-reshaping-astronomy-20220725/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/07/NGC7496_1200_Social.jpg", "publishedAt": "2022-07-25T14:07:24Z", "content": "Hiding in JWSTs image of Jupiter is the volcanic moon Io interacting with Jupiters aurora creating a small bump in the aurora low in the planets sky. The image reveals material coming from Io streami… [+2455 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Mysterious life forms discovered in centuries-old Hawaiian lava caves - Metro.co.uk", "description": "Colonies of microbes found in a very, very inhospitable environment.", "url": "https://metro.co.uk/2022/07/25/mysterious-life-forms-discovered-in-centuries-old-hawaiian-lava-caves-17060670/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/07/Hawaii-cave-3-4c92_1658741931.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-07-25T09:38:00Z", "content": "A stalactite formation in a Hawaiian cave system from this study with copper minerals and white microbial colonies. Despite copper being toxic to many organisms, this formation hosts a microbial comm… [+2823 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jules Bernstein", "title": "The chemical controlling life and death in hair follicles - Phys.org", "description": "A single chemical is key to controlling when hair follicle cells divide, and when they die. This discovery could not only treat baldness, but ultimately speed wound healing because follicles are a source of stem cells.", "url": "https://phys.org/news/2022-07-chemical-life-death-hair-follicles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/the-chemical-controlli.jpg", "publishedAt": "2022-07-25T07:51:46Z", "content": "A single chemical is key to controlling when hair follicle cells divide, and when they die. This discovery could not only treat baldness, but ultimately speed wound healing because follicles are a so… [+3281 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Andy Tomaswick, Universe Today", "title": "NASA Reveals Ambitious New Plan to Detect Signs of Life on Distant Planets - ScienceAlert", "description": "NASA's Institute for Advanced Concepts is famous for supporting outlandish ideas in the astronomy and space exploration fields. Since being re-established in 2011, the institute has supported a wide variety of projects as part of its three-phase prog", "url": "https://www.sciencealert.com/nasa-just-revealed-a-bold-plan-to-detect-biosignatures-on-exoplanets", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/SolarEruptions_1024.jpg", "publishedAt": "2022-07-25T01:28:12Z", "content": "NASA's Institute for Advanced Concepts is famous for supporting outlandish ideas in the astronomy and space exploration fields. Since being re-established in 2011, the institute has supported a wide … [+3820 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: July 24, 2022 | Hackaday - Hackaday", "description": "OK, maybe that won’t buff right out. NASA has released a more detailed analysis of the damage suffered by the James Webb Space Telescope in a run-in with a micrometeoroid, and has deemed the …", "url": "https://hackaday.com/2022/07/24/hackaday-links-july-24-2022/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2022-07-24T23:00:00Z", "content": "OK, maybe that won’t buff right out. NASA has released a more detailed analysis of the damage suffered by the James Webb Space Telescope in a run-in with a micrometeoroid, and has deemed the damage “… [+3703 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Discover New, Unusual Radio Signal from Faraway Galaxy - VOA Learning English", "description": "Scientists say they have discovered a new, unusual radio signal from a distant galaxy.", "url": "https://learningenglish.voanews.com/a/scientists-discover-new-unusual-radio-signal-from-faraway-galaxy/6668760.html", "urlToImage": "https://gdb.voanews.com/AAB2CE89-DE22-49F0-8958-44455A6246C3_cx0_cy7_cw99_w1200_r1.jpg", "publishedAt": "2022-07-24T22:01:07Z", "content": "Researchers say they have discovered a new, unusual radio signal from a distant galaxy.\r\nThe signal is known as a fast radio burst, or FRB. These signals are pulses of radio waves that scientists say… [+4477 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The “Grandest Canyon” in the Solar System: Mars Express Captures Stunning Images of Massive Martian Canyon - SciTechDaily", "description": "ESA’s Mars Express's latest image release takes us over two ruptures in the martian crust that form part of the mighty Valles Marineris canyon system. Valles Marineris cuts across Mars similar to how the Grand Canyon cuts across the United States, except the …", "url": "https://scitechdaily.com/the-grandest-canyon-in-the-solar-system-mars-express-captures-stunning-images-of-massive-martian-canyon/", "urlToImage": "https://scitechdaily.com/images/Mars-Tithonium-Chasma-Perspective-View.jpg", "publishedAt": "2022-07-24T13:29:31Z", "content": "ByEuropean Space Agency (ESA)July 24, 2022\r\nIus and Tithonium Chasmata on Mars. This image from ESAs Mars Express shows Ius and Tithonium Chasmata, which form part of Mars Valles Marineris canyon str… [+6374 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Finds Some Asteroids Aged Early by Sun – “We Were Surprised” - SciTechDaily", "description": "Recently, scientists from NASA’s OSIRIS-REx mission discovered that surface regeneration occurs on asteroids far more quickly than on Earth. By analyzing high-resolution images of rock fractures on asteroid Bennu taken by the OSIRIS-REx spacecraft, the resear…", "url": "https://scitechdaily.com/nasa-finds-some-asteroids-aged-early-by-sun-we-were-surprised/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Bennu-Mosaic-OSIRIS-REx-scaled.jpg", "publishedAt": "2022-07-24T08:45:28Z", "content": "ByRani C. Gran, NASA's Goddard Space Flight CenterJuly 24, 2022\r\nThis mosaic of asteroid Bennu was created using observations made by NASAs OSIRIS-REx spacecraft that was in close proximity to the as… [+6504 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Giant Dinosaur Discovery Reveals Why Many Prehistoric Carnivores Had Such Tiny Arms - SciTechDaily", "description": "Discovery provides insight into the evolution and anatomy of big, carnivorous dinosaurs. Researchers discovered a new huge, meat-eating dinosaur, dubbed Meraxes gigas. The new dinosaur provides fascinating clues about the evolution and biology of dinosaurs su…", "url": "https://scitechdaily.com/new-giant-dinosaur-discovery-reveals-why-many-prehistoric-carnivores-had-such-tiny-arms/", "urlToImage": "https://scitechdaily.com/images/Meraxes-Close-Up-scaled.jpg", "publishedAt": "2022-07-24T06:43:25Z", "content": "ByUniversity of MinnesotaJuly 23, 2022\r\nAn international team that includes a University of Minnesota Twin Cities researcher has discovered a new big, meat-eating dinosaur, dubbed Meraxes gigas (illu… [+5697 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gene Regulation Might Be the Key to a Longer Lifespan - SciTechDaily", "description": "Researchers from the University of Rochester who are interested in longevity genetics propose new targets to fight aging and age-related disorders. Mammals that age at vastly different rates have been created through natural selection. Naked mole rats, for in…", "url": "https://scitechdaily.com/gene-regulation-might-be-the-key-to-a-longer-lifespan/", "urlToImage": "https://scitechdaily.com/images/DNA-Genetics-Evolution-Artists-Concept.jpg", "publishedAt": "2022-07-24T01:59:05Z", "content": "ByUniversity of RochesterJuly 23, 2022\r\nResearchers discovered that long-lived organisms often exhibit high expression of genes involved in DNA repair, RNA transport, and cellular skeleton organizati… [+5920 chars]"}, {"source": {"id": null, "name": "KTVB.com"}, "author": "Brian Holmes", "title": "Watch: Eagle man captures Perseid meteor shower, may be longest meteor ever recorded - KTVB.com", "description": "Jordan Ragsdale's recording lasted 27 seconds. The annual phenomenon lasts through August 24, with its peak expected to be August 13 during the next full moon.", "url": "https://www.ktvb.com/article/news/local/208/eagle-man-captures-perseid-meteor-shower/277-0ad62f21-40d3-4395-941d-4dbcc389ad30", "urlToImage": "https://media.ktvb.com/assets/KTVB/images/4da2ace7-6cbc-49cb-ab43-232913cab821/4da2ace7-6cbc-49cb-ab43-232913cab821_1140x641.jpg", "publishedAt": "2022-07-23T21:48:00Z", "content": "BOISE, Idaho The Perseid meteor shower returned in all its galactic glory on Sunday. This is the time of year when Earth passed through the dust trail left behind by the Comet Swift-Tuttle. \r\nBasical… [+3185 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Incredible Hubble Image Reveals a Bizarre Galaxy 'Mirror' - ScienceAlert", "description": "There's something very odd about this image from the Hubble Space Telescope. If you look closely, you can see two almost-mirror image, orange-colored galaxies, seemingly connected by a long filament.", "url": "https://www.sciencealert.com/a-weird-quirk-of-gravity-created-a-galaxy-mirror-in-this-amazing-hubble-image", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/mirrored-gravitational-lens_1024.jpg", "publishedAt": "2022-07-23T20:02:36Z", "content": "There's something very odd about this image from the Hubble Space Telescope. If you look closely, you can see two almost-mirror image, orange-colored galaxies, seemingly connected by a long filament.… [+2808 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Scientists find the secret to birth of earliest black holes in the Cosmos - The Independent", "description": "A 20-year puzzle about how the earliest monsters were born in the universe may have just been solved", "url": "https://www.independent.co.uk/space/scientists-earliest-black-holes-quasars-b2129821.html", "urlToImage": "https://static.independent.co.uk/2022/05/11/21/Black-hole-wind-illustration-2.jpeg?quality=75&width=1200&auto=webp", "publishedAt": "2022-07-23T18:12:38Z", "content": "It takes a long time to grow a supermassive black hole, even if it eats voraciously. So just how supermassive black holes billions of times heavier than the Sun formed within the first billion years … [+5091 chars]"}]}