{"status": "ok", "totalResults": 27, "articles": [{"source": {"id": null, "name": "Ygorganization.com"}, "author": null, "title": "The Organization | [SD45] The “Traptrix” Initiative - YGOrganization", "description": "Oh hey, actual Spell Cards for Traptrix. SD45-JP001 プティカの蟲惑魔 Pudica no Kowakuma (Traptrix Pudica) Level 4 EARTH Plant Effect Monster ATK 900 DEF 1900 You can only use the (1)st and (2)nd effect of…", "url": "https://ygorganization.com/itsthemostwonderfultimeoftheyear/", "urlToImage": "https://ygorganization.com/wp-content/uploads/2022/11/GirlInAPlant.png", "publishedAt": "2022-11-09T03:57:40Z", "content": "Oh hey, actual Spell Cards for Traptrix.\r\nSD45-JP001 Pudica no Kowakuma (Traptrix Pudica)Level 4 EARTH Plant Effect MonsterATK 900DEF 1900You can only use the (1)st and (2)nd effect of this card’s na… [+1900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "NASA's Artemis I rocket could face damaging winds as storm approaches - CNN", "description": "The NASA Space Launch System rocket is facing a battering from Tropical Storm Nicole, which is now expected to strengthen into a hurricane before it slams into Florida's East Coast.", "url": "https://www.cnn.com/2022/11/08/world/nasa-artemis-i-sls-hurricane-tropical-storm-nicole-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221108135329-artemis-i-1106.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-08T23:28:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe Artemis I mission, which is expected to send an un… [+4936 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": null, "title": "Astronomers Find Wreckage of Destroyed Solar System Right Near Our Own - msnNOW", "description": "Astronomers have spotted the oldest star in the universe that has had rocky and icy planets in its orbit. Today, all that remains around the star is debris accumulating from the vestiges of those bygone worlds — but they're evidence of one of the oldest solar…", "url": "https://futurism.com/the-byte/wreckage-destroyed-solar-system", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA13SMSo.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-11-08T20:37:59Z", "content": "© Provided by Futurism\r\n Only some 90 light years away lurks a graveyard of destroyed planets orbitting a white dwarf. And it may be one of the oldest solar systems in the universe.\r\nDead Space\r\nAstr… [+2628 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Astronomers spot the exposed inner core of an 'oddball' star by accident - Space.com", "description": "The stripped core of a star that was 12 times as massive as the sun was discovered by chance during a stage of stellar evolution that lasts the blink of a cosmic eye.", "url": "https://www.space.com/first-ever-detection-star-core", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rdoMpcUFMsHxPE8i5mq6GM-1200-80.jpg", "publishedAt": "2022-11-08T20:00:37Z", "content": "The exposed core of a massive star has been observed for the first time, a discovery that has been described as purely \"serendipitous\" by the team that chanced upon it.\r\nThough the cores of stars are… [+4916 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA astronaut votes from space bunk bed for Election Day 2022 - Space.com", "description": "'This year's voting booth definitely takes the cake.'", "url": "https://www.space.com/nasa-astronaut-space-ballot-us-election-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oaGy4SGWvxQvYbHZDsvN2H-1200-80.jpg", "publishedAt": "2022-11-08T18:13:08Z", "content": "At least one election ballot this year came from out of this world.\r\nNASA astronaut Josh Cassada zipped up the sleeve on his International Space Station (ISS) bunk bed, creating a modified voting boo… [+3128 chars]"}, {"source": {"id": null, "name": "WMUR Manchester"}, "author": "KC Downey", "title": "Did you see it? Total lunar eclipse wows onlookers in New Hampshire - WMUR Manchester", "description": "Granite Staters in many spots caught glimpse of an awesome sight in the early morning sky Tuesday -- a total lunar eclipse. See photos and a video here.", "url": "https://www.wmur.com/article/new-hampshire-total-lunar-eclipse-11822/41899697", "urlToImage": "https://kubrick.htvapps.com/vidthumb/8cd1630a-4013-40c6-af63-954c399ebba1/8cd1630a-4013-40c6-af63-954c399ebba1_image.jpg?crop=0.690xw:0.690xh;0,0&resize=1200:*", "publishedAt": "2022-11-08T16:48:00Z", "content": "MANCHESTER, N.H. —Granite Staters in many spots caught glimpse of an awesome sight in the early morning sky Tuesday -- a total lunar eclipse.\r\nTotality began at 5:17 a.m. and it ended as the moon set… [+146 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Protective childbirth tattoos found on ancient Egyptian mummies - Livescience.com", "description": "Some ancient Egyptian mothers got tattoos that were likely meant to protect them during childbirth and during the postpartum period, an analysis of their mummies reveals.", "url": "https://www.livescience.com/ancient-egyptian-mothers-protective-tattoos-childbirth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tgnepdRnL2JrYgRntwGV4-1200-80.jpg", "publishedAt": "2022-11-08T15:01:24Z", "content": "A tattoo on the left hip bone of a mummified Egyptian woman buried at Deir el-Medina. (Image credit: Anne Austin/University of Missouri-St. Louis)\r\nLower back tattoos may seem like an early 21st cent… [+5182 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Team creates crystals that generate electricity from heat - Phys.org", "description": "To convert heat into electricity, easily accessible materials from harmless raw materials open up new perspectives in the development of safe and inexpensive so-called \"thermoelectric materials.\" A synthetic copper mineral acquires a complex structure and mic…", "url": "https://phys.org/news/2022-11-team-crystals-electricity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/crystals-generate-elec.jpg", "publishedAt": "2022-11-08T14:56:58Z", "content": "To convert heat into electricity, easily accessible materials from harmless raw materials open up new perspectives in the development of safe and inexpensive so-called \"thermoelectric materials.\" A s… [+3161 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Huge extragalactic structure found hiding behind the Milky Way - Phys.org", "description": "A team of researchers with members from Universidad Nacional de San Juan, Universidade Federal do Rio Grande do Sul and Universidad Andres Bello has found evidence of a large extragalactic assembly hiding behind one part of the Milky Way galaxy. The group has…", "url": "https://phys.org/news/2022-11-huge-extragalactic-milky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/huge-extragalactic-str.jpg", "publishedAt": "2022-11-08T14:56:42Z", "content": "A team of researchers with members from Universidad Nacional de San Juan, Universidade Federal do Rio Grande do Sul and Universidad Andres Bello has found evidence of a large extragalactic assembly h… [+2536 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "NASA needs a new moon car for off-roading astronauts at the lunar south pole - Space.com", "description": "The contracting for the next moon buggy for Artemis has begun.", "url": "https://www.space.com/nasa-needs-a-new-moon-car-for-off-roading-astronauts-at-the-lunar-south-pole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oPw5iqShUmBDoahA2w4dNB-1200-80.jpg", "publishedAt": "2022-11-08T14:45:59Z", "content": "The search for the next-gen buggy for the upcoming Artemis moon missions has begun.\r\nWhile the previous lunar vehicles, used during the 1970s Apollo missions, were designed for the relatively balmy c… [+3704 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Simon", "title": "Scientists Are Uncovering Ominous Waters Under Antarctic Ice - WIRED", "description": "A super-pressurized, 290-mile-long river is running under the ice sheet. That could be bad news for sea-level rise.", "url": "https://www.wired.com/story/scientists-are-uncovering-ominous-waters-under-antarctic-ice/", "urlToImage": "https://media.wired.com/photos/6369829cfb8d8044171209b0/191:100/w_1280,c_limit/Antartica_river_science_GettyImages-160869357.jpg", "publishedAt": "2022-11-08T13:00:00Z", "content": "Its not a tremendous amount of melt per square foot. But over an area thats the size of two large European countries, that scales up. What we concluded is the melting is really smallit's like a milli… [+2935 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Laura Geggel", "title": "Helmet-headed dinosaurs kickboxed like kangaroos, new study suggests - Livescience.com", "description": "Pachycephalosaurs probably didn't butt heads at high speeds. Instead, they likely kickboxed like kangaroos.", "url": "https://www.livescience.com/pachycephalosaur-dinosaurs-kickboxed-like-kangaroos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VpN8xnzzD2EqkoTRXxT6Lj-1200-80.jpg", "publishedAt": "2022-11-08T11:00:00Z", "content": "It's dinosaur lore that pachycephalosaurs — bipedal, Cretaceous beasts with massively thick, domed skulls — forcefully butted heads like bighorn sheep do today. But a new analysis suggests that this … [+4908 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Pinwheel Firework: Stunning Telescope Image Captures Grand Design Spiral Galaxy - SciTechDaily", "description": "This stunning image clearly displays the well-defined arms of the spiral galaxy NGC 4254, also known as the Coma Pinwheel or Messier 99. Because of its distinctive pinwheel shape with prominent arms, it’s called a grand design spiral galaxy. It was discovered…", "url": "https://scitechdaily.com/pinwheel-firework-stunning-telescope-image-captures-grand-design-spiral-galaxy/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-NGC-4254-Coma-Pinwheel-Messier-99.jpg", "publishedAt": "2022-11-08T09:33:59Z", "content": "This image of the spiral galaxy NGC 4254, also known as the Coma Pinwheel or Messier 99, is a composite of data taken with ESOs Very Large Telescope (VLT) and the Atacama Large Millimeter/submillimet… [+804 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Humongous 232-foot asteroid heading for Earth, says NASA; Check speed, distance - HT Tech", "description": "NASA has issued a warning that an asteroid is heading for Earth and there is every likelihood of a dangerously close encounter today.", "url": "https://tech.hindustantimes.com/tech/news/humongous-232-foot-asteroid-heading-for-earth-says-nasa-check-speed-distance-71667886031552.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/08/1600x900/asteroid-3642332_640_1666863345992_1667886154464_1667886154464.jpg", "publishedAt": "2022-11-08T05:43:23Z", "content": "Did you know that most asteroids are irregularly shaped, though a few are nearly spherical, and they are often pitted or cratered? As these asteroids revolve around the Sun in their elliptical orbits… [+1901 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Have Discovered a Mutation That Significantly Increases Lifespan - SciTechDaily", "description": "The study found that faulty RNA processing can result in longer life. RNA is an important information transmitter in our cells and acts as a blueprint for protein production. When freshly formed RNA is processed, introns are removed to produce mature mRNA cod…", "url": "https://scitechdaily.com/researchers-have-discovered-a-mutation-that-significantly-increases-lifespan/", "urlToImage": "https://scitechdaily.com/images/RNA-Biotechnology.jpg", "publishedAt": "2022-11-08T03:16:56Z", "content": "ByMax Planck Institute for Biology of AgeingNovember 7, 2022\r\nScientists found that worms live longer if introns remain in certain RNAs.\r\nThe study found that faulty RNA processing can result in long… [+2947 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Wyatte Grantham-Philips, USA TODAY", "title": "Black hole discovered as the closest known to Earth, astronomers say - USA TODAY", "description": "The dormant black hole, dubbed Gaia BH1, sits 1,600 light-years away – three times closer than the last black hole to hold the record.", "url": "https://www.usatoday.com/story/news/nation/2022/11/07/black-hole-closest-earth-astronomers/8286685001/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/11/07/USAT/4dab8111-81ca-4032-af63-9239e7ee2b9f-AP22308557261252.jpg?auto=webp&crop=4324,2433,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-11-07T23:38:32Z", "content": "Astronomers have discovered the closest known black hole to Earth.\r\nThe dormant black hole, dubbed Gaia BH1, sits 1,600 light-years away – three times closer than the last black hole to hold the reco… [+3442 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Updates Coverage of JPSS-2 Weather Satellite, LOFTID Tech Demo - NASA", "description": "NASA will provide coverage of the upcoming prelaunch and launch activities for the National Oceanic and Atmospheric Administration’s (NOAA’s) Joint Polar Satellite System-2 (JPSS-2) mission and NASA’s Low-Earth Orbit Flight Test of an Inflatable Decelerator (…", "url": "https://www.nasa.gov/press-release/nasa-updates-coverage-of-jpss-2-weather-satellite-loftid-tech-demo/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/jpss2_for_advisory.jpg", "publishedAt": "2022-11-07T22:45:15Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Finally Discover the Cause of a Rare Brain Disease - SciTechDaily", "description": "Researchers discover a novel mechanism behind a rare brain disease. Thanks to research teams on opposite sides of the world, a rare but potentially debilitating brain disorder now has a definitive cause. The disorder, known as hypomyelinating leukodystrophy, …", "url": "https://scitechdaily.com/scientists-finally-discover-the-cause-of-a-rare-brain-disease/", "urlToImage": "https://scitechdaily.com/images/Human-Brain-Artificial-Intelligence-AI-Illustration.jpg", "publishedAt": "2022-11-07T22:23:00Z", "content": "The disease, known as hypomyelinating leukodystrophies, is caused by a mutation in the gene that regulates the transport out of cells of zinc.\r\nResearchers discover a novel mechanism behind a rare br… [+4054 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Harrison Tasoff", "title": "Rare fossil clam discovered alive - Phys.org", "description": "Discovering a new species is always exciting, but so is finding one alive that everyone assumed had been lost to the passage of time. A small clam, previously known only from fossils, has recently been found living at Naples Point, just up the coast from UC S…", "url": "https://phys.org/news/2022-11-rare-fossil-clam-alive.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/rare-fossil-clam-disco.jpg", "publishedAt": "2022-11-07T21:47:03Z", "content": "Discovering a new species is always exciting, but so is finding one alive that everyone assumed had been lost to the passage of time. A small clam, previously known only from fossils, has recently be… [+6021 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Earth's oldest stromatolites and the search for life on Mars - Phys.org", "description": "The earliest morphological traces of life on Earth are often highly controversial, both because non-biological processes can produce relatively similar structures and because such fossils have often been subjected to advanced alteration and metamorphism.", "url": "https://phys.org/news/2022-11-earth-oldest-stromatolites-life-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/earths-oldest-stromato.jpg", "publishedAt": "2022-11-07T21:06:02Z", "content": "The earliest morphological traces of life on Earth are often highly controversial, both because non-biological processes can produce relatively similar structures and because such fossils have often … [+3201 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Geobiologists shine new light on Earth's first known mass extinction event 550 million years ago - Phys.org", "description": "A new study by Virginia Tech geobiologists traces the cause of the first known mass extinction of animals to decreased global oxygen availability, leading to the loss of a majority of animals present near the end of the Ediacaran Period some 550 million years…", "url": "https://phys.org/news/2022-11-geobiologists-earth-mass-extinction-event.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/geobiologists-shine-ne.jpg", "publishedAt": "2022-11-07T20:00:06Z", "content": "A new study by Virginia Tech geobiologists traces the cause of the first known mass extinction of animals to decreased global oxygen availability, leading to the loss of a majority of animals present… [+6253 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Incredible Discovery Has Finally Revealed The First Animals to Grow a Skeleton - ScienceAlert", "description": "Before life on Earth exploded in diversity some 540 million years ago, the first primitive animal skeletons were already starting to form.", "url": "https://www.sciencealert.com/incredible-discovery-has-finally-revealed-the-first-animals-to-grow-a-skeleton", "urlToImage": "https://www.sciencealert.com/images/2022/11/EarlySkeletonLife.jpg", "publishedAt": "2022-11-07T17:00:16Z", "content": "Before life on Earth exploded in diversity some 540 million years ago, the first primitive animal skeletons were already starting to form.\r\nSquishy-looking marine sponges from this time have been fou… [+4587 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Enduring Mystery of the Dragonfly 44 Galaxy - Quanta Magazine", "description": "A growing catalog of huge but dim galaxies such as Dragonfly 44 is forcing astronomers to invent new theories of galactic evolution.", "url": "https://www.quantamagazine.org/the-enduring-mystery-of-the-dragonfly-44-galaxy-20221107/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2022/11/Dragonfly-44-Explainer_1200_Social.webp", "publishedAt": "2022-11-07T16:19:56Z", "content": "But then in 2019, van Dokkums group downgraded Dragonfly 44s rotation speed using improved data. MOND was vindicated. Dragonfly 44 is an example of how these data evolve to agree with MOND, said McGa… [+3632 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A structural biology community assessment of AlphaFold2 applications - Nature.com", "description": "Here, the authors evaluate the performance of AlphaFold2 and its predicted structures on common structural biological applications, including missense variants, function and ligand binding site prediction, modeling of interactions and modeling of experimental…", "url": "https://www.nature.com/articles/s41594-022-00849-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41594-022-00849-w/MediaObjects/41594_2022_849_Fig1_HTML.png", "publishedAt": "2022-11-07T16:13:49Z", "content": "Added structural coverage by AlphaFold2 predictions of model proteomes\r\nThe AF2 database has released predictions of the canonical protein isoforms for 21 model species, covering nearly every residue… [+35654 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Mysterious blue 'aurora' over Lapland surprises skywatchers (photos) - Space.com", "description": "\"This event was unlike anything we have ever seen.\"", "url": "https://www.space.com/mysterious-blue-aurora-spotted-over-lapland-sweden", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Yog9c4aaEHkry6sh4UhcmJ-1200-80.jpg", "publishedAt": "2022-11-07T15:57:24Z", "content": "On Thursday (Nov. 3) a mysterious blue ribbon of light appeared in the skies over Abisko, a small village in the heart of Swedish Lapland.\r\n\"Our team of photographers has been photographing the night… [+3107 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Rare Phenomenon of Reversible Brain Shrinkage - SciTechDaily", "description": "Researchers find another brain-shrinking mammal. European moles face an existential crisis in the depths of winter. Their high-limit mammal metabolisms need more food than is available during the coldest months. Instead of migrating or hibernating to deal wit…", "url": "https://scitechdaily.com/a-rare-phenomenon-of-reversible-brain-shrinkage/", "urlToImage": "https://scitechdaily.com/images/Brain-Energy-Signals-Concept.jpg", "publishedAt": "2022-11-07T12:21:37Z", "content": "European moles shrink their brains by 11% before the winter and grow them again by 4% by the summer.\r\nResearchers find another brain-shrinking mammal.\r\nEuropean moles face an existential crisis in th… [+3768 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Martin McGuigan", "title": "Will Antarctica ever be habitable? - Livescience.com", "description": "As global temperatures rise, the ecology of Antarctica is already changing, but Earth's climate would have to change drastically before the continent could support agriculture and permanent settlers.", "url": "https://www.livescience.com/habitable-antarctica", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4ioeC7AgFh8GriPkZWY5MV-1200-80.jpeg", "publishedAt": "2022-11-07T10:00:00Z", "content": "Could Antarctica, the coldest, driest, windiest continent ever support the kinds of human communities seen elsewhere in the world? (Image credit: Andrew Peacock via Getty Images)\r\nAntarctica is a fre… [+7345 chars]"}]}