{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "How to see 5 planets line up in the sky on Saturday morning - KSL.com", "description": "There's another chance to see five planets lined up in the sky. Saturn, Neptune, Jupiter, Uranus and Mercury will appear together before sunrise on Saturday, weather permitting.", "url": "https://www.ksl.com/article/50667744/how-to-see-5-planets-line-up-in-the-sky-on-saturday-morning", "urlToImage": "https://img.ksl.com/slc/2934/293481/29348158.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-06-17T01:36:44Z", "content": "Estimated read time: 1-2\r\n minutes\r\nNEW YORK Wake up early this weekend to catch a celestial sight: Five planets will line up in the sky before sunrise on Saturday.\r\nSaturn, Neptune, Jupiter, Uranus … [+1139 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Lucy, an Ancient Human Ancestor, Walked on 2 Legs - Inside Edition", "description": "Through computer imaging, we can see how an ancient human ancestor may have walked. Lucy is the name given to a skeleton found in Ethiopia in 1974. The disco...", "url": "https://www.youtube.com/watch?v=EfIfCTSKroQ", "urlToImage": "https://i.ytimg.com/vi/EfIfCTSKroQ/maxresdefault.jpg", "publishedAt": "2023-06-16T22:18:29Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Equipping the Space Station to Produce More Power on This Week @NASA – June 16, 2023 - NASA", "description": "Equipping the space station to produce more power, our newest experimental X-plane, and preparing to test a new laser communications system … a few of the st...", "url": "https://www.youtube.com/watch?v=6U3WiUA2CEs", "urlToImage": "https://i.ytimg.com/vi/6U3WiUA2CEs/maxresdefault.jpg", "publishedAt": "2023-06-16T22:04:59Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "400-Million-Year-Old Fossil Upends Our Understanding of Fibonacci Spirals in Nature - ScienceAlert", "description": "If your eyes have ever been drawn to the arrangement of leaves on a plant stem, the texture of a pineapple, or the scales of a pinecone, then you have unknowingly witnessed brilliant examples of mathematical patterns in nature.", "url": "https://www.sciencealert.com/400-million-year-old-fossil-upends-our-understanding-of-fibonacci-spirals-in-nature", "urlToImage": "https://www.sciencealert.com/images/2023/06/CloseUpSunflowerCenterToShowFibonacciSequence.jpg", "publishedAt": "2023-06-16T22:01:10Z", "content": "If your eyes have ever been drawn to the arrangement of leaves on a plant stem, the texture of a pineapple, or the scales of a pinecone, then you have unknowingly witnessed brilliant examples of math… [+5116 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Emily Lefroy", "title": "Humans have pumped enough groundwater to change Earth's spin - New York Post ", "description": "“Our study shows that among climate-related causes, the redistribution of groundwater actually has the largest impact on the drift of the rotational pole,” lead author Ki-Weon Seo said.", "url": "https://nypost.com/2023/06/16/humans-have-pumped-enough-groundwater-to-change-earths-spin/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000012793359.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-06-16T21:56:00Z", "content": "What in the Earth?\r\nA new study has found that humans pumped so much water out of the ground over 17 years that Earth has tilted nearly 3 feet to the east.\r\n“Earths rotational pole actually changes a… [+2773 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Frustration Leads to Fundamental Physics Discovery: A New Phase of Matter - SciTechDaily", "description": "For Experimental Physicists, Quantum Frustration Leads to Fundamental Discovery “Chiral bose-liquid state” is a new phase of matter, according to UMass Amherst professor. A team of physicists, including University of Massachusetts assistant professor Tigran S…", "url": "https://scitechdaily.com/quantum-frustration-leads-to-fundamental-physics-discovery-a-new-phase-of-matter/", "urlToImage": "https://scitechdaily.com/images/New-Phase-Matter-Illustration.jpg", "publishedAt": "2023-06-16T20:25:20Z", "content": "ByUniversity of Massachusetts AmherstJune 16, 2023\r\nPhysicists have discovered a new phase of matter, the chiral bose-liquid state. This state, discovered through the exploration of kinetic frustrati… [+6098 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Earth Might Have Formed in Just a Few Million Years - Universe Today", "description": "There's a growing body of evidence showing that Earth formed more quickly than thought. And it didn't wait for asteroids to bring its water.", "url": "https://www.universetoday.com/161953/earth-might-have-formed-in-just-a-few-million-years/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2010/10/srvrbig.jpeg", "publishedAt": "2023-06-16T19:11:15Z", "content": "Earth formed about 4.6 billion years ago. That simplistic statement is common, and it’s a good starting point for understanding our planet and our Solar System. But, obviously, Earth didn’t form all … [+10524 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "What’s That Orbiting the Moon? Data Suggests a Lost Spacecraft Could be Lurking in Lunar Orbit - The Debrief", "description": "Recent calculations suggest a famous \"lost\" spacecraft could have been hiding for decades in orbit around the moon.", "url": "https://thedebrief.org/whats-that-orbiting-the-moon-data-suggests-a-lost-spacecraft-could-be-lurking-in-lunar-orbit/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2023/06/moon.jpg", "publishedAt": "2023-06-16T18:31:06Z", "content": "Houston. Tranquility Base here. The Eagle has landed. These were among the famous words spoken in July 1969 by astronaut Neil Armstrong during the Apollo 11 mission, the historic effort that placed t… [+6838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Record breaker! New fastest star zooms through Milky Way at 5 million mph - Space.com", "description": "DC Comics' Scarlet Speedster the Flash could have some cosmic competition in the form of six newly discovered runaway stars racing through the Milky Way.", "url": "https://www.space.com/fastest-runaway-stars-milky-way", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JcfaDioTZV7YnUV5TCRDkg-1200-80.jpg", "publishedAt": "2023-06-16T18:30:00Z", "content": "Six new runaway stars were discovered racing through the Milky Way. Two of the super-speedster stars, designated J0927 and J1235, are moving faster than any object of this type ever seen. \r\nAccording… [+6247 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Surprise! Jupiter's ocean moon Europa may not have a fully formed core - Space.com", "description": "'We found that Europa may have spent most of its life without a fully formed metallic core — that is, if such a core exists at all.'", "url": "https://www.space.com/jupiter-ocean-moon-europa-no-fully-formed-core", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wEkX9JhAKJxyA62aVRGZGj-1200-80.jpg", "publishedAt": "2023-06-16T18:01:15Z", "content": "The core of Jupiter's ocean moon Europa might have formed billions of years after the rest of it did, if indeed it has formed at all, a new study finds.\r\nEuropa\r\n, Jupiter's fourth-largest moon, is c… [+3427 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "None Of Pluto's Five Moons Actually Orbit The Dwarf Planet - IFLScience", "description": "The World-Formerly-Known-As-The-Ninth-Planet is constantly a source of mystery and wonder.", "url": "https://www.iflscience.com/none-of-plutos-five-moons-actually-orbit-the-dwarf-planet-69421", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69421/aImg/68661/pluto-meta.png", "publishedAt": "2023-06-16T16:48:48Z", "content": "People might disagree on whether Pluto should be considered a planet or a dwarf planet but no one disagrees this world is peculiar. Everything about it is so weird, from its heart to the fact that so… [+2243 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Woolston", "title": "Examining 'glitches in the matrix': Team finds ways to harness quantum power of atomic flaws - Phys.org", "description": "The most interesting parts of nature are often the imperfections. That's especially true in quantum physics, the atomic-level world where tiny flaws can make a big difference in the ways particles behave and interact.", "url": "https://phys.org/news/2023-06-glitches-matrix-team-ways-harness.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/glitches-in-the-matrix.jpg", "publishedAt": "2023-06-16T16:46:03Z", "content": "The most interesting parts of nature are often the imperfections. That's especially true in quantum physics, the atomic-level world where tiny flaws can make a big difference in the ways particles be… [+3222 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Exploring gravity's effect on quantum spins - Phys.org", "description": "A joint research group led by Prof. Sheng Dong and Prof. Lu Zhengtian from the University of Science and Technology of China (USTC) of the Chinese Academy of Sciences (CAS), investigated the coupling effect between neutron spin and gravitational force via emp…", "url": "https://phys.org/news/2023-06-exploring-gravity-effect-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/exploring-gravitys-eff.jpg", "publishedAt": "2023-06-16T16:09:09Z", "content": "A joint research group led by Prof. Sheng Dong and Prof. Lu Zhengtian from the University of Science and Technology of China (USTC) of the Chinese Academy of Sciences (CAS), investigated the coupling… [+3039 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "NASA's Curiosity rover snaps extremely detailed 'postcard' of Martian landscape after waking up from a 'brain-boosting nap' - Livescience.com", "description": "The new panorama snapped by NASA's Curiosity rover combines photos from two different times of day to create a highly detailed image of the Red Planet.", "url": "https://www.livescience.com/space/mars/nasas-curiosity-rover-snaps-extremely-detailed-postcard-of-martian-landscape-after-waking-up-from-a-brain-boosting-nap", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7hf9o9iUr8Tymo875ir2AM-1200-80.jpg", "publishedAt": "2023-06-16T16:08:41Z", "content": "The newly released image is a combination of two images taken at different points in the same day on April 8. (Image credit: NASA/JPL-Caltech)\r\nNASA's Curiosity rover recently snapped a stunningly de… [+3002 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Media to View Orion Spacecraft for Next Artemis Missions - NASA", "description": "Media are invited to view NASA’s Orion spacecraft for upcoming Artemis missions at the agency’s Kennedy Space Center in Florida later this summer.", "url": "https://www.nasa.gov/press-release/nasa-invites-media-to-view-orion-spacecraft-for-next-artemis-missions", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/ksc-20220606-ph-kls01_0015_orig.jpg", "publishedAt": "2023-06-16T14:23:10Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Data from InSight suggests Mars has an all-liquid core and internal mass anomalies - Phys.org", "description": "A team of planetary scientists from Belgium, the U.S., France and Germany has found evidence from the InSight lander that suggests Mars has an all-liquid core and internal mass anomalies. In their paper published in the journal Nature, the group describes the…", "url": "https://phys.org/news/2023-06-insight-mars-all-liquid-core-internal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/data-from-insight-sugg.jpg", "publishedAt": "2023-06-16T14:20:01Z", "content": "A team of planetary scientists from Belgium, the U.S., France and Germany has found evidence from the InSight lander that suggests Mars has an all-liquid core and internal mass anomalies. In their pa… [+2505 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New cooling technology developed for quantum computing circuits - Phys.org", "description": "Typical superconducting quantum circuits, such as qubits—basic processing units of a quantum computer, must be operated at very low temperatures, of a few 10s of millikelvin, or hundredths of a degree from absolute zero temperature. These temperatures are tod…", "url": "https://phys.org/news/2023-06-cooling-technology-quantum-circuits.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/superconducting-quantu.jpg", "publishedAt": "2023-06-16T14:10:24Z", "content": "Typical superconducting quantum circuits, such as qubitsbasic processing units of a quantum computer, must be operated at very low temperatures, of a few 10s of millikelvin, or hundredths of a degree… [+3970 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope gets satellite sidekick to aid search for habitable planets - Space.com", "description": "The deep-space telescope now has a partner to help hunt for habitable conditions around other stars.", "url": "https://www.space.com/james-webb-space-telescope-satellite-sidekick-habitable-exoplanets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rXfhbv6AfKXx8aRDbPbhgX-1200-80.jpg", "publishedAt": "2023-06-16T14:00:29Z", "content": "A deep-space telescope's search for potentially habitable exoplanets will get a stellar boost from a small satellite.\r\nThe James Webb Space Telescope's (JWST or Webb) far-reaching exoplanet search wi… [+2762 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "With trapped waves, researchers resolve longstanding debate about localizing light in three dimensions - Phys.org", "description": "With a dramatic boost in computing capability, a team of researchers has solved a decades-long mystery about whether optical waves can be trapped in three-dimensional randomly packed micro- or nanoparticles. It's a discovery that could open new possibilities …", "url": "https://phys.org/news/2023-06-team-behavior-anderson-localization-electromagnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/with-trapped-waves-res.jpg", "publishedAt": "2023-06-16T13:31:52Z", "content": "With a dramatic boost in computing capability, a team of researchers has solved a decades-long mystery about whether optical waves can be trapped in three-dimensional randomly packed micro- or nanopa… [+5408 chars]"}, {"source": {"id": null, "name": "digg.com"}, "author": "@darcymiajimenez", "title": "Life On Planet Earth Was Really Boring Until This Deadly Element Came Along - TechDigg", "description": "Thanks to some freak accidents, life on earth is *a lot* more interesting than the simple old single cells it used to consist of.", "url": "https://digg.com/digg-vids/link/life-on-planet-earth-was-really-boring-until-this-deadly-element-came-along-DvzoUoegC7", "urlToImage": "https://cdn.digg.com/submitted-links/1686913034-AqJyFMuGvf.jpg", "publishedAt": "2023-06-16T13:31:29Z", "content": null}, {"source": {"id": null, "name": "Thepremierdaily.com"}, "author": null, "title": "Two structures found deep in the Earth could be the remains of an ancient planet - msnNOW", "description": "The depths of the Earth, still largely unexplored, harbour tantalizing mysteries. A team of scientists recently presented evidence that two gigantic structures deep within our planet could be the remains of an ancient planet.1 Tracing Echoes of an Ancient Pla…", "url": "https://thepremierdaily.com/structures-in-earth-ancient-planet/?utm_source=simplefeed", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1cBiKl.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-16T12:20:21Z", "content": "The depths of the Earth, still largely unexplored, harbour tantalizing mysteries. A team of scientists recently presented evidence that two gigantic structures deep within our planet could be the rem… [+4558 chars]"}, {"source": {"id": null, "name": "Record Searchlight"}, "author": ", Record Searchlight", "title": "Astronomers at Hat Creek Observatory in Shasta County track 'brightest object ever seen' - Record Searchlight", "description": "The Allen Telescope Array at Hat Creek Observatory was one of the first two radio telescopes to track the brightest object ever seen. What is it?", "url": "https://www.redding.com/story/news/2023/06/16/shasta-county-hat-creek-observatory-hat-creek-observatory-in-shasta-county-helps-nasa-track-brightes/70323635007/", "urlToImage": "https://www.gannett-cdn.com/-mm-/e6182e643a1e3628e873d5273ba08ad5b80c2201/c=0-0-759-427/local/-/media/2021/07/11/Bloomington/8e2506b73a047502b46d62e24b347aa0.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2023-06-16T12:03:40Z", "content": "Astronomers at Hat Creek Radio Observatory in northeast Shasta County are partnering with NASA and other space agencies track what scientists say is the brightest gamma-ray burst ever recorded.\r\nSETI… [+3894 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Emmet Lyons", "title": "New dinosaur species Vectipelta barretti discovered on Britain's Isle of Wight - CBS News", "description": "One scientist said the discovery would force a re-think on the variety of species that once inhabited the area, which today is a small island off England's coast known for Jurassic finds.", "url": "https://www.cbsnews.com/news/new-dinosaur-species-discovered-uk-isle-of-wight-vectipelta-barretti-ankylosaurus/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2023/06/16/0e88a2c5-dc26-4ef7-a201-07abf4648c8d/thumbnail/1200x630g8/c8d5d60e23ecc5d7b258298d0ecd62da/dinosaur-isle-wight.jpg?v=23da2bed74e9783333cf303fba619e89", "publishedAt": "2023-06-16T11:58:00Z", "content": "London — The fossilized remains of a previously unknown species of dinosaur have been discovered in the United Kingdom. Fossils of the species, named Vectipelta barretti, were discovered on the Isle … [+2949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Evolutionary Fuel: How an Ancient Chromosomal Inversion Could Foster Survival - SciTechDaily", "description": "The complexity of evolutionary processes affecting an inversion in stick insects provides resilience against loss of genetic variation, and may foster long-term survival. Genetic variation is the ultimate fuel for evolution, says Utah State University evoluti…", "url": "https://scitechdaily.com/evolutionary-fuel-how-an-ancient-chromosomal-inversion-could-foster-survival/", "urlToImage": "https://scitechdaily.com/images/Timema-knulli-Redwood-Branch.jpg", "publishedAt": "2023-06-16T11:18:29Z", "content": "ByUtah State UniversityJune 16, 2023\r\nStick insects, Timema knulli, on a Redwood tree branch. Utah State University evolutionary geneticist Zach Gompert and colleagues studied a chromosomal inversion… [+4848 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": null, "title": "There Could Still Be A Ninth Planet In Our Solar System – Here's Why - IFLScience", "description": "We don't talk about Pluto, no no no.", "url": "https://www.iflscience.com/there-could-still-be-a-ninth-planet-in-our-solar-system-heres-why-69408", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69408/aImg/68642/solar-system-meta.jpg", "publishedAt": "2023-06-16T10:27:35Z", "content": "We all used to think there were nine planets. But in 2006 the Solar System was left with only eight planets, when Pluto was no longer classified as such. Is it still possible there is a planet out th… [+6895 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Inflatable moon telescope could peer into universe's Dark Ages - Space.com", "description": "'It's like an inflatable mattress on the moon.'", "url": "https://www.space.com/inflatable-moon-telescope-universe-dark-ages", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FtQEACJiPHwTn99pWokK2h-1200-80.jpg", "publishedAt": "2023-06-16T10:00:09Z", "content": "European scientists are developing an inflatable radio telescope concept that could do groundbreaking science on the moon. \r\nThe idea, based on a recent feasibility study by engineers at the European… [+5591 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Triplex Origami: A Game-Changer in Gene Therapy and DNA Nanotechnology - SciTechDaily", "description": "Researchers from the Gothelf lab at Aarhus University have developed a revolutionary new method, called triplex origami, to manipulate the shape and tight packing of DNA. The discoveries open up exciting new possibilities in gene therapy, nanotechnology, and …", "url": "https://scitechdaily.com/triplex-origami-a-game-changer-in-gene-therapy-and-dna-nanotechnology/", "urlToImage": "https://scitechdaily.com/images/DNA-Origami-Concept-Art.jpg", "publishedAt": "2023-06-16T09:46:39Z", "content": "ByAarhus UniversityJune 16, 2023\r\nResearchers at Aarhus University have developed a method called triplex origami, using Hoogsteen interactions to fold DNA into various compact shapes, offering poten… [+6888 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "Julia Robinson", "title": "Half-century quest to create stable beryllium–beryllium bond ends in success - Chemistry World", "description": "Organoberyllium sandwich compound should provide answers to questions first posed a century ago", "url": "https://www.chemistryworld.com/news/half-century-quest-to-create-stable-beryllium-beryllium-bond-ends-in-success/4017575.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/0/9/8/527098_adh44192b_19942.jpg", "publishedAt": "2023-06-16T08:34:08Z", "content": "The first stable compound with a berylliumberyllium bond, diberyllocene, has been isolated by researchers at the University of Oxford.\r\nDue to the elements toxicity, the chemistry of beryllium is one… [+1046 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "A Grave Warning About Antarctica Is Hidden Inside Octopus DNA - ScienceAlert", "description": "Ocean bays that pinch West Antarctica are home to two distinct populations of Turquet's octopus (Pareledone turqueti).", "url": "https://www.sciencealert.com/a-grave-warning-about-antarctica-is-hidden-inside-octopus-dna", "urlToImage": "https://www.sciencealert.com/images/2023/06/PinkOctopusArm.jpg", "publishedAt": "2023-06-16T07:29:26Z", "content": "Ocean bays that pinch West Antarctica are home to two distinct populations of Turquet's octopus (Pareledone turqueti). The shared secrets of their ancestors do not bode well for the future health of … [+3415 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Rebecca Dyer", "title": "We Finally Know How Photosynthesis Starts: It Takes Just a Single Photon - ScienceAlert", "description": "During photosynthesis, a symphony of chemicals transforms light into the energy required for plant, algal, and some bacterial life.", "url": "https://www.sciencealert.com/we-finally-know-how-photosynthesis-starts-it-takes-just-a-single-photon", "urlToImage": "https://www.sciencealert.com/images/2023/06/SinglePhotonAbsorptionConcept.jpg", "publishedAt": "2023-06-16T06:55:18Z", "content": "During photosynthesis, a symphony of chemicals transforms light into the energy required for plant, algal, and some bacterial life. Scientists now know that this remarkable reaction requires the smal… [+4736 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Ask Ethan: Is the proton stable or unstable? - Big Think", "description": "If we waited long enough, would even protons themselves decay? The far future stability of the Universe depends on it.", "url": "https://bigthink.com/starts-with-a-bang/proton-stable-or-unstable/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/12/protonboy-1.jpg?resize=1200,630", "publishedAt": "2023-06-16T06:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Remains of an Extinct World of Primordial Organisms Discovered - SciTechDaily", "description": "Until now, certain biomarkers, the \"protosteroids,\" have been overlooked as fossil witnesses to primordial life. Newly discovered biomarker signatures point to a whole range of previously unknown organisms that dominated complex life on Earth about a billion …", "url": "https://scitechdaily.com/remains-of-an-extinct-world-of-primordial-organisms-discovered/", "urlToImage": "https://scitechdaily.com/images/Community-of-Stem-Group-Eukaryotes.jpg", "publishedAt": "2023-06-16T05:58:18Z", "content": "ByGFZ German Research Centre for Geosciences, Helmholtz CentreJune 15, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a bacterial ma… [+7048 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "JPL and the Space Age: The Hunt for Space Rocks - NASA Jet Propulsion Laboratory", "description": "Asteroids and comets are among the oldest objects in our solar system. They mostly reside at safe distances from Earth, but some find their way into our plan...", "url": "https://www.youtube.com/watch?v=1wNzTyu36WA", "urlToImage": "https://i.ytimg.com/vi/1wNzTyu36WA/maxresdefault.jpg", "publishedAt": "2023-06-15T23:00:11Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Tiny nanopores can contribute to faster identification of diseases - Phys.org", "description": "In a collaboration with Groningen University, Professor Jørgen Kjems and his research group at Aarhus University have achieved a remarkable breakthrough in developing tiny nano-sized pores that can contribute to better possibilities for, among other things, d…", "url": "https://phys.org/news/2023-06-tiny-nanopores-contribute-faster-identification.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/tiny-nanopores-can-con.jpg", "publishedAt": "2023-06-15T21:04:11Z", "content": "In a collaboration with Groningen University, Professor Jørgen Kjems and his research group at Aarhus University have achieved a remarkable breakthrough in developing tiny nano-sized pores that can c… [+3197 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Pulsars Could Help Map the Black Hole at the Center of the Milky Way - Universe Today", "description": "The BlackHoleCam project, part of the Event Horizon Telescope consortium, will use the powerful EHT array to search for pulsars near Sagittarius A*", "url": "https://www.universetoday.com/161805/pulsars-could-help-map-the-black-hole-at-the-center-of-the-milky-way/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/09/eso2208-eht-mwc.jpg", "publishedAt": "2023-06-15T20:50:51Z", "content": "The Theory of General Relativity (GR), proposed by Einstein over a century ago, remains one of the most well-known scientific postulates of all time. This theory, which explains how spacetime curvatu… [+5260 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Frid Kvalpskarmo Hansen", "title": "Museum exhibit in Norway reveals new details on Neanderthals - Phys.org", "description": "No one knows what happened when we, Homo sapiens, first encountered the Neanderthals. But we know we met.", "url": "https://phys.org/news/2023-06-museum-norway-reveals-neanderthals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/your-relatives-of-yore.jpg", "publishedAt": "2023-06-15T20:38:33Z", "content": "No one knows what happened when we, Homo sapiens, first encountered the Neanderthals. But we know we met.\r\nWe know that for thousands of years we lived side by side in Europe and Asia. And we know we… [+5545 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How To See the Invisible: Measuring Dark Matter With Hyper Suprime-Cam Reveals Discrepancy - SciTechDaily", "description": "Using the Hyper Suprime-Cam (HSC), a team led by Princeton University has studied the distribution of dark matter and found a discrepancy between the 'clumpiness' (S8 value) of dark matter in the present universe versus the early universe. This discrepancy co…", "url": "https://scitechdaily.com/how-to-see-the-invisible-measuring-dark-matter-with-hyper-suprime-cam-reveals-discrepancy/", "urlToImage": "https://scitechdaily.com/images/Abstract-Astrophysics-Dark-Matter-Mystery.jpg", "publishedAt": "2023-06-15T20:37:48Z", "content": "ByPrinceton UniversityJune 15, 2023\r\nAn international team of astrophysicists and cosmologists, using the Hyper Suprime-Cam (HSC), one of the worlds most powerful astronomical cameras, and data from … [+18636 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Study reveals potential breakthrough in grapevine disease resistance - Phys.org", "description": "A team of scientists—including UC Irvine's Distinguished Professor of Ecology & Evolutionary Biology Brandon Gaut and UC Davis's Professors of Viticulture & Enology Dario Cantù and Andy Walker—has made a significant breakthrough in the battle against a devast…", "url": "https://phys.org/news/2023-06-reveals-potential-breakthrough-grapevine-disease.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/study-reveals-potentia-1.jpg", "publishedAt": "2023-06-15T20:18:03Z", "content": "A team of scientistsincluding UC Irvine's Distinguished Professor of Ecology &amp; Evolutionary Biology Brandon Gaut and UC Davis's Professors of Viticulture &amp; Enology Dario Cantù and Andy Walker… [+3894 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers demonstrate direct comparison of spin-squeezed optical lattice clocks at record precision level - Phys.org", "description": "Although today's best optical atomic clocks can be used to make extremely precise measurements, they are still limited by the noise from the spin statistics of the many atoms they interrogate, known as quantum projection noise (QPN). But by leveraging the tru…", "url": "https://phys.org/news/2023-06-comparison-spin-squeezed-optical-lattice-clocks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/researchers-demonstrat-10.jpg", "publishedAt": "2023-06-15T20:04:55Z", "content": "Although today's best optical atomic clocks can be used to make extremely precise measurements, they are still limited by the noise from the spin statistics of the many atoms they interrogate, known … [+4462 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Weird' game of cosmic tug-of-war in the Tarantula Nebula weaves up new stars - Space.com", "description": "The region is home to some of the hottest and most massive stars that astronomers have discovered to date.", "url": "https://www.space.com/star-formation-tug-of-war-tarantula-nebula-magnetic-fields", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3WWDiVW2GWBi5ynvyN9xSJ-1200-80.jpg", "publishedAt": "2023-06-15T20:00:00Z", "content": "The strange behavior of the Tarantula Nebula and its continued existence could be the result of powerful magnetic fields at its heart.\r\nThe Tarantula Nebula, officially known as 30 Doradus, is a regi… [+3632 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Juno Mission Captures Lightning On Jupiter - NASA", "description": "In this view of a vortex near Jupiter’s north pole, NASA’s Juno mission observed the glow from a bolt of lightning.", "url": "https://www.nasa.gov/image-feature/jpl/nasa-s-juno-mission-captures-lightning-on-jupiter", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/52413493052_c61f80eb38_o.jpg", "publishedAt": "2023-06-15T19:29:56Z", "content": null}, {"source": {"id": null, "name": "Truthdig.com"}, "author": "Émile P. Torres", "title": "The Acronym Behind Our Wildest AI Dreams and Nightmares - Truthdig", "description": "To understand the divide between AI boosters and doomers, one must unpack their common origins in a bundle of ideologies known as TESCREAL.", "url": "https://www.truthdig.com/articles/the-acronym-behind-our-wildest-ai-dreams-and-nightmares/", "urlToImage": "https://www.truthdig.com/wp-content/uploads/2023/06/EMILE_MAIN.jpeg", "publishedAt": "2023-06-15T19:23:36Z", "content": "TESCREALpronounced tess-cree-all. Its a strange word that you may have seen pop up over the past few months. The renowned computer scientist Dr. Timnit Gebru frequently mentions the TESCREAL ideologi… [+29158 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Phosphorus, Rare Building Block for Life, Discovered at Enceladus - Sci.News", "description": "Phosphorus has not previously been detected in oceans beyond those on Earth and this discovery provides a promising step forward in our understanding of ocean worlds.", "url": "https://www.sci.news/space/enceladus-phosphorus-12009.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_12009f-Enceladus-Water-Plume.jpg", "publishedAt": "2023-06-15T19:01:38Z", "content": "Phosphorus has not previously been detected in oceans beyond those on Earth and this discovery provides a promising step forward in our understanding of ocean worlds.\r\nSaturns moon Enceladus with a p… [+3189 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lindsey Ellefson", "title": "When to Use a Microfiber Cloth Instead of Paper Towels - Lifehacker", "description": "They only sort of do the same thing, and they aren't always interchangeable.", "url": "https://lifehacker.com/when-to-use-a-microfiber-cloth-instead-of-paper-towels-1850544019", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/2cff14489140619cf9d2fc15b9720700.jpg", "publishedAt": "2023-06-15T18:33:36Z", "content": "Microfiber clothssoft, absorbent, economicalare often a preferable alternative to using and throwing away a heap of paper towels. But not every time. Heres how should you decide which to reach for wh… [+2243 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Theoretical discovery: A new path for quantum physics to control chemical reactions - Phys.org", "description": "Controlling chemical reactions to generate new products is one of the biggest challenges in chemistry. Developments in this area impact industry, for example, by reducing the waste generated in the manufacture of construction materials or by improving the pro…", "url": "https://phys.org/news/2023-06-theoretical-discovery-path-quantum-physics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-new-path-for-quantum.jpg", "publishedAt": "2023-06-15T18:00:03Z", "content": "Controlling chemical reactions to generate new products is one of the biggest challenges in chemistry. Developments in this area impact industry, for example, by reducing the waste generated in the m… [+6416 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Did Life Need Plate Tectonics to Emerge? - Universe Today", "description": "Plate tectonics cycle nutrients and help Earth shed heat. But are they necessary for life? Do exoplanets need tectonics to be habitable?", "url": "https://www.universetoday.com/161952/did-life-need-plate-tectonics-to-emerge/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/fea-earths-crust-plate-tectonics.jpg", "publishedAt": "2023-06-15T17:14:53Z", "content": "It’s widely accepted that Earth’s plate tectonics are a key factor in life’s emergence. Plate tectonics allows heat to move from the mantle to the crust and plays a critical role in cycling nutrients… [+12507 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "The Dancing Peanuts Mystery Might Have A Solution - IFLScience", "description": "A curious Argentinian habit might end up explaining the behavior of complex fluids like magma.", "url": "https://www.iflscience.com/the-dancing-peanuts-mystery-might-have-a-solution-69407", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69407/aImg/68639/jim-bowie-meta.jpg", "publishedAt": "2023-06-15T16:45:11Z", "content": "Whats with bizarrely moving legumes in Central and South America? Mexico has its jumping beans and Argentina has dancing peanuts. This is the name of a curious phenomenon that happens when you drop p… [+1457 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Tempest in a teacup: Physicists make breakthrough in creating turbulence - Phys.org", "description": "Turbulence is all around us. It's in the swirl of coffee and milk in a latte, unfurling along the wings of airplanes and the sides of cars, churning the blood in your heart after the valve snaps closed. Yet we still don't fully grasp all of its rules.", "url": "https://phys.org/news/2023-06-tempest-teacup-physicists-breakthrough-turbulence.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/tempest-in-a-teacup-uc.jpg", "publishedAt": "2023-06-15T16:37:03Z", "content": "Turbulence is all around us. It's in the swirl of coffee and milk in a latte, unfurling along the wings of airplanes and the sides of cars, churning the blood in your heart after the valve snaps clos… [+4641 chars]"}, {"source": {"id": null, "name": "Laughingsquid.com"}, "author": "Lori Dorn", "title": "Charming Cockatoo Calls All Women Barbara in Honor of His Beloved Human Grandmother - Laughing Squid", "description": "A charming umbrella cockatoo named Chris has taken to calling all women Barbara after falling in love with his elderly human grandmother.", "url": "https://laughingsquid.com/cockatoo-grandma-barbara/", "urlToImage": "https://laughingsquid.com/wp-content/uploads/2023/06/Cockatoo-Grandma-Barbara.jpeg", "publishedAt": "2023-06-15T16:21:18Z", "content": "A charming umbrella cockatoo named Chris, who is a star in his own right, has taken to calling all women Barbara after falling in love with his elderly human grandmother. Chris and his human Alison w… [+683 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Adam Frank", "title": "Lifelike chemicals may hold the secret to the origin of life - Big Think", "description": "Origin of life studies have always focused on a set of strict environments that could give rise to life. Ante-life opens new possibilities.", "url": "https://bigthink.com/13-8/ante-life-lifelike-chemicals-origin-life/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/vents_Web.jpg?resize=1200,630", "publishedAt": "2023-06-15T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Whole-mount smFISH allows combining RNA and protein quantification at cellular and subcellular resolution - Nature.com", "description": "Zhao et al. have developed a method to detect and quantify single molecules of RNA in several intact plant tissues. The method can also be used to simultaneously quantify and locate mRNAs and proteins in single cells with subcellular resolution.", "url": "https://www.nature.com/articles/s41477-023-01442-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41477-023-01442-9/MediaObjects/41477_2023_1442_Fig1_HTML.png", "publishedAt": "2023-06-15T15:51:22Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alaina O'Regan", "title": "Researchers demystify the unusual origin of the Geminids meteor shower - Phys.org", "description": "The Geminids meteoroids light up the sky as they race past Earth each winter, producing one of the most intense meteor showers in our night sky.", "url": "https://phys.org/news/2023-06-demystify-unusual-geminids-meteor-shower.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-demystify.jpg", "publishedAt": "2023-06-15T15:38:26Z", "content": "The Geminids meteoroids light up the sky as they race past Earth each winter, producing one of the most intense meteor showers in our night sky.\r\nMysteries surrounding the origin of this meteoroid st… [+8553 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists discover urea in atmosphere, revealing profound consequences for climate - Phys.org", "description": "Areas of the ocean that are rich in marine life are having a bigger impact on our ecosystems and the climate than previously thought, new research suggests.", "url": "https://phys.org/news/2023-06-scientists-urea-atmosphere-revealing-profound.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/scientists-discover-ur.jpg", "publishedAt": "2023-06-15T15:15:03Z", "content": "Areas of the ocean that are rich in marine life are having a bigger impact on our ecosystems and the climate than previously thought, new research suggests.\r\nObservations made by scientists at The Un… [+4001 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Alex Daniel", "title": "Scientists discover new planet just like Star Wars' Tatooine - indy100", "description": "When the makers of the Star Wars film franchise dreamt up a planet with two suns in the 1970s, they gave sci-fi enthusiasts some of the most iconic images of the series.How could fans forget a young Luke Skywalker staring into the double sunset on the desert …", "url": "https://www.indy100.com/science-tech/star-wars-planet-tatooine-discovered", "urlToImage": "https://www.indy100.com/media-library/bebop-1c-orbits-two-suns-and-it-s-in-our-very-own-galaxy.png?id=34124935&width=1200&height=600&coordinates=0%2C34%2C0%2C62", "publishedAt": "2023-06-15T15:06:07Z", "content": "When the makers of the Star Wars film franchise dreamt up a planet with two suns in the 1970s, they gave sci-fi enthusiasts some of the most iconic images of the series.\r\nHow could fans forget a youn… [+2856 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The intriguing correlation between earthquakes and cosmic radiation - Phys.org", "description": "There is a clear statistical correlation between global seismic activity and changes in the intensity of cosmic radiation recorded at the surface of our planet, potentially helping to predict earthquakes. Surprisingly, it exhibits a periodicity that escapes u…", "url": "https://phys.org/news/2023-06-intriguing-earthquakes-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/intriguing-correlation.jpg", "publishedAt": "2023-06-15T15:04:18Z", "content": "by The Henryk Niewodniczanski Institute of Nuclear Physics Polish Academy of SciencesThere is a clear statistical correlation between global seismic activity and changes in the intensity of cosmic ra… [+7686 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Astronomers observe white dwarf star transforming into massive celestial diamond - Interesting Engineering", "description": "Scientists believe the process takes roughly a quadrillion years, meaning no star has fully transformed into a diamond.", "url": "https://interestingengineering.com/science/astronomers-observe-white-dwarf-star-transforming-into-massive-celestial-diamond", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/15/image/jpeg/mWBd4mbRY8SjShNBV6QHf5uY9dRFb6ILG39MVwcv.jpg", "publishedAt": "2023-06-15T15:03:00Z", "content": "The team also calculated the star's temperature at approximately 11,420 degrees Fahrenheit (6,300 degrees Celsius), within the range expected of a crystallizing white dwarf.\r\nThey also analyzed the c… [+540 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Cosmic-ray 'GPS' system that tracks underground movement could change the way we respond to disasters - Livescience.com", "description": "A new system that uses subatomic particles produced high in Earth's atmosphere could provide a view inside volcanoes and help locate people trapped beneath rubble.", "url": "https://www.livescience.com/technology/communications/cosmic-ray-gps-system-that-tracks-underground-movement-could-change-the-way-we-respond-to-disasters", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7mmgV2UDnoV8ztZFpNDRrF-1200-80.jpg", "publishedAt": "2023-06-15T15:00:10Z", "content": "Scientists have harnessed the byproducts of cosmic rays\r\n to create the world's first \"GPS\" system that works underground — and it could be used to monitor volcanoes and aid in future search-and-resc… [+3767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Right-handed building blocks of life might have had a rocky start - Phys.org", "description": "Harvard University led research may have solved the puzzle of how life became molecularly right-handed. In the paper, \"Origin of biological homochirality by crystallization of an RNA precursor on a magnetic surface,\" published in Science Advances, the researc…", "url": "https://phys.org/news/2023-06-right-handed-blocks-life-rocky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/right-handed-building.jpg", "publishedAt": "2023-06-15T14:30:01Z", "content": "The mechanism of spin-selective crystallization due to the CISS effect and the experimental setup.(A) As molecules approach a surface, they transiently acquire an induced charge polarization. Because… [+4565 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Particle of sound put in two places at once - Nature.com", "description": "Scientists place a phonon into superposition, paving the way for its use in quantum computers.", "url": "https://www.nature.com/articles/d41586-023-01896-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01896-z/d41586-023-01896-z_25466766.jpg", "publishedAt": "2023-06-15T14:25:23Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Without The Ozone Layer, This Is What Our Planet Would Be Like - IFLScience", "description": "This is definitely not a way to solve climate change though.", "url": "https://www.iflscience.com/without-the-ozone-layer-this-is-what-our-planet-would-be-like-69401", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69401/aImg/68631/ozone-meta.jpg", "publishedAt": "2023-06-15T14:12:49Z", "content": "A new study has quantified how much the ozone in the atmosphere contributes to the planets energy budget the balance of sunlight received versus heat radiated that affects the Earths temperatures. A … [+2742 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Allyson Chiu", "title": "Could sensors help catch wildfires before they burn out of control? - The Washington Post", "description": "Reliably detecting wildfires early will probably require a combination of different technologies working together, experts say.", "url": "https://www.washingtonpost.com/climate-solutions/2023/06/15/wildfire-early-detection-sensors-technology/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4EGIZARHTZHBFET6XTBIWGZJMM_size-normalized.jpg&w=1440", "publishedAt": "2023-06-15T13:30:00Z", "content": "Comment on this story\r\nComment\r\nStarting this month, 10 sensors placed in hilly areas east of Oakland, Calif., will be monitoring the air for signs of wildfires. The sensors, which can detect and mea… [+6006 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Old, ultra-faint and metal-poor star cluster discovered - Phys.org", "description": "An international team of astronomers reports the discovery of a new star cluster (SC) as part of the DECam Local Volume Exploration (DELVE) survey. The newfound cluster, designated DELVE 6, is ultra-faint, metal-poor and is estimated to be about 9 billion yea…", "url": "https://phys.org/news/2023-06-ultra-faint-metal-poor-star-cluster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/old-ultra-faint-and-me.jpg", "publishedAt": "2023-06-15T13:16:05Z", "content": "An international team of astronomers reports the discovery of a new star cluster (SC) as part of the DECam Local Volume Exploration (DELVE) survey. The newfound cluster, designated DELVE 6, is ultra-… [+3611 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "More Evidence of Massive First Generation Stars - Universe Today", "description": "A few days ago I wrote about the search for Population III stars. These stars were the first stars of the universe. Giant beasts hundreds of times more massive than the Sun, composed only of hydrogen and helium. These massive stars would have been very short-…", "url": "https://www.universetoday.com/161896/more-evidence-of-massive-first-generation-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/pairsupernova-scaled.jpg", "publishedAt": "2023-06-15T13:14:46Z", "content": "A few days ago I wrote about the search for Population III stars. These stars were the first stars of the universe. Giant beasts hundreds of times more massive than the Sun, composed only of hydrogen… [+2974 chars]"}, {"source": {"id": null, "name": "Warpnews.org"}, "author": "WALL-Y", "title": "Water found on a massive exoplanet by Webb telescope - Warp News", "description": "Ten times the size of Jupiter and partly extremely hot. Despite this, the James Webb telescope has discovered water on the planet.", "url": "https://www.warpnews.org/space/water-found-on-massive-exoplanet-by-webb-telescope/", "urlToImage": "https://www.warpnews.org/content/images/2023/06/WASP18b_1280.jpg", "publishedAt": "2023-06-15T13:02:43Z", "content": "<ul><li>Evidence of water vapor discovered on an exoplanet ten times the size of Jupiter</li><li>The exoplanet's atmosphere shows remarkable temperature variations</li><li>Discovery opens the potenti… [+1685 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Private space station: How Axiom Space plans to build its orbital outpost - Space.com", "description": "Axiom hopes to dock its first module to the ISS by 2026.", "url": "https://www.space.com/axiom-space-private-station-iss-2026", "urlToImage": "https://cdn.mos.cms.futurecdn.net/X4sDdds9bKLVzZ8cWtkgU-1200-80.jpg", "publishedAt": "2023-06-15T13:00:00Z", "content": "Axiom Space has big plans for low Earth orbit.\r\nThe Houston-based company, founded in 2016, was the first to ferry a flight of all private citizens to the International Space Station (ISS) aboard the… [+5863 chars]"}, {"source": {"id": null, "name": "Softonic"}, "author": "Chema Carvajal Sarabia", "title": "Groundbreaking Discovery: Scientists Unveil the Origins of Earth’s Water - Softonic EN", "description": "We all take it for granted that on our planet water was first. But the reality is quite different, now we know how it got there and it is...", "url": "https://en.softonic.com/articles/scientists-just-discovered-how-water-got-to-land", "urlToImage": "https://articles-img.sftcdn.net/f_auto,t_article_cover_xl/auto-mapping-folder/sites/3/2023/06/Asteroides-y-la-Tierra-1.jpg", "publishedAt": "2023-06-15T11:34:06Z", "content": "Every time we open a bottle of water and drink, our body hydrates, our pupils dilate, and life becomes possible. Life on Earth relies on water as its main ingredient. We are 70% water ourselves. But,… [+2201 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "The US Air Force's Plan To Stop The Earth Rotating Would Have Wiped Out Life On Earth - IFLScience", "description": "There are bad plans, and then there's this.", "url": "https://www.iflscience.com/the-us-air-forces-plan-to-stop-the-earth-rotating-would-have-wiped-out-life-on-earth-69391", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69391/aImg/68618/earth-rotation-meta.png", "publishedAt": "2023-06-15T11:33:59Z", "content": "During the Cold War, when a nuclear war between the US and Soviet Union did not appear out of the question, the US Air Force looked into an unusual defense strategy. \r\nAccording to Daniel Ellsberg, a… [+3405 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "DoD developing its first test GPS satellite since the 1970s - Interesting Engineering", "description": "Fifty years since the development and launch of GPS satellites NTS-1 and NTS-2, NTS-3 has completed testing ahead of launch later this year.", "url": "https://interestingengineering.com/innovation/first-navigational-satellite-50-years", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/15/image/jpeg/rA4S5lQE7dldNSyUop2Q8LXe1xH3tPKhOQeyRZzz.jpg", "publishedAt": "2023-06-15T07:58:00Z", "content": "\"It is a quiet enough chamber that protects aircraft and other GPS users outside of the facility,\" NTS-3 program manager Ariel Biersgreen said in the same statement. \"We needed to have a shielded are… [+1191 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Solve Colorful Kuiper Belt Mystery - SciTechDaily", "description": "The Kuiper Belt, a vast disk brimming with icy bodies including Pluto and located just beyond Neptune's orbit in our solar system, exhibits an intriguing color palette ranging from stark white to deep reddish hues on its objects. This distinctive color range,…", "url": "https://scitechdaily.com/scientists-solve-colorful-kuiper-belt-mystery/", "urlToImage": "https://scitechdaily.com/images/Kuiper-Belt-Aromatic-Structures.jpg", "publishedAt": "2023-06-15T06:33:06Z", "content": "ByUniversity of Hawaii at ManoaJune 14, 2023\r\nAromatic structures linked through unsaturated hydrocarbon chains drive the color variety of hydrocarbon rich surfaces of Kuiper Belt objects. Credit: Un… [+4421 chars]"}]}