{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "What's behind the Martian methane mystery? - Space.com", "description": "The brief spikes of methane observed on Mars tend to follow the seasons, with late spring and early summer seeming to have the highest levels of atmospheric methane.", "url": "https://www.space.com/what-is-behind-martian-methane-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ecgZP4vagotVC3T2LWPGGX-1200-80.jpg", "publishedAt": "2024-09-11T13:00:03Z", "content": "In late 2013 and early 2014, NASA's Curiosity rover\r\n detected an unexpected spike in methane on Mars — 10 times the usual level. Within a few months, the spike faded. Since then, Curiosity has recor… [+4968 chars]"}, {"source": {"id": null, "name": "Defector.com"}, "author": null, "title": "Neither Elon Musk Nor Anybody Else Will Ever Colonize Mars - Defector", "description": "Mars does not have a magnetosphere. Any discussion of humans ever settling the red planet can stop right there, but of course it never does. Do you have a low-cost plan for, uh, creating a gigantic active dynamo at Mars’s dead core? No? Well. It’s fine. I’m s…", "url": "https://defector.com/neither-elon-musk-nor-anybody-else-will-ever-colonize-mars", "urlToImage": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/09/mars.jpg", "publishedAt": "2024-09-11T13:00:00Z", "content": "Mars does not have a magnetosphere. Any discussion of humans ever settling the red planet can stop right there, but of course it never does. Do you have a low-cost plan for, uh, creating a gigantic a… [+14384 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Scientists spot ancient 'smiley face' on Mars — and it could contain signs of life - Livescience.com", "description": "Newly released images of Mars reveal a \"smiley\" salt deposit on the Red Planet's surface. A related study suggests that similar deposits, which were left behind from ancient lakes, may be a good place to look for signs of former life on Mars.", "url": "https://www.livescience.com/space/mars/smiley-face-on-mars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yrUVByoaPnroo8hovY7tPN-1200-80.jpg", "publishedAt": "2024-09-11T11:11:08Z", "content": "Astronomers recently spotted a surprising \"smiley face\" beaming up from the surface of Mars\r\n as they surveyed the alien landscape as part of a new study. The emoticon-like structure, which is only v… [+3663 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Landspace completes 10-kilometer reusable rocket test, eyes 2025 orbital launch - SpaceNews", "description": "Landspace completes 10-kilometer reusable rocket test, eyes 2025 orbital launch Chinese launch startup Landspace conducted a 10-kilometer vertical liftoff, vertical landing test at Jiuquan spaceport Wednesday as it develops a reusable orbital rocket.", "url": "https://spacenews.com/landspace-completes-10-kilometer-reusable-rocket-test-eyes-2025-orbital-launch/", "urlToImage": "https://spacenews.com/wp-content/uploads/2024/09/Zhuque-3-VTVL1-10km-Jiuquan-11Sept2024-Landspace-1.jpg", "publishedAt": "2024-09-11T10:24:27Z", "content": "HELSINKI Chinese launch startup Landspace conducted a 10-kilometer vertical liftoff, vertical landing test at Jiuquan spaceport Wednesday as it develops a reusable orbital rocket.\r\nThe Zhuque-3 VTVL-… [+3507 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Watch a Russian Soyuz rocket launch 3 astronauts to the ISS today - Space.com", "description": "Liftoff is scheduled for 12:23 p.m. ET today (Sept. 11).", "url": "https://www.space.com/international-space-station-soyuz-ms-26-launch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DLRWzsTb4zkYqeP6zY63U7-1200-80.jpg", "publishedAt": "2024-09-11T10:00:35Z", "content": "A NASA astronaut and two Russian cosmonauts will launch toward the International Space Station (ISS) today (Sept. 11), and you can watch the action live.\r\nNASA astronaut Don Pettit will join Roscosmo… [+2628 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Voyager 1 team accomplishes tricky thruster swap - Phys.org", "description": "Engineers working on NASA's Voyager 1 probe have successfully mitigated an issue with the spacecraft's thrusters, which keep the distant explorer pointed at Earth so that it can receive commands, send engineering data, and provide the unique science data it i…", "url": "https://phys.org/news/2024-09-voyager-team-tricky-thruster-swap.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/voyager-1-team-accompl.jpg", "publishedAt": "2024-09-11T07:39:15Z", "content": "Engineers working on NASA's Voyager 1 probe have successfully mitigated an issue with the spacecraft's thrusters, which keep the distant explorer pointed at Earth so that it can receive commands, sen… [+4990 chars]"}, {"source": {"id": null, "name": "WDIV ClickOnDetroit"}, "author": "Shawnte Passmore", "title": "Michigan under G2 Geomagnetic Storm Watch for Northern Lights - WDIV ClickOnDetroit", "description": "According to the National Weather Service Space Weather Prediction Center, the Northern Lights could be visible throughout Southeast Michigan.", "url": "https://www.clickondetroit.com/news/local/2024/09/10/michigan-under-g2-geomagnetic-storm-watch-for-northern-lights/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/zzgP3pEB30M1aK-oT67U/1726007543885_1920x1080_thumbnail.jpg?_a=DATAfRfiZAA0", "publishedAt": "2024-09-10T23:11:37Z", "content": "According to the National Weather Service Space Weather Prediction Center, the Northern Lights could be visible throughout Southeast Michigan.\r\nIn a rare display, large swaths of the U.S. witnessed t… [+2081 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Monisha Ravisetti", "title": "NASA spacecraft captures 1st photo of its giant solar sail while tumbling in space - Livescience.com", "description": "NASA's testing a solar sail system in space, and the spacecraft that brought the tech there has snapped a photo.", "url": "https://www.space.com/nasa-solar-sail-space-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mFm4DbeMnZCoUnKDjhA74Z-1200-80.jpg", "publishedAt": "2024-09-10T22:00:00Z", "content": "On April 23, NASA launched a solar sail\r\n protype to orbit around our planet — a piece of technology that could very well revolutionize the way we think about spacecraft propulsion. Then, on Aug. 29,… [+4398 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "What??? James Webb telescope finds giant question mark in space - Livescience.com", "description": "Astronomers using the James Webb Space Telescope have discovered a pair of distant galaxies being twisted into a cosmic question mark thanks to a rare form of gravitational lensing.", "url": "https://www.livescience.com/space/astronomy/what-james-webb-telescope-finds-giant-question-mark-in-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/auiVdvDvxGY7Fdn8DJAZJQ-1200-80.jpg", "publishedAt": "2024-09-10T21:19:18Z", "content": "Since ancient times, humans have looked to the stars for answers to life's biggest questions. Now, new images from the James Webb Space Telescope\r\n (JWST) reveal a bizarre cosmic object that appears … [+3450 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Cloud atlas of Mars showcases array of atmospheric phenomena - Phys.org", "description": "Cloud enthusiasts have a new tool to investigate striking formations in the skies above the red planet. A browsable database of 20-years-worth of images of clouds and storms, created by the German Aerospace Centre (DLR) in Berlin, is helping scientists better…", "url": "https://phys.org/news/2024-09-cloud-atlas-mars-showcases-array.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/cloud-atlas-of-mars-sh-1.jpg", "publishedAt": "2024-09-10T20:56:03Z", "content": "Cloud enthusiasts have a new tool to investigate striking formations in the skies above the red planet. A browsable database of 20-years-worth of images of clouds and storms, created by the German Ae… [+3770 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Starship Super Heavy Breezes Through Wind Tunnel Testing at NASA Ames - NASA", "description": "SpaceX, the commercial Human Landing System (HLS) provider for Artemis III and Artemis IV, recently tested a 1.2% scale model of the Super Heavy rocket, or booster, in the transonic Unitary Plan Wind Tunnel at NASA’s Ames Research Center in California’s Silic…", "url": "https://www.nasa.gov/image-article/starship-super-heavy-breezes-through-wind-tunnel-testing-at-nasa-ames/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/09/acd24-0004-002.jpg", "publishedAt": "2024-09-10T20:31:27Z", "content": "NASA and its industry partners continue to make progress toward Artemis III and beyond, the first crewed lunar landing missions under the agencys Artemis campaign. SpaceX, the commercial Human Landin… [+2594 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Avoid This Popular Snack: Scientists Reveal Simple Dietary Trick To Cut Calories - SciTechDaily", "description": "A study found that serving a dip with salty snacks significantly increases calorie intake. On average, snacks contribute to around one-fourth of the daily caloric intake for many people. With nearly one-third of adults in the United States being overweight an…", "url": "https://scitechdaily.com/avoid-this-popular-snack-scientists-reveal-simple-dietary-trick-to-cut-calories/", "urlToImage": "https://scitechdaily.com/images/Belly-Fat-Obesity-Weight-Loss.jpg", "publishedAt": "2024-09-10T20:24:35Z", "content": "A Penn State study reveals that adding dip to chips increases caloric intake by 77%, with participants eating the same amount of chips plus the extra calories from the dip. This finding highlights th… [+4527 chars]"}, {"source": {"id": null, "name": "Fnal.gov"}, "author": "maxwellb", "title": "First neutrinos detected at Fermilab short-baseline detector - Fermi National Accelerator Laboratory", "description": "After years of preparation, the first neutrinos have been observed by the Short-Baseline Near Detector collaboration. The data SBND collects will expand our knowledge of how neutrinos interact with matter and will be used to search for evidence of new physics.", "url": "https://news.fnal.gov/2024/09/first-neutrinos-detected-at-fermilab-short-baseline-detector/", "urlToImage": "https://news.fnal.gov/wp-content/uploads/2024/08/24-0137-09.hr_.jpg", "publishedAt": "2024-09-10T18:00:05Z", "content": "Scientists working on the Short-Baseline Near Detector at Fermi National Accelerator Laboratory have identified the detectors first neutrino interactions.\r\nDisplay of a candidate muon neutrino intera… [+8360 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Saturn's Rings to Disappear in 2025. Here’s Why | Vantage with Palki Sharma - Firstpost", "description": "Enjoy the videos and music that you love, upload original content and share it all with friends, family and the world on YouTube.", "url": "https://www.youtube.com/", "urlToImage": "https://www.youtube.com/img/desktop/yt_1200.png", "publishedAt": "2024-09-10T17:45:02Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mindy Weisberger", "title": "Physics breakthrough brings nuclear clock closer to reality - CNN", "description": "A recent breakthrough has paved the way for timekeeping even more precise than the measurements performed by atomic clocks.", "url": "https://www.cnn.com/2024/09/10/science/nuclear-clocks-timekeeping-precision/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/xuv-comb.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-09-10T16:30:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nPicture a clock ticking so steadily that it doesnt los… [+7769 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "China moves Mars sample-return launch up 2 years, to 2028 - Space.com", "description": "'There is now a genuine chance that China could return Martian samples before the U.S.'", "url": "https://www.space.com/china-tianwen-2-mars-sample-return-mission-2028", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VovrbZTgbusHQUba2SvZp5-1200-80.jpg", "publishedAt": "2024-09-10T16:00:01Z", "content": "China has advanced the launch of its Tianwen 3 Mars sample-return mission to 2028. The new timeline, two years sooner than originally planned, suggests that China could bring Mars samples to Earth as… [+3470 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "A long-lost moon could explain Mars' weird shape and extreme terrain - Space.com", "description": "Unlike the other planets in the solar system, Mars is distinctly triaxial, meaning it is an ellipsoid with different sizes along all three axes.", "url": "https://www.space.com/mars-long-lost-moon-weird-shape-extreme-terrain", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oLCk2j4R4JXowpruLkSXXZ-1200-80.jpg", "publishedAt": "2024-09-10T14:00:08Z", "content": "A long-lost moon could explain why Mars is so different from the other rocky planets in the solar system.\r\nToday, Mars\r\n has two tiny moons. But early in its history, the Red Planet may have had a mu… [+3743 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Tim Newcomb", "title": "A Camper Was Playing With Google Maps—and Stumbled Upon a Likely Ancient Impact Crater - AOL", "description": "A man planning a camping trip using Google Maps ran across a uniquely curved spherical pit in Quebec. It may be an ancient asteroid impact crater.", "url": "https://www.popularmechanics.com/science/environment/a62117881/impact-crater-quebec-canada-google-maps/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/y98Eq9uV1VaIL9LFttRL9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_popular_mechanics_812/efbf0b6b8774a518fa395ed4ac60948f", "publishedAt": "2024-09-10T14:00:00Z", "content": "Man Finds Possible Ancient Crater on Google MapsAbstract Aerial Art - Getty Images\r\n<ul><li>A man planning a camping trip using Google Maps ran across a uniquely curved spherical pit in Quebec and st… [+3111 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Researchers find live fungi, bacteria and viruses high in the Earth's atmosphere - Phys.org", "description": "A team of climate, health and atmospheric specialists in Spain and Japan has found abundant live fungi, bacteria and viruses high in the Earth's atmosphere. In their study published in the Proceedings of the National Academy of Sciences, the group collected a…", "url": "https://phys.org/news/2024-09-fungi-bacteria-viruses-high-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/researchers-find-live.jpg", "publishedAt": "2024-09-10T13:30:01Z", "content": "A team of climate, health and atmospheric specialists in Spain and Japan has found abundant live fungi, bacteria and viruses high in the Earth's atmosphere. In their study published in the Proceeding… [+2533 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Owen Bellwood", "title": "NASA Was ‘Right’ To Bring Starliner Back Empty As Thrusters And Guidance Fail On Return - Jalopnik", "description": "Starliner landed back on Earth with more damaged parts that only reaffirmed NASA’s decision not to trust it with the lives of two astronauts", "url": "https://jalopnik.com/nasa-was-right-to-bring-starliner-back-empty-as-thrus-1851644289", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/04311b2c5af41cadec5769ce545d3ede.jpg", "publishedAt": "2024-09-10T13:30:00Z", "content": "Boeings first foray into manned space flight has been an unmitigated cock up. Starliner launched to the International Space Station with two astronauts onboard in June and landed back on Earth two mo… [+3636 chars]"}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "Elon Musk's pet dog inspires young girl's design for Polaris Dawn zero-g indicator - collectSPACE.com", "description": "A privately-funded space crew aiming to set several records in orbit may not include the first child in space, but they have her hopes, wishes and, most tangibly, furry, spacesuit-clad creation aboard. Asteroid is the \"zero-g indicator\" aboard the Polaris Daw…", "url": "http://www.collectspace.com/news/news-091024a-polaris-dawn-asteroid-shiba-dog-zero-g-indicator.html", "urlToImage": "http://www.collectspace.com/images/news-091024a-fb.jpg", "publishedAt": "2024-09-10T13:20:34Z", "content": "September 10, 2024\r\n — A privately-funded crew now on a mission to set several records in Earth orbit may not include the first child in space, but they have her hopes, wishes and, most tangibly, ori… [+2984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "6 Dangerous Asteroids On Collision Course With Earth, First One May Hit In October - NDTV", "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News", "url": "https://www.ndtv.com", "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png", "publishedAt": "2024-09-10T13:12:03Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New dense sub-Saturn exoplanet discovered - Phys.org", "description": "Using the Transiting Exoplanet Survey Satellite (TESS), astronomers from the Physical Research Laboratory (PRL) in Ahmedabad, India and elsewhere, have detected a new sub-Saturn exoplanet with a relatively high density. The finding was reported in a research …", "url": "https://phys.org/news/2024-09-dense-saturn-exoplanet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-dense-sub-saturn-e.jpg", "publishedAt": "2024-09-10T12:49:22Z", "content": "Using the Transiting Exoplanet Survey Satellite (TESS), astronomers from the Physical Research Laboratory (PRL) in Ahmedabad, India and elsewhere, have detected a new sub-Saturn exoplanet with a rela… [+3100 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "ExtremeTech", "title": "WATCH: 1.8 Billion Years of Tectonic Plate Movements In New Animation - ExtremeTech", "description": null, "url": "https://www.extremetech.com/science/watch-18-billion-years-of-tectonic-plate-movements-in-new-animation", "urlToImage": null, "publishedAt": "2024-09-10T11:59:00Z", "content": null}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Interesting Engineering", "title": "Princeton researchers bend DNA strands with light to probe the genome - Interesting Engineering", "description": null, "url": "https://interestingengineering.com/science/scientists-bend-dna-strands-with-light-to-probe-the-genome", "urlToImage": null, "publishedAt": "2024-09-10T10:18:00Z", "content": null}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Chang’e-6 orbiter turns up at Sun-Earth Lagrange point after moon sampling mission - SpaceNews", "description": "Chang’e-6 orbiter turns up at Sun-Earth Lagrange point after moon sampling mission The orbiter for China’s Chang’e-6 lunar far side sample return mission is now at the second Sun-Earth Lagrange as part of extended activities.", "url": "https://spacenews.com/change-6-orbiter-turns-up-at-sun-earth-lagrange-point-after-moon-sampling-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2021/09/Sun-Earth-L1-Earth-moon-april2021-cnsa-clep.jpg", "publishedAt": "2024-09-10T09:36:00Z", "content": "HELSINKI The orbiter for Chinas Change-6 lunar far side sample return mission is now at the second Sun-Earth Lagrange as part of extended activities.\r\nThe orbiter was a key component allowing China t… [+3216 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "ISRO Warning: Massive asteroid with 'continental scale devastation' risk approaching earth - The Economic Times", "description": "ISRO is closely monitoring a large asteroid named Apophis, which is set to pass dangerously close to Earth on April 13, 2029. Apophis, measuring over 300 meters in diameter, poses a significant threat, with the potential to cause  continental scale devastatio…", "url": "https://economictimes.indiatimes.com/magazines/panache/isro-warning-massive-asteroid-with-continental-scale-devastation-risk-approaching-earth/articleshow/113222732.cms", "urlToImage": "https://img.etimg.com/thumb/msid-113223455,width-1200,height-630,imgsize-1850006,overlay-etpanache/photo.jpg", "publishedAt": "2024-09-10T09:23:01Z", "content": "The Indian Space Research Organisation (ISRO) has issued a warning about a potentially hazardous asteroid named Apophis, which is set to pass dangerously close to Earth on April 13, 2029. This astero… [+4552 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Juice confirms that Earth is habitable - European Space Agency", "description": "During its&nbsp;flyby of Earth&nbsp;on 20 August, ESA’s Jupiter Icy Moons Explorer (Juice) found ingredients for life in Earth’s atmosphere.", "url": "https://www.esa.int/Science_Exploration/Space_Science/Juice/Juice_confirms_that_Earth_is_habitable", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/09/juice_s_view_of_the_pacific_ocean_in_three_wavelengths/26305820-1-eng-GB/Juice_s_view_of_the_Pacific_Ocean_in_three_wavelengths_pillars.jpg", "publishedAt": "2024-09-10T09:12:47Z", "content": "Science &amp; Exploration10/09/20243496 views18 likes\r\nDuring its flyby of Earth on 20 August, ESAs Jupiter Icy Moons Explorer (Juice) found ingredients for life in Earths atmosphere.\r\nThe flyby prov… [+3059 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Marcia Dunn", "title": "NASA spacecraft to study Jupiter moon's underground ocean cleared for October launch - Phys.org", "description": "NASA on Monday approved next month's launch to Jupiter's moon Europa after reviewing the spacecraft's ability to withstand the intense radiation there.", "url": "https://phys.org/news/2024-09-nasa-spacecraft-jupiter-moon-underground.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/nasa-spacecraft-to-stu.jpg", "publishedAt": "2024-09-10T08:09:37Z", "content": "NASA on Monday approved next month's launch to Jupiter's moon Europa after reviewing the spacecraft's ability to withstand the intense radiation there.\r\nQuestions about the reliability of the transis… [+2289 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Our Galaxy May Already Be Colliding With Andromeda - IFLScience", "description": "A new study has found galaxies are a whole lot bigger than we thought.", "url": "https://www.iflscience.com/our-galaxy-may-already-be-colliding-with-andromeda-75870", "urlToImage": "https://assets.iflscience.com/assets/articleNo/75870/aImg/78725/galaxy-meta.png", "publishedAt": "2024-09-10T07:33:19Z", "content": "Humans confirmed the existence of other galaxies surprisingly late. Only 100 years ago, in fact, when Edwin Hubble found a type of star known as Cepheid variables within Andromeda, and used them to m… [+3677 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kyle Melnick", "title": "Shark biologists stumble into a deep-sea murder mystery - The Washington Post", "description": "Porbeagle sharks aren’t known to have predators, but a new study says it recorded the first instance of the species being preyed upon by another massive shark.", "url": "https://www.washingtonpost.com/climate-environment/2024/09/09/porbeagle-shark-eaten-prey-study/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/09-06-2024/t_176c2ef5e8d14f31b50477e42f76d93a_name_shark.jpg&w=1440", "publishedAt": "2024-09-10T04:52:54Z", "content": "When biologists in Massachusetts placed tracking tags on porbeagle sharks, they hoped to learn more about the massive hunters habitats.\r\nWhat they got was a murder mystery. The victim was a pregnant … [+4581 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shankhyaneel Sarkar", "title": "Asteroid 2024 ON, Roughly The Size Of A 60-Storey Building, Approaching Earth In Possible Close Call - News18", "description": "Discovered by G. Borisov, asteroid 2024 ON will pass Earth at 620,000 miles.", "url": "https://www.news18.com/world/2024-on-asteroid-space-rock-roughly-the-size-of-a-60-storey-building-threatens-close-flyby-past-earth-9044956.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/09/asteroid-shutterstock-earth-representative-2024-09-a9b6b7d0570ea67aa472173b63739e64-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-09-10T03:42:00Z", "content": "NASA has issued an alert about a large asteroid called 2024 ON, which is approaching Earth at a high speed. \r\n2024 ON has left astronomers and space enthusiasts awestruck since its discovery and the … [+1767 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Delays Upcoming Mars Mission, Citing Delays With Bezos’s Big Rocket - Gizmodo", "description": "New Glenn has been in development for over a decade, but it likely won't be ready for launch next month, posing a problem for NASA.", "url": "https://gizmodo.com/nasa-ditches-bezoss-big-rocket-for-upcoming-mars-mission-2000496226", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/new-glenn-integrated-tank-test-roll-out-05.jpg", "publishedAt": "2024-09-09T19:30:54Z", "content": "Blue Origin’s New Glenn will no longer launch a pair of probes to Mars next month, as NASA believes the rocket wont be ready in time for the missions launch window.\r\nThe Escape and Plasma Acceleratio… [+3009 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "The moon might still have active volcanoes, China's Chang'e 5 sample-return probe reveals - Space.com", "description": "China's Chang'e 5 mission brought back evidence that the moon had erupting volcanoes just 120 million years ago.", "url": "https://www.space.com/moon-volcanically-active-today-china-change-5", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iM5SaM84vTYSqzThckmBsG-1200-80.jpg", "publishedAt": "2024-09-09T19:00:51Z", "content": "Volcanoes have erupted on the lunar surface within a geologically recent timespan, and the moon could still be volcanically active today, according to tiny glass beads in lunar dirt brought back to E… [+6941 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Boing Boing", "title": "Scientists make temporarily transparent mice - Boing Boing", "description": null, "url": "https://boingboing.net/2024/09/09/scientists-make-temporarily-transparent-mice.html", "urlToImage": null, "publishedAt": "2024-09-09T16:21:00Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jan Łyczakowski, Raymond Wightman", "title": "How we discovered a new type of wood - and how it could help fight climate change - The Conversation", "description": "Tulip trees were long renowned for their carbon storage. Their unique wood may be responsible.", "url": "https://theconversation.com/how-we-discovered-a-new-type-of-wood-and-how-it-could-help-fight-climate-change-236618", "urlToImage": "https://images.theconversation.com/files/618181/original/file-20240909-21-he3haq.jpg?ixlib=rb-4.1.0&rect=0%2C388%2C4888%2C2440&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-09-09T16:13:11Z", "content": "For as long as scientists have studied trees, we have categorised them into two types based on the sort of wood they make. Softwoods include pines and firs and generally grow faster than hardwoods, l… [+5870 chars]"}]}