{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Buck Moon: July supermoon to appear brighter than usual in the sky this week - BBC", "description": "July's full Moon, known as a Buck Moon, will be closer than normal in its orbit around the Earth.", "url": "https://www.bbc.com/news/world-66091619", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10411/production/_130277566_06515ed9533a86bbc6113a385643bfd1f8ab2acc.jpg", "publishedAt": "2023-07-03T21:47:59Z", "content": "The Moon will have us gazing at the sky on Monday evening as it appears brighter and larger than usual.\r\nJuly's supermoon will appear full for up to three days, according to Nasa.\r\nKnown as a Buck Mo… [+2975 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Jessica Goudreault", "title": "The Solution To Preventing Asteroid Strikes Is One Of The Oldest Military Weapons - Giant Freakin Robot", "description": "A new way to develop Earth from asteroids is being developed, and it includes one of the oldest weapons in our history.", "url": "https://www.giantfreakinrobot.com/sci/catapults-earth-asteroids.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2022/11/asteroid.jpg", "publishedAt": "2023-07-03T21:37:21Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover a molecular switch that regulates lipid metabolism in cells - News-Medical.Net", "description": "Our body's fat metabolism plays a vital role in energy production in our body. A research team at the University of Basel, Switzerland, has discovered a molecular switch that regulates lipid metabolism in our cells.", "url": "https://www.news-medical.net/news/20230703/Researchers-discover-a-molecular-switch-that-regulates-lipid-metabolism-in-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/3D_illustration_mitchondria_-_Wire_man__2906c5e1a5514570bffd716b0c282567-620x480.jpg", "publishedAt": "2023-07-03T20:01:00Z", "content": "Our body's fat metabolism plays a vital role in energy production in our body. A research team at the University of Basel, Switzerland, has discovered a molecular switch that regulates lipid metaboli… [+3192 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Robotic 'Light Bender' on the moon could help Artemis astronauts keep the lights on - Space.com", "description": "The Light Bender robotics project from space technology company Maxar will autonomously redirect sunlight to power solar panels in dark regions of the lunar surface.", "url": "https://www.space.com/moon-artemis-astronauts-maxar-light-bender", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JN7sdxCJPARKJq7e44rdXG-1200-80.png", "publishedAt": "2023-07-03T19:00:09Z", "content": "A new undertaking from space technology company Maxar will use mirrors to autonomously track and reflect sunlight to supply energy to solar-powered equipment operating in the shadows of the moon's cl… [+3051 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Chemists discover why photosynthetic light-harvesting is so efficient - Phys.org", "description": "When photosynthetic cells absorb light from the sun, packets of energy called photons leap between a series of light-harvesting proteins until they reach the photosynthetic reaction center. There, cells convert the energy into electrons, which eventually powe…", "url": "https://phys.org/news/2023-07-chemists-photosynthetic-light-harvesting-efficient.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2014/photosynthes.jpg", "publishedAt": "2023-07-03T19:00:02Z", "content": "When photosynthetic cells absorb light from the sun, packets of energy called photons leap between a series of light-harvesting proteins until they reach the photosynthetic reaction center. There, ce… [+5804 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "You Up? Mars Helicopter Finally Makes Contact After Two Months of Silence - Gizmodo", "description": "A hilly terrain on Mars stood between Ingenuity and Perseverance, interrupting their communication for over 60 days.", "url": "https://gizmodo.com/mars-ingenuity-helicopter-nasa-two-month-silence-1850601767", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/f63c2982d5fd9b1b2aaa6d7b090c88cf.jpg", "publishedAt": "2023-07-03T18:55:00Z", "content": "After 63 days of agonizing silence, NASAs Martian chopper finally phoned home.\r\nThe Ingenuity helicopter reestablished communication with mission control on June 28, officially logging its 52nd fligh… [+2549 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gurjeet Kahlon", "title": "'Sandwich' discovery offers new explanation for planet formation - Phys.org", "description": "Scientists have made a new discovery on how small planets might form. Researchers at the University of Warwick investigated the \"birth environment\" of planets—areas of gas and dust that swirl around a central star—known as the protoplanetary disk.", "url": "https://phys.org/news/2023-07-sandwich-discovery-explanation-planet-formation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/sandwich-discovery-off.jpg", "publishedAt": "2023-07-03T18:47:24Z", "content": "Scientists have made a new discovery on how small planets might form. Researchers at the University of Warwick investigated the \"birth environment\" of planetsareas of gas and dust that swirl around a… [+3055 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Key ingredient for life found in star-birthing cloud just 1000 light-years from Earth - Space.com", "description": "Tryptophan is one of 20 amino acids essential for forming key proteins needed for life.", "url": "https://www.space.com/amino-acid-tryptophan-perseus-molecular-complex-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/e2Yd4ZsCyPFcS6gZr3QqJK-1200-80.jpg", "publishedAt": "2023-07-03T18:00:19Z", "content": "Astronomers have discovered high amounts of the amino acid tryptophan in interstellar material throughout a nearby star-birthing region of space. Tryptophan is one of 20 amino acids responsible for f… [+4848 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Explosions Just Got More Interesting: Challenging Conventional Understanding of Classical Novae - SciTechDaily", "description": "A researcher has discovered non-thermal emissions from the classical nova V1674 Herculis, challenging the conventional understanding of these celestial objects as simple heat-induced explosions. This rare finding, using the Very Long Baseline Array (VLBA), re…", "url": "https://scitechdaily.com/space-explosions-just-got-more-interesting-challenging-conventional-understanding-of-classical-novae/", "urlToImage": "https://scitechdaily.com/images/V1674Her-Binary-System-With-Classical-Nova-scaled.jpg", "publishedAt": "2023-07-03T17:58:52Z", "content": "ByNational Radio Astronomy ObservatoryJuly 3, 2023\r\nThis artists conception depicts V1674 Herculis, a classical nova hosted in a binary star system that is made up of a white dwarf and dwarf companio… [+4210 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Oliver Morsch", "title": "Researchers create antenna for nanoscale light sources using unusual placement of semiconductor material - Phys.org", "description": "The fast switching and modulation of light is at the heart, among other things, of modern data transfer, in which information is sent through fiber optic cables in the shape of modulated light beams. It has been possible for several years now to miniaturize l…", "url": "https://phys.org/news/2023-07-antenna-nanoscale-sources-unusual-placement.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/researchers-create-ant-3.jpg", "publishedAt": "2023-07-03T17:34:03Z", "content": "The fast switching and modulation of light is at the heart, among other things, of modern data transfer, in which information is sent through fiber optic cables in the shape of modulated light beams.… [+4967 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "Launch Roundup - Arianespace launching Ariane 5 final flight; SpaceX to fly one of last Starlink v1.5 flights - NASASpaceFlight.com - NASASpaceflight.com", "description": "Three launches are currently planned for the week of July 2 through July 9. The…", "url": "https://www.nasaspaceflight.com/2023/07/launch-roundup-july_2_9/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/10/FE6NbAeVIAc8XEO-scaled-1-525x350.jpg", "publishedAt": "2023-07-03T17:18:28Z", "content": "6Three launches are currently planned for the week of July 2 through July 9. The first one is on Americas birthday, Tuesday, July 4, but is a European rocket making its 117th and final flight. Later … [+6300 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "First direct visualization of a zero-field pair density wave - Phys.org", "description": "In the field of superconductivity—the phenomenon in which electrons can flow through a material with essentially zero resistance—the \"holy grail\" of discovery is a superconductor that can perform under everyday temperatures and pressures. Such a material coul…", "url": "https://phys.org/news/2023-07-visualization-zero-field-pair-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/first-direct-visualiza.jpg", "publishedAt": "2023-07-03T17:10:06Z", "content": "In the field of superconductivitythe phenomenon in which electrons can flow through a material with essentially zero resistancethe \"holy grail\" of discovery is a superconductor that can perform under… [+5127 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Emily Mae Czachor", "title": "Saturn's rings radiate brilliant glow in detailed new image from Webb space telescope - CBS News", "description": "NASA unveiled a stunning image of the ringed planet and several of its moons.", "url": "https://www.cbsnews.com/news/saturn-photo-rings-webb-telescope-new-image-nasa/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/07/03/c5168066-5990-43b7-b28c-3b98eab806c9/thumbnail/1200x630/e69ebf74b31283e4f1a7fde422a319bb/saturn-no-text.png?v=f3503a7856c58c20acab4eae8bb1f0f4", "publishedAt": "2023-07-03T17:01:00Z", "content": "The James Webb Space Telescope has produced a stunning new image of Saturn and its rings, which appear to glow in the space telescope's first near-infrared observations of the planet. \r\nNASA unveiled… [+3462 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gravitas: Is China planning to drill the Moon? | WION - WION", "description": "The heads of U.S. and UK command chiefs have raised fears that China is planning to mine the moon for minerals. How does China plan to do it? Molly Gambhir t...", "url": "https://www.youtube.com/watch?v=7_knFmXVhjo", "urlToImage": "https://i.ytimg.com/vi/7_knFmXVhjo/maxresdefault.jpg", "publishedAt": "2023-07-03T16:55:14Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Russell Moul", "title": "Monkey In Zoo Eats Baby's Corpse In Rare Example Of Primate Cannibalism - IFLScience", "description": "It may be a grisly sight, but this dark act could also indicate evolutionary behavior.", "url": "https://www.iflscience.com/monkey-in-zoo-eats-babys-corpse-in-rare-example-of-primate-cannibalism-69642", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69642/aImg/69005/female-drill-monkey-attempting-to-groom-her-baby-s-corpse-meta.jpg", "publishedAt": "2023-07-03T16:36:19Z", "content": "A monkey was recently seen carrying the body of her dead baby for some time after it died. However, she later ate the corpse in a case of primate cannibalism. As unpleasant as this sounds, this unusu… [+4118 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Detection of the cosmological time dilation of high-redshift quasars - Nature.com", "description": "A Bayesian-based analysis of 190 cosmologically distant quasars, photometrically observed over two decades, has revealed the long-expected presence of cosmic time dilation owing to the expansion of space imprinted on their variability.", "url": "https://www.nature.com/articles/s41550-023-02029-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41550-023-02029-2/MediaObjects/41550_2023_2029_Fig1_HTML.png", "publishedAt": "2023-07-03T15:02:48Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Intelligence Meets CRISPR: The Rise of Precision RNA-Targeting and Gene Modulation - SciTechDaily", "description": "Researchers have developed an artificial intelligence model, TIGER, that predicts the on- and off-target activity of RNA-targeting CRISPR tools. This innovation, detailed in a study published in Nature Biotechnology, can accurately design guide RNAs, modulate…", "url": "https://scitechdaily.com/artificial-intelligence-meets-crispr-the-rise-of-precision-rna-targeting-and-gene-modulation/", "urlToImage": "https://scitechdaily.com/images/Genetic-Engineering-AI-DNA-Editing-Concept.jpg", "publishedAt": "2023-07-03T15:00:38Z", "content": "ByColumbia UniversityJuly 3, 2023\r\nResearchers have developed RNA-based predictive models that use artificial intelligence to determine the on- and off-target activity of CRISPR tools that target RNA… [+11687 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Physicists develop a metamaterial that can count - Phys.org", "description": "A block of rubber that can count to ten and even remember the order in which it is pressed—physicists Martin van Hecke and Lennard Kwakernaak (Leiden University and AMOLF Amsterdam) have published about this latest metamaterial in the journal Physical Review …", "url": "https://phys.org/news/2023-07-physicists-metamaterial.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/physicist-develops-a-m.jpg", "publishedAt": "2023-07-03T14:35:14Z", "content": "A block of rubber that can count to ten and even remember the order in which it is pressedphysicists Martin van Hecke and Lennard Kwakernaak (Leiden University and AMOLF Amsterdam) have published abo… [+3562 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "The Magic of Moss: The Tiny Plant Absorbs 6x More CO2 Than Other Plants, Says New Study - Good News Network", "description": "Found in at least 12,000 varieties from snow-capped mountains to red-hot deserts, moss is the oldest living relative of all plants", "url": "https://www.goodnewsnetwork.org/the-magic-of-moss-the-tiny-plant-absorbs-6x-more-co2-than-other-plants-says-new-study/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2022/04/creek-rocks-water-moss-river-pubdomain-Anvesh-Uppunuthula.jpg", "publishedAt": "2023-07-03T14:30:57Z", "content": "Spongy, uniquely green, and allegedly good with directions, Earth’s ubiquitous mosses are more important to ecosystems than they appear.\r\nFound in at least 12,000 species living everywhere from snow-… [+2559 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Mathematical model explains how hollow-core fibers guide light with ultra-low data loss - Phys.org", "description": "Scientists at the University of Bath have developed a mathematical model to explain how antiresonant hollow-core fibers guide light in a way that keeps data loss ultra-low. Until now, scientists had no complete explanation for this well-observed phenomenon.", "url": "https://phys.org/news/2023-07-mathematical-hollow-core-fibers-ultra-low-loss.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/limiting-loss-in-leaky.jpg", "publishedAt": "2023-07-03T14:13:06Z", "content": "Scientists at the University of Bath have developed a mathematical model to explain how antiresonant hollow-core fibers guide light in a way that keeps data loss ultra-low. Until now, scientists had … [+6543 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Solar astronomers discover 'shooting stars' on the sun's corona - Phys.org", "description": "A team of astronomers from several European institutions led by Northumbria University in Newcastle has discovered \"shooting stars\" on the sun. Observations from the European Space Agency's Solar Orbiter (SolO) have revealed never-before-seen \"falling star\"-t…", "url": "https://phys.org/news/2023-07-solar-astronomers-stars-sun-corona.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/solar-astronomers-disc.jpg", "publishedAt": "2023-07-03T14:04:04Z", "content": "A team of astronomers from several European institutions led by Northumbria University in Newcastle has discovered \"shooting stars\" on the sun. Observations from the European Space Agency's Solar Orb… [+4607 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Volcanic sulfur flows observed and recorded in northern Chile - Phys.org", "description": "A small international team of vulcanologists has observed a rarely seen event—a sulfur flow from a volcano—in northern Chile. In their paper published in the journal Frontiers in Earth Science, the group describes how they happened to observe the flow and wha…", "url": "https://phys.org/news/2023-07-volcanic-sulfur-northern-chile.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/volcanic-sulfur-flows.jpg", "publishedAt": "2023-07-03T13:30:01Z", "content": "(A) Location map of the Central Volcanic Zone (CVZ) of the Andes, including the Northern, Southern, and Austral Volcanic Zones (NVZ, SVZ, and AVZ, respectively), showing the Lastarria volcano as a re… [+3629 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New eclipsing cataclysmic variable system discovered - Phys.org", "description": "Using the Spektr-RG (SRG) spacecraft and the Zwicky Transient Facility (ZTF), an international team of astronomers has discovered a new eclipsing cataclysmic variable system, which received designation SRGeJ045359.9+622444 (or SRGeJ0453 for short). The findin…", "url": "https://phys.org/news/2023-07-eclipsing-cataclysmic-variable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-cataclysmic-variab.jpg", "publishedAt": "2023-07-03T13:23:47Z", "content": "Using the Spektr-RG (SRG) spacecraft and the Zwicky Transient Facility (ZTF), an international team of astronomers has discovered a new eclipsing cataclysmic variable system, which received designati… [+3401 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "How to see the moon in conjunction with 5 planets this month - Livescience.com", "description": "In early July, our natural satellite will appear close to Mars, Saturn, Jupiter, Venus and Mercury.", "url": "https://www.livescience.com/space/the-moon/how-to-see-the-moon-in-conjunction-with-5-planets-this-month", "urlToImage": "https://cdn.mos.cms.futurecdn.net/z5N7HXB4ed8ewcrfnSmWvR-1200-80.jpg", "publishedAt": "2023-07-03T13:00:00Z", "content": "In early July, the moon will pass close to all three of Earth's neighboring  inner solar system planets, plus the two largest planets that orbit the sun.\r\nFirst, the gas giants Saturn\r\n and Jupiter\r\n… [+2994 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Stephen Dowling", "title": "Why Saturn's moons have remained hidden from view - BBC", "description": "Astronomers recently announced that they had discovered 62 new moons around the ringed planet Saturn and another has just been added to the list. So, how have they lain hidden for so long?", "url": "https://www.bbc.com/future/article/20230703-why-saturns-moons-have-remained-hidden-from-view", "urlToImage": "https://ychef.files.bbci.co.uk/live/624x351/p0fynfwz.jpg", "publishedAt": "2023-07-03T12:54:05Z", "content": "\"If you look at the four bright moons of Jupiter, the Galilean satellites, those are called regular moons, and all the giant planets have regular moons,\" says Brett Gladman, a Canadian astronomer at … [+2111 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": null, "title": "Euclid Space Telescope: Europe's mission to discover dark energy and dark matter launches - Euronews", "description": "ESA's Euclid space telescope was launched for a six-year mission to shed light on dark energy and matter and chart the largest-ever map of the universe.", "url": "https://www.euronews.com/next/2023/07/02/esas-euclid-space-telescope-launched-to-discover-dark-energy-and-dark-matter", "urlToImage": "https://static.euronews.com/articles/stories/07/72/12/04/1000x563_cmsv2_523a62f8-c834-5ac6-bdc0-e1585d23e16d-7721204.jpg", "publishedAt": "2023-07-03T12:33:45Z", "content": "ESA's Euclid space telescope was launched for a six-year mission to shed light on dark energy and matter and chart the largest-ever map of the universe.\r\n A European space telescope blasted off on Sa… [+3150 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Incredible view of the Milky Way and more — June's best science images - Nature.com", "description": "The month’s sharpest science shots — selected by Nature’s photo team.", "url": "https://www.nature.com/immersive/d41586-023-02046-1/index.html", "urlToImage": "https://www.nature.com/immersive/d41586-023-02046-1/assets/zIPD5sfOMN/2023-07-03_news_iom-june_baobab-milky-way_sm_data-1066x600.jpg", "publishedAt": "2023-07-03T12:08:56Z", "content": "Star-studded sky. This spellbinding sight, captured by photographer Stefan Liebermann, shows the Milky Way arch over baobab trees in Madagascar. The clouds of colour are caused by airglow the effects… [+446 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "5 fascinating facts about the Big Bang, the theory that defines the history of the universe - Livescience.com", "description": "From the Catholic priest who pioneered it, to how we can (almost) see it, here are 5 fascinating facts about the Big Bang.", "url": "https://www.livescience.com/space/cosmology/5-fascinating-facts-about-the-big-bang-the-theory-that-defines-the-history-of-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7gsCkPBXtLBo5qkWoe7NX8-1200-80.png", "publishedAt": "2023-07-03T12:00:00Z", "content": "The term \"Big Bang\r\n\" is thrown around casually, to the point of becoming the title of one of the most popular sitcoms ever. But while we all understand the basic idea — that the universe was once sm… [+5207 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "One of these 19 amazing night sky images will win 2023 Astronomy Photo of the Year - Space.com", "description": "The Royal Observatory of Greenwich has released a shortlist of the top submissions, and the pictures are incredible.", "url": "https://www.space.com/astronomy-photo-of-the-year-shortlist-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qSjikUj2EFCxZYpk9ehCTh-1200-80.jpg", "publishedAt": "2023-07-03T12:00:00Z", "content": "The largest astrophotography competition in the world is wrapping up its 15th year. The contest’s officiating organization, the Royal Observatory of Greenwich, has released nineteen photographs offic… [+13120 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "We May Know What's Causing The Huge Gravity Anomaly Beneath The Indian Ocean - IFLScience", "description": "It is the lowest gravity anomaly on Earth.", "url": "https://www.iflscience.com/we-may-know-whats-causing-the-huge-gravity-anomaly-beneath-the-indian-ocean-69620", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69620/aImg/68980/gravity-map-meta.png", "publishedAt": "2023-07-03T11:58:20Z", "content": "In the Indian Ocean, there is an anomaly. The gravity there is lower (compared to what we'd expect) than anywhere else on the planet, and now, a team of researchers may have figured out why.\r\nAccordi… [+1929 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Laurelle Stelle", "title": "Amish families have figured out an ingenious way to dry clothes without household appliances in the winter — here’s how they do it - Yahoo News", "description": "\"There’s no more iconic image of Amish country than dancing, colorful clothing flapping on the line, drying in the breeze.\"", "url": "https://news.yahoo.com/amish-families-figured-ingenious-way-104500758.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7feS2hyk1F6Rc7NpWKTNMQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MzM-/https://media.zenfs.com/en/the_cool_down_737/eeaaf56691a5dffe35d0c96d0b9e6d4f", "publishedAt": "2023-07-03T10:45:00Z", "content": "Line-drying is a no-cost way to use the suns energy to dry clothing, which makes it a great choice for people who are trying to save money and electricity.\r\nBut some homeowners who want to use clothe… [+2897 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "The discovery of the gravitational wave background has scientists excited - Space.com", "description": "This isn't the first time that humanity has detected gravitational waves. So why is this discovery so important?", "url": "https://www.space.com/gravitational-waves-astronomers-why-so-excited", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CTgcA838bgTbXwysw5Fnyd-1200-80.png", "publishedAt": "2023-07-03T10:00:31Z", "content": "The very fabric of the universe is ringing with gravitational waves from its earliest epoch, and researchers have finally \"heard\" this cosmic symphony. \r\nOn Thursday, June 28, the North American Nano… [+12090 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Mark Harris", "title": "To Beat the Heat, Personal Cooling That You Can Take With You - The Wall Street Journal", "description": "Saharan ants, camels inspire scientists looking for new technologies to keep people cool without air conditioners", "url": "https://www.wsj.com/articles/personal-cooling-technology-1641d754", "urlToImage": "https://images.wsj.net/im-785632/social", "publishedAt": "2023-07-03T09:35:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amaya McDonald", "title": "Scientists find new clue in what led to megalodon’s demise - CNN", "description": "A new study finds that megatooth sharks’ warm-blood adaptation and giant size may have played a role in their extinction.", "url": "https://www.cnn.com/2023/07/03/world/megatooth-shark-warm-blood-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230628083239-megatooth-shark-warm-blood-illo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-07-03T08:39:00Z", "content": "Editors note: Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nMegalodon, one of the most fearsome shar… [+3928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Parker Solar Probe Finds Magnetic Energy Near Sun's Surface Enables Solar Wind To Reach Gravity-Defying Speeds - SciTechDaily", "description": "NASA’s Parker Solar Probe Identifies Mechanism Driving the Sun’s Fast Wind Parker Solar Probe data has helped researchers understand how the sun's wind can reach speeds exceeding 1 million miles per hour. This could assist in predicting large solar eruptions,…", "url": "https://scitechdaily.com/parker-solar-probe-finds-magnetic-energy-near-suns-surface-enables-solar-wind-to-reach-gravity-defying-speeds/", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Spacecraft-Approaching-Sun-1.jpg", "publishedAt": "2023-07-03T04:55:52Z", "content": "ByUniversity of MarylandJuly 2, 2023\r\nResearchers have utilized data from NASAs Parker Solar Probe to understand how the suns wind, composed of ionized particles or plasma, can exceed speeds of 1 mil… [+6974 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering the Low-Energy “Break Point” for Exotic Quark-Gluon Plasma Creation - SciTechDaily", "description": "Through gold nuclei collisions at varying energies, physicists have found that the creation of quark-gluon plasma—an exotic state of matter—halts at the lowest collision energy of 3 GeV. This discovery aids in mapping nuclear matter phases and identifying the…", "url": "https://scitechdaily.com/discovering-the-low-energy-break-point-for-exotic-quark-gluon-plasma-creation/", "urlToImage": "https://scitechdaily.com/images/Mapping-Nuclear-Phase-Changes.jpg", "publishedAt": "2023-07-03T03:40:20Z", "content": "ByU.S. Department of EnergyJuly 2, 2023\r\nA conjectured phase diagram of nuclear matter. New data that show high collision energies produce a quark-gluon plasma (QGP) while the lowest energy collision… [+3488 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sunspot erupts, producing dangerous X-class solar flares! Blackout hits Pacific Ocean area - HT Tech", "description": "A radio blackout was observed over the Pacific Ocean as a terrifying X-class solar flare hit Earth recently, according to reports.", "url": "https://tech.hindustantimes.com/tech/news/sunspot-erupts-producing-dangerous-x-class-solar-flares-blackout-hits-pacific-ocean-area-71688353071895.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/03/1600x900/sun-2335972_1280_1688353402133_1688353406276.jpg", "publishedAt": "2023-07-03T03:04:39Z", "content": "Our Sun has a thin layer of second atmosphere that lies just above the photosphere as well as a huge corona. This is the region where we see most of the solar phenomena such as solar flares, prominen… [+1897 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "NASA Seals Volunteers Into Isolated Habitat For Year-Long Experiment - ScienceAlert", "description": "On June 25, 2023, a crew of four volunteers entered a simulated Martian habitat, from which they will not emerge for over a year.", "url": "https://www.sciencealert.com/nasa-seals-volunteers-into-isolated-habitat-for-year-long-experiment", "urlToImage": "https://www.sciencealert.com/images/2023/07/NASAHabitatRooms.jpg", "publishedAt": "2023-07-03T02:49:39Z", "content": "On June 25, 2023, a crew of four volunteers entered a simulated Martian habitat, from which they will not emerge for over a year. Their mission: to learn more about the logistics and the human psycho… [+3187 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beyond the Helix: DNA's Complex Folding Unveils New Functions - SciTechDaily", "description": "In a groundbreaking study, researchers from Weill Cornell Medicine and the National Heart, Lung, and Blood Institute, a department of the National Institutes of Health, found that DNA can emulate the functions of proteins by forming intricate, three-dimension…", "url": "https://scitechdaily.com/beyond-the-helix-dnas-complex-folding-unveils-new-functions/", "urlToImage": "https://scitechdaily.com/images/Structure-of-Lettuce-DNA.jpg", "publishedAt": "2023-07-03T02:19:18Z", "content": "ByWeill Cornell MedicineJuly 2, 2023\r\nIllustration showing the structure of Lettuce, a DNA that binds and activates fluorophores derived from green fluorescent protein. Credit: Luiz F.M. Passalacqua\r… [+7243 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Carolyn Collins Petersen", "title": "JWST Sees the Beginning of the Cosmic Web - Universe Today", "description": "Astronomers used JWST to spot early galaxies that were forming an early filament of the Cosmic Web 830 million years after the Big Bang.", "url": "https://www.universetoday.com/162267/jwst-sees-the-beginning-of-the-cosmic-web/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/STScI-01H3D73D606N8J46APZBYP5RAP-e1688341018381.jpg", "publishedAt": "2023-07-02T23:39:11Z", "content": "The Cosmic Web is the large-scale structure of the Universe. If you could watch our cosmos unfold from the Big Bang to today, you’d see these filaments (and the voids between them) form throughout ti… [+6528 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: July 2, 2023 | Hackaday - Hackaday", "description": "Members of Pixelbar woke up to shocking news on Wednesday morning this week as they learned that a fire had destroyed the building housing their Rotterdam hackerspace. Pictures of the fire are pret…", "url": "https://hackaday.com/2023/07/02/hackaday-links-july-2-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-07-02T23:00:00Z", "content": "Members of Pixelbar woke up to shocking news on Wednesday morning this week as they learned that a fire had destroyed the building housing their Rotterdam hackerspace. Pictures of the fire are pretty… [+5693 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Someone made iPhone wallpapers out of stunning James Webb images - BGR", "description": "Iconic James Webb images can now be used as iPhone wallpapers thanks to the photo editing work of one Redditor.", "url": "https://bgr.com/science/someone-made-iphone-wallpapers-out-of-stunning-james-webb-images/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/09/orion-nebula-james-webb-st.jpg?quality=82&strip=all", "publishedAt": "2023-07-02T22:18:00Z", "content": "Reddit user u/CalDogga1 has taken some of the most iconic images captured by the James Webb Space Telescope and turned them into iPhone wallpapers. If you haven’t followed the successful image drops … [+1546 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Cecilia Bogaard", "title": "Ancient Sea-Creature Helicoprion Had Terrifying Chainsaw-Like Teeth - Ancient Origins", "description": "Had you lived 270 million years ago, you may have thought twice before taking a dip in the ocean.", "url": "https://www.ancient-origins.net/weird-facts/helicoprion-0018740", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Helicoprion.jpg", "publishedAt": "2023-07-02T21:53:52Z", "content": "Had you lived 270 million years ago, you may have thought twice before taking a dip in the ocean. For one of the most terrifying prehistoric monsters from the underwater world was the owner of a set … [+2867 chars]"}, {"source": {"id": null, "name": "Ynetnews"}, "author": null, "title": "Tonga volcanic eruption triggers most intense electrical activity ever recorded - Ynetnews", "description": "Researchers say nearly 200,000 lightning flashes occurred within the volcanic plume, reaching a peak rate of over 2,600 flashes per minute", "url": "https://www.ynetnews.com/environment/article/bycmplykn", "urlToImage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2023/06/22/HJx2wjnZ003/HJx2wjnZ003_1_0_1300_731_0_large.jpg", "publishedAt": "2023-07-02T20:59:52Z", "content": "A new study found that last year's Hunga Tonga volcanic eruption sparked the most extreme array of electrical activity ever recorded, with a staggering 2,600 lightning flashes per minute, which is hu… [+5179 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvesting Water From Desert Air: MIT's Revolutionary Superabsorbent Hydrogel - SciTechDaily", "description": "A new material developed by MIT engineers exhibits “record-breaking” vapor absorption. MIT engineers have synthesized a superabsorbent material that can soak up a record amount of moisture from the air, even in desert-like conditions. As the material absorbs …", "url": "https://scitechdaily.com/harvesting-water-from-desert-air-mits-revolutionary-superabsorbent-hydrogel/", "urlToImage": "https://scitechdaily.com/images/Harvesting-Water-in-Desert-Concept.jpg", "publishedAt": "2023-07-02T19:06:10Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 2, 2023\r\nMIT engineers have synthesized a new superabsorbent hydrogel infused with lithium chloride that can absorb an unprecedented amount o… [+8234 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Preparing for Asteroid Bennu: NASA's OSIRIS-REx Astromaterials Lab Opens Doors to Media - SciTechDaily", "description": "Ahead of the first asteroid sample collected by the U.S. arriving on Earth in September, media are invited on Monday, July 24, to meet mission scientists and see NASA’s newly-built OSIRIS-REx Sample Curation Laboratory where the agency will study the sample a…", "url": "https://scitechdaily.com/preparing-for-asteroid-bennu-nasas-osiris-rex-astromaterials-lab-opens-doors-to-media/", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Spacecraft-Leaving-Bennu-Surface.gif", "publishedAt": "2023-07-02T16:35:57Z", "content": "NASAs OSIRIS-REx curation team rehearse the opening of the asteroid sample canister in the newly built OSIRIS-REx Curation lab at Johnson Space Center. Credit: NASA\r\nAhead of the first asteroid sampl… [+1195 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Rob Quinn", "title": "Scientists Discover Why Biting Flies Are Attracted to Blue - Newser", "description": "Daytime biting flies misclassify blue objects as animals", "url": "https://www.newser.com/story/337167/heres-why-biting-flies-like-blue.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1480025-12-20230702121959.jpeg", "publishedAt": "2023-07-02T15:15:00Z", "content": "Bluebirds, blue-tailed skinks, blue whales, and Babe the Big Blue Ox aside, blue animals are rare in nature, but biting flies still associate the color with food, researchers say. Lead researcher Rog… [+1601 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "Next Generation Gravitational Wave Detectors Could Pin Down Dark Matter - Universe Today", "description": "Gravitational astronomy is a relatively new discipline that has opened many doors for astronomers to understand how the huge and violent end of the scale works. It has been used to map out merging black holes and other extreme events throughout the universe. …", "url": "https://www.universetoday.com/162261/next-generation-gravitational-wave-detectors-could-pin-down-dark-matter/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/9895.jpg", "publishedAt": "2023-07-02T15:03:07Z", "content": "Gravitational astronomy is a relatively new discipline that has opened many doors for astronomers to understand how the huge and violent end of the scale works. It has been used to map out merging bl… [+4525 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Mars has liquid guts and strange insides, InSight suggests - Ars Technica", "description": "Wobbles in its rotation are difficult to explain without a liquid core.", "url": "https://arstechnica.com/science/2023/07/mars-has-liquid-guts-and-strange-insides-insight-suggests/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/PIA22743-760x380.png", "publishedAt": "2023-07-02T15:00:30Z", "content": "Enlarge/ Artist's view of what InSight looked like after landing.\r\n15 with \r\nMars appears to be a frozen expanse of red dust, gaping craters, and rocky terrain on the outsidebut what lies beneath its… [+4861 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "China tests Earth-based lab to recreate conditions in space - South China Morning Post", "description": "Various simulators have been built in Harbin to put equipment such as satellite components to the test before launch.", "url": "https://www.scmp.com/news/china/science/article/3226297/china-tests-earth-based-lab-recreate-conditions-space", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2023/07/02/280ac7f8-3f91-4c9d-8c00-1649f9c082ae_a400be45.jpg?itok=CyPRzzgH&v=1688311807", "publishedAt": "2023-07-02T15:00:17Z", "content": "Published: 11:00pm, 2 Jul, 2023\r\nUpdated: 11:30pm, 2 Jul, 2023"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Scientists unveil mystery behind Antarctica's blood falls - Interesting Engineering", "description": "\"What would happen if a Mars Rover landed in Antarctica? Would it be able to determine what was causing the Blood Falls to be red?\"", "url": "https://interestingengineering.com/science/scientific-breakthrough-unveils-the-mystery-behind-antarcticas-blood-falls", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/02/image/jpeg/AyFTTs2FoAqmyEyqpvWl4HJZ9wYt2Pj60VfHkH7J.jpg", "publishedAt": "2023-07-02T14:12:00Z", "content": "Scientists believe that exploring this unique environment and its resilient life forms could not just enhance our understanding of Earth but also offer insights into the search for extraterrestrial l… [+1536 chars]"}, {"source": {"id": null, "name": "Lost Coast Outpost"}, "author": "Barry Evans", "title": "GROWING OLD UNGRACEFULLY: It's the CO2, Stupid! (Earth's Good Fortune) - Lost Coast Outpost", "description": "Feeling\r\nlucky today? If you're up for a spot of geology, I hope to convince\r\nyou that you really are, you and the eight billion , along with\r\ncountless members of the other ten million or so other species, who\r\nmake a living here. It could have been so diffe…", "url": "https://lostcoastoutpost.com/2023/jul/2/growing-old-ungracefully-its-co2-stupid-earths-goo/", "urlToImage": "https://lostcoastoutpost.com/loco-media/cache/83/f1/83f1a08e705b6cebb3acb980af2d15a2.webp", "publishedAt": "2023-07-02T14:02:48Z", "content": "Feeling\r\nlucky today? If you’re up for a spot of geology, I hope to convince\r\nyou that you really are, you and the eight billion Homo\r\nsapiens, along with\r\ncountless members of the other ten million … [+3642 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Attempt to Explain Mars Rock With Hole Straight Through It - Futurism", "description": "Earlier this month, NASA's Perseverance Mars rover spotted a mysterious donut-shaped rock. Experts are divided on what it could be.", "url": "https://futurism.com/the-byte/scientists-mars-rock-hole-donut", "urlToImage": "https://wp-assets.futurism.com/2023/06/scientists-mars-rock-hole-donut.jpg", "publishedAt": "2023-07-02T13:22:09Z", "content": "What the hell could it be?\r\nDonut Know\r\nEarlier this month, NASA's Perseverance Mars rover spotted a mysterious donut-shaped rock in the distance during a trip across the delta of the planet's Jezero… [+2512 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Our Solar System May Be Hiding an Extra Planet, Scientists Say - Yahoo Money", "description": "Rogue Oort For over a century, researchers have been puzzled by strange gravitational forces pulling on the orbits of Neptune and Uranus in the far reaches...", "url": "https://futurism.com/the-byte/solar-system-extra-planet", "urlToImage": "https://media.zenfs.com/en/futurism_981/2917e102989b014a52011a03a13d41bc", "publishedAt": "2023-07-02T13:18:50Z", "content": "Rogue One\r\nFor over a century, researchers have been puzzled by strange gravitational forces seemingly pulling on the orbits of Neptune and Uranus in the distant reaches of our solar system.\r\nWhile s… [+1963 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Research", "title": "How did dinosaurs get so big? Scientists now have the answer - Study Finds", "description": "Researchers explain that the air sac structures in the ancient dinosaur Macrocollum itaquii are the key to understanding the evolution of dinosaurs.", "url": "https://studyfinds.org/how-did-dinosaurs-get-so-big/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2022/06/king-of-the-big-839668-scaled.jpg", "publishedAt": "2023-07-02T13:00:48Z", "content": "SÃO PAULO, Brazil — How did dinosaurs go from small creatures to colossal giants? Researchers at the State University of Campinas (UNICAMP) in São Paulo State in Brazil believe they finally have the … [+3868 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Next Pandemic? New Study Reveals How the Recent Animal-Origin Virus Enters Human Cells - SciTechDaily", "description": "Scientists have illuminated the process by which a highly infectious virus, recently transmitted from animals to humans, gains entry into human cells. Dr. Ariel Isaacs and Dr. Yu Shang Low, from The University of Queensland, have successfully revealed the str…", "url": "https://scitechdaily.com/the-next-pandemic-new-study-reveals-how-the-recent-animal-origin-virus-enters-human-cells/", "urlToImage": "https://scitechdaily.com/images/Langya-Virus-Illustration-scaled.jpg", "publishedAt": "2023-07-02T11:36:01Z", "content": "ByUniversity of QueenslandJuly 2, 2023\r\nResearchers have revealed the structure of the fusion protein of the Langya virus, an infectious disease that jumped from animals to humans, using advanced mic… [+2954 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lonely Clouds and Dark Tendrils: Hubble Observes Strange Galactic Neighbor - SciTechDaily", "description": "The Hubble Space Telescope has taken a detailed image of the irregular galaxy ESO 174-1, 11 million light-years away. The image is part of a program to study all known galaxies within 32 million light-years, strategically using the telescope's downtime for ob…", "url": "https://scitechdaily.com/lonely-clouds-and-dark-tendrils-hubble-observes-strange-galactic-neighbor/", "urlToImage": "https://scitechdaily.com/images/Galaxy-ESO-174-1-scaled.jpg", "publishedAt": "2023-07-02T10:25:56Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Artemis 2 astronaut Jeremy Hansen says a Canadian will walk on the moon one day - Space.com", "description": "'American leadership makes space for a country like Canada to shine, and bring our genius.'", "url": "https://www.space.com/artemis-2-jeremy-hansen-canada-on-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XX6vVfa8sKLrHPSFCwf7Me-1200-80.png", "publishedAt": "2023-07-02T10:00:23Z", "content": "Canada's Artemis 2 astronaut says his country is just getting started in lunar realms with his round-the-moon mission.\r\nJeremy Hansen was named Canada's representative on Artemis 2 on April 3, and wi… [+5742 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "The most spectacular images of Venus ever captured - Mashable", "description": "See Earth's 'evil twin' planet in a different light.", "url": "https://mashable.com/article/best-venus-images", "urlToImage": "https://helios-i.mashable.com/imagery/articles/06d7iljJ8Lol1BF2zNq2iNf/hero-image.fill.size_1200x675.v1687895416.jpg", "publishedAt": "2023-07-02T10:00:00Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Is There Really No Sound In Space? - IFLScience", "description": "Is there any truth to the line \"in space no one can hear you scream\"?", "url": "https://www.iflscience.com/is-there-really-no-sound-in-space-69612", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69612/aImg/68967/sound-in-space-meta.png", "publishedAt": "2023-07-02T09:10:08Z", "content": "This article first appeared in Issue 9 of our free digital magazine CURIOUS. \r\nTo quote Edwin Hubble, \"Equipped with his five senses, man explores the universe around him and calls the adventure Scie… [+9694 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Meg Duff", "title": "Do the Pacific Ocean and the Atlantic Ocean mix? - Livescience.com", "description": "Photos show what looks like a line between the Atlantic and Pacific with different water colors on either side, but is there some kind of barrier or do the two oceans mix?", "url": "https://www.livescience.com/planet-earth/rivers-oceans/do-the-pacific-ocean-and-the-atlantic-ocean-mix", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Zd4G6jSKXjfXfzojgN7jWE-1200-80.jpg", "publishedAt": "2023-07-02T09:00:00Z", "content": "A handful of videos on YouTube and TikTok have been racking up likes by showing a strange line in the ocean, with dark water on one side and light water on the other. \r\nLines like this often appear w… [+4894 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Wion", "title": "NASA unveils the trajectory of five asteroids approaching Earth - WION", "description": "NASA unveils the trajectory of five asteroids approaching Earth", "url": "https://www.wionews.com/photos/nasa-unveils-the-trajectory-of-five-asteroids-approaching-earth-610988", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/07/02/363791-untitled-design-4.png", "publishedAt": "2023-07-02T08:07:25Z", "content": "| Updated: Jul 02, 2023, 01:37 PM IST\r\nIn recent times, a notable number of asteroids have made their close passes by Earth, with two of them occurring just yesterday. And now, NASA has revealed that… [+1275 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Insights Into Human Evolution: The Unique Role of Our Foot's Spring-Like Arch - SciTechDaily", "description": "Scientists have discovered that the flexible arch of the human foot may have played a crucial role in our ability to run and walk upright. A recent research study suggests that the evolution of a spring-like arch in humans may have been crucial for bipedal wa…", "url": "https://scitechdaily.com/new-insights-into-human-evolution-the-unique-role-of-our-foots-spring-like-arch/", "urlToImage": "https://scitechdaily.com/images/Human-Evolution-Concept.jpg", "publishedAt": "2023-07-02T08:01:28Z", "content": "A recent study suggests that humans unique foot arch evolved to improve bipedal walking and running by acting as a spring, recoiling to reposition the ankle upright for efficient propulsion. This dis… [+4921 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Ancient human ancestors actually did live with dinosaurs, according to stunning new research - Earth.com", "description": "Placental mammals, a group that includes our human ancestors, survived the asteroid impact that killed the dinosaurs.", "url": "https://www.earth.com/news/human-ancestors-coexisted-with-dinosaurs-yes-according-to-shocking-new-research/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/01160327/dinosaurs_mammal_beach_2medium-1000x625.jpg", "publishedAt": "2023-07-02T07:00:00Z", "content": "An astonishing new study concludes that human ancestors survived the asteroid impact that killed the dinosaurs. This fact, and other new insights into the timeline of animal evolution, are rocking th… [+7237 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Niharika Singh, Niharika Singh", "title": "MIT Unveils Revolutionary AI Tool: Enhancing Chart Interpretation and Accessibility with Adaptive, Detail-Rich Captions for Users of All Abilities - MarkTechPost", "description": "In a significant step towards enhancing accessibility and comprehension of complex charts and graphs, a team of researchers from MIT has created a groundbreaking dataset called VisText. The dataset aims to revolutionize automatic chart captioning systems by t…", "url": "https://www.marktechpost.com/2023/07/01/mit-unveils-revolutionary-ai-tool-enhancing-chart-interpretation-and-accessibility-with-adaptive-detail-rich-captions-for-users-of-all-abilities/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/07/Screenshot-2023-07-01-at-10.24.44-PM.png", "publishedAt": "2023-07-02T06:01:00Z", "content": "In a significant step towards enhancing accessibility and comprehension of complex charts and graphs, a team of researchers from MIT has created a groundbreaking dataset called VisText. The dataset a… [+4740 chars]"}]}