{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "With Falcon 9 grounded, SpaceX test-fires booster for next Starship flight - Ars Technica", "description": "SpaceX says a liquid oxygen leak caused the failure of a Falcon 9 launch last week.", "url": "https://arstechnica.com/space/2024/07/with-falcon-9-grounded-spacex-test-fires-booster-for-next-starship-flight/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/07/booster12-fire-760x380.jpg", "publishedAt": "2024-07-15T22:44:48Z", "content": "Enlarge/ A drone shot looking down on SpaceX's Super Heavy booster during a test-firing of its 33 Raptor engines Monday. \r\n25\r\nIt's unclear yet how long SpaceX's workhorse Falcon 9 rocket will remain… [+3402 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Have You Seen This? NASA releases new images from James Webb Space Telescope - KSL.com", "description": "The James Webb Space Telescope released photographs Friday depicting two merging galaxies, collectively known as Arp 142 and nicknamed", "url": "https://www.ksl.com/article/51069275/have-you-seen-this-nasa-releases-new-images-from-james-webb-space-telescope", "urlToImage": "https://img.ksl.com/slc/2999/299995/29999594.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2024-07-15T21:32:19Z", "content": "SPACE NASA's James Webb Space Telescope continues to dazzle scientists and the public alike with stunning images of space.\r\nOn Friday, the agency released a handful of pictures to commemorate two yea… [+937 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "Booster 12 static fires at Pad A and Pad B tower stacking underway - NASASpaceflight.com", "description": "After Hurricane Beryl passed the Brownsville area without seriously damaging Starbase, preparations for Starship Flight…", "url": "https://www.nasaspaceflight.com/2024/07/booster-12-static-fires-pad-a-b-tower-stacking/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/07/NSF-2024-07-15-21-44-26-861.jpg", "publishedAt": "2024-07-15T20:52:46Z", "content": "7After Hurricane Beryl passed the Brownsville area without seriously damaging Starbase, preparations for Starship Flight 5 have been advanced to a new level with the rollout of Booster 12 to the Orbi… [+7847 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Predator Unearthed in Nevada Rewrites Triassic Coastal Life Story - SciTechDaily", "description": "A newly discovered Triassic crocodile relative demonstrates that pseudosuchian archosaurs inhabited global coastal areas, significantly enriching our understanding of Mesozoic marine ecosystems. Researchers have discovered a new species of extinct crocodile r…", "url": "https://scitechdaily.com/ancient-predator-unearthed-in-nevada-rewrites-triassic-coastal-life-story/", "urlToImage": "https://scitechdaily.com/images/Benggwigwishingasuchus-eremicarminis-Artwork-scaled.jpg", "publishedAt": "2024-07-15T20:51:23Z", "content": "Benggwigwishingasuchus eremicarminis on the Panthalassan Ocean coast. Credit: Jorge Gonzalez\r\nA newly discovered Triassic crocodile relative demonstrates that pseudosuchian archosaurs inhabited globa… [+5801 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": null, "title": "Here's what's (probably) on the other side of a black hole - BBC Science Focus", "description": "A new theory about what happens when black holes die could solve one of the biggest mysteries in physics.", "url": "https://www.sciencefocus.com/space/whats-on-the-other-side-of-a-black-hole", "urlToImage": "https://c02.purpledshub.com/uploads/sites/41/2024/07/White-hole.jpg?w=1200", "publishedAt": "2024-07-15T20:35:10Z", "content": "Perhaps the most surprising scientific discovery of the last decade is that the Universe is teeming with black holes.\r\nTheyve been detected in a surprising variety of sizes: some with masses only a b… [+8956 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Earth system scientists discover missing piece in climate models - Phys.org", "description": "As the planet continues to warm due to human-driven climate change, accurate computer climate models will be key in helping illuminate exactly how the climate will continue to be altered in the years ahead.", "url": "https://phys.org/news/2024-07-earth-scientists-piece-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/earth-system-scientist.jpg", "publishedAt": "2024-07-15T20:16:43Z", "content": "As the planet continues to warm due to human-driven climate change, accurate computer climate models will be key in helping illuminate exactly how the climate will continue to be altered in the years… [+3589 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Perseverance Rover Spots an Unusual Rock in Ancient River Channel (Mars Report) - NASA Jet Propulsion Laboratory", "description": "As NASA’s Perseverance rover prepares to ascend to the rim of Jezero Crater, its team is investigating a rock unlike any that they’ve seen so far on Mars. De...", "url": "https://www.youtube.com/watch?v=TZm846OJxSA", "urlToImage": "https://i.ytimg.com/vi/TZm846OJxSA/maxresdefault.jpg", "publishedAt": "2024-07-15T20:11:36Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "A comet predicted to light up the sky in 2024 may already be doomed - Space.com", "description": "While some comet experts think Comet Tsunchinchan-ATLAS (C/2023 A3) will \"soon be no longer,\" others think it's doing just fine.", "url": "https://www.space.com/comet-c2023-a3-tsuchinshan-atlas-break-up", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JajBxaFNTpG3XfeeX9AfCF-1200-80.jpg", "publishedAt": "2024-07-15T20:11:35Z", "content": "In recent months there has been a gradual build-up of excitement regarding the approach of a new comet with the moniker, Tsuchinshan-ATLAS, cataloged officially as C/2023 A3. \r\nComet Tsuchinchan-ATLA… [+9576 chars]"}, {"source": {"id": null, "name": "Greater Baton Rouge Business Report"}, "author": "Business Report Staff", "title": "An LSU webinar will share CO2 research focused on Lake Maurepas - Greater Baton Rouge Business Report", "description": "An upcoming webinar hosted by LSU will offer insight into ongoing research into the potential risks and benefits of CO2 storage in Louisiana’s geological formations, with a focus on Lake Maurepas. The LSU Institute for Energy Innovation will review progress o…", "url": "https://www.businessreport.com/industry/lsu-webinar-will-share-co2-research-focused-on-lake-maurepas", "urlToImage": null, "publishedAt": "2024-07-15T19:44:25Z", "content": "An upcoming webinar hosted by LSU will offer insight into ongoing research into the potential risks and benefits of CO2 storage in Louisianas geological formations, with a focus on Lake Maurepas.\r\nTh… [+1203 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Paddison", "title": "Melting polar ice is changing the way the Earth spins and making days longer, study shows - CNN", "description": "The impacts of human-caused climate change are so overwhelming they’re actually messing with time, according to new research.", "url": "https://www.cnn.com/2024/07/15/climate/polar-ice-melting-day-length-time/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-129381655.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-07-15T19:30:00Z", "content": "The impacts of human-caused climate change are so overwhelming theyre actually messing with time, according to new research.\r\nPolar ice melt caused by global warming is changing the speed ofEarths ro… [+5849 chars]"}, {"source": {"id": null, "name": "KXAN.com"}, "author": "Eric Henrikson", "title": "Meteor shower over Austin – How to see the Perseids in 2024 - KXAN.com", "description": "One of the best meteor showers of the year has arrived. The Perseid meteor shower runs July 17 through August 24, peaking on August 11 and August 12.", "url": "https://www.kxan.com/news/science/meteor-shower-over-austin-how-to-see-the-perseids-in-2024/", "urlToImage": "https://www.kxan.com/wp-content/uploads/sites/40/2020/08/FINAL_10-1.jpg?w=1280", "publishedAt": "2024-07-15T17:32:58Z", "content": "AUSTIN (KXAN) — One of the best meteor showers of the year has arrived. The Perseid meteor shower runs July 17 through Aug. 24, peaking on Aug. 11 and Aug. 12.\r\nDuring the meteor shower’s peak, up to… [+1489 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Webb unveils stunning ejecta and CO structures in Cassiopeia A's young supernova - Phys.org", "description": "The SETI Institute announced the latest findings from the James Webb Space Telescope (JWST) of the supernova remnant, Cassiopeia A (Cas A). These observations of the youngest known core collapse supernova in the Milky Way provide insights into the conditions …", "url": "https://phys.org/news/2024-07-webb-unveils-stunning-ejecta-cassiopeia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/jwst-unveils-stunning.jpg", "publishedAt": "2024-07-15T17:25:04Z", "content": "The SETI Institute announced the latest findings from the James Webb Space Telescope (JWST) of the supernova remnant, Cassiopeia A (Cas A). These observations of the youngest known core collapse supe… [+5324 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Mysterious Glowing Orbs Spotted from the ISS Look Like Alien Spaceships - Gizmodo", "description": "The rare atmospheric phenomenon was powered by thunderstorms off the coast of South Africa.", "url": "https://gizmodo.com/glowing-orbs-spotted-from-the-iss-are-like-alien-spaceships-2000473371", "urlToImage": "https://gizmodo.com/app/uploads/2024/07/iss071e170351.jpg-e1721062799994.webp", "publishedAt": "2024-07-15T17:05:07Z", "content": "A NASA astronaut snapped a photo of glowing features illuminating Earth’s upper atmosphere. Though it may appear as an alien invasion threatening our planet, the blue orbs are the result of an optica… [+2075 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How a Twist in Physics Could Change Technology Forever - SciTechDaily", "description": "Physicists at the University of Konstanz have discovered a way to imprint a previously unseen geometrical form of chirality onto electrons using laser light, creating chiral coils of mass and charge. This breakthrough in manipulating electron chirality has va…", "url": "https://scitechdaily.com/how-a-twist-in-physics-could-change-technology-forever/", "urlToImage": "https://scitechdaily.com/images/Shaping-Electrons-Into-Chiral-Coils-of-Mass-and-Charge-Schematic-Representation.jpg", "publishedAt": "2024-07-15T16:11:43Z", "content": "Schematic representation of the experimental setup used to shape electrons into chiral coils of mass and charge. Credit: Dr. Yiqi Fang, University of Konstanz, edited\r\nPhysicists at the University of… [+7544 chars]"}, {"source": {"id": null, "name": "Artofmanliness.com"}, "author": "Brett & Kate McKay", "title": "Podcast #1,006: Stop Drowning in Tedious Tasks by Taming Your Life Admin - Art of Manliness", "description": "Filling out paperwork. Making travel reservations. Paying bills. Shopping for groceries. Returning packages. These are all examples of life admin — the little tasks we have to do to keep our lives moving along. Life admin is typically pretty tedious and annoy…", "url": "https://www.artofmanliness.com/lifestyle/homeownership/podcast-1006-stop-drowning-in-tedious-tasks-by-taming-your-life-admin/", "urlToImage": "https://content.artofmanliness.com/uploads/2024/07/manage-life-1.jpg", "publishedAt": "2024-07-15T15:57:39Z", "content": "Filling out paperwork. Making travel reservations. Paying bills. Shopping for groceries. Returning packages.\r\nThese are all examples of life admin the little tasks we have to do to keep our lives mov… [+1246 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Moon cave discovered that could one day house humans - BBC.com", "description": "It is the first cave to be discovered on the Moon and could protect astronauts from radiation.", "url": "https://www.bbc.com/news/articles/ce784r9njz0o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/f588/live/1bc5b1c0-42a6-11ef-b83f-157e38fc9c03.jpg", "publishedAt": "2024-07-15T15:21:58Z", "content": "By Georgina Rannard, Science reporter\r\nScientists have for the first time discovered a cave on the Moon.\r\nAt least 100m deep, it could be an ideal place for humans to build a permanent base, they say… [+3421 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": null, "title": "NASA's Webb Investigates Eternal Sunrises, Sunsets on Distant World - WebbTelescope.org", "description": "", "url": "https://webbtelescope.org/contents/news-releases/2024/news-2024-129", "urlToImage": "//stsci-opo.org/STScI-01J2F1BF7R30SS12NJ8C949NT8.png", "publishedAt": "2024-07-15T15:00:00Z", "content": "Researchers using NASA’s James Webb Space Telescope have finally confirmed what models have previously predicted: An exoplanet has differences between its eternal morning and eternal evening atmosphe… [+5514 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Sun unleashes powerful X-class solar flare triggering radio blackouts over Australia, Southeast Asia and Japan (video) - Space.com", "description": "The explosive action was captured by NASA's Solar Dynamics Observatory.", "url": "https://www.space.com/x-class-solar-flare-eruption-july-13-14-sun-activity-radio-blackouts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TxAN2w6pAXN9ieeQq7ZFVf-1200-80.jpg", "publishedAt": "2024-07-15T14:39:26Z", "content": "Just as we were beginning to think \"The sun has been rather quiet of late,\" it silences the critics with an explosive X-class flare, the most powerful class of solar flare. \r\nThe solar flare\r\n from s… [+3177 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Newly discovered dinosaur species is only green fossil ever found, to be displayed in LA - Fox News", "description": "A newly discovered sauropod species is going on display in the Natural History Museum in Los Angeles. Its fossilized skeleton is the only one found on the planet whose bones are green.", "url": "https://www.foxnews.com/science/newly-discovered-dinosaur-species-only-green-fossil-ever-found-displayed-la", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/07/California-Green-Dinosaur-construction.jpg", "publishedAt": "2024-07-15T14:19:00Z", "content": "<ul><li>A newly discovered sauropod species is going on display in the Natural History Museum in Los Angeles. Its fossilized skeleton is the only one found on the planet whose bones are green, accord… [+3258 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Can the James Webb Space Telescope see galaxies over the universe's horizon? - Space.com", "description": "How can any telescope see a galaxy 33.8 billion light-years away in a universe that is only 13.8 billion years old?", "url": "https://www.space.com/james-webb-space-telescope-universe-expansion-photon-horizon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/98KJ88vrZ9fQxE65VjZrTc-1200-80.png", "publishedAt": "2024-07-15T14:00:15Z", "content": "Since it began sending data back to Earth in 2022, the James Webb Space Telescope (JWST) has greatly impacted astronomy, and one of its most revolutionary achievements is the observation of some of t… [+9317 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New low-mass galaxy discovered - Phys.org", "description": "Astronomers report the discovery of a new galaxy in the constellation Corvus. The newfound galaxy, which received designation Corvus A, has a relatively low mass, is gas-rich and isolated. The discovery was presented in a research paper published July 3 on th…", "url": "https://phys.org/news/2024-07-mass-galaxy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-low-mass-galaxy-di.jpg", "publishedAt": "2024-07-15T13:17:48Z", "content": "Astronomers report the discovery of a new galaxy in the constellation Corvus. The newfound galaxy, which received designation Corvus A, has a relatively low mass, is gas-rich and isolated. The discov… [+3242 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Sven Bilén", "title": "Could people turn Mars into another Earth? Here’s what it would take to transform its barren landscape into a life-friendly world - The Conversation", "description": "Liquid water, breathable air and a sustainable food supply are three of the essentials Mars would need for people to live comfortably there.", "url": "https://theconversation.com/could-people-turn-mars-into-another-earth-heres-what-it-would-take-to-transform-its-barren-landscape-into-a-life-friendly-world-229470", "urlToImage": "https://images.theconversation.com/files/602336/original/file-20240621-19-p5n8pz.jpg?ixlib=rb-4.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-07-15T12:26:06Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to curiouskidsus@theconversation.com.\r\nIs it possible that one day we could make Mars … [+6874 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Evidence of water found in atmosphere of mysterious 'metal god of war' exoplanet - Space.com", "description": "Named for the Gaelic god of war, Smertrios has a composition and density that are a challenge to planet formation models.", "url": "https://www.space.com/exoplanet-water-atmosphere-metal-smertrios", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2r8sxnu3yLHYQsb8ejn9GF-1200-80.png", "publishedAt": "2024-07-15T12:00:01Z", "content": "Astronomers may have discovered the presence of water in the atmosphere of a blisteringly hot planet that is also one of the most \"metal\" worlds ever spotted. The planet's formation remains a mystery… [+7033 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Ian Whittaker", "title": "Astronauts are stuck on the International Space Station after yet more problems with Boeing’s beleaguered Starliner - The Conversation", "description": "The spacecraft’s return has been delayed while experts study helium leaks and thruster problems.", "url": "https://theconversation.com/astronauts-are-stuck-on-the-international-space-station-after-yet-more-problems-with-boeings-beleaguered-starliner-234409", "urlToImage": "https://images.theconversation.com/files/606326/original/file-20240711-17-qi2b7i.jpg?ixlib=rb-4.1.0&rect=0%2C198%2C1437%2C717&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-07-15T11:40:50Z", "content": "For the past few weeks, Nasa astronauts Butch Wilmore and Suni Williams have been stuck on the International Space Station (ISS) after the first crewed voyage of Boeings new Starliner spacecraft hit … [+4843 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "mlive.com"}, "author": "Jack Wojczynski | jwojczynski@mlive.com", "title": "Mystery on the moon: NASA sending rover to investigate ‘lunar swirls’ - MLive.com", "description": "These lunar swirls are big enough to be seen from Earth!", "url": "https://www.mlive.com/weather/2024/07/mystery-on-the-moon-nasa-sending-rover-to-investigate-lunar-swirls.html", "urlToImage": "https://www.mlive.com/resizer/v2/WSV73X7P4BBZBKNJZRSDHXEEUA.jpg?auth=761389c16d21161e055184e6b61dd9496893b479f3d296444f4b2782b111ed37&width=1280&quality=90", "publishedAt": "2024-07-15T11:11:00Z", "content": "An interesting phenomenon on the moon that has perplexed scientists may have a fresh explanation, according to a new study.\r\nIn new images released by NASA, so-called lunar swirls can be seen on the … [+1530 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert Staff", "title": "The Mystery of How Big Animal Brains Should Grow May Finally Be Solved - ScienceAlert", "description": "The idea that animals' brain mass and body mass are correlated makes intuitive sense: larger animals, after all, tend to have larger brains than their smaller cousins.", "url": "https://www.sciencealert.com/the-mystery-of-how-big-animal-brains-should-grow-may-finally-be-solved", "urlToImage": "https://www.sciencealert.com/images/2024/07/beluga_whale_child.jpg", "publishedAt": "2024-07-15T11:01:27Z", "content": "The idea that animals' brain mass and body mass are correlated makes intuitive sense: larger animals, after all, tend to have larger brains than their smaller cousins.\r\nHowever, it's proven difficult… [+3617 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Richard Pallardy", "title": "Pair of dog-size dinosaurs likely crushed to death in underground burrow collapse - Livescience.com", "description": "New species of dinosaur discovered in Utah may have lived underground, with near-complete fossils indicating they died in burrows.", "url": "https://www.livescience.com/animals/dinosaurs/pair-of-dog-size-dinosaurs-likely-crushed-to-death-in-underground-burrow-collapse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BCpTbymgqLRUGiYS7h9Zve-1200-80.jpg", "publishedAt": "2024-07-15T10:48:50Z", "content": "Researchers have discovered a never-before-seen species of dinosaur that may have lived underground in burrows. The new find demonstrates the versatility of these extinct reptiles in exploiting ecolo… [+3052 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Juice’s lunar-Earth flyby: all you need to know - European Space Agency", "description": "ESA’s Jupiter Icy Moons Explorer (Juice) will return to Earth on 19–20 August, with flight controllers guiding the spacecraft first past the Moon and then past Earth itself. This ‘braking’ manoeuvre will take Juice on a shortcut to Jupiter via Venus.", "url": "https://www.esa.int/About_Us/ESAC/Juice_s_lunar-Earth_flyby_all_you_need_to_know", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/07/juice_flies_by_earth/26229439-1-eng-GB/Juice_flies_by_Earth_pillars.png", "publishedAt": "2024-07-15T09:23:16Z", "content": "Agency15/07/2024207 views1 likes\r\nESAs Jupiter Icy Moons Explorer (Juice) will return to Earth on 1920 August, with flight controllers guiding the spacecraft first past the Moon and then past Earth i… [+5013 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ashley Hamer", "title": "What would happen if a black hole wandered into our solar system? - Livescience.com", "description": "Black holes aren't \"cosmic vacuum cleaners,\" but what would happen if one wandered into our solar system?", "url": "https://www.livescience.com/space/black-holes/what-would-happen-if-a-black-hole-wandered-into-our-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DDvy89CzEH3pLHBqNyBJyR-1200-80.jpg", "publishedAt": "2024-07-15T09:00:00Z", "content": "Black holes are massive, mostly invisible and so powerful not even light can escape them. So what would happen if one entered our solar system\r\n?\r\nIt depends on a lot of factors, including the size a… [+5103 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Earth from space: Gravity waves spark pair of perfect cloud ripples above uninhabited islands - Livescience.com", "description": "This 2023 astronaut photo shows a pair of perfectly aligned \"wave clouds\" rippling above the Crozet Islands in the Southern Ocean. The unusual patterns are the result of changes in temperature caused by gravity waves.", "url": "https://www.livescience.com/planet-earth/weather/earth-from-space-gravity-waves-spark-pair-of-perfect-cloud-ripples-above-uninhabited-islands", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6QkQ7zshxCryZVGd35nxQg-1200-80.jpg", "publishedAt": "2024-07-15T07:00:00Z", "content": "Where is it? The Crozet Islands in the Southern Ocean. [-46.41255591, 51.99872352].\r\nWhat's in the photo? A pair of wave clouds formed by island mountains.\r\nWho took the photo? An unnamed astronaut o… [+2985 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESCAPADE on schedule for launch this fall - SpaceNews", "description": "A NASA smallsat mission to Mars remains on track to launch this fall, although without a specific launch date yet.", "url": "https://spacenews.com/escapade-on-schedule-for-launch-this-fall/", "urlToImage": "https://spacenews.com/wp-content/uploads/2024/07/escapade-bluegold.jpg", "publishedAt": "2024-07-15T05:09:52Z", "content": "BUSAN, South Korea A NASA smallsat mission to Mars remains on track to launch this fall, although without a specific launch date yet.\r\nIn a presentation at the Committee on Space Research (COSPAR) 45… [+2903 chars]"}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "'Meatball' milestone: NASA's original logo still soars after 65 years - collectSPACE.com", "description": "One of the world's best known -- and certainly most-traveled -- logos is 65 years old. Since its announcement on July 15, 1959, the NASA insignia has adorned t-shirts and spacesuits, been reproduced 10 stories tall and reached the moon and Mars.", "url": "http://www.collectspace.com/news/news-071524a-nasa-insignia-logo-meatball-65-years.html", "urlToImage": "http://www.collectspace.com/images/news-071524a-fb.jpg", "publishedAt": "2024-07-15T05:00:36Z", "content": "July 15, 2024\r\n — One of the world's best known — and certainly most-traveled — logos is 65 years old.\r\nSince its announcement on July 15, 1959, the insignia representing NASA, or the National Aerona… [+4440 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Lasers Could Solve the World’s Plastic Problem - SciTechDaily", "description": "A team has created a laser technique to break down tough plastics into valuable components, offering a new, sustainable approach to tackling global plastic pollution. A global research team, led by Texas Engineers, has developed a laser-based method to decomp…", "url": "https://scitechdaily.com/how-lasers-could-solve-the-worlds-plastic-problem/", "urlToImage": "https://scitechdaily.com/images/A-Series-of-Mirrors-and-Prisms.jpg", "publishedAt": "2024-07-15T04:01:30Z", "content": "A series of mirrors and prisms deflect lasers and focus them to perform the reaction. Credit: The University of Texas at Austin\r\nA team has created a laser technique to break down tough plastics into… [+4707 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Scientists find a molecule never before found outside our solar system on a planet with glass rain - KSL.com", "description": "An exoplanet the size of Jupiter has long intrigued astronomers because of its scorching temperatures, screaming winds and sideways rain made of glass. Now, data from the James Webb Space Telescope has revealed another intriguing feature of the planet known a…", "url": "https://www.ksl.com/article/51063328/scientists-find-a-molecule-never-before-found-outside-our-solar-system-on-a-planet-with-glass-rain", "urlToImage": "https://img.ksl.com/slc/2998/299874/29987431.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2024-07-15T03:54:56Z", "content": "ATLANTA An exoplanet the size of Jupiter has long intrigued astronomers because of its scorching temperatures, screaming winds and sideways rain made of glass. Now, data from the James Webb Space Tel… [+5195 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Big boost for new epigenetics paradigm: CoRSIVs, first discovered in humans, now found in cattle - Phys.org", "description": "A study published in Genome Biology opens new possibilities to improve production efficiency in the cattle industry and potentially animal agriculture more broadly. A team of researchers at Baylor College of Medicine, Cornell University and the USDA discovere…", "url": "https://phys.org/news/2024-07-big-boost-epigenetics-paradigm-corsivs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/dairycattle.jpg", "publishedAt": "2024-07-15T00:00:01Z", "content": "A study published in Genome Biology opens new possibilities to improve production efficiency in the cattle industry and potentially animal agriculture more broadly. A team of researchers at Baylor Co… [+4979 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Revelations: Unveiling New Layers of the Higgs Boson - SciTechDaily", "description": "New research confirms the Standard Model's predictions about the Higgs boson while suggesting future data may reveal unknown aspects of particle physics. The Higgs boson was discovered in the detectors of the Large Hadron Collider a dozen or so years ago. It …", "url": "https://scitechdaily.com/quantum-revelations-unveiling-new-layers-of-the-higgs-boson/", "urlToImage": "https://scitechdaily.com/images/Particle-Accelerator-Physics-Concept.jpg", "publishedAt": "2024-07-14T22:23:33Z", "content": "ByThe Henryk Niewodniczanski Institute of Nuclear Physics Polish Academy of SciencesJuly 14, 2024Recent theoretical advancements have enhanced the understanding of the Higgs boson’s properties, focus… [+7784 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Researchers End One-year Mars Habitat Mission - VOA Learning English", "description": "Four scientists have left a model Mars environment where they lived in isolation for more than a year. The project is designed to help NASA planners better understand how living on another world could affect human health and performance.", "url": "https://learningenglish.voanews.com/a/nasa-researchers-end-one-year-mars-habitat-mission/7694318.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-d4e4-08dca1eef65a_cx0_cy2_cw0_w1200_r1.jpg", "publishedAt": "2024-07-14T22:05:00Z", "content": "Four scientists have left a model Mars environment where they lived in isolation for more than a year.\r\nThe crew took part in the experiment for the American space agency NASA. Team members included … [+4346 chars]"}, {"source": {"id": null, "name": "Foxweather.com"}, "author": "Emilee Speck", "title": "China planning asteroid re-direct mission for planetary defense test - Fox Weather ", "description": "After NASA's successful planetary defense test in 2022, China’s space agency plans to launch a spacecraft designed to redirect a near-Earth asteroid by 2030.", "url": "https://www.foxweather.com/earth-space/china-asteroid-re-direct-mission-nasa-dart", "urlToImage": "https://images.foxweather.com/static.foxweather.com/www.foxweather.com/content/uploads/2022/10/1024/512/noirlab2223a.jpeg?ve=1&tl=1", "publishedAt": "2024-07-14T20:39:00Z", "content": "After NASA's successful planetary defense test in 2022, China’s space agency plans to launch a spacecraft designed to redirect a near-Earth asteroid by 2030.\r\nIn a recent paper, China’s National Spac… [+1409 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Thousands of worlds do not fit the definition of a 'planet' - Earth.com", "description": "The IAU's planet definition, requiring sun orbit, spherical shape, and orbital clearance, is under scrutiny for excluding exoplanets.", "url": "https://www.earth.com/news/thousands-of-worlds-do-not-fit-the-definition-of-a-planet/", "urlToImage": "https://cff2.earth.com/uploads/2024/07/14132936/Planets-definition.jpg", "publishedAt": "2024-07-14T19:30:44Z", "content": "In the ever-evolving universe of astronomy, the definitions of planets sometimes have to catch up with new discoveries and understandings. \r\nThe term “planet,” as defined by the International Astrono… [+4304 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Satellites could be put to work tracking ocean trash - The Washington Post", "description": "Even satellites that haven’t been designed to detect floating trash could be useful in the battle against a rising tide of ocean pollution, researchers say.", "url": "https://www.washingtonpost.com/science/2024/07/14/satellites-ocean-trash-plastic/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MKCRXBT4SQI6XDC6GLSHWQVVDM.jpg&w=1440", "publishedAt": "2024-07-14T17:30:39Z", "content": "Satellites can now track ocean garbage from space, marking a potential game changer for tracking the vexing problem of marine litter, new research suggests.\r\nThe study, published in Nature Communicat… [+2318 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "1.4 Million-Year-Old Human Activity Unearthed at Orce’s Quicksand Trap - SciTechDaily", "description": "Located at Fuente Nueva-3, this Early Pleistocene archaeological site hosts some of the oldest traces of human habitation in Western Europe. Researchers at the University of Malaga have revealed, in an unprecedented manner, that the Early Pleistocene archaeol…", "url": "https://scitechdaily.com/1-4-million-year-old-human-activity-unearthed-at-orces-quicksand-trap/", "urlToImage": "https://scitechdaily.com/images/Elephant-Graveyard-Quicksand.jpg", "publishedAt": "2024-07-14T15:16:49Z", "content": "Research from the University of Malaga reveals that the Orce archaeological site functioned as a natural trap for large mammals during the Early Pleistocene, marking a significant site for human acti… [+5132 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sarah A. Spitzer", "title": "Scientists call the region of space influenced by the sun the heliosphere – but without an interstellar probe, they don't know much about its shape - Space.com", "description": "The sun is the star of the show.", "url": "https://www.space.com/heliosphere-shape-remains-mystery-without-scientific-probe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gzurBvmsVfsxFaMYZbvArR-1200-80.jpg", "publishedAt": "2024-07-14T15:00:01Z", "content": "This article was originally published at The Conversation. The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights.\r\nSarah Spitzer is a research fellow in Climate a… [+8543 chars]"}, {"source": {"id": null, "name": "Dailykos.com"}, "author": null, "title": "Thwaites Glacier gets a 'daily bath of warm water' melting inland ice miles past the grounding line. - Daily Kos", "description": "\"Think about spraying an icy road with a jet of salty warm water—you don't need meters of that salt water to melt ice rapidly.\" Eric Rinot Thwaites Glacier is a massive cap of ice the size of Florida in the highly vulnerable West Antarctic ice sheet....", "url": "https://www.dailykos.com/stories/2024/7/14/2254118/-Thwaites-Glacier-gets-a-daily-bath-of-warm-water-melting-inland-ice-miles-past-the-grounding-line", "urlToImage": "https://cdn.prod.dailykos.com/images/1152131/story_image/Thwaites_crevasses_in_motion_article.gif?1673620059", "publishedAt": "2024-07-14T13:53:30Z", "content": null}, {"source": {"id": null, "name": "Futurism"}, "author": "Sharon Adarlo", "title": "Earth Surrounded by Dark Comets, Astronomers Claim - Futurism", "description": "Dark comets, which are cross between an asteroid and comet, can make up as much as 60 percent of near-Earth objects.", "url": "https://futurism.com/the-byte/earth-dark-comets", "urlToImage": "https://wordpress-assets.futurism.com/2024/07/earth-dark-comets-1.jpg", "publishedAt": "2024-07-14T12:30:00Z", "content": "In the darkness of space...\r\nRock of Ages\r\nBesides the planets and their satellites, our solar system hosts countless rocky asteroids and glowing comets, all whizzing through the black vacuum of spac… [+2742 chars]"}, {"source": {"id": null, "name": "Knowablemagazine.org"}, "author": "Tom Siegfried, Knowable Magazine", "title": "Animals use physics? Let us count the ways - Ars Technica", "description": "Cats twist and snakes slide, exploiting and negotiating physical laws.", "url": "https://knowablemagazine.org/content/article/physical-world/2024/how-animals-exploit-and-negotiate-physics", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/07/GettyImages-856193648-760x380.jpg", "publishedAt": "2024-07-14T11:13:55Z", "content": "14\r\nIsaac Newton would never have discovered the laws of motion had he studied only cats.\r\nSuppose you hold a cat, stomach up, and drop it from a second-story window. If a cat is simply a mechanical … [+3695 chars]"}, {"source": {"id": null, "name": "Motley Fool"}, "author": "Rich Smith", "title": "Billionaire Elon Musk Gets to Destroy the International Space Station. Here's What Happens Next. - The Motley Fool", "description": "NASA plans to pay Elon Musk close to $850 million to dispose of its old space station. Other companies will pay him even more money to replace it.", "url": "https://www.fool.com/investing/2024/07/14/billionaire-elon-musk-will-destroy-space-station/", "urlToImage": "https://g.foolcdn.com/editorial/images/783230/international-space-station-orbiting-over-a-hurricane-on-earth.jpg", "publishedAt": "2024-07-14T11:07:00Z", "content": "NASA plans to pay Elon Musk close to $850 million to dispose of its old space station. Other companies will pay him even more money to replace it.For nearly a decade, Russia has been threatening to e… [+4500 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": null, "title": "Forgotten, Half-Century Old Film Photographs Reveal A Hidden Truth About Antartica’s Glaciers - Inverse", "description": "An archive of more than 300,000 historical images contains an invaluable record of this area from 1968.", "url": "https://www.inverse.com/science/forgotten-half-century-old-film-photographs-reveal-hidden-truth-about-antarctica-glaciers", "urlToImage": "https://imgix.bustle.com/uploads/image/2024/7/9/75c779fc/file-20240704-23-hdx6id.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2024-07-14T11:00:24Z", "content": "In March 2002, the Larsen B Ice Shelf collapsed catastrophically, breaking up an area about one-sixth the size of Tasmania.\r\nIn a paper published today in Scientific Reports, we used nearly 1,000 fil… [+4771 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Lance Fortnow", "title": "Everything You See Is a Computational Process, If You Know How to Look - WIRED", "description": "Computer scientist Lance Fortnow writes that by embracing the computations that surround us, we can begin to understand and tame our seemingly random world.", "url": "https://www.wired.com/story/everything-you-see-is-a-computational-process-if-you-know-how-to-look/", "urlToImage": "https://media.wired.com/photos/668fae118600eafc56437efa/191:100/w_1280,c_limit/FeelTheMachine-Lede-scaled.jpeg", "publishedAt": "2024-07-14T11:00:00Z", "content": "The original version ofthis storyappeared in Quanta Magazine.\r\nIn the movie Oppenheimer, Niels Bohr challenges the physicist early in his career:\r\nBohr: Algebra is like sheet music. The important thi… [+2722 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Comet 13P/Olbers will be closest to Earth on July 20 - EarthSky", "description": null, "url": "https://earthsky.org/space/comet-13p-olbers-finder-maps/", "urlToImage": "https://earthsky.org/upl/2024/07/Comet-13P-Olbers-by-Peter-Horalek-e1720799395611.jpg", "publishedAt": "2024-07-14T10:55:52Z", "content": "View larger. | Comet 13P/Olbers makes its closest approach to Earth on July 20, 2024. Astrophotographers can take long-exposure images or stack them to obtain amazing results like this one, which sho… [+3756 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Rick Tumlinson", "title": "The values of family in space (op-ed) - Space.com", "description": "As we settle the High Frontier, we will move one step closer to becoming our higher selves, and as we do, perhaps we will grow closer to each other.", "url": "https://www.space.com/values-family-space-settlement-op-ed", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bj58iSQz7XdoAmnYHaCVTP-1200-80.jpg", "publishedAt": "2024-07-14T10:00:32Z", "content": "Rick Tumlinson is the founder of SpaceFund\r\n, a venture capital firm investing in space startups. He also founded the Space Frontier Foundation\r\n, Earthlight Foundation\r\n, and New Worlds Institute\r\n … [+13545 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Submarine-sized 120-ft asteroid to approach Earth today at 20,993 Km/h: NASA - The Times of India", "description": "Asteroid 2022 YS5, a 120-foot space rock, will make a close approach to Earth today at a speed of 20,993 km/h. Discovered in 2022, it has been monitored by NASA’s Jet Propulsion Laboratory. Despite its proximity, it poses no threat. This event highlights the …", "url": "https://timesofindia.indiatimes.com/etimes/trending/submarine-sized-120-ft-asteroid-to-approach-earth-today-at-20993-km/h-nasa/articleshow/111666776.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-111666755,width-1070,height-580,imgsize-52854,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-07-14T09:48:00Z", "content": null}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "A satnav system for the moon? Chinese scientists plot a possible route - South China Morning Post", "description": "China’s lunar ambitions could soon be aided by the construction of 21 satellites for a moon navigation system.", "url": "https://www.scmp.com/news/china/science/article/3270195/satnav-system-moon-chinese-scientists-plot-possible-route", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/07/12/249daa2d-5768-4e03-a895-961cfb18a679_0f5baf0b.jpg?itok=5TMrbvsP&v=1720765615", "publishedAt": "2024-07-14T04:00:10Z", "content": "While the paper did not specify a construction timeline, China aims to put astronauts on the moon by 2030 and to build a research base at the lunar south pole with international partners around 2035.… [+2975 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Pierre Celerier", "title": "Nearby exoplanet could be first known ocean world: Webb telescope - Phys.org", "description": "A planet relatively close to Earth could be the first ever detected with a potentially life-sustaining liquid ocean outside our Solar System, according to scientists using the James Webb space telescope.", "url": "https://phys.org/news/2024-07-nearby-exoplanet-ocean-world-webb.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/an-artists-illustratio-3.jpg", "publishedAt": "2024-07-14T00:00:01Z", "content": "A planet relatively close to Earth could be the first ever detected with a potentially life-sustaining liquid ocean outside our Solar System, according to scientists using the James Webb space telesc… [+4018 chars]"}]}