{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "See August’s second supermoon and bright Saturn in the night sky - CNN", "description": "August ends with its second supermoon of the month, called a blue moon. And look for a bright glimpse of Saturn next to the moon in the night sky.", "url": "https://www.cnn.com/2023/08/30/world/august-supermoon-blue-moon-saturn-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230622164936-01-july-buck-supermoon-2023-scn.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-08-30T12:00:00Z", "content": "Editors Note: Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAugust began with a bright supermoon and… [+3562 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESA postpones Ariane 6 hot-fire test again - SpaceNews", "description": "The European Space Agency says a test-firing of an Ariane 6 core stage has been postponed again, this time because of issues with ground equipment.", "url": "https://spacenews.com/esa-postpones-ariane-6-hot-fire-test-again/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/08/ariane6-testing-july2023.jpg", "publishedAt": "2023-08-30T11:45:28Z", "content": "WASHINGTON The European Space Agency says a test-firing of an Ariane 6 core stage has been postponed again, this time because of issues with ground equipment.\r\nIn an Aug. 30 update, ESA said that a p… [+1363 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Reveals How Plants Pass Down Genetic Memories - SciTechDaily", "description": "When organisms pass their genes on to future generations, they include more than the code spelled out in DNA. Some also pass along chemical markers that instruct cells how to use that code. The passage of these markers to future generations is known as epigen…", "url": "https://scitechdaily.com/new-study-reveals-how-plants-pass-down-genetic-memories/", "urlToImage": "https://scitechdaily.com/images/Green-DNA-Plants.jpg", "publishedAt": "2023-08-30T10:31:59Z", "content": "ByCold Spring Harbor LaboratoryAugust 30, 2023\r\nScientists have discovered how the protein DDM1 aids in the methylation process that silences jumping genes in plants. Their findings also reveal how D… [+4566 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA discussing September arrival of OSIRIS-REx asteroid sample: Watch live today - Space.com", "description": "The OSIRIS-REx press event begins today (Aug. 30) at 5 p.m. ET.", "url": "https://www.space.com/nasa-osiris-rex-asteroid-sample-return-preview", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NKSnixdv8prRRmUR6bUJeW-1200-80.jpg", "publishedAt": "2023-08-30T10:00:20Z", "content": "NASA will discuss the impending arrival of the asteroid sample collected by its OSIRIS-REx probe during a press conference today (Aug. 30), and you can watch it live.\r\nThat sample — about 8.8 ounces … [+4136 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "The last Super Blue Moon until 2037 rises tonight. Here's how to see it - Space.com", "description": "August gets not only a second full moon, but a rare Super Blue Moon.", "url": "https://www.space.com/blue-moon-rises-august-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2dKSrVqJnqJDnR5kUW8YRi-1200-80.jpg", "publishedAt": "2023-08-30T10:00:00Z", "content": "August is almost over, but it still has a rare event to deliver to skywatchers in the form of a second full moon. \r\nThe full moon that rises on Wednesday, Aug. 30, will be a special one too, the unif… [+4001 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A new protocol to reliably demonstrate quantum computational advantage - Phys.org", "description": "Quantum computers, devices that perform computations by exploiting quantum mechanical phenomena, have the potential to outperform classical computers on some tasks and optimization problems. In recent years, research teams at both academic institutions and IT…", "url": "https://phys.org/news/2023-08-protocol-reliably-quantum-advantage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-new-protocol-to-reli.jpg", "publishedAt": "2023-08-30T09:50:01Z", "content": "Quantum computers, devices that perform computations by exploiting quantum mechanical phenomena, have the potential to outperform classical computers on some tasks and optimization problems. In recen… [+4795 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Device Used To Slow Down Chemical Reaction by 100 Billion Times - SciTechDaily", "description": "What happens in femtoseconds in nature can now be observed in milliseconds in the lab. Scientists at the University of Sydney have achieved a groundbreaking feat, directly observing a critical chemical reaction process by utilizing a quantum computer to slow …", "url": "https://scitechdaily.com/quantum-device-used-to-slow-down-chemical-reaction-by-100-billion-times/", "urlToImage": "https://scitechdaily.com/images/Quantum-Chemistry-Close-Up-Art-Concept.jpg", "publishedAt": "2023-08-30T08:28:41Z", "content": "ByUniversity of SydneyAugust 30, 2023\r\nScientists at the University of Sydney used a quantum computer to slow and directly observe a key chemical reaction process, unveiling details previously unseen… [+7037 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "In a First, Scientists Fully Wipe a Cell's Memory Before Turning It Into a Stem Cell - ScienceAlert", "description": "Scientists already have their ways of coaxing human cells into new forms, using a special concoction of chemicals to nudge humble skin cells into malleable tissues known as induced pluripotent stem cells.", "url": "https://www.sciencealert.com/in-a-first-scientists-fully-wipe-a-cells-memory-before-turning-it-into-a-stem-cell", "urlToImage": "https://www.sciencealert.com/images/2023/08/HumanInducedPluripotentStemCellColony.jpg", "publishedAt": "2023-08-30T07:12:24Z", "content": "Scientists already have their ways of coaxing human cells into new forms, using a special concoction of chemicals to nudge humble skin cells into malleable tissues known as induced pluripotent stem c… [+3692 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "SpaceX Crew-7's Stellar Start: Adjusting to Zero Gravity & Learning How To Use a Space Toilet - SciTechDaily", "description": "The four newest crew members aboard the International Space Station (ISS) are adjusting to life in weightlessness while stepping up orbital maintenance duties. The seven other Expedition 69 crew mates continued their space research and health activities befor…", "url": "https://scitechdaily.com/spacex-crew-7s-stellar-start-adjusting-to-zero-gravity-learning-how-to-use-a-space-toilet/", "urlToImage": "https://scitechdaily.com/images/Hurricane-Idalia-From-the-International-Space-Station.jpg", "publishedAt": "2023-08-30T06:49:53Z", "content": "ByNASAAugust 29, 2023\r\nHurricane Idalia was pictured from the International Space Station as it orbited above the Gulf of Mexico on Tuesday, August 29, 2023. Credit: NASA TV\r\nThe four newest crew mem… [+1674 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Searching for evidence of interstellar objects - NBC News", "description": "NBC's Gadi Schwartz talks with Harvard professor Avi Loeb about the discovery of objects on the ocean floor that could be from out of this world.» Subscribe ...", "url": "https://www.youtube.com/watch?v=UqTH3f_ak0s", "urlToImage": "https://i.ytimg.com/vi/UqTH3f_ak0s/maxresdefault.jpg", "publishedAt": "2023-08-30T04:30:14Z", "content": null}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Chu | MIT News", "title": "Newly discovered planet has longest orbit yet detected by the TESS mission - MIT News", "description": "Most known exoplanets orbit closely around their stars, but the MIT-led TESS mission has discovered a rare system containing two planets with much more distant orbits, one of which has the longest orbital period that TESS has detected to date. The planets are…", "url": "https://news.mit.edu/2023/newly-discovered-planet-has-longest-orbit-yet-detected-tess-mission-0830", "urlToImage": "https://news.mit.edu/sites/default/files/images/202308/MIT_Farthest-Planet-01-press.jpg", "publishedAt": "2023-08-30T04:00:00Z", "content": "Of the more than 5,000 planets known to exist beyond our solar system, most orbit their stars at surprisingly close range. More than 80 percent of confirmed exoplanets have orbits shorter than 50 day… [+6117 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Seeing the Invisible: New Method Makes Infrared Light Visible at Room Temperature - SciTechDaily", "description": "Quantum-derived findings might significantly simplify the detection of mid-infrared light at room temperatures. Researchers from the University of Birmingham and the University of Cambridge have unveiled a groundbreaking technique that allows for the detectio…", "url": "https://scitechdaily.com/seeing-the-invisible-new-method-makes-infrared-light-visible-at-room-temperature/", "urlToImage": "https://scitechdaily.com/images/Infrared-Light-Abstract.jpg", "publishedAt": "2023-08-30T03:47:57Z", "content": "ByUniversity of BirminghamAugust 29, 2023\r\nResearchers have developed a method, MIRVAL, to convert mid-infrared photons into visible photons at room temperature, enabling single-molecule spectroscopy… [+5764 chars]"}, {"source": {"id": null, "name": "Newsnationnow.com"}, "author": "Liz Jassin", "title": "‘Nothing like it’: Loeb on interstellar meteor found in ocean - NewsNation Now", "description": "Loeb, the head of the Galileo Project, says that the team is “very confident” the materials found aren’t from our solar system.", "url": "https://www.newsnationnow.com/vargasreports/avi-loeb-interstellar-meteor-pacific-ocean/", "urlToImage": "https://www.newsnationnow.com/wp-content/uploads/sites/108/2023/08/F63962B6467E5C95C137BBE7EC6DAC3F.jpg?w=1280", "publishedAt": "2023-08-30T03:06:13Z", "content": "(NewsNation) The remains of a small meteor discovered in the ocean are “far beyond what you find in the solar system,” according to astrophysicist Avi Loeb.\r\nNearly a decade ago, a meteor traveling f… [+1739 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DNA Danger: Physicists Expose Fat Droplets' Hidden Threat - SciTechDaily", "description": "Fat serves as an essential component of the human body, functioning not only as an energy storage and release mechanism but also playing pivotal roles in hormone regulation and immune function. The increasing prevalence of metabolic disorders, including heart…", "url": "https://scitechdaily.com/dna-danger-physicists-expose-fat-droplets-hidden-threat/", "urlToImage": "https://scitechdaily.com/images/DNA-Editing-Genetic-Engineering-Concept.jpg", "publishedAt": "2023-08-30T02:53:59Z", "content": "ByUniversity of Pennsylvania School of Engineering and Applied ScienceAugust 29, 2023\r\nResearchers at the University of Pennsylvania have discovered that fat-filled lipid droplets, much smaller than … [+5328 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Lee Ying Shan", "title": "India to launch mission to study the sun — just days after successful moon landing - CNBC", "description": "Days after India's successful moon mission, the country is now setting its sights on the sun.", "url": "https://www.cnbc.com/2023/08/30/india-to-launch-mission-to-study-sun-days-after-chandrayaan-3-landing.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107293094-1693300534214-gettyimages-1232127909-economou-notitle210404_npTZC.jpeg?v=1693356294&w=1920&h=1080", "publishedAt": "2023-08-30T00:44:00Z", "content": "Days after India's successful moon mission, the country is now setting its sights on the sun. \r\nAccording to the Indian Space Research Organization (ISRO), the Aditya-L1 spacecraft will be launched f… [+1546 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA Deep Space Network reaches “critical point” as demand grows - SpaceNews", "description": "Increasing demand but decreasing budgets are putting a strain on NASA’s Deep Space Network (DSN), threatening its ability to support missions.", "url": "https://spacenews.com/nasa-deep-space-network-reaches-critical-point-as-demand-grows/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/08/PIA24163large.jpg", "publishedAt": "2023-08-29T23:48:25Z", "content": "WASHINGTON Increasing demand but decreasing budgets are putting a strain on NASAs Deep Space Network (DSN), threatening its ability to provide communications for the agencys science missions and Arte… [+5902 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Cosmic Thermometer” Detected on WASP-31b – A Giant Leap in Exoplanet Research - SciTechDaily", "description": "Chromium hydride, found in the temperature range of 1,200-2,000 degrees Kelvin, has been detected in the hot Jupiter WASP-31b's atmosphere. This discovery paves the way for the molecule to be used as a \"thermometer\" for exoplanets. Chromium hydride (CrH), a m…", "url": "https://scitechdaily.com/cosmic-thermometer-detected-on-wasp-31b-a-giant-leap-in-exoplanet-research/", "urlToImage": "https://scitechdaily.com/images/Hot-Jupiter-Exoplanet-Art.jpg", "publishedAt": "2023-08-29T23:44:22Z", "content": "ByCornell UniversityAugust 29, 2023\r\nAstronomers have confirmed the presence of chromium hydride in the atmosphere of the hot Jupiter WASP-31b using high-resolution spectral observations. This molecu… [+8347 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Y Not? The Full Story Behind Sequencing Humanity's Most Elusive Chromosome - SciTechDaily", "description": "The Telomere-to-Telomere consortium has fully sequenced the Y chromosome, uncovering 41 new genes and adding 30 million new bases to the human genome. This breakthrough will impact studies on reproduction, evolution, and human population changes, and correct …", "url": "https://scitechdaily.com/y-not-the-full-story-behind-sequencing-humanitys-most-elusive-chromosome/", "urlToImage": "https://scitechdaily.com/images/Male-Human-Y-Chromosome-Sequence-Concept.jpg", "publishedAt": "2023-08-29T22:47:12Z", "content": "ByUniversity of California, Santa CruzAugust 29, 2023\r\nResearchers from the Telomere-to-Telomere (T2T) consortium have successfully sequenced the complex Y chromosome, adding 30 million new bases to … [+9519 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Hackers shut down 2 of the world's most advanced telescopes - Space.com", "description": "It's unclear exactly what the nature of the cyberattacks were or from where they originated.", "url": "https://www.space.com/noirlab-gemini-north-south-telescopes-hacked-cybersecurity", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JBgAZ5aAqo8i3wtpQcJjoT-1200-80.jpg", "publishedAt": "2023-08-29T22:00:00Z", "content": "Some of the world's leading astronomical observatories have reported cyberattacks that have resulted in temporary shutdowns.\r\nThe National Science Foundation's National Optical-Infrared Astronomy Res… [+2311 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Nancy Atkinson", "title": "The Whirlpool Galaxy, Seen by JWST - Universe Today", "description": "The Whirlpool Galaxy, aka M51, is one of the most well-known objects in the night sky. It’s close enough and prominent in the northern sky that amateur astronomers have shared stunning pictures of it for decades. But you’ve never seen anything like this: M51 …", "url": "https://www.universetoday.com/162955/the-whirlpool-galaxy-seen-by-jwst/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/08/potm2308a.jpg", "publishedAt": "2023-08-29T21:54:06Z", "content": "The Whirlpool Galaxy, aka M51, is one of the most well-known objects in the night sky. It’s close enough and prominent in the northern sky that amateur astronomers have shared stunning pictures of it… [+2710 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Everything You Need to Know About the 2023 Annular Solar Eclipse - Syfy", "description": "October's annular solar eclipse will be visible from parts of North, Central, and South America. Here's what you need to know.", "url": "https://www.syfy.com/syfy-wire/everything-you-need-to-know-about-the-2023-annular-solar-eclipse", "urlToImage": "https://www.syfy.com/sites/syfy/files/2023/03/Vinn%20Diesel.jpg", "publishedAt": "2023-08-29T21:16:25Z", "content": "In the science fiction horror classic Pitch Black (streaming now on SYFY!), the spaceship Hunter-Gratzner crash lands on the mysterious planet M6-117. The survivors of the crash, including the wild-e… [+4198 chars]"}, {"source": {"id": null, "name": "Cord Cutters News, LLC"}, "author": "Shelby Brown", "title": "SpaceX’s Starlink Now Has Over 5,000 Internet Satellites in Orbit - Cord Cutters News", "description": "SpaceX launched 22 more of its Starlink internet satellites toward orbit on August 26. The Sunday night lift off brought the total number of Starlink satellites in space to over 5,000, according to Space.com, and the spaceflight company isn’t slowing down. Sp…", "url": "https://cordcuttersnews.com/spacexs-starlink-now-has-over-5000-internet-satellites-in-orbit/", "urlToImage": "https://cordcuttersnews.com/wp-content/uploads/2020/07/Starlink-Resized2.jpg", "publishedAt": "2023-08-29T21:08:14Z", "content": "SpaceX launched 22 more of its Starlink internet satellites toward orbit on August 26. The Sunday night lift off brought the total number of Starlink satellites in space to over 5,000, according to S… [+2192 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Hubble, Webb Telescopes to Study Jupiter's Volcanic Moon - Gizmodo", "description": "Io is the most volcanically active world in the solar system, with hundreds of volcanoes that erupt with massive fountains of lava.", "url": "https://gizmodo.com/hubble-webb-telescopes-team-up-to-study-jupiters-tumul-1850784673", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/63dfe08ec66fed0faf5f92e1f2aa1ea5.jpg", "publishedAt": "2023-08-29T20:45:00Z", "content": "Jupiters orbit is swarming with nearly 100 moons, but none are as hardcore as the volcanic world Io. Thats why its going to take an iconic collaboration to truly probe the odd satellite in order to u… [+2259 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Quin", "title": "Titanium micro-spikes skewer resistant superbugs - Phys.org", "description": "A new study suggests rough surfaces inspired by the bacteria-killing spikes on insect wings may be more effective at combating drug-resistant superbugs, including fungus, than previously understood.", "url": "https://phys.org/news/2023-08-titanium-micro-spikes-skewer-resistant-superbugs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/titanium-micro-spikes.jpg", "publishedAt": "2023-08-29T20:27:04Z", "content": "A new study suggests rough surfaces inspired by the bacteria-killing spikes on insect wings may be more effective at combating drug-resistant superbugs, including fungus, than previously understood.\r… [+5365 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Chron", "title": "Texas drought unearths 110-million-year-old dinosaur tracks - Chron", "description": null, "url": "https://www.chron.com/life/wildlife/article/texas-drought-dinosaur-tracks-18336009.php", "urlToImage": null, "publishedAt": "2023-08-29T20:06:06Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Sanders", "title": "Closest supernova in a decade reveals how exploding stars evolve - Phys.org", "description": "Alex Filippenko is the kind of guy who brings a telescope to a party. True to form, at a soiree on May 18 this year, he wowed his hosts with images of star clusters and colorful galaxies—including the dramatic spiral Pinwheel Galaxy—and snapped telescopic pho…", "url": "https://phys.org/news/2023-08-closest-supernova-decade-reveals-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/closest-supernova-in-a.jpg", "publishedAt": "2023-08-29T20:00:59Z", "content": "Alex Filippenko is the kind of guy who brings a telescope to a party. True to form, at a soiree on May 18 this year, he wowed his hosts with images of star clusters and colorful galaxiesincluding the… [+11942 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Colorful Ring Nebula shines in new Webb images - CNN", "description": "The James Webb Space Telescope has revealed colorful new portraits of the iconic Ring Nebula that capture unprecedented details a dying star creates glowing structures.", "url": "https://www.cnn.com/2023/08/29/world/webb-telescope-ring-nebula-images-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230828125639-01-james-webb-space-telescope-ring-nebula-nircam-crop.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-08-29T19:48:00Z", "content": "Editors Note: Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe James Webb Space Telescope has revea… [+3441 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Satellites capture Burning Man festival's fire from space (photos) - Space.com", "description": "The annual 'radical self-expression' festival has just begun.", "url": "https://www.space.com/burning-man-festival-satellite-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/K4AnKTFxfnhnKDxRALMA2o-1200-80.jpg", "publishedAt": "2023-08-29T19:00:06Z", "content": "Satellites watched as  a temporary city sprang up in the Nevada desert, where the famed Burning Man \"radical self-expression\" festival kicked off on Monday (Aug. 28). \r\nOne spacecraft even caught a g… [+2006 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": ", USA TODAY", "title": "Video captures brilliant meteor streaking across Colorado night sky - USA TODAY", "description": "An illuminous fireball made an appearance over Denver around 3:30 a.m. on Sunday and footage of the unusually bright meteor was captured regionwide.", "url": "https://www.usatoday.com/story/news/nation/2023/08/29/colorado-fireball-meteor-video/70708002007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/08/29/USAT/e0954bfb-0102-40d4-a558-d24aa2911335-Mike_Liebman_via_Storyful_colorado_thumb_1.jpg?auto=webp&crop=1911,1075,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-08-29T18:38:13Z", "content": "If you weren't awake to catch a glimpse of the unusually bright meteor that streaked across the Colorado sky on Sunday, you're in luck: plenty of video was captured of the astrological event.\r\nAround… [+1795 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Psyche Power Electronics Engineer Meena Sreekantamurthy – Behind the Spacecraft - NASA Jet Propulsion Laboratory", "description": "Meet Meena Sreekantamurthy, a power electronics engineer on NASA’s Psyche mission, which will be the first to explore a metal-rich asteroid, also named Psych...", "url": "https://www.youtube.com/watch?v=HPn-9Np0Krw", "urlToImage": "https://i.ytimg.com/vi/HPn-9Np0Krw/maxresdefault.jpg", "publishedAt": "2023-08-29T18:30:15Z", "content": null}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "NASA to outdo most Americans on internet speeds, gigabit kit heading to the ISS - The Register", "description": "See hot singles in your area! Well, -453.8 F singles at least", "url": "https://www.theregister.com/2023/08/29/nasa_iss_broadband/", "urlToImage": "https://regmedia.co.uk/2023/08/29/illuma-t-from-iss-to-lcrd.jpg", "publishedAt": "2023-08-29T18:19:00Z", "content": "NASA's laser-based, gigabit-speed space internet is set to get its first orbital users just as soon as a new refrigerator-sized piece of hardware makes it to the International Space Station. \r\nThe In… [+3273 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Axios", "title": "The Moon renaissance is here - Axios", "description": null, "url": "https://www.axios.com/2023/08/29/moon-renaissance-science", "urlToImage": null, "publishedAt": "2023-08-29T17:20:45Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Does hot water freeze faster than cold water? Examining the Mpemba effect - Phys.org", "description": "Does hot water freeze faster than cold water? Aristotle may have been the first to tackle this question that later became known as the Mpemba effect.", "url": "https://phys.org/news/2023-08-hot-faster-cold-mpemba-effect.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/some-like-it-hot.jpg", "publishedAt": "2023-08-29T16:57:05Z", "content": "Does hot water freeze faster than cold water? Aristotle may have been the first to tackle this question that later became known as the Mpemba effect.\r\nThis phenomenon originally referred to the non-m… [+2553 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "Cambrian Marine Arthropod Had Three Eyes and Four Pairs of Biramous Head Limbs - Sci.News", "description": "Paleontologists have conducted a microtomographic study of new specimens of the Early Cambrian shrimp-like arthropod Kylinxia zhangi.", "url": "https://www.sci.news/paleontology/kylinxia-zhangi-eyes-limbs-12218.html", "urlToImage": "https://cdn.sci.news/images/2023/08/image_12218f-Kylinxia-zhangi.jpg", "publishedAt": "2023-08-29T16:56:37Z", "content": "Paleontologists from Yunnan University, the University of Leicester and the Natural History Museum, London have conducted a microtomographic study of new specimens of the Early Cambrian shrimp-like a… [+2841 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Chandrayaan-3 rover confirms presence of sulphur on lunar surface, search for Hydrogen underway: ISRO - Deccan Herald", "description": "Bengaluru, Aug 29 (PTI) The Laser-Induced Breakdown Spectroscope instrument onboard 'Pragyan' rover of Chandrayaan-3 has unambiguously confirmed the presence of sulphur on the lunar surface near south pole, through first-ever in-situ measurements, ISRO said o…", "url": "https://www.deccanherald.com/science/space/chandrayaan-3-rover-confirms-presence-of-sulphur-on-lunar-surface-search-for-hydrogen-underway-isro-2665348", "urlToImage": "https://images.deccanherald.com/deccanherald%2F2023-08%2F49f0b296-cc0d-41ad-9e78-9d352f95a950%2FPTI08_29_2023_000228B.jpg?rect=0%2C149%2C4223%2C2217&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop", "publishedAt": "2023-08-29T16:54:09Z", "content": "Preliminary analyses have unveiled the presence of Aluminum (Al), Sulphur (S), Calcium (Ca), Iron (Fe), Chromium (Cr), and Titanium (Ti) on the lunar surface. Further measurements have revealed the p… [+64 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Game-Changer for Infertile Men – New Diagnostic Detects Viable Sperm - SciTechDaily", "description": "Scientists identify new protein biomarkers for visualizing well-developed sperm to assess the potential success of surgical sperm retrieval. In a recent study, scientists developed a diagnostic test designed to identify functional sperm in infertile men, pote…", "url": "https://scitechdaily.com/a-game-changer-for-infertile-men-new-diagnostic-detects-viable-sperm/", "urlToImage": "https://scitechdaily.com/images/Sperm-Illustration.jpg", "publishedAt": "2023-08-29T16:41:45Z", "content": "Researchers have developed a diagnostic test to identify functional sperm in infertile men, particularly those with nonobstructive azoospermia (NOA), potentially revolutionizing treatments in male in… [+3696 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "New theory suggests universe is twice as old as previously believed - UPI News", "description": "Early universe observations by the James Webb Space Telescope cannot be explained by current cosmological models.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/upi/8891693322495/2023/1/abda912e3b1e0aed9f95ea86958a4f0b/v1.5/New-theory-suggests-universe-is-twice-as-old-as-previously-believed.jpg", "publishedAt": "2023-08-29T15:40:42Z", "content": "Aug. 29 (UPI) -- Early universe observations by the James Webb Space Telescope cannot be explained by current cosmological models. These models estimate the universe to be 13.8 billion years in age, … [+5926 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Is There Life Hiding Out In Ancient Caves On Mars? - IFLScience", "description": "If life is still around on the planet, it might be hiding underground.", "url": "https://www.iflscience.com/is-there-life-hiding-out-in-ancient-caves-on-mars-70449", "urlToImage": "https://assets.iflscience.com/assets/articleNo/70449/aImg/70296/lava-tube-meta.png", "publishedAt": "2023-08-29T15:14:31Z", "content": "Our hopes for finding life on Mars have been downgraded significantly over the years, from the 1870s when many believed we'd find a complex system of canals up there (and presumably a creature intell… [+2484 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This Ancient Meteorite Is A Time Capsule From The Birth of Our Solar System - ScienceAlert", "description": "A piece of ancient space rock that ended up on Earth is giving scientists the clues they need to understand the cloud of dust from which the Solar System was born.", "url": "https://www.sciencealert.com/this-ancient-meteorite-is-a-time-capsule-from-the-birth-of-our-solar-system", "urlToImage": "https://www.sciencealert.com/images/2023/08/erg-chech-002-header.jpg", "publishedAt": "2023-08-29T15:01:16Z", "content": "A piece of ancient space rock that ended up on Earth is giving scientists the clues they need to understand the cloud of dust from which the Solar System was born.\r\nThe rare object is known as Erg Ch… [+3672 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "How Data from a NASA Lunar Orbiter is Preparing Artemis Astronauts - NASA", "description": "As astronauts prepare to head back to the Moon for the first time since 1972, they have been trained on how to identify landmarks, spot geological features, and help mark areas of interest for future landings, all using data gathered by NASA’s Lunar Reconnais…", "url": "https://www.nasa.gov/feature/goddard/2023/lro-artemis-training", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/lunar-south-pole-lro-svs.jpg", "publishedAt": "2023-08-29T14:10:30Z", "content": null}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "In a Monster Star’s Light, a Hint of Darkness - Quanta Magazine", "description": "Astronomers are scouring the cosmos for fingerprints of the invisible — tiny clumps of pure dark matter that might solve a long-standing cosmic mystery.", "url": "https://www.quantamagazine.org/in-a-monster-stars-light-a-hint-of-darkness-20230829/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/08/MonsterMatter-byAllisonLi-Social.webp", "publishedAt": "2023-08-29T14:08:30Z", "content": "His teams analysis, published in June in Monthly Notices of the Royal Astronomical Society, did not find evidence for wavelike dark matter effects in high-resolution images of arcs of light from one … [+7809 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Ben Taub", "title": "We May Finally Know Why Humans Have Such Big Brains - IFLScience", "description": "The later you start having sex, the bigger your brain (\"you\" being a species, not an individual).", "url": "https://www.iflscience.com/we-may-finally-know-why-humans-have-such-big-brains-70453", "urlToImage": "https://assets.iflscience.com/assets/articleNo/70453/aImg/70295/human-brain-size-meta.jpg", "publishedAt": "2023-08-29T13:55:30Z", "content": "The size of the human brain has roughly tripled over the past four million years of hominid evolution, yet the factors driving this encephalic expansion are not fully understood. Attempting to solve … [+2579 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Quantum discovery verifies a decades-old theory on how monopoles decay - Phys.org", "description": "The field of quantum physics is rife with paths leading to tantalizing new areas of study, but one rabbit hole offers a unique vantage point into a world where particles behave differently—through the proverbial looking glass.", "url": "https://phys.org/news/2023-08-quantum-discovery-decades-old-theory-monopoles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/quantum-discovery-veri.jpg", "publishedAt": "2023-08-29T13:37:03Z", "content": "The field of quantum physics is rife with paths leading to tantalizing new areas of study, but one rabbit hole offers a unique vantage point into a world where particles behave differentlythrough the… [+4282 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Atlas V rocket launch of Space Force's 'watchdog' satellite Silent Barker delayed due to storm - Space.com", "description": "A new launch date has not been set.", "url": "https://www.space.com/atlas-v-rocket-silent-barker-watchdog-satellite-space-force-launch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bTrCCWFwsBcJ8pExhG6JG-1200-80.jpg", "publishedAt": "2023-08-29T13:28:16Z", "content": "Update for Aug. 29: The launch of Silent Barker/NROL-107 has been delayed due to an oncoming tropical storm. This story has been updated to reflect the delay.\r\nThe United States Space Force is about … [+4267 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists confirm decades-old theory of non-uniform distribution of electron density in aromatic molecules - Phys.org", "description": "Scientists from the Institute of Organic Chemistry and Biochemistry Prague, the Institute of Physics of the Czech Academy of Sciences, and Palacký University Olomouc, have once again successfully uncovered the mysteries of the world of molecules and atoms.", "url": "https://phys.org/news/2023-08-scientists-decades-old-theory-non-uniform-electron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/scientists-continue-to.jpg", "publishedAt": "2023-08-29T13:21:28Z", "content": "Scientists from the Institute of Organic Chemistry and Biochemistry Prague, the Institute of Physics of the Czech Academy of Sciences, and Palacký University Olomouc, have once again successfully unc… [+4290 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mangirdas Malinauskas", "title": "X-photon 3D nanolithography - Phys.org", "description": "Multiphoton lithography (MPL) is a technique that uses ultra-short laser pulses to create complex three-dimensional (3D) structures at the micro- and nanoscale. It is based on the principle of multiphoton absorption (MPA), which occurs when two or more photon…", "url": "https://phys.org/news/2023-08-x-photon-3d-nanolithography.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/x-photon-3d-nanolithog-1.jpg", "publishedAt": "2023-08-29T12:31:04Z", "content": "Multiphoton lithography (MPL) is a technique that uses ultra-short laser pulses to create complex three-dimensional (3D) structures at the micro- and nanoscale. It is based on the principle of multip… [+6525 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Debra Werner", "title": "Benchmark wins AFRL award to develop thrusters for ASCENT - SpaceNews", "description": "Benchmark Space Systems won a $2.81 million U.S. Air Force Research Laboratory contract to continue development and testing of thrusters running on Advanced Spacecraft Energetic Non-Toxic, ASCENT, fuel.", "url": "https://spacenews.com/benchmark-wins-afrl-award-to-develop-thrusters-for-ascent/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/08/rsz_benchmark_space_systems_has_previously_developed_and_tested_thrusters_up_to_500_newton_class.png?fit=879%2C703&ssl=1", "publishedAt": "2023-08-29T11:00:00Z", "content": "SAN FRANCISCO Benchmark Space Systems won a $2.81 million U.S. Air Force Research Laboratory contract to continue development and testing of thrusters running on Advanced Spacecraft Energetic Non-Tox… [+3432 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Blame It On The Sockets: Forensic Analysis Of The Arecibo Collapse - Hackaday", "description": "Nearly three years after the rapid unplanned disassembly of the Arecibo radio telescope, we finally have a culprit in the collapse: bad sockets. In case you somehow missed it, back in 2020 we start…", "url": "https://hackaday.com/2023/08/29/blame-it-on-the-sockets-forensic-analysis-of-the-arecibo-collapse/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/08/arecibo_socket.png", "publishedAt": "2023-08-29T11:00:00Z", "content": "Nearly three years after the rapid unplanned disassembly of the Arecibo radio telescope, we finally have a culprit in the collapse: bad sockets.\r\nIn case you somehow missed it, back in 2020 we starte… [+2465 chars]"}, {"source": {"id": null, "name": null}, "author": null, "title": null, "description": null, "url": null, "urlToImage": null, "publishedAt": null, "content": null}, {"source": {"id": "wired", "name": "Wired"}, "author": "Camille Bromley", "title": "How to Use AI to Talk to Whales—and Save Life on Earth - WIRED", "description": "With ecosystems in crisis, engineers and scientists are teaming up to decipher what animals are saying. Their hope: By truly listening to nature, humans will decide to protect it.", "url": "https://www.wired.com/story/use-ai-talk-to-whales-save-life-on-earth/", "urlToImage": "https://media.wired.com/photos/64ecf7e3086141296181b95e/191:100/w_1280,c_limit/WI100123_FF_WhaleTalk_01.png", "publishedAt": "2023-08-29T10:00:00Z", "content": "For researchers and conservationists alike, the potential applications of machine learning are basically limitless. And Earth Species is not the only group working on decoding animal communication. P… [+4041 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kosala Herath, Malin Premaratne", "title": "Quantum-enhanced detection for chip-scale wireless communications - Phys.org", "description": "The demand for fast data sharing and processing has sparked a race for greater bandwidth in wireless communication systems. This is described by Edholm's Law, which states that bandwidth and data rates roughly double every year and a half. As our wireless net…", "url": "https://phys.org/news/2023-08-quantum-enhanced-chip-scale-wireless-communications.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/quantum-enhanced-detec.jpg", "publishedAt": "2023-08-29T09:30:01Z", "content": "The demand for fast data sharing and processing has sparked a race for greater bandwidth in wireless communication systems. This is described by Edholm's Law, which states that bandwidth and data rat… [+6999 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We May Have Already Found Life on Mars, Astrobiologist Says - Then Accidentally Killed It - ScienceAlert", "description": "In all our explorations of Mars to date, no evidence has been found that meets the rigorous standards to claim that we have conclusively found life.", "url": "https://www.sciencealert.com/we-may-have-already-found-life-on-mars-astrobiologist-says-then-accidentally-killed-it", "urlToImage": "https://www.sciencealert.com/images/2022/12/mars-crescent.jpg", "publishedAt": "2023-08-29T07:21:09Z", "content": "In all our explorations of Mars to date, no evidence has been found that meets the rigorous standards to claim that we have conclusively found life.\r\nBut, decades ago in the 1970s, when the Viking la… [+4308 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Madhur Garg, Madhur Garg", "title": "This New AI Research Advances Protein Structure Analysis By Integrating Pre-trained Protein Language Models into Geometric Deep Learning Networks - MarkTechPost", "description": "A captivating puzzle awaits resolution in scientific exploration—proteins' intricate and multifaceted structures. These molecular workhorses govern essential biological processes, wielding their influence in fascinating and enigmatic ways. Yet, interpreting t…", "url": "https://www.marktechpost.com/2023/08/28/this-new-ai-research-advances-protein-structure-analysis-by-integrating-pre-trained-protein-language-models-into-geometric-deep-learning-networks/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/08/Screenshot-2023-08-28-at-10.17.30-PM.png", "publishedAt": "2023-08-29T06:00:00Z", "content": "A captivating puzzle awaits resolution in scientific explorationproteins’ intricate and multifaceted structures. These molecular workhorses govern essential biological processes, wielding their influ… [+4497 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Debra Werner", "title": "TransAstra claims NASA contract for debris capture bag - SpaceNews", "description": "Space logistics startup TransAstra won a NASA contract to manufacture a bag to capture orbital debris.", "url": "https://spacenews.com/transastra-claims-nasa-contract-for-debris-capture-bag/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2023/08/rsz_thinkcapturebag2_1.png?fit=879%2C495&ssl=1", "publishedAt": "2023-08-29T01:42:55Z", "content": "SAN FRANCISCO Space logistics startup TransAstra won a NASA contract to manufacture a bag to capture orbital debris.\r\nUnder the $850,000 Phase 2 Small Business Innovation Research contract, TransAstr… [+4851 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Emily Mae Czachor", "title": "NASA releases first U.S. pollution map images from new space instrument - Yahoo News", "description": "A spectrometer launched into orbit in the spring is collecting data on air pollution over North America.", "url": "https://www.cbsnews.com/news/nasa-first-us-pollution-map-images-tempo-instrument-space/?ftag=YHF4eb9d17", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/S0aOqfd6qXUZNzwwxydpHQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/cbs_news_897/ea7b71cf445e4740e987a93b02f95edf", "publishedAt": "2023-08-28T23:36:27Z", "content": "NASA has released the first data maps from a new instrument monitoring air pollution from space. The visualizations show high levels of major pollutants like nitrogen dioxide a reactive chemical usua… [+3459 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Just Add Sugar: The Surprising Ingredient To Supercharge a Common Antioxidant - SciTechDaily", "description": "New research indicates that combining polyphenolic compounds, which are commonly found in fruits and vegetables, with sugar molecules can lead to the development of potentially life-saving medications. Polyphenols are a class of compounds found in many plant-…", "url": "https://scitechdaily.com/just-add-sugar-the-surprising-ingredient-to-supercharge-a-common-antioxidant/", "urlToImage": "https://scitechdaily.com/images/Sprinkling-Sugar-From-Spoon.jpg", "publishedAt": "2023-08-28T21:57:33Z", "content": "Researchers have found a way to enhance the health benefits of polyphenolic compounds by making them water-soluble through glycosylation, paving the way for potentially life-saving drugs.\r\nNew resear… [+2712 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Demon Hunting: Strange 67-Year-Old Particle Physics Prediction Finally Confirmed - SciTechDaily", "description": "67 years after its theoretical prediction by David Pines, the elusive \"demon\" particle, a massless and neutral entity in solids, has been detected in strontium ruthenate, underscoring the value of innovative research approaches. In 1956, theoretical physicist…", "url": "https://scitechdaily.com/demon-hunting-strange-67-year-old-particle-physics-prediction-finally-confirmed/", "urlToImage": "https://scitechdaily.com/images/Pines-Demons-Rendering.jpg", "publishedAt": "2023-08-28T20:47:41Z", "content": "Researchers have discovered Pines demon, a collection of electrons in a metal that behaves like a massless wave. Credit: The Grainger College of Engineering at the University of Illinois Urbana-Champ… [+5827 chars]"}, {"source": {"id": null, "name": "Thetrek.co"}, "author": "Derek Witteman", "title": "Day 133 - The Fugitive on the Appalachian Trail - The Trek", "description": "Last night while going to sleep, Hot Feet was next to me, watching ‘The Fugitive’ on his phone. The Fugitive, starring Harrison Ford, is one of my favorite movies. As a child, it would always come on TV around 8PM and I would get to watch the first hour befor…", "url": "https://thetrek.co/appalachian-trail/day-133-the-fugitive-on-the-appalachian-trail/", "urlToImage": "https://photos.thetrek.co/wp-content/uploads/2023/08/28140323/C9788D9E-9A39-4ED8-9E52-D68008CFD83F-scaled.jpeg", "publishedAt": "2023-08-28T20:18:49Z", "content": "Last night while going to sleep, Hot Feet was next to me, watching The Fugitive on his phone. The Fugitive, starring Harrison Ford, is one of my favorite movies. As a child, it would always come on T… [+3078 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronaut's Breathtaking View: Moonglint, Volcanic Aleutians, and Aurora Borealis - SciTechDaily", "description": "The aurora borealis and moonglint shine bright in this astronaut photo of the Alaskan island chain. An astronaut aboard the International Space Station (ISS) captured this stunning photo of the Aleutian Islands off the coast of mainland Alaska. The archipelag…", "url": "https://scitechdaily.com/astronauts-breathtaking-view-moonglint-volcanic-aleutians-and-aurora-borealis/", "urlToImage": "https://scitechdaily.com/images/Illuminating-the-Aleutians-scaled.jpg", "publishedAt": "2023-08-28T19:27:32Z", "content": "ByNASA Earth ObservatoryAugust 28, 2023\r\nThis photo of the Aleutian Islands is highlighted by the gleaming light of aurora borealis and moonglint. It was captured by an astronaut aboard the Internati… [+3323 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Study shows how historic red tide event of 2020 was fueled by plankton super swimmers - Phys.org", "description": "A major red tide event occurred in waters off Southern California in the spring of 2020, resulting in dazzling displays of bioluminescence along the coast. The spectacle was caused by exceedingly high densities of Lingulodinium polyedra (L. polyedra), a plank…", "url": "https://phys.org/news/2023-08-historic-red-tide-event-fueled.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/historic-red-tide-even.jpg", "publishedAt": "2023-08-28T19:10:01Z", "content": "A major red tide event occurred in waters off Southern California in the spring of 2020, resulting in dazzling displays of bioluminescence along the coast. The spectacle was caused by exceedingly hig… [+8579 chars]"}, {"source": {"id": null, "name": "Martha Stewart"}, "author": "https://www.facebook.com/marthastewart/", "title": "How to Get Artemis Moon Tree Seedlings - Martha Stewart", "description": "NASA is giving education and community organizations the opportunity to receive seedlings that flew around the moon on NASA's Artemis I mission in 2022. The seedlings were grown from tree seeds of five different species, including sycamores, sweetgums, Dougla…", "url": "https://www.marthastewart.com/how-to-get-nasa-artemis-moon-tree-seedlings-7853372", "urlToImage": "https://www.marthastewart.com/thmb/MK92yLbHTS_Oaj-PN9HrL6pblMc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/NASA-artemis-moon-seeds-6b715558e6c840f681a2008a90097496.jpg", "publishedAt": "2023-08-28T18:39:02Z", "content": "If you're an avid gardener, it's likely the plants in your landscape were sourced from a variety of different places. Maybe your hydrangea bush was once a cutting you got from a friend or your vining… [+2366 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Doris Elín Urrutia", "title": "Look! New Mars Images Hint at the Explosive History of an Iconic Landmark - Inverse", "description": "A veteran spacecraft captured incredible views of a science-rich region of Mars. But it also cracked open clues as to its formation.", "url": "https://www.inverse.com/science/mars-orbiter-olympus-mons-lycus-sulci-images", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/8/28/d6205793-9bab-4249-acad-bc8b0654d721-perspective_view_of_lycus_sulci_and_yelwa_crater_pillars.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-08-28T18:30:24Z", "content": "A spacecraft has delivered fantastic images of Mars, showcasing textured terrain and a lone crater near the planets most famous landmark.\r\nOlympus Mons is the Solar Systems largest volcano. Its so la… [+3431 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Hubble Finds Intermediate-Mass Protostellar Object in Ara - Sci.News", "description": "The NASA/ESA Hubble Space Telescope has taken a detailed image of the surroundings of the spectacular protostellar object OH 339.88-1.26.", "url": "https://www.sci.news/astronomy/hubble-intermediate-mass-protostellar-object-ara-12214.html", "urlToImage": "https://cdn.sci.news/images/2023/08/image_12214-OH-339.88-1.26.jpg", "publishedAt": "2023-08-28T18:11:51Z", "content": "The NASA/ESA Hubble Space Telescope has taken a detailed image of the surroundings of the spectacular protostellar object OH 339.88-1.26.\r\nThe dark vertical streak at the center of this Hubble image … [+1987 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Launch of revolutionary satellite and 'Moon Sniper' lunar lander scrubbed just before liftoff - KSL.com", "description": "The launch of a revolutionary satellite that will reveal celestial objects in a new light and the", "url": "https://www.ksl.com/article/50718025/launch-of-revolutionary-satellite-and-moon-sniper-lunar-lander-scrubbed-just-before-liftoff", "urlToImage": "https://img.ksl.com/slc/2945/294500/29450037.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-08-28T17:40:35Z", "content": "Estimated read time: 5-6\r\n minutes\r\nTANEGASHIMA, Japan The launch of a revolutionary satellite that will reveal celestial objects in a new light and the \"Moon Sniper\" lunar lander has been postponed.… [+5859 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "India Becomes Fourth Nation to Touch Down on the Moon In Mission to Study its South Pole - Good News Network", "description": "The pair comes equipped with a variety of scientific instruments. The Vikram lander has 4 in total, including one to detect moonquakes.", "url": "https://www.goodnewsnetwork.org/india-becomes-fourth-nation-to-touch-down-on-the-moon-in-mission-to-study-its-south-pole/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/08/Chandrayaan-3s-rover-Pragyan–Image-credit-ISRO.jpg", "publishedAt": "2023-08-28T17:21:13Z", "content": "Chandrayaan-3’s rover Pragyan Image credit: ISRO\r\n“India is on the Moon,” exclaimed S. Somanath, chief of the Indian Space Research Organisation (ISRO) after their lander/rover combo touched down on … [+2399 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Ariana Garcia", "title": "How to see newly discovered Comet Nishimura from Texas now - Chron", "description": "Texas skywatchers can see newfound Comet Nishimura before it potentially disintegrates in September as it makes its closest approach to the Sun.", "url": "https://www.chron.com/news/space/article/comet-nishimura-texas-18334026.php", "urlToImage": "https://s.hdnux.com/photos/01/34/17/10/24179211/3/rawImage.jpg", "publishedAt": "2023-08-28T16:19:04Z", "content": "Comet Nishimura imaged from June Lake, Calif. on Aug. 21, 2023 while sporting a green coma and a thin tail. \r\nA newly discovered comet might be visible to the naked eye in September. However, Texas s… [+2106 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Pew, pew, pew! These plants shoot out their seeds like bullets - Ars Technica", "description": "Witch hazel plants with heavier seeds have larger capsules to store more elastic energy.", "url": "https://arstechnica.com/science/2023/08/pew-pew-pew-these-plants-shoot-out-their-seeds-like-bullets/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/shootingseedTOP-760x380.jpg", "publishedAt": "2023-08-28T16:08:34Z", "content": "30 with \r\nScientists have measured just how fast members of the witch hazel family can shoot their seeds thanks to spring-loaded fruits.\r\nThe flowering shrubs known as witch hazel are perhaps best kn… [+5158 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Solving a Stellar Mystery – Astronomers Discover Elusive Planet Responsible for Spiral Arms Around Its Star - SciTechDaily", "description": "Researchers from the University of Arizona have found a youthful exoplanet that may shed light on this phenomenon and offer insights into how planets form. Illustrations of the Milky Way exhibit a spiraling design of \"arms\" loaded with stars that radiate from…", "url": "https://scitechdaily.com/solving-a-stellar-mystery-astronomers-discover-elusive-planet-responsible-for-spiral-arms-around-its-star/", "urlToImage": "https://scitechdaily.com/images/Protoplanetary-Disk-With-Spiral-Arms.jpg", "publishedAt": "2023-08-28T14:52:54Z", "content": "ByUniversity of ArizonaAugust 28, 2023\r\nImage of a giant planet driving spiral arms in a protoplanetary disk from theoretical simulations. Credit: L. Krapp and K. Kratter, University of Arizona\r\nRese… [+10659 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Annie Corinne Shaink, Brandon Specktor", "title": "15 incredible images of Earth's moon - Livescience.com", "description": "See Earth's ancient companion like never before with this gallery of incredible satellite, telescope and lunar orbiter images of the moon.", "url": "https://www.livescience.com/space/the-moon/incredible-images-of-earths-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/x9RDkY3hJr6BgVw7obMwHa-1200-80.jpg", "publishedAt": "2023-08-28T14:00:00Z", "content": "Earth and the moon have shared an intimate bond for at least 4.5 billion years, making the two bodies one of the most successful power couples in our planet's history. You can see the moon with the n… [+3511 chars]"}]}