{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Earth's inner core rotation slows down and reverses direction. What does this mean for the planet? - Study Finds", "description": "Earth's inner core, a solid iron sphere nestled deep within our planet, has slowed its rotation, according to new research", "url": "https://studyfinds.org/earth-inner-core-rotation-slows/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2024/06/Earth-inner-core-scaled.jpg", "publishedAt": "2024-06-13T19:13:50Z", "content": "LOS ANGELES — Earth’s inner core, a solid iron sphere nestled deep within our planet, has slowed its rotation, according to new research. Scientists from the University of Southern California say the… [+5066 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Owen Bellwood", "title": "Space Travel Makes You Dumber - Jalopnik", "description": "A study looked into brain function of four privateer astronauts who spent time in space, and found that their performances dropped in orbit", "url": "https://jalopnik.com/space-travel-makes-you-dumber-1851537160", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/259958893bf04cc0a942cc0c3cde4e57.jpg", "publishedAt": "2024-06-13T18:25:00Z", "content": "Traveling to space should be an eye-opening experience, one that gives you a new perspective of humanity and its place in the cosmos. But while you might think an experience like this would make a pe… [+4012 chars]"}, {"source": {"id": null, "name": "Defector.com"}, "author": null, "title": "Did Your Mother Cradle You Lovingly In Her Suckers? - Defector", "description": "Some would say there is no sweeter image than that of a new mother cradling her cooing infant child. Today, I’d like to share with you an even sweeter picture: a new mother cradling 30 to 40 of her children, who are still eggs, in her hooked and sucker-covere…", "url": "https://defector.com/did-your-mother-cradle-you-lovingly-in-her-suckers", "urlToImage": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2024/06/mbaris-advanced-underw.jpg", "publishedAt": "2024-06-13T17:25:00Z", "content": "Some would say there is no sweeter image than that of a new mother cradling her cooing infant child. Today, I'd like to share with you an even sweeter picture: a new mother cradling 30 to 40 of her c… [+4576 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Scientists find a surprise ingredient in exoplanet cake mix — sulfur dioxide - Space.com", "description": "Exoplanet GJ 3470b, is a weird sulfurous world that orbits over its star's poles.", "url": "https://www.space.com/exoplanet-sulfur-dioxide-gj3470b", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6NE2SVNJ3DJv5Ms3L5XpG5-1200-80.jpg", "publishedAt": "2024-06-13T15:00:01Z", "content": "A 'hot Neptune' exoplanet\r\n has been found to contain sulfur dioxide in its atmosphere — an atmosphere that's also gushing into space as the planet loops over its star's poles on a steeply inclined o… [+6363 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Researchers accidentally discover that mixing water with a peptide results in self-assembling and self-healing glass - Phys.org", "description": "A team of materials scientists from Tel Aviv University and Ben-Gurion University of the Negev, both in Israel, working with a colleague from California Institute of Technology, in the U.S., has found that mixing a certain peptide with water results in the cr…", "url": "https://phys.org/news/2024-06-accidentally-peptide-results-glass.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/researchers-accidental.jpg", "publishedAt": "2024-06-13T13:20:56Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+2279 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA calls off spacewalk at International Space Station due to 'spacesuit discomfort' - Space.com", "description": "The call was made about an hour before the two astronauts were scheduled to exit the airlock.", "url": "https://www.space.com/nasa-astronauts-spacewalk-june-13-2024-postponed", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Fb39yuyEuLtH2W5k9BT7LA-1200-80.jpg", "publishedAt": "2024-06-13T12:54:18Z", "content": "The spacewalk scheduled for two NASA astronauts today (June 13) has been postponed.\r\nInternational Space Station (ISS) Expedition 71 crew members Tracy Dyson and Matt Dominick will not be performing … [+2543 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Cosmic 'koi fish' swims through starry sea in stunning telescope photo - Space.com", "description": "The dust and gas of the colorful nebula resembles the vibrant fish.", "url": "https://www.space.com/eso-cosmic-koi-fish-nebula-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Xuit6VoNsSgbuxMS8fNCKE-1200-80.jpg", "publishedAt": "2024-06-13T12:00:52Z", "content": "A bright pink koi fish has been spotted swimming across the southern sky. \r\nThe European Southern Observatory's (ESO) VLT Survey Telescope\r\n (VST) snapped a beautiful new view of the Gum 3 nebula, lo… [+2403 chars]"}, {"source": {"id": null, "name": "Daily Beast"}, "author": "Dan Ladden-Hall", "title": "Elon Musk's SpaceX Addresses Terrifying Space Station Audio - The Daily Beast", "description": "An official livestream sparked fears that an astronaut had a serious problem.", "url": "https://www.thedailybeast.com/nasa-addresses-terrifying-international-space-station-audio-broadcast", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2394,w_4256,x_0,y_69/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1718272363/STS-135_final_flyaround_of_ISS_1_ki0k49", "publishedAt": "2024-06-13T11:52:13Z", "content": "An official NASA livestream that appeared to indicate that a dire medical emergency was unfolding on board the International Space Station Wednesday was only a test, Elon Musks SpaceX said. \r\nThe aud… [+2157 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco", "title": "‘Dyson spheres’ were theorized as a way to detect alien life. Scientists say they’ve found potential evidence - CNN", "description": "New research suggests stars in the Milky Way give off infrared heat expected from Dyson spheres, which physicist Freeman Dyson theorized could be created by intelligent life.", "url": "https://www.cnn.com/2024/06/13/science/dyson-spheres-alien-life-evidence-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-698572974.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-06-13T11:00:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWhat would be the ultimate solution to the energy prob… [+11429 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Erik Van Aken", "title": "Does chaos theory square classical physics with human agency? - Aeon", "description": "Can a butterfly’s wings trigger a distant hurricane? The answer depends on the perspective you take: physics or human agency", "url": "https://aeon.co/essays/does-chaos-theory-square-classical-physics-with-human-agency", "urlToImage": "https://images.aeonmedia.co/images/1092d52d-63eb-4862-b025-b81958b05256/essay-franklin-arts-butterfly-balances-on_leaf.jpg?width=1200&quality=75&format=auto", "publishedAt": "2024-06-13T10:00:51Z", "content": "A slight shift in Cleopatras beauty, and the Roman Empire unravels. You miss your train, and an unexpected encounter changes the course of your life. A butterfly alights from a tree in Michoacán, tri… [+23693 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Northern Lights: 20 Dark Sky Places In The U.S. For The Best Views - Forbes", "description": "If and when another strong geomagnetic storm is predicted—as happened on May 10 this year—here’s where to head in the U.S. for dark skies.", "url": "https://www.forbes.com/sites/jamiecartereurope/2024/06/13/northern-lights-20-dark-sky-places-in-the-us-for-the-best-views/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6669c5e048a98fb6a685391a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-06-13T10:00:00Z", "content": "The northern lights or aurora borealis as seen from the coast of Lake Superior on the beach at ... [+] Whitefish Point via a long exposure in September of 2022.\r\ngetty\r\nAlthough theres no significant… [+3397 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Steven Levy", "title": "If Ray Kurzweil Is Right (Again), You'll Meet His Immortal Soul in the Cloud - WIRED", "description": "The famed futurist remains inhumanly optimistic about the world and his own fate—and thinks the singularity is minutes away.", "url": "https://www.wired.com/story/big-interview-ray-kurzweil/", "urlToImage": "https://media.wired.com/photos/665f455149cc64c0d8e3af06/191:100/w_1280,c_limit/BI_Kurzweil_Paterson_1.jpg", "publishedAt": "2024-06-13T10:00:00Z", "content": "You put a stake in the ground with your book The Singularity Is Near. This one is called The Singularity Is Nearer. How do you define the singularity?\r\nTo me its when a human will not only be able to… [+2588 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Ray Kurzweil", "title": "The Secret to Living Past 120 Years Old? Nanobots - WIRED", "description": "In The Singularity Is Nearer: When We Merge With AI, the spiritual sequel to his (in)famous first book, Ray Kurzweil doubles down on the promise of immortality.", "url": "https://www.wired.com/story/the-singularity-is-nearer-book-ray-kurzweil/", "urlToImage": "https://media.wired.com/photos/6668d8ec4b352fb60ae73928/191:100/w_1280,c_limit/Kurweil-grid-03.jpg", "publishedAt": "2024-06-13T10:00:00Z", "content": "Ive had many conversations over the years about life extension, and the idea often meets resistance. People become upset when they hear of an individual whose life has been cut short by a disease, ye… [+3401 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Wild New Study Suggests Gravity Can Exist Without Mass - ScienceAlert", "description": "What is gravity without mass? Both Newton's revolutionary laws describing its universal effect and Einstein's proposal of a dimpled spacetime, we've thought of gravity as exclusively within the domain of matter.", "url": "https://www.sciencealert.com/wild-new-study-suggests-gravity-can-exist-without-mass", "urlToImage": "https://www.sciencealert.com/images/2024/06/WeirdGravityAbstractPurple.jpg", "publishedAt": "2024-06-13T06:15:55Z", "content": "What is gravity without mass? Both Newton's revolutionary laws describing its universal effect and Einstein's proposal of a dimpled spacetime, we've thought of gravity as exclusively within the domai… [+3412 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Jijo Malayil", "title": "Seashell-inspired cement is super stretchy, crack-resistant, unbreakable - Interesting Engineering", "description": "Researchers draw inspiration from oyster shells to create a durable cement composite which is more flexible and crack-resistant.", "url": "https://interestingengineering.com/innovation/seashell-inspired-cement-composite", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/06/iStock-1442490018-1.jpg", "publishedAt": "2024-06-13T05:16:00Z", "content": "Cross-sectional view and SEM micrograph illustrate the brick-and-mortar structure of natural nacre, showcasing aragonite tablets connected by a flexible organic matrix.\r\nThe group drew inspiration fo… [+860 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stellar Fireworks: Hubble Revisits a Strange Star's 40-Year Nova Mystery - SciTechDaily", "description": "Hubble Telescope Revisits a Star System That is Still Extraordinarily Hot If we could gaze down upon the magnificent spiral structure of our Milky Way galaxy from far above, and compress millions of years into seconds, we would see brief bursts of light, like…", "url": "https://scitechdaily.com/stellar-fireworks-hubble-revisits-a-strange-stars-40-year-nova-mystery/", "urlToImage": "https://scitechdaily.com/images/Nova-in-Binary-Star-System-HM-Sagittae-scaled.jpg", "publishedAt": "2024-06-13T03:04:30Z", "content": "This artist’s concept shows the nova system HM Sagittae (HM Sge), where a white dwarf star is pulling material from its red giant companion. This forms a blazing hot disk around the dwarf, which can … [+7793 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Patrick Reilly", "title": "'Once-in-a-lifetime' nova explosion will appear to add new star to night sky in dazzling spectacle: NASA - New York Post ", "description": "“It’ll fuel the next generation of scientists,” said Dr. Rebekah Hounsell, an assistant research scientist.", "url": "https://nypost.com/2024/06/12/us-news/once-in-a-lifetime-nova-explosion-will-appear-to-add-new-star-to-night-sky-in-dazzling-spectacle-nasa/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/06/www-nasa-gov-centers-and-83706752.jpg?quality=75&strip=all&w=1024", "publishedAt": "2024-06-13T02:59:00Z", "content": "Scientists around the world are anxiously waiting for a cosmic nova event that will appear to add a new star to the night sky sometime between now and September, according to NASA.\r\nThe spectacle wil… [+2609 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Magic: How “Super Photons” Are Shaping the Future of Physics - SciTechDaily", "description": "Researchers at the University of Bonn have demonstrated that super photons, or photon Bose-Einstein condensates, conform to fundamental physics theorems, enabling insights into properties that are often difficult to observe. Under suitable conditions, thousan…", "url": "https://scitechdaily.com/quantum-magic-how-super-photons-are-shaping-the-future-of-physics/", "urlToImage": "https://scitechdaily.com/images/Photonic-Bose-Einstein-Condensate.jpg", "publishedAt": "2024-06-13T00:04:16Z", "content": "Artist’s view of a photonic Bose-Einstein condensate (yellow) in a bath of dye molecules (red) that has been perturbated by an external light source (white flash). Credit: A. Erglis/Albert-Ludwigs Un… [+5566 chars]"}, {"source": {"id": null, "name": "The Seattle Times"}, "author": "Paige Cornwell", "title": "Apollo 8 astronaut Bill Anders died of blunt-force injuries, coroner says - The Seattle Times", "description": "Retired Maj. Gen. William Anders, an Apollo 8 astronaut, died of multiple blunt-force injuries when the plane he was piloting last week crashed.", "url": "https://www.seattletimes.com/seattle-news/apollo-8-astronaut-bill-anders-died-of-blunt-force-injuries-coroner-says/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2024/06/06122024_tzr_tzr_161203.jpg?d=1200x630", "publishedAt": "2024-06-12T23:48:42Z", "content": "Retired Maj. Gen. William Anders, the Apollo 8 astronaut, died of multiple blunt-force injuries when the plane he was piloting last week crashed off the coast of Jones Island, officials said Wednesda… [+1514 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "FAA seeks public input on SpaceX Starship’s environmental impact in Florida - UPI News", "description": "Officials with the Federal Aviation Administration are preparing an environmental impact statement regarding licensing for the SpaceX Starship and its super-heavy launch vehicle and want public input.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/upi/5301718233351/2024/1/def05908201dc0b285c5a94c3558e200/v1.5/FAA-seeks-public-input-on-SpaceX-Starships-environmental-impact-in-Florida.jpg", "publishedAt": "2024-06-12T23:36:41Z", "content": "June 12 (UPI) -- Officials with the Federal Aviation Administration are preparing an environmental impact statement regarding licensing for the SpaceX Starship and its super-heavy launch vehicle and … [+2217 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "The Earth May Be Swimming Through Dark Matter, Scientists Say - Futurism", "description": "Researchers suggest we should hunt for an ultralight dark matter candidate in the Earth's ionosphere, a \"long shot.\"", "url": "https://futurism.com/the-byte/earth-swimming-dark-matter", "urlToImage": "https://wp-assets.futurism.com/2024/06/earth-swimming-dark-matter2.jpg", "publishedAt": "2024-06-12T21:37:23Z", "content": "It's an intriguing theory.\r\nDark Wave\r\nResearchers suggest our planet is being battered by waves of dark matter, the elusive stuff that's believed to make up 27 percent of the universe, though scient… [+2710 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Einstein Telescope could launch a new era in astronomy - Phys.org", "description": "It's still just a plan, but a new telescope could soon be measuring gravitational waves. Gravitational waves are something like the sound waves of the universe. They are created, for example, when black holes or neutron stars collide.", "url": "https://phys.org/news/2024-06-einstein-telescope-era-astronomy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/einstein-telescope-lau.jpg", "publishedAt": "2024-06-12T20:39:06Z", "content": "It's still just a plan, but a new telescope could soon be measuring gravitational waves. Gravitational waves are something like the sound waves of the universe. They are created, for example, when bl… [+11878 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ryan Weber", "title": "Starship Flight 4 milestones effect changes to Flight 5's Ship - NASASpaceFlight.com - NASASpaceflight.com", "description": "Following the highly successful milestones achieved by Booster 11 and Ship 29 on Flight 4…", "url": "https://www.nasaspaceflight.com/2024/06/starship-flight-4-milestones-flight-5/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/06/Flight-4-Liftoff-512x350.jpg", "publishedAt": "2024-06-12T20:29:46Z", "content": "8Following the highly successful milestones achieved by Booster 11 and Ship 29 on Flight 4 of SpaceX’s Starship, engineers are already implementing lessons learned from the mission ahead of the next … [+8896 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "ESA-China moon cooperation could end with Chang'e-6 - SpaceNews", "description": "ESA-China moon cooperation could end with Chang’e-6 European-Chinese cooperation in lunar exploration could come to an end despite successful collaboration in the ongoing Chang’e-6 mission.", "url": "https://spacenews.com/esa-china-moon-cooperation-could-end-with-change-6/", "urlToImage": "https://spacenews.com/wp-content/uploads/2024/06/Chang_e-6_landing_site_on_the_far_side_of_the_Moon-scaled.jpg", "publishedAt": "2024-06-12T20:28:43Z", "content": "HELSINKI European-Chinese cooperation in lunar exploration could come to an end despite successful collaboration in the ongoing Change-6 mission.\r\nESA provided a payload for Chinas Change-6 complex l… [+4073 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Coming in hot: NASA's Chandra checks habitability of exoplanets - Phys.org", "description": "Using NASA's Chandra X-ray Observatory and ESA's (European Space Agency's) XMM-Newton, astronomers are exploring whether nearby stars could host habitable exoplanets, based on whether they emit radiation that could destroy potential conditions for life as we …", "url": "https://phys.org/news/2024-06-hot-nasa-chandra-habitability-exoplanets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/coming-in-hot-nasas-ch.jpg", "publishedAt": "2024-06-12T20:13:47Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5415 chars]"}, {"source": {"id": null, "name": "Miami Herald"}, "author": "Miami Herald", "title": "Prehistoric sea ‘phantom’ — 100 million years old — found in Australia. Take a look - Miami Herald", "description": null, "url": "https://www.miamiherald.com/news/nation-world/world/article289220424.html", "urlToImage": null, "publishedAt": "2024-06-12T20:10:13Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists adapt astronomy method to unblur microscopy images - Phys.org", "description": "A team led by researchers at HHMI's Janelia Research Campus has adapted a class of techniques employed in astronomy to unblur images of far-away galaxies for use in the life sciences, providing biologists with a faster and cheaper way to get clearer and sharp…", "url": "https://phys.org/news/2024-06-scientists-astronomy-method-unblur-microscopy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/scientists-adapt-astro-1.jpg", "publishedAt": "2024-06-12T20:03:17Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+420 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Molly Rosbach", "title": "Pacific coast gray whales have gotten 13% shorter in the past 20–30 years, study finds - Phys.org", "description": "Gray whales that spend their summers feeding in the shallow waters off the Pacific Northwest coast have undergone a significant decline in body length since around the year 2000, a new Oregon State University study has found.", "url": "https://phys.org/news/2024-06-pacific-coast-gray-whales-shorter.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/pacific-coast-gray-wha.jpg", "publishedAt": "2024-06-12T19:21:04Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5156 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Satellite 'megaconstellations' may jeopardize recovery of ozone hole - Phys.org", "description": "When old satellites fall into Earth's atmosphere and burn up, they leave behind tiny particles of aluminum oxide, which eat away at Earth's protective ozone layer. A new study finds that these oxides have increased 8-fold between 2016 and 2022 and will contin…", "url": "https://phys.org/news/2024-06-satellite-megaconstellations-jeopardize-recovery-ozone.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/satellite-megaconstell.jpg", "publishedAt": "2024-06-12T18:06:30Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+4633 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astronomers discover parallel disks and jets erupting from a pair of young stars - Phys.org", "description": "Most of the universe is invisible to the human eye. The building blocks of stars are only revealed in wavelengths that are outside of the visible spectrum. Astronomers recently used two very different, and very powerful, telescopes to discover twin disks—and …", "url": "https://phys.org/news/2024-06-astronomers-parallel-disks-jets-erupting.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/its-twins-astronomers.jpg", "publishedAt": "2024-06-12T18:05:25Z", "content": "Most of the universe is invisible to the human eye. The building blocks of stars are only revealed in wavelengths that are outside of the visible spectrum. Astronomers recently used two very differen… [+3950 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Private Odysseus moon lander reveals which Earth 'technosignatures' aliens might see - Space.com", "description": "Astrophysicist Jack Burns of the University of Colorado Boulder described the moment as the \"dawn of radio astronomy from the moon.\"", "url": "https://www.space.com/odysseus-moon-lander-alien-technosignatures-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nCxtghU5cjFG5PCA5RG7jC-1200-80.jpg", "publishedAt": "2024-06-12T18:00:01Z", "content": "Human technology like cell phones and broadcast towers constantly radiate radio waves into space\r\n, and astronomers estimate this tell-tale signature of humanity has swept across 75 nearby star syste… [+4736 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "MJ Banias, MJ Banias", "title": "Mysterious Space Object Transmitting Radio Signals Every 54 Minutes Baffles Scientists - The Debrief", "description": "Astronomers have detected a mysterious radio signal from deep space that evades current scientific understanding.", "url": "https://thedebrief.org/mysterious-space-object-transmitting-radio-signals-every-54-minutes-baffles-scientists/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2024/06/ASKAP.jpg", "publishedAt": "2024-06-12T17:43:04Z", "content": "Astronomers have detected a peculiar radio signal originating from deep space that evades current scientific understanding. Designated ASKAP J1935+2148, the signal repeats every 53.8 minutes, making … [+4431 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Johnny von Einem", "title": "A mountainous mystery uncovered in South Australia's pink sands - Phys.org", "description": "Deposits of deep-pink sand washing up on South Australian shores shed new light on when the Australian tectonic plate began to subduct beneath the Pacific plate, as well as the presence of previously unknown ancient Antarctic mountains.", "url": "https://phys.org/news/2024-06-mountainous-mystery-uncovered-south-australia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/a-mountainous-mystery.jpg", "publishedAt": "2024-06-12T17:03:03Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+3583 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Boeing's Starliner Now Has 5 Leaks While Parked Outside the ISS - Gizmodo", "description": "Starliner teams detected a helium leak before launch, two more after liftoff, and now a fourth and fifth leak with the vehicle docked at the ISS. Oh my.", "url": "https://gizmodo.com/boeing-starliner-spacecraft-fifth-helium-leak-iss-nasa-1851534977", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/54d4a34837543f8cbae01d2ee7934c5a.png", "publishedAt": "2024-06-12T15:55:00Z", "content": "Following an iffy docking at the International Space Station last week, Boeing managed to deliver a pair of NASA astronauts to the orbital lab. The stressful Starliner saga continues as the crew caps… [+3617 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Age is just a number: Immune cell 'epigenetic clock' ticks independently of organism lifespan - Medical Xpress", "description": "While most cell types experience a functional decline after years of proliferation and replication, T cells can proliferate seemingly indefinitely and without detriment.", "url": "https://medicalxpress.com/news/2024-06-age-immune-cell-epigenetic-clock.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/age-is-just-a-number-i.jpg", "publishedAt": "2024-06-12T15:47:04Z", "content": "This article has been reviewed according to Science X's \r\n editorial process\r\n and policies.\r\n Editors have highlighted\r\n the following attributes while ensuring the content's credibility:\r\nfact-chec… [+5450 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "'At least 150000 tons' of water frost discovered atop Mars' tallest volcanoes - Livescience.com", "description": "Once thought impossible to exist, water frost found atop Mars' Tharsis region volcanoes could come in handy for future human exploration missions, new research suggests.", "url": "https://www.livescience.com/space/mars/at-least-150000-tons-of-water-frost-discovered-atop-mars-tallest-volcanoes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FGQ2bbgtGoP6n9k6qofSsi-1200-80.jpg", "publishedAt": "2024-06-12T15:45:12Z", "content": "Water frost has been spotted atop Mars\r\n' gargantuan equatorial volcanoes for the first time — defying previous beliefs that the presence of water there was impossible.\r\nScientists spotted a hair-thi… [+2701 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Vera Demertzis", "title": "ISS astronauts living with drug-resistant ‘superbug’ that mutated in orbit, bombshell study reveals... - The US Sun", "description": "A NEW out-of-this-world ‘superbug’ has been discovered living aboard the International Space Station. Despite the highly controlled environment on the ISS, a bug hitched a ride to space…", "url": "https://www.the-sun.com/tech/11609432/iss-astronauts-living-with-mutated-superbug-in-orbit/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2024/06/195-JS762217298.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2024-06-12T15:29:50Z", "content": "A NEW out-of-this-world 'superbug' has been discovered living aboard the International Space Station.\r\nDespite the highly controlled environment on the ISS, a bug hitched a ride to space, where scien… [+4488 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New theory describes how waves carry information from surroundings - Phys.org", "description": "Waves pick up information from their environment through which they propagate. A theory of information carried by waves has now been developed at TU Wien—with astonishing results that can be utilized for technical applications.", "url": "https://phys.org/news/2024-06-theory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/what-waves-know-about.jpg", "publishedAt": "2024-06-12T15:22:59Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5408 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "NASA's planet hunter satellite observes smaller object in a black hole pair directly for the first time - Phys.org", "description": "Several international research groups have already confirmed the theory that there are two black holes at the center of the distant galaxy OJ 287, first suggested by astronomers at the University of Turku, Finland. A new study shows that satellite observation…", "url": "https://phys.org/news/2024-06-nasa-planet-hunter-satellite-smaller.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/nasas-planet-hunter-sa.jpg", "publishedAt": "2024-06-12T15:02:03Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+4913 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists \"Absolutely Gutted\" as Door Jammed on Expensive Space Telescope, Blocking Its View of Space - Futurism", "description": "One of the aperture doors covering one of the XRISM space telescope's particle-detecting instrument called Resolve has remained jammed.", "url": "https://futurism.com/the-byte/door-jammed-xrism-space-telescope", "urlToImage": "https://wp-assets.futurism.com/2024/06/door-jammed-xrism-space-telescope.jpg", "publishedAt": "2024-06-12T15:01:11Z", "content": "Scientists are \"absolutely gutted.\"\r\nPod Bay Door\r\nAstronomers are excited to glean new insights into the formation of the universe and dark matter with the help of a space telescope called the X-Ray… [+2164 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Earth's 'Great Oxidation Event' was spread over 200 million years, according to recent geochemical discoveries - Phys.org", "description": "About 2.5 billion years ago, free oxygen, or O2, first started to accumulate to meaningful levels in Earth's atmosphere, setting the stage for the rise of complex life on our evolving planet.", "url": "https://phys.org/news/2024-06-earth-great-oxidation-event-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/1-earth.jpg", "publishedAt": "2024-06-12T15:00:01Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5621 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Lost Aerial Photos Hidden From the Nazis Provide Rare Good News About Climate Change - PetaPixel", "description": "The glaciers observed in East Antarctica have maintained their size and even grown in some places.", "url": "https://petapixel.com/2024/06/12/lost-aerial-photos-hidden-from-the-nazis-provide-rare-good-news-about-climate-change/", "urlToImage": "https://petapixel.com/assets/uploads/2024/06/Glacier-2.jpg", "publishedAt": "2024-06-12T14:55:57Z", "content": "The Honnörbrygga Glacier in Lützow-Holm Bay, Antarctica in 1937 compared to a modern Landsat satellite image from 2023. | Mads Dømgaard / Norwegian Polar Institute\r\nA forgotten set of aerial photos t… [+2895 chars]"}, {"source": {"id": null, "name": "Astronomy Magazine"}, "author": "Astronomy Staff", "title": "How can the visible universe be 46 billion light-years in radius when the universe is only 13.8 billion years old? - Astronomy Magazine", "description": "The expansion of the universe explains how it can be so much larger than 13.8 billion light-years across.", "url": "https://www.astronomy.com/science/size-of-the-universe/", "urlToImage": "https://www.astronomy.com/wp-content/uploads/sites/2/2024/06/expanding-universe.png", "publishedAt": "2024-06-12T14:41:20Z", "content": "How can the visible universe be 46 billion light-years in radius when the universe is only 13.8 billion years old? And how can we detect light 46 billion light-years away when the universe has been i… [+2163 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Observations explore the halo of Centaurus A - Phys.org", "description": "Using the Very Large Telescope (VLT) in Chile, astronomers have observed the halo of a nearby giant elliptical galaxy known as Centaurus A. Results of the observational campaign, published June 1 on the pre-print server arXiv, yield important insights into st…", "url": "https://phys.org/news/2024-06-explore-halo-centaurus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/observations-explore-t-1.jpg", "publishedAt": "2024-06-12T14:12:27Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+375 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble Telescope shares stunning galactic view despite recent hardware malfunction (photo) - Space.com", "description": "The aging but tenacious Hubble Space Telescope has beamed back yet another stunning photo of a distant galaxy.", "url": "https://www.space.com/hubble-telescope-stunning-galaxy-photo-ngc-3059", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UPiu53VEr8yrdbGSXLvL2U-1200-80.jpg", "publishedAt": "2024-06-12T14:00:00Z", "content": "The aging but tenacious Hubble Space Telescope has beamed back yet another stunning photo of a distant galaxy. \r\nHubble\r\n's latest view captures the barred spiral galaxy\r\n NGC 3059, which lies about … [+2512 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Ashley Balzer", "title": "NASA's Roman Mission Gets Cosmic 'Sneak Peek' From Supercomputers - NASA", "description": "Researchers are diving into a synthetic universe to help us better understand the real one. Using supercomputers at the U.S. DOE's (Department of Energy’s)", "url": "https://www.nasa.gov/missions/roman-space-telescope/nasas-roman-mission-gets-cosmic-sneak-peek-from-supercomputers/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/06/roman-simulation-banner.jpg", "publishedAt": "2024-06-12T14:00:00Z", "content": "Researchers are diving into a synthetic universe to help us better understand the real one. Using supercomputers at the U.S. DOE’s (Department of Energys) Argonne National Laboratory in Illinois, sci… [+6558 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Ed Stone, who led NASA's iconic Voyager project for 50 years, dies at 88 - Space.com", "description": "Stone was the pioneering mission's sole project scientist for half a century.", "url": "https://www.space.com/ed-stone-nasa-voyager-mission-project-scientist-obituary", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AyVBXUPgoU4CgqMQokWrga-1200-80.jpg", "publishedAt": "2024-06-12T13:37:07Z", "content": "Humanity has lost an interstellar pioneer.\r\nEd Stone, who served as the project scientist for NASA's groundbreaking Voyager mission from 1972 to 2022, died on Sunday (June 9) at the age of 88.\r\n\"Ed S… [+5816 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": "Rohan Rajeev", "title": "Kavli Prize in Nanoscience goes to three biomedical innovators | STAT - STAT", "description": "The work of three Kavli Prize laureates collectively revolutionized medical treatment on the nanoscale — with applications from therapeutics and vaccines to bioimaging and diagnostics.", "url": "https://www.statnews.com/2024/06/12/kavli-prize-nanoscience-2024-biomedicine-langer-alivisatos-mirkin/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2024/06/Kavli-prize-in-nanoscience-1024x576.jpg", "publishedAt": "2024-06-12T13:07:40Z", "content": "Three scientists Robert Langer, Paul Alivisatos, and Chad Mirkin were awarded the 2024 Kavli nanoscience prize for their seminal work in biomedicine, the Norwegian Academy of Sciences and Letters ann… [+4878 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "Staged Combustion Engine Fires Up for the First Time, Spits Out 350000 HP in One Second - autoevolution", "description": "Space startup Stoke announced the completion of the first hot fire test of a full-flow, staged-combustion (FFSC) engine for the Nova rocket", "url": "https://www.autoevolution.com/news/staged-combustion-engine-fires-up-for-the-first-time-spits-out-350000-hp-in-one-second-235304.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/staged-combustion-engine-fires-up-for-the-first-time-spits-out-350000-hp-in-one-second-235304_1.jpg", "publishedAt": "2024-06-12T13:07:27Z", "content": "Over the past few years the biggest players in space exploration have begun investing heavily in the R&amp;D of new rockets and ships that can be reused, thus lowering the cost of each launch. You ha… [+4185 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "The Potentially Hazardous Asteroid NASA Is Currently Most Concerned About - IFLScience", "description": "No need to worry, NASA has it all under control.", "url": "https://www.iflscience.com/the-potentially-hazardous-asteroid-nasa-is-currently-most-concerned-about-74593", "urlToImage": "https://assets.iflscience.com/assets/articleNo/74593/aImg/76765/asteroid-1950-da-meta.png", "publishedAt": "2024-06-12T12:31:30Z", "content": "While stood on planet Earth, it's easy to forget that we are sat on a rock hurtling through the Solar System on a path which could feasibly collide with other (smaller) space rocks, largely because w… [+5667 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Study finds Arctic warming three-fold compared to global patterns - Phys.org", "description": "Global warming is an omnipresent issue, with widespread initiatives to draw down emissions and mitigate against the International Panel on Climate Change's worse-case scenario predictions of 3.2°C of warming by 2100 (relative to pre-Industrial levels). Curren…", "url": "https://phys.org/news/2024-06-arctic-global-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/arctic-warming-threefo.jpg", "publishedAt": "2024-06-12T11:50:01Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5042 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "New theory links quantum geometry to electron-phonon coupling - Phys.org", "description": "A new study published in Nature Physics introduces a theory of electron-phonon coupling that is affected by the quantum geometry of the electronic wavefunctions.", "url": "https://phys.org/news/2024-06-theory-links-quantum-geometry-electron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-theory-links-quant.jpg", "publishedAt": "2024-06-12T10:50:01Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+52 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Jenée Desmond-Harris", "title": "Family advice: My wife thinks her family should get equal visiting privileges. I'm not so sure. - Slate", "description": "My wife says I'm being \"overdramatic.\"", "url": "https://slate.com/advice/2024/06/wife-family-visits-noise-dear-prudence-advice.html", "urlToImage": "https://compote.slate.com/images/159646b0-f098-4102-9abe-5fc570577d47.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2024-06-12T10:00:00Z", "content": "Every week, Dear Prudence answers additional questions from readers, just for Slate Plus members. Submit questions here. (Its anonymous!)\r\nDear Prudence,\r\nMy wife and I own a townhouse in a very tour… [+2781 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Third Form of Life Makes Energy in 'Remarkable' Ways, Scientists Discover - ScienceAlert", "description": "As the world turns to green hydrogen and other renewable energy sources, scientists have discovered that archaea – the third form of life after bacteria and eukaryotes – have been making energy using hydrogen gas and 'ultraminimal' enzymes for billions...", "url": "https://www.sciencealert.com/third-form-of-life-makes-energy-in-remarkable-ways-scientists-discover", "urlToImage": "https://www.sciencealert.com/images/2019-05/processed/dallol_spring_nanoarchaea_1024.jpg", "publishedAt": "2024-06-12T07:33:48Z", "content": "As the world turns to green hydrogen and other renewable energy sources, scientists have discovered that archaea the third form of life after bacteria and eukaryotes have been making energy using hyd… [+4231 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "The Milky Way's stars are gradually being ejected - Big Think", "description": "Known as hypervelocity stars, we originally thought just one would be ejected every 100,000 years. The real number is much greater.", "url": "https://bigthink.com/starts-with-a-bang/milky-way-stars-being-ejected/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/06/eso1151b.jpg?resize=1200,630", "publishedAt": "2024-06-12T06:00:00Z", "content": null}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Children Find Dinosaur 'Teen-Rex' Fossil in North Dakota - VOA Learning English", "description": "A group of children searching for dinosaur remains found a young Tyrannosaurus rex in North Dakota. The rare find is now at Colorado museum.", "url": "https://learningenglish.voanews.com/a/children-find-dinosaur-teen-rex-fossil-in-north-dakota/7650107.html", "urlToImage": "https://gdb.voanews.com/bcae3414-3a42-4210-b20b-5fd7129b1f77_w1200_r1.jpg", "publishedAt": "2024-06-11T21:58:00Z", "content": "Two brothers, Liam and Jessin Fisher, were hiking in North Dakota with their father and cousin, Kaiden Madsen, during the summer of 2022.\r\nThey were looking for dinosaur fossils.\r\nAnd they found one.… [+3624 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How Do You Deliver a 7,000-Pound Spacecraft? - NASA Jet Propulsion Laboratory", "description": "How was NASA’s Europa Clipper spacecraft packed and shipped from the agency’s Jet Propulsion Laboratory in Southern California to Kennedy Space Center in Flo...", "url": "https://www.youtube.com/watch?v=dk1rCCrW9NU", "urlToImage": "https://i.ytimg.com/vi/dk1rCCrW9NU/maxresdefault.jpg", "publishedAt": "2024-06-11T21:51:47Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Internet Warps Human Morality - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/internet-morality-psychology-26298/", "urlToImage": null, "publishedAt": "2024-06-11T21:45:26Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Barncard", "title": "Wind from black holes may influence development of surrounding galaxies - Phys.org", "description": "Clouds of gas in a distant galaxy are being pushed faster and faster—at more than 10,000 miles per second—out among neighboring stars by blasts of radiation from the supermassive black hole at the galaxy's center. It's a discovery that helps illuminate the wa…", "url": "https://phys.org/news/2024-06-black-holes-galaxies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/wind-from-black-holes.jpg", "publishedAt": "2024-06-11T21:28:03Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+3899 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Supernova discovery machine' James Webb Space Telescope finds most distant star explosion on record - Space.com", "description": "The powerful space telescope uncovered 80 early and distant star explosions in a patch of sky the size of a grain of rice.", "url": "https://www.space.com/james-webb-space-telescope-supernova-factory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/45Z6p3cRRGN3aW2Jr7cdNR-1200-80.png", "publishedAt": "2024-06-11T21:00:01Z", "content": "When it comes to hunting for the explosive deaths of massive stars in the early universe, the James Webb Space Telescope (JWST) is quite the cosmic detective. This celestial Sherlock Holmes has found… [+6680 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "James Webb telescope reveals 'cataclysmic' asteroid collision in nearby star system - Livescience.com", "description": "The James Webb Space Telescope has caught a snapshot of two massive asteroids colliding in a nearby star system — and it could teach us about how common solar systems like our own are.", "url": "https://www.livescience.com/space/cosmology/james-webb-telescope-reveals-cataclysmic-asteroid-collision-in-nearby-star-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zoVZmHNf7VAoUdwzczcXLH-1200-80.jpg", "publishedAt": "2024-06-11T20:42:07Z", "content": "The James Webb Space Telescope\r\n (JWST) has found evidence of two giant asteroids slamming into each other in a nearby star system. The colossal collision ejected 100,000 times more dust than the imp… [+3745 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Eric Stann", "title": "Scientists spot more Milky Way-like galaxies in early universe, advancing our understanding of how galaxies were formed - Phys.org", "description": "University of Missouri scientists are peering into the past and uncovering new clues about the early universe. Since light takes a long time to travel through space, they are now able to see how galaxies looked billions of years ago.", "url": "https://phys.org/news/2024-06-scientists-milky-galaxies-early-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/mizzou-scientists-spot-1.jpg", "publishedAt": "2024-06-11T20:03:18Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+2723 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Solving an Eons-Old Mystery: Paleontologists Shed New Light on the Extinction of the Wooly Rhinoceros - SciTechDaily", "description": "Advanced computer modeling reveals that sustained human hunting contributed to the woolly rhinoceros's extinction by blocking their migration to new habitats during post-Ice Age warming, highlighting the ongoing impact of human activity on large animal specie…", "url": "https://scitechdaily.com/solving-an-eons-old-mystery-paleontologists-shed-new-light-on-the-extinction-of-the-wooly-rhinoceros/", "urlToImage": "https://scitechdaily.com/images/Woolly-Rhinoceroses.jpg", "publishedAt": "2024-06-10T11:30:01Z", "content": "Woolly rhinoceroses were once widely distributed across northern and central Eurasia, before going extinct some 10,000 years ago. Credit: Mauricio Anton\r\nAdvanced computer modeling reveals that susta… [+3663 chars]"}]}