{"status": "ok", "totalResults": 41, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Magical Combination – Scientists Develop a New Class of Materials - SciTechDaily", "description": "Would you rather run into a brick wall or into a mattress? The majority of people would find this decision straightforward. The hardness of a brick wall does not effectively dampen shocks or vibrations, whereas a mattress, with its softness, serves as an exce…", "url": "https://scitechdaily.com/a-magical-combination-scientists-develop-a-new-class-of-materials/", "urlToImage": "https://scitechdaily.com/images/Buckled-Material.jpg", "publishedAt": "2023-06-05T08:24:27Z", "content": "A buckled material that is both stiff and good at absorbing vibrations. Credit: D. Dykstra et al.\r\nWould you rather run into a brick wall or into a mattress? The majority of people would find this de… [+3418 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": ", Florida Today", "title": "SpaceX will try to launch two Falcon 9 rockets from Florida on Sunday - Florida Today", "description": "SpaceX will try to launch two Falcon 9 rockets from Cape Canaveral and Kennedy Space Center this weekend after one mission was delayed due to weather.", "url": "https://www.floridatoday.com/story/tech/science/space/2023/06/03/spacex-will-try-to-launch-two-falcon-9-rockets-from-florida-on-sunday/70284733007/", "urlToImage": "https://www.gannett-cdn.com/presto/2023/06/02/PBRE/0099c3b3-be54-489b-8c29-86823f0aeaa5-SpaceX_Cargo_Dragon_CRS-28.jpg?auto=webp&crop=2999,1687,x0,y305&format=pjpg&width=1200", "publishedAt": "2023-06-05T03:02:35Z", "content": "Update: Liftoff of Falcon 9 at 8:20 a.m. EDT with 22 second-generation Starlink V2 Mini internet satellites from Cape Canaveral Space Force Station in Florida! After a flight toward the southeast, th… [+3126 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Behind Galactic Bars: Webb Telescope Unlocks Secrets of Star Formation - SciTechDaily", "description": "NASA's James Webb Space Telescope has captured a detailed image of the barred spiral galaxy NGC 5068. Part of a project to record star formation in nearby galaxies, this initiative provides significant insights into various astronomical fields. The telescope'…", "url": "https://scitechdaily.com/?p=283229", "urlToImage": "https://scitechdaily.com/images/NGC-5068-Webb-Composite-scaled.jpg", "publishedAt": "2023-06-05T02:22:03Z", "content": "ByNASAJune 4, 2023\r\nThis image of the barred spiral galaxy NGC 5068 is a composite from two of the James Webb Space Telescopes instruments, MIRI and NIRCam. Credit: ESA/Webb, NASA &amp; CSA, J. Lee a… [+8603 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Links: June 4, 2023 | Hackaday - Hackaday", "description": "A report released this week suggests that 50 flights into its five-flight schedule, the Mars helicopter might be starting to show its age. The report details a protracted communications outage Inge…", "url": "https://hackaday.com/2023/06/04/hackaday-links-june-4-2023/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2023-06-04T23:00:00Z", "content": "A report released this week suggests that 50 flights into its five-flight schedule, the Mars helicopter might be starting to show its age. The report details a protracted communications outageIngenui… [+5031 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Iron Age: Metal Fuel for Carbon-Free Energy on Earth… and the Moon - SciTechDaily", "description": "Researchers have utilized microgravity experiments to study discrete burning of iron powder, leading to carbon-free, endlessly recyclable energy storage. This has promising applications on Earth and for future sustainable lunar outposts. Everything burns. Giv…", "url": "https://scitechdaily.com/a-new-iron-age-metal-fuel-for-carbon-free-energy-on-earth-and-the-moon/", "urlToImage": "https://scitechdaily.com/images/Iron-Burning.gif", "publishedAt": "2023-06-04T21:14:18Z", "content": "Scientists have conducted research on discrete burning, a form of fire that jumps from one fuel source to another, using iron powder in zero gravity. The leftover product after combustion is iron oxi… [+5592 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "'Zombie viruses': Ancient diseases climate change will bring back - The Jerusalem Post", "description": "A look at four \"zombie\" viruses from ancient times set to come out of the permafrost, and one other hidden disease proven to be deadly for humans.", "url": "https://www.jpost.com/health-and-wellness/article-745175", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/520300", "publishedAt": "2023-06-04T16:37:00Z", "content": "A number of zombie viruses have been pulled out from the permafrost by scientists, giving insight into what secrets may lie hidden beneath the ice.\r\nPermafrost is an area of ground where everything, … [+6679 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Steve Huff", "title": "One of Saturn's Moons Is Spraying Epic Water Plumes - Newser", "description": "Tiny, bright satellite of Enceladus dazzles astronomers with its geysers", "url": "https://www.newser.com/story/335953/one-of-saturns-moons-is-spraying-epic-water-plumes.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1475094-12-20230604105700.jpeg", "publishedAt": "2023-06-04T15:57:00Z", "content": "Enceladus, Saturn's sixth-largest moon—and the solar system's most reflective object—has been putting on a show, spraying massive volumes of water into space. Aided by the James Webb Space Telescope,… [+1561 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Secrets of Hypernuclei Flow: First Observations at Relativistic Heavy Ion Collider - SciTechDaily", "description": "Particle collisions offer a new way to study interactions of hyperon particles with ordinary nuclear building blocks, potentially giving insight into the properties of neutron stars. In a groundbreaking study, scientists at the RHIC observed the directed flow…", "url": "https://scitechdaily.com/secrets-of-hypernuclei-flow-first-observations-at-relativistic-heavy-ion-collider/", "urlToImage": "https://scitechdaily.com/images/Particle-Collision-Hypernuclei-Flow-Concept.jpg", "publishedAt": "2023-06-04T15:28:03Z", "content": "ByBrookhaven National LaboratoryJune 4, 2023\r\nPhysicists at the Relativistic Heavy Ion Collider (RHIC) have made the first observation of the directed flow of hypernuclei, rare nuclei containing at l… [+9628 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify 240-Million-Year-Old Mystery Ancient Marine Reptile - SciTechDaily", "description": "New research reveals that sulfur minerals that make fossils in the Norwegian archipelago are especially well-suited to radiography. X-ray analysis has led to the categorization of a previously-unidentified marine reptile fossil discovered in Edgeøya, Svalbard…", "url": "https://scitechdaily.com/scientists-identify-240-million-year-old-mystery-ancient-marine-reptile/", "urlToImage": "https://scitechdaily.com/images/Radiography-Imaging-of-a-Middle-Triassic-Mixosaurid-From-Svalbard.jpg", "publishedAt": "2023-06-04T13:11:09Z", "content": "ByPLOSJune 4, 2023\r\nPhotograph of specimen PMO 219.250. Credit: Engelschiøn et al. PLOS ONE, CC-BY 4.0\r\nNew research reveals that sulfur minerals that make fossils in the Norwegian archipelago are es… [+3753 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Grace Eliza Goodwin", "title": "Scientists see brain activity surge in dying patients, may explain NDEs - Business Insider", "description": "A recent study found that some patients' brains continued pumping out gamma waves even after their hearts had stopped.", "url": "https://www.businessinsider.com/scientists-see-brain-activity-surge-in-dying-patients-2023-6", "urlToImage": "https://i.insider.com/6478eaf3085acb0018ff36b1?width=1200&format=jpeg", "publishedAt": "2023-06-04T12:21:00Z", "content": "Scientists saw a surge in brain activity in dying patients. It's one of the very few times where researchers have had the opportunity to measure brain activity in humans immediately before and after … [+2062 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Earth's new “quasi-moon” will stick around for hundreds of years - Earth.com", "description": "Earth's new “quasi-moon” will stick around for hundreds of years • Earth.com", "url": "https://www.earth.com/news/earths-new-quasi-moon-will-stick-around-for-hundreds-of-years/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/04055044/Quasi-moon2-scaled.jpg", "publishedAt": "2023-06-04T11:52:47Z", "content": "Astronomers have recently discovered an asteroid that tags along with our planet during its annual journey around the sun. Dubbed 2023 FW13, this asteroid is considered by experts to be a quasi-moon … [+4054 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Celestial Morse Code? New study reveals mysterious dashes at heart of Milky Way - WION", "description": "Celestial Morse Code? New study reveals mysterious dashes at heart of Milky Way", "url": "https://www.wionews.com/science/celestial-morse-code-new-study-reveals-mysterious-dashes-at-heart-of-milky-way-600396", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/06/04/356816-untitled-design-2023-06-04t174540598.png", "publishedAt": "2023-06-04T11:44:56Z", "content": "A groundbreaking discovery has emerged from the heart of the Milky Way where an international team of astrophysicists stumbled upon an entirely new population of threads at the centre of this massive… [+3268 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "Forget the 'Einstein' tile, meet the true aperiodic tile 'Spectre' - Interesting Engineering", "description": "A new tile called \"Spectre,\" a close relative of that \"Einstein\" tile revealed in March 2023, may have solved a decades-long mathematical problem.", "url": "https://interestingengineering.com/innovation/einstein-true-aperiodic-tile-spectre", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/03/image/jpeg/V4SPEZyhOHjooDO8ZtwvLDKCnw0q4hUY7bnPQnqQ.jpg", "publishedAt": "2023-06-04T11:35:00Z", "content": "Not wanting to leave this problem unsolved, the team kept working. They found a different shape closely related to the hat but could cover the surface without needing to be flipped over. It still did… [+853 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "Comet C/2021 T4 Lemmon is sweeping through southern skies - EarthSky", "description": null, "url": "https://earthsky.org/astronomy-essentials/comet-c-2021-t4-lemmon-is-sweeping-southern-skies/", "urlToImage": "https://earthsky.org/upl/2023/05/Comet-C-2021-T4-from-space.jpg", "publishedAt": "2023-06-04T10:24:50Z", "content": "This space view is from 20° north of the ecliptic plane and from longitude 235°. Grid lines on the plane are 1 astronomical unit (AU), the distance between the sun and the Earth. The ram’s-horn symbo… [+3734 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Our Cells Kill Themselves – Scientists Decode the Exact Mechanism at the Atomic Level - SciTechDaily", "description": "In our bodies, millions of cells meet their end on a daily basis. Contrary to popular belief, cells don't just explode when they die. Instead, a particular protein acts as a trigger for the rupture of the cell membrane. Scientists from the University of Basel…", "url": "https://scitechdaily.com/how-our-cells-kill-themselves-scientists-decode-the-exact-mechanism-at-the-atomic-level/", "urlToImage": "https://scitechdaily.com/images/Ninjurin-1-Proteins-Form-Holes-in-the-Cell-Membrane.jpg", "publishedAt": "2023-06-04T09:29:26Z", "content": "Ninjurin-1 proteins assemble (green/yellow) into filaments and rupture the cell membrane (gray) until the cell disintegrates completely. Intracellular components are shown in blue. Credit: Biozentrum… [+3930 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 28 sheep to ram past the Earth - NASA - The Jerusalem Post", "description": "Asteroid 2023 HO18 is around 28 sheep in diameter and is set to fly very close to the Earth, according to NASA. However, it won't hit us, despite the close pass.", "url": "https://www.jpost.com/science/article-745133", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/539173", "publishedAt": "2023-06-04T09:24:00Z", "content": "An asteroid the size of almost 28 domesticated sheep is set to pass close to the Earth on Sunday, June 4, according to NASA's asteroid tracker. \r\nAccording to the Center for Near-Earth Object Studies… [+3597 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Amanda Heidt", "title": "Do all animals go through adolescence? - Livescience.com", "description": "All species experience the bodily changes of puberty, but the social lessons that define the shift from childhood to adulthood are more nuanced.", "url": "https://www.livescience.com/animals/do-all-animals-go-through-adolescence", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TKLZPXhixKJxXNi7WEAfmf-1200-80.jpg", "publishedAt": "2023-06-04T09:00:00Z", "content": "Looking back on our teenage years often elicits a grimace — it's an awkward time, full of social faux pas, uncertainty and acne — but it's one that we all must pass through on our way to adulthood. \r… [+4671 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Survival Is a Disgusting Matter – How Nature Uses Revulsion as a Shield - SciTechDaily", "description": "Scientists unveil multiple animal species' disease avoidance strategies. Life for all creatures, humans included, would be a lot more straightforward if diseases were as noticeable as flashing warning signs or loud alarm bells. However, in lieu of such overt …", "url": "https://scitechdaily.com/survival-is-a-disgusting-matter-how-nature-uses-revulsion-as-a-shield/", "urlToImage": "https://scitechdaily.com/images/Adaptive-System-of-Disgust.jpg", "publishedAt": "2023-06-04T07:19:20Z", "content": "ByKyoto UniversityJune 4, 2023\r\nAnimals reactions to respective excrements monitored by the research team. Top left: Japanese macaques/human-like. Top right: Adélie penguin/white-splash (parasites, p… [+4095 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cross-country culinary microbes: Uncovering a shared kitchen microbiota across European homes - News-Medical.Net", "description": "Microbial diversity in residential kitchens across five European countries was examined, revealing common bacterial genera/families and their distribution on cleaning utensils and kitchen surfaces. The study highlights variations in microbial composition by c…", "url": "https://www.news-medical.net/news/20230604/Cross-country-culinary-microbes-Uncovering-a-shared-kitchen-microbiota-across-European-homes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749972_16857292957998913.jpg", "publishedAt": "2023-06-04T06:06:00Z", "content": "Humans are constantly exposed to diverse microbes, which can have positive and adverse health effects. Considerable exposure the these microorganisms occurs indoors, with the highest bacterial coloni… [+6068 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Neanderthals May Have Been The First To Carefully Concoct This Substance - ScienceAlert", "description": "The first synthetic substance ever brewed on planet Earth may not have been a product of our own species but was concocted by a close relative as far back as around 200,000 years ago.", "url": "https://www.sciencealert.com/neanderthals-may-have-been-the-first-to-carefully-concoct-this-substance", "urlToImage": "https://www.sciencealert.com/images/2023/05/BlackTar.jpg", "publishedAt": "2023-06-04T06:01:14Z", "content": "The first synthetic substance ever brewed on planet Earth may not have been a product of our own species but was concocted by a close relative as far back as around 200,000 years ago.\r\nResearchers fr… [+3322 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Little-Known Microbes Could Be an Early Warning Signal of Climate Tipping Point - SciTechDaily", "description": "Increased heat levels might drive oceanic plankton and other unicellular organisms toward a carbon threshold, which could potentially exacerbate global warming. However, recent studies suggest that it might be feasible to identify early warning signs before t…", "url": "https://scitechdaily.com/little-known-microbes-could-be-an-early-warning-signal-of-climate-tipping-point/", "urlToImage": "https://scitechdaily.com/images/Paramecium-bursaria-scaled.jpg", "publishedAt": "2023-06-04T03:08:34Z", "content": "ByDuke UniversityJune 3, 2023\r\nFound in lakes and rivers worldwide, single-celled creatures like these Paramecium bursaria can both eat and photosynthesize. Microbes like this play a double role in c… [+7471 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Light-Speed Advances: Graphene Nanoprocessing With a Femtosecond Laser - SciTechDaily", "description": "Researchers at Tohoku University used a femtosecond laser to successfully micro/nanofabricate graphene films, creating multi-point holes without damage and removing contaminants. The technique could replace traditional, more complex methods, offering potentia…", "url": "https://scitechdaily.com/light-speed-advances-graphene-nanoprocessing-with-a-femtosecond-laser/", "urlToImage": "https://scitechdaily.com/images/Laser-Induced-Monolayer-Graphene-Nanoprocessing.jpg", "publishedAt": "2023-06-04T00:13:20Z", "content": "ByTohoku UniversityJune 3, 2023\r\nIllustration of a graphene film being hole-drilled by laser irradiation. The size of the carbon atoms is exaggerated and differs from the actual size. Credit: Yuuki U… [+5881 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Hitching a Ride: mRNA's Transport System in Brain Cells Revealed - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/mrna-genetics-neuroscience-23391/", "urlToImage": null, "publishedAt": "2023-06-03T23:27:18Z", "content": null}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "UAE outlines plans for asteroid mission - SpaceNews", "description": "The United Arab Emirates has released new details about its planned mission to the main asteroid belt, one that is similar to an ongoing NASA mission.", "url": "https://spacenews.com/uae-outlines-plans-for-asteroid-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/06/mbrexplorer.jpg", "publishedAt": "2023-06-03T22:31:58Z", "content": "WASHINGTON The United Arab Emirates has released new details about its planned mission to the main asteroid belt, one that is similar to an ongoing NASA mission.\r\nThe UAE Space Agency said its Emirat… [+3747 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Identify Polar Cyclone on Uranus - VOA Learning English", "description": "New observations of Uranus are providing a fuller understanding of its atmosphere. These observations, made from a telescope located in New Mexico, include the detection of a polar cyclone whose center measures a quarter of Earth's diameter.", "url": "https://learningenglish.voanews.com/a/scientists-identify-polar-cyclone-on-uranus/7115220.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-fa84-08db611234ef_cx16_cy0_cw69_w1200_r1.jpg", "publishedAt": "2023-06-03T21:55:43Z", "content": "The seventh planet from the sun, Uranus, is a world surrounded by mystery. Seen up close just once nearly forty years ago by a passing NASA spacecraft, the planet still guards many secrets.\r\nBut new … [+3152 chars]"}, {"source": {"id": null, "name": "fox5sandiego.com"}, "author": "Amber Coakley", "title": "Look up: This weekend Venus will be at its highest point in the sky - FOX 5 San Diego", "description": "Saturday’s Strawberry Moon is just a precursor to another celestial spectacle that’s expected to wow sky gazers on Sunday night.", "url": "https://fox5sandiego.com/news/look-up-this-weekend-venus-will-be-at-its-highest-point-in-the-sky/", "urlToImage": "https://fox5sandiego.com/wp-content/uploads/sites/15/2023/06/AdobeStock_58627825-1.jpeg?w=1280", "publishedAt": "2023-06-03T21:46:05Z", "content": "Saturday’s Strawberry Moon was just a precursor to another celestial spectacle that’s expected to wow sky gazers on Sunday night.\r\nIf you’ve noticed a bright star that lingers at dusk recently, you’v… [+1439 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jessica Orwig", "title": "Stephen Hawking's theory could mean the entire universe will evaporate - Business Insider", "description": "Hawking radiation predicts black holes lose energy and eventually evaporate. Now a new study predicts the same fate for the rest of the universe.", "url": "https://www.businessinsider.com/stephen-hawking-theory-could-mean-entire-universe-will-evaporate-2023-6", "urlToImage": "https://i.insider.com/647baad540bf000019fa20f7?width=1200&format=jpeg", "publishedAt": "2023-06-03T21:35:00Z", "content": "The ultimate fate of our universe is unknown. But that doesn't stop astronomers from trying to figure it out.\r\nThe most recent idea of how our universe might end is that it will simply evaporate. Tha… [+2200 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "LAURENCE TOGNETTI, Universe Today", "title": "New Study Opens the Door for “Hundreds of Millions” of Habitable Exoplanets - Inverse", "description": "A new study shows that one-third of red dwarfs could have a habitable planet, opening the door for plenty of places for alien life to arise.", "url": "https://www.inverse.com/science/habitable-exoplanets-red-dwarf-stars", "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/6/2/7d5430fa-6992-40dc-a400-0fe264c5c188-getty-1473679341.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-03T20:00:24Z", "content": "In a recent study published in the Proceedings of the National Academy of Sciences, a pair of researchers from the University of Florida (UF) examined orbital eccentricities for exoplanets orbiting r… [+4069 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists have been baffled by this 2,000-year-old 'computer' since it was discovered 120 years ago - BGR", "description": "A 2,000 year old device known as the first computer has left scientists baffled since they discovered it in 1901.", "url": "https://bgr.com/science/scientists-have-been-baffled-by-this-2000-year-old-computer-since-it-was-discovered-120-years-ago/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/06/AdobeStock_544484666.jpeg?quality=82&strip=all", "publishedAt": "2023-06-03T19:10:00Z", "content": "An amazingly complex computer from over 2,000 years ago has kept scientists on their toes since its discovery. The computer, which has been dubbed the ‘first computer,’ is what we call an Antikythera… [+1904 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Rebecca Dyer", "title": "Did Dinosaurs 'See Through' Each Other's Eyes? New Research Provides Insight - ScienceAlert", "description": "Much like symbolically walking a mile in someone else's shoes, visual perspective-taking is 'seeing' through someone else's eyes: We follow someone's gaze to learn what caught their attention, or we may even try and work out what someone else is seeing...", "url": "https://www.sciencealert.com/did-dinosaurs-see-through-each-others-eyes-new-research-provides-insight", "urlToImage": "https://www.sciencealert.com/images/2023/05/TwoDinosaursRoaringOnBlueSkyBackgroundWithOneFlying.jpg", "publishedAt": "2023-06-03T18:01:12Z", "content": "Much like symbolically walking a mile in someone else's shoes, visual perspective-taking is 'seeing' through someone else's eyes: We follow someone's gaze to learn what caught their attention, or we … [+4483 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Redefining Fluid Dynamics: Ancient Invention Sparks Modern Breakthrough - SciTechDaily", "description": "The recent breakthrough holds great potential for both medical and industrial applications. A group of scientists has discovered new laws governing the flow of fluids by conducting experiments on an ancient technology: the drinking straw. This newfound unders…", "url": "https://scitechdaily.com/redefining-fluid-dynamics-ancient-invention-sparks-modern-breakthrough/", "urlToImage": "https://scitechdaily.com/images/Fluids-Physics.jpg", "publishedAt": "2023-06-03T17:35:43Z", "content": "A team of researchers at New York Universitys Courant Institute of Mathematical Sciences has discovered new laws governing the flow of fluids, contradicting previously known laws. Their discovery, wh… [+4377 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Ultra-Faint Dwarf Galaxy Spotted Just 480 Million Years after Big Bang - Sci.News", "description": "Residing behind a galaxy supercluster called Abell 2744, the JD1 galaxy is gravitationally lensed and displays three images.", "url": "https://www.sci.news/astronomy/jd-1-ultra-faint-dwarf-galaxy-11970.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_11970-JD1.jpg", "publishedAt": "2023-06-03T16:58:19Z", "content": "Residing behind a galaxy supercluster called Abell 2744, the JD1 galaxy is gravitationally lensed and displays three images.\r\nA projected image of the galaxy JD1 (inset), which is located behind the … [+3830 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "Sergio Murillo", "title": "New discovery about the atmosphere of Mars - AS USA", "description": "The relative abundance of certain carbon monoxide isotopes that make up the Martian atmosphere is helping write the book on the Red Planet’s history.", "url": "https://en.as.com/latest_news/new-discovery-about-the-atmosphere-of-mars-n/", "urlToImage": "https://img.asmedia.epimg.net/resizer/CVdGddWyp2X5PUVahz3GmiXvMSg=/1472x828/cloudfront-eu-central-1.images.arcpublishing.com/diarioas/PTDGWKDJCJEJ5NATCXLW2PXSOE.jpg", "publishedAt": "2023-06-03T16:14:02Z", "content": "Whispers from outer space never stop. They are echoes of the past that break the sidereal silence. So charged with energy, so empty of everything and nothing at all. Like a giant cardboard box that p… [+3195 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Experimenting With Actual Tractor Beam to Clean Up Space Junk - Futurism", "description": "From their experiments, the researchers calculate that their tractor beam could be used to move debris weighing several tons.", "url": "https://futurism.com/the-byte/scientists-tractor-beam-space-junk", "urlToImage": "https://wp-assets.futurism.com/2023/06/scientists-tractor-beam-space-junk.jpg", "publishedAt": "2023-06-03T13:57:06Z", "content": "Once operational, their device could \"essentially tug away the debris without ever touching it.\"\r\nStraight out of Star Trek\r\nA team of engineers is working on a real life \"tractor beam,\" a staple dev… [+3041 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Milo Pope", "title": "Life on Mars... but only for four years: Red Planet 'too dangerous' for humans to survive on - Daily Mail", "description": "According to a recent study into human life on the Red Planet, scientists have said if humans spend any longer than this point, levels of radiation become unsafe.", "url": "https://www.dailymail.co.uk/sciencetech/article-12155177/Life-Mars-four-years-Red-Planet-dangerous-humans-survive-on.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/03/14/71725727-0-image-a-12_1685800142820.jpg", "publishedAt": "2023-06-03T13:50:57Z", "content": "A human expedition to Mars has long been on the radar of space explorer's aspirations. \r\nTwo years ago there was even talk that humans will be able to reproduce on Mars because sperm can survive ther… [+1905 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "3D Printing to the Rescue: Shrinking Vacuum Pumps for Bigger Discoveries - SciTechDaily", "description": "The device would be a key component of a portable mass spectrometer that could help monitor pollutants, perform medical diagnoses in remote areas, or test Martian soil. MIT researchers have used additive manufacturing to create a small, inexpensive vacuum pum…", "url": "https://scitechdaily.com/3d-printing-to-the-rescue-shrinking-vacuum-pumps-for-bigger-discoveries/", "urlToImage": "https://scitechdaily.com/images/3D-Print-Miniaturized-Peristaltic-Vacuum-Pump.jpg", "publishedAt": "2023-06-03T13:15:16Z", "content": "ByAdam Zewe, Massachusetts Institute of TechnologyJune 3, 2023\r\nMIT researchers have devised a way to 3D print a miniaturized peristaltic vacuum pump, which could be a key component of a portable mas… [+9482 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Study finds that marsupials are 'far more evolved' than humans - BGR", "description": "Shocking new research shows that marsupial evolution may have gone further than other mammals, including humans.", "url": "https://bgr.com/science/study-finds-that-marsupials-are-far-more-evolved-than-humans/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/06/AdobeStock_204317379.jpeg?quality=82&strip=all", "publishedAt": "2023-06-03T13:01:00Z", "content": "Once thought as the least evolved of the mammals that roam our world, new research shows that marsupial evolution might actually be further along than even humans. This old bias towards the creatures… [+2087 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "NEWS WIRES", "title": "‘A first’ from Mars: European spacecraft sends livestream from red planet - FRANCE 24 English", "description": "A European spacecraft around Mars sent its first livestream from the red planet to Earth on Friday to mark the 20th anniversary of its launch, but rain in Spain interfered at times.", "url": "https://www.france24.com/en/europe/20230603-a-first-from-mars-european-spacecraft-sends-livestream-from-red-planet", "urlToImage": "https://s.france24.com/media/display/80047cca-020b-11ee-a45b-005056bfb2b6/w:1280/p:16x9/Mars-live.jpg", "publishedAt": "2023-06-03T12:53:37Z", "content": "A European spacecraft around Mars sent its first livestream from the red planet to Earth on Friday to mark the 20th anniversary of its launch, but rain in Spain interfered at times. The European Spac… [+2124 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Florida residents panic as SpaceX Dragon makes splashdown - The News International", "description": "A loud boom that echoed across the Florida Panhandle was reported on social media by users late Tuesday night as the SpaceX Dragon capsule made its way down to Earth, splashing down in the Gulf of...", "url": "https://www.thenews.com.pk/latest/1076731-spacex-dragon-capsules", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-03/1076731_084149_updates.jpg", "publishedAt": "2023-06-03T12:44:52Z", "content": "A loud boom that echoed across the Florida Panhandle was reported on social media by users late Tuesday night as the SpaceX Dragon capsule made its way down to Earth, splashing down in the Gulf of Me… [+1798 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Fred Pearce", "title": "The Upper Atmosphere Is Cooling, Prompting New Climate Concerns - WIRED", "description": "Scientists are worried about the effect this change could have on orbiting satellites, the ozone layer, and Earth’s weather.", "url": "https://www.wired.com/story/the-upper-atmosphere-is-cooling-prompting-new-climate-concerns/", "urlToImage": "https://media.wired.com/photos/647a6e4788479249e0cc29b0/191:100/w_1280,c_limit/mesopause_science_27420333805_6fd1876a46_o.jpg", "publishedAt": "2023-06-03T12:00:00Z", "content": "This contraction means the upper atmosphere is becoming less dense, which in turn reduces drag on satellites and other objects in low orbitby around a third by 2070, calculates Ingrid Cnossen, a rese… [+2985 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Scientists detect the breath between atoms - Interesting Engineering", "description": "University of Washington researchers have detected the mechanical vibration between two layers of atoms (the atoms’ breaths).", "url": "https://interestingengineering.com/science/scientists-detect-the-breath-between-atoms", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/03/image/jpeg/LJsTJ6HYfeZoh6Hlc4JLiP05g8ykKNa1WXClqVwX.jpg", "publishedAt": "2023-06-03T11:38:00Z", "content": "\"Photons are a natural choice for transmitting this quantum information because optical fibers enable us to transport photons long distances at high speeds, with low losses of energy or information.\"… [+2385 chars]"}]}