{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Bonobos are the only known primate, humans included, that don't kill each other - Earth.com", "description": "Bonobo evolution reveals bonding and group cohesion in response to threats, favoring paths to finding peace instead of aggression.", "url": "https://www.earth.com/news/primate-violence-bonobos-bond-common-enemy-effect-dont-kill-inside-their-species/", "urlToImage": "https://cff2.earth.com/uploads/2024/08/25062932/Bonobos-evolution2.jpg", "publishedAt": "2026-01-11T17:05:09Z", "content": "As humans, we like to think were one of a kind. But pull the camera back and the picture gets simpler: humans, like every other species, run on instincts shaped by evolution.\r\nOne of those instincts … [+5377 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jeff Spry", "title": "I visited the largest collection of public telescopes in the US in Oregon's high desert, and the dark skies blew me away - Space", "description": "Located south of Bend’s outdoor playland, I visited this Pacific Northwest gem for an enchanted winter evening of astronomical wonders", "url": "https://www.space.com/astronomy/i-visited-the-largest-collection-of-public-telescopes-in-the-us-in-oregons-high-desert-and-the-dark-skies-blew-me-away", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7Pgtn3pTzq9ZRnSi7QQ9TD-1280-80.png", "publishedAt": "2026-01-11T16:00:00Z", "content": "SUNRIVER, Oregon  — Perfectly perched amid an expansive plateau of sagebrush, Ponderosa pines, and juniper trees in Central Oregon's High Desert, theSunriver Nature Center and Observatory\r\n offers ex… [+7848 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "ISS astronaut medical evacuation latest news: New commander to take charge soon - Space", "description": "Sunday, Jan. 11, 2026: Updates on NASA's astronaut medical evacuation from the International Space Station.", "url": "https://www.space.com/live/astronaut-medical-evacuation-on-iss-jan-11-2026", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JkZn36tq8gbrcZgF77gcrb-720-80.jpg", "publishedAt": "2026-01-11T15:25:48Z", "content": "2026-01-11T15:24:56.269ZNew commander to take charge soon\r\nThe seven-member Expedition 74 crew poses for a festive portrait aboard the International Space Station's Kibo laboratory module. In the fro… [+19656 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "This Island Spider That Deletes Half Its DNA, and Scientists Say It Shouldn’t Be Possible - The Daily Galaxy", "description": "A team set out to compare two closely related spiders, and stumbled into a paradox. The island species doesn’t behave like island species are supposed to.", "url": "https://dailygalaxy.com/2026/01/spider-deletes-half-dna-shouldnt-possible/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/This-Island-Spider-That-Deletes-Half-Its-DNA-and-Scientists-Say-It-Shouldnt-Be-Possible-scaled.jpg", "publishedAt": "2026-01-11T15:15:00Z", "content": "A spider species found only on the Canary Islands is forcing scientists to rethink long-held assumptions about how evolution works. Rather than expanding its genome like most island species, Dysdera … [+3612 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Sharon Adarlo", "title": "Doomsday Glacier Bombarded by Earthquakes - Futurism", "description": "Hundreds of earthquakes have been detected rattling Antarctica's Thwaites Glacier, also known as the Doomsday Glacier.", "url": "http://futurism.com/science-energy/doomsday-glacier-earthquake", "urlToImage": "https://futurism.com/wp-content/uploads/2026/01/doomsday-glacier-earthquake_4dd12e.jpg?quality=85&w=1200", "publishedAt": "2026-01-11T14:00:00Z", "content": "Hundreds of earthquakes have been detected rattling Antarctica’s Thwaites Glacier, also known as the Doomsday Glacier the disintegration of which could send between two and 10 feet of devastating flo… [+1969 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "Elon Musk Surprises Everyone: SpaceX Will Attempt to Reach Mars by the End of 2026 - The Daily Galaxy", "description": "Elon Musk just revealed SpaceX’s boldest Mars plan yet, targeting liftoff far sooner than expected. With a rare planetary window approaching, the 2026 deadline isn’t just ambitious, it may be the only shot.", "url": "https://dailygalaxy.com/2026/01/elon-musk-spacex-starship-mars-launch-2026-update/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/SpaceXs-Starship-rocket-launches-on-its-fourth-fully-integrated-test-flight-scaled.jpg", "publishedAt": "2026-01-11T13:45:00Z", "content": "SpaceX is moving quickly to position its Starship rocket for a potential uncrewed mission to Mars as early as late 2026, a milestone that, if achieved, would mark the first attempt by a private entit… [+5556 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A new theory of gravity could explain cosmic acceleration without dark energy - ScienceDaily", "description": "The accelerating expansion of the universe is usually explained by an invisible force known as dark energy. But a new study suggests this mysterious ingredient may not be necessary after all. Using an extended version of Einstein’s gravity, researchers found …", "url": "https://www.sciencedaily.com/releases/2026/01/260110211221.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/universe-expansion-dark-energy.webp", "publishedAt": "2026-01-11T13:13:14Z", "content": "Why the universe is expanding faster and faster remains one of the biggest open questions in physics. Current theories cannot fully explain this accelerating growth. Today's standard picture of the u… [+2656 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Metcalfe", "title": "Monumental tomb discovered in Turkey might be of royal from King Midas' kingdom - Live Science", "description": "A burial mound in Turkey may have held the remains of a member of King Midas's family. But not all experts are convinced.", "url": "https://www.livescience.com/archaeology/monumental-tomb-discovered-in-turkey-might-be-of-royal-from-king-midas-kingdom", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3v26gPAvp3kiDFhCvA6FuD-1772-80.png", "publishedAt": "2026-01-11T12:00:00Z", "content": "An ancient tomb discovered in Turkey may have been made for a member of the family of the legendary King Midas, who lived in the eighth century B.C. and is renowned for his mythical \"golden touch.\"\r\n… [+5718 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "SpaceX’s Twilight rideshare mission set to fly from Vandenberg - NASASpaceFlight.com -", "description": "Fresh off a record-shattering launch cadence in 2025, SpaceX is planning to fly its first…", "url": "https://www.nasaspaceflight.com/2026/01/spacexs-twilight-rideshare-mission-vandenberg/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2026/01/IMG_9624-523x350.jpeg", "publishedAt": "2026-01-11T10:27:13Z", "content": "1Fresh off a record-shattering launch cadence in 2025, SpaceX is planning to fly its first rideshare mission of 2026 from Space Launch Complex-4E at Vandenberg Space Force Base on the central Califor… [+7565 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Victoria Atkinson", "title": "What's the oldest river in the world? - Live Science", "description": "The oldest river predates the dinosaurs. But how do we know this?", "url": "https://www.livescience.com/planet-earth/rivers-oceans/whats-the-oldest-river-in-the-world", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mthgvqtvg9g9hod9AFKMnc-1600-80.png", "publishedAt": "2026-01-11T10:00:00Z", "content": "​​Rivers may seem as old as the hills, but they have life cycles just like other natural features do. Many grow and make their meandering mark on the landscape, before ultimately drying up. Some rive… [+4743 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul Sutter", "title": "Is the Universe Made of Math? Part 2: The Minimalist Universe - Universe Today", "description": "Like, it shouldn’t be this easy. Yeah I know physics is kind of hard, and it has taken us centuries to reach our present level of knowledge, and we know we’re still a long way from complete knowledge of time and space.", "url": "https://www.universetoday.com/articles/is-the-universe-made-of-math-part-2-the-minimalist-universe", "urlToImage": "https://www.universetoday.com/article_images/math-blackboard-education-classroom-5b36b07ff8e89d9238f393ef1521cd40_20260107_002444.jpg", "publishedAt": "2026-01-11T00:24:00Z", "content": "This is Part 2 in a series on the mathematical universe hypothesis. Check out Part 1.\r\nLike, it shouldnt be this easy. Yeah I know physics is kind of hard, and it has taken us centuries to reach our … [+4673 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "'Mammoth' Bones Kept in a Museum For 70 Years Turn Out to Be An Entirely Different Animal - ScienceAlert", "description": "The fossilized backbones of what appeared to be woolly mammoths have turned out to come from an entirely different and unexpected animal.", "url": "https://www.sciencealert.com/mammoth-bones-kept-in-a-museum-for-70-years-turn-out-to-be-an-entirely-different-animal", "urlToImage": "https://www.sciencealert.com/images/2026/01/not-a-mammoth.jpg", "publishedAt": "2026-01-10T21:01:42Z", "content": "The fossilized backbones of what appeared to be woolly mammoths have turned out to come from an entirely different and unexpected animal.\r\nArchaeologist Otto Geist came across the bones two epiphysea… [+4522 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matthew Williams", "title": "X-ray spectra provide sharpest image to date of a rapidly spinning black hole - Phys.org", "description": "The X-Ray Imaging and Spectroscopy Mission (XRISM), a joint mission between the Japanese Aerospace Exploration Agency (JAXA) and NASA, launched on Sept. 7th, 2023. Its advanced imaging filters and spectrometers were designed to study black holes and neutron s…", "url": "https://phys.org/news/2026-01-ray-spectra-sharpest-image-date.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/xrism-provides-the-sha.jpg", "publishedAt": "2026-01-10T17:55:26Z", "content": "The X-Ray Imaging and Spectroscopy Mission (XRISM), a joint mission between the Japanese Aerospace Exploration Agency (JAXA) and NASA, launched on Sept. 7th, 2023. Its advanced imaging filters and sp… [+5155 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Toyama", "title": "Clues from the past reveal the West Antarctic Ice Sheet's vulnerability to warming - Phys.org", "description": "The Thwaites and Pine Island glaciers, located in the Amundsen Sea sector of the West Antarctic Ice Sheet (WAIS), are among the fastest-melting glaciers on Earth. Together, they are losing ice more rapidly than any other part of Antarctica, raising serious co…", "url": "https://phys.org/news/2026-01-clues-reveal-west-antarctic-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/clues-from-the-past-re.jpg", "publishedAt": "2026-01-10T17:20:01Z", "content": "The Thwaites and Pine Island glaciers, located in the Amundsen Sea sector of the West Antarctic Ice Sheet (WAIS), are among the fastest-melting glaciers on Earth. Together, they are losing ice more r… [+4876 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "A New Study Finds a Subtle Dance Between Dark Matter and Neutrinos - Universe Today", "description": "Scientists are a step closer to solving one of the universe's biggest mysteries as new research finds evidence that dark matter and neutrinos may be interacting, offering a rare window into the darkest recesses of the cosmos.", "url": "https://www.universetoday.com/articles/a-new-study-finds-a-subtle-dance-between-dark-matter-and-neutrinos", "urlToImage": "https://www.universetoday.com/article_images/cosmology_20260110_165023.jpg", "publishedAt": "2026-01-10T16:51:00Z", "content": "Time again for a tale of things dark and mysterious. A tale of dark matter. It's a well-told tale, but this time it involves an interactive dance between dark matter and neutrinos.\r\nDark matter is, o… [+2721 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "These Rocks Are Older Than the Pyramids… And They’re Hiding in Canada - The Daily Galaxy", "description": "Are these the world’s oldest rocks? Canada may hold the key to Earth's ancient secrets.", "url": "https://dailygalaxy.com/2026/01/canada-rocks-are-older-than-the-pyramids/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/These-Rocks-Are-Older-Than-the-Pyramids…-And-Theyre-Hiding-in-Canada-scaled.jpg", "publishedAt": "2026-01-10T14:15:00Z", "content": "For years, scientists have wondered if a certain stretch of rock in Canada could be home to the worlds oldest rocks, and now, a new analysis seems to make the case stronger than ever. The Nuvvuagittu… [+3294 chars]"}, {"source": {"id": null, "name": "My Modern Met"}, "author": "Sage Helene", "title": "Chernobyl’s “Radiation-Eating” Fungus Turns Nuclear Fallout Into Its Own Energy Source - My Modern Met", "description": "Scientists have discovered a fungus thriving in Chernobyl’s ruins—one of the most hostile environments on Earth.", "url": "https://mymodernmet.com/chernobyl-black-fungus-discovery/", "urlToImage": "https://mymodernmet.com/wp/wp-content/uploads/2025/12/cladosporium-sphaerospermum-fungus-thumbnail-1.jpg", "publishedAt": "2026-01-10T14:05:10Z", "content": "Deep inside the abandoned walls of Chernobyl’s reactor ruins, where radiation remains deadly to most life, a humble black fungus is quietly thriving. This is not a ghost of destruction—it’s a living,… [+2649 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: Missing dinosaurs, quiescent black holes and infectious fungi - Phys.org", "description": "Happy new year! If you're a redhead, the pigments in your hair are protecting you from cellular damage. A post-stroke injection comprising regenerative nanomaterial can protect the brain. And researchers have developed a method to extract rare earth elements …", "url": "https://phys.org/news/2026-01-saturday-citations-dinosaurs-quiescent-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/saturday-citations-din.jpg", "publishedAt": "2026-01-10T13:30:01Z", "content": "Happy new year! If you're a redhead, the pigments in your hair are protecting you from cellular damage. A post-stroke injection comprising regenerative nanomaterial can protect the brain. And researc… [+4238 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists uncover a hidden aging program in the gut that fuels cancer risk - ScienceDaily", "description": "Although the gut renews itself constantly, its stem cells accumulate age-related molecular changes that quietly alter how genes are switched on and off. Scientists found that this “epigenetic drift” follows a clear pattern and appears in both aging intestines…", "url": "https://www.sciencedaily.com/releases/2026/01/260108231411.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/digestive-system-intestines-holographic-scan.webp", "publishedAt": "2026-01-10T13:19:19Z", "content": "The human gut replaces its cells faster than any other tissue in the body. Every few days, fresh cells are produced by specialized stem cells that keep the intestinal lining healthy. Over time, howev… [+4261 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Elizabeth Howell", "title": "Oddball 'platypus galaxies' spotted by James Webb telescope may challenge our understanding of galaxy formation - Live Science", "description": "Astronomers spotted nine galaxies with characteristics that have never been seen as a collection before. It's possible this is a newly found type of star-forming galaxy.", "url": "https://www.livescience.com/space/astronomy/oddball-platypus-galaxies-spotted-by-james-webb-telescope-may-challenge-our-understanding-of-galaxy-formation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2ktRJ8FHqKpJAJqeSdhLdd-1277-80.png", "publishedAt": "2026-01-10T13:00:00Z", "content": "A new category of space objects dubbed \"platypus galaxies\" is defying explanation.\r\nThese nine strange cosmic objects, spotted in archival data from the James Webb Space Telescope\r\n, cannot easily be… [+3449 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "This Photographer Went for the Northern Lights, But He Never Expected to Meet a Curious Creature - The Daily Galaxy", "description": "A photographer went out to capture the beauty of the northern lights, but what he didn’t expect was a special visitor.", "url": "https://dailygalaxy.com/2026/01/photos-fox-dancing-under-northern-lights/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/This-Photographer-Went-for-the-Northern-Lights-But-He-Never-Expected-to-Meet-a-Curious-Creature-scaled.jpg", "publishedAt": "2026-01-10T12:45:00Z", "content": "Dennis Lehtonen, a passionate aurora chaser, had ventured to the remote village of Kilpisjärvi, located within the Arctic Circle, to capture the northern lights in their full glory. What he didnt exp… [+2088 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Hubble Telescope’s Final Countdown: Could It Disappear Sooner Than Expected? - The Daily Galaxy", "description": "As the Hubble Space Telescope faces the end of its mission, experts predict that it could reenter Earth’s atmosphere earlier than predicted.", "url": "https://dailygalaxy.com/2026/01/hubble-countdown-could-it-disappear-sooner/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/Hubble-Telescopes-Final-Countdown-Could-It-Disappear-Sooner-Than-Expected-scaled.png", "publishedAt": "2026-01-10T12:15:00Z", "content": "The Hubble Space Telescope has long been a cornerstone of our understanding of the universe, unveiling awe-inspiring images and groundbreaking data about galaxies, black holes, and the origins of cos… [+4441 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "He Finished High School at Age 8, Earned a PhD in Quantum Physics at 15, Now Wants to Build AI-Enhanced \"Superhumans\" - Indian Defence Review", "description": "A teenage prodigy just earned a PhD in quantum physics, at 15. Now, he's diving into AI and human biology with one goal in mind: to reengineer life itself.", "url": "https://indiandefencereview.com/15-year-old-quantum-physics-phd-use-ai-to-create-superhumans/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/01/this-15-year-old-physicist-now-wants-to-engineer-human-enhancement.jpg", "publishedAt": "2026-01-10T12:05:00Z", "content": "A 15-year-old doctoral graduate is not, in itself, a scientific development. It is a human milestone, occasionally publicised, often exceptional, but separate from the processes of research and disco… [+5467 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "Humanity Just Received a 10-Second Signal From 13 Billion Light Years Away - The Daily Galaxy", "description": "A mysterious 10-second flash from deep space has shattered records and stunned scientists. Detected by a new satellite and confirmed by the James Webb Telescope, this ancient explosion is forcing experts to rethink what they thought they knew about the early …", "url": "https://dailygalaxy.com/2026/01/earth-receives-10-second-signal-from-supernova-13-billion-years-ago/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/Humanity-just-caught-a-10-second-burst-from-deep-space-scaled.jpg", "publishedAt": "2026-01-10T11:45:00Z", "content": "A brilliant cosmic flash, brief yet immensely powerful, travelled over 13 billion years before reaching Earth. It passed through a universe that was still young, turbulent and dark, long before galax… [+5402 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Astronaut on ISS captures spectacular orbital video of zodiacal light, auroras and the Pleiades - Space", "description": "Kimiya Yui released the timelapse footage to celebrate his 300th cumulative day spent orbiting Earth.", "url": "https://www.space.com/stargazing/astronaut-on-iss-captures-spectacular-orbital-video-of-zodiacal-light-auroras-and-the-pleiades", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PgZ43oukPeVoBaft5ka8jZ-1920-80.jpg", "publishedAt": "2026-01-10T11:00:00Z", "content": "Astronaut Kimiya Yui captured a jaw-dropping timelapse video showcasing the beauty of low-Earth orbit as seen from the International Space Station.\r\nYui's 300th cumulative day in space came during hi… [+2362 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Ella McSweeney", "title": "Boy (7) strikes it lucky by finding one of the world’s rarest minerals near his home in Cork - The Irish Times", "description": "Within seconds of handing it over to an expert, it was clear quartz discovery was very special", "url": "https://www.irishtimes.com/environment/2026/01/10/boy-7-strikes-it-lucky-by-finding-one-of-the-worlds-rarest-minerals-near-his-home-in-cork/", "urlToImage": "https://www.irishtimes.com/resizer/v2/IYF5NQ5BYBH6BCQB7JIMR7S4LY.jpg?smart=true&auth=abfd047b7c39e4ad88e731bf8ad9ee3647d94ed6304bfbf8cb3619c9899bb6a1&width=1200&height=630", "publishedAt": "2026-01-10T06:03:50Z", "content": "Around lunchtime on March 1st, 2024, Patrick Roycroft, geology curator at the National Museum of Ireland, was given a piece of mineral, about the size of a Creme Egg, by a seven-year-old boy called B… [+4974 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Betelgeuse has a hidden companion and Hubble just caught its wake - ScienceDaily", "description": "Astronomers have uncovered the long-hidden cause behind Betelgeuse’s strange behavior: a small companion star carving a visible wake through the giant’s vast atmosphere. Using nearly eight years of observations from NASA’s Hubble Space Telescope and ground-ba…", "url": "https://www.sciencedaily.com/releases/2026/01/260109235153.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/betelgeuse-and-wake-of-its-companion-star.webp", "publishedAt": "2026-01-10T05:10:17Z", "content": "Astronomers analyzing fresh observations from NASA's Hubble Space Telescope and several ground-based observatories have uncovered clear signs that a recently identified companion star is shaping the … [+5539 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Geri Mileva", "title": "Scientists sound alarm over little-known threat emerging from Antarctica: 'Acting like a giant conveyor belt' - Yahoo", "description": "The study is based only on simulated scenarios, but real-world changes happening in Antarctica are already affecting the planet.", "url": "https://www.yahoo.com/news/articles/scientists-sound-alarm-over-little-031500904.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/M2yyL4PvcCw_uxNAouuXOg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/3697e1549dfc72433014476de5e33ba9", "publishedAt": "2026-01-10T03:15:00Z", "content": "A shift in balance at the frozen edges of Antarctica could disrupt the balance in all of the world's oceans affecting weather patterns and even global food security.\r\nWhat's happening?\r\nResearchers f… [+2829 chars]"}, {"source": {"id": null, "name": "Vnexpress.net"}, "author": "Khanh Linh", "title": "Top AI researcher Haibin Ling quits US post to join China's Westlake University - VnExpress International", "description": "Haibin Ling, a leading AI researcher who designed the core algorithm behind the world's first mobile plant-identification app, has left his U.S. professorship to join Westlake University, one of China's fastest-rising research institutions.", "url": "https://e.vnexpress.net/news/news/education/top-ai-researcher-haibin-ling-quits-us-post-to-join-china-s-westlake-university-5003950.html", "urlToImage": "https://vcdn1-english.vnecdn.net/2026/01/10/w020251229618034440432-1767782-3611-1143-1768001566.jpg?w=680&h=0&q=100&dpr=1&fit=crop&s=vU9eE0vnLd-RJRe8OlODPQ", "publishedAt": "2026-01-10T00:15:40Z", "content": "Westlake University announced in late December 2025 that Ling has joined the school as a chair professor in its Department of Artificial Intelligence and will lead its Intelligent Computing and Appli… [+3059 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lauren E. Low", "title": "Final Steps Underway for NASA’s First Crewed Artemis Moon Mission - NASA (.gov)", "description": "As NASA moves closer to launch of the Artemis II test flight, the agency soon will roll its SLS (Space Launch System) rocket and Orion spacecraft to the", "url": "https://www.nasa.gov/missions/artemis/artemis-2/final-steps-underway-for-nasas-first-crewed-artemis-moon-mission/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2026/01/boosters.jpg", "publishedAt": "2026-01-10T00:00:48Z", "content": "As NASA moves closer to launch of the Artemis II test flight, the agency soon will roll its SLS (Space Launch System) rocket and Orion spacecraft to the launch pad for the first time at the agencys K… [+8556 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "People inhale very high levels of microplastics simply by breathing city air - Earth.com", "description": "According to a new study, microplastics in the air in Xi'an city, China, more than tripled during the time period of their research project.", "url": "https://www.earth.com/news/people-inhale-very-high-levels-of-microplastics-simply-by-breathing-city-air/", "urlToImage": "https://cff2.earth.com/uploads/2026/01/09081348/pandemic-air-microplastics-three-times-more.jpg", "publishedAt": "2026-01-09T23:07:57Z", "content": "Researchers in Xian, China found that levels of microplastics in the city’s air tripled over the course of their study.\r\nThey measured these particles within PM2.5, the fine pollution that can penetr… [+5787 chars]"}]}