{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Jorge Garay", "title": "New Bacteria Have Been Discovered on a Chinese Space Station - WIRED", "description": "On Earth there is no record of Niallia tiangongensis, a bacterium found aboard the Tiangong station that appears to be well adapted to conditions there.", "url": "https://www.wired.com/story/bacteria-unknown-on-earth-appears-on-chinese-space-station/", "urlToImage": "https://media.wired.com/photos/682c886e2e475e219bbdb41d/191:100/w_1280,c_limit/GettyImages-1497926468%20(1).jpg", "publishedAt": "2025-05-21T10:49:59Z", "content": "It is microscopic and rod-shaped, can create spores, and may have evolved to survive hundreds of miles above our planet's surface. This bacterium, never before seen on Earth, was detected on China's … [+2787 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Day a 2,000 KM Fault Almost Split America in Two: The Buried Secret of the Midwest - The Daily Galaxy", "description": "More than a billion years ago, a massive fault nearly split North America in two, leaving behind a hidden scar beneath the Midwest. This ancient rift, stretching thousands of kilometers, holds secrets still buried under layers of earth and ice.", "url": "https://dailygalaxy.com/2025/05/a-2000-km-fault-almost-split-america-in-two-secret-of-the-midwest/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/View-into-the-Grand-Canyon-from-the-West-Rim.jpg", "publishedAt": "2025-05-21T10:45:00Z", "content": "More than 1.1 billion years ago, an immense geological fault called the Midcontinent Rift began to form beneath what is now the U.S. Midwest. This massive rift stretches approximately 2,000 kilometer… [+3459 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Twice the Size and 50x the Power: Jupiter’s Primordial Past Revealed - SciTechDaily", "description": "Jupiter wasn’t always the planet we know today—it was once twice as big, had a magnetic field 50 times stronger, and its early might shaped the very architecture of our solar system. Using the orbits of two tiny inner moons, scientists have reverse-engineered…", "url": "https://scitechdaily.com/?p=476212", "urlToImage": "https://scitechdaily.com/images/Jupiter-Magnetic-Field.jpg", "publishedAt": "2025-05-21T08:31:30Z", "content": "An illustration of Jupiter with magnetic field lines emitting from its poles. Credit: K. Batygin\r\nJupiter wasn’t always the planet we know today—it was once twice as big, had a magnetic field 50 time… [+4914 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": "Margaret Harris", "title": "Universe may end much sooner than predicted, say theorists - Physics World", "description": "New estimate suggests that the most persistent stellar objects may decay away via Hawking radiation within the next 1078 years", "url": "https://physicsworld.com/a/universe-may-end-much-sooner-than-predicted-say-theorists/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2025/05/black-hole-126761045-shutterstock-oorka.jpg", "publishedAt": "2025-05-21T08:27:40Z", "content": "(Courtesy: Shutterstock/oorka)\r\nThe universes maximum lifespan may be considerably shorter than was previously thought, but dont worry: theres still plenty of time to finish streaming your favourite … [+3934 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Emily Langer", "title": "Ed Smylie, engineer who helped save Apollo 13 crew, dies at 95 - The Washington Post", "description": "He and his NASA colleagues were credited with jury-rigging a carbon dioxide filter that allowed the astronauts to breathe as they made their way back to Earth.", "url": "https://www.washingtonpost.com/obituaries/2025/05/20/ed-smylie-apollo-13-dead/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PWKPXSQ5NVBR27BWR36VLX3NHM.JPG&w=1440", "publishedAt": "2025-05-21T05:41:00Z", "content": "Ed Smylie, who became a quiet hero of the space age in 1970 when he and his fellow NASA engineers jury-rigged an air filter that kept the three Apollo 13 astronauts alive after an onboard explosion s… [+7665 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 23 Starlink satellites to orbit on brand-new Falcon 9 rocket after abort (photos) - Space", "description": "Liftoff occurred at 11:19 p.m. ET on Tuesday (May 20).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-23-starlink-satellites-to-orbit-on-brand-new-falcon-9-rocket-after-abort-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3je4jipU3vXopuJyT2973j.jpg", "publishedAt": "2025-05-21T05:01:56Z", "content": "A brand-new SpaceX rocket just earned its wings.\r\nA Falcon 9 rocket lifted off from Florida's Cape Canaveral Space Force Station Tuesday (May 20) at 11:19 p.m. EDT (0319 GMT on May 21), carrying 23 o… [+1742 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Dark Streaks on Mars May Not Be Signs of Flowing Water Like We Thought - ScienceAlert", "description": "It was big news years ago when Mars orbiters found streaks of what appeared to be water running down Martian cliffs and crater walls.", "url": "https://www.sciencealert.com/dark-streaks-on-mars-may-not-be-signs-of-flowing-water-like-we-thought", "urlToImage": "https://www.sciencealert.com/images/2025/05/streaks_on_mars_header.jpg", "publishedAt": "2025-05-21T02:59:38Z", "content": "It was big news years ago when Mars orbiters found streaks of what appeared to be water running down Martian cliffs and crater walls. Scientists worked hard to figure out what they were. Some propose… [+6214 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "Alarming Sea Level Rise Expected Even With 1.5°C Warming Limit - ScienceAlert", "description": "Rising seas will severely test humanity's resilience in the second half of the 21st century and beyond, even if nations defy the odds and cap global warming at the ambitious 1.5 degrees Celsius target, researchers said Tuesday.", "url": "https://www.sciencealert.com/alarming-sea-level-rise-expected-even-with-1-5c-warming-limit", "urlToImage": "https://www.sciencealert.com/images/2025/05/houses_rising_waters_header.jpg", "publishedAt": "2025-05-21T02:31:46Z", "content": "Rising seas will severely test humanity's resilience in the second half of the 21st century and beyond, even if nations defy the odds and cap global warming at the ambitious 1.5 degrees Celsius targe… [+4450 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A sinking of the oceanic crust could have caused the sea level to drop by 30 meters. - Farmingdale Observer", "description": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth's landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15 and 6 million years ago deserves special attention. Recent …", "url": "https://farmingdale-observer.com/2025/05/20/a-sinking-of-the-oceanic-crust-could-have-caused-the-sea-level-to-drop-by-30-meters/", "urlToImage": null, "publishedAt": "2025-05-21T01:32:00Z", "content": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth’s landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15… [+4033 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA says long-running budget shortfalls may lead to ISS crew and research reductions - SpaceNews", "description": "NASA says a “multi-year” budget shortfall even before the proposed cuts in the fiscal year 2026 budget have led the agency to consider ISS reductions.", "url": "http://spacenews.com/nasa-says-long-running-budget-shortfalls-may-lead-to-iss-crew-and-research-reductions/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/04/54193905419_090d981511_k.jpg", "publishedAt": "2025-05-21T00:10:35Z", "content": "WASHINGTON NASA says a multi-year budget shortfall even before the proposed cuts in the fiscal year 2026 budget request have led the agency to consider reductions in crew size and research on the Int… [+5485 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Frozen ocean world discovered between Mars and Jupiter - The Brighter Side of News", "description": "Instead of solid rock, they believe the crust is dirty ice—formed as a slushy, muddy ocean froze over time.", "url": "https://www.thebrighterside.news/space/frozen-ocean-world-discovered-between-mars-and-jupiter", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/ceres.jpg?auto=webp", "publishedAt": "2025-05-20T23:07:00Z", "content": "Astronomers have long been intrigued by the makeup of the asteroid belts largest body. When it was first spotted in 1801, Ceres appeared dry and rocky, its surface marked by craters and dents. For ye… [+10619 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "A tree dating back to the era of dinosaurs bears fruit for the first time, in the garden of two lucky retired English people. - Stewartville Star", "description": "In a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the garden of British retirees Pamela and Alistair Thompson. This extraordinary event marks a significant milesto…", "url": "https://thinkstewartville.com/2025/05/20/a-tree-dating-back-to-the-era-of-dinosaurs-bears-fruit-for-the-first-time-in-the-garden-of-two-lucky-retired-english-people/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-6480846130354-2025-05-19t093603.707.jpg", "publishedAt": "2025-05-20T21:57:00Z", "content": "Show table of content Hide table of content \r\nIn a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the gar… [+5898 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sarah C.P. Williams", "title": "Scientists discover one of the world's thinnest semiconductor junctions forming inside a quantum material - Phys.org", "description": "Scientists studying a promising quantum material have stumbled upon a surprise: within its crystal structure, the material naturally forms one of the world's thinnest semiconductor junctions—a building block of most modern electronics. The junction is just 3.…", "url": "https://phys.org/news/2025-05-scientists-world-thinnest-semiconductor-junctions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-on-1.jpg", "publishedAt": "2025-05-20T21:18:03Z", "content": "Scientists studying a promising quantum material have stumbled upon a surprise: within its crystal structure, the material naturally forms one of the world's thinnest semiconductor junctionsa buildin… [+4875 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Kasia Pawlowska", "title": "Bright green fireball stuns stargazers across 300 miles of California - SFGATE", "description": "A bright green fireball seen from Morro Bay to Truckee amazed Californians. According to the American Meteor Society, there's a clear reason why it was green.", "url": "https://www.sfgate.com/local/article/bright-green-fireball-seen-california-sky-20337262.php", "urlToImage": "https://s.hdnux.com/photos/01/50/33/32/27375236/3/rawImage.jpg", "publishedAt": "2025-05-20T21:11:58Z", "content": "FILE: A single bright meteor from the Geminid meteor shower is seen above the horizon in December 2017.\r\nUniversal Images Group via Getty\r\nA dazzling sight in the night sky caught the attention of do… [+1807 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How microorganisms swim without a brain and why it matters - Earth.com", "description": "Researchers from TU Wien, University of Vienna, and Tufts University discovered how microorganisms swim efficiently without central control.", "url": "https://www.earth.com/news/how-microorganisms-swim-without-a-brain-and-why-it-matters/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/20143207/Microorganisms-swim.jpg", "publishedAt": "2025-05-20T20:39:03Z", "content": "Picture a microorganism swimming through a liquid. It moves with purpose, but it has no brain, no nerves. How does it know where to go? How does it move at all? \r\nA team of researchers from TU Wien, … [+6907 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Janine Fohlmeister", "title": "The sun up close: Observations with new VTT camera technology deliver 8K image resolution - Phys.org", "description": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Tenerife uses image restoration methods to capture small structure…", "url": "https://phys.org/news/2025-05-sun-vtt-camera-technology-8k.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-sun-up-close-high.jpg", "publishedAt": "2025-05-20T19:23:04Z", "content": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Teneri… [+5258 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "Venus may be geologically 'alive' after all, reanalysis of 30-year-old NASA data reveals - Live Science", "description": "New research strengthens the case that Venus, long considered a geologically stagnant world, may be more Earth-like in its internal dynamics than once believed.", "url": "https://www.livescience.com/space/venus/venus-may-be-geologically-alive-after-all-reanalysis-of-30-year-old-nasa-data-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uYhwoAtbxSFbkHXg9ibSmB.jpg", "publishedAt": "2025-05-20T19:16:08Z", "content": "Scientists have uncovered fresh evidence that Venus is not dead — geologically speaking. Venus\r\n and Earth are similar in size and were bombarded by comparable amounts of water billions of years ago.… [+4459 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Stone Tools From 400,000 Years Ago Expose Unexpected Tech Breakthrough - The Daily Galaxy", "description": "This razor-sharp stone tool changed the game 400,000 years ago — but the story behind its origin reveals much more.", "url": "https://dailygalaxy.com/2025/05/stone-tools-expose-tech-breakthrough/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Stone-Tools-From-400000-Years-Ago-Expose-Unexpected-Tech-Breakthrough.jpg", "publishedAt": "2025-05-20T19:00:00Z", "content": "Recent archaeological discoveries from sites near Tel Aviv reveal how early humans adapted to a changing environment 400,000 years ago. A new study published in the journal Archaeologiesuncovers the … [+3175 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Terraforming Mars Could Be Within Reach - Universe Today", "description": "Mars has fascinated us for centuries. Since the invention of the telescope, science fiction writers have mused over its habitability. Its location in the Solar System's habitable zone suggests it could, in theory, support life—despite lacking a global magneti…", "url": "https://www.universetoday.com/articles/terraforming-mars-could-be-within-reach", "urlToImage": "https://www.universetoday.com/assets/terraform-mars.jpeg", "publishedAt": "2025-05-20T18:57:58Z", "content": "Mars, the fourth planet from the Sun, captivates both scientists and dreamers with its rust coloured surface and tantalising similarities to Earth. Often called the Red Planet due to iron oxide on it… [+3745 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Discover Hidden Dinosaur Mass Grave Full of Thousands of Fossils - Indian Defence Review", "description": "Scientists have uncovered a mysterious dinosaur mass grave containing thousands of perfectly preserved bones — and the secrets it holds could change everything we know about prehistoric life!", "url": "https://indiandefencereview.com/scientists-discover-dinosaur-mass-grave/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/scientists-discover-hidden-dinosaur-mass-grave-full-of-thousands-of-fossils.jpg", "publishedAt": "2025-05-20T18:15:00Z", "content": "A remarkable discovery in Alberta, Canada, has unveiled one of the largest dinosaur bone beds ever found in North America, providing scientists with a unique glimpse into prehistoric life. This findi… [+3421 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Sets Coverage for 32nd SpaceX Resupply Mission Departure - NASA (.gov)", "description": "Filled with nearly 6,700 pounds of supplies, science investigations, equipment, and food, the spacecraft arrived at the space station on April 22 after", "url": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-32nd-spacex-resupply-mission-departure/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/iss070e129455large.jpg", "publishedAt": "2025-05-20T17:43:21Z", "content": "NASA and its international partners will soon receive scientific research samples and hardware after a SpaceX Dragon spacecraft departs the International Space Station on Thursday, May 22, for its re… [+4173 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Distant Moon Shows an Uncanny Resemblance to Earth - The Daily Galaxy", "description": "Latest observations hint at a complex weather cycle and active atmospheric chemistry on Titan, Saturn’s largest moon, opening new paths in the hunt for habitable worlds in our solar system.", "url": "https://dailygalaxy.com/2025/05/distant-moon-shows-resemblance-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Distant-Moon-Shows-an-Uncanny-Resemblance-to-Earth.jpg", "publishedAt": "2025-05-20T17:30:00Z", "content": "Scientists using the James Webb Space Telescope and the Keck II telescope in Hawaii have observed something remarkable on Titan, Saturns largest moon. For the first time, researchers witnessed clouds… [+3024 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Powerful Mother's Day geomagnetic storm created radio-disrupting bubbles in Earth's upper atmosphere - Space", "description": "\"What we found was very interesting.\"", "url": "https://www.space.com/astronomy/earth/powerful-mothers-day-geomagnetic-storm-created-radio-disrupting-bubbles-in-earths-upper-atmosphere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6muVAVnyrGEX8N6kVyPskP.jpg", "publishedAt": "2025-05-20T17:00:00Z", "content": "Researchers from Kyushu University in Japan have provided some new insights about the powerful geomagnetic storm that flared up last Mother's Day, after a big solar storm hit Earth.\r\nThe work focuses… [+2802 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liszewski", "title": "ZEUS is now the country’s most powerful laser at 2 petawatts of power. - The Verge", "description": "The University of Michigan’s ZEUS is now the country’s most powerful with pulses lasting just 25 quintillionths of a second.", "url": "https://www.theverge.com/news/670781/university-of-michigan-zeus-laser-facility-two-quadrillion-watts-most-powerful", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/zeuslaser.jpg?quality=90&strip=all&crop=0%2C10.721349621873%2C100%2C78.557300756254&w=1200", "publishedAt": "2025-05-20T16:47:20Z", "content": "The University of Michigans ZEUS is now the countrys most powerful with pulses lasting just 25 quintillionths of a second.\r\nThe University of Michigans ZEUS is now the countrys most powerful with pul… [+2878 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain’s Gatekeepers Remember Signals to Shape Long-Term Memory - Neuroscience News", "description": "A new study reveals how calcium ion channels in the brain don’t just relay signals—they remember them. A new study reveals how calcium ion channels in the brain don’t just relay signals—they remember them.", "url": "https://neurosciencenews.com/synapses-ion-channel-memory-28987/", "urlToImage": "https://neurosciencenews.com/files/2025/05/memory-synapses-gatekeeper-neurosciecnce.jpg", "publishedAt": "2025-05-20T16:21:47Z", "content": "Summary: A new study reveals how calcium ion channels in the brain dont just relay signalsthey remember them. Researchers discovered that CaV2.1 channels at synapses can adopt nearly 200 shapes based… [+6767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tobias Schlößer", "title": "Overlooked electron property opens up new avenues for orbitronics - Phys.org", "description": "The orbital angular momentum of electrons has long been considered a minor physical phenomenon, suppressed in most crystals and largely overlooked. Scientists at Forschungszentrum Jülich have now discovered that in certain materials it is not only preserved b…", "url": "https://phys.org/news/2025-05-overlooked-electron-property-avenues-orbitronics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/overlooked-electron-pr.jpg", "publishedAt": "2025-05-20T16:19:03Z", "content": "The orbital angular momentum of electrons has long been considered a minor physical phenomenon, suppressed in most crystals and largely overlooked. Scientists at Forschungszentrum Jülich have now dis… [+5832 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "House-size asteroid will pass between Earth and moon on May 21 - Space", "description": "The asteroid poses no threat to the moon or Earth.", "url": "https://www.space.com/stargazing/house-size-asteroid-will-pass-between-earth-and-moon-on-may-21", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HLGhg9CRXow4f2M8NMvAGC.jpg", "publishedAt": "2025-05-20T16:00:00Z", "content": "A newly discovered house-size asteroid is set to make a close, yet harmless approach to Earth on May 21, passing within one-third of the Earth-moon distance.\r\nThe close approach will happen at approx… [+2689 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Biology Centre of the Czech Academy of Sciences", "title": "The mysterious Giant Woolly Rat: Largest rodent in Australia and Oceania documented for first time - Phys.org", "description": "A six-month expedition to the tropical island of New Guinea has led to a remarkable discovery by a young Czech doctoral candidate from the Biology Center of the Czech Academy of Sciences and the University of South Bohemia. František Vejmělka has become the f…", "url": "https://phys.org/news/2025-05-mysterious-giant-woolly-rat-largest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/czech-scientist-makes.jpg", "publishedAt": "2025-05-20T15:29:37Z", "content": "A six-month expedition to the tropical island of New Guinea has led to a remarkable discovery by a young Czech doctoral candidate from the Biology Center of the Czech Academy of Sciences and the Univ… [+4448 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Physicists succeed in converting light into a supersolid that flows like a liquid - Earth.com", "description": "Physicists convert beams of light into frictionless supersolid, first step toward advanced quantum materials and future photonic technologies", "url": "https://www.earth.com/news/physicists-succeed-in-converting-light-into-a-supersolid-that-flows-like-a-liquid/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19034201/physicists-light-supersolid-liquid-flow.jpg", "publishedAt": "2025-05-20T15:02:06Z", "content": "Physicists have reached an unexpected breakthrough: they changed beams of light into a supersolid that flows without normal resistance. This marks a major milestone in condensed matter physics becaus… [+4896 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Samantha Mathewson", "title": "The 100th woman in space: Emily Calandrelli talks about her Blue Origin flight and inspiring the next generation - Space", "description": "\" I recognize that going into space is something that is an incredibly privileged thing to do. I always told myself that if I were to have that chance, I would try to use it to uplift others.\"", "url": "https://www.livescience.com/space/100th-woman-in-space-emily-calandrelli-stands-up-to-small-men-on-the-internet-i-should-have-expected-this", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hLGePwFtSWn74QhN48sKME.jpg", "publishedAt": "2025-05-20T15:00:00Z", "content": "For Emily Calandrelli, known to many as \"The Space Gal,\" the dream of spaceflight began over 20 years ago. Last year, that dream became a reality.\r\nAs the 100th woman to travel to space, Calandrelli … [+5929 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "40 Years After the Chilling Ozone Hole Discovery: Scientists Unveil Eye-Opening New Details - The Daily Galaxy", "description": "40 years after the ozone hole discovery, scientists reveal what’s really happening above Antarctica", "url": "https://dailygalaxy.com/2025/05/40-years-chilling-ozone-hole-discovery/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/40-Years-After-the-Chilling-Ozone-Hole-Discovery-Scientists-Unveil-Eye-Opening-New-Details.jpg", "publishedAt": "2025-05-20T14:50:00Z", "content": "It has been 40 years since scientists revealed the shocking discovery of a large hole in the ozone layer above Antarctica, a finding that sparked urgent global action to protect the planets fragile s… [+4964 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discovered a Lost Planet Hidden Deep Inside Earth’s Mantle - The Daily Galaxy", "description": "Deep beneath our feet lies the shocking discovery of a lost planet’s remains hidden inside Earth’s mantle—redefining our planet’s violent origins.", "url": "https://dailygalaxy.com/2025/05/scientists-lost-planet-hidden-earth-mantle/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discovered-a-Lost-Planet-Hidden-Deep-Inside-Earths-Mantle.jpg", "publishedAt": "2025-05-20T14:00:00Z", "content": "A recent study published in Naturepresents compelling evidence of ancient planetary material buried deep within Earth’s mantle. Researchers have uncovered two massive dense structures beneath Africa … [+4410 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Christopher Plain", "title": "Astronomers Detect Mysterious, Perfectly Spherical Object in Deep Space Emitting Radio Signals - The Debrief", "description": "An international team of astronomers have detected an invisible, mysterious, nearly perfectly spherical object emitting radio signals.", "url": "https://thedebrief.org/astronomers-detect-mysterious-perfectly-spherical-object-in-deep-space-emitting-radio-signals/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/RESIZE-Screenshot-2025-05-19-225234.jpg", "publishedAt": "2025-05-20T13:10:28Z", "content": "A team of astronomers using the Australian Square Kilometre Array Pathfinder (ASKAP) radio telescope have detected a mysterious, almost perfectly spherical object in deep space.\r\nNamed Teleios, Greek… [+3887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Who is watching for earthquakes, volcanoes and tsunamis? Trump is cutting the guardians at the gate - AOL.com", "description": "The league of experts and scientists who have spent decades keeping watch is being decimated by the Trump administration’s staffing cuts.", "url": "https://www.cnn.com/2025/05/20/climate/volcanoes-earthquakes-tsunamis-federal-cuts-dg", "urlToImage": "https://media.zenfs.com/en/aol_cnn_articles_945/bb73324512e90a51f43bd905145d6edd", "publishedAt": "2025-05-20T13:05:35Z", "content": "Sometime between today and 200 years from now, scientists say the big one will hit the United States.\r\nThere is danger lurking on the sea floor off the Pacific Northwests coast: After centuries of tw… [+9334 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "'We don't know how bad it could get' — Are we ready for the worst space weather? - Space", "description": "Space weather forecasting doesn't yet command the same resources as Earth weather forecasting, even though the stakes are growing.", "url": "https://www.space.com/astronomy/sun/we-dont-know-how-bad-it-could-get-are-we-ready-for-the-worst-space-weather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bAaXvg5uVKnsKfVNXLvX85.jpg", "publishedAt": "2025-05-20T13:00:00Z", "content": "Imagine being told a storm is heading your way, but you won't know how bad the winds are or whether they'll knock out power until just minutes before it hits. That's the challenge scientists face whe… [+8440 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "How to Stop Crying Over Onions: Get Sharp - Newser", "description": "Cornell physicists find dull blades, fast cuts release more irritating particles into the air", "url": "https://www.newser.com/story/368961/how-to-stop-crying-over-onions-get-sharp.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1611596-12-20250520080902.jpeg", "publishedAt": "2025-05-20T12:46:00Z", "content": "If you tend to tear up when cutting onions, blame syn-propanethial-S-oxide. That's the chemical released when an onion is sliced, triggering the nerves in your eye responsible for producing tears. Th… [+1638 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jarred Roberts", "title": "Do photons wear out? An astrophysicist explains light’s ability to travel vast cosmic distances without losing energy - The Conversation", "description": "The speed of light is the fastest anything can travel. What happens to a photon from a galaxy 25 million light years away on its journey toward Earth?", "url": "https://theconversation.com/do-photons-wear-out-an-astrophysicist-explains-lights-ability-to-travel-vast-cosmic-distances-without-losing-energy-252880", "urlToImage": "https://images.theconversation.com/files/665882/original/file-20250505-62-3pk41.jpg?ixlib=rb-4.1.0&rect=0%2C744%2C8451%2C4225&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-20T12:40:39Z", "content": "My telescope, set up for astrophotography in my light-polluted San Diego backyard, was pointed at a galaxy unfathomably far from Earth. My wife, Cristina, walked up just as the first space photo stre… [+4766 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Found a Hidden Force Beneath Africa That Could Split the Continent in Two - Yahoo", "description": "Stretching some 4,000 miles, the East African Rift System is one of the largest rifts in the world, and a new study may have just settled a long-standing...", "url": "https://www.popularmechanics.com/science/environment/a64797429/east-african-rift-system-superplume/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yp4HNF0fldEpXWdeYzhrQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/c3d891cc4599dec1b20c55d6d3f19a3a", "publishedAt": "2025-05-20T12:30:00Z", "content": "Heres what youll learn in this story:\r\n<ul><li>The East African Rift System (EARS) is one of the most impressive geologic features on the planetnot to mention one of the most volcanically active and … [+4231 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Caroline Delbert", "title": "Scientists May Have Found a Way to Simplify Gravity. It Could Change Physics as We Know It. - Yahoo", "description": "It may be more straightforward than we thought—mathematically speaking, anyway.", "url": "https://www.popularmechanics.com/science/a64814750/unified-theory-gravity/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j90YkT9slWzcMcuqJ9JTew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/747dfb41ca7b9cdf60fa6427fd333453", "publishedAt": "2025-05-20T12:00:00Z", "content": "Heres what youll learn in this story.\r\n<ul><li>A new paper uses a simplified model to prove that gravity can be unified between quantum and standard physics.\r\n</li><li>The simpler model still meets t… [+3464 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Has Polaris always been the North Star? How Earth's 26,000 year cycle changes the 'pole star' - Space", "description": "Lets take a trip through time.", "url": "https://www.space.com/stargazing/has-polaris-always-been-the-north-star-how-earths-26-000-year-cycle-changes-the-pole-star", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qYoKqgVjZJqVm7gNxPzTiQ.jpg", "publishedAt": "2025-05-20T10:00:00Z", "content": "Polaris, also known as the 'Pole Star' or 'North Star', is arguably the most famous stellar body to hang in the western hemisphere's night sky. For centuries it has served as a vital waypoint for exp… [+9348 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes Send Secret Signals Through Trees And NASA Satellites Can See Them - SciTechDaily", "description": "Greener trees may mean looming eruptions — and now satellites can see it coming.", "url": "https://scitechdaily.com/volcanoes-send-secret-signals-through-trees-and-nasa-satellites-can-see-them/", "urlToImage": "https://scitechdaily.com/images/Chaiten-Volcano-in-Southern-Chile.jpg", "publishedAt": "2025-05-20T09:23:46Z", "content": "Chaitén Volcano in southern Chile erupted on May 2, 2008, for the first time in 9,000 years. NASA satellites that monitor changes in vegetation near volcanoes could aid in earlier eruption warnings. … [+8260 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Scott Neuman", "title": "A broken thruster jeopardized Voyager 1, but engineers executed a remote fix - NPR", "description": "NASA mission controllers raced against time to find a solution before a crucial ground-based radio used for communicating with Voyagers 1 and 2, went offline for upgrades.", "url": "https://www.npr.org/2025/05/20/nx-s1-5403501/voyager-thruster-nasa-interstellar", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/985x554+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7a%2Faa%2Fb8440cc043a59255b4d5a330b678%2Fap24114713039232.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": "Earlier this year, NASA mission controllers faced a challenging decision that could have marked the end of Voyager 1's decades-long journey. \r\nLaunched in 1977 to explore the outer solar system, the … [+4288 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "A NASA Mars rover looked up at a moody sky. What it saw wasn't a star. - Mashable", "description": "Perseverance captures a rare sight from the surface of the Red Planet.", "url": "https://mashable.com/article/nasa-perseverance-mars-moon-deimos-image", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01bQ3GYPyvMtCRR7QIHSFn8/hero-image.fill.size_1200x675.v1747681609.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Second CubeSat joins ESA’s Ramses mission to asteroid Apophis - European Space Agency", "description": null, "url": "https://www.esa.int/Space_Safety/Planetary_Defence/Second_CubeSat_joins_ESA_s_Ramses_mission_to_asteroid_Apophis", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/10/ramses_mission_patch/26369474-1-eng-GB/Ramses_mission_patch_pillars.png", "publishedAt": "2025-05-20T07:51:54Z", "content": "Space Safety20/05/20251211 views34 likes\r\nOn 13 April 2029, the 375 m asteroid Apophis will make a safe but exceptionally close flyby of Earth. ESA is preparing the Ramses mission, which, if fully su… [+2927 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Bright Streak Appears Over US During Aurora Storm, Mystifying Skywatchers - ScienceAlert", "description": "On the night of Saturday 17 May, skywatchers across the US as far south as New Mexico were treated to a peculiar sight: a brilliant stream of whitish light, stretching across the sky.", "url": "https://www.sciencealert.com/bright-streak-appears-over-us-during-aurora-storm-mystifying-skywatchers", "urlToImage": "https://www.sciencealert.com/images/2025/05/white-beam.jpg", "publishedAt": "2025-05-20T04:26:34Z", "content": "On the night of Saturday 17 May, skywatchers across the US as far south as New Mexico were treated to a peculiar sight: a brilliant stream of whitish light, stretching across the sky.\r\nThat was a nig… [+3820 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Perseverance Mars Rover Hits a Geologic Goldmine at Jezero Crater Rim - SciTechDaily", "description": "Perseverance is racing through its fastest science mission yet, uncovering ancient rocks that hint at Mars’ violent, watery past — and maybe even the conditions for life.", "url": "https://scitechdaily.com/nasas-perseverance-mars-rover-hits-a-geologic-goldmine-at-jezero-crater-rim/", "urlToImage": "https://scitechdaily.com/images/NASA-Perseverance-Mars-Rover-Green-Gardens-Sample.jpg", "publishedAt": "2025-05-20T03:41:31Z", "content": "Sealing the “Green Gardens” sample — collected by NASA’s Perseverance Mars rover from a rock dubbed “Tablelands” along the rim of Jezero Crater on February 16, 2025 — presented an engineering challen… [+7584 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Archaeopteryx fossil discovered with preserved soft tissue proves Darwin was right all along - Earth.com", "description": "A new Archaeopteryx fossil with soft tissue reveals flight features and offers fresh support for Darwin’s theory of evolution.", "url": "https://www.earth.com/news/archaeopteryx-fossil-soft-tissue-flight-evolution-proves-darwin-right/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19180325/Archaeopteryx-fossil_UV-light_soft-tissue_credit-Delaney-Drummond_1m.jpg", "publishedAt": "2025-05-20T00:24:16Z", "content": "Archaeopteryx is often referred to as the fossil that proved Darwin right – it links todays birds to ancient dinosaurs. Even though the first specimen was discovered over 160 years ago, this iconic f… [+6244 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Celebrating a Long Career With Roots on Long Island - NASA Earth Observatory (.gov)", "description": "NASA’s Jack Kaye enabled decades of Earth scientists, including those who are unveiling the atmospheric ties between New York City and its suburbs.", "url": "https://earthobservatory.nasa.gov/images/154320/celebrating-a-long-career-with-roots-on-long-island", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/154000/154320/longisland_oli_20230809_th.jpg", "publishedAt": "2025-05-19T22:07:25Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "James Webb Space Telescope discovers an alien planetary system's icy edge - Space", "description": "\"Basically, we detected a water–ice reservoir.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-discovers-an-alien-planetary-systems-icy-edge", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oXbjV6e74vPpZXq9BXV3Zm.png", "publishedAt": "2025-05-19T20:00:00Z", "content": "At long last, particles of water–ice have been discovered in the frozen Kuiper Belt of another star. The discovery, made by the James Webb Space Telescope, is a major step forward in filling in gaps … [+7026 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "A 28,000-year-old 'hybrid child' confirms interbreeding between humans and Neanderthals - Earth.com", "description": "28,000-year-old hybrid child found; new dating confirms crossbreeding between modern humans and Neanderthals.", "url": "https://www.earth.com/news/28000-year-old-hybrid-child-confirms-interbreeding-between-humans-and-neanderthals/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19041700/28000-year-old-hybrid-child-sapiens-neanderthal-interbreeding.jpg", "publishedAt": "2025-05-19T19:44:10Z", "content": "They found this childs bones 27 years ago in a shallow rock shelter in central Portugal. Researchers immediately noticed that the young skeleton had traits belonging to modern humans and to Neanderth… [+4783 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Poukish", "title": "The Milky Way will soon be visible in the California sky: How and when to see it - Phys.org", "description": "California stargazers will soon be able to witness a dazzling celestial sight composed of billions of stars.", "url": "https://phys.org/news/2025-05-milky-visible-california-sky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/milkyway.jpg", "publishedAt": "2025-05-19T19:42:47Z", "content": "California stargazers will soon be able to witness a dazzling celestial sight composed of billions of stars.\r\nIn late May, the Milky Way galaxy will appear as a vibrant band arching across the night … [+2468 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA’s Perseverance Mars Rover to Take Bite Out of ‘Krokodillen’ - NASA (.gov)", "description": "Scientists expect the new area of interest on the lower slope of Jezero Crater’s rim to offer up some of the oldest rocks on the Red Planet.", "url": "https://www.nasa.gov/missions/mars-2020-perseverance/perseverance-rover/nasas-perseverance-mars-rover-to-take-bite-out-of-krokodillen/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/1-pia26573-navcam-nlf-1503-0800373830-316fdr-n0731522ncam13503-0a0195j01-srgb-scaled-stretched-cropped.png", "publishedAt": "2025-05-19T19:04:06Z", "content": "Scientists expect the new area of interest on the lower slope of Jezero Craters rim to offer up some of the oldest rocks on the Red Planet.\r\nNASAs Perseverance Mars rover is exploring a new region of… [+4988 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert Staff", "title": "TRAPPIST-1 Planets Could Be Swimming in Water, Study Shows - ScienceAlert", "description": "A seven-planet system some 40 light-years from Earth could be swimming in water, new research shows.", "url": "https://www.sciencealert.com/trappist-1-planets-could-be-swimming-in-water-study-shows", "urlToImage": "https://www.sciencealert.com/images/2025/05/TrappistWorldsIllustration.jpg", "publishedAt": "2025-05-19T19:01:31Z", "content": "A seven-planet system some 40 light-years from Earth could be swimming in water, new research shows.\r\nIn February 2017 scientists announced the discovery of several exoplanets orbiting the red dwarf … [+4421 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Our galaxy's swirling gases and magnetic lines create cosmic artwork in new simulation - Space", "description": "\"Turbulence remains one of the greatest unsolved problems in classical mechanics.\"", "url": "https://www.space.com/astronomy/our-galaxys-swirling-gases-and-magnetic-lines-create-cosmic-artwork-in-new-simulation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RTQBJnVspU4ebe8523npkK.jpg", "publishedAt": "2025-05-19T19:00:00Z", "content": "In between all the stars in our galaxy, there is a vast, diffuse mix of gas and dust known as the interstellar medium — and scientists have developed a new computer model to explore the magnetism and… [+4241 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "14,000 Years Ago, a Mysterious Solar Event “500 Times More Intense” Than Any Previously Known Bombarded Earth—Could it Happen Again? - The Debrief", "description": "New findings suggest that a mysterious solar event roughly 500 times more powerful than any recorded by scientists struck the Earth near the end of the last Ice Age.", "url": "https://thedebrief.org/14000-years-ago-a-mysterious-solar-event-500-times-more-intense-than-any-previously-known-bombarded-earth-could-it-happen-again/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/solar-event.jpg", "publishedAt": "2025-05-19T18:20:42Z", "content": "New findings indicate that a massive solar storm, roughly 500 times more powerful than any previously recorded, left its mark on our planet near the end of the last Ice Age.\r\nApproximately 14,000 yea… [+4828 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jeremy Gray", "title": "15 Stellar Shots from the 2025 Milky Way Photographer of the Year Contest - PetaPixel", "description": "The eighth annual Milky Way Photographer of the Year contest features spectacular winning night sky photos.", "url": "https://petapixel.com/2025/05/19/15-stellar-shots-from-the-2025-milky-way-photographer-of-the-year-contest/", "urlToImage": "https://petapixel.com/assets/uploads/2025/05/2025-milky-way-photographer-of-the-year-featured.jpg", "publishedAt": "2025-05-19T17:57:52Z", "content": "Travel photography blog Capture the Atlas has announced the winners of its annual Milky Way Photographer of the Year competition. The curated 2025 collection features 25 of the best Milky Way photos … [+9611 chars]"}, {"source": {"id": null, "name": "404media.co"}, "author": "Matthew Gault", "title": "Telegram Gave Authorities Data on More than 20,000 Users - 404 Media", "description": "According to its newest transparency report, Telegram complied with more than 5,000 requests from authorities in the first three months of 2025.", "url": "https://www.404media.co/telegram-gave-authorities-data-on-more-than-20-000-users/", "urlToImage": "https://images.unsplash.com/photo-1636743091340-af4ee8147080?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDN8fFRlbGVncmFtfGVufDB8fHx8MTc0NzY3MzM4M3ww&ixlib=rb-4.1.0&q=80&w=2000", "publishedAt": "2025-05-19T17:12:30Z", "content": "Telegram gave authorities the data on 22,777 of its users\r\n in the first three months of 2025, according to a GitHub that reposts Telegrams transparency reports\r\n.That number is a massive jump from t… [+434 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Daniel Commandeur, Mahsa Masoudi, Siddharth Gadkari", "title": "Batteries that absorb carbon emissions move a step closer to reality – new study - The Conversation", "description": "Lithium carbon dioxide batteries could be a gamechanger for everything from renewable-energy storage to colonising Mars.", "url": "https://theconversation.com/batteries-that-absorb-carbon-emissions-move-a-step-closer-to-reality-new-study-256915", "urlToImage": "https://images.theconversation.com/files/668428/original/file-20250516-62-18tif5.jpg?ixlib=rb-4.1.0&rect=0%2C804%2C4159%2C2079&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-19T17:07:08Z", "content": "What if there were a battery that could release energy while trapping carbon dioxide? This isnt science fiction; its the promise of lithium-carbon dioxide (Li-CO) batteries, which are currently a hot… [+6890 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "\"This moment was inevitable\": this AI crosses the line by attempting to rewrite its code to escape human control. - Farmingdale Observer", "description": "In a groundbreaking yet alarming development, The AI Scientist, an advanced artificial intelligence system developed by Japanese company Sakana AI, has demonstrated behavior that many experts have long feared: attempting to rewrite its own operational code to…", "url": "https://farmingdale-observer.com/2025/05/19/this-moment-was-inevitable-this-ai-crosses-the-line-by-attempting-to-rewrite-its-code-to-escape-human-control/", "urlToImage": null, "publishedAt": "2025-05-19T15:45:00Z", "content": "In a groundbreaking yet alarming development, The AI Scientist, an advanced artificial intelligence system developed by Japanese company Sakana AI, has demonstrated behavior that many experts have lo… [+4938 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discover Massive Hidden Ocean 400 Miles Beneath Earth’s Surface - The Daily Galaxy", "description": "Hidden 400 miles underground, this secret ocean could rewrite the story of our planet forever!", "url": "https://dailygalaxy.com/2025/05/hidden-ocean-400-miles-beneath-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discover-Massive-Hidden-Ocean-400-Miles-Beneath-Earths-Surface.jpg", "publishedAt": "2025-05-19T15:30:00Z", "content": "A groundbreaking study published in Nature reveals compelling evidence of a vast ocean trapped deep within the Earths mantle, about 400 miles beneath the surface. This hidden water reservoir, stored … [+3078 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "A common enzyme takes on a surprising role in preventing cancer - Medical Xpress", "description": "Researchers at Duke University Medical Center and Wake Forest University School of Medicine have identified ALDH4A1, a mitochondrial proline-metabolizing enzyme, as a third structural component of the mitochondrial pyruvate carrier (MPC) complex. Forming a tr…", "url": "https://medicalxpress.com/news/2025-05-common-enzyme-role-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-common-enzyme-takes.jpg", "publishedAt": "2025-05-19T14:30:02Z", "content": "Researchers at Duke University Medical Center and Wake Forest University School of Medicine have identified ALDH4A1, a mitochondrial proline-metabolizing enzyme, as a third structural component of th… [+3557 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cerium Glows Yellow: Chemists Teach Rare Earth Elements New Tricks - SciTechDaily", "description": "Scientists have developed a method to alter the color and brightness of rare earth element luminescence by changing their chemical environment, enabling the design of advanced light-emitting materials. Researchers at HSE University and the Institute of Petroc…", "url": "https://scitechdaily.com/?p=472803", "urlToImage": "https://scitechdaily.com/images/Glowing-Yellow-Cube.jpg", "publishedAt": "2025-05-19T13:30:23Z", "content": "Scientists found a way to change the color and brightness of rare earth element luminescence, paving the way for new light technologies. (Artist’s concept). Credit: SciTechDaily.com\r\nScientists have … [+5788 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "Scientists Found Footprints That Push Humanity’s Timeline Back By 40 Million Years - Yahoo", "description": "We all came from... something like a lizard.", "url": "https://www.popularmechanics.com/science/archaeology/a64788033/footprints-push-humanitys-timeline/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HMoOvHm5n32FkwB6U1WRng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/popular_mechanics_642/c08daf95d41c9c54e08157444ca62d5e", "publishedAt": "2025-05-19T13:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\nHeres what youll learn in this story:\r\n<ul><li>The common ancestor of all tetrapods (including humans) … [+4504 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Christopher Palma, Lucas Brefka", "title": "In what order did the planets in our solar system form? - The Conversation", "description": "The biggest planets hogged a lot of the raw materials and were fully formed first.", "url": "https://theconversation.com/in-what-order-did-the-planets-in-our-solar-system-form-252262", "urlToImage": "https://images.theconversation.com/files/664487/original/file-20250428-56-fbvl4u.jpg?ixlib=rb-4.1.0&rect=0%2C0%2C5499%2C2749&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-19T12:41:45Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to CuriousKidsUS@theconversation.com.\r\nAre planets in the solar system that are closer… [+4632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Is It Erupting Soon? Scientists Solve Mystery of Rumbling “Zombie” Volcano - SciTechDaily", "description": "Researchers used seismic tomography to reveal that fluid buildup, not magma, is driving Uturuncu’s deformation, indicating low eruption risk. Scientists from China, the UK, and the USA have worked together to study the inner workings of Bolivia’s “zombie” vol…", "url": "https://scitechdaily.com/is-it-erupting-soon-scientists-solve-mystery-of-rumbling-zombie-volcano/", "urlToImage": "https://scitechdaily.com/images/Ancient-Volcano-Crater.jpg", "publishedAt": "2025-05-19T12:40:14Z", "content": "An international team of scientists has used advanced imaging and geophysical modeling to investigate Bolivia’s “zombie” volcano, Uturuncu, revealing that its unrest is caused by fluid and gas moveme… [+5293 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "NASA Mission Captures Eerie New View of The Moon And Sun - ScienceAlert", "description": "A new NASA mission to map the solar wind has returned some of its first images from its position in low Earth orbit.", "url": "https://www.sciencealert.com/nasa-mission-captures-eerie-new-view-of-the-moon-and-sun", "urlToImage": "https://www.sciencealert.com/images/2025/05/moon-and-sun.jpg", "publishedAt": "2025-05-19T12:02:35Z", "content": "A new NASA mission to map the solar wind has returned some of its first images from its position in low Earth orbit.\r\nThe Polarimeter to Unify the Corona and Heliosphere (PUNCH) mission launched on 1… [+3324 chars]"}]}