{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Fast Radio Burst Traced Back to The Last Place We Expected - ScienceAlert", "description": "The mystery of fast radio bursts (FRBs) just got a little bit weirder.", "url": "https://www.sciencealert.com/fast-radio-burst-traced-back-to-the-last-place-we-expected", "urlToImage": "https://www.sciencealert.com/images/2025/02/magnetar-eso.jpg", "publishedAt": "2025-03-03T05:37:48Z", "content": "The mystery of fast radio bursts (FRBs) just got a little bit weirder.\r\nA team of astronomers has just traced a burst called FRB 20190208A back to the distant galaxy that spat it out and they found a… [+5462 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Simon Sharwood", "title": "First private moon lander to touch down safely starts sending selfies - The Register", "description": "Firefly Aerospace’s Blue Ghost planned to work for 14 days, should be useful for years thanks to its reflector that improves on Apollo-era tech", "url": "https://www.theregister.com/2025/03/03/blue_ghost_private_moon_success/", "urlToImage": "https://regmedia.co.uk/2025/03/03/supplied_firefly_blue_ghost_shadow_selfie.jpg", "publishedAt": "2025-03-03T04:59:00Z", "content": "Sunday March 2nd has become a notable day in humanitys exploration of outer space, after Firefly Aerospace became the first private company to successfully land a spacecraft on the Moon.\r\nFireflys mi… [+2235 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Discovered an RNA That Repairs DNA Damage – And It’s a Game-Changer - SciTechDaily", "description": "Our DNA is constantly under threat — from cell division errors to external factors like sunlight and smoking. Fortunately, cells have intricate repair mechanisms to counteract this damage. Scientists have uncovered a surprising role played by long non-coding …", "url": "https://scitechdaily.com/scientists-just-discovered-an-rna-that-repairs-dna-damage-and-its-a-game-changer/", "urlToImage": "https://scitechdaily.com/images/Genetics-DNA-Damage-Concept-Art.jpg", "publishedAt": "2025-03-03T03:10:15Z", "content": "A research team has identified NEAT1, a long non-coding RNA, as a key player in DNA repair. This discovery links RNA metabolism to genome stability and opens up potential new cancer treatments. Credi… [+5426 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI World Desk", "title": "Watch: Elon Musk shares rare footage of SpaceX Starship's water landing - The Times of India", "description": "World News: Elon Musk shared a video of a Starship upper stage making a vertical water landing, highlighting effort toward perfecting reentry at extreme temperatu", "url": "https://timesofindia.indiatimes.com/world/us/watch-elon-musk-shares-rare-footage-of-spacex-starships-water-landing/articleshow/118671667.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-118671771,width-1070,height-580,imgsize-9858,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-03-03T03:04:00Z", "content": null}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "Hackaday Links: March 2, 2025 - Hackaday", "description": "It’s been quite a week for asteroid 2024 YR4, which looked like it was going to live up to its “city killer” moniker only to be demoted to a fraction of a percent risk of hitting …", "url": "https://hackaday.com/2025/03/02/hackaday-links-march-2-2025/", "urlToImage": "https://hackaday.com/wp-content/uploads/2014/11/had-links-banner.jpg", "publishedAt": "2025-03-03T00:00:00Z", "content": "It’s been quite a week for asteroid 2024 YR4, which looked like it was going to live up to its “city killer” moniker only to be demoted to a fraction of a percent risk of hitting us when it swings by… [+4238 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Human Skin Can Taste Things, And Scientists Just Figured Out Why - ScienceAlert", "description": "Ever set off too many of the bitter taste receptors on your tongue? You probably spat out whatever it was in your mouth, and that's our best guess for why we even have them: to stop us from ingesting things that might be harmful.", "url": "https://www.sciencealert.com/human-skin-can-taste-things-and-scientists-just-figured-out-why", "urlToImage": "https://www.sciencealert.com/images/2025/02/HandInShadows.jpg", "publishedAt": "2025-03-02T23:55:18Z", "content": "Ever set off too many of the bitter taste receptors on your tongue? You probably spat out whatever it was in your mouth, and that's our best guess for why we even have them: to stop us from ingesting… [+2973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Billion-Light-Year Superstructure Shakes Up Our View of the Universe - SciTechDaily", "description": "Scientists have uncovered “Quipu,” the largest known galactic structure, stretching 1.4 billion light-years. This discovery reshapes cosmic mapping and affects key measurements of the universe’s expansion. A team of scientists has identified the largest cosmi…", "url": "https://scitechdaily.com/billion-light-year-superstructure-shakes-up-our-view-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Five-Superstructures.jpg", "publishedAt": "2025-03-02T23:21:56Z", "content": "Distribution of galaxies (color coding) and galaxy clusters (black dots) in a spherical shell with a distance of 416 to 826 million light years surrounding us. The five superstructures are marked: 1 … [+5302 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Zach Clark", "title": "WATCH LIVE: SpaceX Set for Rocket Launch Sunday Night Carrying Starlink Mission from Cape Canaveral - SpaceCoastDaily.com", "description": "SpaceX is targeting Sunday, March 2 for a Falcon 9 launch of 21 Starlink satellites, including 13 with Direct to Cell capabilities, to low-Earth orbit from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station in Florida.", "url": "https://spacecoastdaily.com/2025/03/watch-live-spacex-set-for-rocket-launch-sunday-night-carrying-starlink-mission-from-cape-canaveral/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2021/02/SpaceX-Starlink-1.jpg", "publishedAt": "2025-03-02T23:15:41Z", "content": "Home » Home » WATCH LIVE: SpaceX Set for Rocket Launch Sunday Night Carrying Starlink Mission from Cape CanaveralBy Space Coast Daily  //  March 2, 2025 \r\nWATCH LIVE:SpaceX Set for Rocket Launch Sund… [+1093 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Nokia And NASA Are Revolutionizing Lunar Exploration With The Launch Of The First Mobile Network On The Moon - Wccftech", "description": "Nokia is deploying its 4G/LTE network on the moon and would be the first network to offer lunar communication system", "url": "https://wccftech.com/nokia-and-nasa-are-revolutionizing-lunar-exploration-with-the-launch-of-the-first-mobile-network-on-the-moon/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/03/Nokia-and-Nasa-e1740948302690.jpg", "publishedAt": "2025-03-02T20:53:00Z", "content": "Nokia was once the leading name in the mobile market, but it parted ways amidst the growing competition and the changing demands of the consumers. While the Finish company is no longer manufacturing … [+2192 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Europa Clipper Flies Past Mars On Its Way To Jupiter’s Icy Moon - The Daily Galaxy --Great Discoveries Channel", "description": "NASA's Europa Clipper just made a daring pass by Mars, using the planet’s gravity to slingshot itself toward Jupiter’s icy moon, Europa. But this wasn’t just a routine maneuver—scientists seized the moment to test key instruments that could one day reveal sig…", "url": "https://dailygalaxy.com/2025/03/nasas-europa-clipper/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/NASAs-Europa-Clipper-Flies-Past-Mars-On-Its-Way-To-Jupiters-Icy-Moon.jpg", "publishedAt": "2025-03-02T19:30:00Z", "content": "NASAs Europa Clipper spacecraft made a crucial maneuver, passing just 550 miles (884 km) above Mars as it continued its journey toward Jupiters ice-covered moon, Europa. The flyby was not just a scen… [+2753 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Tiny Atomic Collisions Unleash Unexpected Energy Bursts - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have uncovered a surprising quantum phenomenon—tiny atomic collisions can unleash unexpected bursts of energy, sometimes ejecting atoms from their traps. Could this discovery reshape the way we manipulate matter at the quantum level?", "url": "https://dailygalaxy.com/2025/03/atomic-collisions-unleash-energy-bursts/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Tiny-Atomic-Collisions-Unleash-Unexpected-Energy-Bursts.jpg", "publishedAt": "2025-03-02T18:00:00Z", "content": "Rubidium atoms can behave unpredictably during atomic collisions, especially when exposed to specific laser light. Researchers have now discovered that these tiny interactions can release unexpected … [+3069 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Sarah Stanley, Eos.org", "title": "Ancient seafloor spreading 15 million years ago caused sea levels to plummet - Livescience.com", "description": "Between 15 million and 6 million years ago, a drop in ocean crust production may have lowered sea level by 26 to 32 meters.", "url": "https://eos.org/research-spotlights/a-seafloor-spreading-slowdown-may-have-slashed-sea-levels", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AuGihh97f9WBz3dthhYFqP-1200-80.jpg", "publishedAt": "2025-03-02T18:00:00Z", "content": "Today we are witnessing rapid global sea level rise attributable mostly to climate change-driven\r\n melting of ice sheets and glaciers\r\n and thermal expansion of seawater. However, sea level change al… [+2464 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Find Evidence of Vehicles From Tens of Thousands of Years Ago - Futurism", "description": "Scientists have discovered footprints and drag marks left behind by an ancient vehicle dated to over 22,000 years ago.", "url": "https://futurism.com/evidence-vehicles-tens-thousands-years-old", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/evidence-vehicles-tens-thousands-years-old.jpg", "publishedAt": "2025-03-02T17:45:01Z", "content": "Uncannily preserved in the sands of New Mexico, archaeologists have discovered the oldest evidence yet of a vehicle used by humans: drag marks, along with footprints, left in the ground that have bee… [+2728 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Researchers experimenting with reversing time discovered something surprising - BGR", "description": "A new study suggests that physics doesn't care about the idea of linear time, and some scientists say there may even be multiple universes.", "url": "https://bgr.com/science/researchers-experimenting-with-reversing-time-discovered-something-surprising/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/03/AdobeStock_212038213.jpeg?quality=82&strip=all", "publishedAt": "2025-03-02T17:00:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Two Newly Launched Space Probes Are Already In Trouble - The Daily Galaxy --Great Discoveries Channel", "description": "Two newly launched space probes are already facing unexpected setbacks, with one losing communication and the other struggling to stay on course.", "url": "https://dailygalaxy.com/2025/03/two-newly-launched-space-probes-are-already-in-trouble/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Two-Newly-Launched-Space-Probes-Are-Already-In-Trouble.jpg", "publishedAt": "2025-03-02T16:30:00Z", "content": "Two spacecraft launched just days ago are already experiencing serious technical issues, highlighting the unpredictable nature of space exploration. NASAs Lunar Trailblazer and Astroforges Odin, both… [+2447 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Joe Wilkins", "title": "A Man's Brain Was Transformed Into Glass. Here's What It Looks Like - Futurism", "description": "A new paper is shaping discourse around an ancient victim of Mount Vesuvius whose brain had melted into glass.", "url": "https://futurism.com/the-byte/scientists-study-pompeii-brain-glass", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/scientists-study-pompeii-brain-glass.jpg", "publishedAt": "2025-03-02T15:30:56Z", "content": "The cataclysmic eruption of Mt. Vesuvius in 79 AD has fascinated researchers and historians for centuries. Since the early 1700s, engineers have been excavating the remnants of the cities of Pompeii … [+2742 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Physicists achieve record-breaking electron beam power and current - Phys.org", "description": "A team of physicists at the SLAC National Accelerator Laboratory, in Menlo Park, California, generated the highest-current, highest-peak-power electron beams ever produced. The team has published their paper in Physical Review Letters.", "url": "https://phys.org/news/2025-02-physicists-electron-power-current.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/researchers-produce-hi.jpg", "publishedAt": "2025-03-02T14:10:02Z", "content": "A team of physicists at the SLAC National Accelerator Laboratory, in Menlo Park, California, generated the highest-current, highest-peak-power electron beams ever produced. The team has published the… [+3178 chars]"}, {"source": {"id": null, "name": "Bulgarianmilitary.com"}, "author": "Boyko Nikolov", "title": "How Russian 'Owl Ears' spot Ukraine’s guns—you won't believe - Bulgarian Military", "description": "Russia’s BUH1a 'Owl Ears' system detects Ukraine’s guns daily with acoustic precision, staying hidden. Discover its upgrades and tactical impact now.", "url": "https://bulgarianmilitary.com/2025/03/02/how-russian-owl-ears-spot-ukraines-guns-you-wont-believe/", "urlToImage": "https://bulgarianmilitary.com/wp-content/uploads/2025/03/How-Russian-Owl-Ears-spot-Ukraines-guns—you-wont-believe.jpg", "publishedAt": "2025-03-02T14:06:10Z", "content": "As of February 26, 2025, the Russian militarys deployment of the BUH1a Sova acoustic reconnaissance system has emerged as a critical tool in its operations across multiple zones in Ukraine, aiding in… [+8803 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Italy's Campi Flegrei volcano may unleash devastating eruptions more often than we thought, ancient outburst suggests - Livescience.com", "description": "A new look at an ancient eruption at Campi Flegrei raises new questions about the propensity of the still-active volcano, located near Naples, to produce major eruptions in the future.", "url": "https://www.livescience.com/planet-earth/volcanos/italys-campi-flegrei-volcano-may-unleash-devastating-eruptions-more-often-than-we-thought-ancient-outburst-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Um7bhjRDvkKMPWdp7LoD27-1200-80.jpg", "publishedAt": "2025-03-02T14:00:00Z", "content": "Italy's Campi Flegrei volcano may have had a more explosive history than experts thought.\r\nA new study finds that the volcano — or one near it — laid down an enormous layer of ash and volcanic rock a… [+4323 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Confirm the Incredible Existence of Time Reflections - Yahoo", "description": "Scientists have confirmed the incredible existence of time reflections. Basically, if you look in a time mirror, you’ll see your back instead of your face.", "url": "https://www.popularmechanics.com/science/a63979764/time-reflections-real/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/udJL6Ah56fENKUp7pZXfpw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/900f914dc4c599a5fabf34798a535989", "publishedAt": "2025-03-02T13:34:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>For more than 50 years, scientists theorized that an electromagnetic wave could be reflected te… [+3694 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Billions of Years Ago, Mars Featured Beaches Fit for a Vacation, Astronomers Say - Gizmodo", "description": "Researchers identified underground sedimentary layers on Mars similar to coastal formations on Earth.", "url": "https://gizmodo.com/billions-of-years-ago-mars-featured-beaches-fit-for-a-vacation-astronomers-say-2000568051", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/Martian.landscape.jpg", "publishedAt": "2025-03-02T13:00:23Z", "content": "Step aside, Santa Monica. It seems that Mars once had beaches that would give the Californian coast a run for its money.\r\nAn international team of researchers has revealed evidence of bygone “vacatio… [+3266 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Is it time to revisit what NASA's Viking lander found on Mars in 1976? - Yahoo", "description": "A new study reconsiders the controversial findings of NASA's Viking Mars lander in 1976, which some argue may have shown signs of past life on the Red Planet...", "url": "https://www.space.com/mars-viking-lander-1976-results", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/LmQM1QLgH9ure9CKLoJgYw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/eed53a2edcc9cdc05a96e84e3883c438", "publishedAt": "2025-03-02T13:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nNASA's Viking 2 on the surface of Mars. | Credit: NASA/JPL-Caltech\r\nBack in 1976, the dual NASA… [+4393 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "Interstellar tunnel found near our solar system—may be a gateway to other stars - The Brighter Side of News", "description": "Scientists believe that long-ago supernova explosions sculpted this vast bubble, blasting away surrounding interstellar gas.", "url": "https://www.thebrighterside.news/space/interstellar-tunnel-found-near-our-solar-system-may-be-a-gateway-to-other-stars", "urlToImage": "https://www.thebrighterside.news/uploads/2025/03/interstellar-tunnel.jpg?auto=webp", "publishedAt": "2025-03-02T12:52:00Z", "content": "The solar system drifts inside an immense, low-density cavity known as the Local Hot Bubble (LHB). This region, spanning at least 1,000 light-years, radiates X-rays due to its searing million-degree … [+6525 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "First-Ever \"Saber-Toothed Cat\" Mummy Unearthed in Siberia—Perfectly Preserved After 37,000 Years - Indian Defence Review", "description": "Buried in Siberian ice for 37,000 years, a mysterious predator has just resurfaced. Unlike anything found before, its body remains eerily intact, frozen in time. Scientists are only beginning to uncover what this ancient creature reveals about a lost world.", "url": "https://indiandefencereview.com/first-ever-saber-toothed-cat-mummy-unearthed-in-siberia-perfectly-preserved-after-37000-years/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/A-team-of-scientists-carefully-excavating-a-mummified-saber-toothed-cat-cub.jpg", "publishedAt": "2025-03-02T12:45:00Z", "content": "In the remote, icy wilderness of eastern Siberia, a group of mammoth tusk hunters stumbled upon a discovery that exceeded their wildest expectations. In 2020, they unearthed a perfectly preserved sab… [+4281 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Straight Out of Sci-Fi: NASA’s Most Powerful Computer Has Just Detected Something Strange Beyond the Solar System - Indian Defence Review", "description": "NASA’s most powerful supercomputer has picked up something unexpected at the edge of the solar system. A strange pattern has emerged in a region long thought to be empty and uneventful.", "url": "https://indiandefencereview.com/straight-out-of-sci-fi-nasas-most-powerful-computer-has-just-detected-something-strange-beyond-the-solar-system/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/A-deep-space-cosmic-anomaly.jpg", "publishedAt": "2025-03-02T12:15:00Z", "content": "The Oort cloud, long considered a vast, icy sphere surrounding our solar system, may be hiding something unexpecteda spiral structure reminiscent of a miniature galaxy. \r\nThis revelation, emerging fr… [+3205 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jacek Krywko", "title": "The ISS is nearly as microbe-free as an isolation ward - Ars Technica", "description": "The largest study yet of the ISS’s microbes hints we’re may be keeping it too clean.", "url": "https://arstechnica.com/science/2025/03/the-space-station-is-nearly-as-microbe-free-as-an-isolation-ward/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/image-2-1152x648.jpeg", "publishedAt": "2025-03-02T12:00:15Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deep Inside Earth, Two Giant Mantle Structures Rewrite Geological History - SciTechDaily", "description": "Deep within Earth’s mantle lie two enormous, continent-sized structures known as LLVPs. Scientists once believed these regions were similar, but groundbreaking research has revealed they have vastly different compositions and histories. The Pacific LLVP is yo…", "url": "https://scitechdaily.com/deep-inside-earth-two-giant-mantle-structures-rewrite-geological-history/", "urlToImage": "https://scitechdaily.com/images/Seismic-Model-S40RTS.jpg", "publishedAt": "2025-03-02T11:37:05Z", "content": "Visualization of seismic model S40RTS (Ritsema et al., 2011), showing the LLVP (large red area) under Africa, made using the GPlates software. Credit: Jeroen Ritsema et al.\r\nDeep within Earth’s mantl… [+6095 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "Is the 'Blaze Star' about to explode? If it does, here's where to look in March - Space.com", "description": "T Coronae Borealis (T CrB) is about to reappear in the spring night sky, so be ready in case it goes nova.", "url": "https://www.space.com/blaze-star-coronae-borealis-where-to-look-march-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/k4u2AvvacsaVHvBeGYohPJ-1200-80.gif", "publishedAt": "2025-03-02T11:00:00Z", "content": "T Coronae Borealis (T CrB), popularly known as the \"Blaze Star,\" is surely on the verge of a rare and dramatic brightening.\r\nThis recurrent nova, located approximately 3,000 light-years\r\n away in the… [+4293 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Shreejaya Karantha", "title": "Space photo of the week: The last view of the 'Great Comet of 2025' for half a million years - Livescience.com", "description": "Beautifully captured against a starry sky, Comet C/2024 G3 (ATLAS) — dubbed by some as the \"Great Comet of 2025\" — shines brightly after its last approach to the sun for hundreds of thousands of years.", "url": "https://www.livescience.com/space/comets/space-photo-of-the-week-the-last-view-of-the-great-comet-of-2025-for-half-a-million-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vmUWeRCTUzEPkLzYAD7iUo-1200-80.jpg", "publishedAt": "2025-03-02T11:00:00Z", "content": "What it is: Comet C/2024 G3 (ATLAS)\r\nWhere it is: In the night sky over Chile, somewhere in the inner solar system\r\nWhen it was shared: Feb. 12, 2025\r\nWhy it's so special: Nicknamed the \"Great Comet … [+3715 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Marcia Dunn", "title": "Here’s a look at moon landing hits and misses - The Associated Press", "description": "Landing a spacecraft on the moon has long been a series of hits and misses. Only five countries have done it. Firefly Aerospace on Sunday became the first private outfit to put a spacecraft on the moon without crashing or falling over. Last year, Intuitive Ma…", "url": "https://apnews.com/article/moon-landings-failures-successes-545ea2f3ffa5a15893054b6f43bdbb98", "urlToImage": "https://dims.apnews.com/dims4/default/99b3663/2147483647/strip/true/crop/2816x1584+0+147/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe3%2F18%2Ff995283f3557492023c9647894a3%2F27be847c670b45c28e6e0f4d47cc2db8", "publishedAt": "2025-03-02T09:59:00Z", "content": "CAPE CANAVERAL, Fla. (AP) Landing a spacecraft on the moon has long been a series of hits and misses. \r\nLast year, a spacecraft built by Intuitive Machines through a NASA-sponsored program put the U.… [+3746 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "etimes.in", "title": "10 most unique and interesting images captured by NASA telescopes - The Times of India", "description": "NASA, with its Hubble and James Webb up in space, regularly shares updates, pictures, descriptions, and more of the Universe's creations. And here we have some of the most interesting images captured.", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/web-stories/10-most-unique-and-interesting-images-captured-by-nasa-telescopes/photostory/118659319.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-118659342,imgsize-52904,width-900,height-1200,resizemode-6/118659342.jpg", "publishedAt": "2025-03-02T09:30:00Z", "content": "This image looks like a glowing swirl of colours spinning in space and pulling us into the bright center. With shades of blue, red, and purple blending together, this cosmic vortex feels like the hea… [+46 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover a Blazar That Shouldn’t Exist Yet - SciTechDaily", "description": "Astronomers have spotted a young, blazing black hole that was already growing at a furious pace just one billion years after the Big Bang. This rare discovery provides a key to understanding how supermassive black holes formed in the universe’s earliest days.…", "url": "https://scitechdaily.com/astronomers-discover-a-blazar-that-shouldnt-exist-yet/", "urlToImage": "https://scitechdaily.com/images/Distant-Blazar-Active-Galactic-Nucleus.jpg", "publishedAt": "2025-03-02T06:42:48Z", "content": "Artist’s impression of the bright, very early active galactic nucleus that was found by Bañados and his colleagues, which has fundamental implications for black hole growth in the earliest billion or… [+8879 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Yes, Saturn’s Rings Are About To Disappear — Here’s Why - Forbes", "description": "Here's everything you need to know about why Saturn's rings are about to disappear — and when they will return.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/03/02/yes-saturns-rings-are-about-to-disappear---heres-why/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63e5037929498f7a30dd2ebe/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-02T06:00:00Z", "content": "NASA's Hubble Space Telescope took this image of Saturn on 22 Sept. 2022. \r\nSCIENCE: NASA, ESA, Amy Simon (NASA-GSFC) IMAGE PROCESSING: Alyssa Pagan (STScI)\r\nTheyre one of the most iconic objects in … [+2469 chars]"}, {"source": {"id": null, "name": "Noozhawk"}, "author": "Janene Scully | Noozhawk North County Editor", "title": "Launch of NASA Satellites from Vandenberg SFB Delayed 2 Days - Noozhawk", "description": "Scientists involved with two NASA missions set to ride a SpaceX rocket into orbit from Vandenberg Space Force Base will have wait at least two more days.", "url": "http://www.noozhawk.com/launch-of-nasa-satellites-from-vandenberg-sfb-delayed-2-days/", "urlToImage": "https://www.noozhawk.com/wp-content/uploads/2025/03/030125-SPHEREX-NASA-cont-scaled.jpg", "publishedAt": "2025-03-02T02:59:12Z", "content": "Scientists involved with two NASA missions set to ride a SpaceX rocket into orbit from Vandenberg Space Force Base will have wait at least two more days. \r\nOn Friday night, NASA officials announced t… [+2928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Razor-Thin, Ultra-Powerful – The Lens That’s Revolutionizing Telescopes - SciTechDaily", "description": "A team of scientists at the University of Utah has designed a flat lens that matches the power of traditional curved lenses while eliminating color distortions. Using microscopic rings to manipulate light, this breakthrough could make space telescopes and ast…", "url": "https://scitechdaily.com/razor-thin-ultra-powerful-the-lens-thats-revolutionizing-telescopes/", "urlToImage": "https://scitechdaily.com/images/Utah-Researchers-Demonstrate-Flat-Lens-scaled.jpg", "publishedAt": "2025-03-02T00:54:46Z", "content": "Utah researchers demonstrated the capabilities of their flat lens with test images of the sun and moon. Credit: Menon Lab, University of Utah\r\nA team of scientists at the University of Utah has desig… [+5568 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Russian cargo ship docks at space station with science, spacesuit and supplies - Space.com", "description": "Russia's Progress MS-30 (91P) spacecraft arrived at the ISS at 6:03 p.m. EST on Saturday (March 1).", "url": "https://www.space.com/space-exploration/international-space-station/russian-cargo-ship-docks-at-space-station-with-science-spacesuit-and-supplies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EjAcLkXha6MYzDKyNeKZmj-1200-80.jpg", "publishedAt": "2025-03-01T23:12:23Z", "content": "A new delivery of food, fuel and supplies has arrived at the International Space Station by way of a Russian supply ship.\r\nRoscomsos' Progress MS-30 (or Progress 91, as referred to by NASA) cargo spa… [+2377 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary 3D Bioprinter Creates Human Tissue Structures in Seconds - SciTechDaily", "description": "Biomedical engineers at the University of Melbourne have developed a 3D bioprinting system capable of creating structures that closely replicate the diverse tissues of the human body. Biomedical engineers at the University of Melbourne have developed a 3D bio…", "url": "https://scitechdaily.com/revolutionary-3d-bioprinter-creates-human-tissue-structures-in-seconds/", "urlToImage": "https://scitechdaily.com/images/3D-Bioprinter-scaled.jpg", "publishedAt": "2025-03-01T22:34:40Z", "content": "The 3D bioprinter at the Collins BioMicrosystems Laboratory at the University of Melbourne. Credit: Tessa van der Riet\r\nBiomedical engineers at the University of Melbourne have developed a 3D bioprin… [+4229 chars]"}, {"source": {"id": null, "name": "Marin Independent Journal"}, "author": "Adrian Rodriguez", "title": "Study: Marin’s sinking areas exacerbate sea-rise threat - Marin Independent Journal", "description": "Parts of eastern San Rafael and Corte Madera are subsiding more than 0.4 inches per year, largely because sediment compaction, federal researchers report.", "url": "https://www.marinij.com/2025/03/01/study-marins-sinking-areas-exacerbate-sea-rise-threat/", "urlToImage": "https://www.marinij.com/wp-content/uploads/2024/11/MIJ-L-SR-SEA-LEVEL-11-05.jpg?w=1024&h=683", "publishedAt": "2025-03-01T20:07:29Z", "content": "Parts of some bayside communities in Marin are sinking at an accelerated pace, making them more vulnerable to threats from the rising sea, according to a federal study.\r\nAreas of eastern San Rafael a… [+4664 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Researchers explore how to build shapeshifting, T-1000-style robots - TechCrunch", "description": "Researchers have developed small robots that can work together as a collective that changes shape and even shifts between solid and “fluid-like” states —", "url": "https://techcrunch.com/2025/03/01/researchers-explore-how-to-build-shapeshifting-t-1000-style-robots/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/03/fluid-robot.jpg?resize=1200,928", "publishedAt": "2025-03-01T19:52:44Z", "content": "Researchers have developed small robots that can work together as a collective that changes shape and even shifts between solid and fluid-like states a concept that should be familiar to anyone still… [+1048 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "100-million-year-old Dinosaur Eggs Reveal A Lost World In Ancient Utah - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists in Utah have uncovered a 100-million-year-old fossil egg cache, revealing a shocking diversity of dinosaur species—including a mysterious reptile never before found in North America. Could this discovery rewrite what we know about ancient ecosystem…", "url": "https://dailygalaxy.com/2025/03/100-million-year-old-dinosaur-eggs-reveal-a-lost-world-in-ancient-utah/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/100-million-year-old-Dinosaur-Eggs-Reveal-A-Lost-World-In-Ancient-Utah.jpg", "publishedAt": "2025-03-01T18:30:00Z", "content": "Fossilized dinosaur eggs discovered in Utah’s Cedar Mountain Formation have unveiled a previously unknown level of biodiversity in North America’s Cretaceous period, offering a glimpse into a world t… [+3072 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "'I think we all know that hope is fading.' Private Odin asteroid probe is tumbling in space - Yahoo", "description": "The company AstroForge is working to try and recover the asteroid probe before time runs out.", "url": "https://www.space.com/space-exploration/private-spaceflight/i-think-we-all-know-that-hope-is-fading-private-odin-asteroid-probe-is-tumbling-in-space", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yTxjipnngFD5bd8bDAl_Nw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/c672874d4cc514954a6c632614f35445", "publishedAt": "2025-03-01T17:38:06Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nAstroForge's Odin asteroid probe, the box-shaped spaceraft at center right, is seen after launc… [+3941 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Revive 24,000-year-old Frozen Organisms - The Daily Galaxy --Great Discoveries Channel", "description": "Frozen in time for 24,000 years—then suddenly alive again. Scientists have revived ancient microscopic creatures from Siberian permafrost, revealing an extraordinary survival trick that could revolutionize cryobiology. What secrets do these tiny survivors hol…", "url": "https://dailygalaxy.com/2025/03/scientists-revive-frozen-organisms/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Scientists-Revive-24000-year-old-Frozen-Organisms.jpg", "publishedAt": "2025-03-01T17:00:00Z", "content": "In a groundbreaking discovery, scientists have successfully revived microscopic frozen organisms in Siberian permafrost for 24,000 years. These ancient creatures, known as bdelloid rotifers, survived… [+3093 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Superelastic Alloy Stays Strong from Liquid Helium to Boiling Water, Transforming Space and Medicine - SciTechDaily", "description": "Researchers have unveiled a groundbreaking titanium-aluminum alloy that maintains superelasticity across an unprecedented temperature range, from -269°C to +127°C. This innovation could revolutionize industries such as space exploration, where extreme conditi…", "url": "https://scitechdaily.com/superelastic-alloy-stays-strong-from-liquid-helium-to-boiling-water-transforming-space-and-medicine/", "urlToImage": "https://scitechdaily.com/images/Newly-Developed-Superelastic-Alloy-scaled.jpg", "publishedAt": "2025-03-01T16:40:15Z", "content": "A block of the newly developed superelastic alloy. Credit: Sheng Xu\r\nResearchers have unveiled a groundbreaking titanium-aluminum alloy that maintains superelasticity across an unprecedented temperat… [+3597 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Heather Gann | hgann@al.com", "title": "‘We have misunderstood the universe’: James Webb telescope findings amaze scientists - AL.com", "description": "“With measurement errors negated, what remains is the real and exciting possibility we have misunderstood the universe,” said Adam Riess, professor of physics and astronomy at Johns Hopkins University.", "url": "https://www.al.com/news/2025/03/we-have-misunderstood-the-universe-james-webb-telescope-findings-amaze-scientists.html", "urlToImage": "https://www.al.com/resizer/v2/EOEBGVG2WZELHHRH4IZEXXRI6U.png?auth=5101f96d5d8b1488959182e6f9a22c241a821e3b7168dbc221581f983e2fbf5c&width=1280&quality=90", "publishedAt": "2025-03-01T15:53:00Z", "content": "Astronomers have recently confirmed that the universe appears to be expanding at vastly different speeds in different places, according to a study published in Astrophysical Journal Letters.\r\nUsing t… [+766 chars]"}, {"source": {"id": null, "name": "Fstoppers"}, "author": "Alex Cooke", "title": "Historic Planetary Alignment: Photographer Captures All Eight Planets in Rare Panorama - Fstoppers", "description": "Josh Dury, a photographer based in Somerset, UK, recently captured a panoramic image showing all eight planets—including Earth—in a single frame. He took the photograph on February 22, 2025, during an uncommon astronomical event called the \"planetary parade,\"…", "url": "https://fstoppers.com/astrophotography/historic-planetary-alignment-photographer-captures-all-eight-planets-rare-694264", "urlToImage": "https://cdn.fstoppers.com/styles/large-16-9/s3/lead/2025/02/planetary-parade-image.jpg", "publishedAt": "2025-03-01T15:03:01Z", "content": "Josh Dury, a photographer based in Somerset, UK, recently captured a panoramic image showing all eight planetsincluding Earthin a single frame. He took the photograph on February 22, 2025, during an … [+3213 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "Lead-208's doubly magic nucleus defies expectations with surprising shape properties - Phys.org", "description": "In a surprising turn of events, an international team of scientists has found that lead-208 (208Pb), the heaviest known \"doubly magic\" nucleus, exhibits unexpected shape characteristics that current nuclear models fail to predict accurately.", "url": "https://phys.org/news/2025-02-doubly-magic-nucleus-defies-properties.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-le.jpg", "publishedAt": "2025-03-01T14:30:01Z", "content": "In a surprising turn of events, an international team of scientists has found that lead-208 (208Pb), the heaviest known \"doubly magic\" nucleus, exhibits unexpected shape characteristics that current … [+5860 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Revolutionary Study Shows Humans Lived in African Rainforests 150,000 Years Ago - Ancient Origins", "description": "A new study has revealed that when humans were still living exclusively in Africa, before migrating to Eurasia and ultimately to the rest of the planet, they were more flexible and adaptable than previously believed. This is because evidence shows that ancien…", "url": "https://www.ancient-origins.net/news-history-archaeology-human-origins/african-rainforest-0021932", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/rffff1.jpg", "publishedAt": "2025-03-01T14:28:00Z", "content": "A new study has revealed that when humans were still living exclusively in Africa, before migrating to Eurasia and ultimately to the rest of the planet, they were more flexible and adaptable than pre… [+5835 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: 'Thar she pokes!' Scientists capture drone footage of narwhals - Phys.org", "description": "Look, all somewhat positive climate news has to be placed in the context of the ongoing global climate crisis, but this week, researchers did report a new simulation suggesting that the Atlantic Meridional Overturning Circulation is unlikely to shut down with…", "url": "https://phys.org/news/2025-02-saturday-citations-thar-scientists-capture.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/saturday-citations-tha.jpg", "publishedAt": "2025-03-01T14:00:01Z", "content": "Look, all somewhat positive climate news has to be placed in the context of the ongoing global climate crisis, but this week, researchers did report a new simulation suggesting that the Atlantic Meri… [+5956 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "'Cosmic Horseshoe' may contain black hole the size of 36 billion suns — one of the largest ever detected - Livescience.com", "description": "The \"Cosmic Horseshoe\" is an Einstein ring, a system made up of a foreground galaxy whose mass is so great, it warps the light from a galaxy behind it. Now, astronomers know where it gets this mass from.", "url": "https://www.livescience.com/space/black-holes/cosmic-horseshoe-may-contain-black-hole-the-size-of-36-billion-suns-one-of-the-largest-ever-detected", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xY5iBfLUXuiUiFFAXxdr8U-1200-80.jpg", "publishedAt": "2025-03-01T14:00:00Z", "content": "Astronomers have discovered an enormous black hole\r\n the size of 36 billion suns lurking within the \"Cosmic Horseshoe.\" The behemoth object is one of the largest black holes ever detected.\r\nFirst dis… [+4171 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Hubble sees mini galaxies surrounding Andromeda are pretty wild - Mashable", "description": "These galaxy satellites aren't like the ones around the Milky Way.", "url": "https://mashable.com/article/hubble-andromeda-dwarf-galaxies-satellites", "urlToImage": "https://helios-i.mashable.com/imagery/articles/00MytTQeszyJh4it0vaO1T1/hero-image.fill.size_1200x675.v1740770568.jpg", "publishedAt": "2025-03-01T14:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Partial solar eclipse 1 month away — The moon will take a 'bite' out of the sun on March 29 - Space.com", "description": "Whether you're an eclipse chaser or a casual observer, the partial solar eclipse on March 29 is a show worth waking up for!", "url": "https://www.space.com/partial-solar-eclipse-one-month-to-go-what-to-expect", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xugZ28dTncftrJy2V86EU6-1200-80.jpg", "publishedAt": "2025-03-01T14:00:00Z", "content": "On Saturday (March 29), the moon will take a big \"bite\" out of the sun during a partial solar eclipse visible across North America, Europe and parts of Northwest Africa.\r\nWhile there will be no total… [+2828 chars]"}, {"source": {"id": null, "name": "Airlive.net"}, "author": "AIRLIVE", "title": "Four tanks were found in Poland after Space X's rocked uncontrollably disintegrated over Europe - AIRLIVE", "description": "The second stage of a SpaceX Falcon 9 rocket disintegrated over Europe during re-entry. On the night of February 18-19, 2025, the second stage of a Falcon 9 rocket disintegrated over Europe, causing a shower of shooting stars. In Poland, debris were found acr…", "url": "https://airlive.net/space/2025/03/01/four-tanks-were-found-in-poland-after-space-xs-rocked-uncontrollably-disintegrated-over-europe/", "urlToImage": "https://airlive.net/wp-content/uploads/2025/02/GkJUldiWUAA0UUR.jpeg", "publishedAt": "2025-03-01T12:54:00Z", "content": "On the night of February 18-19, 2025, the second stage of a Falcon 9 rocket disintegrated over Europe, causing a shower of shooting stars. In Poland, debris were found across the country.\r\nIt all sta… [+1827 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Devitt", "title": "New theory suggests star mergers produce universe's highest-energy particles - Phys.org", "description": "Ultrahigh Energy Cosmic Rays are the highest-energy particles in the universe, whose energies are more than a million times what can be achieved by humans. But while the existence of UHECRs has been known for 60 years, researchers have not succeeded in formul…", "url": "https://phys.org/news/2025-03-theory-star-mergers-universe-highest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/how-do-the-universes-h.jpg", "publishedAt": "2025-03-01T11:27:05Z", "content": "Ultrahigh Energy Cosmic Rays are the highest-energy particles in the universe, whose energies are more than a million times what can be achieved by humans. But while the existence of UHECRs has been … [+2650 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "John Etnyre, The Conversation", "title": "What Shape Is the Universe? - Gizmodo", "description": "The options become even more complicated if you consider time as a dimension.", "url": "https://gizmodo.com/what-shape-is-the-universe-2-2000570246", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/shape-of-the-universe.jpg", "publishedAt": "2025-03-01T11:00:42Z", "content": "When you look at your surrounding environment, it might seem like youre living on a flat plane. After all, this is why you can navigate a new city using a map: a flat piece of paper that represents a… [+5280 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Northern Lights, A ‘Blood Moon’ And A Solar Eclipse: The Sky In March - Forbes", "description": "All the day and night sky highlights in March 2025, including a total lunar eclipse, and a deep partial solar eclipse, and a potential peak in aurora.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/03/01/northern-lights-a-blood-moon-and-a-solar-eclipse-the-sky-in-march/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67ab94e0fe624f18b7ce6e38/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-01T11:00:00Z", "content": "The night of 10th/11th October saw an unprecedented amount of Aurorta Borealis sightings across the ... [+] UK.\r\ngetty\r\nMoon gazers and eclipse-chasers have been waiting a long time since March 2025.… [+4035 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Roberta McLain", "title": "Why can't you tickle yourself? - Livescience.com", "description": "Why do we laugh when tickled but are unable to tickle ourselves? Neuroscience has the answer.", "url": "https://www.livescience.com/health/why-cant-you-tickle-yourself", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TvKUoLrXm8o4vYyWxfWPhU-1200-80.jpg", "publishedAt": "2025-03-01T10:00:00Z", "content": "For many of us, the tickling response is paradoxical — the playfulness it inspires is typically enjoyable, but the overstimulated nerves and loss of control can feel distressing. Whether you find it … [+5025 chars]"}]}