{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DNA Breakthrough – How Genetic Shedding Unveils Species Secrets - SciTechDaily", "description": "Ecologists have shown that the genetic material that species shed into their environments can reveal not only the presence of the species but also a broad range of information about the genetics of whole populations. This information can assist researchers in…", "url": "https://scitechdaily.com/dna-breakthrough-how-genetic-shedding-unveils-species-secrets/", "urlToImage": "https://scitechdaily.com/images/Colorful-Glowing-DNA.jpg", "publishedAt": "2023-09-16T11:58:56Z", "content": "ByCornell UniversitySeptember 16, 2023\r\nEcologists found that species environmental DNA (eDNA) can offer insights into genetics of whole populations, aiding in tracking and preventing invasive specie… [+4477 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Photosynthesis Breakthrough – Researchers Produce Hybrid Solid Catalysts - SciTechDaily", "description": "Researchers at Tokyo Tech have demonstrated that in-cell engineering is an effective method for creating functional protein crystals with promising catalytic properties. By harnessing genetically altered bacteria as a green synthesis platform, the researchers…", "url": "https://scitechdaily.com/artificial-photosynthesis-breakthrough-researchers-produce-hybrid-solid-catalysts/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-09-16T10:18:34Z", "content": "ByTokyo Institute of TechnologySeptember 16, 2023\r\nResearchers have utilized in-cell engineering to produce hybrid solid catalysts for artificial photosynthesis using protein crystals. These catalyst… [+6182 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "NASA Confirms Breathable Oxygen Really Can Be Extracted on Mars - ScienceAlert", "description": "An experiment that took place on Mars has shown that it's feasible to extract breathable oxygen from the thin Martian atmosphere.", "url": "https://www.sciencealert.com/nasa-confirms-breathable-oxygen-really-can-be-extracted-on-mars", "urlToImage": "https://www.sciencealert.com/images/2023/09/mars-sky-clouds.jpg", "publishedAt": "2023-09-16T10:01:16Z", "content": "An experiment that took place on Mars has shown that it's feasible to extract breathable oxygen from the thin Martian atmosphere.\r\nFrom its little home in the belly of NASA's Perseverance rover, the … [+3665 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Stunning image of Andromeda galaxy takes top astronomy photography prize of 2023 (gallery) - Space.com", "description": "The winning images from this year's various categories are stunning.", "url": "https://www.space.com/royal-observatory-greenwich-astronomy-photographer-of-the-year-15-winners", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kNeGHLaKtWECNep3Yh8yzY-1200-80.jpg", "publishedAt": "2023-09-16T10:00:45Z", "content": "The Royal Observatory Greenwich has announced the winners of the Astronomy Photographer of the Year 15, during an award ceremony held Sept. 14. \r\nThis was the Royal Observatory Greenwich's 15th year … [+9772 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Biological Masterpiece – Evolution Wired Human Brains To Act Like Supercomputers - SciTechDaily", "description": "Scientists now possess a mathematical model that closely mirrors the way the human brain interprets visual data. Researchers have confirmed that human brains are naturally wired to perform advanced calculations, similar to e a high-powered computer, to make s…", "url": "https://scitechdaily.com/biological-masterpiece-evolution-wired-human-brains-to-act-like-supercomputers/", "urlToImage": "https://scitechdaily.com/images/Brain-Steers-Our-Actions.jpg", "publishedAt": "2023-09-16T07:44:48Z", "content": "ByUniversity of SydneySeptember 16, 2023\r\nScientists have discovered that the human brain inherently uses Bayesian inference, a statistical method combining prior knowledge with new evidence, to inte… [+4306 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": "Rick Neale, Jamie Groh", "title": "Updates: SpaceX Starlink launch on Friday from Cape Canaveral Space Force Station - Florida Today", "description": "Here's everything you need to know about SpaceX's Friday Falcon 9 Starlink mission liftoff from Cape Canaveral Space Force Station.", "url": "https://www.floridatoday.com/story/tech/science/space/2023/09/15/spacex-launch-day-heres-information-on-todays-starlink-launch-from-cape-canaveral-florida/70857611007/", "urlToImage": "https://www.floridatoday.com/gcdn/authoring/authoring-images/2023/09/09/PBRE/70804746007-crb-090823-spacex-1.jpg?crop=3277,1851,x0,y164&width=3200&height=1808&format=pjpg&auto=webp", "publishedAt": "2023-09-16T03:22:30Z", "content": "Update: Liftoff of a SpaceX Falcon 9 with 22 Starlink satellites at 11:38 p.m. EDT Friday from Cape Canaveral Space Force Station in Florida, followed by a drone ship booster landing minutes later.\r\n… [+5904 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle", "title": "Russian Soyuz docks at ISS, cosmonauts and astronaut aboard - DW (English)", "description": "There has been an instance of cooperation between the US and Russia with the docking of the Soyuz spacecraft at the ISS, amid tensions between Washington and Moscow over the invasion of Ukraine.", "url": "https://www.dw.com/en/russian-soyuz-docks-at-iss-cosmonauts-and-astronaut-aboard/a-66829791", "urlToImage": "https://static.dw.com/image/66829848_6.jpg", "publishedAt": "2023-09-16T02:07:26Z", "content": "A Russian spacecraft successfully docked with the International Space Station (ISS) on Friday after launching from Kazakhstan's Baikonur Cosmodrome.\r\nOn board the Soyuz MS-24 were two Russian cosmona… [+1973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Constant Tension Mystery Deepens: Webb Space Telescope Measures the Universe's Expansion Rate - SciTechDaily", "description": "The \"Hubble Tension\" denotes the difference between the observed and expected expansion rate of the universe. The James Webb Space Telescope refines measurements previously made by the Hubble Space Telescope. Despite advancements, questions persist about the …", "url": "https://scitechdaily.com/hubble-constant-tension-mystery-deepens-webb-space-telescope-measures-the-universes-expansion-rate/", "urlToImage": "https://scitechdaily.com/images/Uncrowding-Cepheids-in-Near-Infrared-scaled.jpg", "publishedAt": "2023-09-16T01:39:38Z", "content": "ByNASASeptember 15, 2023\r\nCombined observations from NASAs NIRCam (Near-Infrared Camera) and Hubbles WFC3 (Wide Field Camera 3) show spiral galaxy NGC 5584, which resides 72 million light-years away … [+12942 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious Dark Matter Mapped Across Space Like Never Before - ScienceAlert", "description": "The curvature of space-time around a colossal mass has yielded the most detailed measurement of the cosmic distribution of dark matter yet.", "url": "https://www.sciencealert.com/mysterious-dark-matter-mapped-across-space-like-never-before", "urlToImage": "https://www.sciencealert.com/images/2023/09/DarkMatterInSpace.jpg", "publishedAt": "2023-09-15T23:31:15Z", "content": "The curvature of space-time around a colossal mass has yielded the most detailed measurement of the cosmic distribution of dark matter yet.\r\nAided by a gravitational lens, a team led by cosmologist K… [+3883 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Webb telescope finds signs of life on faraway exoplanet - The Jerusalem Post", "description": "Along with methane and carbon dioxide, the James Webb Telescope also discovered a molecule known as dimethyl sulphide (DMS), a substance only produced by living things.", "url": "https://www.jpost.com/science/article-759305", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/552878", "publishedAt": "2023-09-15T23:04:00Z", "content": "NASA’s James Webb Space Telescope has uncovered new evidence that a planet outside of our solar system may be able to support life.\r\nThe telescope discovered the presence of methane and carbon dioxid… [+2291 chars]"}, {"source": {"id": null, "name": "KUTV 2News"}, "author": "Victoria Hill, KUTV", "title": "Annular solar eclipse to pass directly over Utah in October - KUTV 2News", "description": "The path of an annular solar eclipse will cross through the Beehive State in October.", "url": "https://kutv.com/news/local/annular-solar-eclipse-to-pass-directly-over-utah-in-october-space-nasa", "urlToImage": "https://kutv.com/resources/media/5e50ca0e-b591-4780-9822-b0ecbfad81f7-large16x9_74_annular_eclipse_detail.jpg", "publishedAt": "2023-09-15T21:21:23Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "So Much James Webb News // NASA's UAPs Report // Closest Black Hole to Earth - Fraser Cain", "description": "Have astronomers found the first signs of life on an exoplanet? So much James Webb news. The closest black hole to Earth. NASA gives its report on UAPs. 😍 1...", "url": "https://www.youtube.com/watch?v=bPXjskJyIwk", "urlToImage": "https://i.ytimg.com/vi/bPXjskJyIwk/maxresdefault.jpg", "publishedAt": "2023-09-15T21:08:03Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Strong Evidence that Supermassive Black Holes Affect Their Host Galaxy's Chemistry - Universe Today", "description": "New research based on ALMA observations and machine learning techniques has mapped out chemical abundances near M77's black hole.", "url": "https://www.universetoday.com/163229/strong-evidence-that-supermassive-black-holes-affect-their-host-galaxys-chemistry/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/20230915-alma-fig-full.jpg", "publishedAt": "2023-09-15T21:05:29Z", "content": "Supermassive Black Holes (SMBHs) are impossible to ignore. They can be billions of times more massive than the Sun, and when they’re actively consuming stars and gas, they become luminous active gala… [+7442 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "High-energy electrons in Earth's magnetic tail may form water on the moon - Space.com", "description": "The discovery could help scientists better understand where water is on the lunar surface, knowledge that could be used in future crewed moon missions.", "url": "https://www.space.com/water-moon-electrons-earth-bombardment", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DYvPu8tCFQUAg2ZmRW3DFX-1200-80.jpg", "publishedAt": "2023-09-15T21:00:00Z", "content": "High-energy electrons located in a tail of plasma around the Earth are weathering the moon and, more excitingly, seem to have given rise to water across the lunar surface.\r\nThe new findings, reached … [+4176 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "M.C.", "title": "Shocking simulation shows what would happen to Earth if it was struck by an asteroid - Marca English", "description": "An asteroid collision with earth could be potentially catastrophic for the planet and its inhabitants. If big and powerful enough, an impact from a giant slab of rock to the Earth&", "url": "https://www.marca.com/en/lifestyle/2023/09/13/6501e14f268e3ee2608b45b8.html", "urlToImage": "https://ak.uecdn.es/p/110/thumbnail/entry_id/0_lee5a2qm/width/657/type/2/bgcolor/000000/0_lee5a2qm.jpg", "publishedAt": "2023-09-15T20:06:38Z", "content": "An asteroid collision with earth could be potentially catastrophic for the planet and its inhabitants. If big and powerful enough, an impact from a giant slab of rock to the Earth's surface could wip… [+1354 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rizwan Choudhury", "title": "Nano rocket thruster can run on water, fit on a fingertip - Interesting Engineering", "description": "The new ICE-Cube Thruster developed by Imperial College runs on water, offering a green and efficient propulsion system for small satellites.", "url": "https://interestingengineering.com/innovation/nano-rocket-thruster", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/15/image/jpeg/Ko2Da0Ue509A0mdtLmpH01LovYfsoc7NxU276uZL.jpg", "publishedAt": "2023-09-15T19:33:00Z", "content": "Tailored for the burgeoning small satellite market\r\nThe ICE-Cube Thruster is designed to meet the needs of the rapidly growing small satellite market, which consists mainly of nanosats weighing under… [+1151 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "mars.nasa.gov", "title": "New Milestones Despite Tricky Boulders - NASA Mars - NASA Mars Exploration", "description": "For the past couple of planning sols, Perseverance has been working on a complex navigation out of a boulder field on one of the lobes on top of the fan.", "url": "https://mars.nasa.gov/mars2020/mission/status/481/new-milestones-despite-tricky-boulders/", "urlToImage": "https://mars.nasa.gov/mars2020-raw-images/pub/ods/surface/sol/00909/ids/edr/browse/ncam/NRF_0909_0747648149_175ECM_N0444864NCAM13909_01_195J01_1200.jpg", "publishedAt": "2023-09-15T19:19:19Z", "content": "For the past couple of planning sols, Perseverance has been working on a complex navigation out of a boulder field on one of the lobes on top of the fan. The engineering team planned specific maneuve… [+1798 chars]"}, {"source": {"id": null, "name": "Screen Rant"}, "author": "Tristan Benns", "title": "Marvel Finally Has Its Own Version of Justice League's Most Powerful Hero (According to Batman) - Screen Rant", "description": "Firestorm is one of the Justice League's most underrated heavy hitters, but now Marvel's Children of the Vault have their own atomic powerhouse.", "url": "https://screenrant.com/marvel-children-vault-atomo-justice-league-firestorm/", "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/09/jla-avengers.jpg", "publishedAt": "2023-09-15T19:00:00Z", "content": "Warning: SPOILERS ahead for Children of the Vault #2While Marvel Comics has no shortage of superhero teams, more than a few of their costumed conglomerates have acted as analogues for the Distinguish… [+2722 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mick Kulikowski", "title": "Study examines the hard reality that no pollen means no seeds - Phys.org", "description": "North Carolina State University researchers have successfully transferred an important gene from one compartment of a plant cell to another to produce tobacco plants that lack pollen and viable seeds, while otherwise growing normally. Their findings could lea…", "url": "https://phys.org/news/2023-09-hard-reality-pollen-seeds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/no-pollen-no-seeds.jpg", "publishedAt": "2023-09-15T18:19:58Z", "content": "North Carolina State University researchers have successfully transferred an important gene from one compartment of a plant cell to another to produce tobacco plants that lack pollen and viable seeds… [+3984 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brian Koberlein", "title": "Researchers: If neutron stars have mountains, they should generate gravitational waves - Phys.org", "description": "A neutron star is 2 solar masses compressed into a ball only 12 kilometers wide. Its surface gravity is so immense it compresses atoms and molecules into raw nuclei and squeezes electrons into protons transforming them into neutrons. Given such immense pressu…", "url": "https://phys.org/news/2023-09-neutron-stars-mountains-generate-gravitational.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/if-neutron-stars-have.jpg", "publishedAt": "2023-09-15T17:13:03Z", "content": "A neutron star is 2 solar masses compressed into a ball only 12 kilometers wide. Its surface gravity is so immense it compresses atoms and molecules into raw nuclei and squeezes electrons into proton… [+3540 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "James Webb Space Telescope could detect life on Earth from across the galaxy, new study suggests - Space.com", "description": "Researchers have shown that if the James Webb Space Telescope was pointed at Earth from a distant star, it could detect the signatures of intelligent life in our planet's atmosphere.", "url": "https://www.livescience.com/space/exoplanets/james-webb-telescope-could-detect-life-on-earth-from-across-the-galaxy-new-study-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NtQuZn2zgLZwp4XW57QqnU-1200-80.jpg", "publishedAt": "2023-09-15T17:00:35Z", "content": "The James Webb Space Telescope (JWST) would be able to spot the signs of our civilization on Earth if it was spying on us from another star system in the Milky Way, a new study shows. \r\nThe finding r… [+4473 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Briley Lewis", "title": "Mathematicians find 12000 new solutions to 'unsolvable' 3-body problem - Livescience.com", "description": "Calculating the way three things orbit each other is notoriously tricky — but a new study may reveal 12,000 new ways to make it work.", "url": "https://www.livescience.com/physics-mathematics/mathematicians-find-12000-new-solutions-to-unsolvable-3-body-problem", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NuDfKpux9MUrZgFAHm97ZS-1200-80.jpg", "publishedAt": "2023-09-15T16:42:54Z", "content": "The three-body problem\r\n is a notoriously tricky puzzle in physics and mathematics, and an example of just how complex the natural world is. Two objects orbiting each other, like a lone planet around… [+3064 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "Overeating and addiction may have roots in early human brain evolution and prosocial behaviors - Medical Xpress", "description": "Research led by the Department of Anthropology and School of Biomedical Sciences, Kent State University, Ohio, has investigated neuropeptide Y innervation in an area of the brain called the nucleus accumbens of various primate species, including humans. The r…", "url": "https://medicalxpress.com/news/2023-09-overeating-addiction-roots-early-human.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/1-brain.jpg", "publishedAt": "2023-09-15T16:34:38Z", "content": "Research led by the Department of Anthropology and School of Biomedical Sciences, Kent State University, Ohio, has investigated neuropeptide Y innervation in an area of the brain called the nucleus a… [+4115 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "A 2022 Gamma Ray Burst Was So Powerful, it was Detected by Spacecraft Across the Solar System - Universe Today", "description": "Gamma-ray bursts are some of the most powerful explosions ever detected, emitting more radiation than the rest of their host galaxy combined. In October 2022, a gamma-ray burst struck the Solar System and interacted with the heliosphere. This set off charged …", "url": "https://www.universetoday.com/163222/a-2022-gamma-ray-burst-was-so-powerful-it-was-detected-by-spacecraft-across-the-solar-system/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/grb-scaled.jpg", "publishedAt": "2023-09-15T16:14:27Z", "content": "On October 9, 2022, a gamma-ray burst illuminated the solar system. Its light had traveled 2.4 billion years to reach us, having begun its journey when only bacteria and archaea existed on the Earth … [+2720 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "NICER: A safer alternative to CRISPR/Cas9 for gene editing - News-Medical.Net", "description": "The gene editing technique CRISPR/Cas9 has allowed researchers to make precise and impactful changes to an organism's DNA to fix mutations that cause genetic disease.", "url": "https://www.news-medical.net/news/20230915/NICER-A-safer-alternative-to-CRISPRCas9-for-gene-editing.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/4/shutterstock_512201353_a79a8d0098c04acb87d742bb139e4bf7-620x480.jpg", "publishedAt": "2023-09-15T16:12:00Z", "content": "The gene editing technique CRISPR/Cas9 has allowed researchers to make precise and impactful changes to an organism's DNA to fix mutations that cause genetic disease. However, the CRISPR/Cas9 method … [+2871 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble telescope spots glowing galactic disk floating in deep space (photo) - Space.com", "description": "It lives in a constellation named for an 18th century astronomical tool.", "url": "https://www.space.com/great-galactic-disk-hubble-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yvcyP7waX8cvM6u8wMTCd-1200-80.jpg", "publishedAt": "2023-09-15T16:00:03Z", "content": "A mesmerizing new photo from the Hubble Space Telescope captures the hazy glow of a distant galaxy. \r\nThe galaxy, known as NGC 3156, is located about 73 million light-years\r\n from Earth\r\n in the Sext… [+2838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA's Juno mission captures stunning view of Jupiter with its volcanic moon, Io (photo) - Space.com", "description": "Citizen scientist Alain Mirón Velázquez made a few photo adjustments to create the dramatic visual.", "url": "https://www.space.com/nasa-juno-jupiter-moon-io-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QBXwNUgU9Q7LsfEb8UCGwW-1200-80.jpg", "publishedAt": "2023-09-15T15:00:01Z", "content": "NASA's Juno mission has captured a stunning new portrait of Jupiter with its volcanic moon, Io. \r\nJuno\r\n snapped this new view on July 30 as it passed by Io ahead of its 53rd close flyby of Jupiter t… [+2141 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Astronaut Tracy C. Dyson Receives Third Space Station Assignment - NASA", "description": "NASA has assigned astronaut Tracy C. Dyson to her second long-duration mission to the International Space Station as a flight engineer and member of the Expedition 70/71 crew.", "url": "https://www.nasa.gov/press-release/nasa-astronaut-tracy-c-dyson-receives-third-space-station-assignment", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/jsc2023e052359.jpg", "publishedAt": "2023-09-15T14:55:01Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Solar Orbiter closes in on the solution to a 65-year-old solar mystery - Phys.org", "description": "A cosmic alignment and a little bit of spacecraft gymnastics has provided a ground-breaking measurement that is helping solve the 65-year-old cosmic mystery of why the sun's atmosphere is so hot.", "url": "https://phys.org/news/2023-09-solar-orbiter-solution-year-old-mystery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/solar-orbiter-closes-i.jpg", "publishedAt": "2023-09-15T14:38:21Z", "content": "The outer atmosphere of the sun, known as the corona, can be seen stretching off into space in this image from Solar Orbiter's Metis instrument. Metis is a multi-wavelength device, working at visible… [+9282 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Paleontologists Furious When Ancient Human Fossils Blasted to Space - Futurism", "description": "Paleontologists were affronted to discover that billionaires had sent ancient hominin bones up on a Virgin Galactic spaceflight.", "url": "https://futurism.com/paleontologists-human-fossils-virgin-galactic", "urlToImage": "https://wp-assets.futurism.com/2023/09/archaeologists-human-fossils-virgin-galactic.jpg", "publishedAt": "2023-09-15T14:01:05Z", "content": "Archaeologists were affronted to discover that billionaire Richard Branson had sent ancient hominin bones up on a commercial space flight, with some suggesting that the stunt reeks of colonialism.\r\nA… [+3466 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Perseverance rover spies 'avocado' rock on Mars (photo) - Space.com", "description": "The Mars 'avocado' is the latest in a long line of Red Planet rocks that look like things.", "url": "https://www.space.com/mars-rover-perseverance-avocado-rock-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Tub7vwPrihAg3jFaC8jhmg-1200-80.jpg", "publishedAt": "2023-09-15T14:00:13Z", "content": "NASA's Perseverance Mars rover snapped a new photo of a Red Planet rock that looks a lot like an avocado. \r\nSince landing on Mars\r\n on Feb. 18, 2021, the rover has traversed the planet's Jezero Crate… [+1954 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Jess Thomson", "title": "Woman Woken by Loud Noise Finds Meteorite in Her Garden - Newsweek", "description": "\"There was no crater, but it broke the table,\" Sylvain Bouley, president of the Astronomical Society of France (SAF), said of the meteorite's crash landing.", "url": "https://www.newsweek.com/meteor-lands-woman-garden-france-meteorite-1827289", "urlToImage": "https://d.newsweek.com/en/full/2282604/meteor-france.jpg", "publishedAt": "2023-09-15T13:41:38Z", "content": "A meteor that was recently seen soaring brightly across the night sky has been found after crash landing in a woman's garden.\r\nThe fireball, also known as a bolide, was spotted as it fell to Earth by… [+4342 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Rhett Allain", "title": "Radiation Is Everywhere. But It's Not All Bad - WIRED", "description": "Although radiation sounds scary, it isn’t necessarily harmful. Here’s what to know about the four types.", "url": "https://www.wired.com/story/radiation-is-everywhere-but-its-not-all-bad/", "urlToImage": "https://media.wired.com/photos/64f0b4ee7bcd6c227c2af0ac/191:100/w_1280,c_limit/wheat_radiation-gieger-science-GettyImages-1446858996.jpg", "publishedAt": "2023-09-15T13:00:00Z", "content": "For many of the sources you encounter in everyday life, the amount of radiation is so low that you dont need to worry about it. But ionizing radiation can also be dangerous, because these free electr… [+3426 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Adam Frank", "title": "How to understand all the talk about a \"crisis in cosmology\" - Big Think", "description": "Cosmology is unlike other sciences. When our view of the Universe changes, so does our understanding of philosophy and science itself.", "url": "https://bigthink.com/13-8/crisis-cosmology-what-it-means/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/09/AdobeStock_455552670.jpeg?resize=1200,630", "publishedAt": "2023-09-15T13:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Why is Neptune's moon Triton so weird? - Space.com", "description": "Triton orbits to the beat of its own drum.", "url": "https://www.space.com/neptune-triton-why-so-weird", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9CFrjRcjekBi36nVmqN9PB-1200-80.jpg", "publishedAt": "2023-09-15T12:00:30Z", "content": "Sometimes, astronomy is like a forensic investigation: We can't just rerun the past, so we have to study clues to figure out what happened. And the outer solar system contains one striking crime scen… [+4985 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Richard Pallardy", "title": "Mystery of 'living fossil' tree frozen in time for 66 million years finally solved - Livescience.com", "description": "The Wollemi pine was thought to have gone extinct 2 million years ago until it was rediscovered by a group of hikers in 1994. Now, scientists have decoded its genome to understand how it's survived — almost unchanged — since the time of the dinosaurs.", "url": "https://www.livescience.com/planet-earth/plants/mystery-of-living-fossil-tree-frozen-in-time-for-66-million-years-finally-solved", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aFGzcazaKS34vEKdyaYQRB-1200-80.jpg", "publishedAt": "2023-09-15T11:11:20Z", "content": "The Wollemi pine (Wollemia nobilis) was rediscovered by a group of hikers in 1994.  (Image credit: Dave Watts/Getty Images)\r\nIn 1994, hikers discovered a group of strange trees growing in a canyon in… [+4653 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "High School Students Discover Weird Behavior Of Asteroid Hit By NASA Spacecraft - IFLScience", "description": "The new results are puzzling and affect planetary defense strategies.", "url": "https://www.iflscience.com/high-school-students-discover-weird-behavior-of-asteroid-hit-by-nasa-spacecraft-70700", "urlToImage": "https://assets.iflscience.com/assets/articleNo/70700/aImg/70695/dimorphos-meta.png", "publishedAt": "2023-09-15T10:15:44Z", "content": "Almost a year ago, NASAs DART mission slammed into asteroid Dimorphos, the moon of the larger asteroid Didymos. The goal was to move the asteroid to a different orbit, and the shift was successful th… [+3011 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Nasa's James Webb Space Telescope captures rare image of the birth of a Sun-like star - Times of India", "description": "US News: Nasa's James Webb Space Telescope has revealed a captivating image of Herbig-Haro 211 (HH 211), offering insights into the mysterious realm of newly b", "url": "https://timesofindia.indiatimes.com/world/us/nasas-james-webb-space-telescope-captures-rare-image-of-the-birth-of-a-sun-like-star/articleshow/103689501.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-103689490,width-1070,height-580,imgsize-16268,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-09-15T10:15:00Z", "content": "Things women do to get their job done"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brunt Ice Shelf in Antarctica Speeds Up After Calving of Giant Iceberg - SciTechDaily", "description": "Following the calving of the A-81 iceberg at the end of January 2023, the Brunt Ice Shelf in Antarctica is moving faster than before. It is currently moving approximately 4 meters (13 feet) a day towards the sea, whereas before the calving it moved at an aver…", "url": "https://scitechdaily.com/brunt-ice-shelf-in-antarctica-speeds-up-after-calving-of-giant-iceberg/", "urlToImage": "https://scitechdaily.com/images/Chasm-1.jpg", "publishedAt": "2023-09-15T09:08:21Z", "content": "ByBritish Antarctic SurveySeptember 15, 2023\r\nChasm-1 remained dormant for many years but has now created a new iceberg. Credit: BAS\r\nFollowing the calving of the A-81 iceberg at the end of January 2… [+4780 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel LAWLER", "title": "Skepticism about claim human ancestors nearly went extinct - Phys.org", "description": "Could the lives of the eight billion people currently on Earth have depended on the resilience of just 1,280 human ancestors who very nearly went extinct 900,000 years ago?", "url": "https://phys.org/news/2023-09-skepticism-human-ancestors-extinct.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/neanderthals-model-pic.jpg", "publishedAt": "2023-09-15T08:23:03Z", "content": "Could the lives of the eight billion people currently on Earth have depended on the resilience of just 1,280 human ancestors who very nearly went extinct 900,000 years ago?\r\nThat is the finding of a … [+5166 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ramish Zafar", "title": "SpaceX Shares Footage of Rocket Engine Tested At Sub Zero Temperatures - Wccftech", "description": "", "url": "https://wccftech.com/spacex-shares-footage-of-rocket-engine-tested-at-sub-zero-temperatures/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/08/SPACEX-RAPTOR-ENGINE-TEST-AUGUST-2023-728x390.png", "publishedAt": "2023-09-15T07:08:00Z", "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\r\nAs part of tests for the Artemis program, SpaceX test-fired… [+5457 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Massive ocean discovered beneath the Earth's crust containing more water than on the surface | indy100 - indy100", "description": "It feels like there have been staggering science stories emerging every other day recently, all of which have blown our tiny little minds.First, there was the discovery of a terrifying black hole pointing right at us, then there was a huge hole found in the s…", "url": "https://www.indy100.com/science-tech/ocean-beneath-earth-crust-ringwoodite-2665436363", "urlToImage": "https://www.indy100.com/media-library/is-earth-imploding-beneath-the-ocean-unexplained-sinkholes-unveiled.jpg?id=33372289&width=1200&height=600&coordinates=0%2C173%2C0%2C173", "publishedAt": "2023-09-15T07:00:00Z", "content": "It feels like there have been staggering science stories emerging every other day recently, all of which have blown our tiny little minds.\r\nFirst, there was the discovery of a terrifying black hole p… [+2212 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astounding Fossil Discovery: The 265-Million-Year-Old Apex Predator That Ruled Brazil Before Dinosaurs - SciTechDaily", "description": "Dinosaurs are often celebrated as the most gigantic and formidable predators in the annals of natural history. However, 40 million years before their reign, Pampaphoneus biccai was the undisputed apex predator of South America, reigning as the biggest and mos…", "url": "https://scitechdaily.com/astounding-fossil-discovery-the-265-million-year-old-apex-predator-that-ruled-brazil-before-dinosaurs/", "urlToImage": "https://scitechdaily.com/images/Reconstruction-Pampaphoneus-biccai-scaled.jpg", "publishedAt": "2023-09-15T06:15:50Z", "content": "ByHarvard University, Department of Organismic and Evolutionary BiologySeptember 14, 2023\r\n265 million years ago, Pampaphoneus biccai was South Americas apex predator. A well-preserved fossil found i… [+6304 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists observed an incredible phenomenon Einstein said we'd never see - BGR", "description": "Astronomers have photographed evidence of an Einstein Cross, a phenomena that Einstein predicted we would never witness for ourselves.", "url": "https://bgr.com/science/scientists-saw-an-incredible-phenomenon-that-einstein-said-wed-never-observe/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/09/einstein-cross-far-away.jpeg?quality=82&strip=all", "publishedAt": "2023-09-15T01:41:00Z", "content": "Decades ago, Albert Einstein predicted gravitational lenses as part of his theory of general relativity. Another physicist at the time predicted that if the Earth and the gravitational lens, as well … [+2154 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "Abandoned Apollo 17 lunar lander module is causing tremors on the moon - CNN", "description": "The Apollo 17 lunar lander module left behind by US astronauts on the moon’s surface could be causing moonquakes, or small tremors, a new study revealed.", "url": "https://www.cnn.com/2023/09/14/world/moonquakes-apollo-17-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230914143139-02-moonquakes-apollo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-09-15T00:04:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nA spacecraft left behind by US astronauts on the lunar… [+5598 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Joseph De Avila", "title": "NASA Will Study UFOs Using AI and Crowdsourcing - The Wall Street Journal", "description": "Space agency releases report on how to examine mysterious objects, names first director of UAP research", "url": "https://www.wsj.com/science/nasa-panel-report-ufos-unidentified-anomalous-phenomena-83cdd26f", "urlToImage": "https://images.wsj.net/im-852638/social", "publishedAt": "2023-09-14T23:30:00Z", "content": null}, {"source": {"id": null, "name": "Thetrek.co"}, "author": "Abby Evans", "title": "The Highs and Lows of BigeLOW - The Trek", "description": "As I climbed some of the last 4k peaks I would on this trail, I decided to run my legs ragged. The first Bigelow peak surged by beneath me; my legs pumped upwards towards the rocky outcropping jutting into the sky in front of me. Blue mountains swelled on eit…", "url": "https://thetrek.co/appalachian-trail/the-highs-and-lows-of-bigelow/", "urlToImage": "https://photos.thetrek.co/wp-content/uploads/2023/09/14160015/64079462-042A-49D1-B69A-32E240A59209.jpeg", "publishedAt": "2023-09-14T22:07:41Z", "content": "As I climbed some of the last 4k peaks I would on this trail, I decided to run my legs ragged. The first Bigelow peak surged by beneath me; my legs pumped upwards towards the rocky outcropping juttin… [+7588 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Birds’ problem-solving skills linked to song complexity - Ars Technica", "description": "But other measures of intelligence, like learning associations, are unconnected.", "url": "https://arstechnica.com/science/2023/09/birds-problem-solving-skills-linked-to-song-complexity/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/GettyImages-522664604-760x380.jpg", "publishedAt": "2023-09-14T21:51:52Z", "content": "Enlarge/ Despite the gaudy clothing, this guy is remarkably crafty.\r\n12 with \r\nOne of the ways we try to understand the origins of human intelligence is by looking at its equivalents elsewhere in the… [+5507 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sonam Sheth, Jenny McGrath", "title": "Mysterious lights on Venus aren't what scientists thought: study - Business Insider", "description": "Flashing light on Venus was thought to be lightning for years, but scientists couldn't prove it. A new study says they're something totally different.", "url": "https://www.businessinsider.com/venus-mysterious-light-flashes-arent-what-scientists-thought-study-2023-9", "urlToImage": "https://i.insider.com/5f64dacf323fc4001e0d71dc?width=1200&format=jpeg", "publishedAt": "2023-09-14T21:37:00Z", "content": "Scientists have observed light shows on Venus for many years and during that time, the most accepted explanation was lightning. Venus might even have more lightning than Earth, NASA said in a stateme… [+2352 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Melting ice likely triggered climate change 8,000+ years ago - Phys.org", "description": "Using geological samples from the Ythan Estuary in Scotland, scientists have identified a melting ice sheet as the probable trigger of a major climate-change event just over 8,000 years ago.", "url": "https://phys.org/news/2023-09-ice-triggered-climate-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/melting-ice-likely-tri.jpg", "publishedAt": "2023-09-14T21:03:46Z", "content": "Using geological samples from the Ythan Estuary in Scotland, scientists have identified a melting ice sheet as the probable trigger of a major climate-change event just over 8,000 years ago.\r\nAnd the… [+3937 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jonti Horner", "title": "Are we about to see a rare green comet light up the sky? An expert on what to expect from Nishimura - The Conversation Indonesia", "description": "There’s a chance Nishimura might brighten unexpectedly – but it’s a slim one.", "url": "https://theconversation.com/are-we-about-to-see-a-rare-green-comet-light-up-the-sky-an-expert-on-what-to-expect-from-nishimura-213464", "urlToImage": "https://images.theconversation.com/files/548226/original/file-20230914-27-vsdb54.jpg?ixlib=rb-1.1.0&rect=0%2C44%2C5994%2C2992&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-09-14T20:05:19Z", "content": "Of all the objects in the Solar System, perhaps the most spectacular are the great comets that occasionally grace our skies. If youve been on social media in the past few days, youve probably seen ar… [+5772 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Our universe holds more 'spectacular' polar ring galaxies than once thought, scientists say - Space.com", "description": "\"The dance and choreography of the gas are beautiful, and that motion of the gas gives us some clues as to how galaxies evolve over time.\"", "url": "https://www.space.com/polar-ring-galaxy-spectacular-realms-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xHfriBTHj2PVh9jatkPk9i-1200-80.jpeg", "publishedAt": "2023-09-14T20:00:01Z", "content": "A team of astronomers has discovered two new potential examples of a strange celestial object known as a polar ring galaxy. This elusive form of galaxy possesses a ring of stars and gas that's orient… [+4313 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stronger Than Steel and Tougher Than Kevlar – Scientists Shed New Light on the Strongest Spider Silk in the World - SciTechDaily", "description": "Numerous scientists aspire to unlock the remarkable capability of spiders to spin silk threads that are immensely strong, lightweight, and flexible. In fact, pound for pound, spider silk is stronger than steel and tougher than Kevlar. However, no one has been…", "url": "https://scitechdaily.com/stronger-than-steel-and-tougher-than-kevlar-scientists-shed-new-light-on-the-strongest-spider-silk-in-the-world/", "urlToImage": "https://scitechdaily.com/images/Irina-Iachina-Holding-Silk-Fiber.jpg", "publishedAt": "2023-09-14T19:58:48Z", "content": "ByUniversity of Southern DenmarkSeptember 14, 2023\r\nBiophysicist Irina Iachina, University of Southern Denmark, holds a silk fiber, produced by a golden orb-web spider. Credit: Anders Boe/University … [+5708 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Shipman", "title": "Genetically modified bacteria found to break down plastics in saltwater - Phys.org", "description": "Researchers have genetically engineered a marine microorganism to break down plastic in salt water. Specifically, the modified organism can break down polyethylene terephthalate (PET), a plastic used in everything from water bottles to clothing that is a sign…", "url": "https://phys.org/news/2023-09-genetically-bacteria-plastics-saltwater.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/genetically-modified-b.jpg", "publishedAt": "2023-09-14T18:48:04Z", "content": "Researchers have genetically engineered a marine microorganism to break down plastic in salt water. Specifically, the modified organism can break down polyethylene terephthalate (PET), a plastic used… [+4450 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Defining microglial-synapse interactions - Science", "description": null, "url": "https://www.science.org/doi/10.1126/science.adh7906", "urlToImage": null, "publishedAt": "2023-09-14T18:03:09Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Autopsy of a star reveals what was eviscerated by a monster black hole - Ars Technica", "description": "From the interior of a star to the accretion disk of a black hole.", "url": "https://arstechnica.com/science/2023/09/autopsy-of-a-star-reveals-what-was-eviscerated-by-a-monster-black-hole/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/image-760x380.jpeg", "publishedAt": "2023-09-14T17:01:43Z", "content": "Enlarge/ Ions of nitrogen and carbon show up in the spectrum of X-rays from a black hole's accretion disk.\r\n16 with \r\nEven huge stars are not always safe out there. When the orbit of a star three tim… [+4143 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Hubble discovers 11-billion-year-old galaxy in a quasar's glare - Space.com", "description": "Astronomers normally observe galaxies by observing light these objects emit, but some tricky galaxies require a different approach.", "url": "https://www.space.com/hubble-elusive-11-billion-year-old-galaxy-light-absorption", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CCkkon9zfgaeueokNmVPo8-1200-80.jpg", "publishedAt": "2023-09-14T17:00:01Z", "content": "Using the Hubble Space Telescope, a team of astronomers has used a tricky technique to discover an elusive 11-billion-year-old galaxy. Rather than observe the light this realm emits, they watched for… [+4319 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "A 'Planet Nine' far from Earth could explain the odd behavior of icy bodies beyond Neptune - Space.com", "description": "Astronomers struggle to explain all of the properties of trans-Neptunian objects.", "url": "https://www.space.com/planet-nine-explain-odd-icy-body-behavior-beyond-neptune", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ewHXX9BMeGHnMukE2jewPV-1200-80.jpg", "publishedAt": "2023-09-14T16:30:33Z", "content": "As the search for \"Planet Nine\r\n\" in the outer solar system continues, new research suggests there may be an Earth twin buried deep within the frozen waste of the Kuiper Belt beyond Neptune.\r\nAstrono… [+4864 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Jay Bennett", "title": "This is what the first stars looked like as they were being born - National Geographic", "description": "The birth of the first stars represents the beginning of a sequence that produced all the worlds and living beings of the universe. Simulations can be used to study the critical first steps that telescopes cannot yet see.", "url": "https://www.nationalgeographic.com/science/article/what-the-first-stars-looked-like-as-they-were-being-born", "urlToImage": "https://i.natgeofe.com/n/8a5ae64a-3d90-4196-9324-55084ba064f1/highresframev0100016_16x9.jpg?w=1200", "publishedAt": "2023-09-14T15:03:21Z", "content": "The first stars were nothing like the relatively cool, long-lived stars that mostly populate the universe today. At the time, more than 13 and a half billion years ago, almost all the visible matter … [+6336 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andrea Wild", "title": "Scientists find banded sand catsharks hiding inside sea sponges - Phys.org", "description": "When scientists on board the research vessel (RV) Investigator pulled a large sponge from the ocean in 2017, they noticed a tail fin poking out. They expected to find an eel had wriggled into the sponge. Instead, they discovered 30 catsharks hiding inside.", "url": "https://phys.org/news/2023-09-scientists-banded-sand-catsharks-sea.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/hide-and-seek-sharks-f.jpg", "publishedAt": "2023-09-14T14:54:23Z", "content": "When scientists on board the research vessel (RV) Investigator pulled a large sponge from the ocean in 2017, they noticed a tail fin poking out. They expected to find an eel had wriggled into the spo… [+3861 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA-Built Greenhouse Gas Detector Moves Closer to Launch - NASA", "description": "The instrument will enable nonprofit organization Carbon Mapper to pinpoint and measure methane and carbon dioxide sources from space.", "url": "https://www.nasa.gov/feature/jpl/nasa-built-greenhouse-gas-detector-moves-closer-to-launch", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/1-pia26092_cm_instrument_complete.jpg", "publishedAt": "2023-09-14T14:54:18Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Shell life species weren't competing as they adjusted to Earth's largest extinction, claims study - Phys.org", "description": "One of the biggest crises in Earth history was marked by a revolution in the shellfish—brachiopods, sometimes called \"lamp shells\" were replaced everywhere ecologically by the bivalves, such as oysters and clams. This happened as a result of the devastating e…", "url": "https://phys.org/news/2023-09-shell-life-species-werent-adjusted.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/shell-life-species-not.jpg", "publishedAt": "2023-09-14T14:42:04Z", "content": "One of the biggest crises in Earth history was marked by a revolution in the shellfishbrachiopods, sometimes called \"lamp shells\" were replaced everywhere ecologically by the bivalves, such as oyster… [+4581 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA to Reveal Asteroid Sample Grabbed in Space, Delivered to Earth - NASA", "description": "The first asteroid sample collected in space and brought to Earth by the United States will be unveiled at NASA’s Johnson Space Center in Houston on Wednesday, Oct. 11, and media accreditation is now open.", "url": "https://www.nasa.gov/press-release/nasa-to-reveal-asteroid-sample-grabbed-in-space-delivered-to-earth", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/osirisrextagprint2016_1_0.jpg", "publishedAt": "2023-09-14T14:33:53Z", "content": null}, {"source": {"id": null, "name": "Jstor.org"}, "author": "S. N. Johnson-Roehr", "title": "How Plate Tectonics Shook Life into Existence - JSTOR Daily", "description": "The cycles of life all rely on the dynamism of the Earth’s crust.", "url": "https://daily.jstor.org/how-plate-tectonics-shook-life-into-existence/", "urlToImage": "https://daily.jstor.org/wp-content/uploads/2023/09/how_plate_tectonics_shook_life_into_existence_1050x700.jpg", "publishedAt": "2023-09-14T14:30:00Z", "content": "The icon indicates free access to the linked research on JSTOR.\r\nLife on this planet has a lot going for it. The Earth is not too hot, nor is it too cold. We have just enough carbon dioxide in our at… [+7586 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Machine Learning Aids Classical Modeling of Quantum Systems - Quanta Magazine", "description": "By using “classical shadows,” ordinary computers can beat quantum computers at the tricky task of understanding quantum behaviors.", "url": "https://www.quantamagazine.org/machine-learning-aids-classical-modeling-of-quantum-systems-20230914/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/09/FasterQuantumML-byKouzouSakai-Social.webp", "publishedAt": "2023-09-14T14:20:51Z", "content": "Understanding the quantum universe is not an easy thing. Intuitive notions of space and time break down in the tiny realm of subatomic physics, allowing for behavior that seems, to our macro sensibil… [+8501 chars]"}, {"source": {"id": null, "name": "Astronomy Magazine"}, "author": "Astronomy Staff", "title": "Do black holes have bottoms? | Astronomy.com - Astronomy Magazine", "description": "Black holes are surrounded by a spherical event horizon, and your spaceship can indeed fly under, over, or around it.", "url": "https://www.astronomy.com/science/do-black-holes-have-bottoms/", "urlToImage": "https://www.astronomy.com/wp-content/uploads/sites/2/2023/08/ASY-SK0923_03.png?fit=1156%2C992", "publishedAt": "2023-09-14T14:10:04Z", "content": "Is there a bottom of a black hole? Can a spaceship travel under one, or does it go on and on?\r\nRick TelloBisbee, Arizona\r\nI suspect your question arises from seeing diagrams like the one at upper rig… [+2316 chars]"}]}