{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Life’s Greatest Leap: Scientists Decode the Origins of Complex Cells - SciTechDaily", "description": "Eukaryogenesis occurred suddenly, driven by the growing length of genes and the limitations on producing longer proteins. An international team of four senior scientists from Mainz, Valencia, Madrid, and Zurich has published groundbreaking research in the jou…", "url": "https://scitechdaily.com/?p=473239", "urlToImage": "https://scitechdaily.com/images/Cells-Rendering-Art-Concept.jpg", "publishedAt": "2025-05-11T03:26:29Z", "content": "A new study finds that the rise of the eukaryotic cell was an algorithmic phase transition, where gene complexity increased via non-coding sequences, breaking the prior link between gene and protein … [+6268 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "NASA Is Increasing Employee Location Tracking - NASA Watch", "description": "It would seem that DOGE is tracking NASA employees as they come - and go - at NASA Headquarters", "url": "https://nasawatch.com/personnel-news/nasa-is-increasing-employee-location-tracking/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/05/NASA-Tracking.png", "publishedAt": "2025-05-11T01:21:43Z", "content": "NASA Tracking — Grok via NASAWatch.com \r\nKeith’s note: It would seem that DOGE is tracking NASA employees as they come – and go – at NASA Headquarters. And if they are doing it there then you can exp… [+1189 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Einstein’s Relativity Predicted a Twisted Illusion – Now Scientists Have Finally Seen It - SciTechDaily", "description": "Einstein’s strangest optical illusion has been captured—thanks to lasers, a cube, and a bit of artistic inspiration.", "url": "https://scitechdaily.com/einsteins-relativity-predicted-a-twisted-illusion-now-scientists-have-finally-seen-it/", "urlToImage": "https://scitechdaily.com/images/Physics-Light-Speed-Cube-Art-Concept-Illustration-Close.jpg", "publishedAt": "2025-05-10T22:31:22Z", "content": "Using lasers and high-speed cameras, scientists have finally visualized a relativistic illusion that makes fast-moving objects appear rotated. (Artist’s concept.) Credit: SciTechDaily.com\r\nPhysicists… [+5812 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Giant Fossil Egg Sat In A Museum Storage For Years - The Daily Galaxy", "description": "It sat unnoticed in a museum for nearly a decade. Now, this ancient egg is shaking up what we thought we knew about ocean predators from the dinosaur age.", "url": "https://dailygalaxy.com/2025/05/giant-fossil-egg-sat-storage-for-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/This-Giant-Fossil-Egg-Sat-In-A-Museum-Storage-For-Years.jpg", "publishedAt": "2025-05-10T18:30:00Z", "content": "An unexpected discovery in Antarctica is challenging long-standing scientific assumptions. A massive egg fossil, recently identified as soft-shelled and possibly belonging to a mosasaur, may reveal t… [+3405 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "FRANCE 24, FRANCE 24", "title": "Soviet-era spacecraft crashes back to Earth after 53 years stuck in orbit - France 24", "description": "A Soviet-era spacecraft that was designed to land on the surface of Venus crashed down to earth on Saturday, decades after it was launched. The European Union Space Surveillance and Tracking agency confirmed the uncontrolled re-entry of Kosmos 482 but could n…", "url": "https://www.france24.com/en/europe/20250510-soviet-era-spacecraft-crashes-back-to-earth-after-53-years-stuck-in-orbit", "urlToImage": "https://s.france24.com/media/display/be2b6826-2cdc-11f0-9e23-005056bf30b7/w:1280/p:16x9/000_36FW7Y7.jpg", "publishedAt": "2025-05-10T18:29:12Z", "content": "A Soviet-era spacecraft plunged to Earth on Saturday, more than a half-century after its failed launch to Venus. \r\nIts uncontrolled entry was confirmed by both the Russian Space Agency and European U… [+2604 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Katie Spalding", "title": "Look Alert: The Most Active Volcano In the Pacific Northwest Is Probably About To Blow, Maybe - IFLScience", "description": "Here's why you should not worry.", "url": "https://www.iflscience.com/look-alert-the-most-active-volcano-in-the-pacific-northwest-is-probably-about-to-blow-maybe-79159", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79159/aImg/83806/axial-seamount-meta.jpg", "publishedAt": "2025-05-10T18:08:00Z", "content": "Theres a huge volcano in northwest US territory, and all signs say its about to blow. The result is set to be a massive eruption, with lava reaching up to 40 kilometers (25 miles) in any direction, h… [+6340 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mysterious Pyramid Found in Antarctica: A Natural Wonder or an Alien Artifact? - Indian Defence Review", "description": "Deep in the frozen wilderness of Antarctica lies a 'pyramid' that has baffled both scientists and conspiracy theorists alike.", "url": "https://indiandefencereview.com/mysterious-pyramid-found-in-antarctica/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/mysterious-pyramid-found-in-antarctica-a-natural-wonder-or-an-alien-artifact.jpg", "publishedAt": "2025-05-10T17:45:00Z", "content": "In the icy expanse of Antarctica, a mountain peak rises with an uncanny resemblance to a perfectly symmetrical pyramid. Located in the Ellsworth Mountains, this unnamed peak garnered widespread atten… [+5512 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Australian National University", "title": "Stormy waves traversing the Earth's core provide new hints into future planetary exploration - Phys.org", "description": "The detection of energy signals from strong winter storms in the North Atlantic Ocean that travel through Earth's core could enhance understanding of our solar system, according to new research from The Australian National University (ANU).", "url": "https://phys.org/news/2025-05-stormy-traversing-earth-core-hints.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/earth-and-moon.jpg", "publishedAt": "2025-05-10T17:30:01Z", "content": "The detection of energy signals from strong winter storms in the North Atlantic Ocean that travel through Earth's core could enhance understanding of our solar system, according to new research from … [+4505 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Reveal Strange Phenomenon of ‘Ice Piracy’ in Antarctica - The Daily Galaxy", "description": "A new study using Copernicus Sentinel-1 data reveals that glaciers in West Antarctica are undergoing rapid ice piracy.", "url": "https://dailygalaxy.com/2025/05/strange-phenomenon-ice-piracy-antarctica/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Reveal-Strange-Phenomenon-of-‘Ice-Piracy-in-Antarctica.jpg", "publishedAt": "2025-05-10T16:40:00Z", "content": "In a groundbreaking study published in The Cryosphere, scientists have revealed an astonishing phenomenon occurring in West Antarcticaa glacier is rapidly siphoning ice from its slower-moving neighbo… [+4067 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Rich Juzwiak", "title": "My Husband Played a Terrifying Prank on Me. So I’ve Figured Out the Perfect Way to Retaliate. - Slate Magazine", "description": "I'm furious.", "url": "https://slate.com/advice/2025/05/marriage-advice-husband-prank-terrifying.html", "urlToImage": "https://compote.slate.com/images/ef7126cd-9e35-42a7-b75a-7cb9484fe1de.gif?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2025-05-10T16:00:00Z", "content": "How to Do It is Slates sex advice column. Have a question? Send it to Jessica and Rich here. Its anonymous!\r\nDear How to Do It,\r\nMy husband recently played a horrible prank on me. Several nights ago,… [+2920 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discover 140-Million-Year-Old Lost Continent Beneath Southern Europe - The Daily Galaxy", "description": "A vast lost continent lies hidden beneath Europe’s mountains—its ancient secrets now reshaping our understanding of Earth’s history.", "url": "https://dailygalaxy.com/2025/05/140-million-year-old-lost-continent-europe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discover-140-Million-Year-Old-Lost-Continent-Beneath-Southern-Europe-1.jpg", "publishedAt": "2025-05-10T15:15:00Z", "content": "In a groundbreaking discovery, scientists from Utrecht University have uncovered the remnants of a long-lost continent, Greater Adria, which has been buried beneath Southern Europe for around 140 mil… [+5164 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Hubble Space Telescope Uncovers Rogue Black Hole Devouring Star 600 Million Light-Years Away - The Daily Galaxy", "description": "Astronomers have caught a wandering black hole, 600 million light-years away, tearing apart a star in an unprecedented event—marking a new frontier in black hole research.", "url": "https://dailygalaxy.com/2025/05/hubble-rogue-black-hole-devouring-star/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Hubble-Space-Telescope-Uncovers-Rogue-Black-Hole-Devouring-Star-600-Million-Light-Years-Away.jpg", "publishedAt": "2025-05-10T14:30:00Z", "content": "Astronomers using NASA’s Hubble Space Telescope have uncovered the first direct evidence of a wandering supermassive black hole in action, tearing a star to shreds in a tidal disruption event (TDE) 6… [+4972 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sanjukta Mondal", "title": "Nanoplastics generated from real-world plastic waste readily adsorb heavy metal ions, study reveals - Phys.org", "description": "Some 460 million metric tons of plastic are produced globally each year, out of which a staggering 91% of plastic waste is never recycled—with 12% incinerated and 79% left to end up in landfills and oceans and linger in our environment.", "url": "https://phys.org/news/2025-05-nanoplastics-generated-real-world-plastic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/nanoplastics-generated.jpg", "publishedAt": "2025-05-10T14:20:01Z", "content": "Some 460 million metric tons of plastic are produced globally each year, out of which a staggering 91% of plastic waste is never recycledwith 12% incinerated and 79% left to end up in landfills and o… [+3876 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Chorus of Gravitational Waves Emerging from the Milky Way Core: Will We Ever Hear Them? - The Daily Galaxy", "description": "A cosmic symphony of gravitational waves is echoing from the heart of the Milky Way—are we about to hear it?", "url": "https://dailygalaxy.com/2025/05/a-chorus-of-gravitational-waves-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Chorus-of-Gravitational-Waves-Emerging-from-the-Milky-Way-Core-Will-We-Ever-Hear-Them.jpg", "publishedAt": "2025-05-10T13:30:00Z", "content": "A recent study published on arXiv sheds light on an astonishing discovery at the core of the Milky Way Galaxy. There, a complex symphony of gravitational waves is being generated by a multitude of co… [+3885 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Amateur astronomer reveals a colorful portrait of Earth's closest star-forming neighbor (photo) - Space", "description": "With two globular clusters thrown in for good measure.", "url": "https://www.space.com/stargazing/astrophotography/amateur-astronomer-reveals-a-colorful-portrait-of-earths-closest-star-forming-neighbor-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mobbgAuypYiFUopqNVXaFG.jpg", "publishedAt": "2025-05-10T13:00:00Z", "content": "The Rho Ophiuchi stellar nursery, imaged by amateur astronomer Greg Meyer in April 2025. (Image credit: Greg Meyer)\r\nAstrophotographer Greg Meyer captured a breathtaking view of the Rho Ophiuchi stel… [+3235 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "New Shark Species Discovered: Pararhincodon Torquis Reveals Ancient Predator from Southern England - Indian Defence Review", "description": "A newly discovered fossil shark, Pararhincodon torquis, reveals ancient insights into shark evolution, shedding light on its unique characteristics and migration patterns.", "url": "https://indiandefencereview.com/new-shark-species-pararhincodon-torquis/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/new-shark-species-discovered-pararhincodon-torquis-reveals-ancient-predator-from-southern-england.jpg", "publishedAt": "2025-05-10T13:00:00Z", "content": "A fascinating new discovery has emerged from southern England, where an ancient shark species, Pararhincodon torquis, has been identified from fossilized remains dating back more than 70 million year… [+4498 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: AI predicts cancer survival outcomes; Hubble spots a wandering black hole - Phys.org", "description": "This week, physicists at CERN reported the transmutation of lead into gold in the Large Hadron Collider, raising the possibility that a Science X alchemy vertical could be on the horizon. An international research collaborative developed a new method to ident…", "url": "https://phys.org/news/2025-05-saturday-citations-ai-cancer-survival.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/saturday-citations-ai.jpg", "publishedAt": "2025-05-10T12:50:01Z", "content": "This week, physicists at CERN reported the transmutation of lead into gold in the Large Hadron Collider, raising the possibility that a Science X alchemy vertical could be on the horizon. An internat… [+5103 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Eye Movements Set the Speed Limit for What You Can See - Neuroscience News", "description": "The speed of your eye movements, called saccades, determines how fast an object can move before it becomes invisible to you.", "url": "https://neurosciencenews.com/eye-saccades-visual-speed-28872/", "urlToImage": "https://neurosciencenews.com/files/2025/05/saccades-visual-speed-neuroscience.jpg", "publishedAt": "2025-05-10T12:26:00Z", "content": "Summary: The speed of your eye movements, called saccades, determines how fast an object can move before it becomes invisible to you. Objects that mimic the speed and trajectory of saccades can essen… [+7133 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lydia Smith", "title": "Hoatzin: The strange 'stinkbird' born with clawed wings that appears to be an evolutionary 'orphan' - Live Science", "description": "This weird blue-faced, red-eyed bird smells so bad predators won't eat it.", "url": "https://www.livescience.com/animals/birds/hoatzin-the-strange-stinkbird-born-with-clawed-wings-that-appears-to-be-an-evolutionary-orphan", "urlToImage": "https://cdn.mos.cms.futurecdn.net/szojE8di4Rtwha5CctF2uF.jpg", "publishedAt": "2025-05-10T12:00:00Z", "content": "Name: Hoatzin (Opisthocomus hoazin)\r\nWhere it lives: Amazon and Orinoco river basins in South America\r\nWhat it eats: Leaves, fruits and flowers\r\nWhy it's awesome: The hoatzin is often regarded as one… [+2923 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Search for the mythical Asian unicorn: New genetic clues emerge - Earth.com", "description": "The study reveals a new chapter in the Asian unicorn's story - and possibly, a path forward for its survival.", "url": "https://www.earth.com/news/search-for-the-mythical-asian-unicorn-new-genetic-clues-emerge/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/10052950/Asian-unicorn.jpg", "publishedAt": "2025-05-10T11:51:53Z", "content": "In the remote, misty highland forests straddling Vietnam and Laos, a rare creature may still roam unseen. Known as the saola, this elusive animal was only discovered by scientists in 1992 and has sin… [+4938 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Isolated for Centuries, These Populations Have Evolved in Disturbing Ways, That Could Save (or Destroy) Us - The Daily Galaxy", "description": "Some human populations have been isolated for centuries, developing rare genetic traits and remarkable survival adaptations. These isolated groups hold the key to unlocking secrets about human evolution and health.", "url": "https://dailygalaxy.com/2025/05/isolated-for-centuries-these-populations-have-evolved-in-disturbing-ways/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Two-elderly-Indian-women-in-saris-their-heads-covered-sit-outside-their-home.jpg", "publishedAt": "2025-05-10T11:45:00Z", "content": "Across the globe, there are human populations that have remained isolated for centuries, leading to genetic characteristics that are far from ordinary. These groups, cut off from the broader gene poo… [+4402 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Mysterious White Patch Crowns the Sahara’s Highest Volcano—It’s Not Snow, and It Could Change Everything You Know! - The Daily Galaxy", "description": "A striking image from the ISS captures a mysterious white patch atop a volcano in the Sahara. What looks like snow is actually something much more intriguing.", "url": "https://dailygalaxy.com/2025/05/a-mysterious-white-patch-crowns-the-saharas-highest-volcano-its-not-snow/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/photograph-offers-a-unique-view-of-Emi-Koussi.jpg", "publishedAt": "2025-05-10T11:15:00Z", "content": "A recent image taken from the International Space Station (ISS) has captured a curious sight atop the Emi Koussi volcano, located in northern Chad, the highest peak in the Sahara Desert. The white pa… [+3067 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "It's been one year since the most intense solar storm in decades created worldwide auroras. What have we learned? - Space", "description": "\"It was a reminder that our sun is capable of producing these very disruptive events that can impact our critical infrastructure.\"", "url": "https://www.space.com/astronomy/sun/its-been-one-year-since-the-most-intense-solar-storm-in-decades-created-worldwide-auroras-what-have-we-learned", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jX83QBVz6DbjXDhUvyTQvV.jpg", "publishedAt": "2025-05-10T10:00:00Z", "content": "I'll never forget the night of May 10, 2024. I remember having dinner with a friend and talking about the potential of seeing the northern lights in Northeast Ohio, a conversation that I had never ha… [+7111 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "In An Unexpected Turn Of Events, Some Cicadas Just Performed Pachelbel’s Canon In D - IFLScience", "description": "Another day, another headline that makes you do a spit-take.", "url": "https://www.iflscience.com/musical-cyborgs-scientists-influence-cicadas-buzz-so-they-perform-pachelbels-canon-in-d-79145", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79145/aImg/83791/cicada-music-meta.png", "publishedAt": "2025-05-10T09:28:59Z", "content": "The incredible buzz of cicadas has been wielded by science like never before as a team working at the University of Tsukuba in Japan has found a way of stimulating the insects so that they performed … [+3186 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Crack 70-Year Fusion Puzzle, Paving Way for Clean Energy - SciTechDaily", "description": "A physics breakthrough could supercharge fusion power development by solving a decades-old particle containment issue.", "url": "https://scitechdaily.com/scientists-crack-70-year-fusion-puzzle-paving-way-for-clean-energy/", "urlToImage": "https://scitechdaily.com/images/Nuclear-Fusion-Reactor-Plasma-Concept-Art.jpg", "publishedAt": "2025-05-10T09:08:01Z", "content": "Researchers cracked a 70-year-old fusion problem, allowing faster, more accurate reactor designs that could finally make fusion energy viable. Credit: SciTechDaily.com\r\nScientists have developed a po… [+4488 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Oregon", "title": "New mathematical approach transforms simulations of large molecule behavior - Phys.org", "description": "Computer simulations help materials scientists and biochemists study the motion of macromolecules, advancing the development of new drugs and sustainable materials. However, these simulations pose a challenge for even the most powerful supercomputers.", "url": "https://phys.org/news/2025-05-mathematical-approach-simulations-large-molecule.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/computer-simulations-l.jpg", "publishedAt": "2025-05-10T09:04:26Z", "content": "Computer simulations help materials scientists and biochemists study the motion of macromolecules, advancing the development of new drugs and sustainable materials. However, these simulations pose a … [+5989 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth’s Greatest Volcanic Mystery Solved: Scientists Trace Monster Eruption to Hidden Hotspot - SciTechDaily", "description": "A recent study has pinpointed the origin of a 120-million-year-old 'super-eruption,' shedding new light on Earth's intricate geological past. A team of geologists from the University of Maryland and the University of Hawaiʻi has definitively traced one of the…", "url": "https://scitechdaily.com/earths-greatest-volcanic-mystery-solved-scientists-trace-monster-eruption-to-hidden-hotspot/", "urlToImage": "https://scitechdaily.com/images/Ancient-Volcano-Smoke.jpg", "publishedAt": "2025-05-10T01:20:45Z", "content": "A surprising geologic discovery has linked one of Earth’s largest volcanic structures to a deep-sea hotspot in the Pacific Ocean, rewriting long-standing ideas about how underwater volcanoes and tect… [+5084 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "SpaceX Falcon 9 rocket launches Starlink satellites from California, lands on ship at sea (video) - Space", "description": "It was the first of five potential Starlink launches between today (May 9) and Monday (May 12).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-15-3-b1081-vsfb", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xcJGEJSUSJdVVknq5NFmMo.jpg", "publishedAt": "2025-05-10T01:09:44Z", "content": "SpaceX kicked off a potentially busy weekend with the launch of a batch of Starlink satellites this evening (May 9) from California.\r\nA Falcon 9 rocket launched SpaceX's Starlink 15-3 mission from Va… [+2218 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "This Galactic 'Bone' Was Smashed by a Pulsar Clocking Up to 2 Million MPH - ScienceAlert", "description": "The culprit in a cosmic hit-and-run that resulted in a broken 'bone' has been found out.", "url": "https://www.sciencealert.com/this-galactic-bone-was-smashed-by-a-pulsar-clocking-up-to-2-million-mph", "urlToImage": "https://www.sciencealert.com/images/2025/05/galactic-bone.jpg", "publishedAt": "2025-05-09T22:01:09Z", "content": "The culprit in a cosmic hit-and-run that resulted in a broken 'bone' has been found out.\r\nOf course, it's not actually a bone at all, but a mind-blowingly huge filament in the center of the Milky Way… [+2525 chars]"}, {"source": {"id": null, "name": "Anchorage Daily News"}, "author": "Ned Rozell", "title": "Alaska’s Dale Guthrie was an influential paleontologist who opened the door to a lost world - Anchorage Daily News", "description": "Guthrie responded to the discovery of “Blue Babe,” a 50,000-year-old steppe bison found north of Fairbanks in 1979.", "url": "https://www.adn.com/alaska-news/science/2025/05/09/alaskas-dale-guthrie-was-an-influential-paleontologist-who-opened-the-door-to-a-lost-world/", "urlToImage": "https://www.adn.com/resizer/v2/R36WMP6XL5ACXJEH72KAHYAIVI.jpg?smart=true&auth=d03760c1f6573544d57ad9dc057bb73fd54d7288383b2c3fe896056b88b0766d&width=1200&height=630", "publishedAt": "2025-05-09T21:18:04Z", "content": "Dale Guthrie stands over the remains of Blue Babe, a steppe bison at least 50,000 years old discovered by gold miner Walter Roman in 1979. (Photo by Mary Lee Guthrie) \r\nSometimes but not very often a… [+5925 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Was T. rex as smart as modern primates? Another study weighs in on the debate - Earth.com", "description": "Can tallying brain cells by studying fossilized skulls really tell us whether T. rex was closer to a crocodile or a clever baboon?", "url": "https://www.earth.com/news/was-tyrannosaurus-rex-smarter-than-modern-primates-dinosaur-intelligence-brain-size/", "urlToImage": "https://cff2.earth.com/uploads/2024/05/09144216/Tyrannosaurus-Rex_brain-size_intelligence-debate_1m.jpg", "publishedAt": "2025-05-09T21:01:37Z", "content": "The idea of a sharpwitted Tyrannosaurusrex prowling through Cretaceous forests, planning ambushes with the cunning of a primate, has stirred public fascination for years. \r\nA fresh debate erupted in2… [+5698 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Katrin Piecha", "title": "Early galaxies may contribute to the 'afterglow' of the universe - Phys.org", "description": "The \"afterglow\" of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to form. Researchers at the Universities of Bonn, Prague and Nanj…", "url": "https://phys.org/news/2025-05-early-galaxies-contribute-afterglow-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/early-galaxies-contrib.jpg", "publishedAt": "2025-05-09T19:59:42Z", "content": "The \"afterglow\" of the universe is an important piece of evidence for the Big Bang. This background radiation also provides important answers to the question of how the first galaxies were able to fo… [+5281 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Giant Impacts Could Trigger Seismic Vibrations Lasting Millions of Years - ScienceAlert", "description": "To understand how chaotic the early Solar System was, we need only gaze at the Moon.", "url": "https://www.sciencealert.com/giant-impacts-could-trigger-seismic-vibrations-lasting-millions-of-years", "urlToImage": "https://www.sciencealert.com/images/2025/05/The_Collision.jpg", "publishedAt": "2025-05-09T19:01:17Z", "content": "To understand how chaotic the early Solar System was, we need only gaze at the Moon. Its cratered surface bears the scars from multitudes of collisions. The early Solar System was like a debris field… [+4606 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Crocodile Fossil Makes Today’s Largest Creatures Look Tiny - The Daily Galaxy", "description": "Sarcosuchus imperator—literally \"flesh crocodile emperor\"—lived during the Early Cretaceous in what is now northern Africa. Unlike modern crocodiles, which", "url": "https://dailygalaxy.com/2025/05/this-crocodile-fossil-makes-todays-largest-creatures-look-tiny/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/This-Crocodile-Fossil-Makes-Todays-Largest-Creatures-Look-Tiny.jpg", "publishedAt": "2025-05-09T19:00:00Z", "content": "The fossil remains of Sarcosuchus imperatora prehistoric reptile dubbed SuperCrocwere uncovered in the Elrhaz Formation of Niger and described in detail in the early 2000s by paleontologist Paul Sere… [+3182 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "“What’s That?”, Scientists Stunned by Discovery of California’s New Tallest Tree - The Daily Galaxy", "description": "A UC Davis professor’s unexpected find in the High Sierra is rewriting the record books for the Jeffrey pine. Could this be a sign of bigger changes to come?", "url": "https://dailygalaxy.com/2025/05/whats-that-scientists-stunned-by-discovery-of-californias-new-tallest-tree/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Whats-That-Scientists-Stunned-by-Discovery-of-Californias-New-Tallest-Tree.jpg", "publishedAt": "2025-05-09T18:30:00Z", "content": "UC Davis Professor Hugh Saffords unexpected discovery of a Jeffrey pine in Californias High Sierra has set a new record for the highest-known tree of this species. His findings, published in the Madr… [+3539 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Doomed star circling supermassive black hole could be ripped apart in less than 6 years - Space", "description": "On each pass, the star kicks out one Jupiter's worth of mass from the black hole's disk.", "url": "https://www.space.com/astronomy/black-holes/doomed-star-circling-supermassive-black-hole-could-be-ripped-apart-in-less-than-6-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cu758oh2Skdy5NM5LF7kh.jpg", "publishedAt": "2025-05-09T18:00:00Z", "content": "A star in a faraway galaxy is sending itself into a spiral of doom, repeatedly plunging through a disk of hot gas surrounding a black hole and releasing powerful bursts of X-rays in the process. Soon… [+5239 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "A New AI Tool Can Recreate Your Face Using Nothing But Your DNA - ZME Science", "description": "New AI built by Chinese scientists can create 3D faces from DNA with alarming accuracy.", "url": "https://www.zmescience.com/science/news-science/ai-dna-3d-facial-reconstruction/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/05/assets_task_01jtty6tqyetvbs20jwt8b9dzn_1746808380_img_0.webp", "publishedAt": "2025-05-09T17:30:25Z", "content": "Credit: ZME Science/AI-generated with SORA.\r\nChinese scientists fed a string of genetic code into an artificial intelligence model. What came out looked like a face a strikingly realistic, three-dime… [+4755 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Has a Badass Moon Rover but No Way to Get It to the Moon - Gizmodo", "description": "It's back to the drawing board after the space agency called off its plan to launch VIPER with the help of a commercial partner.", "url": "https://gizmodo.com/nasa-has-a-badass-moon-rover-but-no-way-to-get-it-to-the-moon-2000600189", "urlToImage": "https://gizmodo.com/app/uploads/2024/07/viper-rover-e1723664235749.jpg", "publishedAt": "2025-05-09T17:25:40Z", "content": "NASA’s VIPER is designed to search for water ice around the Moon’s south pole. But instead of exploring the lunar terrain, the fully assembled four-wheeled robot is in storage at the Johnson Space Ce… [+2157 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Stadium-Sized Asteroid Will Fly Past Earth —Catch It Live Today! - The Daily Galaxy", "description": "A stadium-sized asteroid is set to pass by Earth on May 9, 2025, and you can watch it live. This potentially hazardous asteroid will make a close approach, but there's no need to worry.", "url": "https://dailygalaxy.com/2025/05/a-stadium-sized-asteroid-will-fly-past-earth-catch-it-live-today/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Stadium-Sized-Asteroid-Will-Fly-Past-Earth-—Catch-It-Live-Today.jpg", "publishedAt": "2025-05-09T17:00:00Z", "content": "On May 9, 2025, a stadium-sized asteroid will make a close pass by Earth. This close flyby of asteroid 2002 JX8 has been meticulously tracked by scientists, and although it poses no threat to Earth, … [+4339 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Face to face with a galaxy photo of the day for May 9, 2025 - Space", "description": "NGC 3596 appears almost perfectly face-on when viewed from Earth, showcasing the galaxy’s neatly wound spiral arms.", "url": "https://www.space.com/astronomy/hubble-space-telescope/face-to-face-with-a-galaxy-space-photo-of-the-day-for-may-9-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qCKhC8eWYuv2tsNcbFwStV.jpg", "publishedAt": "2025-05-09T16:37:59Z", "content": "The spiral galaxy NGC 3596 is viewed face-on in this NASA/ESA Hubble Space Telescope image that incorporates six different wavelengths of light. (Image credit: ESA/Hubble &amp; NASA, D. Thilker)\r\nYou… [+1876 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Just Found a Spider So Huge, It Might Have Stalked Dinosaurs - The Daily Galaxy", "description": "Scientists have unearthed a massive spider fossil in Australia, and it’s changing everything we know about prehistoric life.", "url": "https://dailygalaxy.com/2025/05/scientists-just-found-a-spider-so-huge-it-might-have-stalked-dinosaurs/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Just-Found-a-Spider-So-Huge-It-Might-Have-Stalked-Dinosaurs.jpg", "publishedAt": "2025-05-09T16:30:00Z", "content": "A newly discovered fossilized giant trapdoor spider in New South Wales is captivating both scientists and the public. This remarkable discovery, detailed in a recent study published in the Zoological… [+3851 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Brenna Cooper", "title": "Scientists made chillingly bleak discovery after finally reaching bottom of Red Sea - LADbible", "description": "Marine scientists researching the Gulf of Aqaba, Red Sea discovered a series brine pools at the bottom of the ocean which could hold important secrets.", "url": "https://www.ladbible.com/news/science/red-sea-brine-pools-discovered-bottom-316290-20250509", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blt2e74412bfc30761e/681e16778a9e200b2d8016e7/red-sea-bottom.png", "publishedAt": "2025-05-09T16:28:20Z", "content": "Forget exploring space, as it's believed that only five percent of the ocean has been explored meaning there could be a whole wealth of resources and secrets lurking under the waves.\r\nThe Seven Seas … [+3940 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Melissa Gaskill", "title": "NASA Study Reveals Venus Crust Surprise - NASA Science (.gov)", "description": "New details about the crust on Venus include some surprises about the geology of Earth’s hotter twin.", "url": "https://science.nasa.gov/science-research/astromaterials/nasa-study-reveals-venus-crust-surprise/", "urlToImage": "https://science.nasa.gov/wp-content/uploads/2022/05/pia00104-venus-computer-simulated-global-view.jpg", "publishedAt": "2025-05-09T15:14:53Z", "content": "New details about the crust on Venus include some surprises about the geology of Earths hotter twin.\r\nNew details about the crust on Venus include some surprises about the geology of Earths hotter tw… [+3362 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A recently realized ferroelectric topology in nanomembranes enables light field manipulation - Phys.org", "description": "Ferroelectrics are a class of materials that exhibit so-called spontaneous electric polarization, which is the separation of electric charges that can be reversed when an external electric field is applied to them. The dipole moments (i.e., pairs of equal and…", "url": "https://phys.org/news/2025-05-ferroelectric-topology-nanomembranes-enables-field.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-recently-realized-fe.jpg", "publishedAt": "2025-05-09T14:30:02Z", "content": "Ferroelectrics are a class of materials that exhibit so-called spontaneous electric polarization, which is the separation of electric charges that can be reversed when an external electric field is a… [+6173 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Finding Beauty and Truth in Mundane Occurrences - Quanta Magazine", "description": "The physicist Sidney Nagel delights in solving mysteries of the universe that are hiding in plain sight.", "url": "https://www.quantamagazine.org/finding-beauty-and-truth-in-mundane-occurrences-20250509/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/05/SidneyNagel-cr.KristenNorman-Social.jpg", "publishedAt": "2025-05-09T13:55:19Z", "content": "A stain drying on the counter. A raindrop splashing onto the sidewalk. A pile of gravel settling. Historically, such phenomena have rarely caught the attention of physicists, as they seem mundane and… [+2291 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "daturne2", "title": "Natural Disaster Response - NASA (.gov)", "description": "On episode 384, a NASA scientist discusses how imagery and data collected from the International Space Station can support natural disaster response teams on the ground.", "url": "https://www.nasa.gov/podcasts/houston-we-have-a-podcast/natural-disaster-response/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/hwhapep384-natural-disaster-response-featured.png", "publishedAt": "2025-05-09T13:36:45Z", "content": "From Earth orbit to the Moon and Mars, explore the world of human spaceflight with NASA each week on the official podcast of the Johnson Space Center in Houston, Texas. Listen to in-depth conversatio… [+42663 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "For the First Time, Scientists Caught Atoms Freely Interacting in Space—and It Was Stunning - Yahoo", "description": "We had to freeze ’em to see ’em.", "url": "https://www.popularmechanics.com/science/a64712954/free-wheeling-atoms/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/EEiW8EhKMNLxN.DHule0Dg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/cf3c0021c4eab5f6ea8b7038927b3a62", "publishedAt": "2025-05-09T13:30:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>Until now, atoms have never been imaged interacting freely in space, but a new technique known … [+4304 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Are We Wrong About Black Holes? A Radical Theory Challenges Einstein - SciTechDaily", "description": "The mystery at a black hole’s core might soon be solved — without a singularity at all.", "url": "https://scitechdaily.com/are-we-wrong-about-black-holes-a-radical-theory-challenges-einstein/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Singularity-Concept-Close.jpg", "publishedAt": "2025-05-09T13:03:13Z", "content": "New research challenges the long-accepted notion of singularities in black holes — the point where physics allegedly breaks down. Credit: SciTechDaily.com\r\nBlack holes may not have singularities afte… [+7473 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "In 2020, a Rogue Wave the Size of a Four-Storey Building Threatened the High Seas—And It Wasn’t Supposed to Exist - The Daily Galaxy", "description": "A massive wave appeared out of nowhere off the coast of Vancouver Island, towering over nearby waters. This rare phenomenon defied scientific expectations and left experts stunned.", "url": "https://dailygalaxy.com/2025/05/in-2020-a-rogue-wave-the-size-of-a-four-storey-building-threatened-the-high-seas-and-it-wasnt-supposed-to-exist/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/the-most-extreme-rogue-wave-ever-recorded-in-the-pacific-reveals-astonishing-details.jpg", "publishedAt": "2025-05-09T12:20:00Z", "content": "In November 2020, a colossal rogue wave was recorded off the coast of Ucluelet, a small town on Vancouver Island, Canada. This extraordinary event saw a wave rise to a height of 17.6 meters, about th… [+3992 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Space agencies grapple with potential changes to Artemis - SpaceNews", "description": "Space agencies working on the NASA-led Artemis lunar exploration campaign said they plan to continue work on their contributions despite NASA’s current budget uncertainty, even as some consider alt…", "url": "http://spacenews.com/space-agencies-grapple-with-potential-changes-to-artemis/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDVcLzU0NTA1OTc4Mzg3X2YyMDBmMmI2MmNfay0xMDI0eDY4My5qcGciLCJ0eHQiOiJTcGFjZSBhZ2VuY2llcyBncmFwcGxlIHdpdGggcG90ZW50aWFsIGNoYW5nZXMgdG8gQXJ0ZW1pcyIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.pBRU2x43kLz3mRGyT_FhKVFixvdSPGjzmIrF6Fq3TKEMQ", "publishedAt": "2025-05-09T11:54:04Z", "content": "WASHINGTON Space agencies working on the NASA-led Artemis lunar exploration campaign said they plan to continue work on their contributions despite NASAs current budget uncertainty, even as some cons… [+5246 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "New quantum gravity discovery could unite quantum mechanics and relativity - The Brighter Side of News", "description": "Researchers observing rare cosmic events have uncovered mechanisms that could reshape both industry and our view of the universe.", "url": "https://www.thebrighterside.news/post/new-quantum-gravity-discovery-could-unite-quantum-mechanics-and-relativity/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/quantum-gravity.webp?auto=webp", "publishedAt": "2025-05-09T11:51:00Z", "content": "Breakthroughs in science often begin with a simple question and years of tireless exploration. From the way tiny molecules slip through microscopic pores to the staggering behavior of matter near cos… [+8638 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "More than 99% of the Deep Sea Still Remains a Mystery - AOL.com", "description": "Humans have observed less than 0.001% of the deep seafloor—an area roughly the size of Rhode Island.", "url": "https://time.com/7283470/majority-deep-sea-remains-a-mystery-study/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/gYuh1TJ8VEMWBJ8bnfp7DA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/aol_time_773/9c5e0f516342ee031cffea048b69960e", "publishedAt": "2025-05-09T11:29:51Z", "content": "Humanity has only explored 0.001% of the deep sea, according to a May 2025 study. Credit - Getty Images\r\nThe Trump Administration signed an executive order late last month aiming to fast-track approv… [+2855 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronauts Can Reach Mars, but One Critical Organ Could Fail Forever - The Daily Galaxy", "description": "Astronauts are ready to venture to Mars, but the journey comes with an unexpected cost. While reaching the Red Planet may be possible, it could leave them with lifelong consequences.", "url": "https://dailygalaxy.com/2025/05/astronauts-can-reach-mars-but-one-critical-organ-could-fail-forever/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Two-astronauts-climbing-a-mountain-helping-each-other-reach-the-summit.jpg", "publishedAt": "2025-05-09T11:15:00Z", "content": "As space exploration pushes further into the unknown, new challenges are emerging, particularly for long-duration missions. While astronauts may eventually make it to Mars, research indicates that th… [+3982 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Paleontologists Recover a 'One-in-a-Billion' Sea Monster Skull—Bigger, Deadlier, and Stronger Than T. Rex! - The Daily Galaxy", "description": "A colossal sea monster skull has been uncovered along England's Jurassic Coast, leaving paleontologists stunned. This prehistoric predator, with a jaw stronger than anything previously imagined, is rewriting the history of the ocean’s deadliest creatures.", "url": "https://dailygalaxy.com/2025/05/paleontologists-recover-a-one-in-a-billion-sea-monster-skull-bigger-deadlier-and-stronger-than-t-rex/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/pliosaur-a-prehistoric-marine-reptile.jpg", "publishedAt": "2025-05-09T10:45:00Z", "content": "A massive fossil skull has emerged from the cliffs of Dorset, sending ripples through the paleontological community. Found at Kimmeridge Bay, part of the renowned Jurassic Coast in southern England, … [+4002 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China to launch new modules to Tiangong space station - SpaceNews", "description": "China is preparing to launch new modules to its Tiangong space station to meet growing demands for science and potentially boost international cooperation.", "url": "http://spacenews.com/china-to-launch-new-modules-to-tiangong-space-station/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyM1wvMTBcL3NoZW56aG91MTctZG9ja2luZy12aWV3LW9mLXRpYW5nb25nLTI2b2N0MjAyMy1DTVNBLTEtMTAyNHg2NzEuanBnIiwidHh0IjoiQ2hpbmEgdG8gbGF1bmNoIG5ldyBtb2R1bGVzIHRvIFRpYW5nb25nIHNwYWNlIHN0YXRpb24iLCJ0ZW1wbGF0ZSI6ImZ1bGxzY3JlZW4iLCJibG9nX2lkIjo4MDY4MTk3OX0.l5aCfzegskb19MFLHVefuVHFsgvXq-PEarz6jDiIRagMQ", "publishedAt": "2025-05-09T10:39:19Z", "content": "HELSINKI China is preparing to launch new modules to its Tiangong space station to meet growing demands for science and potentially boost international cooperation.\r\nThe Long March 5B, currently Chin… [+4789 chars]"}, {"source": {"id": null, "name": "Iai.tv"}, "author": null, "title": "Spacetime is not a substance - IAI TV", "description": "", "url": "https://iai.tv/articles/spacetime-is-not-a-substance-auid-3164", "urlToImage": "https://iai.tv/assets/Uploads/_resampled/FillWzQ4MCwyNzBd/spacetime-is-not-a-substance.webp", "publishedAt": "2025-05-09T10:14:37Z", "content": "What is real in our fundamental physical theories? University of Pittsburgh historian and philosopher of science, John D. Norton, argues answers lie in Einsteins hole argument. Upon realizing his own… [+3195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Paddison", "title": "Global sea levels are rising faster and faster. It spells catastrophe for coastal towns and cities - CNN", "description": "For around 2,000 years, global sea levels hardly varied. That changed in the twentieth century. Sea levels started rising and have not stopped since — and now, the pace is accelerating.", "url": "https://www.cnn.com/2025/05/09/climate/sea-level-rise-melting-ice-sheets", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1235037354.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-05-09T10:00:00Z", "content": "For around 2,000 years, global sea levels varied little. That changed in the 20th century. They started rising and have not stopped since and the pace is accelerating.\r\nScientists are scrambling to u… [+7044 chars]"}]}