{"status": "ok", "totalResults": 49, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "BRIAN MELLEY", "title": "‘Dinosaur highway’ tracks dating back 166 million years are discovered in England - The Associated Press", "description": "Researchers in England have unearthed nearly 200 dinosaur tracks that date back 166 million years. The discovery, announced Thursday by the universities of Oxford and Birmingham, were made last summer when a worker digging up clay in a quarry in Oxfordshire n…", "url": "https://apnews.com/article/uk-dinosaur-tracks-discovery-9fd0499419db0950099e6413a1936488", "urlToImage": "https://dims.apnews.com/dims4/default/bd336cd/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2f%2Fba%2F4d1f6c54c60b2f0c7b6112270c7e%2F66eda2f228a64f859030264d5e8069da", "publishedAt": "2025-01-02T15:17:00Z", "content": "LONDON (AP) A worker digging up clay in a southern England limestone quarry noticed unusual bumps that led to the discovery of a dinosaur highway and nearly 200 tracks that date back 166 million year… [+2511 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Underwater volcano off Oregon coast on the verge of eruption in 2025 - ZME Science", "description": "Scientists anticipate the submarine volcano will erupt before the end of 2025.", "url": "https://www.zmescience.com/science/news-science/underwater-volcano-off-oregon-coast-on-the-verge-of-eruption-in-2025/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/01/axial-seamount_underwater-geography_credit-UWashington_1m-1400x850-1.webp", "publishedAt": "2025-01-02T13:47:29Z", "content": "Axial Seamount sits less than 300 miles away from the US coast, but its eruption should cause no harm to humans. Credit: Wikimedia Commons. \r\nIn the depths of the Pacific Ocean, 470 kilometers off th… [+5592 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "How to watch the Quadrantids, one of the strongest meteor showers of the year - CNN", "description": "The Quadrantid meteor shower is one of the strongest, and quickest, meteor showers of the year. Here’s what you need to know to observe it during peak activity.", "url": "https://www.cnn.com/2025/01/02/science/quadrantid-meteor-shower-january/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1237540990.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-02T13:39:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe new year kicks off with the peak of the Quadrantid… [+5009 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Finally Solved a 620-Mile Geological Mystery Hidden Beneath Alaska - The Daily Galaxy --Great Discoveries Channel", "description": "Beneath Alaska’s rugged terrain lies a 620-mile enigma that has puzzled geologists for decades. The Denali Fault, a colossal strike-slip fault system, holds secrets of ancient tectonic events that shaped the western edge of North America. With new evidence li…", "url": "https://dailygalaxy.com/2025/01/scientists-solve-620-miles-mystery-alaska/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Scientists-Finally-Solved-a-620-Mile-Geological-Mystery-Hidden-Beneath-Alaska.jpg", "publishedAt": "2025-01-02T13:05:00Z", "content": "For decades, geologists have been puzzled by the Denali Fault, a sprawling 620-mile geological feature in Alaska. This massive strike-slip fault system, where tectonic plates slide past each other ho… [+5758 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "An Ominous Signal Crossed Earth’s Surface 15 Minutes Before a Volcano Erupted: Imperceptible to Humans - The Daily Galaxy --Great Discoveries Channel", "description": "15 minutes before one of the most powerful volcanic eruptions in history, something strange happened. A mysterious wave, imperceptible to human senses, rippled silently across the Earth’s surface. Scientists only discovered it after the disaster struck, leavi…", "url": "https://dailygalaxy.com/2025/01/an-ominous-signal-crossed-earths-surface-15-minutes-before-a-volcano-erupted/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/An-Ominous-Signal-Crossed-Earths-Surface-15-Minutes-Before-a-Volcano-Erupted-1.jpg", "publishedAt": "2025-01-02T12:00:00Z", "content": "A mysterious seismic wave detected before the massive eruption of the Hunga Tonga-Hunga Haapai volcano in January 2022 has led to groundbreaking insights into volcanic phenomena. Paired with revelati… [+5271 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Black holes can squash star formation, James Webb Space Telescope finds - Space.com", "description": "\"The Spiderweb protocluster is an ideal laboratory for investigating the relationship between black holes and star formation in detail.\"", "url": "https://www.space.com/the-universe/black-holes/black-holes-can-squash-star-formation-james-webb-space-telescope-finds", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PaoqffaHcER2YPwAQezdSD-1200-80.jpg", "publishedAt": "2025-01-02T11:00:00Z", "content": "NASA's James Webb Space Telescope found evidence that supermassive black holes suppress star formation in maturing galaxies.\r\nThe team used the James Webb Space Telescope's (JWST) Near Infrared Camer… [+5521 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Thomas Heatherwick", "title": "It's Official: Boring Cities Are Bad for Your Health - WIRED", "description": "Oppressive, unstimulating urban architecture isn’t just about eyesores; there’s evidence that it can cause actual harm to its residents. To fix this in 2025, we must start building for joy.", "url": "https://www.wired.com/story/boring-cities-are-bad-for-your-health/", "urlToImage": "https://media.wired.com/photos/6744606273cd4612788ac85e/191:100/w_1280,c_limit/WW25-Culture-TH-BHBH.jpg", "publishedAt": "2025-01-02T10:00:00Z", "content": "A significant proportion of people today live in towns and cities that grew up around trade, industry, and cars. Think of the docks of Liverpool, the factories of Osaka, the automobile obsession of N… [+4189 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bright Galaxies of the Early Universe Defy Expectations, Sending Astronomers Back to the Drawing Board - SciTechDaily", "description": "New findings from the James Webb Space Telescope contradict traditional theories about early galaxy formation, revealing large and bright galaxies instead of the expected small, dim structures. This observation supports the Modified Newtonian Dynamics (MOND) …", "url": "https://scitechdaily.com/?p=445753", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Galaxy-Formation-Art-Concept-Illustration.jpg", "publishedAt": "2025-01-02T09:17:41Z", "content": "The James Webb Space Telescope has found evidence of large, bright galaxies in the early universe, challenging traditional dark matter theories and suggesting a rapid galactic formation as predicted … [+4605 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Saurav Shroff", "title": "Transforming the Moon Into Humanity’s First Space Hub - WIRED", "description": "The small step back to Earth’s satellite will provide a giant leap for exploring our solar system.", "url": "https://www.wired.com/story/moon-humanity-industrial-space-hub/", "urlToImage": "https://media.wired.com/photos/67444ea4e4eed98751632ba8/191:100/w_1280,c_limit/WW25-Science-SS-Lily-LK.png", "publishedAt": "2025-01-02T09:00:00Z", "content": "This year will mark a turning point in humanitys relationship with the moon, as we begin to lay the foundations for a permanent presence on its surface, paving the way for our natural satellite to be… [+2255 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  RAQUEL GUERTZENSTEIN FROHLICH,  JERUSALEM POST STAFF", "title": "Yellowstone’s volcanic activity could be shifting northeast, study finds - The Jerusalem Post", "description": "The basalt regions within the caldera are slowly shifting to the upper crust, where heat is being diffused northeast.", "url": "https://www.jpost.com/science/article-835794", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/641821", "publishedAt": "2025-01-02T06:50:00Z", "content": "Magma underneath the Yellowstone Caldera — one of Earth’s biggest volcanic complexes — may be moving northeast, according to a study released by the United States Geological Survey (USGS) on Wednesda… [+1298 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Trace Fast Radio Burst to Surprise Source For First Time - ScienceAlert", "description": "When a magnetar within the Milky Way galaxy belched out a flare of colossally powerful radio waves in 2020, scientists finally had concrete evidence to pin down an origin for fast radio bursts.", "url": "https://www.sciencealert.com/scientists-trace-fast-radio-burst-to-surprise-source-for-first-time", "urlToImage": "https://www.sciencealert.com/images/2025/01/frb-illustration-magnetosphere.jpg", "publishedAt": "2025-01-02T05:24:35Z", "content": "When a magnetar within the Milky Way galaxy belched out a flare of colossally powerful radio waves in 2020, scientists finally had concrete evidence to pin down an origin for fast radio bursts.\r\nA mi… [+4723 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2025-01-02T02:43:14Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Every human being originated from this one African country - The Brighter Side of News", "description": "Fossil evidence, along with genetic analysis, points to this Northeast African country as the starting point for human evolution.", "url": "https://www.thebrighterside.news/post/every-human-being-originated-from-this-one-african-country/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/08/africa.webp?auto=webp", "publishedAt": "2025-01-02T01:07:00Z", "content": "Over the past two decades, genetic research has undergone transformative advancements, marked by an extraordinary surge in genomic data collection. This effort has gathered information from hundreds … [+7635 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "SpaceX launch surge helps set new global launch record in 2024 - SpaceNews", "description": "The world set another record for orbital launches in 2024 in a continuing surge of launch activity driven almost entirely by SpaceX.", "url": "http://spacenews.com/spacex-launch-surge-helps-set-new-global-launch-record-in-2024/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDFcLzU0MTE5MDQ5NTg4XzdmNTY2M2E3YjFfay0xMDI0eDY4My5qcGciLCJ0eHQiOiJTcGFjZVggbGF1bmNoIHN1cmdlIGhlbHBzIHNldCBuZXcgZ2xvYmFsIGxhdW5jaCByZWNvcmQgaW4gMjAyNCIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.pExCQsFhsmXzHUuXPXQ1OGrs1HnVM8AOB9-03wwfNkQMQ", "publishedAt": "2025-01-02T01:05:50Z", "content": "WASHINGTON The world set another record for orbital launches in 2024 in a continuing surge of launch activity driven almost entirely by SpaceX.\r\nThere were 259 orbital launch attempts in 2024, a 17% … [+2751 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Use Ancient Genes to Estimate Contact Between Humans, Neanderthals - VOA Learning English", "description": "A new study used ancient genes to look into interactions between Neanderthals and modern humans. Results of two recent studies estimate the two groups likely met and began mating about 45,000 years ago. The team noted the contact likely had a major influence …", "url": "https://learningenglish.voanews.com/a/scientists-use-ancient-genes-to-estimate-contact-between-humans-neanderthals/7911207.html", "urlToImage": "https://gdb.voanews.com/4146b084-23f5-4f15-a2b7-430df9e86fb5_w1200_r1.jpg", "publishedAt": "2025-01-01T22:05:00Z", "content": "Scientists have used ancient genes to learn more details about contact between Neanderthals and humans tens of thousands of years ago.\r\nResults of two recent studies estimate the two groups likely me… [+3883 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Jess Battison", "title": "People left 'terrified' of deep sea after seeing prehistoric creature in eerie underwater footage - LADbible", "description": "This whopper of a creature caught on camera looks like something out of a sci-fi film", "url": "https://www.ladbible.com/community/huge-deep-sea-prehistoric-shark-video-460815-20250101", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/bltf7762967c5e195f6/67759f324cca81fdde617d88/deep-sea-creature.png", "publishedAt": "2025-01-01T20:02:48Z", "content": "For some people, the very thought of the ocean is a scary one.\r\nAnd even if you havent got a phobia of sea animals or thalassophobia, it does get pretty eerie the deeper you think about it. I mean, i… [+2059 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can We Stop Brain Aging? Scientists Uncover Mitochondrial Key - SciTechDaily", "description": "New research identifies E-TCmito as a key link between neuronal activity and mitochondrial function, highlighting its potential to address cognitive decline in aging and diseases like Alzheimer’s. New research in mice has identified a critical mechanism that …", "url": "https://scitechdaily.com/?p=445693", "urlToImage": "https://scitechdaily.com/images/Brain-Boost-Intelligence-Increase-Illustration.jpg", "publishedAt": "2025-01-01T17:16:22Z", "content": "Researchers uncovered a mechanism called excitation-mitochondrial DNA transcription coupling (E-TCmito) linking neuronal activity to mitochondrial DNA transcription, crucial for maintaining brain fun… [+2973 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NOIRLab", "title": "Dark energy camera captures the glittering galaxies of the Antlia Cluster - Phys.org", "description": "NSF NOIRLab rings in the New Year with a glittering galaxyscape captured with the Department of Energy-fabricated Dark Energy Camera, mounted on the U.S. National Science Foundation Víctor M. Blanco 4-meter Telescope at Cerro Tololo Inter-American Observatory…", "url": "https://phys.org/news/2024-12-dark-energy-camera-captures-glittering.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/dark-energy-camera-cap.jpg", "publishedAt": "2025-01-01T17:00:48Z", "content": "NSF NOIRLab rings in the New Year with a glittering galaxyscape captured with the Department of Energy-fabricated Dark Energy Camera, mounted on the U.S. National Science Foundation Víctor M. Blanco … [+4005 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "New Study of Supernovae Data Suggests That Dark Energy is an Illusion - Universe Today", "description": "Dark energy is central to the standard model of cosmology, but the Timescape model suggests dark matter doesn't exist.", "url": "https://www.universetoday.com/170261/new-study-of-supernovae-data-suggests-that-dark-energy-is-an-illusion/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2025/01/universe-scaled.jpg", "publishedAt": "2025-01-01T16:40:59Z", "content": "Dark energy is central to our modern understanding of cosmology. In the standard model, dark energy is what drives the expansion of the Universe. In general relativity, it’s described by a cosmologic… [+3904 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "We finally know where to look for life on Mars - Space.com", "description": "If — and it is a big if — there is life to be found on the Red Planet, scientists say follow the methane.", "url": "https://www.space.com/space-exploration/search-for-life/we-finally-know-where-to-look-for-life-on-mars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5xZxFCV7RR58tHjtFKVdmU-1200-80.png", "publishedAt": "2025-01-01T16:03:00Z", "content": "Ever since the discovery of methane on Mars\r\n, scientists have wondered if the Red Planet might harbor life. Now, researchers know where to look: deep under the surface of a broad Martian plain.\r\nThe… [+4420 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Columbia University School of Engineering and Applied Science", "title": "New 'all-optical' nanoscale sensors of force access previously unreachable environments - Phys.org", "description": "Mechanical force is an essential feature for many physical and biological processes. Remote measurement of mechanical signals with high sensitivity and spatial resolution is needed for a wide range of applications, from robotics to cellular biophysics and med…", "url": "https://phys.org/news/2024-12-optical-nanoscale-sensors-access-previously.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/a-tour-de-force-columb.jpg", "publishedAt": "2025-01-01T16:00:02Z", "content": "Mechanical force is an essential feature for many physical and biological processes. Remote measurement of mechanical signals with high sensitivity and spatial resolution is needed for a wide range o… [+7696 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Scientists Just Debunked a Big Myth About Aging Bones - SciTechDaily", "description": "Researchers have found that age-related bone loss occurs independently of the gut microbiome, challenging previous beliefs and steering future osteoporosis treatments away from microbial solutions. A study by Harvard Medical School demonstrated that bone dete…", "url": "https://scitechdaily.com/harvard-scientists-just-debunked-a-big-myth-about-aging-bones/", "urlToImage": "https://scitechdaily.com/images/Osteoporosis-in-Spine.jpg", "publishedAt": "2025-01-01T15:11:53Z", "content": "In a groundbreaking study, scientists have discovered that the gut microbiome does not influence age-related bone loss, contradicting earlier theories.\r\nResearchers have found that age-related bone l… [+5435 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Toussaint Egan", "title": "What if the moon suddenly transformed into cheese? John Scalzi’s new book has an answer - Polygon", "description": "Starter Villain author John Scalzi is set to return this March with a new book, When the Moon Hits Your Eye. Read an exclusive excerpt from the book on Polygon.", "url": "https://www.polygon.com/entertainment/492832/john-scalzi-when-the-moon-hits-your-eye-excerpt-release", "urlToImage": "https://platform.polygon.com/wp-content/uploads/sites/2/2024/12/when-the-moon-hits-your-eye-cover-photo-header.jpg?quality=90&strip=all&crop=0%2C10.720012038253%2C100%2C78.559975923495&w=1200", "publishedAt": "2025-01-01T14:00:48Z", "content": "John Scalzi is a master of subverting expectations and skewering genre conventions. The author of Redshirts, The Kaiju Preservation Society, and Starter Villain is adept at turning time-worn tropes o… [+18161 chars]"}, {"source": {"id": null, "name": "INFORUM"}, "author": "Tracy Briggs", "title": "100 years ago today, a Fargo editor predicted the future. What did he get right and wrong? - INFORUM", "description": "The 1925 New Year's Day edition of The Fargo Daily Tribune pondered life on Mars, living forever and if it could really get any better than radio.", "url": "https://www.inforum.com/lifestyle/100-years-ago-today-a-fargo-editor-predicted-the-future-what-did-he-get-right-and-wrong", "urlToImage": "https://cdn.forumcomm.com/dims4/default/22fc814/2147483647/strip/true/crop/671x553+0+0/resize/1293x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2F61%2F3c%2F50dd8e0b490aa8007c035cbc6058%2Fscreenshot-2024-12-19-132549.png", "publishedAt": "2025-01-01T13:53:55Z", "content": "As 2024 drew to a close, you could barely turn on the TV or scroll through social media without seeing those year-end lists. They ranged from the familiar (\"Ten Best Movies of 2024) to the delightful… [+7686 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "What Was the Most Intelligent Dinosaur in History? Or the Most Intelligent Ones? - The Daily Galaxy --Great Discoveries Channel", "description": "What if dinosaurs were smarter than we thought? Recent studies are unraveling the mysteries of prehistoric intelligence, revealing surprising cognitive abilities in certain species. From the sharp senses of Tyrannosaurus rex to the advanced brain structure of…", "url": "https://dailygalaxy.com/2025/01/what-was-the-most-intelligent-dinosaur-in-history/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/An-artistic-rendering-of-Velociraptor-exhibiting-pack-hunting-behavior.jpg", "publishedAt": "2025-01-01T13:15:00Z", "content": "The intelligence of dinosaurs has fascinated researchers for decades, challenging traditional perceptions of these ancient creatures as lumbering, instinct-driven reptiles. Recent studies have introd… [+5542 chars]"}, {"source": {"id": null, "name": "Travel+Leisure"}, "author": "https://www.facebook.com/travelandleisure/", "title": "See the First Meteor Shower of the Year, 6 Planets in One Night, and More in January - Travel + Leisure", "description": "January's night sky will bring Quadrantid meteor shower, a Full Wolf Moon, and a 6-planet parade.", "url": "https://www.travelandleisure.com/january-sky-guide-quadrantid-meteor-shower-planets-8765726", "urlToImage": "https://www.travelandleisure.com/thmb/nHzMa5PotX6dqVdve0uFrPblL3Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/TAL-Quadrantid-january-JAN1224-c26581f8f5f34661aacc3523e9becd97.jpg", "publishedAt": "2025-01-01T13:00:00Z", "content": "While 2024 may have set the astrotourism bar high, 2025 has a host of night-sky marvels in store, too including many that are set to grace our skies this month.\r\nJanuary has a meteor shower, top-notc… [+3137 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Astrophysicists confirm first-ever detection of cosmic strings - The Brighter Side of News", "description": "Cosmic strings were first theorized in the mid-1970s as a possible outcome of symmetry-breaking processes in the early universe.", "url": "https://www.thebrighterside.news/discoveries/astrophysicists-confirm-first-ever-detection-of-cosmic-strings", "urlToImage": "https://www.thebrighterside.news/uploads/2024/12/cosmic-strings.jpeg?auto=webp", "publishedAt": "2025-01-01T12:58:00Z", "content": "The origin of the universe is a story of extremes, marked by an explosive event so profound it birthed the very fabric of space and time: the Big Bang. This moment, beyond the bounds of ordinary comp… [+7118 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "2025 Will See Two ‘Blood Moons’ And Two Solar Eclipses — What To Know - Forbes", "description": "There will be two total lunar and two partial eclipses in March and September, but where you are on the planet will determine what you'll see.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/01/01/2025-will-see-two-blood-moons-and-two-solar-eclipses---what-to-know/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/60ae3be97690b93ce508b5b6/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-01T12:23:03Z", "content": "The first \"Blood Moon'\" total lunar eclipse will occur overnight on March 1314, 2025 and be best ... [+] seen from North and South America.\r\nAFP via Getty Images\r\nDid you experience the total solar e… [+2613 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Creating Temporal Light Reflections With Metamaterials - Hackaday", "description": "Owing to the wave nature of light there are many ways that such different waves can interact with each other, but also with materials. Everyone knows about reflecting light with a mirror, which is …", "url": "https://hackaday.com/2025/01/01/creating-temporal-light-reflections-with-metamaterials/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/08/temporal_coherent_wave_control_with_time_interfaces.jpg", "publishedAt": "2025-01-01T12:00:00Z", "content": "Owing to the wave nature of light there are many ways that such different waves can interact with each other, but also with materials. Everyone knows about reflecting light with a mirror, which is a … [+1480 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Alex Knapp", "title": "Five Breakthroughs In 2024 That Laid A Foundation For Future Tech - Forbes", "description": "From transforming coal to computing with DNA to pharmaceutical manufacturing in space, these are the discoveries that will set the stage for the next decade’s technology.", "url": "https://www.forbes.com/sites/alexknapp/2024/12/27/top-breakthroughs-of-2024/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67699aef44fefde764014267/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-01T11:30:00Z", "content": "getty\r\nWhen you think of Albert Einstein, the first thing that probably comes to mind is the Theory of Relativity, which he played a key role in developing. So it may come as a surprise to learn that… [+7133 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Here Are 4 Things We Need to Consider Before We Mine Our Moon - ScienceAlert", "description": "By the end of this decade, nations and private companies may well be mining the surface of the Moon.", "url": "https://www.sciencealert.com/here-are-4-things-we-need-to-consider-before-we-mine-our-moon", "urlToImage": "https://www.sciencealert.com/images/2024/12/lunar_mine_base_header.jpg", "publishedAt": "2025-01-01T10:28:22Z", "content": "By the end of this decade, nations and private companies may well be mining the surface of the Moon.\r\nBut as space becomes accessible to more nations and corporations, we need to stop and ask ourselv… [+5079 chars]"}, {"source": {"id": null, "name": "Supercarblondie.com"}, "author": "https://facebook.com/profile.php?id=100058496944141", "title": "NASA found a planet bigger than Earth that’s in a ‘habitable zone’ - Supercar Blondie", "description": "NASA scientists discovered K2-18 b, a planet bigger than Earth in a habitable zone, with signs of potential life in its atmosphere, including dimethyl sulfide", "url": "https://supercarblondie.com/nasa-found-planet-bigger-than-earth-in-habitable-zone/", "urlToImage": "https://supercarblondie.com/wp-content/uploads/NASA-found-a-planet-bigger-than-Earth-thats-in-a-habitable-zone.webp", "publishedAt": "2025-01-01T10:06:00Z", "content": "NASA scientists have made an amazing discovery a planet named K2-18 b, much bigger than Earth that sits in a habitable zone.\r\nThis planet could have the right conditions for life.\r\nScientists have ev… [+1846 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Anger, tears and joy after Shropshire woman's heart attack at 22 - BBC.com", "description": "Faith Harrison says she wants to celebrate her \"second life\", 12 months after the attack.", "url": "https://www.bbc.com/news/articles/c3wedqexpyvo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7018/live/d4eb2170-b97b-11ef-b092-b1cccc33a085.jpg", "publishedAt": "2025-01-01T08:32:11Z", "content": "Faith Harrison suffered a major heart attack in January 2023 when she was 22\r\nOn 6 January 2024, a then 22-year old Faith Harrison began to have a heart attack while driving home from a hockey match.… [+3326 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Magnificent Moon - nasa.gov", "description": "In November 2024, an astronaut captured a striking photo of the Moon as it lingered just above Earth’s horizon.", "url": "https://earthobservatory.nasa.gov/images/153771/magnificent-moon", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/153000/153771/iss072e277954_th.jpg", "publishedAt": "2024-12-31T23:03:45Z", "content": null}, {"source": {"id": null, "name": "Religionnews.com"}, "author": "Donald Sweeting", "title": "A century after Hubble's discovery, our neighbor galaxies suggest a creator's mind - Religion News Service", "description": "(RNS) — Hubble made no claims about a creator, but his discoveries and the wonder they evoke have prompted others to reconsider ‘the God hypothesis.’", "url": "https://religionnews.com/2024/12/31/a-century-after-hubbles-discovery-our-neighbor-galaxies-suggest-a-creators-mind/", "urlToImage": "http://religionnews.com/wp-content/uploads/2024/12/RNS-Andromeda_Galaxy1-807x545.jpg", "publishedAt": "2024-12-31T22:30:00Z", "content": "(RNS) — When you look into the night sky, the naked eye can only make out 2,500 to 3,000 stars, five planets and maybe one to three galaxies, and that’s assuming ideal atmospheric conditions and the … [+5179 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Revolutionary ‘Super Steel’ produces green hydrogen directly from seawater - The Brighter Side of News", "description": "This new technology addresses two key challenges in water electrolysis systems: cost and corrosion resistance.", "url": "https://www.thebrighterside.news/post/revolutionary-super-steel-produces-green-hydrogen-directly-from-seawater/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/12/stainless-steel-green-hydrogen.jpg?auto=webp", "publishedAt": "2024-12-31T21:07:00Z", "content": "A breakthrough in stainless steel technology could revolutionize green hydrogen production, paving the way for a more sustainable global energy transition.\r\nResearchers at the University of Hong Kong… [+6118 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Fit for a Sci-Fi Movie: NASA Claims China Can Slow Down Earth's Rotation with a Single Gesture - The Daily Galaxy --Great Discoveries Channel", "description": "What if a single human-made structure could subtly alter the Earth’s rotation? The colossal barrage des Trois Gorges in China doesn’t just generate record-breaking electricity—it also shifts planetary mechanics in ways you’d never expect. NASA’s findings reve…", "url": "https://dailygalaxy.com/2024/12/fit-for-a-sci-fi-movie-nasa-claims-china-can-slow-down-earths-rotation-with-a-single-gesture/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Three-Gorges-Dam-in-Central-Chinas-Hubei-province.jpg", "publishedAt": "2024-12-31T19:33:12Z", "content": "The Three Gorges Dam, a colossal hydroelectric dam in central China, is not just the largest of its kind on Earthit also holds a claim straight out of a science fiction story. According to NASA, the … [+3247 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Revolutionizing Brain Diagnostics with Light and AI - Neuroscience News", "description": "A new \"molecular lantern\" technique allows researchers to monitor molecular changes in the brain non-invasively using a thin light-emitting probe.", "url": "https://neurosciencenews.com/molecular-lantern-brain-cancer-ai-28294/", "urlToImage": "https://neurosciencenews.com/files/2024/12/molecular-lantern-brain-cancer-neuroscience.jpg", "publishedAt": "2024-12-31T19:10:46Z", "content": "Summary: A new “molecular lantern” technique allows researchers to monitor molecular changes in the brain non-invasively using a thin light-emitting probe. This innovative tool utilizes Raman spectro… [+7909 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Early Experiences Shape Genes, Brain Health, and Resilience - Neuroscience News", "description": "New research in epigenetics reveals how early-life experiences influence gene expression and brain development.", "url": "https://neurosciencenews.com/epigenetics-experience-neurodevelopment-28293/", "urlToImage": "https://neurosciencenews.com/files/2024/12/epigenetics-experience-neuroscience.jpg", "publishedAt": "2024-12-31T18:14:05Z", "content": "Summary: New research in epigenetics reveals how early-life experiences influence gene expression and brain development. By bridging the gap between nature and nurture, this work shows that environme… [+4704 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "German astronomers discover three new hydrogen-deficient pre-white dwarfs - Phys.org", "description": "Using the X-shooter instrument at ESO's Very Large Telescope (VLT), German astronomers have detected three new pre-white dwarfs, which turned out to be strongly hydrogen-deficient. The finding was reported in a research paper published December 20 on the pre-…", "url": "https://phys.org/news/2024-12-german-astronomers-hydrogen-deficient-pre.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/german-astronomers-dis.jpg", "publishedAt": "2024-12-31T18:00:01Z", "content": "Using the X-shooter instrument at ESO's Very Large Telescope (VLT), German astronomers have detected three new pre-white dwarfs, which turned out to be strongly hydrogen-deficient. The finding was re… [+2913 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Tourists May Have Spent Their Holiday On The Lost Continent Of Greater Adria \"Without Realizing It\" - IFLScience", "description": "\"Forget Atlantis. Without realising it, vast numbers of tourists spend their holiday each year on the lost continent of Greater Adria.\"", "url": "https://www.iflscience.com/tourists-may-have-spent-their-holiday-on-the-lost-continent-of-greater-adria-without-realizing-it-77450", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77450/aImg/81205/sacra-di-san-michele-in-the-province-of-turin-meta.png", "publishedAt": "2024-12-31T17:31:36Z", "content": "Around 200 million years ago, Earth's last supercontinent Pangea began to break apart, with plate tectonics slowly moving the continents into the world we recognize today.   \r\nPlate tectonics was onl… [+2310 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Niamh Shackleton", "title": "Man who tried to let world's biggest snake eat him alive on TV instantly regretted his decision - UNILAD", "description": "American conservationist Paul Rosolie risked his life to raise awareness about the Amazon rainforest after almost being eaten alive by a 20ft long anaconda.", "url": "https://www.unilad.com/news/animals/paul-rosolie-almost-eaten-alive-snake-542486-20241231", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt314ed6d813304874/67742936dc7f695a38006fad/eaten-alive-by-snake.jpg", "publishedAt": "2024-12-31T17:26:20Z", "content": "Most people might do a sponsored marathon or bungee jump to raise awareness about something close to their heart, but this guy opted to be eaten by a giant snake.\r\nWho would be mad enough to do this,… [+2147 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Marcos Fernandez Tous", "title": "NASA's Orion crew capsule had heat shield issues during Artemis 1 − an aerospace expert weighs in (op-ed) - Yahoo! Voices", "description": "Issues with the Orion spacecraft's heat shield on Artemis 1 have delayed the next mission, Artemis 2. So what happened?", "url": "https://www.space.com/space-exploration/nasa-orion-crew-capsule-had-heat-shield-issues-during-artemis-1-an-aerospace-expert-weighs-in-op-ed", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/94H8mhCFbuoWFPx1kXdQBw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/c8e2d845bd7511f34bdd095a1c7dcd82", "publishedAt": "2024-12-31T17:00:00Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nW… [+7036 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Our Understanding Of The Universe Near And Far Is Dramatically Changing - IFLScience", "description": "New discoveries are pushing the envelope, but major challenges remain unsolved.", "url": "https://www.iflscience.com/our-understanding-of-the-universe-near-and-far-is-dramatically-changing-77446", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77446/aImg/81193/glittering-meta.jpg", "publishedAt": "2024-12-31T16:25:40Z", "content": "Cutting-edge astronomy is always a balance between the most incredible breakthroughs and realizing those breakthroughs have not just provided answers, but have also raised questions some old and some… [+7311 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Study sheds light on how gold reaches the Earth’s surface - MINING.com", "description": "Most of Earth's gold is locked up in the mantle, the thick, middle layer of the planet located between the crust and the outer core.", "url": "https://www.mining.com/study-sheds-light-on-how-gold-reaches-the-earths-surface/", "urlToImage": "https://www.mining.com/wp-content/uploads/2024/11/AdobeStock_887647518-1024x574.jpeg", "publishedAt": "2024-12-31T16:04:56Z", "content": "Well, you’re right!\r\nConfused?\r\nLet me explain.\r\nMost of Earth’s gold is locked up in the mantle, the thick, middle layer of the planet located between the crust and the outer core. Pure gold in the … [+2700 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Firefighters Surprise Boy with Brand New Bicycle After Cutting Spokes to Free His Foot - Good News Network", "description": "Fernandina Beach Fire Department rushed to the scene of a bicycle collision where a young man was trapped under his bike wheel.", "url": "https://www.goodnewsnetwork.org/firefighters-surprise-boy-with-brand-new-bicycle-after-cutting-spokes-to-free-his-foot/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2024/12/credit-Fernandina-Beach-Fire-Department.jpg", "publishedAt": "2024-12-31T16:00:34Z", "content": "– credit: Fernandina Beach Fire Department\r\nOn December 18th, Fernandina Beach Fire Department rushed to the scene of a bicycle collision where a young man was trapped under his bike wheel.\r\nBefore t… [+1116 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jeff Spry", "title": "'Star Bound' serves up a 'snarky approach to space history' and the American space program (exclusive) - Space.com", "description": "Blast off into the fascinating history of America's visionary quest to explore the heavens", "url": "https://www.space.com/entertainment/star-bound-serves-up-a-snarky-approach-to-space-history-and-the-american-space-program-exclusive", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LnZrR2tNfxXgtex67bQCEm-1200-80.jpg", "publishedAt": "2024-12-31T16:00:00Z", "content": "Noted author, poet, and NASA historian Bruce McCandless III (\"Wonders All Around\") grew up in close proximity to the thundering roar of Apollo-era rockets and the Space Shuttle Program as the son of … [+6241 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "10 amazing things we found on Mars in 2024, from hundreds of 'spiders' to a 'Martian dog' - Livescience.com", "description": "From arachnid-like formations and mysterious blobs to an underground ocean and a giant volcano, here are our 10 favorite things scientists discovered on Mars this year.", "url": "https://www.livescience.com/space/mars/from-spiders-on-mars-to-a-martian-dog-10-amazing-things-we-found-on-the-red-planet-in-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RJy7zHrJRGhqyVAWSBsgMR-1200-80.jpg", "publishedAt": "2024-12-31T16:00:00Z", "content": "Every year the robots and satellites scientists have sent to Mars\r\n make discoveries that help us learn more about the Red Planet's past and take us a step closer to humanity's potential future livin… [+10004 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Strong Solar Storm Warning Issued For Today As Sun Sends “Fireworks” To Earth - IFLScience", "description": "A celestial end-of-the-year light show is certainly a way to welcome 2025.", "url": "https://www.iflscience.com/strong-solar-storm-warning-issued-for-today-as-sun-sends-fireworks-to-earth-77436", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77436/aImg/81170/aurora-meta.jpg", "publishedAt": "2024-12-31T10:05:38Z", "content": "The Sun is currently experiencing its solar maximum and we have seen its effects across the months with intense solar flares, extreme geomagnetic storms, and auroral displays at lower latitudes than … [+1954 chars]"}]}