{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Oldest Remains of Large Sea Reptile Found on Norwegian Island - VOA Learning English", "description": "Remains of a large sea reptile that lived during the time of the dinosaurs were found recently on a Norwegian island.", "url": "https://learningenglish.voanews.com/a/oldest-remains-of-large-sea-reptile-found-on-norwegian-island/7010510.html", "urlToImage": "https://gdb.voanews.com/9a57115a-69a1-4a1c-aafa-02403f152656_cx0_cy10_cw0_w1200_r1.jpg", "publishedAt": "2023-03-26T21:55:38Z", "content": "Fossils of a large sea reptile that lived during the time of the dinosaurs were found recently on a Norwegian island.\r\nThe reptile is the ichthyosaur. It lived in the oceans and grew to be 21 meters … [+3660 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Caltech Engineers Have Developed an Unusually Tough New Material - SciTechDaily", "description": "Caltech engineers have made a significant breakthrough in the field of nano- and micro-architected materials by creating a novel material composed of multiple interconnected microscale knots. Compared to structurally identical but unknotted materials, the pre…", "url": "https://scitechdaily.com/caltech-engineers-have-developed-an-unusually-tough-new-material/", "urlToImage": "https://scitechdaily.com/images/Microscale-Knots.jpg", "publishedAt": "2023-03-26T19:15:36Z", "content": "ByCalifornia Institute of TechnologyMarch 26, 2023\r\nThe knotted materials, which were created out of polymers, exhibit a tensile toughness that far surpasses materials that are unknotted but otherwis… [+5514 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ingenious Photosynthesis \"Hack\" Paves Way for Renewable Energy Breakthroughs - SciTechDaily", "description": "Researchers have ‘hacked’ the earliest stages of photosynthesis, the natural machine that powers the vast majority of life on Earth, and discovered new ways to extract energy from the process, a finding that could lead to new ways of generating clean fuel and…", "url": "https://scitechdaily.com/ingenious-photosynthesis-hack-paves-way-for-renewable-energy-breakthroughs/", "urlToImage": "https://scitechdaily.com/images/Photosynthesis-Hack-New-Ways-of-Generating-Renewable-Energy.jpg", "publishedAt": "2023-03-26T15:32:48Z", "content": "ByUniversity of CambridgeMarch 26, 2023\r\nIn a groundbreaking development, researchers have successfully hacked the initial stages of photosynthesis the natural process that fuels the majority of life… [+7340 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 33 armadillos to pass Earth Sunday - NASA - The Jerusalem Post", "description": "Asteroid 2023 FL2 is 35 meters, which is as much as almost 33 nine-banded armadillos lined up tail-to-snout. However, it won't hit us, and armadillos might even be more dangerous.", "url": "https://www.jpost.com/science/article-735473", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/501266", "publishedAt": "2023-03-26T15:27:00Z", "content": "An asteroid around the size of almost 33 armadillos is set to pass by Earth on Sunday, according to NASA's asteroid tracker.\r\nThe asteroid in question has been designated 2023 FL2 and was discovered … [+3271 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martha McHardy", "title": "Strongest solar storm in years hits Earth catching forecasters by surprise - The Independent", "description": "The storm made auroras visible as far south as New Mexico in the US", "url": "https://www.independent.co.uk/news/world/solar-storm-new-mexico-us-b2308196.html", "urlToImage": "https://static.independent.co.uk/2023/02/28/10/iStock-1423939850.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-03-26T14:29:39Z", "content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nThe most powerful solar storm in nearly six years ha… [+1989 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Jack Hobbs", "title": "Scientists discover supermassive black hole that now faces Earth - New York Post ", "description": "This is a galactic-sized problem.", "url": "https://nypost.com/2023/03/26/a-supermassive-black-hole-now-faces-earth-scientists/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/03/NYPICHPDPICT000008805949.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-03-26T14:29:00Z", "content": "This is a galactic-sized problem. \r\nScientists revealed Tuesday that galaxy PBC J2333.9-2343 has been reclassified after discovering a supermassive black hole that is currently facing our solar syste… [+2507 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Troy Farah", "title": "Sexually deceptive flowers trick flies into \"mating\" with them - Salon", "description": "Beetle daisies evolved weird fly-like shapes to fool pollinators. Biologists now know how this trick evolved", "url": "https://www.salon.com/2023/03/26/sexually-deceptive-flowers-trick-flies-into-mating-with-them/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/03/gorteria_diffusa_wiki_commons_01.jpg", "publishedAt": "2023-03-26T14:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Copper Deposits Turned a Village Into One of the Most Important Trade Hubs of the Late Bronze Age - SciTechDaily", "description": "Researchers from the University of Gothenburg have uncovered evidence that highlights the significance of the Cypriot village of Hala Sultan Tekke during the Late Bronze Age. Through excavations, the team has established that the village's strategic location …", "url": "https://scitechdaily.com/how-copper-deposits-turned-a-village-into-one-of-the-most-important-trade-hubs-of-the-late-bronze-age/", "urlToImage": "https://scitechdaily.com/images/Copper-Slag-Cyprus.jpg", "publishedAt": "2023-03-26T13:01:30Z", "content": "Copper slag from one of the citys workshops. Credit: T. Bürge\r\nResearchers from the University of Gothenburg have uncovered evidence that highlights the significance of the Cypriot village of Hala Su… [+5426 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Gemma Lavender", "title": "What equipment do you need to see and photograph the planets - Space.com", "description": "How to achieve the very best views and images of the neighboring worlds in our solar system.", "url": "https://www.space.com/what-equipment-do-you-need-to-see-and-photograph-the-planets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZYuMMSqF6Se9vqPZVTm7Yg-1200-80.jpg", "publishedAt": "2023-03-26T13:00:30Z", "content": "Ever wondered how to view and photograph the planets? Viewing the planets in our solar system is on every observer's hit list during a session under the night sky. Popular with beginners and seasoned… [+14023 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "MADDIE BURAKOFF", "title": "Planets on parade: 5 will be lined up in night sky this week - Yahoo News", "description": "Mercury, Jupiter, Venus, Uranus and Mars — will line up near the moon.  You’ll want to look to the western horizon right after sunset, said NASA astronomer...", "url": "https://news.yahoo.com/planets-parade-5-lined-night-120333869.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/pLWuDyOa9_wd_HcE7pxqWA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap.org/aa51bb2fa85cc8af8685ff566c341fa6", "publishedAt": "2023-03-26T12:03:33Z", "content": "NEW YORK (AP) Keep an eye to the sky this week for a chance to see a planetary hangout.\r\nFive planets Mercury, Jupiter, Venus, Uranus and Mars will line up near the moon.\r\nWHERE AND WHEN CAN YOU SEE … [+1599 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Two meteorites are providing a detailed look into outer space - Phys.org", "description": "If you've ever seen a shooting star, you might have actually seen a meteor on its way to Earth. Those that land here are called meteorites and can be used to peek back in time, into the far corners of outer space or at the earliest building blocks of life. To…", "url": "https://phys.org/news/2023-03-meteorites-outer-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/outer-space.jpg", "publishedAt": "2023-03-26T12:00:25Z", "content": "If you've ever seen a shooting star, you might have actually seen a meteor on its way to Earth. Those that land here are called meteorites and can be used to peek back in time, into the far corners o… [+5304 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "NASA selects solar physicist Nicola Fox as its new science chief - Space.com", "description": "Fox previously led the agency's Heliophysics Division.", "url": "https://www.space.com/solar-physicist-nicola-fox-nasa-science-chief", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GDg98m6cFdSbufhTX2XknL-1200-80.jpeg", "publishedAt": "2023-03-26T10:00:17Z", "content": "NASA has selected Nicola Fox as the new associate administrator for its Science Mission Directorate, who oversees more than 100 important missions and projects. \r\nFox previously headed up NASA's Heli… [+3137 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Astrobiologist suggests we look for signs of life from elsewhere in the galaxy by studying space dust - Phys.org", "description": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal International Journal of Astrobiology, he suggests that space dust…", "url": "https://phys.org/news/2023-03-astrobiologist-life-galaxy-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/spacedust.jpg", "publishedAt": "2023-03-26T10:00:01Z", "content": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal Intern… [+2521 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Boeing Starliner's 1st crewed trip to the ISS delayed again over battery overheating risk - The Register", "description": "May fly in the summer, with some presumably pretty nervous pilots", "url": "https://www.theregister.com/2023/03/26/boeing_starliner_iss_delay/", "urlToImage": "https://regmedia.co.uk/2023/03/24/starliner_shutterstock.jpg", "publishedAt": "2023-03-26T09:21:00Z", "content": "Boeing's first mission carrying astronauts to the International Space Station aboard its Starliner capsule, scheduled for April, is now delayed until summer due to the risk of overheating batteries.\r… [+2234 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "VIDEO: Stunning Jezero Crater of Mars seen in flyover - The News International", "description": "The European Space Agency  has developed a virtual flight over the popular Jezero Crater on Mars for those who wish to travel to space and broaden their horizons.An animated video by ESA which...", "url": "https://www.thenews.com.pk/latest/1054159-video-stunning-jezero-crater-of-mars-seen-in-flyover", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-03-26/1054159_095444_updates.jpg", "publishedAt": "2023-03-26T05:40:00Z", "content": "The European Space Agency (ESA) has developed a virtual flight over the popular Jezero Crater on Mars for those who wish to travel to space and broaden their horizons.\r\nAn animated video by ESA which… [+1411 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Race Against Time: NASA Readies for Historic Asteroid Sample Delivery - SciTechDaily", "description": "NASA's OSIRIS-REx spacecraft is cruising back to Earth with a sample it collected from the rocky surface of asteroid Bennu. When its sample capsule parachutes down into the Utah desert on September 24, OSIRIS-REx will become the United States’ first-ever miss…", "url": "https://scitechdaily.com/a-race-against-time-nasa-readies-for-historic-asteroid-sample-delivery/", "urlToImage": "https://scitechdaily.com/images/NASAs-OSIRIS-REx-Asteroid-Sample-Return-Mission.jpg", "publishedAt": "2023-03-26T01:35:04Z", "content": "ByRani Gran, NASA's Goddard Space Flight CenterMarch 25, 2023\r\nNASAs OSIRIS-REx Asteroid Sample Return Mission. Credit: NASAs Goddard Space Flight Center\r\nNASAs OSIRIS-REx spacecraft is cruising back… [+8253 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Bob Cronin", "title": "Scientists: Trash Mess in Space Mirrors Problem in Oceans - Newser", "description": "Cleanup effort must start with a binding global treaty, experts say", "url": "https://www.newser.com/story/332711/to-clean-up-the-mess-in-space-scientists-urge-a-global-treaty.html", "urlToImage": "https:https://img2-azrcdn.newser.com/image/1464039-12-20230325172455.jpeg", "publishedAt": "2023-03-25T21:55:00Z", "content": "There have been calls to action to clean up the trash in the world's oceans, and now researchers are warning of the urgency to do the same thing in space. The efforts are more similar than they might… [+1761 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Chad Langen", "title": "Alpha Centauri Mission Searching For Life, Signals Already Found - Giant Freakin Robot", "description": "Alpha Centauri is our neighboring solar system, but we know little about it, except it's out best shot at finding life beyond Earth.", "url": "https://www.giantfreakinrobot.com/sci/alpha-centauri-mission-searching-life.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2021/01/planets-planetary-protection-scaled.jpg", "publishedAt": "2023-03-25T21:41:05Z", "content": "A team of researchers out of the University of Sydney will search Alpha Centauri for signs of life in the hope of finding another habitable planet. \r\nThe search for extra-terrestrial life has always … [+3119 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "A Geometric Shape That Does Not Repeat Itself When Tiled - Slashdot - Slashdot", "description": "IHTFISP shares a report from Phys.Org: A quartet of mathematicians from Yorkshire University, the University of Cambridge, the University of Waterloo and the University of Arkansas has discovered a 2D geometric shape that does not repeat itself when tiled. Da…", "url": "https://science.slashdot.org/story/23/03/24/2232256/a-geometric-shape-that-does-not-repeat-itself-when-tiled", "urlToImage": "https://a.fsdn.com/sd/topics/math_64.png", "publishedAt": "2023-03-25T19:49:39Z", "content": "I'd hate to have to grout that.\r\nThat's not the only problem. You would need special software to lay it, because it not only has the ability to have no repeating section, it also has the ability to m… [+394 chars]"}, {"source": {"id": null, "name": "Reviewgeek.com"}, "author": "Cory Gunther", "title": "SpaceX Rocket Captures a Stunning Timelapse of Earth - Review Geek", "description": "Seeing a view of Earth from thousands of miles away in a Hollywood movie is neat, but it’s even more amazing when it happens in real life. A new video and timelapse shared by Elon Musk’s SpaceX company did precisely that, and it’s pretty stunning.", "url": "https://www.reviewgeek.com/149347/spacex-rocket-captures-a-stunning-timelapse-of-earth/", "urlToImage": "https://www.reviewgeek.com/p/uploads/2023/03/4c17a1a3.jpg", "publishedAt": "2023-03-25T18:00:23Z", "content": "SpaceX\r\nSeeing a view of Earth from thousands of miles away in a Hollywood movie is neat, but it’s even more amazing when it happens in real life. A new video and timelapse shared by Elon Musk’s Spac… [+1197 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Webb Space Telescope captures dust storm on remote planet - Fox News", "description": "Using data from the James Webb Space Telescope, NASA said researchers have spotted silicate cloud features in the swirling atmosphere of a planet 40 light-years away from Earth.", "url": "https://www.foxnews.com/science/webb-space-telescope-captures-dust-storm-remote-planet", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/Exoplanet.jpg", "publishedAt": "2023-03-25T17:46:00Z", "content": "Researchers working with data from the James Webb Space Telescope have spotted silicate cloud features in a distant planet's atmosphere. \r\nNASA said that the atmosphere of the \"Tatooine-like world,\" … [+2098 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's Hubble Telescope snaps weather changes on Jupiter and Uranus - HT Tech", "description": "NASA’s Hubble Telescope is helping to observe the drastic weather changes on Jupiter and Uranus. Read on to know what NASA said.", "url": "https://tech.hindustantimes.com/tech/news/nasas-hubble-telescope-snaps-weather-changes-on-jupiter-and-uranus-71679759895572.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/hubble_jupiter_stsci-01gv3fd0axt0pybrbc16c7f6zv_1679760240854_1679760263517_1679760263517.png", "publishedAt": "2023-03-25T16:05:13Z", "content": "Since the launch of NASA's Hubble Space Telescope way back in 1990, it has been actively tracing the evolution and formation of galaxies, black holes, dark matter, and much more. Apart from these, th… [+2169 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Have scientists figured out how to make working wormholes? - Syfy", "description": "Theoretical physicist propose \"counterportation\" using local wormholes to send information or objects across space.", "url": "https://www.syfy.com/syfy-wire/have-scientists-figured-out-how-to-make-working-wormholes", "urlToImage": "https://www.syfy.com/sites/syfy/files/2023/01/gal.jpg", "publishedAt": "2023-03-25T15:30:02Z", "content": "The universe is plenty weird already. You dont have to look far to find incredible star-forming nebulae, ravenous supermassive black holes, and worlds of every imaginable size and type. It seems like… [+8908 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "How to watch Ceres, a dwarf planet 14 times smaller than Pluto, photobomb a spiral galaxy this weekend - Space.com", "description": "Watch live online as the dwarf planet Ceres swoops in front of the 'grand design' spiral galaxy Messier 100 this weekend.", "url": "https://www.space.com/https://www.livescience.com/how-to-watch-ceres-a-dwarf-planet-14-times-smaller-than-pluto-photobomb-a-spiral-galaxy-in-the-sky-this-weekend", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fC8mHvNzzjBz8fiGdqCqsJ-1200-80.jpg", "publishedAt": "2023-03-25T14:00:23Z", "content": "This weekend, you can watch live as the first asteroid ever discovered passes across one of the night sky's most beautiful spiral galaxies.\r\nThe Rome-based Virtual Telescope Project (opens in new tab… [+2387 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "NASA hopes to clean up space junk; experts say the days of uncluttered night skies are \"over\" - Salon", "description": "High-powered lasers and special robots that collect junk are among the proposals for cleaning up orbital debri", "url": "https://www.salon.com/2023/03/25/nasa-hopes-to-clean-up-space-junk-experts-say-the-days-of-uncluttered-night-skies-are-over/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/11/space-trash-garbage-debris-1123211.jpg", "publishedAt": "2023-03-25T14:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "RNA base in asteroid samples suggests origins of life on Earth: Study - Phys.org", "description": "The black particles from an asteroid some 300 million kilometers away look unremarkable, like pieces of charcoal, but they hold a component of life itself.", "url": "https://phys.org/news/2023-03-rna-base-asteroid-samples-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-black-particles-fr.jpg", "publishedAt": "2023-03-25T13:30:01Z", "content": "The black particles from an asteroid some 300 million kilometers away look unremarkable, like pieces of charcoal, but they hold a component of life itself.\r\nScientists have discovered the chemical co… [+3830 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Scott Sutherland", "title": "NASA has its first detailed map of water on the Moon - Yahoo! Voices", "description": "The future of lunar and space exploration depends on finding water, and now NASA knows exactly where to look.", "url": "https://ca.news.yahoo.com/nasa-first-detailed-map-water-130005411.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7iR5ChGZoZGzDLUjmtJeUQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_weather_network_616/58371be811266a4a3e1dc4c33a93d428", "publishedAt": "2023-03-25T13:00:05Z", "content": "On one of its final flights, a unique NASA telescope just provided a key discovery that may secure the future of lunar and space exploration.\r\nIn February 2022, astronomers used NASA's now-retired SO… [+3254 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Breakthrough: A New Understanding of Quantum Turbulence - SciTechDaily", "description": "A group of researchers has demonstrated the dissipation of energy in quantum turbulence, providing insights into turbulence across various scales, ranging from microscopic to planetary. Lancaster University's Dr. Samuli Autti collaborated with Aalto Universit…", "url": "https://scitechdaily.com/quantum-breakthrough-a-new-understanding-of-quantum-turbulence/", "urlToImage": "https://scitechdaily.com/images/Gold-Cryostat.jpg", "publishedAt": "2023-03-25T11:31:47Z", "content": "ByLancaster UniversityMarch 25, 2023\r\nThe researchers used a unique rotating cryostat in their study. Credit: Mikko Raskinen/Aalto University\r\nA group of researchers has demonstrated the dissipation … [+3850 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Angeli Gabriel", "title": "Here's why scientists are worried about newly discovered underwater heat waves - Yahoo News", "description": "A recent study found that extreme warming along the seafloor of the continental shelf can have significant biological and economic outcomes.", "url": "https://news.yahoo.com/heres-why-scientists-worried-newly-110012363.html", "urlToImage": "https://media.zenfs.com/en/fox_weather_articles_483/6a4028373b488a79b014bd4be82e4d8b", "publishedAt": "2023-03-25T11:00:12Z", "content": "In a recent study, researchers discovered extreme warming along the seafloor of the North American continental shelves.\r\nContinental shelves form the edge of the continent. They extend up to 300 mile… [+2371 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Mystery of interstellar comet 'Oumuamua has been solved, scientists say - Mashable", "description": "Astronomers found it in 2017. It's speeding up.", "url": "https://mashable.com/article/interstellar-comet-oumuamua", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01FlB7Fb2taUBPIm1PFk7dZ/hero-image.fill.size_1200x675.v1679676132.jpg", "publishedAt": "2023-03-25T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Genome-wide analysis of a collective grave from Mentesh Tepe provides insight into the population structure of early neolithic population in the South Caucasus | Communications Biology - Nature.com", "description": "Genomic analysis of three Neolithic individuals from Mentesh Tepe in Azerbaijan belonging to the beginnings of the Shomu-Shulaveri culture provides insight into the origin and population structure of the Shomu-Shulaveri community.", "url": "https://www.nature.com/articles/s42003-023-04681-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs42003-023-04681-w/MediaObjects/42003_2023_4681_Fig1_HTML.png", "publishedAt": "2023-03-25T06:42:54Z", "content": "Archaeological sampling\r\nWe obtained ethical authorisation from the Institute of Archaeology and Ethnography of Azerbaijan to study samples from Mentesh Tepe. Extraction was attempted on the 30 sampl… [+12663 chars]"}]}