{"status": "ok", "totalResults": 41, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Chemists Have Synthesized an Ocean-Based Molecule That Could Fight Parkinson's - SciTechDaily", "description": "The team utilized a technique that they believe could speed up the drug discovery process in the production of lissodendoric acid A. Organic chemists at the University of California, Los Angeles (UCLA) have synthesized the first artificial form of a molecule …", "url": "https://scitechdaily.com/chemists-have-synthesized-an-ocean-based-molecule-that-could-fight-parkinsons/", "urlToImage": "https://scitechdaily.com/images/Parkinsons-Disease-Nerve-Cells.jpg", "publishedAt": "2023-02-21T03:56:38Z", "content": "ByUniversity of California - Los AngelesFebruary 20, 2023\r\nParkinsons disease is a progressive neurological disorder that affects movement and mobility. It is caused by the degeneration of dopamine-p… [+5905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "NASA is mapping duststorms from space with this new high-tech device - CNN", "description": "Exacerbated by heatwaves and drought, dust storms are increasing around the globe -- but researchers have limited data on their impact on climate change. NASA hopes its new spaceborne instrument, fixed to the International Space Station, will change that by p…", "url": "https://www.cnn.com/2023/02/20/world/nasa-sandstorms-space-emit-hnk-spc-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230215142452-03-transformers-nasa-emit-dust.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-21T01:42:00Z", "content": "In the Mediterranean, its called Sirocco, and in the Canary Islands, La Calima, while it goes by Harmattan in West Africa, and Haboob in Sudan. But these varied names all describe the same thing: dus… [+5814 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Jupiter's Largest Moons All Have Aurorae That Glow Deep Red And 15x Brighter Than Ours - ScienceAlert", "description": "Jupiter is well known for its spectacular aurorae, thanks in no small part to the Juno orbiter and recent images taken by the James Webb Space Telescope (JWST).", "url": "https://www.sciencealert.com/jupiters-largest-moons-all-have-aurorae-that-glow-deep-red-and-15x-brighter-than-ours", "urlToImage": "https://www.sciencealert.com/images/2023/02/GalileanSatellitesRedColourOnDarkBackground.jpg", "publishedAt": "2023-02-21T00:50:38Z", "content": "Jupiter is well known for its spectacular aurorae, thanks in no small part to the Juno orbiter and recent images taken by the James Webb Space Telescope (JWST). Like Earth, these dazzling displays re… [+6016 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "New type of salty ice may exist on extraterrestrial ocean moons - CNN", "description": "The mysterious red streaks crisscrossing the surface of Jupiter's moon Europa may be the result of a newly discovered kind of salty ice. Scientists created the solid crystals in a lab experiment.", "url": "https://www.cnn.com/2023/02/20/world/salty-ice-europa-ocean-moons-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230220142237-01-europa-moon.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-20T22:06:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe mysterious red streaks crisscrossing the surface o… [+4745 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: Warm Water Is Melting Weak Spots in Huge Antarctica Glacier - VOA Learning English", "description": "Scientists say warm water is melting weak spots in Antarctica’s huge Thwaites Glacier. For the first time, scientists traveled to a place in Antarctica known as the grounding point.", "url": "https://learningenglish.voanews.com/a/study-warm-water-is-melting-weak-spots-in-huge-antarctica-glacier/6967422.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-cd38-08db10f2c6a7_cx0_cy8_cw0_w1200_r1.jpg", "publishedAt": "2023-02-20T21:56:49Z", "content": "In two recent studies, researchers say warm water is melting weak areas on Antarcticas huge Thwaites Glacier.\r\nTwo research papers describing melting recently appeared in the publication Nature. \r\nTh… [+3394 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "South Korea debuts first search for DFSZ axion dark matter - Phys.org", "description": "A South Korean research team at the Center for Axion and Precision Physics Research (CAPP) within the Institute for Basic Science (IBS) recently announced the most advanced experimental setup to search for axions. The group has successfully taken its first st…", "url": "https://phys.org/news/2023-02-south-korea-debuts-dfsz-axion.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/south-korea-debuts-fir.jpg", "publishedAt": "2023-02-20T21:00:17Z", "content": "A South Korean research team at the Center for Axion and Precision Physics Research (CAPP) within the Institute for Basic Science (IBS) recently announced the most advanced experimental setup to sear… [+6436 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Bryan Cockfield", "title": "Automating The Most Analog Of HVAC Equipment - Hackaday", "description": "Burning wood, while not a perfect heating solution, has a number of advantages over more modern heating appliances. It’s a renewable resource, doesn’t add carbon to the atmosphere over …", "url": "https://hackaday.com/2023/02/20/automating-the-most-analog-of-hvac-equipment/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/02/wood-stove-main.png", "publishedAt": "2023-02-20T21:00:00Z", "content": "Burning wood, while not a perfect heating solution, has a number of advantages over more modern heating appliances. It’s a renewable resource, doesn’t add carbon to the atmosphere over geologic time … [+1436 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "The Hubble Space Telescope spots three galaxies about to collide - Space.com", "description": "The three galaxies in the constellation Boötes are on a collision course and will eventually merge into a single huge bright galaxy.", "url": "https://www.space.com/hubble-spots-three-galaxies-about-to-collide", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DgxGibT2pFfMMvmfwpVtsQ-1200-80.jpg", "publishedAt": "2023-02-20T19:00:29Z", "content": "A stunning new image from the Hubble Space Telescope shows three galaxies heading for a collision and merger. While galactic collisions are fairly common, this one is rare because each of the trio of… [+2674 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Record-Setting Dinosaur Footprint: 'Couldn't Believe What I Was Looking At' - CNET", "description": "The jumbo three-toed dino might have been squatting down when it left the print in Yorkshire.", "url": "https://www.cnet.com/science/biology/record-setting-dinosaur-footprint-found-couldnt-believe-what-i-was-looking-at/", "urlToImage": "https://www.cnet.com/a/img/resize/1eac0fed53e94e9986b78bb4e99837810d23eb75/hub/2023/02/16/9b2bcd80-c3ad-4487-9bc4-567da7d21691/footprintmakercjamesmckay.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-02-20T18:36:00Z", "content": "A single footprint can tell a whole story. During the Jurassic era, around 166 million years ago, a jumbo meat-eating dinosaur strolled across what is now modern-day Yorkshire in England. At one poin… [+1833 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "China silent on fate of Zhurong Mars rover on 2nd anniversary of Tianwen 1 mission - Space.com", "description": "Tianwen 1, China's first interplanetary mission, marked its second anniversary in orbit around Mars on Feb. 10, but there was no update on the status of the mission's Zhurong rover.", "url": "https://www.space.com/china-silent-zhurong-mars-rover-tianwen-1", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ufyzBMmvB3FbQKZSZwLX5R-1200-80.jpg", "publishedAt": "2023-02-20T18:26:06Z", "content": "China's first interplanetary mission marked its second anniversary in orbit around Mars on Feb. 10, but there was no update on the status of the mission's rover.\r\nThe Tianwen 1 mission's Zhurong rove… [+3174 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rebecca Sohn", "title": "Telomeres: What are they, and how do they impact aging? - Livescience.com", "description": "Telomeres are sections of DNA that are found at the ends of chromosomes and seem to play a role in aging.", "url": "https://www.livescience.com/telomeres-aging-and-cancer", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4aSzTsCkFGNQSCoqKzxbnD-1200-80.jpg", "publishedAt": "2023-02-20T18:00:12Z", "content": "Telomeres are the \"caps\" that protect the ends of DNA strands from being destroyed by a cell. They are made up of areas of repeated DNA sequences combined with specific proteins at the ends of chromo… [+7147 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Marietta Fuhrmann-Koch", "title": "Unknown class of water-rich asteroids identified - Phys.org", "description": "New astronomical measurements in the infrared range have led to the identification of a heretofore unknown class of asteroids. An international research team including geoscientists from Heidelberg University has succeeded in characterizing these small planet…", "url": "https://phys.org/news/2023-02-unknown-class-water-rich-asteroids.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/unknown-class-of-water.jpg", "publishedAt": "2023-02-20T17:45:08Z", "content": "New astronomical measurements in the infrared range have led to the identification of a heretofore unknown class of asteroids. An international research team including geoscientists from Heidelberg U… [+4013 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Asteroid targeted by NASA's Lucy spacecraft gets a marvelous name - Space.com", "description": "Meet \"Dinkinesh\" the tiny main belt asteroid that will be visited by the Lucy spacecraft in November this year.", "url": "https://www.space.com/lucy-first-target-asteroid-gets-a-name", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tiRappMQZCn5CSyzS46Xb9-1200-80.jpg", "publishedAt": "2023-02-20T17:16:46Z", "content": "The first asteroid to be visited by NASA's space rock-hopping craft Lucy has finally been given a name. The tiny asteroid in the main asteroid belt located between Mars and Jupiter has received the m… [+3965 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Adrian Beil", "title": "ESA's David Parker updates status of Orion service modules and European astronauts for Artemis - NASASpaceFlight.com - NASASpaceflight.com", "description": "Airbus and ESA invited media for the Moon Media Day to show and talk about…", "url": "https://www.nasaspaceflight.com/2023/02/esas-david-parker/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/02/Orion-ESM-3-integration-cleanroom-bremen-1-CAirbus.jpg", "publishedAt": "2023-02-20T16:54:50Z", "content": "Airbus and ESA invited media for the Moon Media Day to show and talk about the three Orion European Service Modules currently being produced at Airbus Space and Defence in Bremen. During the event, N… [+7751 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Physicists make most precise measurement yet of magnetic moment of an electron - Phys.org", "description": "A combined team of physicists from Harvard University and Northwestern University has found the most precise value yet for the magnetic moment of an electron. In their paper published in the journal Physical Review Letters, the group describes the methods the…", "url": "https://phys.org/news/2023-02-physicists-precise-magnetic-moment-electron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/physicists-make-most-p.jpg", "publishedAt": "2023-02-20T16:20:01Z", "content": "A combined team of physicists from Harvard University and Northwestern University has found the most precise value yet for the magnetic moment of an electron. In their paper published in the journal … [+2599 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ayesha Gulzar", "title": "Scientists engineered a wood that gets stronger as it captures CO2 - Interesting Engineering", "description": "Scientists have developed a special wood that's stronger than its natural counterpart and helps reduce carbon emissions by capturing CO2 from the air.", "url": "https://interestingengineering.com/innovation/engineered-wood-captures-co2", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/02/20/image/jpeg/6cAmGHLxWdvLu7q8JrDAH2bC6cWoLU6SIcbfsymd.jpg", "publishedAt": "2023-02-20T15:25:00Z", "content": "In the absence of environmentally friendly and sustainable materials for CO2-capturing, the novel enhanced wood structure can be used as a flexible support to deploy CO2-capturing materials in variou… [+1864 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "'One-in-10-billion' binary star system is discovered - Daily Mail", "description": "The unusual star grouping, known as CPD-29 2176, is located about 11,400 light-years from Earth and was first identified by the US space agency's Neil Gehrels Swift Observatory, launched to space in 2004.", "url": "https://www.dailymail.co.uk/sciencetech/article-11771931/One-10-billion-binary-star-discovered.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/20/13/67880405-0-image-a-22_1676901047709.jpg", "publishedAt": "2023-02-20T15:17:40Z", "content": "Astronomers have discovered a 'phenomenally rare' star system that could one day trigger an enormously powerful explosion that showers space with gold.\r\nThe 'one-in-10-billion' system is so scarce th… [+6488 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Dozens of variable stars detected in the open cluster NGC 6611 - Phys.org", "description": "Using three ground-based telescopes in Chile, astronomers have conducted a search for variable stars in the open cluster NGC 6611. In result, they detected 95 variables and the majority of them are most likely cluster members. The discovery was published Febr…", "url": "https://phys.org/news/2023-02-dozens-variable-stars-cluster-ngc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/dozens-of-variable-sta.jpg", "publishedAt": "2023-02-20T15:10:06Z", "content": "Using three ground-based telescopes in Chile, astronomers have conducted a search for variable stars in the open cluster NGC 6611. In result, they detected 95 variables and the majority of them are m… [+3406 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Researchers discover a potential supermassive black hole wandering through space - TechSpot", "description": "By observing an unexpected trail in the gas cloud surrounding a dwarf galaxy, an international team of researchers has now found what they consider a potential candidate...", "url": "https://www.techspot.com/news/97662-researchers-discover-potential-supermassive-black-hole-wandering-through.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/02/2023-02-20-image.jpg", "publishedAt": "2023-02-20T14:42:00Z", "content": "Why it matters: Supermassive black holes (SMBH) are some of the most extreme phenomena populating the universe. They usually reside at the center of their host galaxies, but sometimes they can be eje… [+2302 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Very Large Telescope photographs its lightest ever exoplanet - Space.com", "description": "Taking direct images of exoplanets is notoriously difficult.", "url": "https://www.space.com/very-large-telescope-photographs-lightest-ever-exoplanet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sABKnVwEjqEh9Kkjoqi4EF-1200-80.jpg", "publishedAt": "2023-02-20T14:25:00Z", "content": "The Very Large Telescope in Chile took images of its lightest exoplanet yet after data from two European sky-mapping missions indicated something was tugging at the orbit of a distant young star. \r\nT… [+3586 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Mercury's black disc helps sharpen Solar Orbiter's view - European Space Agency", "description": "This year started with a nice imaging opportunity for Solar Orbiter, and a chance to further improve the quality of its data. On 3 January 2023, inner planet Mercury crossed the spacecraft’s field of view, resulting in a transit where Mercury appeared as a pe…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Solar_Orbiter/Mercury_s_black_disc_helps_sharpen_Solar_Orbiter_s_view", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2023/02/mercury_transit_seen_by_solar_orbiter/24717213-1-eng-GB/Mercury_transit_seen_by_Solar_Orbiter_pillars.jpg", "publishedAt": "2023-02-20T14:21:40Z", "content": "Science &amp; Exploration20/02/2023233 views8 likes\r\nThis year started with a nice imaging opportunity for Solar Orbiter, and a chance to further improve the quality of its data. On 3 January 2023, i… [+3643 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Ramin Skibba", "title": "A Tiny Sun in a Jar Sheds Light on Solar Flare Research - WIRED", "description": "This new lab experiment explores the physics involved in our star’s tumultuous interior regions—by creating a sphere of plasma.", "url": "https://www.wired.com/story/solar-flare-research-sun-jar/", "urlToImage": "https://media.wired.com/photos/63ee50e8dcab861f7a4746f8/191:100/w_1280,c_limit/SOLARFLARES_SCIENCE_Top_Side.jpg", "publishedAt": "2023-02-20T12:00:00Z", "content": "Seth Putterman started out studying the behavior of plasma for national security reasons. Extremely fast hypersonic missiles heat and ionize the surrounding air and form a cloud of charged particles … [+3747 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Event Horizon Telescope spies a black hole powering a super bright monster object - Space.com", "description": "Quasars are super bright structures at the center of some galaxies.", "url": "https://www.space.com/event-horizon-telescope-sees-black-hole-quasar", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XamrpKwTFenVLHdae4rNmk-1200-80.jpg", "publishedAt": "2023-02-20T11:00:00Z", "content": "Astronomers using the Event Horizon Telescope have imaged a quasar at the heart of a distant galaxy that blasts out huge amounts of radiation powered by a feeding supermassive black hole. \r\nThese ext… [+4405 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble telescope captures dazzling stellar duo in Orion Nebula (photo) - Space.com", "description": "A bright variable star known as V 372 Orionis and its companion shine bright in a new Hubble Space Telescope image of the star-forming Orion Nebula.", "url": "https://www.space.com/dazzling-stellar-duo-orion-nebula-hubble-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jRuGSnvEDTor2P9s7PkMkE-1200-80.jpg", "publishedAt": "2023-02-20T11:00:00Z", "content": "The Hubble Space Telescope captured a photo of two young stars surrounded by thick clouds of dust in the Orion Nebula. (Image credit: ESA/Hubble &amp; NASA, J. Bally, M. Robberto)\r\nThe Hubble Space T… [+2305 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“The Sparkler” – Astronomers Discover Distant Galaxy That Mirrors the Early Milky Way - SciTechDaily", "description": "A galaxy has been discovered that mirrors the very early version of our home galaxy, the Milky Way. The galaxy, dubbed ‘The Sparkler’, is embedded in a system of globular clusters and satellite galaxies, and appears to be swallowing them as it grows. The rese…", "url": "https://scitechdaily.com/the-sparkler-astronomers-discover-distant-galaxy-that-mirrors-the-early-milky-way/", "urlToImage": "https://scitechdaily.com/images/Early-Milky-Way-Galaxy-scaled.jpg", "publishedAt": "2023-02-20T10:05:47Z", "content": "ByRoyal Astronomical SocietyFebruary 20, 2023\r\nThis image shows an artists impression of our Milky Way galaxy in its youth. Five small satellite galaxies, of various types and sizes, are in the proce… [+4075 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Elizabeth Rayne", "title": "Can you see Earth spin? - Livescience.com", "description": "You can't watch Earth spin in real time because it rotates so slowly, but there are ways to see the effects of the planet's rotation.", "url": "https://www.livescience.com/can-you-watch-earth-spin", "urlToImage": "https://cdn.mos.cms.futurecdn.net/f6Wiu3jZNoZpCziidy5yZg-1200-80.jpg", "publishedAt": "2023-02-20T10:00:00Z", "content": "We can \"see\" Earth's rotation by watching the progress of the stars across the night sky. (Image credit: shunli zhao via Getty Images)\r\nIf Earth didn't spin, there would be no sunrise and sunset, and… [+3915 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Watch: The scale of the entire Universe versus JWST's views - Big Think", "description": "The glorious sights that JWST keeps revealing are less than a millionth of the whole Universe. Just imagine what else is out there.", "url": "https://bigthink.com/starts-with-a-bang/jwst-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/09/NIRcam-view.jpg?resize=1200,630", "publishedAt": "2023-02-20T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "There Could Be Upward-Moving Silicon-Rich 'Snow' in Earth's Outer Core - ScienceAlert", "description": "By listening to the echo of earthquakes bouncing about inside our planet, we can make a good guess at what's inside Earth without slicing it up.", "url": "https://www.sciencealert.com/there-could-be-upward-moving-silicon-rich-snow-in-earths-outer-core", "urlToImage": "https://www.sciencealert.com/images/2023/02/OpenEarth.jpg", "publishedAt": "2023-02-20T06:02:32Z", "content": "By listening to the echo of earthquakes bouncing about inside our planet, we can make a good guess at what's inside Earth without slicing it up. Unfortunately seismic waves often have inconsistencies… [+2993 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Starwatch: Jupiter and Venus meet for spectacular conjunction - The Guardian", "description": "Two of the brightest planets will be visible on western horizon – if weather cooperates", "url": "https://www.theguardian.com/science/2023/feb/20/starwatch-jupiter-and-venus-meet-for-spectacular-conjunction", "urlToImage": "https://i.guim.co.uk/img/media/2d197cc07a6bd9c558f334a1ae024488a8f8452a/40_47_572_343/master/572.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a5fd445b32fabf2d63b244b5d9fee5fc", "publishedAt": "2023-02-20T06:00:00Z", "content": "chart\r\nIf the weather cooperates and you can find a clear western horizon, this week will treat you to a spectacular evening conjunction.\r\nThe two brightest planets, Jupiter and Venus, will meet in t… [+912 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Katie Spalding", "title": "We Might Finally Know Why Curly Hair Exists - IFLScience", "description": "Naturally curly hair is an almost uniquely human trait. Now we might know why.", "url": "https://www.iflscience.com/we-might-finally-know-why-curly-hair-exists-67605", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67605/aImg/65842/hair-meta.png", "publishedAt": "2023-02-20T03:21:00Z", "content": "Humans are a bit weird, all things considered. Were bipedal, which is already pretty strange; our brains and heads are outsized to a degree that literally causes us pain; and to top it all off, we do… [+5569 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Unexpected Footage Shows Possums Feasting on Kangaroos in The Australian Alps - ScienceAlert", "description": "Vultures, hyenas, and Tasmanian devils are highly efficient scavengers, able to locate and consume carrion rapidly, including the meat and bones.", "url": "https://www.sciencealert.com/unexpected-footage-shows-possums-feasting-on-kangaroos-in-the-australian-alps", "urlToImage": "https://www.sciencealert.com/images/2023/02/PossumFeast.jpg", "publishedAt": "2023-02-20T00:20:45Z", "content": "Vultures, hyenas, and Tasmanian devils are highly efficient scavengers, able to locate and consume carrion rapidly, including the meat and bones.\r\nWhen we think of scavengers, these large carnivores … [+6335 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Angela Giuffrida", "title": "Fragments of ‘Valentine’s fireball’ meteorite fall in southern Italy - The Guardian", "description": "Object hit balcony in Matera and remnants in pristine condition – ‘almost as if we collected it directly from space’, says expert", "url": "https://www.theguardian.com/science/2023/feb/19/fragments-of-valentines-fireball-meteorite-fall-in-southern-italy", "urlToImage": "https://i.guim.co.uk/img/media/65e26cfd2440bfe4f331e163a2cde1b20e8bc5de/0_337_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=412dc31daacd9d2d031f53311c2cc628", "publishedAt": "2023-02-19T21:19:00Z", "content": "Residents of southern Italys picturesque and ancient city of stone have been gripped by another rocky phenomenon after a meteorite crash-landed on the balcony of a home in Materas suburbs.\r\nThe space… [+2370 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Ben Thompson", "title": "New Galaxy Seen By Telescope Looks Like Hell - UNILAD", "description": "New Telescope Images Show A Distant Galaxy That Looks Like Hell", "url": "https://www.unilad.com/technology/james-webb-telescope-shows-new-galaxy-712181-20230219", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&dpr=1&url=https://eu-images.contentstack.com/v3/assets/blt949ea8e16e463049/blt7af2d62ef2583053/63f2512be3898674c7f748df/Telescope.jpg", "publishedAt": "2023-02-19T17:00:06Z", "content": "New images from the James Webb telescope have shown a galaxy in amazing clarity - giving people a look at something that resembles none other than Hell. \r\nThe fiery images were seen by the James Webb… [+2702 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Dominique Mosbergen", "title": "Drilling Deeper Into Ocean Floor in Search for Origins of Life - The Wall Street Journal", "description": "Decadeslong effort has transformed knowledge of planet’s history", "url": "https://www.wsj.com/articles/drilling-deeper-into-ocean-floor-in-search-for-origins-of-life-fadfcab2", "urlToImage": "https://images.wsj.net/im-726727/social", "publishedAt": "2023-02-19T16:38:00Z", "content": null}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Are arctic squirrels the secret to astronaut stasis pods? - Yahoo! Voices", "description": "In Dean Devlin’s new SYFY thriller, The Ark (now streaming on Peacock!), a crew of explorers is sent on an ark ship headed for a planet around Alpha Centauri...", "url": "https://www.syfy.com/syfy-wire/are-arctic-squirrels-the-secret-to-astronaut-stasis-pods", "urlToImage": "https://media.zenfs.com/en/syfy_655/9da23c908515420db71f38d20113198e", "publishedAt": "2023-02-19T16:00:02Z", "content": "In Dean Devlins new SYFY thriller, The Ark (now streaming on Peacock!), a crew of explorers is sent on an ark ship headed for a planet around Alpha Centauri b, 4.2 light years away. Its the kind of m… [+4071 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "New study discovers how to reverse hearing loss - Freethink", "description": "A new study of hair cell regeneration in mice could help researchers figure out how to reverse hearing loss in people.", "url": "https://www.freethink.com/health/hair-cells", "urlToImage": "https://www.freethink.com/wp-content/uploads/2023/02/hair-cells_Web.jpg?resize=1200,630", "publishedAt": "2023-02-19T16:00:00Z", "content": null}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "Logan lab studies impact of solar flares on satellites - KSL.com", "description": "Your credit card stops working, then your radio kicks out. What's happening? It could be a solar flare causing glitches in a satellite. That's why the Space Dynamics Lab at Utah State University in Logan is investigating.", "url": "https://www.ksl.com/article/50582088/logan-lab-studies-impact-of-solar-flares-on-satellites", "urlToImage": "https://img.ksl.com/slc/2492/249200/24920032.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-02-19T15:23:21Z", "content": "Estimated read time: 1-2\r\n minutes\r\nLOGAN Your credit card stops working, then your radio kicks out. What's happening?\r\nIt could be a solar flare causing glitches in a satellite. That's why employees… [+1453 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ellie Broadman, Darrell Kaufman", "title": "Was Earth already heating up, or did global warming reverse a long-term cooling trend? - Phys.org", "description": "Over the past century, the Earth's average temperature has swiftly increased by about 1 degree Celsius (1.8 degrees Fahrenheit). The evidence is hard to dispute. It comes from thermometers and other sensors around the world.", "url": "https://phys.org/news/2023-02-earth-global-reverse-long-term-cooling.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/was-earth-already-heat.jpg", "publishedAt": "2023-02-19T14:50:01Z", "content": "Over the past century, the Earth's average temperature has swiftly increased by about 1 degree Celsius (1.8 degrees Fahrenheit). The evidence is hard to dispute. It comes from thermometers and other … [+6126 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Maggie Harrison", "title": "NASA Scientist Calls for Exploration of Uranus - Futurism", "description": "The proposed NASA probe would \"explore how Uranus formed; how much it migrated after formation; the planet's interior structure,\" and much more.", "url": "https://futurism.com/the-byte/nasa-scientist-exploration-uranus", "urlToImage": "https://wp-assets.futurism.com/2023/02/uranus-1.jpg", "publishedAt": "2023-02-19T14:10:47Z", "content": "Exciting news, folks.\r\nGas Giant\r\nIn a new paper, a NASA scientist is calling on the agency to build and launch a new exploratory probe one designed, to the delight of us all, to investigate the \"mys… [+2336 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Physicists Make Nanoscopic Breakthrough of Colossal Significance - SciTechDaily", "description": "In a new breakthrough, researchers at the University of Copenhagen, in collaboration with Ruhr University Bochum, have solved a problem that has caused quantum researchers headaches for years. The researchers can now control two quantum light sources rather t…", "url": "https://scitechdaily.com/quantum-physicists-make-nanoscopic-breakthrough-of-colossal-significance/", "urlToImage": "https://scitechdaily.com/images/Two-Entangled-Quantum-Light-Sources.jpg", "publishedAt": "2023-02-19T14:07:19Z", "content": "Illustration of two a chip comprising two entangled quantum light sources. Credit: Peter Lodahl\r\nIn a new breakthrough, researchers at the University of Copenhagen, in collaboration with Ruhr Univers… [+5215 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "The 6 most dangerous types of space debris - Space.com", "description": "Cold War-era stuff dominates the list of hazardous orbiting objects.", "url": "https://www.space.com/most-dangerous-types-space-junk", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BixTkFdS9om9qAkv6Cej3n-1200-80.jpg", "publishedAt": "2023-02-19T13:00:25Z", "content": "The space around our planet is getting cluttered. Thousands of satellites and millions of out-of-control fragments of space debris hurtle high above our heads, threatening to collide. Here are the ob… [+13159 chars]"}]}