{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Mysterious Giants Could Be a Whole New Kind of Life That No Longer Exists - ScienceAlert", "description": "Ever since their discovery more than 165 years ago, massive fossilized structures left by an organism known as Prototaxites have proven impossible to categorize.", "url": "https://www.sciencealert.com/mysterious-giants-could-be-a-whole-new-kind-of-life-that-no-longer-exists", "urlToImage": "https://www.sciencealert.com/images/2026/01/prototaxites_header.jpg", "publishedAt": "2026-01-22T03:05:07Z", "content": "Ever since their discovery more than 165 years ago, massive fossilized structures left by an organism known as Prototaxiteshave proven impossible to categorize.\r\nResearchers in the UK have suggested … [+4044 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "'We can handle any kind of difficult situation': Crew-11 astronauts say 1st medical evacuation from ISS had a silver lining - Space", "description": "\"This is actually a very, very good experience for the future of human spaceflight.\"", "url": "https://www.space.com/space-exploration/human-spaceflight/we-can-handle-any-kind-of-difficult-situation-crew-11-astronauts-say-1st-medical-evacuation-from-iss-had-a-silver-lining", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wrngQTAGeQeVQm4kMUkgPA-1920-80.jpg", "publishedAt": "2026-01-21T23:00:00Z", "content": "The astronauts of NASA's most recent mission to the International Space Station (ISS) sat down today (Jan. 21) to discuss their time in orbit, as well as their untimely departure.\r\nNASA astronauts Ze… [+3441 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Erika Peters", "title": "NASA’s Artemis II Mission to Fly Legacy Keepsakes with Astronaut Crew - NASA (.gov)", "description": "As America approaches its 250th anniversary of declaring independence, NASA’s Artemis II mission will carry a host of mementos that reflect the nation’s long", "url": "https://www.nasa.gov/missions/artemis/artemis-2/nasas-artemis-ii-mission-to-fly-legacy-keepsakes-with-astronaut-crew/", "urlToImage": "https://images-assets.nasa.gov/image/KSC-01172026-Artemis%20II_Rollout-26/KSC-01172026-Artemis%20II_Rollout-26~large.jpg", "publishedAt": "2026-01-21T22:48:06Z", "content": "As America approaches its 250th anniversary of declaring independence, NASAs Artemis II mission will carry a host of mementos that reflect the nations long tradition of exploration, innovation, and l… [+4731 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Association of Universities for Research in Astronomy", "title": "Massive cloud with metallic winds discovered orbiting mystery object - Phys.org", "description": "Sweeping winds of vaporized metals have been found in a massive cloud that dimmed the light of a star for nearly nine months. This discovery, made with the Gemini South telescope in Chile, one half of the International Gemini Observatory, offers a rare glimps…", "url": "https://phys.org/news/2026-01-massive-cloud-metallic-orbiting-mystery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/massive-cloud-with-met.jpg", "publishedAt": "2026-01-21T22:17:40Z", "content": "Sweeping winds of vaporized metals have been found in a massive cloud that dimmed the light of a star for nearly nine months. This discovery, made with the Gemini South telescope in Chile, one half o… [+6111 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Eye of God' nebula looks like a cosmic lava lamp in new James Webb Space Telescope image - Space", "description": "It may be one of the most iconic sights in the night sky, but astronomers have never seen the Helix Nebula like this before.", "url": "https://www.space.com/astronomy/galaxies/eye-of-god-nebula-looks-like-a-cosmic-lava-lamp-in-new-james-webb-space-telescope-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/REAc6kaQz2BMkTpLBo8vja-1600-80.png", "publishedAt": "2026-01-21T22:00:00Z", "content": "Astronomers have been given a new and incredibly detailed look at a very familiar astronomical object thanks to the James Webb Space Telescope (JWST). The new JWST image shows the Helix Nebula, the r… [+3123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": "Andy Tomaswick, Universe Today", "title": "2.8 Days to Disaster: Low Earth Orbit Could Collapse Without Warning - SciTechDaily", "description": "A new analysis suggests modern satellite networks could suffer catastrophic collisions within days of losing control during a major solar storm. The phrase “House of Cards” is often associated today with a Netflix political drama, but its original meaning ref…", "url": "https://scitechdaily.com/?p=507155", "urlToImage": "https://scitechdaily.com/images/Space-Junk-Debris-Shattered-Pieces-Satellites-Rockets-Spaceships.jpg", "publishedAt": "2026-01-21T21:38:32Z", "content": "Satellite mega-constellations operate in an increasingly unstable orbital environment, with constant close encounters requiring precise control. New research suggests that a strong solar storm could … [+5877 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Santa Fe Institute", "title": "Are your memories illusions? New study disentangles the Boltzmann brain paradox - Phys.org", "description": "In a recent paper, SFI Professor David Wolpert, SFI Fractal Faculty member Carlo Rovelli, and physicist Jordan Scharnhorst examine a longstanding, paradoxical thought experiment in statistical physics and cosmology known as the \"Boltzmann brain\" hypothesis—th…", "url": "https://phys.org/news/2026-01-memories-illusions-disentangles-boltzmann-brain.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/disentangling-the-bolt.jpg", "publishedAt": "2026-01-21T20:10:01Z", "content": "In a recent paper, SFI Professor David Wolpert, SFI Fractal Faculty member Carlo Rovelli, and physicist Jordan Scharnhorst examine a longstanding, paradoxical thought experiment in statistical physic… [+2820 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Watch a robot swarm \"bloom\" like a garden - Ars Technica", "description": "The Swarm Garden: An array of modular robot agents that adapt to changing conditions for living architecture.", "url": "https://arstechnica.com/science/2026/01/watch-a-robot-swarm-bloom-like-a-garden/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/swarm1-1152x648.jpg", "publishedAt": "2026-01-21T19:47:27Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "2026’s Meteor Showers Could Be the Best in Decades, Here’s When to Watch - The Daily Galaxy", "description": "Don’t put your telescope away just yet. 2026 is bringing a lineup of meteor showers that might be worth losing a little sleep over.", "url": "https://dailygalaxy.com/2026/01/2026-meteor-showers-heres-when-to-watch/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/2026s-Meteor-Showers-Could-Be-the-Best-in-Decades-Heres-When-to-Watch-scaled.jpg", "publishedAt": "2026-01-21T18:50:00Z", "content": "As 2026 gets underway, meteor enthusiasts are already looking beyond the year’s first major shower. The Quadrantids, which peaked earlier this month, were mostly drowned out by a full moon, but the m… [+3184 chars]"}, {"source": {"id": null, "name": "WRAL.com"}, "author": "Tony Rice, NASA Ambassador", "title": "Astronomy Days 2026 postponed - WRAL", "description": "Winter weather has forced the annual 2-day event which draws thousands to the North Carolina Museum of Natural Sciences to be rescheduled to January 31 and February 1.", "url": "https://www.wral.com/news/local/astronomy-days-postponed-jan-2026/", "urlToImage": "https://images.wral.com/0c186558-0ce7-40db-81d7-78a253480302?w=1200&h=630", "publishedAt": "2026-01-21T18:37:49Z", "content": "Astronomy Days at the North Carolina Museum of Natural Sciences in Raleigh, has been postponed to January 31 and February 1 due to the winter storm watch this weekend. \r\nMuseum officials said the dec… [+576 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Warwick", "title": "Unified framework sorts spacetime fluctuations for quantum-gravity experiments - Phys.org", "description": "A team of researchers led by the University of Warwick has developed the first unified framework for detecting \"spacetime fluctuations\"—tiny, random distortions in the fabric of spacetime that appear in many attempts to unite quantum physics and gravity.", "url": "https://phys.org/news/2026-01-framework-spacetime-fluctuations-quantum-gravity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/researchers-publish-gu.jpg", "publishedAt": "2026-01-21T18:22:33Z", "content": "A team of researchers led by the University of Warwick has developed the first unified framework for detecting \"spacetime fluctuations\"tiny, random distortions in the fabric of spacetime that appear … [+4710 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Maynooth University", "title": "Massive black hole mystery unlocked by researchers - Phys.org", "description": "It's one of astronomy's great mysteries: how did black holes get so big, so massive, so quickly. An answer to this cosmic conundrum has now been provided by researchers at Ireland's Maynooth University (MU) and reported today in Nature Astronomy.", "url": "https://phys.org/news/2026-01-massive-black-hole-mystery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/massive-black-hole-mys-1.jpg", "publishedAt": "2026-01-21T18:16:55Z", "content": "It's one of astronomy's great mysteries: how did black holes get so big, so massive, so quickly. An answer to this cosmic conundrum has now been provided by researchers at Ireland's Maynooth Universi… [+3995 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "A Deep Sea Expedition Will Soon Confirm if 'Dark Oxygen' Exists - ScienceAlert", "description": "A team of scientists announced Tuesday they have developed new deep-sea landers specifically to test their contentious discovery that metallic rocks at the bottom of the ocean are producing \"dark oxygen\".", "url": "https://www.sciencealert.com/a-deep-sea-expedition-will-soon-confirm-if-dark-oxygen-exists", "urlToImage": "https://www.sciencealert.com/images/2026/01/DarkBubblesInOceanLitFromAbove.jpg", "publishedAt": "2026-01-21T18:03:11Z", "content": "A team of scientists announced Tuesday they have developed new deep-sea landers specifically to test their contentious discovery that metallic rocks at the bottom of the ocean are producing \"dark oxy… [+3772 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Tomorrow’s “Full Moon” Phase of 3I/ATLAS - Avi Loeb – Medium", "description": "In a new paper that was just accepted for publication yesterday (and posted as a preprint here), I reported with Mauro Barbieri that…", "url": "https://avi-loeb.medium.com/tomorrows-full-moon-phase-of-3i-atlas-1107d089b6d5", "urlToImage": "https://miro.medium.com/v2/resize:fit:725/1*WJkVGvl6v0ehO25J07u50Q.jpeg", "publishedAt": "2026-01-21T17:49:20Z", "content": "(Image credit: Scientific American)\r\nIn a new paper that was just accepted for publication yesterday (and posted as a preprint here), I reported with Mauro Barbieri that tomorrow, January 22, 2026, t… [+6625 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Ageing promotes microglial accumulation of slow-degrading synaptic proteins - Nature", "description": "Newly developed mouse models that enable cell-specific analyses of proteostasis dynamics across the lifespan of the mice reveal key aspects of neuronal proteostasis with ageing.", "url": "https://www.nature.com/articles/s41586-025-09987-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09987-9/MediaObjects/41586_2025_9987_Fig1_HTML.png", "publishedAt": "2026-01-21T16:53:05Z", "content": "Mouse husbandry\r\nMice were housed in standard conditions on a 12-h lightdark cycle and provided with water and standard chow ad libitum. In some experiments, as documented in the main text, mice were… [+71332 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Temporal tissue dynamics from a spatial snapshot - Nature", "description": "One-shot tissue dynamics reconstruction can infer changes in tissue composition over time, from single-time-point spatial proteomics of human cancers.", "url": "https://www.nature.com/articles/s41586-025-09876-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09876-1/MediaObjects/41586_2025_9876_Fig1_HTML.png", "publishedAt": "2026-01-21T16:42:51Z", "content": "The number of cells of a given type in a tissue section can change by division or death, moving in or out of the section (flux) or transdifferentiation40. If we restrict ourselves to modelling cell t… [+26152 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Four camera-type eyes in the earliest vertebrates from the Cambrian Period - Nature", "description": "Early vertebrates, particularly myllokunmingids, possessed four camera-type eyes (a pair of&nbsp;lateral eyes and pineal&nbsp;and parapineal organs), which&nbsp;indicates that these structures functioned in image formation, in&nbsp;support of&nbsp;the hypothe…", "url": "https://www.nature.com/articles/s41586-025-09966-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09966-0/MediaObjects/41586_2025_9966_Fig1_HTML.png", "publishedAt": "2026-01-21T16:23:27Z", "content": "<li>Eakin, R. M. The Third Eye (Univ. of California Press,1973).\r\nBook \r\nGoogle Scholar \r\n</li><li>Lamb, T. D. Evolution of phototransduction, vertebrate photoreceptors and retina. Prog. Retinal Eye … [+8690 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Probing quantum mechanics with nanoparticle matter-wave interferometry - Nature", "description": "Quantum interference of sodium nanoparticles, which can each contain more than 7,000 atoms at masses greater than 170,000 Da, is demonstrated.", "url": "https://www.nature.com/articles/s41586-025-09917-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09917-9/MediaObjects/41586_2025_9917_Fig1_HTML.png", "publishedAt": "2026-01-21T16:13:26Z", "content": "Quantum and classical model\r\nThe theory of TalbotLau interference is best formulated in phase space using the WignerWeyl representation of quantum mechanics42. This framework can account for incohere… [+14479 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Afar fossil shows broad distribution and versatility of Paranthropus - Nature", "description": "With its attribution to Paranthropus, a 2.6-million-year-old partial mandible expands the range of the genus into the Afar region of Ethiopia and adds to our understanding of hominin evolution in eastern Africa.", "url": "https://www.nature.com/articles/s41586-025-09826-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09826-x/MediaObjects/41586_2025_9826_Fig1_HTML.png", "publishedAt": "2026-01-21T16:08:29Z", "content": "<li>Villaseñor, A., Bobe, R. &amp; Behrensmeyer, A. K. Middle Pliocene hominin distribution patterns in Eastern Africa. J. Hum. Evol.147, 102856 (2020).\r\nArticle \r\n PubMed \r\nGoogle Scholar \r\n</li><li… [+13993 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Aarhus University", "title": "Bird retinas function without oxygen—solving a centuries-old biological mystery - Phys.org", "description": "Neural tissue normally dies quickly without oxygen. Yet bird retinas—among the most energy-demanding tissues in the animal kingdom—function permanently without it. This may be relevant in future treatment of stroke patients.", "url": "https://phys.org/news/2026-01-bird-retinas-function-oxygen-centuries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/bird-retinas-function.jpg", "publishedAt": "2026-01-21T16:00:12Z", "content": "Neural tissue normally dies quickly without oxygen. Yet bird retinasamong the most energy-demanding tissues in the animal kingdomfunction permanently without it. This may be relevant in future treatm… [+7285 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "NASA Webb Mission Team", "title": "NASA Webb Finds Young Sun-Like Star Forging, Spewing Common Crystals - NASA Science (.gov)", "description": "Astronomers have long sought evidence to explain why comets at the outskirts of our own solar system contain crystalline silicates, since crystals require", "url": "https://science.nasa.gov/missions/webb/nasa-webb-finds-young-sun-like-star-forging-spewing-common-crystals/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2026/01/STScI-01KESWN3G28KZCQPZ2GHHDKAC3.png", "publishedAt": "2026-01-21T16:00:00Z", "content": "Astronomers have long sought evidence to explain why comets at the outskirts of our own solar system contain crystalline silicates, since crystals require intense heat to form and these dirty snowbal… [+5856 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "How Animals Build a Sense of Direction - Quanta Magazine", "description": "Researchers documented the activity of neurons that shape directional navigation as bats explored a remote island off the coast of Tanzania.", "url": "https://www.quantamagazine.org/how-animals-build-a-sense-of-direction-20260121/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2026/01/Internal-Compass-cr-Nachum-Ulanovsky-Social.jpg", "publishedAt": "2026-01-21T15:20:54Z", "content": "These head direction cells are connected in a ringlike system called a ring attractor network. In mammals, this network is not a physical ring (though it is, strangely, in fruit flies), but it can be… [+3619 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "Neanderthals took reusable toolkits with them on high-altitude treks through the Alps - Phys.org", "description": "When Neanderthals in Italy were crossing the Alps, it's likely they took refuge in high-altitude bear caves. A new study of stone tools in Caverna Generosa, a cave sitting 1,450 meters up in the mountains, found that these travelers also brought a toolkit wit…", "url": "https://phys.org/news/2026-01-neanderthals-reusable-toolkits-high-altitude.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/neanderthals-took-reus.jpg", "publishedAt": "2026-01-21T15:20:08Z", "content": "When Neanderthals in Italy were crossing the Alps, it's likely they took refuge in high-altitude bear caves. A new study of stone tools in Caverna Generosa, a cave sitting 1,450 meters up in the moun… [+3469 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "These Snapshots of the Moment a Star Exploded Will Fill You With Cosmic Dread - Futurism", "description": "A pair of incredible images show the very moment that two different stars exploded, an incredible display that's melting our minds.", "url": "http://futurism.com/space/snapshots-star-exploded-dread", "urlToImage": "https://futurism.com/wp-content/uploads/2026/01/snapshots-star-exploded-dread.jpg?w=1200", "publishedAt": "2026-01-21T15:11:11Z", "content": "A pair of incredible images taken at the very moment two different stars exploded are also an accurate representation of how our feeble minds are being melted at the awesome but terrifying cosmic for… [+3832 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI World Desk", "title": "Who is Shri Kulkarni, Indian-born RAS Gold Medal astrophysicist and Narayana Murthy’s brother-in-law? - Times of India", "description": "US News: Learn about Shrinivas R. Kulkarni, the Indian-born astrophysicist and recent recipient of the RAS Gold Medal, known for his transformative contributions to time-domain astronomy and groundbreaking discoveries in the universe.", "url": "https://timesofindia.indiatimes.com/world/us/who-is-shri-kulkarni-indian-born-ras-gold-medal-astrophysicist-and-narayana-murthys-brother-in-law/articleshow/126978026.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-127006127,width-1280,height-720,imgsize-796139,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg", "publishedAt": "2026-01-21T15:01:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Kenna Hughes-Castleberry", "title": "Hubble sees baby stars in Large Magellanic Cloud photo of the day for Jan. 21, 2026 - Space", "description": "The Large Magellanic Cloud, or LMC, is a key spot for astronomers to study star formation.", "url": "https://www.space.com/astronomy/hubble-space-telescope/hubble-sees-baby-stars-in-large-magellanic-cloud-space-photo-of-the-day-for-jan-21-2026", "urlToImage": "https://cdn.mos.cms.futurecdn.net/A6ktAJBqCZfVxRbTnJQeRL-1920-80.jpg", "publishedAt": "2026-01-21T15:00:00Z", "content": "Star formation\r\n can feel like a distant, abstract concept, until you see it mapped across a landscape of gas and dust. A recent image\r\n from the Hubble Space Telescope\r\n looks at the the N159 star-f… [+2302 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Southern hemisphere ceratosaurs evolved feeding mechanics paralleling those of Northern hemisphere tyrannosaurids - Nature", "description": "Ceratosaurs (Ceratosauria), including Ceratosaurus and derived abelisaurids such as Carnotaurus, were the dominant large-bodied predators in Cretaceous ecosystems of the Southern Hemisphere, paralleling the ecological role of tyrannosaurids in the Cretaceous …", "url": "https://www.nature.com/articles/s41598-025-32686-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-025-32686-4/MediaObjects/41598_2025_32686_Fig1_HTML.png", "publishedAt": "2026-01-21T14:56:27Z", "content": "<li>Carrano, M. T. &amp; Sampson, S. D. The phylogeny of ceratosauria (Dinosauria: Theropoda). J. Syst. Paleontol.6, 183236 (2008).\r\nArticle \r\nGoogle Scholar \r\n</li><li>Hone, D. W. E. &amp; Benton, M… [+13501 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "Bionic LiDAR system achieves beyond-retinal resolution through adaptive focusing - Phys.org", "description": "In a recent study, researchers from China have developed a chip-scale LiDAR system that mimics the human eye's foveation by dynamically concentrating high-resolution sensing on regions of interest (ROIs) while maintaining broad awareness across the full field…", "url": "https://phys.org/news/2026-01-bionic-lidar-retinal-resolution-focusing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/bionic-lidar-system-ac-1.jpg", "publishedAt": "2026-01-21T13:02:33Z", "content": "In a recent study, researchers from China have developed a chip-scale LiDAR system that mimics the human eye's foveation by dynamically concentrating high-resolution sensing on regions of interest (R… [+8171 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": "MARCIA DUNN", "title": "Suni Williams, the NASA astronaut who was stuck at the space station for months, retires within a year of returning - abc7.com", "description": "NASA's Suni Williams - one of two astronauts stuck for months at the International Space Station - has retired.", "url": "https://abc7.com/post/suni-williams-nasa-astronaut-was-stuck-space-station-months-retires-year-returning/18442833/", "urlToImage": "https://cdn.abcotvs.com/dip/images/18442832_012126-cc-ap-suni-williams-img.jpg?w=1600", "publishedAt": "2026-01-21T12:37:37Z", "content": "CAPE CANAVERAL, Fla. -- NASA's Suni Williams - one of two astronauts stuck for months at the International Space Station - has retired.\r\nThe space agency announced the news Tuesday, saying her retire… [+1066 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA to end support for planetary science groups - SpaceNews", "description": "NASA is ending financial support for several planetary science groups as part of a broader drawdown of the agency’s advisory structure.", "url": "http://spacenews.com/nasa-to-end-support-for-planetary-science-groups/", "urlToImage": "https://spacenews.com/wp-content/uploads/2014/12/NASALogo.jpg", "publishedAt": "2026-01-21T12:24:02Z", "content": "WASHINGTON NASA is ending financial support for several planetary science groups as part of a broader drawdown of the agencys advisory structure.\r\nIn a Jan. 16 letter, Louise Prockter, director of NA… [+4530 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "A Cycle Deep Within Earth's Crust May Affect Climate More Than We Thought - ScienceAlert", "description": "Our planet has experienced dramatic climate shifts throughout its history, oscillating between freezing \"icehouse\" periods and warm \"greenhouse\" states.", "url": "https://www.sciencealert.com/a-cycle-deep-within-earths-crust-may-affect-climate-more-than-we-thought", "urlToImage": "https://www.sciencealert.com/images/2026/01/rim_of_fire_carbon_cycle_header.jpg", "publishedAt": "2026-01-21T12:01:59Z", "content": "Our planet has experienced dramatic climate shifts throughout its history, oscillating between freezing \"icehouse\" periods and warm \"greenhouse\" states.\r\nScientists have long linked these climate cha… [+5940 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "It's Official: Africa Is Breaking Apart and a New Ocean Is Forming Faster Than Scientists Ever Predicted - Indian Defence Review", "description": "A massive geological rift is tearing one of Earth’s largest continents in two, faster than scientists once believed.", "url": "https://indiandefencereview.com/its-official-africa-is-breaking-apart-and-a-new-ocean-is-forming-faster-than-scientists-ever-predicted/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/01/a-massive-rift-is-tearing-through-africa-scaled.jpg", "publishedAt": "2026-01-21T12:00:00Z", "content": "A major tectonic divergence in East Africa is progressing more rapidly than earlier models projected, intensifying scientific efforts to monitor what could become the Earth’s next ocean basin. The Ea… [+5200 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Magnetic avalanches power solar flares, finds Solar Orbiter - European Space Agency", "description": "Just as avalanches on snowy mountains start with the movement of a small quantity of snow, the ESA-led Solar Orbiter spacecraft has discovered that a solar flare is triggered by initially weak disturbances that quickly become more violent. This rapidly evolvi…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Solar_Orbiter/Magnetic_avalanches_power_solar_flares_finds_Solar_Orbiter", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2026/01/unleashing_a_solar_flare/27073719-1-eng-GB/Unleashing_a_solar_flare_pillars.png", "publishedAt": "2026-01-21T08:19:25Z", "content": "Science &amp; Exploration21/01/20262246 views29 likes\r\nJust as avalanches on snowy mountains start with the movement of a small quantity of snow, the ESA-led Solar Orbiter spacecraft has discovered t… [+7908 chars]"}, {"source": {"id": null, "name": "menshealth.com"}, "author": "Kate Neudecker", "title": "The Strength and Fitness Benchmarks Men Should be Hitting in Their 50s - Men's Health", "description": "These strength and fitness benchmarks outline what healthy men in their 50s can aim for across strength, endurance, power and cardio.", "url": "https://www.menshealth.com/uk/fitness/a70049052/strength-fitness-benchmarks-men-50s/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/bald-elderly-sportsman-preparing-barbell-for-royalty-free-image-1768907138.pjpeg?crop=1.00xw:0.752xh;0,0.130xh&resize=1200:*", "publishedAt": "2026-01-21T08:02:53Z", "content": "Turning 50 is a significant milestone. Its also a sensible point to reassess your strength and fitness benchmarks to make sure they still reflect what youre capable of. Set the bar too low and you ri… [+7992 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "A failed galaxy could solve the dark matter mystery : Short Wave - NPR", "description": "Cloud 9 is a failed galaxy. It’s a clump of dark matter, called a dark matter halo, that never formed stars. But this failure could be the key to a mystery almost as old as the universe itself: dark matter. Scientists don’t know what dark matter is, but Cloud…", "url": "https://www.npr.org/2026/01/21/nx-s1-5677276/space-stars-dark-matter-galaxy", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3093x1740+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F99%2F0d%2F531bc179490eb41e1bded2f051f7%2F7179e269-5f2f-4f28-a30b-581a48290bdb.jpg", "publishedAt": "2026-01-21T08:00:00Z", "content": "Cloud 9 is a failed galaxy. It's a clump of dark matter, called a dark matter halo, that never formed stars.\r\nBut this failure could be the key to a mystery almost as old as the universe itself: dark… [+759 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Some plants make fake berries to trick birds into helping them spread seeds - Earth.com", "description": "A rare yam species, Dioscorea melanophyma, spreads its clones by fooling birds with fake berries, helping it survive without seeds.", "url": "https://www.earth.com/news/fake-berries-help-sexless-plant-dioscorea-melanophyma-recruit-birds-for-dispersal/", "urlToImage": "https://cff2.earth.com/uploads/2026/01/20184517/fake-berries_Dioscorea-melanophyma_fools-birds_Gao-Chen_1m.jpg", "publishedAt": "2026-01-21T07:16:27Z", "content": "A plant that cant make seeds has a big problem: it can grow, but it struggles to move. Without seeds to hitch rides on wind, water, or animals, an asexual plant is often stuck near its parent, piling… [+5916 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Stanford scientists found a way to regrow cartilage and stop arthritis - ScienceDaily", "description": "Scientists at Stanford Medicine have discovered a treatment that can reverse cartilage loss in aging joints and even prevent arthritis after knee injuries. By blocking a protein linked to aging, the therapy restored healthy, shock-absorbing cartilage in old m…", "url": "https://www.sciencedaily.com/releases/2026/01/260120000333.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/3d-knee-joint-inflammation-osteoarthritis.webp", "publishedAt": "2026-01-21T04:56:21Z", "content": "A study led by Stanford Medicine researchers has found that an injection blocking a protein linked to aging can reverse the natural loss of knee cartilage in older mice. The same treatment also stopp… [+9581 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Discover a New Quantum State of Matter Once Considered Impossible - ScienceAlert", "description": "A quantum state of matter has appeared in a material where physicists thought it would be impossible, forcing a rethink on the conditions that govern the behaviors of electrons in certain materials.", "url": "https://www.sciencealert.com/scientists-discover-a-new-quantum-state-of-matter-once-considered-impossible", "urlToImage": "https://www.sciencealert.com/images/2026/01/BrightParticles.jpg", "publishedAt": "2026-01-21T03:20:45Z", "content": "A quantum state of matter has appeared in a material where physicists thought it would be impossible, forcing a rethink on the conditions that govern the behaviors of electrons in certain materials.\r… [+3766 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Mars has never looked so serene in this gorgeous image from a NASA rover - Digital Trends", "description": "Nearly 14 years ago, NASA’s Curiosity rover landed on Mars for a mission to explore the red planet and discover if it had an environment capable of supporting microbial life. Over the years, the rover has also been beaming back striking images of its surround…", "url": "https://www.digitaltrends.com/space/mars-has-never-looked-so-serene-in-this-gorgeous-image-from-a-nasa-rover/", "urlToImage": "https://www.digitaltrends.com/tachyon/2026/01/mars-curiosity.jpg?resize=1200%2C630", "publishedAt": "2026-01-21T01:45:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "SPIE", "title": "AI-driven ultrafast spectrometer-on-a-chip advances real-time sensing - Phys.org", "description": "For decades, the ability to visualize the chemical composition of materials, whether for diagnosing a disease, assessing food quality, or analyzing pollution, depended on large, expensive laboratory instruments called spectrometers. These devices work by taki…", "url": "https://phys.org/news/2026-01-ai-driven-ultrafast-spectrometer-chip.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/ai-driven-ultrafast-sp.jpg", "publishedAt": "2026-01-20T22:40:02Z", "content": "For decades, the ability to visualize the chemical composition of materials, whether for diagnosing a disease, assessing food quality, or analyzing pollution, depended on large, expensive laboratory … [+3950 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mysterious polar weather on Jupiter and Saturn could be key to understanding their insides - Space", "description": "\"I don't think anyone's made this connection between the surface fluid pattern and the interior properties of these planets.\"", "url": "https://www.space.com/astronomy/solar-system/mysterious-polar-weather-on-jupiter-and-saturn-could-be-key-to-understanding-their-insides", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Aj7hfq4y82pbXMozcpQPoj-1600-80.png", "publishedAt": "2026-01-20T22:00:00Z", "content": "Scientists may finally know why Jupiter and Saturn have very different weather patterns at their poles, despite having similar sizes and compositions. The discovery could help researchers probe deep … [+4126 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "'Like watching a cosmic volcano erupt': Scientists see monster black hole 'reborn' after 100 million years - Live Science", "description": "Scientists saw an inactive black hole 'reawaken' from a 100-million-year nap with fire and fury.", "url": "https://www.livescience.com/space/black-holes/like-watching-a-cosmic-volcano-erupt-scientists-see-monster-black-hole-reborn-after-100-million-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6vfK6LTqLDmfn9TLD9mDKR-850-80.png", "publishedAt": "2026-01-20T21:45:08Z", "content": "Scientists have observed a supermassive black hole\r\n waking up from a nearly 100 million-year nap.\r\nThe black hole lies at the center of a gigantic galaxy that's emitting extremely strong radio waves… [+3517 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Gerelle Q. Dodson", "title": "New NASA Artemis Payloads To Study Moon’s Terrain, Radiation, History - NASA (.gov)", "description": "NASA announced Tuesday the selection of three new science investigations that will strengthen humanity’s understanding and exploration of the Moon. As part of", "url": "https://www.nasa.gov/news-release/new-nasa-artemis-payloads-to-study-moons-terrain-radiation-history/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/09/nasa-meatball-1.jpg", "publishedAt": "2026-01-20T21:23:54Z", "content": "NASA announced Tuesday the selection of three new science investigations that will strengthen humanitys understanding and exploration of the Moon. As part of the agencys CLPS (Commercial Lunar Payloa… [+3528 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": "James Ashworth, Natural History Museum", "title": "DNA Breakthrough Solves Decade-Old Mystery of the Beachy Head Woman - SciTechDaily", "description": "New research suggests the mysterious Roman-era “Beachy Head Woman” was likely from Britain, not the Mediterranean or sub-Saharan Africa. Advances in DNA sequencing are helping researchers resolve a mystery that has surrounded the Beachy Head Woman for more th…", "url": "https://scitechdaily.com/dna-breakthrough-solves-decade-old-mystery-of-the-beachy-head-woman/", "urlToImage": "https://scitechdaily.com/images/3D-Scan-of-Beachy-Head-Womans-Skull.jpg", "publishedAt": "2026-01-20T21:11:21Z", "content": "This digital image was generated from a 3D scan of Beachy Head Woman’s skull. The skin, hair and eye pigmentation were informed by ancient DNA results. Credit: Courtesy of the Face Lab at Liverpool J… [+6529 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Jasna Hodžić", "title": "Computational model discovers new types of neurons hidden in decade-old dataset - Big Think", "description": "Researchers built a model that behaves like a brain. Without being trained on neural data, the model produced a peculiar signal — one that was later discovered in actual brain activity.", "url": "https://bigthink.com/neuropsych/computational-model-discovers-new-types-of-neurons-hidden-in-decade-old-dataset/", "urlToImage": "https://bigthink.com/wp-content/uploads/2026/01/new-neurons-old-dataset_compressed.jpg?resize=1200,630", "publishedAt": "2026-01-20T20:32:25Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Aarhus University", "title": "Complex building blocks of life form spontaneously in space, research reveals - Phys.org", "description": "Challenging long-held assumptions, Aarhus University researchers have demonstrated that the protein building blocks essential for life as we know it can form readily in space. This discovery, appearing in Nature Astronomy, significantly raises the statistical…", "url": "https://phys.org/news/2026-01-complex-blocks-life-spontaneously-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/new-research-reveals-t.jpg", "publishedAt": "2026-01-20T20:30:27Z", "content": "Challenging long-held assumptions, Aarhus University researchers have demonstrated that the protein building blocks essential for life as we know it can form readily in space. This discovery, appeari… [+5332 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Foundational Questions Institute, FQXi", "title": "A twitch in time? Quantum collapse models hint at tiny time fluctuations - Phys.org", "description": "Quantum mechanics is rich with paradoxes and contradictions. It describes a microscopic world in which particles exist in a superposition of states—being in multiple places and configurations all at once, defined mathematically by what physicists call a \"wave…", "url": "https://phys.org/news/2026-01-twitch-quantum-collapse-hint-tiny.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-twitch-in-time-quant.jpg", "publishedAt": "2026-01-20T20:02:16Z", "content": "Quantum mechanics is rich with paradoxes and contradictions. It describes a microscopic world in which particles exist in a superposition of statesbeing in multiple places and configurations all at o… [+5615 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "4,000 Space Mirrors Could Soon Light Up Your Night, and They’re Coming in 2026 - The Daily Galaxy", "description": "A bold new startup plans to launch mirrors into orbit to reflect sunlight onto Earth at night, a move that could outshine the Moon.", "url": "https://dailygalaxy.com/2026/01/4000-space-mirrors-soon-light-up-night/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/4000-Space-Mirrors-Could-Soon-Light-Up-Your-Night-and-Theyre-Coming-in-2026-scaled.jpg", "publishedAt": "2026-01-20T19:15:00Z", "content": "A California startup wants to use giant orbiting mirrors to reflect sunlight onto Earth after dark. The first test satellite is set for launch in April 2026, but the idea has already sparked backlash… [+3238 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Astronomers Discover Gigantic Iron Bar Running Through Ring Nebula - PetaPixel", "description": "'We definitely need to know more.'", "url": "https://petapixel.com/2026/01/20/astronomers-discover-gigantic-iron-bar-running-through-ring-nebula/", "urlToImage": "https://petapixel.com/assets/uploads/2026/01/Ring-Nebula-Bar.jpg", "publishedAt": "2026-01-20T18:38:14Z", "content": "Astronomers discovered this iron bar running for 3.7 trillion miles in the middle of the Ring Nebula | Roger Wesson et al.\r\nIt’s one of the most eye-catching objects in the Universe, but now astronom… [+3924 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "This Black Hole Jet Is So Powerful, It’s Shutting Down an Entire Galaxy - The Daily Galaxy", "description": "This black hole isn’t just pulling stuff in, it’s blasting material out. And what that means for its galaxy is more serious than anyone expected.", "url": "https://dailygalaxy.com/2026/01/black-hole-jet-powerful-shuts-down-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/This-Black-Hole-Jet-Is-So-Powerful-Its-Shutting-Down-an-Entire-Galaxy-scaled.jpg", "publishedAt": "2026-01-20T18:15:00Z", "content": "A supermassive black hole in a nearby galaxy is launching a jet of gas with such force and precision that it may be stripping its host of the raw material needed to form new stars. In VV 340a, this r… [+2761 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "What Isaac Roberts Saw Without A Space Telescope - Hackaday", "description": "Space telescopes are all the rage, and rightfully so. The images they take are spectacular, and they’ve greatly increased what we know about the universe. Surely, any picture taken of, say, t…", "url": "https://hackaday.com/2026/01/20/what-isaac-roberts-saw-without-a-space-telescope/", "urlToImage": "https://hackaday.com/wp-content/uploads/2026/01/Andromeda_Nebula-Isaac_Roberts_29_December_1888_featured.png", "publishedAt": "2026-01-20T18:00:00Z", "content": "Space telescopes are all the rage, and rightfully so. The images they take are spectacular, and they’ve greatly increased what we know about the universe. Surely, any picture taken of, say, the Andro… [+2455 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jennifer M. Dooren", "title": "NASA Unlocks Golden Age of Innovation, Exploration in Trump’s First Year - NASA (.gov)", "description": "One year into President Donald J. Trump’s second term, NASA is delivering measurable progress across human spaceflight, science, aeronautics, and cutting-edge", "url": "https://www.nasa.gov/news-release/nasa-unlocks-golden-age-of-innovation-exploration-in-trumps-first-year/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2026/01/ksc-01172026-artemis-ii-rollout-jan17.jpg", "publishedAt": "2026-01-20T17:57:57Z", "content": "One year into President Donald J. Trumps second term, NASA is delivering measurable progress across human spaceflight, science, aeronautics, and cutting-edge technology. These advances mark the begin… [+3686 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "A Parrot Named Nigel With A British Accent Went Missing. It Showed Up Four Years Later, Talking Spanish. - IFLScience", "description": "Nigel, aka Morgan, went on quite the adventure.", "url": "https://www.iflscience.com/a-parrot-named-nigel-with-a-british-accent-went-missing-it-showed-up-four-years-later-talking-spanish-82270", "urlToImage": "https://assets.iflscience.com/assets/articleNo/82270/aImg/88620/african-gray-parrot-meta.png", "publishedAt": "2026-01-20T17:21:48Z", "content": "An African gray parrot that went missing for four years surprised its British owner upon its return, after the owner found the bird was now speaking in Spanish.In 2010, Darren Chick, a British man li… [+3044 chars]"}, {"source": {"id": null, "name": "19fortyfive.com"}, "author": "Brent M. Eastwood", "title": "Quote of the Day by Stephen Hawking: 'We are just an advanced breed of monkeys on a minor planet of a very average star. But...' - 19FortyFive", "description": "Stephen Hawking’s 1988 “advanced monkeys” quote argues that understanding the universe—and exploring space—may be humanity’s best path to endure.", "url": "https://www.19fortyfive.com/2026/01/quote-of-the-day-by-stephen-hawking-we-are-just-an-advanced-breed-of-monkeys-on-a-minor-planet-of-a-very-average-star-but/", "urlToImage": "https://www.19fortyfive.com/wp-content/uploads/2026/01/Stephen-Hawking.jpg", "publishedAt": "2026-01-20T17:08:47Z", "content": "Space Quote of the Day: Stephen Hawkings Advanced Monkeys Line Still Hits Hard\r\nWe are just an advanced breed of monkeys on a minor planet of a very average star. But we can understand the universe. … [+6875 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sam Jarman", "title": "Vast cluster of ancient galaxies could rewrite the history of star formation - Phys.org", "description": "Astronomers have discovered a vast, dense cluster of massive galaxies just 1 billion years after the Big Bang, each forming stars at an intense rate from collapsing clouds of dust. Reported in Astronomy & Astrophysics by an international team, led by Guilaine…", "url": "https://phys.org/news/2026-01-vast-cluster-ancient-galaxies-rewrite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/vast-cluster-of-ancien.jpg", "publishedAt": "2026-01-20T17:00:01Z", "content": "Astronomers have discovered a vast, dense cluster of massive galaxies just 1 billion years after the Big Bang, each forming stars at an intense rate from collapsing clouds of dust. Reported in Astron… [+5295 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "In 1938, Marjorie Courtenay-Latimer Resurrected A Species Thought To Be Extinct For 66 Million Years - IFLScience", "description": "\"She had been in the lab and recognized how to identify fishes, and said that's something valuable that we have to preserve.”", "url": "https://www.iflscience.com/in-1938-marjorie-courtenay-latimer-resurrected-a-species-thought-to-be-extinct-for-66-million-years-82268", "urlToImage": "https://assets.iflscience.com/assets/articleNo/82268/aImg/88610/coelacanth-fish-meta.png", "publishedAt": "2026-01-20T16:26:27Z", "content": "In the 1930s, a museum curator working for the East London Museum in South Africa started asking fishing boats to let her know if anything unusual turned up in their catch. It was a simple request, o… [+4275 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Marietta Fuhrmann-Koch", "title": "Physicists bridge worlds of quantum matter - Phys.org", "description": "A new unified theory connects two fundamental domains of modern quantum physics: It joins two opposite views of how a single exotic particle behaves in a many-body system, namely as a mobile or static impurity among a large number of fermions, a so-called Fer…", "url": "https://phys.org/news/2026-01-physicists-bridge-worlds-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/physicists-bridge-worl.jpg", "publishedAt": "2026-01-20T16:22:07Z", "content": "A new unified theory connects two fundamental domains of modern quantum physics: It joins two opposite views of how a single exotic particle behaves in a many-body system, namely as a mobile or stati… [+3925 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Kouceila Rekik", "title": "Rare Comet Approaches the Sun in Fiery Encounter Today Before Heading Toward Earth - The Daily Galaxy", "description": "After brushing past the Sun, Comet Wierzchos is returning in February for a closer, and more visible, flyby near Earth.", "url": "https://dailygalaxy.com/2026/01/rare-comet-approaches-the-sun-today/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/Rare-Comet-Approaches-the-Sun-in-Fiery-Encounter-Today-Before-Heading-Toward-Earth-scaled.png", "publishedAt": "2026-01-20T16:15:00Z", "content": "Comet C/2024 E1 (Wierzchos) will pass close to the Sun on January 20, 2026, in a brief but powerful solar encounter that will make it a temporary star of the astronomical world. While it isn’t visibl… [+3652 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "A New Theory Says Gravity May Come From Entropy—Which Could Lead to a Unified Theory of Physics - Yahoo", "description": "A new theory suggests gravity could possibly be the result of entropy—which would mean everything in the universe would fall apart if it all remained...", "url": "https://www.popularmechanics.com/science/a70060000/gravity-from-entropy-unified-theory/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/HSh1TEjiPX8goIjXC9t_aw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/6d2eba9fbeb8552fa74a26e133216c99", "publishedAt": "2026-01-20T16:10:00Z", "content": "Heres what youll learn when you read this story:\r\n<ul><li>A new theory suggests that gravity could possibly be the result of entropy. If true, this would mean that everything in the universe would fa… [+4451 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": "Kate Cheng", "title": "'I did zone 2 cardio every week for an entire year – 8 things I learned' - Women's Health", "description": "One runner tried slow running for a year to build her long-distance running capacity and speed. Here's how it improved her physical and mental health", "url": "https://www.womenshealthmag.com/uk/fitness/running/a70050261/i-did-zone-2-cardio-for-a-year/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/zone-2-cardio-for-a-year-1-696f8cb7443a8.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2026-01-20T15:17:59Z", "content": "Slow running has been emerging as an unexpected way to run faster over long distances. Easy, conversational-pace runs can help you build up your aerobic base and improve your endurance without burnin… [+9716 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "Earth’s Core Might Be “Buttery”, Scientists Say It’s a Brand-New State of Matter - The Daily Galaxy", "description": "Not solid, not liquid… scientists discover Earth’s core may be something entirely new.", "url": "https://dailygalaxy.com/2026/01/earths-core-isnt-solid-but-buttery/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/Earths-Core-Might-Be-Buttery-Scientists-Say-Its-a-Brand-New-State-of-Matter-scaled.jpg", "publishedAt": "2026-01-20T15:15:00Z", "content": "New research suggests that Earths solid inner core might not be as rigid as once believed. Instead, it could exist in an unusual buttery state of matter, one that challenges long-standing assumptions… [+3811 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Scientists Just Discovered How Giant Dinosaurs Grew Necks So Massive They Changed the Way They Walked - The Daily Galaxy", "description": "What made these dinosaurs so huge? Scientists point to one surprising feature: the neck.", "url": "https://dailygalaxy.com/2026/01/giant-dinosaurs-grew-massive-necks-to-walk/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/Scientists-Just-Discovered-How-Giant-Dinosaurs-Grew-Necks-So-Massive-They-Changed-the-Way-They-Walked-scaled.jpg", "publishedAt": "2026-01-20T14:45:00Z", "content": "A recent study from the University of Liverpool shows how sauropod dinosaurs shifted over time from small, tail-heavy animals to gigantic, front-loaded quadrupeds with exceptionally long necks. Using… [+3111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Invisible companion leaves evidence trail around supergiant star Betelgeuse - CNN", "description": "Optical proof of a tiny companion orbiting supergiant star Betelgeuse is hard to come by. Hubble just spotted new evidence.", "url": "https://www.cnn.com/2026/01/20/science/betelgeuse-companion-star-siwarha-wake", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/betelgeuse-01.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-01-20T14:30:59Z", "content": "Astronomers have long searched for clues that a hidden companion star sits out of view near the red supergiant star Betelgeuse. Now, theyve uncovered a new piece of evidence: a trail like the wake be… [+8533 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kenna Hughes-Castleberry", "title": "Mars orbiter sees odd etchings in the sand photo of the day for Jan. 20, 2025 - Space", "description": "Even though the Red Planet's atmosphere is thin, wind is still one of Mars' most relentless sculptors.", "url": "https://www.space.com/astronomy/mars/mars-orbiter-sees-odd-etchings-in-the-sand-space-photo-of-the-day-for-jan-20-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zFCke9xK7Yh7ogNyYNocSo-1920-80.jpg", "publishedAt": "2026-01-20T14:00:00Z", "content": "Mars is famous for its volcanoes, canyons and ancient river valleys, but some of its most active geology happens in slow motion, powered by air. Over time, strong gusts can loft sand grains that ping… [+2473 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "An electrically powered source of entangled light on a chip - Phys.org", "description": "Quantum technologies are cutting-edge systems that can process, transfer, or store information leveraging quantum mechanical effects, particularly a phenomenon known as quantum entanglement. Entanglement entails a correlation between two or more distant parti…", "url": "https://phys.org/news/2026-01-electrically-powered-source-entangled-chip.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/an-electrically-powere-1.jpg", "publishedAt": "2026-01-20T12:30:01Z", "content": "Quantum technologies are cutting-edge systems that can process, transfer, or store information leveraging quantum mechanical effects, particularly a phenomenon known as quantum entanglement. Entangle… [+6073 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Osaka Metropolitan University", "title": "New quantum boundary discovered: Spin size determines how the Kondo effect behaves - Phys.org", "description": "Collective behavior is an unusual phenomenon in condensed-matter physics. When quantum spins interact together as a system, they produce unique effects not seen in individual particles. Understanding how quantum spins interact to produce this behavior is cent…", "url": "https://phys.org/news/2026-01-quantum-boundary-size-kondo-effect.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/new-quantum-boundary-d.jpg", "publishedAt": "2026-01-20T10:00:07Z", "content": "Collective behavior is an unusual phenomenon in condensed-matter physics. When quantum spins interact together as a system, they produce unique effects not seen in individual particles. Understanding… [+5235 chars]"}]}