{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Florida Today"}, "author": "Craig Bailey, Malcolm Denemark, Tim Shortt", "title": "SpaceX launches Starlink 10-12 mission from Cape Canaveral in Florida - Florida Today", "description": "SpaceX launches Falcon 9 rocket on Starlink 10-12 mission at 6:21 p.m. Tuesday, Feb. 18, from Cape Canaveral Space Force Station in Florida.", "url": "https://www.floridatoday.com/picture-gallery/tech/science/space/2025/02/18/spacex-launches-starlink-10-12-mission-from-cape-canaveral-space-force-station-in-florida/78959951007/", "urlToImage": "https://www.floridatoday.com/gcdn/authoring/authoring-images/2025/02/19/PBRE/79114214007-space-x-starlink-1012-1.JPG?crop=5375,3024,x0,y161&width=3200&height=1801&format=pjpg&auto=webp", "publishedAt": "2025-02-19T03:11:14Z", "content": "A SpaceX Falcon 9 rocket lifts off from Cape Canaveral Space Force Station Tuesday, February 18, 2025. The rocket is carrying 23 Starlink satellites. Craig Bailey/FLORIDA TODAY via USA TODAY NETWORK\r… [+2628 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Extreme Drop in Oxygen Will Eventually Suffocate Most Life on Earth - ScienceAlert", "description": "For now, life is flourishing on our oxygen-rich planet, but Earth wasn't always that way – and scientists have predicted that, in the future, the atmosphere will revert back to one that's rich in methane and low in oxygen.", "url": "https://www.sciencealert.com/extreme-drop-in-oxygen-will-eventually-suffocate-most-life-on-earth", "urlToImage": "https://www.sciencealert.com/images/2021-03/processed/earth-glow_1024.jpg", "publishedAt": "2025-02-18T23:21:16Z", "content": "For now, life is flourishing on our oxygen-rich planet, but Earth wasn't always that way and scientists have predicted that, in the future, the atmosphere will revert back to one that's rich in metha… [+3796 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Japan's Resilience moon lander aces lunar flyby ahead of historic touchdown try (photo) - Space.com", "description": "Resilience came within 5,220 miles (8,400 kilometers) of the lunar surface on Feb. 14.", "url": "https://www.space.com/japan-ispace-resilience-moon-lander-aces-flyby-ahead-of-touchdown", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eMm4sBEdKPtG3AuEwLnE7c-1200-80.jpg", "publishedAt": "2025-02-18T21:30:00Z", "content": "The private Resilience lunar lander just got its first up-close look at the moon.\r\nResilience, which was built by Japanese company ispace, aced a flyby of the moon on Friday evening (Feb. 14), coming… [+2331 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This “Impossible” Crystal Is Changing What We Know About Reality - SciTechDaily", "description": "Once thought impossible, quasicrystals revealed a hidden order that challenges our understanding of materials. Their structure follows rules from higher dimensions, influencing both their mechanical and topological properties. Recent research has uncovered bi…", "url": "https://scitechdaily.com/?p=455645", "urlToImage": "https://scitechdaily.com/images/Quasicrystal-Tesseract-Shadow-scaled.jpg", "publishedAt": "2025-02-18T21:29:47Z", "content": "In the illustration: A tesseract (a four-dimensional cube) and the “shadow” it casts on a plane—the quasicrystal discovered by Shechtman. According to Prof. Bartal, “The fact that a quasicrystal is a… [+6231 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "Is Pluto a planet or not? Who cares! Our love for the King of the Kuiper Belt is stronger than ever 95 years later - Space.com", "description": "The controversy endures over Pluto's true status, but the solar system underdog continues to capture hearts across the globe.", "url": "https://www.space.com/the-universe/pluto/is-pluto-a-planet-or-not-who-cares-our-love-for-the-king-of-the-kuiper-belt-is-stronger-than-ever-95-years-later", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VYfK7RzT8xBhM3UAPBiQig-1200-80.jpg", "publishedAt": "2025-02-18T21:00:00Z", "content": "Clyde Tombaugh didn't set out to discover Pluto when he sent his sketches of the night sky to Lowell Observatory in Flagstaff, Arizona in 1929. More than anything, he just wanted to get off the farm … [+15980 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sarah Stanley", "title": "Jupiter's moon Callisto is very likely an ocean world - Phys.org", "description": "More pocked with craters than any other object in our solar system, Jupiter's outermost and second-biggest Galilean moon, Callisto, appears geologically unremarkable. In the 1990s, however, NASA's Galileo spacecraft captured magnetic measurements near Callist…", "url": "https://phys.org/news/2025-02-jupiter-moon-callisto-ocean-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/jupiters-moon-callisto.jpg", "publishedAt": "2025-02-18T20:04:03Z", "content": "More pocked with craters than any other object in our solar system, Jupiter's outermost and second-biggest Galilean moon, Callisto, appears geologically unremarkable. In the 1990s, however, NASA's Ga… [+2942 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Northern Lights Forecast: Here’s Where Aurora Borealis May Appear Tonight - Forbes", "description": "Several states along the Canadian border may have an opportunity to see the phenomenon, forecasters said.", "url": "https://www.forbes.com/sites/tylerroush/2025/02/18/northern-lights-forecast-heres-where-aurora-borealis-may-appear-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67b4e3179dd99d8ba14d00af/0x0.jpg?format=jpg&crop=3504,1971,x0,y179,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-18T19:48:29Z", "content": "Several U.S. states along the Canadian border may see the aurora borealis Tuesday, according to the latest forecast from the National Oceanic and Atmospheric Administration.\r\nSeveral states along the… [+2579 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "FRANCE 24, FRANCE 24", "title": "'City killer' asteroid now has 3.1% chance of hitting Earth: NASA - FRANCE 24 English", "description": "NASA data released Tuesday said there is now a 3.1 percent chance a \"city-destroying\" asteroid could smash into Earth in 2023. The asteroid named 2024 YR4 is being carefully monitored by the international astronomical community.", "url": "https://www.france24.com/en/live-news/20250218-city-killer-asteroid-now-has-3-1-chance-of-hitting-earth-nasa", "urlToImage": "https://s.france24.com/media/display/2f1d1378-ee2f-11ef-a090-005056bf30b7/w:1280/p:16x9/767788f661eade59e8ba6b4e380b283848ae7abf.jpg", "publishedAt": "2025-02-18T19:33:10Z", "content": "An asteroid that could level a city now has a 3.1-percent chance of striking Earth in 2032, according to NASA data released on Tuesday, making it the most threatening space rock ever recorded by mode… [+4032 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National Research University Higher School of Economics", "title": "Network analysis identifies 15 key motives driving human behavior - Phys.org", "description": "Researchers at HSE University and the London School of Hygiene and Tropical Medicine have identified 15 key motives that drive human behavior. By analyzing people's views, preferences, and actions through an evolutionary lens, they demonstrated how these moti…", "url": "https://phys.org/news/2025-02-network-analysis-key-human-behavior.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-identify-fi.jpg", "publishedAt": "2025-02-18T19:14:05Z", "content": "Researchers at HSE University and the London School of Hygiene and Tropical Medicine have identified 15 key motives that drive human behavior. By analyzing people's views, preferences, and actions th… [+6492 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Why we think Theia existed - Phys.org", "description": "The giant-impact hypothesis posits that billions of years ago a Mars-sized body named Theia collided with the early Earth.", "url": "https://phys.org/news/2025-02-theia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/583d73c61a5b8.jpg", "publishedAt": "2025-02-18T18:35:31Z", "content": "The giant-impact hypothesis posits that billions of years ago a Mars-sized body named Theia collided with the early Earth.\r\nThe immense energy from this impact not only significantly altered Earth's … [+2329 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Partha Nandi, Bibhas Ranjan Majhi", "title": "Quantum effects make distant objects move together: New research finds this may happen with ripples in space - Phys.org", "description": "Galaxies, planets, black holes: to most people, everything about our Universe sounds and feels enormous. But while it's true that much of what happens millions of light years away is large, there are also processes happening at the quantum end of the scale. T…", "url": "https://phys.org/news/2025-02-quantum-effects-distant-ripples-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/space.jpg", "publishedAt": "2025-02-18T18:03:17Z", "content": "Galaxies, planets, black holes: to most people, everything about our Universe sounds and feels enormous. But while it's true that much of what happens millions of light years away is large, there are… [+7650 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Not So Random After All: Scientists Uncover Surprising New Clues to the Origin of Life - SciTechDaily", "description": "New research shows that fluctuating environmental conditions helped chemical mixtures self-organize and evolve in structured ways, challenging the notion of chaotic early chemical evolution. A new study examines how complex chemical mixtures evolve under chan…", "url": "https://scitechdaily.com/not-so-random-after-all-scientists-uncover-surprising-new-clues-to-the-origin-of-life/", "urlToImage": "https://scitechdaily.com/images/Origin-of-Life-Concept.jpg", "publishedAt": "2025-02-18T17:33:57Z", "content": "A new study shows that chemical mixtures evolve under changing environmental conditions, revealing how life’s building blocks may have formed. By mimicking early Earth’s wet-dry cycles, researchers f… [+4275 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "The evolving pigment palette of European skin, eyes and hair as seen through ancient DNA - Phys.org", "description": "University of Ferrara researchers in Italy have examined how European skin, eye and hair pigmentation evolved over the past 45,000 years. Findings indicate that lighter pigmentation traits emerged gradually and non-linearly, with dark skin persisting in many …", "url": "https://phys.org/news/2025-02-evolving-pigment-palette-european-skin.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/the-evolving-pigment-p-1.jpg", "publishedAt": "2025-02-18T17:10:02Z", "content": "University of Ferrara researchers in Italy have examined how European skin, eye and hair pigmentation evolved over the past 45,000 years. Findings indicate that lighter pigmentation traits emerged gr… [+4078 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Deep-Sea Creatures Are Crafting Their Own Worlds Beneath the Ocean Floor, Study Finds - Gizmodo", "description": "Organisms in the deep sea rely on gravity flows to lay down sediment and then make burrows beneath the seafloor, according to a new study.", "url": "https://gizmodo.com/deep-sea-creatures-are-crafting-their-own-worlds-beneath-the-ocean-floor-study-finds-2000564906", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/burrowing-animal-pacific-seafloor.jpg", "publishedAt": "2025-02-18T16:00:51Z", "content": "Animals living in one of Earth’s most extreme environmentsbeneath the bottom of the seaare not just making the best of the situation, according to new research. The animals are actually shaping their… [+3957 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Exoplanet with iron rain has violent winds 'like something out of science fiction' - Space.com", "description": "\"Even the strongest hurricanes in the solar system seem calm in comparison.\"", "url": "https://www.space.com/wasp-121b-violent-winds-science-fiction", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wz6yhzPhjobqg2yAotbLyV-1200-80.png", "publishedAt": "2025-02-18T16:00:00Z", "content": "WASP-121 b is the definition of an \"extreme\" exoplanet — it's so hot that it rains droplets of liquid iron. Now, astronomers have discovered that this planet, located around 900 light-years away from… [+4700 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": null, "title": "Webb Reveals Rapid-Fire Light Show From Milky Way's Central Black Hole - WebbTelescope.org", "description": "", "url": "https://webbtelescope.org/contents/news-releases/2025/news-2025-110", "urlToImage": "//stsci-opo.org/STScI-01JKREWZBKAJ0TQSXXE10BVRVP.png", "publishedAt": "2025-02-18T16:00:00Z", "content": "The supermassive black hole at the center of the Milky Way appears to be having a party, complete with a disco ball-style light show. Using NASA’s James Webb Space Telescope, a team of astrophysicist… [+5149 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Just Found A Star System Breaking Every Speed Record - The Daily Galaxy --Great Discoveries Channel", "description": "Deep in the heart of the Milky Way, astronomers have detected a star system moving at mind-blowing speeds—far faster than anything we’ve seen before. Scientists believe it could be home to a mysterious exoplanet, one that might be breaking all known records. …", "url": "https://dailygalaxy.com/2025/02/nasa-just-found-a-star-system-breaking-every-speed-record/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/NASA-Just-Found-A-Star-System-Breaking-Every-Speed-Record.jpg", "publishedAt": "2025-02-18T16:00:00Z", "content": "A newly discovered star system in the heart of the Milky Way is moving at unprecedented speeds. Scientists believe this system, located about 24,000 light-years from Earth, consists of a hypervelocit… [+3357 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Calculating the energy requirements for using moon dust to create rocket fuel - Phys.org", "description": "An international team of engineers and space scientists has used a variety of assumptions, techniques, and math principles to calculate the energy requirements for using moon dust to create rocket fuel. In their paper published in Proceedings of the National …", "url": "https://phys.org/news/2025-02-energy-requirements-moon-rocket-fuel.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/calculating-the-energy.jpg", "publishedAt": "2025-02-18T15:30:03Z", "content": "An international team of engineers and space scientists has used a variety of assumptions, techniques, and math principles to calculate the energy requirements for using moon dust to create rocket fu… [+2885 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "70-Million-Year-Old Dinosaur Embryo Discovered In Fossilized Egg - The Daily Galaxy --Great Discoveries Channel", "description": "Buried for 70 million years, a fossilized egg has revealed a stunning secret—a perfectly preserved dinosaur embryo unlike anything seen before. Scientists are calling it one of the most extraordinary finds in paleontology, offering a rare glimpse into how the…", "url": "https://dailygalaxy.com/2025/02/70-million-year-old-dinosaur-embryo-discovered/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/70-million-year-old-Dinosaur-Embryo-Discovered-In-Fossilized-Egg.jpg", "publishedAt": "2025-02-18T15:30:00Z", "content": "A 70-million-year-old dinosaur embryo, preserved in remarkable detail, has been discovered inside a fossilized egg. The find is one of the most well-preserved dinosaur embryos ever uncovered, offerin… [+2741 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "AI Finds Shared Neural Patterns Across Minds - Neuroscience News", "description": "Researchers have developed a geometric deep learning approach to uncover shared brain activity patterns across individuals.", "url": "https://neurosciencenews.com/ai-neural-patterns-shared-28429/", "urlToImage": "https://neurosciencenews.com/files/2025/02/ai-networks-brain-neuroscience.jpg", "publishedAt": "2025-02-18T15:24:41Z", "content": "Summary: Researchers have developed a geometric deep learning approach to uncover shared brain activity patterns across individuals. The method, called MARBLE, learns dynamic motifs from neural recor… [+6883 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Howarth", "title": "Divers discover 500,000-year-old treasure trove of fossils in Florida sinkhole - Livescience.com", "description": "Divers in Florida’s Steinhatchee River stumbled upon hundreds of pristine fossils from an obscure Ice Age period, including giant armadillos, ancient horses and possibly a new species of tapir.", "url": "https://www.livescience.com/animals/extinct-species/divers-discover-500-000-year-old-treasure-trove-of-fossils-in-florida-sinkhole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/T65W9WgXzaf4vYy5vgAzoR-1200-80.jpg", "publishedAt": "2025-02-18T14:44:19Z", "content": "Fossil collectors have discovered a prehistoric graveyard buried in Florida’s Steinhatchee River.\r\nThe site has yielded a remarkable collection of more than 500 fossils dating back roughly half a mil… [+4652 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Tim McMillan, Tim McMillan", "title": "Physicists Uncover Evidence of Two Opposing Arrows of Time in the Quantum Realm - The Debrief", "description": "Physicists at the University of Surrey have uncovered evidence suggesting that, at the quantum level, time does not have a single, forward direction but instead can emerge in two opposing directions.", "url": "https://thedebrief.org/physicists-uncover-evidence-of-two-opposing-arrows-of-time-in-the-quantum-realm/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/02/COVER_4-1.webp", "publishedAt": "2025-02-18T14:34:09Z", "content": "New research suggests that time may not flow in only one direction in quantum systems, challenging long-held assumptions about the nature of time and thermodynamics.\r\nIn an extraordinary breakthrough… [+6902 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Huge dinosaur footprint found on Isle of Wight beach - BBC.com", "description": "The Iguanodon footprint at Shepherd's Chine is almost 1m across and is about 130 million years old.", "url": "https://www.bbc.com/news/articles/cvg53x1j01lo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/e713/live/7a847410-ee06-11ef-a819-277e390a7a08.jpg", "publishedAt": "2025-02-18T14:00:51Z", "content": "A palaeontologist has discovered a huge dinosaur footprint on a beach on the Isle of Wight.\r\nFossil guide Joe Thompson said the 130-million-year-old Iguanodon print at Shepherd's Chine was the best f… [+1407 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "The Wallace Line forms an invisible barrier that separates Asian and Australian species. Scientists now know what happened - ZME Science", "description": "Ever wondered why you won't find kangaroos outside Australia? It all started with massive climate change millions of years ago.", "url": "https://www.zmescience.com/science/news-science/wallace-line-climate-change/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2023/07/Wallace_Linie.jpg", "publishedAt": "2025-02-18T13:41:51Z", "content": "The Wallace Line. Credit: Wikimedia Commons. \r\nFor over 160 years, the Wallace Line has been one of biologys most enduring mysteries. This invisible boundary, slicing through the Indonesian archipela… [+5142 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Europe Approves First \"Disabled Astronaut\" for Long-Term ISS Mission—a Historic Leap for Space - The Daily Galaxy --Great Discoveries Channel", "description": "Space just took a historic leap forward, but not everyone is on board. A former Paralympian is about to break barriers that once seemed impossible. Despite skepticism, ESA has given the green light for something never done before.", "url": "https://dailygalaxy.com/2025/02/europes-first-disabled-astronaut-approved-for-long-term-iss-missions/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/john-mcfall.jpg", "publishedAt": "2025-02-18T13:00:00Z", "content": "John McFall, the European Space Agency (ESA)s first para-astronaut, has been medically cleared for a long-duration stay aboard the International Space Station (ISS), ESAs Director of Human and Roboti… [+3527 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Mike Allen", "title": "Early human speech hinged on key protein variant: new study - Axios", "description": "It gave us an edge over our extinct cousins.", "url": "https://www.axios.com/2025/02/18/why-humans-talk-new-study-protein-variant", "urlToImage": "https://images.axios.com/_U1H1h80dbE71pyD4QC4MIOHt6Y=/0x64:4623x2665/1366x768/2025/02/18/1739879186759.jpg", "publishedAt": "2025-02-18T12:59:42Z", "content": "Casts of skulls are exhibited in the Hall of Human Origins at the Smithsonian National Museum of Natural History, in Washington. Photo: Jacquelyn Martin/AP\r\nScientists have found genetics played a bi… [+1085 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Arjen Vaartjes, Andrea Morello", "title": "New experiments finally prove a long-forgotten theory about how quantum particles spin - Phys.org", "description": "What makes something quantum? This question has kept a small but dedicated fraction of the world's population—most of them quantum physicists—up at night for decades.", "url": "https://phys.org/news/2025-02-forgotten-theory-quantum-particles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/schrdingers-cat.jpg", "publishedAt": "2025-02-18T12:54:16Z", "content": "What makes something quantum? This question has kept a small but dedicated fraction of the world's populationmost of them quantum physicistsup at night for decades.\r\nAt very small scales, we know the… [+5793 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Tara Duggan", "title": "Four Bay Area locations are sinking at an alarming rate, with implications for sea level rise - San Francisco Chronicle", "description": "Four Bay Area locations are sinking at an alarming rate, with implications for sea level rise.", "url": "https://www.sfchronicle.com/climate/article/sea-level-rise-20161150.php", "urlToImage": "https://s.hdnux.com/photos/01/47/24/34/27084592/3/rawImage.jpg", "publishedAt": "2025-02-18T12:34:23Z", "content": "Bay Farm Island in Alameda, pictured in September 2024, is one of the locations in the Bay Area with a high rate of sinking, which could add a higher risk of sea level rise.\r\nJessica Christian/The Ch… [+4516 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Russian Scientists Unveil Plasma Rocket Engine Which Could Reach Mars in Only 30 Days — Game over for Starship? - Indian Defence Review", "description": "Russian scientists have unveiled a groundbreaking plasma engine that could revolutionize space travel, potentially reducing the journey to Mars to just 30 days. This new development promises to significantly reduce the time required for interplanetary mission…", "url": "https://indiandefencereview.com/russian-scientists-unveil-plasma-rocket-engine-which-could-reach-mars-in-30-days/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Plasma-Rocket-Engine.jpg", "publishedAt": "2025-02-18T12:30:00Z", "content": "Russian scientists have unveiled a powerful new plasma engine that could reshape interplanetary travel, cutting the journey to Mars from several months to just one or two. Developed by Rosatoms Troit… [+3874 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": "Clyde Hughes, Sheri Walsh", "title": "SpaceX to attempt landing booster off coast of Bahamas for first time - Yahoo", "description": "SpaceX successfully landed the first stage of a rocket booster on its drone ship off the coast of an island in The Bahamas on Tuesday, marking the \"first international landing of a first stage booster\" for the company.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/i/6691739879039/2025/1/17399222801735/v1.5/SpaceX-lands-booster-off-coast-of-Bahamas-for-first-time.jpg", "publishedAt": "2025-02-18T12:06:23Z", "content": "Feb. 18 (UPI) --SpaceX successfully landed the first stage of a rocket booster on its drone ship off the coast of an island in The Bahamas on Tuesday, in what was the \"first international landing of … [+1551 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Mars Rover Captures Video of Colorful Dry Ice Clouds Drifting Over Red Planet - Good News Network", "description": "Martian clouds are almost always made of dry ice, or frozen carbon dioxide. 95% of the planet's atmosphere is CO2.", "url": "https://www.goodnewsnetwork.org/mars-rover-captures-video-of-colorful-dry-ice-clouds-drifting-over-red-planet/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/Dry-ice-clouds-over-mars-credit-NASA-JPL.jpg", "publishedAt": "2025-02-18T12:00:33Z", "content": "Dry ice clouds over Mars – credit NASA / JPL / Caltech\r\nMaybe you were a kid the first time you ever saw dry ice: remember how strange it seemed compared to water ice?\r\nNASA’s Curiosity Mars rover re… [+2512 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope learns how a cosmic phoenix cools off to birth stars - Space.com", "description": "\"The Phoenix cluster has the largest reservoir of hot, cooling gas of any galaxy cluster.\"", "url": "https://www.space.com/jwst-pheonix-cluster-star-birth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qVjQe2RNsGVfWGxUvy5ZBB-1200-80.png", "publishedAt": "2025-02-18T10:00:00Z", "content": "How do you cool down a phoenix? I don't mean the mythological birds of flame and rebirth, but rather a cosmic namesake with a fittingly fiery nature.\r\nUsing the James Webb Space Telescope (JWST), ast… [+4915 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Thought They Made a Mistake – But It Led to a Groundbreaking “Molecular Einstein” Discovery - SciTechDaily", "description": "A strange molecular pattern, first mistaken for an error, led researchers to an unexpected discovery: molecules forming non-repeating structures similar to the einstein tiling problem. This phenomenon, driven by chirality and energy balance, could pave the wa…", "url": "https://scitechdaily.com/scientists-thought-they-made-a-mistake-but-it-led-to-a-groundbreaking-molecular-einstein-discovery/", "urlToImage": "https://scitechdaily.com/images/Aperiodic-Surface-Triangles-and-Defects-scaled.jpg", "publishedAt": "2025-02-18T09:21:36Z", "content": "Triangles and defects: Due to the chirality – the handedness – of the molecules, the individual triangular tiles never fit together perfectly. Defects and offsets occur, which give the surface its ap… [+5897 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Solar Orbiter ready for close encounter with Venus - European Space Agency", "description": "The European Space Agency (ESA) is ready to guide the ESA/NASA Solar Orbiter spacecraft through its closest encounter with Venus so far.Today’s flyby will be the first to significantly ‘tilt’ the spacecraft’s orbit and allow it to see the Sun’s polar regions,…", "url": "https://www.esa.int/Enabling_Support/Operations/Solar_Orbiter_ready_for_close_encounter_with_Venus", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2021/08/solar_orbiter_venus_flyby/23417421-1-eng-GB/Solar_Orbiter_Venus_flyby_pillars.jpg", "publishedAt": "2025-02-18T09:00:33Z", "content": "Enabling &amp; Support18/02/20251438 views28 likes\r\nThe European Space Agency (ESA) is ready to guide the ESA/NASA Solar Orbiter spacecraft through its closest encounter with Venus so far.\r\nTodays fl… [+4730 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Tom Nardi", "title": "Space Monitor Points Out Celestial Objects - Hackaday", "description": "Logically we understand that the other planets in the solar system, as well as humanity’s contributions to the cosmos such as the Hubble Space Telescope and the International Space Station, a…", "url": "https://hackaday.com/2025/02/18/space-monitor-points-out-celestial-objects/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/02/spacemon_feat.jpg", "publishedAt": "2025-02-18T09:00:00Z", "content": "Logically we understand that the other planets in the solar system, as well as humanity’s contributions to the cosmos such as the Hubble Space Telescope and the International Space Station, are zippi… [+1310 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Earth from space: A mysterious 'black hole' in Pacific Ocean that sparked wild rumors online - Livescience.com", "description": "This Google Maps image captured in 2021 revealed a mysterious, triangular dark patch in the middle of the Pacific Ocean, sparking bizarre rumors about its origin. However, it turned out to be a small island with incredibly dense tree coverage.", "url": "https://www.livescience.com/planet-earth/rivers-oceans/earth-from-space-a-mysterious-black-hole-in-pacific-ocean-that-sparked-wild-rumors-online", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Lb9ArmJWZkefcFPkCn3hSJ-1200-80.jpg", "publishedAt": "2025-02-18T08:00:00Z", "content": "Where is it? Vostok Island, Kiribati [-10.06285840, -152.311076]\r\nWhat's in the photo? A coral island covered in trees that make it look like a \"black hole\"\r\nWhere did the photo originate? Google Map… [+2738 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "30-Million-Year-Old Hypercarnivore Skull 'Dream Find' For Paleontologists - ScienceAlert", "description": "In Fayum, Egypt, where now lies a barren desert, a lush forest once stood, teeming with life.", "url": "https://www.sciencealert.com/30-million-year-old-hypercarnivore-skull-dream-find-for-paleontologists", "urlToImage": "https://www.sciencealert.com/images/2025/02/Hypercarnivore.jpg", "publishedAt": "2025-02-18T04:43:14Z", "content": "In Fayum, Egypt, where now lies a barren desert, a lush forest once stood, teeming with life.\r\nParadise for all creatures therein, however, it was not. The primates, hippopotamuses, elephants, and hy… [+3858 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Deep-Sea Telescope Just Detected the Most Energetic Ghost Particle Ever - SciTechDaily", "description": "A neutrino of record-breaking energy — 220 PeV — has been detected by the underwater KM3NeT telescope, marking a pivotal moment in astrophysics. This tiny but powerful particle, born from the universe’s most extreme events, provides fresh clues about cosmic a…", "url": "https://scitechdaily.com/a-deep-sea-telescope-just-detected-the-most-energetic-ghost-particle-ever/", "urlToImage": "https://scitechdaily.com/images/KM3NeT-Detector-Underwater.jpg", "publishedAt": "2025-02-18T03:25:51Z", "content": "A record-breaking neutrino detected in the Mediterranean may hold the key to understanding the most extreme events in the universe. Could it be from a cosmic accelerator — or something even more myst… [+8476 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Most Birds-of-Paradise Are Secretly Biofluorescent, Study Finds - ScienceAlert", "description": "Birds-of-paradise have some of the most famous mating displays in the world, but there's more to their colorful rhythmic gymnastics than initially meets the human eye.", "url": "https://www.sciencealert.com/most-birds-of-paradise-are-secretly-biofluorescent-study-finds", "urlToImage": "https://www.sciencealert.com/images/2025/02/BirdofParadise.jpg", "publishedAt": "2025-02-17T23:19:38Z", "content": "Birds-of-paradise have some of the most famous mating displays in the world, but there's more to their colorful rhythmic gymnastics than initially meets the human eye.\r\nFor the first time, scientists… [+5332 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Turning the Moon into a fuel depot will take a lot of power - Ars Technica", "description": "Getting oxygen from regolith takes 24 kWh per kilogram, and we’d need tonnes.", "url": "https://arstechnica.com/science/2025/02/turning-the-moon-into-a-fuel-depot-will-take-a-lot-of-power/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/image-2-1152x648.jpeg", "publishedAt": "2025-02-17T21:33:53Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Scientists Just Discovered Why Humans Burn Energy Like No Other Animal - SciTechDaily", "description": "Humans have evolved an exceptionally high metabolic rate, unlike any other known animal. Unlike primates that conserve energy by being less active, humans can stay on the move thanks to sweating, which prevents overheating. This metabolic advantage may have b…", "url": "https://scitechdaily.com/harvard-scientists-just-discovered-why-humans-burn-energy-like-no-other-animal/", "urlToImage": "https://scitechdaily.com/images/Human-Energy-Evolution-Metabolism-Art-Concept.jpg", "publishedAt": "2025-02-17T18:17:19Z", "content": "Humans have a uniquely high metabolism compared to other mammals, including our primate relatives. This allows us to fuel our large brains, extended lifespans, and high physical activity levels witho… [+5299 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Scientists accidentally discover Earth's inner core is less solid than expected - Space.com", "description": "The new research could help us better understand our planet's thermal and magnetic fields.", "url": "https://www.space.com/the-universe/earth/scientists-accidentally-discover-earths-inner-core-is-less-solid-than-expected", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gaWhPEE8sCbGjh944vk6rb-1200-80.jpg", "publishedAt": "2025-02-17T17:00:00Z", "content": "For a long time, scientists thought the Earth's inner core was a solid ball of metal\r\n, sort of like a planet within a planet that sits some 3,000 miles (4,828 kilometers) below the surface.\r\nHowever… [+2524 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "'We don't feel stranded': Astronauts 'stuck' in space set the record straight - Livescience.com", "description": "\"I think both of us will be a little bit sad when that feeling of space sort of leaves us.\"", "url": "https://www.space.com/space-exploration/international-space-station/boeing-starliner-astronauts-on-the-iss-set-the-story-straight-we-dont-feel-stranded", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eNaW8UkcKBGnouyqvBzHG9-1200-80.jpg", "publishedAt": "2025-02-17T16:42:29Z", "content": "Boeing's Starliner astronauts are in the final stretch of their unexpectedly long stint in Earth orbit — and they're setting the record straight on all the \"stranded astronauts\" talk.\r\nNASA's Suni Wi… [+4405 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Royal Astronomical Society", "title": "'Remarkable' cosmic explosion discovered in decades-old X-ray data - Phys.org", "description": "The \"needle in the haystack\" discovery of a powerful explosion from a mysterious unknown object outside our galaxy has excited astronomers.", "url": "https://phys.org/news/2025-02-remarkable-cosmic-explosion-decades-ray.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/mystery-of-remarkable.jpg", "publishedAt": "2025-02-17T16:39:03Z", "content": "The \"needle in the haystack\" discovery of a powerful explosion from a mysterious unknown object outside our galaxy has excited astronomers.\r\nIt went unnoticed for years within a vast, two decade-long… [+5017 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Eighteen new pulsars discovered with Arecibo data analysis - Phys.org", "description": "Astronomers from West Virginia University and elsewhere report the detection of 18 new pulsars using the Arecibo Observatory (AO) as part of the AO 327-MHz Drift Survey. The findings were detailed in a research paper published Feb. 6 on the arXiv pre-print se…", "url": "https://phys.org/news/2025-02-eighteen-pulsars-arecibo-analysis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/eighteen-new-pulsars-d.jpg", "publishedAt": "2025-02-17T16:20:01Z", "content": "Astronomers from West Virginia University and elsewhere report the detection of 18 new pulsars using the Arecibo Observatory (AO) as part of the AO 327-MHz Drift Survey. The findings were detailed in… [+3135 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Eleanor Higgs", "title": "Incredible 14.6-Million-Year-Old Fossil Bee Discovered In New Zealand - IFLScience", "description": "This is the first fossil bee species described from Zealandia.", "url": "https://www.iflscience.com/incredible-146-million-year-old-fossil-bee-discovered-in-new-zealand-78080", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78080/aImg/82183/fossil-bee-meta.png", "publishedAt": "2025-02-17T16:13:10Z", "content": "Finding fossils of any species is an exciting discovery for science, but some are a little bit more special than others. In New Zealand, a 14.6-million-year-old fossilized bee has been discovered, ma… [+2163 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "The Winter Triangle meets the 'Mars Triangle' in the night sky this month - Space.com", "description": "Enjoy the Mars Triangle while it still lasts, for after mid-March it will be no more.", "url": "https://www.space.com/winter-triangle-meets-mars-triangle-night-sky-feb-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rDRJHTJudGGYEXcrekJQ3k-1200-80.jpg", "publishedAt": "2025-02-17T16:00:00Z", "content": "We're now just past the midpoint of astronomical winter — that moment marking the midway point between December's winter solstice and March's vernal equinox. That moment took place at 4:11 p.m. Easte… [+8845 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "NASA nominee previews his vision for the agency: Mars, hard work, inspiration - Ars Technica", "description": "Jared Isaacman says NASA should invest a “reasonable amount of resources” in Mars.", "url": "https://arstechnica.com/space/2025/02/nasa-nominee-previews-his-vision-for-the-agency-mars-hard-work-inspiration/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/jared-1152x648.jpg", "publishedAt": "2025-02-17T15:39:44Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robin Smith", "title": "Weighing in on the W boson measurement conundrum - Phys.org", "description": "One of the tiniest building blocks of the universe has a weigh-in problem, and Ashutosh Kotwal is determined to get to the bottom of it.", "url": "https://phys.org/news/2025-02-boson-conundrum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/weighing-in-on-a-puzzl.jpg", "publishedAt": "2025-02-17T15:24:05Z", "content": "One of the tiniest building blocks of the universe has a weigh-in problem, and Ashutosh Kotwal is determined to get to the bottom of it.\r\nFor nearly 30 years, the Duke physicist has led a worldwide e… [+7875 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Does the moon look smaller tonight? Here's why a 'micromoon' rises - Space.com", "description": "The moon's orbit is elliptical, or oval-shaped, meaning as its distance from our planet changes, its apparent size changes, too — but only slightly.", "url": "https://www.space.com/the-moon-apogee-smaller-micromoon-february-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tqopbcnjwUkZ4oXzGVH7dm-1200-80.jpg", "publishedAt": "2025-02-17T15:00:00Z", "content": "If you're an avid moon-watcher, you might notice that our moon appears just a tiny bit smaller in the night sky tonight.\r\nOn Monday (Feb. 17), the moon reaches what's known as apogee  — its farthest … [+2843 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Breakthrough Solar Reactor Converts CO2 into Fuel, Changing the Game for Clean Energy - The Daily Galaxy --Great Discoveries Channel", "description": "A team of researchers at the University of Cambridge has developed a groundbreaking solar reactor that captures carbon dioxide from the air and converts it into valuable fuels and chemicals. By harnessing solar energy, the reactor transforms harmful CO2 into …", "url": "https://dailygalaxy.com/2025/02/solar-reactor-converts-co2-into-fuel/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Breakthrough-Solar-Reactor-Converts-CO2-into-Fuel-Changing-the-Game-for-Clean-Energy.jpg", "publishedAt": "2025-02-17T15:00:00Z", "content": "A team of researchers at the University of Cambridge has developed an innovative solar-powered reactor that takes carbon dioxide (CO2) directly from the atmosphere and converts it into a usable gas t… [+3764 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "AI Reveals How Brain Cells Evolved Over 320 Million Years - Neuroscience News", "description": "A new study reveals how AI-driven deep learning models can decode the genetic regulatory switches that define brain cell types across species.", "url": "https://neurosciencenews.com/ai-genetics-brain-evolution-28421/", "urlToImage": "https://neurosciencenews.com/files/2025/02/ai-brain-evolution-neurosience.jpg", "publishedAt": "2025-02-17T14:53:20Z", "content": "Summary: A new study reveals how AI-driven deep learning models can decode the genetic regulatory switches that define brain cell types across species. By analyzing human, mouse, and chicken brains, … [+10041 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Maria Mocerino", "title": "UK’s Thames river has been a watery grave for over 6,000 years: Study - Interesting Engineering", "description": "Most of the bodies plunged into UK's Thames river are from the Bronze and Iron Ages, as per the findings of the study.", "url": "https://interestingengineering.com/culture/thames-watery-grave-reveals-study", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/palace-530055_1920-1-1.jpg", "publishedAt": "2025-02-17T14:43:00Z", "content": "Another expert saidthat the latest research has moved the arguments along, but the funerary origins of these remains have yet to be completely studied and demonstrated.\r\nBut before researchers could … [+973 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Watch the sun erupt in new images from NOAA's weather satellite - Space.com", "description": "\"Every hour counts when you're dealing with CMEs.\"", "url": "https://www.space.com/the-universe/sun/watch-the-sun-erupt-in-new-images-from-noaas-weather-satellite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/snHDZcU8Ntz5tsCwEsHTga-1200-80.png", "publishedAt": "2025-02-17T14:00:00Z", "content": "A space-based telescope has captured new images of the sun that showcase one of our star's fiery outbursts.\r\nThe fresh visuals come courtesy of the National Oceanic and Atmospheric Administration (NO… [+2452 chars]"}, {"source": {"id": null, "name": "Paradepets.com"}, "author": "Eve Vawter", "title": "'Scrawny' Ragdoll Cat's Epic Transformation Is a Giant Fluffy Glow-Up - Yahoo Life", "description": "He's so big and floofy!", "url": "https://paradepets.com/pet-news/scrawny-ragdoll-cat-grows-up-giant-fluffy", "urlToImage": "https://media.zenfs.com/en/parade_pets_articles_328/cd90905ec6f8377d58a7db719d93f2fb", "publishedAt": "2025-02-17T13:05:00Z", "content": "When you adopt a cat or dog, you may not be sure how they will look when they grow up, even with a purebred. Plus, some breeds of pets go through a stage called the uglies, where their puppy or kitty… [+2293 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Springer Nature retracted 2,923 papers last year - Retraction Watch", "description": "The 3,000+ journals in the Springer Nature portfolio published over 482,000 articles in 2024, according to data published this week on a new research integrity page on the company’s website. The pa…", "url": "https://retractionwatch.com/2025/02/17/springer-nature-journal-retractions-2024/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2025/02/SN_Uni_Blue_stack_RGB.jpg", "publishedAt": "2025-02-17T13:00:00Z", "content": "The 3,000+ journals in the Springer Nature portfolio published over 482,000 articles in 2024, according to data published this week on a new research integrity page on the companys website. The page … [+2505 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover ‘Hidden Pipe System’ Beneath Antarctic Glaciers, Speeding Up Ice Loss - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath Antarctica’s frozen surface, scientists have uncovered a vast hidden water network that could be influencing glacier movement. This unsuspected system appears to be accelerating ice flow toward the ocean in ways never fully understood. The discov…", "url": "https://dailygalaxy.com/2025/02/scientists-uncover-hidden-pipe-system-beneath-antarctic-glaciers-speeding-up-ice-loss/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Hidden-Pipe-System-Beneath-Antarctic.jpg", "publishedAt": "2025-02-17T12:30:00Z", "content": "A newly discovered subglacial water network is playing a significant role in how Antarcticas ice sheets move toward the ocean. Using advanced computer models, researchers have mapped the hidden plumb… [+3601 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Neutrinos' Quantum Size Likely Thousands Of Times Larger Than Atomic Nuclei - IFLScience", "description": "You'd think that size would make them easier to detect, but alas.", "url": "https://www.iflscience.com/neutrinos-quantum-size-likely-thousands-of-times-larger-than-atomic-nuclei-78076", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78076/aImg/82181/schematic-of-the-stj-sensor-meta.png", "publishedAt": "2025-02-17T12:16:02Z", "content": "The quantum size of a neutrino has been measured for the first time using innovative table-top measurements of the particles decay.Neutrinos are thought to be the second most common particles in the … [+3298 chars]"}, {"source": {"id": null, "name": "Minneapolis Star Tribune"}, "author": "Lisa Meyers McClintick, Lisa Meyers McClintick", "title": "Rare parade of seven planets visible in Minnesota sky soon - Star Tribune", "description": "The parade will be on display just after dusk Feb. 23-25. But bring binoculars.", "url": "https://www.startribune.com/rare-parade-of-seven-planets-visible-in-minnesota-sky-soon/601224127", "urlToImage": "https://arc.stimg.co/startribunemedia/B3NE3ERPFVE2PHMJAXDG43N3YA.JPG?&w=1200&ar=1.91:1&fit=crop", "publishedAt": "2025-02-17T12:07:18Z", "content": "Make time soon to head outside after the sun sets and study the sky. Five of the brightest planets Venus, Jupiter, Mars, Mercury and Saturn and even the faint Neptune and Uranus will align in a rare … [+1317 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "NASA rover discovers liquid water 'ripples' carved into Mars rock — and it could rewrite the Red Planet's history - Yahoo", "description": "NASA's Curiosity rover photographed remnants of rippling waves in an ancient Martian lakebed, proving that the Red Planet had open water for longer in its...", "url": "https://www.livescience.com/space/mars/nasa-rover-discovers-liquid-water-ripples-carved-into-mars-rock-and-it-could-rewrite-the-red-planets-history", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9ePtns1KOcVniLZSMHlqyw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/3ff7dea7ddb60db85e0e061dcd832c4b", "publishedAt": "2025-02-17T12:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nNASAs Mars Curiosity rover discovered symmetric ripple marks at two separate spots within the R… [+3266 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Just Mapped the Hidden Quantum World of Electrons - SciTechDaily", "description": "A new method finally reveals the full quantum identity of electrons, offering insights that could transform material science and quantum applications. For the first time, scientists have successfully measured the quantum state of electrons released from atoms…", "url": "https://scitechdaily.com/physicists-just-mapped-the-hidden-quantum-world-of-electrons/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nuclear-Physics-Concept-Art.jpg", "publishedAt": "2025-02-17T11:43:24Z", "content": "For over a century, scientists have studied how light ejects electrons from atoms, but this research takes it a step further—by measuring not just their speed but their full quantum state. Using ultr… [+9026 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Thomas Moynihan", "title": "How humanity moved from ‘eternal’ to ‘bookended’ time - Aeon", "description": "Nothing lasts forever: not humanity, not Earth, not the Universe. But finitude confers an indelible meaning to our lives", "url": "https://aeon.co/essays/how-humanity-moved-from-eternal-to-bookended-time", "urlToImage": "https://images.aeonmedia.co/images/2ea19bc2-c917-46ce-9aa4-6ef8d20fceed/essay-v2-1975_142_full.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-02-17T11:04:25Z", "content": "Do you recall the first time you knew you would die? Its a milestone, realising your time is limited. That things happened before you, and will happen afterward, in your absence.\r\nAs we grow up, the … [+29692 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Nola Taylor Tillman", "title": "Some planet-forming stars never 'grow up' and lose their 'Peter Pan' disks - Space.com", "description": "\"We described them as 'never growing up' because they have maintained their primordial disk long after the expected time frame for primordial disks to have dissipated.\"", "url": "https://www.space.com/stars-planet-forming-disks-peter-pan", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UtFNZvezYusFeMBpB6UoQE-1200-80.jpg", "publishedAt": "2025-02-17T11:00:00Z", "content": "Planet formation around low-mass stars may be suffering from Peter Pan syndrome. While previous observations and models have suggested that a disk of planetary building blocks should be 'fully grown'… [+7502 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Astronomers realize mysterious TV signal in their data bounced off an airplane - Space.com", "description": "Rogue TV signals have plagued the Murchison Wide-field Array for five years.", "url": "https://www.space.com/space-exploration/tech/astronomers-realize-mysterious-tv-signal-in-their-data-bounced-off-an-airplane", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R4Lb6pQX99swoLwVGeWFUD-1200-80.jpg", "publishedAt": "2025-02-17T10:00:00Z", "content": "The sky is awash with radio-frequency interference (RFI), but thanks to two astronomers who tracked down a stray TV broadcast reflected off a passing airplane, there may be a new way to wipe out some… [+4738 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A 69-Million-Year Evolutionary Mystery: Scientists Discover Oldest Modern Bird - SciTechDaily", "description": "New clues explore the age-old question: Does a duck always look like a duck and quack like a duck? Sixty-six million years ago, at the end of the Cretaceous Period, an asteroid impact near the Yucatán Peninsula in Mexico triggered the extinction of all known …", "url": "https://scitechdaily.com/a-69-million-year-evolutionary-mystery-scientists-discover-oldest-modern-bird/", "urlToImage": "https://scitechdaily.com/images/Vegavis-iaai-Illustration-scaled.jpg", "publishedAt": "2025-02-17T09:21:34Z", "content": "The Late Cretaceous modern (crown) bird, Vegavis iaai, pursuit diving for fish in the shallow ocean off the coast of the Antarctic peninsula, with ammonites and plesiosaurs for company. Credit: Mark … [+7920 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "A Growth Spurt for Home Reef - nasa.gov", "description": "A small island in Tonga built by an underwater volcano in 2022 has grown larger.", "url": "https://earthobservatory.nasa.gov/images/153941/a-growth-spurt-for-home-reef", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/153000/153941/homereef_oli_20250202_th.jpg", "publishedAt": "2025-02-14T17:31:24Z", "content": null}]}