{"status": "ok", "totalResults": 45, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beneath the Ice: Titan’s Six-Mile-Deep Methane Crust Could Rewrite Planetary Science - SciTechDaily", "description": "Research on Titan has uncovered a significant layer of methane clathrate ice that explains its shallow craters and warm interior. This discovery offers new insights into Titan's methane-rich atmosphere and its potential to support life, setting the stage for …", "url": "https://scitechdaily.com/beneath-the-ice-titans-six-mile-deep-methane-crust-could-rewrite-planetary-science/", "urlToImage": "https://scitechdaily.com/images/Titans-Interior.png", "publishedAt": "2024-10-27T21:06:13Z", "content": "Proposed diagram of Titan’s interior (not to scale), showing a methane clathrate crust over a convecting ice shell. Credit: Schurmeier, et al., 2024\r\nResearch on Titan has uncovered a significant lay… [+5712 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We Finally Know Where to Look For The Universe's Most Sought-After Particle - ScienceAlert", "description": "Neutron stars with a penchant for extreme spinning could be churning out one of the most sought-after particles in the Universe.", "url": "https://www.sciencealert.com/we-finally-know-where-to-look-for-the-universes-most-sought-after-particle", "urlToImage": "https://www.sciencealert.com/images/2024/10/pulsar-pitris.jpg", "publishedAt": "2024-10-27T20:01:28Z", "content": "Neutron stars with a penchant for extreme spinning could be churning out one of the most sought-after particles in the Universe.\r\nThese elementary particles are called axions, and to date they are pu… [+4708 chars]"}, {"source": {"id": null, "name": "Foxweather.com"}, "author": "Emilee Speck", "title": "Geomagnetic Storm Watch issued after strong flare erupts from Sun - Fox Weather ", "description": "Those in the northern tier could be in for a Northern Lights show Sunday and Monday nights after charged particles were sent blasting from the Sun toward Earth in association with a strong solar flare.", "url": "https://www.foxweather.com/earth-space/geomagnetic-storm-watch-strong-solar-flare", "urlToImage": "https://images.foxweather.com/static.foxweather.com/www.foxweather.com/content/uploads/2024/10/1024/512/img_3507-scaled.jpg?ve=1&tl=1", "publishedAt": "2024-10-27T17:40:00Z", "content": "Those in the northern tier could be in for a Northern Lights show Sunday and Monday nights after charged particles were sent blasting from the Sun toward Earth in association with a strong solar flar… [+1521 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Molly Bohannon", "title": "Northern Lights Forecast: Here’s Where You Could See Aurora Borealis Tonight - Forbes", "description": "The northern lights may be visible as far south as northern Iowa on Sunday night into Monday morning, according to the National Oceanic and Atmospheric Administration.", "url": "https://www.forbes.com/sites/mollybohannon/2024/10/27/northern-lights-forecast-heres-where-you-could-see-aurora-borealis-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/671e5cf01b30e4d820c1f3f8/0x0.jpg?format=jpg&crop=1522,857,x0,y157,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-27T15:32:38Z", "content": "A number of states across the northern United States might be able to catch a glimpse of the northern lights Sunday night into Monday morning, according to the National Oceanic and Atmospheric Admini… [+2649 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Sinead Butler", "title": "Africa is starting to split into two and form Earth's sixth's ocean - here's why - indy100", "description": "Back in the day (and by that, we mean around 230 million years ago), there used to be one big supercontinent called Pangea but as we all know this slowly broke apart what emerged the continental drift is the world we’re familiar with today.Although it’s hard …", "url": "https://www.indy100.com/science-tech/africa-split-in-two-sixth-ocean", "urlToImage": "https://www.indy100.com/media-library/what-if-pangea-never-broke-apart.jpg?id=53890983&width=1200&height=600&coordinates=0%2C107%2C0%2C247", "publishedAt": "2024-10-27T15:18:30Z", "content": "Back in the day (and by that, we mean around 230 million years ago), there used to be one big supercontinent called Pangea but as we all know this slowly broke apart what emerged the continental drif… [+3664 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Researchers uncovered the ‘glue’ that holds memories together in our brains - BGR", "description": "New research has finally helped us understand how the brain stores long-term memories, and it's all connected to molecular interactions.", "url": "https://bgr.com/science/researchers-uncovered-the-glue-that-holds-memories-together-in-our-brains/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/03/AdobeStock_530060073.jpg?quality=82&strip=all", "publishedAt": "2024-10-27T14:34:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Scientists discover a promising way to create new superheavy elements - Phys.org", "description": "What is the heaviest element in the universe? Are there infinitely many elements? Where and how could superheavy elements be created naturally?", "url": "https://phys.org/news/2024-10-scientists-superheavy-elements.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/researchers-discover-a-14.jpg", "publishedAt": "2024-10-27T13:00:01Z", "content": "What is the heaviest element in the universe? Are there infinitely many elements? Where and how could superheavy elements be created naturally?\r\nThe heaviest abundant element known to exist is uraniu… [+6001 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope sees lonely supermassive black hole-powered quasars in the early universe - Livescience.com", "description": "The James Webb Space Telescope has discovered lonely quasars in the early universe, with \"empty larders\" that defy theories surrounding their growth to monster sizes.", "url": "https://www.space.com/james-webb-space-telescope-ancient-black-hole-quasar", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ayWNpYYRX8WxfUHLpgZbqD-1200-80.jpg", "publishedAt": "2024-10-27T13:00:00Z", "content": "Using the James Webb Space Telescope, astronomers have peered back 13 billion years to discover surprisingly lonely supermassive black hole-powered quasars.\r\nThe James Webb Space Telescope's (JWST) o… [+6923 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "This small ground beetle is rekindling debate on Darwin’s theory of evolution - South China Morning Post", "description": "A tiny insect that survived the extinction event which killed the dinosaurs throws up questions for evolutionary theory.", "url": "https://www.scmp.com/news/china/science/article/3283794/small-ground-beetle-rekindling-debate-darwins-theory-evolution", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/10/25/8081a02c-c8f6-437d-8781-d71e4830f57d_e5f4188c.jpg?itok=2WcuugHi&v=1729829326", "publishedAt": "2024-10-27T12:00:07Z", "content": "When a mass extinction event 66 million years ago wiped out three-quarters of the worlds plants and animals including the dinosaurs among the survivors was a tiny, black beetle.\r\nThe Cretaceous-Paleo… [+1021 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "What next for NASA's Europa Clipper? The long road to Jupiter and its moons - Space.com", "description": "The NASA mission to Europa has some stops to make on the way.", "url": "https://www.space.com/europa-clipper-what-next-jupiter-moons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qGZPin8Hf9UfYTe28eN2aU-1200-80.png", "publishedAt": "2024-10-27T10:00:01Z", "content": "On Oct. 14, NASA's Europa Clipper spacecraft began a vital mission. It will be investigating the potential habitability of Jupiter's icy ocean moon Europa — but first, it has to get there.\r\nThough no… [+7092 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "UiT The Arctic University of Norway", "title": "Melting Arctic sea-ice could affect global ocean circulation, study warns - Phys.org", "description": "The warming climate in polar regions may significantly disrupt ocean circulation patterns, a new study indicates. Scientists discovered that in the distant past, growing inflows of freshwater from melting Arctic sea-ice into the Nordic Seas likely significant…", "url": "https://phys.org/news/2024-10-arctic-sea-ice-affect-global.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-study-warns-that-m.jpg", "publishedAt": "2024-10-27T10:00:01Z", "content": "The warming climate in polar regions may significantly disrupt ocean circulation patterns, a new study indicates. Scientists discovered that in the distant past, growing inflows of freshwater from me… [+3926 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "Space photo of the week: Hubble spots a stellar 'H-bomb' exploding in Aquarius at 1 million mph - Livescience.com", "description": "A pulsating red star and its spectacular nebula have been captured by NASA's Hubble Space Telescope.", "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-hubble-spots-a-stellar-h-bomb-exploding-in-aquarius-at-1-million-mph", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zFb9WWXcBH8BPTCXUi7uaF-1200-80.jpg", "publishedAt": "2024-10-27T10:00:00Z", "content": "What it is: The variable binary star R Aquarii and the Cederblad 211 nebula\r\nWhere it is: 710 light-years away, in the constellation Aquarius\r\nWhen it was shared: Oct. 16, 2024\r\nWhy it's so special: … [+2371 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "iain.todd@ourmedia.co.uk", "title": "Why do stars in James Webb Space Telescope images have eight spikes emanating from their centre? - Sky at Night Magazine", "description": "Wonder why stars in James Webb Space Telescope images have eight spikes coming from the centre? It's all to do with Webb's optical structure.", "url": "https://www.skyatnightmagazine.com/space-science/why-stars-in-webb-images-have-eight-diffraction-spikes", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2024/10/webb-eight-diffraction-spikes-social.jpg?w=1200", "publishedAt": "2024-10-27T08:37:53Z", "content": "There are a few ways to tell you're looking at a James Webb Space Telescope image, and one key feature is the eight spikes emanating from stars in the pictures it captures.\r\nYou may have noticed thes… [+3450 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Comet Tracker Tonight: Sunday’s Sky Charts To Find It Before It Goes - Forbes", "description": "How, when, and where to look to see Comet C/2023 A3 (Tsuchinshan-ATLAS) after sunset this Sunday, Oct. 27, with sky charts, before it disappears.", "url": "https://www.forbes.com/sites/jamiecartereurope/2024/10/27/comet-tracker-tonight-sundays-sky-charts-to-find-it-before-it-goes/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/670eaee336009ed646d917fb/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-27T05:00:00Z", "content": "Citizens next to a decaying, unusable boat observe the Comet Tsuchinshan-Atlas, the C/2023 A3 ... [+] Tsuchinshan-Atlas comet, the brightest comet of the last 13 years in Van, Turkiye on October 15, … [+3103 chars]"}, {"source": {"id": null, "name": "Upworthy"}, "author": "Vidhya M.", "title": "Astronaut who observed Earth from space for 178 days says he realized humanity is 'living a lie' - Upworthy", "description": "", "url": "https://scoop.upworthy.com", "urlToImage": "https://d34zrgnx1tq8w.cloudfront.net/704693/uploads/3b9b2fb0-401d-11ef-9bb5-77ab9c1d99a7_1200_630.jpeg", "publishedAt": "2024-10-27T04:18:46Z", "content": "It takes a lot of arduous experiences in life to develop a philosophical mindset. Many achievers who have attained greatness in a field only after going through strenuous life experiences have realiz… [+3556 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Mysterious New Objects Beyond the Edge of the Solar System - SciTechDaily", "description": "The Subaru Telescope has discovered new objects beyond the known Kuiper Belt, suggesting a more complex structure at the edge of the Solar System. This finding could reshape our understanding of planet formation and boost the search for life outside Earth. Us…", "url": "https://scitechdaily.com/?p=424651", "urlToImage": "https://scitechdaily.com/images/Kuiper-Belt-Object-Art-Concept.jpg", "publishedAt": "2024-10-27T03:55:48Z", "content": "Observations with the Subaru Telescope have uncovered new objects in the outer Solar System, suggesting a larger, undiscovered population beyond the Kuiper Belt. This discovery reshapes our understan… [+6171 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Quantum entanglement speed is measured for the first time, and it's too fast to comprehend - Earth.com", "description": "Quantum entanglement is where two particles become interconnected and share a single state. But how and when do particles become entangled?", "url": "https://www.earth.com/news/quantum-entanglement-speed-measured-for-first-time-too-fast-to-comprehend/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/22200741/quantum-entanglement_electrons_atoms_speed_1.jpg", "publishedAt": "2024-10-27T00:25:38Z", "content": "In the world of quantum physics, events unfold at mind-boggling speeds. Processes once thought to happen in an instant, like quantum entanglement, are now being examined in the tiniest fractions of a… [+5711 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "Webb Scans Vega for Planets - Universe Today", "description": "To northern sky watchers, Vega is a familiar sight in the summer sky. It’s one of the brightest stars in the sky and in 2013, astronomers detected a large ring of rocky debris surrounding the planet. The prospect of planets suddenly became a real possibility …", "url": "https://www.universetoday.com/169041/webb-scans-vega-for-planets/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/10/Vega.jpg", "publishedAt": "2024-10-26T22:57:55Z", "content": "To northern sky watchers, Vega is a familiar sight in the summer sky. Its one of the brightest stars in the sky and in 2013, astronomers detected a large ring of rocky debris surrounding the planet. … [+3249 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "SpaceX sends 22 Starlink satellites into orbit in record-setting launch - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2024-10-26T22:41:17Z", "content": ""}, {"source": {"id": null, "name": "BBC News"}, "author": "Krupa Padhy", "title": "'It's a unique language spoken by two people': The twins who created their own language - BBC.com", "description": "Up to 50% of twins develop their own communication pattern with one another. Most lose it over time, but for the Youlden twins it has become a normal way of communicating.", "url": "https://www.bbc.com/future/article/20241025-do-twins-have-a-secret-language", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0k06spv.jpg", "publishedAt": "2024-10-26T22:40:12Z", "content": "(Credit: Matthew and Michael Youlden/ Superpolyglotbros)\r\nUp to 50% of twins develop their own communication pattern with one another. Most lose it over time, but for the Youlden twins it has become … [+9257 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Were Wrong: Plants Absorb 31% More CO2 Than Previously Thought - SciTechDaily", "description": "New research shows plants absorb 31% more CO2 than previously estimated, raising the global GPP to 157 petagrams per year. Using carbonyl sulfide as a proxy for photosynthesis, this study highlights tropical rainforests' critical role as carbon sinks and stre…", "url": "https://scitechdaily.com/scientists-were-wrong-plants-absorb-31-more-co2-than-previously-thought/", "urlToImage": "https://scitechdaily.com/images/Tree-Forest-Fog-Carbon-Sequestration-Art.jpg", "publishedAt": "2024-10-26T22:31:48Z", "content": "Scientists have found that plants absorb 31% more carbon dioxide than previously estimated, improving climate predictions and highlighting the importance of natural carbon sinks. The new estimate of … [+6736 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Gemini North Telescope Captures Breathtaking View of Perseus Galaxy Cluster - The Daily Galaxy --Great Discoveries Channel", "description": "The Gemini North telescope has captured an awe-inspiring image of the Perseus galaxy cluster, revealing its complex array of galaxies, intra-cluster light, and intergalactic dust. This latest image, featuring the massive elliptical galaxy NGC 1270, highlights…", "url": "https://dailygalaxy.com/2024/10/gemini-north-perseus-galaxy-cluster/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/Gemini-North-Telescope-Captures-Breathtaking-View-of-Perseus-Galaxy-Cluster.jpg", "publishedAt": "2024-10-26T21:00:30Z", "content": "The Gemini North telescope atop Mauna Kea in Hawaii has delivered a stunning new image of the Perseus galaxy cluster, a massive structure located approximately 240 million light-years from Earth.\r\nTh… [+4892 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "SLS preparations underway for Artemis II and future missions - NASASpaceflight.com", "description": "NASA’s Space Launch System, the other Saturn V-class heavy lift vehicle launched this decade, is…", "url": "https://www.nasaspaceflight.com/2024/10/sls-update/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/10/IMG_9958.jpeg", "publishedAt": "2024-10-26T19:25:52Z", "content": "8NASAs Space Launch System, the other Saturn V-class heavy lift vehicle launched this decade, is being prepared for its second flight and its first crew-carrying flight, even as issues with the Orion… [+6831 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Deirdre Bardolf", "title": "NASA astronaut released from hospital after overnight stay following extended mission in space - New York Post ", "description": "Four astronauts were hospitalized after returning to Earth from an eight-month mission to the International Space Station, and one of them remains in the hospital in stable condition.", "url": "https://nypost.com/2024/10/26/us-news/nasa-astronaut-remains-in-the-hospital-after-returning-from-an-extended-stay-in-space/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/10/newspress-collage-83soycm98-1729920451011.jpg?quality=75&strip=all&1729906120&w=1024", "publishedAt": "2024-10-26T19:12:36Z", "content": "Four astronauts were hospitalized after returning to Earth from an eight-month mission to the International Space Station, and one of them was kept overnight in stable condition.\r\nThree NASA astronau… [+3725 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earth's mantle is split into two halves thanks to supercontinent Pangaea - Livescience.com", "description": "The mantle is split up into two domains — the African and the Pacific — that emerged when supercontinent Pangaea broke apart.", "url": "https://www.livescience.com/planet-earth/geology/earths-mantle-is-split-into-two-halves-thanks-to-supercontinent-pangaea", "urlToImage": "https://cdn.mos.cms.futurecdn.net/daaxnsrEzHZg6563amaa6T-1200-80.jpg", "publishedAt": "2024-10-26T18:00:00Z", "content": "Earth's mantle is split by the Pacific Ring of Fire, an ancient schism that reflects the creation and destruction of the supercontinent Pangaea\r\n, a new study finds.\r\nOne of these sections contains m… [+4082 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Atmospheric Rivers on the Move: What Poleward Shifts Mean for Future Weather Patterns - The Daily Galaxy --Great Discoveries Channel", "description": "Atmospheric rivers are migrating poleward, altering weather patterns and rainfall distribution worldwide. This shift, observed over the past four decades, could result in more droughts in lower latitudes and intensified storms and flooding further north, pres…", "url": "https://dailygalaxy.com/2024/10/atmospheric-rivers-move-poleward-shifts/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/Atmospheric-Rivers-on-the-Move-What-Poleward-Shifts-Mean-for-Future-Weather-Patterns.jpg", "publishedAt": "2024-10-26T17:00:34Z", "content": "A recent study has revealed that atmospheric riversnarrow streams of concentrated water vapor responsible for significant rainfall and snowfallare migrating poleward.\r\nOver the past 40 years, these s… [+5116 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Taylor Nicioli, CNN", "title": "Fossil trapped in amber reveals previously unknown species that lived during time of dinosaurs - KSL.com", "description": "When dinosaurs roamed Earth, their surroundings looked very different than the world of today. But there were also some similarities. And now scientists have confirmed a new one: Diverse firefly species lit up the night during the late Mesozoic.", "url": "https://www.ksl.com/article/51163308/fossil-trapped-in-amber-reveals-previously-unknown-species-that-lived-during-time-of-dinosaurs", "urlToImage": "https://img.ksl.com/slc/3020/302020/30202044.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2024-10-26T16:27:44Z", "content": "When dinosaurs roamed Earth, their surroundings looked very different than the world of today. But there were also some similarities. And now scientists have confirmed a new one: Diverse firefly spec… [+4943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "Groundbreaking telescope reveals first piece of new cosmic map - CNN", "description": "This week, see how new telescopes may reshape how astronomers view the cosmos, discover forgotten medieval cities, learn about fireflies’ early evolution, and more.", "url": "https://www.cnn.com/2024/10/26/science/euclid-vera-rubin-telescope-science-newsletter-wt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231107080435-01-euclid-space-telescope-first-images-perseus-cluster-of-galaxies.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-10-26T15:00:00Z", "content": "Editors note: A version of this story appeared in CNNs Wonder Theory science newsletter. To get it in your inbox, sign up for free here.\r\nGreetings, earthlings! Im Jackie Wattles, and Im thrilled to … [+5494 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": null, "title": "The Dinosaur Age Ended With Two Asteroids, Scientists Say - CNET", "description": "The impact site of the second asteroid is called the Nadir crater, where rock was liquified and a tsunami launched into the Atlantic Ocean.", "url": "https://www.cnet.com/science/the-dinosaur-age-ended-with-two-asteroids-scientists-say/", "urlToImage": "https://www.cnet.com/a/img/resize/aaca16cc2ef71bdf3325776dac6bff754573f0e1/hub/2024/10/04/2b64b0fb-1d7b-4764-a005-8bc7d75ce219/gettyimages-1359393176.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2024-10-26T14:20:00Z", "content": "The only thing worse than getting punched in the face is getting hit twice. That's almost precisely what happened to the dinosaurs, Scientists now say -- just on a much, much larger scale. The astero… [+3307 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "This Week In Space podcast: Episode 134 — The Spruce Space Shuttle - Space.com", "description": "Ben Dickow and the Columbia Memorial Space Center", "url": "https://www.space.com/entertainment/space-movies-shows/this-week-in-space-podcast-this-week-in-space-podcast-episode-134-spruce-space-shuttle", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Eak6braQf3BxVcnis5s33g-1200-80.jpg", "publishedAt": "2024-10-26T14:05:01Z", "content": "On Episode 134 of This Week In Space, Rod Pyle and Tariq Malik talk with Ben Dickow, executive director and president of the Columbia Memorial Space Center, about a magnificent, full-sized shuttle mo… [+2454 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Here is what the new space station, soon to be launched into orbit, will look like. - The Daily Galaxy --Great Discoveries Channel", "description": "The future of space exploration is about to take a giant leap forward with the unveiling of a revolutionary new space station. As the International Space Station (ISS) approaches its planned decommissioning in 2030, private companies are stepping up to fill t…", "url": "https://dailygalaxy.com/2024/10/new-space-station-sneak-peek-futuristic-orbital-hub-coming-soon/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/new-space-station-sneak-peek-futuristic-orbital-hub-coming-soon.jpg", "publishedAt": "2024-10-26T14:00:00Z", "content": "Vast Space's proposed station is a testament to innovative design and engineering. The structure will consist of nine interconnected modules, creating a spacious and versatile environment for astrona… [+4771 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Space Tourist Alarmed When Vision Starts to Deteriorate - Futurism", "description": "A space tourist slash civilian astronaut on the Polaris Dawn mission suffered immediate vision problems once in orbit.", "url": "https://futurism.com/the-byte/space-tourist-vision-deteriorate", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/space-tourist-vision-deteriorate.jpg", "publishedAt": "2024-10-26T12:30:27Z", "content": "Terrifying.\r\nAye-Eye!\r\nScientists are still trying to understand the toll that spaceflight takes on the human body.\r\nWith SpaceX's civilian Polar Dawn mission, which lasted five days and wrapped up l… [+2626 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Rocket Launch Threatened by Sliced Cheese Stuck on Leg - Futurism", "description": "During an important rocket test, some students decided to strap some cheese onto one of the craft's landing legs.", "url": "https://futurism.com/the-byte/rocket-launch-sliced-cheese-leg", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/rocket-launch-sliced-cheese-leg.jpg", "publishedAt": "2024-10-26T12:00:26Z", "content": "\"Yes, it was indeed gruyère, and it almost caused a disaster!\"\r\nCrisis Averted\r\nDuring an important rocket test, some students decided to strap some cheese onto one of the craft's landing legs and go… [+1994 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Conor Feehly", "title": "Most of Earth's meteorites may have come from the same 3 spots - Livescience.com", "description": "Scientists say they've uncovered where the vast majority of Earth's meteorites came from.", "url": "https://www.space.com/earth-meteorites-asteroid-families", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wMpbw8deAJCmGXfyTXxtmh-1200-80.jpg", "publishedAt": "2024-10-26T12:00:00Z", "content": "Earth is constantly getting pummeled by meteorites. We are unaware of most of them, as they burn up in our atmosphere before they hit the ground. Every now and again, though, something larger gets dr… [+2566 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "sahas, Buzz Staff", "title": "In Italy, Archaeologists Find Remains Of 16-months Old Dated Back 17,000 Years Ago - News18", "description": "This discovery was described as a \"remarkable achievement\" by Alessandra Modi, an anthropologist from the University of Florence and a co-author of this journal.", "url": "https://www.news18.com/viral/in-italy-archaeologists-find-remains-of-16-months-old-dated-back-17000-years-ago-9100121.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/10/untitled-design-2024-10-26t163715.286-2024-10-ee3ec7b57e261add2919e9932a29e87c-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-10-26T11:07:35Z", "content": "Last Updated:October 26, 2024, 16:37 IST\r\nDNA examination of the remains revealed that the youngster had wavy dark brown hair.\r\nVarious kinds of startling discoveries are made by scientists all acros… [+3225 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Quantum secret of hydrogen bonds in liquid water revealed for the first time - Interesting Engineering", "description": "Researchers at the Swiss Federal Institute of Technology Lausanne (EPFL) claim to have developed a new method that can allow scientists to study the electronic and nuclear quantum effects of liquid water’s hydrogen bonds in depth.", "url": "https://interestingengineering.com/science/hydrogen-bond-quantum-secret-liquid-water", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/largest-operating-tokamak-76.png?w=1920", "publishedAt": "2024-10-26T10:54:00Z", "content": "For the first time, scientists have an experimental method to investigate this phenomenon and various other aspects of the H-bond in liquid water.\r\nCorrelated vibrational spectroscopy (CVS) enables s… [+728 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "University of Virginia", "title": "Graphene-enhanced 3D-printed concrete reduces carbon emissions by 31% - Tech Xplore", "description": "Researchers from the University of Virginia have made significant strides in the rapidly advancing field of 3D-printed concrete by developing a more sustainable, printable cementitious composite. This new material, which combines graphene with limestone and c…", "url": "https://techxplore.com/news/2024-10-graphene-3d-concrete-carbon-emissions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/graphene.jpg", "publishedAt": "2024-10-26T10:07:29Z", "content": "Researchers from the University of Virginia have made significant strides in the rapidly advancing field of 3D-printed concrete by developing a more sustainable, printable cementitious composite. Thi… [+3930 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "ISS leaks among 50 'areas of concern' for astronaut safety: report - Livescience.com", "description": "Troubleshooting the leaking ISS is ongoing, with NASA and Russia now identifying 50 \"areas of concern\" and four cracks, according to a media report.", "url": "https://www.space.com/iss-leak-50-areas-of-concern-nasa-report", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nYwcg8VzrXLUkqgF2yEfSU-1200-80.jpg", "publishedAt": "2024-10-26T10:00:00Z", "content": "NASA and its Russian counterpart have identified 50 \"areas of concern\" related to a long-running leak aboard the space station, a media report states.\r\nThe leak has been ongoing since 2019 in the Rus… [+3457 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "A colossal asteroid once boiled the oceans. It also did the unexpected. - Mashable", "description": "Earth had a violent past.", "url": "https://mashable.com/article/earth-meteorite-asteroid-impact-s2-life", "urlToImage": "https://helios-i.mashable.com/imagery/articles/04HIygysa6ZHFZJjKM6hfRH/hero-image.fill.size_1200x675.v1729872156.jpg", "publishedAt": "2024-10-26T09:30:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "These 'Jedi Rats' Have an Invisible Trick That Can Move Matter Remotely - ScienceAlert", "description": "Scientists have long known about the ultrasonic vocalizations (USVs) mice and rats make.", "url": "https://www.sciencealert.com/these-jedi-rats-have-an-invisible-trick-that-can-move-matter-remotely", "urlToImage": "https://www.sciencealert.com/images/2024/10/SmellingRats.jpg", "publishedAt": "2024-10-26T09:01:21Z", "content": "Scientists have long known about the ultrasonic vocalizations (USVs) mice and rats make. Beyond the range of human hearing, the exact purpose of these high-pitched sounds isn't certain.\r\nA new propos… [+2931 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Single Workout Can Improve Your Brain: Here’s What Scientists Found - SciTechDaily", "description": "UC Santa Barbara researchers discovered that single, vigorous exercise sessions, especially under 30 minutes, improve cognitive functions like memory and executive function. Future studies will explore whether combining physical activity with cognitive tasks …", "url": "https://scitechdaily.com/a-single-workout-can-improve-your-brain-heres-what-scientists-found/", "urlToImage": "https://scitechdaily.com/images/Brain-Boost-Intelligence-Increase-Illustration.jpg", "publishedAt": "2024-10-26T02:02:41Z", "content": "A UC Santa Barbara study reviewed exercise research on how acute physical activity impacts cognition in young adults. They found that short, intense workouts like HIIT and cycling significantly impro… [+3482 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI-Powered Insights Reveal the Universe’s Fundamental Settings - SciTechDaily", "description": "Utilizing a novel AI-driven method, researchers enhanced the precision of estimating critical cosmological parameters by analyzing galaxy distributions. This breakthrough allows for more refined studies of dark matter and energy, with implications for resolvi…", "url": "https://scitechdaily.com/ai-powered-insights-reveal-the-universes-fundamental-settings/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Distribution-Art-Concept.jpg", "publishedAt": "2024-10-25T23:22:58Z", "content": "Researchers have improved the estimation of cosmological parameters by employing AI to analyze galaxy distributions, promising advancements in understanding dark matter, dark energy, and the universe… [+7986 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "‘Yikes’: Is Elon Musk bragging about his Diablo prowess or his SpaceX near-miss? - The Verge", "description": "", "url": "https://www.theverge.com/2024/10/25/24279835/yikes-is-elon-musk-bragging-about-his-diablo-prowess-or-his-spacex-near-miss", "urlToImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/23966628/the_verge_social_share.png", "publishedAt": "2024-10-25T23:03:08Z", "content": "Posted Oct 25, 2024 \r\nAt 11:03 PM UTC\r\nYikes: Is Elon Musk bragging about his Diablo prowess or his SpaceX near-miss?\r\nOkay, this onesweird: Musk has posted a three-minute clip of a game, but the aud… [+288 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Scientists Peered Inside The Tiniest Dinosaur Egg Ever Found - ScienceAlert", "description": "A delicate, three-year analysis confirms the 'Ganzhou Mini Egg' is the tiniest dinosaur egg ever known.", "url": "https://www.sciencealert.com/scientists-peered-inside-the-tiniest-dinosaur-egg-ever-found", "urlToImage": "https://www.sciencealert.com/images/2024/10/SmallCeratopsianDinoDefendingItsNest.jpg", "publishedAt": "2024-10-25T22:31:28Z", "content": "A delicate, three-year analysis confirms the 'Ganzhou Mini Egg' is the tiniest dinosaur egg ever known.\r\nAt just 30 millimeters in length (about 1.18 inches), this is much smaller than the previous r… [+2337 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2024-10-25T10:30:00Z", "content": "[Removed]"}]}