{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Supermassive Black Hole Is on a Collision Course With The Milky Way - ScienceAlert", "description": "A Milky Way collision with a supermassive black hole might be closer than we thought.", "url": "https://www.sciencealert.com/a-supermassive-black-hole-is-on-a-collision-course-with-the-milky-way", "urlToImage": "https://www.sciencealert.com/images/2025/02/gaia-milky-way.jpg", "publishedAt": "2025-02-14T04:48:20Z", "content": "A Milky Way collision with a supermassive black hole might be closer than we thought.\r\nHidden deep in the Large Magellanic Cloud dwarf galaxy that orbits the Milky Way on an ever-closing loop, signs … [+4561 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Yale Scientists Reprogram Genetic Code To Create Revolutionary Synthetic Organism - SciTechDaily", "description": "Yale researchers have created \"Ochre,\" a genomically recoded organism that enables the production of synthetic proteins with novel properties, paving the way for groundbreaking applications in medicine, biotechnology, and industry. Synthetic biologists from Y…", "url": "https://scitechdaily.com/yale-scientists-reprogram-genetic-code-to-create-revolutionary-synthetic-organism/", "urlToImage": "https://scitechdaily.com/images/DNA-Genetics-Evolution-Artists-Concept.jpg", "publishedAt": "2025-02-14T03:29:40Z", "content": "Yale scientists have reprogrammed the genetic code of an organism, creating a novel genomically recoded organism (GRO) with only one stop codon, enabling the production of synthetic proteins with new… [+7580 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Scientists Finally Solve the Mystery of the Irish Potato Famine’s Origins. It Came From The Andes - ZME Science", "description": "DNA study shows the deadly potato blight came from South America.", "url": "https://www.zmescience.com/science/news-science/irish-potato-andes-origin/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/02/irish-potato-famine-.jpg", "publishedAt": "2025-02-14T00:09:50Z", "content": "In the mid-19th century, a microscopic invader swept across Ireland, leaving a trail of devastation in its wake. The potato blight, caused by the fungus-like pathogen Phytophthora infestans, triggere… [+4801 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Dominik Koll", "title": "An unexpected anomaly was found in the Pacific Ocean – and it could be a global time marker - The Conversation", "description": "There seems to be too much of a radioactive element in rocks deep in the Pacific Ocean – how did it get there 10 million years ago?", "url": "https://theconversation.com/an-unexpected-anomaly-was-found-in-the-pacific-ocean-and-it-could-be-a-global-time-marker-249695", "urlToImage": "https://images.theconversation.com/files/648785/original/file-20250213-15-lvses5.jpeg?ixlib=rb-4.1.0&rect=7%2C302%2C4913%2C2456&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-02-14T00:08:00Z", "content": "Earth must have experienced something exceptional 10 million years ago. Our study of rock samples from the floor of the Pacific Ocean has found a strange increase in the radioactive isotope beryllium… [+6036 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MARCIA DUNN", "title": "Why asteroid 2024 YR4 is unlikely to hit Earth in 2032 and how scientists keep track - The Associated Press", "description": "Scientists say the threat of a newly discovered asteroid has risen slightly in the past few weeks, as the world's telescopes rush to track its course. But the chance is still quite slim — a mere 2% — that the space rock will smack Earth in 2032. They say the …", "url": "https://apnews.com/article/asteroid-2024-yr4-earth-2032-5c353e2ee53bb1ecd68a562611d54062", "urlToImage": "https://dims.apnews.com/dims4/default/d85036b/2147483647/strip/true/crop/3934x2213+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fc8%2F5d268b3d286f1ad6fde052c87294%2Fdd02dbb93a6344b4813b2cb34d6c2d9e", "publishedAt": "2025-02-13T23:54:00Z", "content": "CAPE CANAVERAL, Fla. (AP) The threat of a newly discovered asteroid has risen slightly in the past few weeks, as the worlds telescopes rush to track its course. But the chance of an impact is still q… [+3668 chars]"}, {"source": {"id": "new-scientist", "name": "New Scientist"}, "author": "James Dinneen", "title": "California’s groundwater drought continues despite torrential rain - New Scientist", "description": "Seismic measurement of Los Angeles’s depleted aquifers show a year of heavy precipitation hasn’t been enough to refill them", "url": "https://www.newscientist.com/article/2468282-californias-groundwater-drought-continues-despite-torrential-rain/", "urlToImage": "https://images.newscientist.com/wp-content/uploads/2025/02/13161005/SEI_239730873.jpg", "publishedAt": "2025-02-13T19:03:21Z", "content": "The Los Angeles river, with the downtown LA skyline in the distance\r\nEkaterina Chizhevskaya/Getty Images\r\nIn 2023, a parade of atmospheric rivers brought months of heavy precipitation to much of Cali… [+424 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of the Basque Country", "title": "Birds have developed complex brains independently from mammals, studies reveal - Phys.org", "description": "Two studies published in the latest issue of Science have revealed that birds, reptiles, and mammals have developed complex brain circuits independently, despite sharing a common ancestor. These findings challenge the traditional view of brain evolution and d…", "url": "https://phys.org/news/2025-02-birds-complex-brains-independently-mammals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/birds-have-developed-c.jpg", "publishedAt": "2025-02-13T19:00:09Z", "content": "Two studies published in the latest issue of Science have revealed that birds, reptiles, and mammals have developed complex brain circuits independently, despite sharing a common ancestor. These find… [+6080 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Aurora Borealis Forecast: These 15 States May See Northern Lights Tonight Amid Geomagnetic Storm - Forbes", "description": "Forecasters said high-speed winds from the sun’s surface may impact the Earth’s magnetic field.", "url": "https://www.forbes.com/sites/tylerroush/2025/02/13/aurora-borealis-forecast-these-15-states-may-see-northern-lights-tonight-amid-geomagnetic-storm/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67374d824b0b913222945c25/0x0.jpg?format=jpg&crop=3500,1968,x0,y180,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-13T18:50:18Z", "content": "High-speed winds from the suns surface may impact the Earths magnetic field on Thursday, potentially making the northern lights visible to more states, according to the National Oceanic and Atmospher… [+4772 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Perseverance rover's Mars samples show traces of ancient water, but NASA needs them on Earth to seek signs of life - Space.com", "description": "\"There are some instruments that just can't be miniaturized and sent to Mars.\"", "url": "https://www.space.com/perseverance-mars-rover-samples-ancient-water-return-to-earth-signs-of-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LGtM63LkzgPXjunD2SGrTj-1200-80.jpg", "publishedAt": "2025-02-13T18:46:02Z", "content": "NASA's Perseverance rover has been busy gathering bits of Mars — rock cores the size of chalk sticks, clusters of broken fragments no bigger than pencil erasers, and even grains of dust fine enough t… [+4355 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Moon or Mars? Why not both, acting NASA head Janet Petro says - Space.com", "description": "NASA still views the moon as a stepping stone to Mars, even though Elon Musk has dismissed Earth's nearest neighbor as \"a distraction.\"", "url": "https://www.space.com/the-universe/moon/moon-or-mars-why-not-both-acting-nasa-head-janet-petro-says", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xf3RZ7mgCu6S7fpWF8HHpk-1200-80.jpg", "publishedAt": "2025-02-13T17:28:42Z", "content": "WASHINGTON, DC — NASA still has the moon in its crosshairs.\r\nThe agency has been working to return astronauts to the moon via its Artemis program, which was established in late 2017 in response to a … [+3026 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover a Colossal Underwater Impact Crater Three Times the Size of the Grand Canyon - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have made an extraordinary discovery of an underwater crater beneath the Chesapeake Bay, which is three times the size of the Grand Canyon. Created by an asteroid strike 35 million years ago, the impact sent massive shockwaves through the Earth, ca…", "url": "https://dailygalaxy.com/2025/02/crater-three-times-size-of-grand-canyon/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Scientists-Uncover-a-Colossal-Underwater-Impact-Crater-Three-Times-the-Size-of-the-Grand-Canyon.jpg", "publishedAt": "2025-02-13T16:45:00Z", "content": "In an extraordinary breakthrough, scientists have discovered a massive underwater crater buried beneath the waters of the Chesapeake Bay that is three times the size of the Grand Canyon. This ancient… [+4489 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "New Technology Lights Up Coral Beds to Speed Reef Restoration By Attracting Food - Good News Network", "description": "When coral feed on larger quantities of zooplankton, it makes them stronger and more likely to be resilient against certain threats.", "url": "https://www.goodnewsnetwork.org/new-technology-lights-up-coral-to-speed-reef-restoration-by-attracting-food/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/UZELA-lights-installed-in-a-nursery-credit-Phanor-Montoya-Maya-via-Coral-Restoration-e1739442509110.jpg", "publishedAt": "2025-02-13T16:30:44Z", "content": "UZELA lights installed in a nursery – credit Phanor Montoya-Maya, via Coral Restoration\r\nWhat would a bird feeder look like if you adapted it to feed coral reefs? The answer is something like a searc… [+2599 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Measuring the size of a neutrino: Physicists suggest it's considerably larger than an atomic nucleus - Phys.org", "description": "An international team of physicists has successfully measured the size of a certain type of neutrino to a certain degree. In their paper published in the journal Nature, the group describes experiments they conducted that involved measuring the radioactive de…", "url": "https://phys.org/news/2025-02-size-neutrino-physicists-considerably-larger.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/measuring-the-size-of.jpg", "publishedAt": "2025-02-13T16:10:16Z", "content": "An international team of physicists has successfully measured the size of a certain type of neutrino to a certain degree. In their paper published in the journal Nature, the group describes experimen… [+2797 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Morgan Sherburne", "title": "The evolution of evolution itself: How evolution got so good at evolving - Phys.org", "description": "The field of evolution examines how organisms adapt to their environments over generations, but what about the evolution of evolution itself?", "url": "https://phys.org/news/2025-02-evolution-good-evolving.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/evolution-evolution-ev.jpg", "publishedAt": "2025-02-13T16:05:05Z", "content": "The field of evolution examines how organisms adapt to their environments over generations, but what about the evolution of evolution itself?\r\nResearchers have long questioned why biological populati… [+5705 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Astronomers may have just spotted the fastest planetary system ever seen - Livescience.com", "description": "Researchers believe they have rediscovered a mysterious star system first spotted in 2011. If true, the alien sun and its exoplanet companion are speeding through our galaxy at more than 1.2 million mph. However, it is unclear if this is really the case.", "url": "https://www.livescience.com/space/astronomy/astronomers-may-have-just-spotted-the-fastest-planetary-system-ever-seen", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Lo3fS47hTz8X8f2RLCYUJP-1200-80.jpg", "publishedAt": "2025-02-13T15:51:04Z", "content": "Scientists may have spotted a tiny star, possibly with an alien world in tow, shooting through the Milky Way around 500 times faster than a speeding bullet\r\n. This would make this the fastest planeta… [+4400 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "NASA Webb Mission Team", "title": "Webb Maps Full Picture of How Phoenix Galaxy Cluster Forms Stars - Science@NASA", "description": "Discovery proves decades-old theory of galaxy feeding cycle.", "url": "https://science.nasa.gov/missions/webb/webb-maps-full-picture-of-how-phoenix-galaxy-cluster-forms-stars/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/webb-STScI-01JKDQABVK79V1BBDZ8KHSDTJ9-1K.jpg", "publishedAt": "2025-02-13T15:00:00Z", "content": "Discovery proves decades-old theory of galaxy feeding cycle.\r\nResearchers using NASAs James Webb Space Telescope have finally solved the mystery of how a massive galaxy cluster is forming stars at su… [+5020 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "'It was a miracle.' Amazing tales of dead spacecraft that came back to life - Space.com", "description": "Sometimes the end of the mission isn't really the end.", "url": "https://www.space.com/space-exploration/it-was-a-miracle-amazing-tales-of-dead-spacecraft-that-came-back-to-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6gSvM33BAre4GTU8939Lwa-1200-80.png", "publishedAt": "2025-02-13T15:00:00Z", "content": "The hulk of metal moved silently through space, high above the blue Earth. Power no longer coursed through its wires, its instruments were dead to the outside universe, and its communications antenna… [+13096 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Surrey", "title": "Physicists uncover evidence of two arrows of time emerging from the quantum realm - Phys.org", "description": "What if time is not as fixed as we thought? Imagine that instead of flowing in one direction—from past to future—time could flow forward or backwards due to processes taking place at the quantum level. This is the thought-provoking discovery made by researche…", "url": "https://phys.org/news/2025-02-physicists-uncover-evidence-arrows-emerging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/physicists-uncover-evi.jpg", "publishedAt": "2025-02-13T14:43:00Z", "content": "What if time is not as fixed as we thought? Imagine that instead of flowing in one directionfrom past to futuretime could flow forward or backwards due to processes taking place at the quantum level.… [+4213 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Uncover Mysterious Structural Changes in Earth’s Inner Core - SciTechDaily", "description": "A new study reveals that the Earth's inner core is undergoing a structural transformation. A new study by USC scientists, published in Nature Geoscience, reveals structural changes near the Earth's inner core, suggesting its surface may be shifting. While sci…", "url": "https://scitechdaily.com/researchers-uncover-mysterious-structural-changes-in-earths-inner-core/", "urlToImage": "https://scitechdaily.com/images/Earth-Interior-Structure-Layers-Illustration.jpg", "publishedAt": "2025-02-13T14:31:37Z", "content": "New research reveals Earth’s inner core may be deforming due to outer core turbulence, altering its structure and rotation.\r\nA new study reveals that the Earth’s inner core is undergoing a structural… [+3739 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Paleontologists Discover Recover a ‘One-in-a-Billion’ Sea Monster Skull — Bigger and Deadlier Than a T. Rex - Indian Defence Review", "description": "Buried for 145 million years, a massive fossil skull has emerged from the cliffs of Dorset, leaving scientists in awe. This prehistoric predator had a bite so powerful it could rival the most fearsome beasts of its time. Unique features suggest it may belong …", "url": "https://indiandefencereview.com/paleontologists-discover-recover-a-one-in-a-billion-sea-monster-skull-bigger-and-deadlier-than-a-t-rex/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/A-massive-pliosaur-skull.jpg", "publishedAt": "2025-02-13T14:30:00Z", "content": "A massive pliosaur skull has been discovered embedded in the cliffs near Kimmeridge Bay, Dorset, astonishing paleontologists and sparking new debates about the deadliest hunters of the Jurassic era.\r… [+2974 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "'Iridescent' clouds on Mars captured in Martian twilight in stunning NASA rover images (video) - Space.com", "description": "\"I'll always remember the first time I saw those iridescent clouds and was sure at first it was some color artifact.\"", "url": "https://www.space.com/the-universe/mars/iridescent-clouds-on-mars-captured-in-martian-twilight-in-stunning-nasa-rover-images-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/igGF34V3A3WoMJTKrQY3rM-1200-80.gif", "publishedAt": "2025-02-13T14:00:00Z", "content": "What do clouds on Mars look like? Well, a new video stitched together from images captured by NASA's Curiosity rover offers a glimpse. In this video, delicate red-and-green-tinted clouds are seen dri… [+3897 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Paleontologists Discovered the Oldest Modern Bird Ever Found, Which Might Have Shared the World with a T. Rex - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have uncovered a 69-million-year-old fossil that could change everything we know about bird evolution. The nearly complete skull reveals features strikingly similar to modern birds, raising new debates among paleontologists. Some believe it proves …", "url": "https://dailygalaxy.com/2025/02/paleontologists-discovered-the-oldest-modern-bird-have-shared-the-world-with-t-rex/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/the-Oldest-Modern-Bird-Ever-Found.jpg", "publishedAt": "2025-02-13T14:00:00Z", "content": "A newly unearthed 69-million-year-old fossil is shaking up long-standing debates among paleontologists about when modern birds emerged. The discovery of a nearly complete skull from the extinct bird … [+3385 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "'We were amazed': Astronomers discover oldest, biggest black hole jet in the known universe — and there may be more - Livescience.com", "description": "Astronomers have used a continent-sized radio telescope to find the largest black hole jet ever observed in the early universe.", "url": "https://www.livescience.com/space/black-holes/we-were-amazed-astronomers-discover-oldest-biggest-black-hole-jet-in-the-known-universe-and-there-may-be-more", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KZRuhfNWYh8j8xEz8SATNa-1200-80.jpg", "publishedAt": "2025-02-13T14:00:00Z", "content": "Astronomers have discovered a black hole\r\n jet that erupted into existence when the universe was less than 1.2 billion years old, or roughly 9% its current age. The jet spans 200,000 light-years — tw… [+5252 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Once Feared as the Ocean’s Apex Predator, “Great White Sharks” Are Now Being Hunted by a Deadly Enemy - Indian Defence Review", "description": "Once the undisputed ruler of the ocean, the great white shark is now facing an unexpected and relentless new predator. Disturbing evidence off Australia’s coast reveals a shocking shift in the marine food chain. A silent hunter is targeting great whites with …", "url": "https://indiandefencereview.com/once-thought-to-be-the-oceans-ultimate-predator-great-white-sharks-now-face-a-deadly-new-threat/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Great-White-Shark.jpg", "publishedAt": "2025-02-13T14:00:00Z", "content": "In the waters off Australias southern coast, a dramatic shift in the oceans predator hierarchy is unfolding. The legendary great white shark, long considered the top hunter of the seas, is now facing… [+3717 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Briana R. Zamora", "title": "Lunar Space Station Module Will Journey to US ahead of NASA’s Artemis IV Moon Mission - NASA", "description": "A key element of the Gateway lunar space station has entered the cleanroom for final installations after completing environmental stress tests.", "url": "https://www.nasa.gov/humans-in-space/lunar-space-station-module-will-journey-to-us-ahead-of-nasas-artemis-iv-moon-mission/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/jsc2025e003426.jpg", "publishedAt": "2025-02-13T13:50:37Z", "content": "A key element of the Gateway lunar space station has entered the cleanroom for final installations after completing environmental stress tests. \r\nWhen NASAs Artemis IV astronauts journey to the Moon,… [+1732 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jennifer Zieba", "title": "Scientists just rewrote our understanding of epigenetics - Livescience.com", "description": "DNA and RNA epigenetics, once thought to be separate, have now been found to work together to fine-tune gene expression.", "url": "https://www.livescience.com/health/genetics/scientists-just-rewrote-our-understanding-of-epigenetics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FHaPk8HswmetE3SpEWVuW7-1200-80.jpg", "publishedAt": "2025-02-13T13:30:10Z", "content": "Scientists have uncovered a new way that cells control their genes — and it may rewrite our understanding of \"epigenetics.\"\r\nEpigenetics\r\n is a form of DNA modification that doesn't affect the DNA se… [+4848 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Spent 10 Years Reconstructing This Breathtaking 417 Megapixel Image of This Galaxy Located 2.5m Light-Years Away - The Daily Galaxy --Great Discoveries Channel", "description": "After 10 years of observations and over 1,000 orbits, NASA has unveiled the most precise image of Andromeda ever created. This 417-megapixel masterpiece reveals a turbulent past, exposing the aftermath of a cosmic collision that shaped its evolution. The data…", "url": "https://dailygalaxy.com/2025/02/nasa-spent-10-years-reconstructing-this-breathtaking-417-megapixel-image-of-this-galaxy-located-2-5m-light-years-away/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/This-photomosaic-of-the-Andromeda-galaxy-located-2.5-million-light-years-from-Earth-is-the-largest-ever-created-using-images-from-the-Hubble-Space-Telescope.jpg", "publishedAt": "2025-02-13T13:00:26Z", "content": "For over a decade, the Hubble Space Telescope meticulously observed our closest galactic neighbor, capturing over 1,000 orbits worth of data. The result? A breathtaking 417-megapixel image of the And… [+3615 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Biological aging may not be driven by what we thought - Livescience.com", "description": "A new study draws a line between random genetic mutations and predictable epigenetic changes used to measure biological aging.", "url": "https://www.livescience.com/health/ageing/biological-aging-may-not-be-driven-by-what-we-thought", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WtkHdAgBUdYhaUXsd3JUgJ-1200-80.jpg", "publishedAt": "2025-02-13T13:00:00Z", "content": "Scientists often use \"epigenetic clocks\" to measure biological aging, but what makes these clocks tick is not fully understood. Now, scientists have uncovered a clue: The clocks are synced with rando… [+6973 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "New research reveals what really caused the Black Death - The Brighter Side of News", "description": "Black Death arrived in the Mediterranean through trade ships transporting goods from the territories of the Golden Horde along the Black Sea.", "url": "https://www.thebrighterside.news/health/new-research-reveals-what-really-caused-the-black-death", "urlToImage": "https://www.thebrighterside.news/uploads/2024/08/black-death-5.webp?auto=webp", "publishedAt": "2025-02-13T12:52:00Z", "content": "In 1347, the Black Death arrived in the Mediterranean through trade ships transporting goods from the territories of the Golden Horde along the Black Sea. \r\nThis devastating outbreak spread rapidly a… [+6019 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Little-Known Scientist May Have Unlocked the Secret of Life’s Origins on Earth 50 Years Ago, but Was Buried by History - The Daily Galaxy --Great Discoveries Channel", "description": "For decades, a little-known scientist worked in obscurity, proposing a radical idea about the origins of life. His theory, dismissed and forgotten, challenged everything we thought we knew. Now, researchers are rediscovering his work—and the implications are …", "url": "https://dailygalaxy.com/2025/02/little-known-scientist-may-have-unlocked-the-secret-to-lifes-origins-on-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Tibor-Ganti-i.jpg", "publishedAt": "2025-02-13T12:30:00Z", "content": "The story of Tibor Gánti is one of a visionary scientist who remained in the shadows for far too long. As the scientific community continues to unravel the origins of life, his work provides a compel… [+5410 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Drew Turney", "title": "Supercomputer runs largest and most complicated simulation of the universe ever - Livescience.com", "description": "Frontier, the second fastest supercomputer in the world, used dark matter and the movement of gas and plasma rather than just gravity to model the observable universe.", "url": "https://www.livescience.com/technology/computing/supercomputer-runs-largest-and-most-complicated-simulation-of-the-universe-ever", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nB4UvJorfWEL5o2chQEs7E-1200-80.jpg", "publishedAt": "2025-02-13T12:00:00Z", "content": "The potential for our understanding of the universe has taken a giant leap forward after Frontier, a supercomputer based in the Oak Ridge National Laboratory (ORNL), created a simulation of the unive… [+3295 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Danny Robb", "title": "How the scientists of the 1960s turned the Moon into a place - Aeon", "description": "For most of history, the Moon was regarded as a mysterious and powerful object. Then scientists made it into a destination", "url": "https://aeon.co/essays/how-the-scientists-of-the-1960s-turned-the-moon-into-a-place", "urlToImage": "https://images.aeonmedia.co/images/f9edc8cc-1696-4252-9571-6f790c8670ff/test-essay-lunar-orbiter-1-1102_med.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-02-13T11:02:42Z", "content": "On 25 May 1961, the US president John F Kennedy announced the Apollo programme: a mission to send humans to the Moon and return them safely to Earth within the decade. The next year, the American geo… [+19674 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Discover Nearby Alien World That May Sustain Life - ScienceAlert", "description": "An exoplanet with some key ingredients to support life may be lurking closer than we thought.", "url": "https://www.sciencealert.com/astronomers-discover-nearby-alien-world-that-may-sustain-life", "urlToImage": "https://www.sciencealert.com/images/2025/02/hd-20794-d.jpg", "publishedAt": "2025-02-13T11:01:34Z", "content": "An exoplanet with some key ingredients to support life may be lurking closer than we thought.\r\nAround a star just 20 light-years from the Solar System, astronomers have confirmed the existence of wha… [+3838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Total lunar eclipse brings a Blood Moon to North America next month. Here's how to see it - Space.com", "description": "Earth will soon experience the first total lunar eclipse since November 2022.", "url": "https://www.space.com/stargazing/eclipses/total-lunar-eclipse-brings-a-blood-moon-to-north-america-next-month-heres-how-to-see-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pW3NRvdYEHC6q8actQBk9Q-1200-80.gif", "publishedAt": "2025-02-13T11:00:00Z", "content": "In just one month, skywatchers across North America will be treated to a stunning total lunar eclipse.\r\nThe lunar eclipse will happen overnight between March 13 and March 14\r\n, 2025, and will be the … [+4121 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "This monstrous cosmic structure may warp our universe - Earth.com", "description": "Astronomers discover Quipu, the cosmic structure 1.3 billion light years away that redefines the universe.", "url": "https://www.earth.com/news/this-monstrous-cosmic-structure-may-warp-our-universe/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/12133451/monstrous-cosmic-formation-warps-universe.jpg", "publishedAt": "2025-02-13T10:03:40Z", "content": "Astronomers have identified a new cosmic structure that stretches over 1.3 billion light-years, making it the largest single formation ever observed. Named Quipu, it holds about 200 quadrillion solar… [+6186 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "University of Cambridge", "title": "Solar-powered device captures carbon dioxide from air to make sustainable fuel - Tech Xplore", "description": "Researchers have developed a reactor that pulls carbon dioxide directly from the air and converts it into sustainable fuel, using sunlight as the power source.", "url": "https://techxplore.com/news/2025-02-solar-powered-device-captures-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/solar-powered-device-c.jpg", "publishedAt": "2025-02-13T10:00:07Z", "content": "Researchers have developed a reactor that pulls carbon dioxide directly from the air and converts it into sustainable fuel, using sunlight as the power source.\r\nThe researchers, from the University o… [+4440 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "Record-Breaking Neutrino From Deep Space Spotted by Undersea Telescope - ScienceAlert", "description": "High-energy particles rain down on Earth constantly, but scientists have now detected a doozy: a neutrino blasting in from deep space with an energy far greater than anything we've seen before.", "url": "https://www.sciencealert.com/record-breaking-neutrino-from-deep-space-spotted-by-undersea-telescope", "urlToImage": "https://www.sciencealert.com/images/2025/02/HighestEnergyNeutrino.jpg", "publishedAt": "2025-02-13T07:11:02Z", "content": "High-energy particles rain down on Earth constantly, but scientists have now detected a doozy: a neutrino blasting in from deep space with an energy far greater than anything we've seen before.\r\nOn 1… [+4156 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "How small are the fundamental particles of the Universe? - Big Think", "description": "When we divide matter into its fundamental, indivisible components, are those particles truly point-like, or is there a finite minimum size?", "url": "https://bigthink.com/starts-with-a-bang/how-small-fundamental-particles/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/02/scale.jpg?w=960&h=540&crop=1", "publishedAt": "2025-02-13T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Alpha Centauri Particles Already Lurk in Our Solar System, Study Suggests - ScienceAlert", "description": "The appearance of the Interstellar Objects (ISOs) Oumuamua and Comet Borisov in 2017 and 2019, respectively, created a surge of interest.", "url": "https://www.sciencealert.com/alpha-centauri-particles-already-lurk-in-our-solar-system-study-suggests", "urlToImage": "https://www.sciencealert.com/images/2025/02/AlphaCentauri_2025_Cover.jpg", "publishedAt": "2025-02-13T04:40:13Z", "content": "The appearance of the Interstellar Objects (ISOs) Oumuamua and Comet Borisov in 2017 and 2019, respectively, created a surge of interest.\r\nWhat were they? Where did they come from? Unfortunately, the… [+8726 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Monisha Ravisetti", "title": "NASA denies setting 'new bans' for employees amid reports of removing LGBTQI+ symbols from offices - Space.com", "description": "\"Some managers have been reminding employees to be mindful of what personal affects they have in their workspaces, but there are no penalties or warnings about being placed on administrative leave for displaying personal items.\"", "url": "https://www.space.com/the-universe/earth/nasa-denies-setting-new-bans-for-employees-amid-reports-of-removing-lgbtqi-symbols-from-offices", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cGisb9ZiKwP7wYzHKqA5g-1200-80.jpg", "publishedAt": "2025-02-13T02:38:34Z", "content": "NASA has come under scrutiny over the last few weeks due to its compliance with executive orders penned by U.S. President Donald Trump. These are orders that directly impact all federal organizations… [+3717 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "New Fossils from China Fill Gap in Early Evolutionary History of Birds - Sci.News", "description": "Paleontologists have unearthed the fossilized remains of two Jurassic bird species at a locality in Zhenghe county, Fujian province, southeast China.", "url": "https://www.sci.news/paleontology/baminornis-zhenghensis-13664.html", "urlToImage": "https://cdn.sci.news/images/2025/02/image_13664f-Baminornis-zhenghensis.jpg", "publishedAt": "2025-02-12T23:06:07Z", "content": "Paleontologists have unearthed the fossilized remains of two Jurassic bird species at a locality in Zhenghe county, Fujian province, southeast China. These 149-million-year-old fossils demonstrate th… [+2682 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Human-like Teeth Grown in Pigs Could Make Dental Implants a Thing of the Past - ZME Science", "description": "It's a glimpse into the future of tooth replacement.", "url": "https://www.zmescience.com/science/news-science/human-like-teeth-grown-in-pigs-could-make-dental-implants-a-thing-of-the-past/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/02/andandand0017_Cartoon_Illustration_Human-like_Teeth_Grown_in__4025f9f9-93d1-4717-ac3a-e292517d46b3_1.png", "publishedAt": "2025-02-12T22:39:38Z", "content": "Illustration by Midjourney. \r\nLosing a tooth is more than just a painful inconvenience. Its the loss of a living, functional part of your body one that helps you chew, speak, and smile with confidenc… [+4018 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Edits to Vera Rubin’s Biography Downplay the Need for Women in Science Amid Federal DEI Crackdown - Gizmodo", "description": "To comply with Trump's executive order about DEI, a federally funded telescope project has altered the biography of its namesake astronomer.", "url": "https://gizmodo.com/edits-to-vera-rubins-biography-downplay-the-need-for-women-in-science-amid-federal-dei-crackdown-2000562941", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/vera-rubin.jpg", "publishedAt": "2025-02-12T22:21:55Z", "content": "It’s been less than a month since President Donald Trump declared war on diversity and inclusion at federal agencies. NASA was ordered earlier this month to scrub its sites of “anything specifically … [+3771 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mars Is Rocked by Epic Quakes, And They Don't All Come From Within - ScienceAlert", "description": "Incredibly powerful marsquakes that violently shake the red planet don't always begin under the surface, research shows.", "url": "https://www.sciencealert.com/mars-is-rocked-by-epic-quakes-and-they-dont-all-come-from-within", "urlToImage": "https://www.sciencealert.com/images/2025/02/mars-crater-1.jpg", "publishedAt": "2025-02-12T22:01:22Z", "content": "Incredibly powerful marsquakes that violently shake the red planet don't always begin under the surface, research shows.\r\nA new study using artificial intelligence to analyze seismic data reveals jus… [+4621 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "The New NASA RIF Directive Is Now Online - NASA Watch", "description": "This directive has appeared online at NASA", "url": "https://nasawatch.com/personnel-news/the-new-nasa-rif-directive-is-now-online/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2025/02/12165049/RIF-DOC.png", "publishedAt": "2025-02-12T21:56:07Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Birds-of-paradise use secret biofluorescence to attract mates - Earth.com", "description": "Biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances.", "url": "https://www.earth.com/news/birds-of-paradise-use-secret-biofluorescence-to-attract-mates/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/12143421/bird-of-paradise_biofluorescence_atrract-mates_1m.jpg", "publishedAt": "2025-02-12T21:36:40Z", "content": "New research has revealed that biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances and colorful plumage. \r\nThe study shows that… [+5252 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Whitney Clavin", "title": "AI program plays the long game to solve decades-old math problems - Phys.org", "description": "A game of chess requires its players to think several moves ahead, a skill that computer programs have mastered over the years. Back in 1996, an IBM supercomputer famously beat the then world chess champion Garry Kasparov. Later, in 2017, an artificial intell…", "url": "https://phys.org/news/2025-02-ai-plays-game-decades-math.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/an-infinite-chess-game.jpg", "publishedAt": "2025-02-12T21:22:55Z", "content": "A game of chess requires its players to think several moves ahead, a skill that computer programs have mastered over the years. Back in 1996, an IBM supercomputer famously beat the then world chess c… [+6630 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Tiernan P. Doyle", "title": "NASA’s Advancements in Space Continue Generating Products on Earth - NASA", "description": "The latest edition of NASA’s Spinoff publication, which highlights the successful transfer of agency technology to the commercial sector, is now available", "url": "https://www.nasa.gov/news-release/nasas-advancements-in-space-continue-generating-products-on-earth/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/nasa-spinoff-2025-cover-3k.png", "publishedAt": "2025-02-12T19:29:41Z", "content": "The latest edition of NASAs Spinoff publication, which highlights the successful transfer of agency technology to the commercial sector, is now available online.\r\nFor nearly 25 years, NASA has suppor… [+3670 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brown University", "title": "Unexpected TV signal leads to a new method for filtering out unwanted radio frequencies - Phys.org", "description": "Astronomers sifting through data from the Murchison Widefield Array, a radio telescope in Western Australia, found themselves confronting an unexpected mystery.", "url": "https://phys.org/news/2025-02-unexpected-tv-method-filtering-unwanted.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/radiotelesco.jpg", "publishedAt": "2025-02-12T19:25:06Z", "content": "Astronomers sifting through data from the Murchison Widefield Array, a radio telescope in Western Australia, found themselves confronting an unexpected mystery.\r\nThe telescope, which consists of 4,09… [+6689 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Victoria", "title": "Witnessing the birth of planets: Webb telescope provides unprecedented view into PDS 70 system - Phys.org", "description": "Canadian astronomers have taken an extraordinary step in understanding how planets are born, using the James Webb Space Telescope (JWST). JWST was used to study PDS 70, a young star with two growing planets in its orbit. This remarkable system, located 370 li…", "url": "https://phys.org/news/2025-02-witnessing-birth-planets-webb-telescope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/witnessing-the-birth-o.jpg", "publishedAt": "2025-02-12T19:07:05Z", "content": "Canadian astronomers have taken an extraordinary step in understanding how planets are born, using the James Webb Space Telescope (JWST). JWST was used to study PDS 70, a young star with two growing … [+7256 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Scientists record never-before-seen 'ice quakes' deep inside Greenland's frozen rivers - Livescience.com", "description": "Quakes recorded for the first time inside Greenland's biggest frozen river, the Northeast Greenland Ice Stream, suggest this river and others switch between moving jerkily and flowing like honey.", "url": "https://www.livescience.com/planet-earth/arctic/scientists-record-never-before-seen-ice-quakes-deep-inside-greenlands-frozen-rivers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bz3UtG2rhLkF7vkt6MKpJX-1200-80.jpg", "publishedAt": "2025-02-12T19:04:27Z", "content": "In a first, researchers have recorded countless \"ice quakes\" that sporadically shake the Greenland Ice Sheet. These quakes may explain the jerky way that the island's frozen rivers move downstream to… [+3869 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Simulation shows wolves had time to self-domesticate and evolve into dogs - Phys.org", "description": "A team of mathematicians and statisticians from the University of Wisconsin-La Crosse, the University of Tennessee and Valparaiso University, all in the U.S., has found new evidence that wolves had ample time to self-domesticate and evolve into modern dogs. I…", "url": "https://phys.org/news/2025-02-simulation-wolves-domesticate-evolve-dogs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/wolf.jpg", "publishedAt": "2025-02-12T17:30:01Z", "content": "A team of mathematicians and statisticians from the University of Wisconsin-La Crosse, the University of Tennessee and Valparaiso University, all in the U.S., has found new evidence that wolves had a… [+2597 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Eruption May Be Imminent In Alaska As Earthquakes Increase Underneath Mount Spurr - IFLScience", "description": "In recent months, earthquakes have been detected underneath the volcano at a rate of 125 times per week.", "url": "https://www.iflscience.com/eruption-may-be-imminent-in-alaska-as-earthquakes-increase-underneath-mount-spurr-78022", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78022/aImg/82116/crater-peak-meta.jpg", "publishedAt": "2025-02-12T17:26:51Z", "content": "Geologists are closely monitoring Mount Spurr in the Aleutian Arc of Alaska, USA, after continued volcanic unrest. The Alaska Volcano Observatory (AVO) monitoring the situation says that an eruption … [+3351 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronauts Stuck in Space May Return Sooner Than Expected, Thanks to NASA’s New Plan - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s astronauts Butch Wilmore and Suni Williams will be returning to Earth sooner than expected after an unexpected series of delays and setbacks during their space mission. Originally scheduled to return later in March or April, the astronauts are now set …", "url": "https://dailygalaxy.com/2025/02/nasa-spacex-bring-astronauts-back-sooner/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/NASA-Adjusts-Plans-SpaceX-to-Bring-Astronauts-Back-Sooner-After-Prolonged-Stay-in-Space.jpg", "publishedAt": "2025-02-12T17:00:44Z", "content": "In a significant move to accelerate the timeline of the upcoming Crew-10 mission to the International Space Station (ISS), NASA and SpaceX have agreed to swap Crew Dragon spacecraft. This decision co… [+5696 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Euclid telescope spots rare 'Einstein ring' hiding near Earth — and an ancient, unnamed galaxy behind it - Livescience.com", "description": "Einstein predicted the existence of gravitationally-warped rings of light in 1915. Now, a new one has been discovered just a cosmic stone's throw from our own planet.", "url": "https://www.livescience.com/space/cosmology/euclid-telescope-spots-rare-einstein-ring-hiding-near-earth-and-an-ancient-unnamed-galaxy-behind-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/e4sC9AFJ4oRY39s36q7NmP-1200-80.jpg", "publishedAt": "2025-02-12T17:00:00Z", "content": "The Euclid space telescope\r\n has captured a stunning and rare \"Einstein ring\" magnifying light from the depths of the universe.\r\nThe image shows a faint halo surrounding the nearby galaxy NGC 6505, c… [+4336 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Barcelona", "title": "Eliminating singularities: Physicists describe the creation of black holes through pure gravity - Phys.org", "description": "Traditional black holes, as predicted by Albert Einstein's theory of General Relativity, contain what are known as singularities, i.e., points where the laws of physics break down. Identifying how singularities are resolved in the context of quantum gravity i…", "url": "https://phys.org/news/2025-02-singularities-physicists-creation-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/black-holes-2.jpg", "publishedAt": "2025-02-12T16:32:07Z", "content": "Traditional black holes, as predicted by Albert Einstein's theory of General Relativity, contain what are known as singularities, i.e., points where the laws of physics break down. Identifying how si… [+4711 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Physikalisch-Technische Bundesanstalt", "title": "Physicists find deformed nuclei when searching for 'dark forces' - Phys.org", "description": "When world-leading teams join forces, new findings are bound to be made. This is what happened when quantum physicists from the Physikalisch-Technische Bundesanstalt (PTB) and the Max Planck Institute for Nuclear Physics (MPIK) in Heidelberg combined atomic a…", "url": "https://phys.org/news/2025-02-physicists-deformed-nuclei-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-insights-into-the-2.jpg", "publishedAt": "2025-02-12T16:07:39Z", "content": "When world-leading teams join forces, new findings are bound to be made. This is what happened when quantum physicists from the Physikalisch-Technische Bundesanstalt (PTB) and the Max Planck Institut… [+4260 chars]"}, {"source": {"id": null, "name": "Unc.edu"}, "author": "bpd323", "title": "Dancing turtles unlock scientific discovery - UNC Chapell Hill", "description": "Carolina researchers publish a groundbreaking study on how turtles navigate using the Earth’s magnetic field.", "url": "https://www.unc.edu/posts/2025/02/12/dancing-turtles-unlock-scientific-discovery/", "urlToImage": "https://www.unc.edu/wp-content/uploads/2025/02/Turtles_HERO.jpg", "publishedAt": "2025-02-12T16:05:22Z", "content": "When captive loggerhead sea turtles anticipate food, they do a little dance. The turtles raise their heads out of water, open their mouths, flap their flippers and spin in circles.\r\nNot only is this … [+3951 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Emily Cooke", "title": "Sex leaves 'microbial traces' on genitalia, even when a condom is used — scientists call it the 'sexome' - Livescience.com", "description": "A new study has revealed that, during sex, male and female partners leave unique microbial \"imprints\" on each other, even when they use a condom.", "url": "https://www.livescience.com/health/sex/sex-leaves-microbial-traces-on-genitalia-even-when-a-condom-is-used-scientists-call-it-the-sexome", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VgqNV3zhwSapoes8jXS3V8-1200-80.jpg", "publishedAt": "2025-02-12T16:00:00Z", "content": "Male and female sexual partners leave traces of their \"genital microbiomes\" during intercourse, even when they use a condom, a new study suggests.\r\nIn the study, researchers had 12 monogamous heteros… [+4217 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Parisian photographer produces phenomenal, perfectly-proportioned 'planetary parade' portrait - Livescience.com", "description": "A French astrophotographer recently snapped shots of the moon, Venus, Mars, Jupiter, Saturn, Uranus and Neptune in a single evening, and rearranged them to create a striking composite image. Each \"planetary parade\" member was captured with the same magnificat…", "url": "https://www.livescience.com/space/astronomy/parisian-photographer-produces-phenomenal-perfectly-proportioned-planetary-parade-portrait", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E8bGDnrq8yTeWHnxnpnEJZ-1200-80.jpg", "publishedAt": "2025-02-12T15:32:17Z", "content": "A striking new \"planetary parade\" photo combines images of six solar system\r\n worlds alongside the moon, providing a rare opportunity to compare the sizes of these celestial objects as they currently… [+3332 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "ICYMI: Science is considering retracting ‘arsenic life’ paper - Retraction Watch", "description": "Felisa Wolfe-Simon at Mono Lake in 2010 (photo by Henry Bortman) Science is finally considering retracting a 2010 paper claiming the discovery of a bacterium that could substitute arsenic for phosp…", "url": "https://retractionwatch.com/2025/02/12/icymi-science-considering-retraction-arsenic-life/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2025/02/felicia-wolfe-simon-2010-c-henry-bortman.jpg", "publishedAt": "2025-02-12T15:11:42Z", "content": "Science is finally considering retracting a 2010 paper claiming the discovery of a bacterium that could substitute arsenic for phosphorus in its chemical makeup. We feel the best thing to do would be… [+2134 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "SpaceX rocket launch spawns dazzling 'space jellyfish' in evening sky (photos) - Space.com", "description": "If you saw something strange in the evening sky over California on Feb. 10, we can explain.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-rocket-launch-spawns-dazzling-space-jellyfish-in-evening-sky-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VvSkAEhHCU2LHweFbhSWQH-1200-80.jpg", "publishedAt": "2025-02-12T14:00:00Z", "content": "When SpaceX launched a Falcon 9 rocket from California on Monday evening (Feb. 10), it was just another flight for the company to boost its growing Starlink internet satellite constellation. For spec… [+3378 chars]"}]}