{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Warn: Popular Infant Medicine Could Trigger Diabetes Later in Life - SciTechDaily", "description": "Mouse study reveals beneficial bacteria play crucial role in helping insulin-producing cells multiply. Exposure to antibiotics during a critical stage of infancy can hinder the development of insulin-producing cells in the pancreas and may increase the risk o…", "url": "https://scitechdaily.com/scientists-warn-popular-infant-medicine-could-trigger-diabetes-later-in-life/", "urlToImage": "https://scitechdaily.com/images/Prescription-Drug-Concept.jpg", "publishedAt": "2025-03-28T02:22:57Z", "content": "Early-life exposure to antibiotics can disrupt the growth of insulin-producing cells in the pancreas by altering the infant microbiome, increasing the risk of diabetes later on, according to new mous… [+6745 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Suggests Earth’s First Oceans Weren’t Blue: They Were Green - SciTechDaily", "description": "Scientists have discovered evidence that Earth's oceans were once green, hinting that this could be a marker of early life, both on our planet and potentially on alien worlds. Imagine the world’s oceans with their beautiful blue color. Now, imagine those same…", "url": "https://scitechdaily.com/new-research-suggests-earths-first-oceans-werent-blue-they-were-green/", "urlToImage": "https://scitechdaily.com/images/Green-Ocean-Iwo-Island.jpg", "publishedAt": "2025-03-27T21:33:40Z", "content": "The photo was taken by the research team on Iwo Island in the Satsunan Archipelago, Kyushu, in 2023. The team measured the underwater transmission spectrum, iron oxide concentration, and the cyanobac… [+4852 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Astronauts can survive a trip to Mars, but this vital organ will be permanently damaged - Earth.com", "description": "With evidence pointing to serious kidney challenges, careful planning will be needed to keep crews healthy on space journeys to Mars.", "url": "https://www.earth.com/news/astronauts-can-survive-mars-space-journey-but-their-kidneys-will-be-permanently-damaged/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/27145540/mars_humans_trip-survival_kidney-damage_spacecraft_1m.jpg", "publishedAt": "2025-03-27T21:03:58Z", "content": "Space journeys that stretch far beyond home are on the horizon. Crews heading for Mars will face conditions quite different from those on Earth, and researchers have been working to figure out what m… [+5505 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kimm Fesenmaier", "title": "New superconducting state discovered: Cooper-pair density modulation - Phys.org", "description": "Superconductivity is a quantum physical state in which a metal is able to conduct electricity perfectly without any resistance. In its most familiar application, it enables powerful magnets in MRI machines to create the magnetic fields that allow doctors to s…", "url": "https://phys.org/news/2025-03-superconducting-state-cooper-pair-density.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/team-finds-new-superco.jpg", "publishedAt": "2025-03-27T21:00:04Z", "content": "Superconductivity is a quantum physical state in which a metal is able to conduct electricity perfectly without any resistance. In its most familiar application, it enables powerful magnets in MRI ma… [+5232 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "NASA's daredevil solar spacecraft survives 2nd close flyby of our sun - Space.com", "description": "\"This mission's trailblazing research is rewriting the textbooks on solar science by going to a place no human-made object has ever been.\"", "url": "https://www.space.com/the-universe/sun/nasas-daredevil-solar-spacecraft-survives-2nd-close-flyby-of-our-sun", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mfRCivryH64RDPokhYpWDj-1200-80.jpg", "publishedAt": "2025-03-27T20:26:40Z", "content": "NASA's Parker Solar Probe has successfully completed its second close flyby of the sun, the space agency announced earlier this week.\r\nThe car-sized spacecraft swooped within 8 million miles (6.1 mil… [+3592 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Some birds use biofluorescence to attract mates, glowing in colors that humans can't see - Earth.com", "description": "Biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances.", "url": "https://www.earth.com/news/some-birds-use-biofluorescence-glowing-brightly-to-attract-mates-birds-of-paradise/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/27132123/bird-of-paradise_Paradisaea-guilielmi_Biofluorescence_mating_credit-Rene-Martin_1m.jpg", "publishedAt": "2025-03-27T19:38:31Z", "content": "Animals love to show off with color, especially when it comes to mating. Birds, in particular, often use bright feathers to catch the eye of a potential mate. But lately, scientists have noticed some… [+6106 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "Scientists baffled at mysterious ancient creature that doesn't fit on the tree of life as we know it - Livescience.com", "description": "An ancient and enormous organism called Prototaxites, initially found to be a type of fungus, may actually be an unknown branch of life, researchers say.", "url": "https://www.livescience.com/animals/giant-fungus-like-organism-may-be-a-completely-unknown-branch-of-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zb5qX2JQYMyU5eLuqasZ6o-1200-80.jpg", "publishedAt": "2025-03-27T18:18:06Z", "content": "A bizarre ancient life-form, considered to be the first giant organism\r\n to live on land, may belong to a totally unknown branch of the tree of life, scientists say.\r\nThese organisms, named Prototaxi… [+4780 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Webb Telescope Just Spotted Mysterious ‘Little Red Dots’ - The Daily Galaxy --Great Discoveries Channel", "description": "The James Webb Space Telescope has spotted mysterious glowing little red dots in the early Universe—and they’re unlike anything astronomers expected.", "url": "https://dailygalaxy.com/2025/03/webb-telescope-spotted-little-red-dots/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/NASAs-Webb-Telescope-Just-Spotted-Mysterious-Little-Red-Dots.jpg", "publishedAt": "2025-03-27T17:30:00Z", "content": "The James Webb Space Telescope has uncovered unusual compact sources of light in the distant Universe, nicknamed little red dots (LRDs), which may be rapidly growing black holes shrouded in dense, io… [+3322 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "China sets dates for some of its most ambitious planetary missions - Ars Technica", "description": "These grand Chinese plans come as NASA faces budget cuts.", "url": "https://arstechnica.com/space/2025/03/china-sets-dates-for-some-of-its-most-ambitious-planetary-missions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/tianwen1_mars.jpg", "publishedAt": "2025-03-27T17:13:23Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "NASA stacks moon-bound Artemis 2 rocket: Space photo of the day - Space.com", "description": "The Space Launch System (SLS) core stage and rocket boosters have now been stood up and mated in preparation for NASA's Artemis 2 moon mission.", "url": "https://www.space.com/space-exploration/artemis/nasa-stacks-moon-bound-artemis-2-rocket-space-photo-of-the-day", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fRTGuNTKfQSDcuWLRQ2vhN-1200-80.jpg", "publishedAt": "2025-03-27T17:00:00Z", "content": "NASA technicians joined the Space Launch System (SLS) core stage with the stacked solid rocket boosters for NASA's Artemis 2 moon mission at the Kennedy Space Center in Florida. (Image credit: NASA/F… [+2752 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mysterious Microbes Dug These Tunnels Millions of Years Ago - The Daily Galaxy --Great Discoveries Channel", "description": "Beneath desert stone, scientists have uncovered ancient tunnels likely carved by unknown microbes. What kind of life could have left such a mark millions of years ago?", "url": "https://dailygalaxy.com/2025/03/microbes-dug-tunnels-millions-years-ago/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Mysterious-Microbes-Dug-These-Tunnels-Millions-of-Years-Ago.jpg", "publishedAt": "2025-03-27T17:00:00Z", "content": "A discovery in the deserts of Namibia, Oman, and Saudi Arabia has opened new doors in the world of geomicrobiology. Mysterious micro-burrows carved into ancient marble and limestone have been uncover… [+3271 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Meet Enaiposha: The New Planet That Defies What We Know About Our Solar System - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a new exoplanet, Enaiposha, that challenges everything we thought we knew about mini-Neptunes. With its thick, haze-filled atmosphere and signs of carbon dioxide, this super-Venus could reshape how we understand planetary evolution.", "url": "https://dailygalaxy.com/2025/03/enaiposha-new-planet-solar-system/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Meet-Enaiposha-The-New-Planet-That-Defies-What-We-Know-About-Our-Solar-System.jpg", "publishedAt": "2025-03-27T16:30:00Z", "content": "Astronomers have recently unveiled an extraordinary discovery in the cosmos: a new exoplanet named Enaiposha, located 47 light-years from our solar system. Initially thought to be a mini-Neptune, thi… [+3007 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Human sacrifices found in a Bronze Age tomb in Turkey were mostly teenage girls - Livescience.com", "description": "Archaeologists are unsure why unrelated teenagers were buried in an elaborate Bronze Age tomb but think their age may be a clue.", "url": "https://www.livescience.com/archaeology/human-sacrifices-found-in-a-bronze-age-tomb-in-turkey-were-mostly-teenage-girls", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MVhZQ2XHs82L9DuffPK5tn-1200-80.jpg", "publishedAt": "2025-03-27T16:21:59Z", "content": "Five millennia ago, Bronze Age people in Mesopotamia\r\n built elaborate stone tombs full of spectacular grave goods and human sacrifices. Researchers are unsure of the meaning of this ritual, but a ne… [+4640 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "'Inside-out, headless wonder' fossil discovered - BBC.com", "description": "Prof Sarah Gabbott named the fossil Sue, after her mother, after discovering it in South Africa.", "url": "https://www.bbc.com/news/articles/c5y41gzxee3o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/a98a/live/072bbe10-0a3f-11f0-8cc5-ad01cd2fc9d6.jpg", "publishedAt": "2025-03-27T16:12:57Z", "content": "Adam Moss\r\nThe fossil is a type of previously undiscovered arthropod and is preserved from the inside out\r\nA professor has published details of a rare \"inside-out, legless, headless wonder\" fossil fr… [+3515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt", "title": "Bizarre wasp preserved in amber flew among dinosaurs - CNN", "description": "A parasitic wasp that flew among dinosaurs had a Venus flytrap-like contraption on its abdomen that likely allowed it to inject eggs into insects it entrapped.", "url": "https://www.cnn.com/2025/03/27/science/ancient-parasitic-wasp-amber/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/image-one-wasp.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-27T16:03:00Z", "content": "Summary\r\n<ul><li>Paleontologists discovered a 99 million-year-old parasitic wasp species with a Venus flytrap-like structure on its abdomen.</li><li>Preserved in amber, Sirenobethylus charybdis likel… [+5987 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Here’s how long it will take astronauts’ bodies—after being stuck in space for 9 months—to readjust to life on Earth. - farmingdale-observer.com", "description": "The recent return of NASA astronauts Barry \"Butch\" Wilmore and Sunita \"Suni\" Williams marks the end of an unexpectedly extended mission aboard the International Space Station. After spending 278 days in space—nearly nine months—their bodies now face significa…", "url": "https://farmingdale-observer.com/2025/03/27/heres-how-long-it-will-take-astronauts-bodies-after-being-stuck-in-space-for-9-months-to-readjust-to-life-on-earth/", "urlToImage": null, "publishedAt": "2025-03-27T15:31:00Z", "content": "The recent return of NASA astronauts Barry “Butch” Wilmore and Sunita “Suni” Williams marks the end of an unexpectedly extended mission aboard the International Space Station. After spending 278 days… [+4713 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Finding Clues in Ruins of Ancient Dead Star With NASA’s Chandra - NASA", "description": "People often think about archaeology happening deep in jungles or inside ancient pyramids. However, a team of astronomers has shown that they can use stars", "url": "https://www.nasa.gov/image-article/finding-clues-in-ruins-of-ancient-dead-star-with-nasas-chandra/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/j1655-illus.jpg", "publishedAt": "2025-03-27T15:15:02Z", "content": "People often think about archaeology happening deep in jungles or inside ancient pyramids. However, a team of astronomers has shown that they can use stars and the remains they leave behind to conduc… [+5327 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Detects “Impossible” Light From the Dawn of Time - SciTechDaily", "description": "Unexpected, Bright Hydrogen Emission Caught Astronomers by Surprise In the early universe, space was filled with a dense fog of neutral hydrogen gas. Although the first stars and galaxies gave off powerful ultraviolet light, much of that light was trapped by …", "url": "https://scitechdaily.com/webb-telescope-detects-impossible-light-from-the-dawn-of-time/", "urlToImage": "https://scitechdaily.com/images/JADES-GS-z13-1-GOODS-S-Field-Webb-NIRCam-Image-scaled.jpg", "publishedAt": "2025-03-27T15:11:47Z", "content": "The incredibly distant galaxy JADES-GS-z13-1, observed just 330 million years after the Big Bang, was initially discovered with deep imaging from NASA’s James Webb Space Telescope’s NIRCam (Near-Infr… [+9390 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Partial solar eclipse 2025 livestreams: Where to watch online for free on March 29 - Space.com", "description": "Here's how to watch all the partial solar eclipse action unfold live online.", "url": "https://www.space.com/partial-solar-eclipse-march-2025-livestreams", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JWbBxZDgz6Rt4LubZY6aVB-1200-80.jpg", "publishedAt": "2025-03-27T15:00:00Z", "content": "A partial solar eclipse is happening on March 29 and you can watch it all online for free.\r\nOn the morning of March 29, the new moon will partially cover the sun's disk\r\n, creating the appearance of … [+2086 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Robert Sanders-UC Berkeley", "title": "Watch: Robot leaps and lands like a squirrel - Futurity: Research News", "description": "No robot can match a squirrel’s ability to leap from limb to limb—until now. Check out video of the robot in action.", "url": "https://www.futurity.org/salto-robot-jumping-landing-squirrels-3274772/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2025/03/squirrel-jump-land-robot-1600.jpg", "publishedAt": "2025-03-27T14:55:54Z", "content": "Based on studies of leaping squirrels, researchers have designed a robot that can stick a landing on a branch.\r\nEngineers have designed robots that crawl, swim, fly, and even slither like a snake, bu… [+8298 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Archaeology Breakthrough Reveals Interbreeding Between Two Species at the Root of Human Origins - Indian Defence Review", "description": "The interbreeding event contributed around 20% of modern human DNA, with these genes predominantly found in regions associated with brain function and neural", "url": "https://indiandefencereview.com/interbreeding-between-species-root-human/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/a-cast-of-a-neanderthal-skul.jpg", "publishedAt": "2025-03-27T14:35:00Z", "content": "A recent study from Cambridge University has revealed new insights into human evolution, casting doubt on the long-standing belief about the origins of Homo sapiens. According to the research, publis… [+4596 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National University of Singapore", "title": "Physicists discover a copper-free high-temperature superconducting oxide - Phys.org", "description": "Professor Ariando and Dr. Stephen Lin Er Chow from the National University of Singapore (NUS) Department of Physics have designed and synthesized a groundbreaking new material—a copper-free superconducting oxide—capable of superconducting at approximately 40 …", "url": "https://phys.org/news/2025-03-physicists-copper-free-high-temperature.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/physicists-discover-a.jpg", "publishedAt": "2025-03-27T12:57:04Z", "content": "Professor Ariando and Dr. Stephen Lin Er Chow from the National University of Singapore (NUS) Department of Physics have designed and synthesized a groundbreaking new materiala copper-free supercondu… [+5125 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National Radio Astronomy Observatory", "title": "Small star, mighty flares: ALMA shares new view of Proxima Centauri - Phys.org", "description": "At a distance of just over four light years, Proxima Centauri is our nearest stellar neighbor and is known to be a very active M dwarf star. Its flare activity has been well-known to astronomers using visible wavelengths of light, but a new study using observ…", "url": "https://phys.org/news/2025-03-small-star-mighty-flares-alma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/small-star-mighty-flar.jpg", "publishedAt": "2025-03-27T12:48:03Z", "content": "At a distance of just over four light years, Proxima Centauri is our nearest stellar neighbor and is known to be a very active M dwarf star. Its flare activity has been well-known to astronomers usin… [+4892 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "First-Ever Images of Neptune's Eerie Glow Finally Reveal Missing Aurora - ScienceAlert", "description": "The most elusive planetary aurora in the Solar System has finally been revealed in all its gently glowing glory.", "url": "https://www.sciencealert.com/first-ever-images-of-neptunes-eerie-glow-finally-reveal-missing-aurora", "urlToImage": "https://www.sciencealert.com/images/2025/03/neptune-glow.jpg", "publishedAt": "2025-03-27T12:01:20Z", "content": "The most elusive planetary aurora in the Solar System has finally been revealed in all its gently glowing glory.\r\nFar from the Sun, and Earth, the sky-blue planet Neptune has been captured shimmering… [+4331 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Cygnus mission to ISS scrapped after finding spacecraft damage - SpaceNews", "description": "NASA and Northrop Grumman will not launch a Cygnus cargo mission to the ISS in June as previously planned after discovering the spacecraft is damaged.", "url": "http://spacenews.com/cygnus-mission-to-iss-scrapped-after-finding-spacecraft-damage/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNFwvMTFcLzUzOTA4OTE1MDY5X2RkMWVhZGJhNDJfay0xMDI0eDY4My5qcGciLCJ0eHQiOiJDeWdudXMgbWlzc2lvbiB0byBJU1Mgc2NyYXBwZWQgYWZ0ZXIgZmluZGluZyBzcGFjZWNyYWZ0IGRhbWFnZSIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.YnL1f9nHLr7k4JA1UEuKq21H35WyPe_nNvUN2cfuz8UMQ", "publishedAt": "2025-03-27T11:51:52Z", "content": "WASHINGTON NASA and Northrop Grumman will not launch a Cygnus cargo mission to the International Space Station in June as previously planned after discovering the spacecraft is damaged.\r\nIn a stateme… [+3040 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Archaeologists Discover Forgotten Foods Hidden in 15,000-Year-Old Kitchens - SciTechDaily", "description": "Microscopic plant residues found on bedrock metates offer new insights into the diets and cultural practices of ancient Indigenous communities in the American West. The mortar, pestle, and cutting board in your kitchen are modern descendants of ancient tools …", "url": "https://scitechdaily.com/archaeologists-discover-forgotten-foods-hidden-in-15000-year-old-kitchens/", "urlToImage": "https://scitechdaily.com/images/Lisbeth-Loutderback-Extracting-Plant-Residue-scaled.jpg", "publishedAt": "2025-03-27T11:11:36Z", "content": "Anthropologist Lisbeth Loutderback extracting plant residues from a metate at an archaeological site on public land in southcentral Oregon. Credit: Stefania Wilks, University of Utah\r\nMicroscopic pla… [+6587 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Sheon Han", "title": "Inside arXiv—the Most Transformative Platform in All of Science - WIRED", "description": "Modern science wouldn’t exist without the online research repository known as arXiv. Three decades in, its creator still can’t let it go.", "url": "https://www.wired.com/story/inside-arxiv-most-transformative-code-science/", "urlToImage": "https://media.wired.com/photos/67daacb4360bbd90c85131e2/191:100/w_1280,c_limit/reverse-diptych.jpg", "publishedAt": "2025-03-27T10:00:00Z", "content": "On the librarys side, some people thought Ginsparg was too hands-on. Others said he wasnt patient enough. A good lower-level manager, according to someone long involved with arXiv, but his sense of m… [+7583 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Why modern humans have smaller faces than Neanderthals and chimpanzees - Livescience.com", "description": "We have smaller faces than Neanderthals and even chimps. A new study may explain how this came to be.", "url": "https://www.livescience.com/archaeology/why-modern-humans-have-smaller-faces-than-neanderthals-and-chimpanzees", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ayrNRJczCUzTG58d4jisDS-1200-80.png", "publishedAt": "2025-03-27T10:00:00Z", "content": "Modern humans have uniquely small and flat faces, especially compared with our Neanderthal\r\n cousins' notoriously robust faces and large noses, but the reason for this difference has eluded paleoanth… [+2807 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Farewell, Gaia! Spacecraft operations come to an end - European Space Agency", "description": "The European Space Agency (ESA) has powered down its Gaia spacecraft after more than a decade spent gathering data that are now being used to unravel the secrets of our home galaxy.On 27 March 2025, Gaia’s control team at ESA’s European Space Operations Centr…", "url": "https://www.esa.int/Enabling_Support/Operations/Farewell_Gaia!_Spacecraft_operations_come_to_an_end", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2022/06/gaia_observes_the_milky_way/24305944-1-eng-GB/Gaia_observes_the_Milky_Way_pillars.jpg", "publishedAt": "2025-03-27T09:59:40Z", "content": "Enabling &amp; Support27/03/20253479 views30 likes\r\nThe European Space Agency (ESA) has powered down its Gaia spacecraft after more than a decade spent gathering data that are now being used to unrav… [+5659 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Webb spies a spiral through a cosmic lens - European Space Agency", "description": "Spying a spiral through a cosmic lens (Webb telescope image)", "url": "https://www.esa.int/ESA_Multimedia/Images/2025/03/Webb_spies_a_spiral_through_a_cosmic_lens", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/03/webb_spies_a_spiral_through_a_cosmic_lens/26634093-1-eng-GB/Webb_spies_a_spiral_through_a_cosmic_lens_pillars.jpg", "publishedAt": "2025-03-27T09:04:46Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Blaze Star: How To Prepare For The Biggest Sky Event For 79 Years - Forbes", "description": "The elusive “Blaze Star” nova (also called T Coronae Borealis/T CrB) may erupt around March 27, appearing as a naked eye star within the Corona Borealis constellation.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/03/27/blaze-star-how-to-prepare-for-the-biggest-sky-event-for-79-years/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67e4c07b3f0b1b3d18042135/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-27T09:00:00Z", "content": "An artist's rendering of T Coronae Borealis, also known as T CrB, a recurrent nova in the ... More constellation Corona Borealis. It is a binary system composed of a red giant star and a white dwarf … [+4849 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Unknown physics may help dark energy act as 'antigravity' throughout the universe - Space.com", "description": "\"There are more questions than answers at this point.\"", "url": "https://www.space.com/the-universe/unknown-physics-may-help-dark-energy-act-as-antigravity-throughout-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2Tz372nbuLMBGDYZuV4vkF-1200-80.png", "publishedAt": "2025-03-27T09:00:00Z", "content": "Dark energy could have an accomplice that helps it slow the growth of large cosmic structures, such as vast superclusters made up of clusters of galaxies.\r\nA new analysis of astronomical data suggest… [+8509 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Tiny Mammal Could Hold the Secret to Reversing Aging - SciTechDaily", "description": "Studying how these distant primate relatives slow aging during hibernation may reveal new strategies for supporting healthy aging in humans. We’re all familiar with the visible signs of aging: sagging skin, thinning hair, and the gradual changes we see in the…", "url": "https://scitechdaily.com/this-tiny-mammal-could-hold-the-secret-to-reversing-aging/", "urlToImage": "https://scitechdaily.com/images/Fat-Tailed-Dwarf-Lemur-Under-a-Blanket.jpg", "publishedAt": "2025-03-27T08:21:24Z", "content": "A hamster-sized primate from Madagascar, the fat-tailed dwarf lemur is our closest genetic relative known to hibernate. They also tend to live longer than you’d expect given their size. New research … [+6244 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "FOX Weather", "title": "SpaceX prepares to launch 4-person crew on first polar orbit mission - New York Post ", "description": "Four space explorers will launch with SpaceX next week on a polar orbital mission that could unlock a new area in space for future spaceflights.", "url": "https://nypost.com/2025/03/27/us-news/spacex-prepares-to-launch-4-person-crew-on-first-polar-orbit-mission/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/03/SPACEXX.jpg?quality=75&strip=all&w=1024", "publishedAt": "2025-03-27T05:41:00Z", "content": "Four space explorers will launch with SpaceX next week on a polar orbital mission that could unlock a new area in space for future spaceflights. \r\nThe four-person mission, known as Fram2, will launch… [+1995 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "NASA Just Shot Rockets At The Northern Lights. This Is What Happened - Forbes", "description": "Sounding rockets launched from the Poker Flat Research Range north of Fairbanks, Alaska, lit up the night sky for miles around during an aurora experiment to investigate", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/03/26/nasa-just-shot-rockets-at-the-northern-lights-this-is-what-happened/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67e4bf5de46fa8eec78763b2/0x0.jpg?format=jpg&crop=4000,2252,x0,y99,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-27T03:04:00Z", "content": "Two NASA rockets launched from Alaska on March 25, 2025, lit up the night sky with strange blue lights and white vapor trails to the backdrop of the Northern Lights. The spectacular display was visib… [+3872 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Tiernan P. Doyle", "title": "NASA Shares SpaceX Crew-11 Assignments for Space Station Mission - NASA", "description": "As part of NASA’s SpaceX Crew-11 mission, four crew members from three space agencies will launch in the coming months to the International Space Station for", "url": "https://www.nasa.gov/news-release/nasa-shares-spacex-crew-11-assignments-for-space-station-mission/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/crew-11.jpg", "publishedAt": "2025-03-27T02:01:57Z", "content": "As part of NASAs SpaceX Crew-11 mission, four crew members from three space agencies will launch in the coming months to the International Space Station for a long-duration science expedition aboard … [+4783 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Toxic Mars Dust Could Pose Major Health Risks For Future Astronauts - ScienceAlert", "description": "Martian dust storms can potentially cause respiratory issues and elevated risk of disease, making them yet another health hazard space agencies need to prepare for, according to new research by the Keck School of Medicine at the University of Southern Califor…", "url": "https://www.sciencealert.com/toxic-mars-dust-could-pose-major-health-risks-for-future-astronauts", "urlToImage": "https://www.sciencealert.com/images/2025/03/MarsDark.jpg", "publishedAt": "2025-03-27T01:26:17Z", "content": "Martian dust storms can potentially cause respiratory issues and elevated risk of disease, making them yet another health hazard space agencies need to prepare for, according to new research by the K… [+7378 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "Stunning Swirl in Europe's Skies Caused by Classified Space X Mission - ScienceAlert", "description": "A stunning blue and white spiral spotted in skies across Europe late Monday was created by frozen fuel tumbling from a SpaceX rocket, according to weather forecasters and scientists.", "url": "https://www.sciencealert.com/stunning-swirl-in-europes-skies-caused-by-classified-space-x-mission", "urlToImage": "https://www.sciencealert.com/images/2025/03/space_x_swirl_sky_header.jpg", "publishedAt": "2025-03-27T01:13:22Z", "content": "A stunning blue and white spiral spotted in skies across Europe late Monday was created by frozen fuel tumbling from a SpaceX rocket, according to weather forecasters and scientists.\r\nThe UK's Met Of… [+3364 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Reveal Hidden Machinery of Mitochondria in Stunning Detail - SciTechDaily", "description": "Scientists in Basel revealed that energy-producing proteins in mitochondria form large supercomplexes, boosting ATP production efficiency and offering new insights into cell biology, evolution, and disease. Mitochondria, often called the powerhouses of the ce…", "url": "https://scitechdaily.com/scientists-reveal-hidden-machinery-of-mitochondria-in-stunning-detail/", "urlToImage": "https://scitechdaily.com/images/Mitochondrial-Membrane-Supercomplexes-scaled.jpg", "publishedAt": "2025-03-27T00:17:07Z", "content": "The flux of protons from respiratory supercomplexes (blue) to ATP producing complexes (pink) powers the regeneration of ATP in mitochondria. Credit: Biozentrum / Verena Resh, https://luminous-lab.com… [+3751 chars]"}, {"source": {"id": null, "name": "Southernliving.com"}, "author": "https://www.facebook.com/SouthernLiving/", "title": "How To Keep Squirrels Out Of Your Potted Plants, According To Experts - Southern Living", "description": "Learn how to keep squirrels out of potted plants with these effective strategies from experts.", "url": "https://www.southernliving.com/how-to-keep-squirrels-out-of-potted-plants-11700047", "urlToImage": "https://www.southernliving.com/thmb/VD_9PiBEUvmwRudwKiX23NCT8ro=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2192028132-f76fcb25034648d29e5b703d9940dadc.jpg", "publishedAt": "2025-03-26T22:14:11Z", "content": "Youve just finished planting your containers with flowers, herbs, or veggies, only to come outside later to find your plants uprooted and dirt scattered everywhere. What just happened here?\r\nChances … [+2928 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ABC News", "title": "First shark sound recordings captured by researchers, study shows - ABC News", "description": null, "url": "https://abcnews.go.com/US/sound-recordings-sharks-captured-researchers-new-study-shows/story?id\\\\u003d120173506", "urlToImage": null, "publishedAt": "2025-03-26T21:22:30Z", "content": null}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "The Best Photos Taken by the Blue Ghost Moon Lander - PetaPixel", "description": "It captured some beauties.", "url": "https://petapixel.com/2025/03/26/the-best-photos-taken-by-the-blue-ghost-moon-lander/", "urlToImage": "https://petapixel.com/assets/uploads/2025/03/Blue-Ghost.jpg", "publishedAt": "2025-03-26T19:13:23Z", "content": "The Blue Ghost lunar lander’s mission may have ended, now resting lifeless on the Moons surface, but its success has secured its place in history.\r\nBlue Ghost was a rare success in NASA’s CLPS and Ar… [+3706 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Robin George Andrews", "title": "Astronomers just found a new treasure trove of galaxies. They could help answer our biggest questions. - National Geographic", "description": "Euclid, a European space telescope, just captured 26 million galaxies to reveal the secrets of the dark universe.", "url": "https://www.nationalgeographic.com/science/article/euclid-space-telescope-galaxies-dark-universe", "urlToImage": "https://i.natgeofe.com/n/c38bd938-94b4-4a74-a433-448a88e87f0e/Location_of_Euclid_Deep_Fields_on_Gaia_and_Planck_sky_map_16x9.jpg?w=1200", "publishedAt": "2025-03-26T18:37:41Z", "content": "Each galaxy is beautiful, says Adam Amara, an astrophysicist and the UK Space Agencys chief scientist. But we didnt design [Euclid] to produce pretty pictures. We designed it to do hard science.\r\nIde… [+1249 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Stanford University", "title": "How survivors spanned the globe after Earth's biggest mass extinction - Phys.org", "description": "Scientists don't call it the \"Great Dying\" for nothing. About 252 million years ago, upward of 80% of all marine species vanished during the end-Permian mass extinction—the most extreme event of its kind in Earth's history.", "url": "https://phys.org/news/2025-03-survivors-spanned-globe-earth-biggest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/how-survivors-spanned.jpg", "publishedAt": "2025-03-26T18:33:05Z", "content": "Scientists don't call it the \"Great Dying\" for nothing. About 252 million years ago, upward of 80% of all marine species vanished during the end-Permian mass extinctionthe most extreme event of its k… [+7555 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Jijo Malayil", "title": "New adaptive quadruped robot moves like a dog without using motors - Interesting Engineering", "description": "Researchers developed a motor-free quadruped robot mimicking dog motion using springs and cables, adapting to speed changes on a treadmill.", "url": "https://interestingengineering.com/innovation/motor-free-robot-mimics-dog-gait", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/03/Untitled-design-2025-03-26T200746.742.jpg", "publishedAt": "2025-03-26T18:23:00Z", "content": "The group presents Passive Automata with Synergies (PAWS), a quadruped robot that uses four motors to operate its twelve degrees of freedom in a synergistic manner. The motors combine synergy-based a… [+1060 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Jen Thomas", "title": "Wife of 'stranded' NASA astronaut reveals major health issue he's struggling with after nine months - World News - UNILAD", "description": "After a shocking nine months away, the newly-returned astronauts are struggling to adapt back to normal life", "url": "https://www.unilad.com/news/world-news/nasa-stranded-astronaut-barry-wilmore-return-home-wife-291976-20250326", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt3e5bd9572c657c7f/67e43d06ebe94260fb220a4a/wife-stranded-nasa-astronaut-health-issues-since-returning-earth.png", "publishedAt": "2025-03-26T18:20:08Z", "content": "After spending nine months in space, one of the 'stranded' astronauts is struggling following his return home, according to his wife.\r\nAstronaut Barry 'Butch' Wilmore was 'stranded' in space for 286 … [+2976 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Strange sphere-studded rock on Mars found by NASA's Perseverance rover - Yahoo", "description": "NASA's Perseverance rover has encountered another rock on Mars that has left scientists puzzled.", "url": "https://www.space.com/space-exploration/mars-rovers/strange-sphere-studded-rock-on-mars-found-by-nasas-perseverance-rover", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Cee7TfqMihChIW1Tplg.Ig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/baf4a8cd06b1546cd5e7317d8874404c", "publishedAt": "2025-03-26T18:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nPerseverance acquired this image of the \"St. Pauls Bay\" target (the dark-toned float block in t… [+3764 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Could the ‘Shining Anus’ Volcano in Tonga Erupt Like the Hunga Tonga Disaster? - The Daily Galaxy --Great Discoveries Channel", "description": "A mysterious volcano in Tonga, known for its colorful mythological history and the tale of a shining anus, is showing signs of life again. Could Lofia erupt with the same catastrophic force as Hunga Tonga-Hunga Ha'apai?", "url": "https://dailygalaxy.com/2025/03/shining-anus-volcano-erupt/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Could-the-‘Shining-Anus-Volcano-in-Tonga-Erupt-Like-the-Hunga-Tonga-Disaster.jpg", "publishedAt": "2025-03-26T18:00:00Z", "content": "A striking satellite image of Tongas Tofua Island, taken on April 23, 2022, has captured smoke rising from a volcanic cone known as Lofia. The image, captured by Landsat 9, offers a sobering reminder… [+2597 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Ben Cost", "title": "‘City-killer’ asteroid won’t hit Earth in 2032, but don’t worry— another threat is looming - New York Post ", "description": "Keep on rocking the free world.", "url": "https://nypost.com/2025/03/26/science/city-killer-asteroid-2024-yr4-wont-hit-earth-in-2032-but-another-threat-looms/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/03/101131507.jpg?quality=75&strip=all&w=1024", "publishedAt": "2025-03-26T17:24:00Z", "content": "We could experience a rock market crash.\r\nAsteroid 2024 YR4 won’t hit Earth in December 2032, but that doesn’t mean we’re out of the woods forever. \r\nResearchers warn that “city killer” space rock co… [+3923 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Joe Wilkins", "title": "Fireballs Appear Around the World as Parts of SpaceX Crew Dragon Scream Back to Earth - Futurism", "description": "A week after a SpaceX crew module returned four astronauts from the ISS, their luggage module seems to have caused a wild show on its return.", "url": "https://futurism.com/fireballs-spacex-crew-dragon", "urlToImage": "https://wordpress-assets.futurism.com/2025/03/fireballs-spacex-crew-dragon.jpg", "publishedAt": "2025-03-26T17:05:33Z", "content": "For all his faults, Elon Musk sure knows how to keep things interesting.\r\nYesterday, skies around the world lit up with what seems to be returning debris courtesy of Musk's private space travel compa… [+3343 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Alan Bradley", "title": "Scientists unveil new type of 'time crystal' that defies our traditional understanding of time and motion - Livescience.com", "description": "The latest time crystal innovation may expand the known boundaries of quantum mechanics.", "url": "https://www.livescience.com/physics-mathematics/scientists-unveil-new-type-of-time-crystal-that-defies-our-traditional-understanding-of-time-and-motion", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BGVGCs29gzzqxaP73juwNV-1200-80.jpg", "publishedAt": "2025-03-26T16:39:05Z", "content": "Physicists have created a new type of time crystal\r\n that may help confirm some fundamental theories about quantum interactions.\r\nA standard time crystal is a new phase of matter\r\n that features perp… [+3506 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "First humans in South America survived by eating giant armadillos - Earth.com", "description": "Early human migration timeline into South America has stirred debate. Researchers have long argued about when these first travelers arrived.", "url": "https://www.earth.com/news/first-humans-in-south-america-survived-by-eating-giant-armadillos-neosclerocalyptus/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/26100353/first-humans_south-america_butchering-giant-armadillo_Neosclerocalyptus_credit-Voglino_1m.jpg", "publishedAt": "2025-03-26T16:28:19Z", "content": "The story of early human migration into South America has stirred debate. Researchers have long argued about when these first travelers arrived, how they adapted, and which paths they followed. \r\nEvi… [+5732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Hidden Cell Response Could Be the Key to Beating Cancer and Brain Disease - SciTechDaily", "description": "Cells don’t just follow a rigid script when responding to stress – they’re far more adaptable than we thought. A new study reveals that this stress response can be fine-tuned depending on the type and intensity of the threat. This discovery, called the “split…", "url": "https://scitechdaily.com/this-hidden-cell-response-could-be-the-key-to-beating-cancer-and-brain-disease/", "urlToImage": "https://scitechdaily.com/images/Neuron-Brain-Cell-Stress-Art.jpg", "publishedAt": "2025-03-26T16:00:21Z", "content": "A new discovery shows that cells can tailor their stress response, offering clues to treating cancers and brain diseases more effectively. Credit: SciTechDaily.com\r\nCells don’t just follow a rigid sc… [+4384 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "How NASA’s Perseverance Is Helping Prepare Astronauts for Mars - NASA", "description": "The rover carries several swatches of spacesuit materials, and scientists are assessing how they’ve held up after four years on the Red Planet.", "url": "https://www.nasa.gov/missions/mars-2020-perseverance/perseverance-rover/how-nasas-perseverance-is-helping-prepare-astronauts-for-mars/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/1-enhanced-percy-spacesuit-materials.jpg", "publishedAt": "2025-03-26T15:32:28Z", "content": "The rover carries several swatches of spacesuit materials, and scientists are assessing how theyve held up after four years on the Red Planet.\r\nNASAs Perseverance rover landed on Mars in 2021 to sear… [+5903 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Fluorescent Rocks in Wind Cave National Park May Show How Life Could Exist on One of Jupiter's Moons - Good News Network", "description": "Inside Wind Cave the scientists found that chemicals fossilised within the rocks shine in brilliant hues of pink, blue, and green.", "url": "https://www.goodnewsnetwork.org/fluorescent-rocks-in-wind-cave-national-park-may-show-how-life-could-exist-on-one-of-jupiters-moons/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/03/One-of-Sebrees-students-Jacqueline-Heggen-showing-off-glowing-formations-within-Wind-Cave-credit-Joshua-Sebree-via-SWNS.jpg", "publishedAt": "2025-03-26T15:30:36Z", "content": "One of Sebrees students, Jacqueline Heggen, showing off glowing formations within Wind Cave – credit Joshua Sebree via SWNS\r\nFluorescent chambers inside South Dakota’s Wind Cave has given scientists … [+3944 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Invisible electric field discovered surrounding Earth, NASA says it's 'as crucial as gravity' - Earth.com", "description": "According to scientists, this ambipolar electric field is thought to be just as crucial to Earth as both gravity and magnetism.", "url": "https://www.earth.com/news/invisible-electric-field-discovered-surrounding-earth-nasa-says-its-as-crucial-as-gravity/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/26083001/earth_ambipolar-electric-field_third-global-field_NASA_1m.jpg", "publishedAt": "2025-03-26T14:55:24Z", "content": "Observations from a NASA suborbital rocket have enabled an international group of experts to measure a global electric field that surrounds Earth for the first time ever.\r\nAccording to scientists, th… [+5603 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Giant claw unearthed in Mongolia belongs to a new species of two-fingered dinosaur - Phys.org", "description": "An international team of paleontologists and Earth scientists has identified fossilized remains as a two-clawed therizinosaur. The fossils were unearthed more than a decade ago in Mongolia. Their paper is published in the journal iScience.", "url": "https://phys.org/news/2025-03-giant-claw-unearthed-mongolia-species.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/largest-complete-claw-2.jpg", "publishedAt": "2025-03-26T14:50:03Z", "content": "An international team of paleontologists and Earth scientists has identified fossilized remains as a two-clawed therizinosaur. The fossils were unearthed more than a decade ago in Mongolia. Their pap… [+2405 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Global warming exposes 1,620 kilometers of new Greenland coastline - Phys.org", "description": "An international team of polar ecologists, geographers, and marine scientists has found that global warming has, over the past 20 years, melted enough glacier ice in Greenland that an additional 1,620 kilometers of that country's coastline is now exposed to t…", "url": "https://phys.org/news/2025-03-global-exposes-kilometers-greenland-coastline.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/global-warming-exposes-2.jpg", "publishedAt": "2025-03-26T14:30:08Z", "content": "An international team of polar ecologists, geographers, and marine scientists has found that global warming has, over the past 20 years, melted enough glacier ice in Greenland that an additional 1,62… [+2821 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Mysterious Flow of Fluid in the Brain - Quanta Magazine", "description": "A popular hypothesis for how the brain clears molecular waste, which may help explain why sleep feels refreshing, is a subject of debate.", "url": "https://www.quantamagazine.org/the-mysterious-flow-of-fluid-in-the-brain-20250326/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/03/Glymphatic-Theory-cr.ChanelleNibbelink-Social.jpg", "publishedAt": "2025-03-26T14:25:24Z", "content": "Whats more, during NREM sleep norepinephrine levels change rhythmically. This neurotransmitter could help tie together their hypotheses the physical movement of CSF through brain tissues and the brai… [+4015 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Dave S. Brody", "title": "New documentary 'Children of the Sky' asks the bold question: Can we raise kids in space? (op-ed) - Space.com", "description": "A new 28-minute film explores the medical, social, political and ethical challenges of parenthood and child-rearing that truly permanent communities in space will need to solve.", "url": "https://www.space.com/entertainment/new-documentary-children-of-the-sky-asks-the-bold-question-can-we-raise-kids-in-space-op-ed", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Nvy2utGp4W3SvwAb3TQMoB-1200-80.jpg", "publishedAt": "2025-03-26T13:00:00Z", "content": "Dave Brody writes and directs space-themed non-fiction documentary television.\r\nThere is much talk lately about cities on Mars, multiple bases on the moon, free orbiting \"islands\" in space where tens… [+14787 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Tejasri Gururaj", "title": "China’s record-breaking EV supercapacitor retains 81% power after 10,000 cycles - Interesting Engineering", "description": "A new hybrid electrolyte design shows promise for supercapacitors, exhibiting stability at extreme temperatures and at higher voltages.", "url": "https://interestingengineering.com/innovation/supercapacitor-electrical-energy-battery", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/03/IE-Photo-71-2.jpg", "publishedAt": "2025-03-26T12:49:00Z", "content": "Electrolyte ions, under the influence of an external voltage, move toward electrodes with opposite charges, consequently forming double charge layers.\r\nAs more voltage is applied to the circuit, more… [+743 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "AFP", "title": "‘Unprecedented’ mass bleaching drains life from Australian reef - DAWN.com", "description": "Scientist says a months-long marine heatwave has “cooked” the sprawling Ningaloo Reef.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2025/03/26170538d7acabf.jpg?r=170753", "publishedAt": "2025-03-26T12:15:12Z", "content": "An unprecedented mass bleaching event has been recorded off Australias western coast, scientists said on Wednesday, turning huge chunks of a celebrated reef system a sickly dull white.\r\nA months-long… [+3366 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Unravel the Bizarre Physics of the Mpemba Effect - SciTechDaily", "description": "Scientists are uncovering the mysteries of the Mpemba effect. The Mpemba effect, whereby hotter systems can cool faster than cooler ones under identical conditions, was first noted by Aristotle over 2,000 years ago. It was rediscovered in 1963 by Tanzanian st…", "url": "https://scitechdaily.com/scientists-unravel-the-bizarre-physics-of-the-mpemba-effect/", "urlToImage": "https://scitechdaily.com/images/Physics-Water-Art-Concept.jpg", "publishedAt": "2025-03-26T12:13:27Z", "content": "Researchers used thermomajorization theory to create a universal method for detecting the Mpemba effect, revealing it can occur across wide temperature ranges and may have broad scientific and techno… [+3306 chars]"}, {"source": {"id": null, "name": "KSBY San Luis Obispo News"}, "author": "KSBY Staff", "title": "SpaceX targeting liftoff out of Vandenberg Wednesday afternoon - KSBY News", "description": "SpaceX is targeting liftoff of a Falcon 9 rocket Wednesday afternoon out of Vandenberg Space Force Base", "url": "https://www.ksby.com/news/local-news/spacex-targeting-liftoff-out-of-vandenberg-wednesday-afternoon", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/50cc0ea/2147483647/strip/true/crop/4032x2117+0+454/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F19%2F61%2Faf8f7fb044e4857f26f0370b33a1%2Fvandenberg-space-force-base.jpg", "publishedAt": "2025-03-26T10:59:39Z", "content": "SpaceX is aiming for takeoff this afternoon out of Vandenberg Space Force Base.\r\nTeam Vandenberg Guardians and Airmen will be supporting a SpaceX Falcon 9 launch, sending 27 Starlink satellites to lo… [+549 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "\"Space tornadoes\" discovered at the center of our galaxy - Earth.com", "description": "Deep in the galaxy’s central molecular zone (CMZ), clouds of dust and gas swirl amid energetic shock waves.", "url": "https://www.earth.com/news/space-tornadoes-discovered-at-the-center-of-our-galaxy/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/25143102/milky-way-black-hole_polarized_location_emissions_sagittarius-A_NASA_1m.jpg", "publishedAt": "2025-03-26T10:20:09Z", "content": "Deep in the galaxys central molecular zone (CMZ), surrounding the supermassive black hole at the Milky Ways center, clouds of dust and gas swirl amid energetic shock waves. \r\nNow, a collaboration of … [+5783 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA just made a compelling discovery on Mars - Mashable", "description": "\"We are ready to take the next big step.\"", "url": "https://mashable.com/article/mars-nasa-curiosity-rover-discovers-large-organic-molecules", "urlToImage": "https://helios-i.mashable.com/imagery/articles/05HmtiPgeG8HLIHlC0Hshhv/hero-image.fill.size_1200x675.v1742909065.png", "publishedAt": "2025-03-26T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Thetransmitter.org"}, "author": "Eva Dyer", "title": "Accepting “the bitter lesson” and embracing the brain’s complexity - The Transmitter: Neuroscience News and Perspectives", "description": "To gain insight into complex neural data, we must move toward a data-driven regime, training large models on vast amounts of information. We asked nine experts on computational neuroscience and neural data analysis to weigh in.", "url": "https://www.thetransmitter.org/neuroai/accepting-the-bitter-lesson-and-embracing-the-brains-complexity/", "urlToImage": "https://www.thetransmitter.org/wp-content/uploads/2025/03/cropped-Data-streams-neuro-525-1.png", "publishedAt": "2025-03-26T04:00:37Z", "content": "It is often said that the brain is the most complex object in the universe. Whether this cliche is actually true or not, it points to an undeniable reality: Neural data is incredibly complex and diff… [+9173 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Upends Traditional Views About Memory - SciTechDaily", "description": "New research from the University of Chicago challenges long-held beliefs about how synaptic plasticity contributes to memory and learning. As animals encounter new experiences, the connections between their neurons, known as synapses, adjust in strength depen…", "url": "https://scitechdaily.com/new-research-upends-traditional-views-about-memory/", "urlToImage": "https://scitechdaily.com/images/Brain-Memory-Intelligence-Consciousness-Art-Concept.jpg", "publishedAt": "2025-03-26T03:56:24Z", "content": "New research from the University of Chicago reveals that memory-related brain activity continues to evolve even after something is learned, challenging traditional views of synaptic plasticity. A new… [+6941 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Sara Thompson", "title": "If You Can Name At Least 6 Of These Birds By Their Feathers, You're Smarter Than Today's Average Adult - BuzzFeed", "description": "I hope you've been paying attention to the winged creatures!", "url": "https://www.buzzfeed.com/sarathompson1/identify-birds-feathers-animals-trivia-quiz", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2025-03/24/19/thumb/Uxlt5F1Mm.jpg?crop=2000:1050;0,0%26downsize=1250:*", "publishedAt": "2025-03-26T02:31:03Z", "content": null}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Tim Vernimmen", "title": "How do seals know how long to hold their breath? - National Geographic", "description": "The sea mammals may actually be able to sense the amount of oxygen in their blood—something we humans can't do.", "url": "https://www.nationalgeographic.com/animals/article/seal-dive-drown-blood-oxygen", "urlToImage": "https://i.natgeofe.com/n/2f05dd62-c067-433e-b20e-f9c1348cbdf0/NationalGeographic_2728298_16x9.jpg?w=1200", "publishedAt": "2025-03-20T18:24:19Z", "content": "All-you-can-eat seafood\r\nTo find out if oxygen levels affected seal behavior, McKnight and his colleagues created a special section in a pool where young gray seals were temporarily held before being… [+1678 chars]"}]}