{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Main cause of sunburn is finally identified, and it's time to rewrite the textbooks - Earth.com", "description": "New research reveals that sunburn may be caused by RNA damage, not DNA, challenging long-held beliefs about UV exposure", "url": "https://www.earth.com/news/main-cause-of-sunburn-finally-identified-is-rna-damage-not-dna/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/21142716/sunburn-cause_rna-damage_not-dna-damage_1m.jpg", "publishedAt": "2025-01-21T21:40:41Z", "content": "Sunburn is painful skin damage that we’ve all experienced after spending a bit too much time outdoors without protection from UV rays. Whether it’s from a lazy beach day or an exhilarating hike, the … [+4976 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Microglia Act Differently in Male and Female Brains - Neuroscience News", "description": "Microglia, the brain’s immune cells, play vital roles in clearing toxins and maintaining neuronal health but can also contribute to neurodegenerative diseases if overactive.", "url": "https://neurosciencenews.com/microglia-sex-differences-28375/", "urlToImage": "https://neurosciencenews.com/files/2025/01/male-female-microglia-neuroscience.jpg", "publishedAt": "2025-01-21T21:05:45Z", "content": "Summary: Microglia, the brains immune cells, play vital roles in clearing toxins and maintaining neuronal health but can also contribute to neurodegenerative diseases if overactive. New research reve… [+6717 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Yahya Chaudhry", "title": "Scientists succeed in trapping molecules to perform quantum operations for the first time - Phys.org", "description": "Molecules haven't been used in quantum computing, even though they have the potential to make the ultra-high-speed experimental technology even faster. Their rich internal structures were seen as too complicated, too delicate, too unpredictable to manage, so …", "url": "https://phys.org/news/2025-01-scientists-succeed-molecules-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-make-leap.jpg", "publishedAt": "2025-01-21T20:28:52Z", "content": "Molecules haven't been used in quantum computing, even though they have the potential to make the ultra-high-speed experimental technology even faster. Their rich internal structures were seen as too… [+5864 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Bill Nelson steps down as NASA chief as Trump begins 2nd term - Space.com", "description": "The White House has appointed Janet Petro as acting NASA administrator.", "url": "https://www.space.com/space-exploration/bill-nelson-steps-down-as-nasa-chief-as-trump-begins-2nd-term", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MCErTkFj9Fre5staNDsBuM-1200-80.jpg", "publishedAt": "2025-01-21T20:00:00Z", "content": "Bill Nelson has stepped down as NASA administrator, ending a half-century of public service.\r\nNelson and NASA Deputy Administrator Pam Melroy left the agency on Monday (Jan. 20), the day that Donald … [+3831 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Uncover Colossal Radio Galaxy 32 Times the Size of the Milky Way - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a \"troublesome\" radio galaxy named Inkathazo, 32 times the size of the Milky Way. Located in a dense galaxy cluster, this colossal structure challenges existing theories about how giant radio galaxies form and evolve. What makes In…", "url": "https://dailygalaxy.com/2025/01/radio-galaxy-32-times-size-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Astronomers-Uncover-Colossal-Radio-Galaxy-32-Times-the-Size-of-the-Milky-Way.jpg", "publishedAt": "2025-01-21T19:30:00Z", "content": "Astronomers have identified a colossal giant radio galaxy (GRG) stretching 3.3 million light-years across32 times the size of our Milky Way. Named Inkathazo, which means “trouble” in isiZulu and isiX… [+5700 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mars’ Greatest Mystery Solved: Scientists Uncover the Forces Behind Its Divided Terrain - The Daily Galaxy --Great Discoveries Channel", "description": "Mars’ hemispheres hold a geological mystery that has baffled scientists for decades: Why does the southern terrain rise dramatically above the smooth northern plains? Using seismic data from NASA’s InSight lander, researchers may have finally solved the riddl…", "url": "https://dailygalaxy.com/2025/01/mars-greatest-mystery-solved-scientists/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Mars-Greatest-Mystery-Solved-Scientists-Uncover-the-Forces-Behind-Its-Divided-Terrain.jpg", "publishedAt": "2025-01-21T19:00:00Z", "content": "Mars, the enigmatic Red Planet, has long puzzled scientists with a dramatic geological contrast between its hemispheres, known as the Martian dichotomy. The planet’s southern highlands tower five to … [+5066 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Watch (and hear!) a meteorite impact on doorbell camera video in a world 1st - Space.com", "description": "The audio and video was captured last July on Prince Edward Island, off the coast of Canada.", "url": "https://www.space.com/stargazing/meteors-showers/watch-and-hear-a-meteorite-impact-on-doorbell-camera-video-in-a-world-1st", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DGDiPmrwJbeLtuEmeEXFvh-1200-80.jpg", "publishedAt": "2025-01-21T18:00:00Z", "content": "A sharp crash that sounds like glass shattering or ice cracking has been documented as likely the world's first audio recording of a meteorite crash. It came by chance from a doorbell camera, recorde… [+1991 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Andrey Feldman", "title": "Cosmic voids may explain the universe's acceleration without dark energy - Livescience.com", "description": "New research suggests that dark energy isn't needed to explain the acceleration in the expansion of the universe — instead suggesting giant voids in space are creating an illusion.", "url": "https://www.livescience.com/physics-mathematics/dark-energy/cosmic-voids-may-explain-the-universes-acceleration-without-dark-energy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/N5prfkoB4ckrKrfjcriCCU-1200-80.jpg", "publishedAt": "2025-01-21T17:57:04Z", "content": "Dark energy, the mysterious force that's driving the accelerating expansion of the universe, may not actually exist, scientists say. Their research has brought into question one of the cornerstones o… [+5980 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "How to get a perfect salt ring deposit in your pasta pot - Ars Technica", "description": "Particle diameter, height from which they fall through water, and particle volume are key factors.", "url": "https://arstechnica.com/science/2025/01/how-to-get-a-perfect-salt-ring-deposit-in-your-pasta-pot/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/pasta-ring-1152x648.jpg", "publishedAt": "2025-01-21T17:41:12Z", "content": null}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Global Climate Hope: Earth’s Critical Ocean Current Remains Stable After 60 Years - Indian Defence Review", "description": "Defying decades of dire predictions, the Atlantic Meridional Overturning Circulation (AMOC), a critical driver of Earth’s climate, has remained stable for over 60 years. But as global warming accelerates, can this vital system withstand the mounting pressures…", "url": "https://indiandefencereview.com/climate-hope-earths-ocean-current-stable/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Global-Climate-Hope-Vital-Ocean-Circulation-System-Defies-Predictions-of-Collapse.jpg", "publishedAt": "2025-01-21T17:22:53Z", "content": "The Atlantic Meridional Overturning Circulation (AMOC), a critical ocean current system that redistributes heat and regulates Earths climate, has remained remarkably stable for the past six decades. … [+5463 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Australian Man Realizes Moon Looks Different In Northern Hemisphere After Living There Several Years - IFLScience", "description": "I knew something was up but I couldn't fuckin put my finger on it", "url": "https://www.iflscience.com/australian-man-realizes-moon-looks-different-in-northern-hemisphere-after-living-there-several-years-77716", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77716/aImg/81602/moon-meta.png", "publishedAt": "2025-01-21T17:05:14Z", "content": "An Australian man who moved abroad has revealed that he only realized that the Moon looks different in the Northern Hemisphere after several years of living there.Popular TikTok user coreyyy.exe put … [+2452 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Matthew Cappucci", "title": "Look up through the month for a dazzling parade of planets - The Washington Post", "description": "Four of the planets will be bright, but you might spot a few others with a telescope.", "url": "https://www.washingtonpost.com/weather/2025/01/21/how-to-view-planets-align-saturn-mars-jupiter-venus/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QFWLDSCW5FFYHJPGWSQPNLBR2M_size-normalized.jpg&w=1440", "publishedAt": "2025-01-21T16:41:42Z", "content": "A parade of planets will be visible to skywatchers around the globe through the rest of this month and into February.\r\nAt least four planets Venus, Jupiter, Mars and Saturn should be visible with the… [+2768 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "First-Ever Documented Supersonic Winds Are Ripping Through This Exoplanet - Gizmodo", "description": "The jet winds are moving at nearly six times the speed of the exoplanet's rotation.", "url": "https://gizmodo.com/supersonic-winds-are-ripping-through-this-exoplanet-at-record-breaking-speeds-2000552735", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/Supersonic-winds-on-exoplanet-1.jpeg", "publishedAt": "2025-01-21T16:30:05Z", "content": "The farthest planet from the Sun, Neptune, is the windiest place in the solar system, with winds that whip through at speeds reaching more than 0.3 miles per second (0.5 kilometers per second). That’… [+3730 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mysterious ‘Sunken Worlds’ Discovered Deep in Earth’s Mantle Defy Scientific Explanation - Indian Defence Review", "description": "Deep within Earth's mantle, scientists have uncovered mysterious structures in places they shouldn’t exist. These “sunken worlds,” revealed through cutting-edge imaging, may be remnants of ancient crust or entirely new formations. What secrets do they hold ab…", "url": "https://indiandefencereview.com/mysterious-sunken-worlds-in-earths-mantle/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Mysterious-Sunken-Worlds-Discovered-Deep-in-Earths-Mantle-Defy-Scientific-Explanation.jpg", "publishedAt": "2025-01-21T16:30:00Z", "content": "In a discovery that could reshape our understanding of Earth’s interior, scientists have identified enigmatic structures deep within the planet’s mantle. Described as sunken worlds, these anomalies d… [+4572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Earth’s magnetic north pole is on the move, and scientists just updated its position - CNN", "description": "Your navigation system just got a critical update, one that happens periodically because Earth’s magnetic north pole keeps moving. Here’s what to know.", "url": "https://www.cnn.com/2025/01/21/science/magnetic-north-pole-new-position/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gurfbgsnorthpoleglobe-20241213t092514.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-21T16:22:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nIf you are using your smartphone to navigate, your sys… [+7113 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carolyn Collins Petersen", "title": "Black holes are spinning faster than expected, researchers find - Phys.org", "description": "There's a universe full of black holes out there, spinning merrily away—some fast, others more slowly. A recent survey of supermassive black holes reveals that their spin rates reveal something about their formation history.", "url": "https://phys.org/news/2025-01-black-holes-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/black-holes-are-spinni-2.jpg", "publishedAt": "2025-01-21T16:01:08Z", "content": "There's a universe full of black holes out there, spinning merrily awaysome fast, others more slowly. A recent survey of supermassive black holes reveals that their spin rates reveal something about … [+5859 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mysterious Red Dots in the Sky May Point to the Birth of the Universe’s First Black Holes - Indian Defence Review", "description": "NASA’s James Webb Space Telescope has uncovered mysterious \"little red dots\" scattered across the early universe. Could these enigmatic objects, likely harboring growing black holes, hold the key to understanding the infancy of the cosmos? Astronomers are rac…", "url": "https://indiandefencereview.com/mysterious-red-dots-birth-black-holes/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Mysterious-Red-Dots-in-the-Sky-May-Point-to-the-Birth-of-the-Universes-First-Black-Holes.jpg", "publishedAt": "2025-01-21T16:00:00Z", "content": "Astronomers have uncovered a mysterious population of celestial objects in the early universe, nicknamed little red dots (LRDs), through the groundbreaking observations of NASAs James Webb Space Tele… [+4711 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": "Yasemin Saplakoglu", "title": "Concept Cells Help Your Brain Abstract Information and Build Memories - Quanta Magazine", "description": "Individual cells in the brain light up for specific ideas. These concept neurons, once known as “Jennifer Aniston cells,” help us think, imagine and remember episodes from our lives.", "url": "https://www.quantamagazine.org/concept-cells-help-your-brain-abstract-information-and-build-memories-20250121/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/01/Concept-Neurons_crCarlos-Arrojo-Social.jpg", "publishedAt": "2025-01-21T15:32:42Z", "content": "He knew that his observation of one neuron firing didnt mean there was only one neuron for every concept. If that were true, the chance of finding it would be close to zero, he said. I used to joke t… [+9502 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "15-million-year-old insects stun scientists with their unusual traits - Earth.com", "description": "Ancient New Zealand insect fossils reveal new genus of whitefly and first psyllid wing, enriching knowledge of Miocene biodiversity.", "url": "https://www.earth.com/news/ancient-insects-fossils-whitefly-stun-scientists-with-their-unusual-traits/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/19102924/15-million-year-old-insect-unusual-traits-discovery.jpg", "publishedAt": "2025-01-21T15:22:06Z", "content": "Miocene sediments in parts of New Zealand have always hinted at a lively past. Now, new finds in the Hindon Maar Complex suggest that ancient insects may have been more varied than once imagined. \r\nA… [+5651 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Readily-Available Dietary Supplement Could Help Treat Liver Cancer - SciTechDaily", "description": "Salk scientists have found that eliminating the bile acid-producing protein BAAT and supplementing with the bile acid UDCA can regulate tumor growth in mice with liver cancer. This discovery suggests that UDCA dietary supplements could offer a fast and effect…", "url": "https://scitechdaily.com/scientists-discover-readily-available-dietary-supplement-could-help-treat-liver-cancer/", "urlToImage": "https://scitechdaily.com/images/Human-Liver.Pain-Disease.jpg", "publishedAt": "2025-01-21T14:41:03Z", "content": "Salk Institute researchers found that regulating bile acids—specifically reducing harmful ones and increasing UDCA—can enhance T cell function and potentially make immunotherapy more effective for li… [+8547 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Seven new dark comets discovered in our solar system - Earth.com", "description": "Michigan State University and NASA researchers discover seven dark comets that reveal new solar system secrets.", "url": "https://www.earth.com/news/seven-new-dark-comets-discovered-in-our-solar-system/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/19035421/michigan-state-nasa-discovery-seven-dark-comets-solar-system.jpg", "publishedAt": "2025-01-21T14:27:01Z", "content": "Dark comets have become a buzzworthy subject among astronomers since researchers announced the discovery of seven additional examples of these mysterious objects.\r\nIn direct observations, they seem t… [+5189 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Newly fabricated crystals control interactions between high-frequency phonons and single quantum systems - Phys.org", "description": "Phonons, the quantum mechanical vibrations of atoms in solids, are often sources of noise in solid-state quantum systems, including quantum technologies, which can lead to decoherence and thus adversely impact their performance.", "url": "https://phys.org/news/2025-01-newly-fabricated-crystals-interactions-high.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/using-diamond-phononic.jpg", "publishedAt": "2025-01-21T12:00:04Z", "content": "Phonons, the quantum mechanical vibrations of atoms in solids, are often sources of noise in solid-state quantum systems, including quantum technologies, which can lead to decoherence and thus advers… [+3866 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Next Solar Superstorm Might Leave the Planet in Darkness: Experts Sound the Alarm - The Daily Galaxy --Great Discoveries Channel", "description": "A massive solar storm could be brewing, with the potential to wreak havoc on Earth’s power grids, satellites, and communication systems. While the skies light up in stunning displays, the unseen danger is far more chilling.", "url": "https://dailygalaxy.com/2025/01/next-solar-superstorm-might-leave-the-planet-in-darkness-experts-sound-the-alarm/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Solar-Superstorm-.jpg", "publishedAt": "2025-01-21T12:00:00Z", "content": "The increasing interconnectedness of modern technology amplifies the dangers posed by solar storms. Global economies rely on real-time communication networks, financial systems, and logistics chains … [+4488 chars]"}, {"source": {"id": null, "name": "WyoFile"}, "author": "Katie Klingsporn", "title": "Meet North America’s oldest dino: Found in Wyoming, named in Shoshone language - WyoFile", "description": "Ancient fossils found near Dubois have scientists rethinking the lifespan of reptiles — and how to include Native communities in paleontology.", "url": "http://wyofile.com/meet-north-americas-oldest-dino-found-in-wyoming-named-in-eastern-shoshone/", "urlToImage": "https://wyofile.com/wp-content/uploads/2025/01/Geology_Museum_Lovelace2024-06-03JM_2650.jpg", "publishedAt": "2025-01-21T11:25:00Z", "content": "On a tract of public land near Dubois, an extrusion of very old rock known as the lower Popo Agie Formation peeks out of a hillside. To the unskilled eye, it just looks like a patch of pinkish-red ro… [+7239 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China explores using orbiting lasers to power spacecraft on the moon - SpaceNews", "description": "China could look to laser power transmission from lunar orbit to supply spacecraft on the moon and solve one of the big challenges for its lunar exploration plans.", "url": "http://spacenews.com/china-explores-using-orbiting-lasers-to-power-to-spacecraft-on-the-moon/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyMFwvMDFcL2NoYW5nZTUtZmFyc2lkZS1pbWFnZS5qcGciLCJ0eHQiOiJDaGluYSBleHBsb3JlcyB1c2luZyBvcmJpdGluZyBsYXNlcnMgdG8gcG93ZXIgc3BhY2VjcmFmdCBvbiB0aGUgbW9vbiIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.6k1rthTz3eiHIB2IVHvO75qy_dFt3lkivvpU2zmrlX8MQ", "publishedAt": "2025-01-21T10:54:56Z", "content": "HELSINKI China could look to laser power transmission from lunar orbit to supply spacecraft on the moon and solve one of the big challenges for its lunar exploration plans.\r\nResearchers have assessed… [+3848 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rewriting Prehistory: Archaeologists Have Discovered That Our Ancient Ancestors Were Vegetarian - SciTechDaily", "description": "Nitrogen isotope analysis of tooth enamel reveals no evidence of meat consumption in Australopithecus. New research published in the journal Science suggests that early human ancestors, such as Australopithecus, which lived approximately 3.5 million years ago…", "url": "https://scitechdaily.com/rewriting-prehistory-archaeologists-have-discovered-that-our-ancient-ancestors-were-vegetarian/", "urlToImage": "https://scitechdaily.com/images/Australopithecus-Molars.jpg", "publishedAt": "2025-01-21T09:28:07Z", "content": "Hand-drawn illustration of two of the seven sampled molars from Australopithecus. Credit: Dom Jack, MPIC\r\nNitrogen isotope analysis of tooth enamel reveals no evidence of meat consumption in Australo… [+6800 chars]"}, {"source": {"id": null, "name": "Openculture.com"}, "author": "OC", "title": "Download a 417-Megapixel Panorama of the Andromeda Galaxy—A Decade-Long NASA Project in the Making - Open Culture", "description": "Using the Hubble Space Telescope, astronomers have created a majestic 417-megapixel panorama of the Andromeda galaxy, located some 2.5 million light-years away from our planet.", "url": "https://www.openculture.com/?p=1121873", "urlToImage": "https://cdn8.openculture.com/2025/01/20212059/hubble-panorama-featured-copy-1024x538.webp", "publishedAt": "2025-01-21T09:02:43Z", "content": "Using the Hub­ble Space Tele­scope, astronomers have cre­at­ed a majes­tic 417-megapix­el panora­ma of the Androm­e­da galaxy, locat­ed some 2.5 mil­lion light-years away from our plan­et. Tak­ing mo… [+1591 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "A Giant Object May Have Warped Our Solar System, Study Says - Yahoo! Voices", "description": "This could explain a lot.", "url": "https://www.sciencealert.com/a-giant-object-may-have-warped-our-solar-system-study-says", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/1865735933eaeb84d0faba6756fbe12d", "publishedAt": "2025-01-21T05:45:00Z", "content": "If you were to perfectly follow the steps in An Idiot's Guide to Making a Solar System, you should eventually find yourself with a star surrounded by a flat disc of planetary material orbiting in rel… [+3348 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "What's The Best Dinosaur Movie According To Palaeontologists? We Asked Some To Find Out - IFLScience", "description": "There can be only one... or can there?", "url": "https://www.iflscience.com/whats-the-best-dinosaur-movie-according-to-palaeontologists-we-asked-some-to-find-out-75541", "urlToImage": "https://assets.iflscience.com/assets/articleNo/75541/aImg/78190/best-dinosaur-movies-according-to-palaeontologists-meta.png", "publishedAt": "2025-01-21T03:30:17Z", "content": "At IFLScience, we love a dinosaur movie. If anything, too much (rumor has it Managing Editor Katy Evans even got excited about TheVelociPastor). Safe to say, our opinion on the best dino flick cant b… [+7074 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fast-Forwarding Evolution: AI Mimics 500 Million Years of Biology - SciTechDaily", "description": "Researchers used AI model ESM3 to simulate 500 million years of evolution and create a novel fluorescent protein, revolutionizing protein engineering. Using a multimodal generative language model called ESM3, Thomas Hayes and colleagues designed and synthesiz…", "url": "https://scitechdaily.com/fast-forwarding-evolution-ai-mimics-500-million-years-of-biology/", "urlToImage": "https://scitechdaily.com/images/Future-Human-Evolution.jpg", "publishedAt": "2025-01-21T01:58:23Z", "content": "ESM3, a generative language model, enabled the creation of a novel fluorescent protein and offers tools for protein engineering, integrating sequence, structure, and function for innovative scientifi… [+2184 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Supermassive Black Hole Caught Doing Something Never Seen Before - Yahoo! Voices", "description": "What's it up to?", "url": "https://www.sciencealert.com/supermassive-black-hole-caught-doing-something-never-seen-before", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/2e8d8d363b34c6399467e5f3630ba0a9", "publishedAt": "2025-01-21T00:48:00Z", "content": "As far as supermassive black holes go, the one at the center of the Milky Way is relatively sedate.\r\nBut, even in its supposed quiescent state, Sagittarius A* is prone to the occasional belch or rupt… [+4716 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Habitable Worlds Could Have Formed Before the First Galaxies - Universe Today", "description": "New research based solely on simulations shows how habitable worlds could have formed before any galaxies formed.", "url": "https://www.universetoday.com/170521/habitable-worlds-could-have-formed-before-the-first-galaxies/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/06/heic1916a.jpg", "publishedAt": "2025-01-21T00:21:33Z", "content": "What came first, galaxies or planets? The answer has always been galaxies, but new research is changing that idea. \r\nCould habitable planets really have formed before there were galaxies?\r\nIn the imm… [+5730 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beat the Heat: UCLA’s New Cooling Device Drops Temperatures by 16 Degrees Continuously - SciTechDaily", "description": "A device made of polymer thin films shows promise for use in wearable and portable applications. UCLA materials scientists have created a compact cooling device that continuously removes heat using layers of flexible thin films. This design leverages the elec…", "url": "https://scitechdaily.com/beat-the-heat-uclas-new-cooling-device-drops-temperatures-by-16-degrees-continuously/", "urlToImage": "https://scitechdaily.com/images/Thin-Film-Cooling-Device.jpg", "publishedAt": "2025-01-21T00:16:46Z", "content": "A new UCLA-developed cooling device made of six thin layers of nanotube-coated polymer films about one-quarter of an-inch thick. Credit: UCLA Soft Materials Research Laboratory\r\nA device made of poly… [+5345 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rings of Creation: Webb Maps the Milky Way’s Hidden Carbon Factories - SciTechDaily", "description": "Using the James Webb Space Telescope, astronomers have captured the dynamic process of carbon-rich dust formation around Wolf-Rayet 140, a binary star system in our galaxy. How is carbon, a key building block of life, produced and distributed across space? Us…", "url": "https://scitechdaily.com/rings-of-creation-webb-maps-the-milky-ways-hidden-carbon-factories/", "urlToImage": "https://scitechdaily.com/images/Wolf-Rayet-140-Webb.jpg", "publishedAt": "2025-01-20T23:07:22Z", "content": "The Webb Telescope provides a detailed view of carbon dust production in the binary star system, Wolf-Rayet 140, showing its rapid expansion and potential longevity, which could influence theories on… [+8770 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Hidden water reservoir discovered beneath the Cascade mountains - Earth.com", "description": "Oregon’s Cascade Range is not just a scenic landscape of volcanic peaks - it also hides a massive underground aquifer filled with water.", "url": "https://www.earth.com/news/hidden-water-reservoir-discovered-beneath-the-cascade-mountains/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/20142910/Oregon-Cascades.jpg", "publishedAt": "2025-01-20T21:46:26Z", "content": "Oregons Cascade Range is not just a scenic landscape of volcanic peaks – it also hides a massive underground aquifer filled with water. \r\nScientists from the University of Oregon and their collaborat… [+5091 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cat Williams", "title": "Darwin and Bateman thought female animals weren't promiscuous—they were wrong - Phys.org", "description": "For far too long, women have been seen as secondary to men under the patriarchal rule of human society.", "url": "https://phys.org/news/2025-01-darwin-bateman-thought-female-animals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-biological-truth-a.jpg", "publishedAt": "2025-01-20T20:32:04Z", "content": "For far too long, women have been seen as secondary to men under the patriarchal rule of human society.\r\nYet, humanity's existence has been a minor blip in the history of the Earth, where females are… [+7093 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble Telescope spies newborn stars in famous Orion Nebula (photo) - Space.com", "description": "\"The protostars are midway down the path to becoming mature stars.\"", "url": "https://www.space.com/space-exploration/hubble-space-telescope/hubble-telescope-spies-newborn-stars-in-famous-orion-nebula-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nWEwHvJraGaU6ivZyJtjYb-1200-80.jpg", "publishedAt": "2025-01-20T20:00:00Z", "content": "Two young stars shine bright in the dusty depths of the Orion Nebula in a new Hubble Space Telescope image.\r\nLocated about 1,300 light-years from Earth\r\n, these young stars, also known as protostars,… [+3008 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Find Hundreds of 'Hidden' Black Holes — And There May Be Billions or Even Trillions More - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have made a groundbreaking discovery: hundreds of elusive supermassive black holes hidden behind dense clouds of gas and dust. These cosmic giants, invisible to traditional telescopes, are rewriting what we know about the universe’s most mysteriou…", "url": "https://dailygalaxy.com/2025/01/astronomers-find-hundreds-hidden-black-holes/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Observations-by-NASA-telescopes-have-helped-scientists-identify-more-of-these-hidden-black-holes.-Credit-NASAJPL-Caltech.jpg", "publishedAt": "2025-01-20T19:30:00Z", "content": "Astronomers have recently uncovered hundreds of previously unknown supermassive black holes hidden in the depths of the universe. These black holes, which are buried behind dense clouds of gas and du… [+4890 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Confirms Ancient Biblical Battles Using Groundbreaking Magnetic Dating Technique - The Daily Galaxy --Great Discoveries Channel", "description": "n a revolutionary new study, scientists have employed an innovative approach to validate key moments from the Bible.", "url": "https://dailygalaxy.com/2025/01/scientists-confirms-ancient-biblical-battles-using-groundbreaking-magnetic-dating-technique/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Scientists-Confirms-Ancient-Biblical-Battles-.jpg", "publishedAt": "2025-01-20T18:00:00Z", "content": "In a revolutionary new study, scientists have employed an innovative approach to validate key moments from the Bible. By using archaeomagnetic dating, a method that examines the Earth’s ancient magne… [+4614 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Study warns of a \"ticking time bomb\" under West Antarctic Ice Sheet as ice reveals 100+ volcanoes - The Jerusalem Post", "description": "Researchers found 100+ volcanoes beneath Antarctic ice along the active West Antarctic Rift System, dating back to the dinosaur age.", "url": "https://www.jpost.com/science/science-around-the-world/article-838323", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/644903", "publishedAt": "2025-01-20T18:00:00Z", "content": "A new study published in the journal Geochemistry, Geophysics, Geosystems revealed a potential \"ticking time bomb\" beneath the West Antarctic Ice Sheet, raising alarms about the future of global sea … [+3943 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "'Our model of cosmology might be broken': New study reveals the universe is expanding too fast for physics to explain - Livescience.com", "description": "Astronomers have been confounded by recent evidence that the universe expanded at different rates throughout its life. New findings risk turning the tension into a crisis, scientists say.", "url": "https://www.livescience.com/space/cosmology/our-model-of-cosmology-might-be-broken-new-study-reveals-the-universe-is-expanding-too-fast-for-physics-to-explain", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7CmgeB5SBiGrPbY4HThtiT-1200-80.jpg", "publishedAt": "2025-01-20T17:27:16Z", "content": "The Hubble tension just got tenser — with new measurements revealing that the universe is expanding faster than our current understanding of physics can explain.\r\nOver the past decade, cosmology has … [+4794 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sandee Oster", "title": "Small carnivores may have constituted important part of hunter–gatherer nutrition in the Levant - Phys.org", "description": "A recent study published by Dr. Shirad Galmor and colleagues in Environmental Archaeology examined the role played by foxes and wildcats at the Early Pre-Pottery Neolithic B (EPPNB) site of Aḥihud (Israel). The site was occupied between ca. 10,500 and 10,100 …", "url": "https://phys.org/news/2025-01-small-carnivores-constituted-important-huntergatherer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/small-carnivores-may-h-1.jpg", "publishedAt": "2025-01-20T17:10:08Z", "content": "A recent study published by Dr. Shirad Galmor and colleagues in Environmental Archaeology examined the role played by foxes and wildcats at the Early Pre-Pottery Neolithic B (EPPNB) site of Aihud (Is… [+3051 chars]"}, {"source": {"id": null, "name": "Channel3000.com - WISC-TV3"}, "author": "Anna Kottakis", "title": "Coming soon to the sky near you - Channel3000.com - WISC-TV3", "description": "2025 will bring Wisconsinites a full lunar eclipse, a summer meteor shower and — just maybe — the return of “the Blaze Star.\"", "url": "https://www.channel3000.com/madison-magazine/coming-soon-to-the-sky-near-you/article_db1377dc-d50a-11ef-9822-27e18593131b.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/channel3000.com/content/tncms/assets/v3/editorial/d/c5/dc5dafac-d746-11ef-91e3-f35aca5170f6/678e7244840f7.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2025-01-20T17:00:00Z", "content": "We spent a lot of time last year looking up.\r\nThere were some big-time shows in the sky in 2024, including the total solar eclipse in April and the northern lights displays in August. We set alarms, … [+4330 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Scientists call on UN to help solve Earth's space junk problem - Space.com", "description": "\"In 2024, we saw a 17% year-over-year spike in the average number of close approaches in low Earth orbit per satellite.\"", "url": "https://www.space.com/space-exploration/satellites/scientists-call-on-un-to-help-solve-earths-space-junk-problem", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nERicCjATHeLNtog2QERoR-1200-80.jpg", "publishedAt": "2025-01-20T16:00:00Z", "content": "An international group of researchers is calling on the United Nations to include the protection of Earth's orbit in the U.N.'s sustainable development goals.\r\nThe researchers — led by experts from N… [+5380 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Life is thriving in the subsurface depths of Earth - Ars Technica", "description": "Different species thrive beneath the oceans than under the land.", "url": "https://arstechnica.com/science/2025/01/life-is-thriving-in-the-subsurface-depths-of-earth/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/GettyImages-1152425530-1152x648.jpg", "publishedAt": "2025-01-20T15:31:30Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover Zealandia: The Hidden Continent Missing for 375 Years - The Daily Galaxy --Great Discoveries Channel", "description": "For nearly 400 years, scientists speculated about the existence of Zealandia, a massive landmass that mysteriously disappeared beneath the ocean. Now officially recognized as Earth’s eighth continent, this submerged world is rewriting what we know about our p…", "url": "https://dailygalaxy.com/2025/01/zealandia-continent-missing-375-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Scientists-Uncover-Zealandia-The-Hidden-Continent-Missing-for-375-Years.jpg", "publishedAt": "2025-01-20T15:30:00Z", "content": "After centuries of speculation, scientists have officially confirmed the existence of Zealandia, an enormous submerged continent that was lost to history for nearly 400 years. Spanning an incredible … [+6841 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nathaniel Scharping", "title": "Deep beneath California's Sierra Nevada, Earth's lithosphere may be peeling away - Phys.org", "description": "The processes that form continental crust from the denser basaltic rocks of the upper mantle may make the lower lithosphere denser than the underlying mantle. One theory holds that the lower lithosphere splits away and sinks into the mantle in a process calle…", "url": "https://phys.org/news/2025-01-deep-beneath-california-sierra-nevada.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/deep-beneath-californi.jpg", "publishedAt": "2025-01-20T15:15:03Z", "content": "The processes that form continental crust from the denser basaltic rocks of the upper mantle may make the lower lithosphere denser than the underlying mantle. One theory holds that the lower lithosph… [+2943 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "'Heavy' dark matter would rip our understanding of the universe apart, new research suggests - Space.com", "description": "Because we haven't found anything yet, we've started to wonder if dark matter might be lighter or heavier than we thought.", "url": "https://www.space.com/the-universe/heavy-dark-matter-would-rip-our-understanding-of-the-universe-apart-new-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bysecChz65uuivv5vdmnHT-1200-80.jpg", "publishedAt": "2025-01-20T15:00:00Z", "content": "Dark matter can't be too heavy or it might break our best model of the universe, new research suggests.\r\nWe have an abundance of evidence that something fishy is happening in the universe. Stars orbi… [+4441 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Giant Glacial Features Unearthed Under the North Sea Rewrite Ice Age History - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath the North Sea lies a hidden world shaped by a massive Ice Age glacier that once dominated the landscape. Recently uncovered by scientists, these ancient landforms are offering clues to a mysterious climatic shift that reshaped Earth over a millio…", "url": "https://dailygalaxy.com/2025/01/giant-glacial-features-under-north-sea/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Giant-Glacial-Features-Unearthed-Under-the-North-Sea-Rewrite-Ice-Age-History.jpg", "publishedAt": "2025-01-20T14:30:00Z", "content": "Beneath the muddy depths of the North Sea, scientists have uncovered an ancient, frozen world shaped by a massive Ice Age glacier that swept across the region around 1 million years ago. Using advanc… [+5931 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Newly discovered group hosts two optically dark star-forming galaxies - Phys.org", "description": "An international team of astronomers reports the discovery of a new compact galaxy group using the Atacama Large Millimeter/submillimeter Array (ALMA). The new group, designated CGG-z4, hosts two optically dark star-forming galaxies. The finding was detailed …", "url": "https://phys.org/news/2025-01-newly-group-hosts-optically-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-galaxy-group-detec.jpg", "publishedAt": "2025-01-20T14:23:11Z", "content": "An international team of astronomers reports the discovery of a new compact galaxy group using the Atacama Large Millimeter/submillimeter Array (ALMA). The new group, designated CGG-z4, hosts two opt… [+3167 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "China generates oxygen and rocket fuel in-orbit for first time - Interesting Engineering", "description": "China's achievement is valuable for long-term space exploration, enabling self-sufficiency and enabling missions like a crewed moon landing.", "url": "https://interestingengineering.com/space/china-makes-resources-in-orbit-for-space-travel", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/01/hPpt8VbddUqMedDyJvlX5smCdHbgajADzGS4yZEv.jpeg", "publishedAt": "2025-01-20T14:18:00Z", "content": "This technology mimics the natural photosynthesis process of green plants through engineered physical and chemical methods, utilising carbon dioxide resources in confined spaces or extraterrestrial a… [+815 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "3D structure of iconic Ring Nebula gives 'a brand new view of an old astronomical friend' - Space.com", "description": "We are staring \"right down the barrel of it, which is really quite surprising to me — we're just lucky.\"", "url": "https://www.space.com/the-universe/stars/3d-structure-of-iconic-ring-nebula-gives-a-brand-new-view-of-an-old-astronomical-friend", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mCTVqifyowZGmeXSNmjYyF-1200-80.jpg", "publishedAt": "2025-01-20T14:00:00Z", "content": "One of the most photographed objects in the night sky is the Ring Nebula, wreckage of a bygone sun-like star about 2,000 light-years from Earth. Its striking, smoke-ring-like appearance has both awed… [+4098 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jesse Rhoades, Rebecca Rhoades", "title": "Astronauts on NASA’s Artemis mission to the Moon will need better boots − here’s why - The Conversation Indonesia", "description": "Wearing the wrong shoe on Earth can lead to injury. Researchers still need to figure out the physical consequences of spending a long time walking around on the Moon.", "url": "https://theconversation.com/astronauts-on-nasas-artemis-mission-to-the-moon-will-need-better-boots-heres-why-240981", "urlToImage": "https://images.theconversation.com/files/638969/original/file-20241216-19-m3jzxn.jpg?ixlib=rb-4.1.0&rect=563%2C14%2C1714%2C854&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-01-20T13:35:40Z", "content": "The U.S.s return to the Moon with NASAs Artemis program will not be a mere stroll in the park. Instead it will be a perilous journey to a lunar location representing one of the most extreme environme… [+4030 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Daniel Freedman", "title": "Why is the sky blue? - The Conversation", "description": "The answer has to do with molecules.", "url": "https://theconversation.com/why-is-the-sky-blue-246393", "urlToImage": "https://images.theconversation.com/files/640998/original/file-20250107-19-2ty44y.jpg?ixlib=rb-4.1.0&rect=386%2C98%2C5604%2C2802&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-01-20T13:34:54Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to CuriousKidsUS@theconversation.com.\r\nWhy is the sky blue? Mariana A-E., age 11, Tucs… [+4198 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dolphins and orcas have passed the point of no return in evolution to live on land again - The Daily Galaxy --Great Discoveries Channel", "description": "Marine mammals like dolphins and orcas have hit an evolutionary \"point of no return.\" What does this mean for their survival amid climate change? Discover the surprising truths behind their adaptations and our oceans' future.", "url": "https://dailygalaxy.com/2025/01/dolphins-and-orcas-have-passed-the-point-of-no-return-in-evolution-to-live-on-land-again/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/marine20mammals-evolutionary20adaptations-bruna20farina.jpeg", "publishedAt": "2025-01-20T13:00:00Z", "content": "A recent study from July 2023 in the journal Proceedings of the Royal Society B sheds light on how marine mammals, like dolphins and orcas, have hit an evolutionary “point of no return.” These creatu… [+3613 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Astronomers have just confirmed the existence of an interstellar tunnel between our solar system and distant constellations - Indian Defence Review", "description": "Astronomers have uncovered a network of cosmic tunnels connecting our solar system to distant galaxies, reshaping our understanding of the universe. Discover what these stellar remnants reveal about the origins of life and the interconnectedness of space.", "url": "https://indiandefencereview.com/astronomers-have-just-confirmed-the-existence-of-an-interstellar-tunnel-between-our-solar-system-and-distant-constellations/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/cosmic20tunnels-erosita20observatory-supernova20impact.jpeg", "publishedAt": "2025-01-20T13:00:00Z", "content": "Astronomers have made an exciting discoverya network of cosmic “tunnels” that intricately link our solar system to far-off galaxies. This find, built on years of meticulous research, flips the script… [+4291 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Researchers uncover prehistoric landscape buried beneath Antarctica - The Brighter Side of News", "description": "Antarctica’s ancient river networks buried beneath ice, reveal insights into prehistoric climates and future climate change impacts.", "url": "https://www.thebrighterside.news/global-good/researchers-uncover-prehistoric-landscape-buried-beneath-antarctica", "urlToImage": "https://www.thebrighterside.news/uploads/2024/08/antarctica-1-e1737309740656.webp?auto=webp", "publishedAt": "2025-01-20T12:51:00Z", "content": "The East Antarctic Ice Sheet, a vast expanse spanning over 10 million square kilometers, has long concealed a landscape millions of years old. \r\nThanks to satellite technology and groundbreaking geop… [+6782 chars]"}, {"source": {"id": null, "name": "Oceanographic Magazine"}, "author": "Rob Hutchins", "title": "Deep sea's 'Dark Oxygen' is \"most profound discovery of our time\" - Oceanographic Magazine", "description": "Scientists and leaders from IOC UNESCO have hailed the launch of new and extended research into Dark Oxygen as \"most important of our time\".", "url": "https://oceanographicmagazine.com/news/deep-seas-dark-oxygen-is-most-profound-discovery-of-our-time/", "urlToImage": "https://cdn.oceanographicmagazine.com/wp-content/uploads/2025/01/20143932/Geiger-Laboratories-Northwestern-University-scaled.jpg", "publishedAt": "2025-01-20T12:30:08Z", "content": "The discovery of Dark Oxygen was made in a region of the deep-sea known as the Clarion-Clipperton Zone, a huge flat area of the seafloor that stretches between Hawaii and Mexico. Its an area where mi… [+3632 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "'Ghost' Island Emerges From Ocean – And It's About to Vanish Again - ScienceAlert", "description": "A 'ghost' island that suddenly appeared in the Caspian Sea in early 2023 is playing a centuries-long game of peekaboo with scientists, and it's about to vanish once again – if it hasn't already slipped beneath the waves.", "url": "https://www.sciencealert.com/ghost-island-emerges-from-ocean-and-its-about-to-vanish-again", "urlToImage": "https://www.sciencealert.com/images/2025/01/GhostIslandSea.jpg", "publishedAt": "2025-01-20T11:00:37Z", "content": "A 'ghost' island that suddenly appeared in the Caspian Sea in early 2023 is playing a centuries-long game of peekaboo with scientists, and it's about to vanish once again if it hasn't already slipped… [+2565 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bruce Dorminey", "title": "Astrophysically-Elusive Phosphorus Is Key To All Life On Earth - Forbes", "description": "Crucial to all life on Earth, the 15th element of phosphorus remains a real puzzle for astronomers.  Specialized space telescopes are needed to shed light on the issue.", "url": "https://www.forbes.com/sites/brucedorminey/2025/01/20/astrophysically-elusive-phosphorus-is-key-to-all-life-on-earth/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/678e1746f40aec8d56cd1d84/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-20T09:32:44Z", "content": "Illustration of a supernova explosion, created on July 19, 2015. (Illustration by Tobias ... [+] Roetsch/Future Publishing via Getty Images)\r\nFuture Publishing via Getty Images\r\nPhosphorus, the vastl… [+4645 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "See The ‘Planet Parade’ As Moon And Mars Skim Bright Stars: The Night Sky This Week - Forbes", "description": "Each Monday, I pick out North America’s celestial highlights for the week ahead (which also apply to mid-northern latitudes in the northern hemisphere).", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/01/20/see-the-moon-and-mars-skim-bright-stars-the-night-sky-this-week/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/670ff032a998d4f491f2586a/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-20T07:00:00Z", "content": "This week sees a number of close conjunctions between the Moon, stars, and Mars.\r\ngetty\r\nEach Monday, I pick out North Americas celestial highlights for the week ahead (which also apply to mid-northe… [+2787 chars]"}, {"source": {"id": null, "name": "KVUE.com"}, "author": "Johann Castro", "title": "Lunar lander designed by Cedar Park-based company completes successful first burn - KVUE.com", "description": "\"Blue Ghost,\" designed by Cedar Park-based Firefly, is moving closer to the next step of its mission.", "url": "https://www.kvue.com/article/tech/science/aerospace/cedar-park-texas-firefly-aerospace-blue-ghost-lunar-lander-mission-first-burn/269-bd429e2f-9741-4dde-9a64-d887a89b6307", "urlToImage": "https://media.kvue.com/assets/KVUE/images/fd276c13-4ff6-488d-a950-079894662c37/20250106T234532/fd276c13-4ff6-488d-a950-079894662c37_1140x641.jpg", "publishedAt": "2025-01-20T04:47:22Z", "content": "AUSTIN, Texas A lunar lander that was designed in Central Texas has completed the first step of its mission to the moon.\r\nCedar Park-based Firefly Aerospace says that \"Blue Ghost\" has successfully co… [+960 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Eerie Light Seen in The Sky May Be a New Phenomenon, Scientists Say - ScienceAlert", "description": "A ground-based observing facility tasked with recording the flare of the northern lights has captured images of an inexplicable pale grey glow amid the streaks of green and red, providing researchers with new details into the mystery.", "url": "https://www.sciencealert.com/eerie-light-seen-in-the-sky-may-be-a-new-phenomenon-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2025/01/white_path_in_aurora_header.jpg", "publishedAt": "2025-01-20T01:45:16Z", "content": "A ground-based observing facility tasked with recording the flare of the northern lights has captured images of an inexplicable pale grey glow amid the streaks of green and red, providing researchers… [+4474 chars]"}, {"source": {"id": null, "name": "Science News"}, "author": null, "title": "Hula-hooping robots reveal the physics behind keeping rings aloft - Science News Magazine", "description": "The gyrations of hoop-slinging robots reveal that hourglass-shaped objects are best at keeping a hoop in the air.", "url": "https://www.sciencenews.org/article/hula-hooping-robots-physics", "urlToImage": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/01/010225_ec_hula-hoop_feat.jpg", "publishedAt": "2025-01-17T14:00:00Z", "content": "To keep a Hula-Hoop aloft, it helps to be in shape literally.\r\nExperiments with gyrating, hoop-slinging robots have revealed how these spinning rings stay up despite the pull of gravity. The shape of… [+2014 chars]"}]}