{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "A Supercomputer Predicts When Humanity Will Go Extinct—Scientists Have Already Pinpointed the Date - Indian Defence Review", "description": "A supercomputer simulation has mapped out Earth's distant future, revealing a world where survival may no longer be possible. Rising temperatures, volcanic chaos, and an unrecognizable climate could push mammals—including humans—to the edge. Scientists have t…", "url": "https://indiandefencereview.com/supercomputer-predicts-the-year-humanity-will-go-extinct-the-timeline-is-set/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/A-dystopian-Earth-in-the-far-future-the-land-is-cracked-and-dry-with-scorching-heat-waves-rising-from-the-ground.jpg", "publishedAt": "2025-02-17T13:00:00Z", "content": "A new supercomputer simulation has given scientists a glimpse into Earths distant futurea world where a superheated supercontinent could drive mammals, including humans, to extinction.\r\nThe research,… [+5613 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover ‘Hidden Pipe System’ Beneath Antarctic Glaciers, Speeding Up Ice Loss - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath Antarctica’s frozen surface, scientists have uncovered a vast hidden water network that could be influencing glacier movement. This unsuspected system appears to be accelerating ice flow toward the ocean in ways never fully understood. The discov…", "url": "https://dailygalaxy.com/2025/02/scientists-uncover-hidden-pipe-system-beneath-antarctic-glaciers-speeding-up-ice-loss/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Hidden-Pipe-System-Beneath-Antarctic.jpg", "publishedAt": "2025-02-17T12:30:00Z", "content": "A newly discovered subglacial water network is playing a significant role in how Antarcticas ice sheets move toward the ocean. Using advanced computer models, researchers have mapped the hidden plumb… [+3601 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Nicioli", "title": "Paleontologists uncover a nearly complete skull of a 30 million-year-old apex carnivore in Egypt - CNN", "description": "A nearly complete skull fossil found in Egypt has revealed a new species of Hyaenodonta, an apex carnivore that mysteriously went extinct about 25 million years ago.", "url": "https://www.cnn.com/2025/02/17/science/hyaenodonta-fossil-discovery-bastetodon-skull/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/shorouq-al-ashqar-the-lead-author-with-the-bastetodon-syrtos-skull-and-a-bastet-statue-crop.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-17T11:41:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith sharp catlike teeth and a doglike body, ancient c… [+5733 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Thomas Moynihan", "title": "How humanity moved from ‘eternal’ to ‘bookended’ time - Aeon", "description": "Nothing lasts forever: not humanity, not Earth, not the Universe. But finitude confers an indelible meaning to our lives", "url": "https://aeon.co/essays/how-humanity-moved-from-eternal-to-bookended-time", "urlToImage": "https://images.aeonmedia.co/images/2ea19bc2-c917-46ce-9aa4-6ef8d20fceed/essay-v2-1975_142_full.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-02-17T11:04:25Z", "content": "Do you recall the first time you knew you would die? Its a milestone, realising your time is limited. That things happened before you, and will happen afterward, in your absence.\r\nAs we grow up, the … [+29692 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Astronomers realize mysterious TV signal in their data bounced off an airplane - Space.com", "description": "Rogue TV signals have plagued the Murchison Wide-field Array for five years.", "url": "https://www.space.com/space-exploration/tech/astronomers-realize-mysterious-tv-signal-in-their-data-bounced-off-an-airplane", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R4Lb6pQX99swoLwVGeWFUD-1200-80.jpg", "publishedAt": "2025-02-17T10:00:00Z", "content": "The sky is awash with radio-frequency interference (RFI), but thanks to two astronomers who tracked down a stray TV broadcast reflected off a passing airplane, there may be a new way to wipe out some… [+4738 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A 69-Million-Year Evolutionary Mystery: Scientists Discover Oldest Modern Bird - SciTechDaily", "description": "New clues explore the age-old question: Does a duck always look like a duck and quack like a duck? Sixty-six million years ago, at the end of the Cretaceous Period, an asteroid impact near the Yucatán Peninsula in Mexico triggered the extinction of all known …", "url": "https://scitechdaily.com/a-69-million-year-evolutionary-mystery-scientists-discover-oldest-modern-bird/", "urlToImage": "https://scitechdaily.com/images/Vegavis-iaai-Illustration-scaled.jpg", "publishedAt": "2025-02-17T09:21:34Z", "content": "The Late Cretaceous modern (crown) bird, Vegavis iaai, pursuit diving for fish in the shallow ocean off the coast of the Antarctic peninsula, with ammonites and plesiosaurs for company. Credit: Mark … [+7920 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Elena Gorgan", "title": "This Single-Axle Compact Trailer Expands Into a Full Home at Camp - autoevolution", "description": "The 2025 Flagstaff E-Pro E15FSB is the smallest travel trailer with a slide-out, which allows it to cater to all the needs and deliver superior comfort", "url": "https://www.autoevolution.com/news/this-single-axle-compact-trailer-expands-into-a-full-home-at-camp-247133.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/this-single-axle-compact-trailer-expands-into-a-full-home-at-camp-247133_1.jpg", "publishedAt": "2025-02-17T06:41:40Z", "content": "\"Your ideal floorplan, perfectly sized.\" When a travel trailer builder makes this kind of promise, two things are certain: number one, we're all paying attention, and number two, they'd best deliver … [+4748 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Using Antimony To Make Qubits More Stable - Hackaday", "description": "One of the problems with quantum bits, or “qubits”, is that they tend to be rather fragile, with a high sensitivity to external influences. Much of this is due to the atoms used for qub…", "url": "https://hackaday.com/2025/02/16/using-antimony-to-make-qubits-more-stable/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/03/Quantum-Summit_Hero-and-Carousel-Template_1920x720.jpg", "publishedAt": "2025-02-17T03:00:00Z", "content": "One of the problems with quantum bits, or “qubits”, is that they tend to be rather fragile, with a high sensitivity to external influences. Much of this is due to the atoms used for qubits having two… [+1384 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESA astronaut with physical disability medically cleared for ISS missions - SpaceNews", "description": "In a first, a European astronaut with a physical disability has been medically cleared for missions to the International Space Station.", "url": "http://spacenews.com/esa-astronaut-with-physical-disability-medically-cleared-for-iss-missions/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcL0V4cGxvcmluZ19ncmF2aXR5X3NfZWZmZWN0c19wYXJhYm9saWNfZmxpZ2h0cy0xMDI0eDY4My5qcGciLCJ0eHQiOiJFU0EgYXN0cm9uYXV0IHdpdGggcGh5c2ljYWwgZGlzYWJpbGl0eSBtZWRpY2FsbHkgY2xlYXJlZCBmb3IgSVNTIG1pc3Npb25zIiwidGVtcGxhdGUiOiJmdWxsc2NyZWVuIiwiYmxvZ19pZCI6ODA2ODE5Nzl9.A0hVtamH-AVDunDIgOzG7oLUZrw1fTWkkhO6295YfQgMQ", "publishedAt": "2025-02-16T22:50:36Z", "content": "WASHINGTON In a first, a European astronaut with a physical disability has been medically cleared for missions to the International Space Station.\r\nThe European Space Agency announced Feb. 14 that Jo… [+4492 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Martijn Luinstra", "title": "Euclid reveals an Einstein ring around a nearby galaxy - NASASpaceflight.com", "description": "Using the European Space Agency’s Euclid space telescope, astronomers have accidentally found a complete Einstein…", "url": "https://www.nasaspaceflight.com/2025/02/ngc-6505-einstein-ring/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2025/02/NGC6505_einstein_ring_lead-525x350.jpg", "publishedAt": "2025-02-16T21:29:37Z", "content": "21Using the European Space Agencys Euclid space telescope, astronomers have accidentally found a complete Einstein ring around a nearby galaxy known as NGC 6505. This optical effect shows a distorted… [+5690 chars]"}, {"source": {"id": null, "name": "Defector.com"}, "author": null, "title": "Hell Yeah: This Maggot Has A Face On Its Butt - Defector", "description": "The Mission Impossible franchise is famous for its mask reveals. A dubiously explained technology allows an innocuous silver briefcase to print out a gummy-like mask that, once plastered to a face, transforms Tom Cruise into the spitting image of Philip Seymo…", "url": "https://defector.com/hell-yeah-this-maggot-has-a-face-on-its-butt", "urlToImage": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/fly-with-fake-termite.jpg", "publishedAt": "2025-02-16T18:49:00Z", "content": "The Mission Impossible franchise is famous for its mask reveals. A dubiously explained technology allows an innocuous silver briefcase to print out a gummy-like mask that, once plastered to a face, t… [+3872 chars]"}, {"source": {"id": null, "name": "Defector.com"}, "author": null, "title": "Are You Entranced By The Turtle Dance? - Defector", "description": "Across much of the animal kingdom, the meanings behind some creatures’ gestures are reserved only for other members of their species. A person watching a honeybee’s waggle dance would not understand the information about a pollen-rich flower patch or nearby w…", "url": "https://defector.com/are-you-entranced-by-the-turtle-dance", "urlToImage": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Baby_loggerhead_turtle_detailed_close_up.jpg", "publishedAt": "2025-02-16T17:35:00Z", "content": "Across much of the animal kingdom, the meanings behind some creatures' gestures are reserved only for other members of their species. A person watching a honeybee's waggle dance would not understand … [+6487 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Bojan Stojkovski", "title": "Ultra-hard ‘super diamond’ developed in China, 40% stronger than natural diamonds - Interesting Engineering", "description": "Chinese researchers have synthesized an ultra-hard diamond, first discovered in meteorites, to be used in advanced industrial applications.", "url": "https://interestingengineering.com/science/ultra-hard-super-diamond-china-breakthrough", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/image-1920x1080-97.png", "publishedAt": "2025-02-16T16:39:00Z", "content": "The study states that the synthetic diamond is of high quality and possesses excellent physical properties. It is 40% harder than natural diamonds and has greater thermal stability than nanodiamonds,… [+919 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Unfortunate Exoplanet Being Dragged by Star at Unfathomable Speed - Futurism", "description": "A tiny star is making big moves — whether its accomplice likes it or not. Astronomers have spotted a star just a fraction the mass of the Sun crashing through the Milky Way at ridiculous speeds. And astonishingly, it's managed to drag its exoplanet along, as …", "url": "https://futurism.com/exoplanet-record-speed", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/exoplanet-record-speed.jpg", "publishedAt": "2025-02-16T16:15:32Z", "content": "A tiny star is making big moves whether its accomplice likes it or not.\r\nAstronomers have spotted a star just a fraction the mass of the Sun crashing through the Milky Way at an unbelievable pace. An… [+3188 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Alison Durkee", "title": "Northern Lights Forecast: 7 States Could See Aurora Borealis Tonight - Forbes", "description": "The northern lights could be visible in northern states along the U.S.-Canada border Sunday.", "url": "https://www.forbes.com/sites/alisondurkee/2025/02/16/northern-lights-forecast-7-states-could-see-aurora-borealis-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67b20bbc12200faea129ad87/0x0.jpg?format=jpg&crop=1497,843,x0,y49,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-16T16:09:14Z", "content": "Americans in the northernmost parts of the continental U.S. could see the northern lights on Sunday, as the National Oceanic and Atmospheric Administration predicts the aurora borealis will be more v… [+2671 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Human spaceflight quiz: How well do you know our journey into space? - Livescience.com", "description": "Test your knowledge of humanity's major space-faring milestones and the incredible astronauts who accomplished them.", "url": "https://www.livescience.com/space/space-exploration/human-spaceflight-quiz-how-well-do-you-know-our-journey-into-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/47hFJxyR8zonMYr29vJawS-1200-80.jpg", "publishedAt": "2025-02-16T16:00:00Z", "content": "For more than 60 years, humanity has been pushing the limits of ingenuity, engineering and imagination by launching people into space — and keeping them safe in the \"final frontier\" for prolonged per… [+1073 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Crack 30-Year Cancer Mystery: New Discovery Could Revolutionize Radiotherapy - SciTechDaily", "description": "CMRI researchers discovered that DNA repair pathways control how cancer cells die after radiotherapy. Blocking a key repair process, homologous recombination, forces cancer cells to die in a way that activates the immune system. Scientists at the Children’s M…", "url": "https://scitechdaily.com/scientists-crack-30-year-cancer-mystery-new-discovery-could-revolutionize-radiotherapy/", "urlToImage": "https://scitechdaily.com/images/Cancer-Cells-Artists-Illustration.jpg", "publishedAt": "2025-02-16T15:10:18Z", "content": "Researchers found that blocking certain DNA repair processes in cancer cells can make radiotherapy more effective by alerting the immune system to attack tumors.\r\nCMRI researchers discovered that DNA… [+5527 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Scientists Pinpoint ‘Tipping Point’ for Greenland’s Melting Ice Sheet - Gizmodo", "description": "The vast landmass is melting quickly due to climate change, and may rapidly cause the complete loss of the island's ice.", "url": "https://gizmodo.com/scientists-pinpoint-tipping-point-for-greenlands-melting-ice-sheet-2000562326", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/greenland-landslide-seiche-tremor-2.jpg", "publishedAt": "2025-02-16T15:00:02Z", "content": "Much of icy Greenland may soon go the way of the dodo, according to a group of researchers’ latest climatological analysis.\r\nSoon is a relative term, but the team posits that just a few degrees of te… [+3209 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Pandora Dewan", "title": "'City-killer' asteroid 2024 YR4 could hit the moon instead of us, scientists say - Yahoo", "description": "Asteroid 2024 YR4 has a 2.3% chance of hitting Earth in the year 2032. But according to new estimates, it may have an even smaller chance of hitting the moon instead.", "url": "https://www.livescience.com/space/city-killer-asteroid-2024-yr4-could-hit-the-moon-instead-of-us-scientists-say", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7hTbuwgRV3tkXykUJ56kRk-1200-80.jpg", "publishedAt": "2025-02-16T15:00:00Z", "content": "An asteroid\r\n that's big enough to wipe out a city has a 1-in-43 chance of hitting our planet in the year 2032. But according to new calculations, there's an even smaller chance that it might crash i… [+3509 chars]"}, {"source": {"id": null, "name": "Awaytogarden.com"}, "author": "margaret", "title": "a closer look at ironweeds, or vernonia, with mt. cuba’s sam hoadley - A Way to Garden", "description": "ONE OF THE TALLEST perennials in my garden is New York ironweed, Vernonia noveboracensis. But basically my knowledge of the genus starts and ends there—or at least it did until just recently when Mt. Cuba", "url": "https://awaytogarden.com/a-closer-look-at-ironweeds-or-vernonia-with-sam-hoadley/", "urlToImage": "https://awaytogarden.com/wp-content/uploads/2025/02/Fritillary-on-Vernonia-0A6A7837-1920x1012-1.jpg", "publishedAt": "2025-02-16T14:15:04Z", "content": "ONE OF THE TALLEST perennials in my garden is New York ironweed, Vernonia noveboracensis. But basically my knowledge of the genus starts and ends thereor at least it did until just recently when Mt. … [+25544 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "Is the Habitable Worlds Observatory a Good Idea? - Universe Today", "description": "The Habitable Worlds Observatory, NASA’s planned successor to the James Webb Space Telescope, will be a monster of an instrument.", "url": "https://www.universetoday.com/170942/is-the-habitable-worlds-observatory-a-good-idea/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/12/MGMwZjVmYiYsFSxZeRZvM29NeAM_T2FlOFVgSHlUfn81QmhSeQskKygFPxo5Qyo1OAc7HSZDPStiFioDeRt8aCkeKRo6DDRoKBo4DzJCeX4uRz8MZVRgI3QVbEdiXC5yYE9sWzRAenYoQ2oJZgt4IS8TeBc.jpg", "publishedAt": "2025-02-16T14:10:45Z", "content": "The Habitable Worlds Observatory, NASAs planned successor to the James Webb Space Telescope, will be a monster of an instrument. Using the same origami-like technique pioneered by the James Webb, the… [+2819 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Atomic mirrors made of light promise better, sharper quantum sensors - Interesting Engineering", "description": "Researchers in Germany have found a way to accurately study atomic reflections in quantum sensors by deploying special light pulses.", "url": "https://interestingengineering.com/science/atomic-mirrors-light-sharper-quantum-sensors", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/iStock-11722461821.jpg", "publishedAt": "2025-02-16T13:36:00Z", "content": "To work properly, they rely on carefully designed mirrors and beam splitters to control the movement of atoms. However, there could be instances when some atoms reflect in unexpected ways due to flaw… [+930 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Prabhat Ranjan Mishra", "title": "US region’s salt marshes store 10 million cars’ worth of carbon, outperform forests - Interesting Engineering", "description": "Scientists have recently introduced a new, highly accurate method for quantifying carbon capture in salt marshes.", "url": "https://interestingengineering.com/science/salt-marshes-store-carbon-outperform-forests", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/saltmarhes.png?w=1920", "publishedAt": "2025-02-16T13:28:00Z", "content": "“The amazing thing about tidal marshes, from a climate perspective is that they can continuously increase their carbon storage. They dont fill up,” said Wenxiu Teng, lead author of the paper and a Ph… [+1771 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Alpha Centauri Sending Stream of Objects Into Our Solar System, Scientists Propose - Futurism", "description": "New research suggests that our Solar System may already be swimming in interstellar objects that originate from the Alpha Centauri system.", "url": "https://futurism.com/alpha-centauri-sending-solar-system", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/alpha-centauri-solar-system-flooded-particles.jpg", "publishedAt": "2025-02-16T13:15:26Z", "content": "The detection of a large interstellar object in 2017 named 'Oumuamua was a landmark discovery. Figuring out where the wayward traveler came from, though, is another challenge entirely, especially sin… [+3737 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "The River Thames Has Been a Dumping Ground for Bodies for at Least 6,000 Years, Study Reveals - Gizmodo", "description": "Hundreds of human bones have emerged from the River Thames in the last two centuries, most of them prehistoric.", "url": "https://gizmodo.com/the-river-thames-has-been-a-dumping-ground-for-bodies-for-at-least-6000-years-study-reveals-2000562424", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/river-thames-london.jpg", "publishedAt": "2025-02-16T13:01:41Z", "content": "The average Londoner might be shocked to hear that, over the past two hundred years, hundreds of human bones have been discovered in the River Thames. As new research shows, a sizable portion of thes… [+2584 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Physicists \"Slow Down Light\" to Just 61 Kilometers per Hour Using Ultracold Quantum Matter - The Daily Galaxy --Great Discoveries Channel", "description": "The speed of light is often regarded as the ultimate cosmic speed limit, but researchers have now managed to slow it down dramatically—to just 61 kilometers", "url": "https://dailygalaxy.com/2025/02/physicists-slow-down-light-to-just-61-kilometers-per-hour-using-ultracold-quantum-matter/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/A-hyper-realistic-rendering-of-light-beams-bending-and-slowing-as-they-pass-through-a-cloud-of-ultracold-sodium-atoms.-.jpg", "publishedAt": "2025-02-16T13:00:00Z", "content": "The speed of light is often regarded as the ultimate cosmic speed limit, but researchers have now managed to slow it down dramaticallyto just 61 kilometers per hour. This was achieved by using a Bose… [+3807 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Teesha Shirodkar", "title": "Major differences that set Asteroids apart from Comets - The Times of India", "description": "Asteroids and comets are interesting celestial bodies that reveal information about the early solar system. Both originate from the same primordial material but have distinct characteristics that set them apart.", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/web-stories/major-differences-that-set-asteroids-apart-from-comets/photostory/118303260.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-118303267,imgsize-78126,width-900,height-1200,resizemode-6/118303267.jpg", "publishedAt": "2025-02-16T13:00:00Z", "content": "Asteroids and comets are occasionally visible from Earth. Bright comets, such as Halley's Comet, were visible without a telescope because they have long dust tails formed when their ice melts near th… [+107 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Ground Beneath Sweden Is Rising – Scientists Uncover Gravity Shift - SciTechDaily", "description": "Scientists at Sweden’s KTH Royal Institute of Technology have refined a method to measure post-glacial rebound in Fennoscandinavia, revealing a denser-than-expected landmass and a rise rate of up to one centimeter per year. As the Nordic region continues to r…", "url": "https://scitechdaily.com/the-ground-beneath-sweden-is-rising-scientists-uncover-gravity-shift/", "urlToImage": "https://scitechdaily.com/images/A-Vew-of-Smogen-on-the-West-Coast-of-Sweden.jpg", "publishedAt": "2025-02-16T12:52:11Z", "content": "Two KTH researchers developed a more accurate way to measure gravity shifts as the Scandinavian peninsula continues its centuries-long rise from the sea. Pictured, a view of Smögen on the west coast … [+3195 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Scientists Reveal \"Artificial Leaf\" That Turns Carbon Into Sustainable Fuels - Futurism", "description": "Scientists have developed a new \"artificial leaf\" that removes CO2 from the air and turns it into sustainable fuel.", "url": "https://futurism.com/artificial-leaf-carbon-sustainable-fuel", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/artificial-leaf-carbon-sustainable-fuel-1.jpg", "publishedAt": "2025-02-16T12:30:25Z", "content": "Using an ingenious method inspired by the photosynthesis of living things, scientists have developed a new \"artificial leaf\" that removes CO2 from the air and turns it into sustainable fuels.\r\nFor ye… [+2241 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Jack Lee", "title": "Buying a home in California? Here’s how seriously you should take Zillow’s climate risk data - San Francisco Chronicle", "description": "First Street provides property-level data about the risk of fires and floods. But scientists caution that homebuyers should consider other information too.", "url": "https://www.sfchronicle.com/science/article/zillow-home-climate-risk-20147318.php", "urlToImage": "https://s.hdnux.com/photos/01/47/24/36/27084673/12/rawImage.jpg", "publishedAt": "2025-02-16T12:09:55Z", "content": "Real-estate giant Zillow began offering snapshots of climate risk to potential homebuyers in September 2024. The climate risk scores reflect a propertys risk of five types of hazards over the next 30… [+8353 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Direct Image of the Cosmic Web Reveals the Universe’s Hidden Highways - SciTechDaily", "description": "A cosmic filament, 3 million light-years long, has been directly imaged for the first time — offering a new glimpse into the hidden framework of the Universe! Matter in intergalactic space is arranged in a vast network of interconnected filaments, known as th…", "url": "https://scitechdaily.com/first-direct-image-of-the-cosmic-web-reveals-the-universes-hidden-highways/", "urlToImage": "https://scitechdaily.com/images/MUDF-Cosmic-Filament-Twin.jpg", "publishedAt": "2025-02-16T11:41:47Z", "content": "Simulation of a vast region of the Universe based on the current cosmological model and performed using supercomputers. In the image, the faint glow of the gas within the cosmic filaments, forming a … [+5607 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Study models asteroid collision’s potentially devastating impact - The Washington Post", "description": "A Bennu-type asteroid could lead to “severe environmental consequences,” researchers write, while acknowledging that a collision is not likely.", "url": "https://www.washingtonpost.com/science/2025/02/16/asteroid-collision-impact-winter-bennu/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Q4XT6G3TWPBNFLDP4VGFQUCUJQ.JPG&w=1440", "publishedAt": "2025-02-16T11:31:00Z", "content": "A collision with a medium-size asteroid could create widespread devastation on Earths surface, according to a recent analysis.\r\nWriting in Science Advances, researchers used computer models to assess… [+2382 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Rick Kazmer", "title": "Officials issue stern PSA following protesters' intrusive operation: 'These people should get a life' - Yahoo", "description": "\"It's an 'active investigation.'\"", "url": "https://www.yahoo.com/news/officials-issue-stern-psa-following-113004906.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/bGnpHGQNydz_PTbj7bWVGA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/baac496c4c6d4749330278c141ea6dd4", "publishedAt": "2025-02-16T11:30:04Z", "content": "A CBC story about Vancouver Island's forests has elements of the good, the bad, and the ugly.\r\nThat's because old-growth tree protections have been extended through Sept. 30, 2026, shielding about 4.… [+3315 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Tina Deines", "title": "Scientists make astonishing discovery about plants at the molecular level — here's how it could help solve major problems in the medical field - Yahoo", "description": "\"This study is a testament to the unexpected connections between plant biology and microbiology.\"", "url": "https://www.yahoo.com/news/scientists-astonishing-discovery-plants-molecular-111557276.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/EAzUzzdhs2JJTnGLkx91Jw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/the_cool_down_737/b7bd164ce19e18417330bcfbbd22481b", "publishedAt": "2025-02-16T11:15:57Z", "content": "Scientists at the University of California-Riverside recently discovered a chemical that plants produce that could help prevent infections in medical patients.\r\nScience Daily reported on the findings… [+2427 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Steven Westwood", "title": "Researchers stunned after netting 'vanished' species 80 years after last sighting: 'The resolution of this long-standing mystery' - Yahoo", "description": "One thing is certain: The natural world holds plenty of secrets.", "url": "https://www.yahoo.com/news/researchers-stunned-netting-vanished-species-111510507.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rA0PAaRvHBOnwPpz_4t5Bg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/e297286bd6adce180e3720f2cbe774b1", "publishedAt": "2025-02-16T11:15:10Z", "content": "For more than 80 years, the Chel snakehead (Channa amphibeus) was thought to be extinct. The fish species, first described in 1840 in India's Chel River system, had gone unrecorded for decades until … [+2660 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "Space photo of the week: James Webb telescope shocks scientists with image of ancient galaxy roaring back to life - Livescience.com", "description": "The James Webb Space Telescope has zoomed in on Leo P, a tiny galaxy with some big things to say about star formation.", "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-james-webb-telescope-shocks-scientists-with-image-of-ancient-galaxy-roaring-back-to-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TRxmfXFyL6dWmb9DrowGgK-1200-80.jpg", "publishedAt": "2025-02-16T11:00:00Z", "content": "What it is: The Leo P dwarf galaxy\r\nWhere it is: 5.3 million light-years away in the constellation Leo\r\nWhen it was shared: Jan. 16, 2025\r\nWhy it's so special: Large galaxies like our own Milky Way\r\n… [+2887 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "'Sailing' satellites of the future could provide early warning of dangerous space weather - Space.com", "description": "NOAA is making progress on developing a solar sail to navigate satellites and increase lead time in geomagnetic storm forecasts.", "url": "https://www.space.com/space-exploration/tech/sailing-satellites-of-the-future-could-provide-early-warning-of-dangerous-space-weather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SAnTd8WZUX5PHvQ92oxQF5-1200-80.jpg", "publishedAt": "2025-02-16T11:00:00Z", "content": "NEW ORLEANS — Solar sails that allow satellites to glide on the light from the sun could soon become a reality.\r\nThe technology would allow scientists to provide earlier warnings of space weather eve… [+5111 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Britt Jones", "title": "Chilling discovery made after scientists finally reached the bottom of the Red Sea - UNILAD", "description": "They discovered a place where most animals 'are immediately stunned or killed' in the Red Sea.", "url": "https://www.unilad.com/community/life/death-pools-red-sea-explained-816368-20250213", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt659f699413370dcf/67ae5816e1932ebdd968cf9d/discovery-bottom-of-red-sea_(1).png", "publishedAt": "2025-02-16T10:59:17Z", "content": "Scientists reached the bottom of the Red Sea and what they found was startling.\r\nIf you thought we had collectively searched most of the sea as a human race, youd be wrong.\r\nIn fact, only five percen… [+2841 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "LIGO to detect gravitational waves from 13 million light-years further with new device - Interesting Engineering", "description": "A newly developed optical device promises to significantly enhance LIGO's ability to detect gravitational waves by boosting laser power.", "url": "https://interestingengineering.com/science/ligo-laser-boost-gravitational-waves", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/LIGO-laser-boost.png", "publishedAt": "2025-02-16T10:02:00Z", "content": "The US also has plans to make a gravitational wave detector 10 times the size of LIGO. The proposed observatory is named the Cosmic Explorer, and if everything goes as planned, it will be operational… [+786 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Sade Agard", "title": "Marvels on Mars: 10 astounding topographical features of the red planet - Interesting Engineering", "description": "Mars, our neighboring red planet, possesses some of the most dazzling and extreme geological features within our solar system. Here are some.", "url": "https://interestingengineering.com/lists/mars-astounding-topographical-features-red-planet", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/iStock-14765621771.jpg", "publishedAt": "2025-02-16T09:37:00Z", "content": "Unlike the volcanoes of Earth, Olympus Mons keeps growing because there are no plate tectonics on Mars. This means the lava does not get displaced but accumulates in one place. \r\nThe base of Olympus … [+971 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Uncover a Hidden Star Cluster That Changes Everything - SciTechDaily", "description": "The VLT captures a stunning infrared view of Sagittarius C, exposing a rich field of young stars. This breakthrough provides clues to the mysterious deficit of observed young stars in the Milky Way's core, suggesting areas obscured by cosmic dust as treasure …", "url": "https://scitechdaily.com/astronomers-uncover-a-hidden-star-cluster-that-changes-everything/", "urlToImage": "https://scitechdaily.com/images/Sagittarius-C-Infrared-VLT-scaled.jpg", "publishedAt": "2025-02-16T09:14:40Z", "content": "A stunning infrared image of Sagittarius C reveals hundreds of thousands of stars near the Milky Way’s center, captured by ESO’s Very Large Telescope. Credit: ESO/F. Nogueras-Lara et al.\r\nThe VLT cap… [+2263 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Quantum Mechanics Powers the Near-Perfect Efficiency of Photosynthesis - SciTechDaily", "description": "Plants harness quantum physics to capture solar energy with near-perfect efficiency. Scientists are now exploring how to apply this to next-gen renewable energy tech. Photosynthesis, the process plants use to convert sunlight into energy, relies on an incredi…", "url": "https://scitechdaily.com/how-quantum-mechanics-powers-the-near-perfect-efficiency-of-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Plant-Leaf-Photosynthesis-Art-Concept.jpg", "publishedAt": "2025-02-16T02:16:44Z", "content": "Plants harness quantum physics to capture solar energy with near-perfect efficiency. Scientists are now exploring how to apply this to next-gen renewable energy tech. Credit: SciTechDaily.com\r\nPlants… [+3638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Aguilar Prieto", "title": "An eruption is possible at Alaska’s Mount Spurr. What we know about the volcano - CNN International", "description": "A volcano near Alaska’s most populous city may be preparing to erupt, according to experts who have been monitoring the situation.", "url": "https://www.cnn.com/2025/02/15/us/mount-spurr-volcano-alaska/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/1739132441.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-16T00:33:00Z", "content": "A volcano near Alaskas most populous city could be on the brink of eruption after showing signs of unrest over the past 10 months, according to experts.\r\nHundreds of small earthquakes have occurred b… [+3396 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Made Cancer Radiation Therapy Smarter, Safer, and More Precise - SciTechDaily", "description": "Scientists at UC San Francisco have developed a revolutionary cancer treatment that precisely targets tumors with radiation while sparing healthy tissues. By using a KRAS-targeting drug to mark cancer cells and attaching a radioactive antibody to eliminate th…", "url": "https://scitechdaily.com/scientists-just-made-cancer-radiation-therapy-smarter-safer-and-more-precise/", "urlToImage": "https://scitechdaily.com/images/KRAS-Cancer-Tumor-Cell.jpg", "publishedAt": "2025-02-15T23:55:26Z", "content": "Immune proteins (purple) hold KRAS-sotorasib (yellow hexagons) at the surface of a tumor cell (orange). An antibody (green) carrying radioactivity (yellow halo) detects KRAS-sotorasib and grabs onto … [+5386 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Discovery Reveals the True Composition of Jupiter’s Clouds - SciTechDaily", "description": "A backyard astronomer helped uncover a planetary mystery — Jupiter’s famous clouds aren’t ammonia ice but a murky mix of chemicals, sitting lower in the atmosphere than expected. For years, astronomers believed that Jupiter’s upper clouds — responsible for it…", "url": "https://scitechdaily.com/new-discovery-reveals-the-true-composition-of-jupiters-clouds/", "urlToImage": "https://scitechdaily.com/images/Jupiter-Juno-54th-Close-Flyby.jpg", "publishedAt": "2025-02-15T21:29:21Z", "content": "NASA’s Juno captured this view of Jupiter during the mission’s 54th close flyby of the giant planet on September 7, 2023. Credit: NASA/JPL-Caltech/SwRI/MSSS, Image processing by Tanya Oleksuik CC BY … [+2519 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "SpaceX’s Video Of Starlink Satellites In Space Is So Good It Looks Fake - Wccftech", "description": "SpaceX has shared fresh footage of a latest batch of Starlink satellites being sent to space. Take a look here for more!", "url": "https://wccftech.com/spacexs-video-of-starlink-satellites-in-space-is-so-good-it-looks-fake/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/02/SPACEX-STARSHIP-INTERNET-728x402.png", "publishedAt": "2025-02-15T21:04:00Z", "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\r\nSpaceX has shared a fresh video of the Falcon 9 deploying a… [+3253 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "Many Stars Could Have Sent Us ‘Oumuamua - Universe Today", "description": "When astronomers detected the first known interstellar object, ‘Oumuamua, in 2017, it sparked a host of new studies trying to understand the origin and trajectory of the galactic sojourner. ‘Oumuamua’s unique properties – unlike anything orbiting our sun – ha…", "url": "https://www.universetoday.com/170929/many-stars-could-have-sent-us-oumuamua/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/06/Oumuamua.jpg", "publishedAt": "2025-02-15T19:17:18Z", "content": "When astronomers detected the first known interstellar object, ‘Oumuamua, in 2017, it sparked a host of new studies trying to understand the origin and trajectory of the galactic sojourner.\r\n‘Oumuamu… [+4382 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Good News Network", "title": "Social Media is Swooning Over Images of Hearts on Mars - Good News Network", "description": "NASA sent a valentine to space lovers on social media this week posting images of heart shapes found on Mars.", "url": "https://www.goodnewsnetwork.org/social-media-is-swooning-over-images-of-hearts-on-mars/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/Heart-shapes-on-Mars-planet-posted-by-Mars-Global-Surveyor-team-SWNS.jpg", "publishedAt": "2025-02-15T18:49:21Z", "content": "Heart shapes on Mars captured by Mars Global Surveyor team – NASA / SWNS\r\nNASA sent a valentine to space lovers on social media this week posting images of heart shapes found on Mars.\r\nThe pictures w… [+866 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Mo Costandi", "title": "How early human brains expanded over time - Big Think", "description": "New research challenges old assumptions about the evolution of the human brain.", "url": "https://bigthink.com/the-past/how-early-human-brains-expanded-over-time/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/02/brains-expand-faster_compressed.jpg?resize=1200,630", "publishedAt": "2025-02-15T18:00:00Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "When Did Ocean Acidity Allow Life To Start? - Forbes", "description": "A new study finds that ocean acidity may have prevented life on Earth from developing for the planet’s first 500 million years.", "url": "https://www.forbes.com/sites/davidbressan/2025/02/15/when-did-ocean-acidity-allow-life-to-start/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67ae3bb4106b2c03ad37a1c8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-15T16:46:58Z", "content": "The Danakil desert in Ethiopia with its acidic lakes gives an mpression of how Earth may have looked ... [+] around 4 billion years ago.\r\ngetty\r\nPockets of liquid water existed on Earth already 4.1 b… [+3387 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Brian Foster", "title": "NASA detects an unknown anomaly 90 km above Earth, leaving scientists puzzled - Glass Almanac", "description": "In an unexpected discovery, NASA has detected an anomaly 90 kilometers above the Earth’s surface that could have surprising consequences for both weather patterns and space ... Continue Reading →", "url": "https://glassalmanac.com/nasa-detects-an-unknown-anomaly-90-km-above-earth-leaving-scientists-puzzled/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/02/69560275.jpg", "publishedAt": "2025-02-15T16:30:49Z", "content": "In an unexpected discovery, NASA has detected an anomaly 90 kilometers above the Earths surface that could have surprising consequences for both weather patterns and space technology. This new findin… [+5140 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Detect Huge Radioactive \"Anomaly\" Under Pacific Ocean - Futurism", "description": "Researchers have discovered an \"unexpected\" accumulation of the radioactive isotope beryllium-10, deep in the Pacific Ocean.", "url": "https://futurism.com/huge-radioactive-anomaly-pacific-ocean", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/huge-radioactive-anomaly-pacific-ocean.jpg", "publishedAt": "2025-02-15T16:15:15Z", "content": "Researchers have discovered an \"unexpected\" accumulation of the radioactive isotope beryllium-10, deep underneath the surface of the Pacific Ocean.\r\nAs detailed in a paper published in the journal Na… [+3033 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Unique 3D quasicrystal provides a glimpse into the fourth dimension - Interesting Engineering", "description": "The new study provides new insights into this fourth-dimensional aspect of the quasicrystal. This finding confirms that quasicrystals are shaped by hidden higher-dimensional physics, not just random patterns.", "url": "https://interestingengineering.com/science/quasicrystal-and-the-fourth-dimension", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/quasicrystal.jpg", "publishedAt": "2025-02-15T15:43:00Z", "content": "This crystal was first discovered in 1982 by an Israeli scientist Dan Shechtman. He proposed that a quasicrystal also has a repeating (periodic) structure, but not in the 3D space where we see it. In… [+710 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "This Week In Space podcast: Episode 148 — Clavius Base - Space.com", "description": "Why Clavius Crater Is the Best Spot for NASA’s Moon Base With Dr. Pascal Lee", "url": "https://www.space.com/entertainment/space-movies-shows/this-week-in-space-podcast-episode-148-clavius-base", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SroVAWmWdJizaAHSZyet7J-1200-80.jpg", "publishedAt": "2025-02-15T15:25:12Z", "content": "On Episode 148 of This Week In Space, Rod Pyle and Tariq Malik speak with Dr. Pascal Lee about why Clavius may be the ideal place to build our first lunar base.\r\nThe very mention of Clavius, a vast l… [+1893 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Meet Grace, the Hopping Robot That Will Dive Into the Moon’s Darkest Craters - Gizmodo", "description": "The first-of-its-kind lunar explorer will search for water ice, as it bounces in and out of craters.", "url": "https://gizmodo.com/meet-grace-the-hopping-robot-that-will-dive-into-the-moons-darkest-craters-2000561619", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/im-2-clean-center.jpeg", "publishedAt": "2025-02-15T15:00:09Z", "content": "Meet Grace, the brave hopper robot that’s designed to jump into the darkest depths of the Moon, providing never-before-seen views of permanently shadowed craters near the lunar south pole.\r\nHouston-b… [+3364 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Liv Bridge", "title": "Story behind one of the 'most terrifying photos' ever taken in space is chilling - UNILAD", "description": "The late NASA astronaut Bruce McCandless II spoke about how he took the harrowing image before he died.", "url": "https://www.unilad.com/technology/space/nasa-photo-astronaut-space-explained-290738-20250212", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blte44bfc90e7eee12a/67ad04616314936be3344747/resize_(9).webp", "publishedAt": "2025-02-15T14:47:04Z", "content": "The astronaut behind one of the 'most terrifying photos' ever taken in space explained why it was it was chilling.\r\nThe late Bruce McCandless II opened up about his history-making expedition before h… [+2876 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Blue Ghost 1 enters lunar orbit as Resilience flies by the moon - SpaceNews", "description": "One commercial lunar lander has entered orbit around the moon while another, launched at the same time, made a lunar flyby to set up a later return.", "url": "http://spacenews.com/blue-ghost-1-enters-lunar-orbit-as-resilience-flies-by-the-moon/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcL2JnMS1sdW5hcm9yYml0LTEwMjR4NzY2LmpwZWciLCJ0eHQiOiJCbHVlIEdob3N0IDEgZW50ZXJzIGx1bmFyIG9yYml0IGFzIFJlc2lsaWVuY2UgZmxpZXMgYnkgdGhlIG1vb24iLCJ0ZW1wbGF0ZSI6ImZ1bGxzY3JlZW4iLCJibG9nX2lkIjo4MDY4MTk3OX0.HZ1E4VyNsAGHA1_1eifhJq6ump6vkLgQK6mjvfiFPRoMQ", "publishedAt": "2025-02-15T14:18:39Z", "content": "WASHINGTON One commercial lunar lander has entered orbit around the moon while another, launched at the same time, has performed a lunar flyby to set up a later return.\r\nFirefly Aerospace confirmed F… [+2706 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "A newly proposed protocol to boost privacy in quantum sensor networks - Phys.org", "description": "Devices that leverage quantum mechanics effects, broadly referred to as quantum technologies, could help to tackle some real-world problems faster and more efficiently. In recent years, physicists and engineers have introduced various promising quantum techno…", "url": "https://phys.org/news/2025-02-newly-protocol-boost-privacy-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-newly-proposed-proto.jpg", "publishedAt": "2025-02-15T14:00:02Z", "content": "Devices that leverage quantum mechanics effects, broadly referred to as quantum technologies, could help to tackle some real-world problems faster and more efficiently. In recent years, physicists an… [+4106 chars]"}]}