{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Man Narrowly Escapes Meteorite Strike: ‘It Probably Would’ve Have Ripped Me in Half!’ - The Daily Galaxy --Great Discoveries Channel", "description": "A fiery streak lights up the night sky, and within moments, a deafening crash shatters the calm in a quiet Canadian neighborhood. What followed was an extraordinary encounter with a visitor from space that left scientists stunned and one homeowner counting hi…", "url": "https://dailygalaxy.com/2025/01/man-narrowly-escapes-meteorite-strike/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Man-Narrowly-Escapes-Meteorite-Strike-It-Probably-Wouldve-Have-Ripped-Me-in-Half.jpg", "publishedAt": "2025-01-26T17:00:00Z", "content": "A meteorite hurtling at over 125 mph (201.17 km/h) narrowly avoided striking a Canadian homeowner, creating an extraordinary scene captured on video. The event, which took place in Charlottetown, Pri… [+3654 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Where did dinosaurs come from? Scientists say they figured it out - Earth.com", "description": "Study suggests dinosaurs originated in the Amazon, but their fossils are missing. They started as small, bipedal creatures in a hot climate.", "url": "https://www.earth.com/news/where-did-dinosaurs-come-from-missing-fossils-hold-the-secret/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/26105118/dinosaurs_origin_evolution_1m.jpg", "publishedAt": "2025-01-26T16:35:51Z", "content": "The story of how dinosaurs came to rule our planet has captivated scientists and the public alike for generations. Now, an intriguing new study on fossils suggests we might be looking in the wrong pl… [+6876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Fossils found in China may add a new branch to the human family tree - CNN", "description": "This week, meet a big-brained ancient human relative, hear a meteorite as it lands on Earth, spot a tiny kangaroo-like marsupial, and more.", "url": "https://www.cnn.com/2025/01/26/science/ancient-human-fossils-china-science-newsletter-wt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/figure-4-9-landscape-view-of-xujiayao-20250124214018808.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-26T16:00:00Z", "content": "Editors note: A version of this story appeared in CNNs Wonder Theory science newsletter. To get it in your inbox, sign up for free here.\r\nThe story of how humans evolved is a long and winding one and… [+5353 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Unearthed an Unknown Creature with 24 Eyes While Checking the Quality of the Water in a Nature Reserve - The Daily Galaxy --Great Discoveries Channel", "description": "In the quiet wetlands of Hong Kong, researchers stumbled upon a creature so bizarre it seems pulled from the pages of science fiction. With an otherworldly design—including clusters of eyes and unusual abilities—this aquatic predator has left scientists scrat…", "url": "https://dailygalaxy.com/2025/01/scientists-unearthed-an-unknown-creature-with-24-eyes-while-checking-the-quality-of-the-water-in-a-nature-reserve/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/mysterious-aquatic-creature-illuminated-by-soft-underwater-light.jpg", "publishedAt": "2025-01-26T15:00:00Z", "content": "In a jaw-dropping twist straight out of a sci-fi blockbuster, scientists have stumbled upon a creature so bizarre it defies everything we thought we knew about nature. A venomous jellyfish with 24 ey… [+2692 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Joe Wilkins", "title": "Scientists Find Signs of Life Deep Inside the Earth - Futurism", "description": "A groundbreaking new study of microbes underground is challenging everything we thought we knew about extreme environments.", "url": "https://futurism.com/the-byte/scientists-life-deep-inside-earth", "urlToImage": "https://wordpress-assets.futurism.com/2025/01/scientists-life-deep-inside-earth.jpeg", "publishedAt": "2025-01-26T14:45:59Z", "content": "Deep, deep underground.\r\nLittle Friends\r\nWe've heard of underground parties, but this is ridiculous. A new study by an international team of researchers has uncovered troves of microbes thriving in t… [+2392 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Many alpha male primates sacrifice good health for power - Earth.com", "description": "Alpha male baboons don’t just fight for dominance—they also face extreme stress from guarding their mates.", "url": "https://www.earth.com/news/alpha-male-baboons-sacrifice-good-health-for-power/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/23063133/Alpha-baboon.jpg", "publishedAt": "2025-01-26T14:23:11Z", "content": "We often admire the alpha males of the world – think of a lion ruling his pride, a CEO commanding a boardroom, or a wolf leading his pack. These males have dominance, respect, and the first pick of r… [+5393 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Supersonic winds blow at 33,000 km/h in space around the planet WASP-127b - Indian Defence Review", "description": "WASP-127b boasts wind speeds of 33,000 km/h—faster than anything we've seen before! This gas giant's bizarre atmosphere invites questions that could reshape our understanding of distant planets. Discover the secrets of this extraordinary world!", "url": "https://indiandefencereview.com/supersonic-winds-blow-at-33000-km-h-in-space-around-the-planet-wasp-127b/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/wasp-127b-supersonic20winds-lisa20nortmann.jpeg", "publishedAt": "2025-01-26T14:00:00Z", "content": "Out in the vastness of space, exoplanets are keeping scientists on their toes with all sorts of wild and extreme traits. One such intriguing world is WASP-127b. It’s not just its massive size that gr… [+3526 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Trending Desk", "title": "14-year-old Noida boy discovers an asteroid, NASA’s reaction will amaze you - The Times of India", "description": "Daksh Malik, a 14-year-old from Noida, discovered an asteroid through the International Asteroid Discovery Project and now has the chance to name it.", "url": "https://timesofindia.indiatimes.com/etimes/trending/14-year-old-noida-boy-discovers-an-asteroid-nasas-reaction-will-amaze-you/articleshow/117580113.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-117580124,width-1070,height-580,imgsize-65144,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-01-26T13:41:00Z", "content": "8 famous quotes from the books of Chinese-American author Ana Huang"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Strange Signal Coming From Dead Galaxy, Scientists Say - Futurism", "description": "Astronomers say they've detected a mysterious type of signal known as a fast radio burst coming from an ancient, dead galaxy.", "url": "https://futurism.com/the-byte/strange-signal-dead-galaxy", "urlToImage": "https://wordpress-assets.futurism.com/2025/01/strange-signal-dead-galaxy.jpg", "publishedAt": "2025-01-26T13:15:56Z", "content": "This makes no sense.\r\nRadio Star\r\nAstronomers say they've detected a mysterious type of signal known as a fast radio burst coming from an ancient, dead galaxy billions of light years away. Figurative… [+2887 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "“Gigantic Leap” For Chinese Space Program! Astronauts Claim Massive Breakthrough In Artificial Photosynthesis - EurAsian Times", "description": "In a major milestone that can go a long way in sustaining long-term life in space, the astronauts of the youngest space station in the world, the Chinese Tiangong, successfully conducted experimental extra-terrestrial photosynthesis in orbit ahead of its key …", "url": "https://www.eurasiantimes.com/gigantic-leap-for-chinese-space-program/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2025/01/Space-Station-e1737896744723.jpeg", "publishedAt": "2025-01-26T13:11:21Z", "content": "In a major milestone that can go a long way in sustaining long-term life in space, the astronauts of the youngest space station in the world, the Chinese Tiangong, successfully conducted experimental… [+5927 chars]"}, {"source": {"id": null, "name": "Realclimate.org"}, "author": "Stefan", "title": "The AMOC is slowing, it’s stable, it’s slowing, no, yes, … - RealClimate", "description": "RealClimate: There's been a bit of media whiplash on the issue of AMOC slowing lately - ranging from the AMOC being \"on the brink of collapse\" to it being \"more stable than previously thought\". AMOC, of course, refers to the Atlantic Meridional Overturning Ci…", "url": "https://www.realclimate.org/index.php/archives/2025/01/the-amoc-is-slowing-its-stable-its-slowing-no-yes/", "urlToImage": "https://www.realclimate.org/images//Cold-blob-fingerprint.png", "publishedAt": "2025-01-26T13:04:40Z", "content": "There’s been a bit of media whiplash on the issue of AMOC slowing lately – ranging from the AMOC being “on the brink of collapse” to it being “more stable than previously thought”. AMOC, of course, r… [+9521 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Matt LaFever", "title": "A NorCal town's hidden role in solving an astronomical mystery - SFGATE", "description": "The Ukiah Latitude Observatory has a rich history, from its role in global scientific research to its ongoing cultural significance.", "url": "https://www.sfgate.com/northcoast/article/norcal-town-hidden-role-astronomical-mystery-20014248.php", "urlToImage": "https://s.hdnux.com/photos/01/46/62/66/26946981/5/rawImage.jpg", "publishedAt": "2025-01-26T12:37:13Z", "content": "Over 300 years ago, Sir Isaac Newton observed an odd, inexplicable wobble in Earths rotation, sparking his curiosity. In 1891, American businessman-turned-astronomer Seth Carlo Chandler identified th… [+8545 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Kept in Captivity for 20 Years, This 4-Foot Predator Is Now a Newly Discovered Species - The Daily Galaxy --Great Discoveries Channel", "description": "An unassuming predator, kept in captivity for nearly two decades, held a secret that would shock the scientific world. At over 4 feet long, its olive-green scales and creamy underbelly hinted at something extraordinary. Yet, for years, it remained overlooked,…", "url": "https://dailygalaxy.com/2025/01/kept-in-captivity-for-20-years-this-4-foot-predator-is-now-a-newly-discovered-species/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Scientists-kept-a-4-foot-long-predator-in-captivity-for-over-a-decade-and-discovered-a-new-species-from-Ethiopia.jpg", "publishedAt": "2025-01-26T12:15:00Z", "content": "A decades-old mystery surrounding an olive-colored predator kept in captivity for nearly 20 years has led to the identification of a new species of snake in Ethiopia. Scientists Jakob Hallermann and … [+2579 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "New dinosaur species emerges from pre-WWII fossil photos - The Washington Post", "description": "The dinosaur was about as big as a Tyrannosaurus rex and had a unique nasal horn and symmetrical teeth that it used to eat its prey.", "url": "https://www.washingtonpost.com/science/2025/01/26/dinosaur-tameryraptor-bombing-fossil-discovery/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5ZURKI5R5N3CDYLT3RWEXVHQMM.jpg&w=1440", "publishedAt": "2025-01-26T11:32:21Z", "content": "Scientists have identified a previously unknown dinosaur species from an unlikely source: photographs of fossils destroyed during the Allied bombing of Munich in World War II.\r\nResearchers announced … [+2317 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "Monstrous Creatures of The Past Could Have Feasted on Today's Apex Predators - ScienceAlert", "description": "Biodiversity was booming in the early Cretaceous Period, and not just among dinosaurs.", "url": "https://www.sciencealert.com/monstrous-creatures-of-the-past-could-have-feasted-on-todays-apex-predators", "urlToImage": "https://www.sciencealert.com/images/2025/01/Kronosaurus_bojacens1DB.jpg", "publishedAt": "2025-01-26T11:30:23Z", "content": "Biodiversity was booming in the early Cretaceous Period, and not just among dinosaurs. The oceans also teemed with life, including some monstrous predators unlike anything alive today.\r\nIn a new stud… [+4397 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Einstein Probe Detects Mysterious Blast of X-Rays From the Early Universe - Gizmodo", "description": "The puzzling discovery may force astronomers to rethink the origin of gamma ray bursts.", "url": "https://gizmodo.com/einstein-probe-detects-mysterious-blast-of-x-rays-from-the-early-universe-2000554303", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/Einstein_Probe_detects_ancient_X-ray_burst.jpg", "publishedAt": "2025-01-26T11:00:24Z", "content": "On March 15, 2024, a space-based observatory detected bursts of low-energy X-rays from deep in the ancient universe, fluctuating in brightness for over 17 minutes before fading away. About an hour la… [+3792 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "What are boson stars — and what do they have to do with dark matter? - Space.com", "description": "The skies may be full of invisible \"boson stars.\"", "url": "https://www.space.com/the-universe/stars/what-are-boson-stars-and-what-do-they-have-to-do-with-dark-matter", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DXbPs5MXbcTmZ4gGoqXS3g-1200-80.jpg", "publishedAt": "2025-01-26T11:00:00Z", "content": "Have you ever looked up at the night sky and wondered what you're not seeing? The skies may be full of invisible \"boson stars\" that are made of an exotic form of matter that does not shine.\r\nWe stron… [+4404 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Found the Magic Number to Save Quantum Networks - SciTechDaily", "description": "Researchers at Northwestern have found a way to keep quantum networks functioning despite the inherent instability of quantum links. By strategically adding links, they demonstrated that networks can be maintained with far fewer new connections than expected,…", "url": "https://scitechdaily.com/physicists-found-the-magic-number-to-save-quantum-networks/", "urlToImage": "https://scitechdaily.com/images/Stabilize-Quantum-Networks-Art-Concept-scaled.jpg", "publishedAt": "2025-01-26T10:24:23Z", "content": "A new study highlights how adding the right number of connections can keep quantum networks stable, using fewer resources than previously thought necessary, suggesting a scalable approach to quantum … [+5618 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "New Images of Interstellar Dust Look Like Something Out of a Dream - ScienceAlert", "description": "The intricate whorls and striations of dust that drift between the stars have just been revealed in stupefying detail.", "url": "https://www.sciencealert.com/new-images-of-interstellar-dust-look-like-something-out-of-a-dream", "urlToImage": "https://www.sciencealert.com/images/2025/01/space-striations.jpg", "publishedAt": "2025-01-26T09:01:18Z", "content": "The intricate whorls and striations of dust that drift between the stars have just been revealed in stupefying detail.\r\nIn new images from JWST, we're finally seeing exquisite details of the flow and… [+3794 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Molly Herring", "title": "Scientists Recreate the Conditions That Sparked Complex Life - WIRED", "description": "Evolution was fueled by endosymbiosis, cellular alliances in which one microbe makes a permanent home inside another. For the first time, biologists made it happen in the lab.", "url": "https://www.wired.com/story/scientists-recreate-the-conditions-that-sparked-complex-life/", "urlToImage": "https://media.wired.com/photos/6790c7e2fafe1eeb1f151d66/191:100/w_1280,c_limit/LabEndosymbiosis-crKristinaArmitage-Lede-scaled.jpeg", "publishedAt": "2025-01-26T07:00:00Z", "content": "The original version ofthis storyappeared in Quanta Magazine.\r\nFar from being solo operators, most single-celled microbes are in complex relationships. In the ocean, the soil, and your gut, they migh… [+3235 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Jenny List", "title": "Does A Radome Affect Radio? - Hackaday", "description": "Not too far away from where this is being written is one of Uncle Sam’s NATO outposts, a satellite earth station for their comms system. Its most prominent feature is a radome, a huge golf-ba…", "url": "https://hackaday.com/2025/01/25/does-a-radome-affect-radio/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/01/radome-featured.jpg", "publishedAt": "2025-01-26T03:00:00Z", "content": "Not too far away from where this is being written is one of Uncle Sam’s NATO outposts, a satellite earth station for their comms system. Its most prominent feature is a radome, a huge golf-ball-like … [+1198 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Here’s the Species That Would Dominate the Planet if Humanity Went Extinct, According to a Scientist - farmingdale-observer.com", "description": "In the realm of scientific speculation, researchers often ponder the fate of Earth without human influence. Among these thinkers, Tim Coulson, a distinguished professor at Oxford University, proposes an intriguing theory about the species that might dominate …", "url": "https://farmingdale-observer.com/2025/01/25/heres-the-species-that-would-dominate-the-planet-if-humanity-went-extinct-according-to-a-scientist/", "urlToImage": null, "publishedAt": "2025-01-25T23:42:00Z", "content": "In the realm of scientific speculation, researchers often ponder the fate of Earth without human influence. Among these thinkers, Tim Coulson, a distinguished professor at Oxford University, proposes… [+4191 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "There’s More Than Just Gravity at Work in the Solar System - Universe Today", "description": "Ever since Isaac Newton famously talked about gravity, its dominance as a force in our Solar System has been well known. It’s responsible for the orbits of the planets and their satellites but there are other forces that have shaped our planetary neighbourhoo…", "url": "https://www.universetoday.com/170611/theres-more-than-just-gravity-at-work-in-the-solar-system/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2025/01/comet.jpg", "publishedAt": "2025-01-25T23:39:14Z", "content": "Ever since Isaac Newton famously talked about gravity, its dominance as a force in our Solar System has been well known. Its responsible for the orbits of the planets and their satellites but there a… [+4044 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "JWST facing potential cuts to its operational budget - SpaceNews", "description": "While the James Webb Space Telescope continues to exceed astronomers’ expectations, it faces a potential funding shortfall.", "url": "http://spacenews.com/jwst-facing-potential-cuts-to-its-operational-budget/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyMVwvMTJcL2p3c3QtZGVjMjAyMS1pbGx1cy5qcGciLCJ0eHQiOiJKV1NUIGZhY2luZyBwb3RlbnRpYWwgY3V0cyB0byBpdHMgb3BlcmF0aW9uYWwgYnVkZ2V0IiwidGVtcGxhdGUiOiJkb2lzIiwiYmxvZ19pZCI6ODA2ODE5Nzl9.dFq7DZXS5YgHvHriwdGSAuv3nUr1IR4_C1ykzEXOr_4MQ", "publishedAt": "2025-01-25T23:01:32Z", "content": "WASHINGTON While the James Webb Space Telescope (JWST) continues to exceed astronomers expectations, a potential funding shortfall could reduce the telescopes effectiveness as soon as this fall.\r\nOff… [+3698 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Dark Universe With a Mysterious Fifth Force - SciTechDaily", "description": "Researchers hypothesize a fifth force of nature that could explain the intricate relationship between dark matter and dark energy, suggesting a revolutionary expansion of the Standard Model of physics. Could a new, fifth force of nature help answer some of th…", "url": "https://scitechdaily.com/unlocking-the-dark-universe-with-a-mysterious-fifth-force/", "urlToImage": "https://scitechdaily.com/images/Hadrons-Split-Into-Quarks-and-Bosons.jpg", "publishedAt": "2025-01-25T22:31:32Z", "content": "During particle collisions, hadrons split into quarks and bosons. Credit: University of Oregon\r\nResearchers hypothesize a fifth force of nature that could explain the intricate relationship between d… [+3143 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Astronomers Capture Mysterious 'Chorus Waves' Emerging From Deep Space - ScienceAlert", "description": "An international team of astronomers has detected mysterious chirping signals in an unexpected region of space, raising major questions about how they're created.", "url": "https://www.sciencealert.com/astronomers-capture-mysterious-chorus-waves-emerging-from-deep-space", "urlToImage": "https://www.sciencealert.com/images/2025/01/EarthModel.jpg", "publishedAt": "2025-01-25T22:31:18Z", "content": "An international team of astronomers has detected mysterious chirping signals in an unexpected region of space, raising major questions about how they're created.\r\nKnown as chorus waves, these signal… [+2809 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Astronomers Discover Strange Object in Space—Turns Out Elon Musk Has Something to Do With It - Indian Defence Review", "description": "Astronomers recently identified a mysterious object near Earth that left them puzzled—until they realized Elon Musk was unexpectedly connected to it. This surprising discovery highlights the growing challenges of tracking objects in space and raises intriguin…", "url": "https://indiandefencereview.com/strange-object-in-space-elon-musk/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Astronomers-Thought-They-Found-an-Asteroid—It-Was-Elon-Musks-Tesla-All-Along.jpg", "publishedAt": "2025-01-25T20:06:44Z", "content": "In an unexpected twist, astronomers recently mistook Elon Musks SpaceX Tesla Roadster, launched into space in 2018, for an asteroid. The red convertible, famously sent into orbit with a mannequin nic… [+5789 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Timothy Malcolm", "title": "NASA Curiosity rover finds proof pointing toward a habitable Mars - Chron", "description": "Caltech scientists published a study using NASA Curiosity rover imagery showing the past existence of warm water on Mars.", "url": "https://www.chron.com/news/space/article/mars-nasa-curiosity-rover-life-20055602.php", "urlToImage": "https://s.hdnux.com/photos/01/46/63/40/26949685/3/rawImage.jpg", "publishedAt": "2025-01-25T19:32:07Z", "content": "NASA's Curiosity rover has found evidence that conditions on the planet Mars may have been hospitable for life.\r\nHeritage Images/Getty Images\r\nIt has been a trying time for NASA, what with astronauts… [+2452 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Researchers found a bacteria that eats forever chemicals and their toxic waste - BGR", "description": "Researchers say they have found an unexpected bacteria that can eat forever chemicals and their toxic waste.", "url": "https://bgr.com/science/researchers-found-a-bacteria-that-eats-forever-chemicals-and-their-toxic-waste/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/09/rsz_adobestock_176894218.jpg?quality=82&strip=all", "publishedAt": "2025-01-25T18:44:00Z", "content": null}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Alarming Antarctic Melt Accelerates, Posing a Grave Threat to Global Sea Levels - Indian Defence Review", "description": "The Amery Ice Shelf in East Antarctica, one of the largest and most vital ice formations, is experiencing rapid melting, with melt ponds forming farther inland than ever before. Scientists warn that these changes could destabilize the ice shelf, accelerating …", "url": "https://indiandefencereview.com/antarctic-melt-accelerate-global-sea-level/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Alarming-Antarctic-Melt-Accelerates-Posing-a-Grave-Threat-to-Global-Sea-Levels.jpg", "publishedAt": "2025-01-25T18:15:31Z", "content": "The Amery Ice Shelf in East Antarctica, one of the continents largest and most critical ice formations, is experiencing unprecedented and rapid melting at an alarming pace. Recent satellite observati… [+5898 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "Time-lapse of 1st black hole ever imaged reveals how matter swirls around it - Livescience.com", "description": "Scientists used changes in the supermassive black hole M87*'s accretion disk to infer its orientation, size and turbulence", "url": "https://www.livescience.com/space/black-holes/time-lapse-of-1st-black-hole-ever-imaged-reveals-how-matter-swirls-around-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fTJtaHaQVUewXQCxnvoSXc-1200-80.jpg", "publishedAt": "2025-01-25T18:02:00Z", "content": "How much does a black hole change in a year? Scientists may now have an idea, after taking a fresh look at the first-ever black hole to be imaged\r\n — the supermassive black hole M87*, , which resides… [+2782 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Einstein’s Theory Faces Its Heaviest Challenge Yet – and It Still Holds Up - SciTechDaily", "description": "Researchers at the Large Hadron Collider tested whether top quarks, the most massive known elementary particles, comply with Einstein’s theory of relativity. Despite theories suggesting potential deviations at high energies, the experiments confirmed that Lor…", "url": "https://scitechdaily.com/einsteins-theory-faces-its-heaviest-challenge-yet-and-it-still-holds-up/", "urlToImage": "https://scitechdaily.com/images/Neutrino-Particle-Physics-Art.jpg", "publishedAt": "2025-01-25T17:49:39Z", "content": "Scientists have now confirmed through experiments with top quarks at the LHC that Einstein’s special theory of relativity holds, even under conditions where some theories predicted it might not. Cred… [+3509 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Shape of electrons is revealed for the first time through big advance in quantum physics - Earth.com", "description": "For the first time, scientists have measured the shape of an electron in solids, opening the door to advances in quantum materials.", "url": "https://www.earth.com/news/shape-of-electrons-revealed-first-time-through-big-advance-in-quantum-physics/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/24150211/shape-of-the-electron-quantum-physics-advances.jpg", "publishedAt": "2025-01-25T17:10:35Z", "content": "For the first time, researchers have measured the shape of an electron as it moves through a solid. This achievement could open a new way of looking at how electrons behave inside different materials… [+5901 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Northern Lights Forecast: Geomagnetic Storm Could Bring Aurora Borealis To These States Tonight - Forbes", "description": "An earlier coronal mass ejection may bring the northern lights to more states.", "url": "https://www.forbes.com/sites/tylerroush/2025/01/25/northern-lights-forecast-geomagnetic-storm-could-bring-aurora-borealis-to-these-states-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67950358d58eaac855e34cf9/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-25T15:32:02Z", "content": "The effects of a coronal mass ejectiona bubble of plasma that bursts from the suns surfacewill likely impact Earths magnetic field on Saturday, bringing the northern lights to several northern U.S. s… [+3197 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "K.R. Callaway", "title": "Scientists discover pristine ancient forest frozen in time in Rocky Mountains - Livescience.com", "description": "A melting ice patch in the Rocky Mountains uncovered an ancient forest, and these trees have stories to tell about dynamic landscapes and climate change.", "url": "https://www.livescience.com/planet-earth/plants/pristine-ancient-forest-frozen-in-time-discovered-in-rocky-mountains", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ccLcmhcmgsEGw9WerAVixM-1200-80.jpg", "publishedAt": "2025-01-25T15:10:00Z", "content": "Melting ice high up in the Rocky Mountains has revealed an impeccably preserved forest, frozen in time for thousands of years.\r\nBeartooth Plateau\r\n, which sits at an altitude of over 10,000 feet (3,0… [+3627 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Neanderthal Extinction Linked to Peculiarities in their Blood Types - Ancient Origins", "description": "A recent study strongly suggests that when early humans migrated out of Africa, a rapid evolution in their red blood cells may have played a key role in their survival — and potentially contributed to the eventual extinction of Neanderthals, who experienced n…", "url": "https://www.ancient-origins.net/news-history-archaeology-evolution-human-origins/neanderthal-blood-types-0021853", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/NEO1.jpg", "publishedAt": "2025-01-25T14:59:00Z", "content": "A recent study strongly suggests that when early humans migrated out of Africa, a rapid evolution in their red blood cells may have played a key role in their survival and potentially contributed to … [+6241 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Powerful forces have made the structure of the universe very \"messy\" - Earth.com", "description": "Researchers studied how the universe’s structure changed over time. They found that the universe is less clumpy than expected.", "url": "https://www.earth.com/news/powerful-forces-have-made-the-structure-of-the-universe-messier/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/25073217/Universe-structure.jpg", "publishedAt": "2025-01-25T14:45:28Z", "content": "Across cosmic history, powerful forces have shaped matter into the intricate structures that define the universe. From the earliest moments after the Big Bang to the present-day cosmic web, the distr… [+7443 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "An ‘alien visitor’ might have warped our solar system, study claims - BGR", "description": "A new study claims it is possible an \"alien visitor\" could have warped our solar system during its earliest years.", "url": "https://bgr.com/science/an-alien-visitor-might-have-warped-our-solar-system-study-claims/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/11/kepler-385-solar-system.webp", "publishedAt": "2025-01-25T14:19:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA wants to launch rockets into northern lights to study 'black auroras' - Space.com", "description": "NASA plans to fly two rockets through active auroras and study the unique ribbons of light that dance across the Alaskan night sky.", "url": "https://www.space.com/stargazing/aurora-borealis/nasa-wants-to-launch-rockets-into-northern-lights-to-study-black-auroras", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fsZxZS7JTS23jMXV9BWR3j-1200-80.jpg", "publishedAt": "2025-01-25T14:00:00Z", "content": "NASA plans to fly two rockets through active auroras to help study the unique ribbons of light that dance across the Alaskan night sky.\r\nThe rockets are expected to lift off from the Poker Flat Resea… [+3383 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How did dinosaurs mate, have sex, and reproduce? Fossil evidence offers some clues - Earth.com", "description": "Fossils provide scientists with a few clues about how dinosaurs mated, had sex, and reproduced, but much is still left to the imagination.", "url": "https://www.earth.com/news/how-did-dinosaurs-have-sex-mate-and-reproduce-fossil-evidence-offers-clues/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/24132736/dinosaur-mating-sex_rituals_Brachiosaurus-altithorax_1m.jpg", "publishedAt": "2025-01-25T13:10:13Z", "content": "Dinosaurs left behind fossilized bones and footprints that offer vivid glimpses into their everyday survival. Paleontologists can infer their diets, estimate their sizes, and even figure out how quic… [+5374 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "NASA astronauts want to capture microbes in space - Indian Defence Review", "description": "NASA's upcoming spacewalk could unveil the secrets of microbial life thriving in space. What if these tiny organisms hold clues to life's origins? Discover how their resilience might reshape our understanding of existence beyond Earth.", "url": "https://indiandefencereview.com/nasa-astronauts-want-to-capture-microbes-in-space/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/nasa-microbial20life-spacewalk.jpeg", "publishedAt": "2025-01-25T13:01:00Z", "content": "NASA is gearing up for a thrilling new mission that could shed some light on life beyond our home planet. This upcoming spacewalk, featuring NASA astronauts, will hone in on gathering traces of life … [+3558 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lydia Smith", "title": "Giant phantom jelly: The 33-foot-long ocean giant that has babies out of its mouth - Livescience.com", "description": "Giant phantom jellies were discovered in 1899 and since then have only been spotted around 120 times.", "url": "https://www.livescience.com/animals/jellyfish/giant-phantom-jelly-the-33-foot-long-ocean-giant-that-has-babies-out-of-its-mouth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xqnT3uKYVu95yfAH5eCjuS-1200-80.jpg", "publishedAt": "2025-01-25T13:00:00Z", "content": "Name: Giant phantom jelly (Stygiomedusa gigantea)\r\nWhere it lives: Every ocean except the Arctic Ocean\r\nWhat it eats: Plankton and small fish\r\nWhy it's awesome: Earth's oceans are home to many secret… [+2755 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Quantum physics discovery: Light travels through both space and time - The Brighter Side of News", "description": "Researchers reveal groundbreaking discoveries about light, opening new horizons in telecommunications, computing, and medicine", "url": "https://www.thebrighterside.news/post/quantum-physics-discovery-light-travels-through-both-space-and-time/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/10/light-4-e1737747561168.webp?auto=webp", "publishedAt": "2025-01-25T12:51:00Z", "content": "Physicists from Imperial College London have achieved a groundbreaking milestone in quantum physics by reimagining the classic double-slit experimentthis time in the dimension of time. \r\nLed by Profe… [+6176 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dino Grandoni", "title": "The dodo bird is extinct. This scientist says she can bring it back. - The Washington Post", "description": "The company she works for is betting millions it can realize a once-far-fetched idea of “de-extinction.”", "url": "https://www.washingtonpost.com/climate-environment/2025/01/25/de-extinction-beth-shapiro/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QUW5S2LWSQ4ADB5ULVDSMV3O4Y_size-normalized.JPG&w=1440", "publishedAt": "2025-01-25T11:31:08Z", "content": "DALLAS The place where the dead may be brought back to life is a drab, single-story building in an office park next to a semitruck lot.\r\nInside, between rows of incubators and microscopes, Beth Shapi… [+12460 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "New Evidence Bolsters Theory of Megaflood That Refilled the Mediterranean Millions of Years Ago - Gizmodo", "description": "Researchers identified geological features that point to a single massive flooding event that refilled the Mediterranean Sea 5.33 million years ago", "url": "https://gizmodo.com/new-evidence-bolsters-theory-of-ancient-megaflood-that-refilled-the-mediterranean-millions-of-years-ago-2000553581", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/ridge-shaped-by-megaflood.jpg", "publishedAt": "2025-01-25T11:01:54Z", "content": "Millions of years ago, the Mediterranean Sea evaporated. It may have then been refilled by the largest flooding event ever experienced on Earth.\r\nAn international team of researchers has uncovered ne… [+4095 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Private moon spacecraft just took a breathtaking snapshot of Earth - Mashable", "description": "Not your everyday blue marble.", "url": "https://mashable.com/article/firefly-blue-ghost-moon-spacecraft-images", "urlToImage": "https://helios-i.mashable.com/imagery/articles/03FLGJPWMMOnSrtNvP2Xrpj/hero-image.fill.size_1200x675.v1737738123.jpg", "publishedAt": "2025-01-25T11:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Light-Speed Imaging: A Breakthrough in Edge Detection - SciTechDaily", "description": "Researchers from the University of Amsterdam's Institute of Physics, led by Jorik van de Groep, have developed a groundbreaking method to detect image edges with exceptional speed and minimal energy consumption. Their findings were recently published in ACS P…", "url": "https://scitechdaily.com/light-speed-imaging-a-breakthrough-in-edge-detection/", "urlToImage": "https://scitechdaily.com/images/Photonic-Edge-Detection.jpg", "publishedAt": "2025-01-25T10:37:57Z", "content": "Using a clever device consisting of multiple thin layers, the physicists manage to output the edges of incoming images. Credit: UvA\r\nResearchers from the University of Amsterdam’s Institute of Physic… [+3114 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Solve Long-Standing DNA Machinery Mystery - SciTechDaily", "description": "SMC proteins can reverse direction, reshaping DNA and solving key scientific debates. This discovery could impact research on gene-linked diseases. Scientists from Delft, Vienna, and Lausanne have uncovered that the protein machines responsible for shaping ou…", "url": "https://scitechdaily.com/?p=450717", "urlToImage": "https://scitechdaily.com/images/DNA-Being-Folded-Into-a-Loop-by-an-SMC-Motor-Called-Cohesin-scaled.jpg", "publishedAt": "2025-01-25T09:26:26Z", "content": "The illustration shows DNA being folded into a loop by an SMC motor called cohesin (in purple/blue). The purple part of the motor (with a red/green label) is the protein subunit NIPBL, which acts as … [+4434 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Richard Harth", "title": "Newly discovered microbes in Amazon peatlands could affect global carbon balance - Phys.org", "description": "Complex organisms, thousands of times smaller than a grain of sand, can shape massive ecosystems and influence the fate of Earth's climate, according to a new study.", "url": "https://phys.org/news/2025-01-newly-microbes-amazon-peatlands-affect.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-un.jpg", "publishedAt": "2025-01-25T09:21:46Z", "content": "Complex organisms, thousands of times smaller than a grain of sand, can shape massive ecosystems and influence the fate of Earth's climate, according to a new study.\r\nResearchers from Arizona State U… [+7190 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Bryan Cockfield", "title": "Making The Longest-Distance Radio Contact Possible - Hackaday", "description": "One of the more popular activities in the ham radio world is DXing, which is attempting to communicate with radio stations as far away as possible. There are some feats that will earn some major cr…", "url": "https://hackaday.com/2025/01/25/making-the-longest-distance-radio-contact-possible/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/01/deep-space-main.png", "publishedAt": "2025-01-25T09:00:00Z", "content": "One of the more popular activities in the ham radio world is DXing, which is attempting to communicate with radio stations as far away as possible. There are some feats that will earn some major cred… [+1758 chars]"}, {"source": {"id": null, "name": "The Spokesman-Review"}, "author": "Thomas Clouse", "title": "Star gazers get rare conditions to see several planets at once Saturday: ‘Very, very special’ - The Spokesman Review", "description": "While planets circle the sun in what's called and heliocentric orbit, they rarely fall together in what appears to the human eye as somewhat of line across the visible horizon. Saturday is one of those times.", "url": "https://www.spokesman.com/stories/2025/jan/24/star-gazers-get-rare-conditions-to-see-several-pla/", "urlToImage": "https://thumb.spokesman.com/yCwziVQgwVTAcTlfGsH54Qg_oEc=/1200x630/smart/media.spokesman.com/photos/2025/01/24/679421b8511cc.image.jpg", "publishedAt": "2025-01-25T05:48:31Z", "content": "While planets circle the sun in whats called a heliocentric orbit, they rarely fall together in what appears to the human eye as somewhat of a line across the visible horizon.\r\nSaturday is one of tho… [+3702 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Pandora Dewan", "title": "Science news this week: Interstellar visitors and contagious peeing - Livescience.com", "description": "Jan. 25, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/space/science-news-this-week-interstellar-visitors-and-contagious-peeing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CEvS4VabMdKmgccV4H9avR-1200-80.png", "publishedAt": "2025-01-25T05:00:00Z", "content": "If someone says they need to use the bathroom, does it make you want to go too? \"Contagious peeing\" is a known phenomenon in humans, but new research shows that it happens in chimpanzees too\r\n, sugge… [+6645 chars]"}, {"source": {"id": null, "name": "WEAR"}, "author": "Hannah James", "title": "Thousands of dead fish wash ashore in Milton, raising ecosystem and removal concerns - WEAR", "description": "MILTON, Fla. -- The freezing temperatures have created a scene in a Milton neighborhood. Thousands of dead mullet are washing ashore.", "url": "https://weartv.com/news/local/thousands-of-dead-fish-wash-ashore-in-milton-raising-ecosystem-and-removal-concerns", "urlToImage": "https://weartv.com/resources/media2/16x9/1280/986/center/90/2b7b88b4-b114-423e-bf64-4aa38012f670-Mullet_Massacre2.png", "publishedAt": "2025-01-25T03:31:46Z", "content": "MILTON, Fla. -- The freezing temperatures have created a scene in a Milton neighborhood. Thousands of dead mullet are washing ashore.\r\nHomeowners have several questions. Like, how will this impact th… [+2597 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sheetal Kumari", "title": "Asteroid threat? A giant, 44-foot, house-sized space rock approaching Earth tomorrow; here's what NASA... - Moneycontrol", "description": "NASA's Jet Propulsion Laboratory is tracking asteroid 2024 YY5, approaching Earth on January 26.", "url": "https://www.moneycontrol.com/science/asteroid-threat-a-giant-44-foot-house-sized-space-rock-approaching-earth-tomorrow-here-s-what-nasa-says-article-12918944.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/07/20240725071227_Sushi-94.jpg", "publishedAt": "2025-01-25T03:00:17Z", "content": "NASA's Jet Propulsion Laboratory is tracking asteroid 2024 YY5. The space rock will make a safe approach to Earth soon. Scientists have assured it poses no danger to the planet.\r\nHow close will aster… [+1101 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Bryan Cockfield", "title": "Bouncing Signals Off Of Satellites Other Than The Moon - Hackaday", "description": "The moon is a popular target for ham radio operators to bounce signals since it’s fairly large and follows a predictable path. There are some downsides, though; it’s not always visible …", "url": "https://hackaday.com/2025/01/24/bouncing-signals-off-of-satellites-other-than-the-moon/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/01/satellite-bounce-main.jpg", "publishedAt": "2025-01-25T03:00:00Z", "content": "The moon is a popular target for ham radio operators to bounce signals since it’s fairly large and follows a predictable path. There are some downsides, though; it’s not always visible from the same … [+1817 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Discovers “Blue Lurker” Spinning So Fast, It’s Breaking Astronomers’ Models - SciTechDaily", "description": "A Triple Star System Yields an Unusual Surviving Star Unlike our Sun, which exists alone, at least half of the stars in our galaxy have a companion. This concept was famously depicted in the Star Wars movies, where Luke Skywalker watched two suns set over his…", "url": "https://scitechdaily.com/hubble-discovers-blue-lurker-spinning-so-fast-its-breaking-astronomers-models/", "urlToImage": "https://scitechdaily.com/images/Blue-Lurker-Star-System-scaled.jpg", "publishedAt": "2025-01-25T01:14:47Z", "content": "Discovered in the M67 star cluster, the “blue lurker” captivates astronomers with its quick spin and complex past involving a triple-star system, offering insights into the evolution of stars and the… [+6579 chars]"}, {"source": {"id": null, "name": "Nautil.us"}, "author": "Adam Piore", "title": "How Neanderthals Kept Our Ancestors Warm - Nautilus", "description": "New DNA studies reveal more benefits from our hominin friends", "url": "https://nautil.us/how-neanderthals-kept-our-ancestors-warm-1185278/", "urlToImage": "https://assets.nautil.us/sites/3/nautilus/NZEGjd8d-Piore_HERO.png?auto=compress&fm=png&ixlib=php-3.3.1", "publishedAt": "2025-01-24T23:06:25Z", "content": "Beneath a Medieval castle in Ranis, Germany, a cave sheltered the remains of six humans who died more than 45,000 years ago. Not long ago, scientists sequenced their genomesthe oldest known set of Ho… [+9506 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Hubble snaps another gorgeous image of the Tarantula Nebula - Digital Trends", "description": "A new image from Hubble shows a beautiful patch of the famous Tarantula Nebula.", "url": "https://www.digitaltrends.com/space/hubble-tarantula-nebula-outskirts/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2025/01/hubble-lmc-trantula-potw2503a_jpg_75.jpg?resize=1200%2C630&p=1", "publishedAt": "2025-01-24T22:58:22Z", "content": "This gorgeous new image from the Hubble Space Telescope shows a bustling nearby star forming region called the Tarantula Nebula. Given its name due to its complex, web-like internal structure, this n… [+2795 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Universe's First Stars Flooded The Cosmos With Water, Study Says - ScienceAlert", "description": "Water is the essence of life.", "url": "https://www.sciencealert.com/universes-first-stars-flooded-the-cosmos-with-water-study-says", "urlToImage": "https://www.sciencealert.com/images/2025/01/popIII_stars_water_header.jpg", "publishedAt": "2025-01-24T22:01:18Z", "content": "Water is the essence of life. Every living thing on Earth contains water within it. The Earth is rich with life because it is rich with water.\r\nThis fundamental connection between water and life is p… [+3143 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Continent-sized 'islands' found inside Earth are 100 times taller than Mount Everest - Earth.com", "description": "Deep within Earth’s mantle lie two enormous regions, often referred to as \"islands,\" which are the size of continents.", "url": "https://www.earth.com/news/continent-sized-islands-llsvp-found-inside-earth-are-100-times-taller-than-mount-everest/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/24141452/earth_interior-anatomy_LLSVPs_continents-islands-mantle_1.jpg", "publishedAt": "2025-01-24T21:20:05Z", "content": "Scientists have discovered two continent-sized regions hidden deep within Earth’s mantle, referred to in a recent study as “islands.” Research from Utrecht University reveals that these regions are n… [+5234 chars]"}]}