{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "A half-ton metal ring fell from the sky in Kenya. The country's space agency confirmed what many suspected - Indian Defence Review", "description": "A metallic ring weighing over 1,100 pounds crashed near Nairobi, sparking wild theories about its origin. With millions of pieces of space junk orbiting Earth, this incident raises urgent questions about our safety. What does it mean for the future?", "url": "https://indiandefencereview.com/a-half-ton-metal-ring-fell-from-the-sky-in-kenya-the-countrys-space-agency-confirmed-what-many-suspected/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/space20debris-kenya20space20agency-environmental20impact.png", "publishedAt": "2025-01-22T13:30:00Z", "content": "On December 30, something pretty wild happened in a little village southeast of Nairobi, Kenya. A big metallic ring unexpectedly dropped into a local field, grabbing everyone’s attention and sparking… [+3187 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Ashley Harrell", "title": "Scientists just found 21 trillion gallons of water north of the Calif. border - SFGATE", "description": "North of the California border, scientists just found 21 trillion gallons of water hiding in the cracks of volcanic rock.", "url": "https://www.sfgate.com/california/article/scientists-find-water-cascade-range-california-20047677.php", "urlToImage": "https://s.hdnux.com/photos/01/46/57/76/26935230/5/rawImage.jpg", "publishedAt": "2025-01-22T12:11:57Z", "content": "While studying the volcanic landscape of the Cascade Range north of the California border, Oregon scientists recently discovered something they did not expect: an aquifer containing much more water t… [+4026 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Hubble tension is now in our cosmic backyard, sending cosmology into crisis - Space.com", "description": "\"The Hubble tension is now a Hubble crisis.\"", "url": "https://www.space.com/space-exploration/hubble-space-telescope/hubble-tension-is-now-in-our-cosmic-backyard-sending-cosmology-into-crisis", "urlToImage": "https://cdn.mos.cms.futurecdn.net/L7Ss5RzgGEEvJNbbvfM8gR-1200-80.jpg", "publishedAt": "2025-01-22T11:00:00Z", "content": "The mystery of the Hubble tension has deepened with the startling finding that the Coma Cluster of galaxies is 38 million light-years closer than it should be.\r\nIn recent years, trouble has been brew… [+10363 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Secrets of Andromeda Revealed in Hubble’s Epic 2.5 Billion Pixel Image - SciTechDaily", "description": "Panorama of Nearest Galaxy Unveils Hundreds of Millions of Stars On a crisp, clear autumn night, you can see the most distant object visible to the naked eye — the stunning Andromeda Galaxy, our Milky Way’s closest major neighbor. Located just northeast of th…", "url": "https://scitechdaily.com/secrets-of-andromeda-revealed-in-hubbles-epic-2-5-billion-pixel-image/", "urlToImage": "https://scitechdaily.com/images/Hubble-M31-PHAT-PHAST-Mosaic-scaled.jpg", "publishedAt": "2025-01-22T09:16:40Z", "content": "This is the largest photomosaic ever assembled from Hubble Space Telescope observations. It is a panoramic view of the neighboring Andromeda galaxy, located 2.5 million light-years away. It took over… [+10819 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Frontiers", "title": "Curious blue rings in trees and shrubs reveal cold summers of the past—potentially caused by volcanic eruptions - Phys.org", "description": "Trees need a certain number of warm days in their growing seasons to grow properly; otherwise, the cell walls of new growth don't lignify properly, creating blue rings that appear when wood samples are dyed.", "url": "https://phys.org/news/2025-01-curious-blue-trees-shrubs-reveal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/curious-blue-rings-in.jpg", "publishedAt": "2025-01-22T05:00:01Z", "content": "Trees need a certain number of warm days in their growing seasons to grow properly; otherwise, the cell walls of new growth don't lignify properly, creating blue rings that appear when wood samples a… [+5233 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Curiosity Finds Evidence of Open Water on Ancient Mars - ScienceAlert", "description": "NASA's Curiosity Rover has been exploring Mars since 2012 and more recently has found evidence of ice-free ancient ponds and lakes on the surface.", "url": "https://www.sciencealert.com/curiosity-finds-evidence-of-open-water-on-ancient-mars", "urlToImage": "https://www.sciencealert.com/images/2025/01/WaveRipplesOnMarsSurface.jpg", "publishedAt": "2025-01-22T04:09:53Z", "content": "NASA's Curiosity Rover has been exploring Mars since 2012 and more recently has found evidence of ice-free ancient ponds and lakes on the surface. The rover found small undulations like those seen in… [+4160 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Finland signs Artemis Accords - SpaceNews", "description": "Finland signed the Artemis Accords Jan. 21, the first country to do so this year amid questions about the future of the agreement in the new administration.", "url": "http://spacenews.com/finland-signs-artemis-accords/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDFcL2ZpbmxhbmQtYWFzaWduaW5nLTEwMjR4NjgzLmpwZWciLCJ0eHQiOiJGaW5sYW5kIHNpZ25zIEFydGVtaXMgQWNjb3JkcyIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.GlHnuf-6UQlulM1SzScYjohVYs8Y6TLHjwBB1fMn9e8MQ", "publishedAt": "2025-01-22T00:40:54Z", "content": "WASHINGTON Finland signed the Artemis Accords Jan. 21, the first country to do so this year amid questions about the future of the agreement in the new Trump administration.\r\nNASA said in a statement… [+3571 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Webb finds hidden carbon factories in these massive dust rings - Earth.com", "description": "Two stars in Wolf-Rayet 140 collide, forming carbon-rich dust. Webb captured 17 expanding dust shells, revealing life-building secrets.", "url": "https://www.earth.com/news/webb-telescope-directly-observes-carbon-factories-milky-way-galaxy-wolf-rayet-140/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/15063143/Wolf-Rayet-140_dust-shells_Webb_NASA_1.jpg", "publishedAt": "2025-01-21T23:42:29Z", "content": "Astronomers have long sought to find the origin of the building blocks of life, and how elements like carbon, which are essential for life, spread across the universe. \r\nRecent findings using data fr… [+4779 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Scientists look back in time to reconstruct explosions in Earth's atmosphere - Space.com", "description": "Although they don't impact the surface directly, historical evidence and simulations suggest airbursts can pack a punch.", "url": "https://www.space.com/the-universe/earth/earths-elusive-ignorosphere-could-shed-new-light-on-auroras", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Yv8rY6pYeXqRf6u3578vf4-1200-80.jpg", "publishedAt": "2025-01-21T23:00:00Z", "content": "Japanese scientists have created the first-ever long-term dataset about Earth's entire atmosphere, stretching all the way to space.\r\nThey hope the project will help shed light on some little-explored… [+5890 chars]"}, {"source": {"id": null, "name": "Nautil.us"}, "author": "David P. Barash", "title": "10 Misconceptions About Evolution - Nautilus", "description": "An evolutionary biologist clears up common myths", "url": "https://nautil.us/10-misconceptions-about-evolution-1183733/", "urlToImage": "https://assets.nautil.us/sites/3/nautilus/5iszcMUO-Barash_HERO.png?auto=compress&fm=png&ixlib=php-3.3.1", "publishedAt": "2025-01-21T22:16:34Z", "content": "When Darwin published On the Origin of Species 166 years ago, there were, naturally, misunderstandings. In an 1860 review, Richard Owen, a leading Victorian scientist, rhetorically asked whether evol… [+18632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bio-Engineered “Super Glue” Sets New Strength Record – Could Transform $50 Billion Industry - SciTechDaily", "description": "Researchers have created an adhesive polymer that surpasses the strength of existing commercial options while offering the added benefits of being biodegradable, customizable, and reusable. Researchers at Colorado State University and collaborators have creat…", "url": "https://scitechdaily.com/bio-engineered-super-glue-sets-new-strength-record-could-transform-50-billion-industry/", "urlToImage": "https://scitechdaily.com/images/Super-Glue.jpg", "publishedAt": "2025-01-21T22:08:11Z", "content": "CSU researchers created a biodegradable adhesive from P3HB that outperforms petroleum-based options. Strong, reusable, and eco-friendly, it decomposes in diverse environments. The team is working on … [+5151 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Main cause of sunburn is finally identified, and it's time to rewrite the textbooks - Earth.com", "description": "New research reveals that sunburn may be caused by RNA damage, not DNA, challenging long-held beliefs about UV exposure", "url": "https://www.earth.com/news/main-cause-of-sunburn-finally-identified-is-rna-damage-not-dna/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/21142716/sunburn-cause_rna-damage_not-dna-damage_1m.jpg", "publishedAt": "2025-01-21T21:40:41Z", "content": "Sunburn is painful skin damage that we’ve all experienced after spending a bit too much time outdoors without protection from UV rays. Whether it’s from a lazy beach day or an exhilarating hike, the … [+4976 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Ottawa", "title": "Harnessing electromagnetic waves and quantum materials to improve wireless communication technologies - Phys.org", "description": "A team of researchers from the University of Ottawa has developed innovative methods to enhance frequency conversion of terahertz (THz) waves in graphene-based structures, unlocking new potential for faster, more efficient technologies in wireless communicati…", "url": "https://phys.org/news/2025-01-harnessing-electromagnetic-quantum-materials-wireless.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/harnessing-electromagn.jpg", "publishedAt": "2025-01-21T21:27:04Z", "content": "A team of researchers from the University of Ottawa has developed innovative methods to enhance frequency conversion of terahertz (THz) waves in graphene-based structures, unlocking new potential for… [+3767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Marcus Wolf", "title": "Extreme climate pushed thousands of lakes in West Greenland 'across a tipping point,' study finds - Phys.org", "description": "West Greenland is home to tens of thousands of blue lakes that provide residents with drinking water and sequester carbon from the atmosphere. Yet after two months of record heat and precipitation in fall 2022, an estimated 7,500 lakes turned brown, began emi…", "url": "https://phys.org/news/2025-01-extreme-climate-thousands-lakes-west.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/extreme-climate-pushed.jpg", "publishedAt": "2025-01-21T20:25:05Z", "content": "West Greenland is home to tens of thousands of blue lakes that provide residents with drinking water and sequester carbon from the atmosphere. Yet after two months of record heat and precipitation in… [+6025 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Bill Nelson steps down as NASA chief as Trump begins 2nd term - Space.com", "description": "The White House has appointed Janet Petro as acting NASA administrator.", "url": "https://www.space.com/space-exploration/bill-nelson-steps-down-as-nasa-chief-as-trump-begins-2nd-term", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MCErTkFj9Fre5staNDsBuM-1200-80.jpg", "publishedAt": "2025-01-21T20:00:00Z", "content": "Bill Nelson has stepped down as NASA administrator, ending a half-century of public service.\r\nNelson and NASA Deputy Administrator Pam Melroy left the agency on Monday (Jan. 20), the day that Donald … [+3831 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Uncover Colossal Radio Galaxy 32 Times the Size of the Milky Way - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a \"troublesome\" radio galaxy named Inkathazo, 32 times the size of the Milky Way. Located in a dense galaxy cluster, this colossal structure challenges existing theories about how giant radio galaxies form and evolve. What makes In…", "url": "https://dailygalaxy.com/2025/01/radio-galaxy-32-times-size-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Astronomers-Uncover-Colossal-Radio-Galaxy-32-Times-the-Size-of-the-Milky-Way.jpg", "publishedAt": "2025-01-21T19:30:00Z", "content": "Astronomers have identified a colossal giant radio galaxy (GRG) stretching 3.3 million light-years across32 times the size of our Milky Way. Named Inkathazo, which means “trouble” in isiZulu and isiX… [+5700 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Comet C/2024 G3 ATLAS' 'near-death encounter' with the sun may have blown it apart, new photos suggest - Livescience.com", "description": "New photos of comet C/2024 G3 (ATLAS) suggest that it could be disintegrating due to \"thermal stress\" from its recent slingshot around the sun. However, its fate is still unclear.", "url": "https://www.livescience.com/space/comets/comet-c-2024-g3-atlas-near-death-encounter-with-the-sun-may-have-blown-it-apart-new-photos-suggest", "urlToImage": "https://cdn.mos.cms.futurecdn.net/emifRNLCxGx2mUKPW6uY3S-1200-80.jpg", "publishedAt": "2025-01-21T19:02:23Z", "content": "The \"once-in-a-lifetime\" comet that recently lit up night skies for the first time in millennia might be falling apart after being singed as it slingshotted around the sun, new photos suggest. Howeve… [+3911 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mars’ Greatest Mystery Solved: Scientists Uncover the Forces Behind Its Divided Terrain - The Daily Galaxy --Great Discoveries Channel", "description": "Mars’ hemispheres hold a geological mystery that has baffled scientists for decades: Why does the southern terrain rise dramatically above the smooth northern plains? Using seismic data from NASA’s InSight lander, researchers may have finally solved the riddl…", "url": "https://dailygalaxy.com/2025/01/mars-greatest-mystery-solved-scientists/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Mars-Greatest-Mystery-Solved-Scientists-Uncover-the-Forces-Behind-Its-Divided-Terrain.jpg", "publishedAt": "2025-01-21T19:00:00Z", "content": "Mars, the enigmatic Red Planet, has long puzzled scientists with a dramatic geological contrast between its hemispheres, known as the Martian dichotomy. The planet’s southern highlands tower five to … [+5066 chars]"}, {"source": {"id": null, "name": "Colossal"}, "author": "Kate Mothes", "title": "Uncanny Objects by Joyce Lin Blur Distinctions Between Reality and the Fantastical - Colossal", "description": "Seemingly sliced from a single tree, Joyce Lin's sculptures examine themes of interconnectedness and the Anthropocene.", "url": "https://www.thisiscolossal.com/2025/01/joyce-lin-sculptures/", "urlToImage": "https://www.thisiscolossal.com/wp-content/uploads/2025/01/lin-8.jpg", "publishedAt": "2025-01-21T19:00:00Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Nuclear Thermal Propulsion Reactor Fuel That Could Take Humans To Mars Tested At NASA Facility - IFLScience", "description": "It could significantly cut the amount of time it would take to reach the Red Planet.", "url": "https://www.iflscience.com/nuclear-thermal-propulsion-reactor-fuel-that-could-take-humans-to-mars-tested-at-nasa-facility-77719", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77719/aImg/81609/mars-propulsion-meta.png", "publishedAt": "2025-01-21T18:31:41Z", "content": "A new type of nuclear thermal propulsion reactor fuel has been successfully tested at NASAs Marshall Space Flight Center, with hopes that the fuel could take humans to Mars in the not-too-distant fut… [+4108 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "AI model simulates 500 million years of evolution to generate a new fluorescent protein - Phys.org", "description": "A team of AI researchers, biologists and evolutionary specialists at EvolutionaryScale and the Arc Institute, both in the U.S., has designed and built an AI model capable of generating the code to synthesize novel proteins. In their paper published in the jou…", "url": "https://phys.org/news/2025-01-ai-simulates-million-years-evolution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/ai-model-generates-cod.jpg", "publishedAt": "2025-01-21T18:29:16Z", "content": "A team of AI researchers, biologists and evolutionary specialists at EvolutionaryScale and the Arc Institute, both in the U.S., has designed and built an AI model capable of generating the code to sy… [+2709 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Allan Rose Hill", "title": "Our early ancestors weren't big meat eaters after all - Boing Boing", "description": "Australopithecus africanus—a bipedal primate that lived between 3.2 and 2 million years ago—were primarily vegetarians.", "url": "https://boingboing.net/2025/01/21/our-early-ancestors-werent-big-meat-eaters-after-all.html", "urlToImage": "https://boingboing.net/wp-content/uploads/2025/01/shutterstock_726532726-scaled.jpg", "publishedAt": "2025-01-21T18:14:37Z", "content": "The earliest human ancestors weren't big meat eaters, according to new scientific research on their fossilized remains. Australopithecus africanusa bipedal primate that lived between 3.2 and 2 millio… [+1219 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Andrey Feldman", "title": "Cosmic voids may explain the universe's acceleration without dark energy - Livescience.com", "description": "New research suggests that dark energy isn't needed to explain the acceleration in the expansion of the universe — instead suggesting giant voids in space are creating an illusion.", "url": "https://www.livescience.com/physics-mathematics/dark-energy/cosmic-voids-may-explain-the-universes-acceleration-without-dark-energy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/N5prfkoB4ckrKrfjcriCCU-1200-80.jpg", "publishedAt": "2025-01-21T17:57:04Z", "content": "Dark energy, the mysterious force that's driving the accelerating expansion of the universe, may not actually exist, scientists say. Their research has brought into question one of the cornerstones o… [+5980 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kerry Breen", "title": "\"Supergiant\" sea bug named after Darth Vader found in South China Sea - Yahoo! Voices", "description": "Researchers discovered a new species of deep-sea crustacean while researching culinary patterns in Vietnam.", "url": "https://www.cbsnews.com/news/darth-vader-supergiant-sea-bug-found-south-china-sea/?ftag=YHF4eb9d17", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/9w5Ql4E96Dzci63iJOv.ug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01MjQ-/https://media.zenfs.com/en/cbs_news_897/c2976121cf5a89467873672420b2f055", "publishedAt": "2025-01-21T17:46:34Z", "content": "Researchers studying crustaceans in Vietnam have identified a new \"supergiant\" sea bug species that bears a surprising resemblance to a classic movie villain.\r\nDeep-sea sea bugs, or the Bathynomus sp… [+1867 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "How to get a perfect salt ring deposit in your pasta pot - Ars Technica", "description": "Particle diameter, height from which they fall through water, and particle volume are key factors.", "url": "https://arstechnica.com/science/2025/01/how-to-get-a-perfect-salt-ring-deposit-in-your-pasta-pot/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/pasta-ring-1152x648.jpg", "publishedAt": "2025-01-21T17:41:12Z", "content": null}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Global Climate Hope: Earth’s Critical Ocean Current Remains Stable After 60 Years - Indian Defence Review", "description": "Defying decades of dire predictions, the Atlantic Meridional Overturning Circulation (AMOC), a critical driver of Earth’s climate, has remained stable for over 60 years. But as global warming accelerates, can this vital system withstand the mounting pressures…", "url": "https://indiandefencereview.com/climate-hope-earths-ocean-current-stable/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Global-Climate-Hope-Vital-Ocean-Circulation-System-Defies-Predictions-of-Collapse.jpg", "publishedAt": "2025-01-21T17:22:53Z", "content": "The Atlantic Meridional Overturning Circulation (AMOC), a critical ocean current system that redistributes heat and regulates Earths climate, has remained remarkably stable for the past six decades. … [+5463 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Southampton", "title": "New evidence suggests megaflood refilled the Mediterranean Sea 5 million years ago - Phys.org", "description": "A study provides compelling new evidence that a colossal \"megaflood\" refilled the Mediterranean Sea, ending a period during which the Mediterranean was a vast expanse of salt flats. The research suggests the Zanclean Megaflood ended the Messinian Salinity Cri…", "url": "https://phys.org/news/2025-01-evidence-megaflood-refilled-mediterranean-sea.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-evidence-suggests.jpg", "publishedAt": "2025-01-21T17:17:04Z", "content": "A study provides compelling new evidence that a colossal \"megaflood\" refilled the Mediterranean Sea, ending a period during which the Mediterranean was a vast expanse of salt flats. The research sugg… [+4638 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Matthew Cappucci", "title": "Look up through the month for a dazzling parade of planets - The Washington Post", "description": "Four of the planets will be bright, but you might spot a few others with a telescope.", "url": "https://www.washingtonpost.com/weather/2025/01/21/how-to-view-planets-align-saturn-mars-jupiter-venus/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QFWLDSCW5FFYHJPGWSQPNLBR2M_size-normalized.jpg&w=1440", "publishedAt": "2025-01-21T16:41:42Z", "content": "A parade of planets will be visible to skywatchers around the globe through the rest of this month and into February.\r\nAt least four planets Venus, Jupiter, Mars and Saturn should be visible with the… [+2768 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mysterious ‘Sunken Worlds’ Discovered Deep in Earth’s Mantle Defy Scientific Explanation - Indian Defence Review", "description": "Deep within Earth's mantle, scientists have uncovered mysterious structures in places they shouldn’t exist. These “sunken worlds,” revealed through cutting-edge imaging, may be remnants of ancient crust or entirely new formations. What secrets do they hold ab…", "url": "https://indiandefencereview.com/mysterious-sunken-worlds-in-earths-mantle/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Mysterious-Sunken-Worlds-Discovered-Deep-in-Earths-Mantle-Defy-Scientific-Explanation.jpg", "publishedAt": "2025-01-21T16:30:00Z", "content": "In a discovery that could reshape our understanding of Earth’s interior, scientists have identified enigmatic structures deep within the planet’s mantle. Described as sunken worlds, these anomalies d… [+4572 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": "Yahya Chaudhry", "title": "Researchers make leap in quantum computing - Harvard Gazette", "description": "Breakthrough using ultra-cold polar molecules as qubits may help make super-high-speed experimental technology even faster.", "url": "https://news.harvard.edu/gazette/story/2025/01/researchers-make-leap-in-quantum-computing-molecules/", "urlToImage": "https://news.harvard.edu/wp-content/uploads/2025/01/011525_Kang_Kuen_Ni_Quantum_123.jpg", "publishedAt": "2025-01-21T16:29:14Z", "content": "Molecules havent been used in quantum computing, even though they have the potential to make the ultra-high-speed experimental technology even faster. Their rich internal structures were seen as too … [+5166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Earth’s magnetic north pole is on the move, and scientists just updated its position - CNN", "description": "Your navigation system just got a critical update, one that happens periodically because Earth’s magnetic north pole keeps moving. Here’s what to know.", "url": "https://www.cnn.com/2025/01/21/science/magnetic-north-pole-new-position/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gurfbgsnorthpoleglobe-20241213t092514.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-21T16:22:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nIf you are using your smartphone to navigate, your sys… [+7113 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carolyn Collins Petersen", "title": "Black holes are spinning faster than expected, researchers find - Phys.org", "description": "There's a universe full of black holes out there, spinning merrily away—some fast, others more slowly. A recent survey of supermassive black holes reveals that their spin rates reveal something about their formation history.", "url": "https://phys.org/news/2025-01-black-holes-faster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/black-holes-are-spinni-2.jpg", "publishedAt": "2025-01-21T16:01:08Z", "content": "There's a universe full of black holes out there, spinning merrily awaysome fast, others more slowly. A recent survey of supermassive black holes reveals that their spin rates reveal something about … [+5859 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Space Signal Traced Across the Universe to an Ancient Dead Galaxy - SciTechDaily", "description": "Astronomers have traced a mysterious fast radio burst to an unexpected place — an ancient, massive galaxy far removed from active star formation. This revelation shakes up the conventional wisdom that such cosmic phenomena exclusively arise from younger, star…", "url": "https://scitechdaily.com/mysterious-space-signal-traced-across-the-universe-to-an-ancient-dead-galaxy/", "urlToImage": "https://scitechdaily.com/images/Clear-FRB-CHIME.jpg", "publishedAt": "2025-01-21T16:00:01Z", "content": "Discovering a fast radio burst in an old, distant galaxy challenges the belief that these events are exclusive to young, vibrant galaxies, suggesting a deeper, cosmic puzzle about their true origins … [+8308 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mysterious Red Dots in the Sky May Point to the Birth of the Universe’s First Black Holes - Indian Defence Review", "description": "NASA’s James Webb Space Telescope has uncovered mysterious \"little red dots\" scattered across the early universe. Could these enigmatic objects, likely harboring growing black holes, hold the key to understanding the infancy of the cosmos? Astronomers are rac…", "url": "https://indiandefencereview.com/mysterious-red-dots-birth-black-holes/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Mysterious-Red-Dots-in-the-Sky-May-Point-to-the-Birth-of-the-Universes-First-Black-Holes.jpg", "publishedAt": "2025-01-21T16:00:00Z", "content": "Astronomers have uncovered a mysterious population of celestial objects in the early universe, nicknamed little red dots (LRDs), through the groundbreaking observations of NASAs James Webb Space Tele… [+4711 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Seville", "title": "SMART: One step closer to nuclear fusion with its first plasma - Phys.org", "description": "In a pioneering approach to achieve fusion energy, the SMART device has successfully generated its first tokamak plasma. This step brings the international fusion community closer to achieving sustainable, clean, and virtually limitless energy through control…", "url": "https://phys.org/news/2025-01-smart-closer-nuclear-fusion-plasma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/smart-one-step-closer.jpg", "publishedAt": "2025-01-21T15:23:25Z", "content": "In a pioneering approach to achieve fusion energy, the SMART device has successfully generated its first tokamak plasma. This step brings the international fusion community closer to achieving sustai… [+3480 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "15-million-year-old insects stun scientists with their unusual traits - Earth.com", "description": "Ancient New Zealand insect fossils reveal new genus of whitefly and first psyllid wing, enriching knowledge of Miocene biodiversity.", "url": "https://www.earth.com/news/ancient-insects-fossils-whitefly-stun-scientists-with-their-unusual-traits/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/19102924/15-million-year-old-insect-unusual-traits-discovery.jpg", "publishedAt": "2025-01-21T15:22:06Z", "content": "Miocene sediments in parts of New Zealand have always hinted at a lively past. Now, new finds in the Hindon Maar Complex suggest that ancient insects may have been more varied than once imagined. \r\nA… [+5651 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Most accurate optical atomic clock ever made will redefine the meaning of a 'second' - Earth.com", "description": "Scientists developed a highly accurate optical ion clock, improving time measurement precision by 1,000 times.", "url": "https://www.earth.com/news/most-accurate-optical-atomic-clock-ever-made-will-redefine-the-meaning-of-a-second/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/21080656/optical-clock_atomic-clock_most-accurate_1m.jpg", "publishedAt": "2025-01-21T15:07:03Z", "content": "Timekeeping has always been fundamental to human civilization. From ancient sundials to mechanical clocks and modern atomic optical timekeepers, each innovation has brought greater precision.\r\nNow, a… [+4988 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Matt Morris", "title": "Vortex Solo R/T 8x36 monocular - Space.com", "description": "The Vortex Solo R/T 8x36 monocular is designed primarily as a ranging reticle, but we wanted to see whether it could also be used for birding, outdoor pursuits and basic astronomy.", "url": "https://www.space.com/stargazing/astronomy-kit/vortex-solo-rt-8x36-monocular-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/beinDrWyS8bF2Xd5rtBxwi-1200-80.jpg", "publishedAt": "2025-01-21T15:00:00Z", "content": "As mentioned, the Vortex Solo R/T 8x36 is predominantly a ranging reticle with silhouettes to help with range adjustments. This did not get in the way during our test; in fact, the ability to work ou… [+7051 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "First-of-its-kind video shows meteor striking the Earth at 37,000 mph - BGR", "description": "For the first time, someone has captured a meteor strike and the sound of its crash on video. Watch it for yourself!", "url": "https://bgr.com/science/first-of-its-kind-video-shows-meteor-striking-the-earth-at-37000-mph/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/12/meteor-comet-asteroid-above-earth.jpg?quality=82&strip=all", "publishedAt": "2025-01-21T14:53:00Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists discover the speed at which the brain processes information - Earth.com", "description": "Scientists discover the surprising limits of the human brain's processing speed at 10 bits per second, despite the immense intake of data.", "url": "https://www.earth.com/news/scientists-discover-the-speed-at-which-the-brain-processes-information/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/19083202/brain-processing-speed-discovery-surprises.jpg", "publishedAt": "2025-01-21T14:42:02Z", "content": "Human behavior may appear fluid and fast. Typing away at a keyboard or zipping through a conversation can sometimes feel like lightning in action. Yet researchers suggest that our actual rate at whic… [+4632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Readily-Available Dietary Supplement Could Help Treat Liver Cancer - SciTechDaily", "description": "Salk scientists have found that eliminating the bile acid-producing protein BAAT and supplementing with the bile acid UDCA can regulate tumor growth in mice with liver cancer. This discovery suggests that UDCA dietary supplements could offer a fast and effect…", "url": "https://scitechdaily.com/scientists-discover-readily-available-dietary-supplement-could-help-treat-liver-cancer/", "urlToImage": "https://scitechdaily.com/images/Human-Liver.Pain-Disease.jpg", "publishedAt": "2025-01-21T14:41:03Z", "content": "Salk Institute researchers found that regulating bile acids—specifically reducing harmful ones and increasing UDCA—can enhance T cell function and potentially make immunotherapy more effective for li… [+8547 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Seven new dark comets discovered in our solar system - Earth.com", "description": "Michigan State University and NASA researchers discover seven dark comets that reveal new solar system secrets.", "url": "https://www.earth.com/news/seven-new-dark-comets-discovered-in-our-solar-system/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/19035421/michigan-state-nasa-discovery-seven-dark-comets-solar-system.jpg", "publishedAt": "2025-01-21T14:27:01Z", "content": "Dark comets have become a buzzworthy subject among astronomers since researchers announced the discovery of seven additional examples of these mysterious objects.\r\nIn direct observations, they seem t… [+5189 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Richard Pallardy", "title": "Scientists discover rare venom-spraying scorpion in Columbia - Livescience.com", "description": "Newly described scorpion can spray and inject its venom — the first South American species known to do this.", "url": "https://www.livescience.com/animals/arachnids/scientists-discover-rare-venom-spraying-scorpion-in-columbia", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iyWceBDVcBH3DmcDe4bDcJ-1200-80.jpg", "publishedAt": "2025-01-21T12:09:37Z", "content": "A scientist has discovered the first species of South American scorpion that sprays its venom — a behavior previously only observed in two genera of scorpions found in North America and Africa.\r\nScor… [+4664 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Newly fabricated crystals control interactions between high-frequency phonons and single quantum systems - Phys.org", "description": "Phonons, the quantum mechanical vibrations of atoms in solids, are often sources of noise in solid-state quantum systems, including quantum technologies, which can lead to decoherence and thus adversely impact their performance.", "url": "https://phys.org/news/2025-01-newly-fabricated-crystals-interactions-high.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/using-diamond-phononic.jpg", "publishedAt": "2025-01-21T12:00:04Z", "content": "Phonons, the quantum mechanical vibrations of atoms in solids, are often sources of noise in solid-state quantum systems, including quantum technologies, which can lead to decoherence and thus advers… [+3866 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Next Solar Superstorm Might Leave the Planet in Darkness: Experts Sound the Alarm - The Daily Galaxy --Great Discoveries Channel", "description": "A massive solar storm could be brewing, with the potential to wreak havoc on Earth’s power grids, satellites, and communication systems. While the skies light up in stunning displays, the unseen danger is far more chilling.", "url": "https://dailygalaxy.com/2025/01/next-solar-superstorm-might-leave-the-planet-in-darkness-experts-sound-the-alarm/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Solar-Superstorm-.jpg", "publishedAt": "2025-01-21T12:00:00Z", "content": "The increasing interconnectedness of modern technology amplifies the dangers posed by solar storms. Global economies rely on real-time communication networks, financial systems, and logistics chains … [+4488 chars]"}, {"source": {"id": null, "name": "WyoFile"}, "author": "Katie Klingsporn", "title": "Meet North America’s oldest dino: Found in Wyoming, named in Shoshone language - WyoFile", "description": "Ancient fossils found near Dubois have scientists rethinking the lifespan of reptiles — and how to include Native communities in paleontology.", "url": "http://wyofile.com/meet-north-americas-oldest-dino-found-in-wyoming-named-in-eastern-shoshone/", "urlToImage": "https://wyofile.com/wp-content/uploads/2025/01/Geology_Museum_Lovelace2024-06-03JM_2650.jpg", "publishedAt": "2025-01-21T11:25:00Z", "content": "On a tract of public land near Dubois, an extrusion of very old rock known as the lower Popo Agie Formation peeks out of a hillside. To the unskilled eye, it just looks like a patch of pinkish-red ro… [+7239 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Towards low-cost missions to Mars - European Space Agency", "description": "Two decades after Mars Express, ESA is returning to small-scale missions aimed at exploring the Red Planet. With a completely different landscape of technologies available this time around, new opportunities for interplanetary missions open up. As part of ESA…", "url": "https://www.esa.int/Enabling_Support/Preparing_for_the_Future/Discovery_and_Preparation/Towards_low-cost_missions_to_Mars", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/01/lightship_esa_s_martian_tug/26543920-1-eng-GB/LightShip_ESA_s_martian_tug_pillars.jpg", "publishedAt": "2025-01-21T11:15:45Z", "content": "Enabling &amp; Support21/01/20251322 views28 likes\r\nTwo decades after Mars Express, ESA is returning to small-scale missions aimed at exploring the Red Planet. With a completely different landscape o… [+2794 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China explores using orbiting lasers to power spacecraft on the moon - SpaceNews", "description": "China could look to laser power transmission from lunar orbit to supply spacecraft on the moon and solve one of the big challenges for its lunar exploration plans.", "url": "http://spacenews.com/china-explores-using-orbiting-lasers-to-power-to-spacecraft-on-the-moon/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyMFwvMDFcL2NoYW5nZTUtZmFyc2lkZS1pbWFnZS5qcGciLCJ0eHQiOiJDaGluYSBleHBsb3JlcyB1c2luZyBvcmJpdGluZyBsYXNlcnMgdG8gcG93ZXIgc3BhY2VjcmFmdCBvbiB0aGUgbW9vbiIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.6k1rthTz3eiHIB2IVHvO75qy_dFt3lkivvpU2zmrlX8MQ", "publishedAt": "2025-01-21T10:54:56Z", "content": "HELSINKI China could look to laser power transmission from lunar orbit to supply spacecraft on the moon and solve one of the big challenges for its lunar exploration plans.\r\nResearchers have assessed… [+3848 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "New science facilities are needed to keep America great - Big Think", "description": "New telescopes, radio dishes, and gravitational wave detectors are needed for next-generation science. Will the USA lead the way?", "url": "https://bigthink.com/starts-with-a-bang/new-science-facilities-keep-america-great/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/01/ALMA-big-e1737413498439.jpg?w=907&h=510&crop=1", "publishedAt": "2025-01-21T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 21 Starlink satellites to orbit on 1st flight since Starship explosion (video) - Space.com", "description": "Liftoff occurred at 12:24 a.m. ET on Tuesday (Jan. 21).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launching-21-starlink-satellites-early-jan-21-on-1st-flight-since-starship-explosion", "urlToImage": "https://cdn.mos.cms.futurecdn.net/F3K8zUBqFEKLgabKLMc2Ag-1200-80.jpg", "publishedAt": "2025-01-21T06:15:32Z", "content": "SpaceX launched another batch of its Starlink internet satellites early this morning (Jan. 21), five days after a test flight of the company's Starship megarocket ended in an explosion.\r\nA Falcon 9 r… [+1805 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "A Giant Object May Have Warped Our Solar System, Study Says - Yahoo! Voices", "description": "This could explain a lot.", "url": "https://www.sciencealert.com/a-giant-object-may-have-warped-our-solar-system-study-says", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/1865735933eaeb84d0faba6756fbe12d", "publishedAt": "2025-01-21T05:45:00Z", "content": "If you were to perfectly follow the steps in An Idiot's Guide to Making a Solar System, you should eventually find yourself with a star surrounded by a flat disc of planetary material orbiting in rel… [+3348 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Anne Trafton | MIT News", "title": "Modeling complex behavior with a simple organism - MIT News", "description": "MIT Associate Professor Steven Flavell uses the worm C. elegans as a model to study behaviors such as feeding and navigation, in hopes of shedding light on how these behaviors are controlled in other animals, including humans.", "url": "https://news.mit.edu/2025/modeling-complex-behavior-steven-flavell-0121", "urlToImage": "https://news.mit.edu/sites/default/files/images/202501/MIT-steven-flavell-01-press.jpg", "publishedAt": "2025-01-21T05:00:00Z", "content": "The roundworm C. elegans is a simple animal whose nervous system has exactly 302 neurons. Each of the connections between those neurons has been comprehensively mapped, allowing researchers to study … [+7810 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Scientists Just Made a Material Magnetic Using Light - SciTechDaily", "description": "MIT physicists have discovered a new magnetic state in an antiferromagnetic material using terahertz light, opening doors to revolutionary memory technologies resistant to magnetic interference. By fine-tuning light vibrations to the atomic level, they have c…", "url": "https://scitechdaily.com/mit-scientists-just-made-a-material-magnetic-using-light/", "urlToImage": "https://scitechdaily.com/images/Physics-Light-Magnetism-Art.jpg", "publishedAt": "2025-01-21T04:05:25Z", "content": "Using terahertz light, MIT researchers have induced a durable magnetic state in an antiferromagnetic material, suggesting potential breakthroughs in magnetic storage that resists external disturbance… [+8747 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Supermassive Black Hole Caught Doing Something Never Seen Before - Yahoo! Voices", "description": "What's it up to?", "url": "https://www.sciencealert.com/supermassive-black-hole-caught-doing-something-never-seen-before", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/2e8d8d363b34c6399467e5f3630ba0a9", "publishedAt": "2025-01-21T00:48:00Z", "content": "As far as supermassive black holes go, the one at the center of the Milky Way is relatively sedate.\r\nBut, even in its supposed quiescent state, Sagittarius A* is prone to the occasional belch or rupt… [+4716 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Habitable Worlds Could Have Formed Before the First Galaxies - Universe Today", "description": "New research based solely on simulations shows how habitable worlds could have formed before any galaxies formed.", "url": "https://www.universetoday.com/170521/habitable-worlds-could-have-formed-before-the-first-galaxies/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/06/heic1916a.jpg", "publishedAt": "2025-01-21T00:21:33Z", "content": "What came first, galaxies or planets? The answer has always been galaxies, but new research is changing that idea. \r\nCould habitable planets really have formed before there were galaxies?\r\nIn the imm… [+5730 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cat Williams", "title": "Darwin and Bateman thought female animals weren't promiscuous—they were wrong - Phys.org", "description": "For far too long, women have been seen as secondary to men under the patriarchal rule of human society.", "url": "https://phys.org/news/2025-01-darwin-bateman-thought-female-animals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-biological-truth-a.jpg", "publishedAt": "2025-01-20T20:32:04Z", "content": "For far too long, women have been seen as secondary to men under the patriarchal rule of human society.\r\nYet, humanity's existence has been a minor blip in the history of the Earth, where females are… [+7093 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble Telescope spies newborn stars in famous Orion Nebula (photo) - Space.com", "description": "\"The protostars are midway down the path to becoming mature stars.\"", "url": "https://www.space.com/space-exploration/hubble-space-telescope/hubble-telescope-spies-newborn-stars-in-famous-orion-nebula-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nWEwHvJraGaU6ivZyJtjYb-1200-80.jpg", "publishedAt": "2025-01-20T20:00:00Z", "content": "Two young stars shine bright in the dusty depths of the Orion Nebula in a new Hubble Space Telescope image.\r\nLocated about 1,300 light-years from Earth\r\n, these young stars, also known as protostars,… [+3008 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Confirms Ancient Biblical Battles Using Groundbreaking Magnetic Dating Technique - The Daily Galaxy --Great Discoveries Channel", "description": "n a revolutionary new study, scientists have employed an innovative approach to validate key moments from the Bible.", "url": "https://dailygalaxy.com/2025/01/scientists-confirms-ancient-biblical-battles-using-groundbreaking-magnetic-dating-technique/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Scientists-Confirms-Ancient-Biblical-Battles-.jpg", "publishedAt": "2025-01-20T18:00:00Z", "content": "In a revolutionary new study, scientists have employed an innovative approach to validate key moments from the Bible. By using archaeomagnetic dating, a method that examines the Earth’s ancient magne… [+4614 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Study warns of a \"ticking time bomb\" under West Antarctic Ice Sheet as ice reveals 100+ volcanoes - The Jerusalem Post", "description": "Researchers found 100+ volcanoes beneath Antarctic ice along the active West Antarctic Rift System, dating back to the dinosaur age.", "url": "https://www.jpost.com/science/science-around-the-world/article-838323", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/644903", "publishedAt": "2025-01-20T18:00:00Z", "content": "A new study published in the journal Geochemistry, Geophysics, Geosystems revealed a potential \"ticking time bomb\" beneath the West Antarctic Ice Sheet, raising alarms about the future of global sea … [+3943 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sandee Oster", "title": "Small carnivores may have constituted important part of hunter–gatherer nutrition in the Levant - Phys.org", "description": "A recent study published by Dr. Shirad Galmor and colleagues in Environmental Archaeology examined the role played by foxes and wildcats at the Early Pre-Pottery Neolithic B (EPPNB) site of Aḥihud (Israel). The site was occupied between ca. 10,500 and 10,100 …", "url": "https://phys.org/news/2025-01-small-carnivores-constituted-important-huntergatherer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/small-carnivores-may-h-1.jpg", "publishedAt": "2025-01-20T17:10:08Z", "content": "A recent study published by Dr. Shirad Galmor and colleagues in Environmental Archaeology examined the role played by foxes and wildcats at the Early Pre-Pottery Neolithic B (EPPNB) site of Aihud (Is… [+3051 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Life is thriving in the subsurface depths of Earth - Ars Technica", "description": "Different species thrive beneath the oceans than under the land.", "url": "https://arstechnica.com/science/2025/01/life-is-thriving-in-the-subsurface-depths-of-earth/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/GettyImages-1152425530-1152x648.jpg", "publishedAt": "2025-01-20T15:31:30Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nathaniel Scharping", "title": "Deep beneath California's Sierra Nevada, Earth's lithosphere may be peeling away - Phys.org", "description": "The processes that form continental crust from the denser basaltic rocks of the upper mantle may make the lower lithosphere denser than the underlying mantle. One theory holds that the lower lithosphere splits away and sinks into the mantle in a process calle…", "url": "https://phys.org/news/2025-01-deep-beneath-california-sierra-nevada.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/deep-beneath-californi.jpg", "publishedAt": "2025-01-20T15:15:03Z", "content": "The processes that form continental crust from the denser basaltic rocks of the upper mantle may make the lower lithosphere denser than the underlying mantle. One theory holds that the lower lithosph… [+2943 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "'Heavy' dark matter would rip our understanding of the universe apart, new research suggests - Yahoo! Voices", "description": "Dark matter can't be too heavy or it might break our best model of the universe, new research suggests.", "url": "https://www.space.com/the-universe/heavy-dark-matter-would-rip-our-understanding-of-the-universe-apart-new-research-suggests", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/rq2P4hwXEgHfme3B8nK3ew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/28abbf7275168ea2530aa42a0f0dbd35", "publishedAt": "2025-01-20T15:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nInvisible dark matter makes up most of the mass in the universe, far outweighing the amount of … [+4604 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "China generates oxygen and rocket fuel in-orbit for first time - Interesting Engineering", "description": "China's achievement is valuable for long-term space exploration, enabling self-sufficiency and enabling missions like a crewed moon landing.", "url": "https://interestingengineering.com/space/china-makes-resources-in-orbit-for-space-travel", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/01/hPpt8VbddUqMedDyJvlX5smCdHbgajADzGS4yZEv.jpeg", "publishedAt": "2025-01-20T14:18:00Z", "content": "This technology mimics the natural photosynthesis process of green plants through engineered physical and chemical methods, utilising carbon dioxide resources in confined spaces or extraterrestrial a… [+815 chars]"}, {"source": {"id": null, "name": "Science News"}, "author": null, "title": "Hula-hooping robots reveal the physics behind keeping rings aloft - Science News Magazine", "description": "The gyrations of hoop-slinging robots reveal that hourglass-shaped objects are best at keeping a hoop in the air.", "url": "https://www.sciencenews.org/article/hula-hooping-robots-physics", "urlToImage": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2025/01/010225_ec_hula-hoop_feat.jpg", "publishedAt": "2025-01-17T14:00:00Z", "content": "To keep a Hula-Hoop aloft, it helps to be in shape literally.\r\nExperiments with gyrating, hoop-slinging robots have revealed how these spinning rings stay up despite the pull of gravity. The shape of… [+2014 chars]"}]}