{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "All Of Neptune's Clouds Have Vanished, Scientists Blame It On The Sun - NDTV", "description": "The scientist said that the pattern somewhat matches up with the sun's 11-year cycle of activity.", "url": "https://www.ndtv.com/science/all-of-neptunes-clouds-have-vanished-scientists-blame-it-on-the-sun-4313692", "urlToImage": "https://c.ndtvimg.com/2023-08/9d0u3qn8_neptune-clouds_625x300_20_August_23.jpg", "publishedAt": "2023-08-20T12:40:31Z", "content": "Scientists observed detailed images of the planet between the years 1994 and 2022\r\nAll of Neptune's clouds have disappeared, astronomers announced this unexpected update on Thursday, August 17. For t… [+4807 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Physicists Identify a Strange New Form of Superconductivity - ScienceAlert", "description": "Superconductivity promises to transform everything from power grids to personal electronics.", "url": "https://www.sciencealert.com/physicists-identify-a-strange-new-form-of-superconductivity", "urlToImage": "https://www.sciencealert.com/images/2023/08/CoolSuperconductor.jpg", "publishedAt": "2023-08-20T12:31:15Z", "content": "Superconductivity promises to transform everything from power grids to personal electronics. Yet getting the low-waste form of power to operate at ambient temperatures and pressures is proving to be … [+2952 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA flew a modified U-2 spy plane into thunderstorms to study super-energetic gamma-rays - Space.com", "description": "An international group of researchers captured 'the most detailed' data on gamma-rays and thunderclouds ever.", "url": "https://www.space.com/nasa-thunderstorms-gamma-rays-er-2-aircraft", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kZwy7TZD3ewRNCWt6gPbSd-1200-80.jpg", "publishedAt": "2023-08-20T12:00:53Z", "content": "NASA pilots flew a high-altitude science aircraft directly into thunderstorms and recorded incredible data on gamma-ray flashes.\r\nThunderstorms can create powerful updrafts and downdrafts of wind tha… [+3713 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "Space photo of the week: A cosmic 'ghost' peers through the universe's past - Livescience.com", "description": "Imaged beautifully by Hubble, NGC 6684 is a 'lenticular' galaxy very different to our own Milky Way.", "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-a-cosmic-ghost-peers-through-the-universes-past", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3zQa8ZAvBQoeoPkUgdFtkd-1200-80.jpg", "publishedAt": "2023-08-20T12:00:00Z", "content": "This image\r\n from the Hubble Space Telescope reveals a distant galaxy that looks very different from our own Milky Way\r\n. Best seen from the Southern Hemisphere, NGC 6684 is a whopping 44 million lig… [+1345 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Zombie-Ant Fungi to Hadrosauroid Embryos: Stunning Winners of BMC Ecology and Evolution Image Competition - SciTechDaily", "description": "Cornelia Sattler's image of the invasive orange pore fungus won the BMC Ecology and Evolution image competition. The competition celebrates nature's wonders across various categories, blending art and science. A captivating image of the invasive orange pore f…", "url": "https://scitechdaily.com/from-zombie-ant-fungi-to-hadrosauroid-embryos-stunning-winners-of-bmc-ecology-and-evolution-image-competition/", "urlToImage": "https://scitechdaily.com/images/Invasive-Orange-Pore-Fungus.jpg", "publishedAt": "2023-08-20T10:26:27Z", "content": "ByBMC (BioMed Central)August 20, 2023\r\nOverall winner. An invasive orange pore fungus poses unknown ecological consequences for Australian ecosystems. Credit: Cornelia Sattler\r\nCornelia Sattlers imag… [+5906 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA's Lunar Trailblazer satellite is ready to hunt for water on the moon - Space.com", "description": "Lunar Trailblazer joins a growing list of probes and landers heading toward the moon to search for water ice.", "url": "https://www.space.com/nasa-lunar-trailblazer-hunt-water-on-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yM5G9c5k7vijRtjhD2ifhU-1200-80.jpg", "publishedAt": "2023-08-20T10:00:22Z", "content": "NASA's Lunar Trailblazer mission is almost ready for liftoff.\r\nThe Lockheed Martin-built Lunar Trailblazer satellite is fairly small as satellites go, measuring just 11.5 feet (3.5 meters) wide and w… [+3556 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Turbulent Plasma: Uncovering the Source of the Universe's Magnetic Fields - SciTechDaily", "description": "The source of magnetic fields has long been debated. New research offers clues on their origins. It isn’t just your refrigerator that has magnets on it. The earth, the stars, galaxies, and the space between galaxies are all magnetized, too. The more places sc…", "url": "https://scitechdaily.com/?p=300538", "urlToImage": "https://scitechdaily.com/images/Galactic-Magnetic-Field-Concept-Art.jpg", "publishedAt": "2023-08-20T04:21:06Z", "content": "ByColumbia UniversityAugust 19, 2023\r\nColumbia researchers have found that magnetic fields across the universe may originate in turbulent plasma. Their study demonstrates that these plasmas, present … [+3255 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "New creature discovered by scientists under the Antarctic ocean - The Jerusalem Post", "description": "It looks like something out of a sci-fi film but the research team insist that it is one of many of this strange type of underwater life.", "url": "https://www.jpost.com/science/the-natural-world/article-755423", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/548953", "publishedAt": "2023-08-19T23:34:00Z", "content": "Researchers from the University of California, San Diego, have discovered a new species of sea creature, the Antarctic strawberry feather star, thousands of feet below sea level off the coast of Anta… [+1650 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Rebecca Dyer", "title": "This Ancient Marine Reptile Ate Like Today's Filter-Feeding Whales - ScienceAlert", "description": "New fossils found in China reveal marine reptiles from the Triassic Period were sifting tiny edibles from copious amounts of water long before modern whales made it cool.", "url": "https://www.sciencealert.com/this-ancient-marine-reptile-ate-like-todays-filter-feeding-whales", "urlToImage": "https://www.sciencealert.com/images/2023/08/HupehsuchusFilterFeedingIllustrationHeadShot.jpg", "publishedAt": "2023-08-19T23:31:15Z", "content": "New fossils found in China reveal marine reptiles from the Triassic Period were sifting tiny edibles from copious amounts of water long before modern whales made it cool.\r\nAnalysis of the skulls of t… [+4296 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Space Telescope “Catches” Boomerang Nebula - SciTechDaily", "description": "Hubble has revealed the intricate details of the Boomerang Nebula, a near-absolute zero temperature nebula 5,000 light-years away, showcasing significant matter ejection over millennia. The Hubble Space Telescope has \"caught\" the Boomerang Nebula in these spe…", "url": "https://scitechdaily.com/hubble-space-telescope-catches-boomerang-nebula/", "urlToImage": "https://scitechdaily.com/images/Hubble-Boomerang-Nebula.jpg", "publishedAt": "2023-08-19T23:20:48Z", "content": "ByNASAAugust 19, 2023\r\nStunning image of the Boomerang Nebula, captured by the Hubble Space Telescope, utilizing its Advanced Camera for Surveys. Located about 5,000 light years away, this nebula is … [+3771 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering Quantum Complexity: A Pioneering Algorithm for Accurate Qubit Calculation - SciTechDaily", "description": "Practical quantum computing is another step closer. Researchers have introduced a novel algorithm called Automated Compression of Arbitrary Environments (ACE) designed to study the interactions of qubits with their surrounding environment and the ensuing chan…", "url": "https://scitechdaily.com/deciphering-quantum-complexity-a-pioneering-algorithm-for-accurate-qubit-calculation/", "urlToImage": "https://scitechdaily.com/images/Quantum-Physics-Algorithm-Art.jpg", "publishedAt": "2023-08-19T22:29:14Z", "content": "ByNational Research University Higher School of EconomicsAugust 19, 2023\r\nScientists have developed the ACE algorithm to study qubit interactions and changes in their quantum state, simplifying quant… [+6499 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Indian spacecraft snaps images of the moon’s surface ahead of landing attempt - Digital Trends", "description": "An Indian spacecraft which is approaching the moon's south pole recently snapped images of the lunar surface.", "url": "http://www.digitaltrends.com/space/chandrayaan-3-moon-images/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/08/Screenshot-2023-08-19-233354.jpg?resize=1200%2C630&p=1", "publishedAt": "2023-08-19T21:58:21Z", "content": "An Indian spacecraft that is approaching the moon’s south pole recently snapped images of the lunar surface. The images, shared by Indian space agency ISRO, show the view on approach from the Chandra… [+2150 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Electron Pairing in Artificial Atoms: Physicists Confirm Quantum State Predicted Over 50 Years Ago - SciTechDaily", "description": "Pairing of Electrons in Artificial Atoms Discovered Researchers from the Department of Physics at Universität Hamburg, observed a quantum state that was theoretically predicted more than 50 years ago by Japanese theoreticians but so far eluded detection. By t…", "url": "https://scitechdaily.com/electron-pairing-in-artificial-atoms-physicists-confirm-quantum-state-predicted-over-50-years-ago/", "urlToImage": "https://scitechdaily.com/images/Electrons-Atomic-Physics-Art-Concept.jpg", "publishedAt": "2023-08-19T20:45:27Z", "content": "ByUniversity of HamburgAugust 19, 2023\r\nPhysicists have observed a quantum state, theorized over 50 years ago, by pairing electrons in an artificial atom on a superconductor, creating a basic version… [+4917 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Kristin Houser", "title": "NASA's mission to a $10-quintillion asteroid is two months from launch - Big Think", "description": "Whether you call it 10 quintillion, 10 million trillion, or 10 billion billion, it's a 1 followed by 19 zeroes.", "url": "https://bigthink.com/the-future/10-quintillion-dollar-asteroid-nasa-16-psyche/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/08/psyche.jpg?resize=1200,630", "publishedAt": "2023-08-19T19:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Europa Probe: Bridging Vast Distances With Advanced Antenna Technology - SciTechDaily", "description": "The addition of a high-gain antenna will enable the agency’s Europa Clipper spacecraft – set to launch in October 2024 – to communicate with mission controllers hundreds of millions of miles away. NASA’s Europa Clipper is designed to seek out conditions suita…", "url": "https://scitechdaily.com/nasas-europa-probe-bridging-vast-distances-with-advanced-antenna-technology/", "urlToImage": "https://scitechdaily.com/images/Europa-Mission-Spacecraft-Artists-Rendering.jpg", "publishedAt": "2023-08-19T18:34:32Z", "content": "ByJet Propulsion LaboratoryAugust 19, 2023\r\nNASAs Europa Clipper received a high-gain antenna to boost its communication for its 2024 mission to study Jupiters moon, Europa. With advanced instruments… [+8749 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Using data from InSight, scientists discover that Mars is rotating faster - NASASpaceFlight.com - NASASpaceflight.com", "description": "In December 2022, NASA lost contact with its Interior Exploration using Seismic Investigations, Geodesy and…", "url": "https://www.nasaspaceflight.com/2023/08/insight-rise/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/08/pia25287-1041.jpg", "publishedAt": "2023-08-19T18:25:27Z", "content": "6In December 2022, NASA lost contact with its Interior Exploration using Seismic Investigations, Geodesy and Heat Transport (InSight) Mars lander, which had been operating on the Martian surface for … [+5959 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Universe Today, Brian Koberlein", "title": "This Upcoming Telescope Could Be Our Most Powerful Tool for Finding Interstellar Objects - Inverse", "description": "Two interstellar asteroids or comets have swept into our Solar System that we know of. The Vera Rubin Observatory could be key to finding so many more.", "url": "https://www.inverse.com/science/vera-rubin-will-find-many-more-interstellar-objects", "urlToImage": "https://imgix.bustle.com/uploads/image/2023/8/16/91d0ddd8-ef0c-42f3-aad7-245e20c6ef6f-_20220603_nid_observatory.jpeg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-08-19T18:00:24Z", "content": "Most of the comets we see in the sky were born in our Solar System. They may have formed deep within the Oort cloud, and for some, it is their first visit to the inner Solar System, but they are dist… [+2803 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Kendall Tietz", "title": "Modern-day parenting pressures are making children less developed and well-rounded, study finds - Fox News", "description": "Parents are expected to spend more time 'watching, noticing and responding' to their children, making them less well rounded and developed according to a new survey.", "url": "https://www.foxnews.com/media/modern-day-parenting-pressures-making-children-less-developed-well-rounded-study-finds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/parents-unlikely-kid-covid-vaccination-poll.jpg", "publishedAt": "2023-08-19T18:00:00Z", "content": "The expectations of modern day parenting are putting pressure and expectations on parents, which is limiting opportunities for children to enjoy \"spontaneous play,\" according to a new study from the … [+3499 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "A New Way to Measure the Expansion Rate of the Universe: Redshift Drift - Universe Today", "description": "Almost all the galaxies in the Universe are speeding away from us because of the Big Bang and the acceleration of dark energy. One technique to measure this expansion is redshift, seeing how light is reddened over time as its wavelength stretches out. But eve…", "url": "https://www.universetoday.com/162845/a-new-way-to-measure-the-expansion-rate-of-the-universe-redshift-drift/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/08/redshift.jpg", "publishedAt": "2023-08-19T17:37:01Z", "content": "In 1929 Edwin Hubble published the first solid evidence that the universe is expanding. Drawing upon data from Vesto Slipher and Henrietta Leavitt, Hubble demonstrated a correlation between galactic … [+3866 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Reuters", "title": "Russia's Luna-25 spacecraft suffers technical glitch, space agency says - Yahoo! Voices", "description": "The Russian spacecraft is scheduled to land on the south pole of the moon on Monday, part of a big power race to explore a part of the moon which scientists ...", "url": "https://news.yahoo.com/russias-luna-25-spacecraft-produces-130746279.html", "urlToImage": "https://media.zenfs.com/en/reuters.com/723806359d2698a530ca60af0a5058d6", "publishedAt": "2023-08-19T16:24:03Z", "content": "(Reuters) -An \"abnormal situation\" occurred at Russia's Luna-25 spacecraft on Saturday as it was preparing to transfer to its pre-landing orbit, Russia's national space agency Roskosmos said.\r\nThe Ru… [+1677 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Bhoumik Mhatre, Bhoumik Mhatre", "title": "Development in Nano-Arrays Using Deep Learning: A New AI Method that could Design Nanohole Arrays that can Produce a Specific Structural Color - MarkTechPost", "description": "The diversity in colors is much more and increases with the combination of two or more colors. Light interacts with tiny nanostructures and creates an intrinsic pattern of multiple colors. Light spectrum also interacts with the holes and creates a system call…", "url": "https://www.marktechpost.com/2023/08/19/development-in-nano-arrays-using-deep-learning-a-new-ai-method-that-could-design-nanohole-arrays-that-can-produce-a-specific-structural-color/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/08/Screenshot-2023-08-19-at-5.26.59-AM.png", "publishedAt": "2023-08-19T14:30:00Z", "content": "The diversity in colors is much more and increases with the combination of two or more colors. Light interacts with tiny nanostructures and creates an intrinsic pattern of multiple colors. Light spec… [+2764 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "7 rules that explain Earth's most extreme animal shapes and sizes - Livescience.com", "description": "Nature has a few rules to help explain the extreme shapes and sizes we see in the animal kingdom.", "url": "https://www.livescience.com/animals/rules-that-explain-earths-most-extreme-animal-shapes-and-sizes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2sY8GYfVKqLwimF4s622DZ-1200-80.jpg", "publishedAt": "2023-08-19T14:00:00Z", "content": "Animals come in extreme shapes and sizes, from enormous elephants and colossal squids to miniature marmoset monkeys and teeny-weeny frogs. But there is some method to nature's madness, and while evol… [+5596 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "What happens if someone DIES in space? Experts reveal how dead bodies are frozen or MUMMIFIED before sailing t - Daily Mail", "description": "NASA does not have set protocols for dealing with death in space, but researchers around the world have put forward how such a tragedy could be dealt with.", "url": "https://www.dailymail.co.uk/sciencetech/article-12417381/What-happens-DIES-space-Experts-reveal-dead-bodies-frozen-MUMMIFIED-sailing-cosmos-millions-years.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/08/18/13/41843120-0-When_a_crew_member_dies_it_would_take_months_or_years_before_the-a-7_1692360497914.jpg", "publishedAt": "2023-08-19T12:46:35Z", "content": "With NASA aiming to return humans to the moon later this decade and perhaps send people to Mars in the 2030s, a lot of thought will have to go into how humans might survive long-distance space travel… [+7469 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": ", USA TODAY", "title": "Alaska schoolchildren join efforts to bring back woolly mammoths - USA TODAY", "description": "The company seeking to bring back woolly mammoths to modern day also wants to make sure schoolchildren's interest in science doesn't go extinct.", "url": "https://www.usatoday.com/story/news/nation/2023/08/19/bringing-back-woolly-mammoths-fossils-alaska-schools/70604344007/", "urlToImage": "https://www.gannett-cdn.com/authoring/authoring-images/2023/08/16/USAT/70606500007-woollymammoth.jpeg?auto=webp&crop=4027,2273,x5,y241&format=pjpg&width=1200", "publishedAt": "2023-08-19T12:02:09Z", "content": "The company seeking to bring back the woolly mammoth and other long-gone animals such as the dodo also wants to make sure schoolchildren's interest in science doesn't go extinct.\r\nColossal Laboratori… [+6362 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Blue Origin's New Glenn rocket photographed at Space Coast factory - Space.com", "description": "Social media post provides rare insight into work on New Glenn", "url": "https://www.space.com/blue-origin-new-glenn-rocket-factory-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZwTHfDxeQo7GcAtcFkrGzh-1200-80.png", "publishedAt": "2023-08-19T12:00:50Z", "content": "Blue Origin has provided a rare look inside their factory at NASA's Kennedy Space Center (KSC) showing hardware for its new orbital rocket.\r\nThe image shared on Instagram shows rocket stage and inter… [+1785 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Tom Hale", "title": "Africa Is Splitting Into Two And New Data Is Uncovering How - IFLScience", "description": "The East African Rift System is being pulled in many directions by gigantic geological forces beneath the surface.", "url": "https://www.iflscience.com/africa-is-splitting-into-two-and-new-data-is-uncovering-how-70302", "urlToImage": "https://assets.iflscience.com/assets/articleNo/70302/aImg/70062/africa-meta.jpg", "publishedAt": "2023-08-19T11:06:22Z", "content": "Africa is slowly but surely splitting in two. The east of the continent is scarred by one of the largest rifts in the world. Despite its colossal size, scientists know surprisingly little about the c… [+3547 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Webb Telescope Makes Surprising Finding About the Most Distant Star Ever Seen - Futurism", "description": "The James Webb Space Telescope has once again captured imagery of the furthest star ever detected — and revealed that it may not be alone.", "url": "https://futurism.com/the-byte/james-webb-distant-star-surprise", "urlToImage": "https://wp-assets.futurism.com/2023/08/james-webb-most-ancient-star.jpg", "publishedAt": "2023-08-19T11:02:33Z", "content": "Aww, it has a life partner! \r\nBetter Off Alone\r\nThe James Webb Space Telescope has once again captured imagery of the furthest star ever detected and revealed that it may not be alone.\r\nIn a press re… [+2248 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA films rare footage of its Mars helicopter flying and landing - Mashable", "description": "The aerial robot scouts the Red Planet.", "url": "https://mashable.com/article/mars-helicopter-video-nasa", "urlToImage": "https://helios-i.mashable.com/imagery/articles/06OWRuoF4qcIy4uS5ECy83l/hero-image.fill.size_1200x675.v1692381526.jpg", "publishedAt": "2023-08-19T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Sean Thiessen", "title": "The Mystery Behind Deep Space Question Mark Captured By The James Webb Telescope - Giant Freakin Robot", "description": "In the far reaches of space, a myserious question mark has been found, and narutally it's lead to more questions then answers.", "url": "https://www.giantfreakinrobot.com/sci/deep-space-question-mark.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/04/radio-signals-space.jpg", "publishedAt": "2023-08-19T10:29:00Z", "content": null}, {"source": {"id": null, "name": "Softonic"}, "author": "Pedro Domínguez Rojas", "title": "The Universe’s Humming Riddle: Groundbreaking Research Uncovers Clues to Its Source - Softonic EN", "description": "A group of NANOGrav scientists have been able to detect the gravitational hum of the universe for the first time using neutron stars.", "url": "https://en.softonic.com/articles/a-new-study-reveals-what-could-be-causing-the-buzz-in-our-universe", "urlToImage": "https://articles-img.sftcdn.net/f_auto,t_article_cover_xl/auto-mapping-folder/sites/3/2023/08/Ondas-gravitacionales-NANOGrav-1.jpg", "publishedAt": "2023-08-19T10:01:40Z", "content": "The universe is not static or silent, as is commonly believed. It moves, expands and vibrates. And this is where gravitational waves play an important role: tiny ripples in the fabric of space and ti… [+2601 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Canadian satellite celebrates 20 years in space, 10 times its predicted lifetime - Space.com", "description": "Scisat tracks changes in the atmosphere that could 'delay the ozone recovery in a warming world.'", "url": "https://www.space.com/canadian-satellite-scisat-climate-change-20-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HACb42b2Tv5mKN6CNBVb7J-1200-80.jpg", "publishedAt": "2023-08-19T10:00:34Z", "content": "The satellite was only supposed to last two years. But it's still healthy at 20.\r\nCanada's Scisat is defying all lifetime expectations at a crucial time in human history, helping track the effects of… [+6215 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "I flew weightlessly on a parabolic flight to see incredible student science soar - Space.com", "description": "'The whole thing was just surreal, to see objects in front of you float around, for yourself to float around.'", "url": "https://www.space.com/parabolic-flight-canada-weightless-student-science", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VWHN9tPVBkJYkwPpHpqAPX-1200-80.png", "publishedAt": "2023-08-19T10:00:30Z", "content": "OTTAWA, CANADA — I was soaring like a superhero.\r\nFor about 20 magical seconds at a time, I floated like an astronaut during a special plane flight meant to simulate the weightlessness people feel in… [+12635 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Megan Shersby", "title": "West Indian Ocean coelacanth: The once-'extinct' Lazarus fish that can live for 100 years - Yahoo Life", "description": "Believed to have gone extinct at the time of the dinosaurs, the coelacanth has one of the longest gestation periods on Earth — and it can hunt in a headstand...", "url": "https://www.livescience.com/animals/fish/west-indian-ocean-coelacanth-the-once-extinct-lazarus-fish-that-can-live-for-100-years", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/v0IbczJ9XcGi19Pt6.7rwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/1e0eb743387654abf556aadc84ee7ef5", "publishedAt": "2023-08-19T10:00:09Z", "content": "Name: West Indian Ocean coelacanth or African coelacanth (Latimeria chalumnae), known as 'gombessa' in the Comoros Islands\r\nWhere it lives: Off the east coast of Africa\r\nWhat it eats: A variety of fi… [+2107 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA spacecraft spots stunning flow of ice on Mars - Mashable", "description": "There's movement on Mars.", "url": "https://mashable.com/article/mars-nasa-ice-glacier", "urlToImage": "https://helios-i.mashable.com/imagery/articles/00ZVs2BRXe9vm9lMeYfm6nS/hero-image.fill.size_1200x675.v1692363163.png", "publishedAt": "2023-08-19T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "What is the hottest place in the universe? - Livescience.com", "description": "The hottest spot in the universe may well be near the edges of a supermassive black hole.", "url": "https://www.livescience.com/space/what-is-the-hottest-place-in-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ueqayrn2Sae5sKMW8U8dFX-1200-80.jpg", "publishedAt": "2023-08-19T09:00:00Z", "content": "While the sun is the most scorching object in our solar system, its temperatures pale in comparison to several other cosmic bodies. So what is the hottest place in the universe? \r\n\"I think a good ans… [+4307 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Image: Hubble captures cosmic cluster - Phys.org", "description": "The massive cluster Abell 3322 is featured in this image from the NASA/ESA Hubble Space Telescope, in which the galaxy 2MASX J05101744-4519179 basks in the center. This distant galaxy cluster is a cosmic leviathan that is highly luminous at X-ray wavelengths.…", "url": "https://phys.org/news/2023-08-image-hubble-captures-cosmic-cluster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/image-hubble-captures-1.jpg", "publishedAt": "2023-08-19T06:09:05Z", "content": "The massive cluster Abell 3322 is featured in this image from the NASA/ESA Hubble Space Telescope, in which the galaxy 2MASX J05101744-4519179 basks in the center. This distant galaxy cluster is a co… [+1580 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Uncovering Stellar Mysteries – Astrophysicists Observe Blue Supergiants in Detail - SciTechDaily", "description": "Stars serve as the fundamental building blocks of galaxies and, by extension, the entire observable universe. Among the diverse spectrum of stars, those with a mass exceeding 8 times that of the Sun are labeled as massive stars. Their potent radiation and for…", "url": "https://scitechdaily.com/uncovering-stellar-mysteries-astrophysicists-observe-blue-supergiants-in-detail/", "urlToImage": "https://scitechdaily.com/images/Blue-Supergiant.jpg", "publishedAt": "2023-08-19T05:53:17Z", "content": "ByInstituto de Astrofísica de Canarias (IAC)August 18, 2023\r\nResearchers have conducted a comprehensive study on 750 blue supergiant stars within 6,500 light-years of Earth using the IACOB project, p… [+5373 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Richard Angle", "title": "Crew Dragon Endurance arrives at LC-39A ahead of Crew 7 launch - TESLARATI", "description": "NASA and SpaceX are moving closer to the launch of Crew 7 to the International Space Station as Crew Dragon has arrived at Launch Complex 39A to be attached to the Falcon 9 second stage.", "url": "https://www.teslarati.com/crew-dragon-endurance-arrives-lc-39a-ahead-crew-7-launch/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2023/08/F3w5ZWga4AA3a2k.jpg", "publishedAt": "2023-08-19T02:16:37Z", "content": "NASA and SpaceX are moving closer to the launch of Crew 7 to the International Space Station as Crew Dragon has arrived at Launch Complex 39A to be attached to the Falcon 9 second stage.\r\nThe launch … [+2033 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Trillionth-of-a-Second Camera Captures Chaos in Action - ScienceAlert", "description": "To take a picture, the best digital cameras on the market open their shutter for around around one four-thousandths of a second.", "url": "https://www.sciencealert.com/trillionth-of-a-second-camera-captures-chaos-in-action", "urlToImage": "https://www.sciencealert.com/images/2023/03/CameraLens.jpg", "publishedAt": "2023-08-19T01:31:08Z", "content": "To take a picture, the best digital cameras on the market open their shutter for around around one four-thousandths of a second.\r\nTo snapshot atomic activity, you'd need a shutter that clicks a lot f… [+3651 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists found an ancient human skull that's unlike anything we've seen before - BGR", "description": "The discovery of a new ancient human skull in China has scientists baffled and trying to figure out where it fits in humanity's lineage.", "url": "https://bgr.com/science/scientists-found-an-ancient-human-skull-thats-unlike-anything-weve-seen-before/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/04/bgrpic-copy-7.jpg?quality=82&strip=all", "publishedAt": "2023-08-19T01:02:00Z", "content": "Learning more about ancient humans is important if we want to understand humanity’s origins. That’s why it is always so exciting when scientists uncover ancient human skulls hidden in fossil records.… [+1929 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Here's How Much of a Threat Asteroids Really Pose to Our Planet... And Us - ScienceAlert", "description": "Asteroids are chunks of rock left over from the formation of our Solar System.", "url": "https://www.sciencealert.com/heres-how-much-of-a-threat-asteroids-really-pose-to-our-planet-and-us", "urlToImage": "https://www.sciencealert.com/images/2023/08/AsteroidHitEarth.jpg", "publishedAt": "2023-08-19T00:31:19Z", "content": "Asteroids are chunks of rock left over from the formation of our Solar System. Approximately half a billion asteroids with sizes greater than four metres in diameter orbit the Sun, travelling through… [+5184 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Way To Control Fire – Scientists Develop Novel Nanoscale Material - SciTechDaily", "description": "High-temperature flames are essential for producing numerous materials. However, controlling a fire and its interaction with the intended material can be challenging. Scientists have now developed a method that employs a molecule-thin protective layer to cont…", "url": "https://scitechdaily.com/a-new-way-to-control-fire-scientists-develop-novel-nanoscale-material/", "urlToImage": "https://scitechdaily.com/images/Rings-of-Fire.jpg", "publishedAt": "2023-08-19T00:23:22Z", "content": "ByNorth Carolina State UniversityAugust 18, 2023\r\nResearchers have developed a method, called inverse thermal degradation (ITD), to control how flames interact with materials using a nanoscale protec… [+4079 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Universe: Baffling Unexplained Space Mysteries (S2, E11) | Full Episode - HISTORY", "description": "Delve into the myths, misconceptions, truths and amazing mysteries of our unique universe. See more in Season 2, Episode 11, \"Unexplained Mysteries.\"#TheUniv...", "url": "https://www.youtube.com/watch?v=ayPxlDJVcng", "urlToImage": "https://i.ytimg.com/vi/ayPxlDJVcng/maxresdefault.jpg", "publishedAt": "2023-08-19T00:00:01Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Physicists Just Synthesized Crystals Of The Material We Think Is in Earth's Core - ScienceAlert", "description": "Using an anvil made of diamond, physicists have successfully squeezed iron into the form we think it has deep in the center of Earth.", "url": "https://www.sciencealert.com/physicists-just-synthesized-crystals-of-the-material-we-think-is-in-earths-core", "urlToImage": "https://www.sciencealert.com/images/2023/08/diamond-anvil-shim.jpg", "publishedAt": "2023-08-18T23:31:15Z", "content": "Using an anvil made of diamond, physicists have successfully squeezed iron into the form we think it has deep in the center of Earth.\r\nIt's called hexaferrum, or epsilon iron (-Fe), and it's only sta… [+3145 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Exactly Where To Book Now For The U.S. ‘Ring Of Fire’ Solar Eclipse - Forbes", "description": "Where to be on October 14, 2023 to witness the \"ring of fire\" annular solar eclipse visible  in eight states in the U.S. southwest.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/08/18/exactly-where-to-book-now-for-the-us-ring-of-fire-solar-eclipse/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/1190486853/0x0.jpg?format=jpg&crop=3373,1898,x493,y295,safe&width=1200", "publishedAt": "2023-08-18T23:15:00Z", "content": "The moon moves in front of the sun in a rare \"ring of fire\" solar eclipse as seen from Balut Island, ... [+] Saraggani province in the southern island of Mindanao on December 26, 2019. (Photo by Ferd… [+5259 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Dirty” Surprise: Webb Space Telescope Locates Dust Reservoirs in Two Supernovae - SciTechDaily", "description": "New finding suggests supernovae are likely suppliers of dust to early, young galaxies. Supernovae, the explosive deaths of stars, are some of the universe’s biggest bursts of energy and light. In fact, when they erupt, one supernova can shine even brighter th…", "url": "https://scitechdaily.com/dirty-surprise-webb-space-telescope-locates-dust-reservoirs-in-two-supernovae/", "urlToImage": "https://scitechdaily.com/images/Dusty-Supernovae-Webb-MIRI.jpg", "publishedAt": "2023-08-18T23:08:36Z", "content": "BySpace Telescope Science InstituteAugust 18, 2023\r\nImages from NASAs James Webb Space Telescopes MIRI (Mid-Infrared Instrument) reveal large amounts of dust within two Type II supernovae, Supernova … [+9821 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/sarah-regan", "title": "What A Guru Taught Me For Getting Rid Of Anger & Irritability | mindbodygreen - mindbodygreen", "description": "It's simpler than you might think.", "url": "https://www.mindbodygreen.com/articles/what-guru-taught-me-to-do-to-get-rid-of-anger-and-irritability", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/v6j25iyinjsgok4bu.jpg", "publishedAt": "2023-08-18T22:42:05Z", "content": "According to Daaji, we have a complementary and symbiotic relationship with plants that can play a role in our health and wellbeing, if only we tap into it.\r\n\"Whenever you look at a tree or a flower,… [+1540 chars]"}, {"source": {"id": null, "name": "Surfer.com"}, "author": "Dashel Pierson", "title": "The Science of Kelly Slater's Surf Ranch (Video) - Yahoo Life", "description": "Kelly Slater’s Surf Ranch is a feat of engineering. A perfect wave. A gigantic foil plowing through 2,200 feet of water. An estimated $30 million to build...", "url": "https://www.surfer.com/trending-news/science-of-kelly-slaters-surf-ranch", "urlToImage": "https://media.zenfs.com/en/surfer_magazine_140/65ece898988f83a70542c333c2acec4c", "publishedAt": "2023-08-18T22:00:00Z", "content": "Kelly Slaters Surf Ranch is a feat of engineering.\r\nA perfect wave. A gigantic foil plowing through 2,200 feet of water. An estimated $30 million to build the thing. And all of it going down 100 mile… [+3046 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jenny McGrath", "title": "Fires may have caused La Brea tar pit extinctions 13,000 years ago - Business Insider", "description": "Researchers say fires, possibly set by humans, led to the disappearance of dire wolves, sabertooth cats, and other megafauna at the La Brea tar pits.", "url": "https://www.businessinsider.com/fires-may-have-caused-la-brea-tar-pit-extinctions-thousands-of-years-ago-2023-8", "urlToImage": "https://i.insider.com/64dfd00abd98a6001979b108?width=1200&format=jpeg", "publishedAt": "2023-08-18T20:17:00Z", "content": "From about 50,000 years ago, animals, vegetation, and other debris managed to get stuck in the sticky substance of the Rancho La Brea tar pits in present-day Los Angeles.\r\nThe millions of fossils fou… [+8065 chars]"}, {"source": {"id": null, "name": "Space Ref"}, "author": "John Williams", "title": "\"Mother Nature is Sending us a Warning,\" says NASA During Climate Briefing - Space Ref", "description": "During an August 14 press briefing, NASA warned about alarming climate and temperature trends around the world.", "url": "https://spaceref.com/earth/mother-nature-sending-warning-says-nasa-during-climate-briefing/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2023/08/18154021/nasa-climate-records.png", "publishedAt": "2023-08-18T19:45:10Z", "content": "Map of temperature data presented during NASA’s climate briefing. \r\nImage credit: NASA broadcast. \r\nTemperatures are soaring. As the world sweats through the hottest July since at least 1880, NASA, k… [+6172 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "Hold the Moon – NASA's buildings are crumbling amid 200-year upgrade cycles - The Register", "description": "If a facility falls down, 'the microscope inside it is useless to you'", "url": "https://www.theregister.com/2023/08/18/nasa_buildings_upgrades/", "urlToImage": "https://regmedia.co.uk/2023/08/18/nasapocalypse.jpg", "publishedAt": "2023-08-18T19:35:00Z", "content": "While NASA prepares to journey through the unforgiving vacuum of space to the Moon and Mars, it faces a terrestrial threat in the meantime. A vacuum of funding that has left its own buildings crumbli… [+4455 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "XRISM's Quest: Delving Deep Into the Universe's Hottest Mysteries - SciTechDaily", "description": "Japan's XRISM observatory, launching on August 25, will provide deep insights into the universe's extreme thermal places using ultra-cold instruments, revealing the brightness and chemical composition of cosmic X-ray sources. Japan’s XRISM (X-ray Imaging and …", "url": "https://scitechdaily.com/xrisms-quest-delving-deep-into-the-universes-hottest-mysteries/", "urlToImage": "https://scitechdaily.com/images/XRISM-X-Ray-Imaging-and-Spectroscopy-Mission-Spacecraft-Front-View-scaled.jpg", "publishedAt": "2023-08-18T19:33:34Z", "content": "ByFrancis Reddy, NASAs Goddard Space Flight CenterAugust 18, 2023\r\nXRISM, shown in this artists concept, is an X-ray mission that will study some of the most energetic objects in the universe. Credit… [+7632 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Isobel Whitcomb", "title": "China's rover maps 1000 feet of hidden 'structures' deep below the dark side of the moon - Livescience.com", "description": "Scientists were able to visualize the upper 1,000 feet of the moon's surface for the first time. Their results reveal billions of years of previously hidden lunar history.", "url": "https://www.livescience.com/space/the-moon/chinas-rover-maps-1000-feet-of-hidden-structures-deep-below-the-dark-side-of-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tVTWNN8fY3EVorfi37VN9C-1200-80.jpg", "publishedAt": "2023-08-18T19:31:17Z", "content": "Since it first landed in 2018, China's Chang'e-4 — the first spacecraft to ever land on the far side of the moon — has been taking stunning panoramas of impact craters and sampling minerals from the … [+3149 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Richard Angle", "title": "SpaceX launches 22 Starlinks from Florida, delays launch from California - TESLARATI", "description": "SpaceX had its sights set on back-to-back launches from the East and West Coasts. However, only the Florida launch managed to get off the ground and into orbit. The Starlink Group 6-10 mission lifted off at 11:36 p.m. ET (03:36 UTC on the 17th) from Space Lau…", "url": "https://www.teslarati.com/spacex-launches-22-starlinks/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2021/03/Starlink-20-Falcon-9-B1058-LC-40-031121-Richard-Angle-launch-1-crop-c.jpg", "publishedAt": "2023-08-18T19:30:21Z", "content": "SpaceX had its sights set on back-to-back launches from the East and West Coasts.\r\nHowever, only the Florida launch managed to get off the ground and into orbit.\r\nThe Starlink Group 6-10 mission lift… [+2042 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "A nearby supernova could reveal the secret lives of ghostly neutrinos. Here's how. - Space.com", "description": "Detecting neutrino interactions would open the door to strange new physics beyond the Standard Model.", "url": "https://www.space.com/nearby-supernova-reveal-secrets-neutrinos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WLG4BLkHiiB6hzGzxHLwoT-1200-80.jpg", "publishedAt": "2023-08-18T19:00:07Z", "content": "Physicists have made a leap forward in understanding how ghostly particles called neutrinos might interact with each other, by modeling how neutrinos escaping into space from exploding stars flow lik… [+5502 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Rae Hodge", "title": "Magnetars and “zombie” stars: New type of ultrahigh magnetic star discovered - Salon", "description": "This bizarre new star may have just solved one of science's greatest mysteries", "url": "https://www.salon.com/2023/08/18/magnetars-and-zombie-stars-new-type-of-ultrahigh-magnetic-star-discovered/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/08/artists_impression_of_hd_45166_eso_01.jpg", "publishedAt": "2023-08-18T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Juan Siliezar-Brown", "title": "Small satellite shows off cheap way to reduce space junk - Futurity: Research News", "description": "A student-built satellite designed as a low-cost way to reduce space junk re-entered Earth's atmosphere years earlier than expected.", "url": "https://www.futurity.org/sbudnic-satellite-space-junk-2962242/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2023/08/SBUDNIC-1600.jpg", "publishedAt": "2023-08-18T18:49:37Z", "content": "A small cube satellite meant to demonstrate a practical, low-cost method to cut down on space debris has re-entered Earth’s atmosphere about five years ahead of schedule.\r\nThe student-built satellite… [+4234 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mary Kekatos", "title": "NASA asks for help studying Uranus and Neptune as it prepares to capture new images - ABC News", "description": "The New Horizons spacecraft will take images of the ice giants from \"behind.\"", "url": "https://abcnews.go.com/US/nasa-asks-studying-uranus-neptune-prepares-capture-new/story?id=102368947", "urlToImage": "https://s.abcnews.com/images/Technology/uranus-neptune-planet-ht-jt-230818_1692373380943_hpMain_16x9_992.jpg", "publishedAt": "2023-08-18T18:31:17Z", "content": "NASA is asking amateur astronomers to help the agency study the ice giants Uranus and Neptune.\r\nNext month, NASA will be observing the two planets via its New Horizons spacecraft, originally designed… [+2450 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "'Fleeing vampire' haunted Jurassic oceans with glow-in-the-dark organs, fossil reveals - Livescience.com", "description": "The newfound vampyromorph species was equipped with defensive features not previously seen in the fossil record — and it's related to modern-day vampire squid.", "url": "https://www.livescience.com/planet-earth/fossils/fleeing-vampire-haunted-jurassic-oceans-with-glow-in-the-dark-organs-fossil-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JW9MdErjnPES3xMbKPLQ6A-1200-80.jpg", "publishedAt": "2023-08-18T18:30:56Z", "content": "A bullet-shaped creature with luminous organs, eight arms and sucker attachments like a vampire squid haunted Earth's oceans 165 million years ago, a new study has found.\r\nResearchers in France disco… [+3230 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A new way to identify chiral molecules with light could vastly improve detection efficiency - Phys.org", "description": "Chiral molecules are those that have two versions that are mirror images, like our right and left hands. These molecules have the same structure but different properties when they interact with other molecules, including those inside our bodies. This is impor…", "url": "https://phys.org/news/2023-08-chiral-molecules-vastly-efficiency.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/chirality.jpg", "publishedAt": "2023-08-18T18:00:02Z", "content": "Chiral molecules are those that have two versions that are mirror images, like our right and left hands. These molecules have the same structure but different properties when they interact with other… [+2078 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Fountains of diamonds erupt from Earth's center as supercontinents break up - Livescience.com", "description": "Researchers have discovered a pattern where diamonds spew from deep beneath Earth's surface in huge, explosive volcanic eruptions.", "url": "https://www.livescience.com/planet-earth/geology/fountains-of-diamonds-erupt-from-earths-center-as-supercontinents-break-up", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sxsoknLrTFRxJs8L88kQvm-1200-80.jpg", "publishedAt": "2023-08-18T17:27:40Z", "content": "The breakup of supercontinents may trigger explosive eruptions that send fountains of diamonds shooting up to Earth's surface.\r\nDiamonds form deep in Earth's crust, approximately 93 miles (150 kilome… [+3756 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "The trade-off that helped some trilobites survive mass extinctions - Ars Technica", "description": "While legs made them vulnerable to predation, they came with extra gills.", "url": "https://arstechnica.com/science/2023/08/the-trade-off-that-helped-some-trilobites-survive-mass-extinctions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-139803193-760x380.jpg", "publishedAt": "2023-08-18T17:23:17Z", "content": "20 with \r\nHundreds of millions of years before anthropogenic climate change was ever a thing, life on Earth suffered mass extinctions due to climate change brought on by natural causes. Even so, ther… [+4211 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A new 'spin' on ergodicity breaking - Phys.org", "description": "In a recent Science paper, researchers led by JILA and NIST Fellow Jun Ye, along with collaborators JILA and NIST Fellow David Nesbitt, scientists from the University of Nevada, Reno, and Harvard University, observed novel ergodicity-breaking in C60, a highly…", "url": "https://phys.org/news/2023-08-ergodicity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-new-spin-on-ergodici.jpg", "publishedAt": "2023-08-18T17:08:03Z", "content": "In a recent Science paper, researchers led by JILA and NIST Fellow Jun Ye, along with collaborators JILA and NIST Fellow David Nesbitt, scientists from the University of Nevada, Reno, and Harvard Uni… [+8360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ava Loomar", "title": "New study warns against risks of ‘time-traveling pathogens’ - CNN", "description": "As the climate warms, ancient pathogens unleashed by thawing Arctic permafrost may pose a risk to modern ecosystems, according to a new study.", "url": "https://www.cnn.com/2023/08/18/world/ancient-virus-species-diversity-climate-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230813202737-arctic-permafrost-barrow-ak-061517-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-08-18T16:56:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAs the climate warms, scientists have suggested that t… [+7212 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Sequencing genes of Iron and Bronze Age peoples to better understand early Mediterranean migration patterns - Phys.org", "description": "An international team of anthropologists, archaeologists and geneticists has learned more about the migration patterns of people living around the Mediterranean Sea during the Iron and Bronze ages. In their study, reported in the journal Nature Ecology & Evol…", "url": "https://phys.org/news/2023-08-sequencing-genes-iron-bronze-age.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/sequencing-genes-of-ir.jpg", "publishedAt": "2023-08-18T15:20:01Z", "content": "An international team of anthropologists, archaeologists and geneticists has learned more about the migration patterns of people living around the Mediterranean Sea during the Iron and Bronze ages. I… [+2840 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Ultra-black eels that stalk the ocean's midnight zone all have the same strange skin and scientists now know why - Yahoo Life", "description": "Elusive eels may use ultra-black pigmentation alongside bioluminescence to pounce upon and engulf unwitting prey.", "url": "https://www.livescience.com/animals/fish/ultra-black-eels-keep-evolving-in-the-oceans-midnight-zone", "urlToImage": "https://media.zenfs.com/en/live_science_953/342821b05c5079cf47cc818dc8534b1e", "publishedAt": "2023-08-18T14:40:13Z", "content": "Ultra-black eels keep independently evolving in the deep sea, and researchers now think they know why as camouflage to lure prey closer with their glowing tails before engulfing them in their terrify… [+3407 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Oil eating microbes reshape droplets to optimize biodegradation - Phys.org", "description": "A team of French and Japanese environmental scientists has found that one kind of oil-eating microbe reshapes droplets to optimize biodegradation. In their study, reported in the journal Science, the group isolated Alcanivorax borkumensis bacteria specimens i…", "url": "https://phys.org/news/2023-08-oil-microbes-reshape-droplets-optimize.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/oil-eating-microbes-re-1.jpg", "publishedAt": "2023-08-18T14:40:01Z", "content": "A team of French and Japanese environmental scientists has found that one kind of oil-eating microbe reshapes droplets to optimize biodegradation. In their study, reported in the journal Science, the… [+2698 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Denise Yazak", "title": "Making big leaps in understanding nanoscale gaps - Phys.org", "description": "Creating novel materials by combining layers with unique, beneficial properties seems like a fairly intuitive process—stack up the materials and stack up the benefits. This isn't always the case, however. Not every material will allow energy to travel through…", "url": "https://phys.org/news/2023-08-big-nanoscale-gaps.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/making-big-leaps-in-un.jpg", "publishedAt": "2023-08-18T14:14:17Z", "content": "Creating novel materials by combining layers with unique, beneficial properties seems like a fairly intuitive processstack up the materials and stack up the benefits. This isn't always the case, howe… [+9789 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Joelle Renstrom", "title": "Luna-25: What Russia's and India's missions to the lunar south pole mean for the future of space exploration. - Slate", "description": "Russia and India are expected to land spacecraft on an unexplored part of the moon. Their missions could shape the future of space exploration.", "url": "https://slate.com/technology/2023/08/new-space-race-lunar-south-pole.html", "urlToImage": "https://compote.slate.com/images/5dcb7cf6-6d4b-4a83-a910-85e51c31f0fe.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2023-08-18T14:00:00Z", "content": "If all goes according to plan, next week spacecraft from Russia and India will arrive at the moons south pole, an area thus far unexplored by both humans and landers. A successful landing by either c… [+5924 chars]"}]}