{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "Slate Magazine"}, "author": "Arionne Nettles", "title": "My Son Became Friends With the Kid Who Lives Down the Street. Now They’ve Gotten Too Comfortable for My Liking. - Slate", "description": "I did not sign up for this.", "url": "https://slate.com/advice/2025/10/parent-advice-son-neighbor-babysitting.html", "urlToImage": "https://compote.slate.com/images/a93bf3f7-e037-401c-af9b-8878e15206dd.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2025-10-27T10:00:00Z", "content": "Care and Feeding is Slates parenting advice column. Have a question for Care and Feeding? Submit it here.\r\nDear Care and Feeding,\r\nMy son, Gary, 8, has a friend, Kenny, who is the same age and lives … [+3033 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Is the Newly Discovered 2025 PN7 a Natural Quasi-Moon or the Zond 1 Mission? - Avi Loeb – Medium", "description": "Is it possible that over the past 4.5 billion years of the Earth’s history, alien civilizations visited the solar System and installed…", "url": "https://avi-loeb.medium.com/is-the-newly-discovered-2025-pn7-a-natural-quasi-moon-or-the-zond-1-mission-011c3ef6c96f", "urlToImage": "https://miro.medium.com/v2/resize:fit:494/1*Hb4HIVmW6bXXWMKcBqGnLw.jpeg", "publishedAt": "2025-10-27T09:50:42Z", "content": "The Venus exploration spacecraft Zond 1, launched by the Soviet Union on April 2, 1964. (Image credit: Wikimedia)\r\nIs it possible that over the past 4.5 billion years of the Earths history, alien civ… [+10698 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Comet 3I/ATLAS to become very active? Harvard scientist's big warning as interstellar object comes closest - The Economic Times", "description": "Interstellar comet 3I/ATLAS is nearing its closest approach to the Sun, a point where its behavior could dramatically change. While scientists largely agree it's a comet, some, like Avi Loeb, suggest its unusual characteristics, including a potential nickel a…", "url": "https://economictimes.indiatimes.com/news/international/global-trends/comet-3i/atlas-to-become-very-active-harvard-scientists-big-warning-as-interstellar-object-comes-closest-to-sun/articleshow/124841020.cms", "urlToImage": "https://img.etimg.com/thumb/msid-124841083,width-1200,height-630,imgsize-2360664,overlay-economictimes/articleshow.jpg", "publishedAt": "2025-10-27T05:42:05Z", "content": "Interstellar comet 3I/ATLAS will reach its closest point to the Sun soon and this encounter will change it in several ways. New images reveal the Manhattan-sized interstellar object 3I/ATLAS has star… [+4799 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Universe “Will End in a Big Crunch,” Physicists Warns - SciTechDaily", "description": "Dark-energy evidence suggests the universe will end in a “big crunch” roughly 20 billion years from now. The universe is nearing the halfway point of what may be a 33-billion-year lifespan, according to new calculations by a Cornell physicist using updated da…", "url": "https://scitechdaily.com/the-universe-will-end-in-a-big-crunch-physicists-warns/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Universe-Explosion.jpg", "publishedAt": "2025-10-26T20:11:15Z", "content": "A Cornell physicist proposes that the universe is only halfway through its 33-billion-year lifespan, and will one day reverse course. Based on new dark-energy data, Henry Tye’s model suggests the cos… [+4784 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Joey Klender", "title": "SpaceX reaches incredible Starlink milestone - Teslarati", "description": "SpaceX has reached an incredible milestone with its Starlink program, officially surpassing 10,000 satellites launched into low Earth orbit since starting the program back in 2019. Last Sunday, October 19, SpaceX launched its 131st and 132nd Falcon 9 missions…", "url": "https://www.teslarati.com/spacex-announces-incredible-starlink-milestone/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2025/10/spacex-starlink-10000-1000x600.jpg", "publishedAt": "2025-10-26T18:38:29Z", "content": "Tesla Full Self-Driving (Supervised) v14 has been out for several weeks now, and there are a tremendous number of improvements, as we have now reached the fourth iteration of the semi-autonomous soft… [+4896 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "Bats in The US Can Glow Ghostly Green, And Scientists Have No Idea Why - ScienceAlert", "description": "The glow-in-the-dark bats you're hanging to decorate for Halloween might be more biologically accurate than you thought.", "url": "https://www.sciencealert.com/bats-in-the-us-can-glow-ghostly-green-and-scientists-have-no-idea-why", "urlToImage": "https://www.sciencealert.com/images/2025/10/glowing_bat_header.jpg", "publishedAt": "2025-10-26T18:02:42Z", "content": "The glow-in-the-dark bats you're hanging to decorate for Halloween might be more biologically accurate than you thought. A new study from scientists at the University of Georgia in the US has confirm… [+2190 chars]"}, {"source": {"id": null, "name": "Archaeologymag.com"}, "author": "Dario Radley", "title": "Neanderthals and early humans reshaped Europe’s landscapes long before the rise of farming, study finds - Archaeology News Online Magazine", "description": "Neanderthals and early humans reshaped Europe’s ecosystems long before farming, altering vegetation through fire and hunting.", "url": "https://archaeologymag.com/2025/10/neanderthals-and-early-humans-reshaped-landscapes/", "urlToImage": "https://archaeologymag.com/wp-content/uploads/neanderthals-reshaped-landscapes-1.jpg", "publishedAt": "2025-10-26T17:42:04Z", "content": "A recent study published in PLOS One reveals that Neanderthals and early modern humans began to reshape Europe’s ecosystems tens of thousands of years before the rise of agriculture. Rather than bein… [+4844 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "MIT physicists just found a way to see inside atoms - Science Daily", "description": "MIT researchers have devised a new molecular technique that lets electrons probe inside atomic nuclei, replacing massive particle accelerators with a tabletop setup. By studying radium monofluoride, they detected energy shifts showing electrons interacting wi…", "url": "https://www.sciencedaily.com/releases/2025/10/251026021734.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/nuclear-magnetization.webp", "publishedAt": "2025-10-26T16:48:32Z", "content": "Physicists at MIT have introduced a technique to study the interior of an atom's nucleus by relying on the atom's own electrons as \"messengers\" inside a molecule.In research published on October 23 i… [+6536 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The math says life shouldn’t exist, but somehow it does - Science Daily", "description": "Life’s origin story just became even more mysterious. Using mathematics and information theory, Robert G. Endres of Imperial College London found that the spontaneous emergence of life from nonliving matter may be far more difficult than scientists once thoug…", "url": "https://www.sciencedaily.com/releases/2025/10/251026021759.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/early-earth-artistic-concept.webp", "publishedAt": "2025-10-26T16:38:21Z", "content": "A groundbreaking study is taking a fresh look at one of science's oldest questions: how did life arise from nonliving material on early Earth? Researcher Robert G. Endres of Imperial College London h… [+2755 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Far Can the Body Go? Scientists Find the Ultimate Limit of Human Endurance - SciTechDaily", "description": "Even the most elite endurance athletes can’t outrun biology. A new study finds that humans hit a metabolic ceiling at about 2.5 times their resting energy burn. When ultra-runners take on races that last for hundreds of miles and continue for several days, th…", "url": "https://scitechdaily.com/?p=498677", "urlToImage": "https://scitechdaily.com/images/Dedicated-Marathon-Runner-on-Road.jpg", "publishedAt": "2025-10-26T16:31:39Z", "content": "Researchers studying elite endurance athletes discovered that even the most extreme competitors cannot surpass a metabolic ceiling, an upper limit of about 2.5 times the body’s basal metabolic rate. … [+4520 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Javier Barbuzano", "title": "Space radiation can produce some organic molecules detected on icy moons - Space", "description": "\"There is no better place to look for [life] than Enceladus,\"", "url": "https://eos.org/articles/space-radiation-can-produce-some-organic-molecules-detected-on-icy-moons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CMZT7rLDrR8LU2h2ALcdZ3-1920-80.jpg", "publishedAt": "2025-10-26T15:00:00Z", "content": "This article was originally published at Eos.\r\n The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights\r\n. \r\nNew laboratory research suggests that some organic mole… [+7645 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Astrobotic delays Griffin-1 lander mission to mid-2026 - SpaceNews", "description": "Astrobotic Technology says it now plans to launch its large lunar lander carrying a commercial rover no earlier than mid-2026.", "url": "http://spacenews.com/astrobotic-delays-griffin-1-lander-mission-to-mid-2026/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/10/griffin1-oct25.jpeg", "publishedAt": "2025-10-26T14:22:34Z", "content": "WASHINGTON Astrobotic Technology says it now plans to launch its large lunar lander carrying a commercial rover no earlier than mid-2026.\r\nThe company said in an Oct. 24 statement that its Griffin-1 … [+2686 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Discover Remnants of Cataclysmically Destroyed Planet That Became Earth - Futurism", "description": "A chemical \"anomaly\" revealed through an analysis of meteorites may have led to finding the first existing evidence of \"proto Earth.\"", "url": "http://futurism.com/science-energy/remnants-planet-before-earth", "urlToImage": "https://futurism.com/wp-content/uploads/2025/10/remnants-planet-before-earth.jpg?quality=85&w=1200", "publishedAt": "2025-10-26T13:45:00Z", "content": "Before Earth, there was “proto Earth,” a primitive hunk of rock that formed four and a half billion years ago. It was drastically different to the Earth we know today, heaving with lava and rock all … [+3577 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "How the Mayans were able to accurately predict solar eclipses for centuries - Phys.org", "description": "The Maya Civilization, from Central America, was one of the most advanced ancient civilizations, known for its significant achievements in astronomy and mathematics. This includes accurate calendars and detailed celestial records, but scientists don't fully u…", "url": "https://phys.org/news/2025-10-mayans-accurately-solar-eclipses-centuries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-research-reveals-h-5.jpg", "publishedAt": "2025-10-26T12:10:01Z", "content": "The Maya Civilization, from Central America, was one of the most advanced ancient civilizations, known for its significant achievements in astronomy and mathematics. This includes accurate calendars … [+3478 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Experiment Reveals What Is Truly Burrowing Beneath Mars's Dunes Each Spring - ScienceAlert", "description": "Strange, sinuous gullies etched into the dunes of Mars are finally giving up their secrets.", "url": "https://www.sciencealert.com/experiment-reveals-what-is-truly-burrowing-beneath-marss-dunes-each-spring", "urlToImage": "https://www.sciencealert.com/images/2025/10/mars_gullies_header.jpg", "publishedAt": "2025-10-26T11:02:31Z", "content": "Strange, sinuous gullies etched into the dunes of Mars are finally giving up their secrets.\r\nThese gouges, new experiments reveal, are carved by the explosive sublimation of dry ice, burrowing down t… [+5150 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Larissa G. Capella", "title": "Weird symmetry between Earth's Northern and Southern Hemispheres appears to be breaking - Live Science", "description": "The Northern Hemisphere is absorbing more sunlight than the Southern Hemisphere, and clouds can no longer keep the balance.", "url": "http://eos.org/articles/new-satellite-data-reveal-a-shift-in-earths-once-balanced-energy-system", "urlToImage": "https://eos.org/wp-content/uploads/2025/10/earth-and-clouds.jpg", "publishedAt": "2025-10-26T11:00:00Z", "content": "Years ago, scientists noted something odd: Earths Northern and Southern Hemispheres reflect nearly the same amount of sunlight back into space. The reason why this symmetry is odd is because the Nort… [+4221 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain’s “Pain Map” Discovered: Scientists Find Opioid-Free Path to Relief - SciTechDaily", "description": "New research reveals that the human brain contains a built-in pain map that activates in different regions when relieving pain in the face, arm, or leg. Researchers at the University of Sydney have revealed a detailed map-like system within the brainstem that…", "url": "https://scitechdaily.com/brains-pain-map-discovered-scientists-find-opioid-free-path-to-relief/", "urlToImage": "https://scitechdaily.com/images/Spinal-Cord-Nerve-Pain-Illustration.jpg", "publishedAt": "2025-10-26T10:41:15Z", "content": "Scientists have discovered that the human brain holds an internal “pain map,” where different areas respond when easing discomfort in the face, arm, or leg. Interestingly, placebo pain relief happens… [+5366 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "'No spacecraft would survive': Europe simulates catastrophic solar storm to warn of real risks - Space", "description": "No spacecraft would be safe in the wake of a solar storm like the 1859 Carrington Event.", "url": "https://www.space.com/astronomy/no-spacecraft-would-survive-europe-simulates-catastrophic-solar-storm-to-warn-of-real-risks", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4VwrH9FbRKeFfJjCDLLKVN-1920-80.jpg", "publishedAt": "2025-10-26T10:00:00Z", "content": "Europe has just run its most extreme space weather simulation yet — a scenario so severe that no spacecraft was left unscathed in the exercise.\r\nThe European Space Agency (ESA) staged the exercise at… [+3140 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Finally See Comet Lemmon On Sunday Before It’s Gone For 1,150 Years - Forbes", "description": "Comet Lemmon — C/2025 A6 (Lemmon) — and Comet SWAN — C/2025 R2 (SWAN) — are the first comets visible in binoculars since Comet Tsuchinshan-ATLAS in October 2024.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/10/26/finally-see-comet-lemmon-on-sunday-before-its-gone-for-1150-years/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5f96edb1737ebdb88039c0a3/0x0.jpg?format=jpg&crop=6720,3780,x0,y347,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-10-26T08:05:00Z", "content": "If youve not seen the two green comets yet, 90 minutes after sunset on Sunday, Oct. 26, is your last best chance before they fade. The brighter Comet Lemmon (C/2025 A6) and much dimmer Comet SWAN (C/… [+4681 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "The First Interstellar Car in NASCAR’s History - Avi Loeb – Medium", "description": "On October 25, 2025, I attended the NASCAR car race in Bakersfield, California. The racers were all ecstatic about the interstellar object…", "url": "https://avi-loeb.medium.com/the-first-interstellar-car-in-nascars-history-fbde92a8e4ec", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*C_njWfZr3weAkHNoUdqOLg.jpeg", "publishedAt": "2025-10-26T07:16:58Z", "content": "Alex Malyckes car at the NASCAR race in Bakersfield, California on October 25, 2025. (Image credit: Loebs photo collection)\r\nOn October 25, 2025, I attended the NASCAR car race in Bakersfield, Califo… [+8109 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Holy Grail of Physics: Scientists Discover New Path to Room-Temperature Superconductors - SciTechDaily", "description": "Penn State scientists have unveiled a new theory-driven method to predict superconductors, offering a possible path toward materials that could conduct electricity perfectly. Electricity travels through wires to deliver power, but some of that energy is alway…", "url": "https://scitechdaily.com/the-holy-grail-of-physics-scientists-discover-new-path-to-room-temperature-superconductors/", "urlToImage": "https://scitechdaily.com/images/Futuristic-Floating-Superconductor.jpg", "publishedAt": "2025-10-26T04:16:36Z", "content": "Scientists at Penn State have developed a groundbreaking way to predict which materials might become superconductors. By combining powerful computer modeling with new theoretical insights, their appr… [+7385 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Leibniz Institute for Astrophysics Potsdam", "title": "4MOST telescope facility captures first light - Phys.org", "description": "On October 18, 2025, the 4-meter Multi-Object Spectroscopic Telescope (4MOST) facility, installed on the VISTA telescope at the European Southern Observatory's (ESO) Paranal Observatory in Chile, obtained its first light. This milestone is a crucial step in t…", "url": "https://phys.org/news/2025-10-4most-telescope-facility-captures.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/4most-captures-first-l.jpg", "publishedAt": "2025-10-26T04:00:01Z", "content": "On October 18, 2025, the 4-meter Multi-Object Spectroscopic Telescope (4MOST) facility, installed on the VISTA telescope at the European Southern Observatory's (ESO) Paranal Observatory in Chile, obt… [+9481 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Danielle Meyers", "title": "Experts make astonishing revelation after waking organisms trapped in ice for millennia: 'These are not dead samples' - Yahoo", "description": "\"They’re still very much capable of hosting robust life.\"", "url": "https://www.yahoo.com/news/articles/experts-astonishing-revelation-waking-organisms-021500780.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/CsEfkrOc1Ns9qktXLbYaTg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/00db572ffbeb3675ca5b74b2f6a90b44", "publishedAt": "2025-10-26T02:15:00Z", "content": "Scientists have made a worrisome discovery in their exploration of Arctic sea ice in Alaska. Deep down in the Permafrost Tunnel Research Facility a research site stretching over 350 feet long and 50 … [+2911 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matthew Williams", "title": "Galactic Empires May Live at the Center of our Galaxy, Hence Why We Don't Hear from Them - Universe Today", "description": "In a recent paper, a team of researchers proposes how humanity may someday relocate its entire civilization near the center of our galaxy to take advantage of the relativistic effects of the supermassive black hole there. They also indicate how other advanced…", "url": "https://www.universetoday.com/articles/galactic-empires-may-live-at-the-center-of-our-galaxy-hence-why-we-dont-hear-from-them", "urlToImage": "https://www.universetoday.com/article_images/12116_20251026_003244.jpg", "publishedAt": "2025-10-26T01:57:00Z", "content": "For over half a century, scientists have struggled to answer Fermi's time-honored question: \"Where is Everybody?\" Answering this question is extremely difficult, partly because of the data-poor natur… [+19798 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What’s Glowing at the Center of Our Galaxy? New Study Points to Dark Matter - SciTechDaily", "description": "New simulations suggest dark matter could explain the mysterious gamma-ray glow at the Milky Way’s center. The findings show that the galaxy’s early mergers may have shaped dark matter in a way that matches NASA’s Fermi telescope observations. A long-standing…", "url": "https://scitechdaily.com/whats-glowing-at-the-center-of-our-galaxy-new-study-points-to-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Gravity-Dark-Matter-Art-Concept.jpg", "publishedAt": "2025-10-25T22:40:58Z", "content": "A team of astrophysicists has breathed new life into the debate over the mysterious gamma-ray glow at the heart of the Milky Way. Credit: SciTechDaily.com\r\nNew simulations suggest dark matter could e… [+3571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Stunned by Bizarre Three-Planet System That Rewrites the Rules of Space - SciTechDaily", "description": "An international team of scientists has announced the discovery of three Earth-sized planets orbiting within the binary star system TOI-2267, located approximately 190 light-years from Earth. An international group of scientists has announced the discovery of…", "url": "https://scitechdaily.com/astronomers-stunned-by-bizarre-three-planet-system-that-rewrites-the-rules-of-space/", "urlToImage": "https://scitechdaily.com/images/Artists-Impression-of-TOI-2267-scaled.jpg", "publishedAt": "2025-10-25T22:15:17Z", "content": "Artist’s impression of TOI-2267. Credit: Mario Sucerquia (University of Grenoble Alpes)\r\nAn international team of scientists has announced the discovery of three Earth-sized planets orbiting within t… [+4998 chars]"}, {"source": {"id": null, "name": "Archaeologymag.com"}, "author": "Dario Radley", "title": "Lead exposure may have influenced brain and language development in early humans and Neanderthals - Archaeology News Online Magazine", "description": "Study suggests early humans’ exposure to lead nearly 2 million years ago may have influenced brain and language evolution.", "url": "https://archaeologymag.com/2025/10/lead-exposure-in-early-humans-and-neanderthals/", "urlToImage": "https://archaeologymag.com/wp-content/uploads/schoningen_wooden-spears-neanderthals-2.jpg", "publishedAt": "2025-10-25T20:11:14Z", "content": "A new study published in Science Advances suggests that humans and their ancestors were exposed to lead nearly two million years ago — and that this toxic element may have shaped the evolution of our… [+3296 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert Staff", "title": "The Mystery of Rain on The Sun Can Finally Be Explained - ScienceAlert", "description": "It rains on the Sun, the gigantic thermonuclear orb that burns with the multi-million-degree 'fires' of fusion.", "url": "https://www.sciencealert.com/the-mystery-of-rain-on-the-sun-can-finally-be-explained", "urlToImage": "https://www.sciencealert.com/images/2025/10/corona_on_sun_header.jpg", "publishedAt": "2025-10-25T18:02:41Z", "content": "It rains on the Sun, the gigantic thermonuclear orb that burns with the multi-million-degree 'fires' of fusion.\r\nThis rain is made of superheated plasma, and researchers might have discovered its sec… [+3505 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Dinosaur 'mummies' preserved so well that artists can recreate their appearance in great detail - Earth.com", "description": "Scientists discovered that some dinosaur “mummies,\" such as Edmontosaurus annectens, weren’t preserved skin but clay molds formed by microbes", "url": "https://www.earth.com/news/dinosaur-mummies-edmontosaurus-annectens-duck-billed-preserved-very-well-skin-clay-molds/", "urlToImage": "https://cff2.earth.com/uploads/2025/10/25112313/duck-billed-dinosaur_mummy_illustration_Dani-Navarro_1m.jpg", "publishedAt": "2025-10-25T17:32:30Z", "content": "More than 66 million years ago, a duck-billed dinosaur named Edmontosaurus annectens left behind something remarkable.\r\nWhen scientists from the University of Chicago revisited its fossil remains in … [+5364 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Psychiatrist Says Mental Illness Starts in Your Cells - SciTechDaily", "description": "Emerging evidence points to energy breakdowns inside brain cells as the root of mental illness. This discovery challenges decades of chemical theories and may lead to therapies that restore cellular power rather than just altering brain chemistry.", "url": "https://scitechdaily.com/?p=498584", "urlToImage": "https://scitechdaily.com/images/Illuminated-Neural-Network-Brain-Cell-Neuron-Connections.jpg", "publishedAt": "2025-10-25T14:52:04Z", "content": "Emerging evidence points to energy breakdowns inside brain cells as the root of mental illness. This discovery challenges decades of chemical theories and may lead to therapies that restore cellular … [+10144 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Earth is splitting open beneath the Pacific Northwest - Science Daily", "description": "For the first time, scientists have seen a subduction zone actively breaking apart beneath the Pacific Northwest. Seismic data show the oceanic plate tearing into fragments, forming microplates in a slow, step-by-step collapse. This process, once only theoriz…", "url": "https://www.sciencedaily.com/releases/2025/10/251025084611.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/deep-crack-subduction-zone-ocean-underwater.webp", "publishedAt": "2025-10-25T14:41:33Z", "content": "For the first time, scientists have directly witnessed a subduction zone -- the place where one tectonic plate plunges beneath another -- in the midst of breaking apart. The finding, published in Sci… [+5561 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Astronomers just captured the sharpest view of a distant star ever seen - Science Daily", "description": "A UCLA-led team has achieved the sharpest-ever view of a distant star’s disk using a groundbreaking photonic lantern device on a single telescope—no multi-telescope array required. This technology splits incoming starlight into multiple channels, revealing pr…", "url": "https://www.sciencedaily.com/releases/2025/10/251025084540.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/asymmetric-disc-around-b-cmi.webp", "publishedAt": "2025-10-25T13:50:29Z", "content": "<ul><li>Sharper views from a single telescope: Normally, astronomers link multiple telescopes together to get the clearest images of distant stars and galaxies. A UCLA-led team has now achieved recor… [+6727 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou", "title": "NASA’s SLS rocket for moonbound Artemis II mission fully stacked at KSC - Orlando Sentinel", "description": "NASA stacked the Artemis II Orion spacecraft atop the Space Launch System rocket at Kennedy Space Center this week ahead of the launch planned for as early as February 2026.", "url": "https://www.orlandosentinel.com/2025/10/25/nasas-sls-rocket-for-moonbound-artemis-ii-mission-fully-stacked-at-ksc/", "urlToImage": "https://www.orlandosentinel.com/wp-content/uploads/2025/10/Lockheed_Martin_NASA__s_Orion_spacecraft.jpg?w=1024&h=797", "publishedAt": "2025-10-25T12:59:01Z", "content": "Despite the ongoing government shutdown, NASA did manage to complete a major milestone in its effort to send astronauts back to moon.\r\nTeams completed the stacking of the Orion spacecraft atop the Sp… [+4324 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Life's Ingredients Found Frozen Beyond The Milky Way For First Time - ScienceAlert", "description": "For the first time, astronomers have seen life's building blocks in ice beyond the borders of our galaxy.", "url": "https://www.sciencealert.com/lifes-ingredients-found-frozen-beyond-the-milky-way-for-first-time", "urlToImage": "https://www.sciencealert.com/images/2025/10/tarantula-chandra.jpg", "publishedAt": "2025-10-25T12:03:04Z", "content": "For the first time, astronomers have seen life's building blocks in ice beyond the borders of our galaxy.\r\nAmong a mix of complex organic molecules trapped in ice circling a newborn star in the Large… [+4571 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Gayoung Lee", "title": "Astronomers Just Found a Sneaky Asteroid Near the Sun—and It Highlights a Dangerous Blind Spot - Gizmodo", "description": "Astronomers can usually spot \"planet killer\" asteroids long before they approach Earth. But what if they can't?", "url": "https://gizmodo.com/astronomers-just-found-a-sneaky-asteroid-near-the-sun-and-it-highlights-a-dangerous-blind-spot-2000675481", "urlToImage": "https://gizmodo.com/app/uploads/2025/10/asteroid-2025-sc79-1200x675.jpg", "publishedAt": "2025-10-25T12:00:44Z", "content": "Millions of asteroids are currently zipping through our solar system. These rocky remnants of the early solar system receive extra attention when their itinerary brings them too close to Earthwhich, … [+2188 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Here's where the James Webb Space Telescope and 4 other legendary spacecraft are in October's night sky - Space", "description": "Here's where 5 of NASA's most famous spacecraft can be found in the October sky.", "url": "https://www.space.com/stargazing/heres-where-the-james-webb-space-telescope-and-4-other-legendary-spacecraft-are-in-the-night-sky-october-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bWCux87uJ7XzhWJgPiJXti-1920-80.jpg", "publishedAt": "2025-10-25T12:00:00Z", "content": "Humanity's understanding of the solar system has evolved dramatically following the advent of spaceflight. Over the past seven decades, thousands of sophisticated spacecraft have been launched on amb… [+8447 chars]"}]}