{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "The Seattle Times"}, "author": "Adithi Ramakrishnan", "title": "NASA’s Parker Solar Probe aims to fly closer to the sun like never before - The Seattle Times", "description": "A NASA spacecraft is about to make the closest approach to the sun.", "url": "https://www.seattletimes.com/seattle-news/science/nasas-parker-solar-probe-aims-to-fly-closer-to-the-sun-like-never-before/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2024/12/urnpublicidap.org69c7041048c12b0741ff54a66118def7NASA_Sun_Flyby_76960.jpg?d=1200x630", "publishedAt": "2024-12-22T14:00:17Z", "content": "NEW YORK (AP) A NASA spacecraft aims to fly closer to the sun than any object sent before. \r\nThe Parker Solar Probe was launched in 2018 to get a close-up look at the sun. Since then, it has flown st… [+1762 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Have Discovered a New Formidable Predator in the Deep Sea - The Daily Galaxy --Great Discoveries Channel", "description": "In the mysterious depths of the ocean, where darkness reigns supreme and pressure reaches unimaginable levels, a new predator has emerged from the shadows. Scientists have recently uncovered a fearsome creature lurking in the hadal zone, challenging our under…", "url": "https://dailygalaxy.com/2024/12/scientists-have-discovered-a-new-formidable-predator-in-the-deep-sea/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/scientists-have-discovered-a-new-formidable-predator-in-the-deep-sea.jpg", "publishedAt": "2024-12-22T13:00:00Z", "content": "Hidden in the extreme depths of the Atacama Trench, a new species of amphipod has been discovered by marine biologists. Named Dulcibella camanchaca, this tiny crustacean measures a mere four centimet… [+4379 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Andrew L. Hipp", "title": "'Rising temperatures melted corpses out of the Antarctic permafrost': The rise of one of Earth's most iconic trees in an uncertain world - Livescience.com", "description": "As the Atlantic grew wider, the ancestral population of all of today's oaks may have been straddling the continents of the Northern Hemisphere. If so, the ancestor of the oaks we know today was a widespread population that was cleaved in half as North America…", "url": "https://www.livescience.com/planet-earth/plants/rising-temperatures-melted-corpses-out-of-the-antarctic-permafrost-the-rise-of-one-of-earths-most-iconic-trees-in-an-uncertain-world", "urlToImage": "https://cdn.mos.cms.futurecdn.net/r98jazVHMMEWGbB3PasFob-1200-80.jpg", "publishedAt": "2024-12-22T11:40:00Z", "content": "In this excerpt from \"Oak Origins: From Acorns to Species and the Tree of Life\r\n\" (University of Chicago Press, 2024), author Andrew L. Hipp\r\n explores the extreme conditions on Earth that gave rise … [+8288 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "47-Million-Year-Old “Alien Plant” Baffles Scientists With Strange Features - SciTechDaily", "description": "The discovery indicates a greater diversity in the fossil record of flowering plants than was previously acknowledged. In 1969, fossilized leaves of Othniophyton elongatum—a name meaning “alien plant”—were discovered in eastern Utah. Initially, scientists spe…", "url": "https://scitechdaily.com/47-million-year-old-alien-plant-baffles-scientists-with-strange-features/", "urlToImage": "https://scitechdaily.com/images/Mysterious-Plant-Fossil.jpg", "publishedAt": "2024-12-22T11:31:48Z", "content": "An strange, extinct plant once thought to be related to modern ginseng is now considered the lone representative of an unknown family. Credit: Florida Museum of Natural History photo by Jeff Gage\r\nTh… [+7868 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Something in Earth's Core May Be Altering The Length of Days - ScienceAlert", "description": "Earth's day-night cycle is defined precisely, each a span of 24 hours before the next begins.", "url": "https://www.sciencealert.com/something-in-earths-core-may-be-altering-the-length-of-days", "urlToImage": "https://www.sciencealert.com/images/2022/09/solar-eclipse-australia.jpg", "publishedAt": "2024-12-22T11:31:42Z", "content": "Earth's day-night cycle is defined precisely, each a span of 24 hours before the next begins. Such is the yardstick by which we live our lives, strictly adhering to the ticking of the clock.\r\nEarth, … [+3926 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "New forms of life discovered inside human bodies - Earth.com", "description": "Researchers find obelisks, mysterious RNA molecules in human bacteria that challenge our understanding of viruses and microscopic life.", "url": "https://www.earth.com/news/scientists-find-new-forms-of-life-inside-humans-rna-carriers-obelisks/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/21101951/obelisks_human-life-forms_rna_viruses_mrna_1.jpg", "publishedAt": "2024-12-22T10:44:50Z", "content": "Every time we think we’re close to fully understanding the human body, something fresh and unexpected shows up. Recently, a team of researchers stumbled upon strange entities, or obelisks, living ins… [+5969 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "How Indigenous traditional knowledge is improving our understanding of aurora borealis - CBC.ca", "description": "While modern science explains the mechanism of the aurora borealis, First Nation, Inuit and Métis knowledge, which goes back thousands of years, can help explain its meaning.", "url": "https://www.cbc.ca/radio/unreserved/how-indigenous-traditional-knowledge-is-improving-our-understanding-of-aurora-borealis-1.7414899", "urlToImage": "https://i.cbc.ca/1.7414921.1734641466!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/joe-buffalo-child-and-the-aurora.jpg?im=Resize%3D620", "publishedAt": "2024-12-22T09:00:00Z", "content": "When Nicholas Flowers was young, he made sure to never whistle at the northern lights. \r\nIt was disrespectful, his grandmother taught him. \"She told me, if you whistle at the northern lights, they ma… [+4556 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking 21-Million Cell Study Revises Our Understanding of Aging - SciTechDaily", "description": "Aging happens in distinct stages marked by synchronized cellular changes across organs, as shown in Rockefeller's largest-ever mammalian aging atlas. Their findings offer clues for targeting aging processes and reveal key age and sex differences in cellular d…", "url": "https://scitechdaily.com/?p=443025", "urlToImage": "https://scitechdaily.com/images/Cells-Time-Clock-scaled.jpg", "publishedAt": "2024-12-22T04:26:31Z", "content": "A large-scale single-cell study shows aging happens in specific stages driven by molecular cues, offering targets to modify the aging process and revealing key age and sex-related cellular difference… [+8230 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "Mario Sáez, Joe Brennan", "title": "Earth set to change forever: a sixth ocean is “on the verge of forming” - AS USA", "description": "The Great Rift Valley in Africa is undergoing a process that could split the continent in two.", "url": "https://en.as.com/latest_news/earth-set-to-change-forever-a-sixth-ocean-is-on-the-verge-of-forming-n/", "urlToImage": "https://img.asmedia.epimg.net/resizer/v2/BAO7FCAIE5EZ5CJUJIEO3ZD5QA.jpg?auth=b62adca4423f3045d2f8cf5430c752a18ca7fdde87d80cb1d782d3eb917daf48&width=1472&height=828&focal=1394%2C893", "publishedAt": "2024-12-22T03:18:07Z", "content": "A geological phenomenon is occurring in the heart of East Africa that could forever alter the Earths map. \r\nA new ocean is in the process of forming, a consequence of tectonic movements that are spli… [+3280 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Nanoscale Imaging And Control Of Altermagnetism In MnTe - Hackaday", "description": "Altermagnetism is effectively a hybrid form of ferromagnetism and antiferromagnetism that might become very useful in magnetic storage as well as spintronics in general. In order to practically use…", "url": "https://hackaday.com/2024/12/21/nanoscale-imaging-and-control-of-altermagnetism-in-mnte/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/07/ferromagnetism_antiferromagnetism_altermagnetism.png", "publishedAt": "2024-12-22T03:00:00Z", "content": "Altermagnetism is effectively a hybrid form of ferromagnetism and antiferromagnetism that might become very useful in magnetic storage as well as spintronics in general. In order to practically use i… [+1523 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Shocking Real-Time Satellite Images Show Greenland’s Ice Sheet Melting at an Unprecedented Rate - The Daily Galaxy --Great Discoveries Channel", "description": "A groundbreaking collaboration between two advanced satellite missions has delivered a clearer picture of what’s happening to Greenland’s vast ice sheet. With one satellite using radar and the other laser technology, scientists are documenting the ice loss wi…", "url": "https://dailygalaxy.com/2024/12/satellite-images-greenland-ice-sheet-melt/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Shocking-Real-Time-Satellite-Images-Show-Greenlands-Ice-Sheet-Melting-at-an-Unprecedented-Rate.jpg", "publishedAt": "2024-12-21T23:35:50Z", "content": "Greenlands vast ice sheet, a critical component of Earths climate system, is melting at a pace that has alarmed scientists and policymakers alike. The sheer scale of ice loss in recent years undersco… [+5410 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Discovery Straight Out of Sci-Fi: Astronomers Spot 'Star Twins' in Deadly Dance Around Milky Way’s Black Hole - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have uncovered something extraordinary lurking near the Milky Way’s supermassive black hole—an unexpected celestial pairing defying all odds. This discovery could answer a decades-old mystery about stars racing through space at unimaginable speeds…", "url": "https://dailygalaxy.com/2024/12/a-discovery-straight-out-of-sci-fi-astronomers-spot-star-twins-in-deadly-dance-around-milky-ways-black-hole/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/A-laser-aims-at-the-centre-of-our-galaxy-in-the-heart-of-the-brightest-part-of-the-Milky-Way.-.jpg", "publishedAt": "2024-12-21T22:46:12Z", "content": "In a find that could rewrite what we know about the most extreme parts of our galaxy, a team of astronomers has discovered a binary star system orbiting the supermassive black hole Sagittarius A* at … [+4843 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Discovered Magic at the Large Hadron Collider - SciTechDaily", "description": "Researchers at the Large Hadron Collider have found that top quarks exhibit a property known as magic, which could advance quantum computing. The study, conducted by twin professors shows that the level of magic in top quarks can inform the necessity for quan…", "url": "https://scitechdaily.com/scientists-just-discovered-magic-at-the-large-hadron-collider/", "urlToImage": "https://scitechdaily.com/images/Quantum-Physics-Particle-Wave-Art-Illustration.jpg", "publishedAt": "2024-12-21T21:25:57Z", "content": "Research from the LHC shows top quarks’ magic could be key to quantum computing advancements, potentially revolutionizing various technologies. Credit: SciTechDaily.com\r\nResearchers at the Large Hadr… [+3322 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "SpaceX launches second mid-inclination rideshare mission - SpaceNews", "description": "SpaceX launched 30 satellites Dec. 21 on the second in a series of dedicated rideshare missions to mid-inclination orbits.", "url": "http://spacenews.com/spacex-launches-second-mid-inclination-rideshare-mission/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/12/f9-bandwagon2.jpg?resize=1200%2C1200&quality=89&ssl=1", "publishedAt": "2024-12-21T20:59:25Z", "content": "WASHINGTON SpaceX launched 30 satellites Dec. 21 on the second in a series of dedicated rideshare missions to mid-inclination orbits.\r\nA Falcon 9 lifted off from Vandenberg Space Force Base in Califo… [+3258 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Marcia Dunn, Associated Press", "title": "How old are Saturn's rings? Study suggests they could be 4.5 billion years old just like the planet - KSL.com", "description": "New research suggests that Saturn's rings may be older than they look — possibly as old as the planet.", "url": "https://www.ksl.com/article/51212082/how-old-are-saturns-rings-study-suggests-they-could-be-45-billion-years-old-just-like-the-planet", "urlToImage": "https://img.ksl.com/slc/3031/303142/30314285.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2024-12-21T20:06:45Z", "content": "CAPE CANAVERAL, Fla. New research suggests that Saturn's rings may be older than they look possibly as old as the planet.\r\nInstead of being a youthful 400 million years old as commonly thought, the i… [+1732 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How are auroras made? Space rocket takes a closer look at the Northern Lights - Earth.com", "description": "What happens at the particle level when aurora lights dance in rapid, shape-shifting arcs. An experiment called KiNET-X found out.", "url": "https://www.earth.com/news/kinetx-rocket-experiment-how-are-auroras-made-closer-look-at-northern-lights/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/21113946/auroras_northern-lights_alaska_green-purple_1m.jpg", "publishedAt": "2024-12-21T19:02:21Z", "content": "The Northern Lights, also called the Aurora Borealis, have long fascinated people around the world. They appear as vibrant ribbons of green, pink, purple, and red that seem to move and shift across d… [+6199 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dark Energy Debunked: Scientists Claim Accelerated Expansion of the Universe Is Just an 'Illusion' - The Daily Galaxy --Great Discoveries Channel", "description": "Is the universe truly accelerating, or have we been deceived by the fabric of time itself? For years, dark energy was the answer to explain this cosmic mystery, but a bold new theory suggests it may not exist at all.", "url": "https://dailygalaxy.com/2024/12/dark-energy-debunked-scientists-claim-accelerated-expansion-of-the-universe-is-just-an-illusion/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Dark-energy-Outer-Spac.jpg", "publishedAt": "2024-12-21T18:31:51Z", "content": "For decades, dark energy has dominated cosmology, thought to account for nearly 70% of the universes energy density and driving the accelerated expansion observed in the cosmos. However, groundbreaki… [+3910 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "James Webb telescope solves 20-year-old Hubble conundrum — and it could finally explain why the universe's oldest planets exist - Livescience.com", "description": "The James Webb Space Telescope has confirmed 20-year-old Hubble observations that could finally explain how ancient stars can host massive planets.", "url": "https://www.livescience.com/space/astronomy/james-webb-telescope-solves-20-year-old-hubble-conundrum-and-it-could-finally-explain-why-the-universes-oldest-planets-exist", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YFQzmr8ZFGLVbZK9aMbo5n-1200-80.jpg", "publishedAt": "2024-12-21T18:00:00Z", "content": "The James Webb Space Telescope\r\n (JWST) has just solved a 20-year-old mystery about how ancient stars could host massive planets.\r\nIn the early 2000s, the Hubble Space Telescope observed the oldest p… [+3651 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Astronomers Were Watching a Black Hole When It Suddenly Exploded With Gamma Rays - Futurism", "description": "The hole in the first-ever image of a black hole released a massive burp of gamma rays while astronomers were staring at it.", "url": "https://futurism.com/the-byte/black-hole-exploded-gamma-ray-burst", "urlToImage": "https://wordpress-assets.futurism.com/2024/12/black-hole-exploded-gamma-ray-burst.jpg", "publishedAt": "2024-12-21T17:00:12Z", "content": "Woah.\r\nBlast Radius\r\nIn 2018, astronomers took the first-ever picture of a black hole, a fascinating and unprecedented glimpse of an event horizon.\r\nAnd as it turns out, the black hole dubbed M87* an… [+2818 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Lucy could barely run - what does that say about our ancestors? - Earth.com", "description": "Lucy's species walked upright but lacked modern running abilities, revealing key evolutionary adaptations in humans.", "url": "https://www.earth.com/news/lucy-could-barely-run-what-does-that-say-about-our-ancestors/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/21083649/Lucy_Australopithecus-afarensis_human-ancestor_could-not-run_credit-GNU_1m.jpg", "publishedAt": "2024-12-21T16:22:02Z", "content": "Humans have a knack for getting around on two legs. Many of us take a long run for granted, trotting along city streets or forest trails without giving it much thought.\r\nUnlike ancient human ancestor… [+5271 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "The genomic journey of modern and archaic humans may be older than we thought - Phys.org", "description": "Research conducted at the Department of Biology, University of Padova, has identified critical genomic milestones in the evolution of Homo sapiens, including key chromosomal rearrangements and specific gene variants that contributed to the development of curr…", "url": "https://phys.org/news/2024-12-genomic-journey-modern-archaic-humans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/homo-sapiens.jpg", "publishedAt": "2024-12-21T15:00:01Z", "content": "Research conducted at the Department of Biology, University of Padova, has identified critical genomic milestones in the evolution of Homo sapiens, including key chromosomal rearrangements and specif… [+5987 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "University of Iowa", "title": "Salt-seeking behavior traced to specific brain neurons - Medical Xpress", "description": "Salt, or more precisely the sodium it contains, is very much a \"Goldilocks\" nutrient. Low sodium levels cause a drop in blood volume, which can have serious, sometimes deadly, health consequences. Conversely, too much salt can lead to high blood pressure and …", "url": "https://medicalxpress.com/news/2024-12-salt-behavior-specific-brain-neurons.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/neuron.jpg", "publishedAt": "2024-12-21T14:46:46Z", "content": "Salt, or more precisely the sodium it contains, is very much a \"Goldilocks\" nutrient. Low sodium levels cause a drop in blood volume, which can have serious, sometimes deadly, health consequences. Co… [+5508 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Tea bags release millions of plastic particles during brewing - Earth.com", "description": "Polymer tea bags release billions of plastic particles during brewing. They interact with intestinal cells, even entering the nuclei.", "url": "https://www.earth.com/news/tea-bags-release-millions-of-plastic-particles-during-brewing/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/21073952/Tea-bags-plastic.jpg", "publishedAt": "2024-12-21T14:41:58Z", "content": "You might think of tea as a comforting, soothing ritual. But, scientists at Universitat Autònoma de Barcelona (UAB) have made a startling discovery – infusing tea through commercial tea bags might be… [+4660 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Doorstop Rock Used for Decades Turns Out to Be a $1 Million Treasure - The Daily Galaxy --Great Discoveries Channel", "description": "What would you do if a simple object in your home turned out to be worth a fortune? For one family in a small Romanian village, a decades-old household item turned out to be a treasure of unimaginable value, steeped in geological and historical significance. …", "url": "https://dailygalaxy.com/2024/12/doorstop-rock-turns-out-1-million-treasure/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Doorstop-Rock-Used-for-Decades-Turns-Out-to-Be-a-1-Million-Treasure.jpg", "publishedAt": "2024-12-21T14:21:58Z", "content": "Sometimes, the most astonishing discoveries are hiding in plain sight, disguised as the ordinary. In a quiet Romanian village, what seemed like an unremarkable household object turned out to be a tre… [+5038 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "How to see the Ursids, the final meteor shower that peaks in 2024 - CNN", "description": "Keep an eye on the sky during the early morning hours on Sunday to catch a glimpse of the Ursids, the final meteor shower expected to peak this year.", "url": "https://www.cnn.com/2024/12/21/science/ursid-meteor-shower-december-2024/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1364075682-20241220145746337.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-12-21T14:00:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nLook up to see the Ursid meteor shower, the final cele… [+3504 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ben Simon, Issam Ahmed in Washington", "title": "Scientists observe 'negative time' in quantum experiments - Phys.org", "description": "Scientists have long known that light can sometimes appear to exit a material before entering it—an effect dismissed as an illusion caused by how waves are distorted by matter.", "url": "https://phys.org/news/2024-12-scientists-negative-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/experimental-physicist-1.jpg", "publishedAt": "2024-12-21T12:23:37Z", "content": "Scientists have long known that light can sometimes appear to exit a material before entering itan effect dismissed as an illusion caused by how waves are distorted by matter.\r\nNow, researchers at th… [+4818 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ars Contributors", "title": "Scientists explore frozen scars and fiery sands on the seafloor - Ars Technica", "description": "Researchers found a fossilized seascape while studying the impact of a volcanic eruption.", "url": "https://arstechnica.com/science/2024/12/scientists-explore-frozen-scars-and-fiery-sands-on-the-seafloor/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/img1122-1152x648.jpg", "publishedAt": "2024-12-21T11:09:39Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Plans for ‘Continuous Heartbeat’ in Space After ISS Retirement - Gizmodo", "description": "The space agency is looking to maintain human presence in the microgravity environment as it transitions to commercial stations.", "url": "https://gizmodo.com/nasa-plans-for-continuous-heartbeat-in-space-after-iss-retirement-2000539863", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/international-space-station.jpeg", "publishedAt": "2024-12-21T11:00:40Z", "content": "The International Space Station (ISS) has served as home to astronauts for nearly 30 years but the aging spacecraft is set to retire by the end of the decade, leaving behind a major gap in low Earth … [+3321 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NASA", "title": "Lab work digs into gullies seen on giant asteroid Vesta by NASA's Dawn - Phys.org", "description": "Pocked with craters, the surfaces of many celestial bodies in our solar system provide clear evidence of a 4.6-billion-year battering by meteoroids and other space debris. But on some worlds, including the giant asteroid Vesta that NASA's Dawn mission explore…", "url": "https://phys.org/news/2024-12-lab-gullies-giant-asteroid-vesta.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/lab-work-digs-into-gul-1.jpg", "publishedAt": "2024-12-21T10:30:01Z", "content": "Pocked with craters, the surfaces of many celestial bodies in our solar system provide clear evidence of a 4.6-billion-year battering by meteoroids and other space debris. But on some worlds, includi… [+5207 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Mars is littered with junk. Historians want to save it. - Mashable", "description": "One spacefarer's trash is another's treasure.", "url": "https://mashable.com/article/mars-catalog-man-made-material-junk-trash", "urlToImage": "https://helios-i.mashable.com/imagery/articles/00gw6vEWFts1pbJjQZBHoUF/hero-image.fill.size_1200x675.v1734713978.jpg", "publishedAt": "2024-12-21T10:30:00Z", "content": null}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Time to reset global navigation as Earth’s magnetic North Pole shifts - Interesting Engineering", "description": "Earth's magnetic north pole is shifting, forcing an update to the World Magnetic Model (WMM), which is used by navigation systems worldwide.", "url": "https://interestingengineering.com/science/earths-magnetic-north-pole-shifting-to-russia", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/12/earth-magnetic-field-1.jpg", "publishedAt": "2024-12-21T10:05:00Z", "content": "However, In the past 20 years, it accelerated towards Siberia, increasing in speed every year until about five years ago, when it suddenly decelerated from 50 to 35 km (31 to 22 miles) per year, whic… [+826 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "David Propper", "title": "Prehistoric mastodon jaw found in backyard by NY homeowner who spotted teeth sticking up from soil - AOL", "description": "An intact prehistoric mastodon jaw was discovered in the backyard of a Hudson Valley house after the homeowner initially saw a pair of teeth poking up by a p...", "url": "https://nypost.com/2024/12/17/us-news/prehistoric-mastodon-jaw-found-in-backyard-by-ny-homeowner-who-spotted-teeth-sticking-up-from-soil/?utm_source=aol&amp;utm_campaign=nypost&amp;utm_medium=referral", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kdp5i8qtGeY5i1svYtXWGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/aol_ny_post_us_news_articles_123/c6f5758f1841b7f145a43db03123bc5b", "publishedAt": "2024-12-21T09:46:28Z", "content": "Life size replica of a woolly mammoth skeleton on display at Shanghai Natural History Museum, taken on April 13, 2018\r\nIts a gigantic find.\r\nAn intact prehistoric mastodon jaw was discovered in the b… [+2013 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Mirror Bacteria” Warning: A New Kind of Life Could Pose a Global Threat - SciTechDaily", "description": "Mirror life, a concept involving synthetic organisms with reversed molecular structures, carries significant risks despite its potential for medical advancements. Experts warn that mirror bacteria could escape natural biological controls, potentially evolving…", "url": "https://scitechdaily.com/mirror-bacteria-warning-a-new-kind-of-life-could-pose-a-global-threat/", "urlToImage": "https://scitechdaily.com/images/Mirror-Life-Biology-Art-Concept.jpg", "publishedAt": "2024-12-21T09:18:49Z", "content": "Mirror life presents serious dangers, primarily due to its potential to interact unpredictably with the natural world. Without natural checks like predators or antibiotics, mirror organisms could rep… [+7971 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Retired military weather satellite breaks up - SpaceNews", "description": "A defunct military weather satellite has broken up in orbit and created more than 50 pieces of debris, the latest in a series of similar incidents.", "url": "http://spacenews.com/retired-military-weather-satellite-breaks-up/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2015/02/DMSP-USAF-e1458009205961.jpg?fit=1000%2C800&quality=89&ssl=1", "publishedAt": "2024-12-20T23:07:49Z", "content": "WASHINGTON A defunct military weather satellite has broken up in orbit and created more than 50 pieces of debris, the latest in a series of similar incidents involving that line of spacecraft.\r\nThe U… [+2093 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "The Ol Doinyo Lengai Volcano's Lava Flows Are So Cold It's Possible To Fall In And Survive - IFLScience", "description": "Ol Doinyo Lengai, or “Mountain of God”, is a contender for the weirdest volcano in the world.", "url": "https://www.iflscience.com/the-ol-doinyo-lengai-volcanos-lava-flows-are-so-cold-its-possible-to-fall-in-and-survive-77314", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77314/aImg/80998/ol-doinyo-lengai-volcano-meta.png", "publishedAt": "2024-12-20T22:44:45Z", "content": "If there's one thing you, and Gollum, should know about volcanoes, it's that \"lava=hot\". That, and it's not a great idea to attempt to plug them up with concrete.\r\nBut some volcanos are hotter than o… [+2028 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Abbey A. Donaldson", "title": "NASA Selects Four Commercial Companies to Support Near Space Network - NASA", "description": "NASA has selected multiple companies to expand the agency’s Near Space Network’s commercial direct-to-Earth capabilities services, which is a mission-critical", "url": "https://www.nasa.gov/news-release/nasa-selects-four-commercial-companies-to-support-near-space-network/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/04/nasa_meatball_4.png", "publishedAt": "2024-12-20T22:41:15Z", "content": "NASA has selected multiple companies to expand the agencys Near Space Networks commercial direct-to-Earth capabilities services, which is a mission-critical communication capability that allows space… [+3456 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Gabe Castro-Root", "title": "Space2Sea Antarctica: A student journalist's expedition to bottom of the world begins - Yahoo! Voices", "description": "Space2Sea Antarctica: A student journalist's expedition to bottom of the world begins", "url": "https://www.space.com/space-exploration/missions/space2sea-antarctica-a-student-journalists-expedition-to-bottom-of-the-world-begins", "urlToImage": "https://media.zenfs.com/en/space_311/6dd042d89663edef767ddfc15d91e034", "publishedAt": "2024-12-20T21:44:26Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nCredit: Space2Sea via Instagram\r\nSpace2Sea Antarctica marks the inaugural voyage in a series pr… [+2798 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Eleanor Higgs", "title": "Velvet Ants' Rare Ultrablack Markings Are So Dark They Absorb Nearly All Visible Light - IFLScience", "description": "They absorb most ultraviolet light too.", "url": "https://www.iflscience.com/velvet-ants-rare-ultrablack-markings-are-so-dark-they-absorb-nearly-all-visible-light-77335", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77335/aImg/81020/traumatomutilla-bifurca-meta.png", "publishedAt": "2024-12-20T21:31:03Z", "content": "The animal world goes in hard for impressive colors, from those that blend in perfectly with their surroundings to those born to stand out and seem dressed to impress. However, new research has revea… [+2886 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rice University", "title": "Researchers take 'significant leap forward' with quantum simulation of molecular electron transfer - Phys.org", "description": "Researchers at Rice University have made a meaningful advance in the simulation of molecular electron transfer—a fundamental process underpinning countless physical, chemical and biological processes. The study, published in Science Advances, details the use …", "url": "https://phys.org/news/2024-12-significant-quantum-simulation-molecular-electron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/rice-researchers-take.jpg", "publishedAt": "2024-12-20T21:22:03Z", "content": "Researchers at Rice University have made a meaningful advance in the simulation of molecular electron transfera fundamental process underpinning countless physical, chemical and biological processes.… [+5726 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA’s Proposed Mars ‘Chopper’ Is Ingenuity on Steroids - Gizmodo", "description": "The otherworldly helicopter, with its 36 blades, is the size of an SUV—a major upgrade from Ingenuity's four blades.", "url": "https://gizmodo.com/nasas-proposed-mars-chopper-is-ingenuity-on-steroids-2000541828", "urlToImage": "https://gizmodo.com/app/uploads/2024/12/Mars-Chopper.jpg", "publishedAt": "2024-12-20T21:20:40Z", "content": "Almost a year after Ingenuity broke a blade and ended its experimental stint on Mars, NASA unveiled a new design concept for the Martian helicopter’s successor and it’s comparatively a big boy.\r\nNASA… [+2657 chars]"}, {"source": {"id": null, "name": "OregonLive"}, "author": "The Associated Press", "title": "Humans arrived in Americas earlier than previously thought, co-existed with mastodons, researchers believe - OregonLive", "description": "Giant sloths and mastodons lived with humans for millennia in the Americas, new discoveries suggest.", "url": "https://www.oregonlive.com/environment/2024/12/humans-arrived-in-americas-earlier-than-previously-thought-co-existed-with-mastodons-researchers-believe.html", "urlToImage": "https://www.oregonlive.com/resizer/v2/ICLXTIDW3ZCGXLNYCO2HI7FFRY.jpg?auth=5801ab96c1eb64458f62905202636e1f539b8d1f603ca38aa3757a4594af3852&width=1280&quality=90", "publishedAt": "2024-12-20T21:14:00Z", "content": "SAO PAULO Sloths werent always slow-moving, furry tree-dwellers. Their prehistoric ancestors were huge up to 4 tons and when startled, they brandished immense claws.\r\nFor a long time, scientists beli… [+8437 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Rocket Report: Waiting for New Glenn; SpaceX takes a launch from ULA - Ars Technica", "description": "ULA’s Vulcan rocket is at least several months away from flying again, and Stoke names its engine.", "url": "https://arstechnica.com/science/2024/12/rocket-report-waiting-for-new-glenn-spacex-takes-a-launch-from-ula/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/zenith2-1152x648.jpg", "publishedAt": "2024-12-20T19:40:02Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launching 4 'MicroGEO' satellites to orbit tonight - Space.com", "description": "Liftoff is scheduled for 10:39 p.m. ET tonight (Dec. 20).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launching-4-microgeo-satellites-to-orbit-tonight", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8DLZrmbP9RV4bdunnLmHa4-1200-80.jpg", "publishedAt": "2024-12-20T19:27:00Z", "content": "SpaceX plans to launch four small communications satellites to a high Earth orbit from Florida's Space Coast tonight (Dec. 20).\r\nA Falcon 9 rocket carrying four \"MicroGEO\" satellites built by San Fra… [+2391 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Tiny sensors can detect dehydration before it destroys crops - Earth.com", "description": "Researchers present an innovative plant sensor that detects dryness 48 hours in advance, helping farmers effectively combat drought.", "url": "https://www.earth.com/news/tiny-sensors-can-detect-dehydration-before-it-destroys-crops/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/19034208/tiny-tools-detect-drought-before-destroying-crops.jpg", "publishedAt": "2024-12-20T19:21:42Z", "content": "In many parts of the world, drought leaves farmers struggling. Dry fields often translate into puny harvests and financial heartache.\r\nTraditional methods of checking plants for dryness are slow, and… [+4320 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Baylor College of Medicine", "title": "Discovery of norovirus replication hubs offers new antiviral targets - Medical Xpress", "description": "Human norovirus, a positive-strand RNA virus that is the leading cause of viral gastroenteritis accounting for an estimated 685 million cases and approximately 212,000 deaths globally per year, has no approved vaccines or antivirals.", "url": "https://medicalxpress.com/news/2024-12-discovery-norovirus-replication-hubs-antiviral.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/norovirus.jpg", "publishedAt": "2024-12-20T19:00:01Z", "content": "Human norovirus, a positive-strand RNA virus that is the leading cause of viral gastroenteritis accounting for an estimated 685 million cases and approximately 212,000 deaths globally per year, has n… [+6365 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Axiom's private space station is coming sooner than we thought - Space.com", "description": "Axiom Station could become a free flyer as early as 2028.", "url": "https://www.space.com/space-exploration/private-spaceflight/axioms-private-space-station-is-coming-sooner-than-we-thought", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wQ37UCVcHgbSukXqimH2Dm-1200-80.jpg", "publishedAt": "2024-12-20T19:00:00Z", "content": "Axiom Space has decided to change up the method for assembling its commercial space station.\r\nBy revising the order in which it will launch the station's modules to Earth orbit, Axiom Space\r\n will be… [+3655 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Adam Zewe | MIT News", "title": "Tiny, wireless antennas use light to monitor cellular communication - MIT News", "description": "MIT researchers developed a biosensing technique that eliminates the need for wires. Instead, tiny, wireless antennas use light to detect minute electrical signals in the solution around them.", "url": "https://news.mit.edu/2024/tiny-wireless-antennas-use-light-monitor-cellular-communication-1220", "urlToImage": "https://news.mit.edu/sites/default/files/images/202412/MIT_Organic-Antenna-01-press.jpg", "publishedAt": "2024-12-20T19:00:00Z", "content": "Monitoring electrical signals in biological systems helps scientists understand how cells communicate, which can aid in the diagnosis and treatment of conditions like arrhythmia and Alzheimers.\r\nBut … [+7556 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Benjamin Taub", "title": "Did Humans Almost Go Extinct 900,000 Years Ago? - IFLScience", "description": "The further back you go in time, the more our genomes merge, making it difficult to model ancient populations.", "url": "https://www.iflscience.com/did-humans-almost-go-extinct-900000-years-ago-77282", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77282/aImg/80952/human-extinction-meta.jpg", "publishedAt": "2024-12-20T18:46:58Z", "content": "In 2023, a controversial study introduced a dramatic twist to the story of human history by suggesting that our species came to within a whisker of extinction almost a million years ago. Published in… [+4920 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Spin Liquids Are Real – and Could Change Technology Forever - SciTechDaily", "description": "Scientists have found evidence of a strange state of matter called a quantum spin liquid in a material known as pyrochlore cerium stannate. In this mysterious state, magnetic particles don’t settle into a fixed pattern but stay in constant motion, even at ext…", "url": "https://scitechdaily.com/quantum-spin-liquids-are-real-and-could-change-technology-forever/", "urlToImage": "https://scitechdaily.com/images/Physics-Quantum-Spin-Concept-Art.jpg", "publishedAt": "2024-12-20T18:01:06Z", "content": "Scientists confirmed a quantum spin liquid in a magnetic material, where particles remain in constant motion. This discovery could shape future advancements in quantum technology. Credit: SciTechDail… [+7959 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Watch NASA's Artemis Orion moon spacecraft blow its top during testing (video) - Yahoo! Voices", "description": "NASA's Orion spacecraft recently completed an 11-month test campaign, during which it was subjected to extreme conditions of a launch abort scenario and...", "url": "https://www.space.com/space-exploration/artemis/watch-nasas-artemis-orion-moon-spacecraft-blow-its-top-during-testing-video", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/RotXrOzm64MHQHWzul3zkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/d1949e29b8f210981421a06f15797eb8", "publishedAt": "2024-12-20T18:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nCredit: NASA/Quentin Schwinn \r\nAn uncrewed Orion spacecraft\r\n successfully traveled thousands o… [+4564 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Jonny Thomson", "title": "Everyday Philosophy: Bad at probability? That might be a blessing. - Big Think", "description": "How black and white is your thinking?", "url": "https://bigthink.com/thinking/everyday-philosophy-bad-at-probability-that-might-be-a-blessing/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/12/EP-Percentile-of-Intelligence.jpg?resize=1200,630", "publishedAt": "2024-12-20T17:21:41Z", "content": null}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Sixty Years Ago, We Nearly Wiped Out Bed Bugs. Then, They Started Changing - ZME Science", "description": "Driven to the brink of extinction, bed bugs adapted—and now pesticides are almost useless against them.", "url": "https://www.zmescience.com/science/biology/sixty-years-ago-we-nearly-wiped-out-bed-bugs-then-they-started-changing/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2024/12/image-from-rawpixel-id-2288471-jpeg-scaled-1.jpg", "publishedAt": "2024-12-20T16:26:20Z", "content": "A left lateral view of a common bed bug. Image credits: Centers for Disease Control and Prevention. \r\nIn the 1960s, bed bugs seemed doomed. After centuries of living in the shadows and tormenting hum… [+6123 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "NASA Mars probe spies dusty, retired Insight lander from orbit (photo) - Space.com", "description": "\"Even though we're no longer hearing from InSight, it's still teaching us about Mars.\"", "url": "https://www.space.com/the-universe/mars/nasa-mars-probe-spies-dusty-retired-insight-lander-from-orbit-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EYjTFsSZdzGvwkUHrtVtqQ-1200-80.jpg", "publishedAt": "2024-12-20T16:00:00Z", "content": "NASA's InSight lander continues to contribute valuable knowledge about Mars, even after its retirement.\r\nPhotos captured in late October by NASA's Mars Reconnaissance Orbiter\r\n (MRO) show InSight\r\n r… [+3357 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "10 fascinating discoveries about Neanderthals in 2024, from 'Thorin' the last Neanderthal to an ancient glue factory - Livescience.com", "description": "This year, we learned that our Neanderthal cousins were a lot like us, despite treading their own path that ended in extinction.", "url": "https://www.livescience.com/archaeology/10-fascinating-discoveries-about-neanderthals-in-2024-from-thorin-the-last-neanderthal-to-an-ancient-glue-factory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/waiNnxX4cmTZbcjv8VCqtG-1200-80.jpg", "publishedAt": "2024-12-20T16:00:00Z", "content": "People have been fascinated by Neanderthals\r\n ever since we discovered their bones in a German cave in the mid-19th century. Their stocky bodies and huge heads give us a fun-house-mirror glimpse into… [+9647 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Two Lunar Landers Are Headed for Ancient Impact Sites. What You Need to Know - Gizmodo", "description": "SpaceX is gearing up to send a duo of landers to the Moon this January.", "url": "https://gizmodo.com/two-lunar-landers-are-headed-for-ancient-impact-sites-what-you-need-to-know-2000541102", "urlToImage": "https://gizmodo.com/app/uploads/2024/12/firefly-blue-ghost-mission-3-rendering.jpg", "publishedAt": "2024-12-20T15:35:23Z", "content": "The Moon is the place to be right now. Commercial spacecraft are gearing up to land on the lunar surface, unboxing an array of tools and instruments to explore different regions of the Moon. Two of t… [+3236 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "IceCube Just Spent 10 Years Searching for Dark Matter - Universe Today", "description": "Neutrinos are tricky little blighters that are hard to observe. The IceCube Neutrino Observatory in Antarctica was built to detect neutrinos from space. It is one of the most sensitive instruments built with the hope it might help uncover evidence for dark ma…", "url": "https://www.universetoday.com/170190/icecube-just-spent-10-years-searching-for-dark-matter/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/12/IceCube.jpeg", "publishedAt": "2024-12-20T15:17:36Z", "content": "Neutrinos are tricky little blighters that are hard to observe. The IceCube Neutrino Observatory in Antarctica was built to detect neutrinos from space. It is one of the most sensitive instruments bu… [+3547 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "The Theory That Volcanoes Killed the Dinosaurs Is Officially Extinct - Gizmodo", "description": "The end of the Cretaceous period saw disastrous geological and astronomical events, but researchers say that one in particular is to blame for the mass extinction.", "url": "https://gizmodo.com/the-theory-that-volcanoes-killed-the-dinosaurs-is-officially-extinct-2000541485", "urlToImage": "https://gizmodo.com/app/uploads/2024/12/dinosaur-fossil-extinction.jpg", "publishedAt": "2024-12-20T15:10:11Z", "content": "For years, scientists have floated an alternative theory to explain the extinction of the dinosaursone involving extreme volcanism. Its an intriguing idea, but new research seems to have finally put … [+3929 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "Scientists peered into a secret Antarctic lake hidden beneath the ice — and uncovered a never-before-seen ecosystem - Livescience.com", "description": "Scientists investigating the frozen Lake Enigma in Antarctica discovered an ecosystem teeming with strange microbial communities.", "url": "https://www.livescience.com/planet-earth/antarctica/scientists-peered-beneath-a-frozen-antarctic-lake-and-uncovered-a-never-before-seen-ecosystem", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MTobDEdrwKhUSX5mNcZF3F-1200-80.jpg", "publishedAt": "2024-12-20T15:01:20Z", "content": "Antarctica's Lake Enigma certainly lives up to its name. The permanently ice-covered lake, named for the peculiar cone of debris at its center, was until recently thought to be frozen solid. But scie… [+2992 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "James Webb Telescope Unveils a Napping Monster Black Hole in the Early Universe - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists using the James Webb Space Telescope (JWST) have uncovered a dormant supermassive black hole, 400 million times the mass of the Sun, lurking in the early universe just 800 million years after the Big Bang. This discovery challenges long-standing th…", "url": "https://dailygalaxy.com/2024/12/james-webb-napping-monster-black-hole/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/James-Webb-Telescope-Unveils-a-Napping-Monster-Black-Hole-in-the-Early-Universe.jpg", "publishedAt": "2024-12-20T14:45:00Z", "content": "The James Webb Space Telescope (JWST) has uncovered a dormant supermassive black hole in the early universe, reshaping how scientists understand the growth and evolution of these cosmic giants. Detec… [+4893 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Latest gravitational wave observations conflict with expectations from stellar models - Phys.org", "description": "Almost 300 binary mergers have been detected so far, indicated by their passing gravitational waves. These measurements from the world's gravitational wave observatories put constraints on the masses and spins of the merging objects such as black holes and ne…", "url": "https://phys.org/news/2024-12-latest-gravitational-conflict-stellar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/latest-gravitational-w.jpg", "publishedAt": "2024-12-20T14:40:18Z", "content": "Almost 300 binary mergers have been detected so far, indicated by their passing gravitational waves. These measurements from the world's gravitational wave observatories put constraints on the masses… [+6775 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Enough water to fill trillions of oceans found circling a quasar - Earth.com", "description": "Astronomers have identified a remarkable water reservoir in deep space, circling a huge quasar more than 12 billion light-years away.", "url": "https://www.earth.com/news/enough-water-to-fill-trillions-of-earths-oceans-found-circling-black-hole-quasar/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/19192423/quasar_massive-water-detection_140-trillion-times-earth_1m.jpg", "publishedAt": "2024-12-20T02:49:04Z", "content": "Astronomers have identified a remarkable water reservoir hidden in a corner of the cosmos, circling a quasar more than 12 billion light-years away.\r\nAt that distance, the light we see today began its… [+7154 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "SpaceX Reportedly Lost Communication With Private Astronaut Mission Before Historic Spacewalk - Gizmodo", "description": "The incident raises concerns about companies failing to disclose issues during commercial spaceflight missions.", "url": "https://gizmodo.com/spacex-reportedly-lost-communication-with-private-astronaut-mission-before-historic-spacewalk-2000540517", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/Polaris-Dawn-Spacewalk.jpg", "publishedAt": "2024-12-18T20:36:31Z", "content": "SpaceX’s Polaris Dawn mission reportedly experienced an hour-long loss of ground control before two private astronauts exited the Dragon crew capsule for the first commercial spacewalk in history, ac… [+2880 chars]"}]}