{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Mysterious fast radio burst traced back to rare group of galaxies - CNN", "description": "A powerful radio burst detected in 2022 originated from a rare “blob” of seven galaxies located 8 billion light-years from Earth, according to new research.", "url": "https://www.cnn.com/2024/01/10/world/fast-radio-bursts-hubble-galaxy-group-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/240109172500-fast-radio-burst.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-01-10T15:27:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAstronomers have traced one of the most powerful and d… [+5379 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Kids start paying attention to accuracy at about age four - Ars Technica", "description": "Early on, they're likely to trust humans; a bit later, performance matters more.", "url": "https://arstechnica.com/science/2024/01/robots-or-humans-who-do-kids-really-trust/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1380874448-760x380.jpg", "publishedAt": "2024-01-10T15:01:25Z", "content": "Enlarge/ Why wouldn't you trust this little guy? He's so cute!\r\n3\r\nMaking mistakes is human, but it's not limited to humans. Robots can also glitch. As we fast-forward into a future with upgraded AI … [+3898 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Anthony Wood", "title": "NASA Astronauts Won't Step Foot on the Moon Until September 2026 at the Earliest - IGN", "description": "U.S. astronauts won’t set foot on the Moon until September 2026 at the earliest, following NASA’s announcement of multiple delays to Artemis missions stemming from safety concerns for astronauts flying aboard the Orion spacecraft, and the need for further dev…", "url": "https://www.ign.com/articles/nasa-astronauts-wont-step-foot-on-the-moon-until-september-2026-at-the-earliest", "urlToImage": "https://assets-prd.ignimgs.com/2024/01/10/moon-thumbnail-1704896392299.jpg?width=1280", "publishedAt": "2024-01-10T14:44:17Z", "content": "U.S. astronauts wont set foot on the lunar surface until September 2026 at the earliest, following the announcement of multiple delays to NASA's Artemis Moon program stemming from concerns relating t… [+4108 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "Boffins demo self-eating rocket engine in Scotland - The Register", "description": "Roll up, roll up. See Ouroboros-3 eating its own fuselage", "url": "https://www.theregister.com/2024/01/10/selfeating_rocket_engine/", "urlToImage": "https://regmedia.co.uk/2024/01/10/ourouboros-3.jpg", "publishedAt": "2024-01-10T13:15:00Z", "content": "Interview The concept of a self-eating rocket is rearing its head once again as engineers showcase their work at the AIAA SciTech Forum.\r\nAutophage engines where the rocket effectively consumes itsel… [+2899 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Daily Telescope: A galactic neighborhood that isn't - Ars Technica", "description": "Hubble's still got it.", "url": "https://arstechnica.com/space/2024/01/daily-telescope-a-galactic-neighborhood-that-isnt/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/lotsa-galaxies-760x380.jpg", "publishedAt": "2024-01-10T13:00:05Z", "content": "Enlarge/ Some objects in the mirror are closer than they appear.\r\n15\r\nWelcome to the Daily Telescope. There is a little too much darkness in this world and not enough light, a little too much pseudos… [+1293 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "SpaceX targets February for third Starship test flight - SpaceNews", "description": "SpaceX expects to conduct the third integrated test flight of its Starship vehicle in February as it works to demonstrate landing humans on the moon.", "url": "https://spacenews.com/spacex-targets-february-for-third-starship-test-flight/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/11/IMG_3277.jpg", "publishedAt": "2024-01-10T12:49:36Z", "content": "NEW ORLEANS SpaceX expects to conduct the third integrated test flight of its Starship vehicle in February as it works to demonstrate key technologies needed to land humans on the moon.\r\nDuring a Jan… [+4708 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Beccy Corkill", "title": "Engineers Filmed An Ice Hockey Match From Below The Ice, Recording A Once “Impossible” Angle - IFLScience", "description": "This is just the tip of the iceberg of what these cameras can do!", "url": "https://www.iflscience.com/engineers-filmed-an-ice-hockey-match-from-below-the-ice-recording-a-once-impossible-angle-72362", "urlToImage": "https://assets.iflscience.com/assets/articleNo/72362/aImg/73314/ac-camera-meta.jpg", "publishedAt": "2024-01-10T12:21:44Z", "content": "In todays world, modern camera technology is used in so many ways, from taking snaps during a poolside holiday to surveying the grounds of a vital business. Despite these important uses, not all came… [+4869 chars]"}, {"source": {"id": null, "name": "The News Journal"}, "author": "The News Journal", "title": "Total solar eclipse in April will be last visible in U.S. until 2044 - The News Journal", "description": null, "url": "https://www.delawareonline.com/story/news/2024/01/07/total-solar-eclipse-april-2024-last-visible-us-2044/72121904007/", "urlToImage": null, "publishedAt": "2024-01-10T11:07:38Z", "content": null}, {"source": {"id": null, "name": "Aeon.co"}, "author": null, "title": "Find the building blocks of nature within a single, humble snowflake - Aeon", "description": "Each snowflake’s unique symmetry is a beautiful illustration of the natural laws that govern all things great and small", "url": "https://aeon.co/videos/find-the-building-blocks-of-nature-within-a-single-humble-snowflake", "urlToImage": "https://images.aeonmedia.co/images/e62a6dd4-78fd-49dc-bf5b-320788e9158e/the-science-of-snowflakes-landscape-1.jpg?width=1200&quality=75&format=auto", "publishedAt": "2024-01-10T11:02:58Z", "content": "In this brief yet expansive science lesson, the UK physicist and science educator Brian Cox explores how each snowflake is a microcosm of the laws of physics. Narrating over charming paper cut-out an… [+465 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China's Chang'e-6 probe arrives at spaceport for first-ever lunar far side sample mission - SpaceNews", "description": "China’s Chang’e-6 probe arrives at spaceport for first-ever lunar far side sample mission Components for China’s Chang’e-6 lunar far side sample return mission have arrived at Wenchang spaceport.", "url": "https://spacenews.com/chinas-change-6-probe-arrives-at-spaceport-for-first-ever-lunar-far-side-sample-mission/", "urlToImage": "https://spacenews.com/wp-content/uploads/2020/01/change5-farside-image.jpg", "publishedAt": "2024-01-10T10:22:49Z", "content": "HELSINKI Components for Chinas Change-6 lunar far side sample return mission spacecraft arrived at Wenchang spaceport Wednesday.\r\nThe delivery is part of preparations to launch a stack of four spacec… [+4880 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "NASA Selects a Wild Plan to \"Swarm\" Proxima Centauri With Thousands of Tiny Probes - ScienceAlert", "description": "Humans have dreamed about traveling to other star systems and setting foot on alien worlds for generations.", "url": "https://www.sciencealert.com/nasa-selects-a-wild-plan-to-swarm-proxima-centauri-with-thousands-of-tiny-probes", "urlToImage": "https://www.sciencealert.com/images/2024/01/starshot2-e1476900323550-1.jpeg", "publishedAt": "2024-01-10T09:28:14Z", "content": "Humans have dreamed about traveling to other star systems and setting foot on alien worlds for generations. To put it mildly, interstellar exploration is a very daunting task.\r\nAs Universe Today expl… [+7761 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beyond the Big Bang: Scientists Unveil Secrets of the Universe's Earliest Moments - SciTechDaily", "description": "Their efforts have been centered on mapping the “primordial soup” that filled the Universe in the first millionth of a second following its inception. Physicists from Eötvös Loránd University have been investigating the components of the atomic nucleus using …", "url": "https://scitechdaily.com/beyond-the-big-bang-scientists-unveil-secrets-of-the-universes-earliest-moments/", "urlToImage": "https://scitechdaily.com/images/Particle-Physics-Vortex.jpg", "publishedAt": "2024-01-10T09:23:11Z", "content": "Researchers at Eötvös Loránd University are using advanced particle accelerators to explore the transformation of early Universe’s quark matter into ordinary matter. Their innovative techniques and f… [+6864 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "There Could Be Alien, Mars-Sized Planets Lurking Beyond Pluto - ScienceAlert", "description": "The outer Solar System is like the ultimate wilderness frontier.", "url": "https://www.sciencealert.com/there-could-be-alien-mars-sized-planets-lurking-beyond-pluto", "urlToImage": "https://www.sciencealert.com/images/2024/01/rogue-planet.jpg", "publishedAt": "2024-01-10T06:23:15Z", "content": "The outer Solar System is like the ultimate wilderness frontier. It's so far from the Sun that our telescopes can't easily see what's out there; it's anyone's guess as to what strange objects are lur… [+3466 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA and JAXA troubleshooting glitch with new X-ray astronomy satellite - SpaceNews", "description": "A Japanese X-ray astronomy satellite is working well in orbit four months after its launch, other than an issue that could affect one of its instruments.", "url": "https://spacenews.com/nasa-and-jaxa-troubleshooting-glitch-with-new-x-ray-astronomy-satellite/", "urlToImage": "https://spacenews.com/wp-content/uploads/2024/01/xrism.jpg", "publishedAt": "2024-01-10T04:24:19Z", "content": "NEW ORLEANS A Japanese X-ray astronomy satellite, with contributions from NASA and ESA, is working well in orbit four months after its launch, other than an issue that could affect one of its instrum… [+1838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Stuck valve may have doomed private Peregrine moon lander mission, Astrobotic says - Space.com", "description": "The current hypothesis is that a valve failed to reseal properly, leading to a ruptured oxidizer tank.", "url": "https://www.space.com/astrobotic-peregrine-moon-lander-anomaly-valve", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Mqh9HZMC8QCgAcm8QQhede-1200-80.jpg", "publishedAt": "2024-01-09T23:09:52Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alan Fischer", "title": "Centaurs gain comet-like characteristics through close encounters with Jupiter, Saturn - Phys.org", "description": "A rapid reshaping of orbits resulting from a close encounter with Jupiter or Saturn can lead Centaurs to exhibit comet-like activity, according to a Planetary Science Institute Senior Scientist Eva Lilly paper.", "url": "https://phys.org/news/2024-01-centaurs-gain-comet-characteristics-encounters.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/centaurs-gain-comet-li.jpg", "publishedAt": "2024-01-09T22:27:04Z", "content": "A rapid reshaping of orbits resulting from a close encounter with Jupiter or Saturn can lead Centaurs to exhibit comet-like activity, according to a Planetary Science Institute Senior Scientist Eva L… [+4305 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Nube, the almost invisible galaxy that challenges the dark matter model - Phys.org", "description": "Nube is an almost invisible dwarf galaxy discovered by an international research team led by the Instituto de Astrofísica de Canarias (IAC) in collaboration with the University of La Laguna (ULL) and other institutions.", "url": "https://phys.org/news/2024-01-nube-invisible-galaxy-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/nube-the-almost-invisi-1.jpg", "publishedAt": "2024-01-09T22:22:03Z", "content": "Nube is an almost invisible dwarf galaxy discovered by an international research team led by the Instituto de Astrofísica de Canarias (IAC) in collaboration with the University of La Laguna (ULL) and… [+4962 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aliza Chasan", "title": "When and where stargazers can see the full moon, meteor showers and eclipses in 2024 - CBS News", "description": "Astronomy fans can enjoy celestial events throughout 2024, looking to the sky to see full moons, meteor showers and a total solar eclipse. Here are the key dates to mark on your calendar.", "url": "https://www.cbsnews.com/news/2024-celestial-calendar-dates-full-moon-meteor-showers-total-solar-eclipse/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/01/09/4dcd931f-329b-4c9e-af03-eee2bd3b9a47/thumbnail/1200x630/0e758e8ad0045dfa263280c63638dd36/gettyimages-836436498.jpg?v=3638d056f7798fc8425d74271bc0b398", "publishedAt": "2024-01-09T22:18:36Z", "content": "The year kicked off with a bang, with a meteor shower peaking just days after the start of 2024. There's more to come for stargazers. \r\nFind out when you can catch the best shows in the sky this year… [+4593 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Unexpectedly massive black holes dominate small galaxies in the distant universe - Phys.org", "description": "Astronomers have discovered that the supermassive black holes in the centers of early galaxies are much more massive than expected. These surprisingly hefty black holes offer new insights into the origins of all supermassive black holes, as well as the earlie…", "url": "https://phys.org/news/2024-01-unexpectedly-massive-black-holes-dominate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/unexpectedly-massive-b.jpg", "publishedAt": "2024-01-09T22:11:06Z", "content": "Astronomers have discovered that the supermassive black holes in the centers of early galaxies are much more massive than expected. These surprisingly hefty black holes offer new insights into the or… [+6320 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stranger Than Friction: An Invisible Force Initiating Life - SciTechDaily", "description": "Scientists examine how friction forces propel development in a marine organism. As the potter works the spinning wheel, the friction between their hands and the soft clay helps them shape it into all kinds of forms and creations. In a fascinating parallel, se…", "url": "https://scitechdaily.com/stranger-than-friction-an-invisible-force-initiating-life/", "urlToImage": "https://scitechdaily.com/images/Friction-Forces-Propel-Development.jpg", "publishedAt": "2024-01-09T21:29:56Z", "content": "A new study reveals that sea squirt oocytes use internal friction to undergo developmental changes post-conception, drawing an interesting parallel to a potter shaping clay. Ascidians, or sea squirts… [+7800 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "NASA's Parker Solar Probe will touch the sun later this year while traveling faster than any human-made object has ever gone - Livescience.com", "description": "Later this year, NASA's Parker Solar Probe will come even closer to the sun than it has before, while traveling at record-breaking speeds.", "url": "https://www.livescience.com/space/the-sun/monumental-achievement-for-all-humanity-nasas-parker-solar-probe-is-gearing-up-for-a-record-breaking-encounter-with-the-sun", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tG6b5cm4RvRguvh8gM2xXd-1200-80.jpg", "publishedAt": "2024-01-09T21:03:14Z", "content": "NASA's Parker Solar Probe has already gotten closer to the sun\r\n than any other human-made object. Yet, later this year, the star-skimming spacecraft will get even closer — all while traveling faster… [+2951 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Scientists Discover Dozens of Unknown Bacteria Species in Hospital Patients - Gizmodo", "description": "At least seven may be able to cause human disease, the researchers say.", "url": "https://gizmodo.com/scientists-discover-dozens-of-unknown-bacteria-species-1851153096", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/94309ed4518feec8f9ae940ea256f972.jpg", "publishedAt": "2024-01-09T20:52:00Z", "content": "In a study out this month, Swiss researchers say they genetically sequenced dozens of previously unknown bacterial species that were found in patient samples. While many of these novel bacteria might… [+2731 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rachel Kremen", "title": "How black silicon, a prized material used in solar cells, gets its dark, rough edge - Phys.org", "description": "Researchers at the U.S. Department of Energy's Princeton Plasma Physics Laboratory (PPPL) have developed a new theoretical model explaining one way to make black silicon, an important material used in solar cells, light sensors, antibacterial surfaces and man…", "url": "https://phys.org/news/2024-01-black-silicon-prized-material-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/soundproof-foam-1.jpg", "publishedAt": "2024-01-09T20:51:05Z", "content": "Researchers at the U.S. Department of Energy's Princeton Plasma Physics Laboratory (PPPL) have developed a new theoretical model explaining one way to make black silicon, an important material used i… [+4100 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Creation of Pillars - Hubble Space Telescope", "description": "A behind the scenes look at producing a scientific visualization of the famous Pillars of Creation in the Eagle Nebula.The AstroViz Project of NASA's Univers...", "url": "https://www.youtube.com/watch?v=Slx91ASCiXw", "urlToImage": "https://i.ytimg.com/vi/Slx91ASCiXw/maxresdefault.jpg", "publishedAt": "2024-01-09T19:00:18Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Molly Bohannon", "title": "350,000-Mile Tail Found On A Planet The Size Of Jupiter, Giving Insight Into Role Of Stellar Winds - Forbes", "description": "The exoplanet, or planet orbiting a star outside of Earth’s solar system, was previously believed to not have a tail, or have just a “hint of a tail.”", "url": "https://www.forbes.com/sites/mollybohannon/2024/01/09/350000-mile-tail-found-on-a-planet-the-size-of-jupiter-giving-insight-into-role-of-stellar-winds/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/659d92c436d472a9fc69e7b1/0x0.jpg?format=jpg&crop=3000,1688,x0,y313,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-01-09T18:42:29Z", "content": "Astrophysicists found an exoplanet the size of Jupiter has a tail of gas seven times its own lengtharound 350,000 milesresulting from its gas atmosphere burning off and being shaped by stellar winds,… [+1925 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ramish Zafar", "title": "Starlink Was At Heart Of SpaceX’s $30 Billion Goal Of Self Funding Mars Colony - Wccftech", "description": "A SpaceX company meeting video from 2017 shares the firm's optimistic plans for its Starlinnk satellite internet service.", "url": "https://wccftech.com/starlink-was-at-heart-of-spacexs-30-billion-goal-of-self-funding-mars-colony/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/08/SPACEX-FALCON-9-213-RECOVERY-1-728x406.png", "publishedAt": "2024-01-09T18:36:00Z", "content": "This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy.\r\nAs a crucial NASA conference to discuss updates about the a… [+3999 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Corey Binns", "title": "New research on microbes expands the known limits for life on Earth and beyond - Phys.org", "description": "New research led by Stanford University scientists predicts life can persist in extremely salty environments, beyond the limit previously thought possible.", "url": "https://phys.org/news/2024-01-microbes-limits-life-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-research-on-microb.jpg", "publishedAt": "2024-01-09T17:49:55Z", "content": "New research led by Stanford University scientists predicts life can persist in extremely salty environments, beyond the limit previously thought possible.\r\nThe study, published Dec. 22 in Science Ad… [+7779 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Quantum Cheshire cat study finds particles can't separate from their properties after all - Phys.org", "description": "The quantum Cheshire cat effect draws its name from the fictional Cheshire Cat in the Alice in Wonderland story. That cat was able to disappear, leaving only its grin behind.", "url": "https://phys.org/news/2024-01-quantum-cheshire-cat-particles-properties.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/quantum-particles-cant.jpg", "publishedAt": "2024-01-09T17:49:15Z", "content": "The quantum Cheshire cat effect draws its name from the fictional Cheshire Cat in the Alice in Wonderland story. That cat was able to disappear, leaving only its grin behind.\r\nSimilarly, in a 2013 pa… [+4494 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Layoffs Loom at NASA After Termination of Over 100 Contractors Amid Mars Budget Constraints - Gizmodo", "description": "The space agency, to prepare for budget cuts on its Mars Sample Return mission, has reportedly tossed 100 contractors from its Jet Propulsion Laboratory.", "url": "https://gizmodo.com/nasa-jpl-layoffs-mars-sample-return-budget-cuts-1851151773", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d151a885ec2dc68acda6214923a6ee46.jpg", "publishedAt": "2024-01-09T17:45:00Z", "content": "NASA is scaling back on its ambitious Mars Sample Return (MSR) program, fearing federal budget cuts to the space agencys plan to bring back rock and dust from the Red Planet, which has come under hea… [+3674 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "23 million-year-old petrified mangrove forest discovered hiding in plain sight in Panama - Livescience.com", "description": "Fossils discovered on Barro Colorado Island suggest central Panama was once home to a vast mangrove forest that was preserved when a volcanic mudflow buried it 23 million years ago.", "url": "https://www.livescience.com/planet-earth/plants/23-million-year-old-petrified-mangrove-forest-discovered-hiding-in-plain-sight-in-panama", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pHGxpxeEyWyZASmob9D4kB-1200-80.jpg", "publishedAt": "2024-01-09T17:39:57Z", "content": "A fossilized wood sample discovered on Barro Colorado Island in Panama. (Image credit: Christian Ziegler)\r\nAn ancient mangrove forest with trees that towered up to 130 feet high has been discovered o… [+3656 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Superconducting “Miracle” Receives $2.96 Million Boost - SciTechDaily", "description": "Unconventional Superconductor CeRh2As2: A Quantum Superstar The research conducted by Elena Hassinger, an expert in low-temperature physics working at ct.qmat—Complexity and Topology in Quantum Matter (a joint initiative by two universities in Würzburg and Dr…", "url": "https://scitechdaily.com/groundbreaking-superconducting-miracle-receives-2-96-million-boost/", "urlToImage": "https://scitechdaily.com/images/CeRh2As2.jpg", "publishedAt": "2024-01-09T17:39:09Z", "content": "Depicted is the superconducting miracle cerium-rhodium-arsenic (CeRh2As2). Thanks to a €2.7 million grant from the European Research Council, Elena Hassinger will be able to advance her research on t… [+5125 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Olivia Young", "title": "Scientists finally find mysterious mesospheric ghosts - Big Think", "description": "The midwest is particularly filled with them.", "url": "https://bigthink.com/hard-science/mesospheric-ghosts/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/01/sprites.jpg?resize=1200,630", "publishedAt": "2024-01-09T17:36:48Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Hannah Osborne", "title": "Whale with broken back spotted near Mexico after suspected ship collision will likely die - Livescience.com", "description": "A humpback whale off Baja California Sur with a deformed spine was likely hit by a ship and the injury will probably be fatal, an expert told Live Science.", "url": "https://www.livescience.com/animals/whales/whale-with-broken-back-spotted-near-mexico-after-suspected-ship-collision-will-likely-die", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kTB4sW6vvtQUN48YjNKU3M-1200-80.jpg", "publishedAt": "2024-01-09T17:23:36Z", "content": "The humpback whale (Megaptera novaeangliae) with a broken back was spotted off the coast of Mexico. (Image credit: credit Alexander Schmidt @alexsharks_ on expedition with @apexoceandivers)\r\nA whale … [+3093 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Jupiter Discovered To Have Magnetic Jets - And It's A Big Deal For The Whole Solar System - IFLScience", "description": "Jets have previously only been seen around Earth and Mars.", "url": "https://www.iflscience.com/first-discovery-jupiters-magnetic-jets-is-a-big-deal-for-the-whole-solar-system-72372", "urlToImage": "https://assets.iflscience.com/assets/articleNo/72372/aImg/73337/bi-jupiter-meta.jpg", "publishedAt": "2024-01-09T17:20:55Z", "content": "Magnetosheath jets are fast plasma streams that form in the region between a planets magnetic field and the solar wind, the stream of charged particles that come from the Sun. Its an area of peculiar… [+2385 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Cointelegraph", "title": "Researchers find even good AI can become resistant to shutdown - Cointelegraph", "description": null, "url": "https://cointelegraph.com/news/artificial-intelligence-researchers-find-even-good-ai-can-become-resistant-shutdown", "urlToImage": null, "publishedAt": "2024-01-09T17:16:20Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Quantum entanglement discovery is a revolutionary step forward - Earth.com", "description": "A team of researchers from the Structured Light Laboratory has made a significant breakthrough regarding quantum entanglement.", "url": "https://www.earth.com/news/quantum-entanglement-discovery-is-a-revolutionary-step-forward/", "urlToImage": "https://cff2.earth.com/uploads/2024/01/08145141/quantum-entanglement_topology_new-discovery_1m.jpg", "publishedAt": "2024-01-09T16:56:56Z", "content": "A team of researchers from the Structured Light Laboratory at the University of the Witwatersrand, South Africa, has made a significant breakthrough regarding quantum entanglement. \r\nLed by Professor… [+6362 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Learning a second language strengthens neural connections in the language network, study shows - Medical Xpress", "description": "Scientists at the Max Planck Institute for Human Cognitive and Brain Sciences in Leipzig have unearthed fascinating evidence that the brain undergoes important changes in wiring when we embark on the journey of learning a new language in adulthood. They organ…", "url": "https://medicalxpress.com/news/2024-01-language-neural-network.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/learning-a-second-lang.jpg", "publishedAt": "2024-01-09T16:28:00Z", "content": "Scientists at the Max Planck Institute for Human Cognitive and Brain Sciences in Leipzig have unearthed fascinating evidence that the brain undergoes important changes in wiring when we embark on the… [+3648 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "NASA telescopes chase down 'Green Monster' in star's debris - Phys.org", "description": "By bringing together data from two NASA telescopes, astronomers may have solved a mystery around a bizarre structure found in the debris field of an exploded star. Their work has uncovered new details about the star's remains, and about the explosion itself.", "url": "https://phys.org/news/2024-01-nasa-telescopes-green-monster-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/nasa-telescopes-chase.jpg", "publishedAt": "2024-01-09T16:18:00Z", "content": "By bringing together data from two NASA telescopes, astronomers may have solved a mystery around a bizarre structure found in the debris field of an exploded star. Their work has uncovered new detail… [+6512 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Charles Q. Choi", "title": "The 1st Americans may have arrived by a sea ice 'highway' - Livescience.com", "description": "During the last ice age, the first people to reach the Americas may have traveled from Asia along a sea ice \"highway.\"", "url": "https://www.livescience.com/archaeology/the-1st-americans-may-have-arrived-by-a-sea-ice-highway", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gyZKgbH4WHdSuW46SKvwoW-1200-80.jpg", "publishedAt": "2024-01-09T16:17:57Z", "content": "During the last ice age, sea ice may have provided an ancient \"highway\" for the first humans to reach the Americas, researchers say.\r\nThe finding — that the first Americans may have trekked upon this… [+4488 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": "WebbTelescope.org", "title": "NASA's Webb Finds Signs of Possible Aurorae on Isolated Brown Dwarf | Webb - WebbTelescope.org", "description": null, "url": "https://webbtelescope.org/contents/news-releases/2024/news-2024-103", "urlToImage": null, "publishedAt": "2024-01-09T16:15:00Z", "content": null}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Robin George Andrews", "title": "Is there a 9th planet out there? We may soon find out. - National Geographic", "description": "Starting in 2025 the Vera C. Rubin observatory will increase the number of known objects circling the sun by roughly tenfold, spotting new comets, exotic asteroids from other stars, and perhaps even the elusive Planet Nine.", "url": "https://www.nationalgeographic.com/science/article/is-there-a-planet-nine-we-may-find-out-vera-rubin-observatory", "urlToImage": "https://i.natgeofe.com/n/b7bf794e-b7fa-4768-bb6c-569b239b1773/MM9898_220929_0022_16x9.jpg?w=1200", "publishedAt": "2024-01-09T15:55:37Z", "content": "Our solar system is home to wondrous worlds, mysterious moons, astounding asteroids, and curious comets. But despite myriad telescope surveys of the night sky, most of our celestial neighborhood rema… [+8492 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Seeking another Earth? Look for low carbon dioxide - Ars Technica", "description": "In our own Solar System, Earth has far lower CO2 concentrations than its neighbors.", "url": "https://arstechnica.com/science/2024/01/seeking-another-earth-look-for-low-carbon-dioxide/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/5K_Exo_Beauty_HiRes_FINAL-760x380.jpeg", "publishedAt": "2024-01-09T15:13:18Z", "content": "15\r\nWhat do we need to find if we want to discover another Earth? If an exoplanet is too far away for even the most powerful telescopes to search directly for water or certain biosignatures, is there… [+3871 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "New study suggests some forms of life could exist in Venus's sulfuric acid clouds - Phys.org", "description": "A team of chemists and planetary scientists from Worcester Polytechnic Institute, Nanoplanet Consulting and MIT has found evidence that a form of life that uses sulfuric acid as a liquid medium could exist in some of the clouds covering Venus. The team has pu…", "url": "https://phys.org/news/2024-01-life-venus-sulfuric-acid-clouds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/planet-venus.jpg", "publishedAt": "2024-01-09T14:50:01Z", "content": "A team of chemists and planetary scientists from Worcester Polytechnic Institute, Nanoplanet Consulting and MIT has found evidence that a form of life that uses sulfuric acid as a liquid medium could… [+2549 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Gliese 367 b is a dark and hot sub-Earth with no atmosphere, study finds - Phys.org", "description": "Using the James Webb Space Telescope (JWST), astronomers have investigated a nearby sub-Earth exoplanet known as Gliese 367 b. The obtained results indicate that this alien world is dark, hot and lacks a detectable atmosphere. The new findings were published …", "url": "https://phys.org/news/2024-01-gliese-dark-hot-earth-atmosphere.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/gliese-367-b-is-a-dark.jpg", "publishedAt": "2024-01-09T14:50:01Z", "content": "Using the James Webb Space Telescope (JWST), astronomers have investigated a nearby sub-Earth exoplanet known as Gliese 367 b. The obtained results indicate that this alien world is dark, hot and lac… [+3078 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Experts Warn Against Strip Mining the Moon - Futurism", "description": "As humans barrel ever closer to colonizing the Moon, the prospect of lunar mining is also becoming more real.", "url": "https://futurism.com/the-byte/experts-against-moon-mining", "urlToImage": "https://wp-assets.futurism.com/2024/01/experts-against-moon-mining.jpg", "publishedAt": "2024-01-09T14:38:40Z", "content": "\"We need to act now.\"\r\nMine Not\r\nAs humans barrel ever closer to colonizing the Moon, the prospect of lunar mining is also becoming more real and the consequences just might be dire.\r\nIn interviews w… [+2823 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Peggy Hollinger and Sylvia Pfeifer, FT", "title": "“We are worried,” says European rocket chief at prospect of launch competition - Ars Technica", "description": "On the continent, Ariane 6 may be the last launcher with a monopoly.", "url": "https://www.ft.com/content/58e85e5a-cf6b-4cda-ab06-7acd5c91ffc1", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/07/37918-760x380.jpg", "publishedAt": "2024-01-09T14:18:04Z", "content": "Enlarge/ Artist's view of the configuration of Ariane 6 using four boosters on the ELA-4 launch pad together with its mobile gantry. \r\n116\r\nThere is no guarantee Frances ArianeGroup will continue to … [+4058 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Shark amazes researchers with remarkable dorsal fin regeneration - Interesting Engineering", "description": "A silky shark (Carcharhinus falciformis) has stunned researchers with its miraculous recovery over a year after suffering a major lesion to its dorsal fin.", "url": "https://interestingengineering.com/science/shark-amazes-researchers-with-remarkable-dorsal-fin-regeneration", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2024/01/09/image/jpeg/jdrMu5dHCUIY8RXuntPLqlFRwjDgqBsofkjMYxG3.jpg", "publishedAt": "2024-01-09T13:55:00Z", "content": "Researchers still don't understand how the silky shark's dorsal fin healed in such a short time. \r\nWithout access to the shark itself, researchers can't be sure if this remarkable healing process is … [+2017 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA funds Venus sample-return, interstellar probes and other far-out space tech - Space.com", "description": "Each of the 13 newly announced NIAC awards is worth up to $175,000.", "url": "https://www.space.com/nasa-niac-funding-2024-venus-sample-return", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VfuSGgsV7m7GAxgaH4ZWcJ-1200-80.jpg", "publishedAt": "2024-01-09T13:00:07Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "AL.com"}, "author": "Dennis Pillion | dpillion@al.com", "title": "‘Most impressive’ alligator snapping turtle is still one of Alabama’s weirdest animals - AL.com", "description": "The alligator snapping turtle isn't known to be aggressive to people, but it's probably best not to mess with it.", "url": "https://www.al.com/news/2024/01/most-impressive-alligator-snapping-turtle-is-still-one-of-alabamas-weirdest-animals.html", "urlToImage": "https://www.al.com/resizer/s6wemtsbJ-SfjTpCo4X8idEHC_E=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/EZAGTUNN35ETPHAJUAK54PVHKA.JPG", "publishedAt": "2024-01-09T13:00:00Z", "content": "Its a face only a mother could love. Well, a mother or a wildlife biologist.\r\nBut if you ever get face-to-face with a 200-pound, 100 year-old alligator snapping turtle with its gaping jaws spread wid… [+4539 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "The last of the Moon men: the stories of the surviving Apollo astronauts - BBC.com", "description": "Who are the eight surviving members of humanity's greatest feat of exploration?", "url": "https://www.bbc.com/news/science-environment-67410372", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16EA6/production/_131726839_mediaitem131726838.jpg", "publishedAt": "2024-01-09T12:04:00Z", "content": "Who will be the next human to leave their footprint on the surface of the Moon?\r\nThey were the pioneers of space exploration - the 24 Nasa astronauts who travelled to the Moon in the Apollo missions … [+11340 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Delivery of a sebum modulator by an engineered skin microbe in mice - Nature.com", "description": "An engineered skin microbe produces a therapeutic molecule that reduces sebum in mice.", "url": "https://www.nature.com/articles/s41587-023-02072-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41587-023-02072-4/MediaObjects/41587_2023_2072_Fig1_HTML.png", "publishedAt": "2024-01-09T10:02:49Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cyclones in Space? See How Hubble Uncovered Extreme Weather on a Distant Planet - SciTechDaily", "description": "Stormy weather on display on a \"hot Jupiter\" The Jupiter-sized planet WASP-121 b is no place to call home. For starters, it orbits very close to a star that is brighter and hotter than the Sun. The planet is so dangerously close to its star that its upper atm…", "url": "https://scitechdaily.com/cyclones-in-space-see-how-hubble-uncovered-extreme-weather-on-a-distant-planet/", "urlToImage": "https://scitechdaily.com/images/Massive-Cyclones-Hot-Exoplanet-Atmosphere.jpg", "publishedAt": "2024-01-09T09:28:25Z", "content": "Astronomers have detected dynamic weather activities, such as massive cyclones, on the uninhabitable exoplanet WASP-121 b using NASA’s Hubble Space Telescope. This discovery, crucial for studying dis… [+8649 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Krishna Ramanujan", "title": "Fastest swimming insect could inspire uncrewed boat designs - Phys.org", "description": "Whirligig beetles, the world's fastest-swimming insect, achieve surprising speeds by employing a strategy shared by speedy marine mammals and waterfowl, according to a new Cornell University study that rewrites previous explanations of the physics involved.", "url": "https://phys.org/news/2024-01-fastest-insect-uncrewed-boat.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/fastest-swimming-insec.jpg", "publishedAt": "2024-01-09T09:18:47Z", "content": "Whirligig beetles, the world's fastest-swimming insect, achieve surprising speeds by employing a strategy shared by speedy marine mammals and waterfowl, according to a new Cornell University study th… [+3839 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China launches “lobster eye” Einstein Probe to unveil mysteries of X-ray universe - SpaceNews", "description": "China launches “lobster eye” Einstein Probe to unveil mysteries of X-ray universe China launched its Einstein Probe early Tuesday to detect X-ray emissions from violent, fleeting cosmic phenomena using novel lobster eye-inspired optics.", "url": "https://spacenews.com/china-launches-lobster-eye-einstein-probe-to-unveil-mysteries-of-x-ray-universe/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/03/einstein-probe-CAS.png", "publishedAt": "2024-01-09T08:20:49Z", "content": "HELSINKI China launched its Einstein Probe early Tuesday to detect X-ray emissions from violent, fleeting cosmic phenomena using novel lobster eye-inspired optics.\r\nA Long March 2C rocket lifted off … [+4989 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "The first dark, primordial galaxy has gas, but no stars - Big Think", "description": "Finding it at all was a happy accident. Examining it further may help unlock the secrets hiding within the earliest galaxies of all.", "url": "https://bigthink.com/starts-with-a-bang/dark-primordial-galaxy/", "urlToImage": "https://bigthink.com/wp-content/uploads/2024/01/J063041_B-horizontal-final.jpg?resize=1200,630", "publishedAt": "2024-01-09T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Most Precise Measure of Dark Energy Confirms Universe Won't Tear Apart - ScienceAlert", "description": "Over ten years ago, the Dark Energy Survey (DES) began mapping the Universe to find evidence that could help us understand the nature of the mysterious phenomenon known as dark energy.", "url": "https://www.sciencealert.com/most-precise-measure-of-dark-energy-confirms-universe-wont-tear-apart", "urlToImage": "https://www.sciencealert.com/images/2024/01/galaxy_whirl_space.jpg", "publishedAt": "2024-01-09T05:45:15Z", "content": "Over ten years ago, the Dark Energy Survey (DES) began mapping the Universe to find evidence that could help us understand the nature of the mysterious phenomenon known as dark energy.\r\nI'm one of mo… [+4884 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "USA TODAY", "title": "3 planets appear with moon early Tuesday. How to spot them from home. - USA TODAY", "description": null, "url": "https://www.usatoday.com/story/news/nation/2024/01/08/three-planets-align-with-moon-tuesday/72152643007/", "urlToImage": null, "publishedAt": "2024-01-09T02:43:32Z", "content": null}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Jason Collins", "title": "Gigantic Terror Beast Worm Discovered In Greenland - Giant Freakin Robot", "description": "A new species of worms that roamed Earth long ago has been discovered in Greenland, and its existence is absolutely terrifying.", "url": "https://www.giantfreakinrobot.com/sci/gigantic-terror-beast-worm.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2020/12/sandworm.jpg", "publishedAt": "2024-01-09T00:10:42Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Noelle Toumey Reetz", "title": "A colossal star erupts: Examining one of the largest stars in the Milky Way as it fades from view - Phys.org", "description": "Astronomers from Georgia State University's CHARA Array have captured the first close-up images of a massive star known as RW Cephei that recently experienced a strange fading event. The images are providing new clues about what's happening around the massive…", "url": "https://phys.org/news/2024-01-colossal-star-erupts-largest-stars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/a-colossal-star-erupts.jpg", "publishedAt": "2024-01-08T23:07:04Z", "content": "Astronomers from Georgia State University's CHARA Array have captured the first close-up images of a massive star known as RW Cephei that recently experienced a strange fading event. The images are p… [+5196 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Astronomers offer an explosive origin theory for giant odd radio circles in space - CNN", "description": "Massive rings in space known as odd radio circles may be sculpted by a shock wave of screaming winds created by the explosions of stars, according to a new study.", "url": "https://www.cnn.com/2024/01/08/world/odd-radio-circles-starburst-galaxies-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/240108145423-odd-radio-circles.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-01-08T23:02:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nOdd radio circles in space have mystified astronomers … [+5531 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "The Mystery of Titan's 'Magic Islands' May Finally Be Solved - ScienceAlert", "description": "When the Cassini spacecraft returned radar scans of the surface of Saturn's moon Titan, the results were mind-blowing.", "url": "https://www.sciencealert.com/the-mystery-of-titans-magic-islands-may-finally-be-solved", "urlToImage": "https://www.sciencealert.com/images/2024/01/FalseColorImageShowsLigeiaMareOnTitan.jpg", "publishedAt": "2024-01-08T22:01:16Z", "content": "When the Cassini spacecraft returned radar scans of the surface of Saturn's moon Titan, the results were mind-blowing.\r\nIt revealed giant lakes or seas of liquid methane, a complete absence of waves,… [+2235 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The black spots on salmon filets found to contain melanin - Phys.org", "description": "More than 20% of the filets of Atlantic salmon may have unattractive black and red spots, which are often &gt;1 cm and create substantial financial losses. The spots are far more abundant in reared than in wild salmon, and their causes are poorly understood.", "url": "https://phys.org/news/2024-01-black-salmon-filets-melanin.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/the-black-spots-on-sal.jpg", "publishedAt": "2024-01-08T21:02:03Z", "content": "More than 20% of the filets of Atlantic salmon may have unattractive black and red spots, which are often &gt;1 cm and create substantial financial losses. The spots are far more abundant in reared t… [+5034 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": null, "title": "2 years on, this is what James Webb has taught us about the universe - Euronews", "description": "On January 8, 2022, the James Webb Telescope unfurled its mirror for the first time. Two years on, it has shown us things in the universe we've never seen before.", "url": "https://www.euronews.com/next/2024/01/08/in-pictures-the-cartwheel-galaxy-and-the-other-universe-mysteries-revealed-by-james-webb", "urlToImage": "https://static.euronews.com/articles/stories/06/91/03/78/1200x675_cmsv2_1633183a-c96d-58c7-a02e-cc87a64e694b-6910378.jpg", "publishedAt": "2024-01-08T20:00:10Z", "content": "On January 8, 2022, the James Webb Telescope unfurled its mirror for the first time. Two years on, it has shown us things in the universe we've never seen before.\r\n Our naked eye would never be able … [+8401 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "What does space smell like? - Space.com", "description": "The exotic chemistry of planetary and interstellar space produces a bouquet of unusual aromas — if only there were air in space in which to smell them.", "url": "https://www.space.com/what-does-space-smell-like", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mV93kxaXHmAn74yTSoWMrY-1200-80.jpg", "publishedAt": "2024-01-08T18:58:24Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "Iai.tv"}, "author": null, "title": "Chaos theory and the end of physics | Tim Palmer - IAI", "description": "", "url": "https://iai.tv/articles/chaos-theory-and-the-end-of-physics-tim-palmer-auid-2708", "urlToImage": "", "publishedAt": "2024-01-08T17:17:01Z", "content": "When we look at scientific progress, especially in physics, it can seem like all the great discoveries lie behind us. Since the revolutions of Einstein's theory of relativity and quantum mechanics, p… [+12746 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Pesala Bandara", "title": "Scientists Took 11000 Photos of Ants' Faces to Reveal Secrets of Survival - PetaPixel", "description": "They took 11,739 images of ants.", "url": "https://petapixel.com/2024/01/08/scientists-took-11000-photos-of-ants-faces-to-reveal-secrets-of-survival/", "urlToImage": "https://petapixel.com/assets/uploads/2024/01/ant-faces-scientists-photos-thousands.jpg", "publishedAt": "2024-01-08T16:43:26Z", "content": "Scientists took over 11,000 photos of ants to reveal how the different patterns and textures on their faces could be the secret behind their survival as a species.\r\nEntomologist Clint Penick and his … [+2264 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Tasmanian devil die-off is shifting another predator's genetics - Nature.com", "description": "Devil population crashes caused by contagious tumours have knock-on effects elsewhere in the food chain.", "url": "https://www.nature.com/articles/d41586-024-00034-7", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-024-00034-7/d41586-024-00034-7_26605512.jpg", "publishedAt": "2024-01-08T16:28:42Z", "content": null}]}