{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Jesse Emspak", "title": "The new moon of March 2025 creates a partial solar eclipse this weekend - Space.com", "description": "Unlike a total solar eclipse, part of the sun is still visible during a partial solar eclipse, so there is no darkening of the sky or visible solar corona.", "url": "https://www.space.com/the-universe/moon/the-new-moon-of-march-2025-creates-a-partial-solar-eclipse-this-weekend", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Qigia9QMiYrRmFVuh3UU4R-1200-80.jpg", "publishedAt": "2025-03-26T10:00:10Z", "content": "This new moon of March 2025 will create a partial solar eclipse visible in the northeastern part of North America, much of Europe and Russia; one will even be able to see the moon cover a sliver of t… [+10554 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Life on Mars? NASA’s Curiosity Rover Finds Prebiotic Clues in a 3.7-Billion-Year-Old Rock - SciTechDaily", "description": "NASA’s Curiosity rover has unearthed the largest organic molecules ever detected on Mars—possible fragments of fatty acids—hinting at the tantalizing possibility that prebiotic chemistry on the Red Planet may have been more advanced than previously thought. F…", "url": "https://scitechdaily.com/?p=464694", "urlToImage": "https://scitechdaily.com/images/Long-Chain-Hydrocarbons-Discovered-on-Mars-scaled.jpg", "publishedAt": "2025-03-26T08:21:12Z", "content": "This graphic shows the long-chain organic molecules decane, undecane, and dodecane. These are the largest organic molecules discovered on Mars to date. They were detected in a drilled rock sample cal… [+8706 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "26 million galaxies captured in vivid deep field photos in just one week - Earth.com", "description": "ESA’s Euclid mission mapped 26 million galaxies, revealing galaxy shapes, cosmic structures, and gravitational lenses", "url": "https://www.earth.com/news/euclid-captures-26-million-galaxies-in-vivid-deep-field-photos/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/23093743/Euclid_Galaxies-in-different-shapes_ESA_1m.jpg", "publishedAt": "2025-03-26T04:55:16Z", "content": "The European Space Agency (ESA) has unveiled the first survey data from its Euclid mission. The images feature a spectacular collection of galaxies, clusters, and deep cosmic fields. \r\nThis first, ma… [+4814 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Never-before-seen Earth shapes described as 'like seeing the back of the moon' - Earth.com", "description": "Scientists using a submersible robot discovered patterns under the Antarctic ice that have never been seen before by humans.", "url": "https://www.earth.com/news/antarctica-ice-shapes-never-seen-by-humans-dotson-ice-shelf-ran-submersible/", "urlToImage": "https://cff2.earth.com/uploads/2024/08/25190107/Antarctica_Dotson-ice-shelf_mystery-shapes_credit-UGothenburg_1.jpg", "publishedAt": "2025-03-26T01:24:14Z", "content": "An international research team deployed the unmanned submarine named ‘Ran’ beneath thick Antarctic ice. After that, things got weird. \r\nThey captured the first detailed maps of a glaciers underside, … [+4908 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Hear The First-Ever Recordings of Sharks Actively Making Noises - ScienceAlert", "description": "In the murky depths of the ocean, one predator has a trait that exacerbates the dread it inspires as it slides through the ocean waves.", "url": "https://www.sciencealert.com/hear-the-first-ever-recordings-of-sharks-actively-making-noises", "urlToImage": "https://www.sciencealert.com/images/2025/03/sharky-shark.jpg", "publishedAt": "2025-03-26T00:22:30Z", "content": "In the murky depths of the ocean, one predator has a trait that exacerbates the dread it inspires as it slides through the ocean waves. Sharks have long been considered completely, eerily silent; to … [+5969 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Deep space radio burst reaches Earth after an 8 billion year journey - Earth.com", "description": "A mysterious and powerful burst of radio waves reached Earth after traveling through space for 8 billion years dubbed FRB 20220610A.", "url": "https://www.earth.com/news/deep-space-radio-burst-frb-20220610a-reaches-earth-after-8-billion-year-journey/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/25175358/radio-burst_8-billion-years_FRB-20220610A_illustration_Beijing-Planetarium_1m.jpg", "publishedAt": "2025-03-26T00:19:42Z", "content": "Recently, astronomers made an astonishing discovery — a mysterious and powerful burst of radio waves reached Earth after traveling through space for 8 billion years. Dubbed FRB 20220610A, it is one o… [+5985 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jennifer M. Dooren", "title": "NASA Statement on Nomination of Greg Autry for Agency CFO - NASA", "description": "The following is a statement from NASA acting Administrator Janet Petro regarding the nomination by President Donald Trump of Greg Autry on March 24 to serve", "url": "https://www.nasa.gov/news-release/nasa-statement-on-nomination-of-greg-autry-for-agency-cfo/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/gautry325.jpg", "publishedAt": "2025-03-25T23:47:34Z", "content": "The following is a statement from NASA acting Administrator Janet Petro regarding the nomination by President Donald Trump of Greg Autry on March 24 to serve as the agencys chief financial officer (C… [+1585 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Monster Black Hole Jets in a Spiral Galaxy Could Forecast the Milky Way’s Frightening Future - SciTechDaily", "description": "Astronomers have uncovered a spiral galaxy nearly a billion light-years away that hosts a supermassive black hole launching colossal jets of energy, something once thought possible only in elliptical galaxies. This revelation not only challenges our current m…", "url": "https://scitechdaily.com/?p=464443", "urlToImage": "https://scitechdaily.com/images/Cosmic-Cataclysm-Art-Concept-Illustration.jpg", "publishedAt": "2025-03-25T22:02:03Z", "content": "A gigantic spiral galaxy with powerful black hole jets has shocked scientists, showing that even galaxies like ours could unleash dangerous radiation one day. It challenges how we think galaxies evol… [+6790 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jude Coleman", "title": "How ancient stone kitchens preserve food secrets - Phys.org", "description": "The mortar, pestle and cutting board in your kitchen are modern versions of manos and metates—ancient cooking implements found in archaeological sites around the world. A mano is a hand-held stone tool used with a metate to grind and pulverize food materials …", "url": "https://phys.org/news/2025-03-ancient-stone-kitchens-food-secrets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/how-ancient-stone-kitc.jpg", "publishedAt": "2025-03-25T20:52:04Z", "content": "The mortar, pestle and cutting board in your kitchen are modern versions of manos and metatesancient cooking implements found in archaeological sites around the world. A mano is a hand-held stone too… [+6556 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Alien-Like Microbes May Have Carved Tunnels Into Solid Rock Millions of Years Ago - Indian Defence Review", "description": "Deep beneath desert stone, scientists have uncovered tiny, perfectly aligned tunnels that may have been carved by ancient microbes", "url": "https://indiandefencereview.com/alien-like-microbes-tunnels-solid-rock/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/03/alien-like-microbes-may-have-carved-tunnels-into-solid-rock-millions-of-years-ago.jpg", "publishedAt": "2025-03-25T20:10:00Z", "content": "Deep inside marble and limestone formations in the deserts of Namibia, Oman, and Saudi Arabia, scientists have uncovered something astonishing: thin, perfectly aligned tunnelscarved through solid sto… [+5389 chars]"}, {"source": {"id": null, "name": "Electrek"}, "author": "Jo Borrás", "title": "Forget carbon neutral, Northwestern develops carbon NEGATIVE concrete - Electrek.co", "description": "The quest for carbon-neutral concrete has become a billion-dollar endeavor – but a team of scientists from Northwestern gas gone one better.", "url": "http://electrek.co/2025/03/25/forget-carbon-neutral-northwestern-develops-carbon-negative-concrete/", "urlToImage": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2025/03/Bloczek_betonowy.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2025-03-25T19:05:00Z", "content": "Depending on who you believe, concrete is responsible for between 5 and 10% of global carbon emissions. Thats a lot of carbon, and the quest for carbon neutral concrete has become a multibillion-doll… [+3656 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Sarah Frazier", "title": "NASA’s Parker Solar Probe Team Wins 2024 Collier Trophy - Science@NASA", "description": "NASA, the Johns Hopkins Applied Physics Laboratory, and partners that created the Parker Solar Probe mission have been awarded the 2024 Robert J. Collier Trophy", "url": "https://science.nasa.gov/science-research/heliophysics/nasas-parker-solar-probe-team-wins-2024-collier-trophy/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/psp/Parker%20Solar%20Probe%20in%20solar%20wind.png", "publishedAt": "2025-03-25T19:01:31Z", "content": "The innovative team of engineers and scientists from NASA, the Johns Hopkins Applied Physics Laboratory in Laurel, Maryland, and more than 40 other partner organizations across the country that creat… [+5439 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Chimpanzees select the best materials for termite fishing - Earth.com", "description": "Chimpanzees in Tanzania choose flexible materials for termite tools, revealing clues about the origins of human intelligence and tool use.", "url": "https://www.earth.com/news/chimpanzees-select-the-best-materials-for-termite-fishing/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/25125549/Chimpanzees-fishing.jpg", "publishedAt": "2025-03-25T18:58:26Z", "content": "In the forests of Tanzania, chimpanzees have long been known to fish for termites using handmade tools crafted from local plants. But what makes this behavior even more fascinating is how carefully t… [+4409 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "NASA Armstrong Internal Email: Latest on Executive Orders Etc. - NASA Watch", "description": "this email \"Latest on Executive Orders, Etc.\" was sent to the NASA Armstrong workforce by Center Director Brad Flick on 24 March 2025", "url": "https://nasawatch.com/personnel-news/nasa-armstrong-internal-email-latest-on-executive-orders-etc/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/03/afrc_entrance.jpg", "publishedAt": "2025-03-25T18:33:44Z", "content": "NASA Armstrong Flight Research Center \r\nKeith’s note: this email “Latest on Executive Orders, Etc.” was sent to the NASA Armstrong workforce by Center Director Brad Flick on 24 March 2025 . Of all th… [+3651 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Intrigued by \"Star Grinder\" Pulverizing Entire Star Systems in Our Galaxy - Futurism", "description": "Astronomers suggest there's a giant \"star grinder\" lurking at the center of the Milky Way, churning up star systems.", "url": "https://futurism.com/the-byte/star-grinder", "urlToImage": "https://wordpress-assets.futurism.com/2025/03/star-grinder.jpg", "publishedAt": "2025-03-25T18:17:26Z", "content": "Astronomers suggest there's a giant \"star grinder\" lurking at the center of the Milky Way, churning up potentially tens of thousands of star systems that are unfortunate enough to get too close.\r\nAs … [+2605 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Oxygen on Mars: Breakthrough technology turns carbon emissions into oxygen - The Brighter Side of News", "description": "A groundbreaking electrochemical method directly splits CO₂ into oxygen, promising carbon neutrality and life support in extreme environments", "url": "https://www.thebrighterside.news/post/oxygen-on-mars-breakthrough-technology-turns-carbon-emissions-into-oxygen/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/03/O2-on-Mars.jpg?auto=webp", "publishedAt": "2025-03-25T18:07:00Z", "content": "Carbon dioxide (CO) pollution drives climate change, warming the planet and threatening human survival. Plants naturally turn CO into oxygen (O) during photosynthesis, but their efficiency is surpris… [+7998 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Rare moonbow shines below total lunar eclipse in stunning photo: 'This is definitely the first time I've tried something like this, but will not be the last' - Space.com", "description": "\"The respective sizes of the two arcs also create a great symbolic representation of the difference in scale between what we experience and deal with as humans on Earth and the vastness and grandeur of the scale of space and our closest neighbor\"", "url": "https://www.space.com/rare-moonbow-total-lunar-eclipse-astrophoto", "urlToImage": "https://cdn.mos.cms.futurecdn.net/No6b4r2SbkQAUf2erbQPrk-1200-80.jpg", "publishedAt": "2025-03-25T18:00:00Z", "content": "Earlier this month, a total lunar eclipse was visible across Earth and the U.S. was in prime position to see the very best of this spectacular event overnight on March 13.\r\nOver several hours, starga… [+5597 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "James Webb telescope reveals 'cosmic tornado' in best detail ever — and finds part of it is not what it seems - Livescience.com", "description": "The spectacular image shows a \"cosmic tornado\" being burped out from a baby star.", "url": "https://www.livescience.com/space/astronomy/james-webb-telescope-reveals-cosmic-tornado-in-best-detail-ever-and-finds-part-of-it-is-not-what-it-seems", "urlToImage": "https://cdn.mos.cms.futurecdn.net/h5tVYUMPjh3656ze8V6WCZ-1200-80.jpg", "publishedAt": "2025-03-25T17:59:44Z", "content": "NASA's James Webb Space Telescope (JWST) has snapped a spectacular image of a \"cosmic tornado\" being burped out from a baby star.\r\nThe image reveals an outflow of hot gas from a newborn star — known … [+3736 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dust Devils on Mars Create Lightning-like Zaps That Could Endanger Rovers - The Daily Galaxy --Great Discoveries Channel", "description": "Martian dust devils may be more than just swirling storms—they could be generating lightning-like electrical discharges that pose a serious risk to rovers.", "url": "https://dailygalaxy.com/2025/03/dust-devils-mars-lightning-like-zaps/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Dust-Devils-on-Mars-Create-Lightning-like-Zaps-That-Could-Endanger-Rovers.jpg", "publishedAt": "2025-03-25T17:00:00Z", "content": "Mars has always captured the imagination of space explorers, and now new findings are showing that the Red Planets dust devils might be even more dangerous than we thought. These familiar whirlwinds … [+3305 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "An Astronomer Calculated the Exact Day a Star Will Blow—and It’s This Week - Gizmodo", "description": "The rare nova explosion—once it happens—will be so bright that you'll be able to spot it without a telescope.", "url": "https://gizmodo.com/an-astronomer-calculated-the-exact-day-a-star-will-blow-and-its-this-week-2000580309", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/nova-star-explosion.jpeg", "publishedAt": "2025-03-25T16:35:53Z", "content": "Astronomers have been watching a small constellation in the night sky, waiting for a nearby binary star system to explode. The wait may finally be over: A numerical estimate predicts the rare nova er… [+4110 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Mysterious Red Flash Appeared Over the Himalayas — No One Has Ever Seen Before - The Daily Galaxy --Great Discoveries Channel", "description": "A rare and stunning display of red sprites was captured above the Himalayas, leaving scientists astounded. This incredible event not only amazed astrophotographers but also opened a new window into the mysteries of our atmosphere", "url": "https://dailygalaxy.com/2025/03/mysterious-red-flash-appeared-himalayas/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/A-Mysterious-Red-Flash-Appeared-Over-the-Himalayas-—-No-One-Has-Ever-Seen-Before.jpg", "publishedAt": "2025-03-25T16:30:00Z", "content": "In May 2022, an extraordinary electrical phenomenon unfolded in the skies above the Himalayas, capturing the attention of both scientists and skywatchers. Over one hundred rare and vibrant red sprite… [+3071 chars]"}, {"source": {"id": null, "name": "Home.cern"}, "author": null, "title": "A new piece in the matter–antimatter puzzle - CERN", "description": "Yesterday, at the annual Rencontres de Moriond conference taking place in La Thuile, Italy, the LHCb collaboration at CERN reported a new milestone in our understanding of the subtle yet profound differences between matter and antimatter. In its analysis of l…", "url": "https://home.cern/news/press-release/physics/new-piece-matter-antimatter-puzzle", "urlToImage": "https://cds.cern.ch/images//file?size=medium", "publishedAt": "2025-03-25T16:00:00Z", "content": "The LHCb experiment at CERN has revealed a fundamental asymmetry in the behaviour of particles called baryons\r\n Yesterday, at the annual Rencontres de Moriond conference taking place in La Thuile, It… [+4748 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt", "title": "Previously unknown dinosaur species resembled prehistoric ‘Edward Scissorhands’ - CNN", "description": "Paleontologists unearthed the fossil in Mongolia’s Gobi Desert, and the find is unique because of a sheath preserved on one of the digits, which reveals the claw’s true length.", "url": "https://www.cnn.com/2025/03/25/science/two-fingered-claw-dinosaur-duonychus-tsogtbaatari-mongolia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/7-duonychus-hand-reconstruction-illustration-credit-masoto-hattori.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-25T15:40:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith distinctive two-fingered claws, the remains of a … [+3962 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Artemis II Core Stage Integration Complete at Kennedy - The Daily Galaxy --Great Discoveries Channel", "description": "NASA has completed the core stage integration for the Artemis II mission, marking a major milestone as the rocket prepares for its first crewed mission around the Moon.", "url": "https://dailygalaxy.com/2025/03/nasa-artemis-ii-core-stage-integration/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/NASA-Moves-One-Step-Closer-to-Moon-with-Artemis-II-Core-Stage-Integration.jpg", "publishedAt": "2025-03-25T15:00:00Z", "content": "On March 23, 2025, NASA successfully completed a major milestone for the Artemis II mission with the integration of the core stage of the Space Launch System (SLS) rocket at Kennedy Space Center in F… [+4065 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "US Space Force celebrates return of 1st Guardian to launch to space (photos) - Space.com", "description": "\"We're all excited to have you back, and we're ready to leverage your experiences and expertise in the Space Force.\"", "url": "https://www.space.com/space-exploration/international-space-station/us-space-force-celebrates-return-of-1st-guardian-to-launch-to-space-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/APRaTnPrX6ptXbergvurBA-1200-80.jpg", "publishedAt": "2025-03-25T15:00:00Z", "content": "U.S. Space Force Col. Nick Hague is back on Earth after living on the International Space Station (ISS) for the last five-plus months.\r\nOn March 18\r\n, Hague splashed down in the SpaceX\r\n Crew-9 Drago… [+3462 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discover Mysterious Golden Orb at the Bottom of the Ocean - The Daily Galaxy --Great Discoveries Channel", "description": "A mysterious golden orb found 3,300 meters beneath the ocean’s surface has scientists baffled, sparking theories about a new, unknown species or an unusual egg.", "url": "https://dailygalaxy.com/2025/03/scientists-golden-orb-bottom-ocean/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Scientists-Discover-Mysterious-Golden-Orb-at-the-Bottom-of-the-Ocean.jpg", "publishedAt": "2025-03-25T14:30:00Z", "content": "On a routine ocean exploration off the coast of Alaska, scientists stumbled upon an unexpected and puzzling discovery: a mysterious golden orb lying 3,300 meters (2 miles) beneath the ocean surface. … [+5523 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "Strange Spheres Spotted on Mars Baffle NASA Scientists, Point to Red Planet’s Mysterious Past - The Debrief", "description": "NASA scientists were recently “astonished” by the Perseverance rover's discovery of dark gray spheres on Mars, whose origin remains unclear.", "url": "https://thedebrief.org/strange-spheres-spotted-on-mars-baffle-nasa-scientists-point-to-red-planets-mysterious-past/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/03/spheres-on-Mars.jpg", "publishedAt": "2025-03-25T14:12:28Z", "content": "NASA scientists were recently astonished by an unusual discovery made by the Perseverance rover involving a series of dark gray spheres on Mars, whose origin remains unclear.\r\nThe spherical objects w… [+5212 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Elliot Williams", "title": "2024 Hackaday Supercon Talk: Killing Mosquitoes With Freaking Drones, And Sonar - Hackaday", "description": "Suppose that you want to get rid of a whole lot of mosquitoes with a quadcopter drone by chopping them up in the rotor blades. If you had really good eyesight and pretty amazing piloting skills, yo…", "url": "https://hackaday.com/2025/03/25/2024-hackaday-supercon-talk-killing-mosquitoes-with-freaking-drones-and-sonar/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/03/toussaint_feat.png", "publishedAt": "2025-03-25T14:00:00Z", "content": "Suppose that you want to get rid of a whole lot of mosquitoes with a quadcopter drone by chopping them up in the rotor blades. If you had really good eyesight and pretty amazing piloting skills, you … [+3132 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Spot a New Giant Molecular Cloud in the Milky Way, 23,000 Light Years Away - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have discovered a new giant molecular cloud (GMC) in the Milky Way, a finding that has expanded our understanding of the galaxy's structure and", "url": "https://dailygalaxy.com/2025/03/astronomers-molecular-cloud-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Astronomers-Spot-a-New-Giant-Molecular-Cloud-in-the-Milky-Way-23000-Light-Years-Away.jpg", "publishedAt": "2025-03-25T14:00:00Z", "content": "Astronomers have discovered a new giant molecular cloud (GMC) in the Milky Way, a finding that has expanded our understanding of the galaxy’s structure and star formation processes. This new cloud, d… [+3067 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laura Mgrdichian-West", "title": "'Half ice, half fire': Physicists discover new phase of matter in a magnetic material - Phys.org", "description": "Two scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have discovered a new phase of matter while studying a model system of a magnetic material.", "url": "https://phys.org/news/2025-03-ice-physicists-phase-magnetic-material.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/brookhaven-physicists.jpg", "publishedAt": "2025-03-25T13:39:04Z", "content": "Two scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory have discovered a new phase of matter while studying a model system of a magnetic material.\r\nThe phase is a neve… [+5184 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Marathon runners undergo reversible reductions in myelin in the brain during a race, study reveals - Medical Xpress", "description": "A team of neurologists, neuroradiologists and biomaterials specialists affiliated with several institutions in Spain has found that marathon runners undergo a reversible reduction in myelin in the brain during a race. In their study published in the journal N…", "url": "https://medicalxpress.com/news/2025-03-marathon-runners-reversible-reductions-myelin.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/marathon-runners-under.jpg", "publishedAt": "2025-03-25T13:13:01Z", "content": "A team of neurologists, neuroradiologists and biomaterials specialists affiliated with several institutions in Spain has found that marathon runners undergo a reversible reduction in myelin in the br… [+2618 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "Scientists discover new 15 million-year old fish with last meal fossilized inside its stomach - Livescience.com", "description": "Scientists have discovered the fossilized remains of a new fish species called Ferruaspis brocksi, which lived 15 million years ago, and some of the fish have their final meals preserved inside their stomachs.", "url": "https://www.livescience.com/animals/extinct-species/scientists-discover-new-15-million-year-old-fish-with-last-meal-fossilized-inside-its-stomach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cJeYruUrD5srnWgYoCixHg-1200-80.jpg", "publishedAt": "2025-03-25T12:55:39Z", "content": "Fossils of 15 million-year-old freshwater fish discovered in Australia represent a species completely new to science — and they still have the remains of their final meals in their stomachs.\r\nThe fos… [+4465 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Kylie Mohr", "title": "'It's incredibly dynamic': Geologists find new Yellowstone thermal vent - SFGATE", "description": "Yellowstone National Park geologists have discovered a hot new geothermal feature.", "url": "https://www.sfgate.com/national-parks/article/yellowstone-geologists-find-hydrothermal-feature-20234304.php", "urlToImage": "https://s.hdnux.com/photos/01/47/61/51/27204170/3/rawImage.jpg", "publishedAt": "2025-03-25T11:09:19Z", "content": "On an August day in 2024, a Yellowstone National Park ranger driving south between Mammoth Hot Springs and Norris Geyser Basin noticed a plume of steam. Was it really steam, the ranger wondered, or w… [+6194 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Innsbruck", "title": "How an unconventional type of quantum computer opens a new door to the world of elementary particles - Phys.org", "description": "The standard model of particle physics is our best theory of the elementary particles and forces that make up our world: particles and antiparticles, such as electrons and positrons, are described as quantum fields. They interact through other force fields, s…", "url": "https://phys.org/news/2025-03-unconventional-quantum-door-world-elementary.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-type-of-quantum-co.jpg", "publishedAt": "2025-03-25T10:53:41Z", "content": "The standard model of particle physics is our best theory of the elementary particles and forces that make up our world: particles and antiparticles, such as electrons and positrons, are described as… [+4342 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Dazzling photos of this month's total lunar eclipse showcase a blood red moon near the Milky Way's heart - Space.com", "description": "NOIRLab shared stunning views of the total lunar eclipse in the night sky over Chile, complete with a blood red moon and beautiful, star-studded Milky Way.", "url": "https://www.space.com/stargazing/astrophotography/dazzling-photos-of-this-months-total-lunar-eclipse-showcase-a-blood-red-moon-near-the-milky-ways-heart", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aS7aU5fiSceQyNu4D8TyiZ-1200-80.jpg", "publishedAt": "2025-03-25T10:00:00Z", "content": "Breathtaking photos of the total lunar eclipse from earlier this month capture a glowing, blood red moon and star-studded heart of the Milky Way in the night skies over Chile.\r\nA total lunar eclipse\r… [+2750 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "'Unlike any objects we know': Scientists get their best-ever view of 'space tornadoes' howling at the Milky Way's center - Yahoo", "description": "Scientists have gotten the best-ever view of 'space tornadoes' howling near the Milky Way's black hole. The cosmic twisters could play an important role in...", "url": "https://www.livescience.com/space/unlike-any-objects-we-know-scientists-get-their-best-ever-view-of-space-tornadoes-howling-at-the-milky-ways-center", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MFkoclXnsLi7Ud4UDmQhQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/5b5b74dde9dcbe9d7326edaf9bea17de", "publishedAt": "2025-03-25T10:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nA radio-wave map of the Milky Way's turbulent center, taken with the MeerKAT telescope. New res… [+3270 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Tentacled Microbes That Might Have Sparked Complex Life - SciTechDaily", "description": "New research sheds light on one of the biggest questions in biology: where did complex life come from? The answer may lie with Asgard archaea, a group of ancient single-celled microbes that share surprising similarities with more complex organisms. By closely…", "url": "https://scitechdaily.com/the-tentacled-microbes-that-might-have-sparked-complex-life/", "urlToImage": "https://scitechdaily.com/images/Asgard-Archaeon.jpg", "publishedAt": "2025-03-25T08:22:48Z", "content": "An artist’s depiction of an Asgard archaeon, based on cryo-electron tomography data: the cell body and appendages feature thread-like skeletal structures, similar to those found in complex cells with… [+8213 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Javier Carbajal", "title": "Scientists Observe Carbon Dioxide on Planets Outside the Solar System for the First Time - WIRED", "description": "The findings provide strong evidence that four giant exoplanets 130 light-years from Earth formed much like Jupiter and Saturn.", "url": "https://www.wired.com/story/scientists-observe-for-the-first-time-carbon-dioxide-on-other-planets-outside-the-solar-system/", "urlToImage": "https://media.wired.com/photos/67daf71f91fcdb9ee3fd125a/191:100/w_1280,c_limit/jameswebb.jpeg", "publishedAt": "2025-03-25T08:00:00Z", "content": "Carbon dioxide has been detected on a planet outside our solar system for the first time. The gas has been observed directly by the James Webb Space Telescope on four exoplanets, all belonging to the… [+3982 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Just one exo-Earth pixel can reveal continents, oceans, and more - Big Think", "description": "Even from a single pixel, multiwavelength data taken over time can reveal clouds, icecaps, oceans, continents, and even signs of life.", "url": "https://bigthink.com/starts-with-a-bang/one-exo-earth-pixel-continents-oceans/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/03/earthnight.jpg?resize=1200,630", "publishedAt": "2025-03-25T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "How DOGE Recruits Space People - NASA Watch", "description": "this is the sort of thing that DOGE employees use to try and recruit new employees", "url": "https://nasawatch.com/personnel-news/how-doge-recruits-space-people/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/03/DOGEtexting.png", "publishedAt": "2025-03-25T00:38:33Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Tiny Particle is Redefining Our View of the Atomic Nucleus - SciTechDaily", "description": "University of Queensland scientists have cracked a long-standing puzzle in nuclear physics, showing that nuclear polarization, once thought to hinder experiments with muonic atoms, has a much smaller effect than expected. This surprising result clears a major…", "url": "https://scitechdaily.com/this-tiny-particle-is-redefining-our-view-of-the-atomic-nucleus/", "urlToImage": "https://scitechdaily.com/images/Physics-Atom-Nucleus-Art.jpg", "publishedAt": "2025-03-24T23:33:35Z", "content": "Muonic atoms can now unlock nuclear secrets, thanks to a breakthrough that minimizes polarization concerns. Credit: SciTechDaily.com\r\nUniversity of Queensland scientists have cracked a long-standing … [+2792 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Sandra Erwin", "title": "NRO expands spy satellite network with back-to-back SpaceX launches - SpaceNews", "description": "The NROL-69 mission launched from Cape Canaveral Space Force Station.", "url": "http://spacenews.com/nro-expands-spy-satellite-network-with-back-to-back-spacex-launches/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDNcL0xhdW5jaC1FbnRyeS1MYW5kaW5nLTEwMjR4NjgzLmpwZyIsInR4dCI6Ik5STyBleHBhbmRzIHNweSBzYXRlbGxpdGUgbmV0d29yayB3aXRoIGJhY2stdG8tYmFjayBTcGFjZVggbGF1bmNoZXMiLCJ0ZW1wbGF0ZSI6ImZ1bGxzY3JlZW4iLCJibG9nX2lkIjo4MDY4MTk3OX0.8ihWRZEKpYS8p0hnB6XvYrHqZXOyP3vekE0ecj_O3mAMQ", "publishedAt": "2025-03-24T22:59:39Z", "content": "WASHINGTON A SpaceX Falcon 9 rocket on March 24 successfully launched the classified NROL-69 mission for the National Reconnaissance Office, putting the agency on a path to build the largest ever U.S… [+1462 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Carolyn Collins Petersen", "title": "We're one step closer to a giant interferometer on the moon - Phys.org", "description": "What's on and in a star? What happens in an active galactic nucleus? Answering those questions is the goal of a proposed giant interferometer on the moon. It's called the Artemis-enabled Stellar Imager (AeSI) and would deploy a series of 15–30 optical/ultravi…", "url": "https://phys.org/news/2025-03-closer-giant-interferometer-moon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/were-one-step-closer-t.jpg", "publishedAt": "2025-03-24T21:17:18Z", "content": "What's on and in a star? What happens in an active galactic nucleus? Answering those questions is the goal of a proposed giant interferometer on the moon. It's called the Artemis-enabled Stellar Imag… [+8765 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Queen Mary, University of London", "title": "Biologists discover ancient neurohormone that controls appetite - Phys.org", "description": "A team of biologists at Queen Mary University of London has discovered that a neurohormone controlling appetite in humans has an ancient evolutionary origin, dating back over half a billion years. The findings, published in Proceedings of the National Academy…", "url": "https://phys.org/news/2025-03-biologists-ancient-neurohormone-appetite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/appetite.jpg", "publishedAt": "2025-03-24T19:57:09Z", "content": "A team of biologists at Queen Mary University of London has discovered that a neurohormone controlling appetite in humans has an ancient evolutionary origin, dating back over half a billion years. Th… [+4754 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Chu | MIT News", "title": "Mathematicians uncover the logic behind how people walk in crowds - MIT News", "description": "Mathematicians studied the flow of human crowds and developed a way to predict when pedestrian paths will transition from orderly to entangled. Their findings may help inform the design of public spaces that promote safe and efficient thoroughfares.", "url": "https://news.mit.edu/2025/mathematicians-uncover-logic-behind-how-crowds-walk-0324", "urlToImage": "https://news.mit.edu/sites/default/files/images/202503/MIT-CrowdFlow-01.jpg", "publishedAt": "2025-03-24T19:00:00Z", "content": "Next time you cross a crowded plaza, crosswalk, or airport concourse, take note of the pedestrian flow. Are people walking in orderly lanes, single-file, to their respective destinations? Or is it a … [+7497 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Asteroid 2024 YR4 May Miss Earth in 2032, But It’s Not Gone for Good - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers confirm that asteroid 2024 YR4 won't hit Earth in 2032, but its return could still pose a threat in the future, according to a recent study.", "url": "https://dailygalaxy.com/2025/03/asteroid-2024-yr4-miss-earth-2032-not-gone/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Asteroid-2024-YR4.jpg", "publishedAt": "2025-03-24T18:30:00Z", "content": "In a cosmic twist of fate, scientists have confirmed that asteroid 2024 YR4, a near-Earth asteroid previously thought to pose a significant threat, will not collide with our planet in 2032. However, … [+3051 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "17-Year-Old Discovers Black Hole Echo Bigger Than the Milky Way - The Daily Galaxy --Great Discoveries Channel", "description": "A 17-year-old student searching for dying stars made a discovery that left astronomers speechless — a mysterious glow stretching far beyond our galaxy. What he found wasn't what anyone expected.", "url": "https://dailygalaxy.com/2025/03/17-year-old-discovers-black-hole-echo-bigger-than-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/17-Year-Old-Discovers-Black-Hole-Echo-Bigger-Than-the-Milky-Way-.jpg", "publishedAt": "2025-03-24T18:00:00Z", "content": "A high school student in New York has stumbled onto a massive discovery a cosmic light echo possibly spanning twice the width of the Milky Way. While scanning space for signs of dying stars, 17-year-… [+2771 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "'Potentially hazardous' pyramid-size asteroid will make its closest flyby of Earth for more than 100 years this Wednesday - Livescience.com", "description": "The hefty space rock 2014 TN17 is large enough to wipe out a city, but it will pose no risk to our planet when it sails by this Wednesday (March 26). Researchers will monitor it carefully during its close approach.", "url": "https://www.livescience.com/space/asteroids/potentially-hazardous-pyramid-size-asteroid-will-make-its-closest-flyby-of-earth-for-more-than-100-years-this-wednesday", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FasZ27BnUtAKBFpoFfHLhV-1200-80.jpg", "publishedAt": "2025-03-24T17:51:59Z", "content": "A \"potentially hazardous\" pyramid-size asteroid\r\n is about to zoom past Earth at around 48,000 mph (77,300 km/h) this week as it reaches its closest point to our planet in more than 100 years. But th… [+3530 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Invites Media to SpaceX’s 32nd Resupply Launch to Space Station - NASA", "description": "NASA and SpaceX are targeting no earlier than Monday, April 21, to launch the SpaceX Dragon spacecraft on the company’s Falcon 9 rocket from Launch Complex", "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-spacexs-32nd-resupply-launch-to-space-station/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/ksc-20241104-ph-spx01-0001large.jpg", "publishedAt": "2025-03-24T17:34:47Z", "content": "Media accreditation is open for the next launch to deliver NASA science investigations, supplies, and equipment to the International Space Station.\r\nNASA and SpaceX are targeting no earlier than Mond… [+2719 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Three Hundred Years Later, a Tool from Isaac Newton Gets an Update - Quanta Magazine", "description": "A simple, widely used mathematical technique can finally be applied to boundlessly complex problems.", "url": "https://www.quantamagazine.org/three-hundred-years-later-a-tool-from-isaac-newton-gets-an-update-20250324/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/03/Newtons-Method-cr.MicheleSclafani-Social.jpg", "publishedAt": "2025-03-24T17:34:22Z", "content": "Every day, researchers search for optimal solutions. They might want to figure out where to build a major airline hub. Or to determine how to maximize return while minimizing risk in an investment po… [+10881 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Katherine Bryant, Rogier Mars", "title": "What makes the human brain unique? We compared it with monkeys and apes to find out - The Conversation Indonesia", "description": "Advances in technology are making it easier to explore this question.", "url": "https://theconversation.com/what-makes-the-human-brain-unique-we-compared-it-with-monkeys-and-apes-to-find-out-252331", "urlToImage": "https://images.theconversation.com/files/657157/original/file-20250324-68-hionxf.jpg?ixlib=rb-4.1.0&rect=0%2C377%2C9000%2C4500&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-03-24T17:31:02Z", "content": "Scientists have long tried to understand the human brain by comparing it to other primates. Researchers are still trying to understand what makes our brain different to our closest relatives. Our rec… [+5310 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA Takes to the Air to Study Wildflowers - NASA", "description": "For many plant species, flowering is biologically synced with the seasons. Scientists are clocking blooms to understand our ever-changing planet.", "url": "https://www.nasa.gov/earth/nasa-takes-to-the-air-to-study-wildflowers/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/1-wildflower-field-work-.png", "publishedAt": "2025-03-24T16:51:56Z", "content": "For many plant species, flowering is biologically synced with the seasons. Scientists are clocking blooms to understand our ever-changing planet.\r\nNASA research is revealing theres more to flowers th… [+5058 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kevin Stacey", "title": "Updated physical model helps reconstruct sudden, dramatic sea level rise after last ice age - Phys.org", "description": "Around 14,500 years ago, toward the end of the last ice age, melting continental ice sheets drove a sudden and cataclysmic sea level rise of up to 65 feet in just 500 years or less. Despite the scale of the event, known as Meltwater Pulse 1a, scientists still…", "url": "https://phys.org/news/2025-03-physical-reconstruct-sudden-sea-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-research-helps-rec.jpg", "publishedAt": "2025-03-24T16:18:05Z", "content": "Around 14,500 years ago, toward the end of the last ice age, melting continental ice sheets drove a sudden and cataclysmic sea level rise of up to 65 feet in just 500 years or less. Despite the scale… [+6042 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Chicken Embryos Grow Dinosaur-like Feathers After Gene Switch - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have triggered ancient traits in chicken embryos, causing them to grow dinosaur-like feathers. But what happened next surprised even the researchers—hinting at evolution’s hidden backup plans.", "url": "https://dailygalaxy.com/2025/03/chicken-embryos-dinosaur-gene-switch/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Chicken-Embryos-Grow-Dinosaur-like-Feathers-After-Gene-Switch.jpg", "publishedAt": "2025-03-24T16:00:00Z", "content": "Feathers may define birds today, but their story began millions of years ago in creatures that looked very different from modern avians. A new study has just pushed the boundary of evolutionary biolo… [+3214 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alex Jones", "title": "Shocking spherules on Mars - Phys.org", "description": "Last week, the Perseverance Science Team were astonished by a strange rock comprised of hundreds of millimeter-sized spheres… and the team are now working hard to understand their origin.", "url": "https://phys.org/news/2025-03-spherules-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/shocking-spherules-on.jpg", "publishedAt": "2025-03-24T15:19:03Z", "content": "Last week, the Perseverance Science Team were astonished by a strange rock comprised of hundreds of millimeter-sized spheres and the team are now working hard to understand their origin.\r\nIt has now … [+2759 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Norbert Junkes", "title": "Event Horizon Telescope allows close study of accelerating jets from black holes - Phys.org", "description": "An international team of researchers used multi-wavelength observations of active galactic nuclei to study how black holes launch relativistic jets. The sixteen sources were observed with the Event Horizon Telescope during its first campaign in 2017. The extr…", "url": "https://phys.org/news/2025-03-event-horizon-telescope-jets-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/accelerating-jets-from.jpg", "publishedAt": "2025-03-24T15:12:04Z", "content": "An international team of researchers used multi-wavelength observations of active galactic nuclei to study how black holes launch relativistic jets. The sixteen sources were observed with the Event H… [+6816 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious 'Death Star' on The Verge of Exploding Is Hiding a Secret - ScienceAlert", "description": "Thousands of light-years from Earth, the dramatic death throes of a giant star are playing out.", "url": "https://www.sciencealert.com/mysterious-death-star-on-the-verge-of-exploding-is-hiding-a-secret", "urlToImage": "https://www.sciencealert.com/images/2025/03/wr-104.jpg", "publishedAt": "2025-03-24T15:02:35Z", "content": "Thousands of light-years from Earth, the dramatic death throes of a giant star are playing out.\r\nIt's part of a star system called Wolf-Rayet 104 (WR 104), also known famously as the Pinwheel Nebula.… [+4777 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Private SpaceX Fram2 mission ready for world's 1st crewed flight over Earth's polar regions (photos) - Space.com", "description": "SpaceX will launch the first crewed mission orbit over the North and South Poles no earlier than March 31.", "url": "https://www.space.com/space-exploration/missions/private-spacex-fram2-mission-ready-for-worlds-1st-crewed-flight-over-earths-polar-regions-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LVzSbUS4buvwG2txPD8zVX-1200-80.jpg", "publishedAt": "2025-03-24T14:58:36Z", "content": "SpaceX's mission to launch the first astronauts into polar orbit is quickly approaching.\r\nNamed for the Norwegian seafaring ship Fram, which completed expeditions of the Arctic and Antarctic regions … [+3211 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Gorgeous Hubble telescope image was 20 years in the making: Space photo of the day - Space.com", "description": "The Hubble Space Telescope captured an image of a star and a spiral galaxy, both in the constellation Virgo. But the photo is an optical illusion.", "url": "https://www.space.com/space-exploration/hubble-space-telescope/gorgeous-hubble-telescope-image-was-20-years-in-the-making-space-photo-of-the-day", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PRkaAXuZgK3SxokyT9rE9E-1200-80.jpg", "publishedAt": "2025-03-24T14:32:49Z", "content": "This Hubble Space Telescope image of NGC 4900 appears to show a bright star overlapping the spiral galaxy. But while both celestial objects appear to be in the constellation Virgo as viewed from Eart… [+2815 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Abbey A. Donaldson", "title": "NASA’s SpaceX Crew-9 Astronauts to Discuss Science Mission - NASA", "description": "After completing a long-duration stay aboard the International Space Station, NASA’s SpaceX Crew-9 astronauts will discuss their science mission during a", "url": "https://www.nasa.gov/news-release/nasas-spacex-crew-9-astronauts-to-discuss-science-mission/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/03/54394869292-9cc1f8ca6c-k.jpg", "publishedAt": "2025-03-24T14:04:36Z", "content": "After completing a long-duration stay aboard the International Space Station, NASAs SpaceX Crew-9 astronauts will discuss their science mission during a postflight news conference at 2:30 p.m. EDT Mo… [+3662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Might the proton decay in other places or at other times? - Phys.org", "description": "Does the proton decay? While this was a famous prediction of Grand Unified Theories (GUTS) developed in the 1970s and 1980s, experimentalists have ruled it out—or rather, put lower limits on its mean lifetime of about 1034 years. That's 20 orders of magnitude…", "url": "https://phys.org/news/2025-03-proton-decay.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/might-the-proton-decay.jpg", "publishedAt": "2025-03-24T14:00:03Z", "content": "Does the proton decay? While this was a famous prediction of Grand Unified Theories (GUTS) developed in the 1970s and 1980s, experimentalists have ruled it outor rather, put lower limits on its mean … [+5698 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jackson K Njau", "title": "1.5 million-year-old bone tools discovered in Tanzania rewrite the history of human evolution - The Conversation", "description": "By 1.5 million years ago, Homo erectus was able to transfer tool-making skills from stone to bone.", "url": "https://theconversation.com/1-5-million-year-old-bone-tools-discovered-in-tanzania-rewrite-the-history-of-human-evolution-251826", "urlToImage": "https://images.theconversation.com/files/654350/original/file-20250311-56-t75tk1.jpg?ixlib=rb-4.1.0&rect=15%2C81%2C1039%2C518&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-03-24T13:24:41Z", "content": "The ancestors of humans started making tools about 3.3 million years ago. First they made them out of stone, then they switched to bone as a raw material. Until recently, the earliest clear evidence … [+5404 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Jackie Appel", "title": "A Shocking Discovery Shows Dark Energy Is Weakening—and We Might Be Wrong About How the Universe Ends - Yahoo", "description": "Well… not everything. But also, not not everything", "url": "https://www.popularmechanics.com/space/deep-space/a64245003/desi-dark-energy/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7V.CbNRyeGvk9dsvHsd9uQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/4ee85aeea23aeb669b34dfef17a7c02e", "publishedAt": "2025-03-24T13:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>The Dark Energy Spectroscopic Instrument (DESI) collaboration just dropped their first official… [+7515 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "“We Can Finally See the Very First Moment”: Scientists Capture the Birth of the Universe with Unprecedented Precision - The Daily Galaxy --Great Discoveries Channel", "description": "The ACT telescope has been a key player in these breakthroughs, capturing incredibly detailed images of the universe’s earliest structures.", "url": "https://dailygalaxy.com/2025/03/we-can-finally-see-the-very-first-moment-scientists-capture-the-birth-of-the-universe-with-unprecedented-precision/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/the-new-half-sky-image-from-the-Atacama-Cosmology-Telescope.jpg", "publishedAt": "2025-03-24T12:00:00Z", "content": "In a major breakthrough for cosmology, scientists have captured an image that reveals the universes earliest moments with remarkable precision. Thanks to advanced telescopes, particularly the Atacama… [+3145 chars]"}, {"source": {"id": null, "name": "Usgs.gov"}, "author": null, "title": "Ash plume heights, hazards, and ashfall projections, oh my! What do volcanologists learn from ashfall maps? - United States Geological Survey", "description": "How do volcanologists determine the height of eruptive plumes from Yellowstone’s past explosive eruptions? Ironically, you have to dig into the ground to get the answer.", "url": "https://www.usgs.gov/observatories/yvo/news/ash-plume-heights-hazards-and-ashfall-projections-oh-my-what-do", "urlToImage": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/styles/teaser/public/media/images/Wilson_Basin_Wyoming.jpg?itok=VFFtxXnz", "publishedAt": "2025-03-24T10:07:06Z", "content": "Yellowstone Caldera Chronicles is a weekly column written by scientists and collaborators of the Yellowstone Volcano Observatory. This week's contribution is from Dr. Madison Myers, Associate Profess… [+5941 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou", "title": "NASA websites no longer promote ‘first woman’ on the moon for Artemis - Orlando Sentinel", "description": "NASA websites have dropped references to landing the first woman on the moon as part of the goals for its Artemis program.", "url": "https://www.orlandosentinel.com/2025/03/21/nasa-websites-no-longer-promoting-first-woman-on-the-moon-for-artemis/", "urlToImage": "https://www.orlandosentinel.com/wp-content/uploads/2024/01/tos-l-orion-media-day0757-2.jpg?w=1024&h=683", "publishedAt": "2025-03-21T19:51:11Z", "content": "NASA websites have dropped references to landing the first woman on the moon as part of the goals for its Artemis program.\r\nUpdated pages as of Friday for the program no longer feature the statement:… [+4410 chars]"}]}