{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Captures Mysterious Gas Jets From Speeding Object in the Outer Solar System - SciTechDaily", "description": "Scientists revealed unexpected outgassing from this object galloping across the outer solar system. Similar to the Ancient Greek mythological creature of the same name, centaurs in astronomy are in an in-between dynamical phase: leaving their distant and stab…", "url": "https://scitechdaily.com/webb-telescope-captures-mysterious-gas-jets-from-speeding-object-in-the-outer-solar-system/", "urlToImage": "https://scitechdaily.com/images/Outgassing-Asteroid-Comet-Concept.jpg", "publishedAt": "2024-10-10T12:35:15Z", "content": "Astronomers using the James Webb Space Telescope have observed unique gas emissions from Centaur 29P, providing new insights into the chemical and physical characteristics of centaurs in our solar sy… [+9759 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2024-10-10T12:00:53Z", "content": "[Removed]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "A severe geomagnetic storm could cause colorful auroras over Northern California and Alabama - CNN", "description": "A severe geomagnetic storm is expected to reach Earth on Thursday, which could bring an increased chance of auroras and may affect communications and the power grid.", "url": "https://www.cnn.com/2024/10/09/science/solar-storm-aurora-power-gps/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2151911419.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-10-10T00:54:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nColorful auroras could be visible in areas of the Unit… [+5405 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "NASA “really looking forward” to next Starship test flight - SpaceNews", "description": "As SpaceX prepares for the test flight of its Starship vehicle, NASA is closely watching as it waits for the company to achieve the next milestones on development of the lunar lander version of the…", "url": "https://spacenews.com/nasa-really-looking-forward-to-next-starship-test-flight/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/starship-ift5-preview.jpg?resize=1200%2C1125&ssl=1", "publishedAt": "2024-10-09T23:30:24Z", "content": "Updated 9 p.m. Eastern with Gerstenmaier comments.\r\nWASHINGTON As SpaceX prepares for the test flight of its Starship vehicle, NASA is closely watching as it waits for the company to achieve the next… [+5309 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "First complete map of every neuron in an adult brain revealed - Earth.com", "description": "Scientists reveal the first complete neural map of an adult brain, mapping every neuron and connection for new insights into brain function.", "url": "https://www.earth.com/news/first-complete-map-of-every-neuron-in-the-brain-revealed/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/07153853/neurons_50-largest_mapped_fruit-fly-brain_UCambridge_1m.jpg", "publishedAt": "2024-10-09T21:44:16Z", "content": "Imagine gazing at the intricate yet beautiful map of an entire city, but the city is in fact a brain. Sounds fascinating, doesn’t it? Well, scientists have now made this a reality.\r\nExperts have crea… [+5736 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jeremy Gray", "title": "Perseverance Rover Spies Incredible Blue Rocks on Mars and Makes Incredible Discovery - PetaPixel", "description": "Beautiful blue rocks photographed on Mars.", "url": "https://petapixel.com/2024/10/09/perseverance-rover-spies-incredible-blue-rocks-on-mars-and-makes-incredible-discovery/", "urlToImage": "https://petapixel.com/assets/uploads/2024/10/nasa-mars-blue-rocks-featured.jpg", "publishedAt": "2024-10-09T21:43:57Z", "content": "NASA’s Perseverance rover captured the clearest view of Mars’ landscape yet, showing incredible blue rocks on the dusty surface that raise pivotal questions about the Red Planet’s complex history. \r\n… [+2742 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Bruce Einhorn, Linda Lew", "title": "China Is Playing Catch-Up to Elon Musk in Space - Bloomberg", "description": "President Xi wants to build China into a “space power.” But SpaceX’s big lead and China’s security concerns could hinder the nation’s private launch startups.", "url": "https://www.bloomberg.com/news/articles/2024-10-09/china-is-trying-to-rival-elon-musk-in-space", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iTnzH18BpcUY/v0/1200x630.jpg", "publishedAt": "2024-10-09T21:00:27Z", "content": "From electric cars to civilian drones to solar panels, Chinese companies have rapidly emerged as global leaders in advanced industries that the government considers critical. Theres one area, though,… [+632 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Texas at Austin", "title": "Astronomers race to capture image of exoplanet near star - Phys.org", "description": "Planet AF Lep b is a world of firsts. In 2023, it was the lowest-mass planet outside our solar system to be directly observed and have its mass measured using astrometry. This is a technique that charts the subtle movements of a host star over many years to g…", "url": "https://phys.org/news/2024-10-astronomers-capture-image-exoplanet-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/astronomers-race-to-ca.jpg", "publishedAt": "2024-10-09T20:40:22Z", "content": "Planet AF Lep b is a world of firsts. In 2023, it was the lowest-mass planet outside our solar system to be directly observed and have its mass measured using astrometry. This is a technique that cha… [+4566 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sierra Bouchér", "title": "Never-before-seen head of prehistoric, car-size 'millipede' solves evolutionary mystery - Livescience.com", "description": "The fossil showed unique stalked eyes and centipede-like characteristics.", "url": "https://www.livescience.com/animals/extinct-species/never-before-seen-head-of-prehistoric-car-size-millipede-solves-evolutionary-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7wxcxRjTAqDSLJLVVvedbR-1200-80.png", "publishedAt": "2024-10-09T20:30:56Z", "content": "The face of a car-size, millipede-like creature — the largest arthropod ever to live — has finally been revealed thanks to two well-preserved fossils, a new study reports.\r\nThe arthropod, Arthropleur… [+3458 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NASA", "title": "Jupiter's Great Red Spot shows unexpected size changes - Phys.org", "description": "Astronomers have observed Jupiter's legendary Great Red Spot (GRS), an anticyclone large enough to swallow Earth, for at least 150 years. But there are always new surprises—especially when NASA's Hubble Space Telescope takes a close-up look at it.", "url": "https://phys.org/news/2024-10-jupiter-great-red-unexpected-size.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/nasas-hubble-telescope.jpg", "publishedAt": "2024-10-09T20:26:56Z", "content": "Astronomers have observed Jupiter's legendary Great Red Spot (GRS), an anticyclone large enough to swallow Earth, for at least 150 years. But there are always new surprisesespecially when NASA's Hubb… [+5717 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Sam Mauhay-Moore", "title": "How to view the rare Draconid meteor shower from the Bay Area - SFGATE", "description": "This week's meteor shower sets the stage for a busy meteor season through the end of 2024.", "url": "https://www.sfgate.com/bayarea/article/draconid-meteor-shower-california-bay-area-19826809.php", "urlToImage": "https://s.hdnux.com/photos/01/44/13/66/26262917/3/rawImage.jpg", "publishedAt": "2024-10-09T20:26:32Z", "content": "A bright Geminid Meteor falls from the sky over the summit of 14,505 foot Mount Whitney in California's Sierra Nevada mountains.\r\nTony Rowell/Getty Images\r\nWe may be past the peak of the elusive Drac… [+3443 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars Revealed: NASA’s Curiosity Rover Uncovers the Red Planet’s Shocking Climate Shift - SciTechDaily", "description": "Curiosity’s exploration of Gale crater on Mars has uncovered new evidence about the planet’s climate evolution. By studying isotopic values in carbon-rich minerals, scientists have discovered that ancient Mars likely underwent extreme evaporation, creating ca…", "url": "https://scitechdaily.com/mars-revealed-nasas-curiosity-rover-uncovers-the-red-planets-shocking-climate-shift/", "urlToImage": "https://scitechdaily.com/images/Early-Mars-With-Liquid-Water.jpg", "publishedAt": "2024-10-09T20:18:03Z", "content": "This is an artist’s concept of an early Mars with liquid water (blue areas) on its surface. Ancient regions on Mars bear signs of abundant water – such as features resembling valleys and deltas, and … [+7070 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": null, "title": "Scientists uncover ‘sixth sense’ in geckos – and they say it could help humans with hearing disorders - BBC Discover Wildlife", "description": "It's thought that other reptiles may also possess this hidden talent.", "url": "https://www.discoverwildlife.com/animal-facts/reptiles/geckos-have-sixth-sense", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2024/10/Tokay-gecko.jpg?w=1200", "publishedAt": "2024-10-09T20:08:30Z", "content": "An exciting new study by biologists at the University of Maryland (UMD) in the UShas revealed that geckos have a hidden superpower. \r\nThe team found that these lizards use their inner ear not just fo… [+1767 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "Comet Tsuchinshan-ATLAS photobombs SOHO spacecraft during powerful solar flare (video) - Space.com", "description": "Comet Tsuchinshan-ATLAS is putting on a show in multiple ways.", "url": "https://www.space.com/comet-tsuchinshan-atlas-soho-solar-flare-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LLnmQPjuNDvE2HPqvT7m4C-1200-80.jpg", "publishedAt": "2024-10-09T20:04:37Z", "content": "Nothing makes a photo more interesting than an unexpected guest appearing in the background. And how cool would it be if the photobomber were a comet?\r\nThat's exactly what happened to the sun-studyin… [+3335 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Saima May Sidik", "title": "Scientists uncover details of a catastrophic volcanic eruption and flood over 1,000 years ago - Phys.org", "description": "In the year 946 CE, the Changbaishan-Tianchi volcano, on the border between China and North Korea, erupted ferociously. The eruption released dozens of cubic kilometers of magma and triggered a massive flood from the lake atop the volcano's summit, known toda…", "url": "https://phys.org/news/2024-10-scientists-uncover-catastrophic-volcanic-eruption.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-details-about-a-ve.jpg", "publishedAt": "2024-10-09T19:08:26Z", "content": "In the year 946 CE, the Changbaishan-Tianchi volcano, on the border between China and North Korea, erupted ferociously. The eruption released dozens of cubic kilometers of magma and triggered a massi… [+2653 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Octopus suckers inspire new tech for gripping objects underwater - Ars Technica", "description": "New adhesive system could be powerful tool for underwater salvage, rescue operations.", "url": "https://arstechnica.com/science/2024/10/octopus-suckers-inspire-new-tech-for-gripping-objects-underwater/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/octo1.jpg", "publishedAt": "2024-10-09T19:00:29Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kitta MacPherson", "title": "In double breakthrough, mathematician helps solve two long-standing problems - Phys.org", "description": "A Rutgers University-New Brunswick professor who has devoted his career to resolving the mysteries of higher mathematics has solved two separate, fundamental problems that have perplexed mathematicians for decades.", "url": "https://phys.org/news/2024-10-breakthrough-mathematician-problems.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/in-double-breakthrough-1.jpg", "publishedAt": "2024-10-09T18:57:13Z", "content": "A Rutgers University-New Brunswick professor who has devoted his career to resolving the mysteries of higher mathematics has solved two separate, fundamental problems that have perplexed mathematicia… [+6359 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "Research supports run–walk interval training as a way to reduce chronic low back pain - Medical Xpress", "description": "A study conducted at Monash University, Australia, has demonstrated that a progressive run–walk interval training program, delivered digitally and supported remotely, is not only effective in reducing pain and disability in adults with chronic low back pain (…", "url": "https://medicalxpress.com/news/2024-10-runwalk-interval-chronic-pain.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/runners.jpg", "publishedAt": "2024-10-09T18:55:45Z", "content": "A study conducted at Monash University, Australia, has demonstrated that a progressive runwalk interval training program, delivered digitally and supported remotely, is not only effective in reducing… [+3565 chars]"}, {"source": {"id": null, "name": "ForexLive"}, "author": "Adam Button", "title": "In the age of AI, here's an old reminder that technology can advance at lightning speed - ForexLive", "description": "Jeffrey Hinton Don't bet against human invention. . Most, if not virtually all people still have little grasp on how much change generative artificial intelligence will bring.", "url": "https://www.forexlive.com/news/in-the-age-of-ai-heres-an-old-reminder-that-technology-can-advance-at-lightning-speed-20241009/", "urlToImage": "https://images.forexlive.com/images/Jeffrey%20Hinton_id_1117d9f1-b67d-4b11-83be-119b158b696c_size975.jpg", "publishedAt": "2024-10-09T18:41:00Z", "content": "Don't bet against human invention.\r\nMost, if not virtually all people still have little grasp on how much change generative artificial intelligence will bring. Yesterday, the Nobel Prize for physics … [+2067 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Ryan Erik King", "title": "Hurricane Milton Strands Astronauts In Space As NASA Delays SpaceX Crew-8 Return - Jalopnik", "description": "The Crew-8 Dragon was scheduled to land off the coast of Florida this week", "url": "https://jalopnik.com/hurricane-milton-strands-astronauts-in-space-as-nasa-de-1851669127", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/b6e48968dead9aedb1cc769ec1689a64.jpg", "publishedAt": "2024-10-09T18:35:00Z", "content": "The category-four Hurricane Milton will make landfall in Florida on Wednesday and is projected to be the worst to strike the state in 100 years. The devastation expected across the peninsula has alre… [+1589 chars]"}, {"source": {"id": null, "name": "HubbleSite"}, "author": null, "title": "NASA's Hubble, New Horizons Team Up for a Simultaneous Look at Uranus - Hubble Space Telescope", "description": "", "url": "https://hubblesite.org/contents/news-releases/2024/news-2024-033", "urlToImage": "//stsci-opo.org/STScI-01J99DNXY9H9KYZHBCE3VRZT3W.jpg", "publishedAt": "2024-10-09T18:30:00Z", "content": "NASA's Hubble Space Telescope and New Horizons spacecraft simultaneously set their sights on Uranus recently, allowing scientists to make a direct comparison of the planet from two very different vie… [+6328 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "Ocean experts raise concerns over deorbiting the International Space Station - SpaceNews", "description": "GOLDEN, Colorado — NASA is faced with the challenge of safely deorbiting, in one fell swoop, over 400 tons of space hardware in a few years. As of now, the agency plans on deorbiting the Internatio…", "url": "https://spacenews.com/ocean-experts-raise-concerns-over-deorbiting-the-international-space-station/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/PHOTO-1-ISS-LARGE-NASA-scaled.jpg?resize=1200%2C1200&ssl=1", "publishedAt": "2024-10-09T18:25:26Z", "content": "GOLDEN, Colorado NASA is faced with the challenge of safely deorbiting, in one fell swoop, over 400 tons of space hardware in a few years. As of now, the agency plans on deorbiting the International … [+5839 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Laura Sorto", "title": "Artemis I Radiation Measurements Validate Orion Safety for Astronauts - NASA", "description": "NASA's Orion spacecraft is designed to keep astronauts safe in deep space, protecting them from the unforgiving environment far from Earth. During the", "url": "https://www.nasa.gov/missions/artemis/artemis-1/artemis-i-radiation-measurements-validate-orion-safety-for-astronauts/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/artemis-i-srag-orion.jpg", "publishedAt": "2024-10-09T18:19:06Z", "content": "NASA’s Orion spacecraft is designed to keep astronauts safe in deep space, protecting them from the unforgiving environment far from Earth. During the uncrewed Artemis I mission, researchers from NAS… [+3358 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Korine Powers", "title": "NASA Terminal Transmits First Laser Communications Uplink to Space - NASA", "description": "NASA’s LCOT (Low-Cost Optical Terminal), a ground station made of modified commercial hardware, transmitted its first laser communications uplink to the TBIRD", "url": "https://www.nasa.gov/technology/space-comms/space-communications/nasa-terminal-transmits-first-laser-communications-uplink-to-space/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/01/lcot-terminal-1.jpg", "publishedAt": "2024-10-09T18:11:05Z", "content": "NASAs LCOT (Low-Cost Optical Terminal), a ground station made of modified commercial hardware, transmitted its first laser communications uplink to the TBIRD (TeraByte Infrared Delivery), a tissue bo… [+4189 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Will Dunham", "title": "Oldest-known birds of prey lived alongside T. rex in North America - Reuters", "description": "In western North America during the twilight of the dinosaur age, the unquestioned ruler was Tyrannosaurus rex, one of the largest terrestrial predators in Earth's history. But there were many other predators earning a living in various ways, including - as n…", "url": "https://www.reuters.com/science/oldest-known-birds-prey-lived-alongside-t-rex-north-america-2024-10-09/", "urlToImage": "https://www.reuters.com/resizer/v2/LLFLYKEPPJKAJOTZBZAY7BC6TI.jpg?auth=737e149fbbfbab4f415ce9c337d5a67a04d6a2009bb27b8ab30a602a1f372184&height=1005&width=1920&quality=80&smart=true", "publishedAt": "2024-10-09T18:10:40Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Astronauts could mine asteroids for food someday, scientists say - Space.com", "description": "Material harvested from asteroids could be used to sustain astronauts during long-duration space missions.", "url": "https://www.space.com/mining-asteroids-food-deep-space-missions", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ThWMPASDNMXYUdGid9AjSJ-1200-80.jpg", "publishedAt": "2024-10-09T18:02:10Z", "content": "Material harvested from asteroids could be used to sustain astronauts during long-duration space missions. \r\nResearchers from Western University's Institute for Earth and Space Exploration have ident… [+3225 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "Io: Jupiter's hellish and beautiful moon where rivers of lava never stop flowing - Boing Boing", "description": "Boing Boing is the Web's favorite site devoted to technology, entertainment, and culture. Launched in 1989 as a print 'zine and still...", "url": "https://boingboing.net/", "urlToImage": "https://boingboing.net/wp-content/uploads/2022/06/bbstacked.jpg", "publishedAt": "2024-10-09T17:30:00Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Mysterious 'blobs' in Earth's mantle are not what we thought, study claims - Livescience.com", "description": "Lava that erupts from hotspots around the world seems to come from a similar ancestral magma, new research finds.", "url": "https://www.livescience.com/planet-earth/volcanos/mysterious-blobs-in-earths-mantle-are-not-what-we-thought-study-claims", "urlToImage": "https://cdn.mos.cms.futurecdn.net/t4STXaxDHsxXZgsQNajRZh-1200-80.jpg", "publishedAt": "2024-10-09T16:38:32Z", "content": "Lava around the world may come from the same magma ancestor deep in Earth's middle layer, new research finds.\r\nThe study suggests that the deep mantle, where magma arises, is more uniform than scient… [+4344 chars]"}, {"source": {"id": null, "name": "TheInertia.com"}, "author": "Nikolai Barkats", "title": "Montana Snowbowl Resort and the Death of the Local Town Mountain - The Inertia", "description": "", "url": "https://www.theinertia.com/mountain/montana-snowbowl-resort-and-the-death-of-the-local-town-mountain/", "urlToImage": "http://www.theinertia.com/wp-content/uploads/2024/05/snowbowlheader.jpg", "publishedAt": "2024-10-09T16:27:19Z", "content": "The view that makes it all worth it. Photo: Geoff Perna\r\nGeoff Perna was cruising at breakneck speed through a powdery tree line, snow sticking to his unkempt beard. He was having the time of his lif… [+8715 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Alexander Cox", "title": "Prime Day final hours: Celestron AstroMaster 130EQ still 31% off - Space.com", "description": "It's your last chance to grab a Prime Day telescope deal and the Celestron AstroMaster 130EQ is still 31% off, ideal for beginners.", "url": "https://www.space.com/celestron-astromaster-130-eq-prime-day-save-31-percent-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dZep9QSEM949gHWr6utrj7-1200-80.jpg", "publishedAt": "2024-10-09T16:10:46Z", "content": "As Prime Day in October enters its final hours, it's not too late to grab a telescope deal and The Celestron AstroMaster 130EQ is still 31% off. If you're looking to see night sky targets clearly and… [+3855 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Black Hole Destroys Star, Goes After Another, NASA Missions Find - NASA", "description": "NASA’s Chandra X-ray Observatory and other telescopes have identified a supermassive black hole that has torn apart one star and is now using that stellar", "url": "https://www.nasa.gov/image-article/black-hole-destroys-star-goes-after-another-nasa-missions-find/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/tde-crunched.jpg", "publishedAt": "2024-10-09T15:07:17Z", "content": "NASAs Chandra X-ray Observatory and other telescopes have identified a supermassive black hole that has torn apart one star and is now using that stellar wreckage to pummel another star or smaller bl… [+5452 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Flashback! Space shuttle snags a spinning satellite with Canadarm - VideoFromSpace", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/", "urlToImage": "https://www.youtube.com/img/desktop/yt_1200.png", "publishedAt": "2024-10-09T15:00:53Z", "content": null}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": "Robert Z. Pearlman", "title": "Gateway gift: Northrop Grumman delivers lunar-orbit hab for Space Center Houston display - Space.com", "description": "'It is a great way to tell the story of the Gateway to the public.'", "url": "http://www.collectspace.com/news/news-100824a-artemis-gateway-halo-mockup-northrop-grumman-space-center-houston.html", "urlToImage": "https://cdn.mos.cms.futurecdn.net/K7vXvMfmVEKmLvFt4rnj49-1200-80.jpg", "publishedAt": "2024-10-09T15:00:47Z", "content": "An early, full-scale mockup of the astronaut accommodations developed for a small space station orbiting the moon has arrived at Space Center Houston to go on public display.\r\nDelivered by flatbed tr… [+5415 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Aaron Gregg, Christian Davenport", "title": "As International Space Station ages, air leaks from Russian section - The Washington Post", "description": "In late September, the inspector general identified 588 replacement parts that were operating beyond their planned operational lifetimes.", "url": "https://www.washingtonpost.com/business/2024/10/09/international-space-station-nasa/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R3JIA3CEOMVXPOTYQP3XLKKKVQ.jpg&w=1440", "publishedAt": "2024-10-09T14:37:02Z", "content": "Russias space agency has identified four cracks and about 50 other areas of concern in a Russian section of the International Space Station, leading NASA to classify the problem at its highest level … [+5320 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The ‘Beautiful Confusion’ of the First Billion Years Comes Into View - Quanta Magazine", "description": "Astronomers are reveling in the James Webb Space Telescope’s discoveries about the formative epoch of cosmic history.", "url": "https://www.quantamagazine.org/the-beautiful-confusion-of-the-first-billion-years-comes-into-view-20241009/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2024/10/FirstBillionYears-crKristinaArmitage-Social.webp", "publishedAt": "2024-10-09T14:36:29Z", "content": "Susan Kassin, an astronomer at the Space Telescope Science Institute, showed images from previous observatories compared to JWSTs. It was like having the optometrist flip a lens so that the last line… [+8341 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jim Clash", "title": "Jared Isaacman, Commercial Spaceflight Pioneer, On His Recent Mission - Forbes", "description": "“We achieved all of our objectives: high apogee, EVA, Starlink communication and some 40 science and research experiments where we at least gathered a single data point.”", "url": "https://www.forbes.com/sites/jimclash/2024/10/09/jared-isaacman-commercial-spaceflight-pioneer-on-his-recent-mission/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67068c89d7dce45e604749a5/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-09T14:30:01Z", "content": "Inspiration4 mission commander Jared Isaacman, founder and chief executive officer of Shift4 Payments, in front of the recovered first stage of a Falcon 9 rocket at Space Exploration Technologies Cor… [+8195 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "ESA Tests Advanced Lunar Camera for Future Artemis Missions - The Daily Galaxy --Great Discoveries Channel", "description": "ESA has tested a cutting-edge lunar camera designed for NASA’s upcoming Artemis missions during the PANGAEA geology training in Lanzarote. The Handheld Universal Lunar Camera (HULC), equipped to withstand the Moon’s extreme conditions, aims to capture high-de…", "url": "https://dailygalaxy.com/2024/10/esa-tests-lunar-camera-artemis-missions/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/ESA-Tests-Advanced-Lunar-Camera-for-Future-Artemis-Missions.jpg", "publishedAt": "2024-10-09T14:24:43Z", "content": "As preparations for NASA's ambitious Artemis lunar missions move forward, the European Space Agency (ESA) has taken an important step by testing the Handheld Universal Lunar Camera (HULC) during thei… [+7640 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Maria Mocerino", "title": "Black widow spider venom decoded at ‘near-atomic resolution’ by scientists - Interesting Engineering", "description": "The black widow spider has developed a truly impressive defense mechanism that enables it to bring down giants comparatively.", "url": "https://interestingengineering.com/science/black-widow-spider-neurotoxin-a-latrotoxin-deadly-poison", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/Untitled-1_ab9713.jpg", "publishedAt": "2024-10-09T14:14:00Z", "content": "In a recent study, not only did University of Münster scientists discover that the deadly neurotoxin behaves differently than all previously known toxins, but understanding how it works will lead to … [+809 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Lagrange Points And Why You Want To Get Stuck At Them - Hackaday", "description": "Orbital mechanics is a fun subject, as it involves a lot of seemingly empty space that’s nevertheless full of very real forces, all of which must be taken into account lest one’s spacec…", "url": "https://hackaday.com/2024/10/09/lagrange-points-and-why-you-want-to-get-stuck-at-them/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/09/Larange.jpg", "publishedAt": "2024-10-09T14:00:00Z", "content": "Visualization of the Sun-Earth Lagrange points.\r\nOrbital mechanics is a fun subject, as it involves a lot of seemingly empty space that’s nevertheless full of very real forces, all of which must be t… [+8672 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "A Massive Space Junk Disaster in Orbit Is Inevitable Now, Scientists Warn - Futurism", "description": "Some of the world's leading space experts are warning that the current space junk crisis surrounding our planet is soon to reach a head.", "url": "https://futurism.com/the-byte/space-junk-disaster-inevitable", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/space-junk-disaster-inevitable.jpg", "publishedAt": "2024-10-09T13:41:56Z", "content": "\"Collisions are not a question of if but when.\"\r\nLow-Earth Warning\r\nResearchers from the orbital mapping firm LeoLabs are raising alarm bells about the dangerous amount of space junk littering our pl… [+2340 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lisa Marshall", "title": "You get your energy from your mom. A new study explains why - Phys.org", "description": "It's one of the basic tenets of biology: We get our DNA from our mom and our dad. But one notable exception has perplexed scientists for decades: Most animals, including humans, inherit the DNA inside their mitochondria—the cell's energy centers—from their mo…", "url": "https://phys.org/news/2024-10-energy-mom.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/you-get-your-energy-fr-1.jpg", "publishedAt": "2024-10-09T13:36:55Z", "content": "It's one of the basic tenets of biology: We get our DNA from our mom and our dad. But one notable exception has perplexed scientists for decades: Most animals, including humans, inherit the DNA insid… [+4730 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Max Planck Society", "title": "Quantum register reaches 1,200 neutral atoms in continuous operation - Phys.org", "description": "A team of physicists led by Johannes Zeiher, research group leader in Immanuel Bloch's Quantum Many-Body Systems department and co-founder of the MPQ spin-off planqc, has achieved significant progress in scaling up quantum computing platforms with neutral ato…", "url": "https://phys.org/news/2024-10-quantum-register-neutral-atoms.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/quantum-register-reach.jpg", "publishedAt": "2024-10-09T13:24:04Z", "content": "A team of physicists led by Johannes Zeiher, research group leader in Immanuel Bloch's Quantum Many-Body Systems department and co-founder of the MPQ spin-off planqc, has achieved significant progres… [+5640 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA's Next Big Leap: New Space Probes to Unveil the Secrets of Black Holes and the Birth of Planets - The Daily Galaxy --Great Discoveries Channel", "description": "NASA is on the verge of a new era in space exploration with the launch of its Probe Explorers program. Two groundbreaking missions—an Advanced X-ray Imaging Satellite and a Far-Infrared Observatory—are competing to explore some of the universe’s most profound…", "url": "https://dailygalaxy.com/2024/10/nasas-next-big-leap-new-space-probes-to-unveil-the-secrets-of-black-holes-and-the-birth-of-planets/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/NASAs-Next-Big-Leap-New-Space-Probes-to-Unveil-the-Secrets-of-Black-Holes-and-the-Birth-of-Planets.jpg", "publishedAt": "2024-10-09T13:15:06Z", "content": "NASA has unveiled a groundbreaking initiative under its storied Explorers Program, introducing a new category of missions known as Probe Explorers.\r\nThese missions aim to fill the gap between NASAs f… [+7933 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Scientists Unveil The Origin Of Giant Mineral Geodes - Forbes", "description": "Giant amethyst geodes formed within a steady groundwater flow and at unexpectedly low crystallization temperatures, new study finds.", "url": "https://www.forbes.com/sites/davidbressan/2024/10/09/scientists-unveil-the-origin-of-giant-mineral-geodes/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67017154f4296ce050049a94/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-09T11:47:31Z", "content": "People view the 12-foot tall amethyst geode from Uruguay hosted at the American Museum of Natural ... [+] History in New York.\r\nAP\r\nThanks to geological surveys and detailed chemical analysis, a team… [+4199 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Earth's continental crust in America and China is breaking apart, researchers warn - WION", "description": "Researchers, who have been studying the dramatic changes in the continental configurations of Earth over the past billions of years, have made a stunning observation: that the oldest continental crusts are disintegrating.\n\nAccording to experts, the Earth's cr…", "url": "https://www.wionews.com/science/earths-continental-crust-in-america-and-china-is-breaking-apart-researchers-warn-765988", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/03/29/421647-untitled-design-2024-03-29t144355980.png", "publishedAt": "2024-10-09T11:43:57Z", "content": "Researchers, who have been studying the dramatic changes in the continental configurations of Earth over the past billions of years, have made a stunning observation: that the oldest continental crus… [+2361 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Team discovers three new magnetic and helium-enriched hot subdwarf stars - Phys.org", "description": "An international team of astronomers reports the discovery of three new helium-enriched hot subdwarf stars with strong magnetic fields. The finding, made with the Southern African Large Telescope (SALT), is detailed in a research paper published Oct. 3 on the…", "url": "https://phys.org/news/2024-10-team-magnetic-helium-enriched-hot.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/team-discovers-three-n.jpg", "publishedAt": "2024-10-09T11:40:02Z", "content": "An international team of astronomers reports the discovery of three new helium-enriched hot subdwarf stars with strong magnetic fields. The finding, made with the Southern African Large Telescope (SA… [+3191 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Hunter's Moon, biggest supermoon of 2024, is coming in October. Details inside - WION", "description": "The year's biggest supermoon, the Hunter's Moon, will rise in the sky next week. Astronomers have been thrilled to see three back-to-back supermoons this year, but October's supermoon is going to be extra special.\n\nIt will be the only moon to come this close …", "url": "https://www.wionews.com/science/hunters-moon-biggest-supermoon-of-2024-is-coming-in-october-details-inside-765953", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/10/09/459251-untitled-design-72.png", "publishedAt": "2024-10-09T10:50:11Z", "content": "The year's biggest supermoon, the Hunter's Moon, will rise in the sky next week. Astronomers have been thrilled to see three back-to-back supermoons this year, but October's supermoon is going to be … [+1960 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Noah Haggerty", "title": "Scientists long urged NASA to search for signs of life near Jupiter. Now it's happening - Yahoo! Voices", "description": "NASA JPL's Europa Clipper spacecraft, the largest planetary probe ever built, will launch as early as Friday to explore Jupiter's icy ocean moon.", "url": "https://www.yahoo.com/news/scientists-long-urged-nasa-search-100033338.html", "urlToImage": "https://media.zenfs.com/en/la_times_articles_853/5a75aaddc718a7e1b685fc590ea26ddc", "publishedAt": "2024-10-09T10:00:33Z", "content": "In 2015, Bill Nye was on Marine One with President Obama.\r\nThe television personality and science advocate was officially there for an Earth Day event, but he took the opportunity to talk to the pres… [+9196 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Ashley C. Ford", "title": "Help! I Went on a Great Date. Then I Learned What He Did to a Woman at His Last Job. - Slate", "description": "I was not expecting that.", "url": "https://slate.com/advice/2024/10/dating-professional-workplace-romance-dear-prudence-advice.html", "urlToImage": "https://compote.slate.com/images/d7548031-92f4-4250-9129-842aaa8d7625.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2024-10-09T10:00:00Z", "content": "Every week, Dear Prudence answers additional questions from readers, just for Slate Plus members. Ashley C. Ford is filling in as Prudie for Jenée Desmond-Harris while shes on parental leave. Submit … [+2258 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "New light-driven toroidal microrobot navigates viscous fluids easily - Interesting Engineering", "description": "The newly developed tiny robot is powered by a special synthetic material called liquid crystalline elastomer.", "url": "https://interestingengineering.com/innovation/light-powered-microrobot-swims-through-mucus", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/soft-robot.jpg", "publishedAt": "2024-10-09T09:16:00Z", "content": "“Our innovation enables three-dimensional free swimming in the Stokes regime and opens up new possibilities for exploring confined spaces, such as microfluidic environments. In addition, these toroid… [+951 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Cryptic Mars, a land shaped by ice - European Space Agency", "description": "ESA’s Mars Express has captured an astonishing array of landforms emerging from a thick winter blanket of frost as spring arrives in the south polar region of Mars.&nbsp;Some of these features are surprisingly dark compared with their icy surroundings, earnin…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Mars_Express/Cryptic_Mars_a_land_shaped_by_ice", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/10/cryptic_terrain_in_australe_scopuli_on_mars/26345724-1-eng-GB/Cryptic_terrain_in_Australe_Scopuli_on_Mars_pillars.jpg", "publishedAt": "2024-10-09T09:06:35Z", "content": "Science &amp; Exploration09/10/20241061 views33 likes\r\nESAs Mars Express has captured an astonishing array of landforms emerging from a thick winter blanket of frost as spring arrives in the south po… [+5457 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of East Anglia", "title": "Researchers discover how plants produce a novel anti-stress molecule - Phys.org", "description": "New research identifies for the first time the genes that help plants grow under stressful conditions—with implications for producing more sustainable food crops in the face of global climate change.", "url": "https://phys.org/news/2024-10-anti-stress-molecule.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/researchers-discover-h-14.jpg", "publishedAt": "2024-10-09T09:00:01Z", "content": "New research identifies for the first time the genes that help plants grow under stressful conditionswith implications for producing more sustainable food crops in the face of global climate change.\r… [+3291 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Another world with six-storey buildings beneath the Arctic? Here's what scientists found on its seafloor - WION", "description": "In an unbelievable discovery, scientists have found multiple mysterious underwater structures on the seafloor of the remote area of the Arctic.\n\nThe international team of researchers discovered a vast range of formations that were larger than football fields.…", "url": "https://www.wionews.com/science/another-world-with-six-storey-buildings-beneath-the-arctic-heres-what-scientists-found-on-its-seafloor-765875", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/10/09/459208-arctic-mysterious-structures.png", "publishedAt": "2024-10-09T07:20:19Z", "content": "In an unbelievable discovery, scientists have found multiple mysterious underwater structures on the seafloor of the remote area of the Arctic.\r\nThe international team of researchers discovered a vas… [+2290 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "The threat of solar storms explained - BBC.com", "description": "What damage could ferocious solar explosions wreak on our vulnerable planet?", "url": "https://www.bbc.com/reel/video/p0jd9cnj/the-threat-of-solar-storms-explained", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024xn/p0jwgt75.jpg", "publishedAt": "2024-10-09T00:04:39Z", "content": null}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "NASA awards Rocket Lab study contract for Mars Sample Return - SpaceNews", "description": "NASA has awarded a contract to Rocket Lab to study alternative concepts for Mars Sample Return (MSR), joining several other efforts to improve the cost and schedule of the program.", "url": "https://spacenews.com/nasa-awards-rocket-lab-study-contract-for-mars-sample-return/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/53194639182_f787a64a4e_o.jpg?resize=1200%2C901&ssl=1", "publishedAt": "2024-10-08T22:54:22Z", "content": "WASHINGTON NASA has awarded a contract to Rocket Lab to study alternative concepts for Mars Sample Return (MSR), joining several other efforts to improve the cost and schedule of the program.\r\nRocket… [+5498 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Record-breaking ancient spinning galaxy challenges cosmic evolution theories - Space.com", "description": "'Seeing a galaxy with such similarities to our own Milky Way, that is strongly rotation-dominated, challenges our understanding of how quickly galaxies in the early universe evolve into the orderly galaxies of today's cosmos.'", "url": "https://www.space.com/the-universe/record-breaking-ancient-galaxy-challenges-cosmic-evolution-theories", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QYfzrpcQoXWyw74zWnbHr9-1200-80.png", "publishedAt": "2024-10-08T22:00:05Z", "content": "The most distant and thus earliest rotating disk galaxy ever spotted has surprised astronomers and could challenge our theories of galactic evolution. Not only does it seemingly exist too early in th… [+5037 chars]"}, {"source": {"id": null, "name": "Miami Herald"}, "author": "Aspen Pflughoeft", "title": "Soil-dwelling fish dug up in rainforest of Costa Rica. It’s an ‘unusual’ new species - Miami Herald", "description": "Scientists found “worm-like” fish with small eyes in muddy swampy rainforest and discovered new species: Berlin’s bloodworm eel, study said.", "url": "https://www.miamiherald.com/news/nation-world/world/article293666159.html", "urlToImage": "https://www.miamiherald.com/news/nation-world/world/2ru62p/picture293669984/alternates/LANDSCAPE_1140/MixCollage-08-Oct-2024-02-16-PM-97.jpg", "publishedAt": "2024-10-08T19:30:04Z", "content": "World\r\nIn the rainforest of Costa Rica, a soil-dwelling fish with skin-covered eyes maneuvered through the mud. Its small size and underground lifestyle likely helped it go unnoticed until now.\r\nWhen… [+2370 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Nasa astronaut captures timelapse of auroras from space - BBC.com", "description": "Astronaut Matthew Dominick filmed the phenomenon from the Dragon Endeavour spacecraft.", "url": "https://www.bbc.com/news/videos/ckg01913nxqo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/b21a/live/3a7b6620-859d-11ef-83dd-fbf1b9732cf0.jpg", "publishedAt": "2024-10-08T18:11:46Z", "content": "Astronaut Matthew Dominick filmed the phenomenon from the Dragon Endeavour spacecraft, while a Chicago photographer captured the lights dancing over the city.\r\nThe spectacle is rarely visible from po… [+495 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Every Year We Pass Through The \"Taurid Swarm\". Could It Contain An Object That Threatens Life On Earth? - IFLScience", "description": "Given what happened to the dinosaurs, it's always better to check.", "url": "https://www.iflscience.com/every-year-we-pass-through-the-taurid-swarm-could-it-contain-an-object-that-threatens-life-on-earth-76278", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76278/aImg/79376/comet-encke-meta.png", "publishedAt": "2024-10-08T17:23:32Z", "content": "A team of astronomers have taken a close look at the \"Taurid swarm\" or \"Halloween Fireballs\" in order to determine whether they pose any threat to Earth.\r\nEvery year, the Earth is treated to several … [+2950 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Meet The Eclipse Chasers On The World’s Most Remote Island - Forbes", "description": "Hear from the eclipse chasers who travel anywhere to witness unique solar events, forming a global community. Last week it was Easter Island in the Pacific Ocean.", "url": "https://www.forbes.com/sites/jamiecartereurope/2024/10/08/meet-the-eclipse-chasers-on-the-worlds-most-remote-island/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6705171a11971174fd6c9d3e/0x0.jpg?format=jpg&crop=1787,1006,x13,y415,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-08T16:59:07Z", "content": "Eclipse-chaser Mandie Adams with Dinky Doo at Ahu Tahai, Easter Island, where she observed the ... [+] annular solar eclipse on Oct. 2, 2024.\r\nScott Spaulding\r\nLast Wednesdays ring of fire was visibl… [+7426 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jacek Krywko", "title": "Comb jellies can fuse to heal injuries - Ars Technica", "description": "Ctenophores merge with neighbors at wound sites, making animals with duplicate parts.", "url": "https://arstechnica.com/science/2024/10/injured-comb-jellies-can-fuse-into-a-single-organism/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/GettyImages-1471271102.jpg", "publishedAt": "2024-10-08T16:38:09Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Richard Pallardy", "title": "Ancient piece of driftwood hidden for thousands of years could hold secrets for combating climate change - Livescience.com", "description": "A 3,775-year-old log found in Canada had barely lost any of its carbon content since being buried, indicating \"wood vaulting\" is a viable means of carbon storage.", "url": "https://www.livescience.com/planet-earth/climate-change/ancient-piece-of-driftwood-hidden-for-thousands-of-years-could-hold-secrets-for-combating-climate-change", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vGS3eRiYiBKMPFu8P7ACoP-1200-80.jpg", "publishedAt": "2024-10-08T16:27:29Z", "content": "A really old and remarkably well-preserved log buried almost 4,000 years ago provides key evidence to support a simple and effective way of locking away carbon to reduce greenhouse gas emissions — bu… [+3975 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Danny Baird", "title": "NASA Seeks Innovative Artemis Lunar Logistics, Mobility Solutions - NASA", "description": "NASA is asking U.S. industry to submit innovative architecture solutions that could help the agency land and move cargo on the lunar surface during future", "url": "https://www.nasa.gov/general/nasa-seeks-innovative-artemis-lunar-logistics-mobility-solutions/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/09/architecture-illustration-logistics.png", "publishedAt": "2024-10-08T16:15:17Z", "content": "NASA is asking U.S. industry to submit innovative architecture solutions that could help the agency land and move cargo on the lunar surface during future Artemis missions. Released in September, the… [+4116 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Abbey A. Donaldson", "title": "Journey Through Stars with NASA in New Minecraft Game - NASA", "description": "NASA invites gamers, educators, and students to grab their pickaxe and check out its latest collaboration with Minecraft exploring a new world inspired by the", "url": "https://www.nasa.gov/learning-resources/hubble-new-minecraft-game/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/nasa-jw-still01-1920x1080-1.png", "publishedAt": "2024-10-08T16:00:16Z", "content": "NASA invites gamers, educators, and students to grab their pickaxe and check out its latest collaboration with Minecraft exploring a new world inspired by the agencys James Webb Space Telescope. The … [+2767 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Amanda Kooser", "title": "NASA Spacecraft Captures Dramatic ‘Zen Gardens’ On Mars - Forbes", "description": "NASA’s Mars Reconnaissance Orbiter caught sight of an unusual boulder-strewn landscape with strange patterns not seen elsewhere on the red planet.", "url": "https://www.forbes.com/sites/amandakooser/2024/10/08/nasa-spacecraft-captures-dramatic-zen-gardens-on-mars/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/670554a566b6811084dee13f/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-10-08T15:59:08Z", "content": "NASA's Mars Reconnaissance Orbiter captured this view of Daedalia Planum in August 2024.\r\nNASA/JPL-Caltech/University of Arizona\r\nWhen it comes to Mars, theres room to appreciate both the science and… [+3077 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cranfield University", "title": "With advanced scanning technique, confiscated Iron Age Iranian swords proven to be pastiches - Phys.org", "description": "For the first time, an imaging method has been used to investigate Iron Age bronze Iranian swords, revealing significant modern modifications that prove the weapons have been altered to increase their commercial value in the illicit antiquities market.", "url": "https://phys.org/news/2024-10-advanced-scanning-technique-confiscated-iron.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/confiscated-iron-age-i.jpg", "publishedAt": "2024-10-08T15:11:03Z", "content": "For the first time, an imaging method has been used to investigate Iron Age bronze Iranian swords, revealing significant modern modifications that prove the weapons have been altered to increase thei… [+4818 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Ashley Balzer", "title": "NASA’s Roman Space Telescope’s ‘Exoskeleton’ Whirls Through Major Test - NASA", "description": "A major component of NASA’s Nancy Grace Roman Space Telescope just took a spin on the centrifuge at NASA’s Goddard Space Flight Center in Greenbelt, Maryland.", "url": "https://www.nasa.gov/missions/roman-space-telescope/nasas-roman-space-telescopes-exoskeleton-whirls-through-major-test/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/oba-copy-1.jpg", "publishedAt": "2024-10-08T14:21:51Z", "content": "A major component of NASAs Nancy Grace Roman Space Telescope just took a spin on the centrifuge at NASAs Goddard Space Flight Center in Greenbelt, Maryland. Called the Outer Barrel Assembly, this pie… [+4044 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX rocket snaps amazing views of Earth during Hera asteroid probe launch (photos) - Yahoo! Voices", "description": "The upper stage of a SpaceX Falcon 9 rocket captured amazing images of Earth Monday (Oct. 7) during the launch of Europa's Hera asteroid probe.", "url": "https://www.space.com/spacex-falcon-9-hera-launch-earth-photos", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/sJxHx1RAq3y.XIyFvZ4KBg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/6ca56ccfa5a4233c63ab59d2842aeb64", "publishedAt": "2024-10-08T14:00:33Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nEarth as seen from the upper stage of a SpaceX Falcon 9 rocket during the launch of Europe's He… [+2260 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "Recycling Tough Plastics Into Precursors With Some Smart Catalyst Chemistry - Hackaday", "description": "Plastics are unfortunately so cheap useful that they’ve ended up everywhere. They’re filling our landfills, polluting our rivers, and even infiltrating our food chain as microplastics. …", "url": "https://hackaday.com/2024/10/08/recycling-tough-plastics-into-precursors-with-some-smart-catalyst-chemistry/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/09/Recycle.jpg", "publishedAt": "2024-10-08T14:00:00Z", "content": "Plastics are unfortunately so cheap useful that they’ve ended up everywhere. They’re filling our landfills, polluting our rivers, and even infiltrating our food chain as microplastics. As much as we … [+5888 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "NASA shuts Voyager 2 plasma instrument from 12 billion miles away - Interesting Engineering", "description": "The Plasma Spectrometer (PLS) has been the eyes and ears of Voyager 2, measuring the charged particles that shape our solar system and beyond.", "url": "https://interestingengineering.com/space/nasa-shuts-down-voyager-2-plasma-instrument", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/MIT_Voyager-PLS-Signoff-02-PRESS_627039.jpg", "publishedAt": "2024-10-07T13:35:00Z", "content": "When Voyager 2 left the heliosphere, the solar wind flow to the three cups facing the Sun decreased a lot. The fourth cup’s (used to study planetary magnetospheres) best data is only collected every … [+851 chars]"}]}