{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Live Science"}, "author": "Pandora Dewan", "title": "Science news this week: A 'skull' on Mars and the discovery of a brand-new color - Live Science", "description": "April 25, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/animals/science-news-this-week-a-skull-on-mars-and-the-discovery-of-a-brand-new-color", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GrHcoXgkDT7rcmJMXCzNzM.png", "publishedAt": "2025-04-26T04:01:11Z", "content": "NASA scientists have discovered a mysterious structure on Mars\r\n that may offer new insights into the Red Planet's watery past.\r\nThe dark, pitted rock, nicknamed 'Skull Hill', was discovered by NASA'… [+6204 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Icelandic Volcano Sends Toxic Shockwave 1,250 Miles to Arctic - SciTechDaily", "description": "Chinese researchers traced 2023 Icelandic volcanic emissions to Arctic smog, showing 80% of Ny-Ålesund’s sulfur dioxide came from the eruption. A research team led by Professors Si Fuqi and Yuhan Luo at the Hefei Institutes of Physical Science, part of the Ch…", "url": "https://scitechdaily.com/?p=472273", "urlToImage": "https://scitechdaily.com/images/Arctic-Volcano-Ice.jpg", "publishedAt": "2025-04-26T00:31:52Z", "content": "A Chinese research team used satellite and ground-based tools to track sulfur dioxide from Iceland’s 2023 Sundhnukagigar volcanic eruption as it traveled over 2,000 kilometers to the Arctic, causing … [+3169 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Steve Fink", "title": "First Image From Upgraded Solar Telescope Shows Sun Like Never Before - Study Finds", "description": "After years of development, researchers at the Daniel K. Inouye Solar Telescope in Hawaii have fired up their newest tool, the Visible Tunable Filter (VTF), and captured its first images of our sun.", "url": "https://studyfinds.org/first-image-from-upgraded-solar-telescope-shows-sun-like-never-before/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2025/04/Sunspot-image-scaled.png", "publishedAt": "2025-04-25T21:41:21Z", "content": "A narrow-band image of the Sun at a wavelength of =588.9nm, that of a well known solar sodium line also known as the NaD line. The image was acquired during recent first light efforts with the VTF at… [+5419 chars]"}, {"source": {"id": null, "name": "Scientific American"}, "author": "Jack Murtagh", "title": "Mathematicians just solved a 125-year-old problem, uniting 3 theories in physics - Live Science", "description": "A breakthrough in Hilbert's sixth problem is a major step in grounding physics in math", "url": "https://www.scientificamerican.com/article/lofty-math-problem-called-hilberts-sixth-closer-to-being-solved/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ERNsFE9UHeeDBprQ43gUvE.jpg", "publishedAt": "2025-04-25T21:12:00Z", "content": "When the greatest mathematician alive unveils a vision for the next century of research, the math\r\n world takes note. That's exactly what happened in 1900 at the International Congress of Mathematici… [+7079 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "New study: There are lots of icy super-Earths - Ars Technica", "description": "“Microlensing” lets us find planets at much greater distances from their star.", "url": "https://arstechnica.com/science/2025/04/new-study-there-are-lots-of-icy-super-earths/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/image-4-1041x648.jpeg", "publishedAt": "2025-04-25T21:06:25Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Flexibility Beats Instinct: How Adaptable Learning Drives Success - Neuroscience News", "description": "Humans have an exceptional ability to learn socially, but most studies have focused on overly simplified tasks.", "url": "https://neurosciencenews.com/flexibility-adaptive-learning-28736/", "urlToImage": "https://neurosciencenews.com/files/2025/04/cognitive-flexibility-adaptive-learning-neuroscience.jpg", "publishedAt": "2025-04-25T21:02:09Z", "content": "Summary: Humans have an exceptional ability to learn socially, but most studies have focused on overly simplified tasks. In a new study using Minecraft, researchers found that the most successful par… [+8173 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Hubble helps explore the wreckage of a supernova star explosion in a satellite galaxy of the Milky Way (image) - Space", "description": "\"Thanks to the high resolution of our new images, we detected a faint structure on the northeast side of this supernova remnant that had not been observed before.\"", "url": "https://www.space.com/the-universe/hubble-helps-explore-the-wreckage-of-a-supernova-star-explosion-in-a-satellite-galaxy-of-the-milky-way-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XGbxB8wLXGJusC3GjRvX3g.png", "publishedAt": "2025-04-25T20:00:00Z", "content": "The Hubble Space Telescope may have just celebrated its 35th birthday on April 24, but it's still providing groundbreaking astronomy. \r\nCase in point: Astronomers have used Hubble along with an array… [+5630 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "How the Hubble Telescope became the 'Energizer bunny of spacecraft,' according to one of its astronaut visitors - Space", "description": "\"Knock on wood, it can go another 10 years,\" former astronaut John Grunsfeld says.", "url": "https://www.space.com/space-exploration/hubble-space-telescope/how-the-hubble-telescope-became-the-energizer-bunny-of-spacecraft-best-nasa-ambassador-according-to-hubble-hugging-astronaut", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gR3uqZ8LFW9WQKgXFqCZJD.jpg", "publishedAt": "2025-04-25T19:00:00Z", "content": "John Grunsfeld has a model of the Hubble Space Telescope on his bookshelf. It's right next to a model of a NASA space shuttle, which delivered Hubble to space 35 years ago, and it's no secret why bot… [+8610 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astrophotographer Spends 80 Hours to Capture What NASA Hasn’t Shown You About Andromeda - The Daily Galaxy", "description": "A mesmerizing new image of the Andromeda Galaxy reveals it cloaked in glowing gas and surrounded by stars like never before.", "url": "https://dailygalaxy.com/2025/04/astrophotographer-spends-80-hours-capture-andromeda/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Astrophotographer-Spends-80-Hours-to-Capture-What-NASA-Hasnt-Shown-You-About-Andromeda.jpg", "publishedAt": "2025-04-25T18:30:00Z", "content": "A stunning new photograph of the Andromeda Galaxy has unveiled the vast, glowing gases that surround this majestic spiral system. Captured by Miguel Claro, a professional astrophotographer and scienc… [+3006 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "A 113-Million-Year-Old 'Hell Ant' Fossil Was Just Discovered – Here’s What It Tells Us About Ancient Predators! - Indian Defence Review", "description": "A newly discovered 113-million-year-old fossil of Vulcanidris cratensis, a hell ant species from the Cretaceous, reveals complex predatory behaviors and challenges our understanding of early insect evolution.", "url": "https://indiandefencereview.com/113-million-year-old-hell-ant-fossil/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/04/a-113-million-year-old-hell-ant-fossil-was-just-discovered-heres-what-it-tells-us-about-ancient-predators.jpg", "publishedAt": "2025-04-25T18:20:00Z", "content": "A remarkable new fossil discovery in Brazil has shed light on the evolution of ants during the Cretaceous period. Vulcanidris cratensis, a new species of “hell ant”, has been uncovered, offering unpr… [+3485 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Needs to Build Gloves and Boots That Can Withstand Frigid Moon Temperatures - Gizmodo", "description": "Spacesuit parts are being tested in a cryogenic ice chamber to see how well they would fare in the lunar south pole.", "url": "https://gizmodo.com/nasa-needs-to-build-gloves-and-boots-that-can-withstand-frigid-moon-temperatures-2000594350", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Glove-in-Load-Dock.jpg", "publishedAt": "2025-04-25T18:15:09Z", "content": "NASA’s upcoming missions to the Moon are set to be a lot more chilly than the Apollo program, and the agency is working to figure out how to keep its astronauts snug when visiting the permanently sha… [+5218 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "New theory challenges Big Bang, dark matter, and dark energy in the birth of the universe - The Brighter Side of News", "description": "A new theory says the universe expands in fast bursts, not one Big Bang—removing the need for dark matter and dark energy.", "url": "https://www.thebrighterside.news/post/new-theory-challenges-big-bang-dark-matter-and-dark-energy-in-the-birth-of-the-universe/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/04/Screenshot-2025-04-24-101501.png?auto=webp", "publishedAt": "2025-04-25T18:07:00Z", "content": "In the search to understand how the universe came to be, a new theory is rewriting the script. Instead of one massive, fiery birth like the Big Bang, this idea suggests the cosmos has been growing in… [+7774 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "The sun might be spitting out particles that create water on the moon - Space", "description": "\"With only lunar soil and a basic ingredient from the sun — which is always spitting out hydrogen — there's a possibility of creating water.\"", "url": "https://www.space.com/the-universe/sun/the-sun-might-be-spitting-out-particles-that-create-water-on-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vtiMUpve68SChhWey8GvhE.jpg", "publishedAt": "2025-04-25T18:03:08Z", "content": "Future moon astronauts may find water more accessible than previously thought, according to a new experiment that suggests the sun is replenishing the sought-after resource on the lunar surface.\r\nBec… [+4197 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Deep-sea Footage Captures Grotesque Parasites Latched Onto Rattail Fish - The Daily Galaxy", "description": "A deep-sea fish swimming near Antarctica has been caught on camera hosting two bizarre parasites with long, pig-tail-like egg sacs. What scientists discovered at nearly 1,600 feet below the surface is both unsettling and fascinating.", "url": "https://dailygalaxy.com/2025/04/deep-sea-footage-captures-grotesque-parasites/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Deep-sea-Footage-Captures-Grotesque-Parasites-Latched-Onto-Rattail-Fish.jpg", "publishedAt": "2025-04-25T18:00:00Z", "content": "Filmed by the Schmidt Ocean Institute, the video reveals a deep-sea rattail fish with two parasites clinging to either side of its head. The parasites are Lophoura szidati, a type of bloodsucking cop… [+2775 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Just Found a Dark Matter Bridge Connecting Two Colliding Galaxies! - The Daily Galaxy", "description": "Astronomers have uncovered a dark matter bridge connecting two galaxies in the Perseus cluster. This key discovery could be the answer to a cosmic mystery.", "url": "https://dailygalaxy.com/2025/04/astronomers-found-dark-matter-two-galaxies/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Astronomers-Just-Found-a-Dark-Matter-Bridge-Connecting-Two-Colliding-Galaxies.jpg", "publishedAt": "2025-04-25T17:00:00Z", "content": "Astronomers have made a groundbreaking discovery in the Perseus galaxy cluster, located 240 million light-years from Earth. For the first time, a dark matter bridge has been detected linking two gala… [+2853 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Releases Clearest Footage Of Mars 140 Million Miles Away - The Daily Galaxy", "description": "NASA's latest footage of Mars offers an astonishingly clear view of the planet’s dunes, sparking both awe and humor online.", "url": "https://dailygalaxy.com/2025/04/clearest-footage-mars-140-million-miles-away/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/NASA-Releases-Clearest-Footage-Of-Mars-140-Million-Miles-Away.jpg", "publishedAt": "2025-04-25T16:30:00Z", "content": "NASA has recently shared groundbreaking footage of Mars, offering the clearest images of the red planet ever captured by the Curiosity Rover. Shot from an astonishing distance of 140 million miles, t… [+2917 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "SpaceX Crew-11 astronauts put things into perspective | Space photo of the day for April 24, 2025 - Space", "description": "The next crew to launch to the International Space Station on a Dragon spacecraft pose inside SpaceX’s Hangar X at Kennedy Space Center.", "url": "https://www.space.com/space-exploration/international-space-station/spacex-crew-11-astronauts-put-things-into-perspective-space-photo-of-the-day-for-april-24-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3uibquaKRWQctR3GprejJ7.jpg", "publishedAt": "2025-04-25T15:31:16Z", "content": "From left to right, SpaceX Crew-11 members Oleg Platonov of Roscosmos, Mike Fincke and Zena Cardman of NASA and JAXA astronaut Kimiya Yui pose together in front of a Falcon 9 rocket inside SpaceX’s H… [+1613 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Hey, what are these curved green flashes above my polymer semiconductor? - Phys.org", "description": "In every scientific discovery in the movies, a scientist observes something unexpected, scratches the side of his or her forehead and says \"hmmmmm.\" In just such a moment in real life, scientists from Canada observed unexpected flashes of curved green light f…", "url": "https://phys.org/news/2025-04-hey-green-polymer-semiconductor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/hey-what-are-these-cur.jpg", "publishedAt": "2025-04-25T15:20:02Z", "content": "In every scientific discovery in the movies, a scientist observes something unexpected, scratches the side of his or her forehead and says \"hmmmmm.\" In just such a moment in real life, scientists fro… [+5957 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "The brightest star in the night sky shows off this spring: How to see a scintillating Sirius - Space", "description": "Some people probably believe that the twinkling effect is produced by the stars themselves, but that is not the case at all.", "url": "https://www.space.com/stargazing/the-brightest-star-in-the-night-sky-shows-off-this-spring-how-to-see-a-scintillating-sirius", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vFKyardHe57AtkTkzvZLgD.jpg", "publishedAt": "2025-04-25T15:00:00Z", "content": "Since 1986 I have had an affiliation with the Hayden Planetarium in New York. My \"official\" title there is \"Associate and Guest Lecturer.\"\r\n Indeed, through all of these years I given scores of prese… [+7887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Fossilized footprints reveal unprecedented insight into prehistoric animal behavior in Oregon - CNN", "description": "Researchers created 3D models of ancient tracks in Oregon’s John Day Fossil Beds National Monument. The study revealed a glimpse of animal life 50 million years ago.", "url": "https://www.cnn.com/2025/04/25/science/fossil-footprints-oregon-john-day-monument/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/cover-photo-7.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-25T14:18:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAbout 50 million years ago, a small bird waded along a… [+7209 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "What’s Going On Inside Io, Jupiter’s Volcanic Moon? - Quanta Magazine", "description": "Recent flybys of the fiery world refute a leading theory of its inner structure — and reveal how little is understood about geologically active moons.", "url": "https://www.quantamagazine.org/whats-going-on-inside-io-jupiters-volcanic-moon-20250425/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/04/IoVolcanism-cr.NASA-Social.jpg", "publishedAt": "2025-04-25T14:05:25Z", "content": "Crucially, unlike Ios odd magnetic field, which seemed to indicate that it concealed an oceans worth of fluid, Europas own Galileo-era magnetic signal remains robust. Its a pretty clean result at Eur… [+2794 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Rachel Nuwer", "title": "Dire wolves and woolly mammoths: Why scientists are worried about de-extinction - BBC", "description": "The creation of three \"dire wolf\" pups has raised hopes that it may be possible to resurrect extinct animals. But some scientists have grave concerns.", "url": "https://www.bbc.com/future/article/20250425-why-scientists-fear-attempts-to-resurrect-extinct-animals-may-backfire", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0l6gblq.jpg", "publishedAt": "2025-04-25T14:00:00Z", "content": "The creation of three \"dire wolf\" pups has raised hopes that it may be possible to resurrect extinct animals. But some scientists have grave concerns.\r\nWhen news broke that Colossal Biosciences, a Da… [+15092 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "12-Billion-Year-Old Milky Way Twin Shocks Astronomers - SciTechDaily", "description": "A surprisingly well-formed spiral galaxy has been spotted just a billion years after the Big Bang, challenging long-held beliefs about how quickly galaxies evolve. Named Zhúlóng, after a Chinese solar dragon, it looks remarkably like our Milky Way, with spira…", "url": "https://scitechdaily.com/12-billion-year-old-milky-way-twin-shocks-astronomers/", "urlToImage": "https://scitechdaily.com/images/Astronomy-Distant-Galaxy-Art-Concept.jpg", "publishedAt": "2025-04-25T13:36:34Z", "content": "Zhúlóng, a galaxy eerily similar to the Milky Way, has been discovered in the early universe, just 1 billion years post-Big Bang. Its mature structure defies standard galaxy formation theories. (Arti… [+5009 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Los Alamos National Laboratory", "title": "New framework suggests stars dissolve into neutrons to forge heavy elements - Phys.org", "description": "Understanding the origin of heavy elements on the periodic table is one of the most challenging open problems in all of physics. In the search for conditions suitable for these elements via \"nucleosynthesis,\" a Los Alamos National Laboratory-led team is going…", "url": "https://phys.org/news/2025-04-framework-stars-dissolve-neutrons-forge.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-theory-suggests-st.jpg", "publishedAt": "2025-04-25T13:17:04Z", "content": "Understanding the origin of heavy elements on the periodic table is one of the most challenging open problems in all of physics. In the search for conditions suitable for these elements via \"nucleosy… [+6092 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Discovered a Remarkable Lifeform That Conducts Electricity Like a Wire - Yahoo", "description": "Found in a mudflat off the coast of Oregon, this organism’s electricity-conducting abilities could make it ideal for bioelectric devices.", "url": "https://www.popularmechanics.com/science/animals/a64567364/conductive-organism-bioengineering/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/r3_yFOsmerGZtHQFqJmMCw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/cd9df8b952b450e2605f1d862067c68f", "publishedAt": "2025-04-25T13:00:00Z", "content": "<ul><li>Ca. Electrothrix yaqonensisa cable bacteria discovered along the coast of Oregonhas the remarkable ability to conduct electricity.\r\n</li><li>According to researchers, this bacteria stands out… [+3348 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "First Utterly Alone Black Hole Confirmed Roaming The Cosmos - ScienceAlert", "description": "A lonely black hole roaming the cosmos in solitude has been confirmed for the first time.", "url": "https://www.sciencealert.com/first-utterly-alone-black-hole-confirmed-roaming-the-cosmos", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/lone-black-hole_1024.jpg", "publishedAt": "2025-04-25T12:01:19Z", "content": "A lonely black hole roaming the cosmos in solitude has been confirmed for the first time. A closer look has revealed the dark object's identity, after much hubbub.\r\nThe new analysis shows that the bl… [+3542 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "James Webb Telescope Confirms a Troubling Anomaly: Something Is Seriously Wrong with Our Understanding of the Universe - The Daily Galaxy", "description": "The James Webb Space Telescope just confirmed a shocking revelation about the universe’s expansion rate. This discovery shakes the very foundations of modern cosmology. New data may force a major rethink of everything we thought we knew about the cosmos.", "url": "https://dailygalaxy.com/2025/04/james-webb-telescope-confirms-a-troubling-anomaly-something-is-seriously-wrong-with-our-understanding-of-the-universe/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/james-webb-telescope.jpg", "publishedAt": "2025-04-25T11:45:00Z", "content": "Recent observations by the James Webb Space Telescope (JWST) have added new weight to one of the most perplexing problems in cosmology: the Hubble Tension. This issue, which describes the discrepancy… [+4543 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Rocket Report: The pitfalls of rideshare; China launches next Tiangong crew - Ars Technica", "description": "This week, engineers ground-tested upgrades for Blue Origin’s New Glenn and Europe’s Ariane 6.", "url": "https://arstechnica.com/space/2025/04/rocket-report-the-pitfalls-of-rideshare-china-launches-next-tiangong-crew/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-2211081142-1152x648.jpg", "publishedAt": "2025-04-25T11:00:02Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Shreejaya Karantha", "title": "James Webb telescope solves 'impossible' black hole mystery from the ancient universe - Yahoo", "description": "Astronomers have used the James Webb Space Telescope (JWST) to revisit a misunderstood black hole thought to be gulping matter 40 times faster than the...", "url": "https://www.livescience.com/space/black-holes/james-webb-telescope-reveals-truth-about-impossible-black-hole-thought-to-be-feeding-at-40-times-the-theoretical-limit", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/r_NnJSUhvdCYttZF5s5Vbw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/49ecc4352bb01880264ddddad7d51d24", "publishedAt": "2025-04-25T11:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nAn illustration of a supermassive black hole surrounded by dust. | Credit: ESA\r\nA \"fast-feeding… [+4976 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "New quantum optics theory proposes that classical interference arises from bright and dark states of light - Phys.org", "description": "Classical physics theories suggest that when two or more electromagnetic waves interfere destructively (i.e., with their electric fields canceling each other out), they cannot interact with matter. In contrast, quantum mechanics theory suggests that light par…", "url": "https://phys.org/news/2025-04-quantum-optics-theory-classical-bright.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-quantum-optics-the.jpg", "publishedAt": "2025-04-25T10:30:01Z", "content": "Classical physics theories suggest that when two or more electromagnetic waves interfere destructively (i.e., with their electric fields canceling each other out), they cannot interact with matter. I… [+7756 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "New analysis casts doubt on 'biosignatures' found on planet K2-18b - NPR", "description": "Researchers using data from the James Webb Space Telescope recently announced they had detected biosignature gases on planet K2-18b. A new analysis of the same data casts doubt on the earlier findings", "url": "https://www.npr.org/2025/04/25/g-s1-62610/biosignatures-k2-18b-james-webb-exoplanet-doubt", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2048x1152+0+221/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff6%2Fee%2F28d22485411fadead7908f428d1e%2Fimage-8.jpg", "publishedAt": "2025-04-25T10:00:00Z", "content": "Astronomers have been poring over last week's claim\r\n of the detection of life-associated gases in the atmosphere of a distant planet named K2-18b \"the strongest evidence yet that life may exist on a… [+4396 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Ghostly galaxy without dark matter baffles astronomers - Live Science", "description": "Astronomers have stumbled upon yet another ghostly galaxy that appears to be devoid of dark matter, the elusive stuff that makes up most of the material universe.", "url": "https://www.space.com/the-universe/ghostly-galaxy-without-dark-matter-baffles-astronomers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iZgRvqNPWqjD8yRTgygC35.jpg", "publishedAt": "2025-04-25T10:00:00Z", "content": "Astronomers have stumbled upon yet another ghostly galaxy that appears to be devoid of dark matter.\r\nDark matter,\r\n the invisible substance astronomers believe dominates the universe, provides the gr… [+3801 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Portsmouth", "title": "Is our universe the ultimate computer? - Phys.org", "description": "Whether we are simply characters in an advanced virtual world is a much-debated theory, challenging previous thinking about the universe and our existence.", "url": "https://phys.org/news/2025-04-universe-ultimate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/is-our-universe-the-ul.jpg", "publishedAt": "2025-04-25T09:30:02Z", "content": "Whether we are simply characters in an advanced virtual world is a much-debated theory, challenging previous thinking about the universe and our existence.\r\nThe possibility that the entire universe i… [+4241 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "SpaceX Falcon 9 rocket launches 28 Starlink satellites, aces droneship booster landing (photos) - Space", "description": "It was SpaceX's 47th Falcon 9 mission of the year.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-6-74-b1069-ccsfs", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jaLpHd7LdGg4mFK3viBCdH.jpg", "publishedAt": "2025-04-25T05:05:57Z", "content": "SpaceX continues its steady pace of Starlink launches, ever growing the company's orbital internet constellation.\r\nA Falcon 9 rocket launched SpaceX's Starlink 6-74 mission Thursday night, April 24, … [+2218 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Shark Attacks on Humans Aren’t Always What They Seem, Scientists Say - Gizmodo", "description": "Sharks rarely bite humans in the first place. And in a new study Friday, researchers have found that some of these bites are wholly defensive.", "url": "https://gizmodo.com/shark-attacks-on-humans-arent-always-what-they-seem-scientists-say-2000594028", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Sharks.jpg", "publishedAt": "2025-04-25T04:02:06Z", "content": "Sharks might not be as responsible for rare human bites as we assumed. In a study released today, scientists argue that at least some shark bites should be considered a form of self-defense.\r\nMarine … [+4771 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Justine McDaniel", "title": "Scientists made ‘tiny earthquakes’ to find where Yellowstone’s magma begins - The Washington Post", "description": "For the first time, geoscientists detected the top of Yellowstone’s magma reservoir. It is active and dynamic, but not in danger of erupting, they found.", "url": "https://www.washingtonpost.com/nation/2025/04/24/yellowstone-magma-cap/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FGXKVZACEAI63C7LFNHEQGYVAA.jpg&w=1440", "publishedAt": "2025-04-25T03:45:40Z", "content": "Underneath Yellowstone National Park, magma bubbles and flows. But exactly how close it is to the surface has long been a mystery to scientists until now.\r\nFor the first time, researchers have detect… [+4470 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Navarre Bartz", "title": "LLMs Coming For A DNA Sequence Near You - Hackaday", "description": "While tools like CRISPR have blown the field of genome hacking wide open, being able to predict what will happen when you tinker with the code underlying the living things on our planet is still tr…", "url": "https://hackaday.com/2025/04/24/llms-coming-for-a-dna-sequence-near-you/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/04/wide-EVO2-final-with-text-300dpi-01.jpg", "publishedAt": "2025-04-25T02:00:00Z", "content": "While tools like CRISPR have blown the field of genome hacking wide open, being able to predict what will happen when you tinker with the code underlying the living things on our planet is still tric… [+1344 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "One Material, Four Behaviors: Superconductor, Metal, Semiconductor, and Insulator - SciTechDaily", "description": "RIKEN scientists have discovered how to manipulate molybdenum disulfide into acting as a superconductor, metal, semiconductor, or insulator using a specialized transistor technique. By inserting potassium ions and adjusting conditions, they could trigger dram…", "url": "https://scitechdaily.com/one-material-four-behaviors-superconductor-metal-semiconductor-and-insulator/", "urlToImage": "https://scitechdaily.com/images/Transister-Design-Art-Concept.jpg", "publishedAt": "2025-04-25T01:16:38Z", "content": "Scientists have developed a method to turn molybdenum disulfide into a range of electronic states, including a superconductor, just by adding potassium ions and tweaking temperature. Credit: SciTechD… [+4126 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "At the Magic Angle, a Mysterious Vibration Emerges – And It Might Explain Superconductivity - SciTechDaily", "description": "Scientists have unveiled a cutting-edge quantum microscope that allows them to observe how electrons interact with strange atomic vibrations in twisted graphene, including a newly revealed “phason.” This phenomenon could help explain mysterious behaviors like…", "url": "https://scitechdaily.com/at-the-magic-angle-a-mysterious-vibration-emerges-and-it-might-explain-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Graphene-Vibration-Art-Concept.jpg", "publishedAt": "2025-04-25T00:07:59Z", "content": "A revolutionary cryogenic microscope has revealed how electrons couple with atomic vibrations in graphene, offering new clues about the origin of superconductivity and strange metal behaviors. Credit… [+4900 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Mac Oliveau", "title": "Scientists discover elusive third type of quantum particle - The Brighter Side of News", "description": "Mathematical model hints at new quantum particles beyond fermions and bosons—paraparticles could reshape modern physics.", "url": "https://www.thebrighterside.news/post/scientists-discover-elusive-third-type-of-quantum-particle/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/04/para4.webp?auto=webp", "publishedAt": "2025-04-25T00:07:00Z", "content": "In the strange and fascinating world of quantum mechanics, particles have long been sorted into just two types: fermions and bosons. These labels help explain how matter forms and how forces work. Fe… [+6052 chars]"}, {"source": {"id": null, "name": "Outside"}, "author": "Alex Hutchinson", "title": "New Study: Lactic Acid Doesn’t Actually Cause That Burning Feeling. Here’s What Does. - Outside Magazine", "description": "Lactic acid has long been vilified, but new research shows that it doesn't impair muscle function. In fact, it might actually be good for you.", "url": "https://www.outsideonline.com/health/training-performance/lactic-acid-muscle-fatigue/", "urlToImage": "https://cdn.outsideonline.com/wp-content/uploads/2025/04/GettyImages-1256194593-1024x576.jpg?width=1200", "publishedAt": "2025-04-24T23:51:31Z", "content": "\"],\"filter\":{\"nextExceptions\":\"img, blockquote, div\",\"nextContainsExceptions\":\"img, blockquote, a.btn, a.o-button\"},\"renderIntial\":true,\"wordCount\":350}'&gt;\r\n Like all great villains, lactic acid ha… [+10216 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Reusable rockets are here, so why is NASA paying more to launch stuff to space? - Ars Technica", "description": "Something appears to be broken in how NASA procures launch services.", "url": "https://arstechnica.com/space/2025/04/reusable-rockets-are-here-so-why-is-nasa-paying-more-to-launch-stuff-to-space/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/52723746397_8777ce86ce_k-1152x648.jpg", "publishedAt": "2025-04-24T23:15:41Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Scientists Spotted Signs of a Hidden Structure Inside Earth's Core - ScienceAlert", "description": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history.", "url": "https://www.sciencealert.com/scientists-spotted-signs-of-a-hidden-structure-inside-earths-core", "urlToImage": "https://www.sciencealert.com/images/2023/02/EarthsInnermostInnerCore.jpg", "publishedAt": "2025-04-24T22:43:21Z", "content": "While most of us take the ground beneath our feet for granted, written within its complex layers, like the pages of a book, is Earth's history. Our history.\r\nResearch shows there are little-known cha… [+3389 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Curiosity discovers carbonate mineral, provides insight into disappearance of ancient atmosphere - NASASpaceFlight.com -", "description": "NASA’s Curiosity rover, which has been driving around the surface of Mars for over 12…", "url": "https://www.nasaspaceflight.com/2025/04/curiosity-carbonate-atmosphere/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/07/37899_curiosity-rover-selfie-Windjana-holes-PIA18390-464x350.jpg", "publishedAt": "2025-04-24T22:06:59Z", "content": "26NASA’s Curiosity rover, which has been driving around the surface of Mars for over 12 years, recently discovered a mineral called siderite on the slopes of Mount Sharp in Gale Crater. Interestingly… [+4973 chars]"}, {"source": {"id": null, "name": "Usgs.gov"}, "author": null, "title": "Volcano Watch — Tilt, Tremor, and Lava: Remembering Mauna Loa’s 2022 Eruption Onset - USGS (.gov)", "description": "As people from around the world are captivated by episodic lava fountaining during the ongoing Kīlauea eruption in Halemaʻumaʻu, let’s use the current pause and transition our attention back to the details of another recent eruption—Mauna Loa in 2022.", "url": "https://www.usgs.gov/observatories/hvo/news/volcano-watch-tilt-tremor-and-lava-remembering-mauna-loas-2022-eruption", "urlToImage": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/styles/teaser/public/media/images/11292022-SaddleRoad%20AM_0.jpg?itok=0vYeXjKU", "publishedAt": "2025-04-24T21:08:06Z", "content": "Volcano Watch is a weekly article and activity update written by U.S. Geological Survey Hawaiian Volcano Observatory scientists and affiliates.\r\nMany residents remember Mauna Loathe largest active vo… [+5808 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Mars orbiter snaps 1st image of Curiosity rover driving on the Red Planet (photo) - Space", "description": "\"Curiosity was captured in what is believed to be the first orbital image of the rover mid-drive across the Red Planet.\"", "url": "https://www.space.com/space-exploration/mars-rovers/mars-orbiter-snaps-1st-image-of-curiosity-rover-driving-on-the-red-planet-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mnbGe8igJidZx8YqHebTkP.jpg", "publishedAt": "2025-04-24T19:30:00Z", "content": "NASA's Mars Reconnaissance Orbiter (MRO) just snapped an off-Earth action shot the likes of which we've never seen before.\r\nOn Feb. 28, MRO's HiRISE (High-Resolution Imaging Science Experiment) camer… [+2139 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Widest high-resolution photo of the Sun ever captured - Earth.com", "description": "Solar Orbiter began routine science operations in 2021 and has since looped ever closer to the Sun, stealing bits of speed from Venus.", "url": "https://www.earth.com/news/widest-high-resolution-photo-of-the-sun-ever-captured-solar-orbiter/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/24130819/Sun_Solar-Orbiter_widest-view-yet_ESA_1.jpg", "publishedAt": "2025-04-24T19:23:07Z", "content": "The Suns newest portrait is not the fiery disc we remember from textbooks. Instead, it sprawls across a mosaic so detailed that you could stack a dozen Earths end to end inside a single pixel and sti… [+4355 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Massive Hole the Size of Switzerland Opens in Antarctica - The Daily Galaxy", "description": "A massive polynya the size of Switzerland has recently appeared in Antarctica, leaving scientists baffled. Uncover the surprising factors driving this phenomenon and what it means for the future of our planet's climate.", "url": "https://dailygalaxy.com/2025/04/massive-hole-size-switzerland-antarctica/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Massive-Hole-the-Size-of-Switzerland-Opens-in-Antarctica.jpg", "publishedAt": "2025-04-24T18:30:00Z", "content": "A surprising event that has caught the attention of scientists around the world. This large gap in the sea ice remained open for several weeks, raising questions about the underlying mechanisms drivi… [+3384 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "Massive Icebergs Once Floated Around the UK - Newser", "description": "Evidence could prove useful in understanding how ice sheets respond to climate change", "url": "https://www.newser.com/story/367656/britain-was-once-home-to-giant-icebergs.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1606593-12-20250424134702.jpeg", "publishedAt": "2025-04-24T18:17:00Z", "content": "Deep tracks in the floor of the North Sea are hugely exciting to scientists in the UK, who say the grooves not only confirm that an ice sheet once covered Britain and Ireland, but also that it calved… [+2046 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matthew Williams", "title": "A novel concept for a multiplanetary crewed mission to Mars and Ceres - Phys.org", "description": "For NASA, sending a crewed mission to Mars has been the long-term goal for over two decades. China has joined the club in recent years, with plans to send crewed missions to the red planet ahead of NASA. In both cases, the plans envision a stepping stone appr…", "url": "https://phys.org/news/2025-04-concept-multiplanetary-crewed-mission-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-novel-concept-for-a.jpg", "publishedAt": "2025-04-24T17:30:01Z", "content": "For NASA, sending a crewed mission to Mars has been the long-term goal for over two decades. China has joined the club in recent years, with plans to send crewed missions to the red planet ahead of N… [+8094 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Ancient Fossil Was Mistaken for a Fungus - The Daily Galaxy", "description": "A bizarre fossil has scientists rethinking everything they know about ancient life. Once thought to be a tree or fungus, new research reveals Prototaxites might be a whole new form of life entirely.", "url": "https://dailygalaxy.com/2025/04/this-ancient-fossil-was-mistaken-fungus/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/This-Ancient-Fossil-Was-Mistaken-for-a-Fungus.jpg", "publishedAt": "2025-04-24T17:30:00Z", "content": "A peculiar fossil discovery has raised eyebrows in the scientific community, prompting researchers to rethink the boundaries of life on Earth. This fossil, identified as Prototaxites, was once believ… [+3113 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "California Institute of Technology", "title": "Quantum sensors tested for next-generation particle physics experiments - Phys.org", "description": "To learn more about the nature of matter, energy, space, and time, physicists smash high-energy particles together in large accelerator machines, creating sprays of millions of particles per second of a variety of masses and speeds. The collisions may also pr…", "url": "https://phys.org/news/2025-04-quantum-sensors-generation-particle-physics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/quantum-sensors-tested.jpg", "publishedAt": "2025-04-24T17:09:25Z", "content": "To learn more about the nature of matter, energy, space, and time, physicists smash high-energy particles together in large accelerator machines, creating sprays of millions of particles per second o… [+6417 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Claire Loewen", "title": "Researchers identify two new crocodile species - Phys.org", "description": "McGill University researchers, in collaboration with Mexican scientists, have discovered two previously unknown species of crocodiles, one living on the island of Cozumel and the other on the atoll of Banco Chinchorro, both off the Yucatán Peninsula.", "url": "https://phys.org/news/2025-04-crocodile-species.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/researchers-identify-t-1.jpg", "publishedAt": "2025-04-24T16:30:03Z", "content": "McGill University researchers, in collaboration with Mexican scientists, have discovered two previously unknown species of crocodiles, one living on the island of Cozumel and the other on the atoll o… [+2773 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Emily Cooke", "title": "Ancient DNA and modern genomes can reveal stories of past peoples, from the Iron Age to Chernobyl, geneticist says - Live Science", "description": "Ingrida Domarkienė, a geneticist at Vilnius University in Lithuania, discusses the exciting developments made possible by studying ancient and modern DNA.", "url": "https://www.livescience.com/health/genetics/ancient-dna-and-modern-genomes-can-reveal-stories-of-past-peoples-from-the-iron-age-to-chernobyl-geneticist-says", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vW2FSxZpmycPwkuGPBsqmL.png", "publishedAt": "2025-04-24T16:00:00Z", "content": "Ingrida Domarkienė\r\n studies ancient DNA, weaving together fragments of genetic material from modern humans and our long-extinct human relatives to retell their stories.\r\nFrom a background in molecul… [+8561 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Alana Wise", "title": "Mercury, Venus and Saturn to delight stargazers in a parade across the sky - NPR", "description": "The pre-dawn sky will feature a glowing crescent moon, joined by planets Mercury, Venus and Saturn.", "url": "https://www.npr.org/2025/04/24/g-s1-62359/planet-parade-mercury-venus-saturn", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1200x675+0+0/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1c%2F20%2F289273f54f1ba0f03210f96d1d8e%2Fskychart-venus-saturn-moon-april-24-2025.png", "publishedAt": "2025-04-24T15:24:44Z", "content": "Alongside a crescent moon, Mercury, Venus and Saturn will become visible to stargazers just before dawn on Friday morning.\r\nAccording to NASA, the planetary phenomenon will be clearest about 45 minut… [+1772 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "Geologist left 'awe-struck' by giant 'sea dragon' discovery in Mississippi - Live Science", "description": "Researchers may have discovered Mississippi's largest ever mosasaur after pulling a Cretaceous-aged fossil out of a riverbed south of Starkville.", "url": "https://www.livescience.com/animals/extinct-species/giant-sea-dragon-fossil-could-be-largest-mosasaur-ever-discovered-in-mississippi", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BvjtgfMC3rpnB8AACqWCGc.jpg", "publishedAt": "2025-04-24T15:12:58Z", "content": "A giant \"sea dragon\" backbone plucked from a riverbank in Mississippi could belong to the largest mosasaur ever found in the state, scientists say.\r\nResearchers only found a single vertebra from the … [+3976 chars]"}, {"source": {"id": null, "name": "Lbl.gov"}, "author": "jennynuss", "title": "Scientists Develop Artificial Leaf That Uses Sunlight to Produce Valuable Chemicals - Berkeley Lab News Center (.gov)", "description": "Researchers built a device made of perovskite and copper that mimics a green leaf.", "url": "https://newscenter.lbl.gov/2025/04/24/scientists-develop-artificial-leaf-that-uses-sunlight-to-produce-valuable-chemicals/", "urlToImage": "https://newscenter.lbl.gov/wp-content/uploads/2025/04/Newscenter_featured_1190px_XBD-202503-035-001.jpg", "publishedAt": "2025-04-24T15:05:52Z", "content": "Previous experiments have successfully replicated photosynthesis through the use of biological materials, but this work incorporated an inorganic material, copper. While the selectivity of copper is … [+1306 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "WSJ", "title": "Astronomers Discover Tatooine-Like Planet With Two Suns - WSJ", "description": null, "url": "https://www.wsj.com/science/astronomers-discover-tatooine-like-planet-with-two-suns-e43ba33d", "urlToImage": null, "publishedAt": "2025-04-24T15:00:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Unlock a Hidden Dimension for Light—And It Could Revolutionize Technology! - The Daily Galaxy", "description": "Scientists have discovered a groundbreaking phenomenon where light materializes from nothingness, opening the door to revolutionary advances in physics and technology.", "url": "https://dailygalaxy.com/2025/04/scientists-unlock-a-hidden-dimension-light/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Scientists-Unlock-a-Hidden-Dimension-for-Light—And-It-Could-Revolutionize-Technology.jpg", "publishedAt": "2025-04-24T15:00:00Z", "content": "In a groundbreaking new study, researchers from the University of Rostock and the University of Birmingham have made a surprising discovery that challenges the long-held understanding of time and spa… [+3095 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Tethys Seaway — The Vanished Ocean That Completely Altered the Course of Life on Earth! - The Daily Galaxy", "description": "The Tethys Seaway, Earth's lost ocean, vanished and sparked epic changes—shaping deserts, evolution, and the planet’s future in ways you won’t believe!", "url": "https://dailygalaxy.com/2025/04/tethys-seaway-ocean-altered-life-on-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Tethys-Seaway-The-Vanished-Ocean-That-Reshaped-Life-on-Earth.jpg", "publishedAt": "2025-04-24T14:30:00Z", "content": "The closure of the ancient Tethys Seaway has left an indelible mark on Earth’s history. As tectonic forces slowly reshaped the planet over millions of years, this ocean’s disappearance altered climat… [+4273 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Scotty Hendricks", "title": "5 classic science fiction novels written by scientists - Big Think", "description": "What happens when scientists \"write what they know\"? Some amazing science fiction stories.", "url": "https://bigthink.com/books/science-fiction-novels-by-scientists/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/04/5-Classic-Sci-Fi-Books.jpg?resize=1200,630", "publishedAt": "2025-04-24T14:30:00Z", "content": null}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Say Dark Matter May Be Giving Off a Signal - futurism.com", "description": "Scientists want to build a new type of detector they liken to a \"cosmic car radio,\" that could listen to what the dark matter is saying.", "url": "https://futurism.com/dark-matter-signal-axion-detector", "urlToImage": "https://wordpress-assets.futurism.com/2025/04/dark-matter-signal-axion-detector.jpg", "publishedAt": "2025-04-24T14:05:13Z", "content": "Dark matter, the invisible stuff that scientists believe makes up around 85 percent of the mass in the universe, remains one of science's biggest mysteries.\r\nAs far as anyone has been able to establi… [+2621 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Why Snow in New Zealand’s Alps Turned an Alarming Shade of Red - Gizmodo", "description": "Several years ago, snow in New Zealand's Southern Alps turned red, and while many blamed wildfires at the time, new research uncovers the true culprit.", "url": "https://gizmodo.com/why-snow-in-new-zealands-alps-turned-an-alarming-shade-of-red-2000593615", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/red-new-zealand-alps.jpg", "publishedAt": "2025-04-24T13:35:15Z", "content": "During the Southern Hemisphere’s summer of 20192020, mountains in New Zealand turned red. New research finally explains why.\r\nResearchers have revealed that New Zealand’s Southern Alps turned red aft… [+2657 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Insert Human a “Language Gene” Into Mice — and Now They’re Talking Differently - Indian Defence Review", "description": "Scientists just inserted a human gene into mice, and the results are nothing short of mind-blowing. The vocalizations of the rodents changed in ways no one expected.", "url": "https://indiandefencereview.com/scientists-insert-human-a-language-gene-into-mice-and-now-theyre-talking-differently/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/04/a-close-up-photograph-of-a-small-white-laboratory-mouse.jpg", "publishedAt": "2025-04-24T13:30:00Z", "content": "In a groundbreaking experiment, researchers have inserted a human-specific gene, known as NOVA1, into mice to study the evolution of vocal communication. The results were nothing short of extraordina… [+4223 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A continent is splitting in two, the rift is already visible, and a new ocean is set to form. - Farmingdale Observer", "description": "The African continent is experiencing a remarkable geological transformation right before our eyes. Scientists have confirmed that East Africa is gradually splitting apart, with visible evidence of this continental fracture already appearing. This extraordina…", "url": "https://farmingdale-observer.com/2025/04/24/a-continent-is-splitting-in-two-the-rift-is-already-visible-and-a-new-ocean-is-set-to-form/", "urlToImage": null, "publishedAt": "2025-04-24T12:21:00Z", "content": "The African continent is experiencing a remarkable geological transformation right before our eyes. Scientists have confirmed that East Africa is gradually splitting apart, with visible evidence of t… [+4124 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Stunning Photos Show Construction of World’s Largest Telescope - PetaPixel", "description": "Building work has reached its highest point.", "url": "https://petapixel.com/2025/04/24/stunning-photos-show-construction-of-extremely-large-telescope-eso/", "urlToImage": "https://petapixel.com/assets/uploads/2025/04/ELT2.jpg", "publishedAt": "2025-04-24T11:52:21Z", "content": "A side-by-side view of the Extremely Large Telescope in August 2023, left, and April 12, 2025, right. | E. Garcés/ESO\r\nThe European Southern Observatory (ESO) has shared spectacular progress photos o… [+2720 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Abhishek Bhardwaj", "title": "‘Terror crocodiles’ feasted on dinosaurs 75 million years ago, study finds how - Interesting Engineering", "description": "The study sheds light on the adaptation which played the most important role in 'terror crocodiles' becoming a dinosaur-eating demon.", "url": "https://interestingengineering.com/science/terror-crocodile-ate-dinosaur-study", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/04/Untitled-design-2025-04-24T142046.121.jpg", "publishedAt": "2025-04-24T10:33:00Z", "content": "Previously, the massive reptile had also been called a greater alligator by the experts. However, new research shows that it belongs to a different family tree of the crocodilian family compared to t… [+788 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Brandon Boesch", "title": "When AIs do science, it will be strange and incomprehensible - Aeon", "description": "When AI takes over the practice of science we will likely find the results strange and incomprehensible. Should we worry?", "url": "https://aeon.co/essays/when-ais-do-science-it-will-be-strange-and-incomprehensible", "urlToImage": "https://images.aeonmedia.co/images/03742822-3ab0-4169-97a7-aacc6d38eaae/essay-gettyimages-499163175.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-04-24T10:00:35Z", "content": "The science of our age is computational. Without models, simulations, statistical analysis, data storage and so on, our knowledge of the world would grow far more slowly. For decades, our fundamental… [+17732 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Katarina Zimmer", "title": "'Its strength is its simplicity': The benefits of cleaning with vinegar - BBC", "description": "Katarina Zimmer put vinegar to the test as a cleaning product and discovered a wide range of benefits, for people and the planet.", "url": "https://www.bbc.com/future/article/20250423-is-vinegar-safer-and-more-sustainable-than-other-cleaning-products", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0l616zp.jpg", "publishedAt": "2025-04-24T09:02:26Z", "content": "Katarina Zimmer put vinegar to the test as a cleaning product and discovered a wide range of benefits, for people and the planet.\r\nA few months ago in my new Berlin apartment, my toilet and I were at… [+11087 chars]"}]}