{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MARCIA DUNN", "title": "Why asteroid 2024 YR4 is unlikely to hit Earth in 2032 and how scientists keep track - The Associated Press", "description": "Scientists say the threat of a newly discovered asteroid has risen slightly in the past few weeks, as the world's telescopes rush to track its course. But the chance is still quite slim — a mere 2% — that the space rock will smack Earth in 2032. They say the …", "url": "https://apnews.com/article/asteroid-2024-yr4-earth-2032-5c353e2ee53bb1ecd68a562611d54062", "urlToImage": "https://dims.apnews.com/dims4/default/d85036b/2147483647/strip/true/crop/3934x2213+0+205/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fac%2Fc8%2F5d268b3d286f1ad6fde052c87294%2Fdd02dbb93a6344b4813b2cb34d6c2d9e", "publishedAt": "2025-02-13T18:52:00Z", "content": "CAPE CANAVERAL, Fla. (AP) The threat of a newly discovered asteroid has risen slightly in the past few weeks, as the worlds telescopes rush to track its course. But the chance of an impact is still q… [+3668 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Measuring the size of a neutrino: Physicists suggest it's considerably larger than an atomic nucleus - Phys.org", "description": "An international team of physicists has successfully measured the size of a certain type of neutrino to a certain degree. In their paper published in the journal Nature, the group describes experiments they conducted that involved measuring the radioactive de…", "url": "https://phys.org/news/2025-02-size-neutrino-physicists-considerably-larger.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/measuring-the-size-of.jpg", "publishedAt": "2025-02-13T16:10:16Z", "content": "An international team of physicists has successfully measured the size of a certain type of neutrino to a certain degree. In their paper published in the journal Nature, the group describes experimen… [+2797 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Astronomers may have just spotted the fastest planetary system ever seen - Livescience.com", "description": "Researchers believe they have rediscovered a mysterious star system first spotted in 2011. If true, the alien sun and its exoplanet companion are speeding through our galaxy at more than 1.2 million mph. However, it is unclear if this is really the case.", "url": "https://www.livescience.com/space/astronomy/astronomers-may-have-just-spotted-the-fastest-planetary-system-ever-seen", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Lo3fS47hTz8X8f2RLCYUJP-1200-80.jpg", "publishedAt": "2025-02-13T15:51:04Z", "content": "Scientists may have spotted a tiny star, possibly with an alien world in tow, shooting through the Milky Way around 500 times faster than a speeding bullet\r\n. This would make this the fastest planeta… [+4400 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Largest celestial object of its kind discovered in the distant universe - CNN", "description": "Astronomers used an array of telescopes to find the most massive radio jet in the early universe. The celestial object is hundreds of thousands of light-years long.", "url": "https://www.cnn.com/2025/02/13/science/distant-giant-quasar-jet/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/noirlab2506a.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-13T15:31:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAstronomers have spied a monster radio jet in the dist… [+6223 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Micah Maidenberg, Andrew Tangel", "title": "The Cleanup From SpaceX’s Last Starship Launch Looms Over Its Next One - The Wall Street Journal", "description": "Explosion during test flight last month worried residents of Turks and Caicos and raised concerns about risks to commercial planes", "url": "https://www.wsj.com/business/spacex-starship-cleanup-launch-elon-musk-11e59ada", "urlToImage": "https://images.wsj.net/im-67150802/social", "publishedAt": "2025-02-13T15:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "'It was a miracle.' Amazing tales of dead spacecraft that came back to life - Space.com", "description": "Sometimes the end of the mission isn't really the end.", "url": "https://www.space.com/space-exploration/it-was-a-miracle-amazing-tales-of-dead-spacecraft-that-came-back-to-life", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6gSvM33BAre4GTU8939Lwa-1200-80.png", "publishedAt": "2025-02-13T15:00:00Z", "content": "The hulk of metal moved silently through space, high above the blue Earth. Power no longer coursed through its wires, its instruments were dead to the outside universe, and its communications antenna… [+13096 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Surrey", "title": "Physicists uncover evidence of two arrows of time emerging from the quantum realm - Phys.org", "description": "What if time is not as fixed as we thought? Imagine that instead of flowing in one direction—from past to future—time could flow forward or backwards due to processes taking place at the quantum level. This is the thought-provoking discovery made by researche…", "url": "https://phys.org/news/2025-02-physicists-uncover-evidence-arrows-emerging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/physicists-uncover-evi.jpg", "publishedAt": "2025-02-13T14:43:00Z", "content": "What if time is not as fixed as we thought? Imagine that instead of flowing in one directionfrom past to futuretime could flow forward or backwards due to processes taking place at the quantum level.… [+4213 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Uncover Mysterious Structural Changes in Earth’s Inner Core - SciTechDaily", "description": "A new study reveals that the Earth's inner core is undergoing a structural transformation. A new study by USC scientists, published in Nature Geoscience, reveals structural changes near the Earth's inner core, suggesting its surface may be shifting. While sci…", "url": "https://scitechdaily.com/researchers-uncover-mysterious-structural-changes-in-earths-inner-core/", "urlToImage": "https://scitechdaily.com/images/Earth-Interior-Structure-Layers-Illustration.jpg", "publishedAt": "2025-02-13T14:31:37Z", "content": "New research reveals Earth’s inner core may be deforming due to outer core turbulence, altering its structure and rotation.\r\nA new study reveals that the Earth’s inner core is undergoing a structural… [+3739 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Paleontologists Discover Recover a ‘One-in-a-Billion’ Sea Monster Skull — Bigger and Deadlier Than a T. Rex - Indian Defence Review", "description": "Buried for 145 million years, a massive fossil skull has emerged from the cliffs of Dorset, leaving scientists in awe. This prehistoric predator had a bite so powerful it could rival the most fearsome beasts of its time. Unique features suggest it may belong …", "url": "https://indiandefencereview.com/paleontologists-discover-recover-a-one-in-a-billion-sea-monster-skull-bigger-and-deadlier-than-a-t-rex/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/A-massive-pliosaur-skull.jpg", "publishedAt": "2025-02-13T14:30:00Z", "content": "A massive pliosaur skull has been discovered embedded in the cliffs near Kimmeridge Bay, Dorset, astonishing paleontologists and sparking new debates about the deadliest hunters of the Jurassic era.\r… [+2974 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "'Iridescent' clouds on Mars captured in Martian twilight in stunning NASA rover images (video) - Space.com", "description": "\"I'll always remember the first time I saw those iridescent clouds and was sure at first it was some color artifact.\"", "url": "https://www.space.com/the-universe/mars/iridescent-clouds-on-mars-captured-in-martian-twilight-in-stunning-nasa-rover-images-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/igGF34V3A3WoMJTKrQY3rM-1200-80.gif", "publishedAt": "2025-02-13T14:00:00Z", "content": "What do clouds on Mars look like? Well, a new video stitched together from images captured by NASA's Curiosity rover offers a glimpse. In this video, delicate red-and-green-tinted clouds are seen dri… [+3897 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Paleontologists Discovered the Oldest Modern Bird Ever Found, Which Might Have Shared the World with a T. Rex - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have uncovered a 69-million-year-old fossil that could change everything we know about bird evolution. The nearly complete skull reveals features strikingly similar to modern birds, raising new debates among paleontologists. Some believe it proves …", "url": "https://dailygalaxy.com/2025/02/paleontologists-discovered-the-oldest-modern-bird-have-shared-the-world-with-t-rex/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/the-Oldest-Modern-Bird-Ever-Found.jpg", "publishedAt": "2025-02-13T14:00:00Z", "content": "A newly unearthed 69-million-year-old fossil is shaking up long-standing debates among paleontologists about when modern birds emerged. The discovery of a nearly complete skull from the extinct bird … [+3385 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Once Feared as the Ocean’s Apex Predator, “Great White Sharks” Are Now Being Hunted by a Deadly Enemy - Indian Defence Review", "description": "Once the undisputed ruler of the ocean, the great white shark is now facing an unexpected and relentless new predator. Disturbing evidence off Australia’s coast reveals a shocking shift in the marine food chain. A silent hunter is targeting great whites with …", "url": "https://indiandefencereview.com/once-thought-to-be-the-oceans-ultimate-predator-great-white-sharks-now-face-a-deadly-new-threat/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Great-White-Shark.jpg", "publishedAt": "2025-02-13T14:00:00Z", "content": "In the waters off Australias southern coast, a dramatic shift in the oceans predator hierarchy is unfolding. The legendary great white shark, long considered the top hunter of the seas, is now facing… [+3717 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jennifer Zieba", "title": "Scientists just rewrote our understanding of epigenetics - Livescience.com", "description": "DNA and RNA epigenetics, once thought to be separate, have now been found to work together to fine-tune gene expression.", "url": "https://www.livescience.com/health/genetics/scientists-just-rewrote-our-understanding-of-epigenetics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FHaPk8HswmetE3SpEWVuW7-1200-80.jpg", "publishedAt": "2025-02-13T13:30:10Z", "content": "Scientists have uncovered a new way that cells control their genes — and it may rewrite our understanding of \"epigenetics.\"\r\nEpigenetics\r\n is a form of DNA modification that doesn't affect the DNA se… [+4848 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Spent 10 Years Reconstructing This Breathtaking 417 Megapixel Image of This Galaxy Located 2.5m Light-Years Away - The Daily Galaxy --Great Discoveries Channel", "description": "After 10 years of observations and over 1,000 orbits, NASA has unveiled the most precise image of Andromeda ever created. This 417-megapixel masterpiece reveals a turbulent past, exposing the aftermath of a cosmic collision that shaped its evolution. The data…", "url": "https://dailygalaxy.com/2025/02/nasa-spent-10-years-reconstructing-this-breathtaking-417-megapixel-image-of-this-galaxy-located-2-5m-light-years-away/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/This-photomosaic-of-the-Andromeda-galaxy-located-2.5-million-light-years-from-Earth-is-the-largest-ever-created-using-images-from-the-Hubble-Space-Telescope.jpg", "publishedAt": "2025-02-13T13:00:26Z", "content": "For over a decade, the Hubble Space Telescope meticulously observed our closest galactic neighbor, capturing over 1,000 orbits worth of data. The result? A breathtaking 417-megapixel image of the And… [+3615 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "Biological aging may not be driven by what we thought - Livescience.com", "description": "A new study draws a line between random genetic mutations and predictable epigenetic changes used to measure biological aging.", "url": "https://www.livescience.com/health/ageing/biological-aging-may-not-be-driven-by-what-we-thought", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WtkHdAgBUdYhaUXsd3JUgJ-1200-80.jpg", "publishedAt": "2025-02-13T13:00:00Z", "content": "Scientists often use \"epigenetic clocks\" to measure biological aging, but what makes these clocks tick is not fully understood. Now, scientists have uncovered a clue: The clocks are synced with rando… [+6973 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "New research reveals what really caused the Black Death - The Brighter Side of News", "description": "Black Death arrived in the Mediterranean through trade ships transporting goods from the territories of the Golden Horde along the Black Sea.", "url": "https://www.thebrighterside.news/health/new-research-reveals-what-really-caused-the-black-death", "urlToImage": "https://www.thebrighterside.news/uploads/2024/08/black-death-5.webp?auto=webp", "publishedAt": "2025-02-13T12:52:00Z", "content": "In 1347, the Black Death arrived in the Mediterranean through trade ships transporting goods from the territories of the Golden Horde along the Black Sea. \r\nThis devastating outbreak spread rapidly a… [+6019 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Little-Known Scientist May Have Unlocked the Secret of Life’s Origins on Earth 50 Years Ago, but Was Buried by History - The Daily Galaxy --Great Discoveries Channel", "description": "For decades, a little-known scientist worked in obscurity, proposing a radical idea about the origins of life. His theory, dismissed and forgotten, challenged everything we thought we knew. Now, researchers are rediscovering his work—and the implications are …", "url": "https://dailygalaxy.com/2025/02/little-known-scientist-may-have-unlocked-the-secret-to-lifes-origins-on-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Tibor-Ganti-i.jpg", "publishedAt": "2025-02-13T12:30:00Z", "content": "The story of Tibor Gánti is one of a visionary scientist who remained in the shadows for far too long. As the scientific community continues to unravel the origins of life, his work provides a compel… [+5410 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Drew Turney", "title": "Supercomputer runs largest and most complicated simulation of the universe ever - Livescience.com", "description": "Frontier, the second fastest supercomputer in the world, used dark matter and the movement of gas and plasma rather than just gravity to model the observable universe.", "url": "https://www.livescience.com/technology/computing/supercomputer-runs-largest-and-most-complicated-simulation-of-the-universe-ever", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nB4UvJorfWEL5o2chQEs7E-1200-80.jpg", "publishedAt": "2025-02-13T12:00:00Z", "content": "The potential for our understanding of the universe has taken a giant leap forward after Frontier, a supercomputer based in the Oak Ridge National Laboratory (ORNL), created a simulation of the unive… [+3295 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Danny Robb", "title": "How the scientists of the 1960s turned the Moon into a place - Aeon", "description": "For most of history, the Moon was regarded as a mysterious and powerful object. Then scientists made it into a destination", "url": "https://aeon.co/essays/how-the-scientists-of-the-1960s-turned-the-moon-into-a-place", "urlToImage": "https://images.aeonmedia.co/images/f9edc8cc-1696-4252-9571-6f790c8670ff/test-essay-lunar-orbiter-1-1102_med.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-02-13T11:02:42Z", "content": "On 25 May 1961, the US president John F Kennedy announced the Apollo programme: a mission to send humans to the Moon and return them safely to Earth within the decade. The next year, the American geo… [+19674 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Discover Nearby Alien World That May Sustain Life - ScienceAlert", "description": "An exoplanet with some key ingredients to support life may be lurking closer than we thought.", "url": "https://www.sciencealert.com/astronomers-discover-nearby-alien-world-that-may-sustain-life", "urlToImage": "https://www.sciencealert.com/images/2025/02/hd-20794-d.jpg", "publishedAt": "2025-02-13T11:01:34Z", "content": "An exoplanet with some key ingredients to support life may be lurking closer than we thought.\r\nAround a star just 20 light-years from the Solar System, astronomers have confirmed the existence of wha… [+3838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Total lunar eclipse brings a Blood Moon to North America next month. Here's how to see it - Space.com", "description": "Earth will soon experience the first total lunar eclipse since November 2022.", "url": "https://www.space.com/stargazing/eclipses/total-lunar-eclipse-brings-a-blood-moon-to-north-america-next-month-heres-how-to-see-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pW3NRvdYEHC6q8actQBk9Q-1200-80.gif", "publishedAt": "2025-02-13T11:00:00Z", "content": "In just one month, skywatchers across North America will be treated to a stunning total lunar eclipse.\r\nThe lunar eclipse will happen overnight between March 13 and March 14\r\n, 2025, and will be the … [+4121 chars]"}, {"source": {"id": null, "name": "Cam.ac.uk"}, "author": null, "title": "Solar-powered device captures carbon dioxide from air to make sustainable fuel - University of Cambridge news", "description": "Researchers have developed a reactor that pulls carbon dioxide directly from the air and converts it into sustainable fuel, using sunlight as the power source.", "url": "https://www.cam.ac.uk/research/news/solar-powered-device-captures-carbon-dioxide-from-air-to-make-sustainable-fuel", "urlToImage": "https://www.cam.ac.uk/sites/default/files/news/research/news/solar-daccu-final-copy.jpg", "publishedAt": "2025-02-13T10:48:02Z", "content": "The researchers, from the University of Cambridge, say their solar-powered reactor could be used to make fuel to power cars and planes, or the many chemicals and pharmaceuticals products we rely on. … [+4514 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "Record-Breaking Neutrino From Deep Space Spotted by Undersea Telescope - ScienceAlert", "description": "High-energy particles rain down on Earth constantly, but scientists have now detected a doozy: a neutrino blasting in from deep space with an energy far greater than anything we've seen before.", "url": "https://www.sciencealert.com/record-breaking-neutrino-from-deep-space-spotted-by-undersea-telescope", "urlToImage": "https://www.sciencealert.com/images/2025/02/HighestEnergyNeutrino.jpg", "publishedAt": "2025-02-13T07:11:02Z", "content": "High-energy particles rain down on Earth constantly, but scientists have now detected a doozy: a neutrino blasting in from deep space with an energy far greater than anything we've seen before.\r\nOn 1… [+4156 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "How small are the fundamental particles of the Universe? - Big Think", "description": "When we divide matter into its fundamental, indivisible components, are those particles truly point-like, or is there a finite minimum size?", "url": "https://bigthink.com/starts-with-a-bang/how-small-fundamental-particles/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/02/scale.jpg?w=960&h=540&crop=1", "publishedAt": "2025-02-13T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Alpha Centauri Particles Already Lurk in Our Solar System, Study Suggests - ScienceAlert", "description": "The appearance of the Interstellar Objects (ISOs) Oumuamua and Comet Borisov in 2017 and 2019, respectively, created a surge of interest.", "url": "https://www.sciencealert.com/alpha-centauri-particles-already-lurk-in-our-solar-system-study-suggests", "urlToImage": "https://www.sciencealert.com/images/2025/02/AlphaCentauri_2025_Cover.jpg", "publishedAt": "2025-02-13T04:40:13Z", "content": "The appearance of the Interstellar Objects (ISOs) Oumuamua and Comet Borisov in 2017 and 2019, respectively, created a surge of interest.\r\nWhat were they? Where did they come from? Unfortunately, the… [+8726 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Monisha Ravisetti", "title": "NASA denies setting 'new bans' for employees amid reports of removing LGBTQI+ symbols from offices - Space.com", "description": "\"Some managers have been reminding employees to be mindful of what personal affects they have in their workspaces, but there are no penalties or warnings about being placed on administrative leave for displaying personal items.\"", "url": "https://www.space.com/the-universe/earth/nasa-denies-setting-new-bans-for-employees-amid-reports-of-removing-lgbtqi-symbols-from-offices", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cGisb9ZiKwP7wYzHKqA5g-1200-80.jpg", "publishedAt": "2025-02-13T02:38:34Z", "content": "NASA has come under scrutiny over the last few weeks due to its compliance with executive orders penned by U.S. President Donald Trump. These are orders that directly impact all federal organizations… [+3717 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "What would happen if a small asteroid hit Earth? Scientists have an idea - Earth.com", "description": "An asteroid strike could cool the planet's climate, harm crops, and disrupt food supply, but it may also increase plankton growth in oceans.", "url": "https://www.earth.com/news/climate-chaos-how-an-asteroid-strike-would-change-life-on-earth/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/06084412/small-asteroid-strike_impact_life-on-earth_1m.jpg", "publishedAt": "2025-02-12T22:32:23Z", "content": "Throughout history, Earth has faced cataclysmic events that reshaped its climate and ecosystems. Some of these events were triggered by asteroid impacts, leaving long-lasting effects on both land and… [+7553 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "The ninth planet in our solar system could soon be revealed by this new telescope - farmingdale-observer.com", "description": "The hunt for our solar system's elusive ninth planet has captivated astronomers and space enthusiasts alike. Recent developments suggest that we may be on the brink of a groundbreaking discovery, one that could reshape our understanding of our cosmic neighbor…", "url": "https://farmingdale-observer.com/2025/02/12/the-ninth-planet-in-our-solar-system-could-soon-be-revealed-by-this-new-telescope/", "urlToImage": null, "publishedAt": "2025-02-12T22:27:00Z", "content": "The hunt for our solar system’s elusive ninth planet has captivated astronomers and space enthusiasts alike. Recent developments suggest that we may be on the brink of a groundbreaking discovery, one… [+4522 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Edits to Vera Rubin’s Biography Downplay the Need for Women in Science Amid Federal DEI Crackdown - Gizmodo", "description": "To comply with Trump's executive order about DEI, a federally funded telescope project has altered the biography of its namesake astronomer.", "url": "https://gizmodo.com/edits-to-vera-rubins-biography-downplay-the-need-for-women-in-science-amid-federal-dei-crackdown-2000562941", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/vera-rubin.jpg", "publishedAt": "2025-02-12T22:21:55Z", "content": "It’s been less than a month since President Donald Trump declared war on diversity and inclusion at federal agencies. NASA was ordered earlier this month to scrub its sites of “anything specifically … [+3771 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mars Is Rocked by Epic Quakes, And They Don't All Come From Within - ScienceAlert", "description": "Incredibly powerful marsquakes that violently shake the red planet don't always begin under the surface, research shows.", "url": "https://www.sciencealert.com/mars-is-rocked-by-epic-quakes-and-they-dont-all-come-from-within", "urlToImage": "https://www.sciencealert.com/images/2025/02/mars-crater-1.jpg", "publishedAt": "2025-02-12T22:01:22Z", "content": "Incredibly powerful marsquakes that violently shake the red planet don't always begin under the surface, research shows.\r\nA new study using artificial intelligence to analyze seismic data reveals jus… [+4621 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "The New NASA RIF Directive Is Now Online - NASA Watch", "description": "This directive has appeared online at NASA", "url": "https://nasawatch.com/personnel-news/the-new-nasa-rif-directive-is-now-online/", "urlToImage": "https://media2.spaceref.com/wp-content/uploads/2025/02/12165049/RIF-DOC.png", "publishedAt": "2025-02-12T21:56:07Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Birds-of-paradise use secret biofluorescence to attract mates - Earth.com", "description": "Biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances.", "url": "https://www.earth.com/news/birds-of-paradise-use-secret-biofluorescence-to-attract-mates/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/12143421/bird-of-paradise_biofluorescence_atrract-mates_1m.jpg", "publishedAt": "2025-02-12T21:36:40Z", "content": "New research has revealed that biofluorescence is widespread in birds-of-paradise, a group of tropical birds famous for their spectacular courtship dances and colorful plumage. \r\nThe study shows that… [+5252 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Whitney Clavin", "title": "AI program plays the long game to solve decades-old math problems - Phys.org", "description": "A game of chess requires its players to think several moves ahead, a skill that computer programs have mastered over the years. Back in 1996, an IBM supercomputer famously beat the then world chess champion Garry Kasparov. Later, in 2017, an artificial intell…", "url": "https://phys.org/news/2025-02-ai-plays-game-decades-math.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/an-infinite-chess-game.jpg", "publishedAt": "2025-02-12T21:22:55Z", "content": "A game of chess requires its players to think several moves ahead, a skill that computer programs have mastered over the years. Back in 1996, an IBM supercomputer famously beat the then world chess c… [+6630 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Stunned After Finding Organic Molecules in a 66-Million-Year-Old Dinosaur Bone - Indian Defence Review", "description": "For more than a century, paleontologists believed that fossilization erased all traces of organic molecules from dinosaur bones, leaving behind nothing but", "url": "https://indiandefencereview.com/organic-molecules-66-m-year-dinosaur-bone/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Scientists-Stunned-After-Finding-Organic-Molecules-in-a-66-Million-Year-Old-Dinosaur-Bone.jpg", "publishedAt": "2025-02-12T21:14:33Z", "content": "For more than a century, paleontologists believed that fossilization erased all traces of organic molecules from dinosaur bones, leaving behind nothing but mineralized remains. That long-standing ass… [+6996 chars]"}, {"source": {"id": null, "name": "Archaeology"}, "author": "Jessica Esther Saraceni", "title": "News - Study Dates Human Remains Recovered From the River Thames - Archaeology", "description": "LONDON, ENGLAND—According to a Live Science report, radiocarbon dating of ancient human skeletons recovered from […]", "url": "https://archaeology.org/news/2025/02/12/study-dates-human-remains-recovered-from-the-river-thames/", "urlToImage": "https://archaeology.org/wp-content/uploads/2025/02/News-20250212-London-Thames-River-Foreshore.jpg", "publishedAt": "2025-02-12T20:08:52Z", "content": "LONDON, ENGLANDAccording to a Live Science report, radiocarbon dating of ancient human skeletons recovered from the River Thames indicates that they date to between 4000 B.C. and A.D. 1800. Nichola A… [+897 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Simulated a Quantum Apocalypse. Then the Universe Disappeared. - Yahoo", "description": "Luckily “false vacuum decay” would take millions of years to occur, if it happens at all.", "url": "https://www.popularmechanics.com/science/a63758162/false-vacuum-decay-quantum-annealer/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/3b8ZT7rt_TN2l3GzCbD0eg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/c2e22056e981ab3d08f95ea139abe240", "publishedAt": "2025-02-12T19:30:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>The universe could end not with a bang, but a whimper known as false vacuum decay.\r\n</li><li>In… [+3694 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brown University", "title": "Unexpected TV signal leads to a new method for filtering out unwanted radio frequencies - Phys.org", "description": "Astronomers sifting through data from the Murchison Widefield Array, a radio telescope in Western Australia, found themselves confronting an unexpected mystery.", "url": "https://phys.org/news/2025-02-unexpected-tv-method-filtering-unwanted.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/radiotelesco.jpg", "publishedAt": "2025-02-12T19:25:06Z", "content": "Astronomers sifting through data from the Murchison Widefield Array, a radio telescope in Western Australia, found themselves confronting an unexpected mystery.\r\nThe telescope, which consists of 4,09… [+6689 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Tiernan P. Doyle", "title": "NASA’s Advancements in Space Continue Generating Products on Earth - NASA", "description": "The latest edition of NASA’s Spinoff publication, which highlights the successful transfer of agency technology to the commercial sector, is now available", "url": "https://www.nasa.gov/news-release/nasas-advancements-in-space-continue-generating-products-on-earth/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/nasa-spinoff-2025-cover-3k.png", "publishedAt": "2025-02-12T19:22:44Z", "content": "The latest edition of NASAs Spinoff publication, which highlights the successful transfer of agency technology to the commercial sector, is now available online.\r\nFor nearly 25 years, NASA has suppor… [+3670 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Victoria", "title": "Witnessing the birth of planets: Webb telescope provides unprecedented view into PDS 70 system - Phys.org", "description": "Canadian astronomers have taken an extraordinary step in understanding how planets are born, using the James Webb Space Telescope (JWST). JWST was used to study PDS 70, a young star with two growing planets in its orbit. This remarkable system, located 370 li…", "url": "https://phys.org/news/2025-02-witnessing-birth-planets-webb-telescope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/witnessing-the-birth-o.jpg", "publishedAt": "2025-02-12T19:07:05Z", "content": "Canadian astronomers have taken an extraordinary step in understanding how planets are born, using the James Webb Space Telescope (JWST). JWST was used to study PDS 70, a young star with two growing … [+7256 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Scientists record never-before-seen 'ice quakes' deep inside Greenland's frozen rivers - Yahoo", "description": "Quakes recorded for the first time inside Greenland's biggest frozen river, the Northeast Greenland Ice Stream, suggest this river and others switch between ...", "url": "https://www.livescience.com/planet-earth/arctic/scientists-record-never-before-seen-ice-quakes-deep-inside-greenlands-frozen-rivers", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Se65S3DylnAO1s.qla2UgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/e07a5f4f8008cb41896c64dcb4852d51", "publishedAt": "2025-02-12T19:04:27Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nResearchers recorded ice quakes in the Greenland Ice Sheet by lowering a fiber-optic cable down… [+4153 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Simulation shows wolves had time to self-domesticate and evolve into dogs - Phys.org", "description": "A team of mathematicians and statisticians from the University of Wisconsin-La Crosse, the University of Tennessee and Valparaiso University, all in the U.S., has found new evidence that wolves had ample time to self-domesticate and evolve into modern dogs. I…", "url": "https://phys.org/news/2025-02-simulation-wolves-domesticate-evolve-dogs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/wolf.jpg", "publishedAt": "2025-02-12T17:30:01Z", "content": "A team of mathematicians and statisticians from the University of Wisconsin-La Crosse, the University of Tennessee and Valparaiso University, all in the U.S., has found new evidence that wolves had a… [+2597 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Meet the Sexome: The Bacteria in Our Junk That We Swap During Sex - Gizmodo", "description": "New research shows that we regularly transfer traces of our genital microbiomes to sexual partners—a discovery that could someday be used as a crime-solving tool.", "url": "https://gizmodo.com/meet-the-sexome-the-bacteria-in-our-junk-that-we-swap-during-sex-2000562797", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/Microbiome.jpg", "publishedAt": "2025-02-12T16:37:46Z", "content": "It turns out that fluids aren’t the only thing we’re swapping with our bedtime mates. New research out this week shows that people also leave behind remnants of their genitals’ unique microbiome post… [+4738 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Barcelona", "title": "Eliminating singularities: Physicists describe the creation of black holes through pure gravity - Phys.org", "description": "Traditional black holes, as predicted by Albert Einstein's theory of General Relativity, contain what are known as singularities, i.e., points where the laws of physics break down. Identifying how singularities are resolved in the context of quantum gravity i…", "url": "https://phys.org/news/2025-02-singularities-physicists-creation-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/black-holes-2.jpg", "publishedAt": "2025-02-12T16:32:07Z", "content": "Traditional black holes, as predicted by Albert Einstein's theory of General Relativity, contain what are known as singularities, i.e., points where the laws of physics break down. Identifying how si… [+4711 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "Moroccan fly maggot uses fake face on its butt to infiltrate termite colony - Livescience.com", "description": "Researchers have discovered blow fly larvae with fake termite faces on their rears that enable them to socially integrate into termite colonies in the mountains of Morocco.", "url": "https://www.livescience.com/animals/insects/moroccan-fly-maggot-uses-fake-face-on-its-butt-to-infiltrate-termite-colony", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GDb7Zs5vkbfvBwgGRqWhgL-1200-80.jpg", "publishedAt": "2025-02-12T16:11:13Z", "content": "Mountain fly maggots have evolved fake faces on their butts as a cunning disguise to infiltrate termite colonies, a new study has found.\r\nResearchers spotted the fake faces, which resemble termite he… [+3230 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Physikalisch-Technische Bundesanstalt", "title": "Physicists find deformed nuclei when searching for 'dark forces' - Phys.org", "description": "When world-leading teams join forces, new findings are bound to be made. This is what happened when quantum physicists from the Physikalisch-Technische Bundesanstalt (PTB) and the Max Planck Institute for Nuclear Physics (MPIK) in Heidelberg combined atomic a…", "url": "https://phys.org/news/2025-02-physicists-deformed-nuclei-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-insights-into-the-2.jpg", "publishedAt": "2025-02-12T16:07:39Z", "content": "When world-leading teams join forces, new findings are bound to be made. This is what happened when quantum physicists from the Physikalisch-Technische Bundesanstalt (PTB) and the Max Planck Institut… [+4260 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Earliest short-tailed bird from the Late Jurassic of China - Nature.com", "description": "Two recently discovered bird fossils from the Late Jurassic Zhenghe Fauna demonstrate that highly derived bird-like features and the origin of birds appeared much earlier in the Jurassic period than previously estimated.", "url": "https://www.nature.com/articles/s41586-024-08410-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-024-08410-z/MediaObjects/41586_2024_8410_Fig1_HTML.png", "publishedAt": "2025-02-12T16:03:41Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Parisian photographer produces phenomenal, perfectly-proportioned 'planetary parade' portrait - Livescience.com", "description": "A French astrophotographer recently snapped shots of the moon, Venus, Mars, Jupiter, Saturn, Uranus and Neptune in a single evening, and rearranged them to create a striking composite image. Each \"planetary parade\" member was captured with the same magnificat…", "url": "https://www.livescience.com/space/astronomy/parisian-photographer-produces-phenomenal-perfectly-proportioned-planetary-parade-portrait", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E8bGDnrq8yTeWHnxnpnEJZ-1200-80.jpg", "publishedAt": "2025-02-12T15:32:17Z", "content": "A striking new \"planetary parade\" photo combines images of six solar system\r\n worlds alongside the moon, providing a rare opportunity to compare the sizes of these celestial objects as they currently… [+3332 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "ICYMI: Science is considering retracting ‘arsenic life’ paper - Retraction Watch", "description": "Felisa Wolfe-Simon at Mono Lake in 2010 (photo by Henry Bortman) Science is finally considering retracting a 2010 paper claiming the discovery of a bacterium that could substitute arsenic for phosp…", "url": "https://retractionwatch.com/2025/02/12/icymi-science-considering-retraction-arsenic-life/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2025/02/felicia-wolfe-simon-2010-c-henry-bortman.jpg", "publishedAt": "2025-02-12T15:11:42Z", "content": "Science is finally considering retracting a 2010 paper claiming the discovery of a bacterium that could substitute arsenic for phosphorus in its chemical makeup. We feel the best thing to do would be… [+2134 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "NASA Telescopes Deliver Stellar Bouquet in Time for Valentine’s Day - NASA", "description": "A bouquet of thousands of stars in bloom has arrived. This composite image contains the deepest X-ray image ever made of the spectacular star forming region", "url": "https://www.nasa.gov/image-article/nasa-telescopes-deliver-stellar-bouquet-in-time-for-valentines-day/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/30dor.jpg", "publishedAt": "2025-02-12T15:06:58Z", "content": "A bouquet of thousands of stars in bloom has arrived. This composite image contains the deepest X-ray image ever made of the spectacular star forming region called 30 Doradus.\r\nBy combining X-ray dat… [+4174 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Aurora Alert: Geomagnetic storm could bring northern lights as far south as Michigan and Maine this week - Space.com", "description": "Strong solar winds could supercharge the northern lights just in time for Valentine's Day.", "url": "https://www.space.com/stargazing/aurora-borealis/aurora-alert-geomagnetic-storm-could-bring-northern-lights-as-far-south-as-michigan-and-maine-this-week", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TQNbN57q5EodM9pnLHaiua-1200-80.jpg", "publishedAt": "2025-02-12T14:50:36Z", "content": "(Image credit: Daisy Dobrijevic/Canva)\r\nKeep up to date with northern lights forecasts, alerts and geomagnetic storm warnings with our aurora forecast live blog.\r\nA fresh blast of solar wind is set t… [+2843 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Russia Claims New Plasma-Based Engine Could Cut Mars Travel to Just 30 Days - Gizmodo", "description": "Engineers developed an engine prototype which could reach unprecedented speeds, cutting down interplanetary travel time.", "url": "https://gizmodo.com/russia-claims-new-plasma-based-engine-could-cut-mars-travel-to-just-30-days-2000562451", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/Mars-1.jpeg", "publishedAt": "2025-02-12T14:36:17Z", "content": "A trip to Mars may be in the books for future astronauts, but current propulsion technology will have them floating in a spacecraft bound for the Red Planet for roughly six to nine months. Considerin… [+2542 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Mahdi Bodaghi", "title": "Sofas that self-assemble when you heat them up? How 4D printing could transform manufacturing - The Conversation", "description": "This unsung research area involves 3D-printing smart materials that can change shape when they come into contact with stimuli like heat or light.", "url": "https://theconversation.com/sofas-that-self-assemble-when-you-heat-them-up-how-4d-printing-could-transform-manufacturing-246899", "urlToImage": "https://images.theconversation.com/files/647658/original/file-20250207-17-c7o3tq.jpg?ixlib=rb-4.1.0&rect=15%2C115%2C964%2C481&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-02-12T14:23:03Z", "content": "Imagine buying a flat sheet from a furniture store that changes into a sofa when you heat it with a hairdryer. Or consider the value of a stent that precisely expands inside a patients artery, adapti… [+6311 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "SpaceX rocket launch spawns dazzling 'space jellyfish' in evening sky (photos) - Space.com", "description": "If you saw something strange in the evening sky over California on Feb. 10, we can explain.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-rocket-launch-spawns-dazzling-space-jellyfish-in-evening-sky-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VvSkAEhHCU2LHweFbhSWQH-1200-80.jpg", "publishedAt": "2025-02-12T14:00:00Z", "content": "When SpaceX launched a Falcon 9 rocket from California on Monday evening (Feb. 10), it was just another flight for the company to boost its growing Starlink internet satellite constellation. For spec… [+3378 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Just Discovered ‘Quipu,’ the New Largest Structure in Our Cosmos - Yahoo", "description": "With a length of 428 megaparsecs, or around 1.39 billion light-years, the superstructure is the biggest ever spotted.", "url": "https://www.popularmechanics.com/space/deep-space/a63742272/quipu-superstructure/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/jWniKmZaOSnsRZ7F0rk6pg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/1896d6db791e4c5388dbb864bd3c125d", "publishedAt": "2025-02-12T13:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>To explore deep space is to come to grips with humanitys ever-shrinking importance in the unive… [+3790 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Ellsworth Toohey", "title": "Here's a plan to detonate the world's largest H-bomb to end global warming — what could go wrong? - Boing Boing", "description": "New climate proposal suggests using the world's largest nuclear explosion under the ocean to pulverize carbon-absorbing rock.", "url": "https://boingboing.net/2025/02/12/heres-a-plan-to-detonate-the-worlds-largest-h-bomb-to-end-global-warming-what-could-go-wrong.html", "urlToImage": "https://boingboing.net/wp-content/uploads/2025/02/hbomb.jpg", "publishedAt": "2025-02-12T12:06:52Z", "content": "You know we're living in interesting times when \"nuke the ocean floor\" makes it onto the list of climate solutions. \r\nA new proposal suggests using the world's largest-ever nuclear explosion buried d… [+1403 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Discovery of Stunning Einstein Ring by European Space Agency’s Euclid – the Dark Universe Detective - Good News Network", "description": "A galaxy in the distance, was tightly encircled by a halo of light—also known as an Einstein Ring, a result of gravitational lensing.", "url": "https://www.goodnewsnetwork.org/discovery-of-stunning-einstein-ring-by-european-space-agencys-euclid-the-dark-universe-detective/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/European-Space-Agency-detector-Euclid-captures-Einstein-Ring-around-galaxy-NGC_6505-Credit-ESA.jpg", "publishedAt": "2025-02-12T12:00:29Z", "content": "European Space Agencys Euclid captures Einstein Ring Credit: ESA\r\nWhen parsing through images meant to test the camera on a new space telescope, scientists recently recognized a striking and rare phe… [+3233 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Hoba Mystery: Why Didn't The World's Largest Meteorite Leave An Impact Crater? - IFLScience", "description": "Scientists suggested two scenarios at first: a really unusual entry, or somebody moved it.", "url": "https://www.iflscience.com/hoba-mystery-why-didnt-the-worlds-largest-meteorite-leave-an-impact-crater-78007", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78007/aImg/82079/hoba-meteorite-meta.png", "publishedAt": "2025-02-12T11:07:11Z", "content": "In 1920, a farmer plowing a field in Grootfontein, Namibia, hit a sudden roadblock below the surface of the soil. Curious about what had stopped his plow, the farmer dug around and found a very stran… [+4150 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mindy Weisberger", "title": "Diagnostic dilemma: One Direction concert left teen with 'crackling' bubbles in her chest - Livescience.com", "description": "In what doctors called an \"extraordinary\" case, a teenage girl developed several rare conditions after attending a pop concert.", "url": "https://www.livescience.com/health/diagnostic-dilemma-one-direction-concert-left-teen-with-crackling-bubbles-in-her-chest", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FXPLXRHapCdKgQ7LFrbwDB-1200-80.jpg", "publishedAt": "2025-02-12T11:00:00Z", "content": "The patient: A 16-year-old girl in Texas\r\nThe symptoms: The patient became short of breath after attending a concert by the boy band One Direction. She visited the emergency room the next day and tol… [+2897 chars]"}, {"source": {"id": null, "name": "Euro Weekly News"}, "author": "Marc Menendez-Roche", "title": "Beyond Neptune: NASA excited by new colossal ghost planet that defies science - Euro Weekly News", "description": "NASA has finally confirmed the existence of a new planet beyond Neptune that is 50 per cent larger than Jupiter and about a tenth of the dense, dubbed WASP-193b", "url": "https://euroweeklynews.com/2025/02/12/nasa-stunned-ghost-planet-appears-from-nowhere-science-cant-explain-it/", "urlToImage": "https://cdn.euroweeklynews.com/wp-content/uploads/2025/02/NASA-confirms-the-existence-of-WASP-193b-A-giant-marshmallow-like-planet-beyond-Neptune.jpg", "publishedAt": "2025-02-12T09:41:07Z", "content": "Space Oddity: NASA confirms the existence of WASP-193b - A giant, marshmallow-like planet beyond Neptune!\r\nCredit: Shutterstock, Vadim Sadovski NASA has finally confirmed the existence of WASP-193b. … [+3731 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Yellowstone's Super-Hot Water May Hold The Secrets of Earth's First Breath - ScienceAlert", "description": "Microbial life in Yellowstone's Lower Geyser Basin may hold clues to the evolution of life's exploitation of oxygen, according to a recent analysis by researchers from Montana State University.", "url": "https://www.sciencealert.com/yellowstones-super-hot-water-may-hold-the-secrets-of-earths-first-breath", "urlToImage": "https://www.sciencealert.com/images/2025/02/GettyImages-91233219.jpg", "publishedAt": "2025-02-12T03:31:19Z", "content": "Microbial life in Yellowstone's Lower Geyser Basin may hold clues to the evolution of life's exploitation of oxygen, according to a recent analysis by researchers from Montana State University.\r\nThe … [+4575 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mantis Shrimp Reveals The Secret to Surviving Its Deadly Shockwaves - ScienceAlert", "description": "Nothing else in the animal kingdom packs a punch like the mantis shrimp.", "url": "https://www.sciencealert.com/mantis-shrimp-reveals-the-secret-to-surviving-its-deadly-shockwaves", "urlToImage": "https://www.sciencealert.com/images/2025/02/mantis-shrimp.jpg", "publishedAt": "2025-02-12T01:32:57Z", "content": "Nothing else in the animal kingdom packs a punch like the mantis shrimp. This tiny, colorful crustacean delivers a wallop at 23 meters per second a king-hit delivering a jaw-dropping 1,500 newtons of… [+4218 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Scientists discover massive underwater crater that is 3x larger than the Grand Canyon - The Brighter Side of News", "description": "About 35 million years ago, an asteroid struck the ocean off the East Coast of North America, leaving behind a massive impact crater.", "url": "https://www.thebrighterside.news/space/scientists-discover-massive-underwater-crater-that-is-3x-larger-than-the-grand-canyon", "urlToImage": "https://www.thebrighterside.news/uploads/2024/07/Screenshot-2024-07-07-110706.png?auto=webp&width=2000&height=1096", "publishedAt": "2025-02-12T00:37:00Z", "content": "About 35 million years ago, an asteroid struck the ocean off the East Coast of North America, leaving behind a massive impact crater now buried beneath the Chesapeake Bay. \r\nThe collision unleashed d… [+6246 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Volcanoes Could Reveal Where to Dig Minerals For Future Energy Technology - ScienceAlert", "description": "About 400 kilometres northwest of Sydney, just south of Dubbo, lies a large and interesting body of rock formed around 215 million years ago by erupting volcanoes.", "url": "https://www.sciencealert.com/volcanoes-could-reveal-where-to-dig-minerals-for-future-energy-technology", "urlToImage": "https://www.sciencealert.com/images/2025/02/volcano_green_minerals_header.jpg", "publishedAt": "2025-02-12T00:31:39Z", "content": "About 400 kilometres northwest of Sydney, just south of Dubbo, lies a large and interesting body of rock formed around 215 million years ago by erupting volcanoes.\r\nKnown as the Toongi deposit, this … [+5454 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA picks SpaceX to launch Pandora exoplanet mission - Space.com", "description": "Pandora will lift off atop a SpaceX Falcon 9 rocket, as so many other satellites have.", "url": "https://www.space.com/the-universe/exoplanets/nasa-picks-spacex-to-launch-pandora-exoplanet-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uYySDaERvtHkJ4SLmDcUZN-1200-80.jpg", "publishedAt": "2025-02-11T22:00:00Z", "content": "A small NASA exoplanet probe now has a ride to Earth orbit.\r\nThe agency announced on Monday afternoon (Feb. 10) that it has picked SpaceX to launch Pandora, a 716-pound (325-kilogram) satellite desig… [+2066 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Gut Microbiome Regulates Brain Signals Through the Vagus Nerve - Neuroscience News", "description": "New research provides direct evidence that the gut microbiome communicates with the brain through the vagus nerve.", "url": "https://neurosciencenews.com/gut-microbiome-vagus-nerve-28413/", "urlToImage": "https://neurosciencenews.com/files/2025/02/vagus-nerve-gut-brain-neuroscience.jpg", "publishedAt": "2025-02-11T21:52:28Z", "content": "Summary: New research provides direct evidence that the gut microbiome communicates with the brain through the vagus nerve. Using germ-free mice, scientists observed significantly reduced vagal nerve… [+4924 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Amber Rose", "title": "From photons to protons: Team makes breakthrough in high-energy particle detection - Phys.org", "description": "Particle detectors play a crucial role in our understanding of the fundamental building blocks of the universe. They allow scientists to study the behavior and properties of the particles produced in high-energy collisions. Such particles are boosted to near …", "url": "https://phys.org/news/2025-02-photons-protons-team-breakthrough-high.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/from-photons-to-proton.jpg", "publishedAt": "2025-02-11T21:45:04Z", "content": "Particle detectors play a crucial role in our understanding of the fundamental building blocks of the universe. They allow scientists to study the behavior and properties of the particles produced in… [+5687 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Arianespace plans five Ariane 6 launches in 2025, primarily in the second half of the year - SpaceNews", "description": "As Arianespace prepares for its first commercial Ariane 6 launch, it is projecting a manifest for the vehicle backloaded to the second half of the year.", "url": "http://spacenews.com/arianespace-plans-five-ariane-6-launches-in-2025-primarily-in-the-second-half-of-the-year/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcL2FyaWFuZTYtdmEyNjMtcHJlcHMtMTAyNHg2ODIuanBlZyIsInR4dCI6IkFyaWFuZXNwYWNlIHBsYW5zIGZpdmUgQXJpYW5lIDYgbGF1bmNoZXMgaW4gMjAyNSwgcHJpbWFyaWx5IGluIHRoZSBzZWNvbmQgaGFsZiBvZiB0aGUgeWVhciIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.9ZZP5TgbG7O5RJlA2CXu1o6M6PD7TUwE3JHvwWxjynAMQ", "publishedAt": "2025-02-11T21:40:51Z", "content": "WASHINGTON As Arianespace prepares for its first commercial Ariane 6 launch, the company is projecting a manifest for the vehicle backloaded to the second half of the year.\r\nArianespace is working to… [+3275 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earthquakes at massive Alaska volcano Mount Spurr ramp up again — and there's now a 50-50 chance of an eruption - Livescience.com", "description": "Ten months of unrest at Mount Spurr could be a sign of an upcoming eruption from a side vent or, less likely, from the main crater.", "url": "https://www.livescience.com/planet-earth/volcanos/earthquakes-at-massive-alaska-volcano-mount-spurr-ramp-up-again-and-theres-now-a-50-50-chance-of-an-eruption", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yB8GXQ4v32f87pKKSfY5xc-1200-80.jpg", "publishedAt": "2025-02-11T17:31:39Z", "content": "A volcano in Alaska could be primed to erupt, which would likely send avalanches of hot ash and mud cascading down the mountain's slopes.\r\nMount Spurr, a snow-covered stratovolcano that sits 77 miles… [+3443 chars]"}]}