{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Invisible barrier discovered in the ocean that jellyfish won’t cross - Earth.com", "description": "The way Botrynema jellyfish is distributed across the ocean may reveal a previously unknown biogeographic barrier in the North Atlantic.", "url": "https://www.earth.com/news/invisible-barrier-discovered-in-the-ocean-that-jellyfish-botrynema-wont-cross/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/29135956/jellyfish_Botrynema-brucei_NOAA_1m.jpg", "publishedAt": "2025-11-29T23:15:00Z", "content": "Life in the deep ocean often sorts into hidden zones shaped by temperature, salt, and moving water. Many animals, like Botrynema jellyfish, stay within a narrow band of conditions, almost like having… [+7359 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Simon Alvarez", "title": "SpaceX’s Starship FL launch site will witness scenes once reserved for sci-fi films - Teslarati", "description": "A Starship that launches from the Florida site could touch down on the same site years later.", "url": "https://www.teslarati.com/spacex-starship-fl-launch-site-witness-scenes-sci-fi-films/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2025/08/starship-flight-10-stacking-1000x600.jpeg", "publishedAt": "2025-11-29T21:06:42Z", "content": "Elon Musk has proposed a high-profile gaming challenge for xAIs upcoming Grok 5. As per Musk, it would be interesting to see if the large language model could beat the world best human League of Lege… [+5406 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Watch live as near-Earth asteroid Eros buzzes the Andromeda Galaxy on Nov. 30 (video) - Space", "description": "Eros will pass within 2 degrees of the Andromeda Galaxy's core on Nov. 30.", "url": "https://www.space.com/stargazing/watch-live-as-near-earth-asteroid-eros-buzzes-the-andromeda-galaxy-on-nov-30-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xAwK3yiZEkcFM8Ps6PUZp8-1884-80.jpg", "publishedAt": "2025-11-29T17:00:00Z", "content": "(Image credit: Amazon)\r\nThe Celestron NexStar 8SE is a great choice for exploring distant solar system objects and you can currently get it for $200 off during the Black Friday sales! Check out our B… [+2697 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "Scientists Unearthed an Enormous Shark Fossil That Dominated Oceans in Dinosaur Times - The Daily Galaxy", "description": "Scientists have uncovered a fossil of a massive shark that ruled the oceans during the time of the dinosaurs.", "url": "https://dailygalaxy.com/2025/11/scientists-find-fossil-giant-shark/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Scientists-Unearthed-an-Enormous-Shark-Fossil-That-Dominated-Oceans-in-Dinosaur-Times-scaled.jpg", "publishedAt": "2025-11-29T15:15:00Z", "content": "Around 115 million years ago, the waters off northern Australia were home to a giant shark that totally flips what we thought we knew about ancient ocean predators. Recent fossil discoveries show tha… [+2733 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": "Ashley Fike", "title": "The Universe Might Just Go Dark Forever, Scientists Say - vice.com", "description": "People love an apocalyptic spectacle. Meteor showers, collapsing stars, something dramatic enough to justify every disaster movie ever made.", "url": "http://www.vice.com/en/article/the-universe-might-just-go-dark-forever-scientists-say/", "urlToImage": "https://www.vice.com/wp-content/uploads/sites/2/2025/11/The-Universe-Might-Just-Go-Dark-Forever-Scientists-Say.jpg?resize=2000,1028", "publishedAt": "2025-11-29T14:35:45Z", "content": "People love an apocalyptic spectacle. Meteor showers, collapsing stars, something dramatic enough to justify every disaster movie ever made. The real long-term cosmic forecast is stranger, slower, an… [+2360 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "Asteroid loaded with amino acids offers new clues about the origin of life on Earth - Phys.org", "description": "One of the most elegant theories about the origins of life on our planet is that it was kick-started by a delivery from outer space. This idea suggests that prebiotic molecules—the building blocks of life—were transported here by asteroids or other celestial …", "url": "https://phys.org/news/2025-11-asteroid-amino-acids-clues-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/asteroid-loaded-with-a.jpg", "publishedAt": "2025-11-29T14:30:01Z", "content": "One of the most elegant theories about the origins of life on our planet is that it was kick-started by a delivery from outer space. This idea suggests that prebiotic moleculesthe building blocks of … [+3417 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists may have found dark matter after 100 years of searching - ScienceDaily", "description": "Nearly a century after astronomers first proposed dark matter to explain the strange motions of galaxies, scientists may finally be catching a glimpse of it. A University of Tokyo researcher analyzing new data from NASA’s Fermi Gamma-ray Space Telescope has d…", "url": "https://www.sciencedaily.com/releases/2025/11/251129053349.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/astrophysics-dark-matter-particle-mystery.webp", "publishedAt": "2025-11-29T14:22:53Z", "content": "In the early 1930s, Swiss astronomer Fritz Zwicky noticed that many galaxies were moving far faster than their visible mass should permit. This unusual motion led him to propose that some kind of inv… [+3747 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "Probing the quantum nature of black holes through entropy - Phys.org", "description": "In a study published in Physical Review Letters, physicists have demonstrated that black holes satisfy the third law of thermodynamics, which states that entropy remains positive and vanishes at extremely low temperatures, just like ordinary quantum systems. …", "url": "https://phys.org/news/2025-11-probing-quantum-nature-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/probing-the-quantum-na.jpg", "publishedAt": "2025-11-29T13:20:03Z", "content": "In a study published in Physical Review Letters, physicists have demonstrated that black holes satisfy the third law of thermodynamics, which states that entropy remains positive and vanishes at extr… [+8646 chars]"}, {"source": {"id": null, "name": "International Business Times UK"}, "author": "Briane Nebria", "title": "3I/ATLAS Update: Harvard's Avi Loeb Warns Comet's Luminosity Resembles Controlled Emission Pattern - International Business Times UK", "description": "The interstellar object 3I/ATLAS defies comet science with an anti-tail, stable core, and anomalous acceleration. Harvard's Avi Loeb suggests a controlled emission pattern. Get the forensic details...", "url": "https://www.ibtimes.co.uk/3i-atlas-update-harvards-avi-loeb-warns-comets-luminosity-resembles-controlled-emission-pattern-1758925", "urlToImage": "https://d.ibtimes.co.uk/en/full/1763807/3i-atlas-comet.jpg", "publishedAt": "2025-11-29T13:00:00Z", "content": "Forget everything you know about comets. A new, high-resolution image of the interstellar object 3I/ATLAS, captured on Nov. 28, 2025, from a powerful telescope in Utah, presents a forensic snapshot t… [+6509 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Science news this week: An enigmatic human relative, dark matter discovery and mysterious lights in the sky during nuclear weapons tests - Live Science", "description": "Nov. 29, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/health/science-news-this-week-an-enigmatic-human-relative-dark-matter-discovery-and-mysterious-lights-in-the-sky-during-nuclear-weapons-tests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BWaQZUCL92xS2rpUxtcFBi-1600-80.jpg", "publishedAt": "2025-11-29T12:00:00Z", "content": "This week’s biggest science news took us on a journey through human prehistory, with the discovery that the mysterious, 3.4 million-year-old \"Burtele foot\" in Ethiopia may have belonged to an enigmat… [+7097 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Baikonur pad damaged in Soyuz launch to ISS - SpaceNews", "description": "The Baiknour pad used for the launch of the latest crew to the ISS has sustained damage, raising questions about its ability to support upcoming missions.", "url": "http://spacenews.com/baikonur-pad-damaged-in-soyuz-launch-to-iss/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/11/54953022444_8e0647b78d_k.jpg", "publishedAt": "2025-11-29T09:15:54Z", "content": "BERLIN The Baiknour pad used for the launch of the latest crew to the International Space Station has sustained damage, raising questions about its ability to support upcoming missions to the station… [+2266 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI World Desk", "title": "‘Miniature-lightning’ detected on Mars: Nasa rover makes rare discovery— new study explains - The Times of India", "description": "Science News: NASA's Perseverance rover has detected 'mini-lightning' on Mars for the first time, capturing faint crackles from dust-driven electrical discharges du", "url": "https://timesofindia.indiatimes.com/science/miniature-lightning-detected-on-mars-nasa-rover-makes-rare-discovery-new-study-explains/articleshow/125652698.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-125652799,width-1070,height-580,imgsize-1567515,resizemode-75,overlay-toi_sw,pt-32,y_pad-500/photo.jpg", "publishedAt": "2025-11-29T06:55:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Create 7 Remarkable New Ceramic Materials by Simply Removing Oxygen - SciTechDaily", "description": "Penn State scientists discovered seven new ceramics by simply removing oxygen—opening a path to materials once beyond reach. Sometimes, less truly is more. By removing oxygen during the synthesis process, a team of materials scientists at Penn State successfu…", "url": "https://scitechdaily.com/scientists-create-7-remarkable-new-ceramic-materials-by-simply-removing-oxygen/", "urlToImage": "https://scitechdaily.com/images/Three-Newly-Synthesized-High-Entropy-Oxide-Ceramic-Pellets.jpg", "publishedAt": "2025-11-28T23:20:25Z", "content": "Three of the seven newly synthesized high-entropy oxide ceramic pellets are pictured here. Credit: David Kubarek/Penn State\r\nPenn State scientists discovered seven new ceramics by simply removing oxy… [+6596 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Morgan Underwood", "title": "Beyond the habitable zone: Exoplanet atmospheres are the next clue to finding life on planets orbiting distant stars - Space", "description": "But being in this sweet spot doesn't automatically mean a planet is hospitable to life.", "url": "https://theconversation.com/beyond-the-habitable-zone-exoplanet-atmospheres-are-the-next-clue-to-finding-life-on-planets-orbiting-distant-stars-267498", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yrqfMcZuxgPgQBUAT3G6FQ-1280-80.jpg", "publishedAt": "2025-11-28T23:00:00Z", "content": "This article was originally published at The Conversation.\r\n The publication contributed the article to Space.com's Expert Voices: Op-Ed &amp; Insights\r\n. \r\nWhen astronomers search for planets that c… [+7778 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA probe captures stunning photos of Earth and moon on the way to infamous asteroid Apophis - Space", "description": "These images mark an early milestone in the mission, confirming that OSIRIS-APEX is healthy and on course for its 2029 encounter with Apophis.", "url": "https://www.space.com/astronomy/asteroids/nasa-probe-captures-stunning-photos-of-earth-and-moon-on-the-way-to-infamous-asteroid-apophis", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S9HwEbiVVN9ec3evi5Qsqb-1536-80.jpg", "publishedAt": "2025-11-28T22:00:00Z", "content": "NASA's OSIRIS-APEX spacecraft captured stunning new images of Earth recently as it whipped past the planet during a high-speed slingshot maneuver, sending the probe on a fast track toward the famous … [+3217 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kimberley Lane, Jase Parnell-Brookes", "title": "World's smallest image-stabilized binoculars now cheaper for Black Friday - Live Science", "description": "The Nikon 12x25 S image-stabilized binoculars may be small and compact, but they provide shake-free views of wildlife and the night sky that fit in your pocket.", "url": "https://www.livescience.com/technology/these-tiny-image-stabilized-binoculars-are-great-for-wildlife-and-theyre-on-sale-for-black-friday", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R9mhrfcKHixTcN979xnX9g-2133-80.jpg", "publishedAt": "2025-11-28T19:34:41Z", "content": "The best image-stabilized binoculars are typically pretty massive and heavy, but these Nikon 12x25 S IS binos change the game completely. They're currently $62 cheaper at Newegg than on Amazon.\r\nNiko… [+2029 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "AI-Guided Robot Plants ‘Baby Corals’ Across the Great Barrier Reef - Good News Network", "description": "A robotic assistant called the Deployment Guidance System (DGS) scans the seafloor and determines the best place for a coral to spawn.", "url": "https://www.goodnewsnetwork.org/ai-guided-robot-plants-baby-corals-across-the-great-barrier-reef/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/11/Coral-on-the-Great-Barrier-Reef-Toby-Hudson-CC-3.0.jpg", "publishedAt": "2025-11-28T19:30:53Z", "content": "Coral on the Great Barrier Reef – Toby Hudson CC 3.0.\r\nAt the Australian Institute of Marine Science, artificial intelligence is being leveraged to help restore coral reefs after recent bleaching eve… [+2421 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "Dark matter-dark energy interaction shapes cosmic halo spin and alignment, simulations show - Phys.org", "description": "A cosmological simulation study by researchers from the Shanghai Astronomical Observatory of the Chinese Academy of Sciences has systematically revealed, for the first time, how the interaction between dark matter and dark energy significantly influences the …", "url": "https://phys.org/news/2025-11-dark-energy-interaction-cosmic-halo.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-study-reveals-key-3.jpg", "publishedAt": "2025-11-28T18:11:29Z", "content": "A cosmological simulation study by researchers from the Shanghai Astronomical Observatory of the Chinese Academy of Sciences has systematically revealed, for the first time, how the interaction betwe… [+4672 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Manuel Maidorn", "title": "Finding information in the randomness of living matter - Phys.org", "description": "When describing collective properties of macroscopic physical systems, microscopic fluctuations are typically averaged out, leaving a description of the typical behavior of the systems. While this simplification has its advantages, it fails to capture the imp…", "url": "https://phys.org/news/2025-11-randomness.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/finding-information-in.jpg", "publishedAt": "2025-11-28T17:40:02Z", "content": "When describing collective properties of macroscopic physical systems, microscopic fluctuations are typically averaged out, leaving a description of the typical behavior of the systems. While this si… [+2782 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Greg Basky", "title": "Tiny lead fragments in hunted meat exceed safe levels, study reveals - Phys.org", "description": "This fall, when Adam Leontowich headed to southeast Saskatchewan to hunt whitetailed deer and ruffed grouse, he once again opted for lead-free ammunition—cartridges with copper bullets for his .308 rifle and shells with steel pellets for his 12-gauge shotgun.…", "url": "https://phys.org/news/2025-11-tiny-fragments-meat-exceed-safe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-research-reveals-t-4.jpg", "publishedAt": "2025-11-28T17:23:38Z", "content": "This fall, when Adam Leontowich headed to southeast Saskatchewan to hunt whitetailed deer and ruffed grouse, he once again opted for lead-free ammunitioncartridges with copper bullets for his .308 ri… [+4655 chars]"}, {"source": {"id": null, "name": "The Denver Post"}, "author": "John Meyer", "title": "Meteor shower, super moon, lunar eclipse; Colorado’s winter night skies will blow you away - The Denver Post", "description": "Kick off you winter stargazing with the brightest super moon of 2025 on Dec. 4-5.", "url": "https://www.denverpost.com/2025/11/28/colorado-stargazing-guide/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2021/11/Great-Sand-Dunes-1.jpg?w=1024&h=576", "publishedAt": "2025-11-28T15:59:05Z", "content": "Colorado winters in the mountains are beautiful, but not every view can be seen during the day. There are times at night when the full moon illuminates a surreal snowscape, creating beautiful shapes … [+3671 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gabriele Meseg-Rutzen", "title": "Stars defy black hole by showing stable orbits around Sagittarius A* - Phys.org", "description": "An international research team led by PD Dr. Florian Peissker at the University of Cologne has used the new observation instrument ERIS (Enhanced Resolution Imager and Spectrograph) at the Very Large Telescope (VLT) facility in Chile to show that several so-c…", "url": "https://phys.org/news/2025-11-stars-defy-black-hole-stable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/stars-defy-the-black-h-1.jpg", "publishedAt": "2025-11-28T15:40:06Z", "content": "An international research team led by PD Dr. Florian Peissker at the University of Cologne has used the new observation instrument ERIS (Enhanced Resolution Imager and Spectrograph) at the Very Large… [+3453 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope watches our Milky Way galaxy's monster black hole fire out a flare - Space", "description": "\"In order to get such high sensitivity in the mid-infrared, one needs to go to space, as the atmosphere severely messes up ground-based observations at this wavelength.\"", "url": "https://www.space.com/astronomy/black-holes/james-webb-space-telescope-watches-our-milky-way-galaxys-monster-black-hole-fire-out-a-flare", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mT3zi6jXUdAw5994P3wGHo-1600-80.png", "publishedAt": "2025-11-28T15:00:00Z", "content": "Astronomers have used the James Webb Space Telescope (JWST) to observe flares from Sagittarius A*, the supermassive black hole at the heart of the Milky Way, in a new light. The new modelling of thes… [+5399 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Frozen Puppy Discovered in Siberia With a Woolly Rhino Still in Its Stomach - The Daily Galaxy", "description": "One of the last woolly rhinos was found inside the belly of a 14,000-year-old puppy.", "url": "https://dailygalaxy.com/2025/11/frozen-puppy-with-woolly-rhino-its-stomach/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/11/Frozen-Puppy-Discovered-in-Siberia…-with-a-Woolly-Rhino-Still-in-Its-Stomach-scaled.jpg", "publishedAt": "2025-11-28T14:45:00Z", "content": "A 14,000-year-old mummified puppy discovered in Siberia contained the unexpected remains of a woolly rhinoceros in its stomach. Researchers now believe the young carnivore consumed part of one of the… [+2724 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "New universal law predicts how most objects shatter, from dropped bottles to exploding bubbles - Phys.org", "description": "When a plate drops or a glass smashes, you're annoyed by the mess and the cost of replacing them. But for some physicists, the broken pieces are a source of fascination: Why does everything break into such a huge variety of sizes? Now, Emmanuel Villermaux at …", "url": "https://phys.org/news/2025-11-universal-law-shatter-bottles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/fragment.jpg", "publishedAt": "2025-11-28T14:40:02Z", "content": "When a plate drops or a glass smashes, you're annoyed by the mess and the cost of replacing them. But for some physicists, the broken pieces are a source of fascination: Why does everything break int… [+3429 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Science of the People and 3I/ATLAS - Avi Loeb – Medium", "description": "To paraphrase the Declaration of Independence in the context of science:", "url": "https://avi-loeb.medium.com/science-of-the-people-and-3i-atlas-3d528c44cb25", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*xHc5i_EUsEXrcftTpE9LJA.jpeg", "publishedAt": "2025-11-28T14:20:20Z", "content": "Image of 3I/ATLAS on November 28, 2025 from a telescope in Utah. The sunward direction is pointing towards the lower left corner. (Image credit: Roberto Colombari)\r\nTo paraphrase the Declaration of I… [+6691 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Your Cat Might Be Hiding a Planet-Killing Black Hole: Astrophysicists Just Gave This Wild Theory a Major Boost - Indian Defence Review", "description": "A radical new theory suggests invisible black holes from the dawn of time may be quietly passing through Earth—and even your body—right now. Backed by fresh research, this mind-bending idea could finally crack the mystery of dark matter and upend everything w…", "url": "https://indiandefencereview.com/your-cat-hiding-a-planet-killing-black-hole/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/11/your-cat-wont-notice-it-neither-will-you.jpg", "publishedAt": "2025-11-28T12:30:00Z", "content": "A provocative theory gaining traction in astrophysics suggests that ancient, atom-sized black holes may be quietly drifting through our planetand even through our bodieswithout leaving a trace. These… [+4723 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Biology Breakthrough: Scientists Discover First New Plant Tissue in 160 Years – and It Supercharges Crop Yields - SciTechDaily", "description": "A research group led by Dr. Ryushiro Kasahara has discovered a new plant tissue essential for seed formation, which will be named in his honor. A research team at Nagoya University in Japan has identified a previously unknown plant tissue that plays a crucial…", "url": "https://scitechdaily.com/biology-breakthrough-scientists-discover-first-new-plant-tissue-in-160-years-and-it-supercharges-crop-yields/", "urlToImage": "https://scitechdaily.com/images/Biotechnology-Green-Plant-Leaf.jpg", "publishedAt": "2025-11-28T11:55:07Z", "content": "Researchers at Nagoya University have discovered a completely new plant tissue that acts as a nutrient gateway for developing seeds, a breakthrough not seen in 160 years. Credit: Shutterstock\r\nA rese… [+5034 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Quantum sensor based on silicon carbide qubits operates at room temperature - Phys.org", "description": "Over the past decades, physicists and quantum engineers introduced a wide range of systems that perform desired functions leveraging quantum mechanical effects. These include so-called quantum sensors, devices that rely on qubits (i.e., units of quantum infor…", "url": "https://phys.org/news/2025-11-quantum-sensor-based-silicon-carbide.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-quantum-sensor-based.jpg", "publishedAt": "2025-11-28T11:30:01Z", "content": "Over the past decades, physicists and quantum engineers introduced a wide range of systems that perform desired functions leveraging quantum mechanical effects. These include so-called quantum sensor… [+7624 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Science Desk", "title": "NASA spots a mysterious red sphere hurtling through space at record speed, leaving scientists scrambling - The Times of India", "description": "Science News: NASA has discovered CWISE J1249, a mysterious red celestial object moving at over one million miles per hour through the Milky Way. This object, with", "url": "https://timesofindia.indiatimes.com/science/nasa-spots-a-mysterious-red-sphere-hurtling-through-space-at-record-speed-leaving-scientists-scrambling-for-answers/articleshow/125534970.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-125537187,width-1070,height-580,imgsize-46450,resizemode-75,overlay-toi_sw,pt-32,y_pad-500/photo.jpg", "publishedAt": "2025-11-28T11:07:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "Here are my favorite items to have near during a total solar eclipse. - Space", "description": "These are my top recommendations to get you ready for the total solar eclipse next year.", "url": "https://www.space.com/stargazing/skywatching-kit/what-you-need-to-buy-to-get-ready-for-the-2026-total-solar-eclipse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yRkg8bijpPDR6qqynHEFbA-2133-80.jpg", "publishedAt": "2025-11-28T10:00:00Z", "content": "Are you prepared for the next total solar eclipse\r\n? Now less than a year away\r\n, on August 12, 2026, a path of totality will plunge eastern Greenland, western Iceland and northern Spain into darknes… [+1974 chars]"}, {"source": {"id": null, "name": "Tom's Hardware UK"}, "author": "Jowi Morales", "title": "After nearly fifty years, Voyager 1 spacecraft approaches one light-day milestone — 25.9 billion km distance from Earth ensures one day of latency for commands - Yahoo", "description": "Voyager 1 is about to achieve a distance of one light-day from Earth as it continues on its deep space mission.", "url": "https://www.tomshardware.com/tech-industry/after-nearly-fifty-years-voyager-1-spacecraft-approaches-one-light-day-milestone-25-9-billion-km-distance-from-earth-ensures-one-day-of-latency-for-commands", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2nyRfzUtKUnsQSKZRalaug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/toms_hardware_319/3d6f411d522bf390f66f5e6f112847b7", "publishedAt": "2025-11-28T10:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nVoyager 1, the farthest human-made object from Earth, is about to hit one light-day distance fr… [+2165 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Earth from Space: Eye of the Sahara - European Space Agency", "description": "The Copernicus Sentinel-2 mission captures a spectacular geological wonder in the Sahara Desert of Mauritania: the Richat Structure.", "url": "https://www.esa.int/ESA_Multimedia/Images/2025/11/Earth_from_Space_Eye_of_the_Sahara", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/11/earth_from_space_eye_of_the_sahara/26998095-1-eng-GB/Earth_from_Space_Eye_of_the_Sahara_pillars.jpg", "publishedAt": "2025-11-28T09:09:49Z", "content": null}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "What’s in a kiss? 21 million years of evolution : Short Wave - NPR", "description": "How far back in evolutionary history does kissing go? Through phylogenetic analysis, an international team of scientists found that kissing was likely present in the ancestor of all apes – which lived 21 million years ago. Not only that: They were definitely …", "url": "https://www.npr.org/2025/11/28/nx-s1-5620985/human-kiss-neanderthal-evolution-family-tree", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F9c%2F2a9d3da149c3a26985102233c314%2F67890955-c0f0-412a-9d38-e116669f5769.jpg", "publishedAt": "2025-11-28T08:00:00Z", "content": "How far back in evolutionary history does kissing go?\r\nThrough phylogenetic analysis, an international team of scientists found that kissing was likely present in the ancestor of all apes which lived… [+1856 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify the Evolutionary “Purpose” of Consciousness - SciTechDaily", "description": "Summary: Researchers at Ruhr University Bochum explore why consciousness evolved and why different species developed it in distinct ways. By comparing humans with birds, they show that complex awareness may arise through different neural architectures yet ser…", "url": "https://scitechdaily.com/scientists-identify-the-evolutionary-purpose-of-consciousness/", "urlToImage": "https://scitechdaily.com/images/Extreme-Eye-Close-Up.jpg", "publishedAt": "2025-11-28T02:46:39Z", "content": "Shutterstock\r\nSummary: Researchers at Ruhr University Bochum explore why consciousness evolved and why different species developed it in distinct ways. By comparing humans with birds, they show that … [+6825 chars]"}]}