{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Top predators in prehistoric oceans would have eaten killer whales as snacks - Earth.com", "description": "Scientists discovered ancient marine reptiles that reached unprecedented trophic levels. These creatures exceeded today’s top predators.", "url": "https://www.earth.com/news/prehistoric-marine-reptiles-would-have-eaten-killer-whales-as-snacks/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/15181436/ancient-marine-reptiles_plesiosaurs-Elasmosaurus_1m.jpg", "publishedAt": "2025-01-16T01:22:48Z", "content": "Scientists have pieced together evidence that ancient marine reptiles once swam in what is now central Colombia, and these creatures appear to have been more formidable predators than todays mighty k… [+5217 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "This May Be The Best Photo Ever Taken From The International Space Station - IFLScience", "description": "We are in awe at what astronaut Don Pettit has been able to capture from space.", "url": "https://www.iflscience.com/this-may-be-the-best-photo-ever-taken-from-the-international-space-station-77638", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77638/aImg/81476/petitt-meta.jpg", "publishedAt": "2025-01-16T00:13:16Z", "content": "Astronaut Don Pettit has taken one of the most incredible astrophotography pictures ever, and possibly the best taken by humans from the International Space Station (ISS). The latest composition is a… [+2218 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Person Adopts a ‘Normal’ Kitten, but Gets a Huge Surprise as It Grows - The Daily Galaxy --Great Discoveries Channel", "description": "When a pet lover took in a tiny kitten, they thought they were giving a home to a typical feline in need. But as the weeks turned into months, the kitten grew—and grew—and kept growing. What started as an act of kindness turned into an unexpected adventure fu…", "url": "https://dailygalaxy.com/2025/01/normal-kitten-huge-surprise-as-it-grows/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Person-Adopts-a-‘Normal-Kitten-but-Gets-a-Huge-Surprise-as-It-Grows.jpg", "publishedAt": "2025-01-15T22:53:06Z", "content": "A casual scroll through Facebook turned into a life-changing moment for one unsuspecting animal lover. Among the posts, they stumbled upon an adoption listing for a tiny, scrappy kitten. Described as… [+5383 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "California Institute of Technology", "title": "Signatures of ice-free ancient ponds and lakes found on Mars - Phys.org", "description": "Researchers have discovered two sets of ancient wave ripples on Mars, signatures of long-dried bodies of water preserved in the rock record. Wave ripples are small undulations in the sandy shores of lakebeds, created as wind-driven water laps back and forth. …", "url": "https://phys.org/news/2025-01-signatures-ice-free-ancient-ponds.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/signatures-of-ice-free.jpg", "publishedAt": "2025-01-15T20:57:03Z", "content": "Researchers have discovered two sets of ancient wave ripples on Mars, signatures of long-dried bodies of water preserved in the rock record. Wave ripples are small undulations in the sandy shores of … [+3667 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Chernobyl’s Stray Dogs Are Genetically Distinct—But Radiation Isn’t the Reason - Gizmodo", "description": "Dogs living near the Chernobyl nuclear plant aren’t radioactive mutants—but their genetic differences reveal a surprising story.", "url": "https://gizmodo.com/chernobyls-stray-dogs-are-genetically-distinct-but-radiation-isnt-the-reason-2000550665", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/Chornobyl-dogs.jpg", "publishedAt": "2025-01-15T20:55:17Z", "content": "In 1986, the Chernobyl nuclear reactor in the Soviet Union, now in Ukraine, exploded, spewing massive amounts of radioactive material into the environment. Almost four decades later, the stray dogs t… [+4243 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Vanessa Thomas", "title": "NASA Solar Observatory sees coronal loops flicker before big flares - Phys.org", "description": "For decades, scientists have tried in vain to accurately predict solar flares—intense bursts of light on the sun that can send a flurry of charged particles into the solar system. Now, using NASA's Solar Dynamics Observatory, one team has identified flickerin…", "url": "https://phys.org/news/2025-01-nasa-solar-observatory-coronal-loops.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/nasa-solar-observatory.jpg", "publishedAt": "2025-01-15T20:46:27Z", "content": "For decades, scientists have tried in vain to accurately predict solar flaresintense bursts of light on the sun that can send a flurry of charged particles into the solar system. Now, using NASA's So… [+4517 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Record broken in Antarctica: European researchers have extracted ice over a million years old - The Daily Galaxy --Great Discoveries Channel", "description": "European scientists have just uncovered ice over 1.2 million years old from Antarctica, revealing secrets of our planet's ancient climate. What could this groundbreaking discovery mean for our understanding of today’s climate challenges?", "url": "https://dailygalaxy.com/2025/01/european-researchers-dig-up-earths-oldest-ice-what-secrets-does-it-hold/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/ancient20ice-climate20research-frC3A9dC3A9ric20parrenin.jpeg", "publishedAt": "2025-01-15T20:30:00Z", "content": "In a jaw-dropping feat, European scientists have pulled off something incredible: they’ve managed to extract ice that’s more than 1.2 million years old from the Antarctic ice sheet. This smashes the … [+3043 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "The 7 best total solar eclipses of the next 10 years - Space.com", "description": "Here are the next seven total solar eclipses across the world, from Alaska to Australia.", "url": "https://www.space.com/stargazing/eclipses/top-solar-eclipses-next-decade", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mM45jXAvWbMrb26oqa9gtS-1200-80.jpg", "publishedAt": "2025-01-15T19:23:35Z", "content": "Eclipse-watchers have plenty to look forward to in the next decade.\r\nOver the next ten years, Earth\r\n will experience seven total solar eclipses that will see skywatchers in Australia, Egypt, Spain a… [+8022 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Hubble Telescope sees rare supernova explosion as a violent 'pale blue dot' (image) - Space.com", "description": "Hubble captured an exploding star about 650 million light-years from Earth.", "url": "https://www.space.com/space-exploration/hubble-space-telescope/hubble-telescope-sees-rare-supernova-explosion-as-a-violent-pale-blue-dot-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SGFjqJiDWEjFg3ikp5QQE6-1200-80.jpg", "publishedAt": "2025-01-15T19:00:00Z", "content": "The Hubble Space Telescope recently captured a snapshot of a rare supernova that sits in the Gemini constellation, about 650 million light-years away from Earth.\r\nA newly released Hubble\r\n pic shows … [+2565 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Legendary Gaia Spacecraft Maps Entire Galaxy, Promptly Retires - Gizmodo", "description": "The intrepid mapping mission has collected more than three trillion observations that'll change the way we see our neck of the cosmic woods.", "url": "https://gizmodo.com/legendary-gaia-spacecraft-maps-entire-galaxy-promptly-retires-2000550606", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/milky-way-map-gaia-illustration.jpg", "publishedAt": "2025-01-15T18:56:30Z", "content": "The European Space Agency’s Gaia mission has completed one of its major charges: delivering a map of the Milky Way galaxy, comprised of trillions of observations taken over a 10-year space.\r\nBetween … [+3335 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain Uses Place Cells to Anchor Episodic Memories - Neuroscience News", "description": "Researchers have developed a model explaining how place cells in the hippocampus anchor both spatial and episodic memories.", "url": "https://neurosciencenews.com/place-ceels-episodic-memory-28359/", "urlToImage": "https://neurosciencenews.com/files/2025/01/place-cells-episodic-memory-neurosience.jpg", "publishedAt": "2025-01-15T18:21:25Z", "content": "Summary: Researchers have developed a model explaining how place cells in the hippocampus anchor both spatial and episodic memories. Grid cells in the entorhinal cortex interact with hippocampal cell… [+10666 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jaron Schneider", "title": "Sound of Meteorite Striking Earth Captured for First Time by Ring Camera - PetaPixel", "description": "For the first time, a Ring doorbell camera has captured the sight and sound of a meteorite crashing to Earth.", "url": "https://petapixel.com/2025/01/15/sound-of-a-meteorite-striking-the-ground-has-been-captured-for-the-first-time/", "urlToImage": "https://petapixel.com/assets/uploads/2025/01/meteorite-strike-feat.jpg", "publishedAt": "2025-01-15T17:46:01Z", "content": "Photo by Joe Velaidum courtesy of Compass Media\r\nFor the first time, a Ring doorbell camera has captured the sight and sound of a meteorite crashing to Earth.\r\nPrince Edward Island, Canada resident J… [+3200 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Manisha Caleb, Yu Wing Joshua Lee", "title": "Blinking radio pulses from space hint at a cosmic object that 'shouldn't exist' - Phys.org", "description": "When some of the biggest stars reach the end of their lives, they explode in spectacular supernovas and leave behind incredibly dense cores called neutron stars. Some of these remnants emit powerful radio beams from their magnetic poles.", "url": "https://phys.org/news/2025-01-radio-pulses-space-hint-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/blinking-radio-pulses-1.jpg", "publishedAt": "2025-01-15T17:45:45Z", "content": "When some of the biggest stars reach the end of their lives, they explode in spectacular supernovas and leave behind incredibly dense cores called neutron stars. Some of these remnants emit powerful … [+5849 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Woods Hole Oceanographic Institution", "title": "Critical ocean current has not declined in the last 60 years, AMOC study finds - Phys.org", "description": "Earth, being 71% covered in water, is influenced by the ocean and its movements. In the Atlantic Ocean, a system of connected currents, called the Atlantic Meridional Overturning Circulation (AMOC), moves water throughout the world's oceans powered by a combi…", "url": "https://phys.org/news/2025-01-critical-ocean-current-declined-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-study-finds-that-c.jpg", "publishedAt": "2025-01-15T17:00:45Z", "content": "Earth, being 71% covered in water, is influenced by the ocean and its movements. In the Atlantic Ocean, a system of connected currents, called the Atlantic Meridional Overturning Circulation (AMOC), … [+4885 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "'Warm water' from deep sea flowing towards one of Antarctica's largest ice shelves - Livescience.com", "description": "Antarctica's Filchner-Ronne Ice Shelf may be under threat due to relatively warm water from the deep sea flowing towards the shelf. Is climate change to blame?", "url": "https://www.livescience.com/planet-earth/antarctica/warm-water-from-deep-sea-flowing-towards-one-of-antarcticas-largest-ice-shelves", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4tKgycu3GuRLfCEVFtzaR3-1200-80.jpg", "publishedAt": "2025-01-15T16:48:40Z", "content": "\"Warm\" water is flowing toward one of Antarctica\r\n's biggest ice shelves, which, if it melted, could dramatically raise sea levels\r\n.\r\nThe Filchner-Ronne Ice Shelf (FRIS) extends over the Weddell Sea… [+3813 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Ingrid Fadelli", "title": "DNA methylation mediates the link between childhood adversity and depression, study suggests - Medical Xpress", "description": "Past psychology research suggests that there is a strong relationship between difficult experiences during childhood and the development of depressive symptoms. In fact, statistics suggest that adverse experiences during childhood can double the risk of being…", "url": "https://medicalxpress.com/news/2025-01-dna-methylation-link-childhood-adversity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-finds-that-dna-m-2.jpg", "publishedAt": "2025-01-15T16:30:02Z", "content": "Past psychology research suggests that there is a strong relationship between difficult experiences during childhood and the development of depressive symptoms. In fact, statistics suggest that adver… [+5908 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Ameya Paleja", "title": "World-first quantum entanglement of molecules at 92% fidelity, UK achieves ‘magic’ - Interesting Engineering", "description": "UK researchers used special optical tweezers to attain quantum entanglement of molecules that could unlock multiple applications in quantum computing.", "url": "https://interestingengineering.com/science/quantum-entanglement-molecules-optical-tweezers", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/01/IE-Photo-31-1.jpg", "publishedAt": "2025-01-15T16:00:00Z", "content": "However, to achieve this, the research team needed to create a stable environment that supports the coherence of molecules over extended periods. \r\nThe Tweezer Team at Durham University and their exp… [+1155 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Supermassive black hole spotted 12.9 billion light-years from Earth — and it's shooting a beam of energy right at us - Livescience.com", "description": "The newly discovered \"blazar,\" which has a mass equal to 700 million suns, is the oldest of its kind ever seen and changes what we know about the early universe.", "url": "https://www.livescience.com/space/black-holes/supermassive-black-hole-spotted-12-9-billion-light-years-from-earth-and-its-shooting-a-beam-of-energy-right-at-us", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Exp5kRdGVFfzaR7QNmBWrk-1200-80.jpg", "publishedAt": "2025-01-15T15:22:19Z", "content": "Astronomers have discovered a supermassive black hole that's shooting a giant energy beam directly at Earth. The cosmic juggernaut, which is about as massive as 700 million suns, is taking aim at us … [+3989 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Celebrates Edwin Hubble’s Discovery of a New Universe - Science@NASA", "description": "For humans, the most important star in the universe is our Sun. The second-most important star is nestled inside the Andromeda galaxy. Don’t go looking for it — the flickering star is 2.2 million light-years away, and is 1/100,000th the brightness of the fain…", "url": "https://science.nasa.gov/missions/hubble/nasa-celebrates-edwin-hubbles-discovery-of-a-new-universe/", "urlToImage": "https://science.nasa.gov/wp-content/uploads/2023/04/stsci-prc11-15a-jpg.webp?w=1024", "publishedAt": "2025-01-15T15:19:51Z", "content": "The seemingly inauspicious star, simply named V1, flung open a Pandora's box full of mysteries about time and space that are still challenging astronomers today. Using the largest telescope in the wo… [+458 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Saturn disappears behind the moon in stunning telescope photo - Space.com", "description": "The moon and Saturn were basically engaged in a cosmic game of peek-a-boo.", "url": "https://www.space.com/stargazing/saturn-disappears-behind-the-moon-in-stunning-telescope-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vCvqbf4eS3vzMnX6pZXhtR-1200-80.jpg", "publishedAt": "2025-01-15T15:00:00Z", "content": "A stunning new photo captures the moon and Saturn engaged in a cosmic game of peek-a-boo.\r\nOn Jan. 4, Saturn briefly hid behind the crescent moon, escaping the view of skywatchers in Europe, Africa, … [+3612 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Katja Henßel", "title": "Paleontologists discover a new species of North African predatory dinosaur in archived images - Phys.org", "description": "SNSB and LMU Paleontologists have identified a new species of predatory dinosaur from the Cretaceous period in North Africa, about 95 million years old. What makes this discovery so special is that the original fossil from Egypt was completely destroyed 80 ye…", "url": "https://phys.org/news/2025-01-paleontologists-species-north-african-predatory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/munich-paleontologists.jpg", "publishedAt": "2025-01-15T14:49:59Z", "content": "SNSB and LMU Paleontologists have identified a new species of predatory dinosaur from the Cretaceous period in North Africa, about 95 million years old. What makes this discovery so special is that t… [+4126 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "In Oregon, a giant 300-foot smiley face greets traffic every fall - ZME Science", "description": "Every fall, a hillside in Oregon flashes a giant, yellow smiley face of trees.", "url": "https://www.zmescience.com/science/news-science/in-oregon-a-giant-300-foot-smiley-face-greets-traffic-every-fall/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/01/smiley-face-oregon.jpg", "publishedAt": "2025-01-15T14:41:46Z", "content": "Credit: The Oregonian.\r\nDriving along Oregon 18 in the fall, near mile-marker 25, travelers might catch an unexpected sight: a smiley face in the trees. Nestled between the towns of Grand Ronde and W… [+2273 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Webb captures the light echoes of an exploding star - Earth.com", "description": "NASA’s James Webb Space Telescope has revealed new details about interstellar dust and gas using infrared light echoes from a supernova.", "url": "https://www.earth.com/news/webb-captures-the-light-echoes-of-an-exploding-star/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/15071020/Light-echo.jpg", "publishedAt": "2025-01-15T14:29:33Z", "content": "Many decades ago, a massive star collapsed. A shockwave erupted, tearing the star apart. As this shockwave hit the stars surface, it created a burst of intense X-rays, ultraviolet light, and a powerf… [+4685 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "Scientists discover enormous reservoir hidden in Cascades — more than twice the amount of water in Lake Mead - Livescience.com", "description": "An enormous water reservoir — likely the largest aquifer of its kind in on Earth — sits inside the volcanic rocks of the Oregon Cascades, scientists have revealed.", "url": "https://www.livescience.com/planet-earth/volcanos/scientists-discover-enormous-reservoir-hidden-in-cascades-more-than-twice-the-amount-of-water-in-lake-mead", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v6anndy47EjZrxYoqGzkM5-1200-80.jpg", "publishedAt": "2025-01-15T13:36:04Z", "content": "A hidden reservoir of groundwater more than twice the size of Lake Mead is buried inside the Oregon Cascades, a new study reports.\r\nScientists found that the underground aquifer holds at least 19.4 c… [+3198 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Scott Travers", "title": "3 Fascinating Reasons Why The ‘World’s Largest Living Organism’ Is Truly Larger Than Life - Forbes", "description": "While it may be defined as a single organism, Pando is anything but one—sustaining an entire world under its canopy. Here’s how it works.", "url": "https://www.forbes.com/sites/scotttravers/2025/01/15/3-fascinating-reasons-why-the-worlds-largest-living-organism-is-truly-larger-than-life/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6784f70d5795035e1fe53e5d/0x0.jpg?format=jpg&crop=733,343,x0,y85,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-15T13:30:00Z", "content": "While it may be defined as a single organism, Pando is anything but onesustaining an entire world ... [+] under its canopy. Heres how it works.\r\ngetty\r\nWhen you think of the worlds largest organism, … [+6519 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "New orchid species discovered resembles a small cupcake - Earth.com", "description": "New orchid resembling a cupcake was discovered on Norfolk Island, highlighting biodiversity and conservation.", "url": "https://www.earth.com/news/adelopetalum-argyropus-new-orchid-species-discovered-resembles-small-cupcake/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/15060743/new-orchid-species_cupcake_Adelopetalum-argyropus_credit-Heidi-Zimmer_1m.jpg", "publishedAt": "2025-01-15T13:14:26Z", "content": "Could you imagine happening upon an orchid that looks familiar but has a unique difference that makes you wonder if it is a new species? \r\nThats exactly what happened during a study at Norfolk Island… [+4271 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Strange multi-planet system proves not all hot Jupiter exoplanets are lonely giants - Space.com", "description": "\"There are still many things related to planetary formation and the early evolution of young planetary systems that we don't understand.\"", "url": "https://www.space.com/hot-Jupiter-exoplanets-not-lonely-giants-WASP-132", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nB62as5oFFUMEc6BRaVzfh-1200-80.png", "publishedAt": "2025-01-15T13:00:00Z", "content": "The discovery of an extraordinary multi-planet system has demonstrated that so-called \"hot Jupiter\" planets may not be lonely giants after all. The findings could force scientists to revise their mod… [+5143 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sandee Oster", "title": "Archaeologists reveal 8,000-year-old bone powder cooking practice in ancient China - Phys.org", "description": "A new study by archaeologist Xingtao Wei and his colleagues, published in the International Journal of Osteoarchaeology, provides insights into some of the earliest forms of humans processing bones into powder for cooking, dating back nearly 8,000 years (6,08…", "url": "https://phys.org/news/2025-01-archaeologists-reveal-year-bone-powder.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/study-reveals-8000-yea.jpg", "publishedAt": "2025-01-15T12:30:01Z", "content": "A new study by archaeologist Xingtao Wei and his colleagues, published in the International Journal of Osteoarchaeology, provides insights into some of the earliest forms of humans processing bones i… [+5719 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "12 billion light-years from Earth, NASA has discovered an immense water reservoir containing 140,000 billion times the amount of water on Earth. - farmingdale-observer.com", "description": "In a groundbreaking discovery, NASA astronomers have unveiled an immense reservoir of water vapor surrounding a distant quasar. This cosmic oasis, located a staggering 12 billion light-years from Earth, contains an astounding 140 trillion times more water tha…", "url": "https://farmingdale-observer.com/2025/01/15/12-billion-light-years-from-earth-nasa-has-discovered-an-immense-water-reservoir-containing-140-trillion-times-the-amount-of-water-on-earth/", "urlToImage": null, "publishedAt": "2025-01-15T12:22:00Z", "content": "In a groundbreaking discovery, NASA astronomers have unveiled an immense reservoir of water vapor surrounding a distant quasar. This cosmic oasis, located a staggering 12 billion light-years from Ear… [+5840 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "What's next for the 2 private landers SpaceX just launched toward the moon? - Space.com", "description": "Blue Ghost and Resilience both have long journeys ahead of them.", "url": "https://www.space.com/space-exploration/launches-spacecraft/whats-next-for-the-2-private-landers-spacex-just-launched-toward-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hf4DmgPRrDVKNGkPg7ZhwF-1200-80.jpg", "publishedAt": "2025-01-15T12:00:00Z", "content": "Two newly launched private moon landers have long roads ahead of them.\r\nEarly on Tuesday morning (Jan. 15), a SpaceX Falcon 9 rocket sent Blue Ghost and Resilience — lunar landers built by Firefly Ae… [+3634 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Scientists achieve direct experimental realization of dual-type entangling gates - Phys.org", "description": "To develop scalable and reliable quantum computers, engineers and physicists will need to devise effective strategies to mitigate errors in their quantum systems without adding complex additional components. A promising strategy to reduce errors entails the u…", "url": "https://phys.org/news/2025-01-scientists-experimental-dual-entangling-gates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-direct-experimenta.jpg", "publishedAt": "2025-01-15T11:30:01Z", "content": "To develop scalable and reliable quantum computers, engineers and physicists will need to devise effective strategies to mitigate errors in their quantum systems without adding complex additional com… [+4274 chars]"}, {"source": {"id": null, "name": "In Defence of Marxism"}, "author": "Alan Woods", "title": "What is truth? – In Defence of Marxism magazine #48 out now! - In Defence of Marxism", "description": "“What is truth?” said jesting Pilate, and would not stay for an answer.", "url": "https://marxist.com/what-is-truth.htm", "urlToImage": "https://marxist.com/images/stories/theory/2025_Jan/faust_rembrandt_Image_public_domain.jpg", "publishedAt": "2025-01-15T11:05:24Z", "content": "Issue 48 of In Defence of Marxism magazine the quarterly theoretical journal of the Revolutionary Communist International is out now! Alan Woods editorial, which we publish below, takes up the centra… [+15423 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "Chris Knight", "title": "China plans to wave its flag on the surface of the moon — literally - National Post", "description": "Chang'e 7 mission, slated to reach the moon's south pole next year, will include a flag that can flutter even in the vacuum of space.", "url": "https://nationalpost.com/news/space/china-plans-to-wave-its-flag-on-the-surface-of-the-moon-literally", "urlToImage": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/01/Screen-Shot-2025-01-14-at-3.11.24-PM-1.png", "publishedAt": "2025-01-15T11:02:31Z", "content": "Chang'e 7 mission, slated to reach the moon's south pole next year, will include a flag that can flutter even in the vacuum of space\r\nA Chinese flag, made of basalt, flies from the Chang'e 6 lander i… [+7380 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "In Photos: See Mercury’s Craters In Spectacular Close-Ups After Flyby - Forbes", "description": "The BepiColombo spacecraft has sent back three images of Mercury after a brief flyby of the planet on Jan. 8, 2025.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/01/15/in-photos-see-mercurys-craters-in-spectacular-close-ups-after-flyby/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6785a818bbdb8b256e049a03/0x0.jpg?format=jpg&crop=2000,1125,x0,y634,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-15T11:00:00Z", "content": "This image of Mercury's surface was taken by M-CAM 1 on board the Mercury Transfer Module (part of ... [+] the BepiColombo spacecraft), using an integration time of 40 milliseconds. Taken from around… [+4253 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Octopus Arms Are Controlled by a Nervous System That's Like No Other - ScienceAlert", "description": "Octopuses tend to keep secrets, but we've just learnt how they achieve their extraordinary dexterity.", "url": "https://www.sciencealert.com/octopus-arms-are-controlled-by-a-nervous-system-thats-like-no-other", "urlToImage": "https://www.sciencealert.com/images/2025/01/octopus-arms.jpg", "publishedAt": "2025-01-15T10:01:30Z", "content": "Octopuses tend to keep secrets, but we've just learnt how they achieve their extraordinary dexterity.\r\nThe fine control these almost-alien animals have over each of their eight arms is at least parti… [+4503 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "Webb telescope just solved the 'universe-breaking problem' - Mashable", "description": "\"Contrary to Headlines, Cosmology Isn’t Broken.\"", "url": "https://mashable.com/article/james-webb-space-telescope-mystery-explained", "urlToImage": "https://helios-i.mashable.com/imagery/articles/02PQ4MYLgbbn43mOjlkLehZ/hero-image.fill.size_1200x675.v1736872837.png", "publishedAt": "2025-01-15T10:00:00Z", "content": null}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2025-01-15T07:00:13Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Glacier Experts Uncover Critical Flaw in Sea-Level Rise Predictions - SciTechDaily", "description": "New research shows temperate glacier ice flows more steadily than previously thought, leading to lower projections of sea-level rise. Neal Iverson started with two lessons in ice physics when asked to describe a research paper about glacier ice flow that has …", "url": "https://scitechdaily.com/?p=449192", "urlToImage": "https://scitechdaily.com/images/Antarctica-Melting-Ice.jpg", "publishedAt": "2025-01-15T03:24:12Z", "content": "Scientists discovered that temperate glacier ice flows differently than previously thought, requiring a change in Glen’s flow law’s stress exponent from 3 or 4 to 1.0. This adjustment suggests that m… [+7054 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "44 Hidden Stars Revealed: Gravitational Lensing Unlocks the Secrets of the Dragon Arc - SciTechDaily", "description": "In an astronomical feat, using NASA's James Webb Space Telescope, a team of astronomers observed a distant galaxy, uncovering 44 individual stars 6.5 billion light-years away. This discovery, enabled by gravitational lensing, sets a new record for observing d…", "url": "https://scitechdaily.com/44-hidden-stars-revealed-gravitational-lensing-unlocks-the-secrets-of-the-dragon-arc/", "urlToImage": "https://scitechdaily.com/images/Abell-370-Galaxy-Cluster-Hubble.jpg", "publishedAt": "2025-01-15T00:51:01Z", "content": "Abell 370, a galaxy cluster located nearly 4 billion light-years away from Earth features several arcs of light, including the “Dragon Arc” (lower left of center). These arcs are caused by gravitatio… [+7678 chars]"}, {"source": {"id": null, "name": "The Pasadena Star-News"}, "author": "David Wilson", "title": "Eaton fire: At least 200 JPL employees lost their homes - The Pasadena Star-News", "description": "More than 200 employees of the Jet Propulsion Laboratory lost their homes in the Eaton fire. Here is the latest on the status of the facility.", "url": "https://www.pasadenastarnews.com/2025/01/14/eaton-fire-destroys-homes-of-more-than-200-jpl-employees/", "urlToImage": "https://www.pasadenastarnews.com/wp-content/uploads/2025/01/LDN-L-PAL-EATON-0114-05-WL.jpg?w=1024&h=682", "publishedAt": "2025-01-14T22:27:09Z", "content": "More than 200 employees of the Jet Propulsion Laboratory have lost their homes in the Eaton fire, Director Laurie Leshin confirmed on social media Tuesday, Jan. 14.\r\nThe more-than-14,000-acre Eaton f… [+3465 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Ariana Garcia", "title": "Now is the best time to see this once-in-a-lifetime comet - Chron", "description": "A guide on how to see Comet C/2024 G3 from Texas this week before it dims and disappears for the next 160,000 years.", "url": "https://www.chron.com/news/space/article/comet-texas-view-20033344.php", "urlToImage": "https://s.hdnux.com/photos/01/46/52/00/26910725/3/rawImage.jpg", "publishedAt": "2025-01-14T21:37:55Z", "content": "NASA astronaut Don Petit photographed Comet C/2024 G3 from the International Space Station. \r\nDon Pettit/NASA\r\nA once-in-a-lifetime comet just made its closest approach to the Sun, becoming visible f… [+3081 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "US Department of Energy", "title": "Neutron star measurements place limits on color superconductivity in dense quark matter - Phys.org", "description": "At extremely high densities, quarks are expected to form pairs, as electrons do in a superconductor. This high-density quark behavior is called color superconductivity. The strength of pairing inside a color superconductor is difficult to calculate, but scien…", "url": "https://phys.org/news/2025-01-neutron-star-limits-superconductivity-dense.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/neutron-star-measureme.jpg", "publishedAt": "2025-01-14T21:34:02Z", "content": "At extremely high densities, quarks are expected to form pairs, as electrons do in a superconductor. This high-density quark behavior is called color superconductivity. The strength of pairing inside… [+2488 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "Rubin Observatory aces 1st image tests, gets ready to use world's largest digital camera - Space.com", "description": "The first image represents just a fraction of the power the observatory's eventual camera will have.", "url": "https://www.space.com/the-universe/vera-rubin-observatory-aces-1st-camera-tests-in-chile-atacama-desert-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/S39oJCdWKGyqaoEzSkUT75-1200-80.jpg", "publishedAt": "2025-01-14T21:07:18Z", "content": "NATIONAL HARBOR, Md. — A giant new telescope in Chile has opened its eyes for the first time — and while the view may not be impressive to some, its scientist parents are thrilled.\r\nThe Vera C. Rubin… [+3006 chars]"}, {"source": {"id": null, "name": "Bikerumor.com"}, "author": "Ron Frazelle", "title": "Updated Wolf Tooth Components Bike Tire Pressure App 2.0 Matches More Tire Types - BikeRumor.com", "description": "The Bike Tire Pressure Calculator app powered by Wolf Tooth Components has been pumped up with a new update for the perfect tire pressure!", "url": "https://bikerumor.com/updated-wolf-tooth-components-bike-tire-pressure-app-2-0/", "urlToImage": "https://bikerumor.com/wp-content/uploads/2025/01/Wolf-Tooth-Tire-Pressure-Calulator-App-hero-jpeg.webp", "publishedAt": "2025-01-14T19:52:13Z", "content": "Techy news out of Minneapolis, Minnesota today. The free Bike Tire Pressure Calculator app powered by Wolf Tooth Components has been pumped up with a new update. The app allows cyclists of all discip… [+4801 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Discovery of the World's Deepest Blue Hole: Could This Lead to a Hidden Underwater World? - Indian Defence Review", "description": "A newly discovered blue hole has smashed depth records, plunging further into the Earth's crust than any known underwater sinkhole. This astonishing geological wonder may conceal hidden caves, tunnels, and untold ecological secrets. With advanced technology a…", "url": "https://indiandefencereview.com/discovery-of-the-worlds-deepest-blue-hole/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Discovery-of-the-Worlds-Deepest-Blue-Hole-Could-This-Lead-to-a-Hidden-Underwater-World.jpg", "publishedAt": "2025-01-14T19:17:06Z", "content": "A record-breaking blue hole has been discovered off the coast of the Yucatan Peninsula, plunging to depths that surpass any previously known sinkhole on the planet. This remarkable underwater cavern,… [+5120 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Feeding supermassive black holes are more common than thought across the universe - Space.com", "description": "\"If our eyes were able to detect X-rays, the sky would be full of dots. And every single one of those dots would be an accreting supermassive black hole.\"", "url": "https://www.space.com/Ravenously-feeding-supermassive-black-holes-hiding-early-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/k8jFzSpZAd9Z7JNzymLSPG-1200-80.png", "publishedAt": "2025-01-14T19:00:00Z", "content": "The universe could be packed with many more monstrous black holes ravenously feeding on their surrounding material than previously suspected.\r\nThat's the conclusion of a team of scientists, who theor… [+4764 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Mystery in Space: A Supermassive Black Hole Defies Cosmic Rules - Indian Defence Review", "description": "A supermassive black hole 100 million light-years away is behaving like nothing scientists have ever seen, emitting X-ray flashes at a pace that keeps accelerating. Could a spinning white dwarf be teetering on the edge of the unknown? The answers may rewrite …", "url": "https://indiandefencereview.com/supermassive-black-hole-defies-cosmic-rule/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Supermassive-black-hole-showcasing-a-dynamic-and-colorful-depiction-of-the-event-horizon-and-the-surrounding-accretion-disk.jpg", "publishedAt": "2025-01-14T17:54:14Z", "content": "Astronomers are currently grappling with a puzzling cosmic phenomenon that defies conventional understanding of black hole behavior. At the heart of this mystery is 1ES 1927+654, a supermassive black… [+5765 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Guest Author", "title": "Designing a Star Tracker for Astronaut Don Pettit to Use on the ISS - PetaPixel", "description": "RIT photography professor Ted Kinsman shares how he designed and built a star tracker for NASA astronaut Don Pettit to use on board the ISS.", "url": "https://petapixel.com/2025/01/14/designing-a-star-tracker-for-astronaut-don-pettit-to-use-on-the-iss/", "urlToImage": "https://petapixel.com/assets/uploads/2025/01/star-tracker-for-don-pettit.jpg", "publishedAt": "2025-01-14T17:42:50Z", "content": "In the spring of 2023, I received a phone call from Peter Blackberg (an old friend, RIT alumnus, and a space enthusiast) when he asked if I would join a call with NASA astronaut Don Pettit. Don wante… [+7233 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Norbert Junkes", "title": "First-ever detection of a mid-infrared flare in Sagittarius A*, the Milky Way's supermassive massive black hole - Phys.org", "description": "Using the MIRI instrument onboard the James Webb Space Telescope, an international team of scientists made the first-ever detection of a mid-IR flare from Sagittarius A*, the supermassive massive black hole at the heart of the Milky Way. In simultaneous radio…", "url": "https://phys.org/news/2025-01-mid-infrared-flare-sagittarius-milky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/first-ever-detection-o-1.jpg", "publishedAt": "2025-01-14T17:35:31Z", "content": "Using the MIRI instrument onboard the James Webb Space Telescope, an international team of scientists made the first-ever detection of a mid-IR flare from Sagittarius A*, the supermassive massive bla… [+6147 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Mars hides behind the Full Wolf Moon in gorgeous photos from around the world - Space.com", "description": "The Red Planet adorably peeks out in these stunning views of the Full Wolf Moon.", "url": "https://www.space.com/stargazing/mars-hides-behind-the-full-wolf-moon-in-gorgeous-photos-from-around-the-world", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Zcxvd8qUY4dReC9rGgJgLE-1200-80.jpg", "publishedAt": "2025-01-14T17:09:17Z", "content": "The moon performed a cosmic ballet with Mars this week.\r\nOn Monday evening (Jan. 13), the Full Wolf Moon passed in front of Mars in what's known as a lunar occultation, during which another celestial… [+5585 chars]"}, {"source": {"id": null, "name": "Housedigest.com"}, "author": "Vanessa Taylor", "title": "Lock A Gravel Driveway In Place With An Easy And Effective Solution - House Digest", "description": "Gravel driveways are inexpensive, but the pieces can easily be tracked onto your lawn. Luckily, mulch glue, or rock glue, can make gravel stay put.", "url": "https://www.housedigest.com/1757162/rock-paste-glue-driveway-gravel-place/", "urlToImage": "https://www.housedigest.com/img/gallery/lock-a-gravel-driveway-in-place-with-an-easy-and-effective-solution/l-intro-1736444896.jpg", "publishedAt": "2025-01-14T17:00:00Z", "content": "Although gravel is a great and inexpensive option for your driveway, gravel driveways come with their own drawbacks. Chief among them is the fact that gravel is notorious for getting kicked around. I… [+1009 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Luca Nardi", "title": "You Have NASA to Thank for Wireless Headphones and Vacuum Cleaners - WIRED", "description": "The space agency’s Spinoff project displays the countless everyday technologies that were spurred by space-related research.", "url": "https://www.wired.com/gallery/nasa-spinoff-space-research-technology/", "urlToImage": "https://media.wired.com/photos/677d64637aa03cca9c278fcb/191:100/w_2580,c_limit/Apollo15LunarRover.jpg", "publishedAt": "2025-01-14T16:41:25Z", "content": "Many people see space exploration as a waste of resources. Of course, there is the counterargument that scientific discoveries have intrinsic cultural value, that space-related initiatives often boos… [+510 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Mysterious spiral galaxy jet puzzles astronomers: 'At first, I thought I completely messed up' - Space.com", "description": "\"Clearly there is something interesting going on.\"", "url": "https://www.space.com/space-exploration/hubble-space-telescope/mysterious-spiral-galaxy-jet-puzzles-astronomers-at-first-i-thought-i-completely-messed-up", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ibZUVcWavZtuQD8sMuAXUC-1200-80.jpg", "publishedAt": "2025-01-14T16:00:00Z", "content": "The Hubble Space Telescope image you see above is from last year, and it showcases several galaxies that inhabit a pocket of our universe roughly 5.94 billion light-years away from us. Astronomers, h… [+4329 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Yutu-2 rover likely immobile on the moon after historic lunar far side mission - SpaceNews", "description": "HELSINKI — China’s Yutu-2 rover, part of the first ever mission to land on the far side of the moon, may have made its final tracks, NASA lunar orbiter images reveal. China launched the Chang’e-4 l…", "url": "http://spacenews.com/yutu-2-rover-likely-immobile-on-the-moon-after-historic-lunar-far-side-mission/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAxOVwvMDJcL2xhbmRlci1zbmFwcy1ZdXR1Mi0xMWphbjIwMTktRlVMTC1DTEVQLTEwMjR4NzUyLmpwZyIsInR4dCI6Ill1dHUtMiByb3ZlciBsaWtlbHkgaW1tb2JpbGUgb24gdGhlIG1vb24gYWZ0ZXIgaGlzdG9yaWMgbHVuYXIgZmFyIHNpZGUgbWlzc2lvbiIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.0ASIE2YriiKl9Ze42sSOmSGuQppkxYiRzCgDhccmkE8MQ", "publishedAt": "2025-01-14T15:44:06Z", "content": "HELSINKI Chinas Yutu-2 rover, part of the first ever mission to land on the far side of the moon, may have made its final tracks, NASA lunar orbiter images reveal.\r\nChina launched the Change-4 lander… [+4562 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "This 800-Mile-Long Science Experiment Could Prove There Are Way More Than Four Dimensions - Yahoo! Voices", "description": "With the help of shape-shifting ghost particles, ‘DUNE’ could unlock all-new physics.", "url": "https://www.popularmechanics.com/science/a63387124/neutrino-experiment-higher-dimensions/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/v6Nlsk566_CstHpAH5.1bw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/38ec610a05281e1f34db8beac6454fad", "publishedAt": "2025-01-14T15:00:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\n<ul><li>Due to go online in 2028, the Deep Underground Neutrino Experiment (DUNE) is designed to unders… [+3870 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of New South Wales", "title": "Quantum engineers create a 'Schrödinger's cat' inside a silicon chip - Phys.org", "description": "UNSW engineers have demonstrated a well-known quantum thought experiment in the real world. Their findings deliver a new and more robust way to perform quantum computations—and they have important implications for error correction, one of the biggest obstacle…", "url": "https://phys.org/news/2025-01-quantum-schrdinger-cat-silicon-chip.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/this-metaphorical-cat.jpg", "publishedAt": "2025-01-14T14:00:04Z", "content": "UNSW engineers have demonstrated a well-known quantum thought experiment in the real world. Their findings deliver a new and more robust way to perform quantum computationsand they have important imp… [+5875 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Blue Ghost moon lander will help NASA see Earth's magnetic field 'breathing' for 1st time - Space.com", "description": "\"We expect to see the magnetosphere breathing out and breathing in.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/blue-ghost-moon-lander-will-help-nasa-see-earths-magnetic-field-breathing-for-1st-time", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RW9nT5ktjYDeN8CiSmhEBK-1200-80.jpg", "publishedAt": "2025-01-14T14:00:00Z", "content": "Firefly Aerospace's soon-to-launch Blue Ghost moon lander will help NASA better understand our home planet, and how it responds to space weather.\r\nThe Lunar Environment Heliospheric X-ray Imager inst… [+2966 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Tim McMillan, Tim McMillan", "title": "Time Travel Paradoxes Solved? New Study Shows How Quantum Mechanics Prevents Changing the Past - The Debrief", "description": "New research provides a solution to time travel paradoxes by demonstrating that quantum mechanics prevents one from ever changing the past.", "url": "https://thedebrief.org/time-travel-paradoxes-solved-new-study-shows-how-quantum-mechanics-prevents-changing-the-past/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/01/AdobeStock_816704682_750x500.jpeg", "publishedAt": "2025-01-14T13:45:02Z", "content": "Time travel has long captured the human imagination, from its appearances in science fiction fantasies to its profound implications in modern theoretical physics. Now, a recent study by Dr. Lorenzo G… [+9835 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Do Cows Really Align With The Electromagnetic Field Of The Earth? - IFLScience", "description": "In 2008, researchers viewed satellite images of cows grazing and found something a little unexpected.", "url": "https://www.iflscience.com/do-cows-really-align-with-the-electromagnetic-field-of-the-earth-77595", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77595/aImg/81413/cows-meta.png", "publishedAt": "2025-01-14T13:41:18Z", "content": "In 2008, a team of researchers studying deer and cattle found something a little unexpected. Both animals, when grazing or resting, appear to align their bodies in the north-south direction.\r\n\"Farmer… [+4323 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Astronomers discover a new dense sub-Saturn exoplanet - Phys.org", "description": "An international team of astronomers has reported the detection of a new exoplanet orbiting a bright late F-type star. The newfound alien world, designated TOI-6038 A b, is about six times larger and nearly 80 times more massive than Earth. The finding is det…", "url": "https://phys.org/news/2025-01-astronomers-dense-saturn-exoplanet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/astronomers-discover-a.jpg", "publishedAt": "2025-01-14T13:30:01Z", "content": "An international team of astronomers has reported the detection of a new exoplanet orbiting a bright late F-type star. The newfound alien world, designated TOI-6038 A b, is about six times larger and… [+3325 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Henry Taylor, Peter Vickers, Sean McMahon", "title": "Do aliens exist? We studied what scientists really think - The Conversation Indonesia", "description": "Only 10.2% of astrobiologists disagree with the claim that intelligent aliens likely exist.", "url": "https://theconversation.com/do-aliens-exist-we-studied-what-scientists-really-think-241505", "urlToImage": "https://images.theconversation.com/files/642307/original/file-20250114-21-tpugbg.jpg?ixlib=rb-4.1.0&rect=0%2C819%2C7706%2C3853&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-01-14T13:23:42Z", "content": "News stories about the likely existence of extraterrestrial life, and our chances of detecting it, tend to be positive. We are often told that we might discover it any time now. Finding life beyond E… [+6254 chars]"}, {"source": {"id": null, "name": "Jasondeegan.com"}, "author": "Smith Noah", "title": "In a few days, Earth will witness a rare event straight out of a sci-fi movie - Jason Deegan", "description": "Imagine gazing up at the night sky and spotting a second moon gracefully orbiting our planet, even if just for a short while. This extraordinary event ... Continue Reading →", "url": "https://jasondeegan.com/in-a-few-days-earth-will-witness-a-rare-event-straight-out-of-a-sci-fi-movie/", "urlToImage": "https://jasondeegan.com/wp-content/uploads/2025/01/Earth-will-witness-a-rare-event.webp", "publishedAt": "2025-01-14T13:00:47Z", "content": "Imagine gazing up at the night sky and spotting a second moon gracefully orbiting our planet, even if just for a short while. This extraordinary event is set to become reality in the coming days as a… [+4398 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": "Kelly Kizer Whitt", "title": "Huygens landed on Saturn’s moon Titan 20 years ago - EarthSky", "description": null, "url": "https://earthsky.org/space/huygens-landed-on-saturns-moon-titan-20-years/", "urlToImage": "https://earthsky.org/upl/2024/12/6-huygens-fish-eye-looking-down-ESA-NASA-JPL-University-of-Arizona-Jan-14-2005.jpg", "publishedAt": "2025-01-14T12:40:56Z", "content": "Watch as Huygens descends through the atmosphere of Saturn’s moon Titan and lands on its surface on January 14, 2005.\r\nHuygens landed on Saturn’s moon Titan 20 years ago\r\nRight now, space probes are … [+3798 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Scientists discover 'sunken worlds' hidden deep within Earth's mantle that shouldn't be there - Livescience.com", "description": "A new way of measuring structures deep inside Earth has highlighted numerous previously unknown blobs within our planet's mantle. These anomalies are surprisingly similar to sunken chunks of Earth's crust but appear in seemingly impossible places.", "url": "https://www.livescience.com/planet-earth/geology/scientists-discover-sunken-worlds-hidden-deep-within-earths-mantle-that-shouldnt-be-there", "urlToImage": "https://cdn.mos.cms.futurecdn.net/f5Yj5EQ7gUdiNMkyJ5VdTe-1200-80.jpg", "publishedAt": "2025-01-14T12:11:08Z", "content": "Potential patches of Earth's ancient crust, sometimes called \"sunken worlds,\" may have just been discovered deep within the mantle, thanks to a new way of mapping the inside of our planet\r\n. However,… [+4350 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "Something invisible and 'fuzzy' may lurk at the Milky Way's center, new research suggests - Livescience.com", "description": "The cores of galaxies may not be made of what we thought, new research suggests — they could hold one giant, invisible star made of mysterious \"fuzzy\" matter.", "url": "https://www.livescience.com/physics-mathematics/dark-matter/something-invisible-and-fuzzy-may-lurk-at-the-milky-ways-center-new-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zmvgpXK9rasaiQCC8LPLuX-1200-80.jpg", "publishedAt": "2025-01-14T12:00:00Z", "content": "Galaxies may be anchored to giant \"dark stars\" — clumps of invisible matter sitting at their cores, new research suggests.\r\nAlthough astronomers have an abundance of evidence that most of the mass in… [+3483 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2025-01-14T11:33:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Oceanographic Magazine"}, "author": "Rob Hutchins", "title": "Life in the '90s: Barrier Reef biodiversity has 'shifted significantly' - Oceanographic Magazine", "description": "Fish communities living on the Great Barrier Reef today are \"substantially different\" to those that lived there in the 1990s, new study finds", "url": "https://oceanographicmagazine.com/news/life-in-the-90s-barrier-reef-biodiversity-has-shifted-significantly/", "urlToImage": "https://cdn.oceanographicmagazine.com/wp-content/uploads/2025/01/14094806/Matt-Curnock.jpg", "publishedAt": "2025-01-14T09:54:24Z", "content": "Fish communities living on the Great Barrier Reef today are substantially different to those that inhabited the coral reef ecosystem – the largest in the world – back in the 1990s, a new study lookin… [+3140 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Earth from space: Svalbard's radioactive 'Bear Island' surrounded by rare cloud swirls and a giant algal bloom - Livescience.com", "description": "A 2023 satellite image captured a pair of peculiar phenomena painting parallel swirls in the sea and sky around Norway's Bear Island, which is surrounded by extremely radioactive waters left behind by a doomed Soviet submarine.", "url": "https://www.livescience.com/planet-earth/earth-from-space-svalbards-radioactive-bear-island-surrounded-by-rare-cloud-swirls-and-a-giant-algal-bloom", "urlToImage": "https://cdn.mos.cms.futurecdn.net/agtKV4FfxUwmw5HtkGYV2P-1200-80.jpg", "publishedAt": "2025-01-14T09:47:17Z", "content": "Where is it? Bear Island, Svalbard [74.43137835, 19.058443166]\r\nWhat's in the photo? Atmospheric vortices in the clouds and a swirling algal bloom in the ocean\r\nWhich satellite took the photo? NASA A… [+3496 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Spiky fossils Punk and Emo change our understanding of molluscan evolution - Nature.com", "description": "Two fossils from about 430 million years ago suggest early worm-like molluscs were more diverse than the group is today.", "url": "https://www.nature.com/articles/d41586-024-04147-x", "urlToImage": "https://media.nature.com/lw1200/magazine-assets/d41586-024-04147-x/d41586-024-04147-x_50379092.jpg", "publishedAt": "2025-01-08T17:02:13Z", "content": null}]}