{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Watch NASA unveil landing sites for Artemis 3 human return to the moon today - Space.com", "description": "Humans may return to the surface of the moon in 2025 with the Artemis 3 mission.", "url": "https://www.space.com/nasa-artemis-moon-landing-sites-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jmPZGNCXEnVaUwSqUniEzC-1200-80.jpg", "publishedAt": "2022-08-19T09:07:12Z", "content": "NASA will unveil potential future landing sites for a human return to the surface of the moon, and you can watch the briefing on Space.com today (Aug. 19), or directly on the space agency's website. … [+2806 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Longest-Lived Mission: Voyager Probes Log 45 Years in Space - SciTechDaily", "description": "Launched in 1977, the twin Voyager probes are NASA’s longest-operating mission and the only spacecraft ever to explore interstellar space. Launched in 1977, NASA’s twin Voyager spacecraft inspired the world with pioneering visits to Jupiter, Saturn, Uranus, a…", "url": "https://scitechdaily.com/nasas-longest-lived-mission-voyager-probes-log-45-years-in-space/", "urlToImage": "https://scitechdaily.com/images/Voyager-Illustration.jpg", "publishedAt": "2022-08-19T08:49:34Z", "content": "ByJet Propulsion LaboratoryAugust 19, 2022\r\nThis artists rendering shows NASAs Voyager spacecraft. On the boom to the right, the Cosmic Ray Science instrument, Low Energy Charged Particle detector, t… [+12743 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Drop everything and go back': Russian cosmonaut aborts spacewalk after spacesuit snag - South China Morning Post", "description": "Subscribe to our YouTube channel for free here: https://sc.mp/subscribe-youtubeCameras aboard the International Space Station captured a life-or-death moment...", "url": "https://www.youtube.com/watch?v=_JqCDFLh0bo", "urlToImage": "https://i.ytimg.com/vi/_JqCDFLh0bo/maxresdefault.jpg", "publishedAt": "2022-08-19T04:14:12Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Phillip Nieto", "title": "Scientists find a new asteroid crater that may shed light on Dinosaurs' extinction - Fox News", "description": "Scientists may learn more clues about the extinction of dinosaurs after discovering a large asteroid crater off the coast of west Africa.", "url": "https://www.foxnews.com/science/scientists-find-new-asteroid-crater-shed-light-dinosaurs-extinction", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/11/T-Rex-GETTY.jpg", "publishedAt": "2022-08-18T21:05:06Z", "content": "A previously undiscovered asteroid crater off the coast of West Africa may hold some answers about how Dinosaurs went extinct. \r\nApproximately 66 million years ago, a large asteroid, whose crater is … [+2173 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Selects Proposals to Study Stellar Explosions, Galaxies, Stars - NASA", "description": "NASA has selected four mission proposals submitted to the agency’s Explorers Program for further study.", "url": "https://www.nasa.gov/press-release/nasa-selects-proposals-to-study-stellar-explosions-galaxies-stars/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hubble_mrk1337_esapotw2145a_0.jpg", "publishedAt": "2022-08-18T20:16:44Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Underwater snow reveals new clues about Europa as ocean world missions draw closer - CNN", "description": "Jupiter's icy moon Europa is an ocean world encased beneath a thick ice crust. Under the water, snow floats upward much like it does beneath ice shelves on Earth. These findings could inform the way NASA's Europa Clipper explores the moon when it launches in …", "url": "https://www.cnn.com/2022/08/18/world/underwater-snow-europa-clipper-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220817144416-02-nasa-europa-clipper-super-tease.jpg", "publishedAt": "2022-08-18T20:02:00Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples, CNN", "title": "Scientists are asking the public to name 20 exoplanetary systems observed by the Webb telescope. Here's how to submit your idea - CNN", "description": "During its exploration of deep space, the Webb telescope will closely observe 20 exoplanetary systems. Scientists have organized a global search for the perfect names for these other worlds.", "url": "https://www.cnn.com/2022/08/18/world/webb-telescope-exoplanet-name-contest-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220817222635-james-webb-space-telescope-mirror-121421-super-tease.jpg", "publishedAt": "2022-08-18T17:39:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Grains of dust from asteroid Ryugu older than our solar system - Phys.org", "description": "An international team of researchers studying dust samples retrieved by the Hayabusa-2 space probe, has found that some of its dust grains are older than the solar system. In their paper published in The Astrophysical Journal Letters, the group describes thei…", "url": "https://phys.org/news/2022-08-grains-asteroid-ryugu-older-solar.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/grains-of-dust-from-as.jpg", "publishedAt": "2022-08-18T17:30:02Z", "content": "(a) Backscattered electron (BSE) image of Ryugu thin section A0058-2. Every black area consists of 20 NanoSIMS maps measured. (b) An area in section C0002 with a less altered lithology than the surro… [+3901 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Bill Nye Breaks Down Webb Telescope Space Images | WIRED - WIRED", "description": "The James Webb Space Telescope has dazzled us with its first batch of images. WIRED got in touch with the one and only Bill Nye to break down some of these a...", "url": "https://www.youtube.com/watch?v=piMfL12RzoA", "urlToImage": "https://i.ytimg.com/vi/piMfL12RzoA/hqdefault.jpg", "publishedAt": "2022-08-18T14:10:36Z", "content": null}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Aisha Nozari", "title": "Scientists make massive breakthrough in nuclear fusion as 'ignition' is finally achieved - UNILAD", "description": "Scientists have now confirmed that on 8 August 2021, they were able to ignite the same chemical reaction that powers the Sun in a ground-breaking experiment", "url": "https://www.unilad.com/news/scientists-make-nuclear-breakthrough-20220818", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&dpr=1&url=https://eu-images.contentstack.com/v3/assets/blt949ea8e16e463049/blt02f5aef2b1b048a9/62fe2d5cc6768832a0186544/fusion.png", "publishedAt": "2022-08-18T12:49:19Z", "content": "Scientists have confirmed that on 8 August 2021, they were able to ignite the same chemical reaction that powers the Sun by pumping more power than the entire US electric grid into a small gold capsu… [+2671 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Astronomers obtain new images of R136, the most massive star ever found - Phys.org", "description": "Meet R136a1, the most massive star known. Located in the Large Magellanic Cloud, it's a hulking behemoth weighing somewhere between 150 and 200 times the mass of the sun. Understanding the upper limit of stars helps astronomers piece together everything from …", "url": "https://phys.org/news/2022-08-astronomers-images-r136-massive-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/r136-is-the-most-massi.jpg", "publishedAt": "2022-08-18T12:45:00Z", "content": "Meet R136a1, the most massive star known. Located in the Large Magellanic Cloud, it's a hulking behemoth weighing somewhere between 150 and 200 times the mass of the sun. Understanding the upper limi… [+2411 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bad Dreams Could Be a Early Sign of Parkinson’s - SciTechDaily", "description": "A study finds that frequent nightmares could be an early warning of Parkinson's Disease. According to experts at the University of Birmingham, older adults who begin to have nightmares or disturbing dreams could be displaying the early symptoms of Parkinson's…", "url": "https://scitechdaily.com/bad-dreams-could-be-a-early-sign-of-parkinsons/", "urlToImage": "https://scitechdaily.com/images/Dark-Thoughts-Consciousness-Dream-Nightmare-Concept.jpg", "publishedAt": "2022-08-18T11:23:47Z", "content": "A study finds that frequent nightmares could be an early warning of Parkinsons Disease.\r\nAccording to experts at the University of Birmingham, older adults who begin to have nightmares or disturbing … [+2938 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": "Daniel Uria", "title": "'Cannibal' solar burst headed for Earth could make northern lights visible in U.S. - UPI News", "description": "A plume of \"dark plasma\" from the sun is expected to be overtaken by a \"cannibal\" solar burst that may cause an aurora display visible throughout large portions of the United States on Thursday.", "url": "https://www.upi.com", "urlToImage": "https://cdnph.upi.com/sv/ph/og/i/3311660791782/2022/1/16607956513236/v1.5/Cannibal-solar-burst-headed-for-Earth-could-make-northern-lights-visible-in-US.jpg?lg=5", "publishedAt": "2022-08-18T10:41:34Z", "content": "Aug. 18 (UPI) -- A plume of \"dark plasma\" from the sun is expected to be overtaken by a \"cannibal\" solar burst that may cause an aurora display visible throughout large portions of the United States … [+2477 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Astrophotographer captures clear image of Saturn as it makes its closest approach to Earth this year - Daily Mail", "description": "An astrophotographer captured his clearest ever photo of Saturn from Los Angeles, USA on Sunday. The gas giant also reached its closest point to Earth this year, and was therefore at its brightest.", "url": "https://www.dailymail.co.uk/sciencetech/article-11123167/Astrophotographer-captures-clear-image-Saturn-makes-closest-approach-Earth-year.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/18/10/61499429-0-image-a-200_1660814386208.jpg", "publishedAt": "2022-08-18T10:23:14Z", "content": "An astrophotographer has taken his clearest ever picture of Saturn while it made its closest approach to Earth this year.\r\nOur planet moved almost directly between Saturn and the sun on Sunday, in an… [+7389 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "James Webb Space Telescope will seek clouds of vaporized gems on exoplanets - Space.com", "description": "Astronomers are looking for clouds made of vaporized gems and metals on faraway exoplanets.", "url": "https://www.space.com/james-webb-space-telescope-exoplanet-atmosphere-gems", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QvqRbQtF9P87ymBzMNbdNe-1200-80.jpg", "publishedAt": "2022-08-18T10:00:28Z", "content": "Astronomers will be hoping for cloudy skies as the James Webb Space Telescope\r\n (JWST or Webb) turns its attention to exoplanetary atmospheres laden with vaporized rock and crystals such as corundum … [+6544 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "We exist. What can that fact teach us about the Universe? - Big Think", "description": "The anthropic principle has fascinating scientific uses, where the simple fact of our existence holds deep physical lessons. Don't abuse it!", "url": "https://bigthink.com/starts-with-a-bang/we-exist/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/08/astrobio_award_0.jpg", "publishedAt": "2022-08-18T06:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Live Science", "title": "Hundreds of Shimmering Crystal Fragments Discovered at Prehistoric Burial Site - ScienceAlert", "description": "Hundreds of fragments of a rare transparent type of quartz called 'rock crystal' suggest Neolithic people used the mineral to decorate graves and other structures at a ceremonial site in western England, archaeologists say.", "url": "https://www.sciencealert.com/hundreds-of-shimmering-crystal-fragments-discovered-at-prehistoric-burial-site", "urlToImage": "https://www.sciencealert.com/images/2022/08/RareRockCrystalFoundOnStoneAgeBurialSites.jpg", "publishedAt": "2022-08-18T02:36:01Z", "content": "Hundreds of fragments of a rare transparent type of quartz called 'rock crystal' suggest Neolithic people used the mineral to decorate graves and other structures at a ceremonial site in western Engl… [+5727 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "EARTH BURNS UP IN THE SUN'S DEVASTATING HEAT | Countdown to Armageddon - HISTORY", "description": "What if Earth was thrown out of orbit? Could we survive the suns heat? Find out in this clip from Season 1 of \"Doomsday: 10 Ways the World Will End.\"#Countdo...", "url": "https://www.youtube.com/watch?v=0eOPO3YAvpk", "urlToImage": "https://i.ytimg.com/vi/0eOPO3YAvpk/hqdefault.jpg", "publishedAt": "2022-08-17T22:39:21Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Nancy Atkinson", "title": "Here's the Largest Image JWST Has Taken So Far - Universe Today", "description": "A team of scientists using the James Webb Space Telescope have just released the largest image taken by the telescope so far. The image is a mosaic of 690 individual frames taken with the telescope’s Near Infrared Camera (NIRCam) and it covers an area of sky …", "url": "https://www.universetoday.com/157168/heres-the-largest-image-jwst-has-taken-so-far/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/08/visualization-lab-ut-rll.jpeg", "publishedAt": "2022-08-17T21:56:52Z", "content": "A team of scientists using the James Webb Space Telescope have just released the largest image taken by the telescope so far. The image is a mosaic of 690 individual frames taken with the telescopes … [+4283 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Kate Golembiewski", "title": "How Chewing Shaped Human Evolution - The New York Times", "description": "An experiment revealed that chomping on slightly tougher material requires markedly more energy. Spending less time on mastication may go hand in hand with human evolution.", "url": "https://www.nytimes.com/2022/08/17/science/chewing-human-evolution.html", "urlToImage": "https://static01.nyt.com/images/2022/08/23/science/17tb-chewing/17tb-chewing-facebookJumbo.jpg", "publishedAt": "2022-08-17T21:42:47Z", "content": "Because chewing tougher food or in this case, tougher gum takes significantly more energy, these findings suggest that the metabolic costs of chewing may have played an important role in our evolutio… [+1283 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Watch a SpaceX Dragon cargo capsule leave the space station Thursday - Space.com", "description": "The robotic freighter is scheduled to depart the ISS around 11:05 a.m. ET.", "url": "https://www.space.com/spacex-dragon-leave-space-station-august-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Cami6Q85NqA5yTgQVZWQAP-1200-80.jpg", "publishedAt": "2022-08-17T19:37:26Z", "content": "A SpaceX Dragon cargo capsule will leave the International Space Station (ISS) on Thursday morning (Aug. 18), and you can watch it live.\r\nThe robotic Dragon\r\n is scheduled to depart the orbiting lab … [+1902 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Maddie Burakoff", "title": "Giant sharks once roamed the seas, feasting on huge meals - The Associated Press", "description": "NEW YORK (AP) — Today's sharks have nothing on their ancient cousins. A giant shark that roamed the oceans millions of years ago could have devoured a creature the size of a killer whale in just five bites, new research suggests.", "url": "https://apnews.com/article/science-oddities-fossils-sharks-fish-cd87e463438196637b95b4d52832645d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/9910b97f51fb4699957902d5f18e5e60/3000.jpeg", "publishedAt": "2022-08-17T19:21:06Z", "content": "NEW YORK (AP) Todays sharks have nothing on their ancient cousins. A giant shark that roamed the oceans millions of years ago could have devoured a creature the size of a killer whale in just five bi… [+2424 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Colliding black holes could clock universe's expansion rate - Space.com", "description": "'Spectral siren' method suggests mergers between massive and compact cosmic objects could help understand how the universe has evolved.", "url": "https://www.space.com/colliding-black-holes-measure-universe-expansion", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eFQQ4PLdAvZy9GLEbpuxDP-1200-80.jpg", "publishedAt": "2022-08-17T19:00:04Z", "content": "Scientists may have found a way of using the collisions of black holes to measure the rate at which the universe is expanding and solve some of the mysteries surrounding dark energy, the mysterious f… [+5519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Tiny glowing fish is full of antifreeze to help it survive Greenland's icy waters - CNN", "description": "Tiny glowing fish that live in icy waters off the coast of Greenland are full of naturally occurring antifreeze proteins that help them survive in subzero waters, according to new research. But time may be running out for the snailfish as the Arctic warms.", "url": "https://www.cnn.com/2022/08/17/world/antifreeze-protein-fish-greenland-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220816125220-02-antifreeze-fish-greenland-liparis-super-tease.jpg", "publishedAt": "2022-08-17T18:51:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Charles Q. Choi", "title": "Want to grow plants on Mars? High school student project finds 2 tricks for Red Planet - Space.com", "description": "The soil and water of Mars are normally too harsh for crops, but research led by a then-high school sophomore finds that alfalfa plants and photosynthetic bacteria might help make Martian soil and wat", "url": "https://www.space.com/mars-plants-alfalfa-bacteria-project", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hqGZydL9U6KpcP76oEaAFX-1200-80.jpg", "publishedAt": "2022-08-17T18:02:44Z", "content": "The soil and water of Mars are normally too harsh for crops, but research led by a then-high school sophomore finds that alfalfa plants and photosynthetic bacteria might help make Martian soil and wa… [+3870 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Alexander Cox", "title": "Get 43% off the Estes Saturn V model rocket, and save on launch sets too - Space.com", "description": "You can save over $38 on a 1:200 scale model of the actual rocket that stands nearly two feet tall.", "url": "https://www.space.com/estes-model-rocket-amazon-deals-august-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EpKBBcmqwXCuu4s694B3zC-1200-80.jpg", "publishedAt": "2022-08-17T17:44:51Z", "content": "If you're looking to launch your summer entertainment onto the next level, a 43% saving on the Estes Saturn V model rocket could be what you need. \r\nThe 43% discount (opens in new tab) amounts to a t… [+2505 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Kiona Smith", "title": "Look! New Webb Telescope image reveals a rare galaxy close to the Milky Way - Inverse", "description": "The Great Barred Galaxy lives up to its name in its Webb image debut.", "url": "https://www.inverse.com/science/new-webb-space-telescope-images-show-us-a-gorgeous-nearby-galaxy", "urlToImage": "https://imgix.bustle.com/uploads/image/2022/8/17/5e5dae44-c7f2-4d99-ab44-10af0b35ed1b-nircam.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-08-17T17:15:25Z", "content": "Raw data\r\n from the James Webb Space Telescope has yielded a stunning image of a nearby galaxy, with a little help from an unofficial photo processor.\r\n\"I chose NGC 1365 since that was the most recen… [+3687 chars]"}, {"source": {"id": null, "name": "WDSU New Orleans"}, "author": null, "title": "8-year-old girl chats with ISS astronaut using ham radio - WDSU New Orleans", "description": "In a tale of \"right place, right time,\" the 8-year-old girl from Kent in southeast England spoke with American astronaut Kjell Lindgren aboard the International Space Station (ISS) using her dad's ham radio.", "url": "https://www.wdsu.com/article/girl-chats-with-iss-astronaut-using-ham-radio/40919892", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/isabella-payne-1660752741.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2022-08-17T16:42:00Z", "content": "When Isabella Payne heads back to elementary school in September, she's going to have the best \"what I did on my vacation\" story to tell.\r\nIn a tale of \"right place, right time,\" the 8-year-old girl … [+2491 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Saleen Martin, USA TODAY", "title": "Thyreophoran dinosaur Jakapil kaniukura found in Argentina - USA TODAY", "description": "The small dinosaur was part of the Cretaceous period, the last era of the dinosaurs, and lived between 97 million and 94 million years ago.", "url": "https://www.usatoday.com/story/news/world/2022/08/17/remains-tiny-dinosaur-protective-spikes/10328034002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/08/16/USAT/d757f143-cc0b-4e6f-9eb2-f7472e2307c4-Picture3.jpg?auto=webp&crop=2217,1248,x0,y494&format=pjpg&width=1200", "publishedAt": "2022-08-17T16:35:33Z", "content": "Researchers in Argentina have discovered remains of a tiny, herbivorous dinosaur with protective spikes, suggesting the group it belongs to lived in a much wider area than originally thought.\r\nThe di… [+2258 chars]"}, {"source": {"id": "vice-news", "name": "Vice News"}, "author": null, "title": "Scientists Discover New Trigger for Mass Extinction of All Deep Ocean Life - VICE", "description": "The movement of continents over millions of years plays a surprising role in the survival of marine life, a new study reports.", "url": "https://www.vice.com/en/article/z34m93/scientists-discover-new-trigger-for-mass-extinction-of-all-deep-ocean-life", "urlToImage": "https://video-images.vice.com/articles/62fd0e69003e94009b473a73/lede/1660752105427-gettyimages-1184421184.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDI4MDkzNjQ1NDg0OTV4aDtjZW50ZXIsY2VudGVyJnJlc2l6ZT0xMjAwOiomcmVzaXplPTEyMDA6Kg", "publishedAt": "2022-08-17T16:02:15Z", "content": "Oxygen is one of the key ingredients for life as we know it on Earth, and its abundance or scarcity hugely influences the types of creatures that can survive in any given environment. Marine animals,… [+4781 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Lee Kanayama", "title": "NOAA, NASA, and Northrop Grumman complete major testing for JPSS-2 before launch - NASASpaceFlight.com - NASASpaceflight.com", "description": "The National Oceanic and Atmospheric Administration (NOAA), NASA, and Northrop Grumman have completed the final…", "url": "https://www.nasaspaceflight.com/2022/08/jpss-2-testing-complete/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/08/2022-08_solardeploy2.00_01_28_16.Still005-622x350.png", "publishedAt": "2022-08-17T16:02:04Z", "content": "The National Oceanic and Atmospheric Administration (NOAA), NASA, and Northrop Grumman have completed the final major test of the Joint Polar Satellite System (JPSS)-2 spacecraft ahead of its deliver… [+10038 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Supermassive black hole's bright 'photon ring' revealed in new image - Space.com", "description": "The first image of the black hole at the heart of the galaxy M87 has been 'remastered' to reveal forces at work around the behemoth.", "url": "https://www.space.com/supermassive-black-hole-photon-ring-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VAvBMgm3hwxJu4iWV3LNuQ-1200-80.jpg", "publishedAt": "2022-08-17T16:00:13Z", "content": "A newly remastered image of the black hole at the heart of the galaxy Messier 87 (M87) peels back the layers of the black hole to reveal photons flung around by the object's tremendous gravitational … [+4536 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Huge volcanic eruptions: time to prepare - Nature.com", "description": "More must be done to forecast and try to manage globally disruptive volcanic eruptions. The risks are greater than people think.", "url": "https://www.nature.com/articles/d41586-022-02177-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-02177-x/d41586-022-02177-x_23357294.jpg", "publishedAt": "2022-08-17T15:37:58Z", "content": "The massive eruption of the Hunga TongaHunga Haapai volcano this January in Tonga, in the south Pacific Ocean, was the volcanic equivalent of a near miss asteroid whizzing by the Earth. The eruption … [+13624 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "There's no one in charge of NASA's mega-moon program. And the countdown clock is ticking. - POLITICO", "description": "All the complex systems under development — the rocket, the capsule, lunar landers and spacesuits — still have to go under one roof. And quickly.", "url": "https://www.politico.com/news/2022/08/17/wanted-someone-to-oversee-nasas-return-to-the-moon-00052251", "urlToImage": "https://static.politico.com/46/a7/c69c208c42aa9abb7d76c584c9a6/220816-nasa-moon-ap.jpg", "publishedAt": "2022-08-17T15:20:07Z", "content": "It begins as soon as Aug. 29, when NASA plans to launch the first and only uncrewed test flight of the mega rocket and spacecraft that will get them there.\r\nThe NASA Artemis rocket with the Orion spa… [+13460 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Scientists Study How to Remove Planetary “Photobombers” - NASA", "description": "A NASA study details the ways the light telescopes receive from potentially habitable planets beyond our solar system could be “contaminated” by light from other nearby planets. The research modeled this “photobombing” effect on an advanced space telescope de…", "url": "https://www.nasa.gov/feature/goddard/2022/planetary-photobombers/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/kepler186f_artistconcept_2-captioned.jpg", "publishedAt": "2022-08-17T13:47:10Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Rocket Lab will self-fund a mission to search for life in the clouds of Venus - Ars Technica", "description": "\"Breakthrough science is possible.\"", "url": "https://arstechnica.com/science/2022/08/rocket-lab-will-self-fund-a-mission-to-search-for-life-in-the-clouds-of-venus/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/08/rl-mission-760x380.jpg", "publishedAt": "2022-08-17T13:09:47Z", "content": "Enlarge/ An artist's impression of Rocket Lab's proposed mission to Venus.\r\n21 with 20 posters participating, including story author\r\nNever let it be said that Rocket Lab founder Peter Beck lacks a f… [+4433 chars]"}]}