{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Biofluorescence in Birds-of-Paradise, Revealing a Hidden Layer of Mating Displays - SciTechDaily", "description": "Birds-of-paradise have long fascinated scientists with their dazzling courtship displays, but new research reveals they have an even more striking secret—they glow under ultraviolet light! Scientists have discovered widespread biofluorescence in these birds, …", "url": "https://scitechdaily.com/scientists-discover-biofluorescence-in-birds-of-paradise-revealing-a-hidden-layer-of-mating-displays/", "urlToImage": "https://scitechdaily.com/images/Emperor-Bird-of-Paradise-Biofluorescence.jpg", "publishedAt": "2025-02-26T03:33:38Z", "content": "Scientists have uncovered a hidden layer of visual communication in birds-of-paradise—biofluorescence. Nearly all species in this group glow under UV light, with males displaying vibrant flashes to a… [+4804 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Greg Wehner", "title": "SpaceX rocket to send Intuitive Machine's second lunar lander to the moon - Fox Business", "description": "Intuitive Machines out of Texas is sending a second lunar lander, this time Athena, to the moon, where it will drill for water, ice and other gases.", "url": "https://www.foxbusiness.com/fox-news-air-space/spacex-rocket-send-intuitive-machines-second-lunar-lander-moon", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2025/02/0/0/intutitive-machines-athena.jpg?ve=1&tl=1", "publishedAt": "2025-02-26T03:00:00Z", "content": "Texas-based Intuitive Machines is \"ready to go\" with the launch of its second moon landing mission, which is expected to blast off on Wednesday.\r\nReuters reported that a company executive confirmed t… [+2610 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Adithi Ramakrishnan", "title": "Every planet of our solar system is lining up in the February night sky - The Associated Press", "description": "Seven planets grace the sky at the end of February in what’s known as a planetary parade, though some will be difficult to spot. Venus, Mars and Jupiter are visible to the naked eye through the end of the month. Mercury and Saturn will be faint and close to t…", "url": "https://apnews.com/article/seven-planets-parade-february-20cb0d141af5b958e46f136022104766", "urlToImage": "https://dims.apnews.com/dims4/default/6a24f64/2147483647/strip/true/crop/2707x1523+0+141/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F95%2F95%2F120af2335a756a1bcb3e9062bbeb%2Fba9901f797114cf0a2af6cf2b3b263ba", "publishedAt": "2025-02-25T22:02:00Z", "content": "NEW YORK (AP) Seven planets grace the sky at the end of February in whats known as a planetary parade, though some will be difficult to spot with the naked eye.\r\nThese planetary hangouts happen when … [+1280 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX rolls huge Super Heavy booster to pad ahead of Starship Flight 8 launch (photos) - Space.com", "description": "Liftoff is scheduled for Friday (Feb. 28).", "url": "https://www.space.com/spacex-starship-super-heavy-launch-pad-flight-8-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zc4RfjUoMroanJbG53st5G-1200-80.jpg", "publishedAt": "2025-02-25T21:00:00Z", "content": "Starship hardware has made it to the pad ahead of a planned liftoff this week.\r\nSpaceX posted photos on X today (Feb. 25) showing Super Heavy, the giant first stage of its Starship megarocket, being … [+2268 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Forgotten Eruption That Cooled the Earth and Turned the Sun Green - The Daily Galaxy --Great Discoveries Channel", "description": "In 1831, a mysterious force cooled the planet and turned the Sun an eerie shade of green—but no one knew why. Now, scientists have finally uncovered the hidden volcanic eruption responsible for this bizarre phenomenon. Could another unnoticed volcano be lurki…", "url": "https://dailygalaxy.com/2025/02/eruption-cooled-earth-and-turned-sun-green/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/The-Forgotten-Eruption-That-Cooled-the-Earth-and-Turned-the-Sun-Green.jpg", "publishedAt": "2025-02-25T20:30:00Z", "content": "In 1831, a massive volcanic eruption in the Kuril Islands sent sulfur-laden ash high into the sky, cooling the planet and tinting the Sun green. \r\nThe volcano, known as Zavaritzki, remained a mystery… [+3219 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Scientists Just Found a Faster, Cheaper Way to Store Carbon Permanently - SciTechDaily", "description": "A team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals. By enhancing the natural weathering process, their technique creates reactive materials that absorb carbon at unprecedented rates. This scalable appr…", "url": "https://scitechdaily.com/stanford-scientists-just-found-a-faster-cheaper-way-to-store-carbon-permanently/", "urlToImage": "https://scitechdaily.com/images/Olivine-Aerolie-Weathering-Naturally.jpg", "publishedAt": "2025-02-25T20:12:01Z", "content": "Olivine aérolie weathering naturally. Credit: Renhour48 via Wikimedia\r\nA team at Stanford has developed a powerful yet low-energy way to trap atmospheric CO2 using heated minerals.\r\nBy enhancing the … [+7943 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Supernova Dataset Might Hold the Key to Dark Energy! - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have just uncovered the largest dataset of supernovae ever recorded, and it’s raising serious questions about the way we understand the universe’s expansion. Could this discovery force scientists to rethink dark energy and rewrite cosmology as we …", "url": "https://dailygalaxy.com/2025/02/supernova-dataset-hold-key-dark-energy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/This-Supernova-Dataset-Might-Hold-the-Key-to-Dark-Energy.jpg", "publishedAt": "2025-02-25T19:30:00Z", "content": "For decades, Type Ia supernovae have been the gold standard for measuring the expansion of the universe. These massive stellar explosions, used as “standard candles” in cosmology, helped astronomers … [+3657 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Geologists Have Long Searched for Gold Hydrogen. A New Study Finally Shows Where It’s Hiding. - Yahoo", "description": "Now we just have to find it.", "url": "https://www.popularmechanics.com/science/environment/a63905035/hydrogen-mountains/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/kk8k_HfM7qTRVe_Qf277ug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/popular_mechanics_642/e969cd1a49dac19e68c21b028ab2d8fb", "publishedAt": "2025-02-25T19:00:00Z", "content": "<ul><li>While hydrogen is on the verge of being a world-changing fuel source, its creation still relies largely on natural gas, making the fuel less-than-ideal in a world increasingly focused on deca… [+4303 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Something Shook Titan’s Orbit, and Scientists Are Racing to Solve the Mystery - SciTechDaily", "description": "Scientists are investigating Saturn’s moon Titan to understand how tidal forces affect its orbit, revealing clues about its internal structure and past changes. This research indicates Titan’s orbit is evolving rapidly on a geologic timescale, implying an eve…", "url": "https://scitechdaily.com/something-shook-titans-orbit-and-scientists-are-racing-to-solve-the-mystery/", "urlToImage": "https://scitechdaily.com/images/Titan-Moon-Orbits-Saturn.jpg", "publishedAt": "2025-02-25T18:08:47Z", "content": "SwRI studied Saturn’s moon Titan to assess its tidal dissipation rate, the energy lost as it orbits the ringed planet with its massive gravitational force. Understanding tidal dissipation helps scien… [+4329 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Jorge Garay", "title": "Something Unexpected Is Spewing Stars Into the Milky Way - WIRED", "description": "Fast-moving stars in the Milky Way indicate there could be a supermassive black hole in the neighboring Large Magellanic Cloud—something that has never been detected in a smaller galaxy.", "url": "https://www.wired.com/story/large-magellanic-cloud-supermassive-black-hole/", "urlToImage": "https://media.wired.com/photos/67b6196d3a2dde1bc2bc31fa/191:100/w_1280,c_limit/galaxia%20gran%20nube%20de%20magallanes.jpg", "publishedAt": "2025-02-25T18:05:01Z", "content": "New research from a team at the Harvard Center for Astrophysics suggests that the Large Magellanic Cloud, a dwarf galaxy neighboring the Milky Way, hosts a gravitational structure hundreds of thousan… [+3163 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Vienna", "title": "Solar system's journey through Orion complex 14 million years ago may have altered Earth's climate - Phys.org", "description": "An international research team led by the University of Vienna has discovered that the solar system traversed the Orion star-forming complex, a component of the Radcliffe Wave galactic structure, approximately 14 million years ago. This journey through a dens…", "url": "https://phys.org/news/2025-02-solar-journey-orion-complex-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-galactic-journey-o-1.jpg", "publishedAt": "2025-02-25T17:50:34Z", "content": "An international research team led by the University of Vienna has discovered that the solar system traversed the Orion star-forming complex, a component of the Radcliffe Wave galactic structure, app… [+5225 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Science reveals how to bring gold to the surface from Earth's mantle - Earth.com", "description": "International scientists reveal that magma transports gold from the mantle to the surface by means of a sulfur complex.", "url": "https://www.earth.com/news/science-reveals-how-to-bring-gold-to-the-surface-from-earths-mantle/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/25043029/gold-mantle-extraction-science.jpg", "publishedAt": "2025-02-25T17:31:00Z", "content": "Gold is more abundant in Earths bulk composition than lead. Its presence on the surface, however, has long been a puzzle because gold atoms prefer to stay buried far below. \r\nOn December 29, 2024, a … [+4428 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Ruthless New Predator Is Moving Into the Arctic—And Scientists Are Sounding the Alarm - The Daily Galaxy --Great Discoveries Channel", "description": "A new predator has made the Arctic its home, disrupting the fragile ecosystem and threatening the balance of marine life in ways scientists never expected.", "url": "https://dailygalaxy.com/2025/02/new-predator-is-moving-into-the-arctic/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/A-Ruthless-New-Predator-Is-Moving-Into-the-Arctic—And-Scientists-Are-Sounding-the-Alarm.jpg", "publishedAt": "2025-02-25T15:20:00Z", "content": "A dramatic shift is unfolding in the Arctic Ocean, where killer whales (orcas)once blocked by thick iceare now establishing year-round populations. As climate change melts polar ice, new hunting grou… [+3422 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mysterious fast radio burst traced back to massive 'cosmic graveyard' of ancient stars - Space.com", "description": "\"This new fast radio burst shows us that just when you think you understand an astrophysical phenomenon, the universe turns around and surprises us.\"", "url": "https://www.space.com/science-astronomy/fast-radio-burst-frb-dead-galaxy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MW5bBWE4oYz8zPde5cfVMS-1200-80.png", "publishedAt": "2025-02-25T15:00:00Z", "content": "Astronomers have been forced to reassess the origins of mysterious, rapid radio wave blasts called \"fast radio bursts\" (FRBs).\r\nThis rethink was brought about by an FRB first detected last year, whic… [+7624 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Pesala Bandara", "title": "This AI-Generated Optical Illusion Test Could Replace CAPTCHAs - PetaPixel", "description": "While AI can generate optical illusions, it struggles to recognize them.", "url": "https://petapixel.com/2025/02/25/this-ai-generated-optical-illusion-test-could-replace-captchas/", "urlToImage": "https://petapixel.com/assets/uploads/2025/02/illusion-captcha.jpg", "publishedAt": "2025-02-25T14:09:12Z", "content": "The “IllusionCAPTCHA” test takes an AI-generated image and alters it by incorporating an illusory word or object, such as an apple. AI bots are unable to recognize it.\r\nResearchers have developed a n… [+2430 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Owen Bellwood", "title": "NASA Awards SpaceX $100 Million Contract To Launch Asteroid Hunting Telescope - Jalopnik", "description": "NASA awarded SpaceX a $100 million contract to launch a new satellite that could monitor extraterrestrial threats to the Earth.", "url": "https://www.jalopnik.com/1798966/nasa-awards-spacex-100-million-contract-launch-asteroid-hunting-telescope/", "urlToImage": "https://www.jalopnik.com/img/gallery/nasa-awards-space-x-100-million-contract-to-launch-asteroid-hunting-telescope/l-intro-1740490749.jpg", "publishedAt": "2025-02-25T13:50:15Z", "content": "Once deployed to a site that scientists call the Sun-Earth Lagrange Point 1, NEO Surveyor will form part of our planetary defense system to scan for asteroids that are at least 460 feet across, Space… [+1059 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "When Did Life Appear on Earth? New Evidence Suggests It Started Shockingly Billions of Years Earlier than We Thought - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists once believed life took a billion years to emerge on Earth, but new evidence suggests it may have appeared almost instantly. Clues buried in ancient rocks and genetics are rewriting the timeline of our origins.", "url": "https://dailygalaxy.com/2025/02/when-did-life-appear-on-earth-new-evidence-suggests-it-started-shockingly-billions-of-years-earlier-than-we-thought/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/volcanic-planet-with-glowing-lava.jpg", "publishedAt": "2025-02-25T13:40:00Z", "content": "For decades, scientists believed that life on Earth took at least a billion years to get started. The prevailing idea was that the planets violent early historyespecially a period of intense asteroid… [+2932 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New dwarf galaxy discovered in the halo of Andromeda galaxy - Phys.org", "description": "An international team of astronomers reports the discovery of a new dwarf galaxy, which they have named Pegasus VII. The newfound galaxy, which lies about 2.4 million light years away, was identified in the Ultraviolet Near-Infrared Optical Northern Survey (U…", "url": "https://phys.org/news/2025-02-dwarf-galaxy-halo-andromeda.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-dwarf-galaxy-disco.jpg", "publishedAt": "2025-02-25T13:30:01Z", "content": "An international team of astronomers reports the discovery of a new dwarf galaxy, which they have named Pegasus VII. The newfound galaxy, which lies about 2.4 million light years away, was identified… [+3238 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jacqueline Minerd", "title": "NASA Prepares Gateway Lunar Space Station for Journey to Moon - NASA", "description": "Assembly is underway for Gateway's Power and Propulsion Element, the module that will power the lunar space station's journey to and around the Moon as part of NASA’s Artemis campaign.", "url": "https://www.nasa.gov/missions/artemis/nasa-prepares-gateway-lunar-space-station-for-journey-to-moon/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/jsc2024e081642-1.jpg", "publishedAt": "2025-02-25T13:03:23Z", "content": "Assembly is underway for Gateway's Power and Propulsion Element, the module that will power the lunar space station's journey to and around the Moon as part of NASAs Artemis campaign.\r\nNASAs Artemis … [+1454 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Tom Earnshaw", "title": "US Space Force shares first declassified photo from top secret X-37b mission - LADbible", "description": "The Boeing X-38B, or Orbital Test Vehicle, is used by the US Space Force to conduct secret experiments orbiting the Earth", "url": "https://www.ladbible.com/news/health/usa-secret-space-plane-first-image-released-431655-20250225", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/blt4cdcfc2eb7243732/67bdabaf76acd3ac7f406853/Boeing_X-37.jpg", "publishedAt": "2025-02-25T13:01:23Z", "content": "The first image from the USA's secret space plane currently orbiting the world has been released by the United States military.\r\nDubbed X-37B or the Orbital Test Vehicle (OTV), it is the code name fo… [+2543 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Watch Live: NASA Is Launching a Space Telescope That Could Rewrite the Universe’s Origin Story - SciTechDaily", "description": "NASA is gearing up for an exciting launch with SPHEREx, a space telescope designed to uncover the history of the universe while searching for signs of life. Hitching a ride on the same rocket, the PUNCH mission will peer into the Sun’s outer layers to study s…", "url": "https://scitechdaily.com/watch-live-nasa-is-launching-a-space-telescope-that-could-rewrite-the-universes-origin-story/", "urlToImage": "https://scitechdaily.com/images/NASA-Spectro-Photometer-History-Universe-Epoch-Reionization-Ices-Explorer-SPHEREx-Mission.jpg", "publishedAt": "2025-02-25T12:51:05Z", "content": "The Spectro-Photometer for the History of the Universe, Epoch of Reionization and Ices Explorer (SPHEREx) mission will provide the first all-sky spectral survey. Over a two-year planned mission, the … [+3843 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "First dark matter search using WINERED spectrograph sets new lifetime constraints - Phys.org", "description": "Dark matter is an elusive type of matter that does not emit, absorb or reflect light and is thus impossible to detect using conventional techniques employed in particle physics. In recent years, groups of physicists worldwide have been trying to observe this …", "url": "https://phys.org/news/2025-02-dark-winered-spectrograph-lifetime-constraints.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-results-of-the-fir.jpg", "publishedAt": "2025-02-25T12:20:01Z", "content": "Dark matter is an elusive type of matter that does not emit, absorb or reflect light and is thus impossible to detect using conventional techniques employed in particle physics. In recent years, grou… [+6522 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "On March 29, a Once-in-a-Lifetime Celestial Event Will Plunge the North Pole and Europe Into Darkness for Almost 4 Hours - The Daily Galaxy --Great Discoveries Channel", "description": "A solar eclipse in 2025 will briefly darken the sky, creating a momentary spectacle for those in the right place at the right time. While not a total eclipse, it will still offer a striking view for millions.", "url": "https://dailygalaxy.com/2025/02/on-march-29-a-once-in-a-lifetime-celestial-event-will-plunge-the-north-pole-and-europe-into-darkness-for-almost-4-hours/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Eclipse.jpg", "publishedAt": "2025-02-25T12:15:00Z", "content": "The year 2025 will bring two solar eclipses, offering skywatchers a chance to witness one of the most awe-inspiring celestial events. The first, a partial eclipse in March, will provide a spectacular… [+3583 chars]"}, {"source": {"id": null, "name": "Umontreal.ca"}, "author": "Heidi White", "title": "JWST Forecasts Partially Cloudy Skies on Ultra-Hot Neptune LTT 9779 b - News | Institute for Research on Exoplanets", "description": "Montréal, Canada—A team of researchers led by Louis-Philippe Coulombe, a graduate student at the Université de Montréal's Trottier Institute for Research on Exoplanets (IREx), has used the James Webb Space Telescope (JWST) to explore the exotic atmosphere of …", "url": "https://exoplanetes.umontreal.ca/en/jwst-forecasts-partially-cloudy-skies-on-ultra-hot-neptune-ltt-9779-b/", "urlToImage": null, "publishedAt": "2025-02-25T12:00:41Z", "content": "Montréal, CanadaA team of researchers led by Louis-Philippe Coulombe, a graduate student at the Université de Montréal’s Trottier Institute for Research on Exoplanets (IREx), has used the James Webb … [+7615 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "Blue Ghost spacecraft captures rare, stunnning views of Earth eclipsing the moon - Livescience.com", "description": "Firefly Aerospace's Blue Ghost spacecraft took some unique photos of our home planet on its Mission 1 flight to the moon in late January and early February. The spacecraft is now in orbit around the moon, with a planned landing date of March 2.", "url": "https://www.livescience.com/space/space-exploration/blue-ghost-spacecraft-captures-rare-stunnning-views-of-earth-eclipsing-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/33sX7vNeGZ7YdNBKWcBoxS-1200-80.jpg", "publishedAt": "2025-02-25T12:00:00Z", "content": "A \"ghostly\" spacecraft has shared a treasure trove of vacation photos from its recent trip into orbit, including a stunning selfie with Earth eclipsing the moon in the background.\r\nThis \"ghost\" isn't… [+3846 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Geysers on Saturn's icy moon Enceladus may form from a 'mushy zone' - Phys.org", "description": "Searching for life on other celestial bodies, or at the very least the necessary components to support it, has been fascinating scientists and enthusiasts for centuries. While planets are the obvious choice, their moons can also harbor the chemical ingredient…", "url": "https://phys.org/news/2025-02-geysers-saturn-icy-moon-enceladus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/geysers-on-saturns-icy.jpg", "publishedAt": "2025-02-25T11:30:01Z", "content": "Searching for life on other celestial bodies, or at the very least the necessary components to support it, has been fascinating scientists and enthusiasts for centuries. While planets are the obvious… [+5612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Scientists say they’ve discovered why Mars is red - CNN", "description": "A study suggests Mars takes its red hue from a type of mineral that forms in cool water, which could reveal insights about whether Mars was ever able to support life.", "url": "https://www.cnn.com/2025/02/25/science/why-mars-is-red/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/near-ir-green-and-near-uv-colour-view-of-mars.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-25T11:30:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWith its iconic rusty hue, Mars has long been called t… [+9088 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joshua Nelken-Zitser", "title": "Mining the moon for minerals could be worth billions, but astronomers warn it's bad news for science - AOL", "description": "The moon has resources like rare earth elements and helium-3. But unfettered mining could be very bad news for scientific research, astronomers warn.", "url": "https://www.businessinsider.com/mining-moon-minerals-lucrative-bad-news-science-research-astronomists-2025-2", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/n7R6OwxZPvXwxPwp9xKRvg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/aol_business_insider_articles_308/33e32c5eb17cc77b8fcd4bb8ace2be7f", "publishedAt": "2025-02-25T11:20:43Z", "content": "Mining the moon could be a huge money-making industry in the future.Yunus Turkyilmaz/Anadolu via Getty Images\r\n<ul><li>Moon mining could become a multibillion-dollar industry.\r\n</li><li>The moon hold… [+3613 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "China to send a spacecraft out of the ecliptic to study the Sun’s poles - SpaceNews", "description": "HELSINKI — China plans to send a space observatory out of the plane of the ecliptic for a mission to study the poles of the sun. The Solar Polar Orbit Observatory is currently scheduled to launch i…", "url": "http://spacenews.com/china-to-send-a-spacecraft-out-of-the-ecliptic-to-study-the-suns-poles/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcL3N1bi14c3RyZWFtLVBJQTE4OTA2bWVkaXVtLW5hc2EtMTAyNHg1MjAuanBnIiwidHh0IjoiQ2hpbmEgdG8gc2VuZCBhIHNwYWNlY3JhZnQgb3V0IG9mIHRoZSBlY2xpcHRpYyB0byBzdHVkeSB0aGUgU3VuXHUyMDE5cyBwb2xlcyIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.1nzXogkwryGUbVf5XaEg1JgmnZVPlb2QsJvaTNRA3IIMQ", "publishedAt": "2025-02-25T11:17:38Z", "content": "HELSINKI China plans to send a space observatory out of the plane of the ecliptic for a mission to study the poles of the sun.\r\nThe Solar Polar Orbit Observatory is currently scheduled to launch in 2… [+4308 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Created Shape-Shifting Robots That Flow Like Liquid and Harden Like Steel - SciTechDaily", "description": "Researchers have designed a robotic material that transforms like a living organism. Inspired by embryos, these disk-shaped robots use magnets, motors, and light to shift between rigid and fluid states. The result? A self-healing, shape-shifting system that c…", "url": "https://scitechdaily.com/scientists-just-created-shape-shifting-robots-that-flow-like-liquid-and-harden-like-steel/", "urlToImage": "https://scitechdaily.com/images/Robot-Wrench.jpg", "publishedAt": "2025-02-25T11:15:52Z", "content": "An artist’s depiction of a material-like collective of robots forming a rigid device. Credit: Brian Long, University of California Santa Barbara, edited\r\nResearchers have designed a robotic material … [+6124 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "If Mars has microbe fossils, a laser and rock quarry in Algeria could help find them - Space.com", "description": "Scientist is proud to have led \"the first astrobiology study to involve Algeria,\" and believes that his findings are a major step towards finding evidence of life on Mars.", "url": "https://www.space.com/mars-microbes-laser-rock-quarry-algeria", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DkoawzoHm9wReCa4HGH6QX-1200-80.jpg", "publishedAt": "2025-02-25T11:00:00Z", "content": "Scientists searching for the fossilized remains of ancient microbes on Mars now have a better idea of what signs they should be looking for, thanks to a new study of Earthly microbial fossils embedde… [+6010 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Earth from space: Rare 'sunglint' transforms the Mediterranean Sea into a swirling, silver mirror - Livescience.com", "description": "This 2022 astronaut photo reveals a menagerie of hidden oceanographic features surrounding a pair of Greek islands, including giant spinning currents and rarely seen \"internal waves.\"", "url": "https://www.livescience.com/planet-earth/rivers-oceans/earth-from-space-rare-sunglint-transforms-the-mediterranean-sea-into-a-swirling-silver-mirror", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bWfDfxGtoLfw43Dt2rgGkG-1200-80.jpg", "publishedAt": "2025-02-25T09:24:59Z", "content": "Where is it? Milos and Antimilos, Greece [36.78052336, 24.355555146]\r\nWhat's in the photo? The sun shining directly off the surface of the Mediterranean Sea\r\nWho took the photo? An unnamed astronaut … [+3151 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Measures of a 'Double Magic' Atom Reveal an Unexpected Surprise Inside - ScienceAlert", "description": "An experiment bludgeoning special lead atoms with high-speed particles has revealed a shocking surprise.", "url": "https://www.sciencealert.com/measures-of-a-double-magic-atom-reveal-an-unexpected-surprise-inside", "urlToImage": "https://www.sciencealert.com/images/2025/02/atomic-nucleus-getty.jpg", "publishedAt": "2025-02-25T06:35:23Z", "content": "An experiment bludgeoning special lead atoms with high-speed particles has revealed a shocking surprise.\r\nFar from the perfect sphere physicists from the University of Surrey expected to find, the he… [+3427 chars]"}, {"source": {"id": null, "name": "Disabilityscoop.com"}, "author": "Shaun Heasley", "title": "Astronaut With Disability Cleared To Go To Space Station - Disability Scoop", "description": "For the first time, an astronaut with a disability has been cleared for a mission to the International Space Station.", "url": "https://www.disabilityscoop.com/2025/02/25/astronaut-with-disability-cleared-to-go-to-space-station/31317/", "urlToImage": "https://www.disabilityscoop.com/wp-content/uploads/2025/02/ds250225_astronaut.jpg", "publishedAt": "2025-02-25T04:34:36Z", "content": "For the first time, an astronaut with a disability has been cleared for a mission to the International Space Station.\r\nThe European Space Agency said this month that John McFall has received medical … [+1250 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA’s Europa Clipper Uses Mars to Go the Distance - NASA", "description": "The orbiter bound for Jupiter’s moon Europa will investigate whether the moon is habitable, but it first will get the help of Mars’ gravitational force to get", "url": "https://www.nasa.gov/missions/europa-clipper/nasas-europa-clipper-uses-mars-to-go-the-distance/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/1-clipper-mga.png", "publishedAt": "2025-02-25T01:29:04Z", "content": "The orbiter bound for Jupiters moon Europa will investigate whether the moon is habitable, but it first will get the help of Mars gravitational force to get to deep space. \r\nOn March 1, NASAs Europa … [+5984 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Black Hole The Size of 36 Billion Suns Could Lie at The Heart of Cosmic Horseshoe - ScienceAlert", "description": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about five-and-a-half billion light-years away.", "url": "https://www.sciencealert.com/black-hole-the-size-of-36-billion-suns-could-lie-at-the-heart-of-cosmic-horseshoe", "urlToImage": "https://www.sciencealert.com/images/2025/02/horseshoe_lens_header.jpg", "publishedAt": "2025-02-25T01:24:49Z", "content": "In 2007, astronomers discovered the Cosmic Horseshoe, a gravitationally lensed system of galaxies about five-and-a-half billion light-years away.\r\nThe foreground galaxy's mass magnifies and distorts … [+7614 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Surprise Spiral Shape Revealed in The Darkness Surrounding The Solar System - ScienceAlert", "description": "The edge of the Solar System is a strange place, full of oddities we've only just begun to probe.", "url": "https://www.sciencealert.com/surprise-spiral-shape-revealed-in-the-darkness-surrounding-the-solar-system", "urlToImage": "https://www.sciencealert.com/images/2025/02/SolarSystemEdge.jpg", "publishedAt": "2025-02-24T23:44:54Z", "content": "The edge of the Solar System is a strange place, full of oddities we've only just begun to probe. But perhaps the oddest of all is the Oort Cloud, a vast field of icy debris extending out to 100,000 … [+4635 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "You Can Ignore That OPM Email - NASA Watch", "description": "According to a variety of emails and postings and TV stories OPM has told everyone that any response to the Saturday OPM memo is \"voluntary\"", "url": "https://nasawatch.com/personnel-news/you-can-ignore-that-opm-email/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/02/cnnemial.png", "publishedAt": "2025-02-24T23:17:22Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Thetransmitter.org"}, "author": "Claudia López Lloreda", "title": "Exclusive: NIH appears to archive policy requiring female animals in studies - The Transmitter: Neuroscience News and Perspectives", "description": "Such a shift would “put us back in the dark ages in terms of our science,” says neuroscientist Anne Murphy, who helped to formulate the original policy.", "url": "https://www.thetransmitter.org/policy/exclusive-nih-appears-to-archive-policy-requiring-female-animals-in-studies/", "urlToImage": "https://www.thetransmitter.org/wp-content/uploads/2025/02/cropped-sex-gender-research-NIH-525.png", "publishedAt": "2025-02-24T22:01:37Z", "content": "The phrase Historic document published prior to January 20, 2025 now appears on multiple websites of the U.S. National Institutes of Health (NIH) that pertain to its long-standing policy on research … [+3999 chars]"}, {"source": {"id": null, "name": "How-To Geek"}, "author": "Ben Lovejoy", "title": "8 Surprising Things We Wouldn't Have Without Space Travel - How-To Geek", "description": "No, that doesn't include non-stick pans.", "url": "https://www.howtogeek.com/things-we-wouldnt-have-without-space-travel/", "urlToImage": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/02/spacewalk-at-the-iss.jpeg", "publishedAt": "2025-02-24T22:00:00Z", "content": "Summary\r\n<ul><li>\r\n Teflon was not developed for space travel though it did play a significant role in the lunar program.\r\n </li><li>\r\n But a great deal of today's tech did indeed evolve from space t… [+8801 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Clea Simon", "title": "Accidental discovery may hint at answer to a chicken-or-egg question on evolution - Phys.org", "description": "For biochemists, it's the which-came-first question: oxygen production by photosynthesis or oxygen consumption by aerobic metabolism?", "url": "https://phys.org/news/2025-02-accidental-discovery-hint-chicken-egg.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/accidental-discovery-m.jpg", "publishedAt": "2025-02-24T21:48:04Z", "content": "For biochemists, it's the which-came-first question: oxygen production by photosynthesis or oxygen consumption by aerobic metabolism?\r\nIn photosynthesis, algae and plants take in sunlight to turn car… [+5216 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Manon Boot", "title": "Finally solved: How the body's endocannabinoids spread through the brain - Medical Xpress", "description": "Marijuana-like endocannabinoids produced by your own body—how do they travel through the brain? It turns out that these fatty messenger molecules are transported in fatty vesicles. This surprising discovery contrasts with how traditional messenger molecules m…", "url": "https://medicalxpress.com/news/2025-02-body-endocannabinoids-brain.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/finally-solved-how-the.jpg", "publishedAt": "2025-02-24T21:32:38Z", "content": "Marijuana-like endocannabinoids produced by your own bodyhow do they travel through the brain? It turns out that these fatty messenger molecules are transported in fatty vesicles. This surprising dis… [+3028 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "No More Singularities? Quantum Gravity Could Finally Solve the Black Hole Mystery - SciTechDaily", "description": "Scientists have discovered a way to create black holes without the mysterious singularities where physics breaks down. By using pure gravity rather than exotic matter, their new model challenges previous theories and brings us closer to understanding the true…", "url": "https://scitechdaily.com/no-more-singularities-quantum-gravity-could-finally-solve-the-black-hole-mystery/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Gravity-Black-Hole-Concept.jpg", "publishedAt": "2025-02-24T21:19:15Z", "content": "A groundbreaking study has shown that black holes can exist without singularities, eliminating the need for exotic matter. The discovery, based on quantum gravity corrections, offers a more natural e… [+5425 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists discover a protein that reverses cellular aging - Earth.com", "description": "Researchers discovered AP2A1, a protein controlling cellular aging. Lower AP2A1 reversed aging effects, while higher levels sped aging.", "url": "https://www.earth.com/news/scientists-discover-a-protein-that-reverses-cellular-aging/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/24103853/Scientists-discover-protein-that-reverses-cellular-aging.jpg", "publishedAt": "2025-02-24T20:51:15Z", "content": "Throughout history, humanity has chased the elusive promise of eternal youth. From mythical fountains to today’s anti-aging creams, the pursuit of staying forever young remains constant. But beneath … [+4689 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Josh DeLozier", "title": "Scientists reveal key to affordable, room-temperature quantum light - Phys.org", "description": "Quantum light sources are fickle. They can flicker like stars in the night sky and can fade out like a dying flashlight. However, newly published research from the University of Oklahoma proves that adding a covering to one of these light sources, called a co…", "url": "https://phys.org/news/2025-02-scientists-reveal-key-room-temperature.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/scientists-reveal-key.jpg", "publishedAt": "2025-02-24T20:39:03Z", "content": "Quantum light sources are fickle. They can flicker like stars in the night sky and can fade out like a dying flashlight. However, newly published research from the University of Oklahoma proves that … [+3540 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of British Columbia", "title": "Hydrogen becomes a superfluid at nanoscale, confirming 50-year-old prediction - Phys.org", "description": "Hydrogen nano-clusters at low temperatures display 'superfluidity'—a quantum state of frictionless flow only previously observed in helium.", "url": "https://phys.org/news/2025-02-hydrogen-superfluid-nanoscale-year.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/hydrogen-becomes-a-sup.jpg", "publishedAt": "2025-02-24T20:35:03Z", "content": "Hydrogen nano-clusters at low temperatures display 'superfluidity'a quantum state of frictionless flow only previously observed in helium.\r\nThe new research is published in Science Advances by an int… [+2913 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "California’s Sea Level Projections May Be Way Off—Thanks to Sinking Land - Gizmodo", "description": "Analysis by experts at NASA's Jet Propulsion Laboratory indicates a combination of natural and anthropogenic factors are changing California's landscape.", "url": "https://gizmodo.com/californias-sea-level-projections-may-be-way-off-thanks-to-sinking-land-2000567537", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/california-cliffs-nasa-study.jpg", "publishedAt": "2025-02-24T20:25:59Z", "content": "Rising and sinking land across the state of California could affect sea levels in the state in the coming decades, according to an analysis by researchers at NASA’s Jet Propulsion Laboratory.\r\nThe re… [+2576 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Utrecht University", "title": "Mega-iceberg from Antarctica is headed toward South Georgia—here's what could happen - Phys.org", "description": "It is no strange sight to see icebergs break off of the Antarctic ice cap and drift away, like the gigantic sheet of ice that is currently heading for the island of South Georgia. But climate change is making it happen more frequently, with ever-larger iceber…", "url": "https://phys.org/news/2025-02-mega-iceberg-antarctica-south-georgia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/mega-iceberg-from-anta.jpg", "publishedAt": "2025-02-24T20:04:27Z", "content": "It is no strange sight to see icebergs break off of the Antarctic ice cap and drift away, like the gigantic sheet of ice that is currently heading for the island of South Georgia. But climate change … [+7144 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "Powerful X-class solar flare triggers radio blackouts across the Pacific Ocean (video) - Space.com", "description": "An active sunspot region erupted with an X2.0 solar flare this weekend.", "url": "https://www.space.com/the-universe/sun/powerful-x-class-solar-flare-triggers-radio-blackouts-across-the-pacific-ocean-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KtyzWTGusXRpawReC5xmFd-1200-80.gif", "publishedAt": "2025-02-24T20:00:00Z", "content": "The sun ended the weekend with a bang as a sunspot rotating out of our view erupted with a powerful solar flare on Sunday afternoon.\r\nAt 2:27 p.m. EST (1927 GMT) on Sunday, (Feb. 24), a X2.0 solar fl… [+3034 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Mice Discovered Giving ‘First Aid’ to Unconscious Mates in Surprising Display of Empathy - Good News Network", "description": "When presented with an unresponsive acquaintance, a mouse may attempt to revive them by pawing and gently biting at their face, scientists recently reported. A third behavior was also seen, however, and that involved the attendant mouse removing the unconscio…", "url": "https://www.goodnewsnetwork.org/mice-discovered-giving-first-aid-to-unconscious-mates-in-surprising-display-of-empathy/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/A-mouse-tends-to-an-unconscious-peer-by-pulling-its-tongue-credit-Wenjian-Sun-et-al.-2025-e1740405437106.jpg", "publishedAt": "2025-02-24T19:30:17Z", "content": "A mouse tends to an unconscious peer by pulling its tongue – credit: Wenjian Sun et al. 2025, released\r\nWhen presented with an unresponsive acquaintance, a mouse may attempt to revive them by pawing … [+3063 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Dwarf planet Ceres holds evidence of life’s cosmic origins - The Brighter Side of News", "description": "Organic material on Ceres may have originated from asteroid impacts, revealing new insights into the Solar System’s history", "url": "https://www.thebrighterside.news/post/dwarf-planet-ceres-holds-evidence-of-lifes-cosmic-origins/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/02/ceres.jpg?auto=webp", "publishedAt": "2025-02-24T19:07:00Z", "content": "Ceres, the largest object in the asteroid belt, may hold answers to fundamental questions about the Solar System. This dwarf planet, positioned between Mars and Jupiter, is the only inner Solar Syste… [+6939 chars]"}, {"source": {"id": null, "name": "SpaceCoastDaily.com"}, "author": "Space Coast Daily", "title": "SpaceX Pushes Falcon 9 Rocket Launch Tonight to Tuesday from Cape Canaveral - SpaceCoastDaily.com", "description": "SpaceX is targeting Monday, February 24 for a Falcon 9 launch of 21 Starlink satellites, including 13 with Direct to Cell capabilities, to low-Earth orbit from Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station in Florida.", "url": "https://spacecoastdaily.com/2025/02/watch-live-spacex-ready-to-launch-falcon-9-rocket-tonight-from-cape-canaveral-3/", "urlToImage": "https://spacecoastdaily.com/wp-content/uploads/2019/11/SpaceX-Starlink-580-2.jpg", "publishedAt": "2025-02-24T17:50:27Z", "content": "Home » Home » SpaceX Pushes Falcon 9 Rocket Launch Tonight to Tuesday from Cape CanaveralBy Space Coast Daily  //  February 24, 2025 \r\nWATCH LIVE:SpaceX Ready to Launch Falcon 9 Rocket Tonight from C… [+981 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Elon Musk Wants To Crash The International Space Station Into The Earth 3 Years Early - IFLScience", "description": "He seems to have forgotten the \"international\" part of the International Space Station.", "url": "https://www.iflscience.com/elon-musk-wants-to-crash-the-international-space-station-into-the-earth-3-years-early-78177", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78177/aImg/82325/musk-meta.png", "publishedAt": "2025-02-24T16:34:43Z", "content": "SpaceX CEO and head of the Department of Government Efficiency (DOGE) Elon Musk has said he wants to deorbit the International Space Station \"as soon as possible\", pushing it towards the Earth years … [+4673 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "The Surprising Truth Behind the Neanderthal Population Crash 110000 Years Ago - Indian Defence Review", "description": "New research reveals a mysterious Neanderthal population crash 110,000 years ago, reshaping their evolution and genetic diversity. Discover the latest findings.", "url": "https://indiandefencereview.com/truth-behind-neanderthal-population-crash/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Neanderthal-Population.jpg", "publishedAt": "2025-02-24T16:30:00Z", "content": "Neanderthal population, a species that thrived in Eurasia for over 250,000 years, experienced a dramatic decline in genetic diversity around 110,000 years ago. Recent studies indicate that this event… [+3610 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "Scientists Find Greenland Ice Sheet's Point of No Return - Newser", "description": "Climate modeling study suggests collapse could become inevitable sooner than you might think", "url": "https://www.newser.com/story/364740/scientists-find-greenland-ice-sheets-point-of-no-return.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1594591-12-20250224103547.jpeg", "publishedAt": "2025-02-24T16:21:00Z", "content": "Greenland's ice sheet, one of only two permanent ice sheets on Earth, loses a reported 33 million tons of ice every hour, or almost 290 billion tons per year. Hovering at around 650,000 square miles,… [+1961 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Exoplanet with iron rain has violent winds 'like something out of science fiction' - Livescience.com", "description": "\"Even the strongest hurricanes in the solar system seem calm in comparison.\"", "url": "https://www.space.com/wasp-121b-violent-winds-science-fiction", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ebxa7euHP4toZZ9EJrJRWS-1200-80.jpg", "publishedAt": "2025-02-24T16:00:00Z", "content": "WASP-121 b is the definition of an \"extreme\" exoplanet — it's so hot that it rains droplets of liquid iron. Now, astronomers have discovered that this planet, located around 900 light-years away from… [+4638 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NASA", "title": "Hubble spies a spiral that may be hiding an imposter - Phys.org", "description": "The sparkling spiral galaxy gracing this NASA/ESA Hubble Space Telescope image is UGC 5460, which sits about 60 million light-years away in the constellation Ursa Major. This image combines four different wavelengths of light to reveal UGC 5460's central bar …", "url": "https://phys.org/news/2025-02-hubble-spies-spiral-imposter.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/hubble-spies-a-spiral.jpg", "publishedAt": "2025-02-24T15:13:26Z", "content": "The sparkling spiral galaxy gracing this NASA/ESA Hubble Space Telescope image is UGC 5460, which sits about 60 million light-years away in the constellation Ursa Major. This image combines four diff… [+1789 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Largest structure ever found in the universe is 1.4 billion light years long - Earth.com", "description": "Seen as a long strand with smaller threads branching, the Quipu superstructure contains 68 galaxy clusters spanning 1.4 billion light years.", "url": "https://www.earth.com/news/largest-structure-in-universe-is-1-4-billion-light-years-long-quipu-superstructure/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/22101915/open-cluster_wide-field_superstructure_universe_Webb_1m.jpg", "publishedAt": "2025-02-24T15:02:50Z", "content": "The Universe contains many types of massive formations that shape our understanding of how stars and galaxies group together. Astronomers have long studied these sprawling patterns, which give valuab… [+5833 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "NASA installs 'bulletproof' sunshade on powerful Nancy Grace Roman Space Telescope (photos) - Space.com", "description": "\"The successful integration was both a proud moment and a relief!\"", "url": "https://www.space.com/space-exploration/missions/nasa-installs-bulletproof-sunshade-on-powerful-nancy-grace-roman-space-telescope-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JHd7NPnEYiyKSgQpcCTzam-1200-80.jpg", "publishedAt": "2025-02-24T14:00:00Z", "content": "The team working on NASA's Nancy Grace Roman Space Telescope has announced the successful installation of the observatory's sunshade.\r\nThis visor-like shade serves as a deployable aperture cover, blo… [+4259 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Chris Stokel-Walker", "title": "We gave an AI a Rorschach test. What it saw in the inkblots offers a window into the human mind - BBC.com", "description": "Rorschach tests play with the human imagination and our mind's ability to impart meaning onto the world around us – but what does AI see in them?", "url": "https://www.bbc.com/future/article/20250224-what-happens-when-you-give-an-ai-a-rorschach-inkblot-test", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0kt8pw0.jpg", "publishedAt": "2025-02-24T14:00:00Z", "content": "Rorschach tests play with the human imagination and our mind's ability to impart meaning onto the world around us but what does AI see in them?\r\nFor more than a century, the Rorschach inkblot test ha… [+11320 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "SpaceX has an explanation for the Falcon 9 bits that hit Poland - The Register", "description": "Oxygen leak blamed for a lack of deorbit burn", "url": "https://www.theregister.com/2025/02/24/spacex_falcon_9_debris/", "urlToImage": "https://regmedia.co.uk/2021/03/03/umbrella_storm_shutterstock.jpg", "publishedAt": "2025-02-24T12:50:00Z", "content": "SpaceX has published an explanation for the debris from the Falcon 9 second stage that fell over Poland last week. Because of an oxygen leak, the expected deorbit burn didn't occur.\r\nThe second stage… [+2685 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s LRO Snaps a Rare Photo of a Bizarre Spacecraft Speeding at 11,500 KM/H over the Moon’s Orbit — We Finally Know What It Is - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s Lunar Reconnaissance Orbiter just snapped an unexpected photo of another spacecraft racing past the Moon. The image reveals a bizarre, elongated shape streaking through space at breakneck speeds.", "url": "https://dailygalaxy.com/2025/02/nasas-lro-snaps-a-rare-photo-of-a-bizarre-spacecraft-speeding-at-11500-km-h-over-the-moons-orbit-we-finally-know-what-it-is/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Photo-Op-as-It-Zips-Past-SKoreas-Danuri-Moon-Orbiter.jpg", "publishedAt": "2025-02-24T12:45:00Z", "content": "In a rare cosmic alignment, NASAs Lunar Reconnaissance Orbiter (LRO) successfully captured images of South Koreas Danuri lunar orbiter as the two spacecraft zipped past each other in lunar orbit. \r\nT… [+3350 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "This Apex Predator Was ‘King of the Ancient Egyptian Forest’ Then Mysteriously Went Extinct - Good News Network", "description": "Hyainailourinae means Hyena-cats, and these more feline-like creatures first appeared in Africa about 47 million years ago.", "url": "https://www.goodnewsnetwork.org/this-apex-predator-was-king-of-the-ancient-egyptian-forest-then-mysteriously-went-extinct/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/Bastetodon-syrtos-skull.jpg", "publishedAt": "2025-02-24T12:00:50Z", "content": "Bastetodon syrtos skull – credit: Shoruq Al-Ashqar, released.\r\nFrom the sands of Egypt’s Western Desert, a nearly complete skull of a prehistoric apex predator offers scientists the chance to underst… [+4354 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Jon Martindale", "title": "New Horizons Probe to Cross Termination Shock Zone 20 Years After Voyager 1 - ExtremeTech", "description": "Instruments aboard the much newer spacecraft should give us new insights.", "url": "https://www.extremetech.com/science/new-horizons-probe-to-cross-termination-shock-zone-20-years-after-voyager", "urlToImage": "https://i.extremetech.com/imagery/content-types/045lbzDb8FO2CRUrYBUcZs4/hero-image.fill.size_1200x675.jpg", "publishedAt": "2025-02-24T12:00:00Z", "content": "The New Horizons probe\r\n, which delivered stunning images of Pluto in 2015\r\n, is set to cross the “termination shock” on the boundary of the Sun’s heliosphere over 20 years since Voyager 1 first made… [+2878 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Game-Changing Method Turns Carbon Dioxide Into Usable Energy With Incredible Efficiency - SciTechDaily", "description": "Scientists have developed a highly efficient dual-site catalyst that improves methanol production from carbon dioxide, increasing efficiency by 1.5 times and offering a promising step toward greener fuel and chemical production. Methanol, a key component in m…", "url": "https://scitechdaily.com/game-changing-method-turns-carbon-dioxide-into-usable-energy-with-incredible-efficiency/", "urlToImage": "https://scitechdaily.com/images/Carbon-Dioxide-Smokestack-Capture.jpg", "publishedAt": "2025-02-24T11:42:01Z", "content": "Researchers, including two from Oregon State University, have developed a novel dual-site electrocatalyst that significantly improves methanol production efficiency from carbon dioxide. The new catal… [+4949 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "Where will the 'Blood Moon' total lunar eclipse be visible in March 2025? - Space.com", "description": "A total lunar eclipse on March 13-14, 2025, will be visible across Earth's night side. See detailed maps of where and when to watch the dramatic 'Blood Moon'.", "url": "https://www.space.com/where-blood-moon-total-lunar-eclipse-visible-march-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RLJgDy6pY4j2VVfYJZbXaS-1200-80.jpg", "publishedAt": "2025-02-24T11:00:00Z", "content": "A total lunar eclipse will occur on March 13-14, 2025\r\n — the first on Earth since 2022 — but only the night side of the planet will get to see it. During this global event, which will occur at the s… [+7951 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "See A Crescent Moon, Venus And The Northern Lights: The Night Sky This Week - Forbes", "description": "Each Monday, I pick out North America’s celestial highlights for the week ahead (which also applies to northern hemisphere mid-northern latitudes).", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/02/24/see-a-crescent-moon-venus-and-the-northern-lights-the-night-sky-this-week/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67752188392672890676090c/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-24T11:00:00Z", "content": "This week, see a crescent moon with Venus in the western sky after sunset. \r\ngetty\r\nEach Monday, I pick out North Americas celestial highlights for the week ahead (which also applies to northern hemi… [+3481 chars]"}]}