{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Scientists Record First-Ever Brain Waves From Freely Moving Octopuses - Neuroscience News", "description": "By implanting electrodes and monitoring data, researchers have successfully captured the brain activity of freely moving octopuses. The recorded brain activity could solve numerous questions about octopus behaviors including movement, cognition, and learning …", "url": "https://neurosciencenews.com/octopus-brain-waves-22554/", "urlToImage": "https://neurosciencenews.com/files/2023/02/octopus-brain-waves-neurosinces.jpg", "publishedAt": "2023-02-23T23:04:38Z", "content": "Summary: By implanting electrodes and monitoring data, researchers have successfully captured the brain activity of freely moving octopuses. The recorded brain activity could solve numerous questions… [+6483 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "Texas struck by meteor the size of a thousand-pound corgi - Boing Boing", "description": "From The Jerusalem Post: A meteor around the size of a Pembroke Welsh Corgi and weighing around the total weight of four baby elephants struck the Earth near McAllen, Texas last Wednesday, NASA con…", "url": "https://boingboing.net/2023/02/23/texas-struck-by-meteor-the-size-of-a-thousand-pound-corgi.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/02/4694470234_6f27a4f602_o.jpg?fit=1069%2C802&ssl=1", "publishedAt": "2023-02-23T22:17:05Z", "content": "From The Jerusalem Post:\r\nA meteor around the size of a Pembroke Welsh Corgi and weighing around the total weight of four baby elephants struck the Earth near McAllen, Texas last Wednesday, NASA conf… [+1980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "Russia to launch replacement spacecraft for astronauts stranded by coolant leak - CNN", "description": "Russia is gearing up to launch a Soyuz spacecraft to the International Space Station that will replace a capsule that sprang a coolant leak in December, leaving two cosmonauts and one NASA astronaut without a ride home.", "url": "https://www.cnn.com/2023/02/23/world/russia-spacecraft-leak-rescue-soyuz-launch-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230111091616-nasa-soyuz-2022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-23T21:11:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nRussia is gearing up to launch a Soyuz spacecraft to t… [+4070 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Detect \"Heartbeat-Like\" Signal From the Sun - Futurism", "description": "A team of researchers has made an unusual discovery: a series of \"heartbeat\"-like radio bursts emanating from a solar flare above the Sun's surface.", "url": "https://futurism.com/the-byte/scientists-detect-heartbeat-signal-sun", "urlToImage": "https://wp-assets.futurism.com/2023/02/scientists-detect-heartbeat-signal-sun.jpg", "publishedAt": "2023-02-23T16:59:45Z", "content": "\"The discovery is unexpected.\"\r\nSeeing Patterns\r\nA team of researchers has made an unusual discovery: a series of \"heartbeat\"-like radio bursts emanating from a solar flare thousands of miles above t… [+2062 chars]"}, {"source": {"id": null, "name": "KSAT San Antonio"}, "author": "Julie Moreno", "title": "View Jupiter and Venus near the Moon just after sunset this week - KSAT San Antonio", "description": "The two brightest planets in our sky are getting cozy this month. Jupiter and Venus will appear close together each evening just after sunset and will be visible near the waxing crescent Moon.", "url": "https://www.ksat.com/news/local/2023/02/23/view-the-jupiter-and-venus-near-the-moon-just-after-sunset-this-week/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/4TJ3K4LUN5GDRM2K4N53SK45ZA.png?_a=ATO2Bfe0", "publishedAt": "2023-02-23T15:56:37Z", "content": "SAN ANTONIO Hey Venus...\r\nThe two brightest planets in our sky are getting cozy this month. Jupiter and Venus will appear close together each evening just after sunset and will be visible near the wa… [+767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The quantum twisting microscope: A new lens on quantum materials - Phys.org", "description": "One of the striking aspects of the quantum world is that a particle, say, an electron, is also a wave, meaning that it exists in many places at the same time. In a new study, reported today in Nature, researchers from the Weizmann Institute of Science make us…", "url": "https://phys.org/news/2023-02-quantum-microscope-lens-materials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-quantum-twisting-m.jpg", "publishedAt": "2023-02-23T15:50:49Z", "content": "One of the striking aspects of the quantum world is that a particle, say, an electron, is also a wave, meaning that it exists in many places at the same time. In a new study, reported today in Nature… [+7357 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Two new gas giant exoplanets discovered with TESS - Phys.org", "description": "Astronomers report the detection of two new gas giant exoplanets using NASA's Transiting Exoplanet Survey Satellite (TESS). The newfound alien worlds, designated TOI-3984A b and TOI-5293A b, have very short orbital periods. The discovery was detailed in a pap…", "url": "https://phys.org/news/2023-02-gas-giant-exoplanets-tess.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/two-new-gas-giant-exop.jpg", "publishedAt": "2023-02-23T15:00:02Z", "content": "Astronomers report the detection of two new gas giant exoplanets using NASA's Transiting Exoplanet Survey Satellite (TESS). The newfound alien worlds, designated TOI-3984A b and TOI-5293A b, have ver… [+3346 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Holly Ober", "title": "Study explains how Enceladus ejects particles from oceans beneath its surface - Phys.org", "description": "Although it is relatively small, Enceladus—the sixth largest of Saturn's 83 moons—has been considered by astronomers to be one of the more compelling bodies in our solar system.", "url": "https://phys.org/news/2023-02-enceladus-ejects-particles-oceans-beneath.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/study-explains-how-enc.jpg", "publishedAt": "2023-02-23T14:59:26Z", "content": "Although it is relatively small, Enceladusthe sixth largest of Saturn's 83 moonshas been considered by astronomers to be one of the more compelling bodies in our solar system.\r\nEnceladus stands apart… [+4718 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "Dark energy could lead to a second (and third, and fourth) Big Bang, new research suggests - Livescience.com", "description": "Scientists have proposed a way that the universe could stop expanding, ending in a 'Big Crunch' that resets space and time as we know it.", "url": "https://www.livescience.com/dark-energy-could-lead-to-a-second-and-third-and-fourth-big-bang-new-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MkPxrFuT8NyUVS49r9XWdH-1200-80.jpg", "publishedAt": "2023-02-23T13:00:00Z", "content": "Will the universe end in a bang or a whimper? A pair of theoretical physicists have proposed a third path: perhaps the universe will never end.\r\nIn a study that attempts to define the nature of dark … [+3557 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "NASA Help Wanted: Ham Radio Operators Please Apply - Hackaday", "description": "NASA’s been recruiting citizen scientists lately, and their latest call is looking for help from ham radio operators. They want you to make and report radio contacts during the 2023 and 2024 …", "url": "https://hackaday.com/2023/02/23/nasa-help-wanted-ham-radio-operators-please-apply/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/02/ham.png", "publishedAt": "2023-02-23T12:00:00Z", "content": "NASA’s been recruiting citizen scientists lately, and their latest call is looking for help from ham radio operators. They want you to make and report radio contacts during the 2023 and 2024 North Am… [+1334 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "In Pictures: Saturn V, the NASA Rocket That Went to the Moon - Gizmodo", "description": "The Saturn V rocket remains one of NASA's greatest technological achievements—a powerful launch vehicle that finally brought the Moon within reach.", "url": "https://gizmodo.com/saturn-v-rocket-nasa-moon-launch-sls-space-missions-1850141507", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/5725f9e6491215c1d87ac038aaa3d865.jpg", "publishedAt": "2023-02-23T12:00:00Z", "content": "We choose to go to the Moon in this decade and do the other things, not because they are easy, but because they are hard, President John Kennedy said famously in a 1962 speech. A bold goal, and a goa… [+703 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "The Milky Way's monster black hole is destroying a mysterious dust cloud - Space.com", "description": "A dust filament 3,000 times as long as the sun-Earth distance is being destroyed by the Milky Way's black hole in front of astronomers' eyes.", "url": "https://www.space.com/monster-black-hole-milky-way-shredding-mysterious-dust-cloud", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bHcEuVxCV6Yjm6CbDueAGg-1200-80.jpg", "publishedAt": "2023-02-23T11:00:24Z", "content": "The supermassive black hole at the center of our Milky Way galaxy is tearing apart a strange dust cloud, and astronomers are observing the spectacle  as it happens.\r\nThe dust cloud, called X7 and abo… [+4138 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Francesca Benson", "title": "Mother Shipton's Petrifying Well Appears To Turn Toys Into Stone - IFLScience", "description": "Near Mother Shipton's Cave, the incredible phenomenon can be explained by geology and chemistry.", "url": "https://www.iflscience.com/mother-shipton-s-petrifying-well-appears-to-turn-toys-into-stone-67679", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67679/aImg/65948/teddy-bears-underpants-and-an-ice-skate-hung-up-at-the-petrifying-well-meta.jpg", "publishedAt": "2023-02-23T08:26:00Z", "content": "If youre keen to see eerie objects that look like theyve been turned to stone, Mother Shiptons petrifying well in Knaresborough, England, is the place to be. Due to a quirk of local geology, the petr… [+3720 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 23 February 2023: The weird Spiral Galaxy Arp 78 - HT Tech", "description": "NASA’s Astronomy Picture of the Day is an enthralling picture of the peculiar Spiral Galaxy Arp 78.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-23-february-2023-the-weird-spiral-galaxy-arp-78-71677131670075.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/23/1600x900/spiral_1677131942063_1677131949651_1677131949651.jpg", "publishedAt": "2023-02-23T05:59:51Z", "content": "Gravity binds a galaxy, which is a vast assembly of gas, dust, billions of stars, and their respective solar systems. Galaxies exhibit an array of sizes, ranging from diminutive dwarf galaxies with a… [+1868 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "This Weird-Looking Fungus Could Be a Biodegradable Alternative to Plastic - ScienceAlert", "description": "The tinder fungus (Fomes fomentarius)  has some surprising properties, scientists have discovered: properties that could enable it to provide a natural, biodegradable alternative to certain plastics and other materials in the future.", "url": "https://www.sciencealert.com/this-weird-looking-fungus-could-be-a-biodegradable-alternative-to-plastic", "urlToImage": "https://www.sciencealert.com/images/2023/02/FomesFomentarius.jpg", "publishedAt": "2023-02-23T03:41:21Z", "content": "The tinder fungus (Fomes fomentarius) has some surprising properties, scientists have discovered: properties that could enable it to provide a natural, biodegradable alternative to certain plastics a… [+3525 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The White Specks in This Image Aren't Stars or Galaxies. They're Black Holes - ScienceAlert", "description": "The image above may look like a fairly normal picture of the night sky, but what you're looking at is a lot more special than just glittering stars.", "url": "https://www.sciencealert.com/the-white-specks-in-this-image-arent-stars-or-galaxies-theyre-black-holes", "urlToImage": "https://www.sciencealert.com/images/2021-02/processed/black_hole_sky_map_cover_1024.jpg", "publishedAt": "2023-02-23T03:36:19Z", "content": "The image above may look like a fairly normal picture of the night sky, but what you're looking at is a lot more special than just glittering stars. Each of those white dots is an active supermassive… [+2720 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study: Evolution of Uniquely Human DNA Was a Delicate Balancing Act - SciTechDaily", "description": "Many alterations to the genomes of early humans had opposing effects, likely due to a delicate balance between enhanced cognitive abilities and an increased risk of psychiatric disorders. Humans and chimpanzees share 99% of their DNA, with human accelerated r…", "url": "https://scitechdaily.com/new-study-evolution-of-uniquely-human-dna-was-a-delicate-balancing-act/", "urlToImage": "https://scitechdaily.com/images/Light-DNA-Genetics.jpg", "publishedAt": "2023-02-23T03:20:32Z", "content": "ByGladstone InstitutesFebruary 22, 2023\r\nResearchers at Gladstone Institutes have conducted an analysis of numerous human and chimpanzee HARs and found that a number of the modifications that occurre… [+6886 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "A New Battery In Development Means We Might Be Able to Spend The Day On Venus - ScienceAlert", "description": "Sending a lander to Venus presents several huge engineering problems.", "url": "https://www.sciencealert.com/a-new-battery-in-development-means-we-might-be-able-to-spend-the-day-on-venus", "urlToImage": "https://www.sciencealert.com/images/2023/02/venus_surface_venera13.jpg", "publishedAt": "2023-02-23T00:10:23Z", "content": "Sending a lander to Venus presents several huge engineering problems. Granted, we'd get a break from the nail-biting entry, descent, and landing, since Venus' atmosphere is so thick a lander would se… [+4226 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers make a new type of quantum material with a dramatic distortion pattern - Phys.org", "description": "Researchers at the Department of Energy's SLAC National Accelerator Laboratory and Stanford University have created a new type of quantum material whose atomic scaffolding, or lattice, has been dramatically warped into a herringbone pattern.", "url": "https://phys.org/news/2023-02-quantum-material-distortion-pattern.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/slac-stanford-research.jpg", "publishedAt": "2023-02-22T21:34:48Z", "content": "Researchers at the Department of Energy's SLAC National Accelerator Laboratory and Stanford University have created a new type of quantum material whose atomic scaffolding, or lattice, has been drama… [+5025 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Amanda Kooser", "title": "Scientists Sleuth Out Meteorite Crater at a French Winery - CNET", "description": "Previous geologists had pooh-poohed the idea of the crater coming from a meteorite.", "url": "https://www.cnet.com/science/space/scientists-sleuth-out-meteorite-crater-at-a-french-winery/", "urlToImage": "https://www.cnet.com/a/img/resize/0b48bf0e2bfb325b2e3e6a2d4499c3d9522415d2/hub/2023/02/22/2ddee28a-caaf-44fb-9a85-aa0df2788bdb/trou-de-meteore-c-frankbrenker.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-02-22T21:25:00Z", "content": "The Domaine du Meteore winery in southern France got its name from a dramatic depression in the ground where it grows grape vines. Turns out the name is more than a marketing ploy. Geologist and cosm… [+2223 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Animals' 'sixth sense' is more widespread than previously thought - Phys.org", "description": "A study using fruit flies, led by researchers at the Universities of Manchester and Leicester, supported by the National Physical Laboratory, has suggested that the animal world's ability to sense a magnetic field may be more widespread than previously though…", "url": "https://phys.org/news/2023-02-animals-sixth-widespread-previously-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/animals-sixth-sense-mo.jpg", "publishedAt": "2023-02-22T20:22:04Z", "content": "A study using fruit flies, led by researchers at the Universities of Manchester and Leicester, supported by the National Physical Laboratory, has suggested that the animal world's ability to sense a … [+5260 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Physicists give the first law of thermodynamics a makeover - Phys.org", "description": "West Virginia University physicists have made a breakthrough on an age-old limitation of the first law of thermodynamics.", "url": "https://phys.org/news/2023-02-physicists-law-thermodynamics-makeover.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/wvu-physicists-give-th.jpg", "publishedAt": "2023-02-22T19:09:41Z", "content": "West Virginia University physicists have made a breakthrough on an age-old limitation of the first law of thermodynamics.\r\nPaul Cassak, professor and associate director of the Center for KINETIC Plas… [+5229 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "", "title": "NASA studies earth dust from space - CNN", "description": "Allison Chinchar reports for Transformers on the space technology helping in the climate change fight", "url": "https://www.cnn.com/videos/business/2023/02/22/exp-nasa-weather-transformer-chinchar-022109aseg2-cnni-business.cnn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230222125436-exp-nasa-weather-transformer-chinchar-022109aseg2-cnni-business-00003828.png?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-22T17:58:36Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "97% of the Age of the Universe – Astronomers Confirm Age of Most Distant Galaxy With Oxygen - SciTechDaily", "description": "A new study led by a joint team at Nagoya University and the National Astronomical Observatory of Japan has measured the cosmic age of a very distant galaxy. The team used the ALMA radio telescope array to detect a radio signal that has been traveling for app…", "url": "https://scitechdaily.com/97-of-the-age-of-the-universe-astronomers-confirm-age-of-most-distant-galaxy-with-oxygen/", "urlToImage": "https://scitechdaily.com/images/Galaxy-GHZ2-GLASS-z12-ALMA-Spectrum.jpg", "publishedAt": "2023-02-22T17:22:17Z", "content": "ByRoyal Astronomical SocietyFebruary 22, 2023\r\nThe radio telescope array ALMA has pin-pointed the exact cosmic age of a distant JWST-identified galaxy, GHZ2/GLASS-z12, at 367 million years after the … [+6488 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Powerful X-class flare spat out a rare 'solar tsunami,' and you can hear it smashing into Earth - Yahoo Life", "description": "The sun recently spat out an X-class solar flare, one of the most powerful it can emit, which triggered a rare shockwave across the sun's surface and caused radio blackouts on Earth.", "url": "https://www.livescience.com/powerful-x-class-flare-spat-out-a-rare-solar-tsunami-and-you-can-hear-it-smashing-into-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Z4ThgkifBoRseCZEXPQ92d-1200-80.gif", "publishedAt": "2023-02-22T17:09:26Z", "content": "A clip of the X-class flare erupting from the sun on Feb. 17 followed by a 'solar tsunami' that is visible as a faint shockwave in the surrounding region. (Image credit: NASA/Solar Dynamics Observato… [+3712 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Laurence Tognetti", "title": "Titan's icy crust creates tides in the moon's subsurface ocean - Space.com", "description": "Saturn's largest moon Titan is an intriguing world that looks a bit like Earth but not quite so.", "url": "https://www.space.com/saturn-moon-titan-ocean-tides-icy-crust-study", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ovtrNjYFeZiRawWh7vkEPK-1200-80.jpg", "publishedAt": "2023-02-22T16:37:34Z", "content": "Saturn's moon Titan is an odd world. Studied in close detail by NASA's Cassini mission and other spacecraft, Titan is so cold that seas and lakes of liquid methane and ethane form on its surface. But… [+4819 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Rogue Gas Giant, Fish In Space, Detecting Primordial Black Holes | Q&A 212 - Fraser Cain", "description": "What effect would a rogue gas giant have if it flew through the Solar System? Can fish survive in microgravity and go to space? Do hypervelocity stars leave ...", "url": "https://www.youtube.com/watch?v=gLGx7l_Q4yk", "urlToImage": "https://i.ytimg.com/vi/gLGx7l_Q4yk/maxresdefault.jpg", "publishedAt": "2023-02-22T16:30:44Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Structure of the human DICER–pre-miRNA complex in a dicing state - Nature.com", "description": "The active-state structure of human DICER bound to pre-miRNA reveals the structural basis for the specificity of DICER in how it selects substrates in a sequence dependent manner, and sheds light on DICER-related diseases.", "url": "https://www.nature.com/articles/s41586-023-05723-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05723-3/MediaObjects/41586_2023_5723_Fig1_HTML.png", "publishedAt": "2023-02-22T16:17:47Z", "content": "<li>Elbashir, S. M., Lendeckel, W. &amp; Tuschl, T. RNA interference is mediated by 21- and 22-nucleotide RNAs. Genes Dev.15, 188200 (2001).\r\nArticle \r\n CAS \r\n PubMed \r\n PubMed Central \r\nGoogle Schol… [+12603 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Weak upper-mantle base revealed by postseismic deformation of a deep earthquake - Nature.com", "description": "The Earth’s mantle viscosity is studied following a deep earthquake located near the bottom of the upper mantle, and a weak layer is detected that is consequential to the understanding of mantle dynamics.", "url": "https://www.nature.com/articles/s41586-022-05689-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-05689-8/MediaObjects/41586_2022_5689_Fig1_HTML.png", "publishedAt": "2023-02-22T16:17:47Z", "content": "<li>Karato, S.Rheology of the Earths mantle: a historical review. Gondwana Res.18, 1745 (2010).\r\nArticle \r\n ADS \r\nGoogle Scholar \r\n</li><li>King, S. D. Reconciling laboratory and observational models… [+6456 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Topological spin texture in the pseudogap phase of a high-Tc superconductor - Nature.com", "description": "Using Lorentz transmission electron microscopy, one of the first direct observations of topological spin texture is described, in the pseudogap phase of a high-temperature cuprate superconductor based on YBa2Cu3O6+x.", "url": "https://www.nature.com/articles/s41586-023-05731-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05731-3/MediaObjects/41586_2023_5731_Fig1_HTML.png", "publishedAt": "2023-02-22T16:17:47Z", "content": "<li>Sonier, J. E. et al. Anomalous weak magnetism in superconducting YBa2Cu3O6+x. Science292, 16921695 (2001).\r\nArticle \r\n ADS \r\n CAS \r\nGoogle Scholar \r\n</li><li>Kaminski, A. et al. Spontaneous break… [+6476 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Geometric frustration of Jahn–Teller order in the infinite-layer lattice - Nature.com", "description": "A distorted infinite-layer lattice of single-crystal CaCoO2 originates from competition between an ordered Jahn–Teller effect and geometric frustration.", "url": "https://www.nature.com/articles/s41586-022-05681-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-022-05681-2/MediaObjects/41586_2022_5681_Fig1_HTML.png", "publishedAt": "2023-02-22T16:13:25Z", "content": "<li>Jahn, H. A. &amp; Teller, E. Stability of polyatomic molecules in degenerate electronic states Iorbital degeneracy. Proc. R. Soc. Lond.161, 220235 (1937).\r\nADS \r\n CAS \r\n MATH \r\nGoogle Scholar \r\n<… [+9726 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "In search of Planet 9: An unconventional detection approach - Phys.org", "description": "There is a mystery in our solar system surrounding the orbits of Kuiper belt objects. More than one trillion icy objects smaller than our moon orbit the sun in a donut-shaped ring beyond Neptune. Oddly, a cluster of outer Kuiper belt objects all ellipse in a …", "url": "https://phys.org/news/2023-02-planet-unconventional-approach.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/in-search-of-planet-9.jpg", "publishedAt": "2023-02-22T16:10:02Z", "content": "There is a mystery in our solar system surrounding the orbits of Kuiper belt objects. More than one trillion icy objects smaller than our moon orbit the sun in a donut-shaped ring beyond Neptune. Odd… [+4592 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA's Chandra Discovers Giant Black Holes on Collision Course - NASA", "description": "NASA’s Chandra X-ray Observatory helped identify two pairs of dwarf galaxies on track to merge.", "url": "https://www.nasa.gov/mission_pages/chandra/images/nasas-chandra-discovers-giant-black-holes-on-collision-course.html", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/bh_pairs.jpg", "publishedAt": "2023-02-22T15:28:08Z", "content": null}, {"source": {"id": null, "name": "FOX 35 Orlando"}, "author": "FOX 35 Orlando", "title": "SpaceX delays next Starlink mission from Florida to Sunday - FOX 35 Orlando", "description": "SpaceX is targeting this Sunday to launch its next Starlink mission from Florida's Space Coast.", "url": "https://www.fox35orlando.com/news/spacex-to-launch-next-starlink-mission-from-florida-on-thursday", "urlToImage": "https://images.foxtv.com/static.fox35orlando.com/www.fox35orlando.com/content/uploads/2020/01/1280/720/falcon9-starlink1.jpg?ve=1&tl=1", "publishedAt": "2023-02-22T15:19:41Z", "content": "Watch the launch live\r\n<ul><li>A Falcon 9 rocket is scheduled to lift off on Feb. 27 from Space Launch Complex 40 at Cape Canaveral Space Force Station at 1:37 p.m. \r\n</li></ul>\r\nCAPE CANAVERAL, Fla.… [+981 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Greg Evans", "title": "Scientists troubled by 'doomsday glacier' discovery - indy100", "description": "Scientists have been left shocked and worried by a recent discovery made beneath the Thwaites Glacier in Antarctica, otherwise known as the 'doomsday glacier.'The huge amount of ice has been destablised and has been reduced by nearly nine miles since the 1990…", "url": "https://www.indy100.com/science-tech/doomsday-glacier-thwaites-climate-change-2659452693", "urlToImage": "https://www.indy100.com/media-library/18-years-of-satellite-imagery-shows-receding-of-thwaites-glacier.jpg?id=33056526&width=1200&height=600&coordinates=0%2C16%2C0%2C154", "publishedAt": "2023-02-22T13:54:30Z", "content": "Scientists have been left shocked and worried by a recent discovery made beneath the Thwaites Glacier in Antarctica, otherwise known as the 'doomsday glacier.'\r\nThe huge amount of ice has been destab… [+2823 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Mars helicopter Ingenuity's historic 1st flights shed light on Martian dust dynamics - Space.com", "description": "'There's a reason that helicopter pilots on Earth prefer to land on helipads.'", "url": "https://www.space.com/mars-helicopter-ingenuity-flights-dust-dynamics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oJWjgKKts56uAZsx2bfidC-1200-80.jpg", "publishedAt": "2023-02-22T13:00:56Z", "content": "In April 2021, a camera on NASA's Perseverance Mars rover recorded its tiny robotic cousin Ingenuity lifting off on the Red Planet. \r\nForaying 10 feet (3 meters) into the Martian sky, the 4-pound (1.… [+5707 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Kate Ravilious", "title": "Terrawatch: why has the Earth's spinning inner core slowed down? - The Guardian", "description": "The solid inner core is contained within the liquid outer core, enabling it to rotate differently from the Earth itself", "url": "https://www.theguardian.com/science/2023/feb/22/terrawatch-earth-spinning-inner-core-slowed-down", "urlToImage": "https://i.guim.co.uk/img/media/7669ab901a4adc9283d065c8f291c00601d696cc/0_558_5365_3217/master/5365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b16e329fa11b31cd4e455c228aea9af5", "publishedAt": "2023-02-22T12:18:00Z", "content": "Earths inner core appears to have stopped spinning faster than its mantle. New measurements suggest that the rotation of the inner core has slowed in recent decades and is now about to reverse direct… [+1197 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Paul Sutter", "title": "The early universe was crammed with stars 10000 times the size of our sun, new study suggests - Livescience.com", "description": "When the universe's first stars emerged from the cosmic dark ages, they ballooned to 10,000 times the mass of Earth's sun, new research suggests.", "url": "https://www.livescience.com/the-early-universe-was-crammed-with-stars-10000-times-the-size-of-our-sun-new-study-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GKLjeSN7gb6erLoeZqHsHE-1200-80.jpg", "publishedAt": "2023-02-22T11:00:00Z", "content": "The first stars in the cosmos may have topped out at over 10,000 times the mass of the sun\r\n, roughly 1,000 times bigger than the biggest stars alive today, a new study has found. \r\nNowadays, the big… [+4228 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Planetary Radar Captures Empire State Building-Sized Asteroid As It Flew Past Earth - SciTechDaily", "description": "One of the most elongated asteroids ever imaged by planetary radar was closely tracked by NASA’s Deep Space Network. An oblong asteroid, more than three times as long as it is wide, safely flew past Earth on February 3 at a distance of about 1.1 million miles…", "url": "https://scitechdaily.com/nasas-planetary-radar-captures-empire-state-building-sized-asteroid-as-it-flew-past-earth/", "urlToImage": "https://scitechdaily.com/images/Asteroid-With-Craters-in-Space.jpg", "publishedAt": "2023-02-22T09:39:41Z", "content": "ByJet Propulsion LaboratoryFebruary 22, 2023\r\nNASAs Deep Space Network tracked one of the most elongated asteroids ever imaged by planetary radar. This is an artists illustration. See the image below… [+5434 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Bizarre And Unknown DNA Discovered In Mars-Like Atacama Desert - IFLScience", "description": "The results showed that sensors on the Mars rovers may not be up to scratch.", "url": "https://www.iflscience.com/bizarre-and-unknown-dna-discovered-in-mars-like-atacama-desert-67657", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67657/aImg/65918/mars-surface-meta.jpg", "publishedAt": "2023-02-22T09:10:00Z", "content": "If youre a living organism, the Atacama Desert is a pretty awful place to be. It is the second driest desert in the world, with the land composed of rocks, dust, salt lakes, and lava that flows over … [+2358 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Genomic study reveals signs of TB adaptation in ancient Andeans - Phys.org", "description": "People have inhabited the Andes mountains of South America for more than 9,000 years, adapting to the scarce oxygen available at high altitudes, along with cold temperatures and intense ultraviolet radiation. A new genomic study suggests that Indigenous popul…", "url": "https://phys.org/news/2023-02-genomic-reveals-tb-ancient-andeans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/andes-mountains.jpg", "publishedAt": "2023-02-22T08:38:19Z", "content": "People have inhabited the Andes mountains of South America for more than 9,000 years, adapting to the scarce oxygen available at high altitudes, along with cold temperatures and intense ultraviolet r… [+4940 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Russell Moul", "title": "Vivianite: The Necro Crystal You Never Knew Existed - IFLScience", "description": "The strange mineral that grows on corpses", "url": "https://www.iflscience.com/vivianite-the-necro-crystal-you-never-knew-existed-67651", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67651/aImg/65920/vivianite-meta.jpg", "publishedAt": "2023-02-22T08:02:00Z", "content": "Fans of the fantasy genre are probably used to the idea of special stones or crystals that have formed on ancient dead bodies and boast some sort of mystical property, but did you know there are real… [+3396 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": null, "title": "Our Moon Has Been Slowly Drifting Away From Earth Over The Past 2.5 Billion Years - IFLScience", "description": "The moon is currently moving 3.8 cm away from the Earth every year.", "url": "https://www.iflscience.com/our-moon-has-been-slowly-drifting-away-from-earth-over-the-past-2-5-billion-years-67655", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67655/aImg/65916/moon-meta.jpg", "publishedAt": "2023-02-22T07:20:00Z", "content": "Looking up at the moon in the night sky, you would never imagine that it is slowly moving away from Earth. But we know otherwise. In 1969, NASAs Apollo missions installed reflective panels on the moo… [+6266 chars]"}]}