{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Massive Meteorite Hit Scotland Much More Recently Than Scientists Thought - SciTechDaily", "description": "A meteorite impact in Scotland happened 990 million years ago, not 1.2 billion as previously thought, possibly influencing the emergence of early life on land, new Curtin University research shows. Curtin University researchers have discovered that a massive …", "url": "https://scitechdaily.com/a-massive-meteorite-hit-scotland-much-more-recently-than-scientists-thought/", "urlToImage": "https://scitechdaily.com/images/Comet-on-Fire-Meteor-Earth.jpg", "publishedAt": "2025-05-07T01:28:09Z", "content": "New research from Curtin University has revealed that a massive meteorite struck northwestern Scotland 990 million years ago, 200 million years later than previously believed, rewriting Scotland’s ge… [+3222 chars]"}, {"source": {"id": null, "name": "WESH Orlando"}, "author": "Matt Leonard", "title": "SpaceX planning nighttime launch of Falcon 9 from Cape Canaveral - WESH", "description": "SpaceX is targeting a Monday night launch of a Falcon 9 rocket carrying over two dozen Starlink internet satellites to low-Earth orbit.", "url": "https://www.wesh.com/article/spacex-nighttime-launch-falcon-9-cape-canaveral/64693658", "urlToImage": "https://kubrick.htvapps.com/vidthumb/546c24b1-12f8-4eef-9580-52ede6ce7ad9/d378e9ef-7822-4689-a62a-fdadb7bde627.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "publishedAt": "2025-05-07T00:33:00Z", "content": "CAPE CANAVERAL SPACE FORCE STATION, Fla. —SpaceX launched a Falcon 9 rocket carrying over two dozen Starlink internet satellites to low-Earth orbit from Florida on Tuesday.\r\nThe rocket lifted off fro… [+337 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy", "title": "T. rex ancestors crossed from Asia to North America via land bridge 70 million years ago, study finds - CNN", "description": "A new study based on mathematical modeling weighs in on the fierce debate among paleontologists over the origins of the king of the dinosaurs, Tyrannosaurus rex.", "url": "https://www.cnn.com/2025/05/06/science/t-rex-ancestors-asia-study-scli-intl", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/dinopanorama-2.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-05-06T23:36:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe direct ancestor of Tyrannosaurus rex would have ar… [+3843 chars]"}, {"source": {"id": null, "name": "MyNorthwest.com"}, "author": "Frank Sumrall", "title": "VIDEO: Bright green fireball streaks across PNW, stuns witnesses - MyNorthwest.com", "description": "A mysterious green fireball flew across the sky in southern Washington over the weekend, with hundreds of people witnessing the strange phenomenon.", "url": "https://mynorthwest.com/pacific-northwest-weather/green-fireball/4084427", "urlToImage": "https://mynorthwest.com/wp-content/uploads/2025/05/Untitled-design-2025-05-06T132236.927.jpg", "publishedAt": "2025-05-06T22:37:53Z", "content": "A mysterious green fireball flew across the sky in southern Washington over the weekend, with hundreds of people witnessing and commenting on the strange phenomenon.\r\nPeople spotted the green firebal… [+1463 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "In a first, physicists spot elusive 'free-range' atoms — confirming a century-old theory about quantum mechanics - Live Science", "description": "Physicists have used a novel technique to observe individual atoms interacting in free space for the first time ever. The new technique confirms a century-old quantum mechanical theory.", "url": "https://www.livescience.com/physics-mathematics/quantum-physics/in-a-first-physicists-spot-elusive-free-range-atoms-confirming-a-century-old-theory-about-quantum-mechanics", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6KdkGK6EDoaJXAmkKvuGzU.jpg", "publishedAt": "2025-05-06T21:34:26Z", "content": "For the first time, scientists have observed solo atoms floating freely and interacting in space. The discovery helps to confirm some of the most basic principles of quantum mechanics\r\n that were fir… [+2860 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "53-Year-Old Soviet Spacecraft Will Plummet Back to Earth This Week - Gizmodo", "description": "The spacecraft’s expected area of reentry spans vast regions on both sides of the equator, where it could potentially land in a single piece.", "url": "https://gizmodo.com/53-year-old-soviet-spacecraft-will-plummet-back-to-earth-this-week-2000598701", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Artist_s_view_of_ATV-5_reentry.jpg", "publishedAt": "2025-05-06T20:26:15Z", "content": "Kosmos 482 has been trapped in Earths orbit for 53 years but its wandering journey is coming to an end. The failed Venus mission is expected to reenter through the atmosphere in a dramatic fall towar… [+3975 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Find ‘Impossible’ Crystal Created by World’s First Nuclear Bomb - Indian Defence Review", "description": "A crystal, formed during the first nuclear bomb test at Trinity, offers new insights into nuclear explosions and could pave the way for future nuclear forensics.", "url": "https://indiandefencereview.com/scientists-crystal-created-nuclear-bomb/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/scientists-find-impossible-crystal-created-by-worlds-first-nuclear-bomb.jpg", "publishedAt": "2025-05-06T20:25:00Z", "content": "In an extraordinary discovery, scientists have revealed that a quasicrystal, a rare and once-thought-to-be-impossible form of matter, was created during the worlds first nuclear bomb test. This groun… [+4200 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "20 Feet Long: Giant Croc-Like Predator Discovered in the Caribbean - SciTechDaily", "description": "Fossils reveal that sebecids, long-extinct land predators, survived far longer in the Caribbean than previously thought, rewriting ancient ecological history. Imagine a crocodile built like a greyhound — that’s a sebecid. Standing tall, with some species reac…", "url": "https://scitechdaily.com/20-feet-long-giant-croc-like-predator-discovered-in-the-caribbean/", "urlToImage": "https://scitechdaily.com/images/Sebecid-scaled.jpg", "publishedAt": "2025-05-06T20:13:36Z", "content": "Sebecids were top predators until they went extinct during the Miocene. Credit: Illustration by Jorge Machuky\r\nFossils reveal that sebecids, long-extinct land predators, survived far longer in the Ca… [+7923 chars]"}, {"source": {"id": null, "name": "East Idaho News"}, "author": "EastIdahoNews.com Staff", "title": "Scientists make ‘tiny earthquakes’ to find how close magma is to the surface in Yellowstone - East Idaho News", "description": "The following is taken from Yellowstone Caldera Chronicles, a weekly column written by scientists and collaborators of the Yellowstone Volcano Observatory. This was written by Brandon Schmandt, professor of earth, environmental and planetary sciences, and Che…", "url": "https://www.eastidahonews.com/2025/05/scientists-make-tiny-earthquakes-to-find-how-close-magma-is-to-the-surface-in-yellowstone/", "urlToImage": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2025/05/earthquake-truck.jpg", "publishedAt": "2025-05-06T17:07:00Z", "content": null}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "Nature Built a Nuclear Reactor 2 Billion Years Ago — Here’s How It Worked - ZME Science", "description": "Billions of years ago, this uranium went a bit crazy.", "url": "https://www.zmescience.com/feature-post/pieces/nature-built-a-nuclear-reactor-2-billion-years-ago-heres-how-it-worked/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2021/12/Ranger_Uranium_Mine_01.jpg", "publishedAt": "2025-05-06T17:00:26Z", "content": "This cannot be possible.\r\nThat was the thought racing through physicist Francis Perrins mind in May 1972. He was examining a dark piece of uranium ore at a nuclear fuel processing plant in southern F… [+7192 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Asteroid Vesta could be a fragment of a solar system planet, but which one? - Space", "description": "An alternate explanation that fits the evidence is that Vesta was once part of a planet – but which planet that might been remains a mystery.", "url": "https://www.space.com/astronomy/asteroids/asteroid-vesta-could-be-a-fragment-of-a-solar-system-planet-but-which-one", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Me9nsrJN2t4aiYDJwPo5tT.jpg", "publishedAt": "2025-05-06T16:34:00Z", "content": "The asteroid Vesta could be a huge chunk of planet that was blasted off its parent world and sent spinning into space in the aftermath of a titanic collision four-and-a-half billion years ago.\r\nThat'… [+6704 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Breakthrough Discovery: Scientists Find Organism That Transmits Electricity Like a Wire - The Daily Galaxy", "description": "Scientists have uncovered a bizarre new bacterium that behaves like a living wire, opening the door to pollution-fighting tech and next-gen bioelectronics.", "url": "https://dailygalaxy.com/2025/05/scientists-organism-transmits-electricity/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Breakthrough-Discovery-Scientists-Find-Organism-That-Transmits-Electricity-Like-a-Wire.jpg", "publishedAt": "2025-05-06T13:30:00Z", "content": "A newly discovered species of bacteria that conducts electricity like a living wire is shaking up the scientific world. Named Candidatus Electrothrix yaqonensis, the organism was found in Oregons Yaq… [+2469 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Eta Aquarid meteor shower 2025 delights stargazers around the world with dramatic shooting stars (photos) - Space", "description": "The Eta Aquarid meteor shower peaked on May 5-6, and the astrophotography community were there to watch it unfold.", "url": "https://www.space.com/stargazing/meteor-showers/eta-aquarid-meteor-shower-2025-delights-stargazers-around-the-world-with-dramatic-shooting-stars-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QzcrhFjto62EbLRsLirf5N.jpg", "publishedAt": "2025-05-06T12:55:28Z", "content": "The Eta Aquarid meteor shower peaked on May 6, delighting skywatchers with a spectacular cosmic light show as debris from Halley's Comet careened into Earth's atmosphere to form majestic 'shooting st… [+4438 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Satellites Tracked a Volcano’s Secret Collapse for 12 Years – Then It Sparked a Killer Wave - SciTechDaily", "description": "Hidden movements beneath a volcano foretold a deadly collapse—data from space might stop the next one.", "url": "https://scitechdaily.com/satellites-tracked-a-volcanos-secret-collapse-for-12-years-then-it-sparked-a-killer-wave/", "urlToImage": "https://scitechdaily.com/images/Volcanic-Eruption-Wireframe-Concept-Illustration.jpg", "publishedAt": "2025-05-06T12:39:24Z", "content": "Anak Krakatau’s deadly 2018 collapse was preceded by years of unnoticed ground movement, now exposed through satellite radar analysis. Researchers believe such data could offer crucial early warnings… [+5620 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Tuesday Telescope: It’s not space weather, but weather from space - Ars Technica", "description": "“I am so amazed by the view we have up here of our Earth’s weather systems.”…", "url": "https://arstechnica.com/space/2025/05/tuesday-telescope-its-not-space-weather-but-weather-from-space/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/space-station-lightning-1152x648.jpg", "publishedAt": "2025-05-06T12:00:56Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Have Reproduced in a Lab the Worst Possible Way for the Universe to End. Spoiler Alert: You’re Definitely Not Ready - The Daily Galaxy", "description": "Scientists in Europe have recreated a chilling cosmic scenario once thought impossible to test. Inside a lab, they simulated a process that could unravel the universe itself.", "url": "https://dailygalaxy.com/2025/05/scientists-have-reproduced-in-a-lab-the-worst-possible-way-for-the-universe-to-end-spoiler-alert-youre-definitely-not-ready/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Illustration-Of-The-Red-And-Orange-Galaxy.jpg", "publishedAt": "2025-05-06T11:45:00Z", "content": "Scientists in Europe have successfully simulated a process known as false vacuum decay, a hypothetical event that could one day spell the end of theuniverse. The experiment, carried out using ultraco… [+5135 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Exploring cyborg cicada bioacoustic modulations for insect-based communication - Phys.org", "description": "Researchers at the University of Tsukuba in Japan have invented a method to manipulate the musical scales of cicadas' chirps by using electrical muscle stimulation (EMS). A hybrid biological-electronic speaker was produced using live cicadas controlled throug…", "url": "https://phys.org/news/2025-05-exploring-cyborg-cicada-bioacoustic-modulations.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/exploring-cyborg-cicad.jpg", "publishedAt": "2025-05-06T11:20:02Z", "content": "Researchers at the University of Tsukuba in Japan have invented a method to manipulate the musical scales of cicadas' chirps by using electrical muscle stimulation (EMS). A hybrid biological-electron… [+4306 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alyssa Ochs", "title": "Scientists flabbergasted after observing major change at Earth's North and South Poles: 'More than the effect of ice ages' - Yahoo", "description": "Future studies may also help scientists and governments plan for adaptations.", "url": "https://www.yahoo.com/news/scientists-flabbergasted-observing-major-change-103046418.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0Ua4MVyTIvB8BeFO8R9vKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDE-/https://media.zenfs.com/en/the_cool_down_737/fdb9ea40abf9a306ca85edab94b4c105", "publishedAt": "2025-05-06T10:30:46Z", "content": "A new scientific study revealed that Earth's North and South Poles could shift by more than 89 feet by the year 2100.\r\nMelting ice due to our planet's overheating is moving these geographic poles, po… [+3031 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Full Moon May 2025: When To See The ‘Flower Moon’ Rise Where You Are - Forbes", "description": "Everything you need to know about May's full “Flower Moon,” including exactly when, where, and how to see it at its best from where you are.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/05/06/full-moon-may-2025-when-to-see-the-flower-moon-rise-where-you-are/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/678a4e897e136e5532541628/0x0.jpg?format=jpg&crop=1129,635,x178,y176,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-05-06T10:00:00Z", "content": "The full flower moon the second full moon of spring in the Northern Hemisphere will light up the night sky on Monday, May 12, 2025. It will be best seen rising in the east as an orange orb just after… [+3130 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "'Right now, we are in what has to be a Golden Age of asteroid exploration.' Scientists celebrate NASA's latest space rock flyby - Space", "description": "\"We're studying the leftover raw materials from the formation of the planets and trying to understand the history that made the Earth and our environment what it is.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/right-now-we-are-in-what-has-to-be-a-golden-age-of-asteroid-exploration-scientists-celebrate-nasas-latest-space-rock-flyby", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uELpUspCYS2dgixVmr8iVT.jpg", "publishedAt": "2025-05-06T10:00:00Z", "content": "BOULDER, Colorado — Asteroid experts are pondering the scientific output from the NASA Lucy spacecraft after it shot by its celestial destination — the main belt asteroid named Donaldjohanson.\r\nHere … [+6678 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Finally Confirm “Crazy” Vitamin B1 Theory From 1958 - SciTechDaily", "description": "Chemists have successfully generated an unstable molecule in water, a feat once believed to be impossible. Chemists have confirmed a 67-year-old theory about vitamin B1 by stabilizing a highly reactive molecule in water, a breakthrough that was long considere…", "url": "https://scitechdaily.com/?p=473257", "urlToImage": "https://scitechdaily.com/images/Vitamin-B1-Paper.jpg", "publishedAt": "2025-05-06T08:24:34Z", "content": "A team of chemists has achieved the unprecedented: stabilizing a notoriously reactive carbene molecule in water, validating a decades-old theory about vitamin B1 and offering a greener path for chemi… [+4912 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "The most \"boring\" part of cosmic history shaped our modern Universe - Big Think", "description": "It took nearly 400,000 years, after the Big Bang, to first form neutral atoms. The imprints from that early time can now be seen everywhere.", "url": "https://bigthink.com/starts-with-a-bang/boring-part-cosmic-history-shaped-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/09/Baryon-Acoustic-Oscillation-v1-scaled-1.jpg?resize=1200,630", "publishedAt": "2025-05-06T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "SISSA Medialab", "title": "Alternative black hole models suggest quantum effects may erase need for singularities - Phys.org", "description": "Ever since general relativity pointed to the existence of black holes, the scientific community has been wary of one peculiar feature: the singularity at the center—a point, hidden behind the event horizon, where the laws of physics that govern the rest of th…", "url": "https://phys.org/news/2025-05-alternative-black-hole-quantum-effects.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/black-holes-beyond-the.jpg", "publishedAt": "2025-05-06T04:00:01Z", "content": "Ever since general relativity pointed to the existence of black holes, the scientific community has been wary of one peculiar feature: the singularity at the centera point, hidden behind the event ho… [+7555 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hidden for 40,000 Years: Scientists Discover “Odd” New Butterfly Species - SciTechDaily", "description": "A new butterfly species, Satyrium curiosolus, has been discovered in Alberta. Isolated for millennia, it shows unique traits and faces conservation risks due to low genetic diversity. In Canada’s Rocky Mountains, a modest yet remarkable butterfly has gone lar…", "url": "https://scitechdaily.com/hidden-for-40000-years-scientists-discover-odd-new-butterfly-species/", "urlToImage": "https://scitechdaily.com/images/Satyrium-curiosolus-scaled.jpg", "publishedAt": "2025-05-06T02:11:49Z", "content": "Satyrium curiosolus. Credit: MacDonald et al.\r\nA new butterfly species, Satyrium curiosolus, has been discovered in Alberta. Isolated for millennia, it shows unique traits and faces conservation risk… [+7131 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Scientists Reveal a Surprising New Theory on Where Echidnas Came From - ScienceAlert", "description": "New analysis of a 100-million-year-old fossil embedded in a rocky cove in Australia suggests echidnas may have evolved from swimming ancestors.", "url": "https://www.sciencealert.com/scientists-reveal-a-surprising-new-theory-on-where-echidnas-came-from", "urlToImage": "https://www.sciencealert.com/images/2025/05/echidna-water.jpg", "publishedAt": "2025-05-06T02:10:08Z", "content": "New analysis of a 100-million-year-old fossil embedded in a rocky cove in Australia suggests echidnas may have evolved from swimming ancestors.\r\nThat's basically unheard of: While there are many exam… [+3939 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Skye Jacobs", "title": "Astronomers spot possible Planet Nine in data spanning 23 years - TechSpot", "description": "Astronomers have long speculated about an unseen planet lurking in the solar system's outer edge. This hypothetical world, dubbed Planet Nine, could explain the unusual clustering of...", "url": "https://www.techspot.com/news/107802-astronomers-spot-possible-planet-nine-data-spanning-23.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-05-image-18.jpg", "publishedAt": "2025-05-05T22:43:00Z", "content": "What just happened? A newly identified object spotted in two infrared sky surveys may be the most substantial evidence for the elusive Planet Nine a potential Neptune-sized world orbiting hundreds of… [+5031 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aamir Khollam", "title": "US team cracks fusion flaw, solving problem stuck for 70 years - Interesting Engineering", "description": "A major breakthrough in magnetic confinement could help unlock clean, runaway-free fusion energy using stellarator designs.", "url": "https://interestingengineering.com/energy/us-scientists-end-70-year-fusion-struggle", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/05/Untitled-design-2025-05-06T010424.196.jpg", "publishedAt": "2025-05-05T22:38:00Z", "content": "These particles essential to keeping the plasma hot enough for sustained fusion tend to escape through holes in the reactors magnetic field, draining energy and halting the reaction.\r\nNow, a team of … [+755 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Webb Telescope Spotted Something Crazy Happening at the Heart of the Milky Way - SciTechDaily", "description": "Sagittarius C, a turbulent region near the Milky Way’s center, is glowing with hot plasma and threaded by magnetic fields, slowing star formation despite its dense gas. New images from the James Webb Space Telescope reveal never-before-seen details, including…", "url": "https://scitechdaily.com/the-webb-telescope-spotted-something-crazy-happening-at-the-heart-of-the-milky-way/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Center-MeerKAT-and-Webb-scaled.jpg", "publishedAt": "2025-05-05T21:34:00Z", "content": "An image of the Milky Way Galaxy captured by the MeerKAT radio telescope, with an inset showing a detailed image of Sagittarius C taken by the James Webb Space Telescope. Credit: NASA, ESA, CSA, STSc… [+7041 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Stellar Meltdown: 1,000 Young Stars Fly Apart, Leaving Astronomers Baffled - SciTechDaily", "description": "A massive star group is flying apart like never seen before—leaving astronomers both stunned and intrigued.", "url": "https://scitechdaily.com/?p=473665", "urlToImage": "https://scitechdaily.com/images/Star-Family-Art-Concept.jpg", "publishedAt": "2025-05-05T21:09:20Z", "content": "Over 1000 young stars in Ophion are scattering across space in a surprising, disorderly way—an unprecedented find shaking up ideas about how star families behave. Credit: SciTechDaily.com\r\nAstronomer… [+6120 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA's Artemis 2 moon rocket gets 2nd stage even as Trump tries to scrap Space Launch System (photos) - Space", "description": "Only a few pieces left before SLS is fully assembled.", "url": "https://www.space.com/space-exploration/artemis/nasas-artemis-2-moon-rocket-gets-2nd-stage-even-as-trump-tries-to-scrap-space-launch-system-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hQ8aMyD4k3gTVkw723ZECN.jpg", "publishedAt": "2025-05-05T20:00:00Z", "content": "The Artemis 2 megarocket set to launch NASA's next astronauts to the moon in 2026 is almost completely assembled.\r\nThe giant Space Launch System (SLS) rocket continues to grow inside the NASA's Vehic… [+3430 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Physicists Develop Novel Quantum Theory of Gravity - Sci.News", "description": "The new theory, developed by physicists at Aalto University, describes gravity in a way that’s compatible with the Standard Model of particle physics, opening the door to an improved understanding of how the Universe began.", "url": "https://www.sci.news/physics/quantum-theory-gravity-13877.html", "urlToImage": "https://cdn.sci.news/images/2018/07/image_6198f-High-Energy-Neutrino.jpg", "publishedAt": "2025-05-05T19:41:11Z", "content": "The new theory, developed by physicists at Aalto University, describes gravity in a way thats compatible with the Standard Model of particle physics, opening the door to an improved understanding of … [+5127 chars]"}, {"source": {"id": null, "name": "Bestreviews.com"}, "author": "Christina Marfice", "title": "Some of the most popular baby names of 2025 so far - BestReviews", "description": "According to Babycenter, these are the actual most popular baby names so far in 2025.", "url": "https://bestreviews.com/articles/baby-and-kids/play-activity/most-popular-baby-names-2025", "urlToImage": "https://cdn.bestreviews.com/images/v4desktop/expertshopper-cover/feature_most-popular-baby-names-2025.jpg", "publishedAt": "2025-05-05T18:27:09Z", "content": "Babycenter uses daily data to update its list of the most popular names\r\nNaming a baby is a big deal  after all, they'll have their name for the rest of their life! So how do parents decide? Some go … [+4043 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mindy Weisberger", "title": "Is a Bolivian ‘zombie volcano’ about to awaken? Scientists explore why it’s showing signs of life - CNN", "description": "Uturuncu, a Bolivian ‘zombie volcano’ that hasn’t erupted in more than 250,000 years, has shown signs of life. But scientists don’t think those signs spell trouble.", "url": "https://www.cnn.com/2025/05/05/science/uturuncu-zombie-volcano-erupt", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/cn7cj3.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-05-05T17:59:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nCan a volcano rise from the dead? Uturuncu, a lofty pe… [+5984 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA Director General reaction to a reduced budget proposal for NASA - European Space Agency", "description": "ESA Director General Josef Aschbacher emphasises&nbsp;the importance of cooperation&nbsp;in&nbsp;space activities", "url": "https://www.esa.int/Newsroom/ESA_Director_General_reaction_to_a_reduced_budget_proposal_for_NASA", "urlToImage": null, "publishedAt": "2025-05-05T17:36:14Z", "content": "ESA Director General Josef Aschbacher emphasises the importance of cooperation in space activitiesOn 2 May 2025, the White House Office of Management and Budget released a 'skinny version of the Pres… [+1709 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "People really can communicate with just their eyes, study finds - Live Science", "description": "New research reveals how humans communicate through their gaze.", "url": "https://www.livescience.com/human-behavior/people-really-can-communicate-with-just-their-eyes-study-finds", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wkgXjjAVBCz6x7LNv36Y4h.jpg", "publishedAt": "2025-05-05T17:30:00Z", "content": "People can read intention in each other's gazes, recent research finds, lending evidence to this well-known assumption about human communication.\r\nThe study reveals how humans use their eyes to commu… [+4823 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "SpaceX’s Starship Flight 9 Lift Off Date Potentially Revealed In New Notice! - Wccftech", "description": "SpaceX's Starship Flight 9 could occur between May 13th and May 23rd indicates a notice to mariners. Take a look!", "url": "https://wccftech.com/spacexs-starship-flight-9-lift-off-date-potentially-revealed-in-new-notice/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/03/Screenshot-2025-03-04-at-4.36.24 AM-728x414.png", "publishedAt": "2025-05-05T17:17:00Z", "content": "According to a notice to mariners that surfaced earlier today, SpaceX could fly Starship Flight 9 later this month. The previous Starship test flight flew in March, and since then, SpaceX has remaine… [+2994 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Russell Moul", "title": "What The Hell Is A Dinosaur Tree? One Has Just Borne Fruit For First Time - IFLScience", "description": "The ancient conifer was once thriving during the time of the dinosaurs but now it is critically endangered.", "url": "https://www.iflscience.com/what-is-a-dinosaur-tree-the-living-fossil-dinosaurs-once-munched-on-thats-still-around-today-79075", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79075/aImg/83686/wollemi-pines-meta.jpg", "publishedAt": "2025-05-05T16:58:25Z", "content": "When we think about living fossils, most of us likely think about crocodiles, alligators, sharks or some other primeval creature that has roamed the world for millions of years. But what about trees?… [+2448 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Cuttlefish Seem to ‘Wave’ at Each Other, but What They’re Saying Is a Mystery - Gizmodo", "description": "A cute observation in the cephalopods' behavior indicates they also react to sound waves, a notion that will soon be tested with a machine learning approach.", "url": "https://gizmodo.com/cuttlefish-seem-to-wave-at-each-other-but-what-theyre-saying-is-still-a-mystery-2000598074", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/cuttlefish.jpg", "publishedAt": "2025-05-05T16:45:48Z", "content": "Researchers just spotted cunning cuttlefish waving to one another with their tentacles, a previously unobserved behavior that pushes the boundaries of the creature’s intelligence.\r\nCuttlefishsometime… [+3313 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Astronomers Find Odd Radio Signal Coming From Fracture In Milky Way's \"Cosmic Snake\" - IFLScience", "description": "A cosmic \"bone\" at the heart of the Milky Way appears to be fractured. Looking at the break, astronomers found a radio source.", "url": "https://www.iflscience.com/astronomers-find-odd-radio-signal-coming-from-fracture-in-milky-ways-cosmic-snake-79062", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79062/aImg/83681/cosmic-snake-meta.png", "publishedAt": "2025-05-05T16:28:21Z", "content": "The mystery of a giant \"fracture\" in our galaxy the Milky Way may have been solved after new observations from NASAs Chandra X-ray Observatory and radio telescopes.Looking towards the center of the M… [+3133 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncovered New Population of Minimoons Orbiting Earth—What Does This Mean for Our Planet? - The Daily Galaxy", "description": "New study suggests there may be a hidden population of minimoons may be lurking near Earth.", "url": "https://dailygalaxy.com/2025/05/new-population-of-minimoons-orbiting-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Uncovered-New-Population-of-Minimoons-May-Be-Orbiting-Earth—What-Does-This-Mean-for-Our-Planet.jpg", "publishedAt": "2025-05-05T15:40:00Z", "content": "New research suggests there may be a hidden population of minimoons lurking near Earth, with fragments of the Moon traveling through our solar system. The study, published in The Astrophysical Journa… [+2216 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lindsey Valich", "title": "Mars surface patterns resemble Earth, revealing secrets of its past - Phys.org", "description": "Despite its dry, dusty surface and thinner atmosphere, Mars may have more in common with Earth than scientists previously thought.", "url": "https://phys.org/news/2025-05-mars-surface-patterns-resemble-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/mars-surface-patterns.jpg", "publishedAt": "2025-05-05T15:28:04Z", "content": "Orthophoto of solifluction lobes in Norway (The Norwegian Mapping Authority) with overlays (lower right) of fluid contact line instabilities in a numerical model (; Kondic and Diez, 2001) and physica… [+3971 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Hubble spies a skewed spiral galaxy photo of the day for May 5, 2025 - Space", "description": "The formation is catalogued in the Atlas of Peculiar Galaxies compiled in 1966.", "url": "https://www.space.com/astronomy/hubble-space-telescope/hubble-spies-a-skewed-spiral-galaxy-space-photo-of-the-day-for-may-5-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZpUfTX7gshLjzhe4tCVuym.jpg", "publishedAt": "2025-05-05T15:16:04Z", "content": "\"Peculiar\" spiral galaxy Arp 184 or NGC 1961 as captured by NASA/ESA's Hubble Space Telescope. (Image credit: ESA/Hubble &amp; NASA, J. Dalcanton, R. J. Foley (UC Santa Cruz), C. Kilpatrick)\r\nArp 184… [+2148 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "At 6,500 Feet Below Sea Level, China is Building an Underwater Station - The Daily Galaxy", "description": "China's ambitious underwater station is set to dive 6,500 feet below sea level, unlocking new frontiers in deep-sea research and resource exploration.", "url": "https://dailygalaxy.com/2025/05/china-is-building-an-underwater-station/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/At-6500-Feet-Below-Sea-Level-China-is-Building-an-Underwater-Station-1.jpg", "publishedAt": "2025-05-05T15:00:00Z", "content": "China is about to make a monumental leap in deep-sea research with the construction of a state-of-the-art underwater station set to be positioned 2,000 meters beneath the South China Sea. \r\nScheduled… [+2927 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Just Uncovered the World’s Oldest Ant Fossil - The Daily Galaxy", "description": "A stunning fossil from 113 million years ago has revealed an ancient hell ant with unique features.", "url": "https://dailygalaxy.com/2025/05/scientists-uncovered-world-oldest-ant-fossil/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Just-Uncovered-the-Worlds-Oldest-Ant-Fossil.jpg", "publishedAt": "2025-05-05T15:00:00Z", "content": "A 113-million-year-old fossil discovered in Brazil has shattered records, marking the oldest known ant specimen ever identified. \r\nThe fossil belongs to a species called Vulcanidris cratensis, a memb… [+2831 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "NASA Webb Mission Team", "title": "NASA’s Webb Lifts Veil on Common but Mysterious Type of Exoplanet - NASA Science (.gov)", "description": "Though they don’t orbit around our Sun, sub-Neptunes are the most common type of exoplanet, or planet outside our solar system, that have been observed in our", "url": "https://science.nasa.gov/missions/webb/nasas-webb-lifts-veil-on-common-but-mysterious-type-of-exoplanet/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/webb/science/2025/webb-STScI-01JRWXVNG7ZEYJJB6MYSAYCEQ6-4K.jpg", "publishedAt": "2025-05-05T14:00:00Z", "content": "Though they dont orbit around our Sun, sub-Neptunes are the most common type of exoplanet, or planet outside our solar system, that have been observed in our galaxy. These small, gassy planets are sh… [+6245 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Nola Taylor Tillman", "title": "A giant crater on the moon may hold remnants of an ancient magma ocean. Artemis astronauts could bring home samples of it - Space", "description": "Material from the crater can \"tell the story of the late evolution of the lunar magma ocean,\" scientists say.", "url": "https://www.space.com/astronomy/moon/a-giant-crater-on-the-moon-may-hold-remnants-of-an-ancient-magma-ocean-artemis-astronauts-could-bring-home-samples-of-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/t4CJqJQCVXR8KF7KRysgcK.jpg", "publishedAt": "2025-05-05T14:00:00Z", "content": "A giant impact crater on the moon may contain primordial pieces of the lunar mantle and remnants of an ancient magma ocean, researchers say. Crewmembers on upcoming Artemis missions could potentially… [+5916 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Almost Every Speck of Light in This Incredible Image Is a Galaxy - ScienceAlert", "description": "If you ever want to get a bit of perspective, there's very little that's more humbling than a good deep field image – and JWST has just dropped a real showstopper.", "url": "https://www.sciencealert.com/almost-every-speck-of-light-in-this-incredible-image-is-a-galaxy", "urlToImage": "https://www.sciencealert.com/images/2025/05/cosmos-web-header.jpg", "publishedAt": "2025-05-05T13:01:46Z", "content": "If you ever want to get a bit of perspective, there's very little that's more humbling than a good deep field image and JWST has just dropped a real showstopper.\r\nIn the latest image release, the pow… [+2905 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "What happens when common ant species disappear? - Earth.com", "description": "Ecosystems can temporarily bounce back when common ant species disappear. Other species may step in to perform similar roles.", "url": "https://www.earth.com/news/earths-quiet-engineers-what-happens-when-common-ant-species-disappear/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/04232306/When-common-ant-species-disappear-nature-fixes-it-but-at-a-cost.jpg", "publishedAt": "2025-05-05T12:40:19Z", "content": "Ants are everywhere – underfoot, under leaves, and under-appreciated. While often overlooked, these tiny insects carry immense ecological weight. Their roles go far beyond scavenging crumbs at a picn… [+7708 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Alexander E. Gates", "title": "How was the Earth built? - The Conversation", "description": "The Earth started as a mixture of gas and dust around the Sun and grew as it collided with asteroids and dust particles.", "url": "https://theconversation.com/how-was-the-earth-built-254257", "urlToImage": "https://images.theconversation.com/files/661438/original/file-20250412-56-2n0jkr.jpg?ixlib=rb-4.1.0&rect=0%2C249%2C4268%2C2134&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-05T12:33:17Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to CuriousKidsUS@theconversation.com.\r\nHow was the Earth built? Noah, age 5, Florida\r\n… [+4536 chars]"}, {"source": {"id": null, "name": "Housedigest.com"}, "author": "Brandy Eaklor", "title": "The 10 Best Flowering Shrubs To Plant If You Have A Small Yard Or Garden - House Digest", "description": "A small backyard doesn't mean you can't plant flowering shrubs, you just need to look for ones with naturally compact growth habits or dwarf varieties.", "url": "https://www.housedigest.com/1848249/flowering-shrubs-plant-small-backyard-garden/", "urlToImage": "https://www.housedigest.com/img/gallery/the-10-best-flowering-shrubs-to-plant-if-you-have-a-small-yard-or-garden/l-intro-1746000859.jpg", "publishedAt": "2025-05-05T12:15:00Z", "content": "Growing just 2 to 4 feet tall with a slightly wider spread, summersweet 'Hummingbird' (Clethra alnifolia 'Hummingbird') is a stunning cultivar of the sweet pepperbush, but more compact. Plus, it come… [+1254 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Mathematician Finds Solution to One of The Oldest Problems in Algebra - ScienceAlert", "description": "Solving one of the oldest algebra problems isn't a bad claim to fame, and it's a claim Norman Wildberger can now make: The mathematician has solved what are known as higher-degree polynomial equations, which have been puzzling experts for nearly 200 years.", "url": "https://www.sciencealert.com/mathematician-finds-solution-to-one-of-the-oldest-problems-in-algebra", "urlToImage": "https://www.sciencealert.com/images/2025/05/AlgebraSolution.jpg", "publishedAt": "2025-05-05T12:01:28Z", "content": "Solving one of the oldest algebra problems isn't a bad claim to fame, and it's a claim Norman Wildberger can now make: The mathematician has solved what are known as higher-degree polynomial equation… [+3073 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Hours-long continuous lasing achieved using laser-cooled strontium atoms - Phys.org", "description": "Laser-cooled atomic gases, gases of atoms chilled to temperatures around absolute zero using laser technologies, have proved to be versatile physical platforms to study and control quantum phenomena. When these atomic gases interact with light inside an optic…", "url": "https://phys.org/news/2025-05-hours-lasing-laser-cooled-strontium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-demonstrates-con.jpg", "publishedAt": "2025-05-05T11:50:01Z", "content": "Laser-cooled atomic gases, gases of atoms chilled to temperatures around absolute zero using laser technologies, have proved to be versatile physical platforms to study and control quantum phenomena.… [+7945 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera Staff", "title": "Have scientists solved the mystery of gold’s origin in the universe? - Al Jazeera", "description": "A study gives clue to cosmic origin of gold and heavy elements, and they were created earlier than we thought.", "url": "https://www.aljazeera.com/news/2025/5/5/have-scientists-solved-the-mystery-of-golds-origin-in-the-universe", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2025/05/2016-02-10T120000Z_424604865_TM3EC2A1BOV01_RTRMADP_3_SPACE-GRAVITYWAVES-1746434583.jpg?resize=1920%2C1440", "publishedAt": "2025-05-05T10:52:30Z", "content": "The origins of heavy elements such as gold have been one of the biggest mysteries of astrophysics. A study has now provided a clue about the precious metals cosmic origins.\r\nScientists have found tha… [+4117 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "What time is it on the moon? US House space committee wants a standard lunar clock - Space", "description": "The U.S. House space committee moved a lunar time bill to a full House vote.", "url": "https://www.space.com/astronomy/moon/what-time-is-it-on-the-moon-us-house-space-committee-wants-a-standard-lunar-clock", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QgUe9PZni7hmT8mpQG56Pf.jpg", "publishedAt": "2025-05-05T10:00:00Z", "content": "We are one step closer to getting a lunar time zone this week, as a bill passed out of the US House Science, Space and Technology committee directs the administrator of NASA to develop a way to coord… [+4867 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Scientists chased a falling spacecraft with a plane to understand satellite air pollution - Yahoo", "description": "A dramatic aircraft chase of a falling spacecraft has provided new insights into the fiery processes that accompany the atmospheric demise of retired...", "url": "https://www.space.com/space-exploration/satellites/scientists-chased-a-falling-spacecraft-with-a-plane-to-understand-satellite-air-pollution", "urlToImage": "https://media.zenfs.com/en/space_311/825ce1fb1453dbc266e41e72504e7180", "publishedAt": "2025-05-05T09:00:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nIllustration of ESA's Salsa Cluster satellite burning up during reentry. | Credit: ESA/David Du… [+7278 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Alice Sun", "title": "Do other planets have seasons? - Live Science", "description": "Earth has four seasons, but do other planets in our solar system also have hot summer days and cold winter nights?", "url": "https://www.livescience.com/space/do-other-planets-have-seasons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GXSQAhTthhTepjoeZ5dr4H.jpg", "publishedAt": "2025-05-05T09:00:00Z", "content": "Every year, Earth follows a familiar pattern of seasonal changes: As summer rolls around in the Northern Hemisphere, winter creeps in in the Southern Hemisphere, and vice versa.\r\nBut do other planets… [+4000 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Strange Secret Behind These Semiconductors That Seemingly Defy Physics - SciTechDaily", "description": "The mechanism that stabilizes new ferroelectric semiconductors also creates a conductive pathway, which could make them suitable for use in high-power transistors. A new type of semiconductor that can store information using electric fields may lead to more e…", "url": "https://scitechdaily.com/the-strange-secret-behind-these-semiconductors-that-seemingly-defy-physics/", "urlToImage": "https://scitechdaily.com/images/Semiconductor-Crystal-Concept.jpg", "publishedAt": "2025-05-05T08:21:54Z", "content": "Scientists discovered atomic-scale fractures in new semiconductors that stabilize opposing polarizations, unlocking potential for advanced electronics and quantum tech. (Artist’s concept). Credit: Sc… [+7248 chars]"}, {"source": {"id": null, "name": "Fitandwell.com"}, "author": "Alice Porter", "title": "Taking two-minute stretching breaks throughout the day is more effective than doing one long flexibility session, according to a strength coach - Fit&Well", "description": "You've heard of exercise snacking—stretch snacking is just as effective", "url": "https://www.fitandwell.com/exercise/flexibility/taking-two-minute-stretching-breaks-throughout-the-day-is-more-effective-than-doing-one-long-flexibility-session-according-to-a-strength-coach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vfTWoQauFQBkiS6AxfoGhd.jpg", "publishedAt": "2025-05-05T06:38:19Z", "content": "The benefits of stretching are wide-ranging, from reducing stiffness and achiness to improving flexibility and posture—all helping you to move better during everyday life.\r\nBut finding the time to st… [+4577 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why the Sky Glows Green Over Chile’s Desert – And It’s Not an Aurora - SciTechDaily", "description": "Hidden away in the darkest corners of Earth’s atmosphere, a faint green airglow quietly paints the night sky, far from the bustling interference of light pollution. Captured above the La Silla Observatory in Chile’s Atacama Desert, this phenomenon is often co…", "url": "https://scitechdaily.com/why-the-sky-glows-green-over-chiles-desert-and-its-not-an-aurora/", "urlToImage": "https://scitechdaily.com/images/Green-Airglow-La-Silla-Observatory.jpg", "publishedAt": "2025-05-05T02:26:40Z", "content": "Airglow — a ghostly green shimmer in the night sky — drifts silently above La Silla Observatory, revealing the quiet magic of Earth’s upper atmosphere. Unlike auroras, this subtle glow is ever-presen… [+2826 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Liv Bridge", "title": "People are creeped out for same reason after seeing mind-blowing picture taken of asteroid in space - UNILAD", "description": "The space rock captured by NASA has upset some viewers for the same unexpected reason.", "url": "https://www.unilad.com/technology/space/asteroid-photograph-best-ryugu-497542-20250429", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt88b453cb23a19046/68112747861534191a0fcfd1/Screenshot_2025-04-29_at_15.18.22.png", "publishedAt": "2025-05-04T13:48:02Z", "content": "Giant rocks tearing through space at breakneck speed is terrifying at the best of times, but one picture of an asteroid has given many the creeps.\r\nThere are an estimated 1.1 to 1.9 million asteroids… [+2894 chars]"}]}