{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Unearth Primordial Photoredox Catalyst - SciTechDaily", "description": "Nitrogen-doped graphite catalyzes reactions to give early biomolecules. The sun, pivotal in powering the first biochemical molecules on Earth, facilitated crucial reactions along with catalysts that sped up chemical processes. A group of researchers has recen…", "url": "https://scitechdaily.com/scientists-unearth-primordial-photoredox-catalyst/", "urlToImage": "https://scitechdaily.com/images/Chemistry-Catalyst-Concept.jpg", "publishedAt": "2023-09-05T05:34:56Z", "content": "ByWileySeptember 4, 2023\r\nResearchers have demonstrated that a solid formed from ammonia and methane plasma can use sunlight to catalyze amine-to-imine conversions, a process potentially pivotal in t… [+2618 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Peering Into the Cosmic Dawn: Researchers Detect the Host Galaxies of Quasars in the Early Universe - SciTechDaily", "description": "The James Webb Space Telescope has unveiled images that show, for the first time, starlight from two colossal galaxies with actively growing black holes, known as quasars, observed less than a billion years after the Big Bang. A recent study, published in the…", "url": "https://scitechdaily.com/peering-into-the-cosmic-dawn-researchers-detect-the-host-galaxies-of-quasars-in-the-early-universe/", "urlToImage": "https://scitechdaily.com/images/Quasar-Supermassive-Black-Hole-Illustration.jpg", "publishedAt": "2023-09-05T04:43:26Z", "content": "ByKavli Institute for the Physics and Mathematics of the UniverseSeptember 4, 2023\r\nThe James Webb Space Telescope has unveiled starlight from two ancient galaxies with quasars, less than a billion y… [+7830 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Next-Generation of Memory Technology – New Material Shows Promise - SciTechDaily", "description": "Phase change memory is a type of nonvolatile memory that utilizes the capability of phase change materials (PCM) to transition between an amorphous state, where atoms are scattered, and a crystalline state, where atoms are closely aligned. This change produce…", "url": "https://scitechdaily.com/the-next-generation-of-memory-technology-new-material-shows-promise/", "urlToImage": "https://scitechdaily.com/images/Advanced-Computer-Memory-Chip-Artist-Concept.jpg", "publishedAt": "2023-09-05T03:02:23Z", "content": "Tohoku University researchers have advanced phase change memory by using sputtering to create niobium telluride (NbTe4), a material with superior storage and thermal capabilities.\r\nPhase change memor… [+3598 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Demon quasiparticle is detected 67 years after it was first proposed – Physics World - physicsworld.com", "description": "Researchers observe Pines' demon unexpectedly after bombarding exotic metal with electrons", "url": "https://physicsworld.com/a/demon-quasiparticle-is-caught-67-years-after-it-was-first-proposed/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/09/Pines-demon-cropped.jpg", "publishedAt": "2023-09-05T01:34:36Z", "content": "Lurking for decades: researchers have discovered Pines' demon, a collection of electrons in a metal that behaves like a massless wave. It is illustrated here as an artists impression. (Courtesy: The … [+5419 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Scientists Discover 'Pure Math' Is Written Into Evolutionary Genetics - ScienceAlert", "description": "Mathematicians delight in the beauty of math that so many of us don't see.", "url": "https://www.sciencealert.com/scientists-discover-pure-math-is-written-into-evolutionary-genetics", "urlToImage": "https://www.sciencealert.com/images/2023/08/AminoAcidSequenceFoldingIntoProtein.jpg", "publishedAt": "2023-09-05T00:38:32Z", "content": "Mathematicians delight in the beauty of math that so many of us don't see. But nature is a wonderful realm in which to observe beauty born out of mathematical relationships.\r\nThe natural world provid… [+4137 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Watch NASA’s New Trailer For Year’s Most Spectacular Celestial Event - Forbes", "description": "If you’ve been reading my page lately you’ll know that a very special kind of solar eclipse is just days away from being visible in North America. Now NASA is on to it.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/09/04/watch-nasas-new-trailer-for-years-most-spectacular-celestial-event/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64f5cee1641235f7671e813e/0x0.jpg?format=jpg&crop=1137,534,x526,y552,safe&width=1200", "publishedAt": "2023-09-04T23:15:00Z", "content": "Since the Moon appears smaller than the Sun during an annular solar eclipse, the Sun peeks out from ... [+] around the Moon.\r\nNASA/Bill Dunford \r\nIm the worlds only eclipse journalist. For the very l… [+2461 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "In Australia's Ancient Stromatolites, NASA Finds a Blueprint for Mars Exploration - SciTechDaily", "description": "NASA is working with its international partners to study the ancient Earth as it relates to Mars. In June 2023, NASA's Mars Exploration Program leaders joined their counterparts from the Australian Space Agency, ESA (European Space Agency), and the Australian…", "url": "https://scitechdaily.com/in-australias-ancient-stromatolites-nasa-finds-a-blueprint-for-mars-exploration/", "urlToImage": "https://scitechdaily.com/images/Egg-Carton-Stromatolites-Trendall-Western-Australia.jpg", "publishedAt": "2023-09-04T22:42:41Z", "content": "ByNASASeptember 4, 2023\r\nMembers of NASAs Mars Exploration Program, the European Space Agency, the Australian Space Agency, and the Australian Commonwealth Scientific and Industrial Research Organiza… [+8859 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Hannah Sparks", "title": "'Earth-like' Planet Nine could be hiding in our solar system: new research - New York Post ", "description": "While some astronomers remain unconvinced that such a plant exists, this new work isn’t the first to posit the existence of a ninth planet in our cosmic community.", "url": "https://nypost.com/2023/09/04/earth-like-planet-nine-could-be-hiding-in-our-solar-system/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/09/newspress-collage-vyqnj2pys-1693859368915.jpg?quality=75&strip=all&1693851339&w=1024", "publishedAt": "2023-09-04T22:24:00Z", "content": "There may be another world lurking between the orbital lines of our solar system. \r\nAstronomers in Japan have published their theory of an “Earth-like planet,” dubbed Planet Nine, that’s hiding in pl… [+2716 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Can Football Ever Be Safe? | September 5, 2023 - CNN 10", "description": "Today on CNN 10, we’re looking at the thousands of Burning Man festival attendees sheltering in place in the remote area of Nevada. How did 0.8 inches of rai...", "url": "https://www.youtube.com/watch?v=DIMUgjmZr5E", "urlToImage": "https://i.ytimg.com/vi/DIMUgjmZr5E/maxresdefault.jpg", "publishedAt": "2023-09-04T22:00:07Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Missing Link in Cognitive Processing? Scientists Discover Swirling Spirals in the Brain - SciTechDaily", "description": "The findings have the potential to advance both computing and understanding of the brain. Scientists from the University of Sydney and Fudan University have found human brain signals traveling across the outer layer of neural tissue that naturally arrange the…", "url": "https://scitechdaily.com/the-missing-link-in-cognitive-processing-scientists-discover-swirling-spirals-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Spiral-Numbers.jpg", "publishedAt": "2023-09-04T21:32:58Z", "content": "Scientists have discovered that human brain signals form swirling spirals on the outer layer of neural tissue, which play a crucial role in organizing brain activity and cognitive processes. This dis… [+4033 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aliza Chasan", "title": "Fireball streaks over mid-Atlantic states at 36,000 miles per hour - CBS News", "description": "A fireball streaked across the sky Sunday night, speeding across several U.S. states, including Maryland and Pennsylvania.", "url": "https://www.cbsnews.com/news/fireball-streaks-over-mid-atlantic-states-meteor-asteroid-difference/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/09/04/04ea015c-7e4f-4a7e-a266-25d026477b35/thumbnail/1200x630/3d4b2304a952377a730fd6dbaaacc67b/gettyimages-1596243663.jpg?v=bd30f47a894d621fb3691fc64d1442e9", "publishedAt": "2023-09-04T21:15:23Z", "content": "Hundreds watched in awe Sunday night as a fireball streaked across the mid-Atlantic. \r\nThe fireball, which was an exceptionally bright meteor, first became visible 47 miles above the Maryland town of… [+2594 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Countdown to History: NASA's OSIRIS-REx Preps for Epic Asteroid Delivery - SciTechDaily", "description": "NASA's OSIRIS-REx mission is set to return the first U.S. asteroid sample to Earth in September after a successful mockup drop test in Utah's West Desert. A team led by NASA in Utah’s West Desert is in the final stages of preparing for the arrival of the firs…", "url": "https://scitechdaily.com/countdown-to-history-nasas-osiris-rex-preps-for-epic-asteroid-delivery/", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Diverts-Away-From-Earth-scaled.jpg", "publishedAt": "2023-09-04T20:02:40Z", "content": "ByNASASeptember 4, 2023\r\nIllustration of OSIRIS-REx diverting away from Earth after releasing its sample return capsule. Credit: NASAs Goddard Space Flight Center/CI Lab\r\nNASA\r\nEstablished in 1958, t… [+6017 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "Supermassive Neptune-Sized Exoplanet Has Density Higher than Steel - Sci.News", "description": "Astronomers believe the peculiar composition of the Neptune-sized planet TOI-1853b is the result of a giant planetary clash.", "url": "https://www.sci.news/astronomy/supermassive-neptune-sized-exoplanet-12236.html", "urlToImage": "https://cdn.sci.news/images/2023/09/image_12236f-TOI-1853b.jpg", "publishedAt": "2023-09-04T19:54:10Z", "content": "Astronomers believe the peculiar composition of the Neptune-sized planet TOI-1853b is the result of a giant planetary clash.\r\nHeavy elements dominate the mass of the Neptune-sized exoplanet TOI-1853b… [+2509 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "It's Going to Take More Than Early Dark Energy to Resolve the Hubble Tension - Universe Today", "description": "Astronomers have measured the Universe's expansion rate and found that various methods don't agree, and their error bars don't overlap. This is called the \"Hubble Tension\" or the \"Crisis in Cosmology.\" Either the measurements are wrong, or new physics is wait…", "url": "https://www.universetoday.com/163026/its-going-to-take-more-than-early-dark-energy-to-resolve-the-hubble-tension/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/galaxies-scaled.jpg", "publishedAt": "2023-09-04T19:00:23Z", "content": "Our best understanding of the Universe is rooted in a cosmological model known as LCDM. The CDM stands for Cold Dark Matter, where most of the matter in the universe isn’t stars and planets, but a st… [+12422 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Immune Cells' GPS: Crafting Their Own Directional Paths - Neuroscience News", "description": "Researchers made a breakthrough in understanding how immune cells navigate within the body.", "url": "https://neurosciencenews.com/immune-cell-navigation-23872/", "urlToImage": "https://neurosciencenews.com/files/2023/09/immune-cell-gps-neurosinces.jpg", "publishedAt": "2023-09-04T18:51:15Z", "content": "Summary: Researchers made a breakthrough in understanding how immune cells navigate within the body. Contrary to previous beliefs, these cells not only respond to directional cues but also actively s… [+7226 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Astronauts on ISS can face muscle loss in microgravity – a new ESA experiment may help - Space.com", "description": "The method works on Earth, could it work in space too?", "url": "https://www.space.com/iss-astronauts-microgravity-muscle-loss-esa-experiment", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PQTpsxJ7NjJGMGZvomCMZW-1200-80.png", "publishedAt": "2023-09-04T18:00:14Z", "content": "On Aug. 27, Danish astronaut Andreas Mogensen scripted history when he became the first European to pilot the SpaceX Dragon spacecraft to the International Space Station (ISS).\r\nOver the next six mon… [+4366 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Oldest Human Ancestors May Have Evolved Nine Million Years Ago in Turkey - Ancient Origins", "description": "Modern humans first left Africa and migrated to Eurasia between 60,000 and 100,000 years ago. But a fossilized skeleton with surprisingly human-like characteristics found in central Turkey suggests that ancient human ancestors of Homo sapiens journeyed in the…", "url": "https://www.ancient-origins.net/news-evolution-human-origins/human-ancestors-asia-0019217", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Human-ancestors-Asia.jpg", "publishedAt": "2023-09-04T17:42:27Z", "content": "Modern humans first left Africa and migrated to Eurasia between 60,000 and 100,000 years ago . But a fossilized skeleton with surprisingly human-like characteristics found in central Turkey suggests … [+7237 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESA to set target for first Ariane 6 launch after upcoming tests - SpaceNews", "description": "ESA plans to set a target launch period for the first Ariane 6 in October, with the hopes that vehicle can finally take flight “not too late” into 2024.", "url": "https://spacenews.com/esa-to-set-target-for-first-ariane-6-launch-after-upcoming-tests/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/09/a6-vinci-hotfire.jpg", "publishedAt": "2023-09-04T17:23:43Z", "content": "WASHINGTON The European Space Agency plans to set a target launch period for the first Ariane 6 in October, with the hopes that vehicle can finally take flight not too late into 2024.\r\nAt a Sept. 4 b… [+5142 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brian Koberlein", "title": "If Earth were an exoplanet, JWST would know there's an intelligent civilization here - Phys.org", "description": "If we're going to look for life on other worlds, why not start with the one planet we know has life? Earth's atmosphere is rich with oxygen and molecules such as methane, which strongly suggest the presence of life. It also has traces of molecules such as nit…", "url": "https://phys.org/news/2023-09-earth-exoplanet-jwst-intelligent-civilization.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/if-earth-was-an-exopla.jpg", "publishedAt": "2023-09-04T17:12:57Z", "content": "If we're going to look for life on other worlds, why not start with the one planet we know has life? Earth's atmosphere is rich with oxygen and molecules such as methane, which strongly suggest the p… [+3041 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Seismic Secrets: Researchers Unearth the Mysteries of How Turkey's East Anatolian Fault Formed - SciTechDaily", "description": "A University of Minnesota professor heads an international group of geoscientists investigating earthquake-impacted regions. An international team led by the University of Minnesota Twin Cities has successfully determined the age and formation process of the …", "url": "https://scitechdaily.com/unlocking-seismic-secrets-researchers-unearth-the-mysteries-of-how-turkeys-east-anatolian-fault-formed/", "urlToImage": "https://scitechdaily.com/images/East-Anatolian-Fault-Zone-Satellite-Image.jpg", "publishedAt": "2023-09-04T17:02:50Z", "content": "The East Anatolian fault zone was the site of two devastating earthquakes that occurred in Turkey and Syria in February 2023. While the University of Minnesota-led teams findings wont help predict ti… [+4897 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Hubble views elliptical galaxy Messier 89 - Phys.org", "description": "This huge ball of stars—around 100 billion in total—is an elliptical galaxy located some 55 million light-years away. Known as Messier 89, this galaxy appears to be perfectly spherical; which is unusual for elliptical galaxies that tend to be elongated ellips…", "url": "https://phys.org/news/2023-09-hubble-views-elliptical-galaxy-messier.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/hubble-views-elliptica.jpg", "publishedAt": "2023-09-04T17:02:01Z", "content": "This huge ball of starsaround 100 billion in totalis an elliptical galaxy located some 55 million light-years away. Known as Messier 89, this galaxy appears to be perfectly spherical; which is unusua… [+1319 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Chandrayaan-3 rover and lander in sleep mode but might wake up later this month - Space.com", "description": "The two vehicles have completed their primary mission goals.", "url": "https://www.space.com/chandrayaan-3-rover-lander-sleep-mode", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tFk3GajhFRKryJYHJ7EekA-1200-80.jpg", "publishedAt": "2023-09-04T16:47:56Z", "content": "India's Chandrayaan-3 lunar rover and lander have completed their primary mission goals and are now preparing for the upcoming two-week lunar night. The Indian Space Research Organization (ISRO) hope… [+3256 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Brian Koberlein", "title": "Astronomers are hoping the Event Horizon Telescope saw pulsars near the Milky Way's supermassive black hole - Phys.org", "description": "Millisecond pulsars are amazing astronomical tools. They are fast-rotating neutron stars that sweep beams of radio energy from their magnetic poles, and when they are aligned just right we see them as rapidly flashing radio beacons. They flash with such regul…", "url": "https://phys.org/news/2023-09-astronomers-event-horizon-telescope-pulsars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/astronomers-are-hoping.jpg", "publishedAt": "2023-09-04T16:36:03Z", "content": "Millisecond pulsars are amazing astronomical tools. They are fast-rotating neutron stars that sweep beams of radio energy from their magnetic poles, and when they are aligned just right we see them a… [+4430 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beyond 5,500 Worlds: A Sextet of New Exoplanets Sends Discovery Milestone Skyward - SciTechDaily", "description": "Scientists have discovered six new exoplanets, taking the total to 5,502. With advancements in technology, the field of exoplanet research has grown exponentially since the first discovery in 1992, and upcoming instruments promise even deeper insights. On Aug…", "url": "https://scitechdaily.com/beyond-5500-worlds-a-sextet-of-new-exoplanets-sends-discovery-milestone-skyward/", "urlToImage": "https://scitechdaily.com/images/5500-Exoplanets.jpg", "publishedAt": "2023-09-04T16:12:32Z", "content": "ByChelsea Gohd, NASA's Exoplanet Exploration ProgramSeptember 4, 2023\r\nNASAs Exoplanet Archive confirmed four new worlds, bringing the total past 5,500. Credit: NASA/JPL-Caltech\r\nScientists have disc… [+13660 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Scientists manipulate quantum mechanics to slow down a chemical reaction by 100 billion times - Livescience.com", "description": "Using a quantum device, researchers have observed, for the first time, a molecular process called conical intersection that is important in reactions such as photosynthesis.", "url": "https://www.livescience.com/chemistry/scientists-manipulate-quantum-mechanics-to-slow-down-a-chemical-reaction-by-100-billion-times", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EDsnFXXAYgTnFvPkwCYQkU-1200-80.jpeg", "publishedAt": "2023-09-04T16:00:00Z", "content": "For the first time, scientists have directly observed a molecular dance that's crucial to basic chemical reactions such as photosynthesis\r\n. And they've done it by using a quantum computer to slow do… [+2250 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Ellie Abraham", "title": "Scientists baffled by discovery of '2000-year-old computer' - indy100", "description": "Scientists have been left baffled by the discovery of the wreck of a 2,000-year-old “computer” that is amazingly complex.The Antikythera mechanism – an astronomical calendar – has been dubbed “‘the first computer” and has baffled scientists for generations af…", "url": "https://www.indy100.com/science-tech/antikythera-mechanism-astronomical-calendar-computer-2664894001", "urlToImage": "https://www.indy100.com/media-library/discovery-of-2000-year-old-computer-leaves-scientists-baffled.jpg?id=33752172&width=1200&height=600&coordinates=0%2C227%2C0%2C429", "publishedAt": "2023-09-04T15:27:26Z", "content": "Scientists have been left baffled by the discovery of the wreck of a 2,000-year-old computer that is amazingly complex.\r\nThe Antikythera mechanism an astronomical calendar has been dubbed the first c… [+1672 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Pioneering Genetics Research: Male Sex Chromosome Finally Deciphered - SciTechDaily", "description": "A global team of scientists has fully sequenced the Y chromosome, enhancing our understanding of male development, fertility, and genetically-linked diseases. The chromosome associated with male development, which is the last mysterious piece of the human gen…", "url": "https://scitechdaily.com/pioneering-genetics-research-male-sex-chromosome-finally-deciphered/", "urlToImage": "https://scitechdaily.com/images/Human-Chromosome-Sequence-Art.jpg", "publishedAt": "2023-09-04T15:22:30Z", "content": "ByJohns Hopkins UniversitySeptember 4, 2023\r\nResearchers, including those from Johns Hopkins University, have successfully sequenced the Y chromosome, which is linked to male development. This breakt… [+6064 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Chinese scientist proposes solar system-wide resource utilization roadmap - SpaceNews", "description": "Chinese scientist proposes solar system-wide resource utilization roadmap Chinese space scientists have outlined a tentative roadmap for establishing a space resources utilization network stretching into the outer reaches of the solar system.", "url": "https://spacenews.com/chinese-scientist-proposes-solar-system-wide-resource-utilization-roadmap/", "urlToImage": "https://spacenews.com/wp-content/uploads/2016/08/Juno-view-of-Jupiter-2016-08-27.jpg", "publishedAt": "2023-09-04T14:05:11Z", "content": "HELSINKI Chinese space scientists have outlined a tentative roadmap for establishing a space resources utilization network stretching into the outer reaches of the solar system.\r\nWang Wei, a scientis… [+3864 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists make the first observation of a nucleus decaying into four particles after beta decay - Phys.org", "description": "Not all of the material around us is stable. Some materials may undergo radioactive decay to form more stable isotopes. Scientists have now observed a new decay mode for the first time. In this decay, a lighter form of oxygen, oxygen-13 (with eight protons an…", "url": "https://phys.org/news/2023-09-scientists-nucleus-decaying-particles-beta.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/scientists-make-the-fi.jpg", "publishedAt": "2023-09-04T14:03:09Z", "content": "Not all of the material around us is stable. Some materials may undergo radioactive decay to form more stable isotopes. Scientists have now observed a new decay mode for the first time. In this decay… [+2799 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "Up to half black holes that rip apart stars and devour them 'burp back up' stellar remains years later - Livescience.com", "description": "Years after ripping stars to shreds, 24 black holes suddenly flared up with radio waves in inexplicable 'burping' bouts. Half of all star-killing black holes may experience the same.", "url": "https://www.livescience.com/space/black-holes/up-to-half-of-black-holes-that-rip-apart-stars-burp-back-up-stellar-remains-years-later", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dW8WUHZjKY6aT3eQ7dA6WF-1200-80.jpg", "publishedAt": "2023-09-04T14:00:00Z", "content": "Up to half of the black holes that devour stars \"burp up\" their stellar remains years later.\r\nAstronomers made the discovery after spending years watching black holes involved in tidal disruption eve… [+3340 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Hundreds of supernova remnants remain hidden in our galaxy. These astronomers want to find them - Space.com", "description": "Less than half the predicted number of supernova remnants in our galaxy have been found – where are all the others?", "url": "https://www.space.com/hundreds-supernova-remnants-hidden-galaxy-astronomers-find-them", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZQcksw5smEksCuA5Lx3vy4-1200-80.jpg", "publishedAt": "2023-09-04T13:00:01Z", "content": "A new search for supernova remnants in our galaxy is underway. Scientists are with aiming to find hundreds of these star explosion remains scattered across the Milky Way by  using radio observations … [+4056 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Janna Levin", "title": "Quantum wormholes, explained - Big Think", "description": "Quantum wormholes are mathematically possible — but might also be physically impossible. Physicist Janna Levin explains Hawking’s famous information paradox.", "url": "https://bigthink.com/the-well/what-is-a-quantum-wormhole/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/08/A1-Web-Levin-2.jpg?resize=1200,630", "publishedAt": "2023-09-04T13:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space's Silent Threat: Scientists Shed New Light on “Killer Electrons” - SciTechDaily", "description": "High-energy ‘relativistic’ electrons, often called “killer” electrons, are a major source of radiation damage to satellites so understanding their patterns of activity is crucial. Solar emissions of charged particles and magnetic fields can disrupt Earth's ma…", "url": "https://scitechdaily.com/spaces-silent-threat-scientists-shed-new-light-on-killer-electrons/", "urlToImage": "https://scitechdaily.com/images/Satellite-Reentry-Burning-in-Atmosphere.jpg", "publishedAt": "2023-09-04T12:58:38Z", "content": "ByBritish Antarctic SurveySeptember 4, 2023\r\nA new study reveals the escalating threat of killer electrons during geomagnetic storms, urging for fortified satellite infrastructure to mitigate potenti… [+4532 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Canterbury: Scientists search cathedral roof for cosmic dust - BBC", "description": "The inaccessibility of Canterbury Cathedral roof could make it the good place to find space matter.", "url": "https://www.bbc.com/news/uk-england-kent-66707859", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/152A/production/_130981450_canterburycathedralfromground.jpg", "publishedAt": "2023-09-04T12:41:29Z", "content": "Scientists are taking to the roof of Canterbury Cathedral to search for matter from space.\r\nMembers of the School of Physics and Astronomy from the University of Kent are hoping to find micrometeorit… [+1270 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "The Moon is slowly drifting away from Earth and it's beginning to impact us - indy100", "description": "The Moon is a constant in the night sky, but all is not actually as it seems. It turns out that scientists have discovered the Moon is drifting away from Earth, and it’s changing everything we thought we knew about our planet’s relationship with its only natu…", "url": "https://www.indy100.com/science-tech/moon-drifting-away-earth-impact", "urlToImage": "https://www.indy100.com/media-library/last-super-blue-moon-until-2037-lights-up-skies-in-beijing-china.jpg?id=36334470&width=1200&height=600&coordinates=0%2C72%2C0%2C73", "publishedAt": "2023-09-04T12:11:17Z", "content": "The Moon is a constant in the night sky, but all is not actually as it seems. \r\nIt turns out that scientists have discovered the Moon is drifting away from Earth, and its changing everything we thoug… [+1726 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Galaxy shapes can help identify wrinkles in space caused by the Big Bang - Space.com", "description": "The new way could also help in better mapping of the universe, scientists say.", "url": "https://www.space.com/galactic-geometry-big-bang-wrinkles-baos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DSfvjPKbQvL7tvGghPZ3a4-1200-80.jpg", "publishedAt": "2023-09-04T12:00:01Z", "content": "Astronomers have found a new way to detect one of the oldest features of our universe.\r\nThese Baryon Acoustic Oscillations, or BAO, are subtle wrinkles that flowed through cosmic matter during the fi… [+3012 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "Unknown ultra-light particles linked to dark matter could be found using atomic clocks - Yahoo Life", "description": "The use of atomic clocks could help bring cosmology and astrophysics \"down to Earth\" by allowing scientists to investigate the mysteries of dark energy and...", "url": "https://www.livescience.com/physics-mathematics/dark-matter/unknown-ultra-light-particles-linked-to-dark-matter-could-be-found-using-atomic-clocks", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Il959Fft7.MvWHftL0_3Rg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/6f97900ee5e92b421082c4225183d2ae", "publishedAt": "2023-09-04T11:53:52Z", "content": "Scientists are using atomic clocks to investigate some of the universe's greatest mysteries, including the nature of dark matter, in a laboratory. In the process, they say they're bringing cosmology … [+5377 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "ISRO gets more out of Chandrayaan-3 mission as Vikram lander hops and lands again safely - Times of India", "description": "The Chandrayaan-3 lander Vikram has achieved another significant milestone. The lander has successfully performed a hop experiment, whereby on ISRO’s command, it jumped to a height of 40 cm and landed safely 30-40 centimetres away. This is something", "url": "https://timesofindia.indiatimes.com/videos/toi-original/isro-gets-more-out-of-chandrayaan-3-mission-as-vikram-lander-hops-and-lands-again-safely/videoshow/103358976.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-103358976,imgsize-608177.cms", "publishedAt": "2023-09-04T11:19:40Z", "content": "Sep 04, 2023, 10:20PM ISTSource: TOI.inThe Chandrayaan-3 lander Vikram has achieved another significant milestone. The lander has successfully performed a hop experiment, whereby on ISROs command, it… [+272 chars]"}, {"source": {"id": null, "name": "FirstCoastNews.com WTLV-WJXX"}, "author": "Lauren Rautenkranz", "title": "Did you hear the loud boom last night? Here's what it was - FirstCoastNews.com WTLV-WJXX", "description": "If you were up after midnight, you heard it. If you were outside, you saw it. If you were asleep, it could've woken you.", "url": "https://www.firstcoastnews.com/article/news/local/dragon-capsule-brings-crew-sonic-boom-to-skies-over-florida-georgia/77-84efd737-c255-499c-956f-5963678d44be", "urlToImage": "https://media.firstcoastnews.com/assets/WTLV/images/acf80097-62fa-4c7f-b260-3fe9806190c8/acf80097-62fa-4c7f-b260-3fe9806190c8_1140x641.jpg", "publishedAt": "2023-09-04T11:14:00Z", "content": "JACKSONVILLE, Fla. Many of you may have heard a loud boom around midnight Sunday night. Maybe you saw a fireball soaring through the sky. It was quite the spectacle and thankfully there are a lot of … [+1851 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "Hubble Space Telescope Spies Stunning Spiral Galaxy - Sci.News", "description": "A new image from the NASA/ESA Hubble Space Telescope features IC 1776, a barred spiral galaxy that hosted a supernova explosion about eight years ago.", "url": "https://www.sci.news/astronomy/hubble-spiral-galaxy-ic-1776-12234.html", "urlToImage": "https://cdn.sci.news/images/2023/09/image_12234-IC-1776.jpg", "publishedAt": "2023-09-04T10:49:07Z", "content": "A new image from the NASA/ESA Hubble Space Telescope features IC 1776, a barred spiral galaxy that hosted a supernova explosion about eight years ago.\r\nThis Hubble image shows IC 1776, a barred spira… [+2111 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Shatters the Myth of Men As Hunters and Women As Gatherers - SciTechDaily", "description": "Data from foraging societies around the world indicates that women often hunt large game skillfully. Analysis of data from dozens of foraging societies around the world demonstrates that in at least 79 percent of these groups, women partake in hunting. This c…", "url": "https://scitechdaily.com/new-research-shatters-the-myth-of-men-as-hunters-and-women-as-gatherers/", "urlToImage": "https://scitechdaily.com/images/Prehistoric-Woman-Hunting-Spear.jpg", "publishedAt": "2023-09-04T10:27:33Z", "content": "New research contradicts the common belief that in foraging societies, only men hunt and women gather, revealing that women actively hunt in 79% of these societies, utilizing diverse strategies and e… [+3005 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Jupiter gets hit by space rock, telescopes spot bright flash - Interesting Engineering", "description": "The gas giant is hit by space rocks 12-60 times annually, but astronomers have seldom recorded these fleeting impacts.", "url": "https://interestingengineering.com/science/amateur-stargazers-capture-a-space-rock-smashing-into-jupiter", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/04/image/jpeg/aGaAOtssIosvWO1HeHBKM5JqJC8l0QLWYB1CshTl.jpg", "publishedAt": "2023-09-04T10:04:00Z", "content": "Some experts believe that the massive size of Jupiter is what protects Earth from frequent collisions with rogue space rocks, thereby allowing life to flourish. The planet either absorbs these object… [+1578 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "See the moon meet up with Jupiter on Sept. 4. - Space.com", "description": "The moon will meet up with Jupiter tonight, making a close approach to the solar system's largest planet in the night sky.", "url": "https://www.space.com/moon-jupiter-conjunction-september-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/46CZqzitLnnVo2VL8ZAu55-1200-80.jpg", "publishedAt": "2023-09-04T10:00:13Z", "content": "The moon will meet up with Jupiter tonight, making a close approach to the solar system's largest planet in the night sky. \r\nFrom New York City, the 19-day-old moon and Jupiter will be visible from s… [+3564 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Faster Than Can Be Explained – Photonic Time Crystals Could Revolutionize Optics - SciTechDaily", "description": "A recent study reveals oscillations in the refractive index that are faster than can be explained by current theories. A study recently published in the journal Nanophotonics reveals that by rapidly modulating the refractive index - which is the ratio of the …", "url": "https://scitechdaily.com/faster-than-can-be-explained-photonic-time-crystals-could-revolutionize-optics/", "urlToImage": "https://scitechdaily.com/images/Abstract-Time-Crystal-Concept.gif", "publishedAt": "2023-09-04T09:17:11Z", "content": "Researchers have produced photonic time crystals in the near-visible spectrum, potentially revolutionizing light science applications. This breakthrough expands the previously understood range of PTC… [+3333 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Mysterious Species of Marine Bacteria Discovered Deep in The Ocean - ScienceAlert", "description": "In sediment samples from deep within the ocean, scientists have identified a mysterious and unique new species of marine bacteria that advances our understanding of deep-sea conditions and microbiology in general.", "url": "https://www.sciencealert.com/mysterious-species-of-marine-bacteria-discovered-deep-in-the-ocean", "urlToImage": "https://www.sciencealert.com/images/2023/08/BacteriaFind.jpg", "publishedAt": "2023-09-04T09:01:19Z", "content": "In sediment samples from deep within the ocean, scientists have identified a mysterious and unique new species of marine bacteria that advances our understanding of deep-sea conditions and microbiolo… [+2619 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Spectacular Meteor Streaks Across Night Sky In Turkey, Turns It Green - NDTV", "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News", "url": "https://www.ndtv.com/news", "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png", "publishedAt": "2023-09-04T06:59:49Z", "content": ""}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "G2 geomagnetic storm hits Earth, sparks auroras in the US - HT Tech", "description": "National Oceanic and Atmospheric Administration (NOAA) predicted a few days ago that a CME was on course for Earth, and could hit the planet on September 2. This event has now taken place and it made for an amazing viewing in parts of the US.", "url": "https://tech.hindustantimes.com/tech/news/g2-geomagnetic-storm-hits-earth-sparks-auroras-in-the-us-71693795509162.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/vincent-guth-62V7ntlKgL8-unsplash_1693795905432_1693795911852.jpg", "publishedAt": "2023-09-04T02:53:46Z", "content": "Over the last few months, we have witnessed several solar storm and geomagnetic storm impacts, and their frequency is likely to increase even more as we approach the solar maximum which could arrive … [+2165 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dazzling auroras delight social media as solar storm strikes Earth - HT Tech", "description": "A dazzling Northern Lights show lit up the sky due to an unexpected solar storm, surprising skygazers and electrifying social media.", "url": "https://tech.hindustantimes.com/tech/news/dazzling-auroras-delight-social-media-as-solar-storm-strikes-earth-71693795107161.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/Solar_Storm_1693795301579_1693795301852.jpg", "publishedAt": "2023-09-04T02:43:12Z", "content": "A spectacular northern lights show lit up the sky early on Sunday morning, delighting people and filling social media with stunning pictures. This amazing display was caused by a solar storm that was… [+1696 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Super, Blue and Blood: A Guide to Different Full Moons - VOA Learning English", "description": "Sky watchers around the world were treated this month to two full moons, a supermoon and a blue moon. Today, we’re taking a look at some different kinds of full moons and how often we can expect to see them.", "url": "https://learningenglish.voanews.com/a/super-blue-and-blood-a-guide-to-different-full-moons/7250151.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-d34a-08dbaa956c6f_cx0_cy9_cw0_w1200_r1.jpg", "publishedAt": "2023-09-03T22:01:25Z", "content": "Sky watchers around the world were treated this month to two full moons, a supermoon and a blue moon.\r\nThe American space agency NASA explains a supermoon happens when the moons orbit brings it close… [+3593 chars]"}, {"source": {"id": null, "name": "San Antonio Express-News"}, "author": "Sara DiNatale", "title": "100-million-year-old dinosaur footprints visible due to Texas drought - San Antonio Express-News", "description": "We can see 100-million-year-old dinosaur footprints because of the drought at Texas' Dinosaur Valley State Park", "url": "https://www.expressnews.com/news/texas/article/texas-dinosaur-footprints-18345586.php", "urlToImage": "https://s.hdnux.com/photos/01/27/15/61/22862924/4/rawImage.jpg", "publishedAt": "2023-09-03T18:28:19Z", "content": "There's a silver lining to the extreme drought in Somervell County: Visible 100-plus-million-year-old dinosaur footprints. The footprints were first discovered last summer, revealed when Paluxy River… [+1747 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Neil Saintilan", "title": "After studying more than 1,500 coastal ecosystems, researchers say they will drown if we let the world warm above 2C - Phys.org", "description": "Much of the world's natural coastline is protected by living habitats, most notably mangroves in warmer waters and tidal marshes closer to the poles. These ecosystems support fisheries and wildlife, absorb the impact of crashing waves and clean up pollutants.…", "url": "https://phys.org/news/2023-08-coastal-ecosystems-world-2c.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/we-studied-more-than-1.jpg", "publishedAt": "2023-09-03T17:40:02Z", "content": "Much of the world's natural coastline is protected by living habitats, most notably mangroves in warmer waters and tidal marshes closer to the poles. These ecosystems support fisheries and wildlife, … [+5159 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Space research says you shouldn't use your phone before sleep - Interesting Engineering", "description": "Two ESA studies conducted in the International Space Station are offering solutions for better sleep on space and here on earth.", "url": "https://interestingengineering.com/health/space-research-says-you-shouldnt-use-your-phone-before-sleep", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/03/image/jpeg/cBz8bDhli5tYiw698TzYMhtqK7dCfylhxNtnhp3W.jpg", "publishedAt": "2023-09-03T16:59:00Z", "content": "An in-ear measuring device to track brain activity\r\nFor the sleeping in orbit study, Mogensen is making use of an in-ear measuring device that tracks the electroencephalogram (EEG) of his brain. The … [+1325 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 81 bulldogs to pass Earth on Wednesday - NASA - The Jerusalem Post", "description": "Asteroid 2021 JA5 is around the size of 81 bulldogs, the symbol of the college football team of the University of Georgia. But it won't hit us – hopefully the Bulldog team will have better luck.", "url": "https://www.jpost.com/science/space/article-757419", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/540072", "publishedAt": "2023-09-03T16:56:00Z", "content": "An asteroid the size of 81 bulldogs is set to zip past the Earth on Wednesday, September 6, according to NASA's asteroid tracker.\r\nThe asteroid in question has been dubbed 2021 JA5, as stated by the … [+2936 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Keyhole: Webb Reveals Breathtaking New Structures Within Iconic Supernova - SciTechDaily", "description": "Small crescent-like structures come into clear view. NASA’s James Webb Space Telescope has uncovered new details in Supernova 1987A with its NIRCam (Near-Infrared Camera) instrument. Structures, some only visible in infrared wavelengths, provide clues into th…", "url": "https://scitechdaily.com/cosmic-keyhole-webb-reveals-breathtaking-new-structures-within-iconic-supernova/", "urlToImage": "https://scitechdaily.com/images/Supernova-1987A-Webb-NIRCam-Image.jpg", "publishedAt": "2023-09-03T15:13:25Z", "content": "BySpace Telescope Science InstituteSeptember 3, 2023\r\nWebbs NIRCam (Near-Infrared Camera) captured this detailed image of SN 1987A (Supernova 1987A) with unprecedented clarity, revealing new structur… [+9839 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "The Closest Supernova Seen in the Modern Era, Examined by JWST - Universe Today", "description": "In 1987, a supernova suddenly appeared in the Large Magellanic Cloud and was studied by astronomers worldwide. Although the detonating star was 165,000 light-years away, this was still the closest supernova seen in centuries. Astronomers have continued to stu…", "url": "https://www.universetoday.com/163016/the-closest-supernova-seen-in-the-modern-era-examined-by-jwst/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/sn1987a.jpg", "publishedAt": "2023-09-03T14:40:02Z", "content": "In November of 1572, Tycho Brahe noticed a new star in the constellation Cassiopeia. It was the first supernova to be observed in detail by Western astronomers and became known as Tycho’s Supernova. … [+2973 chars]"}, {"source": {"id": null, "name": "Pethelpful.com"}, "author": "Eve Vawter", "title": "Golden Retriever with Dementia Going on Enrichment Walks Is Breaking Hearts - Yahoo Life", "description": "Nigh Time walks are supposed to help this sweet dog with dementia.", "url": "https://pethelpful.com/pet-news/golden-retriever-dementia-enrichment-walks", "urlToImage": "https://media.zenfs.com/en/pethelpful_915/bdeeab793418e7d7c7d2ef09c4b7c24c", "publishedAt": "2023-09-03T14:20:00Z", "content": "We all love and treasure our beloved fur friends, no matter how old they get. With age can sometimes come the condition known as dog dementia, and one couple who is sharing the challenges of having a… [+1830 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "NASA image shows likely lunar crater caused by crash of Russia's Luna 25 mission - KSL.com", "description": "A new crater has appeared on the moon, and it was likely created when Russia's uncrewed Luna 25 mission crashed into the lunar surface.", "url": "https://www.ksl.com/article/50721812/nasa-image-shows-likely-lunar-crater-caused-by-crash-of-russias-luna-25-mission", "urlToImage": "https://img.ksl.com/slc/2945/294566/29456668.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-09-03T14:06:43Z", "content": "Estimated read time: 1-2\r\n minutes\r\nMOSCOW A new crater has appeared on the moon, and it was likely created when Russia's uncrewed Luna 25 mission crashed into the lunar surface.\r\nImages taken by NAS… [+1481 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: SpaceX Crew-7 Mission Launches, Storm From Space, Lunar Exploration - SciTechDaily", "description": "A new crew heads to the space station … A major storm spotted from space … And a robotic spacecraft enabling human missions to the Moon … A few of the stories to tell you about – This Week at NASA! https://youtu.be/sSdsYsu4uyc NASA’s SpaceX Crew-7 Mission Lau…", "url": "https://scitechdaily.com/this-week-nasa-spacex-crew-7-mission-launches-storm-from-space-lunar-exploration/", "urlToImage": "https://scitechdaily.com/images/Artemis-Astronaut-on-Moon-scaled.jpg", "publishedAt": "2023-09-03T14:02:42Z", "content": "ByNASASeptember 3, 2023\r\nDuring a recent training session for the Artemis II astronauts, data from NASAs Lunar Reconnaissance Orbiter (LRO) was utilized to acquaint them with the lunar views theyll e… [+4778 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Penn State scientists unlock the key to clean energy storage - Interesting Engineering", "description": "\"It took us six years of measuring and re-measuring.\" Efforts by a research team at Penn State have finally paid off in quantifying hydrogen spillover.", "url": "https://interestingengineering.com/science/penn-state-scientists-unlock-the-key-to-clean-energy-storage", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/03/image/jpeg/jrAURPb6O5UropfxqYC4CgZpWbxLBlVWZCoTDbiO.jpg", "publishedAt": "2023-09-03T13:27:00Z", "content": "What sets this research apart is the role of entropy, which plays a crucial part in driving the atoms from the metal to the substrate. Unlike previous assumptions that thermal energy was the primary … [+1387 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "ScienceAlert", "title": "Ancient Mud in Mississippi Reveals Dramatic Saga of Antarctic Ice - ScienceAlert", "description": null, "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnNjaWVuY2VhbGVydC5jb20vYW5jaWVudC1tdWQtaW4tbWlzc2lzc2lwcGktcmV2ZWFscy1kcmFtYXRpYy1zYWdhLW9mLWFudGFyY3RpYy1pY2XSAQA?oc=5", "urlToImage": null, "publishedAt": "2023-09-03T12:31:18Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comprehensive New Amphibian Family Tree Revises Frog Evolution Timeline - SciTechDaily", "description": "Most detailed and comprehensive family tree to date of frogs created using molecular data. Researchers, including Jeff Streicher, Senior Curator in Charge, Amphibians and Reptiles at the Natural History Museum, London, have unveiled the most extensive evoluti…", "url": "https://scitechdaily.com/comprehensive-new-amphibian-family-tree-revises-frog-evolution-timeline/", "urlToImage": "https://scitechdaily.com/images/Vietnamese-Mossy-Frog-Theloderma-corticale.jpg", "publishedAt": "2023-09-03T11:53:22Z", "content": "ByThe Natural History MuseumSeptember 3, 2023\r\nA groundbreaking study presents the most exhaustive frog evolutionary tree, spanning 5,242 species. The research proposes a revised timeline for frog ev… [+4302 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Taking out the trash: Here's how private companies could be vital for space debris removal - Space.com", "description": "To keep a watchful, more-informed eye on orbital debris, much better approaches are needed.", "url": "https://www.space.com/space-debris-taking-out-the-trash", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ojG3vXhs8ezHBS6WChrDV6-1200-80.jpg", "publishedAt": "2023-09-03T11:28:51Z", "content": "There's no doubt about it. Earth orbit is a messy place. \r\nBut is there a business in removing space junk from Earth orbit? Around the world, private companies and national space agencies alike are c… [+9643 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Dead Star Devouring Rival, Using Its Flesh to Shoot \"Cosmic Cannonballs\" - Futurism", "description": "Astronomers have discovered a mysterious pulsar that is launching accreted matter from its companion star like \"cosmic cannonballs.\"", "url": "https://futurism.com/the-byte/dead-star-devouring-rival-shoot-cosmic-cannonballs", "urlToImage": "https://wp-assets.futurism.com/2023/08/dead-star-devouring-rival-shoot-cosmic-cannonballs.jpg", "publishedAt": "2023-09-03T11:05:26Z", "content": "This pulsar is flinging \"enormous amounts of matter\" at \"incredibly high speeds.\"\r\nCosmic Cannonballs\r\nAstronomers have discovered a fascinating pulsar that's been stripping material from its compani… [+2729 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "NASA to test space laser communications system - The Washington Post", "description": "NASA says the refrigerator-sized relay will allow astronauts on the International Space Station to send high-resolution data, including images and video.", "url": "https://www.washingtonpost.com/science/2023/09/03/nasa-laser-communications-space-station/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RHJ2WXDF24NA3YDVDPQQA5CSDQ.jpg&w=1440", "publishedAt": "2023-09-03T10:32:36Z", "content": "Comment on this story\r\nComment\r\nSpacecraft typically use radio-based communication systems to talk to Earth. But in the future, lasers may become part of astronauts communications arsenal.\r\nLate last… [+2402 chars]"}]}