{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "This crab emits light from its forehead, and scientists have tried to figure out why. - Farmingdale Observer", "description": "The fascinating world of marine biology never ceases to amaze scientists with remarkable adaptations that creatures develop for survival. Among these evolutionary marvels is the Parasesarma eumolpe, a unique crab species found in Southeast Asian mangrove fore…", "url": "https://farmingdale-observer.com/2025/06/05/this-crab-emits-light-from-its-forehead-and-scientists-have-tried-to-figure-out-why/", "urlToImage": null, "publishedAt": "2025-06-06T02:36:00Z", "content": "The fascinating world of marine biology never ceases to amaze scientists with remarkable adaptations that creatures develop for survival. Among these evolutionary marvels is the Parasesarma eumolpe, … [+4629 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Webb telescope detects water vapor on a planet outside the solar system smaller than Neptune - Earth.com", "description": "The Webb telescope detects a clear, hydrogen-rich atmosphere, as well as water vapor, on the hot sub-Neptune planet TOI-421 B.", "url": "https://www.earth.com/news/webb-telescope-detects-water-vapor-on-planet-outside-the-solar-system-toi-421-b/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/05043649/water-vapor-detected-exoplanet-webb.jpg", "publishedAt": "2025-06-06T00:10:52Z", "content": "Researchers announced that NASAs James Webb space telescope captured an unusual snapshot of a small, gassy planet known as TOI-421 B. They found strong signs of water vapor but no traces of carbon di… [+4618 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "NASA unexpectedly finds 'X-shaped structures' in Earth’s upper atmosphere, which they can’t fully explain - Earth.com", "description": "NASA's GOLD mission found unexpected, and unexplainable, C-shapes and X-shaped formations in part of Earth's atmosphere called the ionosphere.", "url": "https://www.earth.com/news/nasa-gold-mission-unexpectedly-finds-x-shaped-structures-in-earths-upper-atmosphere/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/05145300/earth-upper-atmosphere_x-shaped-structures_unexplained_NASA-Gold-Mission_1m.jpg", "publishedAt": "2025-06-05T21:30:49Z", "content": "Signals from navigation satellites, radio broadcasts, and distant spacecraft all squeeze through a thin, electrified veil in Earth’s atmosphere called the ionosphere. Stretching from about 50 miles t… [+5914 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kenna Hughes-Castleberry", "title": "Fireball streaks through aurora-filled skies photo of the day for June 5, 2025 - Space", "description": "Skywatchers in Chelsea, Canada are treated to a stunning aurora display that has a little something extra.", "url": "https://www.space.com/astronomy/earth/fireball-streaks-through-aurora-filled-skies-space-photo-of-the-day-for-june-5-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QDABHVyjYBDCvcbyjcJSAH.jpg", "publishedAt": "2025-06-05T18:00:00Z", "content": "Spectators were already out capturing the stunning aurora display when a blazing meteor sped past.\r\nWhat is it?\r\nAt 5:57 a.m. local time skywatchers around Montréal, Canada and parts of the northeast… [+1976 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sonia Fernandez", "title": "Largest map of the universe announced revealing 800,000 galaxies, challenging early cosmos theories - Phys.org", "description": "In the name of open science, the multinational scientific collaboration COSMOS on Thursday released the data behind the largest map of the universe. Called the COSMOS-Web field, the project, built with data collected by the James Webb Space Telescope (JWST), …", "url": "https://phys.org/news/2025-06-largest-universe-revealing-galaxies-early.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/mapping-space-largest.jpg", "publishedAt": "2025-06-05T17:37:53Z", "content": "In the name of open science, the multinational scientific collaboration COSMOS on Thursday released the data behind the largest map of the universe. Called the COSMOS-Web field, the project, built wi… [+5967 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Denise Chow, Chase Cain", "title": "Earth's atmosphere hasn't had this much CO2 in millions of years - NBC News", "description": "Earth’s atmosphere now has more carbon dioxide in it than it has in millions — and possibly tens of millions — of years, according to data released Thursday by the National Oceanic and Atmospheric Administration and scientists at the University of California …", "url": "https://www.nbcnews.com/science/climate-change/earth-co2-record-global-warming-rcna210974", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-06/250604-record-high-atmospheric-carbon-se-220p-b00f01.jpg", "publishedAt": "2025-06-05T16:51:50Z", "content": "Earths atmosphere now has more carbon dioxide in it than it has in millions and possibly tens of millions of years, according to data released Thursday by the National Oceanic and Atmospheric Adminis… [+3407 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "The Black Hole Universe: New Model Suggests The Big Bang Was Not The Beginning Of Everything - IFLScience", "description": "\"We are not witnessing the birth of everything from nothing, but rather the continuation of a cosmic cycle,\" said Professor Enrique Gaztanaga.", "url": "https://www.iflscience.com/the-black-hole-universe-new-model-suggests-the-big-bang-was-not-the-beginning-of-everything-79504", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79504/aImg/84286/black-hole-universe-meta.png", "publishedAt": "2025-06-05T16:21:32Z", "content": "A team of physicists have proposed a new cosmological model dubbed the \"black hole universe\" that suggests that our universe did not begin at the Big Bang.For a long time the universe was assumed to … [+4855 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Earth's energy balance is rising much faster than scientists predicted, and we have no idea why - Live Science", "description": "For reasons still unknown, Earth's energy imbalance is rising much faster than models can account for. Now, scientists are calling for long-term investment in monitoring capability, so that they can make informed predictions about climate change.", "url": "https://www.livescience.com/planet-earth/climate-change/earths-energy-imbalance-is-rising-much-faster-than-scientists-expected-and-now-researchers-worry-they-might-lose-the-means-to-figure-out-why", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ohAp2KdU4xd59DVRxmdSvC.gif", "publishedAt": "2025-06-05T16:20:29Z", "content": "Earth's energy imbalance is growing faster than anyone expected — and scientists don't understand why.\r\nTo complicate matters several NASA satellites that provide the highest-resolution picture of th… [+6516 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "150-Million-Year-Old Stegosaurus Skull Rewrites Dinosaur Evolution - SciTechDaily", "description": "A rare stegosaurian skull discovery in Spain redefines dinosaur evolution and unveils a new group, Neostegosauria. Paleontologists from the Fundación Conjunto Paleontológico de Teruel-Dinópolis have made an exciting discovery. In a new study published in the …", "url": "https://scitechdaily.com/150-million-year-old-stegosaurus-skull-rewrites-dinosaur-evolution/", "urlToImage": "https://scitechdaily.com/images/Illustration-of-Dacentrurus-armatus.jpg", "publishedAt": "2025-06-05T16:06:48Z", "content": "Illustration of Dacentrurus armatus. Credit: Adrián Blázquez / Fundación Dinópolis\r\nA rare stegosaurian skull discovery in Spain redefines dinosaur evolution and unveils a new group, Neostegosauria.\r… [+4682 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Terraforming Mars Might Actually Work and Scientists Now Have a Plan to Try It - ZME Science", "description": "Can we build an ecosystem on Mars — and should we?", "url": "https://www.zmescience.com/science/news-science/terraforming-mars-might-actually-work-and-scientists-now-have-a-plan-to-try-it/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/06/hero-image.fit_lim.size_1600x900.v1748868303.jpg", "publishedAt": "2025-06-05T15:46:22Z", "content": "Credit: Daein Ballard/Wikimedia\r\nMars is a frozen shadow of its former self. Its riverbeds are dry, its air is thin and chock-full of carbon dioxide, and its soil is soaked with salts hostile to life… [+6356 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Dopamine Neurons Map Future Rewards, Not Just Past Ones - Neuroscience News", "description": "Populations of dopamine neurons don't simply signal reward prediction errors—they encode rich maps of possible future outcomes, including when and how much a reward might be.", "url": "https://neurosciencenews.com/dopamine-future-reward-29218/", "urlToImage": "https://neurosciencenews.com/files/2025/06/dopamine-reward-neurosicence.jpg", "publishedAt": "2025-06-05T15:25:20Z", "content": "Summary: Populations of dopamine neurons don’t simply signal reward prediction errorsthey encode rich maps of possible future outcomes, including when and how much a reward might be. This diverse, ad… [+13292 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Astronomers discover most powerful cosmic explosions since the Big Bang - Space", "description": "\"These ENTs are different beasts, reaching brightnesses nearly 10 times more than what we typically see.\"", "url": "https://www.space.com/astronomy/astronomers-discover-most-powerful-cosmic-explosions-since-the-big-bang", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5LojtaUwf2Dd69ty73BMmj.jpg", "publishedAt": "2025-06-05T15:24:12Z", "content": "Astronomers have discovered the most powerful cosmic explosions since the Big Bang, naming them \"extreme nuclear transients.\"\r\nThese incredibly energetic explosions occur when stars with masses at le… [+3294 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "SpaceX May Be Failing to Get Starship Working at All - Yahoo", "description": "Last week, both stages of SpaceX's Starship exploded after returning from space. The Super Heavy booster flew apart as it attempted a landing burn over...", "url": "https://futurism.com/spacex-failing-starship", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0pYBthDZBKOQWEr3BUJiAw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MzA-/https://media.zenfs.com/en/futurism_981/1d696670a1cbd2a54de925eacc9f2fd9", "publishedAt": "2025-06-05T15:17:36Z", "content": "Last week, both stages of SpaceX's Starship exploded after returning from space. The Super Heavy booster flew apart as it attempted a landing burn over ground, and forty minutes later, the Starship v… [+4816 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Upcoming Telescope Predicted to Discover Millions of Hidden Solar System Objects - Gizmodo", "description": "With 3.2 billion pixels and a decade-long search, the Rubin Observatory will reveal what’s been hiding in plain sight.", "url": "https://gizmodo.com/upcoming-telescope-predicted-to-discover-millions-of-hidden-solar-system-objects-2000611672", "urlToImage": "https://gizmodo.com/app/uploads/2025/06/rubin-observatory-1200x675.jpg", "publishedAt": "2025-06-05T15:15:03Z", "content": "A new observatory perched high in the Chilean Andes is about to blow the lid off our solar systemand scientists say its going to be like switching from a black-and-white TV to 4K color.\r\nThe National… [+2590 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Worms Caught Building Flesh Towers in the Wild - Gizmodo", "description": "Research out today is the first to document nematodes in the wild amassing into towers, likely as a way to reach new places.", "url": "https://gizmodo.com/wild-worms-build-flesh-towers-and-are-closer-than-you-think-2000611200", "urlToImage": "https://gizmodo.com/app/uploads/2025/06/worm-tower-1-1200x675.jpg", "publishedAt": "2025-06-05T15:00:59Z", "content": "Scientists have just discovered something most of us probably wouldve been fine never knowing: wild nematodesalso known as roundwormslove to climb on top of each other to build fleshy, writhing tower… [+5162 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Tooth fossil analysis upends current theory of prehistoric human evolution - Earth.com", "description": "Scientists used enamel proteins from 2-million-year-old teeth to find unexpected variation in Paranthropus robustus.", "url": "https://www.earth.com/news/tooth-enamel-analysis-suggests-early-eurasians-were-multiple-species-paranthropus-robustus/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/05081924/Paranthropus-robustus_tooth-enamel-fossil-analysis_1.jpg", "publishedAt": "2025-06-05T14:13:27Z", "content": "Ancient tooth enamel proteins have provided powerful clues for researchers studying our very early relatives – Paranthropus robustus, in this instance – and their role in human evolution. \r\nThis hard… [+5919 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Scientists discover universal rule that governs all life on Earth - The Brighter Side of News", "description": "Global study finds a universal pattern organizing life on Earth, reshaping how we understand and protect biodiversity.", "url": "https://www.thebrighterside.news/post/scientists-discover-universal-rule-that-governs-all-life-on-earth/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/06/Screenshot-2025-06-04-121542.png?auto=webp", "publishedAt": "2025-06-05T14:07:00Z", "content": "Across Earths many landscapes and oceans, life has formed in patterns that might not be obvious at first. While it may seem like species are scattered randomly, a new global study suggests theres an … [+6735 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers Discover Giant Planet Orbiting Tiny Star, Defying Planet Formation Theories - The Daily Galaxy", "description": "Astronomers have discovered a giant planet orbiting an incredibly small star.", "url": "https://dailygalaxy.com/2025/06/giant-planet-orbiting-tiny-star/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Astronomers-Discover-Giant-Planet-Orbiting-Tiny-Star-Defying-Planet-Formation-Theories.jpg", "publishedAt": "2025-06-05T14:00:00Z", "content": "A groundbreaking discovery in the field of exoplanet research is forcing scientists to reconsider long-held theories about how planets form. An international team of astronomers, led by the Universit… [+4001 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Astronomers simulate a star's final moments as it's swallowed by a black hole: 'Breaks like an egg' - Space", "description": "A neutron star's final moments may spark violent starquakes, monster shock waves, and even a fleeting, never-before-seen object called a black hole pulsar.", "url": "https://www.space.com/astronomy/black-holes/astronomers-simulate-a-stars-final-moments-as-its-swallowed-by-a-black-hole-breaks-like-an-egg", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8asUNSkjjLcxBNUvSEwhPP.jpg", "publishedAt": "2025-06-05T14:00:00Z", "content": "The universe is full of spectacular and violent events, but few are more dramatic than a black hole tearing apart a star. Now, thanks to advanced computer simulations, scientists have gotten their cl… [+5370 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Watch an asteroid the size of an aircraft carrier make a close pass of Earth on June 5 - Space", "description": "The asteroid will pose zero threat to the moon and Earth.", "url": "https://www.space.com/stargazing/watch-an-asteroid-the-size-of-an-aircraft-carrier-make-a-close-pass-of-earth-on-june-5", "urlToImage": "https://cdn.mos.cms.futurecdn.net/s9EAJRbZhfRbPQCcR6ZoVV.jpg", "publishedAt": "2025-06-05T13:00:00Z", "content": "A potentially hazardous asteroid roughly the size of an aircraft carrier is due to pass within 2.8 million miles (3.5 million km) of Earth on June 5 and you can watch it happen live online.\r\nNASA and… [+2414 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Only 1,280 Survived: The Near-Extinction Event That Nearly Wiped Out Humanity 1 Million Years Ago - The Daily Galaxy", "description": "A dramatic event nearly wiped out humanity nearly one million years ago. New genetic research uncovers the shocking scale of this near-extinction.", "url": "https://dailygalaxy.com/2025/06/only-1280-survived-the-near-extinction-event-that-nearly-wiped-out-humanity-1-million-years-ago/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Primitive-tribe-of-ancient-natives-wearing-animal-skins-1-1.jpg", "publishedAt": "2025-06-05T12:15:00Z", "content": "Nearly one million years ago, humanity came perilously close to disappearing. A new study reveals that our ancestors may have been reduced to just 1,280 individuals, leaving the human race on the bri… [+4178 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Earth’s Magnetic Field Failed 41,000 Years Ago – The Catastrophic Event That Altered Human Evolution Forever - Indian Defence Review", "description": "A mysterious event 41,000 years ago sent Earth’s magnetic field into chaos, reshaping the planet in ways we’re just beginning to understand. Scientists have uncovered haunting sounds that bring this ancient upheaval back to life.", "url": "https://indiandefencereview.com/earths-magnetic-field-failed-41000-years-ago-the-catastrophic-event-that-altered-human-evolution-forever/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/a-group-of-men-running-from-the-sun.jpg", "publishedAt": "2025-06-05T12:00:00Z", "content": "Imagine standing on Earth as its magnetic field suddenly flips, unleashing a dramatic transformation in our planets environment. This might sound like science fiction, but a dramatic magnetic event, … [+4023 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Important scientific finding confirms ancient biblical events - The Brighter Side of News", "description": "To understand ancient conflicts, scientists are turning to archaeomagnetism—a method that reads the Earth’s magnetic memory.", "url": "https://www.thebrighterside.news/post/important-scientific-finding-confirms-ancient-biblical-events/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/12/biblical-events-main-e1749068983545.webp?auto=webp", "publishedAt": "2025-06-05T11:51:00Z", "content": "Rebuilding the past often takes more than digging through ruins or reading faded scrolls. To truly understand ancient conflicts, scientists are turning to archaeomagnetisma method that reads the Eart… [+6440 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Japan's 10,000-Year-Old Underwater 'Pyramid' Is Still One of the World’s Biggest Unsolved Mysteries—No One Knows Who Built It - The Daily Galaxy", "description": "Beneath the waters off Japan’s Yonaguni Island lies a massive structure that has puzzled experts for decades. Its origins spark fierce debate between natural forces and ancient civilizations.", "url": "https://dailygalaxy.com/2025/06/japans-10000-year-old-underwater-pyramid-worlds-biggest-unsolved-mysteries/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/the-Yonaguni-Monument.jpg", "publishedAt": "2025-06-05T11:45:00Z", "content": "Off the coast of Yonaguni Island in Japan, a submerged structure has puzzled divers, researchers, and archaeologists since its discovery nearly four decades ago. The monument, hidden beneath the wate… [+4416 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA withdraws support for conferences - SpaceNews", "description": "A space station research conference has been canceled and the future of a planetary science conference is in doubt as NASA pulls back support for them.", "url": "http://spacenews.com/nasa-withdraws-support-for-conferences/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/06/issrdc-montalbano.webp", "publishedAt": "2025-06-05T11:37:10Z", "content": "Updated 9:20 a.m. Eastern with LPI statement.\r\nWASHINGTON A space station research conference has been canceled and the future of a long-running planetary science conference is in doubt as NASA pulls… [+5824 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists discover a 33-foot Jurassic giant, twice as big as its cousin - Earth.com", "description": "Jurassic giant discovered in China: new dinosaur species Xingxiulong yueorum measured up to 33 feet long, stunning paleontologists.", "url": "https://www.earth.com/news/scientists-discover-a-33-foot-jurassic-giant-twice-as-big-as-its-cousin-xingxiulong/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/05033538/jurassic-dinosaur-xingxiulong-yueorum-33-foot-discovery.jpg", "publishedAt": "2025-06-05T11:33:13Z", "content": "Larger sauropodomorph dinosaurs from the Early Jurassic keep amazing scientists. A striking example is Xingxiulong yueorum, an animal believed to measure as much as 33 feet in length.\r\nThese long-nec… [+5871 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Europe’s Groundbreaking Earth-Mars Tugboat Mission Is Looking for Passengers to Join Its First Voyage - The Daily Galaxy", "description": "This new space venture will change how we travel between Earth and the Red Planet. A limited number of passengers will be part of this historic journey.", "url": "https://dailygalaxy.com/2025/06/europe-earth-mars-tugboat-mission-is-looking-for-passengers-to-join-its-first-voyage/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Artists-impression-of-LightShip.jpg", "publishedAt": "2025-06-05T10:45:00Z", "content": "The European Space Agency (ESA) is embarking on a bold new venture that could reshape the way we explore Mars. Dubbed LightShip, this interplanetary tugboat will transport cargo between Earth and Mar… [+2832 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Tom Hale", "title": "Watch It! Livestream Of A Giant Underwater Volcano In the Pacific Northwest Set To Blow In 2025 - IFLScience", "description": "It's set to erupt in 2025. When exactly, only time will tell.", "url": "https://www.iflscience.com/a-bloated-volcano-on-the-west-coast-is-set-to-erupt-in-2025-and-its-being-livestreamed-now-79488", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79488/aImg/84258/axial-seamount-volcano-meta.png", "publishedAt": "2025-06-05T10:24:51Z", "content": "A bloated submarine volcano on the West Coast of the US is about to blow, and a good snippet of the event is set to be livestreamed straight to your screen. The Axial Seamount is an underwater volcan… [+2313 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "‘Strawberry Moon’ June 2025: See The Lowest Full Moon Since 2006 - Forbes", "description": "Everything you need to know about June’s full strawberry moon, including exactly when, where, and how to see it at its best from where you are.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/06/05/full-moon-june-2025-when-to-see-the-strawberry-moon-rise-and-fall/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/647cd0b68c78818aad0b6fdd/0x0.jpg?format=jpg&crop=4200,2361,x0,y48,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-06-05T10:00:00Z", "content": "The full strawberry moon the final full moon of spring in the Northern Hemisphere will turn full on Wednesday, June 11, 2025. However, it will be best seen at moonrise on Tuesday, June 10 as it appea… [+3708 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Building the 'Moonhouse': Q&A with artist Mikael Genberg - Space", "description": "\"When I first imagined a typical Swedish house standing on the moon, I instantly felt the power of the image, but also its impossibility.\"", "url": "https://www.space.com/space-exploration/missions/building-the-moonhouse-q-and-a-with-artist-mikael-genberg", "urlToImage": "https://cdn.mos.cms.futurecdn.net/e74cPQ7D4cf94Zh5PmTmHc.jpg", "publishedAt": "2025-06-05T10:00:00Z", "content": "A dream that Mikael Genberg has nurtured for more than a quarter century could come true today (June 5).\r\nThe Swedish artist's \"Moonhouse,\" a project he devised way back in 1999, is set to touch down… [+5273 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don’t Miss This Rare Chance to See the Milky Way’s Glowing Core - SciTechDaily", "description": "This June, the Milky Way’s brilliant heart lights up the night as planets align and the solstice sun marks Earth’s celestial tipping point.", "url": "https://scitechdaily.com/dont-miss-this-rare-chance-to-see-the-milky-ways-glowing-core/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Arch-Over-Lone-Tree-Center.jpg", "publishedAt": "2025-06-05T09:23:32Z", "content": "The Milky Way’s glowing core dominates June’s skies, arcing overhead in its full glory for those under dark skies. This cosmic backdrop sets the stage for Mars brushing past Regulus, Venus pairing wi… [+8016 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA’s new asteroid hunter opens its eye to the sky - European Space Agency", "description": "The European Space Agency’s (ESA) newest planetary defender has opened its ‘eye’ to the cosmos for the first time. The&nbsp;Flyeye telescope’s ‘first light’ marks the beginning of a new chapter in how we scan the skies for new near-Earth asteroids and comets.", "url": "https://www.esa.int/Space_Safety/Planetary_Defence/ESA_s_new_asteroid_hunter_opens_its_eye_to_the_sky", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/06/flyeye_s_view_of_the_andromeda_galaxy/26727542-1-eng-GB/Flyeye_s_view_of_the_Andromeda_galaxy_pillars.png", "publishedAt": "2025-06-05T09:02:40Z", "content": "Space Safety05/06/20251132 views29 likes\r\nThe European Space Agencys (ESA) newest planetary defender has opened its eye to the cosmos for the first time. The Flyeye telescopes first light marks the b… [+2705 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Magnetic fields appear to be as old as the universe itself. What created them? - Space", "description": "Everywhere we look, we see magnetic fields. But where did they come from?", "url": "https://www.space.com/astronomy/magnetic-fields-appear-to-be-as-old-as-the-universe-itself-what-created-them", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7cbQooiqidLB75gwxKoZJY.jpg", "publishedAt": "2025-06-05T09:00:00Z", "content": "The universe is soaked in weak-but-persistent magnetic fields. Despite decades of research, astronomers still aren't exactly sure where these magnetic fields came from. But new research suggests they… [+3898 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "Something Deep in Our Galaxy Is Pulsing Every 44 Minutes. No One Knows Why. - AOL.com", "description": "What is this thing?", "url": "https://www.popularmechanics.com/space/deep-space/a64952278/something-deep-in-our-galaxy-is-pulsing-every-44-minutes-no-one-knows-why/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yilHx4gOMIK5GpKE7qDNxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_popular_mechanics_812/93b3a4c2a1f256b1f4d1c0be1b089fcb", "publishedAt": "2025-06-05T07:36:25Z", "content": "Something in Our Galaxy Pulses Every 44 MinutesNazarii Neshcherenskyi - Getty Images\r\nHeres what youll learn when you read this story:\r\n<ul><li>ASKAP J1832-0911 is a long-period radio transient (LPT)… [+4294 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "We've Finally Seen The Skyscraper Tsunami That Shook Earth For 9 Days - ScienceAlert", "description": "In September 2023, Earth rumbled.", "url": "https://www.sciencealert.com/weve-finally-seen-the-skyscraper-tsunami-that-shook-earth-for-9-days", "urlToImage": "https://www.sciencealert.com/images/2025/06/MegaTsunamiCropped.jpg", "publishedAt": "2025-06-05T07:09:12Z", "content": "In September 2023, Earth rumbled.\r\nSeismic monitoring all over the globe registered a strange signal that repeated every 90 seconds over a whopping nine days, petering out in a way never before seen.… [+4143 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "A 'Crazy Idea' About Pluto Was Just Confirmed in a Scientific First - ScienceAlert", "description": "When the New Horizons spacecraft swept past Pluto and Charon in 2015, it revealed two amazingly complex worlds and an active atmosphere on Pluto.", "url": "https://www.sciencealert.com/a-crazy-idea-about-pluto-was-just-confirmed-in-a-scientific-first", "urlToImage": "https://www.sciencealert.com/images/2025/06/PlutoHazeAtmosphere.jpg", "publishedAt": "2025-06-05T05:56:12Z", "content": "When the New Horizons spacecraft swept past Pluto and Charon in 2015, it revealed two amazingly complex worlds and an active atmosphere on Pluto. Those snapshots redefined our understanding of the sy… [+4986 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Crack 30-Year Mystery Behind “Holy Grail” Cancer Drug - SciTechDaily", "description": "A Danish research team has cracked the full biosynthesis of Taxol enabling cheaper and eco-friendly production in yeast. Taxol is one of the most trusted chemotherapy drugs for treating breast, ovarian, cervical, and lung cancers. Yet making this life-saving …", "url": "https://scitechdaily.com/?p=478685", "urlToImage": "https://scitechdaily.com/images/Biological-Lymphocytes-and-Cancer-Cell.jpg", "publishedAt": "2025-06-05T03:43:12Z", "content": "Scientists have finally decoded the full biosynthetic pathway of Taxol, a crucial chemotherapy drug, solving a decades-long mystery. Credit: Shutterstock\r\nA Danish research team has cracked the full … [+4262 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "Maria Merano", "title": "SpaceX marks 500th Falcon launch with Starlink 11-22 Mission - Teslarati", "description": "The Starlink 11-22 mission marks SpaceX’s 500th Falcon flight & 50th Starlink launch of 2025. Will SpaceX IPO Starlink next?", "url": "https://www.teslarati.com/spacex-500-falcon-launch-starlink-mission/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2024/04/GKm6BcQbEAA_80u-1000x600.jpg", "publishedAt": "2025-06-05T03:26:20Z", "content": "SpaceX celebrated its 500th Falcon rocket launch with the Starlink 11-22 mission, a midweek flight from Vandenberg Space Force Base in California.\r\nThe milestone was achieved with a Falcon 9 liftoff … [+2116 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "New T cell protein discovery stops autoimmune diseases in their tracks - The Brighter Side of News", "description": "Researchers were surprised by the potency of suppressing multiple autoimmune diseases—not only in prevention but also in treatment.", "url": "https://www.thebrighterside.news/post/new-t-cell-protein-discovery-stops-autoimmune-diseases-in-their-tracks/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/06/Screenshot-2025-06-03-162109.png?auto=webp&width=2000&height=1043", "publishedAt": "2025-06-05T00:07:00Z", "content": "T cells are the immune systems frontline fighters. When they detect danger, they rapidly multiply and transform into effector cells that destroy pathogens. This transformation demands an intense burs… [+6606 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover “Alien” Chemistry Under Earth’s Largest Lithium Deposits - SciTechDaily", "description": "New research reveals that lithium-rich brines have a chemistry dominated by boron, fundamentally different from typical saline waters. A new study published in Science Advances reveals a surprising twist: much of the world’s lithium is found in salty waters w…", "url": "https://scitechdaily.com/scientists-uncover-alien-chemistry-under-earths-largest-lithium-deposits/", "urlToImage": "https://scitechdaily.com/images/Salar-de-Uyuni-Salt-Mound.jpg", "publishedAt": "2025-06-04T21:23:39Z", "content": "A groundbreaking study shows boron, not carbonate, controls the chemistry of lithium-rich brines, with major implications for mining and environmental management.\r\nNew research reveals that lithium-r… [+5258 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Long, dark 'streaks' spotted on Mars aren't what scientists thought - Live Science", "description": "A set of dark streaks that regularly wind across the Martian surface are more likely to be formed by dust and wind than by water, a new artificial intelligence analysis has revealed.", "url": "https://www.livescience.com/space/mars/long-dark-streaks-spotted-on-mars-arent-what-scientists-thought", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iFYsmRFo4AcZGYDBstepk8.jpg", "publishedAt": "2025-06-04T20:16:00Z", "content": "Mysterious dark streaks flowing across Mars\r\n's surface may not be the result of running water after all, a new artificial intelligence (AI) analysis suggests.\r\nThe streaks, first observed running al… [+2456 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Is the Moon the Next Billionaire’s Playground? A Trillion Dollars Worth of Platinum Is Waiting - The Daily Galaxy", "description": "Lunar craters could hold a trillion-dollar stash of platinum and other rare metals. But as mining in space becomes more feasible, who will claim these valuable resources?", "url": "https://dailygalaxy.com/2025/06/is-the-moon-the-next-billionaires-playground-a-trillion-dollars-worth-of-platinum-is-waiting/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Is-the-Moon-the-Next-Billionaires-Playground-A-Trillion-Dollars-Worth-of-Platinum-Is-Waiting.jpg", "publishedAt": "2025-06-04T19:00:00Z", "content": "For centuries, humans have gazed at the Moon, marveling at its silent beauty. Now, new research suggests that lunar craters could hold vast riches far beyond our wildest dreams. Scientists believe th… [+3303 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Dinosaurs Had More Than Just Teeth—They Had Cancer, and It’s Changing Everything - The Daily Galaxy", "description": "Scientists have uncovered evidence that dinosaurs suffered from cancer. A 70-million-year-old fossil reveals a tumor linked to one that still affects humans today.", "url": "https://dailygalaxy.com/2025/06/dinosaurs-had-more-than-just-teeth-they-had-cancer/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Dinosaurs-Had-More-Than-Just-Teeth—They-Had-Cancer-and-Its-Changing-Everything.jpg", "publishedAt": "2025-06-04T18:30:00Z", "content": "Dinosaurs, often depicted as unstoppable creatures of immense strength, were far from immune to the diseases that affect modern animals including cancer. A groundbreaking new study has revealed that … [+3280 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Galaxy Clusters on Course to Crash Again, NASA’s Chandra Finds - NASA (.gov)", "description": "New observations from NASA’s Chandra X-ray Observatory and other telescopes have captured a rare cosmic event: two galaxy clusters have collided and are now", "url": "https://www.nasa.gov/image-article/galaxy-clusters-on-course-to-crash-again-nasas-chandra-finds/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/06/g181.jpg", "publishedAt": "2025-06-04T18:15:43Z", "content": "New observations from NASAs Chandra X-ray Observatory and other telescopes have captured a rare cosmic event: two galaxy clusters have collided and are now poised to head back for another swipe at ea… [+4180 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Jyväskylä", "title": "The heaviest proton emitter: New type of atomic nucleus discovered - Phys.org", "description": "For the first time in almost 30 years, the heaviest nucleus decaying via proton emission has been measured. The previous similar breakthrough was achieved in 1996.", "url": "https://phys.org/news/2025-06-heaviest-proton-emitter-atomic-nucleus.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-heaviest-proton-em.jpg", "publishedAt": "2025-06-04T17:10:04Z", "content": "For the first time in almost 30 years, the heaviest nucleus decaying via proton emission has been measured. The previous similar breakthrough was achieved in 1996.\r\nThe radioactive decay of atomic nu… [+2941 chars]"}, {"source": {"id": null, "name": "Usgs.gov"}, "author": null, "title": "End of an Era: Landsat 7 Decommissioned After 25 Years of Earth Observation - USGS (.gov)", "description": "After 25 years of capturing Earth's changing landscape, the Landsat 7 satellite received its final transmission from the U.S. Geological Survey and was officially decommissioned June 4, closing a remarkable chapter in space-based observation.", "url": "https://www.usgs.gov/news/national-news-release/end-era-landsat-7-decommissioned-after-25-years-earth-observation", "urlToImage": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/styles/teaser/public/media/images/landsat7_300DPI.jpg?h=9f00f10b&itok=WfyKDBQK", "publishedAt": "2025-06-04T17:04:33Z", "content": "These Landsat 7 images showcase the first and last captures of the Las Vegas area, taken on July 4, 1999, and May 28, 2024, respectively. The images highlight the city, the surrounding desert landsca… [+2935 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Satellite Footage Captures Mysterious Structure That Looks Like Human Lips - Indian Defence Review", "description": "A strange hill in Sudan resembling pursed human lips has puzzled scientists—discover the mysterious formation seen from space!", "url": "https://indiandefencereview.com/satellite-mysterious-structure-human-lips/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/satellite-footage-captures-mysterious-structure-that-looks-like-human-lips.jpg", "publishedAt": "2025-06-04T16:15:00Z", "content": "In 2012, satellite imagery from Google Earth captured an intriguing and mysterious hill formation in Sudan, which appears to resemble pursed human lips. Located in the arid region of West Darfur, abo… [+3865 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Webb Telescope Captures a Stunning New View of the Sombrero Galaxy - The Daily Galaxy", "description": "NASA's James Webb Space Telescope unveils new insights into the Sombrero Galaxy.", "url": "https://dailygalaxy.com/2025/06/nasas-webb-telescope-sombrero-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASAs-Webb-Telescope-Captures-a-Stunning-New-View-of-the-Sombrero-Galaxy.jpg", "publishedAt": "2025-06-04T16:00:00Z", "content": "NASAs James Webb Space Telescope has just added to the growing catalog of astronomical discoveries by providing a new perspective on the Sombrero Galaxy. The stunning new image, captured in near-infr… [+4480 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "An 'invisible threat': Swarm of hidden 'city killer' asteroids around Venus could one day collide with Earth, simulations show - Live Science", "description": "A new study suggests that unidentified \"co-orbital asteroids\" around Venus may have the capacity to impact our planet in the future, with potentially devastating consequences. However, there is no immediate threat.", "url": "https://www.livescience.com/space/asteroids/an-invisible-threat-swarm-of-hidden-city-killer-asteroids-around-venus-could-one-day-collide-with-earth-simulations-show", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FB3hiwZ3Csvg8ZkoykMx7i.jpg", "publishedAt": "2025-06-04T15:48:22Z", "content": "A hidden swarm of \"city killer\" space rocks, known as co-orbital asteroids\r\n, is likely hiding around Venus\r\n and could pose an \"invisible threat\" to Earth over the coming millennia if the asteroids … [+5242 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Plant You’ve Never Heard of Can Do What Scientists Thought Was Impossible - SciTechDaily", "description": "A study on beetleweed shows that autopolyploid plants with different chromosome sets can coexist, reshaping how scientists understand rapid speciation. About 3.7 billion years ago, a chain of naturally occurring amino acids, similar to those found in meteorit…", "url": "https://scitechdaily.com/this-plant-youve-never-heard-of-can-do-what-scientists-thought-was-impossible/", "urlToImage": "https://scitechdaily.com/images/Botanical-Illustration-of-Beetleweed.jpg", "publishedAt": "2025-06-04T15:29:24Z", "content": "Beetleweeds also have a somewhat unpleasant odor reminiscent of skunk. Credit: Henry Crane Andrews (1803)\r\nA study on beetleweed shows that autopolyploid plants with different chromosome sets can coe… [+5615 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "34-Million-Year-Old Snake Discovery Unveils Surprising Secrets About Reptile Evolution - Indian Defence Review", "description": "A stunning 34-million-year-old snake fossil discovery in Wyoming is rewriting the history of evolution.", "url": "https://indiandefencereview.com/34-million-year-old-snake-discovery/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/34-million-year-old-snake-discovery-unveils-surprising-secrets-about-reptile-evolution.jpg", "publishedAt": "2025-06-04T15:15:00Z", "content": "Paleontologists have made a groundbreaking discovery in western Wyoming: the nearly complete fossils of a 34-million-year-old snake, Hibernophis breithaupti. This extraordinary find reshapes our unde… [+4489 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "They Just Wanted to Make a Space Movie. Instead, They Uncovered a Mind-Blowing Cosmic Secret - The Daily Galaxy", "description": "A simple planetarium show led to an unexpected discovery, revealing a shocking new structure!", "url": "https://dailygalaxy.com/2025/06/space-movie-mind-blowing-cosmic-secret/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/They-Just-Wanted-to-Make-a-Space-Movie.-Instead-They-Uncovered-a-Mind-Blowing-Cosmic-Secret.jpg", "publishedAt": "2025-06-04T15:00:00Z", "content": "A spiral-shaped structure in the Oort Cloud, long thought to be a featureless shell of icy debris, has been revealed by accidentthrough a planetarium show. The unexpected finding emerged as astronome… [+3444 chars]"}, {"source": {"id": null, "name": "Housedigest.com"}, "author": "Michelle Roberts-Garcia", "title": "Swap Out The Dated Eucalyptus Decor Trend For This More Modern Option - House Digest", "description": "If you are over the eucalyptus stem look that dominated the 2010s, there are some more modern options that you can explore.", "url": "https://www.housedigest.com/1874882/swap-outdated-eucalyptus-plant-decor-dark-stemmed-plant-elevated-design/", "urlToImage": "https://www.housedigest.com/img/gallery/swap-out-the-dated-eucalyptus-decor-trend-for-this-more-modern-option/l-intro-1748553502.jpg", "publishedAt": "2025-06-04T14:40:00Z", "content": "For this swap, it's totally fine to go with either real or faux stems. While there are plenty of mistakes everyone makes when buying fake plants, there are ways to ensure they look good. For starters… [+1150 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Telescope Captures First-Ever Ultra-Fine Magnetic Stripes on the Sun’s Surface! - The Daily Galaxy", "description": "A groundbreaking discovery using the Inouye Solar Telescope has revealed ultra-fine magnetic \"stripes\" on the Sun's surface, offering new insights into space weather and solar dynamics.", "url": "https://dailygalaxy.com/2025/06/ultra-fine-magnetic-stripes-suns-surface/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Telescope-Captures-First-Ever-Ultra-Fine-Magnetic-Stripes-on-the-Suns-Surface.jpg", "publishedAt": "2025-06-04T14:00:00Z", "content": "A groundbreaking study published in The Astrophysical Journal Lettersexplores the fine-scale structure of the Suns surface, revealing unprecedented details about its magnetic fields. Using the power … [+5446 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Matt Morris", "title": "The biggest binoculars we've ever tested: Celestron SkyMaster 25x100 hands-on review - Live Science", "description": "With 25x magnification and giant 100mm lenses, these binoculars from Celestron are built for serious night sky observation — ideal for tripods and clear skies.", "url": "https://www.livescience.com/technology/celestron-skymaster-25x100-binocular-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QTRGrt7Pv4WDgortESAi2G.jpg", "publishedAt": "2025-06-04T14:00:00Z", "content": "Why you can trust Live Science\r\nOur expert reviewers spend hours testing and comparing products and services so you can choose the best ones for you. Find out more about how we test.The Celestron Sky… [+8308 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Ezzy Pearson", "title": "New theory could finally make ‘quantum gravity’ a reality – and prove Einstein wrong - BBC Science Focus Magazine", "description": "A new theory could finally unite quantum mechanics and gravity into a single Theory of Everything - one of physics biggest challenges", "url": "https://www.sciencefocus.com/news/new-theory-quantum-gravity", "urlToImage": "https://c02.purpledshub.com/uploads/sites/41/2025/06/koto_feja-GettyImages-2151292894-1.jpg?w=1200", "publishedAt": "2025-06-04T13:34:10Z", "content": "Scientists might be on the verge of cracking one of the biggest problems in physics, allowing them to finally create a grand Theory of Everything.\r\nCurrently, two separate theories are used to explai… [+6090 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "japinter", "title": "Cosmic Dawn with Nobel Laureate John Mather - NASA (.gov)", "description": "A new NASA documentary, Cosmic Dawn, chronicles the inside story of the James Webb Space Telescope. John Mather led the telescope's science team for decades.", "url": "https://www.nasa.gov/podcasts/curious-universe/cosmic-dawn-with-nobel-laureate-john-mather/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/cosmic-dawn-thumbnail-horizontal-program-tile-16-9-with-title.png", "publishedAt": "2025-06-04T13:24:39Z", "content": "Episode description:\r\nThe James Webb Space Telescope is doing something astronomers dreamed about for decades: peering into our universes early past, a period known as cosmic dawn. A new NASA+ docume… [+19142 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How and why do cats purr? Scientists finally found the answers - Earth.com", "description": "Researchers found that cats with a shorter repeat in the androgen receptor gene purr more. Males are more vocal, females may act aggressively.", "url": "https://www.earth.com/news/how-and-why-do-cats-purr-scientists-finally-found-the-answers-genetic-dna/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/04071310/cat_purring_genetics_1m.jpg", "publishedAt": "2025-06-04T13:23:06Z", "content": "Whether you share your home with a cat or simply watch them purr online, these creatures hold an irreplaceable spot in countless lives. They have evolved alongside humans, displaying distinct tendenc… [+5340 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "General framework bridges quantum thermodynamics and non-Markovianity - Phys.org", "description": "The extraction of work (i.e., usable energy) from quantum processes is a key focus of quantum thermodynamics research, which explores the application of thermodynamics laws to quantum systems. Meanwhile, other quantum physics research has been investigating t…", "url": "https://phys.org/news/2025-06-general-framework-bridges-quantum-thermodynamics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-general-framework-br.jpg", "publishedAt": "2025-06-04T13:19:22Z", "content": "The extraction of work (i.e., usable energy) from quantum processes is a key focus of quantum thermodynamics research, which explores the application of thermodynamics laws to quantum systems. Meanwh… [+7233 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Uncover a Lost World Hidden Beneath Antarctica’s Frozen Tapestry for Millions of Years - Indian Defence Review", "description": "Beneath Antarctica’s thick ice, a hidden landscape has finally been uncovered, revealing ancient peaks buried for millions of years. New research sheds light on the dynamic forces that shaped the continent’s geological history.", "url": "https://indiandefencereview.com/scientists-uncover-a-lost-world-hidden-beneath-antarcticas-frozen-tapestry-for-millions-of-years/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/the-ice-blanketed-bedrock-of-the-transantarctic-mountains.jpg", "publishedAt": "2025-06-04T13:05:00Z", "content": "Deep beneath Antarctica’s thick ice lies a hidden landscape that has long eluded scientific exploration. In a groundbreaking study, researchers have identified ancient mountain peaks buried under mil… [+2755 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "20-Year Mystery of The Muon's Wiggle May Finally Be Solved - ScienceAlert", "description": "Physicists at Fermilab have made the most precise measurement ever of a long-disputed value – the magnetic 'wiggle' of an elementary particle known as a muon.", "url": "https://www.sciencealert.com/20-year-mystery-of-the-muons-wiggle-may-finally-be-solved", "urlToImage": "https://www.sciencealert.com/images/2025/06/muon.jpg", "publishedAt": "2025-06-04T13:01:24Z", "content": "Physicists at Fermilab have made the most precise measurement ever of a long-disputed value the magnetic 'wiggle' of an elementary particle known as a muon.\r\nIn somewhat disappointing news, that meas… [+4435 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "A Giant Mouth Has Opened on The Sun And Even It Looks Surprised - ScienceAlert", "description": "A giant mouth-like hole in the Sun about as wide as five Jupiters is blasting hot Sun breath in Earth's general direction.", "url": "https://www.sciencealert.com/a-giant-mouth-has-opened-on-the-sun-and-even-it-looks-surprised", "urlToImage": "https://www.sciencealert.com/images/2025/06/coronal-face.jpg", "publishedAt": "2025-06-04T12:02:37Z", "content": "A giant mouth-like hole in the Sun about as wide as five Jupiters is blasting hot Sun breath in Earth's general direction.\r\nIt's not an actual hole in the Sun, but what is known as a coronal hole: a … [+2649 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sanjukta Mondal", "title": "Most people obey arbitrary rules even when it's not in their interest to do so, experiments show - Phys.org", "description": "Contrary to the popular saying, rules aren't meant to be broken, as they are foundational to society and exist to uphold safety, fairness and order in the face of chaos. The collective benefits of rule-following are well established, but individual incentives…", "url": "https://phys.org/news/2025-06-people-obey-arbitrary.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/people-inclined-to-obe.jpg", "publishedAt": "2025-06-04T10:30:01Z", "content": "Contrary to the popular saying, rules aren't meant to be broken, as they are foundational to society and exist to uphold safety, fairness and order in the face of chaos. The collective benefits of ru… [+4320 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "James Webb Space Telescope unveils fiery origins of a distant, hellish exoplanet - Space", "description": "\"Studying the chemistry of ultra hot planets like WASP-121b helps us to understand how gas giant atmospheres work under extreme temperature conditions.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-unveils-fiery-origins-of-a-distant-hellish-exoplanet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AeJrDikaRxf2H3pQWGUjnE.webp", "publishedAt": "2025-06-04T10:00:00Z", "content": "Astronomers using NASA's James Webb Space Telescope (JWST\r\n) have uncovered the tumultuous history of a distant, hellishly hot exoplanet that's being stretched and scorched by its star.\r\nThe planet, … [+4623 chars]"}]}