{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "SFGate"}, "author": "Ariana Bindman", "title": "Researchers make stunning discovery on distant moon - SFGATE", "description": "Researchers discovered that one of Saturn's moons, Enceladus, might contain an abundance of phosphorus.", "url": "https://www.sfgate.com/bayarea/article/phosphorus-discovery-saturn-moon-enceladus-18155050.php", "urlToImage": "https://s.hdnux.com/photos/01/33/25/30/23942682/5/rawImage.jpg", "publishedAt": "2023-06-15T23:13:27Z", "content": "A crucial building block for life has been found in one of the galaxys most unlikely places. According to a recent study published on June 14 in the journal Nature, Enceladus an icy moon orbiting Sat… [+1770 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rebecca Dzombak", "title": "We've pumped so much groundwater that we've nudged the Earth's spin, says new study - Phys.org", "description": "By pumping water out of the ground and moving it elsewhere, humans have shifted such a large mass of water that the Earth tilted nearly 80 centimeters (31.5 inches) east between 1993 and 2010 alone, according to a new study published in Geophysical Research L…", "url": "https://phys.org/news/2023-06-weve-groundwater-nudged-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/weve-pumped-so-much-gr.jpg", "publishedAt": "2023-06-15T20:59:45Z", "content": "By pumping water out of the ground and moving it elsewhere, humans have shifted such a large mass of water that the Earth tilted nearly 80 centimeters (31.5 inches) east between 1993 and 2010 alone, … [+4405 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How To See the Invisible: Measuring Dark Matter With Hyper Suprime-Cam Reveals Discrepancy - SciTechDaily", "description": "Using the Hyper Suprime-Cam (HSC), a team led by Princeton University has studied the distribution of dark matter and found a discrepancy between the 'clumpiness' (S8 value) of dark matter in the present universe versus the early universe. This discrepancy co…", "url": "https://scitechdaily.com/how-to-see-the-invisible-measuring-dark-matter-with-hyper-suprime-cam-reveals-discrepancy/", "urlToImage": "https://scitechdaily.com/images/Abstract-Astrophysics-Dark-Matter-Mystery.jpg", "publishedAt": "2023-06-15T20:37:48Z", "content": "ByPrinceton UniversityJune 15, 2023\r\nAn international team of astrophysicists and cosmologists, using the Hyper Suprime-Cam (HSC), one of the worlds most powerful astronomical cameras, and data from … [+18636 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "House-sized asteroid followed by bus-sized asteroid - EarthSky", "description": null, "url": "https://earthsky.org/space/house-sized-asteroid-2023-lz-to-pass-earth-june-14-2023/", "urlToImage": "https://earthsky.org/upl/2023/06/2023-LZ-on-Paint-KKW.jpg", "publishedAt": "2023-06-15T19:56:05Z", "content": "Bus-sized asteroid to pass Earth\r\nHot on the heels of the house-sized asteroid that passed Earth on June 14, 2023, is a bus-sized asteroid that will pass Earth on June 15, 2023. Astronomers discovere… [+4994 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Astronauts unfurl final roll-out solar array (for now) at space station in record-tying spacewalk - Space.com", "description": "Stephen Bowen now shares the record for the most spacewalks conducted by an American after helping to deploy the last (for now) of six new solar arrays.", "url": "https://www.space.com/astronauts-spacewalk-international-space-station-sixth-solar-array-deployed", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KWEByyFYKL97CnXhewKZZC-1200-80.jpg", "publishedAt": "2023-06-15T18:58:36Z", "content": "Two NASA astronauts deployed the sixth and last (for now) upgraded solar array outside of the International Space Station, increasing the orbital laboratory's power supply while tying an American spa… [+5743 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lindsey Ellefson", "title": "When to Use a Microfiber Cloth Instead of Paper Towels - Lifehacker", "description": "They only sort of do the same thing, and they aren't always interchangeable.", "url": "https://lifehacker.com/when-to-use-a-microfiber-cloth-instead-of-paper-towels-1850544019", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/2cff14489140619cf9d2fc15b9720700.jpg", "publishedAt": "2023-06-15T18:33:36Z", "content": "Microfiber clothssoft, absorbent, economicalare often a preferable alternative to using and throwing away a heap of paper towels. But not every time. Heres how should you decide which to reach for wh… [+2243 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "The intriguing correlation between earthquakes and cosmic radiation - Phys.org", "description": "There is a clear statistical correlation between global seismic activity and changes in the intensity of cosmic radiation recorded at the surface of our planet, potentially helping to predict earthquakes. Surprisingly, it exhibits a periodicity that escapes u…", "url": "https://phys.org/news/2023-06-intriguing-earthquakes-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/intriguing-correlation.jpg", "publishedAt": "2023-06-15T15:04:18Z", "content": "by The Henryk Niewodniczanski Institute of Nuclear Physics Polish Academy of SciencesThere is a clear statistical correlation between global seismic activity and changes in the intensity of cosmic ra… [+7686 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Cosmic-ray 'GPS' system that tracks underground movement could change the way we respond to disasters - Livescience.com", "description": "A new system that uses subatomic particles produced high in Earth's atmosphere could provide a view inside volcanoes and help locate people trapped beneath rubble.", "url": "https://www.livescience.com/technology/communications/cosmic-ray-gps-system-that-tracks-underground-movement-could-change-the-way-we-respond-to-disasters", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7mmgV2UDnoV8ztZFpNDRrF-1200-80.jpg", "publishedAt": "2023-06-15T15:00:10Z", "content": "Scientists have harnessed the byproducts of cosmic rays\r\n to create the world's first \"GPS\" system that works underground — and it could be used to monitor volcanoes and aid in future search-and-resc… [+3767 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Quantum interference of light: Anomalous phenomenon found - Phys.org", "description": "A counterintuitive facet of the physics of photon interference has been uncovered by three researchers of Université libre de Bruxelles, Belgium. In an article published this month in Nature Photonics, they have proposed a thought experiment that utterly cont…", "url": "https://phys.org/news/2023-06-quantum-anomalous-phenomenon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/quantum-interference-o-1.jpg", "publishedAt": "2023-06-15T15:00:09Z", "content": "A counterintuitive facet of the physics of photon interference has been uncovered by three researchers of Université libre de Bruxelles, Belgium. In an article published this month in Nature Photonic… [+5600 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Right-handed building blocks of life might have had a rocky start - Phys.org", "description": "Harvard University led research may have solved the puzzle of how life became molecularly right-handed. In the paper, \"Origin of biological homochirality by crystallization of an RNA precursor on a magnetic surface,\" published in Science Advances, the researc…", "url": "https://phys.org/news/2023-06-right-handed-blocks-life-rocky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/right-handed-building.jpg", "publishedAt": "2023-06-15T14:30:01Z", "content": "The mechanism of spin-selective crystallization due to the CISS effect and the experimental setup.(A) As molecules approach a surface, they transiently acquire an induced charge polarization. Because… [+4565 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kerry Breen", "title": "NASA's Curiosity rover sends \"postcard\" showing Mars during different times of the day - CBS News", "description": "The panoramic postcard shows multiple landmarks on the planet.", "url": "https://www.cbsnews.com/news/mars-postcard-nasa-curiosity-rover/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/06/15/ad21b349-921c-42e9-b981-ed83a0b4431a/thumbnail/1200x630/701b9881aeee68265daa39db30bfd9bc/27508-pia25912-web.jpg?v=adb9795b43723798d80fb080371b87b9", "publishedAt": "2023-06-15T13:17:00Z", "content": "NASA's Mars rover, Curiosity, recently captured a stunning photo of the Martian skies and landscape that offers researchers a glimpse at what the red planet looks like at different times of day.\r\nThe… [+2998 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Old, ultra-faint and metal-poor star cluster discovered - Phys.org", "description": "An international team of astronomers reports the discovery of a new star cluster (SC) as part of the DECam Local Volume Exploration (DELVE) survey. The newfound cluster, designated DELVE 6, is ultra-faint, metal-poor and is estimated to be about 9 billion yea…", "url": "https://phys.org/news/2023-06-ultra-faint-metal-poor-star-cluster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/old-ultra-faint-and-me.jpg", "publishedAt": "2023-06-15T13:16:05Z", "content": "An international team of astronomers reports the discovery of a new star cluster (SC) as part of the DECam Local Volume Exploration (DELVE) survey. The newfound cluster, designated DELVE 6, is ultra-… [+3611 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "More Evidence of Massive First Generation Stars - Universe Today", "description": "A few days ago I wrote about the search for Population III stars. These stars were the first stars of the universe. Giant beasts hundreds of times more massive than the Sun, composed only of hydrogen and helium. These massive stars would have been very short-…", "url": "https://www.universetoday.com/161896/more-evidence-of-massive-first-generation-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/pairsupernova-scaled.jpg", "publishedAt": "2023-06-15T13:14:46Z", "content": "A few days ago I wrote about the search for Population III stars. These stars were the first stars of the universe. Giant beasts hundreds of times more massive than the Sun, composed only of hydrogen… [+2974 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Private space station: How Axiom Space plans to build its orbital outpost - Space.com", "description": "Axiom hopes to dock its first module to the ISS by 2026.", "url": "https://www.space.com/axiom-space-private-station-iss-2026", "urlToImage": "https://cdn.mos.cms.futurecdn.net/X4sDdds9bKLVzZ8cWtkgU-1200-80.jpg", "publishedAt": "2023-06-15T13:00:00Z", "content": "Axiom Space has big plans for low Earth orbit.\r\nThe Houston-based company, founded in 2016, was the first to ferry a flight of all private citizens to the International Space Station (ISS) aboard the… [+5863 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Meet The Giant Armored Fossil Skink Twice As Big As Largest Surviving Species - IFLScience", "description": "Fifty thousand years ago in Australia, even the skinks were chonky.", "url": "https://www.iflscience.com/meet-the-giant-armored-fossil-skink-twice-as-big-as-largest-surviving-species-69394", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69394/aImg/68620/chonkasaurus-meta.png", "publishedAt": "2023-06-15T11:09:39Z", "content": "A newly described species of skink was 1,000 times heavier than the typical member of that family. The largest known skink went extinct 47,000 years ago, at the same time as many other Australian gia… [+3542 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Michael Marshall", "title": "This 'lost world' reveals a new chapter in the evolution of life - National Geographic", "description": "The origin of complex organisms called eukaryotes—which includes all animals, plants, and fungi—is one of biology’s biggest mysteries. A new discovery helps reveal these evolutionary roots.", "url": "https://www.nationalgeographic.com/premium/article/lost-world-reveals-new-chapter-in-evolution-of-life", "urlToImage": "https://i.natgeofe.com/n/65bd9f94-9767-4e1f-84b2-0b38f2849635/C0244257-Evolution_Drawing_16x9.jpg?w=1200", "publishedAt": "2023-06-15T11:02:32Z", "content": "The origin of complex organisms called eukaryoteswhich includes all animals, plants, and fungiis one of biologys biggest mysteries. A new discovery helps reveal these evolutionary roots."}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Fastest Runaway Star In The Milky Way Discovered Moving At 2285 Kilometers Per Second - IFLScience", "description": "Some of these stars are so fast that they could easily (and will) leave our galaxy.", "url": "https://www.iflscience.com/fastest-runaway-star-in-milky-way-discovered-moving-at-2285-kilometers-per-second-69393", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69393/aImg/68619/wd-hypervelocity-meta.jpg", "publishedAt": "2023-06-15T10:37:20Z", "content": "Astronomers have discovered six new \"runaway\" stars in the Milky Way. These are stars that move extremely fast and in an unusual direction, usually as the result of a supernova event. Two of the star… [+3294 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Parker Solar Probe Sheds Light on Unusual, Violent Origin of Geminid Meteor Shower - SciTechDaily", "description": "Each winter, the Geminid meteors light up the sky as they race past Earth, producing one of the most intense meteor showers in the night sky. Now, NASA’s Parker Solar Probe mission is providing new evidence that a violent, catastrophic event created the Gemin…", "url": "https://scitechdaily.com/nasas-parker-solar-probe-sheds-light-on-unusual-violent-origin-of-geminid-meteor-shower/", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Orbits-Sun.gif", "publishedAt": "2023-06-15T10:01:25Z", "content": "ByDesiree Apodaca, NASA Goddard Space Flight CenterJune 15, 2023\r\nArtists concept of the Parker Solar Probe spacecraft approaching the sun. Data from the spacecraft suggests that a violent event, pos… [+2865 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Rocket Lab is set to launch a mystery mission from Virginia. What could it be? - Space.com", "description": "The company's new hypersonic-testing suborbital rocket, perhaps?", "url": "https://www.space.com/rocket-lab-mystery-mission-virginia-june-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7PdozZbETcGeGKmzfeGeJG-1200-80.jpeg", "publishedAt": "2023-06-15T10:00:51Z", "content": "Rocket Lab is gearing up to launch a mission from the U.S. East Coast in the next few days, but you won't be able to watch it live.\r\nNASA's Wallops Flight Facility in Virginia announced via Twitter o… [+2562 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Matthew Rozsa", "title": "\"Let there be light!\" James Webb discovers ancient galaxies that gave our universe its first glow - Salon", "description": "The James Webb Space Telescope made history when its initial images were unveiled last year", "url": "https://www.salon.com/2023/06/15/let-there-be-light-james-webb-discovers-ancient-galaxies-that-gave-our-universe-its-first-glow/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2023/06/james_webb_space_telescope_image_of_start_of_universe_01.jpg", "publishedAt": "2023-06-15T09:30:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Evolution Keeps Making Crabs, And Nobody Knows Why - ScienceAlert", "description": "Our planet's convoluted history of evolving life has spawned countless weird and wonderful creatures, but none excite evolutionary biologists – or divide taxonomists – quite like crabs.", "url": "https://www.sciencealert.com/evolution-keeps-making-crabs-and-nobody-knows-why", "urlToImage": "https://www.sciencealert.com/images/2021-12/processed/RedCrabs_1024.jpg", "publishedAt": "2023-06-15T07:32:02Z", "content": "Our planet's convoluted history of evolving life has spawned countless weird and wonderful creatures, but none excite evolutionary biologists or divide taxonomists quite like crabs.\r\nWhen researchers… [+5991 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Solve Colorful Kuiper Belt Mystery - SciTechDaily", "description": "The Kuiper Belt, a vast disk brimming with icy bodies including Pluto and located just beyond Neptune's orbit in our solar system, exhibits an intriguing color palette ranging from stark white to deep reddish hues on its objects. This distinctive color range,…", "url": "https://scitechdaily.com/scientists-solve-colorful-kuiper-belt-mystery/", "urlToImage": "https://scitechdaily.com/images/Kuiper-Belt-Aromatic-Structures.jpg", "publishedAt": "2023-06-15T06:33:06Z", "content": "ByUniversity of Hawaii at ManoaJune 14, 2023\r\nAromatic structures linked through unsaturated hydrocarbon chains drive the color variety of hydrocarbon rich surfaces of Kuiper Belt objects. Credit: Un… [+4421 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "A Day on Earth Used to Last Only 19 Hours. Now We Know Why. - ScienceAlert", "description": "There was a time in Earth's turbulent history when everything almost slowed to a standstill.", "url": "https://www.sciencealert.com/a-day-on-earth-used-to-last-only-19-hours-now-we-know-why", "urlToImage": "https://www.sciencealert.com/images/2023/06/ViewOfEarthFromMoonInForeground.jpg", "publishedAt": "2023-06-15T05:24:40Z", "content": "There was a time in Earth's turbulent history when everything almost slowed to a standstill. Tectonic activity eased, geochemical processes oozed, and the evolution of life in its simplest forms didn… [+5045 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Scientists Reveal What Would Happen if The Ozone Layer Vanished - ScienceAlert", "description": "The evolution of Earth's climate contains many components.", "url": "https://www.sciencealert.com/scientists-reveal-what-would-happen-if-the-ozone-layer-vanished", "urlToImage": "https://www.sciencealert.com/images/2020-05/processed/earth-atmosphere_1024.jpg", "publishedAt": "2023-06-15T03:08:18Z", "content": "The evolution of Earth's climate contains many components. And new research has shown just how critical the ozone layer is to the surface temperature of the Earth. Without an ozone layer, our planet … [+3360 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Parker Solar Probe's Confirmation Of Interchange Reconnection Being The Source Of Fast Solar Wind - Hackaday", "description": "Although experimental verification is at the heart of the scientific method, there is quite a difficulty range when it comes to setting up such an experiment. Testing what underlies the formation o…", "url": "https://hackaday.com/2023/06/14/parker-solar-probes-confirmation-of-interchange-reconnection-being-the-source-of-fast-solar-wind/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/06/Sun_poster.svg_.png", "publishedAt": "2023-06-15T02:00:00Z", "content": "Artist rendition of the Parker Solar Probe. (Credit: NASA)\r\nAlthough experimental verification is at the heart of the scientific method, there is quite a difficulty range when it comes to setting up … [+2224 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X", "title": "Scientists create long-lasting, cobalt-free, lithium-ion batteries - Tech Xplore", "description": "In a discovery that could reduce or even eliminate the use of cobalt—which is often mined using child labor—in the batteries that power electric cars and other products, scientists at the University of California, Irvine have developed a long-lasting alternat…", "url": "https://techxplore.com/news/2023-06-scientists-long-lasting-cobalt-free-lithium-ion-batteries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/scientists-create-long.jpg", "publishedAt": "2023-06-14T20:58:46Z", "content": "In a discovery that could reduce or even eliminate the use of cobaltwhich is often mined using child laborin the batteries that power electric cars and other products, scientists at the University of… [+2518 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Lab mice go wild: making experiments more natural in order to decode the brain - Nature.com", "description": "Armed with technologies to track a creature’s every move, neuroscientists are gaining insights into animal — and human — behaviour.", "url": "https://www.nature.com/articles/d41586-023-01926-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01926-w/d41586-023-01926-w_25476292.jpg", "publishedAt": "2023-06-14T20:32:19Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Chris Panella, Jessica Orwig", "title": "How, when, where to see 5 planets align in space this week - Business Insider", "description": "Here's how to see five planets align. The rare planetary parade of Saturn, Neptune, Jupiter, Uranus, and Mercury will appear in a line beside the sun.", "url": "https://www.businessinsider.com/planets-align-how-to-watch-where-when-023-6", "urlToImage": "https://i.insider.com/648a03a71cc64b001ae134ea?width=1200&format=jpeg", "publishedAt": "2023-06-14T20:30:00Z", "content": "This week, a rare five-planet alignment will occur in our night sky, according to StarWalk.\r\nBut you'll need very clear skies, impeccable timing, an obstructed view of the eastern horizon, and probab… [+2460 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Keith Cooper", "title": "Rare 'warped' supernova revealed through space-time phenomenon predicted by Einstein - Yahoo Life", "description": "The gravity of a galaxy two-and-a-half billion light-years away has acted like a cosmic magnifying glass to amplify the light of a distant exploding white...", "url": "https://www.livescience.com/space/rare-warped-supernova-revealed-through-space-time-phenomenon-predicted-by-einstein", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/_Px8Bwu2rN116NpHbjhAFQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/7c5bcb5cb3800ccf2f999839a3e21233", "publishedAt": "2023-06-14T20:01:47Z", "content": "The gravity of a distant galaxy warped space and magnified the light of a faraway supernova, potentially revealing tantalizing details about stellar explosions, as well as an unseen population of gal… [+6319 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Ultra-hot exoplanet has an atmosphere of vaporized rock - Space.com", "description": "If you are looking to escape the summer heatwave, WASP-76b would be a poor choice of destination.", "url": "https://www.space.com/exoplanet-hot-atmosphere-vaporized-rock", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JsSKFvLxkpiYqaf56L3iSY-1200-80.jpg", "publishedAt": "2023-06-14T20:00:11Z", "content": "Heatwaves on Earth may be uncomfortable and even dangerous for some, but our planet has nothing on the blisteringly hot world of WASP-76 b. \r\nAstronomers have taken a deeper look at the exoplanet on … [+7644 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jennifer Nalewicki", "title": "Mysterious rock art painted by Aboriginal people depicts Indonesian warships, study suggests - Yahoo Life", "description": "Archaeologists may have solved the mystery of the origins of two boat paintings detailed inside a cave in Australia.", "url": "https://www.livescience.com/archaeology/mysterious-rock-art-painted-by-aboriginal-people-depicts-indonesian-warships-study-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ckh3TQw9ftQowt7Wcx9N8J-1200-80.jpg", "publishedAt": "2023-06-14T19:55:27Z", "content": "Hundreds of years ago, in a cramped cave, Indigenous people in Australia painted a pair of watercraft whose origins have puzzled archaeologists since the artworks' discovery about 50 years ago. Now, … [+4156 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jesse Jenkins", "title": "Sun's coldest region stores secret to heating million-degree corona, study finds - Phys.org", "description": "Nearly 5,000 kilometers above the sun's surface lies a century-old question for solar physicists—how are temperatures in the star's upper atmosphere (corona) hundreds of times hotter than temperatures at the sun's visible surface?", "url": "https://phys.org/news/2023-06-sun-coldest-region-secret-million-degree.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/suns-coldest-region-st.jpg", "publishedAt": "2023-06-14T19:43:41Z", "content": "Nearly 5,000 kilometers above the sun's surface lies a century-old question for solar physicistshow are temperatures in the star's upper atmosphere (corona) hundreds of times hotter than temperatures… [+5009 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Why is Venus So Hot? – We Asked a NASA Scientist - NASA", "description": "Why is Venus so hot? The planet’s thick CO2-filled atmosphere is great at trapping heat. This creates a runaway greenhouse effect that makes Venus roughly 70...", "url": "https://www.youtube.com/watch?v=ZHrTBCsAsTI", "urlToImage": "https://i.ytimg.com/vi/ZHrTBCsAsTI/maxresdefault.jpg", "publishedAt": "2023-06-14T19:31:40Z", "content": null}, {"source": {"id": null, "name": "kottke.org"}, "author": null, "title": "Apollo Remastered - kottke.org", "description": "NASA keeps the original film negatives from the Apollo program sealed in a frozen vault in Houston, TX and rarely grants acc", "url": "https://kottke.org/23/06/apollo-remastered", "urlToImage": "https://kottke.org/plus/misc/images/apollo-remastered-01.jpg", "publishedAt": "2023-06-14T18:58:09Z", "content": "NASA keeps the original film negatives from the Apollo program sealed in a frozen vault in Houston, TX and rarely grants access to them. As a result, nearly all of the photos we see of those historic… [+1110 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Ocean current comes to the rescue for Pacific island reefs - Phys.org", "description": "Marine heatwaves are emerging as a key impact of climate change and pose a particularly significant threat to corals that form the backbone of coral reefs. Researchers have now identified a phenomenon that could help coral reef managers better plan and act fo…", "url": "https://phys.org/news/2023-06-ocean-current-pacific-island-reefs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ocean-current-comes-to-1.jpg", "publishedAt": "2023-06-14T18:17:48Z", "content": "Marine heatwaves are emerging as a key impact of climate change and pose a particularly significant threat to corals that form the backbone of coral reefs. Researchers have now identified a phenomeno… [+6266 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Pentagon gearing up to launch 1st experimental navigation satellite in 50 years (video) - Space.com", "description": "'It's probably going to affect so many lives.'", "url": "https://www.space.com/pentagon-experimental-navigation-satellite-nts-3-launch-preparations", "urlToImage": "https://cdn.mos.cms.futurecdn.net/f5T8WYBKQaRsp96mCpxYAb-1200-80.jpeg", "publishedAt": "2023-06-14T18:00:40Z", "content": "The Pentagon is preparing to launch a test craft that could improve the nation's satellite-navigation capabilities.  \r\nThe spacecraft, called Navigation Technology Satellite-3 (NTS-3), will be the fi… [+3291 chars]"}, {"source": {"id": null, "name": "Colossal"}, "author": "Grace Ebert", "title": "Explore Mars' Craggy Topography in an Enormous 5.7 Terapixel Mosaic of the Red Planet's Surface — Colossal - Colossal", "description": "A new composite from the Bruce Murray Laboratory for Planetary Visualization details 99.5 percent of Mars' surface in unprecedented detail.", "url": "https://www.thisiscolossal.com/2023/06/zoomable-mars-surface-image/", "urlToImage": "https://www.thisiscolossal.com/wp-content/uploads/2023/06/mars-1.jpg", "publishedAt": "2023-06-14T17:55:50Z", "content": "All images via Bruce Murray Laboratory for Planetary Visualization\r\nA new composite released by the Bruce Murray Laboratory for Planetary Visualization details 99.5 percent of Mars’ surface in unprec… [+836 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "JPL Creates World's Largest PDF Archive to Aid Malware Research - NASA Jet Propulsion Laboratory", "description": "As part of DARPA’s SafeDocs program, JPL data scientists have amassed 8 million PDFs that can now be used for further study in order to make the internet more secure.", "url": "https://www.jpl.nasa.gov/news/jpl-creates-worlds-largest-pdf-archive-to-aid-malware-research", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1_pdf-corpus-world-data-visualization.jpeg", "publishedAt": "2023-06-14T17:37:35Z", "content": "When building the corpus, the team didnt evaluate the actual subject matter of the PDFs. Their goal was to gather a large representative sample of PDFs that exist on the internet so experts can searc… [+3195 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Friendless 'hot Jupiter' exoplanets may not be so lonely after all - Space.com", "description": "How hot Jupiters form and evolve is one of the oldest questions in exoplanet research.", "url": "https://www.space.com/hot-jupiters-may-have-planetary-companions", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mkBqiXvLAWNxxxfWH3GLH8-1200-80.jpg", "publishedAt": "2023-06-14T17:00:54Z", "content": "Jupiter-like exoplanets that are blisteringly close to their parent stars were long thought to be friendless in their cosmic neighborhood. A new study has now revealed that many of them might, in fac… [+5356 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Vulcan aces engine test, but upper stage anomaly will delay launch for a while - Ars Technica", "description": "\"Working corrective action and retest.\"", "url": "https://arstechnica.com/space/2023/06/vulcan-rocket-completes-critical-test-but-launch-slipping-toward-end-of-2023/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/vulcan-1-760x380.jpg", "publishedAt": "2023-06-14T16:48:10Z", "content": "Enlarge/ United Launch Alliance's Vulcan rocket completes a \"flight readiness firing\" last week. \r\n34 with \r\nThe Vulcan rocket took a critical step toward its much-anticipated debut launch last week … [+4430 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lindsey Valich", "title": "Plate tectonics not required for the emergence of life, argues study - Phys.org", "description": "Scientists have taken a journey back in time to unlock the mysteries of Earth's early history, using tiny mineral crystals called zircons to study plate tectonics billions of years ago. The research sheds light on the conditions that existed in early Earth, r…", "url": "https://phys.org/news/2023-06-plate-tectonics-required-emergence-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/plate-tectonics-not-re.jpg", "publishedAt": "2023-06-14T16:40:54Z", "content": "Scientists have taken a journey back in time to unlock the mysteries of Earth's early history, using tiny mineral crystals called zircons to study plate tectonics billions of years ago. The research … [+6430 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "KISS: A New Way To Easily Produce Large, Clean 2D Materials - SciTechDaily", "description": "Nearly two decades have passed since the advent of graphene, the two-dimensional variant of graphite, which has significantly amplified interest in 2D materials due to their unique physical attributes. The initial production of graphene famously involved usin…", "url": "https://scitechdaily.com/kiss-a-new-way-to-easily-produce-large-clean-2d-materials/", "urlToImage": "https://scitechdaily.com/images/KISS-Exfoliation-and-Photoemission-Experiment.png", "publishedAt": "2023-06-14T16:35:07Z", "content": "ByUniversity of GroningenJune 14, 2023\r\nArtistic depiction of KISS exfoliation and photoemission experiment. 2D material is separated from the parent crystal due to stronger interaction with the subs… [+5849 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "For experimental physicists, quantum frustration leads to fundamental discovery - Phys.org", "description": "A team of physicists, including University of Massachusetts assistant professor Tigran Sedrakyan, recently announced in the journal Nature that they have discovered a new phase of matter. Called the \"chiral Bose-liquid state,\" the discovery opens a new path i…", "url": "https://phys.org/news/2023-06-experimental-physicists-quantum-frustration-fundamental.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/for-experimental-physi.jpg", "publishedAt": "2023-06-14T15:55:40Z", "content": "A team of physicists, including University of Massachusetts assistant professor Tigran Sedrakyan, recently announced in the journal Nature that they have discovered a new phase of matter. Called the … [+4957 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Study claims Earth was created much faster than we thought - Phys.org", "description": "When we walk around in our everyday life, we might not think of the Earth itself very often. But this planet is the foundation of our life. The air we breathe, the water we drink and the gravity that pins us to the ground.", "url": "https://phys.org/news/2023-06-earth-faster-thought.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/how-the-earth-was-crea.jpg", "publishedAt": "2023-06-14T15:55:25Z", "content": "When we walk around in our everyday life, we might not think of the Earth itself very often. But this planet is the foundation of our life. The air we breathe, the water we drink and the gravity that… [+4570 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Mitotic tethering enables inheritance of shattered micronuclear chromosomes - Nature.com", "description": "Chromothriptically produced&nbsp;pieces of a micronucleated chromosome are&nbsp;shown to be tethered together in mitosis by a protein complex consisting of MDC1, TOPBP1 and CIP2A, thus enabling their inheritance by a single daughter cell.", "url": "https://www.nature.com/articles/s41586-023-06216-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-06216-z/MediaObjects/41586_2023_6216_Fig1_HTML.png", "publishedAt": "2023-06-14T15:11:28Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Inference and reconstruction of the heimdallarchaeial ancestry of eukaryotes - Nature.com", "description": "Analyses of multiple phylogenetic marker datasets of Asgard archaea provide insight into the transition from prokaryotes to eukaryotes, specifically placing eukaryotes within Asgard archaea and as a sister lineage to Hodarchaeales.", "url": "https://www.nature.com/articles/s41586-023-06186-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-06186-2/MediaObjects/41586_2023_6186_Fig1_HTML.png", "publishedAt": "2023-06-14T15:11:28Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "General cross-coupling reactions with adaptive dynamic homogeneous catalysis - Nature.com", "description": "A self-adjustive catalytic system with nickel under visible-light-driven redox reaction conditions provides a general method for carbon–(hetero)atom cross-coupling reactions and is demonstrated for nine different bond-forming reactions.", "url": "https://www.nature.com/articles/s41586-023-06087-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-06087-4/MediaObjects/41586_2023_6087_Fig1_HTML.png", "publishedAt": "2023-06-14T15:04:46Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Ants have a specialized communication processing center that has not been found in other social insects - Phys.org", "description": "Have you ever noticed an ant in your home, only to find that a week later the whole colony has moved in? The traps you set up catch only a few of these ants, but soon, the rest of the colony has mysteriously disappeared. Now, a study published in the journal …", "url": "https://phys.org/news/2023-06-ants-specialized-communication-center-social.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ants-have-a-specialize.jpg", "publishedAt": "2023-06-14T15:01:10Z", "content": "Have you ever noticed an ant in your home, only to find that a week later the whole colony has moved in? The traps you set up catch only a few of these ants, but soon, the rest of the colony has myst… [+4320 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Photosynthesis starts with a single photon, study shows - Phys.org", "description": "Using a complex cast of metal-studded pigments, proteins, enzymes, and co-enzymes, photosynthetic organisms can convert the energy in light into the chemical energy for life. And now, thanks to a study published June 14 in Nature, we know that this organic ch…", "url": "https://phys.org/news/2023-06-photosynthesis-photon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/photosynthesis-key-to.jpg", "publishedAt": "2023-06-14T15:00:03Z", "content": "Using a complex cast of metal-studded pigments, proteins, enzymes, and co-enzymes, photosynthetic organisms can convert the energy in light into the chemical energy for life. And now, thanks to a stu… [+6908 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Scientists discover an exoplanet like a Star Wars world - Mashable", "description": "And it's not in a galaxy far, far away — it's right here.", "url": "https://mashable.com/article/star-wars-exoplanet-with-two-stars", "urlToImage": "https://helios-i.mashable.com/imagery/articles/02pGd66O4bwnuNkMD8mQFmF/hero-image.fill.size_1200x675.v1686694155.jpg", "publishedAt": "2023-06-14T14:19:45Z", "content": null}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "$1.2 billion spacecraft sets off to probe dark energy and dark matter next month - Interesting Engineering", "description": "Dark energy and dark matter make up 95% of the universe, and Euclid could finally uncover their mystery.", "url": "https://interestingengineering.com/innovation/12-billion-spacecraft-probe-dark-energy-and-dark-matter", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/14/image/jpeg/siuRK83bJats69Ibv8dSuh52n8EIAVXWrttMFaZ3.jpg", "publishedAt": "2023-06-14T14:02:00Z", "content": "The \"dark universe\" makes up the vast majority of the cosmos: it is composed of roughly 27 percent dark matter and about 68 percent dark energy. And yet, we don't fully understand what these forces a… [+780 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Avi Loeb, Avi Loeb", "title": "Diary of an Interstellar Voyage: Part 3 - The Debrief", "description": "Efforts to retrieve an interstellar object at the bottom of the Pacific begin in the third installment of \"Diary of an Interstellar Journey.\"", "url": "https://thedebrief.org/diary-of-an-interstellar-voyage-part-3/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2023/06/Silver-Star.jpg", "publishedAt": "2023-06-14T13:57:47Z", "content": "This is the third in an ongoing series of updates from Harvard Astronomer Avi Loeb, who heads The Galileo Project, documenting his team’s expedition to attempt the recovery of an interstellar object … [+4631 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Sharon Adarlo", "title": "Scientists Spot Star Transforming Into Colossal Cosmic Diamond - Futurism", "description": "A white dwarf that's about 104 light years away is slowly crystallizing, a process that could take a quadrillion years.", "url": "https://futurism.com/the-byte/scientists-spot-white-dwarf-star-crystallization", "urlToImage": "https://wp-assets.futurism.com/2023/06/scientists-spot-white-dwarf-star-crystallization.jpg", "publishedAt": "2023-06-14T13:54:06Z", "content": "Talk about bling!\r\nBright Like a Diamond\r\nResearchers are studying a white dwarf star about 104 light years away practically in our cosmic backyard that's slowly crystallizing.\r\nThe star, with the un… [+2045 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "Jamie Durrani", "title": "High-entropy alloy nanoparticles made with 17 different metals - Chemistry World", "description": "Liquid gallium matrix enables mixing of elements that were otherwise immiscible", "url": "https://www.chemistryworld.com/news/high-entropy-alloy-nanoparticles-made-with-17-different-metals/4017570.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/0/7/9/527079_full_text__fu_41586_2023_6082_onlinepdf_3002f_263918.jpg", "publishedAt": "2023-06-14T13:30:25Z", "content": "Multi-element nanoparticles can now be made with a more diverse array of metals, thanks to a new technique developed by researchers in China. These materials could find use in a wide range of applica… [+1261 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Ashworth", "title": "Fossil reveals smallest sauropodomorph dinosaur from the Jurassic - Phys.org", "description": "A tiny relative of titanosaurs has been uncovered in South Africa.", "url": "https://phys.org/news/2023-06-fossil-reveals-smallest-sauropodomorph-dinosaur.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/fossil-reveals-smalles.jpg", "publishedAt": "2023-06-14T13:16:31Z", "content": "A tiny relative of titanosaurs has been uncovered in South Africa.\r\nWeighing in at around 75 kilograms, the dinosaur would have barely been heavier than the average person. Its small size meant that … [+5822 chars]"}, {"source": {"id": null, "name": "Search Engine Land"}, "author": "Sam Hollingsworth", "title": "How to write a meta description that gets clicks - Search Engine Land", "description": "Here are nine tips to ensure you’re giving each webpage the best possible meta description while satisfying the pixel limit.", "url": "https://searchengineland.com/write-meta-description-clicks-428217", "urlToImage": "https://searchengineland.com/wp-content/seloads/2023/06/How-to-write-a-meta-description-that-gets-clicks.png", "publishedAt": "2023-06-14T13:00:00Z", "content": "Like all beautiful yet hard-to-perfect things in life, writing effective meta descriptions is hard work.\r\nA critical HTML element of every webpage, a meta description is a summary of a page’s content… [+5850 chars]"}, {"source": {"id": null, "name": "Nytlicensing.com"}, "author": "Darren Incorvaia", "title": "These Flies Age Faster After Witnessing Death - Yahoo News", "description": "“There’s a very special place in fly hell for me,” said Christi Gendron, a neurobiologist at the University of Michigan in Ann Arbor. Gendron earned that...", "url": "https://nytlicensing.com/stories/6mT6gjV7", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GK91lR3DzWc7saaGLHR4Dw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2023-06/5dc4a620-0aae-11ee-8f7f-9e2078e978d2", "publishedAt": "2023-06-14T12:17:01Z", "content": "Theres a very special place in fly hell for me, said Christi Gendron, a neurobiologist at the University of Michigan in Ann Arbor.\r\nGendron earned that spot by researching how living fruit flies resp… [+3901 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Tom Hale", "title": "“Lucy” Walked Upright 3.2 Million Years Ago, New 3D Model Shows - IFLScience", "description": "These bones were made for walkin'.", "url": "https://www.iflscience.com/lucy-walked-upright-32-million-years-ago-new-3d-model-shows-69380", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69380/aImg/68593/lucy-meta.jpg", "publishedAt": "2023-06-14T12:10:08Z", "content": "Scientists have recently looked at the bones of Lucy, a world-famous set of early human ancestor remains, and found further evidence that she could walk upright just as effectively as modern-day Homo… [+2872 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Craton Deception: Geologists Challenge Conventional View of Earth's Continental History and Stability - SciTechDaily", "description": "A new study challenges longstanding beliefs about Earth's stable cratons, revealing that they have undergone repetitive deformation beneath their crust since formation. Contrary to previous theories, the study found that the mantle keels, once thought to be b…", "url": "https://scitechdaily.com/craton-deception-geologists-challenge-conventional-view-of-earths-continental-history-and-stability/", "urlToImage": "https://scitechdaily.com/images/Cross-Secitonal-View-of-New-Hypothesis.jpg", "publishedAt": "2023-06-14T10:18:28Z", "content": "In this hypothetical cross-sectional view of the Earths crust and mantle during the breakup of the supercontinent Rodinia, a mantle plume initiates the peeling away process of the lower mantle. Credi… [+5218 chars]"}, {"source": {"id": null, "name": "EL PAÍS"}, "author": "Manuel Ansede", "title": "Nobel winner Anton Zeilinger: 'Physicists can make measurements, but cannot say anything about the essence of reality' - EL PAÍS USA", "description": "The Austrian scientist, a pioneer of quantum teleportation, reflects on God, the nature of things and the future of computing", "url": "https://english.elpais.com/science-tech/2023-06-14/nobel-winner-anton-zeilinger-physicists-can-make-measurements-but-cannot-say-anything-about-the-essence-of-reality.html", "urlToImage": "https://images.english.elpais.com/resizer/FFhKSpgJCkjoj95NyfW2VbxON0c=/1200x0/filters:focal(2941x838:2951x848)/cloudfront-eu-central-1.images.arcpublishing.com/prisa/27HUWDN6BVHG3ISHOE6M5FXSXQ.JPG", "publishedAt": "2023-06-14T10:07:32Z", "content": null}, {"source": {"id": null, "name": "Audacy.com"}, "author": "Rex Ravita II", "title": "Hubble spots stunning jellyfish galaxy 'swimming' through a sea of stars - KRLD", "description": "The James Webb Space telescope has made multiple groundbreaking discoveries since its launch last December. However, Hubble, Webb’s predecessor, continues to prove it still has plenty to offer with its latest image.", "url": "https://www.audacy.com/krld/news/national/hubble-discovers-stunning-jellyfish-galaxy", "urlToImage": "https://images.radio.com/aiu-media/hubblej0206potw2323a-468a3430-5256-4df4-ac18-c45d504c3409.jpg", "publishedAt": "2023-06-14T10:00:02Z", "content": "Though we all have differences, there’s one commonality that has prevailed for all of humanity: we are all floating on a rock, flying through outer space at over a million miles an hour.﻿\r\nThanks to … [+2272 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Pierre Celerier", "title": "Scientists explain why peanuts 'dance' when dropped in beer - Phys.org", "description": "When peanuts are dropped into a pint of beer, they initially sink to the bottom before floating up and \"dancing\" in the glass.", "url": "https://phys.org/news/2023-06-scientists-peanuts-beer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/scientists-explain-why-1.jpg", "publishedAt": "2023-06-14T08:43:36Z", "content": "When peanuts are dropped into a pint of beer, they initially sink to the bottom before floating up and \"dancing\" in the glass.\r\nScientists have dug deep seeking to investigate this phenomenon in a ne… [+3417 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "Tim Wogan", "title": "Hand-built caesium-based 'artificial atoms' used to create 'synthetic' benzene - Chemistry World", "description": "Manufactured atoms offer chemists chance to play ‘mind games’ with matter and change bond order of molecules", "url": "https://www.chemistryworld.com/news/hand-built-caesium-based-artificial-atoms-used-to-create-synthetic-benzene/4017567.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/0/6/1/527061_adf26852_647349.jpg", "publishedAt": "2023-06-14T08:31:01Z", "content": "Artificial atoms that form molecular orbitals reminiscent of those in well-known organic molecules have been produced by researchers in the Netherlands using strategically positioned caesium atoms on… [+3778 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - BepiColombo braces for third Mercury flyby - European Space Agency", "description": "The ESA/JAXA BepiColombo mission is gearing up for its next close flyby of Mercury on 19 June, when it will pass the planet’s surface at an altitude of about 236 km.", "url": "https://www.esa.int/Science_Exploration/Space_Science/BepiColombo/BepiColombo_braces_for_third_Mercury_flyby", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2021/09/bepicolombo_mercury_flyby4/23479079-1-eng-GB/BepiColombo_Mercury_flyby_pillars.jpg", "publishedAt": "2023-06-14T08:01:02Z", "content": "Science &amp; Exploration14/06/20231792 views38 likes\r\nThe ESA/JAXA BepiColombo mission is gearing up for its next close flyby of Mercury on 19 June, when it will pass the planets surface at an altit… [+8516 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Scientists Find 'Underground Mountains' Four Times the Height of Mt Everest! - The Weather Channel", "description": "These massive mountain-like structures are sandwiched between the planet's core and mantle, approximately 2,900 kilometres within the Earth.", "url": "https://weather.com/en-IN/india/news/news/2023-06-14-underground-mountains-higher-than-mt-everest-found", "urlToImage": "https://s.w-x.co/in-underground_mountains.jpg", "publishedAt": "2023-06-14T06:12:44Z", "content": "Our understanding of what lies beneath the Earth's surface is mostly restricted to the stuff printed in our school textbooks: a solid inner core, a mantle, and the crust. But a recent study has the s… [+2493 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers succeed in arranging nanoscale quantum sensors on desired targets - Phys.org", "description": "University of Tokyo scientists have achieved the delicate task of arranging quantum sensors at a nanoscale, allowing them to detect extremely small variations in magnetic fields. The high-resolution quantum sensors will have potential uses in quantum material…", "url": "https://phys.org/news/2023-06-succeed-nanoscale-quantum-sensors-desired.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-succeed-in.jpg", "publishedAt": "2023-06-14T04:00:02Z", "content": "University of Tokyo scientists have achieved the delicate task of arranging quantum sensors at a nanoscale, allowing them to detect extremely small variations in magnetic fields. The high-resolution … [+4428 chars]"}, {"source": {"id": null, "name": "Softonic"}, "author": "Chema Carvajal Sarabia", "title": "Stellar Alert: Betelgeuse, the Impending Supernova Set to Illuminate the Skies - Softonic EN", "description": "The universe is full of stars, asteroids, and comets. Some are dangerous and some are not. Today we are talking about a star that is very close to exploding...", "url": "https://en.softonic.com/articles/its-called-betelgeuse-its-a-star-and-its-about-to-explode", "urlToImage": "https://articles-img.sftcdn.net/f_auto,t_article_cover_xl/auto-mapping-folder/sites/3/2023/06/Betelgeuse-1.jpg", "publishedAt": "2023-06-13T13:29:18Z", "content": "The universe is filled with celestial bodies suspended in the vast emptiness that surrounds us. These bodies can be of all kinds, from harmless moons to enormous planets. However, they can also be st… [+3236 chars]"}]}