{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "\"Negative time\" observed in new quantum experiments, surprising scientists - Earth.com", "description": "Scientists demonstrated in quantum experiments that \"negative time\" actually exists in a tangible, physical sense that can be measured.", "url": "https://www.earth.com/news/negative-time-observed-measured-tangible-in-new-quantum-experiments/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/23161623/negative-time_photons_quantum-mechanics_1m.jpg", "publishedAt": "2024-12-28T06:39:29Z", "content": "It is widely known among scientists that light sometimes appears to exit a material before it has even entered. This odd “negative time” phenomenon was long seen as an illusion caused by the way wave… [+5753 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Webb Discovery Forces Rethink of Planet Formation in the Early Universe - SciTechDaily", "description": "New data confirms Hubble's finding and refutes current theories of planet formation in the universe’s early days. Thanks to its incredible sensitivity and sharp resolution, NASA’s Webb Space Telescope just cracked a cosmic mystery that has puzzled astronomers…", "url": "https://scitechdaily.com/stunning-webb-discovery-forces-rethink-of-planet-formation-in-the-early-universe/", "urlToImage": "https://scitechdaily.com/images/Protoplanetary-Disks-in-NGC-346-Webb-NIRCam-Image.jpg", "publishedAt": "2024-12-28T03:20:14Z", "content": "The Webb Space Telescope has provided evidence that contradicts existing theories by confirming long-lived planet-forming disks in environments with minimal heavy elements, suggesting a need to revis… [+11734 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover 555-Million-Year Fossil That Could Rewrite the History of Life on Earth - The Daily Galaxy --Great Discoveries Channel", "description": "Deep within South Australia’s ancient sandstone lies a discovery that could change everything we know about the origins of life on Earth. Scientists have unearthed an extraordinary fossil, dating back 555 million years, in what may be the most detailed glimps…", "url": "https://dailygalaxy.com/2024/12/scientists-uncover-555-million-year-fossil/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Scientists-Uncover-555-Million-Year-Fossil-That-Could-Rewrite-the-History-of-Life-on-Earth-1.jpg", "publishedAt": "2024-12-27T23:37:41Z", "content": "A stunning fossil discovery in South Australia has provided a groundbreaking glimpse into one of evolutions greatest mysteries. A 555-million-year-old worm-like organism, Uncus dzaugisi, has been ide… [+5722 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Warn of an Undersea Volcano Eruption Near Oregon Coast in 2025 - The Daily Galaxy --Great Discoveries Channel", "description": "Beneath the Pacific, just off Oregon's coast, an undersea volcano known as Axial Seamount is stirring once again. Scientists monitoring its every move believe it could erupt as soon as 2025, marking a rare opportunity to predict volcanic activity years in adv…", "url": "https://dailygalaxy.com/2024/12/scientists-warn-of-an-undersea-volcano-eruption-near-oregon-coast-in-2025/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/undersea-volcano-eruption.jpg", "publishedAt": "2024-12-27T22:55:22Z", "content": "Beneath the waves of the Pacific Ocean, about 470 kilometers off the coast of Oregon, lies Axial Seamount, an undersea volcano at the cutting edge of scientific exploration. Decades of monitoring hav… [+3973 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Great White Sharks Scared From Their Habitat by Just 2 Predators - ScienceAlert", "description": "There is no sea creature whose name inspires terror – rightly or wrongly – as much as the great white shark.", "url": "https://www.sciencealert.com/great-white-sharks-scared-from-their-habitat-by-just-2-predators", "urlToImage": "https://www.sciencealert.com/images/2023/01/GoredSharkOnTheBeach.jpg", "publishedAt": "2024-12-27T22:31:40Z", "content": "There is no sea creature whose name inspires terror rightly or wrongly as much as the great white shark.\r\nWith its sleek body optimized for hunting, its sharp teeth, and its (somewhat undeserved) rep… [+6337 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "'Alien-like' marine life found on underwater mountains includes 100 new species - Earth.com", "description": "Explore vibrant seamount ecosystems, home to over 100 newly discovered marine species and vital to ocean health.", "url": "https://www.earth.com/news/alien-like-marine-life-found-on-underwater-mountains-includes-100-new-species/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/27142301/Underwater-mountains.jpg", "publishedAt": "2024-12-27T21:43:58Z", "content": "When you digest the fact that humans know less about the seamounts dotting our planet’s oceans than about the vast expanse of outer space, it might take a moment to sink in. Only a fraction of these … [+4229 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Unusual 1-Million-Year-Old Glacial Landforms Under the North Sea - SciTechDaily", "description": "Researchers used advanced seismic technology to uncover 1-million-year-old glacial and ocean current landforms beneath the North Sea, providing new insights into past climate and ice sheet behavior. A team of international researchers, including a glaciologis…", "url": "https://scitechdaily.com/scientists-discover-unusual-1-million-year-old-glacial-landforms-under-the-north-sea/", "urlToImage": "https://scitechdaily.com/images/North-Sea.jpg", "publishedAt": "2024-12-27T21:38:38Z", "content": "Scientists have discovered 1-million-year-old glacial landforms beneath the North Sea, revealing how ice sheets and ocean currents shaped the region’s history. Using advanced seismic technology, the … [+4518 chars]"}, {"source": {"id": null, "name": "KSBY San Luis Obispo News"}, "author": "Kathrene Herndon", "title": "SpaceX targeting Saturday for 46th launch from Vandenberg Space Force Base - KSBY News", "description": "Following stage separation, the first stage is expected to land on the Of Course I Still Love You droneship in the Pacific Ocean.", "url": "https://www.ksby.com/news/local-news/spacex-targeting-saturday-for-next-launch-from-vandenberg-space-force-base", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/7596d0b/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F42%2F7d%2Fecddec4c4898b4cb2c803632b0ab%2Fspacex-logo.jpeg", "publishedAt": "2024-12-27T20:22:09Z", "content": "SpaceX is gearing up for what could be its final launch this year from Vandenberg Space Force Base.\r\nThe company is targeting Saturday at 5:48 p.m. for the Falcon 9 launch carrying 22 Starlink satell… [+691 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Researchers solve the mystery of 50,000 DNA \"knots\" in the human genome - The Brighter Side of News", "description": "New research maps 50,000 i-motifs in human DNA, revealing their potential roles in gene regulation and disease-linked genomic functions.", "url": "https://www.thebrighterside.news/post/researchers-solve-the-mystery-of-50000-dna-knots-in-the-human-genome/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/12/genome-1-scaled.jpg?auto=webp&width=2000&height=1500", "publishedAt": "2024-12-27T19:07:00Z", "content": "DNAs iconic double helix has long been the symbol of lifes blueprint. However, the human genome conceals far more complexity. Among these mysteries are i-motifs, unusual knot-like DNA structures form… [+4480 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Oxytocin Influences Social Behavior and Emotional Response - Neuroscience News", "description": "New research reveals how oxytocin profoundly influences social behavior and emotional responses in the brain.", "url": "https://neurosciencenews.com/oxytocin-emotion-social-behavior-28287/", "urlToImage": "https://neurosciencenews.com/files/2024/12/oxytocin-social-behavior-emotion-neuroscience.jpg", "publishedAt": "2024-12-27T19:05:59Z", "content": "Summary: New research reveals how oxytocin profoundly influences social behavior and emotional responses in the brain. Animal models have shown how this hormone impacts social fear and how chronic st… [+6083 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Cotton-and-Squid-Bone Sponge Can Soak Up 99.9% of Microplastics, Scientists Say - Good News Network", "description": "With proper testing at a commercial or industrial scale, they estimate the sponges could become products within a couple of years.", "url": "https://www.goodnewsnetwork.org/cotton-and-squid-bone-sponge-can-soak-up-99-9-of-microplastics-scientists-say/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2024/12/Photo-by-Anastasiia-Nelen-on-Unsplash.jpg", "publishedAt": "2024-12-27T19:00:49Z", "content": "Photo by Anastasiia Nelen on Unsplash\r\nA matrix of squid bone and cotton cellulose offers a low-cost, scalable solution to global microplastic poisoning according to a new study from China.\r\nAttempti… [+2859 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA’s Parker Solar Probe Makes History With Closest Pass to Sun - Science@NASA", "description": "Operations teams have confirmed NASA’s mission to “touch” the Sun survived its record-breaking closest approach to the solar surface on Dec. 24, 2024.", "url": "https://science.nasa.gov/science-research/heliophysics/nasas-parker-solar-probe-makes-history-with-closest-pass-to-sun/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/missions/psp/Parker%20Into%20the%20Sun.png?w=1280&h=720&fit=clip&crop=faces%2Cfocalpoint", "publishedAt": "2024-12-27T18:17:09Z", "content": "NASAs Armstrong Flight Research Center in Edwards, California, is preparing today for tomorrows mission. Supersonic flight, next generation aircraft, advanced air mobility, climate changes, human exp… [+181 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Ryan Erik King", "title": "Blood Could Be Key Ingredient For Concrete On Mars - Jalopnik", "description": "It would take 72 weeks for one astronaut to produce enough bodily fluid to build a small habitat", "url": "https://jalopnik.com/blood-could-be-key-ingredient-for-concrete-on-mars-1851729330", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6751a4690e4aff79912c1a9bc27c1a7f.jpg", "publishedAt": "2024-12-27T18:00:00Z", "content": "Its conceivable that a future American President will address the nation from the Oval Office on the day NASA successfully lands astronauts on Mars. They will likely praise the blood, sweat and tears… [+2106 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "Scientists use machine learning to develop an opener for a molecular can - Phys.org", "description": "In an era of medical care that is increasingly aiming at more targeted medication therapies, more individual therapies and more effective therapies, doctors and scientists want to be able to introduce molecules to the biological system to undertake specific a…", "url": "https://phys.org/news/2024-12-scientists-machine-molecular.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/scientists-use-machine-1.jpg", "publishedAt": "2024-12-27T17:00:01Z", "content": "In an era of medical care that is increasingly aiming at more targeted medication therapies, more individual therapies and more effective therapies, doctors and scientists want to be able to introduc… [+5939 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "Christmas solar flares erupt from the sun. Will they trigger aurora 'fireworks' as we close out 2024? - Space.com", "description": "Several M-class solar flares erupt within just a few hours late Dec. 25.", "url": "https://www.space.com/the-universe/sun/christmas-solar-flares-fire-off-from-the-sun-will-they-trigger-aurora-fireworks-as-we-close-out-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UPSmi5GprzfoPC7UP7PqZg-1200-80.jpg", "publishedAt": "2024-12-27T16:29:23Z", "content": "In the final hours of Christmas Day, the sun fired off four solar flares within less than three hours.\r\nThe biggest flare of the series, recorded at a M7.3, erupted from sunspot region AR3938 on Dec.… [+2371 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Made Molecules Do the Impossible With Light - SciTechDaily", "description": "By combining photochemical reactions with molecular self-assembly, scientists have achieved the impossible: using light to create molecular fits that defy thermodynamic equilibrium. This groundbreaking approach could revolutionize technology and medicine by l…", "url": "https://scitechdaily.com/scientists-just-made-molecules-do-the-impossible-with-light/", "urlToImage": "https://scitechdaily.com/images/Chemical-Physics-Molecules-Art-Illustration.jpg", "publishedAt": "2024-12-27T16:00:38Z", "content": "Using light, researchers have guided molecules to self-assemble in ways nature wouldn’t allow, unlocking new realms of nanotechnology. This method could inspire futuristic solutions in medicine and d… [+6307 chars]"}, {"source": {"id": null, "name": "Dailykos.com"}, "author": null, "title": "14 Billion Years of Lies - is Dark Energy about to be \"Solved\"? - Daily Kos", "description": "An amusing title for a pretty good slide show...about a subject few really care much about but has held the scientific world’s attention for 3 decades — “Dark Energy”. For the last century or so humans have come to understand we live in a vast universe...", "url": "https://www.dailykos.com/stories/2024/12/27/2293949/-14-Billion-Years-of-Lies-is-Dark-Energy-about-to-be-Solved", "urlToImage": "https://cdn.prod.dailykos.com/images/1355523/story_image/WhirlpoolGalaxy-Hubble.jpg?1728824650", "publishedAt": "2024-12-27T15:59:42Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Unveils a Terrifying Sound from a Black Hole That Will Give You Nightmares — Are You Ready to Hear It? - The Daily Galaxy --Great Discoveries Channel", "description": "What does a black hole sound like? It's not a question most of us think to ask, but thanks to NASA, we now have an answer— and it’s nothing like what you might expect. A sound captured from deep space reveals something eerie and unsettling, challenging everyt…", "url": "https://dailygalaxy.com/2024/12/nasa-unveils-a-terrifying-sound-from-a-black-hole-that-will-give-you-nightmares-are-you-ready-to-hear-it/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/james-webb-telescope-around-black-hole-3d-illustration.jpg", "publishedAt": "2024-12-27T15:29:27Z", "content": "Space, with its vast, mysterious, and often terrifying nature, has long captivated humanitys imagination. As we continue to explore the cosmos, our understanding of the universe expands, revealing as… [+3654 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Evolution journal editors resign en masse to protest Elsevier changes - Retraction Watch", "description": "All but one member of the editorial board of the Journal of Human Evolution (JHE), an Elsevier title, have resigned, saying the “sustained actions of Elsevier are fundamentally incompatible with th…", "url": "https://retractionwatch.com/2024/12/27/evolution-journal-editors-resign-en-masse-to-protest-elsevier-changes/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2024/12/image-5.png", "publishedAt": "2024-12-27T15:01:55Z", "content": "All but one member of the editorial board of the Journal of Human Evolution (JHE), an Elsevier title, have resigned, saying the sustained actions of Elsevier are fundamentally incompatible with the e… [+3345 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Justin Davenport", "title": "International Space Station finishes challenging year as plans are made for its retirement - NASASpaceflight.com", "description": "The International Space Station continues to act as humanity’s outpost in low-Earth orbit, a role…", "url": "https://www.nasaspaceflight.com/2024/12/iss-yearly-roundup/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/12/IMG_4078.jpeg", "publishedAt": "2024-12-27T14:50:21Z", "content": "22The International Space Station continues to act as humanitys outpost in low-Earth orbit, a role that began at the turn of this century. However, the ISS is showing its age and plans are being adva… [+20398 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Study sheds more light on the nature of compact symmetric object DA 362 - Phys.org", "description": "Indian astronomers have performed a multiwavelength study of a gamma-ray emitting compact symmetric object known as DA 362. Results of the study, presented in a research paper published December 17 on the pre-print server arXiv, yield more insights into the n…", "url": "https://phys.org/news/2024-12-nature-compact-symmetric-da.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/study-sheds-more-light-1.jpg", "publishedAt": "2024-12-27T13:30:02Z", "content": "Indian astronomers have performed a multiwavelength study of a gamma-ray emitting compact symmetric object known as DA 362. Results of the study, presented in a research paper published December 17 o… [+3378 chars]"}, {"source": {"id": null, "name": "The Denver Post"}, "author": "Elise Schmelzer", "title": "Denver’s first pet aquamation facility offers a gentler, more eco-friendly way to say goodbye to furry friends - The Denver Post", "description": "The Denver metro’s first pet aquamation facility provides a gentler and more eco-friendly alternative to cremation for furry, feathered and fanged friends.", "url": "https://www.denverpost.com/2024/12/27/pet-aquamation-denver-environment-waterbridge/", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2024/12/TDP-L-AQUAMATION_191.jpg?w=1024&h=683", "publishedAt": "2024-12-27T13:00:06Z", "content": "In an unassuming home on Englewood’s main thoroughfare, warm water gently circulates over the bodies of dead pets inside a large metal box.\r\nFor 18 hours, the water and a potassium hydroxide solution… [+5682 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "James Price", "title": "The oldest rocks on Earth - Livescience.com", "description": "The world's oldest rocks are spread across the globe and paint a picture of Earth's turbulent early history. Here are some of the most notable and important formations scientists have discovered.", "url": "https://www.livescience.com/planet-earth/geology/the-oldest-rocks-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TkRwantuXAHFXu9TWykWUT-1200-80.jpg", "publishedAt": "2024-12-27T13:00:00Z", "content": "Earth has existed for 4.54 billion years\r\n, and during that time, our planet has undergone a number of violent transitions. This makes it difficult for researchers to find out what happened during Ea… [+6429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Meagan Chappell", "title": "Astronauts face unique visual challenges at lunar south pole - Phys.org", "description": "Humans are returning to the moon—this time, to stay. Because our presence will be more permanent, NASA has selected a location that maximizes line-of-sight communication with Earth, solar visibility, and access to water ice: the Lunar South Pole (LSP).", "url": "https://phys.org/news/2024-12-astronauts-unique-visual-lunar-south.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/characterizing-the-vis.jpg", "publishedAt": "2024-12-27T12:39:03Z", "content": "Humans are returning to the moonthis time, to stay. Because our presence will be more permanent, NASA has selected a location that maximizes line-of-sight communication with Earth, solar visibility, … [+4521 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Craving carbs? Blame an ancient gene. - Ars Technica", "description": "We, Neanderthals, and Denisovans all have extra copies of a starch-digesting enzyme.", "url": "https://arstechnica.com/science/2024/12/craving-carbs-blame-an-ancient-gene/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/GettyImages-1451454006-1152x648.jpg", "publishedAt": "2024-12-27T12:25:49Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "What is ‘Kessler Syndrome’ — and why do some scientists think the space disaster scenario has already started? - CNN", "description": "The concept known as “Kessler Syndrome” was proposed nearly five decades ago. Experts weigh in on whether the space-based disaster scenario is already unfolding.", "url": "https://www.cnn.com/2024/12/27/science/space-junk-earth-kessler-syndrome/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2189441731.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-12-27T12:18:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAs a piece of spaceborne garbage veered toward the Int… [+12984 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Warn: Granite Island’s Little Penguins Could Go Extinct in Just a Few Years – Human Activity Is to Blame - The Daily Galaxy --Great Discoveries Channel", "description": "Granite Island’s little penguins, once thriving in large numbers, are now facing an alarming decline. Despite their resilience, human activities and environmental changes have put their survival at risk. New research reveals surprising insights into how even …", "url": "https://dailygalaxy.com/2024/12/scientists-warn-granite-islands-little-penguins-could-go-extinct-in-just-a-few-years-human-activity-is-to-blame/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/12/Granite-Islands-Little-Penguin.jpg", "publishedAt": "2024-12-27T12:00:00Z", "content": "The little penguin colony on Granite Island, once thriving, is now at the brink of extinction. With human activity driving their numbers to critically low levels, scientists are sounding an alarm. Th… [+4067 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Tel-Aviv University", "title": "Brain's 'tug-of-war': Choosing between classical and operant conditioning - Medical Xpress", "description": "A study from Tel Aviv University could reshape our scientific understanding of how humans learn and form memories, particularly through classical and operant conditioning.", "url": "https://medicalxpress.com/news/2024-12-brain-war-classical-conditioning.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/brain-15.jpg", "publishedAt": "2024-12-27T11:15:52Z", "content": "A study from Tel Aviv University could reshape our scientific understanding of how humans learn and form memories, particularly through classical and operant conditioning.\r\nThe research team found th… [+5111 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Tiny Fossilized Embryos Reveal Stunning Details of Life Half a Billion Years Ago - ScienceAlert", "description": "Tiny balls of mineral are opening a new window into the history of life on Earth.", "url": "https://www.sciencealert.com/tiny-fossilized-embryos-reveal-stunning-details-of-life-half-a-billion-years-ago", "urlToImage": "https://www.sciencealert.com/images/2024/12/embryo-header.jpg", "publishedAt": "2024-12-27T11:02:14Z", "content": "Tiny balls of mineral are opening a new window into the history of life on Earth.\r\nThese millimeter-sized objects are more than half a billion years old the fossilized embryos of animals that lived d… [+4147 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Solar Eclipse 2025: Why You’ll Need Your Eclipse Glasses Again Soon - Forbes", "description": "Everything you need to know about the partial solar eclipse that will take place on March 29, 2025 as seen from North America and Europe.", "url": "https://www.forbes.com/sites/jamiecartereurope/2024/12/27/solar-eclipse-2025-why-youll-need-your-eclipse-glasses-again-soon/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6741e15a7d360c25942f1e9c/0x0.jpg?format=jpg&crop=1978,1113,x16,y104,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-12-27T11:00:39Z", "content": "U.S. President Donald Trump, first lady Melania Trump and their son Barron Trump wear special ... [+] glasses to view the solar eclipse from the Truman Balcony at the White House on August 21, 2017 i… [+3017 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "Julia Hotz", "title": "Bat-watching, beach explorations and 'sniff' walks: How nature can provide a tonic for loneliness - BBC.com", "description": "There is an ever-growing list of the benefits of nature prescriptions – now researchers say nature could offer a cure for loneliness too.", "url": "https://www.bbc.com/future/article/20241224-why-spending-more-time-in-nature-can-help-you-feel-less-lonely", "urlToImage": "https://ychef.files.bbci.co.uk/624x351/p0kdx0gc.jpg", "publishedAt": "2024-12-27T10:31:12Z", "content": "There is an ever-growing list of the benefits of natural prescriptions now researchers say nature could offer a cure for loneliness too.\r\nKye Aziz didn't consider himself a big nature lover. As an as… [+9079 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "The Speed Of Human Thought Estimated At A Puzzling 10 Bits Per Second - IFLScience", "description": "Human thought may be far, far slower than we, uh, thought.", "url": "https://www.iflscience.com/the-speed-of-human-thought-estimated-at-a-puzzling-10-bits-per-second-77389", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77389/aImg/81116/brain-meta.png", "publishedAt": "2024-12-27T10:02:45Z", "content": "A duo of researchers at Caltech have attempted to quantify the speed of human thought, putting it at a somewhat perplexing 10 bits of information per second. To put that into perspective, one estimat… [+5623 chars]"}, {"source": {"id": null, "name": "ArchDaily"}, "author": "Andreas Luco", "title": "Z Ø / BETA Ø - ArchDaily", "description": "Completed in 2023 in Madrid, Spain. Images by David Zarzoso. The project focuses on a creating contemporary home where the living quarters face a garden, which becomes the green heart of the home.  After...", "url": "https://www.archdaily.com/1023737/z-o-beta-o", "urlToImage": "https://images.adsttc.com/media/images/673c/8cd7/3106/b562/afa8/44c8/large_jpg/z-o-beta-o_7.jpg?1732021480", "publishedAt": "2024-12-27T08:00:00Z", "content": "© David Zarzoso\r\n+ 13\r\nMore SpecsLess Specs\r\n© David Zarzoso\r\nText description provided by the architects. The project focuses on a creating contemporary home where the living quarters face a garden,… [+825 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Twisted Edison: How Spiraling Light Could Transform Autonomous Vision - SciTechDaily", "description": "Researchers at the University of Michigan discovered a way to produce bright, twisted light using technology akin to an Edison bulb. This breakthrough revisits the principles of blackbody radiation, offering the potential for advanced robotic vision systems c…", "url": "https://scitechdaily.com/twisted-edison-how-spiraling-light-could-transform-autonomous-vision/", "urlToImage": "https://scitechdaily.com/images/Physics-Twisted-Light-Concept.jpg", "publishedAt": "2024-12-27T03:12:32Z", "content": "Using old principles, researchers created intensely bright twisted light that could help robots and self-driving cars see the world more intricately by detecting the “twist” in light waves. (Artist’s… [+6710 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "We Could Be Just 10 Seconds Away From Discovering Dark Matter - ScienceAlert", "description": "The mystery of dark matter could be solved in as little as 10 seconds.", "url": "https://www.sciencealert.com/we-could-be-just-10-seconds-away-from-discovering-dark-matter", "urlToImage": "https://www.sciencealert.com/images/2024/11/sn1987a-1.png", "publishedAt": "2024-12-27T02:58:35Z", "content": "The mystery of dark matter could be solved in as little as 10 seconds.\r\nWhen the next nearby supernova goes off, any gamma-ray telescope pointing in the right direction might be treated to more than … [+4287 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Business Insider", "title": "Astronauts Share Most Breathtaking Images of Earth From Space in 2024 - ScienceAlert", "description": "Every year, the International Space Station produces some of the world's best photography.", "url": "https://www.sciencealert.com/astronauts-share-most-breathtaking-images-of-earth-from-space-in-2024", "urlToImage": "https://www.sciencealert.com/images/2024/12/AuroraFromISS2024.jpg", "publishedAt": "2024-12-27T01:26:16Z", "content": "Every year, the International Space Station produces some of the world's best photography.\r\nAstronauts tend to be technically skilled with a camera, yes. Many of them are engineers, after all.\r\nTheir… [+6417 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Kapil Kajal", "title": "Huge black hole on fire, emits gamma rays billions times stronger than visible light - Yahoo! Voices", "description": "The first-ever photographed black hole emits an extraordinary gamma-ray flare, billions of times more energetic than visible light.", "url": "https://interestingengineering.com/space/black-hole-emits-gamma-rays", "urlToImage": "https://media.zenfs.com/en/interesting_engineering_646/89d5cc74e8dbc3ca2453e965b4d93cfa", "publishedAt": "2024-12-26T23:58:05Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nI… [+4752 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Could planting trees in the Arctic solve global warming? Surprising answer! - The Brighter Side of News", "description": "Planting trees in the Arctic may worsen climate change. Discover why sustainable alternatives like supporting herbivores are more effective", "url": "https://www.thebrighterside.news/post/could-planting-trees-in-the-arctic-solve-global-warming-surprising-answer/", "urlToImage": "https://www.thebrighterside.news/uploads/2024/12/arctic-main.webp?auto=webp&width=2000&height=1333", "publishedAt": "2024-12-26T23:07:00Z", "content": "Tree planting has been championed globally as a cost-effective strategy to mitigate climate change. Trees are celebrated for their ability to absorb carbon dioxide from the atmosphere, promising a so… [+4698 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Lunar glass may rewrite the geological history of the Moon - Earth.com", "description": "A new study reveals that lunar glass beads from Chang'e-5 may have come from meteorite impacts, challenging theories about lunar volcanism.", "url": "https://www.earth.com/news/lunar-glass-may-rewrite-the-geological-history-of-the-moon/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/26024427/lunar-volcanic-beads-doubts.jpg", "publishedAt": "2024-12-26T22:48:48Z", "content": "A recent study published in the journal Science reveals new details about spherical glass beads retrieved by Chinas Change-5 lunar mission. \r\nInitially believed to have formed from volcanic activity … [+5236 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Sarah Johnson", "title": "Revolution in Physics: Top Quarks Created for the First Time at CERN - Glass Almanac", "description": "For the first time, scientists have successfully observed top quarks, ultrafast and unstable fundamental particles created in an Earth-based laboratory. This groundbreaking discovery, announced by the ... Continue Reading →", "url": "https://glassalmanac.com/revolution-in-physics-top-quarks-created-for-the-first-time-at-cern/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2024/12/Revolution-in-Physics-Top-Quarks-Created-for-the-First-Time.jpg", "publishedAt": "2024-12-26T22:23:57Z", "content": "For the first time, scientists have successfully observed top quarks, ultrafast and unstable fundamental particles created in an Earth-based laboratory. This groundbreaking discovery, announced by th… [+4476 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Razvan Calin", "title": "Challenger R/T vs Mustang GT Drag Race: Did the Mopar Bring the Right Engine to the Fight? - autoevolution", "description": "A third-gen Dodge Challenger goes head-to-head against two Mustang GTs and loses clean two out of two, even when if left first", "url": "https://www.autoevolution.com/news/challenger-r-t-vs-mustang-gt-drag-race-did-the-mopar-bring-the-right-engine-to-the-fight-244689.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/challenger-r-t-vs-mustang-gt-drag-race-did-the-mopar-bring-the-right-engine-to-the-fight-244689_1.jpg", "publishedAt": "2024-12-26T20:41:03Z", "content": "It’s been a year since the last pony Mopar, the Challenger, exited production, hand in hand with the Chevrolet Camaro. The Mustang is now alone in a field it named and defined for the past six decade… [+3496 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michael Irving", "title": "World's Oldest Known Lizard Finally Finds Its Place in Family Tree - ScienceAlert", "description": "The oldest known lizard has reclaimed its crown clade.", "url": "https://www.sciencealert.com/worlds-oldest-known-lizard-finally-finds-its-place-in-family-tree", "urlToImage": "https://www.sciencealert.com/images/2024/12/Low-Res_lizard-illustration.jpg", "publishedAt": "2024-12-26T20:02:10Z", "content": "The oldest known lizard has reclaimed its crown clade. A contentious fossil has been re-analyzed by paleobiologists and declared the earliest known member of the lizard-snake group.\r\nThe critter at t… [+3808 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Chinese Satellite Burns Up Over New Orleans, Creating Fireballs in the Sky - Gizmodo", "description": "The imaging satellite was decommissioned two years ago and abandoned to burn up upon reentry through Earth's atmosphere.", "url": "https://gizmodo.com/chinese-satellite-burns-up-over-new-orleans-creating-fireballs-in-the-sky-2000543300", "urlToImage": "https://gizmodo.com/app/uploads/2024/12/Satellite-Reentry.jpeg", "publishedAt": "2024-12-26T19:25:30Z", "content": "Hundreds of stargazers reported fireballs over the southeastern U.S. earlier this week. But this was no natural phenomenonjust another case of dead satellites littering Earth’s orbit.\r\nThe fireworks … [+3061 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Solar Eclipses ‘On Demand’ Mark New Era for Scientists Studying the Physics of Our Sun - Good News Network", "description": "Its effects, as well as being more consequential for our society, are difficult to understand due to outstanding problems in imaging the Sun", "url": "https://www.goodnewsnetwork.org/solar-eclipses-on-demand-mark-new-era-for-scientists-studying-the-physics-of-our-sun/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2024/12/An-illustration-of-Proba-3s-orbit-and-function-credit-ESA-e1735210492271.jpg", "publishedAt": "2024-12-26T19:00:47Z", "content": "An illustration of Proba-3’s orbit and function – credit: ESA\r\nUsing a pair of satellites, the European Space Agency is set to be able to create artificial solar eclipses on-demand to study one of th… [+2956 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mike Pearl", "title": "4 radio emissions Earth received from space in 2024 - Mashable", "description": "None are aliens. All of them are interesting anyway.", "url": "https://mashable.com/article/radio-signals-from-space-2024", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01lrFl3Jl8iu2w1XspPDsW9/hero-image.fill.size_1200x675.v1735076220.jpg", "publishedAt": "2024-12-26T18:19:13Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Early human ancestor 'Lucy' was a bad runner, and this one tendon could explain why - Livescience.com", "description": "By digitally modeling muscles and tendons for the skeleton of Lucy (Australopithecus afarensis), researchers determined that our hominin ancestors could run well but topped out around 11 mph.", "url": "https://www.livescience.com/archaeology/early-human-ancestor-lucy-was-a-bad-runner-and-this-one-tendon-could-explain-why", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rK7pub9kxxvzdeAHMQ4tBb-1200-80.gif", "publishedAt": "2024-12-26T18:00:00Z", "content": "\"Lucy,\" our 3.2 million-year-old hominin relative, couldn't run very fast, according to a new study. But modeling her running ability has provided new insights into the evolution of human anatomy key… [+3025 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Organic molecules found throughout the universe hint that life began in deep space - Earth.com", "description": "Asteroids and comets reveal complex organic molecules which form in space and might have contributed to Earth’s early biology.", "url": "https://www.earth.com/news/organic-molecules-found-throughout-the-universe-hint-that-life-began-in-deep-space/", "urlToImage": "https://cff2.earth.com/uploads/2024/12/26095441/asteroids_organic-molecules_deep-space_nebula_galaxies_1m.jpg", "publishedAt": "2024-12-26T17:03:25Z", "content": "The universe is packed with intricate, carbon-based compounds, including organic molecules, that hold clues about lifes raw materials. Some of these compounds are found in space.\r\nOver the past few y… [+5917 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Watch Ants Outsmart Humans In The Piano Movers Puzzle Using \"Emergent Cognitive Skills\" - IFLScience", "description": "Ants vs humans: who will win?", "url": "https://www.iflscience.com/watch-ants-outsmart-humans-in-the-piano-movers-puzzle-using-emergent-cognitive-skills-77383", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77383/aImg/81100/ants-meta.png", "publishedAt": "2024-12-26T16:49:52Z", "content": "A team studying the group behavior of ants has found that, in the right circumstances, ants can outsmart humans in collective problem-solving tasks.\r\nResearchers from the Weizmann Institute of Scienc… [+4194 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Ryan Erik King", "title": "Private Space Station Set To Break Free From ISS 2 Years Early - Jalopnik", "description": "NASA preferred the accelerated timeline for flexibility in attaching the spacecraft that will kill the ISS", "url": "https://jalopnik.com/private-space-station-set-to-break-free-from-iss-2-year-1851728840", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f6b161dfd67f4835f22508724dbf28f4.png", "publishedAt": "2024-12-26T16:32:43Z", "content": "The International Space Station is nearly five years from its scheduled death date. NASAs funeral plans include seeing a private station springboard off the ISS before the older station plunges into … [+2241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julianna Bragg, CNN", "title": "The bird at the center of the worst single-species mortality event in modern history isn’t recovering, scientists say - Yahoo! Voices", "description": "An Alaska seabird species faced the worst mortality event in modern history, and the population isn’t recovering, a study finds. Experts discuss the future...", "url": "https://www.cnn.com/2024/12/26/science/alaska-heat-wave-murres-global-warming/index.html", "urlToImage": "https://media.zenfs.com/en/cnn_articles_875/7797a37aa63b64424ca25630b90088b7", "publishedAt": "2024-12-26T16:18:47Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nS… [+6268 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Neutron Stars With Less Mass Than A White Dwarf Might Exist, and LIGO and Virgo Could Find Them - Universe Today", "description": "Theoretically a neutron star could have less mass than a white dwarf. If these light neutron stars exist, we might detect them through the gravitational waves they emit during a cataclysmic merger with another star.", "url": "https://www.universetoday.com/170211/neutron-stars-with-less-mass-than-a-white-dwarf-might-exist-and-ligo-and-virgo-could-find-them/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/12/neutronstar.jpg", "publishedAt": "2024-12-26T15:53:13Z", "content": "Most of the neutron stars we know of have a mass between 1.4 and 2.0 Suns. The upper limit makes sense, since, beyond about two solar masses, a neutron star would collapse to become a black hole. The… [+3460 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Matt Morris", "title": "Are night vision monoculars good for skywatching? - Space.com", "description": "Night vision monoculars are hi-tech pieces of kit, but can they help us see celestial objects in areas with light pollution?", "url": "https://www.space.com/stargazing/astronomy-kit/monoculars-with-night-vision-are-they-worth-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PrKfumQzhDy9j9vzt4T9AV-1200-80.jpg", "publishedAt": "2024-12-26T15:00:00Z", "content": "With light pollution a major problem for stargazing in city and suburban areas, it can be hard to see stars without the right equipment to counteract it. Night vision monoculars may be the perfect bi… [+4992 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Running chicken nebula glows in gorgeous new image from Very Large Telescope in Chile - Space.com", "description": "Chicken on the run!", "url": "https://www.space.com/the-universe/galaxies/running-chicken-nebula-glows-in-gorgeous-new-image-from-very-large-telescope-in-chile", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CxZSJhdp4xaPxLK5AvWozA-1200-80.jpg", "publishedAt": "2024-12-26T14:00:00Z", "content": "A new telescope image reveals a distant cosmic gas cloud that looks like a curious chicken with his head tilted in wonder of the universe.\r\nThe image, taken by the European Southern Observatory's (ES… [+2629 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Zhenbo Wang", "title": "From new commercial Moon landers to asteroid investigations, expect a slate of exciting space missions in 2025 - The Conversation France", "description": "From exploring the Moon to revealing mysteries of the solar system, space agencies around the world are gearing up for an exciting year of launches and flybys.", "url": "https://theconversation.com/from-new-commercial-moon-landers-to-asteroid-investigations-expect-a-slate-of-exciting-space-missions-in-2025-243645", "urlToImage": "https://images.theconversation.com/files/636685/original/file-20241205-15-zofr5y.jpg?ixlib=rb-4.1.0&rect=10%2C0%2C6952%2C3476&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2024-12-26T13:46:47Z", "content": "In 2024, space exploration dazzled the world. \r\nNASAs Europa Clipper began its journey to study Jupiters moon Europa. SpaceXs Starship achieved its first successful landing, a critical milestone for … [+8753 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Benjamin Taub", "title": "Are There Any Perfectly Straight Lines In Nature? - IFLScience", "description": "Even laser beams aren't totally straight", "url": "https://www.iflscience.com/are-there-any-perfectly-straight-lines-in-nature-77390", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77390/aImg/81109/lines-in-desert-meta.jpg", "publishedAt": "2024-12-26T13:29:30Z", "content": "The shortest distance between any two points is a perfectly straight line, and given the brilliant efficiency of the natural universe, it figures that linear flawlessness must be a feature of our rea… [+2990 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "gurpreet-singh", "title": "5 Easy workouts to keep your body's flexibility - Mint", "description": "Incorporating these five easy workouts daily can greatly enhance flexibility and well-being; listen to your body and avoid overexertion.", "url": "https://www.livemint.com/web-stories/5-easy-workouts-to-keep-your-bodys-flexibility-updated-visual-story-11735200189449.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/12/26/960x540/pexels-photo-8018965_1735201597565.jpeg", "publishedAt": "2024-12-26T10:45:33Z", "content": "5 EASY WORKOUTS TO KEEP YOUR BODY'S FLEXIBILITY UPDATED \r\nPublished By Gurpreet Singh | 26 Dec, 2024 \r\nFlexibility is vital for overall health, enhancing range of motion, reducing injury risk, boosti… [+1217 chars]"}]}