{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: A Planetary Breakup, Hercules Star Cluster, and the Harp Constellation - SciTechDaily", "description": "What's Up for June? A planetary breakup, prime viewing for a well-known star cluster, and the constellation Lyra. Skywatching highlights for June 2022 include the gathering of four naked-eye planets (Saturn, Mars, Jupiter, and Venus) in the morning sky. Check…", "url": "https://scitechdaily.com/dont-miss-a-planetary-breakup-hercules-star-cluster-and-the-harp-constellation/", "urlToImage": "https://scitechdaily.com/images/Hubble-Ring-Nebula-Messier-57.jpg", "publishedAt": "2022-06-06T09:49:07Z", "content": "ByPreston Dyches, NASA's Jet Propulsion LaboratoryJune 6, 2022\r\nSkywatchers in June will want to see the planets Saturn, Mars, Jupiter, and Venus, the Hercules Cluster, and the constellation Lyra.\r\nW… [+7775 chars]"}, {"source": {"id": null, "name": "Kyodonews.net"}, "author": "", "title": "Amino acids found in asteroid samples collected by Hayabusa2 probe - Kyodo News Plus", "description": "Kyodo News Plus is an online publication delivering the latest news from Japan together with those stories from around the globe in which Japan plays a key role. Centering on content provided by Kyodo News, Japan’s leading news agency, our publication keeps r…", "url": "https://english.kyodonews.net/", "urlToImage": "https://english.kyodonews.net/en/img/fb_og_image.png", "publishedAt": "2022-06-06T04:19:40Z", "content": "Japan's welfare ministry to conduct survey on male sexual trauma\r\nJapan's welfare ministry is creating for the first time a survey specifically focusing on boys and men victimized by sexual violence,… [+2373 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Convergent Evolution Has Been Fooling Us: Most of Our Evolutionary Trees Could Be Wrong - SciTechDaily", "description": "Scientists say convergent evolution is much more common than previously thought. An evolutionary tree, or phylogenetic tree, is a branching diagram showing the evolutionary relationships among various biological species based upon similarities and differences…", "url": "https://scitechdaily.com/convergent-evolution-has-been-fooling-us-most-of-our-evolutionary-trees-could-be-wrong/", "urlToImage": "https://scitechdaily.com/images/Elephant-Shrew.jpg", "publishedAt": "2022-06-05T20:14:43Z", "content": "Scientists say convergent evolution is much more common than previously thought.An evolutionary tree, or phylogenetic tree, is a branching diagram showing the evolutionary relationships among various… [+4678 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "NASA rolling Artemis 1 back to the pad to finish WDR - NASASpaceFlight.com - NASASpaceflight.com", "description": "The first integrated Orion spacecraft and Space Launch System (SLS) rocket for NASA’s Artemis 1…", "url": "https://www.nasaspaceflight.com/2022/06/nasa-rolling-artemis-1-back-to-the-pad-to-finish-wdr/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/06/KSC-20220603-PH-GEB01composite.resize.jpg", "publishedAt": "2022-06-05T18:13:11Z", "content": "The first integrated Orion spacecraft and Space Launch System (SLS) rocket for NASA’s Artemis 1 lunar test flight is returning to Launch Pad 39B at the Kennedy Space Center (KSC) in Florida in hopes … [+11613 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Your Brain Is Ready to Learn About New Things Without You Even Realizing - ScienceAlert", "description": "Simply being exposed to things we're not familiar with – new objects or species of animals, for example – puts us in learning mode, new research has revealed, and makes us more ready to learn about the new thing later on.", "url": "https://www.sciencealert.com/just-being-exposed-to-new-things-makes-us-ready-to-learn-about-them", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/BrainMoldWithHalfPlainWhiteAndTheOtherHalfPaintedManyDifferentColors_1024.jpg", "publishedAt": "2022-06-05T18:03:58Z", "content": "Simply being exposed to things we're not familiar with new objects or species of animals, for example puts us in learning mode, new research has revealed, and makes us more ready to learn about the n… [+4165 chars]"}, {"source": {"id": null, "name": "Raw Story"}, "author": "Nicole Karlis, Salon", "title": "Scientist says interstellar travel might be possible without spaceships - Raw Story", "description": "While a warp drive almost certainly isn't a thing that will ever exist, there's no law of physics that says interstellar travel isn't possible. Perhaps that is one reason why the sci-fi idea isn't out of the realm of possibility, and why some scientists aren'…", "url": "https://www.rawstory.com/space-travel/", "urlToImage": "https://www.rawstory.com/media-library/alien-life-is-out-there-but-our-theories-are-probably-steering-us-away-from-it.jpg?id=24827058&width=1200&coordinates=0%2C107%2C0%2C107&height=600", "publishedAt": "2022-06-05T15:33:34Z", "content": "While a warp drive almost certainly isn't a thing that will ever exist, there's no law of physics that says interstellar travel isn't possible. Perhaps that is one reason why the sci-fi idea isn't ou… [+4328 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb's First Images, Next-Gen Spacesuits, and Lunar-Roving Robot - SciTechDaily", "description": "An important target date for the James Webb Space Telescope … An update about the next generation of spacesuits …. And testing our lunar-roving robot … a few of the stories to tell you about – This Week at NASA! https://youtu.be/vO4lzzfeZg0 First Full-Color I…", "url": "https://scitechdaily.com/this-week-nasa-webbs-first-images-next-gen-spacesuits-and-lunar-roving-robot/", "urlToImage": "https://scitechdaily.com/images/Webb-First-Images-Next-Gen-Spacesuits-Lunar-Roving-Robot.gif", "publishedAt": "2022-06-05T14:54:31Z", "content": "ByNASAJune 5, 2022\r\nThe James Webb Space Telescope (JWST or Webb) is an orbiting infrared observatory that will complement and extend the discoveries of the Hubble Space Telescope. It covers longer w… [+4430 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Issam Ahmed", "title": "Scientists produce chimp genetic map to combat trafficking - Phys.org", "description": "Scientists have produced the first genetic map of chimpanzees in the wild, offering a detailed reconstruction of the endangered species' past migrations, and a new tool to combat illegal trafficking.", "url": "https://phys.org/news/2022-06-scientists-chimp-genetic-combat-trafficking.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/scientists-have-now-ma.jpg", "publishedAt": "2022-06-05T14:20:01Z", "content": "Scientists have produced the first genetic map of chimpanzees in the wild, offering a detailed reconstruction of the endangered species' past migrations, and a new tool to combat illegal trafficking.… [+4053 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tom Kerss", "title": "Venus crossed the sun's face 10 years ago today. Most people alive will never see the sight again. - Space.com", "description": "A look back at the last transit of Venus for more than a century, as it appeared in pristine Hawaiian skies.", "url": "https://www.space.com/venus-transit-2012-skywatching-reminiscences", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bjHh2pTB3Eg5kkSYisSypJ-1200-80.jpg", "publishedAt": "2022-06-05T12:50:59Z", "content": "For many of us, the past two years have delivered a lesson in not taking things for granted. The chaos of the pandemic disrupted relationships, trade and the privileges we often enjoy without a secon… [+11875 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "That's No Asteroid…Oh, Actually It Is - Hackaday", "description": "How important is it to identify killer asteroids before they strike your planet? Ask any dinosaurs. Oh, wait… Granted you also need a way to redirect them, but interest in finding them has pi…", "url": "https://hackaday.com/2022/06/05/thats-no-asteroid-oh-actually-it-is/", "urlToImage": "https://hackaday.com/wp-content/uploads/2022/06/aster.png", "publishedAt": "2022-06-05T11:00:00Z", "content": "How important is it to identify killer asteroids before they strike your planet? Ask any dinosaurs. Oh, wait… Granted you also need a way to redirect them, but interest in finding them has picked up … [+1071 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Charles Q. Choi", "title": "Which is colder: The North or South Pole? - Livescience.com", "description": "Both are downright chilly, but which wins the prize?", "url": "https://www.livescience.com/is-north-pole-or-south-pole-colder", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rb43PFuhsA6dtHod2iWyC-1200-80.jpg", "publishedAt": "2022-06-05T11:00:00Z", "content": "The North Pole and South Pole are the coldest places on Earth\r\n. However, as similar as these areas might seem, one is far icier than the other.\r\nSo, which pole is colder?\r\nBoth the North Pole and So… [+5026 chars]"}, {"source": {"id": null, "name": "AL.com"}, "author": "Leada Gore | lgore@al.com", "title": "5 planets align in the sky this month: Best times, places to see - AL.com", "description": "June will include a rare “planet parade,” this month as five planets line up in the dawn sky. Even more, they’ll be in their proper order from the sun.", "url": "https://www.al.com/news/2022/06/5-planets-align-in-the-sky-this-month-best-times-places-to-see.html", "urlToImage": "https://www.al.com/resizer/hL0bZhYKEsVRLbDc6b7HlNhHY8Q=/1280x0/smart/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/6HQJ2QJEJFBS5HXWZAGEKHBWPA.PNG", "publishedAt": "2022-06-05T10:56:00Z", "content": "June will include a rare planet parade, this month as five planets line up in the dawn sky. Even more, theyll be in their proper order from the sun.\r\nThe view of all five naked-eye planets will greet… [+1426 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Counting Galaxies To Solve a Cosmological Puzzle: Putting the Theory of Special Relativity Into Practice - SciTechDaily", "description": "The theory of relativity was developed by Albert Einstein in the early 1900s due to the inability of classical physics to explain certain observations. It has two components, special relativity and general relativity. Special relativity is based on the key co…", "url": "https://scitechdaily.com/counting-galaxies-to-solve-a-cosmological-puzzle-putting-the-theory-of-special-relativity-into-practice/", "urlToImage": "https://scitechdaily.com/images/Spacetime-Special-Relativity-Concept.jpg", "publishedAt": "2022-06-05T09:48:48Z", "content": "ByUniversity of Colorado at BoulderJune 5, 2022\r\nThe theory of relativity usually encompasses two interrelated theories by Albert Einstein: special relativity published in 1905 and general relativity… [+6998 chars]"}, {"source": {"id": null, "name": "Apartment Therapy"}, "author": "Olivia Harvey", "title": "Bioluminescent Houseplants May Be the Next Big Trend for Green Thumbs - Apartment Therapy", "description": "If you’re looking to add a futuristic spin to your houseplant collection, then you’re going to want to keep an eye on the bioluminescent houseplant market. A company called Light Bio is genetically engineering plants that glow in the dark.Using the genetic ma…", "url": "https://www.apartmenttherapy.com/bioluminescent-houseplants-37088014", "urlToImage": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/at%2Fhouse%20tours%2F2020-01%2FEmily%20E%2FEdelmanTour_016", "publishedAt": "2022-06-04T19:08:48Z", "content": "If you’re looking to add a futuristic spin to your houseplant collection, then you’re going to want to keep an eye on the bioluminescent houseplant market. A company called Light Bio is genetically e… [+1734 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "Ancient humans made giant omelets from the eggs of ‘Demon Ducks of Doom’ - Syfy", "description": "Early Australians were eating the eggs of Genyornis newtoni, the last living species of a group of birds known as ‘Demon Ducks of Doom.’", "url": "https://www.syfy.com/syfy-wire/ancient-eggshells-confirmed-as-genyornis-the-last-demon-duck", "urlToImage": "https://www.syfy.com/sites/syfy/files/2022/06/life_illustration_of_genyornis.jpg", "publishedAt": "2022-06-04T17:00:04Z", "content": "The Croods tells the story of a prehistoric family just trying to survive in a world which is still almost entirely wild. While the family spends most of their time stuck in their cave at the behest … [+4180 chars]"}]}