{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Runaway Black Holes Are Real After All. Here's What We Know. - ScienceAlert", "description": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond.", "url": "https://www.sciencealert.com/runaway-black-holes-are-real-after-all-heres-what-we-know", "urlToImage": "https://www.sciencealert.com/images/2026/02/black_hole_in_the_sky_header.jpg", "publishedAt": "2026-02-08T01:01:27Z", "content": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond. It was moving at around 68 kilometres per second, just over double Earth's spe… [+5740 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "ByOlivia Dimmer", "title": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org", "description": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…", "url": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/cells-systems-cooperat.jpg", "publishedAt": "2026-02-07T21:00:04Z", "content": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The… [+3730 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "When Termites Became Monogamous, A Surprising Thing Happened to Their Sperm - ScienceAlert", "description": "Termites reveal a startling consequence of long-term monogamy – the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.", "url": "https://www.sciencealert.com/when-termites-became-monogamous-a-surprising-thing-happened-to-their-sperm", "urlToImage": "https://www.sciencealert.com/images/2026/02/TermiteSoldierCloseUp.jpg", "publishedAt": "2026-02-07T20:15:15Z", "content": "Termites reveal a startling consequence of long-term monogamy the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.\r\nThis involved l… [+2869 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ryan Weber", "title": "Starbase’s launch site lays groundwork to double in size - NASASpaceFlight.com -", "description": "While pushing for Flight 12, SpaceX has received approval to nearly double the launch site’s…", "url": "https://www.nasaspaceflight.com/2026/02/starbases-launch-site-double-size/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2026/02/Starbase-Launch-Site-with-Expansion-Outlined-622x350.jpg", "publishedAt": "2026-02-07T19:57:50Z", "content": "1While pushing for Flight 12, SpaceX has received approval to nearly double the launch sites size at Starbase. With this approval, SpaceX will be able to complete the redesign of Pad 1 and add additi… [+4844 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Keiichi Ohnaka, Jacco van Loon", "title": "A giant star is changing before our eyes and astronomers are watching in real time - Phys.org", "description": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more than 1,500 times larger than the sun and emitting over 100,000…", "url": "https://phys.org/news/2026-02-giant-star-eyes-astronomers-real.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-giant-star-is-changi.jpg", "publishedAt": "2026-02-07T19:10:01Z", "content": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more th… [+6328 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "NASA Telescope Discovers Nearby Planet With Deep Similarities to Earth - Futurism", "description": "A new candidate exoplanet appears to almost uncanny similarities to Earth — but may differ in at least one major way.", "url": "http://futurism.com/space/far-away-planet-earth-chilling", "urlToImage": "https://futurism.com/wp-content/uploads/2026/02/far-away-planet-earth-chilling.jpg?quality=85&w=1200", "publishedAt": "2026-02-07T18:30:00Z", "content": "Astronomers have discovered what appears to be an exoplanet that could be a distant Earthly paradise. Or it could be a frigid realm even chillier than Mars, incapable of supporting life.\r\nThe margins… [+3015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Webb unveils nature of distant ultraviolet-luminous galaxy CEERS2-588 - Phys.org", "description": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of the observational campaign, published January 29 on the arXiv …", "url": "https://phys.org/news/2026-02-webb-unveils-nature-distant-ultraviolet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/observations-unveil-th.jpg", "publishedAt": "2026-02-07T16:50:01Z", "content": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of th… [+3755 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Stuart Blackman", "title": "\"22% of US men believe they could beat a chimpanzee in a fight\" – Here’s how humans actually stack up against the world’s 10 strongest primates - BBC Wildlife Magazine", "description": "Discover the strongest primates on the planet…", "url": "https://www.discoverwildlife.com/animal-facts/mammals/worlds-strongest-primates", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/02/strongest-primates.jpg?w=1200", "publishedAt": "2026-02-07T16:45:00Z", "content": "From nut-cracking monkeys to tree-bending apes, primates come in an astonishing range of shapes, sizes and strength styles. Some rely on brute mass, others on explosive power, iron grips or slow, rel… [+7439 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Something supercharged Uranus when Voyager 2 flew past - ScienceDaily", "description": "Voyager 2’s flyby of Uranus in 1986 recorded radiation levels so extreme they baffled scientists for nearly 40 years. New research suggests the spacecraft caught Uranus during a rare solar wind event that flooded the planet’s radiation belts with extra energy…", "url": "https://www.sciencedaily.com/releases/2026/02/260206012217.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/uranus-planet-moon-orbits.webp", "publishedAt": "2026-02-07T16:43:26Z", "content": "Scientists at Southwest Research Institute (SwRI) say they may have found an answer to a puzzle that has lingered for nearly four decades involving the radiation belts surrounding Uranus.When NASA's … [+2647 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Ben Mather, Adriana Dutkiewicz, Dietmar Müller, Sabin Zahirovic", "title": "The way Earth's surface moves has a bigger impact on shifting the climate than we knew - Space", "description": "New research reveals the source of this carbon – and the driving forces behind it – are far more complex than previously thought.", "url": "https://www.space.com/astronomy/earth/the-way-earths-surface-moves-has-a-bigger-impact-on-shifting-the-climate-than-we-knew", "urlToImage": "https://cdn.mos.cms.futurecdn.net/n587iTqPMX6heN544QvWHQ-1920-80.jpg", "publishedAt": "2026-02-07T15:00:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "What Scientists Discovered in This Remote Cave Was Buried for 3,700 Years, and It’s Finally Been Revealed - The Daily Galaxy", "description": "A quiet cave seemed like any other archaeological site, until one genetic pattern turned routine research into something far more gripping.", "url": "https://dailygalaxy.com/2026/02/remote-cave-discovery-buried-3700-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/What-Scientists-Discovered-in-This-Remote-Cave-Was-Buried-for-3700-Years-and-Its-Finally-Been-Revealed-scaled.jpg", "publishedAt": "2026-02-07T14:45:00Z", "content": "In a cave nestled high in the Calabrian mountains, ancient bones have revealed a shocking genetic discovery: a child born from a father-daughter union over 3,700 years ago. The rare finding, backed b… [+2886 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jutta Witte", "title": "New type of magnetism discovered in 2D materials - Phys.org", "description": "In collaboration with international partners, researchers at the University of Stuttgart have experimentally demonstrated a previously unknown form of magnetism in atomically thin material layers. The discovery is highly relevant for future magnetic data stor…", "url": "https://phys.org/news/2026-02-magnetism-2d-materials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-new-type-of-magnetis-1.jpg", "publishedAt": "2026-02-07T14:00:06Z", "content": "In collaboration with international partners, researchers at the University of Stuttgart have experimentally demonstrated a previously unknown form of magnetism in atomically thin material layers. Th… [+3797 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Andromeda Is Heading Straight for the Milky Way, and Scientists Finally Know Why - The Daily Galaxy", "description": "A new study uncovers the reason why Andromeda is speeding toward the Milky Way, revealing the powerful influence of dark matter on galactic movement.", "url": "https://dailygalaxy.com/2026/02/andromeda-heading-for-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Andromeda-Is-Heading-Straight-for-the-Milky-Way-and-Scientists-Finally-Know-Why-scaled.png", "publishedAt": "2026-02-07T13:45:00Z", "content": "For years, astronomers have observed the strange motion of Andromeda, the Milky Way’s closest large galactic neighbor. While most galaxies in the universe are receding due to the expansion of space, … [+4264 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "‘Impossible’ material: Researchers create glass-plastic hybrid that defies physics theory - Interesting Engineering", "description": "Scientists have finally combined the best of both worlds into a new, impact-resistant material called a compleximer.", "url": "https://interestingengineering.com/science/impossible-material-glass-plastic-hybrid", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2026/02/Plastic.jpg", "publishedAt": "2026-02-07T12:13:00Z", "content": "Researchers at Wageningen University &amp; Research (WUR) have defied long-standing material theories by developing a brand-new class of material known as a “compleximer.” \r\nThis amber-colored substa… [+3195 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Northern Lights Alert: 10 States May See Aurora Saturday Night - Forbes", "description": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth", "url": "https://www.forbes.com/sites/jamiecartereurope/2026/02/07/northern-lights-alert-10-states-may-see-aurora-saturday-night/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5f719b705d322bfa863f2fdc/0x0.jpg?format=jpg&crop=3398,1910,x1694,y1170,safe&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-07T11:30:51Z", "content": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth. (Photo by Alex Kormann/Star Tr… [+3438 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "Submarine Disappears Beneath Antarctic Ice After Spotting Bizarre Structures No Scientist Has Seen Before - Indian Defence Review", "description": "A groundbreaking Antarctic mission ended in mystery after a high-tech sub vanished beneath the ice, just moments after uncovering bizarre structures hidden below a melting glacier.", "url": "https://indiandefencereview.com/submarine-lost-under-antarctic-ice-after-discovering-glacier-secrets/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/this-under-ice-sub-saw-something-scientists-cant-explain-scaled.jpg", "publishedAt": "2026-02-07T11:30:00Z", "content": "A robotic submersible operating beneath one of Antarcticas most closely monitored ice shelves vanished in January 2024 during a scheduled mission. The vehicle, part of a long-running international ef… [+5699 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Severnaya Zemlya May Be The Last Major Land Discovery On Planet Earth - IFLScience", "description": "\"I strained my eyes and peered intently into the darkness. No, there could be no mistake. I could definitely see land.\"", "url": "https://www.iflscience.com/severnaya-zemlya-may-be-the-last-major-land-discovery-on-planet-earth-82450", "urlToImage": "https://assets.iflscience.com/assets/articleNo/82450/aImg/88894/severnaya-zemlya-archipelago-meta.jpg", "publishedAt": "2026-02-07T10:02:20Z", "content": "With satellite imagery of pretty much every corner of Earth readily available, we are used to the whole of planet Earth being known to humans. But it wasn't that long ago, in the grand scheme of thin… [+4744 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Scientists Are Rethinking 60 Years of Arctic Snow Data - SciTechDaily", "description": "Decades of advances in satellite observation made it seem as though Arctic snow cover was growing, when in reality satellites were simply becoming better at detecting smaller and shrinking amounts of snow.", "url": "https://scitechdaily.com/why-scientists-are-rethinking-60-years-of-arctic-snow-data/", "urlToImage": "https://scitechdaily.com/images/Abandoned-Fishing-Boat-Heavy-Storm-Arctic.jpg", "publishedAt": "2026-02-07T05:30:27Z", "content": "New research suggests that long-standing satellite records may have been quietly misleading scientists about Arctic snow cover. What once appeared to be a surprising increase turns out to be an illus… [+5126 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Rewrites the Life History of the World’s Most Famous Dinosaur - SciTechDaily", "description": "The largest study ever conducted on the growth of Tyrannosaurus rex reveals that the dinosaur took a far longer and slower route to adulthood than scientists had previously believed.", "url": "https://scitechdaily.com/new-research-rewrites-the-life-history-of-the-worlds-most-famous-dinosaur/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-rex-Skeleton-Museum.jpg", "publishedAt": "2026-02-07T04:20:10Z", "content": "A new analysis of fossil bone growth suggests Tyrannosaurus rex grew far more slowly than scientists once thought, taking nearly 40 years to reach full size. Using advanced statistical methods and ne… [+5555 chars]"}, {"source": {"id": null, "name": "East Idaho News"}, "author": "Lisa Lete", "title": "US Navy veteran retires after 35-year career in nuclear innovation and space exploration at INL - East Idaho News", "description": "IDAHO FALLS — Dave Hendricks of Idaho Falls spent his entire 35-year career working in the Idaho desert at Idaho National Laboratory. It’s the only place he ever worked. But that single workplace opened doors he never imagined, including a front-row seat to h…", "url": "https://www.eastidahonews.com/2026/02/us-navy-veteran-retires-after-35-year-career-in-nuclear-innovation-and-space-exploration-at-inl/", "urlToImage": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2026/02/Dave-Hendricks-feature-photo.jpg", "publishedAt": "2026-02-07T00:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX's next astronaut launch for NASA is officially on for Feb. 11 as FAA clears Falcon 9 rocket to fly again - Space", "description": "\"The FAA oversaw and accepted the findings of the SpaceX-led investigation.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacexs-next-astronaut-launch-for-nasa-is-officially-on-for-feb-11-as-faa-clears-falcon-9-rocket-to-fly-again", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eqepdosgSdhu7yhzmKZyZd-1920-80.jpg", "publishedAt": "2026-02-06T23:40:05Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "The dirty afterlife of a dead satellite - Phys.org", "description": "Sometimes we humans get ahead of ourselves. We embark on grand engineering experiments without really understanding what the long-term implications of such projects are. Climate change itself is a perfect example of that—no one in the early industrial revolut…", "url": "https://phys.org/news/2026-02-dirty-afterlife-dead-satellite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-dirty-afterlife-of.jpg", "publishedAt": "2026-02-06T22:31:01Z", "content": "Sometimes we humans get ahead of ourselves. We embark on grand engineering experiments without really understanding what the long-term implications of such projects are. Climate change itself is a pe… [+5277 chars]"}, {"source": {"id": null, "name": "Thedodo.com"}, "author": "Sarah Ashley", "title": "Shivering Dog Locked Out Of House Sits On Her Babies To Keep Them Warm - The Dodo", "description": "On a frigid day in Kansas City, Kansas, a mama dog resorted to sitting on her babies to keep them warm. The dogs were locked outside. Rescuers arrived just in time to save the entire family.", "url": "https://www.thedodo.com/daily-dodo/shivering-dog-locked-out-of-house-sits-on-her-babies-to-keep-them-warm", "urlToImage": "https://assets3.thrillist.com/v1/image/3203851/1200x600/crop;;webp=auto;jpeg_quality=85.jpg", "publishedAt": "2026-02-06T22:22:39Z", "content": "In mid-January, temperatures in Kansas City, Kansas, dropped to 15 degrees Fahrenheit. Spending time outdoors, even in the bright sunshine, was dangerous without proper clothing.\r\nSo when a neighbor … [+2387 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images - Live Science", "description": "A team of researchers using the James Webb Space Telescope has produced the most detailed map of dark matter to date.", "url": "https://www.livescience.com/physics-mathematics/dark-matter/invisible-scaffolding-of-the-universe-revealed-in-ambitious-new-james-webb-telescope-images", "urlToImage": "https://cdn.mos.cms.futurecdn.net/teESBNqZ6Q4EGydNMYhAqe-2560-80.jpg", "publishedAt": "2026-02-06T22:04:42Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope finds precursors to 'building blocks of life' in nearby galaxy - Space", "description": "\"We found an unexpected chemical complexity, with abundances far higher than predicted by current theoretical models.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-finds-precursors-to-building-blocks-of-life-in-nearby-galaxy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7RBsTzEnyN5ot5brQaR56W-1600-80.png", "publishedAt": "2026-02-06T22:00:00Z", "content": null}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Can apes play pretend? Scientists use an imaginary tea party to find out - PBS", "description": "For the first time, an experiment hints that an ape in captivity can have an imagination.", "url": "https://www.pbs.org/newshour/science/can-apes-play-pretend-scientists-use-an-imaginary-tea-party-to-find-out", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2026/02/AP26036547415356-1024x768.jpg", "publishedAt": "2026-02-06T21:09:35Z", "content": "NEW YORK (AP) By age 2, most kids know how to play pretend. They turn their bedrooms into faraway castles and hold make-believe tea parties.\r\nThe ability to make something out of nothing may seem uni… [+2843 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jacek Krywko", "title": "COVID-19 cleared the skies but also supercharged methane emissions - Ars Technica", "description": "Less pollution meant lower amounts of a methane-destroying chemical.", "url": "https://arstechnica.com/science/2026/02/covid-19-cleared-the-skies-but-also-supercharged-methane-emissions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg", "publishedAt": "2026-02-06T21:05:45Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Gayoung Lee", "title": "Something Mysteriously Powerful Slammed Into Earth in 2023. Scientists Now Have a Theory - Gizmodo", "description": "The science here gets really dark.", "url": "https://gizmodo.com/something-unimaginably-powerful-slammed-into-earth-in-2023-scientists-now-have-a-theory-2000719040", "urlToImage": "https://gizmodo.com/app/uploads/2026/02/webb-dark-matter-Sextans-1200x675.jpg", "publishedAt": "2026-02-06T20:45:04Z", "content": "In astrophysics, extreme events may call for extreme interpretations. Sometimes, that means weighing every possible option for what something could have beenor what it could explain.\r\nIn 2023, a dete… [+4228 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Maine", "title": "New study uses Neanderthals to demonstrate gap between generative AI and scholarly knowledge - Phys.org", "description": "Technological advances over the past four decades have turned mobile devices and computers into the world's largest library, where information is just a tap away. Phones, laptops, tablets, smartwatches—they're a part of everyday life, simplifying access to en…", "url": "https://phys.org/news/2026-02-neanderthals-gap-generative-ai-scholarly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/new-study-uses-neander.jpg", "publishedAt": "2026-02-06T20:40:01Z", "content": "Technological advances over the past four decades have turned mobile devices and computers into the world's largest library, where information is just a tap away. Phones, laptops, tablets, smartwatch… [+5542 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Shibaura Institute of Technology", "title": "Researchers demonstrate organic crystal emitting red light from UV and green from near-infrared - Phys.org", "description": "Invisible light beyond the range of human vision plays a vital role in communication technologies, medical diagnostics, and optical sensing. Ultraviolet and near-infrared wavelengths are routinely used in these fields, yet detecting them directly often requir…", "url": "https://phys.org/news/2026-02-crystal-emitting-red-uv-green.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/seeing-the-unseen-scie-2.jpg", "publishedAt": "2026-02-06T20:00:07Z", "content": "Invisible light beyond the range of human vision plays a vital role in communication technologies, medical diagnostics, and optical sensing. Ultraviolet and near-infrared wavelengths are routinely us… [+5323 chars]"}, {"source": {"id": null, "name": "HPCwire"}, "author": null, "title": "Brookhaven Lab’s RHIC Concludes 25-Year Run with Final Collisions - HPCwire", "description": "Milestone caps a quarter century of groundbreaking discoveries — with more to come from final run’s largest-ever dataset — plus technological advances in accelerators, detectors, and computing UPTON, N.Y., Feb. 6, 2026 — Just after 9 a.m. on Friday, Feb. 6, 2…", "url": "https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/", "urlToImage": "https://www.hpcwire.com/wp-content/uploads/2026/02/20260206_1-1024x677.png", "publishedAt": "2026-02-06T19:56:40Z", "content": "Milestone caps a quarter century of groundbreaking discoveries — with more to come from final run’s largest-ever dataset — plus technological advances in accelerators, detectors, and computing\r\nUPTON… [+14244 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA space telescope sees interstellar visitor comet 3I/ATLAS flare up while exiting the solar system - Space", "description": "The infrared space telescope also detected water vapor, carbon dioxide and organic compounds streaming from the departing comet two months after it made its closest approach to the sun.", "url": "https://www.space.com/astronomy/comets/nasa-space-telescope-sees-comet-3i-atlas-dramatically-flare-as-interstellar-visitor-exits-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PcdqhxzofdWSqZV3wb9id7-1566-80.jpg", "publishedAt": "2026-02-06T19:52:08Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Augustin Baudier", "title": "A dinosaur with spikes exhibiting unprecedented properties discovered in China - Phys.org", "description": "Documented for 200 years, the Iguanodontia group is expanding with the discovery of a brand-new species, the first known to bear spikes with properties never before observed in dinosaurs. Scientists from the CNRS1 and their internationalpartners have uncovere…", "url": "https://phys.org/news/2026-02-dinosaur-spikes-unprecedented-properties-china.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-dinosaur-with-spikes.jpg", "publishedAt": "2026-02-06T19:30:01Z", "content": "Documented for 200 years, the Iguanodontia group is expanding with the discovery of a brand-new species, the first known to bear spikes with properties never before observed in dinosaurs. Scientists … [+1867 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Sarah Talbi", "title": "They Drilled Deeper Into Earth’s Crust Than Anyone Before… Then Hit Something Unexpected - Indian Defence Review", "description": "In a stunning geological feat, scientists drilled over 1,200 meters into Earth’s crust, coming closer than ever to the mantle before time ran out.", "url": "https://indiandefencereview.com/drilled-deeper-earths-crust-hit-something-unexpected/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/drilling-machine-scaled.jpg", "publishedAt": "2026-02-06T19:30:00Z", "content": "In May 2023, a team of researchers aboard the JOIDES Resolution drilled 1,268 meters into the Earth’s crust, reaching mantle-altered rock closer than ever before. Working just south of the Lost City … [+3811 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "The Amazingly Fast Meteor Over New Zealand on January 30, 2026 is Not Interstellar in Origin - Avi Loeb – Medium", "description": "On January 30, 2026 at 10:25:37 UTC, a bright green fireball from a meteor was spotted over Wellington Harbour, New Zealand (as reported…", "url": "https://avi-loeb.medium.com/the-amazingly-fast-meteor-over-new-zealand-on-january-30-2026-is-not-interstellar-in-origin-8e64912a7dcd", "urlToImage": "https://miro.medium.com/v2/resize:fit:1050/1*-5KzLjpiYybO7SYLbS3Vvw.jpeg", "publishedAt": "2026-02-06T18:49:09Z", "content": "A camera image of the bright meteor over Wellington, New Zealand at 23:25:37 local time on January 30, 2026. (Image credit: RNZ)\r\nOn January 30, 2026 at 10:25:37 UTC, a bright green fireball from a m… [+6329 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jennifer Chu", "title": "Aerobic respiration began hundreds of millions of years earlier than previously thought, study suggests - Phys.org", "description": "Oxygen is a vital and constant presence on Earth today. But that hasn't always been the case. It wasn't until around 2.3 billion years ago that oxygen became a permanent fixture in the atmosphere, during a pivotal period known as the Great Oxidation Event (GO…", "url": "https://phys.org/news/2026-02-aerobic-respiration-began-hundreds-millions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/some-early-life-forms.jpg", "publishedAt": "2026-02-06T18:40:01Z", "content": "Oxygen is a vital and constant presence on Earth today. But that hasn't always been the case. It wasn't until around 2.3 billion years ago that oxygen became a permanent fixture in the atmosphere, du… [+7928 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ryan Schoensee", "title": "Compound in 500-million-year-old fossils sheds new light on Earth's carbon cycle - Phys.org", "description": "A UT San Antonio-led international research team has identified chitin, the primary organic component of modern crab shells and insect exoskeletons, in trilobite fossils more than 500 million years old, marking the first confirmed detection of the molecule in…", "url": "https://phys.org/news/2026-02-compound-million-year-fossils-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/trilobite.jpg", "publishedAt": "2026-02-06T18:35:20Z", "content": "A UT San Antonio-led international research team has identified chitin, the primary organic component of modern crab shells and insect exoskeletons, in trilobite fossils more than 500 million years o… [+3699 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jenny Green", "title": "The surprising power of a tiny, disordered protein in a mitochondrial supercomplex - Phys.org", "description": "For decades, scientists assumed that order drives efficiency. Yet in the bustling machinery of mitochondria—the organelles that crank out adenosine triphosphate (ATP), the universal \"energy currency\" of cells—one of the most enigmatic components is a protein …", "url": "https://phys.org/news/2026-02-power-tiny-disordered-protein-mitochondrial.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-surprising-power-o.jpg", "publishedAt": "2026-02-06T18:29:24Z", "content": "For decades, scientists assumed that order drives efficiency. Yet in the bustling machinery of mitochondriathe organelles that crank out adenosine triphosphate (ATP), the universal \"energy currency\" … [+9092 chars]"}, {"source": {"id": null, "name": "Astronomy Magazine"}, "author": "Jonti Horner, The Conversation", "title": "A new comet was just discovered. Will it be visible in broad daylight? - Astronomy Magazine", "description": "Explore Comet MAPS' journey as it nears the Sun, promising a spectacular celestial show.", "url": "https://www.astronomy.com/observing/a-new-comet-was-just-discovered-will-it-be-visible-in-broad-daylight/", "urlToImage": "https://www.astronomy.com/wp-content/uploads/2026/02/Lieve_Verschuier_-_Staartster_komeet_boven_Rotterdam_-_11028-A-B_-_Museum_Rotterdam.jpg", "publishedAt": "2026-02-06T18:03:50Z", "content": "A newly discovered comet has astronomers excited, with the potential to be a spectacular sight in early April.\r\nC/2026 A1 (MAPS) was spotted by a team of four amateur astronomers with a remotely oper… [+5930 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Mars Is Losing Its Water, and Scientists Just Discovered Why - The Daily Galaxy", "description": "Mars is losing its water, and scientists have just made an unexpected discovery that could help explain why.", "url": "https://dailygalaxy.com/2026/02/mars-losing-water-scientists-discover-why/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Mars-Is-Losing-Its-Water-and-Scientists-Just-Discovered-Why-scaled.png", "publishedAt": "2026-02-06T17:45:00Z", "content": "Mars, once a much wetter and more dynamic planet, is now a dry and inhospitable desert. The mystery of how the red planet lost its water has fascinated scientists for decades. A groundbreaking study … [+5797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco", "title": "Student makes cosmic dust in a lab, shining a light on the origin of life - cnn.com", "description": "A doctoral student recreated a tiny piece of the universe in a bottle to investigate the chemistry that led to life on Earth.", "url": "https://www.cnn.com/2026/02/06/science/cosmic-dust-discovery-life-beginnings", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/phd-candidate-linda-losurdo-in-her-university-of-sydney-lab-landscape-2-photo-fiona-wolf-university-of-sydney.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-02-06T17:30:45Z", "content": "Recreating a piece of the universe in a bottle might sound like science fiction, but its exactly what Linda Losurdo did.\r\nLosurdo, a doctoral student in materials and plasma physics at the University… [+6308 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James Devitt", "title": "Scientists discover 'levitating' time crystals that you can hold in your hand - Phys.org", "description": "Time crystals, a collection of particles that \"tick\"—or move back and forth in repeating cycles—were first theorized and then discovered about a decade ago. While scientists have yet to create commercial or industrial applications for this intriguing form of …", "url": "https://phys.org/news/2026-02-scientists-levitating-crystals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/scientists-discover-le-1.jpg", "publishedAt": "2026-02-06T17:29:24Z", "content": "Time crystals, a collection of particles that \"tick\"or move back and forth in repeating cycleswere first theorized and then discovered about a decade ago. While scientists have yet to create commerci… [+3941 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "Dinosaurs Survived a Boiling Planet for Millions of Years but Scientists Say Humans May Not - The Daily Galaxy", "description": "Dinosaurs lived through intense heat and high CO₂, yet they thrived. So why is that same planet now turning hostile for us?", "url": "https://dailygalaxy.com/2026/02/dinosaur-era-co2-why-humans-may-not/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Dinosaurs-Survived-a-Boiling-Planet-for-Millions-of-Years-but-Scientists-Say-Humans-May-Not-scaled.jpg", "publishedAt": "2026-02-06T17:15:00Z", "content": "Back when dinosaurs roamed the planet, Earth was hotter than it is today. Yet life not only existed but thrived. Meanwhile, humans are already struggling to deal with a relatively modest temperature … [+3173 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "John Johnson", "title": "For Jupiter, 'Textbooks Will Need to Be Updated' - Newser", "description": "New measurements reveal the planet is a bit thinner, flatter than believed", "url": "https://www.newser.com/story/383289/jupiter-is-a-smidge-smaller-than-we-thought.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1663275-12-20260206112203.jpeg", "publishedAt": "2026-02-06T16:48:00Z", "content": "Still, \"textbooks will need to be updated,\" says study co-author Yohai Kaspi of the Weizmann Institute of Science in Israel, in a statement. Earlier measurements came from NASA's Voyager and Pioneer … [+862 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Daniel Graham", "title": "10 epic photos of the most monumental trees on Earth - BBC Wildlife Magazine", "description": "Astonishing images of some of the world's largest trees, from towering giant sequoias and coastal redwoods to colossal cedars and statuesque baobabs.", "url": "https://www.discoverwildlife.com/plant-facts/trees/tree-photos", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/02/Sequoia-National-Park.jpeg?w=1200", "publishedAt": "2026-02-06T16:38:04Z", "content": "The world is home to some truly extraordinary trees. Some grow almost entirely beneath the ground, others are poisonous, and there's one that's estimated to be almost 5,000 years old.\r\nThen there are… [+1549 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Scientist accidentally stumbles across bizarre ancient ‘wrinkle structures’ in Morocco that shouldn't be there - Live Science", "description": "Ancient fossil structures imprinted on rocks that were once deep beneath the ocean suggest the search for the first life on Earth needs to be broadened.", "url": "https://www.livescience.com/planet-earth/geology/scientist-accidentally-stumbles-across-bizarre-ancient-wrinkle-structures-in-morocco-that-shouldnt-be-there", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nTJ9tADEYvnasjfdLv2krd-1600-80.png", "publishedAt": "2026-02-06T16:35:40Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "New critique debunks claim that trees can sense a solar eclipse - Ars Technica", "description": "Controversial 2025 study \"represents the encroachment of pseudoscience into the heart of biological research.\"", "url": "https://arstechnica.com/science/2026/02/new-critique-debunks-claim-that-trees-can-sense-a-solar-eclipse/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/dolomite4-1152x648.jpg", "publishedAt": "2026-02-06T16:17:45Z", "content": null}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "Oops, Scientists May Have Embarrassingly Miscalculated the End of Existence - Yahoo", "description": "Despite its spectacular birth, the universe will mostly likely eventually fade into nothingness with very little drama—sooner than we thought, scientists say...", "url": "https://www.popularmechanics.com/space/a70269628/end-of-the-universe-timeline/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/hOlP26lfM4aYOsNlw5B0fA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/popular_mechanics_642/62eb13b20c4024440240f44c7a0b339e", "publishedAt": "2026-02-06T16:15:00Z", "content": "\"Hearst Magazines and Yahoo may earn commission or revenue on some items through these links.\"\r\nHeres what youll learn when you read this story:\r\n<ul><li>Despite its spectacular birth, the universe w… [+4403 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Benjamin Taub", "title": "We May Now Know Where Humans And Neanderthals Hooked Up – And It Was All Over The Place - IFLScience", "description": "This was far more than just a one-night stand.", "url": "https://www.iflscience.com/we-may-now-know-where-humans-and-neanderthals-hooked-up-and-it-was-all-over-the-place-82482", "urlToImage": "https://assets.iflscience.com/assets/articleNo/82482/aImg/88946/neanderthal-skeleton-meta.jpg", "publishedAt": "2026-02-06T16:02:04Z", "content": "When our ancient ancestors made the journey out of Africa and took their first steps in Eurasia, they came face-to-face with Neanderthals for the first time and boy, did they hit it off. In fact, pre… [+3041 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ecole Polytechnique Federale de Lausanne", "title": "Measuring time at the quantum level depends on material symmetry - Phys.org", "description": "EPFL physicists have found a way to measure the time involved in quantum events and found it depends on the symmetry of the material. \"The concept of time has troubled philosophers and physicists for thousands of years, and the advent of quantum mechanics has…", "url": "https://phys.org/news/2026-02-quantum-material-symmetry.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/quantum-event.jpg", "publishedAt": "2026-02-06T16:00:03Z", "content": "EPFL physicists have found a way to measure the time involved in quantum events and found it depends on the symmetry of the material. \"The concept of time has troubled philosophers and physicists for… [+5293 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul Arnold", "title": "The evolutionary trap that keeps rove beetles alive - Phys.org", "description": "Rove beetles have evolved a neat trick to survive. They cloak themselves in ant pheromones, allowing them to enter and remain undetected within ant colonies. But it comes with a catch. Once a rove beetle lineage evolves this kind of obligate symbiotic relatio…", "url": "https://phys.org/news/2026-02-evolutionary-rove-beetles-alive.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-evolutionary-trap.jpg", "publishedAt": "2026-02-06T14:40:01Z", "content": "Rove beetles have evolved a neat trick to survive. They cloak themselves in ant pheromones, allowing them to enter and remain undetected within ant colonies. But it comes with a catch. Once a rove be… [+3203 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "Half Pink. Half Colorless. Miners Discover a Massive 37.4-Carat Diamond with a Faultless Split Unlike Any Other Gem - The Daily Galaxy", "description": "Split perfectly in half, this 37-carat gem reveals a buried story scientists never expected to see.", "url": "https://dailygalaxy.com/2026/02/rare-37-carat-pink-diamond-found-botswana-geological-split/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/This-giant-diamond-is-split-down-the-middle-scaled.jpg", "publishedAt": "2026-02-06T12:15:00Z", "content": "A rough diamond unearthed in Botswana in the final quarter of 2025 has drawn sustained attention from geoscientists and gemological laboratories worldwide. The 37.41-carat crystal features a highly u… [+5186 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "Mankind Just Received a 10-Second Signal from 13 Billion Light-Years Across the Universe - Indian Defence Review", "description": "A 10-second flash from deep space just rewrote what we thought we knew about the early universe.", "url": "https://indiandefencereview.com/mankind-just-received-a-10-second-signal-from-13-billion-light-years-across-the-universe/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/a-10-second-burst-of-light-just-reached-earth-scaled.jpg", "publishedAt": "2026-02-06T12:00:00Z", "content": "A brief, high-energy signal recorded last year has become a focal point in astrophysics. The event, lasting ten seconds, came from a time when the universe was only a fraction of its current age. It … [+5130 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Does dark matter actually exist? New theory says it could be gravity behaving strangely - Space", "description": "\"It highlights gravity's possible hidden complexity and invites a reevaluation of where dark matter effects originate.\"", "url": "https://www.space.com/astronomy/dark-universe/does-dark-matter-actually-exist-new-theory-says-it-could-be-gravity-behaving-strangely", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ug3qTXVQFJFGSaFGH9hnzh-1600-80.png", "publishedAt": "2026-02-06T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Pensoft Publishers", "title": "The internet names a new deep-sea species of chiton - Phys.org", "description": "The Senckenberg Ocean Species Alliance (SOSA), in partnership with the scientific publisher Pensoft Publishers and science YouTuber Ze Frank, have let the internet name a newly discovered deep‑sea chiton (a type of marine mollusk). The formal description of t…", "url": "https://phys.org/news/2026-02-internet-deep-sea-species-chiton.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/the-internet-names-a-n.jpg", "publishedAt": "2026-02-06T09:00:01Z", "content": "The Senckenberg Ocean Species Alliance (SOSA), in partnership with the scientific publisher Pensoft Publishers and science YouTuber Ze Frank, have let the internet name a newly discovered deepsea chi… [+5291 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "See Six Planets In The Night Sky This Weekend — When And Where To Look - Forbes", "description": "Look west just after sunset from this weekend for a chance to see some of six planets, though the best views will be had later this month.", "url": "https://www.forbes.com/sites/jamiecartereurope/2026/02/06/see-six-planets-in-the-night-sky-this-weekend---when-and-where-to-look/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/68c160e1da4f033ca6fc6af0/0x0.jpg?format=jpg&crop=3769,2118,x272,y272,safe&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-06T09:00:00Z", "content": "A planet parade mistakenly called a planetary alignment by many is set to unfold this weekend as six planets appear together in the night sky. From this weekend until the end of February, skywatchers… [+3504 chars]"}]}