{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After Sunspot AR3213 EXPLODES, solar storm set to hit Earth, NASA reveals - HT Tech", "description": "NASA Solar Dynamics Observatory has revealed that sunspot AR3213 has exploded again, resulting in solar flare eruptions accompanied by shock waves. This solar storm has impacted Earth.", "url": "https://tech.hindustantimes.com/tech/news/after-sunspot-ar3213-explodes-solar-storm-set-to-hit-earth-nasa-reveals-71676099449863.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/11/1600x900/solar-flare-67532_1920_1_1663740280289_1676099480900_1676099480900.jpg", "publishedAt": "2023-02-11T07:13:03Z", "content": "The Sun has been extremely active in the last few days. It has been buzzing with regions that are highly unstable. This also includes two large sunspots that are directly facing the Earth. The more v… [+1834 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Japan believes green lasers seen over Hawaii likely from China satellite - South China Morning Post", "description": "The National Astronomical Observatory of Japan said that the light show spotted over Hawaii’s tallest mountain in January was likely from a Chinese satellite launched last year.", "url": "https://www.scmp.com/news/asia/east-asia/article/3209862/japan-astronomers-believe-green-lights-seen-over-hawaii-are-lasers-chinese-satellite", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2023/02/11/8ad472f5-342a-4736-acd4-33ed48ef0fea_d250e021.jpg?itok=wn3Stt5o&v=1676100220", "publishedAt": "2023-02-11T04:27:39Z", "content": "Astronomers in Japan believe green laser-lights spotted over Hawaii last month were beamed down by a Chinese weather satellite.\r\nThe National Astronomical Observatory of Japan posted video online of … [+688 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Live : Sun Baffles Scientists As Part Of Sun Breaks Off Forming Strange Crown-like Vortex - TIMES NOW", "description": "Live : A 'material' from a northern prominence broke away from the main filament and was circulating in a massive polar vortex around the north pole of the S...", "url": "https://www.youtube.com/watch?v=qi7NBWibETE", "urlToImage": "https://i.ytimg.com/vi/qi7NBWibETE/maxresdefault_live.jpg", "publishedAt": "2023-02-11T04:14:43Z", "content": null}, {"source": {"id": null, "name": "CNET"}, "author": "Monisha Ravisetti", "title": "Scientists Find Fossil of Biggest Penguin Ever - CNET", "description": "They say it would've weighed a whopping 350 pounds. That's more than an ostrich.", "url": "https://www.cnet.com/science/biology/scientists-find-fossil-of-biggest-penguin-ever/", "urlToImage": "https://www.cnet.com/a/img/resize/354f252ec6beae047f7238490fab8bb74acab536/hub/2023/02/10/9b309c72-8fe1-48f8-928b-3f57f9a03fe6/otago0241044.png?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-02-11T00:03:42Z", "content": "While searching through the beachy boulders of New Zealand's South Island, a crew of international scientists stumbled on an exquisite find: fossilized evidence of two new penguin species that roamed… [+5870 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange New Form of Ice Discovered – “Raises Many Questions on the Very Nature of Liquid Water” - SciTechDaily", "description": "A collaboration between scientists at Cambridge and University College London has led to the discovery of a new form of ice that more closely resembles liquid water than any other and may hold the key to understanding this most famous of liquids. The new form…", "url": "https://scitechdaily.com/strange-new-form-of-ice-discovered-raises-many-questions-on-the-very-nature-of-liquid-water/", "urlToImage": "https://scitechdaily.com/images/Setup-Creating-Medium-Density-Amorphous-Ice-scaled.jpg", "publishedAt": "2023-02-11T00:01:49Z", "content": "Part of the setup for creating medium-density amorphous ice. Credit: Christoph Salzmann\r\nA collaboration between scientists at Cambridge and University College London has led to the discovery of a ne… [+4043 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "A new climate solution involves shooting moon dust into space to create a 'solar shield' around Earth, but scientists say it's a risky last resort - msnNOW", "description": "A moon-dust shield is the latest in a series of risky, last-resort geoengineering proposals to shield Earth from the sun and stop global warming.", "url": "https://www.insider.com/climate-crisis-mine-moon-dust-shield-sun-astrophycists-solution-2023-2", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA17lNN6.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-02-10T23:44:06Z", "content": "© STEFANO RELLANDINI/AFP via Getty Images\r\n The full moon rises next to the Eiffel Tower in Paris. STEFANO RELLANDINI/AFP via Getty Images\r\nThree astrophysicists have an out-of-this-world solution fo… [+5454 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Water-hunting NASA cubesat won't reach Moon after total thruster fail - The Register", "description": "ASCENT propulsion system just didn't work", "url": "https://www.theregister.com/2023/02/10/nasas_flashlight_cubesat_moon/", "urlToImage": "https://regmedia.co.uk/2023/02/10/lunar_flashlight.jpg", "publishedAt": "2023-02-10T23:30:00Z", "content": "A tiny NASA cubesat, sent to hunt for signs of water ice on the Moon, will not reach lunar orbit after all four thrusters in a miniaturized propulsion system malfunctioned en route.\r\nThe Lunar Flashl… [+2581 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "NASA rover finds 'clearest evidence yet' of an ancient lake on Mars - CNN", "description": "In the foothills of a Martian mountain, NASA's Curiosity rover found stunning new evidence of an ancient lake in the form of rocks etched with the ripples of waves — and the telltale signs appeared in the unlikeliest of places.", "url": "https://www.cnn.com/2023/02/10/world/mars-nasa-curiosity-rover-ancient-waters-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230210144651-mars-curiosity-ancient-waters.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-10T23:22:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nIn the foothills of a Martian mountain, NASAs Curiosit… [+2885 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Find Dwarf Planet With an 'Impossible' Ring, And They're Unsure How It Exists - ScienceAlert", "description": "Rings in the Solar System are not exactly rare.", "url": "https://www.sciencealert.com/scientists-find-dwarf-planet-with-an-impossible-ring-and-theyre-unsure-how-it-exists", "urlToImage": "https://www.sciencealert.com/images/2023/02/quaoar-illustration.jpg", "publishedAt": "2023-02-10T23:01:02Z", "content": "Rings in the Solar System are not exactly rare. Half the planets have them, and others may have in the past. Some asteroids have rings, as does the dwarf planet Haumea. Even the Sun has rings of a so… [+4475 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Universe: Hostile Worlds of Mercury & Venus (S1, E7) | Full Episode - HISTORY", "description": "Scorched by their proximity to the sun, Mercury and Venus are hostile worlds; one gouged with craters and the other a vortex of sulfur, carbon dioxide and ac...", "url": "https://www.youtube.com/watch?v=PaewZEe806k", "urlToImage": "https://i.ytimg.com/vi/PaewZEe806k/maxresdefault.jpg", "publishedAt": "2023-02-10T23:00:24Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lindsey Valich", "title": "New models shed light on life's origin - Phys.org", "description": "The first signs of life emerged on Earth in the form of microbes about four billion years ago. While scientists are still determining exactly when and how these microbes appeared, it's clear that the emergence of life is intricately intertwined with the chemi…", "url": "https://phys.org/news/2023-02-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/antient-earth.jpg", "publishedAt": "2023-02-10T22:28:22Z", "content": "The first signs of life emerged on Earth in the form of microbes about four billion years ago. While scientists are still determining exactly when and how these microbes appeared, it's clear that the… [+5294 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Researchers detail never-before-seen properties in a family of superconducting Kagome metals - Phys.org", "description": "Dramatic advances in quantum computing, smartphones that only need to be charged once a month, trains that levitate and move at superfast speeds. Technological leaps like these could revolutionize society, but they remain largely out of reach as long as super…", "url": "https://phys.org/news/2023-02-never-before-seen-properties-family-superconducting-kagome.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-detail-nev.jpg", "publishedAt": "2023-02-10T22:23:29Z", "content": "Dramatic advances in quantum computing, smartphones that only need to be charged once a month, trains that levitate and move at superfast speeds. Technological leaps like these could revolutionize so… [+6434 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Puffy helium planets could explain exoplanet size mystery - Space.com", "description": "The fate of Neptune-like worlds that migrate close to their star is to be whittled away by stellar radiation.", "url": "https://www.space.com/puffy-helium-planets--exoplanet-size-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BNR5UHHTYFaZfzGP4urGfM-1200-80.jpg", "publishedAt": "2023-02-10T21:00:34Z", "content": "Helium could make up almost half the mass of the atmosphere of giant exoplanets\r\n that have migrated close to their star\r\n, explaining why there is a mysterious size gap in the scale of these worlds.… [+5192 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Opening day of 2023 has come and gone! | #SepangTest - MotoGP", "description": "Day 1 of 2023 is underway as the #MotoGP stars get their hands on their new machines! 🙌It was a full morning and afternoon of action so check out how the ri...", "url": "https://www.youtube.com/watch?v=lUueIUSD4t0", "urlToImage": "https://i.ytimg.com/vi/lUueIUSD4t0/maxresdefault.jpg", "publishedAt": "2023-02-10T20:00:13Z", "content": null}, {"source": {"id": null, "name": "TechSpot"}, "author": "Priya Walia", "title": "A new potentially habitable planet is discovered by scientists, but half of it is in perpetual darkness - TechSpot", "description": "When we analyzed the data of the star Wolf 1069, we discovered a clear, low-amplitude signal of what appears to be a planet of roughly Earth mass,...", "url": "https://www.techspot.com/news/97568-new-potentially-habitable-planet-discovered-scientists-but-half.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/02/2023-02-10-image-11.jpg", "publishedAt": "2023-02-10T19:22:00Z", "content": "Why it matters: A team of international astronomers announced the discovery of an exoplanet that is both eerily similar and close to Earth on a galactic scale. The newly discovered planet Wolf 1069b … [+2158 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Leonardo noted link between gravity and acceleration centuries before Einstein - Ars Technica", "description": "Caltech engineers even recreated his experiment with a modern apparatus.", "url": "https://arstechnica.com/science/2023/02/leonardo-noted-link-between-gravity-and-acceleration-centuries-before-einstein/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/davinci1-760x380.jpg", "publishedAt": "2023-02-10T17:33:49Z", "content": "18 with 0 posters participating\r\nCaltech researchers recreated an experiment on gravity and acceleration that Leonardo da Vinci sketched out in his notebooks.\r\nCaltech engineer Mory Gharib was poring… [+3779 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A liquid laser that is robust in air and tunable by wind - Phys.org", "description": "Scientists from the Tsukuba Research Center for Energy Materials Science at the University of Tsukuba demonstrated a simple method to produce ionic liquid microdroplets that work as flexible, long-lasting, and pneumatically tunable lasers. Unlike existing \"dr…", "url": "https://phys.org/news/2023-02-liquid-laser-robust-air-tunable.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/a-liquid-laser-that-is.jpg", "publishedAt": "2023-02-10T17:30:03Z", "content": "Scientists from the Tsukuba Research Center for Energy Materials Science at the University of Tsukuba demonstrated a simple method to produce ionic liquid microdroplets that work as flexible, long-la… [+3275 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "How fingerprints get their unique whorls - Phys.org", "description": "An international team of scientists with a myriad of backgrounds has revealed the process by which unique fingerprints develop. In their research, published open access in the journal Cell, the group studied the development of fingerprints in mice and humans.", "url": "https://phys.org/news/2023-02-fingerprints-unique-whorls.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/how-fingerprints-get-t.jpg", "publishedAt": "2023-02-10T17:30:01Z", "content": "An international team of scientists with a myriad of backgrounds has revealed the process by which unique fingerprints develop. In their research, published open access in the journal Cell, the group… [+2517 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Tom Metcalfe", "title": "Lasers reveal ruins of 5th-century fortress in Spanish forest - Livescience.com", "description": "Laser scans have revealed that what was thought to be an Iron Age hillfort in northwestern Spain is, in fact, an early medieval stronghold built in the fifth century A.D. and occupied for the next 200 years.", "url": "https://www.livescience.com/lasers-reveal-ruins-of-5th-century-fortress-in-spanish-forest", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6HF5T3s3iihSVyakfAmWZ7-1200-80.jpg", "publishedAt": "2023-02-10T17:27:41Z", "content": "Archaeologists in Spain got the surprise of a lifetime when they discovered the ruins of a powerful fifth-century fortress surrounded by a huge defensive wall in a dense forest, instead of the Iron A… [+4725 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "James Webb telescope finds Milky Way's long-lost twin 9 billion years in the past - Livescience.com", "description": "The light from the distant Sparkler galaxy was spotted in Webb's First Deep Field and could teach us how our own Milky Way devoured other galaxies to grow.", "url": "https://www.livescience.com/james-webb-finds-milky-ways-long-lost-twin-9-billion-years-in-the-past", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Py3Gj8YHGjPH9PmMCidarR-1200-80.jpeg", "publishedAt": "2023-02-10T17:20:04Z", "content": "A sparkling cannibal galaxy discovered by the James Webb Space Telescope appears to be a \"very early\" mirror image of the Milky Way, and it could help astronomers understand how our galaxy took shape… [+3513 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "Mars atmosphere mystery could be solved by rocks in Minnesota - Space.com", "description": "We know precious little about how Mars got its atmosphere or how it disappeared. Now, thanks to some rocks from Duluth, Minnesota, scientists have a new theory.", "url": "https://www.space.com/mars-atmosphere-mystery-minnesota-rocks", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EqgzkMmxjQpEMo4ZTPYuL-1200-80.jpg", "publishedAt": "2023-02-10T17:00:11Z", "content": "Rocks found right here on Earth could help solve the mystery of what happened to Mars' atmosphere.\r\nThanks to our hard-working Mars rovers\r\n, we know that there once was liquid water on our neighbori… [+3359 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Mexican jumping beans exhibit diffusive motion, study finds - Phys.org", "description": "A pair of physicists at Seattle University has found that the path taken by Mexican jumping beans is random and benefits the moth larvae they contain. Devon McKee and Pasha Tabatabai became curious about the movements of Mexican jumping beans and decided to f…", "url": "https://phys.org/news/2023-02-mexican-beans-diffusive-motion.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/jumping-beans-jumping.jpg", "publishedAt": "2023-02-10T16:01:16Z", "content": "A pair of physicists at Seattle University has found that the path taken by Mexican jumping beans is random and benefits the moth larvae they contain. Devon McKee and Pasha Tabatabai became curious a… [+2838 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Laurence Tognetti", "title": "'PneumoPlanet' inflatable moon habitat could house 32 astronauts - Space.com", "description": "Humanity is going back to the moon to stay — and we might have a way to live there long-term.", "url": "https://www.space.com/pneumoplanet-inflatable-moon-habitat-concept", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8b2CaAKocFh9YAPyUjHx7f-1200-80.png", "publishedAt": "2023-02-10T16:00:12Z", "content": "Recently, NASA established potential landing sites near the south pole of the moon for upcoming crewed missions of its Artemis program. But how will astronauts survive and thrive in the harsh lunar e… [+4711 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "While the mantle is mostly solid, a layer about 93 miles (150 kilometers) down is melty, new research finds. - Livescience.com", "description": "While the mantle is mostly solid, a layer about 93 miles (150 kilometers) down is melty, new research finds.", "url": "https://www.livescience.com/earths-mantle-has-a-gooey-layer-we-never-knew-about", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TBEAyDNuBvqWq9awXAdPmH-1200-80.jpg", "publishedAt": "2023-02-10T15:22:45Z", "content": "Most of Earth's mantle is hot but solid, with rocks that deform slowly rather than cracking like the cooler rocks of the crust do. But new research finds that around 93 miles (150 kilometers) below E… [+2980 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA test fires upgraded rocket engines for future Artemis moon missions (video) - Space.com", "description": "The agency wants to send huge payloads towards the moon starting with Artemis 5. Getting there requires more power from recycled RS-25 space shuttle engines.", "url": "https://www.space.com/nasa-artemis-moon-space-launch-system-engine-test-february-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mmcMKA2tDtLK9YGQHgt5xj-1200-80.jpg", "publishedAt": "2023-02-10T15:00:36Z", "content": "NASA fired up an engine Wednesday (Feb. 8) to boost human moon missions.\r\nThe RS-25 engine, a veteran of the space shuttle program, has a new design for the NASA's Artemis program. Starting with Arte… [+2293 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Invites Public to Virtually Share in Excitement of Crew Launch - NASA", "description": "The public is invited to take part in virtual activities and events ahead of the launch of NASA’s SpaceX Crew-6 mission to the International Space Station. Liftoff is targeted for 2:07 a.m. EST Sunday, Feb. 26, from Launch Complex 39A at NASA’s Kennedy Space …", "url": "https://www.nasa.gov/feature/nasa-invites-public-to-virtually-share-in-excitement-of-crew-launch/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/52408625787_b1a01ac35f_k.jpg", "publishedAt": "2023-02-10T14:42:55Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Hubble Spots an Elusive Galaxy - NASA", "description": "Right in the middle of this image taken with the NASA/ESA Hubble Space Telescope lies the newly discovered dwarf galaxy known as Donatiello II.", "url": "https://www.nasa.gov/image-feature/goddard/2023/hubble-spots-an-elusive-galaxy/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/hubble_donotielloii_potw2306a.jpg", "publishedAt": "2023-02-10T12:38:58Z", "content": null}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Ian Bott, Clive Cookson", "title": "Europe's boldest space mission to search for life in outer solar system - Financial Times", "description": "Juice spacecraft’s ambitious 12-year voyage will observe Jupiter and three of its moons", "url": "https://www.ft.com/content/4d836b5a-8ea7-4e6e-a12a-419c1f6bbcd4", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fcb2523a1-fd24-43b6-8b12-5710cc866f64.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2023-02-10T12:00:44Z", "content": "European scientists are in the final stages of preparation for one of the most ambitious space projects ever undertaken, launching a 12-year mission to the outer solar system to investigate whether t… [+4767 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Alexander Cox", "title": "Scope out $85 off the Celestron AstroMaster 130 EQ telescope - Space.com", "description": "You can get a big discount on a powerful telescope that's well suited to beginners and those without much stargazing experience.", "url": "https://www.space.com/celestron-astromaster-130eq-deal-save-85-dollars-february-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nsqbwxqBp5Drne2BdgEB8b-1200-80.jpg", "publishedAt": "2023-02-10T11:05:33Z", "content": "If you're looking for a new telescope or want to inspire a budding astronomer in your life then this deal on the Celestron AstroMaster 130 EQ could be perfect for you. \r\nThe $85 discount (opens in ne… [+2317 chars]"}, {"source": {"id": null, "name": "Lithub.com"}, "author": "", "title": "Theorizing the Basis of Our World: A Reading List on Quantum Reality - Literary Hub", "description": "Quantum Mechanics is the science behind nuclear energy, smart phones, and particle collisions. Yet, almost a century after its discovery, there is still controversy over what the theory actually me…", "url": "https://lithub.com/theorizing-the-basis-of-our-world-a-reading-list-on-quantum-reality/", "urlToImage": "https://s26162.pcdn.co/wp-content/uploads/2016/02/quantum-entaglement.jpg", "publishedAt": "2023-02-10T09:55:10Z", "content": "Quantum Mechanics is the science behind nuclear energy, smart phones, and particle collisions. Yet, almost a century after its discovery, there is still controversy over what the theory actually mean… [+9094 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Now Is Your Last Chance To See The Green Comet Before It Disappears (Maybe Forever) - IFLScience", "description": "The green comet is moving far away and getting dimmer.", "url": "https://www.iflscience.com/now-is-your-last-chance-to-see-the-green-comet-before-it-disappears-maybe-forever-67492", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67492/aImg/65658/comet-3-meta.jpg", "publishedAt": "2023-02-10T09:37:00Z", "content": "The last time Comet C/2022 E3 (ZTF) was visible in our skies Neanderthals still roamed the Earth, 50,000 years ago, so if you dont want to have to wait another 50 millennia, the time to see it is now… [+1572 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top NASA Astronomy Pictures of the week: Nebulae to Comet ZTF, check them all - HT Tech", "description": "NASA publishes its Astronomy Picture of the Day on a daily basis where pictures of stars, galaxies, planets, black holes and other celestial objects are shared. This week's pictures included Nebulae, Nacreous Clouds, Comet ZTF and more. So, check out the Top …", "url": "https://tech.hindustantimes.com/photos/top-nasa-astronomy-pictures-of-the-week-nebulae-to-comet-ztf-check-them-all-71676021105222.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/10/1600x900/nebula_1676021428819_1676021452107_1676021452107.jpg", "publishedAt": "2023-02-10T09:29:28Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Saturn's Rings Are Acting Strange – Hubble Captures Mysterious “Spokes” - SciTechDaily", "description": "Mysterious Features Were First Seen Decades Ago by Voyager Spacecraft Since their discovery by NASA's Voyager mission in the 1980s, temporary \"spoke\" features across Saturn's rings have fascinated scientists, yet eluded explanation. They have been observed in…", "url": "https://scitechdaily.com/saturns-rings-are-acting-strange-hubble-captures-mysterious-spokes/", "urlToImage": "https://scitechdaily.com/images/Spokes-Spotted-in-Saturns-Rings.jpg", "publishedAt": "2023-02-10T09:20:31Z", "content": "BySpace Telescope Science InstituteFebruary 10, 2023\r\nNASAs Hubble Space Telescope has observation time devoted to Saturn each year, thanks to the Outer Planet Atmospheres Legacy (OPAL) program, and … [+8569 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Luke Hurst", "title": "Making heads spin: Scientists say Earth’s inner core has changed its rotation - Euronews", "description": "The Earth’s core lies thousands of kilometres below us, and much about it still remains a mystery.", "url": "https://www.euronews.com/next/2023/02/10/making-heads-spin-scientists-say-earths-inner-core-has-changed-its-rotation", "urlToImage": "https://static.euronews.com/articles/stories/07/33/31/32/1000x563_cmsv2_ae0ad8d0-55fd-52c1-be2e-8f632f819562-7333132.jpg", "publishedAt": "2023-02-10T07:48:49Z", "content": "The Earths core may have stopped spinning, or may even now be spinning backwards, according to a new study.\r\nThe core of our planet is made up of an outer layer of liquid metal, and an inner core of … [+3196 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Ask Ethan: How do we know the timeline of our Universe? - Big Think", "description": "From the earliest stages of the hot Big Bang (and even before) to our dark energy-dominated present, how and when did the Universe grow up?", "url": "https://bigthink.com/starts-with-a-bang/timeline-of-our-universe/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/02/02-earliest-stars_3x2.jpg?resize=1200,630", "publishedAt": "2023-02-10T07:00:00Z", "content": null}, {"source": {"id": null, "name": "ArchDaily"}, "author": "Eduardo Souza", "title": "The Evolution of Large-Scale Windows: Towards Unobstructed, Uninterrupted Views - ArchDaily", "description": "We will explore the past of glass windows and what technologies and possibilities we have available today.", "url": "https://www.archdaily.com/995564/the-evolution-of-large-scale-windows-towards-unobstructed-uninterrupted-views", "urlToImage": "https://images.adsttc.com/media/images/63d2/b042/7643/4a12/6071/63fe/large_jpg/the-evolution-of-large-scale-windows-towards-unobstructed-uninterrupted-views_3.jpg?1674752073", "publishedAt": "2023-02-10T06:30:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Astronomers Detect a Strange New 'Molecular Bubble' Structure in Space - ScienceAlert", "description": "A newly discovered structure located deep in the heart of a thick cloud of gas and dust more than 450 light-years away is the signature of a pair of baby stars in the throes of formation.", "url": "https://www.sciencealert.com/astronomers-detect-a-strange-new-molecular-bubble-structure-in-space", "urlToImage": "https://www.sciencealert.com/images/2023/02/molecular-bubble.jpg", "publishedAt": "2023-02-10T06:24:13Z", "content": "A newly discovered structure located deep in the heart of a thick cloud of gas and dust more than 450 light-years away is the signature of a pair of baby stars in the throes of formation.\r\nA team of … [+3924 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Colossal 2400-foot asteroid, 4 other space rocks to buzz Earth soon - HT Tech", "description": "NASA has issued alerts against 5 asteroids which are set to buzz Earth in the coming days. One of them is a colossal 2400-foot asteroid which is nearly as big as a bridge! Check out their speed, distance, trajectory and more.", "url": "https://tech.hindustantimes.com/photos/colossal-2400-foot-asteroid-4-other-space-rocks-to-buzz-earth-soon-71676008594926.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/10/1600x900/stsci-01gqqpmmf1zczptf7n1t7nqe92-lowres_1675793172700_1676008637668_1676008637668.png", "publishedAt": "2023-02-10T05:59:44Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Mysterious Dark Galaxy Emits No Visible Light, Scientists Say - ScienceAlert", "description": "Galaxies come in many different shapes and sizes, but the basic ingredients seem fairly consistent.", "url": "https://www.sciencealert.com/mysterious-dark-galaxy-emits-no-visible-light-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2023/02/inverted_NGC4414.jpg", "publishedAt": "2023-02-10T05:21:14Z", "content": "Galaxies come in many different shapes and sizes, but the basic ingredients seem fairly consistent. There's usually a big black hole at the center, a bunch of stars and gas, and a generous serving of… [+5248 chars]"}, {"source": {"id": null, "name": "TheInertia.com"}, "author": "Joe Carberry", "title": "10 Eerie Clips of Great White Sharks Eyeing Surfers - TheInertia.com", "description": "", "url": "https://www.theinertia.com/surf/10-eerie-clips-of-great-white-sharks-eyeing-surfers/", "urlToImage": "http://www.theinertia.com/wp-content/uploads/2023/02/greatwhite.jpg", "publishedAt": "2023-02-10T01:42:37Z", "content": "Carlos Gauna has established himself as a modern great white shark expert, especially in the art of capturing footage of said sharks with his drone. Also known as the Malibu Artist (in case he’s new … [+963 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Sea life bounced back fast after the 'mother of mass extinctions' - Nature.com", "description": "A treasure trove of fossils uncovered in China challenges the idea that marine animals took millions of years to recover from the world’s worst die-off.", "url": "https://www.nature.com/articles/d41586-023-00383-9", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00383-9/d41586-023-00383-9_24008890.jpg", "publishedAt": "2023-02-09T23:12:10Z", "content": "The Guiyang biota from China reveals a complex marine ecosystem that lived 250 million years ago (artists impression).Credit: Dinghua Yang, Haijun Song\r\nAn exceptionally well-preserved trove of fossi… [+4593 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "George Vernadakis", "title": "New earthquake probability model may help better predict the next big one - Daily Mail", "description": "A new model claims to predict when and where the next major earthquake may strike - just days after a 7.8 magnitude quake rocked Turkey and Syria, killing at least 19,000 people.", "url": "https://www.dailymail.co.uk/sciencetech/article-11729143/New-earthquake-probability-model-help-better-predict-big-one.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/09/20/67523279-0-image-a-8_1675975979498.jpg", "publishedAt": "2023-02-09T21:54:47Z", "content": "A new model claims to predict when and where the next major earthquake may strike - just days after a 7.8 magnitude quake rocked Turkey and Syria, killing at least 19,000 people. \r\nDeveloped by a tea… [+6206 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Evidence for a chiral superconductor could bring quantum computing closer to the mainstream - Phys.org", "description": "The University of Tennessee's physicists have led a scientific team that found silicon—a mainstay of the soon-to-be trillion-dollar electronics industry—can host a novel form of superconductivity that could bring rapidly emerging quantum technologies closer t…", "url": "https://phys.org/news/2023-02-evidence-chiral-superconductor-quantum-closer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/evidence-for-a-chiral.jpg", "publishedAt": "2023-02-09T21:18:00Z", "content": "Experimental QPI results. a-e) QPI data and processing procedures. a STM image (Vs=0.1 V, It=0.1 nA) of a (3×3)-Sn surface (p=0.1) with several surface defects appearing as dark spots. b) Correspondi… [+7992 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Laurence Tognetti", "title": "Astronomers still scratching their heads over population of ocean-world exoplanets - Phys.org", "description": "In a recent study submitted to the Astrophysical Journal Letters, an international team of researchers led by the University of California, Los Angeles (UCLA) examine the potential for water-worlds around M-dwarf stars. Water-worlds, also known as ocean world…", "url": "https://phys.org/news/2023-02-astronomers-population-ocean-world-exoplanets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astronomers-still-scra.jpg", "publishedAt": "2023-02-09T21:04:25Z", "content": "In a recent study submitted to the Astrophysical Journal Letters, an international team of researchers led by the University of California, Los Angeles (UCLA) examine the potential for water-worlds a… [+2523 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "How a single-gene change led to a new species of monkeyflower - Phys.org", "description": "Monkeyflowers glow in a rich assortment of colors, from yellow to pink to deep red-orange. But about 5 million years ago, some of them lost their yellow. In the Feb. 10 issue of Science, UConn botanists explain what happened genetically to jettison the yellow…", "url": "https://phys.org/news/2023-02-single-gene-species-monkeyflower.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/yellow-evolution-uniqu.jpg", "publishedAt": "2023-02-09T20:45:03Z", "content": "Monkeyflowers glow in a rich assortment of colors, from yellow to pink to deep red-orange. But about 5 million years ago, some of them lost their yellow. In the Feb. 10 issue of Science, UConn botani… [+4354 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA's CAPSTONE moon probe bounces back from 11-day communications glitch - Space.com", "description": "After the spacecraft rebooted itself, communications got back to normal Monday (Feb. 6)", "url": "https://www.space.com/nasa-moon-probe-no-communications-11-days", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RtoKrNr8Q9G4ZuHpMU7Zr3-1200-80.jpg", "publishedAt": "2023-02-09T19:00:39Z", "content": "NASA engineers had a nearly two-week battle with a space probe refusing to respond to commands.\r\nCAPSTONE, an experimental spacecraft at the moon meant to test an orbit for NASA's planned Gateway spa… [+3806 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Hobby-Eberly telescope reveals galaxy gold mine in first large survey - Phys.org", "description": "Astronomers have barely scratched the surface of mapping the nearly endless stars and galaxies of the heavens. Using supercomputers, researchers with The University of Texas at Austin have now revealed the locations of more than 200,000 new astronomical objec…", "url": "https://phys.org/news/2023-02-hobby-eberly-telescope-reveals-galaxy-gold.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/hobby-eberly-telescope-1.jpg", "publishedAt": "2023-02-09T18:56:15Z", "content": "Astronomers have barely scratched the surface of mapping the nearly endless stars and galaxies of the heavens. Using supercomputers, researchers with The University of Texas at Austin have now reveal… [+3701 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Here's what living on Mars would do to the human body - Daily Mail", "description": "NASA aims to send humans to Mars next decade, but SpaceX could do it even earlier. Here's what the first astronauts there will have to contend with.", "url": "https://www.dailymail.co.uk/sciencetech/article-11732099/Heres-living-Mars-human-body.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/09/16/65251177-0-image-a-3_1675958685159.jpg", "publishedAt": "2023-02-09T18:39:14Z", "content": "A new era of spaceflight has dawned with NASA's Artemis programme, which aims to establish a base camp on the moon and lay groundwork for a future trip to Mars.\r\nThe US space agency will send humans … [+13310 chars]"}, {"source": {"id": null, "name": "tor.com"}, "author": "James Davis Nicoll", "title": "Five SF Stories About Space Scouts and Cosmic Exploration - tor.com", "description": "Of all the career paths offered to player characters in the venerable tabletop roleplaying game Traveller, few were as memorable as that of the scout. Stalwart explorers of empire’s hinterlands, sc…", "url": "https://www.tor.com/2023/02/09/five-sf-stories-about-space-scouts-and-cosmic-exploration/", "urlToImage": "https://i0.wp.com/www.tor.com/wp-content/uploads/2023/02/NASA-Explorer-Poster-Space-Opera-Week.png?fit=1200%2C+9999&crop=0%2C0%2C100%2C800px&quality=100&ssl=1", "publishedAt": "2023-02-09T18:04:03Z", "content": "Of all the career paths offered to player characters in the venerable tabletop roleplaying game Traveller, few were as memorable as that of the scout. Stalwart explorers of empires hinterlands, scout… [+5816 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "SKA Observatory (SKAO): A guide to the soon-to-be largest radio telescopes in the world - Space.com", "description": "The world's largest radio telescopes are being built in South Africa and Australia.", "url": "https://www.space.com/square-kilometre-array-observatory-skao", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SS69w5KaqtWjuYpoUEV8hg-1200-80.jpg", "publishedAt": "2023-02-09T18:00:31Z", "content": "The Square Kilometre Array Observatory (SKAO) will deliver the next generation of radio telescopes — vast arrays of radio dishes and antennas spanning two continents. \r\nOnce constructed, the SKA tele… [+15218 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "NASA's NuSTAR Telescope Reveals Hidden Light Shows on the Sun - NASA Jet Propulsion Laboratory", "description": "Some of the hottest spots in the Sun’s atmosphere appear in the telescope’s X-ray view.", "url": "https://www.jpl.nasa.gov/news/nasas-nustar-telescope-reveals-hidden-light-shows-on-the-sun", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1a-PIA25628-nustar-main-image-16.jpg", "publishedAt": "2023-02-09T16:57:33Z", "content": "The observations used in these images coincided with the 12th close approach to the Sun, or perihelion, by NASAs Parker Solar Probe, which is flying closer to the our star than any other spacecraft i… [+1071 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Andromeda galaxy crash triggered a mass galactic migration 2 billion years ago - Space.com", "description": "The influx of stars into the galaxy next door to the Milky Way was revealed by intricate patterns in their motion today and reflects a violent event in our galaxy’s past.", "url": "https://www.space.com/andromeda-galaxy-collision-stellar-immigration", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4w7zm7pYpa6gBP2PQGRdfR-1200-80.jpg", "publishedAt": "2023-02-09T16:55:26Z", "content": "Astronomers have discovered new evidence that Andromeda, the galaxy next door to our own, grew by merging with another galaxy. The event triggered a mass migration of stars into the galaxy. \r\nThis ev… [+4359 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Leaf transformation for efficient random integration and targeted genome modification in maize and sorghum - Nature.com", "description": "Enhanced Wus2/Bbm expression substantially improves leaf transformation, Cas9-mediated gene dropouts and targeted gene insertion in maize, sorghum and other Poaceae species.", "url": "https://www.nature.com/articles/s41477-022-01338-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41477-022-01338-0/MediaObjects/41477_2022_1338_Fig1_HTML.png", "publishedAt": "2023-02-09T16:15:45Z", "content": "Our previous work using Wus2/Bbm established both the starting point and our new objective for the optimization of leaf transformation. Lowe et al.10 determined that the use of Wus2 regulated by the … [+30772 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Adam Zewe | MIT News Office", "title": "Scientists boost quantum signals while reducing noise | MIT News | Massachusetts Institute of Technology - MIT News", "description": "Researchers developed a special type of amplifier that uses a technique known as squeezing to amplify quantum signals by a factor of 100 while reducing the noise that is inherent in quantum systems by an order of magnitude. Their device is the first to demons…", "url": "https://news.mit.edu/2023/boost-quantum-signals-squeezing-noise-0209", "urlToImage": "https://news.mit.edu/sites/default/files/images/202302/MIT_Squeezing-Microwaves-01-PRESS.jpg", "publishedAt": "2023-02-09T16:00:00Z", "content": "A certain amount of noise is inherent in any quantum system. For instance, when researchers want to read information from a quantum computer, which harnesses quantum mechanical phenomena to solve cer… [+8147 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Joy of Asking About Infinity, Jellyfish and the End of the Universe - Quanta Magazine", "description": "As The Joy of Why podcast returns for a second season, producer Polly Stryker and host Steven Strogatz invite listeners to join them and their brilliant new guests on another voyage of discovery.", "url": "https://www.quantamagazine.org/the-joy-of-asking-about-infinity-jellyfish-and-the-end-of-the-universe-20230209/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2023/02/JoY-OpeningEssay-byPeterGreenwood-Social.webp", "publishedAt": "2023-02-09T15:22:14Z", "content": "Heres a second confession: My math education didnt go well, and lets just say I wasnt hanging out reading Steves classic book Nonlinear Dynamics and Chaos on a Friday night. But Im a changed person b… [+2093 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Bobby Azarian", "title": "Why Carl Sagan believed that science is a source of spirituality - Big Think", "description": "Science will lead us to a universal morality and a cosmic religion.", "url": "https://bigthink.com/thinking/why-carl-sagan-believed-that-science-is-a-source-of-spirituality/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/02/30834308763_9392083746_o.png?resize=1200,630", "publishedAt": "2023-02-09T15:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Magma Charts a Shockingly Unexpected Course Beneath Volcanoes - SciTechDaily", "description": "Imperial College London researchers have observed magma taking an unexpected route beneath volcanoes, shedding light on the processes behind eruptions. The findings were based on data from a tectonic plate boundary in the Eastern Caribbean region. The results…", "url": "https://scitechdaily.com/?p=250445", "urlToImage": "https://scitechdaily.com/images/Earthquake-Data-To-Map-Seismic-Absorption.jpg", "publishedAt": "2023-02-09T14:42:35Z", "content": "ByImperial College LondonFebruary 9, 2023\r\nIn new research, scientists from Imperial College London have observed magma taking an unexpected route beneath volcanoes, providing new insights into the m… [+6984 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "World's Deadliest Mushroom Changed How It Reproduces as It Spreads Across The US - ScienceAlert", "description": "Scientists just discovered a scary new fact about the most dangerous mushroom in the world.", "url": "https://www.sciencealert.com/worlds-deadliest-mushroom-changed-how-it-reproduces-as-it-spreads-across-the-us", "urlToImage": "https://www.sciencealert.com/images/2023/02/DeathCapMushroom.jpg", "publishedAt": "2023-02-09T02:39:51Z", "content": "Scientists just discovered a scary new fact about the most dangerous mushroom in the world. It's not reproducing like it used to, and it could be helping it move into new areas.\r\nMushrooms are infamo… [+4394 chars]"}]}