{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joel Achenbach", "title": "Newly detected near-Earth asteroid has astronomers’ full attention - The Washington Post", "description": "The risk of impact is likely to drop to zero as observations of Asteroid 2024 YR4 continue.", "url": "https://www.washingtonpost.com/science/2025/02/02/asteroid-hit-earth/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/67YAO7ZO252SES562Q3SYPFXAQ.jpg&w=1440", "publishedAt": "2025-02-02T20:32:07Z", "content": "On Wednesday, an unprecedented memo from the International Asteroid Warning Network reached the United Nations Office for Outer Space Affairs and from there winged across the planet to government off… [+6623 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "Ice age Europeans as young as 10 years old rocked cheek piercings 30,000 years ago - Livescience.com", "description": "A study of Paleolithic skeletons from Central Europe suggests people's teeth were worn down and crowded together because of cheek piercings.", "url": "https://www.livescience.com/archaeology/ice-age-europeans-as-young-as-10-years-old-rocked-cheek-piercings-30-000-years-ago", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AWtCzo26AEbvGBrL98Wobe-1200-80.png", "publishedAt": "2025-02-02T17:15:00Z", "content": "Strange, flat patches on the teeth of ancient Europeans have puzzled archaeologists for centuries. But one researcher thinks he's solved the mystery: Ice age people as young as 10 years old rocked ch… [+3939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moon on the Move: Surprising New Ridges Reveal Recent Activity - SciTechDaily", "description": "A new study has uncovered evidence that the moon is still geologically active, contradicting previous beliefs that its surface had remained unchanged for billions of years. Researchers found small, relatively young ridges on the far side, suggesting ongoing t…", "url": "https://scitechdaily.com/moon-on-the-move-surprising-new-ridges-reveal-recent-activity/", "urlToImage": "https://scitechdaily.com/images/Lunar-Maria-Diagram-scaled.jpg", "publishedAt": "2025-02-02T17:05:25Z", "content": "Small ridges on the moon’s far side (depicted in yellow) reveal evidence that the moon may not be as dormant as previously believed. Credit: Tom Watters, Smithsonian Institution\r\nA new study has unco… [+4056 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Jack Guy, CNN", "title": "Amateur fossil hunter finds 66-million-year-old animal vomit - KSL.com", "description": "An amateur fossil hunter has uncovered a piece of animal vomit dating back 66 million years on a beach in Denmark.", "url": "https://www.ksl.com/article/51240099/amateur-fossil-hunter-finds-66-million-year-old-animal-vomit", "urlToImage": "https://img.ksl.com/slc/3038/303894/30389486.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2025-02-02T14:58:54Z", "content": "STEVNS KLINT, Denmark An amateur fossil hunter has uncovered a piece of animal vomit dating back 66 million years on a beach in Denmark.\r\nPeter Bennicke noticed a \"strange small cluster of lily piece… [+1350 chars]"}, {"source": {"id": null, "name": "The-express.com"}, "author": "Nelson Espinal", "title": "Scientists say they have figured out where dinosaurs came from in remarkable breakthrough - Daily Express US", "description": "In a new study, scientists are piecing together the mysterious origins of dinosaurs, challenging long-held beliefs about where these giants first appeared.", "url": "https://www.the-express.com/news/science/161927/dinosaurs-origin-explained-new-study", "urlToImage": "https://cdn-images.the-express.com/img/dynamic/15/1200x630/322314.jpg", "publishedAt": "2025-02-02T14:00:00Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "Space photo of the week: James Webb and Hubble telescopes unite to solve 'impossible' planet mystery - Livescience.com", "description": "New James Webb Space Telescope observations of a star cluster called NGC 346 are shedding light on how, when and where planets formed in the early universe.", "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-james-webb-and-hubble-telescopes-unite-to-solve-impossible-planet-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bk3gzV8TFStdNc5csPtnjM-1200-80.jpg", "publishedAt": "2025-02-02T13:00:00Z", "content": "What it is: An open cluster of stars called NGC 346\r\nWhere it is: 210,000 light-years away, in the constellation Tucana\r\nWhen it was shared: Dec. 16, 2024\r\nWhy it's so special: This James Webb Space … [+2889 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Giant ice age landforms discovered deep beneath North Sea revealed in amazing detail - Space.com", "description": "New images from the North Sea show never-before-seen landforms that were carved by a single, colossal ice sheet 1 million years ago and subsequently buried beneath a thick layer of mud.", "url": "https://www.livescience.com/planet-earth/rivers-oceans/giant-ice-age-landforms-discovered-deep-beneath-north-sea-revealed-in-amazing-detail", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Qu9WCEBMj6gmk8kHeC3dk6-1200-80.png", "publishedAt": "2025-02-02T13:00:00Z", "content": "Researchers have discovered huge landforms deep beneath the North Sea that suggest the region was swallowed by a giant ice sheet toward the middle of the last ice age\r\n.\r\nThe scientists captured thes… [+4141 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "New theory unites Einstein’s theory of relativity with quantum mechanics - The Brighter Side of News", "description": "For over a century, quantum mechanics and Einstein’s general relativity have stood as the cornerstones of modern physics.", "url": "https://www.thebrighterside.news/space/new-theory-unites-einsteins-theory-of-relativity-with-quantum-mechanics", "urlToImage": "https://www.thebrighterside.news/uploads/2025/02/quantum-mechanics-and-theory-of-relativity.webp?auto=webp", "publishedAt": "2025-02-02T12:51:00Z", "content": "For over a century, quantum mechanics and Einsteins general relativity have stood as the cornerstones of modern physics, yet their unification remains one of sciences greatest challenges. \r\nNow, rese… [+10336 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Two American Teenage Girls Challenge 2,000 Years of Mathematics with a Groundbreaking Proof of Pythagoras’ Theorem - The Daily Galaxy --Great Discoveries Channel", "description": "Two students from Louisiana have shaken the foundations of mathematics with a fresh take on an age-old theorem. Their work challenges a long-standing assumption about trigonometry and Pythagoras' theorem. What seemed impossible for centuries has now been reex…", "url": "https://dailygalaxy.com/2025/02/two-american-teenage-girls-challenge-2000-years-of-mathematics-with-a-groundbreaking-proof-of-pythagoras-theorem/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Two-American-teenage-girls.jpg", "publishedAt": "2025-02-02T12:45:00Z", "content": "In an astonishing breakthrough, two young students from Louisiana have done what many thought was impossible: proving Pythagoras’ theorem using only trigonometry. Their discovery has rocked the world… [+3443 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Captures Eerie “Birdsongs” in Space, 100,000 KM Away - The Daily Galaxy --Great Discoveries Channel", "description": "Far beyond Earth, something is singing in space. Scientists have detected unexpected electromagnetic waves, producing eerie sounds that shouldn’t exist in this region. This discovery challenges existing theories and reveals unseen forces at work.", "url": "https://dailygalaxy.com/2025/02/nasa-captures-eerie-birdsongs-in-space-100000-km-away/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/chorus-waves.jpg", "publishedAt": "2025-02-02T12:15:00Z", "content": "Scientists have detected an unexpected electromagnetic phenomenon in space: “chorus waves”, a type of wave that, when converted into audio, produces a sound eerily similar to birdsong. This discovery… [+3122 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Flickering, invisible space loops may help predict solar flares - The Washington Post", "description": "It’s notoriously difficult to predict when the sun will belch out a large solar flare — an explosive burst of radiation that directly affects Earth’s atmosphere.", "url": "https://www.washingtonpost.com/science/2025/02/02/solar-flare-radiation-space-weather/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NEAD4C45IH63SOBMLAY4VOTKDI.JPG&w=1440", "publishedAt": "2025-02-02T11:57:57Z", "content": "Flickering, invisible loops in the suns atmosphere appear to warn of larger solar flares to come, a new analysis finds. The discovery could help scientists better predict space weather, researchers s… [+1874 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists May Have Found Traces of an Extinct Genetic Code That Came Before DNA - SciTechDaily", "description": "Scientists have long believed they understood how life’s genetic code evolved, but new research upends that assumption. By analyzing ancient protein sequences, researchers discovered that early life preferred smaller amino acids and incorporated sulfur-based …", "url": "https://scitechdaily.com/scientists-may-have-found-traces-of-an-extinct-genetic-code-that-came-before-dna/", "urlToImage": "https://scitechdaily.com/images/Ancient-Genetic-Code-Art-Concept.jpg", "publishedAt": "2025-02-02T11:37:47Z", "content": "Conventional wisdom about the evolution of the universal genetic code, used by nearly all living organisms to translate genetic information into proteins, is likely in need of revision. Credit: SciTe… [+5889 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Earth's Underworld Is Full of Life, And It Goes Deeper Than We Ever Knew - ScienceAlert", "description": "The surface of our Earth is wriggling with life: it's the defining feature of our planet, which, far as we know, makes it unique among the cosmos.", "url": "https://www.sciencealert.com/earths-underworld-is-full-of-life-and-it-goes-deeper-than-we-ever-knew", "urlToImage": "https://www.sciencealert.com/images/2025/01/1-Team-of-geomicrobiologists-walking-to-a-sampling-site-at-the-end-of-an-inactive-tunnel-in-a-South-African-gold-mine-Credit-Emil-Ruff-copy.jpg", "publishedAt": "2025-02-02T11:29:27Z", "content": "The surface of our Earth is wriggling with life: it's the defining feature of our planet, which, far as we know, makes it unique among the cosmos. But we may have underestimated how deep beneath our … [+3918 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "NASA scientists want to solve a mystery: Why did life \"turn left?\" - Mashable", "description": "Asteroid Bennu isn't playing nice with a leading scientific hypothesis.", "url": "https://mashable.com/article/nasa-bennu-asteroid-amino-acids-surprise", "urlToImage": "https://helios-i.mashable.com/imagery/articles/07zMYd4Ovx0KWSh35dzzWpc/hero-image.fill.size_1200x675.v1738282301.jpg", "publishedAt": "2025-02-02T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "How much did SpaceX's Starship Flight 7 explosion pollute the atmosphere? - Space.com", "description": "Scientists are not sure how much metallic dust remained in the atmosphere after the most recent SpaceX rocket 'disassembly.'", "url": "https://www.space.com/space-exploration/how-much-did-spacexs-starship-flight-7-explosion-pollute-the-atmosphere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/of2MMCYVkKJ5W7yqyxPdVb-1200-80.jpg", "publishedAt": "2025-02-02T11:00:00Z", "content": "The rapid unscheduled disassembly (aka explosion) of SpaceX's Starship megarocket that rained scorching fragments of metal across the Caribbean in mid-January may have released significant amounts of… [+4004 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary Biology Discovery Combines DNA and RNA To Fight Cancer - SciTechDaily", "description": "A study reveals DNA and RNA epigenetics work together as a complementary system for precise gene regulation, crucial for cell function and development, with implications for advanced cancer therapies. Our genes carry the complete set of instructions necessary…", "url": "https://scitechdaily.com/revolutionary-biology-discovery-combines-dna-and-rna-to-fight-cancer/", "urlToImage": "https://scitechdaily.com/images/Cancer-Cells-Dividing.jpg", "publishedAt": "2025-02-02T09:15:40Z", "content": "Recent research reveals that DNA and RNA epigenetics, previously studied as independent systems, actually function as a complementary regulatory network. This dual mechanism enables precise gene acti… [+4322 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Peeing Appears to Be Contagious in Humanity's Closest Relatives - ScienceAlert", "description": "Like an infectious smile or a mirrored yawn, peeing may be a socially contagious behavior that is overlooked and potentially widespread among primates.", "url": "https://www.sciencealert.com/peeing-appears-to-be-contagious-in-humanitys-closest-relatives", "urlToImage": "https://www.sciencealert.com/images/2025/01/ChimpSociety.jpg", "publishedAt": "2025-02-02T09:00:25Z", "content": "Like an infectious smile or a mirrored yawn, peeing may be a socially contagious behavior that is overlooked and potentially widespread among primates.\r\nA study of 20 captive chimpanzees (Pan troglod… [+3638 chars]"}, {"source": {"id": null, "name": "Bulgarianmilitary.com"}, "author": "Boyko Nikolov", "title": "Russia plans to target satellites with gunpowder and nails - Bulgarian Military", "description": "While the US continues to push forward with its ambitious \"Iron Dome\" project, Russia is looking at more cost-effective methods to counter space adversaries.", "url": "https://bulgarianmilitary.com/2025/02/02/russia-plans-to-target-satellites-with-gunpowder-and-nails/", "urlToImage": "https://bulgarianmilitary.com/wp-content/uploads/2024/02/Russian-Soyuz-launch-speculations-stir-US-over-nuke-space-weapon.jpg", "publishedAt": "2025-02-02T08:26:26Z", "content": "While the United States continues to push forward with its ambitious “Iron Dome” project to protect Earth from space-based threats, Russia is looking at more unconventional and cost-effective methods… [+7738 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Dinosaur bone bitten by croc-like creature discovered in Canada - BBC.com", "description": "The bone was unearthed by researchers from the University of Reading.", "url": "https://www.bbc.com/news/articles/ckgnlnwk5ppo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6574/live/01a93a50-e0a8-11ef-a544-6d6714619779.jpg", "publishedAt": "2025-02-02T07:20:36Z", "content": "The vertebra of the young dinosaur is much smaller than that of a fully grown pterosaur\r\nThe fossilised neck bone of a dinosaur that was bitten by a crocodile-like creature 76 million years ago has b… [+2092 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Fourfold Spike in Ocean Warming Sparks Global Concern - SciTechDaily", "description": "A new study has revealed that ocean warming is accelerating at an alarming rate, increasing more than four times faster than in the 1980s. This rapid rise in temperatures is linked to a growing energy imbalance in the Earth’s system, intensified by human-indu…", "url": "https://scitechdaily.com/?p=452412", "urlToImage": "https://scitechdaily.com/images/Earth-on-Fire-Climate-Change-Ocean.jpg", "publishedAt": "2025-02-02T04:09:52Z", "content": "A growing energy imbalance — driven by greenhouse gases and decreased reflection of sunlight — is causing the oceans to warm at an accelerating rate. This phenomenon played a major role in record hea… [+3131 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "Researchers Thought They Discovered an Asteroid—It Was Elon Musk's Tesla Floating in Space - Stewartville Star", "description": "In a startling turn of events, the scientific community was left reeling after a group of researchers mistook Elon Musk's Tesla Roadster for a potentially hazardous asteroid. This astronomical blunder not only highlights the challenges of space observation bu…", "url": "https://thinkstewartville.com/2025/02/01/researchers-thought-they-discovered-an-asteroid-it-was-elon-musks-tesla-floating-in-space/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/01/thinkstewartville.com-0csdfzf-0csdfzf.jpg", "publishedAt": "2025-02-02T03:03:00Z", "content": "Show table of content Hide table of content \r\nIn a startling turn of events, the scientific community was left reeling after a group of researchers mistook Elon Musk’s Tesla Roadster for a potentiall… [+5926 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Forget Silicon – DNA Might Be the Future of Quantum Computing - SciTechDaily", "description": "Researchers have uncovered a way to manipulate DNA at the atomic level using electric field gradients to control nitrogen nuclear spins. Their findings suggest that DNA could be used as both a storage and computation mechanism in future quantum computing devi…", "url": "https://scitechdaily.com/forget-silicon-dna-might-be-the-future-of-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/DNA-Quantum-Computing-Art-Concept.jpg", "publishedAt": "2025-02-02T02:39:00Z", "content": "Scientists have taken a step toward DNA-powered quantum computers by using electric fields to control nuclear spins, unlocking new possibilities in computation and data storage. Credit: SciTechDaily.… [+5154 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Nasa needs saving from itself – but is this billionaire right for that job? - BBC.com", "description": "The success of SpaceX and other private-sector space firms is throwing up hard questions about America's \"great national treasure\".", "url": "https://www.bbc.com/news/articles/cn93797z2dpo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/f8b7/live/cb2ecc60-dff8-11ef-bd1b-d536627785f2.png", "publishedAt": "2025-02-02T00:04:19Z", "content": "Billionaire businessman Jared Isaacman has a big vision for the future of humanity. \r\nHe set off on his first mission to space in 2021 a private journey he paid an estimated $200m (£160m) for and ann… [+15334 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Mysterious Radio Burst Came From Nowhere and It’s Baffling Experts - SciTechDaily", "description": "Astronomers tracking mysterious fast radio bursts (FRBs) stumbled upon an unexpected cosmic puzzle. A burst was detected from the outskirts of an ancient, dead galaxy — far from any young stars thought to create such phenomena. This baffling discovery challen…", "url": "https://scitechdaily.com/this-mysterious-radio-burst-came-from-nowhere-and-its-baffling-experts/", "urlToImage": "https://scitechdaily.com/images/CHIME-Fast-Radio-Burst-Signal.jpg", "publishedAt": "2025-02-01T23:46:19Z", "content": "Scientists using CHIME expected to find a young, energetic star behind a newly detected FRB. Instead, it came from a quiet, ancient galaxy where star formation ended billions of years ago. This chall… [+8743 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "High-Resolution Imaging of Dyson Sphere Candidate Reveals no Radio Signals - Universe Today", "description": "In the more than sixty years where scientists have engaged in the Search for Extraterrestrial Intelligence (SETI), several potential examples of technological activity (“technosignatures”) have been considered. While most SETI surveys to date have focused on …", "url": "https://www.universetoday.com/170424/high-resolution-imaging-of-dyson-sphere-candidate-reveals-no-radio-signals/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/frasercain_scientific_illustration_of_a_dyson_sphere_the_sphere_59595d2a-69b4-405f-b5c9-8698e45861e3.jpg", "publishedAt": "2025-02-01T23:34:05Z", "content": "In the more than sixty years where scientists have engaged in the Search for Extraterrestrial Intelligence (SETI), several potential examples of technological activity (“technosignatures”) have been … [+6867 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "SpaceX launches 22 Starlink satellites to orbit from California - Space.com", "description": "Liftoff occurred at 6:02 p.m. EST.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-22-starlink-satellites-to-orbit-from-california", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Lv63aopX7ZP4xKJkrsknTX-1200-80.jpg", "publishedAt": "2025-02-01T23:27:13Z", "content": "SpaceX launched another batch of its Starlink internet satellites from California today (Feb. 1).\r\nA Falcon 9 rocket carrying 22 Starlink spacecraft lifted off from Vandenberg Space Force Base at 6:0… [+1437 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Sarah Johnson", "title": "Researchers Shatter 100-Year-Old Rule in Organic Chemistry! - Glass Almanac", "description": "A groundbreaking discovery by researchers at the University of California, Los Angeles (UCLA) has challenged a long-standing rule in organic chemistry known as Bredt’s Rule. Established ... Continue Reading →", "url": "https://glassalmanac.com/researchers-shatter-100-year-old-rule-in-organic-chemistry-2/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/02/Researchers-Shatter-100-Year-Old-Rule-in-Organic-Chemistry.jpg", "publishedAt": "2025-02-01T23:07:42Z", "content": "A groundbreaking discovery by researchers at the University of California, Los Angeles (UCLA) has challenged a long-standing rule in organic chemistry known as Bredt’s Rule. Established nearly a cent… [+4897 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Submersible Sent to Explore Antarctica’s ‘Doomsday Glacier’ Mysteriously Disappears - Indian Defence Review", "description": "A high-tech submersible has mysteriously vanished beneath Antarctica’s most dangerous glacier, leaving scientists baffled and concerned. The robotic vehicle, designed to explore the unstable Thwaites Glacier, failed to return from its second dive, despite hav…", "url": "https://indiandefencereview.com/submersible-antarcticas-glacier-disappears/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Submersible-Sent-to-Explore-Antarcticas-‘Doomsday-Glacier-Mysteriously-Disappears.jpg", "publishedAt": "2025-02-01T21:14:44Z", "content": "A seven-meter-long robotic submersible, designed to explore one of the most unstable and dangerous glaciers in Antarctica, has vanished without a trace. The autonomous vehicle, named Ran, was conduct… [+5771 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Two enormous \"bubbles\" discovered towering above and below our Milky Way galaxy - Earth.com", "description": "In the heart of our Milky Way galaxy, two gigantic \"bubbles\" extend roughly 50,000 light-years above and below the galactic center.", "url": "https://www.earth.com/news/two-enormous-fermi-bubbles-discovered-towering-above-and-below-our-milky-way-galaxy/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/01115335/fermi-bubbles_milky-way-galaxy-center_credit-UMich-Yang-ESA-Gaia_1m.jpg", "publishedAt": "2025-02-01T20:19:25Z", "content": "The heart of our Milky Way galaxy is much more active than most people would realize. In fact, astronomers discovered two gigantic “bubbles” extending above and below the galactic center, roughly 50,… [+6629 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Earth's crust is peeling away under California - Livescience.com", "description": "A section of the upper mantle and crust under the Sierra Nevada mountains is peeling away, in a process that may mimic how the continents were formed.", "url": "https://www.livescience.com/planet-earth/geology/earths-crust-is-peeling-away-under-california", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JCZjvQUVcQ2BMQknk47mRh-1200-80.jpg", "publishedAt": "2025-02-01T19:39:00Z", "content": "Beneath California's Sierra Nevada mountains, the crust is peeling away.\r\nThis process, called lithospheric foundering, is nothing to worry about. In fact, it may be how the continents first formed. … [+3141 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Scott Travers", "title": "The ‘52-Hertz Whale’ Is The Loneliest Animal In The World—Here’s What We Know - Forbes", "description": "Deep in the Pacific, humans have tracked a mysterious whale’s call for decades—but no other whale seems to respond. And now, we might be running out of time to find the source.", "url": "https://www.forbes.com/sites/scotttravers/2025/02/01/the-52-hertz-whale-is-the-loneliest-animal-in-the-world-heres-what-we-know/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/679df6b272ec3ddf43c5c17e/0x0.jpg?format=jpg&crop=2376,1114,x0,y33,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-02-01T19:30:22Z", "content": "Deep in the Pacific, humans have tracked a mysterious whales call for decadesbut no other whale ... [+] seems to respond. And now, we might be running out of time to find the source.\r\ngetty\r\nAs far a… [+6141 chars]"}, {"source": {"id": null, "name": "Jasondeegan.com"}, "author": "Smith Noah", "title": "A New Gold Rush Could Be on the Horizon If This Discovery About a Chemical Element Proves True - Jason Deegan", "description": "A groundbreaking study from the University of Geneva (UNIGE) may change the way we search for gold deposits. Researchers have discovered that bisulfide (HS-), a sulfur-based ... Continue Reading →", "url": "https://jasondeegan.com/a-new-gold-rush-could-be-on-the-horizon-if-this-discovery-about-a-chemical-element-proves-true/", "urlToImage": "https://jasondeegan.com/wp-content/uploads/2025/01/A-New-Gold-Rush.jpg", "publishedAt": "2025-02-01T19:00:15Z", "content": "A groundbreaking study from the University of Geneva (UNIGE) may change the way we search for gold deposits. Researchers have discovered that bisulfide (HS-), a sulfur-based molecule, plays a crucial… [+3454 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Safety panel urges NASA to reassess Artemis mission objectives to reduce risk - SpaceNews", "description": "A safety panel is calling on NASA to reassess to plans for upcoming Artemis missions because the agency is packing too many objectives into each mission.", "url": "http://spacenews.com/safety-panel-urges-nasa-to-reassess-artemis-mission-objectives-to-reduce-risk/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDJcLzUzMTI1MTU3MDc2X2QwYWY4YTBjM2Jfby0xMDI0eDU3Ni5qcGciLCJ0eHQiOiJTYWZldHkgcGFuZWwgdXJnZXMgTkFTQSB0byByZWFzc2VzcyBBcnRlbWlzIG1pc3Npb24gb2JqZWN0aXZlcyB0byByZWR1Y2UgcmlzayIsInRlbXBsYXRlIjoiZG9pcyIsImJsb2dfaWQiOjgwNjgxOTc5fQ.SFfejDfi2Q_DvR6_4Xu6uOZornJ1D7ueDoMqpXZpOX0MQ", "publishedAt": "2025-02-01T18:12:11Z", "content": "ORLANDO, Fla. A safety panel is calling on NASA to reassess to plans for upcoming Artemis missions, arguing that the agency is packing too many objectives into each mission.\r\nAt a Jan. 30 public meet… [+5427 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Yellowstone supervolcano study sparks new debate on where and when it will erupt - Earth.com", "description": "Yellowstone's magma system shows new activity, with the northeast sector possibly hosting future volcanic activity.", "url": "https://www.earth.com/news/yellowstone-supervolcano-eruption-study-sparks-new-debate-on-where-and-when-it-will-erupt/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/01104138/yellowstone-supervolcano_crater-movement_eruption-estimates_1m.jpg", "publishedAt": "2025-02-01T17:45:30Z", "content": "Yellowstone National Park boasts some of the most iconic geothermal features in the United States. Beneath those colorful hot springs and spewing geysers sits a volcanic system that has captured the … [+5746 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Victoria Atkinson", "title": "New fabric can heat up almost 50 degrees to keep people warm in ultracold weather - Livescience.com", "description": "A new smart fabric converts light into heat and can raise temperatures by more than 54 degrees Fahrenheit (30 degrees Celsius) after just 10 minutes in the sun.", "url": "https://www.livescience.com/chemistry/new-fabric-can-heat-up-almost-50-degrees-to-keep-people-warm-in-ultracold-weather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kxecsWLRX54LbSnmKcapbn-1200-80.jpg", "publishedAt": "2025-02-01T16:04:00Z", "content": "Scientists have invented a smart fabric that converts light into heat and can raise temperatures by more than 54 degrees Fahrenheit (30 degrees Celsius) after just 10 minutes in the sun. The new mate… [+3000 chars]"}, {"source": {"id": null, "name": "The-express.com"}, "author": "Benjamin Lynch, Claire Anderson", "title": "Huge volcano eruption predicted for 2025 as scientists are left 'fascinated' - Daily Express US", "description": "The Axial Seamount is an underwater volcano located around 300 miles off the coast of Oregon in the US. Scientists believe it could erupt in the near future", "url": "https://www.the-express.com/news/world-news/161928/huge-volcano-eruption-predicted-2025-scientists-left-fascinated", "urlToImage": "https://cdn-images.the-express.com/img/dynamic/12/1200x630/322325.jpg", "publishedAt": "2025-02-01T14:55:33Z", "content": null}, {"source": {"id": null, "name": "Gothamist"}, "author": "https://gothamist.com/staff/rosemary-misdary", "title": "A ‘parade of planets’ in NYC's night skies for February - Gothamist", "description": "Most of the planets can be seen with the naked eye.", "url": "https://gothamist.com/news/a-parade-of-planets-in-nycs-night-skies-for-february", "urlToImage": "https://api-prod.gothamist.com/images/349478/fill-1200x650|format-webp|webpquality-85/", "publishedAt": "2025-02-01T14:01:00Z", "content": "Sunsets in February will end with a bonus throughout the month: Every planet in the solar system will be visible in the night sky.\r\nAstronomy buffs call it a parade of planets. And most of them can b… [+2911 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Study demonstrates phase-tunable spin-wave-mediated mutual synchronization of spin Hall nano-oscillators - Phys.org", "description": "Spin Hall nano-oscillators (SHNOs) are nanoscale spintronic devices that convert direct current into high-frequency microwave signals through spin wave auto-oscillations. This is a type of nonlinear magnetization oscillations that are self-sustained without t…", "url": "https://phys.org/news/2025-01-phase-tunable-mutual-synchronization-hall.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-demonstrates-pha.jpg", "publishedAt": "2025-02-01T14:00:02Z", "content": "Spin Hall nano-oscillators (SHNOs) are nanoscale spintronic devices that convert direct current into high-frequency microwave signals through spin wave auto-oscillations. This is a type of nonlinear … [+6020 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Physicists May Have Just Unlocked the Secret of What’s Inside a Black Hole - The Daily Galaxy --Great Discoveries Channel", "description": "For decades, black holes have been one of the biggest mysteries in physics—but what if we could finally understand what’s inside them? Using quantum computing and machine learning, physicists have created a mathematical simulation of a black hole’s core, reve…", "url": "https://dailygalaxy.com/2025/02/physicists-unlocked-inside-black-hole/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Physicists-May-Have-Just-Unlocked-the-Secret-of-Whats-Inside-a-Black-Hole.jpg", "publishedAt": "2025-02-01T14:00:00Z", "content": "Black holes have long been the ultimate cosmic enigma, defying conventional physics and pushing the boundaries of what we understand about space and time. Now, a groundbreaking study led by physicist… [+6766 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Just like in a Sci-Fi Movie: A Collector Who Bought a Meteorite in Morocco Holds a Startling Truth About Mars’ Watery Past! - Indian Defence Review", "description": "In 2011, a collector unknowingly purchased a small, dark meteorite in Morocco. Years later, scientists discovered that this unassuming rock contained something far more valuable than anyone had imagined. Locked inside were traces of an ancient environment tha…", "url": "https://indiandefencereview.com/just-like-in-a-sci-fi-movie-a-collector-who-bought-a-meteorite-in-morocco-holds-a-startling-truth-about-mars-watery-past/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Martian-rocks.jpg", "publishedAt": "2025-02-01T13:30:00Z", "content": "A simple black stone falling from the sky, lost in the Sahara Desert, could have easily gone unnoticed. But this Martian rock hides a mystery billions of years old. Its name? Black Beauty. And after … [+3163 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Melissa Hobson", "title": "Antarctic scale worm: The glitzy frilly horror show with giant protruding jaws that look like Alien's xenomorph - Livescience.com", "description": "This deep-sea polar worm looks like it can't decide if it's dressed for a glitzy party or a gruesome massacre.", "url": "https://www.livescience.com/animals/antarctic-scale-worm-the-glitzy-frilly-horror-show-with-giant-protruding-jaws-that-look-like-aliens-xenomorph", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bK6o65dfCwTgt66NnhoHzb-1200-80.jpg", "publishedAt": "2025-02-01T13:00:00Z", "content": "Name: Antarctic scale worm (Eulagisca gigantea)\r\nWhere it lives: Below 1,640 (500 meters) deep in Antarctica's Southern Ocean\r\nWhat it eats: Unknown. Probably other animals and/or organic debris.\r\nWh… [+2412 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: Spider zombies; the morphology of cute dogs; entropy is coming for everyone - Phys.org", "description": "This week, astronomers reported the discovery of a super-Earth potentially capable of sustaining life, occupying an eccentric orbit around its star that oscillates in and out of the habitable zone. The first mouse engineered with embryonic stem cells from two…", "url": "https://phys.org/news/2025-01-saturday-citations-spider-zombies-morphology.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/saturday-citations-spi.jpg", "publishedAt": "2025-02-01T12:30:01Z", "content": "This week, astronomers reported the discovery of a super-Earth potentially capable of sustaining life, occupying an eccentric orbit around its star that oscillates in and out of the habitable zone. T… [+5341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Nicioli", "title": "Blue Ghost lunar lander is documenting its journey to the moon. The views are breathtaking - CNN", "description": "The Blue Ghost lunar lander has captured its first images of the moon from Earth’s orbit as well as a video of Earth eclipsing the sun. See the dazzling views here.", "url": "https://www.cnn.com/2025/02/01/science/blue-ghost-moon-eclipse-pictures/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/54283932532-420f060ef1-k.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-01T12:30:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe Blue Ghost lunar lander has captured its first ima… [+3615 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Subham", "title": "Joe Rogan issues four-word reaction to mysterious square structure reportedly pictured on Mars, fans share theories: \"Time-line conflicts\" - Sportskeeda", "description": "Joe Rogan has issued a four-word reaction to a mysterious square structure reportedly pictured on Mars. Fans, too, have shared their theories on the same.", "url": "https://www.sportskeeda.com/mma/news-joe-rogan-issues-four-word-reaction-mysterious-square-structure-reportedly-pictured-mars-fans-share-theories-time-line-conflicts", "urlToImage": "https://staticg.sportskeeda.com/editor/2025/02/046a1-17384070333406-1920.jpg", "publishedAt": "2025-02-01T11:13:00Z", "content": "Joe Rogan has issued a four-word reaction to a mysterious square structure reportedly pictured on Mars. Fans, too, have shared their theories on the same.\r\nAn image reportedly taken from the Mars Glo… [+2446 chars]"}, {"source": {"id": null, "name": "/FILM"}, "author": "Jaron Pak", "title": "Why Sci-Fi Planets Like Arrakis Or Tatooine Aren't Accurate, According To NASA - SlashFilm", "description": "Sci-fi planets like Dune's Arrakis and Star Wars' Tatooine might look cool, but according to NASA they're more fiction than science.", "url": "https://www.slashfilm.com/1771393/why-sci-fi-planets-arrakis-tatooine-not-accurate-nasa/", "urlToImage": "https://www.slashfilm.com/img/gallery/why-sci-fi-planets-like-arrakis-or-tatooine-arent-accurate-according-to-nasa/l-intro-1737821891.jpg", "publishedAt": "2025-02-01T11:00:57Z", "content": "Everyone knows that you need water to live. However, NASA scientists have found some new reasons water is required for life not just individually but on a planetary scale. New data from NASA's Habita… [+1385 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "How Webb Telescope’s ‘Little Red Dots’ Nearly Broke Cosmology—and Helped Fix It - Gizmodo", "description": "Mysterious little red dots threatened to overhaul modern cosmology—but new research may have solved the celestial conundrum.", "url": "https://gizmodo.com/how-webb-telescopes-little-red-dots-nearly-broke-cosmology-and-helped-fix-it-2000556178", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/little-red-dots.jpg", "publishedAt": "2025-02-01T11:00:45Z", "content": "About a year after launching into orbit around the Sun, the James Webb Space Telescope began imaging an abundance of little red dots, which scientists called, um, “little red dots.” I knownot only is… [+4087 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Check Out These Amazing Photos of Comet G3 ATLAS Soaring Past Earth - ScienceAlert", "description": "Comets are always a true celestial treat to track.", "url": "https://www.sciencealert.com/check-out-these-amazing-photos-of-comet-g3-atlas-soaring-past-earth", "urlToImage": "https://www.sciencealert.com/images/2025/01/CometG3AtlasWosSouthernHemisphere.jpg", "publishedAt": "2025-02-01T10:32:13Z", "content": "Comets are always a true celestial treat to track. In a clockwork cosmos, the appearance of a potentially bright new comet is always a celestial question mark: will it perform up to expectations, or … [+3552 chars]"}, {"source": {"id": null, "name": "Cape Cod Times"}, "author": "Jason Savio", "title": "Dennis Port cottage is a ‘sunny and bright’ retreat at just under half a million dollars - Cape Cod Times", "description": "This two-bedroom Dennis Port cottage at 17 Myrtle Lane comes with deeded access to nearby Swan River and a nice outdoor area.", "url": "https://www.capecodtimes.com/story/business/cape-homes/2025/02/01/cape-cod-real-estate-dennis-port-ma-cottage-swan-river/78022536007/", "urlToImage": "https://www.capecodtimes.com/gcdn/authoring/authoring-images/2025/01/30/NCCT/78053974007-picture-7.jpg?crop=623,351,x0,y69&width=623&height=351&format=pjpg&auto=webp", "publishedAt": "2025-02-01T10:10:24Z", "content": "This quaint two-bedroom cottage in Dennis Port includes deeded access to nearby Swan River and could also be turned into a year-round residence.\r\nPerfect for kayakers, paddle boarders and canoers, Le… [+1355 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "90-year-old assumption about quantum entropy challenged in new study - Interesting Engineering", "description": "New research shows that the second law of thermodynamics, which states entropy increases over time, also applies to closed quantum systems.", "url": "https://interestingengineering.com/science/entropy-also-work-in-quantum-world", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/laws-of-entropy.jpg", "publishedAt": "2025-02-01T10:01:00Z", "content": "When we reimagine the entropy of a quantum system through the lens of Claude Shannon, we begin with a quantum system in a state of low Shannon entropy, meaning that the systems behavior is relatively… [+736 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Mouse with two dads survives to adulthood, major implications for same-sex human couples - Earth.com", "description": "A team of researchers has successfully engineered a bi-paternal mouse - a mouse with two dads - that survived until adulthood.", "url": "https://www.earth.com/news/mouse-with-two-dads-survives-to-adulthood-major-implications-for-same-sex-human-couples/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/31170355/same-sex-parents_males_ivf_genetic-engineering_1m.jpg", "publishedAt": "2025-02-01T09:24:14Z", "content": "In a breakthrough achievement, a team of researchers has successfully engineered a bi-paternal mouse – a mouse with two dads – that survived until adulthood. \r\nThe experts targeted specific imprintin… [+5743 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Billions of Hidden Black Holes Could Be Lurking in Space - ScienceAlert", "description": "Don't let the name fool you.", "url": "https://www.sciencealert.com/billions-of-hidden-black-holes-could-be-lurking-in-space", "urlToImage": "https://www.sciencealert.com/images/2025/01/black_hole_glow2_header.jpg", "publishedAt": "2025-02-01T09:01:48Z", "content": "Don't let the name fool you. Black holes might all have hearts of pure darkness, but many cloak themselves in rings of fire that blaze like little else in the cosmos.\r\nThat doesn't mean all are detec… [+4201 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": null, "title": "There's Still Time to Spot Six Planets in a Spectacular Planet Parade This Week - CNET", "description": "Mars, Venus, Jupiter and Saturn should be visible to the naked eye, but get a telescope and you can spot Neptune and Uranus.", "url": "https://www.cnet.com/science/how-to-see-planet-parade-six-planets-in-alignment-this-weekend/", "urlToImage": "https://www.cnet.com/a/img/resize/a75a13cb42c859f0da21d70b04883a84db5c94aa/hub/2025/01/21/1b6ed94e-5c50-407e-8376-803f16c226ea/planet-parade-gettyimages-2154942855.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2025-01-31T22:48:00Z", "content": "2025 is starting off with a bang for skygazers, with a planet parade now visible in the night sky. A planet parade is when several of our solar system's planets are visible in the night sky at the sa… [+6107 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "Enrico de Lazaro", "title": "Long-Handed Ostrich-Like Dinosaur Unearthed in Mexico - Sci.News", "description": "A bizarre new genus and species of ornithomimid dinosaur has been identified from the fossilized remains found in 2014 in Coahuila, Mexico.", "url": "https://www.sci.news/paleontology/mexidracon-longimanus-13629.html", "urlToImage": "https://cdn.sci.news/images/2025/01/image_13629f-Mexidracon-longimanus.jpg", "publishedAt": "2025-01-31T22:03:58Z", "content": "A bizarre new genus and species of ornithomimid dinosaur has been identified from the fossilized remains found in 2014 in Coahuila, Mexico.\r\nLife reconstruction of Mexidracon longimanus. Image credit… [+2825 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "NASA's Juno spacecraft watches most powerful volcanic event ever seen on Jupiter's moon Io - Space.com", "description": "\"This is the most powerful volcanic event ever recorded on the most volcanic world in our solar system — so that's really saying something.\"", "url": "https://www.space.com/nasa-juno-spacecraft-jupiter-io-volcanism", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mPJ9ZdUNo47A2jJYJgouSo-1200-80.png", "publishedAt": "2025-01-31T22:00:00Z", "content": "Even for Jupiter's moon Io, the most volcanic body in the solar system, a recent volcanic event witnessed by NASA's Juno spacecraft takes the biscuit.\r\nThe event was just one eruption centralized in … [+4832 chars]"}, {"source": {"id": null, "name": "Popular Science"}, "author": "Laura Baisas", "title": "Most humans haven’t moved these muscles in 25 million years - Yahoo! Voices", "description": "But the auricular muscles might not be so useless after all.", "url": "https://www.popsci.com/science/ear-muscles-wiggle/", "urlToImage": "https://www.popsci.com/wp-content/uploads/2025/01/ear.png?quality=85&w=2000", "publishedAt": "2025-01-31T05:00:00Z", "content": "Our distant ancestors had several body parts that have become fairly useless over the course of evolutionour wisdom teeth, the tails that are present during the sixth week of gestation, and the auric… [+5351 chars]"}]}