{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Immune Cells' GPS: Crafting Their Own Directional Paths - Neuroscience News", "description": "Researchers made a breakthrough in understanding how immune cells navigate within the body.", "url": "https://neurosciencenews.com/immune-cell-navigation-23872/", "urlToImage": "https://neurosciencenews.com/files/2023/09/immune-cell-gps-neurosinces.jpg", "publishedAt": "2023-09-04T18:51:15Z", "content": "Summary: Researchers made a breakthrough in understanding how immune cells navigate within the body. Contrary to previous beliefs, these cells not only respond to directional cues but also actively s… [+7226 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": ", USA TODAY", "title": "Bright fireball dazzles hundreds across Mid-Atlantic: Watch now - USA TODAY", "description": "A fireball flew Sunday night across the United States, dazzling hundreds of eyewitnesses who reported the sighting to the American Meteor Society.", "url": "https://www.usatoday.com/story/news/nation/2023/09/04/bright-fireball-dazzles-hundreds-across-mid-atlantic-watch-now/70761071007/", "urlToImage": "https://www.gannett-cdn.com/authoring/authoring-images/2023/09/04/USAT/70761080007-ap-texas-perseid-meteor-shower.jpg?auto=webp&crop=2384,1347,x0,y0&format=pjpg&width=1200", "publishedAt": "2023-09-04T18:32:17Z", "content": "A blazing fireball flew Sunday night across the Mid-Atlantic region of the United States, dazzling hundreds of eyewitnesses who reported the sighting to the American Meteor Society.\r\nIt's likely the … [+2257 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Oldest Human Ancestors May Have Evolved Nine Million Years Ago in Turkey - Ancient Origins", "description": "Modern humans first left Africa and migrated to Eurasia between 60,000 and 100,000 years ago. But a fossilized skeleton with surprisingly human-like characteristics found in central Turkey suggests that ancient human ancestors of Homo sapiens journeyed in the…", "url": "https://www.ancient-origins.net/news-evolution-human-origins/human-ancestors-asia-0019217", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Human-ancestors-Asia.jpg", "publishedAt": "2023-09-04T17:42:27Z", "content": "Modern humans first left Africa and migrated to Eurasia between 60,000 and 100,000 years ago . But a fossilized skeleton with surprisingly human-like characteristics found in central Turkey suggests … [+7237 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "ESA to set target for first Ariane 6 launch after upcoming tests - SpaceNews", "description": "ESA plans to set a target launch period for the first Ariane 6 in October, with the hopes that vehicle can finally take flight “not too late” into 2024.", "url": "https://spacenews.com/esa-to-set-target-for-first-ariane-6-launch-after-upcoming-tests/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/09/a6-vinci-hotfire.jpg", "publishedAt": "2023-09-04T17:23:43Z", "content": "WASHINGTON The European Space Agency plans to set a target launch period for the first Ariane 6 in October, with the hopes that vehicle can finally take flight not too late into 2024.\r\nAt a Sept. 4 b… [+5142 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "I Challenged Space YouTubers To Pick James Webb's Best Image [feat.@joescott and @whatdamath] - Fraser Cain", "description": "Which JWST image is the best so far? To answer that, we did a series of polls among our community with a quarter-final round, semi-final and the final. Can m...", "url": "https://www.youtube.com/watch?v=96POynVOcWc", "urlToImage": "https://i.ytimg.com/vi/96POynVOcWc/maxresdefault.jpg", "publishedAt": "2023-09-04T17:02:51Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Seismic Secrets: Researchers Unearth the Mysteries of How Turkey's East Anatolian Fault Formed - SciTechDaily", "description": "A University of Minnesota professor heads an international group of geoscientists investigating earthquake-impacted regions. An international team led by the University of Minnesota Twin Cities has successfully determined the age and formation process of the …", "url": "https://scitechdaily.com/unlocking-seismic-secrets-researchers-unearth-the-mysteries-of-how-turkeys-east-anatolian-fault-formed/", "urlToImage": "https://scitechdaily.com/images/East-Anatolian-Fault-Zone-Satellite-Image.jpg", "publishedAt": "2023-09-04T17:02:50Z", "content": "The East Anatolian fault zone was the site of two devastating earthquakes that occurred in Turkey and Syria in February 2023. While the University of Minnesota-led teams findings wont help predict ti… [+4897 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Chandrayaan-3 rover and lander in sleep mode but might wake up later this month - Space.com", "description": "The two vehicles have completed their primary mission goals.", "url": "https://www.space.com/chandrayaan-3-rover-lander-sleep-mode", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tFk3GajhFRKryJYHJ7EekA-1200-80.jpg", "publishedAt": "2023-09-04T16:47:56Z", "content": "India's Chandrayaan-3 lunar rover and lander have completed their primary mission goals and are now preparing for the upcoming two-week lunar night. The Indian Space Research Organization (ISRO) hope… [+3256 chars]"}, {"source": {"id": null, "name": "WFLA"}, "author": "Nathaniel Rodriguez", "title": "What was the ‘fireball’ flying through the Florida sky last night? - WFLA", "description": "Floridians who happened to be out early Monday morning caught a glimpse of a fiery streak going across the moonlight sky.", "url": "https://www.wfla.com/glance-at-the-galaxy/what-was-the-fireball-flying-through-the-florida-sky-last-night/", "urlToImage": "https://www.wfla.com/wp-content/uploads/sites/71/2023/09/thumbnail_IMG_3002-e1693843188749.jpg?w=1280", "publishedAt": "2023-09-04T16:16:59Z", "content": "TAMPA, Fla. (WFLA) Floridians who happened to be out early Monday morning caught a glimpse of a fiery streak going across the moonlight sky.\r\nOne witness in Zephyrhills described it as a “fireball” t… [+1632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beyond 5,500 Worlds: A Sextet of New Exoplanets Sends Discovery Milestone Skyward - SciTechDaily", "description": "Scientists have discovered six new exoplanets, taking the total to 5,502. With advancements in technology, the field of exoplanet research has grown exponentially since the first discovery in 1992, and upcoming instruments promise even deeper insights. On Aug…", "url": "https://scitechdaily.com/beyond-5500-worlds-a-sextet-of-new-exoplanets-sends-discovery-milestone-skyward/", "urlToImage": "https://scitechdaily.com/images/5500-Exoplanets.jpg", "publishedAt": "2023-09-04T16:12:32Z", "content": "ByChelsea Gohd, NASA's Exoplanet Exploration ProgramSeptember 4, 2023\r\nNASAs Exoplanet Archive confirmed four new worlds, bringing the total past 5,500. Credit: NASA/JPL-Caltech\r\nScientists have disc… [+13660 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Scientists manipulate quantum mechanics to slow down a chemical reaction by 100 billion times - Livescience.com", "description": "Using a quantum device, researchers have observed, for the first time, a molecular process called conical intersection that is important in reactions such as photosynthesis.", "url": "https://www.livescience.com/chemistry/scientists-manipulate-quantum-mechanics-to-slow-down-a-chemical-reaction-by-100-billion-times", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EDsnFXXAYgTnFvPkwCYQkU-1200-80.jpeg", "publishedAt": "2023-09-04T16:00:00Z", "content": "For the first time, scientists have directly observed a molecular dance that's crucial to basic chemical reactions such as photosynthesis\r\n. And they've done it by using a quantum computer to slow do… [+2250 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Pioneering Genetics Research: Male Sex Chromosome Finally Deciphered - SciTechDaily", "description": "A global team of scientists has fully sequenced the Y chromosome, enhancing our understanding of male development, fertility, and genetically-linked diseases. The chromosome associated with male development, which is the last mysterious piece of the human gen…", "url": "https://scitechdaily.com/pioneering-genetics-research-male-sex-chromosome-finally-deciphered/", "urlToImage": "https://scitechdaily.com/images/Human-Chromosome-Sequence-Art.jpg", "publishedAt": "2023-09-04T15:22:30Z", "content": "ByJohns Hopkins UniversitySeptember 4, 2023\r\nResearchers, including those from Johns Hopkins University, have successfully sequenced the Y chromosome, which is linked to male development. This breakt… [+6064 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Women's Health"}, "author": null, "title": "Zone 2 Cardio: Examples And Benefits, Explained By A Trainer - Women's Health", "description": "The technique may feel easy, but it comes with huge payoffs.", "url": "https://www.womenshealthmag.com/fitness/a44868963/zone-2-cardio/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/woman-exercising-on-spin-bike-in-home-royalty-free-image-1692639459.jpg?crop=1.00xw:0.669xh;0,0.141xh&resize=1200:*", "publishedAt": "2023-09-04T14:06:48Z", "content": "When youre \r\nrollerblading across a busy park, hiking through a hilly forest, or power-walking down the street with your squirrel-chasing pup, youll likely notice your heart thumping quicker than usu… [+9934 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Chinese scientist proposes solar system-wide resource utilization roadmap - SpaceNews", "description": "Chinese scientist proposes solar system-wide resource utilization roadmap Chinese space scientists have outlined a tentative roadmap for establishing a space resources utilization network stretching into the outer reaches of the solar system.", "url": "https://spacenews.com/chinese-scientist-proposes-solar-system-wide-resource-utilization-roadmap/", "urlToImage": "https://spacenews.com/wp-content/uploads/2016/08/Juno-view-of-Jupiter-2016-08-27.jpg", "publishedAt": "2023-09-04T14:05:11Z", "content": "HELSINKI Chinese space scientists have outlined a tentative roadmap for establishing a space resources utilization network stretching into the outer reaches of the solar system.\r\nWang Wei, a scientis… [+3864 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists make the first observation of a nucleus decaying into four particles after beta decay - Phys.org", "description": "Not all of the material around us is stable. Some materials may undergo radioactive decay to form more stable isotopes. Scientists have now observed a new decay mode for the first time. In this decay, a lighter form of oxygen, oxygen-13 (with eight protons an…", "url": "https://phys.org/news/2023-09-scientists-nucleus-decaying-particles-beta.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/scientists-make-the-fi.jpg", "publishedAt": "2023-09-04T14:03:09Z", "content": "Not all of the material around us is stable. Some materials may undergo radioactive decay to form more stable isotopes. Scientists have now observed a new decay mode for the first time. In this decay… [+2799 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Robert Lea", "title": "Up to half black holes that rip apart stars and devour them 'burp back up' stellar remains years later - Livescience.com", "description": "Years after ripping stars to shreds, 24 black holes suddenly flared up with radio waves in inexplicable 'burping' bouts. Half of all star-killing black holes may experience the same.", "url": "https://www.livescience.com/space/black-holes/up-to-half-of-black-holes-that-rip-apart-stars-burp-back-up-stellar-remains-years-later", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dW8WUHZjKY6aT3eQ7dA6WF-1200-80.jpg", "publishedAt": "2023-09-04T14:00:00Z", "content": "Up to half of the black holes that devour stars \"burp up\" their stellar remains years later.\r\nAstronomers made the discovery after spending years watching black holes involved in tidal disruption eve… [+3340 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Renay San Miguel", "title": "Physicists solve mysteries of microtubule movers - Phys.org", "description": "Active matter is any collection of materials or systems composed of individual units that can move on their own, thanks to self-propulsion or autonomous motion. They can be of any size—think clouds of bacteria in a petri dish, or schools of fish.", "url": "https://phys.org/news/2023-09-physicists-mysteries-microtubule-movers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/physicists-solve-myste.jpg", "publishedAt": "2023-09-04T13:49:30Z", "content": "Active matter is any collection of materials or systems composed of individual units that can move on their own, thanks to self-propulsion or autonomous motion. They can be of any sizethink clouds of… [+6545 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tara Suter", "title": "SpaceX Dragon returns astronauts home after months on space station - The Hill", "description": "An international crew of astronauts returned home in a SpaceX Dragon spacecraft Monday morning. The astronauts, known as “Crew-6,” splashed down off the coast of Jacksonville, Fla., after a mission to the International Space Station, according to NASA’s websi…", "url": "https://thehill.com/homenews/space/4186141-spacex-dragon-returns-nasa-astronauts-space-station/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/09/AP23244638559057-e1693835192383.jpg?w=1280", "publishedAt": "2023-09-04T13:46:00Z", "content": "Skip to content\r\nAn international crew of astronauts returned home in a SpaceX Dragon spacecraft Monday morning.\r\nThe astronauts, known as “Crew-6,” splashed down off the coast of Jacksonville, Fla.,… [+1315 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space's Silent Threat: Scientists Shed New Light on “Killer Electrons” - SciTechDaily", "description": "High-energy ‘relativistic’ electrons, often called “killer” electrons, are a major source of radiation damage to satellites so understanding their patterns of activity is crucial. Solar emissions of charged particles and magnetic fields can disrupt Earth's ma…", "url": "https://scitechdaily.com/spaces-silent-threat-scientists-shed-new-light-on-killer-electrons/", "urlToImage": "https://scitechdaily.com/images/Satellite-Reentry-Burning-in-Atmosphere.jpg", "publishedAt": "2023-09-04T12:58:38Z", "content": "ByBritish Antarctic SurveySeptember 4, 2023\r\nA new study reveals the escalating threat of killer electrons during geomagnetic storms, urging for fortified satellite infrastructure to mitigate potenti… [+4532 chars]"}, {"source": {"id": null, "name": "Wtaj.com"}, "author": "Bill Shannon", "title": "What are the bright lights over Central Pennsylvania? - WTAJ - www.wtaj.com", "description": "PENNSYLVANIA (WTAJ) — A string of lights high in the Pennsylvania skies is giving people some “X-Files” feelings, but rest assured, it’s not aliens — Sorry Agent Mulder. The lights have been spotted all over Pennsylvania this Labor Day weekend, starting with …", "url": "https://www.wtaj.com/news/local-news/what-are-the-bright-lights-over-central-pennsylvania/", "urlToImage": "https://www.wtaj.com/wp-content/uploads/sites/69/2023/09/Starlink-over-Curwensville-feat.-img.png?w=1280", "publishedAt": "2023-09-04T12:43:02Z", "content": "PENNSYLVANIA (WTAJ) — A string of lights high in the Pennsylvania skies is giving people some “X-Files” feelings, but rest assured, it’s not aliens — Sorry Agent Mulder. \r\nThe lights have been spotte… [+1764 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Canterbury: Scientists search cathedral roof for cosmic dust - BBC", "description": "The inaccessibility of Canterbury Cathedral roof could make it the good place to find space matter.", "url": "https://www.bbc.com/news/uk-england-kent-66707859", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/152A/production/_130981450_canterburycathedralfromground.jpg", "publishedAt": "2023-09-04T12:41:29Z", "content": "Scientists are taking to the roof of Canterbury Cathedral to search for matter from space.\r\nMembers of the School of Physics and Astronomy from the University of Kent are hoping to find micrometeorit… [+1270 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "There Might Be An \"Earth-Sized Planet\" Hiding In The Solar System - IFLScience", "description": "Two astrophysicists have an explanation for strange movements of objects in the Kuiper Belt.", "url": "https://www.iflscience.com/there-might-be-an-earth-sized-planet-hiding-in-the-solar-system-70527", "urlToImage": "https://assets.iflscience.com/assets/articleNo/70527/aImg/70436/kuiper-belt-planet-meta.png", "publishedAt": "2023-09-04T12:35:13Z", "content": "There may be an undiscovered Earth-like planet lurking within the solar system, according to a team of astronomers looking at the movement of objects in the Kuiper Belt. \r\nFinding planets is no simpl… [+2411 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "The Moon is slowly drifting away from Earth and it's beginning to impact us - indy100", "description": "The Moon is a constant in the night sky, but all is not actually as it seems. It turns out that scientists have discovered the Moon is drifting away from Earth, and it’s changing everything we thought we knew about our planet’s relationship with its only natu…", "url": "https://www.indy100.com/science-tech/moon-drifting-away-earth-impact", "urlToImage": "https://www.indy100.com/media-library/last-super-blue-moon-until-2037-lights-up-skies-in-beijing-china.jpg?id=36334470&width=1200&height=600&coordinates=0%2C72%2C0%2C73", "publishedAt": "2023-09-04T12:11:17Z", "content": "The Moon is a constant in the night sky, but all is not actually as it seems. \r\nIt turns out that scientists have discovered the Moon is drifting away from Earth, and its changing everything we thoug… [+1726 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Galaxy shapes can help identify wrinkles in space caused by the Big Bang - Space.com", "description": "The new way could also help in better mapping of the universe, scientists say.", "url": "https://www.space.com/galactic-geometry-big-bang-wrinkles-baos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DSfvjPKbQvL7tvGghPZ3a4-1200-80.jpg", "publishedAt": "2023-09-04T12:00:01Z", "content": "Astronomers have found a new way to detect one of the oldest features of our universe.\r\nThese Baryon Acoustic Oscillations, or BAO, are subtle wrinkles that flowed through cosmic matter during the fi… [+3012 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "ISRO gets more out of Chandrayaan-3 mission as Vikram lander hops and lands again safely - Times of India", "description": "The Chandrayaan-3 lander Vikram has achieved another significant milestone. The lander has successfully performed a hop experiment, whereby on ISRO’s command, it jumped to a height of 40 cm and landed safely 30-40 centimetres away. This is something", "url": "https://timesofindia.indiatimes.com/videos/toi-original/isro-gets-more-out-of-chandrayaan-3-mission-as-vikram-lander-hops-and-lands-again-safely/videoshow/103358976.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-103358976,imgsize-608177.cms", "publishedAt": "2023-09-04T11:19:40Z", "content": "Sep 04, 2023, 04:49PM ISTSource: TOI.inThe Chandrayaan-3 lander Vikram has achieved another significant milestone. The lander has successfully performed a hop experiment, whereby on ISROs command, it… [+272 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "China discovers 'hidden structures' deep beneath the dark side of the moon - indy100", "description": "Scientists have just uncovered billions of years’ worth of secrets buried beneath the surface of the moon.Our celestial companion has been a source of awe and mystery since time immemorial, but now, thanks to China’s space programme, we’re starting to piece t…", "url": "https://www.indy100.com/science-tech/china-moon-discovery-hidden-structures-2664885294", "urlToImage": "https://www.indy100.com/media-library/sturgeon-moon-in-the-sky-above-chicago-il-usa.jpg?id=34979122&width=1200&height=600&coordinates=0%2C150%2C0%2C424", "publishedAt": "2023-09-04T11:11:53Z", "content": "Scientists have just uncovered billions of years worth of secrets buried beneath the surface of the moon.\r\nOur celestial companion has been a source of awe and mystery since time immemorial, but now,… [+2724 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Shatters the Myth of Men As Hunters and Women As Gatherers - SciTechDaily", "description": "Data from foraging societies around the world indicates that women often hunt large game skillfully. Analysis of data from dozens of foraging societies around the world demonstrates that in at least 79 percent of these groups, women partake in hunting. This c…", "url": "https://scitechdaily.com/new-research-shatters-the-myth-of-men-as-hunters-and-women-as-gatherers/", "urlToImage": "https://scitechdaily.com/images/Prehistoric-Woman-Hunting-Spear.jpg", "publishedAt": "2023-09-04T10:27:33Z", "content": "New research contradicts the common belief that in foraging societies, only men hunt and women gather, revealing that women actively hunt in 79% of these societies, utilizing diverse strategies and e… [+3005 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "See the moon meet up with Jupiter on Sept. 4. - Space.com", "description": "The moon will meet up with Jupiter tonight, making a close approach to the solar system's largest planet in the night sky.", "url": "https://www.space.com/moon-jupiter-conjunction-september-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/46CZqzitLnnVo2VL8ZAu55-1200-80.jpg", "publishedAt": "2023-09-04T10:00:13Z", "content": "The moon will meet up with Jupiter tonight, making a close approach to the solar system's largest planet in the night sky. \r\nFrom New York City, the 19-day-old moon and Jupiter will be visible from s… [+3564 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Faster Than Can Be Explained – Photonic Time Crystals Could Revolutionize Optics - SciTechDaily", "description": "A recent study reveals oscillations in the refractive index that are faster than can be explained by current theories. A study recently published in the journal Nanophotonics reveals that by rapidly modulating the refractive index - which is the ratio of the …", "url": "https://scitechdaily.com/faster-than-can-be-explained-photonic-time-crystals-could-revolutionize-optics/", "urlToImage": "https://scitechdaily.com/images/Abstract-Time-Crystal-Concept.gif", "publishedAt": "2023-09-04T09:17:11Z", "content": "Researchers have produced photonic time crystals in the near-visible spectrum, potentially revolutionizing light science applications. This breakthrough expands the previously understood range of PTC… [+3333 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Mysterious Species of Marine Bacteria Discovered Deep in The Ocean - ScienceAlert", "description": "In sediment samples from deep within the ocean, scientists have identified a mysterious and unique new species of marine bacteria that advances our understanding of deep-sea conditions and microbiology in general.", "url": "https://www.sciencealert.com/mysterious-species-of-marine-bacteria-discovered-deep-in-the-ocean", "urlToImage": "https://www.sciencealert.com/images/2023/08/BacteriaFind.jpg", "publishedAt": "2023-09-04T09:01:19Z", "content": "In sediment samples from deep within the ocean, scientists have identified a mysterious and unique new species of marine bacteria that advances our understanding of deep-sea conditions and microbiolo… [+2619 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Spectacular Meteor Streaks Across Night Sky In Turkey, Turns It Green - NDTV", "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News", "url": "https://www.ndtv.com/news", "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png", "publishedAt": "2023-09-04T06:59:49Z", "content": ""}, {"source": {"id": null, "name": "Florida Today"}, "author": "Jamie Groh", "title": "Sunday's Starlink mission sets record-breaking launch pace for SpaceX - Florida Today", "description": "Sunday's Starlink launch from the Space Coast marked a record-breaker in launch pace for SpaceX.", "url": "https://www.floridatoday.com/story/tech/science/space/2023/09/03/sunday-falcon-9-starlink-mission-sets-record-breaking-rocket-launch-pace-spacex/70717303007/", "urlToImage": "https://www.floridatoday.com/gcdn/authoring/authoring-images/2023/09/04/PBRE/70759745007-crb-090323-spacex-4.jpg?crop=2016,1140,x0,y106&width=2016&height=1140&format=pjpg&auto=webp", "publishedAt": "2023-09-04T03:46:35Z", "content": "A SpaceX Falcon 9 rocket blasted off a Florida launch pad late Sunday night, taking another batch of the company's Starlink internet satellites along a southern trajectory that skirted along the stat… [+3110 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "G2 geomagnetic storm hits Earth, sparks auroras in the US - HT Tech", "description": "National Oceanic and Atmospheric Administration (NOAA) predicted a few days ago that a CME was on course for Earth, and could hit the planet on September 2. This event has now taken place and it made for an amazing viewing in parts of the US.", "url": "https://tech.hindustantimes.com/tech/news/g2-geomagnetic-storm-hits-earth-sparks-auroras-in-the-us-71693795509162.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/vincent-guth-62V7ntlKgL8-unsplash_1693795905432_1693795911852.jpg", "publishedAt": "2023-09-04T02:53:46Z", "content": "Over the last few months, we have witnessed several solar storm and geomagnetic storm impacts, and their frequency is likely to increase even more as we approach the solar maximum which could arrive … [+2165 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dazzling auroras delight social media as solar storm strikes Earth - HT Tech", "description": "A dazzling Northern Lights show lit up the sky due to an unexpected solar storm, surprising skygazers and electrifying social media.", "url": "https://tech.hindustantimes.com/tech/news/dazzling-auroras-delight-social-media-as-solar-storm-strikes-earth-71693795107161.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/Solar_Storm_1693795301579_1693795301852.jpg", "publishedAt": "2023-09-04T02:43:12Z", "content": "A spectacular northern lights show lit up the sky early on Sunday morning, delighting people and filling social media with stunning pictures. This amazing display was caused by a solar storm that was… [+1696 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Super, Blue and Blood: A Guide to Different Full Moons - VOA Learning English", "description": "Sky watchers around the world were treated this month to two full moons, a supermoon and a blue moon. Today, we’re taking a look at some different kinds of full moons and how often we can expect to see them.", "url": "https://learningenglish.voanews.com/a/super-blue-and-blood-a-guide-to-different-full-moons/7250151.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-d34a-08dbaa956c6f_cx0_cy9_cw0_w1200_r1.jpg", "publishedAt": "2023-09-03T22:01:25Z", "content": "Sky watchers around the world were treated this month to two full moons, a supermoon and a blue moon.\r\nThe American space agency NASA explains a supermoon happens when the moons orbit brings it close… [+3593 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "ESA's Planetary Defense Mission: Hera Asteroid Spacecraft Is Complete - SciTechDaily", "description": "ESA's asteroid defense mission, Hera, has been successfully assembled at OHB Bremen in Germany. Hera is complete. ESA’s asteroid mission for planetary defense was built and prepared in two halves, but now, through a painstaking operation, they have been mated…", "url": "https://scitechdaily.com/esas-planetary-defense-mission-hera-asteroid-spacecraft-is-complete/", "urlToImage": "https://scitechdaily.com/images/Hera-Mission-Family-Portrait-scaled.jpg", "publishedAt": "2023-09-03T21:11:27Z", "content": "ESAs Hera mission has been fully assembled in Germany and is set to study the Dimorphos and Didymos asteroids. It will soon undergo rigorous testing in the Netherlands to ensure space readiness. Cred… [+6093 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Neil Saintilan", "title": "After studying more than 1,500 coastal ecosystems, researchers say they will drown if we let the world warm above 2C - Phys.org", "description": "Much of the world's natural coastline is protected by living habitats, most notably mangroves in warmer waters and tidal marshes closer to the poles. These ecosystems support fisheries and wildlife, absorb the impact of crashing waves and clean up pollutants.…", "url": "https://phys.org/news/2023-08-coastal-ecosystems-world-2c.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/we-studied-more-than-1.jpg", "publishedAt": "2023-09-03T17:40:02Z", "content": "Much of the world's natural coastline is protected by living habitats, most notably mangroves in warmer waters and tidal marshes closer to the poles. These ecosystems support fisheries and wildlife, … [+5159 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "Sébastian SEIBT", "title": "Human ancestors were near extinction some 900,000 years ago, says study - FRANCE 24 English", "description": "A study published on Thursday claims that human ancestors teetered on the brink of extinction over 900,000 years ago. Based on a new method of analysis, scientists found that our ancestors survived in a group of less than 1,300 individuals.", "url": "https://www.france24.com/en/science/20230903-human-ancestors-were-near-extinction-some-900-000-years-ago-says-study", "urlToImage": "https://s.france24.com/media/display/27b0abc0-48dd-11ee-876f-005056bfb2b6/w:1280/p:16x9/010923-homo-sapiens-m.jpg", "publishedAt": "2023-09-03T17:06:31Z", "content": "A study published on Thursday claims that human ancestors teetered on the brink of extinction over 900,000 years ago. Based on a new method of analysis, scientists found that our ancestors survived i… [+5437 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Space research says you shouldn't use your phone before sleep - Interesting Engineering", "description": "Two ESA studies conducted in the International Space Station are offering solutions for better sleep on space and here on earth.", "url": "https://interestingengineering.com/health/space-research-says-you-shouldnt-use-your-phone-before-sleep", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/03/image/jpeg/cBz8bDhli5tYiw698TzYMhtqK7dCfylhxNtnhp3W.jpg", "publishedAt": "2023-09-03T16:59:00Z", "content": "An in-ear measuring device to track brain activity\r\nFor the sleeping in orbit study, Mogensen is making use of an in-ear measuring device that tracks the electroencephalogram (EEG) of his brain. The … [+1325 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 81 bulldogs to pass Earth on Wednesday - NASA - The Jerusalem Post", "description": "Asteroid 2021 JA5 is around the size of 81 bulldogs, the symbol of the college football team of the University of Georgia. But it won't hit us – hopefully the Bulldog team will have better luck.", "url": "https://www.jpost.com/science/space/article-757419", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/540072", "publishedAt": "2023-09-03T16:56:00Z", "content": "An asteroid the size of 81 bulldogs is set to zip past the Earth on Wednesday, September 6, according to NASA's asteroid tracker.\r\nThe asteroid in question has been dubbed 2021 JA5, as stated by the … [+2936 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of Climate Evolution: The Tipping Points That Changed Earth Forever - SciTechDaily", "description": "Over the past 66 million years, two major climate events have shaped the climate system, dividing the period into two distinct climate eras. An analysis of the hierarchy of tipping points indicates that over the past 66 million years, two significant occurren…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-climate-evolution-the-tipping-points-that-changed-earth-forever/", "urlToImage": "https://scitechdaily.com/images/Earth-Weather-Climate-Change.gif", "publishedAt": "2023-09-03T16:21:53Z", "content": "ByUniversity of Copenhagen - Faculty of ScienceSeptember 3, 2023\r\nA new study uses the theory of punctuated equilibrium to analyze the hierarchy of climate tipping points, identifying two major event… [+6271 chars]"}, {"source": {"id": null, "name": "Fort Worth Star-Telegram"}, "author": "Mitchell Willetts", "title": "Dinosaur tracks revealed as river dries at drought-stricken Texas park, photos show - Fort Worth Star-Telegram", "description": "Drought conditions have uncovered dinosaur tracks previously hidden under water at Dinosaur Valley State Park in Texas, photos show.", "url": "https://www.star-telegram.com/news/state/texas/article278926029.html", "urlToImage": "https://www.star-telegram.com/news/nation-world/national/u4qgev/picture278926094/alternates/LANDSCAPE_1140/tracksha_fitted.jpeg", "publishedAt": "2023-09-03T15:58:18Z", "content": "Drought and intense heat have unearthed dozens of dinosaur tracks normally hidden under murky water and mud at a Texas park, photos show.\r\nPaul Baker, retail manager at Dinosaur Valley State Park, ha… [+2169 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Keyhole: Webb Reveals Breathtaking New Structures Within Iconic Supernova - SciTechDaily", "description": "Small crescent-like structures come into clear view. NASA’s James Webb Space Telescope has uncovered new details in Supernova 1987A with its NIRCam (Near-Infrared Camera) instrument. Structures, some only visible in infrared wavelengths, provide clues into th…", "url": "https://scitechdaily.com/cosmic-keyhole-webb-reveals-breathtaking-new-structures-within-iconic-supernova/", "urlToImage": "https://scitechdaily.com/images/Supernova-1987A-Webb-NIRCam-Image.jpg", "publishedAt": "2023-09-03T15:13:25Z", "content": "BySpace Telescope Science InstituteSeptember 3, 2023\r\nWebbs NIRCam (Near-Infrared Camera) captured this detailed image of SN 1987A (Supernova 1987A) with unprecedented clarity, revealing new structur… [+9839 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "The Closest Supernova Seen in the Modern Era, Examined by JWST - Universe Today", "description": "In 1987, a supernova suddenly appeared in the Large Magellanic Cloud and was studied by astronomers worldwide. Although the detonating star was 165,000 light-years away, this was still the closest supernova seen in centuries. Astronomers have continued to stu…", "url": "https://www.universetoday.com/163016/the-closest-supernova-seen-in-the-modern-era-examined-by-jwst/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/09/sn1987a.jpg", "publishedAt": "2023-09-03T14:40:02Z", "content": "In November of 1572, Tycho Brahe noticed a new star in the constellation Cassiopeia. It was the first supernova to be observed in detail by Western astronomers and became known as Tycho’s Supernova. … [+2973 chars]"}, {"source": {"id": null, "name": "Pethelpful.com"}, "author": "Eve Vawter", "title": "Golden Retriever with Dementia Going on Enrichment Walks Is Breaking Hearts - Yahoo Life", "description": "Nigh Time walks are supposed to help this sweet dog with dementia.", "url": "https://pethelpful.com/pet-news/golden-retriever-dementia-enrichment-walks", "urlToImage": "https://media.zenfs.com/en/pethelpful_915/bdeeab793418e7d7c7d2ef09c4b7c24c", "publishedAt": "2023-09-03T14:20:00Z", "content": "We all love and treasure our beloved fur friends, no matter how old they get. With age can sometimes come the condition known as dog dementia, and one couple who is sharing the challenges of having a… [+1830 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: SpaceX Crew-7 Mission Launches, Storm From Space, Lunar Exploration - SciTechDaily", "description": "A new crew heads to the space station … A major storm spotted from space … And a robotic spacecraft enabling human missions to the Moon … A few of the stories to tell you about – This Week at NASA! https://youtu.be/sSdsYsu4uyc NASA’s SpaceX Crew-7 Mission Lau…", "url": "https://scitechdaily.com/this-week-nasa-spacex-crew-7-mission-launches-storm-from-space-lunar-exploration/", "urlToImage": "https://scitechdaily.com/images/Artemis-Astronaut-on-Moon-scaled.jpg", "publishedAt": "2023-09-03T14:02:42Z", "content": "ByNASASeptember 3, 2023\r\nDuring a recent training session for the Artemis II astronauts, data from NASAs Lunar Reconnaissance Orbiter (LRO) was utilized to acquaint them with the lunar views theyll e… [+4778 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "NASA spots new Moon crater, likely caused by crashed Russian probe - Phys.org", "description": "NASA has spotted a small new crater on the Moon that was likely caused by a Russian probe crash landing on the surface around two weeks ago.", "url": "https://phys.org/news/2023-09-nasa-moon-crater-russian-probe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/nasas-lunar-reconnaiss.jpg", "publishedAt": "2023-09-03T13:40:45Z", "content": "NASA has spotted a small new crater on the Moon that was likely caused by a Russian probe crash landing on the surface around two weeks ago.\r\nThe finding was made by the Lunar Reconnaissance Orbiter … [+1852 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Penn State scientists unlock the key to clean energy storage - Interesting Engineering", "description": "\"It took us six years of measuring and re-measuring.\" Efforts by a research team at Penn State have finally paid off in quantifying hydrogen spillover.", "url": "https://interestingengineering.com/science/penn-state-scientists-unlock-the-key-to-clean-energy-storage", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/03/image/jpeg/jrAURPb6O5UropfxqYC4CgZpWbxLBlVWZCoTDbiO.jpg", "publishedAt": "2023-09-03T13:27:00Z", "content": "What sets this research apart is the role of entropy, which plays a crucial part in driving the atoms from the metal to the substrate. Unlike previous assumptions that thermal energy was the primary … [+1387 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "'Alice Ring' magnetic monopoles observed for the first time - Interesting Engineering", "description": "Named after the famous novel \"Alive in Wonderland,\" a strange kind of circular magnetic monopole, called \"Alice Rings\" have now been observed.", "url": "https://interestingengineering.com/science/alice-rings-for-the-first-time", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/03/image/jpeg/5Ckmf0xpgOE60CvIYZ3zcXM2FF33pcOJb2NSKM1L.jpg", "publishedAt": "2023-09-03T13:04:00Z", "content": "\"Alice Rings,\" the researchers explain, are linked to monopoles, which transform into one-sided magnetic poles when they form loops. However, \"Alice Rings\" have a longer lifespan than typical monopol… [+1302 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling the Magnetic Mysteries of Black Holes: How Does “MAD” Accretion Form Around a Black Hole? - SciTechDaily", "description": "For the first time, a global team of scientists has uncovered the magnetic field transport processes in the accretion flow of a black hole, as well as the creation of a magnetically arrested disk, or \"MAD,\" near the black hole. This breakthrough came from mul…", "url": "https://scitechdaily.com/unveiling-the-magnetic-mysteries-of-black-holes-how-does-mad-accretion-form-around-a-black-hole/", "urlToImage": "https://scitechdaily.com/images/An-Illustration-of-the-Black-Hole-X-Ray-Binary-MAXI-J1820070-With-a-Magnetically-Arrested-Disk-Formed-Around-the-Black-Hole-scaled.jpg", "publishedAt": "2023-09-03T12:43:46Z", "content": "ByChinese Academy of Sciences HeadquartersSeptember 3, 2023\r\nAn illustration of the black hole X-ray binary MAXI J1820+070 with a magnetically arrested disk formed around the black hole. Credit: You … [+7282 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "Ancient Mud in Mississippi Reveals Dramatic Saga of Antarctic Ice - ScienceAlert", "description": "Mud cores drilled in Mississippi hold long-hidden clues about the origins of gigantic Antarctic ice sheets around 34 million years ago, new research shows.", "url": "https://www.sciencealert.com/ancient-mud-in-mississippi-reveals-dramatic-saga-of-antarctic-ice", "urlToImage": "https://www.sciencealert.com/images/2019-01/processed/017-antarctica_1024.jpg", "publishedAt": "2023-09-03T12:31:18Z", "content": "Mud cores drilled in Mississippi hold long-hidden clues about the origins of gigantic Antarctic ice sheets around 34 million years ago, new research shows.\r\nEarth was in the midst of a major transiti… [+4115 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Comprehensive New Amphibian Family Tree Revises Frog Evolution Timeline - SciTechDaily", "description": "Most detailed and comprehensive family tree to date of frogs created using molecular data. Researchers, including Jeff Streicher, Senior Curator in Charge, Amphibians and Reptiles at the Natural History Museum, London, have unveiled the most extensive evoluti…", "url": "https://scitechdaily.com/comprehensive-new-amphibian-family-tree-revises-frog-evolution-timeline/", "urlToImage": "https://scitechdaily.com/images/Vietnamese-Mossy-Frog-Theloderma-corticale.jpg", "publishedAt": "2023-09-03T11:53:22Z", "content": "ByThe Natural History MuseumSeptember 3, 2023\r\nA groundbreaking study presents the most exhaustive frog evolutionary tree, spanning 5,242 species. The research proposes a revised timeline for frog ev… [+4302 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Taking out the trash: Here's how private companies could be vital for space debris removal - Space.com", "description": "To keep a watchful, more-informed eye on orbital debris, much better approaches are needed.", "url": "https://www.space.com/space-debris-taking-out-the-trash", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ojG3vXhs8ezHBS6WChrDV6-1200-80.jpg", "publishedAt": "2023-09-03T11:28:51Z", "content": "There's no doubt about it. Earth orbit is a messy place. \r\nBut is there a business in removing space junk from Earth orbit? Around the world, private companies and national space agencies alike are c… [+9643 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "NASA to test space laser communications system - The Washington Post", "description": "NASA says the refrigerator-sized relay will allow astronauts on the International Space Station to send high-resolution data, including images and video.", "url": "https://www.washingtonpost.com/science/2023/09/03/nasa-laser-communications-space-station/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RHJ2WXDF24NA3YDVDPQQA5CSDQ.jpg&w=1440", "publishedAt": "2023-09-03T10:32:36Z", "content": "Comment on this story\r\nComment\r\nSpacecraft typically use radio-based communication systems to talk to Earth. But in the future, lasers may become part of astronauts communications arsenal.\r\nLate last… [+2402 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "'Unusual' Exoplanet Seems to Have Shrunk, And We Don't Know How - ScienceAlert", "description": "A newly discovered exoplanet has presented astronomers with an interesting problem.", "url": "https://www.sciencealert.com/unusual-exoplanet-seems-to-have-shrunk-and-we-dont-know-how", "urlToImage": "https://www.sciencealert.com/images/2023/08/hot-neptune-header.jpg", "publishedAt": "2023-09-03T10:01:14Z", "content": "A newly discovered exoplanet has presented astronomers with an interesting problem.\r\nIt's called TOI-332b, and its physical properties and orbital distance from its star are challenging to explain wi… [+3999 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "daniel.hani@sprylab.com", "title": "Scientists are racing to conceive the first baby in space. Here's why - BBC Science Focus Magazine", "description": "if we’re going to colonise space, we need to talk about reproduction in low gravity.", "url": "https://www.sciencefocus.com/space-babies-reproduction", "urlToImage": "https://c02.purpledshub.com/uploads/sites/41/2023/09/space-baby-floating.jpg", "publishedAt": "2023-09-03T09:05:20Z", "content": "Everyone, it seems, is fixated on space exploration right now. NASA, in collaboration with the Canadian, Japanese and European space agencies, is working on the Gateway programme to build a human-ten… [+6393 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Puzzles: Unraveling the Cosmic Origins of Life in the Lab - SciTechDaily", "description": "Scientists are pushing to understand life's chemical origins and potential development in cosmic environments, investigating scenarios like hydrothermal vents, meteorites, potential exotic life on Saturn's moon, and lab-based Darwinian evolution. Research inv…", "url": "https://scitechdaily.com/primordial-puzzles-unraveling-the-cosmic-origins-of-life-in-the-lab/", "urlToImage": "https://scitechdaily.com/images/Life-in-Lab-Art-Concept.jpg", "publishedAt": "2023-09-03T08:13:21Z", "content": "ByPat Brennan, NASA's Exoplanet Exploration ProgramSeptember 3, 2023\r\nNASA scientists, along with a global team, are pushing the boundaries to understand how life might originate and evolve in divers… [+20166 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Atmospheric Revelations: New Research Reveals Earth's Ancient “Breath” - SciTechDaily", "description": "Researchers have identified a link between ancient atmospheric shifts and Earth's mantle chemistry, shedding light on the planet's evolution. An international team of scientists has uncovered an important link between Earth’s early atmosphere and the chemistr…", "url": "https://scitechdaily.com/atmospheric-revelations-new-research-reveals-earths-ancient-breath/", "urlToImage": "https://scitechdaily.com/images/Tiny-Mineral-Inclusions-Earth-Atmosphere-Mantle-scaled.jpg", "publishedAt": "2023-09-03T07:29:31Z", "content": "ByUniversity of PortsmouthSeptember 3, 2023\r\nTiny mineral inclusions picture for the first time oxygen accumulated in the atmosphere and changed the composition of the mantle. Credit: Hugo Moreira / … [+6679 chars]"}, {"source": {"id": null, "name": "Dailyinterlake.com"}, "author": "TAYLOR INMAN", "title": "Hay piles and pellets: searching for pikas in Glacier National Park - Daily Inter Lake", "description": "Researchers are joining forces with citizen science volunteers to see how the pika population is faring in Glacier National Park.", "url": "https://dailyinterlake.com/news/2023/sep/03/hay-piles-and-pellets-looking-signs-pikas-glacier-/", "urlToImage": "https://hagadone.media.clients.ellingtoncms.com/img/photos/2023/08/31/2023-08-24-PIKA-11_r1200x630.jpg?b7d505e466ff31ef2a911eceee85296b69915698", "publishedAt": "2023-09-03T07:00:13Z", "content": "Hiking among the many talus slopes in Glacier National Park, one might be so lucky to catch a glimpse at the elusive pika. The tiny member of the rabbit family is losing footing in similar habitats a… [+8168 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Shubhangi Dua", "title": "Cosmic Explorer: MIT's next-gen gravitational-wave detector - Interesting Engineering", "description": "Construction of a sizable detector capable of detecting gravitational-wave signals from events like the merging of black holes and neutron stars is underway.", "url": "https://interestingengineering.com/innovation/cosmic-explorer-mits-next-gen-gravitational-wave-detector-ligo", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/09/01/image/jpeg/QTcPY6MqZz00XP9hh0vyTFvv7QBFdma3e4RQ2Mfm.jpg", "publishedAt": "2023-09-03T06:55:00Z", "content": "\"The LIGO detectors are four kilometers long for each arm, and Cosmic Explorer will be 40 kilometers on a side, so 10 times larger. The signal we get from a gravitational wave is essentially proporti… [+1511 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": "Angely Mercado", "title": "10 Bugs Scientists Want You to Squash Immediately - Gizmodo Australia", "description": "Insects are cool (if you look past all the legs). They break down dead things by eating them and pollinate plants so that we can grow enough crops to feed the world. Conservation encourages us to protect wildlife, especially bugs that are now looking down the…", "url": "http://gizmodo.com.au/2023/09/bugs-scientists-want-you-to-squash-immediately/", "urlToImage": "https://gizmodo.com.au/wp-content/uploads/2023/08/a0327733282d090fd8be10407545d6d6.jpg?quality=75", "publishedAt": "2023-09-03T01:01:00Z", "content": "Insects are cool (if you look past all the legs). They break down dead things by eating them and pollinate plants so that we can grow enough crops to feed the world. Conservation encourages us to pro… [+7821 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Your Complete Travel Guide To October’s ‘Ring Of Fire’ Solar Eclipse - Forbes", "description": "On Saturday, October 14, 2023 a \"ring of fire\" annular solar eclipse will be visible across the U.S. Southwest. It's time make a plan while you still can.", "url": "https://www.forbes.com/sites/jamiecartereurope/2023/09/02/the-ultimate-travel-planning-guide-to-octobers-great-american-ring-of-fire-annular-solar-eclipse/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6322dc6ad24363768d065095/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-09-02T23:15:00Z", "content": "This composite image shows the moon as it moves in front of the sun in a rare \"ring of fire\" solar ... [+] eclipse as seen from Tanjung Piai in Malaysia on December 26, 2019. (Photo by Sadiq ASYRAF /… [+8022 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Advancing Quantum Matter: “Golden Rules” for Building Atomic Blocks - SciTechDaily", "description": "Physicists have developed a technique to precisely align supermoiré lattices, revolutionizing the potential for next-generation moiré quantum matter. National University of Singapore (NUS) physicists have developed a technique to precisely control the alignme…", "url": "https://scitechdaily.com/advancing-quantum-matter-golden-rules-for-building-atomic-blocks/", "urlToImage": "https://scitechdaily.com/images/Golden-Rules-for-Building-Atomic-Blocks-scaled.jpg", "publishedAt": "2023-09-02T22:04:44Z", "content": "ByNational University of SingaporeSeptember 2, 2023\r\nThe clock model shows the rotation alignment between the hour hand (Top hBN), minute hand (middle graphene) and second hand (Bottom hBN). The comb… [+6378 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Eric Mack", "title": "Explosive Flash As Large Object Crashes Into Jupiter Captured By Cameras - Forbes", "description": "You’ve probably heard of a concept called the \"law of attraction\" that’s popular in wellness circles. It was on display in the outer solar system last month.", "url": "https://www.forbes.com/sites/ericmack/2023/09/02/explosive-flash-as-large-object-crashes-into-jupiter-captured-by-cameras/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64f3a9cd186de8836b85cc99/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-09-02T21:35:48Z", "content": "solar system gas giant jupiter with moons\r\ngetty\r\nYouve probably heard of a concept called the law of attraction thats popular in wellness circles. In astrophysics theres a similar concept called gra… [+2489 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "NASA spacecraft is returning to Earth this month with first-ever asteroid sample - Earth.com", "description": "NASA is gearing up for what is set to be a momentous occasion: the return of OSIRIS-REx and the first-ever U.S. asteroid sample to Earth.", "url": "https://www.earth.com/news/osiris-rex-is-bringing-an-asteroid-sample-back-to-earth-this-month-worrying-many-people/", "urlToImage": "https://cff2.earth.com/uploads/2023/09/01132025/OSIRIS-REx_asteroid-sample-return_simulation_NASA_3medium.jpg", "publishedAt": "2023-09-02T20:14:43Z", "content": "In the vast expanses of Utahs West Desert, a significant milestone in space exploration is taking place. Led by NASA, a team of scientists and engineers is gearing up for what is set to be a momentou… [+9492 chars]"}]}