{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Doomed exoplanet will be obliterated as it spirals into a star - CNN", "description": "Astronomers have found an exoplanet that is spiraling closer to its host star — and eventually, total obliteration.", "url": "https://www.cnn.com/2022/12/19/world/doomed-exoplanet-aging-star-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221216151101-exoplanet-kepler-1658b.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-19T14:36:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAstronomers have come across an exoplanet with a gloom… [+3719 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "NASA's InSight recorded a marsquake 5 times more powerful than previous record - Space.com", "description": "The mega-marsquake, which is 5 times stronger than the previous record, may be the last big find from the InSight Mars Lander.", "url": "https://www.space.com/mars-insight-most-powerful-marsquake", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QxbpEjTRe6Ne6EEkEn5SWo-1200-80.jpg", "publishedAt": "2022-12-19T11:00:11Z", "content": "A Marsquake detected by NASA's InSight lander in May this year was at least five times larger than the next largest seismic event recorded on the planet.\r\nThe quake occurred on May 4 and registered a… [+2527 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Two Nearby Earth-Like Worlds Found in The Sweet Spot For Life to Survive - ScienceAlert", "description": "In the search for life on other planets, a couple of promising leads have just opened up: Astronomers have identified two worlds with Earth-like masses, sitting in the habitable zone around a red dwarf star called GJ 1002.", "url": "https://www.sciencealert.com/two-nearby-earth-like-worlds-found-in-the-sweet-spot-for-life-to-survive", "urlToImage": "https://www.sciencealert.com/images/2022/12/ExoplanetHeat.jpg", "publishedAt": "2022-12-19T04:14:38Z", "content": "In the search for life on other planets, a couple of promising leads have just opened up: Astronomers have identified two worlds with Earth-like masses, sitting in the habitable zone around a red dwa… [+2917 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Webb Space Telescope Pierces Through Dust Clouds to Unveil Young Stars in Early Stages of Formation - SciTechDaily", "description": "Webb’s Infrared Capabilities Pierce Through Dust Clouds to Make Rare Find Searching for buried treasure isn't easy. It can be a painstaking, even frustrating, process. It is common to sift through the proverbial sand for hours and hours and rarely hit the jac…", "url": "https://scitechdaily.com/nasas-webb-space-telescope-pierces-through-dust-clouds-to-unveil-young-stars-in-early-stages-of-formation/", "urlToImage": "https://scitechdaily.com/images/Webb-Carina-Nebula-Jets-NIRCam-Narrowband-Filters-scaled.jpg", "publishedAt": "2022-12-18T17:06:45Z", "content": "BySpace Telescope Science InstituteDecember 18, 2022\r\nImage of the Cosmic Cliffs, a region at the edge of a gigantic, gaseous cavity within NGC 3324, captured by Webbs Near-Infrared Camera (NIRCam). … [+10316 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Cassidy Ward", "title": "What we know about the damaged Soyuz capsule and what's next for the ISS crew? - Syfy", "description": "A leak was detected aboard the Soyuz capsule attached to the International Space Station on Wednesday, so what happens now?", "url": "https://www.syfy.com/syfy-wire/soyuz-capsule-leak-at-iss-whats-next-for-space-station-crew", "urlToImage": "https://www.syfy.com/sites/syfy/files/2022/12/gettyimages-168603354.jpg", "publishedAt": "2022-12-18T14:50:19Z", "content": "Space travel can be dangerous. In fact, its almost an active rebellion against inherent danger. In the history of human space travel, never has that been more clear than during the famed ill-fated fl… [+3963 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "NASA cancels climate change satellite to monitor greenhouse gases - Space.com", "description": "The agency still maintains its commitment to studying climate change.", "url": "https://www.space.com/nasa-geocarb-climate-change-mission-canceled", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Tjsj27zPd4cBKxurbobVJa-1200-80.jpg", "publishedAt": "2022-12-18T11:00:50Z", "content": "All good things must come to an end, and in the case of NASA's GeoCarb mission, some good things must end before they really begin.\r\nNASA has canceled the GeoCarb mission, which was a collaboration w… [+2411 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Micah Maidenberg", "title": "Elon Musk's SpaceX Prepares for Starship Launch - The Wall Street Journal", "description": "Company pushes for first orbital test launch of rocket system for deep-space missions", "url": "https://www.wsj.com/articles/elon-musks-spacex-prepares-for-starship-launch-11671327551", "urlToImage": "https://images.wsj.net/im-685807/social", "publishedAt": "2022-12-18T11:00:00Z", "content": "SpaceX is gearing up for a key test of its immense rocket that is designed for commercial launches, as well as the Mars mission \r\nElon Musk has long sought.Near a beach east of Brownsville, Texas, em… [+367 chars]"}, {"source": {"id": null, "name": "Grunge.com"}, "author": null, "title": "The Stunning Discovery Made Inside A Meteorite In Somalia - msnNOW", "description": "In 2022, scientists from the University of Alberta announced that they had discovered something in a meteorite sample that had never been seen before.", "url": "https://www.grunge.com/1136220/the-stunning-discovery-made-inside-a-meteorite-in-somalia/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA15oLpc.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-12-18T00:00:59Z", "content": "© Chip Somodevilla/Getty Images\r\n meteorite in tray\r\nIf you've ever seen a shooting star, you've witnessed a meteor speeding across the sky. If that object makes its way to the ground, it's called a … [+3442 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "The Perseverance rover is about to have a big first on Mars - CNN", "description": "This week, explore the latest on Mars alongside the Perseverance rover, laugh along with the funniest photos from the animal kingdom, discover a pristine Norse shipwreck, learn if dinosaur tails can create a sonic boom, and more.", "url": "https://www.cnn.com/2022/12/17/world/perseverance-sample-depot-science-newsletter-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221216103012-01-perseverance-rover-sample-depot-bettys-rock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-17T16:43:00Z", "content": "A version of this story appeared in CNNs Wonder Theory science newsletter. To get it in your inbox, sign up for free here.\r\nSome of our favorite space missions are closing out the year in a big way.\r… [+5137 chars]"}]}