{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Uncovers Star Birth Struggles in a Magnetic Maze at the Milky Way’s Core - SciTechDaily", "description": "Two new research studies explore how a stellar nursery in the heart of the Milky Way is affected by the region’s strong magnetic fields. Despite decades of research, the process of how stars form is still filled with unanswered questions. Because stars create…", "url": "https://scitechdaily.com/?p=467437", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Center-MeerKAT-and-Webb-scaled.jpg", "publishedAt": "2025-04-30T02:56:23Z", "content": "The Webb Telescope has captured dramatic stellar births and strange magnetic filaments in the Milky Way’s core, revealing how intense forces may suppress star formation where it’s most expected. Cred… [+8806 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "NASA is growing concerned as a massive anomaly spreads across Earth, scientists believe it’s linked to deep Earth forces. - Farmingdale Observer", "description": "At the heart of the US space agency's concerns is a geomagnetic phenomenon that is as fascinating as it is worrying: the South Atlantic Anomaly (SAA). This immense region is characterised by a significantly reduced magnetic intensity compared with the surroun…", "url": "https://farmingdale-observer.com/2025/04/29/nasa-is-growing-concerned-as-a-massive-anomaly-spreads-across-earth-scientists-believe-its-linked-to-deep-earth-forces/", "urlToImage": null, "publishedAt": "2025-04-30T02:34:00Z", "content": "At the heart of the US space agency’s concerns is a geomagnetic phenomenon that is as fascinating as it is worrying: the South Atlantic Anomaly (SAA). This immense region is characterised by a signif… [+4561 chars]"}, {"source": {"id": null, "name": "KING5.com"}, "author": "Brady Wakayama", "title": "UW scientists expect an underwater volcano to erupt this year - KING5.com", "description": "Scientists at UW's Cabled Array, one of the world's largest ocean observatories monitoring this active volcano, have seen potential eruption signs in recent months.", "url": "https://www.king5.com/article/news/local/uw-scientists-expect-underwater-volcano-to-erupt-this-year/281-22bce3bb-a552-46f2-8244-3c778648cd89", "urlToImage": "https://media.king5.com/assets/KING/images/8e2b35bb-7923-477f-8e42-f604fb5e8739/20250430T010146/8e2b35bb-7923-477f-8e42-f604fb5e8739_1140x641.jpg", "publishedAt": "2025-04-30T01:04:00Z", "content": "SEATTLE An underwater volcano in the Pacific Northwest is showing signs it may erupt for the first time in years.\r\n\"It's one of the coolest things that happens on our planet,\" said Debbie Kelley. \"Th… [+2097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kameryn Griesser", "title": "First image from the world’s largest solar telescope captures the sun in unheard-of detail - CNN", "description": "The National Science Foundation’s Daniel K. Inouye telescope debuted a close-up of the sun captured by its new, ultra-powerful imaging tool. Here’s what you can see.", "url": "https://www.cnn.com/2025/04/29/science/first-detailed-image-sun-solar-telescope/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/vtf-300dpi-notext.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-30T00:29:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nA newly released image of the sun captured by the worl… [+5660 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Fossils explain how fish evolved to walk out of the water to live on land - Earth.com", "description": "Fossils of Tiktaalik roseae blended fins with hints of limbs and sported a flat head suited for peering above the waterline.", "url": "https://www.earth.com/news/tiktaalik-roseae-fossils-help-explain-how-fish-evolved-walked-on-land/", "urlToImage": "https://cff2.earth.com/uploads/2024/04/29180750/tiktaalik_first-walking-land-animal_illustration_1m.jpg", "publishedAt": "2025-04-30T00:20:55Z", "content": "About 375 million years ago, shallow streams and tidal flats teemed with creatures that looked like fish but were already edging toward life on solid ground. One such pioneer, Tiktaalik roseae, blend… [+5579 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Florida Museum of Natural History", "title": "Giant croc-like carnivore fossils found in the Caribbean - Phys.org", "description": "Imagine a crocodile built like a greyhound—that's a sebecid. Standing tall, with some species reaching 20 feet in length, they dominated South American landscapes after the extinction of dinosaurs until about 11 million years ago. Or at least, that's what pal…", "url": "https://phys.org/news/2025-04-giant-croc-carnivore-fossils-caribbean.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/giant-croclike-carnivo.jpg", "publishedAt": "2025-04-29T23:10:01Z", "content": "Imagine a crocodile built like a greyhoundthat's a sebecid. Standing tall, with some species reaching 20 feet in length, they dominated South American landscapes after the extinction of dinosaurs unt… [+8063 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "See photos snapped in space by Europe's 1st private reentry capsule - Space", "description": "\"This flight — and the engineering process that led us here — taught us valuable lessons on the design of the next iteration, Phoenix 2.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/see-photos-snapped-in-space-by-europes-1st-private-reentry-capsule", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7MtdsuUAFquKu9Kob5T668.jpg", "publishedAt": "2025-04-29T22:12:21Z", "content": "A European reentry capsule notched some important milestones on its first-ever spaceflight last week — and took some photos to commemorate the trip.\r\nPhoenix 1, a prototype spacecraft built by German… [+2807 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Spacecraft captures rare photo of a remnant from our solar system's formation - Earth.com", "description": "NASA’s Lucy spacecraft captures asteroid Donaldjohanson, marking a new step in its mission to explore the solar system’s ancient past.", "url": "https://www.earth.com/news/lucy-spacecraft-captures-rare-view-of-ancient-asteroid-donaldjohanson/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/29141723/asteroid_Donaldjohanson_Lucy-Mission_Spacecraft_illustration_NASA_1m.jpg", "publishedAt": "2025-04-29T21:50:49Z", "content": "NASAs Lucy spacecraft captured a striking image of the asteroid Donaldjohanson during its close flyby on April 20, 2025. \r\nThe snapshot reveals that the asteroid is an elongated contact binary – an o… [+5316 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Phys.org", "title": "Chemicals released by climbing shoe abrasion could lead to lung issues for climbers in indoor environments - Phys.org", "description": null, "url": "https://phys.org/news/2025-04-chemicals-climbing-abrasion-lung-issues.html", "urlToImage": null, "publishedAt": "2025-04-29T20:37:04Z", "content": null}, {"source": {"id": null, "name": "Live Science"}, "author": "Jonathan Gilbert", "title": "Astronomers discover giant 'bridge' in space that could finally solve a violent galactic mystery - Live Science", "description": "Scientists have found evidence for a cosmic collision in the Perseus cluster, a group of thousands of galaxies not far from our own.", "url": "https://www.livescience.com/space/astronomy/astronomers-discover-giant-bridge-in-space-that-could-finally-solve-a-violent-galactic-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nnpUouBS2zb58KwNFDwAjC.jpg", "publishedAt": "2025-04-29T20:02:09Z", "content": "Astronomers thought the Perseus cluster was a massive-but-stable grouping of galaxies, until they found hints of a collision with another cluster — but no one had identified a cosmic interloper. Now,… [+6047 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Scientists Discover a Massive, Glowing Blob of Hydrogen Very Close to Our Solar System - Gizmodo", "description": "The molecular cloud is brimming with material that could birth baby stars.", "url": "https://gizmodo.com/scientists-discover-a-massive-glowing-blob-of-hydrogen-very-close-to-our-solar-system-2000595835", "urlToImage": "https://gizmodo.com/app/uploads/2025/04/Molecular-cloud.jpg", "publishedAt": "2025-04-29T19:55:40Z", "content": "The birthplace of stars begins within large, cold clouds of gas and dust, which eventually collapse under the weight of gravity. Molecular clouds are vast cosmic entities that often stretch for hundr… [+2431 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "DC Agle, Karen Fox, Molly Wasser, Deb Schmid", "title": "Juno mission gets under Jupiter's and Io's surface - Phys.org", "description": "New data from the agency's Jovian orbiter sheds light on the fierce winds and cyclones of the gas giant's northern reaches and volcanic action on its fiery moon.", "url": "https://phys.org/news/2025-04-juno-mission-jupiter-io-surface.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/nasas-juno-mission-get.jpg", "publishedAt": "2025-04-29T19:35:15Z", "content": "New data from the agency's Jovian orbiter sheds light on the fierce winds and cyclones of the gas giant's northern reaches and volcanic action on its fiery moon.\r\nNASA's Juno mission has gathered new… [+6612 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "This Country Is The First In Modern History To Lose All Of Its Glaciers - The Daily Galaxy", "description": "A nation has just made climate history by losing all of its glaciers. This unprecedented event underscores the accelerating impact of climate change.", "url": "https://dailygalaxy.com/2025/04/this-country-the-first-lose-glaciers/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/This-Country-Is-The-First-In-Modern-History-To-Lose-All-Of-Its-Glaciers.jpg", "publishedAt": "2025-04-29T19:00:00Z", "content": "Venezuela has officially lost all of its glaciers. Humboldt Glacier, the countrys last remaining glacier, was once a symbol of resilience in one of the worlds most unique climates. \r\nHowever, recent … [+2802 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "New record! 6 rockets launch in less than 24 hours - Space", "description": "It's been a whirlwind stretch for space fans.", "url": "https://www.space.com/space-exploration/launches-spacecraft/new-record-6-rockets-launch-in-less-than-24-hours", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DURbXEDnrPobsa3EEL3v6e.jpg", "publishedAt": "2025-04-29T18:30:00Z", "content": "The past day has been a whirlwind for space fans.\r\nSix different rockets launched toward orbit in a dizzying stretch of 18 hours, topping by two the previous record for most liftoffs in a 24-hour spa… [+2957 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Amateur astronomer captures detailed photos of Croc's Eye and Whirlpool galaxies from backyard observatory - Space", "description": "Sometimes the universe just stares right back at us.", "url": "https://www.space.com/stargazing/amateur-astronomer-captures-detailed-photos-of-crocs-eye-and-whirlpool-galaxies-from-backyard-observatory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BRqPjemHtNKzbDoRHNZYgm.jpg", "publishedAt": "2025-04-29T18:00:00Z", "content": "The iconic Whirlpool galaxy Messier 51 is pictured along with the smaller galaxy NGC 5195 at the top of the image. (Image credit: Dr. Michele Hernandez Bayliss)\r\nVermont-based astrophotographer Miche… [+3785 chars]"}, {"source": {"id": null, "name": "ALS News Today"}, "author": "Steve Bryson, PhD", "title": "Researchers discover cell pathway that prevents TDP-43 aggregation... - ALS News Today", "description": "A protein was created where TDP-43 was fused to the SUMO2 protein and these fusion proteins were expressed in cells with or without stress.", "url": "https://alsnewstoday.com/news/researchers-discover-cell-pathway-prevents-tdp-43-aggregation-als/", "urlToImage": "https://alsnewstoday.com/wp-content/uploads/2023/07/Petri.png", "publishedAt": "2025-04-29T16:36:16Z", "content": "Researchers have discovered a pathway in cells that prevents the formation of TDP-43 protein clumps, which contribute to nerve cell damage in nearly all people with amyotrophic lateral sclerosis (ALS… [+4614 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Hubble Reveals New Details of a Explosion in the Milky Way’s Satellite Galaxy - The Daily Galaxy", "description": "A mysterious supernova remnant in a neighboring galaxy has revealed new secrets through stunning images from Hubble.", "url": "https://dailygalaxy.com/2025/04/hubble-new-details-explosion-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Hubble-Reveals-New-Details-of-a-Explosion-in-the-Milky-Ways-Satellite-Galaxy.jpg", "publishedAt": "2025-04-29T16:30:00Z", "content": "This time, the focus is on the remains of a star that exploded in the Large Magellanic Cloud (LMC), a satellite galaxy of the Milky Way. \r\nUsing high-resolution images captured by Hubble, combined wi… [+3463 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jennifer M. Dooren", "title": "NASA Soars to New Heights in First 100 Days of Trump Administration - NASA (.gov)", "description": "Today is the 100th day of the Trump-Vance Administration after being inaugurated on Jan. 20. In his inaugural address, President Trump laid out a bold and", "url": "https://www.nasa.gov/news-release/nasa-soars-to-new-heights-in-first-100-days-of-trump-administration/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/04/screenshot-178.png", "publishedAt": "2025-04-29T14:50:50Z", "content": "Today is the 100th day of the Trump-Vance Administration after being inaugurated on Jan. 20. In his inaugural address, President Trump laid out a bold and ambitious vision for NASAs future throughout… [+17821 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Terrifying Maps Reveal What Earth Will Look Like If All the Land Ice Melts - The Daily Galaxy", "description": "If all of Earth’s land ice melts, the results could be catastrophic. Rising seas would submerge cities worldwide, displacing millions of people.", "url": "https://dailygalaxy.com/2025/04/terrifying-maps-earth-if-land-ice-melts/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Terrifying-Maps-Reveal-What-Earth-Will-Look-Like-If-All-the-Land-Ice-Melts.jpg", "publishedAt": "2025-04-29T14:30:00Z", "content": "Imagine a world where all the land ice on Earth melts. It might sound like a scenario for a science fiction movie, but the possibility is becoming increasingly real due to the impacts of climate chan… [+3498 chars]"}, {"source": {"id": null, "name": "Daytona Beach News-Journal"}, "author": "C. A. Bridges, USA TODAY NETWORK - Florida", "title": "Lovebug season is coming ... maybe. Has Florida seen the last of the flying nuisances? - Yahoo", "description": "Lovebugs, for decades the scourge of Florida drivers and car wash employees, have been diminishing in recent years. Are we seeing the last of them?", "url": "https://www.news-journalonline.com/story/news/2025/04/29/florida-lovebug-season-april-may-where/83136318007/", "urlToImage": "https://media.zenfs.com/en/daytona-beach-news-journal/7146a78a2a3cceb44315ff066079c148", "publishedAt": "2025-04-29T14:10:36Z", "content": "Floridians know. Every May and September  and sometimes December in South Florida  the state gets swarmed by zillions of little black and red flying bugs, paired off and filling the skies as they rep… [+6959 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sexism Disrupts Team Performance by Altering Emotional Synchrony - Neuroscience News", "description": "A new study reveals that sexist behavior in teams shifts emotional synchrony from boosting performance to merely fostering social bonding.", "url": "https://neurosciencenews.com/sexism-emotional-synchrony-28767/", "urlToImage": "https://neurosciencenews.com/files/2025/04/sexism-emotional-cooperation-neuroscience.jpg", "publishedAt": "2025-04-29T14:09:52Z", "content": "Summary: A new study reveals that sexist behavior in teams shifts emotional synchrony from boosting performance to merely fostering social bonding. Researchers found that women exposed to subtle sexi… [+3606 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "NASA Science Editorial Team", "title": "Help Classify Galaxies Seen by NASA’s James Webb Space Telescope! - NASA Science (.gov)", "description": "NASA needs your help identifying the shapes of thousands of galaxies in images taken by our James Webb Space Telescope with the Galaxy Zoo project. These", "url": "https://science.nasa.gov/directorates/smd/astrophysics-division/help-classify-galaxies-seen-by-nasas-james-webb-space-telescope/", "urlToImage": "https://assets.science.nasa.gov/dynamicimage/assets/science/cds/citizen-science/projects/galaxy-zoo-screenshot.jpg", "publishedAt": "2025-04-29T13:57:28Z", "content": "NASA needs your help identifying the shapes of thousands of galaxies in images taken by our James Webb Space Telescope with the Galaxy Zoo project. These classifications will help scientists answer q… [+3119 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mara Johnson-Groh", "title": "Flares from magnetized stars can forge planets' worth of gold - Phys.org", "description": "Astronomers have discovered a previously unknown birthplace of some of the universe's rarest elements: a giant flare unleashed by a supermagnetized star. The astronomers calculated that such flares could be responsible for forging up to 10% of our galaxy's go…", "url": "https://phys.org/news/2025-04-flares-magnetized-stars-forge-planets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/flares-from-magnetized.jpg", "publishedAt": "2025-04-29T13:33:04Z", "content": "Astronomers have discovered a previously unknown birthplace of some of the universe's rarest elements: a giant flare unleashed by a supermagnetized star. The astronomers calculated that such flares c… [+6968 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "They wanted to see Earth, but they captured Starlink instead, here’s the image we weren’t supposed to see. - Farmingdale Observer", "description": "In a surprising turn of events, a Starlink satellite has been captured on Google Earth images while flying over Texas. This rare celestial photobomb reveals the growing presence of SpaceX's constellation in Earth's orbit and raises questions about space pollu…", "url": "https://farmingdale-observer.com/2025/04/29/they-wanted-to-see-earth-but-they-captured-starlink-instead-heres-the-image-we-werent-supposed-to-see/", "urlToImage": null, "publishedAt": "2025-04-29T13:14:00Z", "content": "In a surprising turn of events, a Starlink satellite has been captured on Google Earth images while flying over Texas. This rare celestial photobomb reveals the growing presence of SpaceX’s constella… [+4550 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Scientists Found The 'Lid' Keeping The Yellowstone Supervolcano From Erupting - ScienceAlert", "description": "Scientists in the United States have 'blown the lid off' the Yellowstone supervolcano's mysterious underground reservoir of magma.", "url": "https://www.sciencealert.com/scientists-found-the-lid-keeping-the-yellowstone-supervolcano-from-erupting", "urlToImage": "https://www.sciencealert.com/images/2025/04/PrismaticSpring.jpg", "publishedAt": "2025-04-29T13:05:42Z", "content": "Scientists in the United States have 'blown the lid off' the Yellowstone supervolcano's mysterious underground reservoir of magma.\r\nA team of geologists and Earth scientists now claims to have finall… [+5146 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Uncover Ancient Tunnels Beneath the Earth Belonging to an Unknown Lifeform - The Daily Galaxy", "description": "The discovery challenges current understandings of how life forms can survive in harsh environments, and opens the door to exploring previously unknown life forms.", "url": "https://dailygalaxy.com/2025/04/scientists-uncover-ancient-tunnels-beneath-the-earth-belonging-to-an-unknown-lifeform/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Ancient-Tunnels-Beneath-the-Earth.jpg", "publishedAt": "2025-04-29T12:30:00Z", "content": "In the deserts of Africa and the Middle East, scientists have uncovered unusual tiny tubes embedded in rocks, which they suspect were created by some form of life. These strange micro-burrows, found … [+3401 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "James Moorhouse", "title": "50-year-old spaceship set to crash into Earth at 17,000mph and could hit UK - Yahoo News UK", "description": "The impact is thought to be 'like a meteor'.", "url": "https://www.ladbible.com/news/science/uk-spaceship-russia-meteor-earth-disaster-space-905800-20250429", "urlToImage": "https://media.zenfs.com/en/ladbible_826/40a82e9343a8c849f22b5d48ba68589e", "publishedAt": "2025-04-29T12:22:46Z", "content": "Just when you think things are starting to look up in the UK, what with the heatwave and the inevitable afternoons spent in beer gardens that come with it, I'm afraid there's some bad news you might … [+2243 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Tuesday Telescope: Yes, you can see stars in space, and they’re spectacular - Ars Technica", "description": "“Okay, where’s my camera? I gotta record that.”…", "url": "https://arstechnica.com/space/2025/04/tuesday-telescope-yes-you-can-see-stars-in-space-and-theyre-spectacular/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/pettit-1152x648.jpg", "publishedAt": "2025-04-29T12:00:37Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Astronomers Find Potential Candidate For Planet Nine In 40-Year-Old Data - IFLScience", "description": "The bright spot could potentially be the elusive Planet Nine, if it exists at all.", "url": "https://www.iflscience.com/astronomers-find-potential-candidate-for-planet-nine-in-40-year-old-data-78985", "urlToImage": "https://assets.iflscience.com/assets/articleNo/78985/aImg/83562/planet-nine-meta.png", "publishedAt": "2025-04-29T11:14:19Z", "content": "A team of astronomers poring through old astronomical data may have seen a candidate for the elusive Planet Nine a hypothetical ninth planet in the Solar System, far beyond the orbit of Neptune.In 20… [+3451 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Sam Hill", "title": "After decades in storage, fossilized tracks unlock ancient secrets in Oregon - SFGATE", "description": "Using 3D modeling, researchers at John Day Fossil Beds National Monument are learning about the daily lives of ancient creatures.", "url": "https://www.sfgate.com/national-parks/article/oregon-fossil-tracks-unlock-secrets-20294420.php", "urlToImage": "https://s.hdnux.com/photos/01/50/11/77/27303920/3/rawImage.jpg", "publishedAt": "2025-04-29T11:09:54Z", "content": "Millions of years ago, Oregon was wild shorebirds foraged for worms in shallow waters, massive cat-like predators hunted smaller mammals, and ancient tapirs (or rhinoceroses) roamed the land.\r\nPaleon… [+4938 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Generation Z is Losing a Skill That Shaped Human Progress for 5,500 Years—40% Are Falling Behind - The Daily Galaxy", "description": "Generation Z is losing a skill that has shaped human communication for thousands of years. With digital devices taking over, handwriting is becoming a rare art. The consequences of this shift are starting to show in surprising ways.", "url": "https://dailygalaxy.com/2025/04/generation-z-is-losing-a-skill-that-shaped-human-progress-for-5500-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/A-GenZer-Looking-at-his-phone.jpg", "publishedAt": "2025-04-29T11:00:00Z", "content": "The rapid advancement of digital technologies has transformed nearly every aspect of daily life. As the world becomes increasingly connected through smartphones, social media, and digital devices, tr… [+3497 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Vega-C rocket launches European forest-monitoring 'Biomass' satellite to orbit (video) - Space", "description": "Liftoff occurred at 5:15 a.m. ET on Tuesday (April 29).", "url": "https://www.space.com/space-exploration/launches-spacecraft/vega-c-rocket-launch-esa-biomass-forest-monitoring-satellite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QuirerWLpT3LUYpSpCw83L.jpg", "publishedAt": "2025-04-29T09:24:00Z", "content": "A European forest-monitoring satellite headed toward orbit from South America early Tuesday morning (April 29).\r\nThe European Space Agency's (ESA) Biomass spacecraft lifted off atop a Vega-C rocket f… [+2535 chars]"}, {"source": {"id": null, "name": "Chemistry World"}, "author": "James Urquhart", "title": "One of the biggest questions in Mars science may have been answered by the Curiosity rover - Chemistry World", "description": "Mystery of where all the carbon dioxide went that once made the red planet far more hospitable has puzzled scientists for years", "url": "https://www.chemistryworld.com/news/one-of-the-biggest-questions-in-mars-science-may-have-been-answered-by-the-curiosity-rover/4021417.article", "urlToImage": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/5/8/7/540587_pia14165orig_655728_crop_crop_crop.jpg", "publishedAt": "2025-04-29T09:14:44Z", "content": "Nasas rover Curiosity has discovered elusive pure carbonates on Mars, helping to solve the conundrum of how the planet was once warm enough to enable rivers to flow.1 Whats more, it also provides the… [+5118 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "40-year-old spy satellite photos are helping find forgotten land mines in Cambodia - Space", "description": "\"Mines were put there, people left and have forgotten about it.\"", "url": "https://www.space.com/space-exploration/satellites/40-year-old-spy-satellite-photos-are-helping-find-forgotten-land-mines-in-cambodia", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v237XdixeoPWzsMxr9WfNh.jpg", "publishedAt": "2025-04-29T09:00:20Z", "content": "Declassified images from U.S. military satellites are helping find forgotten mine fields in Cambodia.\r\nFrom the late 1960s almost until the end of the 1990s, a bloody war between communist groups and… [+5423 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Sci-Fi to Reality: Single-Photon Teleportation Breakthrough - SciTechDaily", "description": "Teleportation isn't just science fiction anymore — scientists have found a way to send information more clearly and efficiently than ever before. Using an incredibly tiny material called a nanophotonic platform, researchers dramatically improved how well quan…", "url": "https://scitechdaily.com/from-sci-fi-to-reality-single-photon-teleportation-breakthrough/", "urlToImage": "https://scitechdaily.com/images/Physics-Quantum-Entanglement-Phenomenon-Concept-Illustration.jpg", "publishedAt": "2025-04-29T08:24:49Z", "content": "Researchers achieved 94% fidelity in quantum teleportation by enhancing nonlinear optics with a nanophotonic platform, solving major noise and efficiency issues. Credit: SciTechDaily.com\r\nTeleportati… [+6198 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Just Confirmed a 67-Year-Old Hypothesis About Vitamin B1 - ScienceAlert", "description": "You often need a lot of patience to be a scientist, and that's certainly been the case for researchers who have now found solid evidence for a hypothesis around vitamin B1 (or thiamine) that was first put forward almost 70 years ago.", "url": "https://www.sciencealert.com/scientists-just-confirmed-a-67-year-old-hypothesis-about-vitamin-b1", "urlToImage": "https://www.sciencealert.com/images/2025/04/DissolvingTablet.jpg", "publishedAt": "2025-04-29T07:25:33Z", "content": "You often need a lot of patience to be a scientist, and that's certainly been the case for researchers who have now found solid evidence for a hypothesis around vitamin B1 (or thiamine) that was firs… [+2931 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Okayama University of Science", "title": "Fossil of a new mammal species from the age of dinosaurs discovered in Mongolia's Gobi desert - Phys.org", "description": "A joint research team has discovered a fossil belonging to a previously unknown genus and species of mammal in the Late Cretaceous (100–66 million-year-old) strata of Mongolia's Gobi Desert.", "url": "https://phys.org/news/2025-04-fossil-mammal-species-age-dinosaurs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/fossil-of-a-new-mammal.jpg", "publishedAt": "2025-04-29T06:22:23Z", "content": "A joint research team has discovered a fossil belonging to a previously unknown genus and species of mammal in the Late Cretaceous (10066 million-year-old) strata of Mongolia's Gobi Desert.\r\nThe mous… [+2855 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Brand-new Falcon 9 rocket sends 23 Starlink satellites to orbit on SpaceX's 2nd launch of the day (video) - Space", "description": "Liftoff occurred at 10:34 p.m. ET today (April 28).", "url": "https://www.space.com/space-exploration/launches-spacecraft/brand-new-falcon-9-rocket-sends-23-starlink-satellites-to-orbit-on-spacexs-2nd-launch-of-the-day", "urlToImage": "https://cdn.mos.cms.futurecdn.net/c8FVmoGVwx3L86PbULp8eQ.jpg", "publishedAt": "2025-04-29T03:42:39Z", "content": "SpaceX sent another batch of Starlink satellites to orbit tonight (April 28), its second liftoff of the day.\r\nA Falcon 9 rocket carrying 23 Starlink broadband satellites — including 13 with direct-to… [+2314 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Woman, 91, breaks marathon record: Scientists decode this unusual stamina - Times of India", "description": "Emma Maria Mazzenga, a 91-year-old Italian athlete, shattered a marathon record, showcasing remarkable stamina by running the 200 meters in 51.47 seco", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/woman-91-breaks-marathon-record-scientists-decode-this-unusual-stamina/articleshow/120712973.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120712958,width-1070,height-580,imgsize-1111367,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-04-29T01:47:00Z", "content": null}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Camilo López-Aguirre, Laura A. B. Wilson, Robin Beck, Sue Hand", "title": "Echidna ancestors lived watery lifestyles like platypuses 100 million years ago – new study - The Conversation", "description": "A controversial idea suggests the ancestors of echidnas were more like the platypus. For the first time, fossil evidence might support it.", "url": "https://theconversation.com/echidna-ancestors-lived-watery-lifestyles-like-platypuses-100-million-years-ago-new-study-254484", "urlToImage": "https://images.theconversation.com/files/663741/original/file-20250424-56-ymjpmx.jpg?ixlib=rb-4.1.0&rect=0%2C320%2C3199%2C1599&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-04-28T23:58:27Z", "content": "As the worlds only surviving egg-laying mammals, Australasias platypus and four echidna species are among the most extraordinary animals on Earth.\r\nThey are also very different from each other.\r\nThe … [+4746 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Veteran NASA astronaut says ISS can operate past 2030 - SpaceNews", "description": "A veteran NASA astronaut just back from the International Space Station believes the orbiting facility can operate well past its planned 2030 retirement date", "url": "http://spacenews.com/veteran-nasa-astronaut-says-iss-can-operate-past-2030/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDRcLzU0NDYyMjU2NjYyXzRkZTJiYmFkZThfay0xMDI0eDczNC5qcGciLCJ0eHQiOiJWZXRlcmFuIE5BU0EgYXN0cm9uYXV0IHNheXMgSVNTIGNhbiBvcGVyYXRlIHBhc3QgMjAzMCIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.fwGifujiSDweNJUhFzbCh_wzXHuUGEDNnB2S0W36QbkMQ", "publishedAt": "2025-04-28T23:50:37Z", "content": "WASHINGTON A veteran NASA astronaut just back from the International Space Station believes the orbiting facility can operate well past its planned 2030 retirement date and he wouldnt mind another tr… [+3648 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Chris Kirkland, Timmons Erickson, Tony Prave", "title": "1 billion years ago, a meteorite struck Scotland and influenced life on Earth - The Conversation", "description": "The microbes living here were dramatically disrupted – and the future of life on Earth changed.", "url": "https://theconversation.com/1-billion-years-ago-a-meteorite-struck-scotland-and-influenced-life-on-earth-254285", "urlToImage": "https://images.theconversation.com/files/662453/original/file-20250417-62-ry575q.jpg?ixlib=rb-4.1.0&rect=0%2C105%2C5858%2C2929&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-04-28T23:03:44Z", "content": "Weve discovered that a meteorite struck northwest Scotland 1 billion years ago, 200 million years later than previously thought. Our results are published today in the journal Geology.\r\nThis impact n… [+5414 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Katie Mather", "title": "How to best view the Eta Aquarids meteor shower that peaks next week - Yahoo", "description": "The Eta Aquarids will be visible for residents of both the northern and southern hemispheres next week but will put on an especially big performance for...", "url": "https://www.yahoo.com/news/how-to-best-view-the-eta-aquarids-meteor-shower-that-peaks-next-week-222839279.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/iWIhg2UC_9c5W0MLbqStsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-04/c6bec940-246e-11f0-93d5-52fca9f84816", "publishedAt": "2025-04-28T22:28:39Z", "content": "Just two weeks after the Lyrids meteor shower, stargazers should get ready to see the peak of the Eta Aquarids meteor shower, which is expected to light up the sky the night of Monday, May 5, and the… [+2134 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Curiosity rover captured in action from above for the first time - Earth.com", "description": "NASA’s Curiosity rover was spotted mid-drive on Mars for the first time, offering a fresh look at its mission.", "url": "https://www.earth.com/news/curiosity-rover-captured-driving-for-the-first-time/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/27141951/Curiosity-rover-.jpg", "publishedAt": "2025-04-28T22:27:00Z", "content": "NASAs Curiosity Mars rover has never been shy around cameras. From iconic selfies to being spotted from space, its activities have been well-documented over the years.\r\nBut something new happened on … [+4972 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Wildfire Maps Help Firefighters in Real Time - NASA Earth Observatory (.gov)", "description": "Detailed fire maps, produced in minutes with data from a NASA airborne sensor, enabled firefighters in Alabama to limit the spread of wildfires and save buildings.", "url": "https://earthobservatory.nasa.gov/images/154225/wildfire-maps-help-firefighters-in-real-time", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/154000/154225/castleberry_aviris_20250319_th.jpg", "publishedAt": "2025-04-28T22:09:00Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matthew Williams", "title": "China uses 'gravitational slingshots' to save 2 satellites that were stuck in the wrong orbit for 123 days - Live Science", "description": "Chinese engineers have rescued two satellites that were stuck in the wrong orbit using a novel 'gravitational slingshot' method.", "url": "https://www.universetoday.com/articles/chinese-engineers-used-gravitational-slingshots-to-rescue-a-pair-of-satellites-1", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WbTDdnQTNBNV2my4bVLHSH.jpg", "publishedAt": "2025-04-28T21:30:00Z", "content": "On March 15th at 8:15 p.m. Beijing time (March 14th at 8:42 p.m. EDT; 5:42 p.m. PDT), China launched two satellites atop a Yuanzheng-1S mounted on a Long March-2C rocket. While the first and second s… [+3161 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Carter Williams, KSL.com", "title": "Dust continues to impact Colorado River's water flow, Utah study finds - KSL News", "description": "The Colorado River is a vital water source for a large chunk of the West, but dust continues to impact its reliability, a recent Utah-led study finds.", "url": "https://www.ksl.com/article/51302744/dust-continues-to-impact-colorado-rivers-water-flow-utah-study-finds", "urlToImage": "https://img.ksl.com/slc/2940/294013/29401392.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2025-04-28T21:04:36Z", "content": "SALT LAKE CITY The Colorado River is a vital water source for a large chunk of the West, including Utah.\r\nIt's believed that about 60% of Utahns directly benefit from the river, which accounts for so… [+3952 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Brandon Specktor", "title": "Scientists spot a 'dark nebula' being torn apart by rowdy infant stars — offering clues about our own solar system's past - Live Science", "description": "The National Science Foundation's Dark Energy Camera reveals a stunning glimpse into the 'dark nebula' known as the Circinus West molecular cloud, a region of space that's so dense with gas that light can't escape it.", "url": "https://www.livescience.com/space/astronomy/scientists-spot-a-dark-nebula-being-torn-apart-by-rowdy-infant-stars-offering-clues-about-our-own-solar-systems-past", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NYYGn43tWP7cZaA9uAHNXY.jpg", "publishedAt": "2025-04-28T21:00:00Z", "content": "A battle is raging between darkness and light in the constellation Circinus, and a new image from the National Science Foundation's Dark Energy Camera captures a key turning point in the cosmic campa… [+3003 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Protein changes discovered that protect humans and mammals from aging and disease - Earth.com", "description": "An emerging study now suggests that certain tiny adjustments in our proteins could hold the secret to better aging.", "url": "https://www.earth.com/news/protein-changes-discovered-protect-humans-mammals-from-aging/", "urlToImage": "https://cff2.earth.com/uploads/2025/04/28145545/protein-changes_aging-discovery_humans_mammals_1m.jpg", "publishedAt": "2025-04-28T20:56:15Z", "content": "Mammals range from tiny creatures that last just a few years to whales that sail through life for more than a century, raising questions about how aging shapes such differences and what forces keep s… [+4905 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Snowball Earth: Drone mapping and isotopic dating suggest Marinoan glaciation spanned 4 million years - Phys.org", "description": "Scientists at the University of California, Berkeley, and Boise State University have found evidence suggesting that the Marinoan glaciation began approximately 639 million years ago and lasted for approximately 4 million years. In their study published in th…", "url": "https://phys.org/news/2025-04-snowball-earth-drone-isotopic-dating.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/multipronged-study-sug.jpg", "publishedAt": "2025-04-28T20:20:01Z", "content": "Scientists at the University of California, Berkeley, and Boise State University have found evidence suggesting that the Marinoan glaciation began approximately 639 million years ago and lasted for a… [+2789 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "125-Year-Old Physics Puzzle Finally Cracked by Mathematicians - The Daily Galaxy", "description": "After more than a century of challenge, mathematicians have made a stunning breakthrough by uniting three key theories in fluid dynamics. This groundbreaking discovery could change the future of physics – but how did they do it?", "url": "https://dailygalaxy.com/2025/04/physics-puzzle-finally-cracked/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/Physics-Puzzle-Finally-Cracked-by-Mathematicians.jpg", "publishedAt": "2025-04-28T19:30:00Z", "content": "Mathematicians have recently solved a problem that has eluded scientists for over 125 years, bridging three key theories that describe the motion of fluids. This milestone addresses a long-standing c… [+2944 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jess Thomson", "title": "A 'zombie' volcano in Bolivia has been acting up, and scientists finally know why - Live Science", "description": "Uturuncu, a dormant volcano in Bolivia, appeared to be getting ready to erupt following earthquakes and \"sombrero\" shaped deformation — scientists have now worked out what's going on beneath the surface.", "url": "https://www.livescience.com/planet-earth/volcanos/mystery-of-bolivian-zombie-volcano-finally-solved", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vLQXR4JupsWZ5eq676K26D.jpg", "publishedAt": "2025-04-28T19:00:00Z", "content": "A \"zombie\" volcano in Bolivia has been rumbling in its sleep — despite being dormant for hundreds of thousands of years — and scientists now think they know why.\r\nUturuncu, located in the Andes in so… [+4022 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Georgina Jedikovska", "title": "Artificial leaf to make unlimited fuel from thin air and sunlight - Interesting Engineering", "description": "Scientists create a sun-powered artificial leaf that turns sunlight and CO₂ into fuel and chemicals, challenging fossil fuels.", "url": "https://interestingengineering.com/science/artificial-leaf-converts-co-into-fuel", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/04/A1_1160b3.jpg", "publishedAt": "2025-04-28T19:00:00Z", "content": "Even though other experiments have achieved artificial photosynthesis using biological materials, Yang’s team chose copper, an inorganic material with lower selectivity for desired chemical reactions… [+1212 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Georgina Jedikovska", "title": "Scientists crack 50-year-old physics theory to create first-ever black hole bomb - Interesting Engineering", "description": "Physicists have built the first-ever lab model of a black hole bomb, a decades-old theory where spinning energy amplifies until it explodes.", "url": "https://interestingengineering.com/science/scientists-crack-50-year-old-physics-theory-to-create-first-ever-black-hole-bomb", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/04/Low-Res_image-000-_000150-1.png", "publishedAt": "2025-04-28T18:27:00Z", "content": "The team also found that without an initial external magnetic field, the system could spontaneously generate a runaway signal from background noise, mirroring what would happen in a real black hole b… [+768 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bethany Mauger", "title": "Vesta's missing core shatters long-held beliefs about the asteroid - Phys.org", "description": "For decades, scientists believed Vesta, one of the largest objects in our solar system's asteroid belt, wasn't just an asteroid and eventually concluded it was more like a planet with a crust, mantle and core. Now, Michigan State University has contributed to…", "url": "https://phys.org/news/2025-04-vesta-core-shatters-held-beliefs.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-research-shatters.jpg", "publishedAt": "2025-04-28T18:19:05Z", "content": "For decades, scientists believed Vesta, one of the largest objects in our solar system's asteroid belt, wasn't just an asteroid and eventually concluded it was more like a planet with a crust, mantle… [+6611 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Captures Stunning View of Uranus During Rare Stellar Event! - The Daily Galaxy", "description": "NASA captured a rare event this month when Uranus passed between Earth and a distant star, offering a unique opportunity to study the ice giant’s atmosphere in detail.", "url": "https://dailygalaxy.com/2025/04/nasa-view-uranus-during-rare-stellar-event/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/NASA-Captures-Stunning-View-of-Uranus-During-Rare-Stellar-Event.jpg", "publishedAt": "2025-04-28T16:00:00Z", "content": "On April 7, 2025, NASA had a rare opportunity to study Uranus atmosphere and rings when the ice giant passed between Earth and a distant star, creating a “stellar occultation.” This event, which was … [+3227 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Southwest Research Institute", "title": "New Horizons observations lead to first Lyman-alpha map from the galaxy - Phys.org", "description": "The NASA New Horizons spacecraft's extensive observations of Lyman-alpha emissions have resulted in the first-ever map from the galaxy at this important ultraviolet wavelength, providing a new look at the galactic region surrounding our solar system. The find…", "url": "https://phys.org/news/2025-04-horizons-lyman-alpha-galaxy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-horizons-observati.jpg", "publishedAt": "2025-04-28T15:56:47Z", "content": "The NASA New Horizons spacecraft's extensive observations of Lyman-alpha emissions have resulted in the first-ever map from the galaxy at this important ultraviolet wavelength, providing a new look a… [+3831 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "'Hell Ant' Is Oldest Ever Found—by Millions of Years - Newser", "description": "113M-year-old species may have impaled prey with upward-moving jaws", "url": "https://www.newser.com/story/367725/hell-ant-is-oldest-ever-found-by-millions-of-years.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1607246-12-20250428104602.jpeg", "publishedAt": "2025-04-28T15:32:00Z", "content": "An overlooked fossil in storage in Brazil was hiding the 113-million-year-old remains of a \"hell ant,\" now the oldest ant specimen known to science. The winged ant dubbed Vulcanidris cratensis, descr… [+1960 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Brian Foster", "title": "SpaceX rocket debris crashes in Europe — top Polish space officials fired - Glass Almanac", "description": "Space, once seen as a symbol of international cooperation, is increasingly becoming the backdrop for diplomatic tensions. A recent incident involving the uncontrolled re-entry of SpaceX’s ... Continue Reading →", "url": "https://glassalmanac.com/spacex-rocket-debris-crashes-in-europe-top-polish-space-officials-fired/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/04/SpaceX-rocket-debris-crashes-in-Europe-and-top-Polish-space-officials-fired.jpg", "publishedAt": "2025-04-28T15:30:23Z", "content": "Space, once seen as a symbol of international cooperation, is increasingly becoming the backdrop for diplomatic tensions. A recent incident involving the uncontrolled re-entry of SpaceX’s Falcon 9 ro… [+4193 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": "Daniele Iannotti", "title": "New research suggests gravity might emerge from quantum information theory - Physics World", "description": "Theoretical study offers novel insights into the nature of spacetime and matter interactions", "url": "https://physicsworld.com/a/new-research-suggests-gravity-might-emerge-from-quantum-information-theory/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2025/04/wormhole-or-black-hole-773678275-shutterstock-rost9.jpg", "publishedAt": "2025-04-28T14:48:45Z", "content": "Inspiration: Matter tells space how to curve, and space tells matter how to move. John Wheeler. (Courtesy: Shutterstock/Rost9)\r\nA new theoretical framework proposes that gravity may arise from entrop… [+5499 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "James Webb Spots Mysterious Objects at the Edge of the Solar System — And They're Full of Secrets - The Daily Galaxy", "description": "The James Webb Space Telescope has captured an intriguing glimpse of mysterious objects far beyond Neptune.", "url": "https://dailygalaxy.com/2025/04/james-webb-spots-objects-at-solar-system/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/James-Webb-Space-Telescope-Eyes-Mysterious-Objects-at-the-Edge-of-the-Solar-System.jpg", "publishedAt": "2025-04-28T14:30:00Z", "content": "The James Webb Space Telescope (JWST) has begun unlocking secrets about mysterious objects lingering at the outer edges of our solar system. A new study, using JWSTs cutting-edge capabilities, focuse… [+4255 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Tonga eruption sent shockwaves to upper satellite orbit: Study - Interesting Engineering", "description": "This volcanic eruption didn't just affect the oceans and lower atmosphere; new research looked at how it impacted the thermosphere, which is way up where satellites orbit.", "url": "https://interestingengineering.com/science/underwater-volcanic-eruption-shocked-satellites", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/04/IE-17_a2e588.jpg", "publishedAt": "2025-04-28T13:41:00Z", "content": "Our recent investigation discovered the dramatic thermospheric responses at satellite altitudes, the study noted. \r\nThis observation prompted a question: What made this eruption so powerful that it c… [+812 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "'Totally unexpected': Two new crocodile species discovered in the Caribbean - Live Science", "description": "A crocodile DNA study has revealed two previously unknown Crocodylus species in the Caribbean. The crocodiles live on Cozumel and Banco Chinchorro, where they're threatened by human activities.", "url": "https://www.livescience.com/animals/alligators-crocodiles/scientists-discover-2-new-species-of-crocodile-hiding-in-plain-sight", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SgfByu9Hjo78W4FiL8xDrW.jpg", "publishedAt": "2025-04-28T13:36:51Z", "content": "Researchers have identified two new crocodile species living on isolated islands in the Caribbean — and they're both threatened with extinction, a new study has found.\r\nThe reptiles, previously thoug… [+3164 chars]"}, {"source": {"id": null, "name": "DOGOnews"}, "author": "Mihika Sakharpe", "title": "Lunar Caves Could Be Used To House Future Astronauts - DOGO News", "description": "Lunar Caves Could Be Used To House Future Astronauts has 0 comments.", "url": "https://www.dogonews.com/2025/4/28/lunar-caves-could-be-used-to-house-future-astronauts", "urlToImage": "https://cdn4.dogonews.com/images/4b8b04ac-7980-4292-ae75-c1243d3e95c6/1721110385863.jpeg", "publishedAt": "2025-04-28T12:54:39Z", "content": "April 28, 2025 \r\nBy Mihika Sakharpe - 351 words\r\nAlignment \r\nView CCSS | NGSS\r\nAn artist's impression of the recently-found lunar cave (Credit: NASA)\r\nOne of the biggest challenges for long-term stay… [+2306 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "20% of Modern Human Genetic Heritage Is Thought to Have Been Inherited From a Mysterious Ancestral Population - The Daily Galaxy", "description": "A surprising genetic discovery shakes up our understanding of human evolution. New research reveals an unexpected twist in the story of our origins, linking modern humans to ancient populations in ways we never imagined.", "url": "https://dailygalaxy.com/2025/04/20-of-modern-human-genetic-heritage-inherited-from-a-mysterious-ancestral-population/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/04/ancient-human-species.jpg", "publishedAt": "2025-04-28T11:15:00Z", "content": "New research has revealed an incredible discovery: modern humans carry 20% of their genetic material from a mysterious population that split from our ancestors 1.5 million years ago. This study chall… [+3093 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Julie Brown Davis", "title": "Tahoe's most influential laboratory is aboard this 48-year-old fishing boat - SFGATE", "description": "A fishing boat customized into a floating laboratory, the John LeConte is an iconic fixture on Lake Tahoe, shuttling UC Davis scientists across the water.", "url": "https://www.sfgate.com/renotahoe/article/tahoe-influential-laboratory-aboard-48-year-boat-20292861.php", "urlToImage": "https://s.hdnux.com/photos/01/50/11/75/27303782/3/rawImage.jpg", "publishedAt": "2025-04-28T11:10:55Z", "content": "Sunlight glimmers on Lake Tahoe on a spring morning in April as the John LeConte, the 48-year-old research vessel for the UC Davis Tahoe Environmental Research Center, motors across the glassy water.… [+15128 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "“The Beginning of a New Era”: NASA’s James Webb Reveals Three ‘Red Monsters’ Growing in the Infant Universe - Indian Defence Review", "description": "These findings suggest that the universe's first billion years were far more crowded and complex than models had predicted.", "url": "https://indiandefencereview.com/the-beginning-of-a-new-era-nasas-james-webb-reveals-three-red-monsters-growing-in-the-infant-universe/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/04/image-of-the-three-ultra-massive-galaxies.jpg", "publishedAt": "2025-04-28T11:00:00Z", "content": "The James Webb Space Telescope (JWST) has made a discovery that is changing what scientists thought they knew about the early universe. Astronomers have found huge, star-forming galaxies nicknamed “r… [+3398 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Roberta McLain", "title": "What was the fastest dinosaur? - Live Science", "description": "Dinosaurs left behind clues about their maximum speeds, but do we know which dinosaur was the fastest?", "url": "https://www.livescience.com/animals/dinosaurs/what-was-the-fastest-dinosaur", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rPqZFdZbQfYoQriogdRJ6N.gif", "publishedAt": "2025-04-28T09:00:00Z", "content": "Before the mid-1960s, it was widely believed that all dinosaurs were cold-blooded, slow-moving animals. But in the summer of 1964, a team of paleontologists led by John Ostrom\r\n discovered Deinonychu… [+6189 chars]"}]}