{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Blue Origin updates work on ‘transporter’ for Blue Moon lunar lander - SpaceNews", "description": "Blue Origin revealed new details about its development of an Artemis lunar lander as the company nears the first launch of a smaller lander.", "url": "http://spacenews.com/blue-origin-updates-work-on-transporter-for-blue-moon-lunar-lander/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/05/bluemoon-transporter.jpeg", "publishedAt": "2025-05-21T20:37:45Z", "content": "WASHINGTON Blue Origin revealed new details about its development of an Artemis lunar lander as the company nears the first launch of a smaller lander.\r\nSpeaking at the spring meeting of the Lunar Su… [+5108 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "NASA's Mars Perseverance snaps a selfie as a Martian dust devil blows by - NBC News", "description": "The latest selfie by NASA’s Perseverance rover at Mars has captured an unexpected guest: a Martian dust devil.", "url": "https://www.nbcnews.com/science/space/nasas-mars-perseverance-snaps-selfie-martian-dust-devil-blows-rcna208342", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250521-NASA-Mars-Perseverance-Rover-selfie-ew-300p-8764df.jpg", "publishedAt": "2025-05-21T19:06:58Z", "content": "The latest selfie by NASAs Perseverance rover at Mars has captured an unexpected guest: a Martian dust devil.\r\nResembling a small pale puff, the twirling dust devil popped up 3 miles (5 kilometers) b… [+376 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mars Reveals a Sunset Stranger Than You Ever Imagined - The Daily Galaxy", "description": "Mars offers sunsets unlike any on Earth — but what can these fleeting moments tell us about the planet’s mysterious atmosphere?", "url": "https://dailygalaxy.com/2025/05/mars-sunset-stranger-than-ever-imagined/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Mars-Reveals-a-Sunset-Stranger-Than-You-Ever-Imagined.jpg", "publishedAt": "2025-05-21T19:00:00Z", "content": "On May 19, 2005, NASAs Mars Exploration Rover Spirit captured a remarkable image of the sun setting beyond the rim of Gusev crater on Mars. This panoramic view, taken during the rovers 489th Martian … [+2575 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Scientists Just Caught Lightning Firing Off a Gamma-Ray Blast - Gizmodo", "description": "The split-second spark may explain how storms become radioactive—and how lightning really begins.", "url": "https://gizmodo.com/scientists-just-caught-lightning-firing-off-a-gamma-ray-blast-2000605461", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/lightning-bolt.jpg", "publishedAt": "2025-05-21T18:00:54Z", "content": "For the first time, scientists have caught lightning in the act of unleashing a powerful burst of gamma radiation known as a terrestrial gamma-ray flash (TGF).\r\nResearchers at the University of Osaka… [+3150 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Astronomers spy puzzlingly 'perfect' cosmic orb with unknown size and location - Live Science", "description": "New radio images reveal an unusually faint and symmetrical supernova remnant, nicknamed Telios, lurking just below the galactic plane of the Milky Way. However, they cannot tell exactly where it is, how big it is or how it formed.", "url": "https://www.livescience.com/space/astronomy/astronomers-spy-puzzlingly-perfect-cosmic-orb-with-unknown-size-and-location", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sGEywJFAR4CqNLXJnUgFJB.jpg", "publishedAt": "2025-05-21T17:20:04Z", "content": "Astronomers have discovered the eerie remains of a supernova with an almost perfect spherical shape glowing faintly on the outskirts of the Milky Way\r\n. However, they are unsure exactly how large and… [+3818 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Unearthing a 90-Million-Year-Old Mystery: The Turtle No One Saw Coming - The Daily Galaxy", "description": "What if a 90-million-year-old turtle fossil could rewrite history? A recent discovery from New Mexico’s Moreno Hill Formation just did — uncovering a species no one expected.", "url": "https://dailygalaxy.com/2025/05/turtle-no-one-saw-coming/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Unearthing-a-90-Million-Year-Old-Mystery-The-Turtle-No-One-Saw-Coming.jpg", "publishedAt": "2025-05-21T17:00:00Z", "content": "A 90-million-year-old fossil discovery in New Mexico has just revealed a brand-new species of turtle, shaking up what we thought we knew about ancient reptiles. This rare find from the mysterious bae… [+2995 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "NASA legend Gene Kranz returns to mission control photo of the day for May 21, 2025 - Space", "description": "White Flight, we have a lifetime achievement award.", "url": "https://www.space.com/space-exploration/apollo/nasa-legend-gene-kranz-returns-to-mission-control-space-photo-of-the-day-for-may-21-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/gkK7A9eMKaTFRtGDH6vgma.jpg", "publishedAt": "2025-05-21T16:52:33Z", "content": "Legendary NASA flight director, Gene Kranz, now 91 years old, is seen posing with his lifetime achievement award from the American Astronautical Society at his restored console in Apollo mission cont… [+1992 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Jennifer Sandlin", "title": "Sassy bird wins dance-off with zero competition - Boing Boing", "description": "Remember this American Woodcock, the delightful little bird with an unflappable swagger? Well, if you liked its ridiculous dance moves—bobbing here, weaving there—you'll love the Wilson's Snipe, a slightly longer-legged relative…", "url": "https://boingboing.net/2025/05/21/sassy-bird-wins-dance-off-with-zero-competition.html", "urlToImage": "https://boingboing.net/wp-content/uploads/2025/05/Wilsons-Snipe.-Photographer-Mdf.-Image-from-Wi.jpg", "publishedAt": "2025-05-21T16:13:43Z", "content": "Remember this American Woodcock, the delightful little bird with an unflappable swagger? Well, if you liked its ridiculous dance movesbobbing here, weaving thereyou'll love the Wilson's Snipe, a slig… [+1881 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Weight Loss Breakthrough: Scientists Discover Key to Fat-Burning Power in Human Cells - SciTechDaily", "description": "Blocking Mitch, a protein that regulates energy control, prevents fat from accumulating in human cells. About a decade ago, a new generation of weight-loss drugs promised a slimmer, healthier future. But there was a catch: while these medications helped shed …", "url": "https://scitechdaily.com/?p=476034", "urlToImage": "https://scitechdaily.com/images/Overweight-Man-Belly-Measuring-Tape.jpg", "publishedAt": "2025-05-21T15:56:53Z", "content": "Scientists found that disabling a single protein, Mitch, can boost metabolism and block fat formation, laying the groundwork for a new kind of obesity treatment.\r\nBlocking Mitch, a protein that regul… [+6556 chars]"}, {"source": {"id": null, "name": "InsideClimate News"}, "author": "By Bob Berwyn", "title": "Paris Agreement target won’t protect polar ice sheets, scientists warn - Ars Technica", "description": "New research suggests the Earth will pass multiple dangerous tipping points at 1.5 degrees Celsius of warming, the U.N. limit exceeded for much of the last two years.", "url": "https://insideclimatenews.org/news/21052025/paris-agreement-target-wont-protect-polar-ice-sea-level-rise/", "urlToImage": "https://insideclimatenews.org/wp-content/uploads/2025/05/GettyImages-2186073066-1024x683.jpg", "publishedAt": "2025-05-21T15:35:36Z", "content": "Sea levels in some parts of the world could be rising by as much as 8 to 12 inches per decade within the lifetime of todays youngest generations, outpacing the ability of many coastal communities to … [+9914 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Giant 'white streak' appears over multiple US states as Chinese rocket dumps experimental fuel in space - Live Science", "description": "A recent launch of China's Zhuque-2E rocket triggered a giant white streak of light to appear above at least seven U.S. states after deploying six satellites into low-Earth orbit. The light show, which was visible in at least seven states, was the result of a…", "url": "https://www.livescience.com/space/space-exploration/giant-white-streak-appears-over-multiple-us-states-as-chinese-rocket-dumps-experimental-fuel-in-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DoCntnChZHxpuhhzhkRVxd.jpg", "publishedAt": "2025-05-21T15:23:15Z", "content": "A massive streak of white, aurora-like light recently appeared in the night sky above several U.S. states after a Chinese rocket released half a dozen satellites into orbit. The light show was trigge… [+4848 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Astronomers Witness Galaxy Shanking Its Rival With a Beam of Radiation - Gizmodo", "description": "Astronomers caught a brutal act of cosmic violence for the first time—one galaxy piercing another with deadly radiation.", "url": "https://gizmodo.com/astronomers-witness-galaxy-shanking-its-rival-with-a-beam-of-radiation-2000605367", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/galaxies-collision.jpg", "publishedAt": "2025-05-21T15:12:19Z", "content": "In the cold, ancient reaches of the cosmos, two galaxies are duking it out in a battle thats been raging for billions of years. But it’s not a fair fight, a team of astronomers recently found, as one… [+3194 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Never-before-seen 'extreme' microbes surrounded NASA robot before it was sent to Mars 18 years ago, new study reveals - Live Science", "description": "DNA analysis has revealed that 26 novel species of \"extremophile\" bacteria were lurking in a clean room that housed NASA's Phoenix lander before it was launched to Mars in 2007. The hardy microbes might be capable of surviving in space.", "url": "https://www.livescience.com/space/space-exploration/never-before-seen-extreme-microbes-surrounded-nasa-robot-before-it-was-sent-to-mars-18-years-ago-new-study-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zyZo6iLvccLYAR3TrqhGmX.jpg", "publishedAt": "2025-05-21T15:04:24Z", "content": "Dozens of never-before-seen species of \"extremophile\" bacteria were hiding in a NASA clean room used to quarantine a Mars lander before it was successfully launched to the Red Planet more than 17 yea… [+4017 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Chicago", "title": "Teeth first evolved as sensory tissue in the armored exoskeletons of ancient fish, fossil scans find - Phys.org", "description": "Anyone who has ever squirmed through a dental cleaning can tell you how sensitive teeth can be. This sensitivity gives important feedback about temperature, pressure—and yes, pain—as we bite and chew our food. However, the sensitive parts inside the hard enam…", "url": "https://phys.org/news/2025-05-teeth-evolved-sensory-tissue-armored.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/toothache-from-eating-3.jpg", "publishedAt": "2025-05-21T15:00:59Z", "content": "Anyone who has ever squirmed through a dental cleaning can tell you how sensitive teeth can be. This sensitivity gives important feedback about temperature, pressureand yes, painas we bite and chew o… [+7198 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Anne Wilson", "title": "Is gravity quantum? Laser cooling brings torsional oscillators closer to answering this question - Phys.org", "description": "One of the most profound open questions in modern physics is: \"Is gravity quantum?\" The other fundamental forces—electromagnetic, weak, and strong—have all been successfully described, but no complete and consistent quantum theory of gravity yet exists.", "url": "https://phys.org/news/2025-05-gravity-quantum-laser-cooling-torsional.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/is-gravity-quantum.jpg", "publishedAt": "2025-05-21T14:46:42Z", "content": "One of the most profound open questions in modern physics is: \"Is gravity quantum?\" The other fundamental forceselectromagnetic, weak, and stronghave all been successfully described, but no complete … [+6918 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Drill Record-Breaking Core Near Earth’s Mantle, Unlocking Geological Mysteries - The Daily Galaxy", "description": "Scientists have drilled deeper than ever into Earth’s mantle, uncovering groundbreaking clues about our planet’s hidden geology and origins.", "url": "https://dailygalaxy.com/2025/05/scientists-drill-core-near-earths-mantle/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Drill-Record-Breaking-Core-Near-Earths-Mantle-Unlocking-Geological-Mysteries.jpg", "publishedAt": "2025-05-21T14:35:00Z", "content": "A recent groundbreaking scientific expedition has pierced deeper into the Earths mantle than ever before, offering unprecedented insights into the planets geology. The findings, detailed in a study p… [+3138 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Titan's weather resembles Earth's, but runs on methane instead of water - Earth.com", "description": "Saturn’s moon Titan has Earth-like weather powered by methane. New observations reveal rising clouds and rare molecules.", "url": "https://www.earth.com/news/titans-weather-resembles-earths-but-runs-on-methane-instead-of-water/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/21082724/titan_saturn-moon_mosaics_Cassini-flyby_NASA_1m.jpg", "publishedAt": "2025-05-21T14:34:16Z", "content": "Saturns moon Titan appears as a fuzzy, yellow ball from space, shrouded in dense clouds that conceal an interesting world beneath.\r\nThough alien in appearance, the moon shares unexpected similarities… [+5391 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Monitoring Tree Leaves From Space Could Help Predict Volcanic Eruptions - Gizmodo", "description": "Carbon dioxide emissions from rising magma is one of the earliest signs that a volcano is waking up, but measuring it directly is notoriously difficult.", "url": "https://gizmodo.com/monitoring-tree-leaves-from-space-could-help-predict-volcanic-eruptions-2000605214", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/volcano-with-trees.jpg", "publishedAt": "2025-05-21T14:30:44Z", "content": "Forecasting volcanic eruptions is difficult, but not impossible. By keeping an eye on features such as ground deformation, changes in gas emissions, and ground tremors, volcanologists can sometimes m… [+3072 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "‘Important moment in evolution’: Fossil preserves never-before-seen flight feathers in ‘first bird’ - CNN", "description": "Scientists were finally given access to a remarkable Archaeopteryx fossil that’s allowed them to better understand exactly how the earliest known bird could fly.", "url": "https://www.cnn.com/2025/05/21/science/archaeopteryx-fossil-includes-feathers", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/archaepteryx-fossil-under-uv-light-photo-by-delaney-drummond-photo-by-delaney-drummond-c-field-museum.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-05-21T13:37:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nWhen a fossil preserves an animals complete body in a … [+6437 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chandrachur Chakraborty", "title": "Could black holes be growing inside stars—silently and forever? - Phys.org", "description": "When people think of black holes, they imagine something dramatic: a star exploding in space, collapsing in on itself, and forming a cosmic monster that eats everything around it. But what if black holes didn't always begin with a bang? What if, instead, they…", "url": "https://phys.org/news/2025-05-black-holes-stars-silently.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/could-black-holes-be-g.jpg", "publishedAt": "2025-05-21T13:30:01Z", "content": "When people think of black holes, they imagine something dramatic: a star exploding in space, collapsing in on itself, and forming a cosmic monster that eats everything around it. But what if black h… [+6676 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Physicists confirm the incredible existence of \"time mirrors\" - Earth.com", "description": "Physicists demonstrate a time mirror for the first time, reversing electromagnetic waves in a laboratory led by Dr. Hussein Moussa.", "url": "https://www.earth.com/news/physicists-confirm-the-incredible-existence-of-time-mirrors/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19054620/time-mirror-first-laboratory-demonstration.jpg", "publishedAt": "2025-05-21T13:28:51Z", "content": "For decades, theoretical physicists tossed around the idea that time reflection, also known as “time mirrors,” might one day be demonstrated in a real-world experiment. \r\nThis idea seemed too big and… [+5168 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Thirty years ago, Stephen Hawking made predictions for 2025, and they are impressive! - Farmingdale Observer", "description": "In 1995, visionary physicist Stephen Hawking appeared on BBC's \"Tomorrow's World\" to share his predictions for the year 2025. Now that we've reached this milestone, it's fascinating to examine how accurate his technological and space-related forecasts turned …", "url": "https://farmingdale-observer.com/2025/05/21/thirty-years-ago-stephen-hawking-made-predictions-for-2025-and-they-are-impressive/", "urlToImage": null, "publishedAt": "2025-05-21T13:03:00Z", "content": "In 1995, visionary physicist Stephen Hawking appeared on BBC’s “Tomorrow’s World” to share his predictions for the year 2025. Now that we’ve reached this milestone, it’s fascinating to examine how ac… [+5108 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Christopher Plain", "title": "Scientists Studying Life Forms at the Base of a Glacier in Antarctica Make a Shocking Discovery - The Debrief", "description": "Scientists studying extreme life forms living at the base of a glacier in Antarctica made a shocking discovery.", "url": "https://thedebrief.org/scientists-studying-life-forms-at-the-base-of-a-glacier-in-antarctica-make-a-shocking-discovery/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/RESIZE-Low-Res_frontiers-microbiology-antarctica-mutualism-bacteria-eukaryotes-02.jpg", "publishedAt": "2025-05-21T12:58:02Z", "content": "A team of scientists studying the biodiversity of microscopic organisms living at the base of a slowly retreating glacier on the southern coast of Antarctica has made an intriguing discovery: separat… [+6193 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Unusual Face Tatts Discovered on Mysterious South American Mummy - ScienceAlert", "description": "South American mummies have become known for their impressive tattoos, but an analysis has found the design inked into the cheek of an approximately 800-year-old woman buried in the region is unique in many ways.", "url": "https://www.sciencealert.com/unusual-face-tatts-discovered-on-mysterious-south-american-mummy", "urlToImage": "https://www.sciencealert.com/images/2025/05/mummy-with-face-tatts-1.jpg", "publishedAt": "2025-05-21T12:01:27Z", "content": "South American mummies have become known for their impressive tattoos, but an analysis has found the design inked into the cheek of an approximately 800-year-old woman buried in the region is unique … [+3976 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Tim Stevens", "title": "The pursuit of better drugs through orbital space crystals - The Verge", "description": "Sierra Space is getting ready to launch its reusable space plane, Dream Chaser, carrying a module to grow crystals for experimental drug research.", "url": "https://www.theverge.com/space/670339/sierra-space-crystals-merck-dream-chaser-drugs", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/SS_KV_07_High-Res.jpg?quality=90&strip=all&crop=0%2C23.821989528796%2C100%2C52.356020942408&w=1200", "publishedAt": "2025-05-21T12:00:00Z", "content": "The pursuit of better drugs through orbital space crystals\r\nNo, not those sorts of drugs, the kinds that could save your life.\r\nThe pursuit of better drugs through orbital space crystals\r\nNo, not tho… [+7516 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joshua Shavit", "title": "New research findings challenge Einstein’s landmark theory of relativity - The Brighter Side of News", "description": "The discovery in 1998 that the Universe’s expansion is speeding up has become one of the deepest and most enduring puzzles in modern physics.", "url": "https://www.thebrighterside.news/post/new-research-findings-challenge-einsteins-landmark-theory-of-relativity/", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/theory-of-general-relativity.webp?auto=webp&width=2000&height=1341", "publishedAt": "2025-05-21T11:51:00Z", "content": "The discovery in 1998 that the Universe is expanding faster over time shook the foundations of cosmology. This finding challenged deep-seated assumptions about how space behaves on the grandest scale… [+6419 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Not a Doctor, But Possibly the Man Who Will End 70% of Cancer Deaths — And It All Started in a Small Lab - The Daily Galaxy", "description": "A French chemist may have uncovered a surprising flaw in how cancer spreads through the body. His lab at Institut Curie has produced a molecule attracting global attention.", "url": "https://dailygalaxy.com/2025/05/not-a-doctor-but-possibly-the-man-who-will-end-70-of-cancer-deaths-and-it-all-started-in-a-small-lab/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Close-up-red-foam.jpg", "publishedAt": "2025-05-21T11:45:00Z", "content": "In a small lab at the heart of the Institut Curie in Paris, French chemist Raphaël Rodriguez is working on what could become one of the most significant medical breakthroughs in the fight against can… [+2425 chars]"}, {"source": {"id": null, "name": "WOODTV.com"}, "author": "Matt Jaworowski", "title": "University of Michigan researchers develop nation’s most powerful laser - WOODTV.com", "description": "Researchers at the University of Michigan have developed the nation’s most powerful laser.", "url": "https://www.woodtv.com/news/michigan/university-of-michigan-researchers-develop-nations-most-powerful-laser/", "urlToImage": "https://www.woodtv.com/wp-content/uploads/sites/51/2025/05/ZEUS-LASER2.jpg?w=1280", "publishedAt": "2025-05-21T11:03:17Z", "content": "GRAND RAPIDS, Mich. (WOOD) Researchers at the University of Michigan have developed the nations most powerful laser.\r\nThe latest design has nearly doubled the peak power of any other laser in the cou… [+2327 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rong-Gong Lin II", "title": "A mysterious, highly active undersea volcano near California could erupt later in 2025: What scientists expect - Phys.org", "description": "A mysterious and highly active undersea volcano off the Pacific Coast could erupt by the end of this year, scientists say.", "url": "https://phys.org/news/2025-05-mysterious-highly-undersea-volcano-california.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/undersea-volcano.jpg", "publishedAt": "2025-05-21T11:01:14Z", "content": "A mysterious and highly active undersea volcano off the Pacific Coast could erupt by the end of this year, scientists say.\r\nNearly a mile deep and about 700 miles northwest of San Francisco, the volc… [+9153 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "The Day a 2,000 KM Fault Almost Split America in Two: The Buried Secret of the Midwest - The Daily Galaxy", "description": "More than a billion years ago, a massive fault nearly split North America in two, leaving behind a hidden scar beneath the Midwest. This ancient rift, stretching thousands of kilometers, holds secrets still buried under layers of earth and ice.", "url": "https://dailygalaxy.com/2025/05/a-2000-km-fault-almost-split-america-in-two-secret-of-the-midwest/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/View-into-the-Grand-Canyon-from-the-West-Rim.jpg", "publishedAt": "2025-05-21T10:45:00Z", "content": "More than 1.1 billion years ago, an immense geological fault called the Midcontinent Rift began to form beneath what is now the U.S. Midwest. This massive rift stretches approximately 2,000 kilometer… [+3459 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "On Mars, a water reservoir as large as the Red Sea has been discovered by an ESA radar. - Farmingdale Observer", "description": "The exploration of Mars has yielded a groundbreaking discovery that could transform our understanding of the Red Planet. The European Space Agency's Mars Advanced Radar for Subsurface and Ionospheric Sounding (MARSIS) has detected an enormous water reservoir …", "url": "https://farmingdale-observer.com/2025/05/21/on-mars-a-water-reservoir-as-large-as-the-red-sea-has-been-discovered-by-an-esa-radar/", "urlToImage": null, "publishedAt": "2025-05-21T10:45:00Z", "content": "The exploration of Mars has yielded a groundbreaking discovery that could transform our understanding of the Red Planet. The European Space Agency’s Mars Advanced Radar for Subsurface and Ionospheric… [+4522 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "See the crescent moon rise close to Saturn and Neptune early on May 22 - Space", "description": "Remember: A telescope or binoculars will be needed to spot far-flung Neptune!", "url": "https://www.space.com/stargazing/see-the-crescent-moon-rise-close-to-saturn-and-neptune-early-on-may-22", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TYtbrBd2uukHG59iN9cbPb.jpg", "publishedAt": "2025-05-21T10:00:00Z", "content": "The moon will be positioned close to Saturn and Neptune in the pre-dawn hours on May 22. (Image credit: Starry Night.)\r\nThe moon will rise with Venus and the ice giant Neptune in the pre-dawn sky on … [+3407 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Laura Simmons", "title": "Having An “Aha!” Moment When Solving A Puzzle “Almost Doubles” Your Memory - IFLScience", "description": "“We can now actually observe how brain activity shifts as a person moves from confusion to clarity.”", "url": "https://www.iflscience.com/having-an-aha-moment-when-solving-a-puzzle-almost-doubles-your-memory-79284", "urlToImage": "https://assets.iflscience.com/assets/articleNo/79284/aImg/83964/eureka-moment-meta.jpg", "publishedAt": "2025-05-21T09:25:46Z", "content": "You know how sometimes you can spend ages thinking about a problem, and then suddenly, the answer just clicks? These moments of insight are super-satisfying, but it turns out they can also reveal rea… [+3845 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Perseverance rover rolls into 'Crocodile' region on Mars to hunt for super-old rocks - Space", "description": "\"The Krokodillen rocks formed before Jezero Crater was created, during Mars' earliest geologic period, the Noachian, and are among the oldest rocks on Mars.\"", "url": "https://www.space.com/astronomy/mars/perseverance-rover-rolls-into-crocodile-region-on-mars-to-hunt-for-super-old-rocks", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RDVF8Ga42HyLx96y2TVrQX.jpg", "publishedAt": "2025-05-21T09:00:00Z", "content": "NASA's Perseverance rover has made to a new region on Mars, which may contain some of the Red Planet's oldest and most interesting rocks.\r\nPerseverance landed inside the 28-mile-wide (45 kilometers) … [+3738 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "JWST breaks its own record with new most distant galaxy MoM-z14 - Big Think", "description": "Coming from just 280 million years after the Big Bang, or 98% of cosmic history ago, this new, massive galaxy is a puzzle, but not a mirage.", "url": "https://bigthink.com/starts-with-a-bang/jwst-breaks-record-most-distant-galaxy-mom-z14/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/05/squarecover.jpg?resize=1185,630", "publishedAt": "2025-05-21T06:00:00Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Emily Langer", "title": "Ed Smylie, engineer who helped save Apollo 13 crew, dies at 95 - The Washington Post", "description": "He and his NASA colleagues were credited with jury-rigging a carbon dioxide filter that allowed the astronauts to breathe as they made their way back to Earth.", "url": "https://www.washingtonpost.com/obituaries/2025/05/20/ed-smylie-apollo-13-dead/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PWKPXSQ5NVBR27BWR36VLX3NHM.JPG&w=1440", "publishedAt": "2025-05-21T05:41:00Z", "content": "Ed Smylie, who became a quiet hero of the space age in 1970 when he and his fellow NASA engineers jury-rigged an air filter that kept the three Apollo 13 astronauts alive after an onboard explosion s… [+7665 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "NHS consultant with MND campaigns for more government funding - BBC", "description": "Andrew Davies believes MND has been \"left-behind\" in research terms and is campaigning for a cure.", "url": "https://www.bbc.com/news/articles/cm2xm3d2kl3o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/fb4b/live/bca6b260-3620-11f0-a597-6d65f2e5ecfb.jpg", "publishedAt": "2025-05-21T05:34:20Z", "content": "An NHS consultant with motor neurone disease said the condition had been \"left behind\" in research terms. \r\nAndrew Davies, from Hartley Witney in Hampshire, was diagnosed with the terminal illness la… [+2094 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 23 Starlink satellites to orbit on brand-new Falcon 9 rocket after abort (photos) - Space", "description": "Liftoff occurred at 11:19 p.m. ET on Tuesday (May 20).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-23-starlink-satellites-to-orbit-on-brand-new-falcon-9-rocket-after-abort-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3je4jipU3vXopuJyT2973j.jpg", "publishedAt": "2025-05-21T05:01:56Z", "content": "A brand-new SpaceX rocket just earned its wings.\r\nA Falcon 9 rocket lifted off from Florida's Cape Canaveral Space Force Station Tuesday (May 20) at 11:19 p.m. EDT (0319 GMT on May 21), carrying 23 o… [+1742 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supercharged Antibodies: Scientists Engineer Potent New Weapon Against Cancer - SciTechDaily", "description": "Scientists have created a new type of super-strong antibody that could significantly enhance cancer immunotherapy. In an exciting advance for cancer treatment, scientists have developed a new type of powerful antibody that could help the immune system fight c…", "url": "https://scitechdaily.com/supercharged-antibodies-scientists-engineer-potent-new-weapon-against-cancer/", "urlToImage": "https://scitechdaily.com/images/Antibodies-Science-Illustration.jpg", "publishedAt": "2025-05-21T03:33:51Z", "content": "A groundbreaking study from the University of Southampton reveals that engineering antibodies to be more rigid significantly enhances their ability to activate immune cells, potentially offering a mo… [+4425 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Dark Streaks on Mars May Not Be Signs of Flowing Water Like We Thought - ScienceAlert", "description": "It was big news years ago when Mars orbiters found streaks of what appeared to be water running down Martian cliffs and crater walls.", "url": "https://www.sciencealert.com/dark-streaks-on-mars-may-not-be-signs-of-flowing-water-like-we-thought", "urlToImage": "https://www.sciencealert.com/images/2025/05/streaks_on_mars_header.jpg", "publishedAt": "2025-05-21T02:59:38Z", "content": "It was big news years ago when Mars orbiters found streaks of what appeared to be water running down Martian cliffs and crater walls. Scientists worked hard to figure out what they were. Some propose… [+6214 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A sinking of the oceanic crust could have caused the sea level to drop by 30 meters. - Farmingdale Observer", "description": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth's landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15 and 6 million years ago deserves special attention. Recent …", "url": "https://farmingdale-observer.com/2025/05/20/a-sinking-of-the-oceanic-crust-could-have-caused-the-sea-level-to-drop-by-30-meters/", "urlToImage": null, "publishedAt": "2025-05-21T01:32:00Z", "content": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth’s landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15… [+4033 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Frozen ocean world discovered between Mars and Jupiter - The Brighter Side of News", "description": "Instead of solid rock, they believe the crust is dirty ice—formed as a slushy, muddy ocean froze over time.", "url": "https://www.thebrighterside.news/space/frozen-ocean-world-discovered-between-mars-and-jupiter", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/ceres.jpg?auto=webp", "publishedAt": "2025-05-20T23:07:00Z", "content": "Astronomers have long been intrigued by the makeup of the asteroid belts largest body. When it was first spotted in 1801, Ceres appeared dry and rocky, its surface marked by craters and dents. For ye… [+10619 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "A tree dating back to the era of dinosaurs bears fruit for the first time, in the garden of two lucky retired English people. - Stewartville Star", "description": "In a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the garden of British retirees Pamela and Alistair Thompson. This extraordinary event marks a significant milesto…", "url": "https://thinkstewartville.com/2025/05/20/a-tree-dating-back-to-the-era-of-dinosaurs-bears-fruit-for-the-first-time-in-the-garden-of-two-lucky-retired-english-people/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-6480846130354-2025-05-19t093603.707.jpg", "publishedAt": "2025-05-20T21:57:00Z", "content": "Show table of content Hide table of content \r\nIn a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the gar… [+5898 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sarah C.P. Williams", "title": "Scientists discover one of the world's thinnest semiconductor junctions forming inside a quantum material - Phys.org", "description": "Scientists studying a promising quantum material have stumbled upon a surprise: within its crystal structure, the material naturally forms one of the world's thinnest semiconductor junctions—a building block of most modern electronics. The junction is just 3.…", "url": "https://phys.org/news/2025-05-scientists-world-thinnest-semiconductor-junctions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-on-1.jpg", "publishedAt": "2025-05-20T21:18:03Z", "content": "Scientists studying a promising quantum material have stumbled upon a surprise: within its crystal structure, the material naturally forms one of the world's thinnest semiconductor junctionsa buildin… [+4875 chars]"}, {"source": {"id": null, "name": "SFGate"}, "author": "Kasia Pawlowska", "title": "Bright green fireball spotted flying over Ukiah, Morro Bay, Truckee - SFGATE", "description": "A bright green fireball seen from Morro Bay to Truckee amazed Californians. According to the American Meteor Society, there's a clear reason why it was green.", "url": "https://www.sfgate.com/local/article/bright-green-fireball-seen-california-sky-20337262.php", "urlToImage": "https://s.hdnux.com/photos/01/50/33/32/27375236/3/rawImage.jpg", "publishedAt": "2025-05-20T21:11:58Z", "content": "FILE: A single bright meteor from the Geminid meteor shower is seen above the horizon in December 2017.\r\nUniversal Images Group via Getty\r\nA dazzling sight in the night sky caught the attention of do… [+1807 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How microorganisms swim without a brain and why it matters - Earth.com", "description": "Researchers from TU Wien, University of Vienna, and Tufts University discovered how microorganisms swim efficiently without central control.", "url": "https://www.earth.com/news/how-microorganisms-swim-without-a-brain-and-why-it-matters/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/20143207/Microorganisms-swim.jpg", "publishedAt": "2025-05-20T20:39:03Z", "content": "Picture a microorganism swimming through a liquid. It moves with purpose, but it has no brain, no nerves. How does it know where to go? How does it move at all? \r\nA team of researchers from TU Wien, … [+6907 chars]"}, {"source": {"id": null, "name": "My Modern Met"}, "author": "Jessica Stewart", "title": "Spectacular Images From the 2025 Milky Way Photographer of the Year Competition - My Modern Met", "description": "Can you believe how absolutely beautiful our galaxy is?", "url": "https://mymodernmet.com/2025-milky-way-photographer-year/", "urlToImage": "https://mymodernmet.com/wp/wp-content/uploads/2025/05/2025-milky-way-photog-year-thumbnail.jpg", "publishedAt": "2025-05-20T20:18:48Z", "content": "“Diamond Beach Emerald Sky” by Brent Martin“With a clear night forecast and the Milky Way core returning for 2025, I set out to explore the Great Ocean Road. After a few setbacks—such as a failed com… [+13196 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Janine Fohlmeister", "title": "The sun up close: Observations with new VTT camera technology deliver 8K image resolution - Phys.org", "description": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Tenerife uses image restoration methods to capture small structure…", "url": "https://phys.org/news/2025-05-sun-vtt-camera-technology-8k.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-sun-up-close-high.jpg", "publishedAt": "2025-05-20T19:23:04Z", "content": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Teneri… [+5258 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "Venus may be geologically 'alive' after all, reanalysis of 30-year-old NASA data reveals - Live Science", "description": "New research strengthens the case that Venus, long considered a geologically stagnant world, may be more Earth-like in its internal dynamics than once believed.", "url": "https://www.livescience.com/space/venus/venus-may-be-geologically-alive-after-all-reanalysis-of-30-year-old-nasa-data-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uYhwoAtbxSFbkHXg9ibSmB.jpg", "publishedAt": "2025-05-20T19:16:08Z", "content": "Scientists have uncovered fresh evidence that Venus is not dead — geologically speaking. Venus\r\n and Earth are similar in size and were bombarded by comparable amounts of water billions of years ago.… [+4459 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Stone Tools From 400,000 Years Ago Expose Unexpected Tech Breakthrough - The Daily Galaxy", "description": "This razor-sharp stone tool changed the game 400,000 years ago — but the story behind its origin reveals much more.", "url": "https://dailygalaxy.com/2025/05/stone-tools-expose-tech-breakthrough/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Stone-Tools-From-400000-Years-Ago-Expose-Unexpected-Tech-Breakthrough.jpg", "publishedAt": "2025-05-20T19:00:00Z", "content": "Recent archaeological discoveries from sites near Tel Aviv reveal how early humans adapted to a changing environment 400,000 years ago. A new study published in the journal Archaeologiesuncovers the … [+3175 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Discover Hidden Dinosaur Mass Grave Full of Thousands of Fossils - Indian Defence Review", "description": "Scientists have uncovered a mysterious dinosaur mass grave containing thousands of perfectly preserved bones — and the secrets it holds could change everything we know about prehistoric life!", "url": "https://indiandefencereview.com/scientists-discover-dinosaur-mass-grave/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/scientists-discover-hidden-dinosaur-mass-grave-full-of-thousands-of-fossils.jpg", "publishedAt": "2025-05-20T18:15:00Z", "content": "A remarkable discovery in Alberta, Canada, has unveiled one of the largest dinosaur bone beds ever found in North America, providing scientists with a unique glimpse into prehistoric life. This findi… [+3421 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A 28,000-year-old Child Proves That Our Human Ancestors Never Truly Separated From Neanderthals - The Daily Galaxy", "description": "An ancient child’s bones found in Portugal shed new light on the mysterious bond between humans and Neanderthals. Cutting-edge research is rewriting the story of our shared origins—what did they discover?", "url": "https://dailygalaxy.com/2025/05/a-28000-year-old-baby-proves-that-our-human-ancestors-never-truly-separated-from-neanderthals/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-28000-year-old-Baby-Proves-That-Our-Human-Ancestors-Never-Truly-Separated-From-Neanderthals.jpg", "publishedAt": "2025-05-20T18:00:00Z", "content": "Scientists have uncovered new evidence that confirms what many anthropologists have long suspected: interbreeding between Neanderthals and early modern humans. This discovery centers around the remar… [+3059 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jessica Taveau", "title": "NASA Sets Coverage for 32nd SpaceX Resupply Mission Departure - NASA (.gov)", "description": "Filled with nearly 6,700 pounds of supplies, science investigations, equipment, and food, the spacecraft arrived at the space station on April 22 after", "url": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-32nd-spacex-resupply-mission-departure/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/iss070e129455large.jpg", "publishedAt": "2025-05-20T17:43:21Z", "content": "NASA and its international partners will soon receive scientific research samples and hardware after a SpaceX Dragon spacecraft departs the International Space Station on Thursday, May 22, for its re… [+4173 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lori Dajose", "title": "Jupiter was formerly twice its current size and had a much stronger magnetic field, study says - Phys.org", "description": "Understanding Jupiter's early evolution helps illuminate the broader story of how our solar system developed its distinct structure. Jupiter's gravity, often called the \"architect\" of our solar system, played a critical role in shaping the orbital paths of ot…", "url": "https://phys.org/news/2025-05-jupiter-current-size-stronger-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/jupiter-was-formerly-t.jpg", "publishedAt": "2025-05-20T16:52:41Z", "content": "Understanding Jupiter's early evolution helps illuminate the broader story of how our solar system developed its distinct structure. Jupiter's gravity, often called the \"architect\" of our solar syste… [+4078 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "House-size asteroid will pass between Earth and moon on May 21 - Space", "description": "The asteroid poses no threat to the moon or Earth.", "url": "https://www.space.com/stargazing/house-size-asteroid-will-pass-between-earth-and-moon-on-may-21", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HLGhg9CRXow4f2M8NMvAGC.jpg", "publishedAt": "2025-05-20T16:00:00Z", "content": "A newly discovered house-size asteroid is set to make a close, yet harmless approach to Earth on May 21, passing within one-third of the Earth-moon distance.\r\nThe close approach will happen at approx… [+2689 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "40 Years After the Chilling Ozone Hole Discovery: Scientists Unveil Eye-Opening New Details - The Daily Galaxy", "description": "40 years after the ozone hole discovery, scientists reveal what’s really happening above Antarctica", "url": "https://dailygalaxy.com/2025/05/40-years-chilling-ozone-hole-discovery/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/40-Years-After-the-Chilling-Ozone-Hole-Discovery-Scientists-Unveil-Eye-Opening-New-Details.jpg", "publishedAt": "2025-05-20T14:50:00Z", "content": "It has been 40 years since scientists revealed the shocking discovery of a large hole in the ozone layer above Antarctica, a finding that sparked urgent global action to protect the planets fragile s… [+4964 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discovered a Lost Planet Hidden Deep Inside Earth’s Mantle - The Daily Galaxy", "description": "Deep beneath our feet lies the shocking discovery of a lost planet’s remains hidden inside Earth’s mantle—redefining our planet’s violent origins.", "url": "https://dailygalaxy.com/2025/05/scientists-lost-planet-hidden-earth-mantle/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discovered-a-Lost-Planet-Hidden-Deep-Inside-Earths-Mantle.jpg", "publishedAt": "2025-05-20T14:00:00Z", "content": "A recent study published in Naturepresents compelling evidence of ancient planetary material buried deep within Earth’s mantle. Researchers have uncovered two massive dense structures beneath Africa … [+4410 chars]"}, {"source": {"id": null, "name": "Discovery Institute"}, "author": "Casey Luskin", "title": "“1% Difference” Now Overturned - Evolution News", "description": "This finding should be major news in the science world, yet those involved don’t seem interested in highlighting the discovery.", "url": "https://evolutionnews.org/2025/05/bombshell-new-research-overturns-claim-that-humans-and-chimps-differ-by-only-1-percent-of-dna/", "urlToImage": "https://evolutionnews.org/wp-content/uploads/2025/05/2001-chimp-obelisk-scaled.png", "publishedAt": "2025-05-20T13:38:16Z", "content": "Image credit: Nathan Jacobson.\r\nHow many times have you heard it said that the human and chimpanzee genomes are so similar that they are only 1 percent different at the level of their DNA? This shows… [+7257 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Sawyer Rosenstein", "title": "Starfish Space announces plans for first commercial satellite docking - NASASpaceFlight.com -", "description": "A new mission will aim to complete the first commercial satellite docking in low Earth…", "url": "https://www.nasaspaceflight.com/2025/05/starfish-plans-first-commercial-satellite-docking/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2025/05/Otter_Pup_approaching_Starfish.png", "publishedAt": "2025-05-20T13:00:23Z", "content": "63A new mission will aim to complete the first commercial satellite docking in low Earth orbit (LEO). However, the satellite it aims to dock with isnt equipped with a docking adapter.\r\nStarfish Space… [+3969 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "'We don't know how bad it could get' — Are we ready for the worst space weather? - Space", "description": "Space weather forecasting doesn't yet command the same resources as Earth weather forecasting, even though the stakes are growing.", "url": "https://www.space.com/astronomy/sun/we-dont-know-how-bad-it-could-get-are-we-ready-for-the-worst-space-weather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bAaXvg5uVKnsKfVNXLvX85.jpg", "publishedAt": "2025-05-20T13:00:00Z", "content": "Imagine being told a storm is heading your way, but you won't know how bad the winds are or whether they'll knock out power until just minutes before it hits. That's the challenge scientists face whe… [+8440 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "How to Stop Crying Over Onions: Get Sharp - Newser", "description": "Cornell physicists find dull blades, fast cuts release more irritating particles into the air", "url": "https://www.newser.com/story/368961/how-to-stop-crying-over-onions-get-sharp.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1611596-12-20250520080902.jpeg", "publishedAt": "2025-05-20T12:46:00Z", "content": "If you tend to tear up when cutting onions, blame syn-propanethial-S-oxide. That's the chemical released when an onion is sliced, triggering the nerves in your eye responsible for producing tears. Th… [+1638 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jarred Roberts", "title": "Do photons wear out? An astrophysicist explains light’s ability to travel vast cosmic distances without losing energy - The Conversation", "description": "The speed of light is the fastest anything can travel. What happens to a photon from a galaxy 25 million light years away on its journey toward Earth?", "url": "https://theconversation.com/do-photons-wear-out-an-astrophysicist-explains-lights-ability-to-travel-vast-cosmic-distances-without-losing-energy-252880", "urlToImage": "https://images.theconversation.com/files/665882/original/file-20250505-62-3pk41.jpg?ixlib=rb-4.1.0&rect=0%2C744%2C8451%2C4225&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-20T12:40:39Z", "content": "My telescope, set up for astrophotography in my light-polluted San Diego backyard, was pointed at a galaxy unfathomably far from Earth. My wife, Cristina, walked up just as the first space photo stre… [+4766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Who is watching for earthquakes, volcanoes and tsunamis? Trump is cutting the guardians at the gate - Yahoo", "description": "The league of experts and scientists who have spent decades keeping watch is being decimated by the Trump administration’s staffing cuts.", "url": "https://www.cnn.com/2025/05/20/climate/volcanoes-earthquakes-tsunamis-federal-cuts-dg", "urlToImage": "https://media.zenfs.com/en/cnn_articles_875/bb73324512e90a51f43bd905145d6edd", "publishedAt": "2025-05-20T12:20:02Z", "content": "Sometime between today and 200 years from now, scientists say the big one will hit the United States.\r\nThere is danger lurking on the sea floor off the Pacific Northwests coast: After centuries of tw… [+9334 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Scott Neuman", "title": "A broken thruster jeopardized Voyager 1, but engineers executed a remote fix - NPR", "description": "NASA mission controllers raced against time to find a solution before a crucial ground-based radio used for communicating with Voyagers 1 and 2, went offline for upgrades.", "url": "https://www.npr.org/2025/05/20/nx-s1-5403501/voyager-thruster-nasa-interstellar", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/985x554+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7a%2Faa%2Fb8440cc043a59255b4d5a330b678%2Fap24114713039232.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": "Earlier this year, NASA mission controllers faced a challenging decision that could have marked the end of Voyager 1's decades-long journey. \r\nLaunched in 1977 to explore the outer solar system, the … [+4288 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "A NASA Mars rover looked up at a moody sky. What it saw wasn't a star. - Mashable", "description": "Perseverance captures a rare sight from the surface of the Red Planet.", "url": "https://mashable.com/article/nasa-perseverance-mars-moon-deimos-image", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01bQ3GYPyvMtCRR7QIHSFn8/hero-image.fill.size_1200x675.v1747681609.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Second CubeSat joins ESA’s Ramses mission to asteroid Apophis - European Space Agency", "description": null, "url": "https://www.esa.int/Space_Safety/Planetary_Defence/Second_CubeSat_joins_ESA_s_Ramses_mission_to_asteroid_Apophis", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/10/ramses_mission_patch/26369474-1-eng-GB/Ramses_mission_patch_pillars.png", "publishedAt": "2025-05-20T07:51:54Z", "content": "Space Safety20/05/20251211 views34 likes\r\nOn 13 April 2029, the 375 m asteroid Apophis will make a safe but exceptionally close flyby of Earth. ESA is preparing the Ramses mission, which, if fully su… [+2927 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Claims that \"the Universe will end sooner than expected\" are false - Big Think", "description": "If all massive objects emit Hawking radiation, not just black holes alone, then everything is unstable, even the Universe. Can that be true?", "url": "https://bigthink.com/starts-with-a-bang/universe-end-sooner-expected-false/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/05/origin-56-e1726775142874.jpg?resize=1200,630", "publishedAt": "2025-05-20T06:00:00Z", "content": null}]}