{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Tariq Malik", "title": "What time is SpaceX's Starship Flight 6 launch test on Nov. 18? - Space.com", "description": "SpaceX's sixth Starship test flight is set for no earlier than Monday afternoon (Nov. 18) for now.", "url": "https://www.space.com/space-exploration/launches-spacecraft/what-time-is-spacexs-starship-flight-6-launch-test-on-nov-18", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ayA5jwkirDZj3RRed7eFLH-1200-80.jpg", "publishedAt": "2024-11-15T22:40:56Z", "content": "SpaceX is gearing up to launch its next Starship test flight, a mission that will attempt a second catch of the world's largest rocket on Monday (Nov. 18). But if you're hoping to watch the launch li… [+11402 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain’s Recycling Changes with Age - Neuroscience News", "description": "New research uncovers how mitophagy, the cellular recycling of damaged mitochondria, changes dynamically in the aging mammalian brain.", "url": "https://neurosciencenews.com/mitophagy-brain-aging-28060/", "urlToImage": "https://neurosciencenews.com/files/2024/11/mitochondria-brain-aging-recycling-neurosicence.jpg", "publishedAt": "2024-11-15T20:16:48Z", "content": "Summary: New research uncovers how mitophagy, the cellular recycling of damaged mitochondria, changes dynamically in the aging mammalian brain. In memory-related cells, mitophagy rises in midlife but… [+7266 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Meteorite found in a drawer at university contains 700-million-year-old evidence of water on Mars - Livescience.com", "description": "The Lafayette meteorite was discovered in a drawer at Purdue University in 1931, with no clear indication of how it got there. A new analysis of the rock reveals evidence of liquid water on Mars 742 million years ago.", "url": "https://www.livescience.com/space/meteoroids/meteorite-found-in-a-drawer-at-university-contains-700-million-year-old-evidence-of-water-on-mars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MnnqprC5ZseD3e68tTtH7H-1200-80.jpg", "publishedAt": "2024-11-15T20:13:18Z", "content": "A meteorite\r\n discovered in a drawer at a university in 1931 harbors evidence of liquid water on Mars 742 million years ago, new research suggests.\r\nThe Lafayette meteorite is a glassy chunk of space… [+3102 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "US Department of Energy", "title": "Scientists gain new insights into how mass is distributed in hadrons - Phys.org", "description": "Scientists can determine the mass of subatomic particles that are built from quarks by looking at the particles' energy and momentum in four-dimensional spacetime. One of the quantities that encode this information, called the trace anomaly, is linked to the …", "url": "https://phys.org/news/2024-11-scientists-gain-insights-mass-hadrons.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/scientists-gain-new-in-1.jpg", "publishedAt": "2024-11-15T19:35:04Z", "content": "Scientists can determine the mass of subatomic particles that are built from quarks by looking at the particles' energy and momentum in four-dimensional spacetime. One of the quantities that encode t… [+3043 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Russia Says Potentially \"Catastrophic\" Leak in Space Station Isn't a Big Deal - Futurism", "description": "In September, NASA's inspector general noted in a report that new cracks and leaks affecting the Russian segment of the aging International Space Station continued to be a \"top safety risk.\" The leaks, which have plagued a module connecting the segment's dock…", "url": "https://futurism.com/the-byte/russia-catastrophic-leak-space-station", "urlToImage": "https://wordpress-assets.futurism.com/2024/11/russia-catastrophic-leak-space-station.jpg", "publishedAt": "2024-11-15T19:25:20Z", "content": "\"The Russians believe that continued operations are safe but they cant prove to our satisfaction that they are.\"\r\nTake a Leak\r\nIn September, NASA's inspector general warned in a report that new crack… [+2291 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Hannah Peart", "title": "Ecosystem that predates the dinosaurs uncovered in the Alps by melting snow - Yahoo! Voices", "description": "Beneath the snowy slopes lay a prehistoric surprise: an ecosystem that predates the dinosaurs, revealed by melting snow before being stumbled upon by a hiker...", "url": "https://www.nbcnews.com/news/world/fossils-predates-dinosaurs-uncovered-italy-alps-hiker-melting-snow-rcna180300", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/cya5rMQEMcTNrjvgkctDGQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/nbc_news_122/ee072968fe5bd383d6cbec2888ef5ce6", "publishedAt": "2024-11-15T18:27:13Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nB… [+4319 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ian Livingston", "title": "Leonid meteor shower peaks alongside supermoon this weekend. What to know. - The Washington Post", "description": "Leonid meteors often produce extended bright, colorful trails as they burn up in Earth’s atmosphere.", "url": "https://www.washingtonpost.com/weather/2024/11/15/leonid-meteor-shower-supermoon/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ELXJW2Z7CJCOVCWFAUEK3XELBQ.jpg&w=1440", "publishedAt": "2024-11-15T18:15:36Z", "content": "Leonid meteors are visible in the night sky from early November to early December. This weekend, the ongoing meteor shower reaches its maximum intensity, with a peak Sunday night into early Monday.\r\n… [+3659 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "James R. Riordon", "title": "NASA satellites reveal abrupt drop in global freshwater levels - Phys.org", "description": "An international team of scientists using observations from NASA-German satellites found evidence that Earth's total amount of freshwater dropped abruptly starting in May 2014 and has remained low ever since. Reporting in Surveys in Geophysics, the researcher…", "url": "https://phys.org/news/2024-11-nasa-satellites-reveal-abrupt-global.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/nasa-satellites-reveal.jpg", "publishedAt": "2024-11-15T18:08:04Z", "content": "An international team of scientists using observations from NASA-German satellites found evidence that Earth's total amount of freshwater dropped abruptly starting in May 2014 and has remained low ev… [+4861 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "First-Ever 'Einstein Zig-Zag' Found in Space Could Help Solve the Universe's Expansion Mystery - Gizmodo", "description": "A compound lens forged by two galaxies is helping astronomers get a bead on the Hubble Constant and dark energy.", "url": "https://gizmodo.com/first-ever-einstein-zig-zag-found-in-space-could-help-solve-the-universes-expansion-mystery-2000525039", "urlToImage": "https://gizmodo.com/app/uploads/2024/11/abell-gravitational-lens.jpg", "publishedAt": "2024-11-15T17:40:28Z", "content": "A light source in space originally believed to be a galaxy bending light from a distant active galactic core is actually an extremely rare and first-of-its-kind gravitational lens, according to a tea… [+3919 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "'Another piece of the puzzle': Antarctica's 1st-ever amber fossil sheds light on dinosaur-era rainforest that covered South Pole 90 million years ago - Livescience.com", "description": "Until now, Antarctica was the only continent on Earth without any known amber fossils. But sediment cores taken from below the seafloor have revealed a tiny piece of fossilized resin holding fragments of an ancient rainforest that covered the South Pole durin…", "url": "https://www.livescience.com/planet-earth/fossils/another-piece-of-the-puzzle-antarcticas-1st-ever-amber-fossil-sheds-light-on-dinosaur-era-rainforest-that-covered-south-pole-90-million-years-ago", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8Zfa7ir4AQ5CM9e2esaaYB-1200-80.jpg", "publishedAt": "2024-11-15T17:20:37Z", "content": "For the first time, researchers have discovered a piece of fossilized resin, or amber, in Antarctica. The tiny golden fragment, unearthed beneath the seafloor, contains microscopic remnants of an anc… [+3677 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Meat-Eating 'Terror Birds' Once Ruled Earth: The Predators That Dominated After the Dinosaurs - The Daily Galaxy --Great Discoveries Channel", "description": "Long after the dinosaurs disappeared, terror birds became Earth's supreme predators. Armed with deadly hooked beaks, these flightless meat-eaters dominated the planet for millions of years. But what caused their fall?", "url": "https://dailygalaxy.com/2024/11/meat-eating-terror-birds-once-ruled-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/depiction-of-a-terror-bird-actively-hunting-its-prey.jpg", "publishedAt": "2024-11-15T16:23:51Z", "content": "Imagine a time when Earth was ruled by colossal flightless birds, towering up to 10 feet (3.05 m) tall, equipped with razor-sharp hooked beaks and formidable speed. These were the terror birds, scien… [+2835 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Aberdeen", "title": "Study of Scotland's last plague reveals humanity in face of 'Black Death' - Phys.org", "description": "A new study led by the University of Aberdeen has provided greater understanding of Scotland's final deadly brush with the plague.", "url": "https://phys.org/news/2024-11-scotland-plague-reveals-humanity-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/study-of-scotlands-las.jpg", "publishedAt": "2024-11-15T16:01:03Z", "content": "A new study led by the University of Aberdeen has provided greater understanding of Scotland's final deadly brush with the plague.\r\nResearch published in the journal PLOS One has confirmed for the fi… [+4772 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "'It invites us to reconsider our notion of shadow': Laser beams can actually cast their own shadows, scientists discover - Livescience.com", "description": "After discussing the quirks in 3D modeling software, where a laser beam is treated as a solid object that can cast a shadow, scientists decided to experiment in real life — and found that laser beams can indeed cast a shadow under the right conditions.", "url": "https://www.livescience.com/technology/it-invites-us-to-reconsider-our-notion-of-shadow-laser-beams-can-actually-cast-their-own-shadows-scientists-discover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zaS62FehRr7EGUfxZ8zUwG-1200-80.jpg", "publishedAt": "2024-11-15T15:45:00Z", "content": "A quirk in scientific 3D modeling has led to the discovery that laser light\r\n can — under the right circumstances — cast its own shadow.\r\nThe finding challenges our current understanding of what a sh… [+3174 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Watch Beaver Moon supermoon rise today in free livestream - Space.com", "description": "Don't miss the Beaver Moon! The last supermoon of the year.", "url": "https://www.space.com/stargazing/watch-november-full-moon-rise-today-in-free-livestream", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jLyQZmds5oofSXSHrotUh7-1200-80.jpg", "publishedAt": "2024-11-15T15:27:06Z", "content": "The November Full Moon, also known as the Beaver Moon rises today and is the last supermoon of the year.\r\nYou can watch the full moon rise live from Italy, in a free livestream courtesy of astronomer… [+2108 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Ryan Whalen, Christopher Plain and Ryan Whalen", "title": "James Webb Space Telescope Finds Stunning Evidence for Alternate Theory of Gravity - The Debrief", "description": "New discoveries from NASA's James Webb Space Telescope offer unexpected support for an alternate theory of gravity first proposed in 1998.", "url": "https://thedebrief.org/james-webb-space-telescope-finds-stunning-evidence-for-alternate-theory-of-gravity/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2024/11/openart-image_Gp-5Z6jS_1731652752711_raw.jpg", "publishedAt": "2024-11-15T15:13:18Z", "content": "Astronomers using the James Webb Space Telescope to peer back in time into the farthest reaches of the universe have found stunning evidence for an alternate theory of gravity.\r\nCurrent models of gal… [+6078 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Physicists create the first fully mechanical qubit - Phys.org", "description": "A team of physicists at ETH Zürich has built the first-ever working mechanical qubit. In their paper published in the journal Science, the group describes their novel idea for creating such a qubit and how well it has worked during testing.", "url": "https://phys.org/news/2024-11-physicists-fully-mechanical-qubit.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/physicists-create-the-1.jpg", "publishedAt": "2024-11-15T15:10:01Z", "content": "A team of physicists at ETH Zürich has built the first-ever working mechanical qubit. In their paper published in the journal Science, the group describes their novel idea for creating such a qubit a… [+2194 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Webb telescope captures stunning image of massive super star cluster in deep space - The Daily Galaxy --Great Discoveries Channel", "description": "The James Webb Space Telescope (JWST) has once again astounded astronomers with its latest capture of Westerlund 1, a colossal super star cluster nestled in the depths of our Milky Way galaxy. This extraordinary celestial factory, located 12,000 light-years a…", "url": "https://dailygalaxy.com/2024/11/webb-telescope-captures-stunning-image-massive-super-star-cluster-deep-space/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/webb-telescope-captures-stunning-image-massive-super-star-cluster-deep-space.jpg.webp", "publishedAt": "2024-11-15T14:00:00Z", "content": "Westerlund 1 is not your average star cluster. It’s a galactic behemoth, outshining and outweighing its cosmic counterparts by a staggering margin. While typical star clusters boast a mass around 10,… [+3743 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Michael Natale", "title": "40 Years Ago, Scientists Dropped Gophers Onto a Volcano. Today, They're Tiny Heroes. - Popular Mechanics", "description": "A bunch of gophers helped restore the plant life around Mount St. Helens after a devastating eruption", "url": "https://www.popularmechanics.com/science/environment/a62883921/gophers-mount-st-helens/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/pocket-gopher-royalty-free-image-1731432526.jpg?crop=1xw:0.74963xh;center,top&resize=1200:*", "publishedAt": "2024-11-15T14:00:00Z", "content": "<ul><li>A new study reveals that an unconventional ecological intervention tactic is still providing benefits 40 years later</li><li>After the 1980 eruption of Mount St. Helens devastated the local e… [+3478 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Ty Roush", "title": "Northern Lights Forecast: Aurora Borealis May Appear In These States Tonight - Forbes", "description": "The northern lights may be visible in states like Montana, North Dakota and Wisconsin.", "url": "https://www.forbes.com/sites/tylerroush/2024/11/15/northern-lights-forecast-aurora-borealis-may-appear-in-these-states-tonight/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67374d824b0b913222945c25/0x0.jpg?format=jpg&crop=3500,1968,x0,y14,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-11-15T13:33:48Z", "content": "A patch of the northern U.S. could have a chance to see aurora borealis on Friday night, with quieter geomagnetic activity expected through the weekend, according to a National Oceanic and Atmospheri… [+3121 chars]"}, {"source": {"id": null, "name": "Celebwell.com"}, "author": "Leah Groth", "title": "Golf Influencer Karin Hart in Two-Piece Workout Gear is \"Making Golf Great Again\" - Celebwell", "description": "Karin Hart is hitting the golf course in her workout gear. In a new social media post the golf influencer flaunts her amazing body.", "url": "https://celebwell.com/news-golf-influencer-karin-hart-in-two-piece-workout-gear-is-making-golf-great-again/", "urlToImage": "https://celebwell.com/wp-content/uploads/sites/2/2024/11/Karin-Hart.jpg?quality=82&strip=all", "publishedAt": "2024-11-15T13:30:33Z", "content": "Golf influencer Karin Hart is making waves both on and off the course, where she's recently shared a video of herself hitting balls in stylish workout gear and her \"MGGA\" hat, captioned, \"Making golf… [+2946 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "James Webb telescope observes ancient supernova replaying thrice in cosmic time warp - The Daily Galaxy --Great Discoveries Channel", "description": "The James Webb Space Telescope (JWST) has made a groundbreaking discovery, observing an ancient supernova that appears to replay three times due to a cosmic phenomenon known as gravitational lensing. This remarkable observation not only showcases the telescop…", "url": "https://dailygalaxy.com/2024/11/james-webb-telescope-observes-ancient-supernova-replaying-thrice-cosmic-time-warp/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/james-webb-telescope-observes-ancient-supernova-replaying-thrice-cosmic-time-warp.jpg.webp", "publishedAt": "2024-11-15T13:00:00Z", "content": "The JWST’s near-infrared camera (NIRCam) captured a mesmerizing sight in the galaxy cluster PLCK G165.7+67.0, located 3.6 billion light-years from Earth. Astronomers observed three distinct points of… [+3734 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "New family of optimized magnetic fields could display enhanced fusion plasma confinement - Phys.org", "description": "Physicists have been trying to design fusion reactors, technologies that can generate energy via nuclear fusion processes, for decades. The successful realization of fusion reactors relies on the ability to effectively confine charged particles with magnetic …", "url": "https://phys.org/news/2024-11-family-optimized-omnigenous-magnetic-fields.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/a-new-family-of-optimi.jpg", "publishedAt": "2024-11-15T12:50:01Z", "content": "Physicists have been trying to design fusion reactors, technologies that can generate energy via nuclear fusion processes, for decades. The successful realization of fusion reactors relies on the abi… [+5367 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronaut’s ‘Lightbulb Moment’ in Space Reveals Humanity’s Biggest ‘Lie’ - The Daily Galaxy --Great Discoveries Channel", "description": "From the breathtaking beauty of Earth's thin atmosphere to the stark realization of humanity's misplaced priorities, astronaut Ronald Garan unveils the \"lie\" we all live by. His revelations challenge the very foundations of modern society. What did he see fro…", "url": "https://dailygalaxy.com/2024/11/astronauts-lightbulb-moment-in-space-reveals-humanitys-biggest-lie/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/astronaut-ronald-garan-in-space-.jpg", "publishedAt": "2024-11-15T12:31:38Z", "content": "Former NASA astronaut Ronald Garan experienced a profound shift in perspective during his time in space, uncovering what he described as a lie underpinning life on Earth. After spending a total of 17… [+2383 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "", "title": "Impulse Space buys three Falcon 9 launches - SpaceNews", "description": "Impulse Space has purchased three Falcon 9 launches for its Helios transfer vehicle for missions starting in 2026, including one for the Space Force.", "url": "https://spacenews.com/impulse-space-buys-three-falcon-9-launches/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/01/impulse-helios.jpg?resize=1200%2C1125&ssl=1", "publishedAt": "2024-11-15T12:21:43Z", "content": "WASHINGTON Impulse Space has purchased three Falcon 9 launches for its Helios transfer vehicle for missions starting in 2026, including one for the Space Force.\r\nImpulse Space announced Nov. 14 that … [+2330 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Where do fast radio bursts come from? Astronomers tie mysterious eruptions to massive galaxies - Livescience.com", "description": "Fast radio bursts — powerful and poorly understood cosmic eruptions — tend to occur in massive galaxies that host long-dead stars known as magnetars, a new study suggests.", "url": "https://www.space.com/the-universe/where-do-fast-radio-bursts-come-from-astronomers-tie-mysterious-eruptions-to-massive-galaxies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Bx4DH8cP2VSYs8CPc8BbBd-1200-80.gif", "publishedAt": "2024-11-15T12:00:00Z", "content": "Every day, invisible to the human eye, thousands of enigmatic flashes of cosmic energy known as fast radio bursts (FRBs) erupt across the sky, releasing as much energy in milliseconds as the sun does… [+2849 chars]"}, {"source": {"id": null, "name": "Android Authority"}, "author": null, "title": "Want to keep making money on Google Opinion Rewards? You'll need to accept this change - Android Authority", "description": "Google Opinion Rewards is prompting users to share their location with Google as the company transitions to on-device Timeline. Read on!", "url": "https://www.androidauthority.com/google-opinion-rewards-timeline-location-change-3499939/", "urlToImage": "https://www.androidauthority.com/wp-content/uploads/2023/05/Google-Opinion-Rewards-logo-on-smartphone-next-to-money-Stock-photo-2.jpg", "publishedAt": "2024-11-15T10:57:23Z", "content": "<ul><li>Google Opinion Rewards is prompting users to consent to processing their location data in order to continue presenting location-based surveys to let users earn Google Play credit.</li><li>Thi… [+2256 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ADITHI RAMAKRISHNAN", "title": "The far side of the moon once had erupting volcanoes too - The Associated Press", "description": "New research confirms volcanoes were erupting on the far side of the moon billions of years ago. Researchers analyzed lunar soil brought back by China’s Chang’e-spacecraft and found fragments of volcanic rock that were about 2.8 billion years old. The oldest …", "url": "https://apnews.com/article/moon-volcano-far-side-china-5ac2d80e9f715f728f8c3be2caf56797", "urlToImage": "https://dims.apnews.com/dims4/default/0568c70/2147483647/strip/true/crop/1280x720+0+40/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3b%2Fb0%2F3b4627d2658a584a040d6f540707%2Fde20e90ebff34063b61da79a44ab7c70", "publishedAt": "2024-11-15T10:02:00Z", "content": "NEW YORK (AP) Volcanoes were erupting on the mysterious far side of the moon billions of years ago just like on the side that we can see, new research confirms. \r\nResearchers analyzed lunar soil brou… [+1844 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ludovic EHRET, Luna LIN", "title": "China tests building Moon base with lunar soil bricks - Phys.org", "description": "China is seeking to push forward in its quest to build the first lunar base, launching an in-space experiment to test whether the base's bricks could be made from the Moon's own soil.", "url": "https://phys.org/news/2024-11-china-moon-base-lunar-soil.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/beijing-which-has-pour-1.jpg", "publishedAt": "2024-11-15T09:20:01Z", "content": "China is seeking to push forward in its quest to build the first lunar base, launching an in-space experiment to test whether the base's bricks could be made from the Moon's own soil.\r\nA cargo rocket… [+3959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Astonishing Results” – Scientists Reveal Secrets of Mysterious 22-Million-Year-Old Dolphin Skull - SciTechDaily", "description": "A newly discovered dolphin species from 22 million years ago shows evidence of early echolocation, akin to modern dolphins' hearing abilities. A team of researchers led by SNSB paleontologist Gertrud Rößner has discovered a new prehistoric dolphin species. Th…", "url": "https://scitechdaily.com/?p=431630", "urlToImage": "https://scitechdaily.com/images/Fossil-Dolphin-Romaleodelphis-pollerspoecki.jpg", "publishedAt": "2024-11-15T09:15:55Z", "content": "Fossil dolphin Romaleodelphis pollerspoecki. Credit: M. Schellenberger, SNSB-BSPG\r\nA newly discovered dolphin species from 22 million years ago shows evidence of early echolocation, akin to modern do… [+4370 chars]"}, {"source": {"id": null, "name": "Europeanspaceflight.com"}, "author": "Andrew Parsonson", "title": "ESA Releases Findings of Super Heavy-Lift Rocket Studies - European Spaceflight", "description": "ESA has revealed that the results of its European super heavy-lift rockets studies show that development is “possible in principle.”", "url": "https://europeanspaceflight.com/esa-releases-findings-of-super-heavy-lift-rocket-studies/", "urlToImage": "https://europeanspaceflight.com/wp-content/uploads/2024/11/ESA-Release-Findings-of-Super-Heavy-Lift-Rocket-Studies.jpg", "publishedAt": "2024-11-15T08:47:46Z", "content": "Rocket Factory Augsburg\r\nThe European Space Agency has revealed the findings of a pair of studies it commissioned to explore how Europe could develop a rocket capable of delivering 100 tonnes to low … [+2766 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Scientists turn blood into bone-repairing superpower to fight injuries, diseases - Interesting Engineering", "description": "These peptide-based materials material can be shaped and molded into various forms, making them adaptable for different types of injuries.", "url": "https://interestingengineering.com/science/scientists-turn-blood-into-bone-repairing-material", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/11/blood.jpg", "publishedAt": "2024-11-15T08:08:00Z", "content": "This could open doors to personalized regenerative treatments, such as 3D-printed implants, to address various injuries and illnesses.\r\nFor years, scientists have been looking at synthetic approaches… [+754 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Stunningly Preserved Saber-Toothed Kitten Studied in World First - ScienceAlert", "description": "For some 37,000 years, the soft, furry body of a three-week-old saber-toothed 'kitten' lay cradled by Arctic permafrost, its head, limbs, paws, and torso remaining almost perfectly preserved by the cold.", "url": "https://www.sciencealert.com/stunningly-preserved-saber-toothed-kitten-studied-in-world-first", "urlToImage": "https://www.sciencealert.com/images/2024/11/SaberToothedKittenMummy.jpg", "publishedAt": "2024-11-15T06:29:39Z", "content": "For some 37,000 years, the soft, furry body of a three-week-old saber-toothed 'kitten' lay cradled by Arctic permafrost, its head, limbs, paws, and torso remaining almost perfectly preserved by the c… [+3967 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Mysterious Flashes Traced to Cosmic Cloud's Encounter With Merging Black Holes - ScienceAlert", "description": "In March 2021, astronomers observed a high-energy burst of light from a distant galaxy.", "url": "https://www.sciencealert.com/mysterious-flashes-traced-to-cosmic-clouds-encounter-with-merging-black-holes", "urlToImage": "https://www.sciencealert.com/images/2024/11/black_hole_binary_green_swirl.jpg", "publishedAt": "2024-11-15T01:41:19Z", "content": "In March 2021, astronomers observed a high-energy burst of light from a distant galaxy. Assigned the name AT 2021hdr, it was thought to be a supernova.\r\nHowever, there were enough interesting feature… [+1839 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA rockets seed artificial clouds below glowing auroras in Norway (photo) - Space.com", "description": "\"When I saw the rocket launch, I was very surprised. I assumed it was a very strange kind of cloud.\"", "url": "https://www.space.com/the-universe/earth/nasa-rockets-seed-artificial-clouds-below-glowing-auroras-in-norway-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Z3gsDngr5tfkg3opaTmsB4-1200-80.jpg", "publishedAt": "2024-11-14T21:59:52Z", "content": "It's not every day you get to watch a rocket launch into a sky glowing with colorful auroras — and it's even rarer to see that rocket leave swirling clouds in its wake as part of a NASA science exper… [+2843 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Identify Misunderstanding about Uranus - VOA Learning English", "description": "When Voyager 2 flew past Uranus in 1986, it observed the planet under unusual conditions. Now scientists are correcting the misunderstandings that observation created about the planet Uranus.", "url": "https://learningenglish.voanews.com/a/scientists-identify-misunderstanding-about-uranus/7862519.html", "urlToImage": "https://gdb.voanews.com/b866f7af-b6b1-4a5b-a65b-ec143da00494_w1200_r1.jpg", "publishedAt": "2024-11-14T21:55:00Z", "content": "In 1781, German-born British astronomer William Herschel made Uranus the first planet discovered with a telescope. But, 243 years later, we still do not know much about this cold planet, the third la… [+4041 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Rachel Harrison", "title": "Mathematical approach can predict crystal structure in hours instead of months - Phys.org", "description": "Researchers at New York University have devised a mathematical approach to predict the structures of crystals—a critical step in developing many medicines and electronic devices—in a matter of hours using only a laptop, a process that previously took a superc…", "url": "https://phys.org/news/2024-11-mathematical-approach-crystal-hours-months.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/scientists-use-math-to.jpg", "publishedAt": "2024-11-14T21:38:51Z", "content": "Researchers at New York University have devised a mathematical approach to predict the structures of crystalsa critical step in developing many medicines and electronic devicesin a matter of hours us… [+6127 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Sarah Johnson", "title": "Mysterious Hole on Google Maps Baffles Experts: Unraveling the Geological Enigma! - Glass Almanac", "description": "Sometimes, significant scientific findings occur entirely by chance. This was exactly the case with the recent discovery of a mysterious hole in Quebec. Unveiled through Google ... Continue Reading →", "url": "https://glassalmanac.com/mysterious-hole-on-google-maps-baffles-experts-unraveling-the-geological-enigma/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2024/11/Mysterious-Hole-on-Google-Maps-Baffles-Experts-Unraveling-the-Geological.jpg", "publishedAt": "2024-11-14T21:35:35Z", "content": "Sometimes, significant scientific findings occur entirely by chance. This was exactly the case with the recent discovery of a mysterious hole in Quebec. Unveiled through Google Maps, this geological … [+2085 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Paola Rosa-Aquino", "title": "What you didn't know about the first time we tried to contact aliens - National Geographic", "description": "In 1974, astronomers sent a call out into the cosmos from a massive telescope in Puerto Rico. The anniversary of the message brings reflections on a new missive to the stars and grief for a lost observatory.", "url": "https://www.nationalgeographic.com/science/article/arecibo-message-alien-extraterrestrial-communication", "urlToImage": "https://i.natgeofe.com/n/afd6cf49-a66f-467c-be4d-9b726079ed9c/2DFRN3T_16x9.jpg?w=1200", "publishedAt": "2024-11-14T21:28:16Z", "content": "In this new era in the hunt for alien life, Arecibo Observatory researchers launched a competition in 2018 to compose an updated message. This time, a new generation of scientists had the tantalizing… [+1864 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Neural Flexibility: Prioritizing Memories to Guide Behavior - Neuroscience News", "description": "Male worms can activate two conflicting memories—mating and starvation—when encountering the same odor, but only one influences their behavior.", "url": "https://neurosciencenews.com/conflicting-memory-behavior-28052/", "urlToImage": "https://neurosciencenews.com/files/2024/11/neural-flexibility-memory-neurosicence.jpg", "publishedAt": "2024-11-14T21:18:52Z", "content": "Summary: Male worms can activate two conflicting memoriesmating and starvationwhen encountering the same odor, but only one influences their behavior. A study conditioned worms to associate the smell… [+6704 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Brenna Cooper", "title": "Heartbreaking mystery of first ever space dog who would tragically 'never come back' to Earth - LADbible", "description": "Here is the heartbreaking story of Laika, the soviet dog who became the first animal to orbit the Earth in 1957.", "url": "https://www.ladbible.com/community/laika-soviet-space-dog-story-286444-20241114", "urlToImage": "https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/bltcd74acc1d0a99f3a/blteecbd07c5d1c9183/673657df93dccb80843d925b/first-dog-space-died.png", "publishedAt": "2024-11-14T21:07:42Z", "content": "Here is the heartbreaking story of Laika, the first living being to orbit Earth from space.\r\nWhen it comes to stories about the space race between the USA and the Soviet Union, we're all aware of sto… [+2708 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Circuits Behind Psychedelics’ Anti-Anxiety Power Decoded - Neuroscience News", "description": "New research has identified distinct neural circuits for the anti-anxiety and hallucinogenic effects of psychedelics.", "url": "https://neurosciencenews.com/anxiolitic-psychedelics-hallucinations-28050/", "urlToImage": "https://neurosciencenews.com/files/2024/11/anxiety-psychedelics-hallucinations-neurosicence.jpg", "publishedAt": "2024-11-14T20:32:26Z", "content": "Summary: New research has identified distinct neural circuits for the anti-anxiety and hallucinogenic effects of psychedelics. Using the psychedelic DOI in mice, researchers demonstrated that anxiety… [+7871 chars]"}, {"source": {"id": null, "name": "Channel3000.com - WISC-TV3"}, "author": "Maggie Ginsberg", "title": "Madison woman gets new species named after her - Channel3000.com - WISC-TV3", "description": "Researcher names newly discovered trilobite from 430-million-year-old collection after the UW curator who’s devoted 15 years to preserving it.", "url": "https://www.channel3000.com/madison-magazine/madison-woman-gets-new-species-named-after-her/article_260818e4-a2b9-11ef-826f-c74df4273019.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/channel3000.com/content/tncms/assets/v3/editorial/0/54/0546bf00-a2bb-11ef-83ce-ef07ebb6c02e/673649bf936ce.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2024-11-14T20:30:00Z", "content": "Imagine this: Its 1984, and two amateur paleontologists are digging in a quarry near Waukesha when they discover what ultimately turns out to be about 2,000 invertebrate fossils things like soft-bodi… [+4677 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Asteroid pieces brought to Earth help reveal how our solar system's planets and moons grew - Space.com", "description": "'We're showing that, everywhere we look now, there was some sort of magnetic field that was responsible for bringing mass to where the sun and planets were forming.'", "url": "https://www.space.com/the-universe/asteroids/asteroid-pieces-brought-to-earth-help-reveal-how-our-solar-systems-planets-and-moons-grew", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BitfP8CSjQr9DGvxxrwXAb-1200-80.jpg", "publishedAt": "2024-11-14T20:00:00Z", "content": "Samples collected from the near-Earth asteroid Ryugu have revealed clues about a primordial magnetic field that helped asteroids, planets and moons grow in our solar system.\r\nAnalysis of three grains… [+4733 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Loura Hall", "title": "Precision Pointing Goes the Distance on NASA Experiment - NASA", "description": "One year ago today, the future of space communications arrived at Earth as a beam of light from a NASA spacecraft nearly 10 million miles away. That’s 40", "url": "https://www.nasa.gov/directorates/stmd/precision-pointing-goes-the-distance-on-nasa-experiment/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/11/1-dsoc-uplink.webp", "publishedAt": "2024-11-14T19:21:45Z", "content": "One year ago today, the future of space communications arrived at Earth as a beam of light from a NASA spacecraft nearly 10 million miles away. Thats 40 times farther than our Moon. Thats like using … [+3911 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Brilliant fireball explodes over North America as satellites capture flash from space (video) - Space.com", "description": "The American Meteor Society received 170 different witness reports about the fireball.", "url": "https://www.space.com/stargazing/meteors-showers/brilliant-fireball-explodes-over-north-america-as-satellites-watch-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rMJayfqgAy9mkh6u3NMZEi-1200-80.jpg", "publishedAt": "2024-11-14T18:04:24Z", "content": "Another fireball lit up the skies this week, this time over the U.S. Midwest and parts of Canada —  but unlike the last one, this one came from outer space.\r\nThe meteor burned up on the morning of No… [+3808 chars]"}, {"source": {"id": null, "name": "My Modern Met"}, "author": "Regina Sienra", "title": "Best New Photos of Jupiter From the Latest Flyby of NASA’s Juno Spacecraft - My Modern Met", "description": "These images are out of this world!", "url": "https://mymodernmet.com/new-photos-of-jupiter-juno-spacecraft/", "urlToImage": "https://mymodernmet.com/wp/wp-content/uploads/2024/11/junocam-jupiter-photos-fb.jpg", "publishedAt": "2024-11-14T17:38:54Z", "content": "Photo: NASA / JPL / SwRI / MSSS / Gerald Eichstädt / Thomas Thomopoulos © (CC BY 3.0)\r\nNASA's Juno mission completed its 66th close passage to Jupiter—also known as perijove—on October 23. The spacec… [+3903 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NASA", "title": "Hubble sees aftermath of galaxy's scrape with Milky Way - Phys.org", "description": "A story of survival is unfolding at the outer reaches of our galaxy, and NASA's Hubble Space Telescope is witnessing the saga.", "url": "https://phys.org/news/2024-11-hubble-aftermath-galaxy-milky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/nasas-hubble-sees-afte.jpg", "publishedAt": "2024-11-14T17:38:03Z", "content": "A story of survival is unfolding at the outer reaches of our galaxy, and NASA's Hubble Space Telescope is witnessing the saga.\r\nThe Large Magellanic Cloud, also called the LMC, is one of the Milky Wa… [+5544 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Mysterious ‘Pet Cloud’ Above New Zealand Stuns NASA’s Satellites - The Daily Galaxy --Great Discoveries Channel", "description": "A rare cloud formation, recently captured by NASA's Landsat 8 satellite, has mesmerized both locals and scientists alike. Shaped by unique winds over New Zealand's Otago region, this cloud has roots in weather lore dating back to the 1890s.", "url": "https://dailygalaxy.com/2024/11/mysterious-pet-cloud-above-new-zealand-stuns-nasas-satellites/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/11/Taieri-Pet-NZ-Cloud.jpg", "publishedAt": "2024-11-14T17:37:56Z", "content": "A rare and ethereal cloud formation, nicknamed the “Taieri Pet”, recently captivated onlookers from Earth and beyond as NASAs satellites captured a stunning image of this phenomenon over New Zealands… [+3788 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "A proposed experiment to test whether gravity behaves as a quantum entity when measured - Phys.org", "description": "A multi-institutional team of physicists is proposing an experiment to test whether gravity behaves as a quantum entity when measured. They published a description of their experiment in the journal Physical Review Letters and state that once a means for cond…", "url": "https://phys.org/news/2024-11-gravity-quantum-entity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/a-proposed-experiment.jpg", "publishedAt": "2024-11-14T17:30:02Z", "content": "A multi-institutional team of physicists is proposing an experiment to test whether gravity behaves as a quantum entity when measured. They published a description of their experiment in the journal … [+2611 chars]"}, {"source": {"id": null, "name": "Off Tackle Empire"}, "author": "ZuzuRU", "title": "B1G Power Poll, Week 11: Whales - Off Tackle Empire", "description": "Whale, whale, whale what do we have here?", "url": "https://www.offtackleempire.com/2024/11/14/24295709/big-ten-conferece-college-football-power-poll-rankings-week-11-whales-dolphins", "urlToImage": "https://cdn.vox-cdn.com/thumbor/qISarym8O3h8Jt1QYNfMM58c9lk=/0x0:3174x1662/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25733520/Big_Ten_Whale_Poll_Cover_02.png", "publishedAt": "2024-11-14T17:00:00Z", "content": "EIGHTEEN TEAMS GOD.\r\nAnyway! As you all know I, Dr. Zuzu, feel an intense obligation to do a science-themed Power Poll each year. Since 2015 I have given you Dinosaurs, Non-Dinosaur Extinct Animals, … [+11546 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Chicago", "title": "Latest findings from the South Pole Telescope bolster standard cosmological model - Phys.org", "description": "Roughly 400,000 years after the Big Bang, the universe cooled just enough to allow photons to escape from the primordial cosmological soup. Over the next 14 billion years, these ancient photons—the universe's first light—continued traveling. This relic light …", "url": "https://phys.org/news/2024-11-latest-south-pole-telescope-bolster.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/latest-findings-from-t.jpg", "publishedAt": "2024-11-14T16:31:04Z", "content": "Roughly 400,000 years after the Big Bang, the universe cooled just enough to allow photons to escape from the primordial cosmological soup. Over the next 14 billion years, these ancient photonsthe un… [+6539 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Caroline Delbert", "title": "Scientists Discovered the Secret to Perfect Cell Division - Yahoo! Voices", "description": "Without it, we wouldn’t exist.", "url": "https://www.popularmechanics.com/science/a62896803/perfect-cell-division/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/QkBjNm1i7H.s0MeXRdvM5Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/popular_mechanics_642/4c17a0ed792984af2d5676b786218443", "publishedAt": "2024-11-14T16:05:00Z", "content": "<ul><li>Just one enzyme manages the refilling of the cellular soda machine that replicates our genes.\r\n</li><li>PLK-1 initiates a process in two protein groups, leading to creation of new CENP-A prot… [+3790 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Altering two genes to produce sweeter tomatoes without sacrificing size, weight or yield - Phys.org", "description": "A team of horticulturists, bio-breeders and agriculture specialists affiliated with a host of institutions across China has produced sweeter tomatoes without sacrificing size, weight or yield by altering two of their genes. In their study, published in the jo…", "url": "https://phys.org/news/2024-11-genes-sweeter-tomatoes-sacrificing-size.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/altering-two-tomato-ge.jpg", "publishedAt": "2024-11-14T15:50:02Z", "content": "A team of horticulturists, bio-breeders and agriculture specialists affiliated with a host of institutions across China has produced sweeter tomatoes without sacrificing size, weight or yield by alte… [+2787 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Scientists discover life in the most uninhabitable place on Earth - Study Finds", "description": "Researchers have found evidence of living microbes thriving in one of the most inhospitable environments on Earth - the Atacama Desert of Chile.", "url": "https://studyfinds.org/life-most-uninhabitable-place/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2024/11/atacama-desert-scaled.jpg", "publishedAt": "2024-11-14T15:12:03Z", "content": "The researchers aimed to understand the microbial communities in the extremely dry Atacama Desert. They collected soil samples at different locations across a moisture gradient, from the coastal area… [+2632 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rewriting Textbooks: Geologists Uncover New Secrets in the Ancient Layers of the Grand Canyon - SciTechDaily", "description": "Armed with advanced technology, decades of expertise, and insights from an NSF-funded study, a multi-institution team of geoscientists offer innovative, updated perspectives of an iconic sedimentary record. Anyone from the Boomer generation to Gen X, Millenni…", "url": "https://scitechdaily.com/rewriting-textbooks-geologists-uncover-new-secrets-in-the-ancient-layers-of-the-grand-canyon/", "urlToImage": "https://scitechdaily.com/images/Grand-Canyon.jpg", "publishedAt": "2024-11-14T15:07:43Z", "content": "Edwin McKee’s groundbreaking work on the Grand Canyon’s geology has been revisited by a modern team, revealing new insights into ancient climate and life. This research highlights the evolving nature… [+4984 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Stranded NASA Astronaut Hits Back Against Comments About Her Weight - Futurism", "description": "NASA is in the middle of another health debacle after one of its astronauts hit back against rumors that she'd lost too much weight in space.", "url": "https://futurism.com/the-byte/nasa-starliner-astronaut-weight-rumors", "urlToImage": "https://wordpress-assets.futurism.com/2024/11/nasa-starliner-astronaut-weight-rumors.jpg", "publishedAt": "2024-11-14T15:05:42Z", "content": "\"HIPAA laws apparently apply to NASA, too.\"\r\nEff Off\r\nNASA seems to be in the middle of another health debacle after one of its astronauts was forced to hit back against rumors that she'd lost too mu… [+3326 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Ashley Balzer", "title": "Telescope for NASA’s Roman Mission Complete, Delivered to Goddard - NASA", "description": "NASA’s Nancy Grace Roman Space Telescope is one giant step closer to unlocking the mysteries of the universe. The mission has now received its final major", "url": "https://www.nasa.gov/missions/roman-space-telescope/telescope-for-nasas-roman-mission-complete-delivered-to-goddard/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/11/ioa-005.jpg", "publishedAt": "2024-11-14T15:00:00Z", "content": "NASAs Nancy Grace Roman Space Telescope is one giant step closer to unlocking the mysteries of the universe. The mission has now received its final major delivery: the Optical Telescope Assembly, whi… [+5233 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "NASA Is Laying Off Hundreds of Employees Again - Futurism", "description": "NASA is laying off hundreds of employees at its Jet Propulsion Laboratory in California, in response to a lower budget.", "url": "https://futurism.com/the-byte/nasa-jpl-laying-off-hundreds", "urlToImage": "https://wordpress-assets.futurism.com/2024/11/nasa-jpl-laying-off-hundreds.jpg", "publishedAt": "2024-11-14T14:08:26Z", "content": "Grim.\r\nPunching Bag\r\nNASA is undergoing another round of layoffs. And once again, it's the space agency's famous Jet Propulsion Laboratory in California that's taking the hit.\r\nOn Tuesday, JPL announ… [+2588 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "'God of Darkness' asteroid will pass so close it is expected to get 'the shakes' - The Jerusalem Post", "description": "When Apophis was discovered in 2004, initial calculations indicated that it could approach Earth with a risk of collision.", "url": "https://www.jpost.com/science/science-around-the-world/article-828910", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/633952", "publishedAt": "2024-11-14T13:46:00Z", "content": "A recent study led by Ronald-Louis Ballouz from Johns Hopkins University Applied Physics Laboratory suggests that the asteroid 99942 Apophis may experience tremors—similar to earthquakes—due to Earth… [+4462 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Skyler Ware", "title": "'Edge of chaos' neuroscience theory could lead to superfast computing chips that behave like superconductors - Livescience.com", "description": "By tapping into the enigmatic theory of how neurons transmit signals, scientists have proven they can one day build computer chips with near-zero electrical resistance.", "url": "https://www.livescience.com/technology/electronics/edge-of-chaos-neuroscience-theory-could-lead-to-superfast-computing-chips-that-behave-like-superconductors", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UDkxV975d7DX3UytgPQFNG-1200-80.jpg", "publishedAt": "2024-11-14T13:00:00Z", "content": "By walking a tightrope between order and chaos, researchers could one day make computer chips work more like the human brain.\r\nResearchers created conditions at the \"edge of chaos,\" a transition poin… [+3320 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "3D map reveals our solar system's local bubble has an 'escape tunnel' - Livescience.com", "description": "A 3D map of our cosmic neighborhood has revealed hot and cold regions as well as an \"escape tunnel\" from our local bubble.", "url": "https://www.space.com/milky-way-hot-cold-local-bubble-supernovas", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EtU2VdZBL6LwNaXbZZLsNJ-1200-80.jpg", "publishedAt": "2024-11-14T12:00:00Z", "content": "Using data from the eROSITA All-Sky Survey, astronomers have created a 3D map of the low-density bubble of X-ray-emitting, million-degree hot gas that surrounds the solar system.\r\nThe investigation h… [+6545 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Scientists Took Semen Onto A \"Vomit Comet\" Flight, And The Results Were Concerning - IFLScience", "description": "This could have big implications for human reproduction in spaceflight.", "url": "https://www.iflscience.com/scientists-took-semen-onto-a-vomit-comet-flight-and-the-results-were-concerning-76774", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76774/aImg/80207/flight-meta.png", "publishedAt": "2024-11-14T11:47:21Z", "content": "Right now, space travel is limited to trained astronauts and cosmonauts, and the super-wealthy. This means there is little opportunity for having a little zero-g intercourse unless you don't mind doi… [+3246 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Mario Hubert", "title": "On seeing the laws of nature as a recipe or a news report - Aeon", "description": "Physicists and philosophers today have formulated three opposing models that explain how laws work. Which is the best?", "url": "https://aeon.co/essays/on-seeing-the-laws-of-nature-as-a-recipe-or-a-news-report", "urlToImage": "https://images.aeonmedia.co/images/293dfee5-a2e1-41f9-82d6-c8ce36645448/test-nyc27030.jpg?width=1200&quality=75&format=auto", "publishedAt": "2024-11-14T11:00:31Z", "content": "The Sun rises every day. Water boils at 100°C. Apples fall to the ground. We live in a world in which objects behave the same given the same circumstances. We can imagine living in a different world:… [+16699 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Could a supernova ever destroy Earth? - Space.com", "description": "To estimate how close a supernova would have to be to cause serious damage to Earth, we must first look at a supernova's destructive capabilities.", "url": "https://www.space.com/the-universe/stars/could-a-supernova-ever-destroy-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GvsEMYP5uJHJQdoCMbG3re-1200-80.jpg", "publishedAt": "2024-11-14T10:59:29Z", "content": "When the bright star Betelgeuse explodes, it will be an impressive sight. The stellar explosion, known as a supernova, will be brighter than any planet and almost as bright as the full moon. It will … [+6721 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ana Altchek", "title": "The billionaire CEO who made history with SpaceX describes facing the 'vacuum of death' in only a spacesuit - Business Insider", "description": "The SpaceX astronaut Jared Isaacman says frequent space travel is \"around the corner.\" How humans will survive off-world is another question.", "url": "https://www.businessinsider.com/spacex-jared-isaacman-interview-polaris-dawn-space-walk-2024-11", "urlToImage": "https://i.insider.com/672ce39588cea3ba1c1ee9a0?width=1200&format=jpeg", "publishedAt": "2024-11-14T08:00:00Z", "content": "Jared Isaacman's second trip to space felt different.\r\nThe billionaire CEO of the payments company Shift4 made history two months ago when he opened up the hatch on a SpaceX rocket ship and stepped i… [+6499 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 20 Starlink satellites from California (video) - Space.com", "description": "Liftoff occurred at 12:23 a.m. EST on Thursday (Nov. 14).", "url": "https://www.space.com/spacex-starlink-launch-group-9-11", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZUgtBN9a5ytNwaq8gxybWP-1200-80.jpg", "publishedAt": "2024-11-14T05:38:13Z", "content": "SpaceX launched another batch of its Starlink internet satellites from California's central coast on Thursday (Nov. 14).\r\nA Falcon 9 rocket carrying 20 Starlink spacecraft, including 13 with direct-t… [+1672 chars]"}]}