{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "NASA Confirms It Has Lost Contact With Mars Orbiter MAVEN - ScienceAlert", "description": "NASA has officially lost contact with a spacecraft that has been orbiting Mars since 2014.", "url": "https://www.sciencealert.com/nasa-confirms-it-has-lost-contact-with-mars-orbiter-maven", "urlToImage": "https://www.sciencealert.com/images/2025/12/maven-1.jpg", "publishedAt": "2025-12-11T03:34:21Z", "content": "NASA has officially lost contact with a spacecraft that has been orbiting Mars since 2014.\r\nThe MAVEN spacecraft Mars Atmosphere and Volatile Evolution abruptly lost contact with Earth on 6 December … [+2350 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "See full bio", "title": "Is This the Moment? Scientists Detect a Signal That Might Be Dark Matter - CNET", "description": "Because dark matter is completely invisible to light, science had to look for clever new methods to spot it.", "url": "https://www.cnet.com/science/space/the-invisible-becomes-visible-scientists-may-have-finally-seen-dark-matter/", "urlToImage": "https://www.cnet.com/a/img/resize/07579875f087c853e17ef0193d0f5829d0884862/hub/2025/12/02/cf245967-e11b-41b1-915f-5fae335bcad9/nasa-dark-matter-and-dark-energy-graph.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2025-12-11T01:37:00Z", "content": "The universe is packed with riddles, but few are as stubborn—or as fascinating—as dark matter. First proposed in 1933 by astronomer Fritz Zwicky, this elusive substance refuses to play by the rules: … [+8214 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "How do you activate a supermassive black hole? A galaxy merger should do the trick - Space", "description": "\"This new approach can even reveal faint AGN that other identification methods will miss.\"", "url": "https://www.space.com/astronomy/how-do-you-activate-a-supermassive-black-hole-a-galaxy-merger-should-do-the-trick", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wnQvjVh8xWrhV4gqmCRqMd-1920-80.jpg", "publishedAt": "2025-12-10T23:00:00Z", "content": "Scientists have confirmed that colossal collisions between galaxies trigger titanic eruptions in the centers of those galaxies, and the discovery is thanks to an artificial intelligence tool that was… [+4946 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Mark Hallam", "title": "Signs of 400,000-year-old Neanderthal campfire found in UK - DW", "description": "Researchers excavating an ancient Neanderthal site in southern England found evidence not just of a hearth, but of its inhabitants bringing iron pyrite to the area specifically to enable them to light fires.", "url": "https://www.dw.com/en/signs-of-400000-year-old-neanderthal-campfire-found-in-uk/a-75098034", "urlToImage": "https://static.dw.com/image/75098225_6.jpg", "publishedAt": "2025-12-10T21:44:35Z", "content": "Archaeologists wrote in the journal Nature this week\r\nthat they have unearthed the oldest-known evidence of deliberate fire-making by prehistoric humans in the English county of Suffolk. \r\nThe hearth… [+4177 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jonathan Rees", "title": "Einstein's theory comes wrapped up with a bow: Astronomers spot star 'wobbling' around black hole - Phys.org", "description": "The cosmos has served up a gift for a group of scientists who have been searching for one of the most elusive phenomena in the night sky. Their study, presented in Science Advances, reports on the very first observations of a swirling vortex in spacetime caus…", "url": "https://phys.org/news/2025-12-einstein-theory-astronomers-star-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/einsteins-theory-comes-1.jpg", "publishedAt": "2025-12-10T19:59:33Z", "content": "The cosmos has served up a gift for a group of scientists who have been searching for one of the most elusive phenomena in the night sky. Their study, presented in Science Advances, reports on the ve… [+3883 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Q&A Before Closest Approach of 3I/ATLAS to Earth - Avi Loeb – Medium", "description": "Below is a Q&A list that combines questions from various reporters about the interstellar object 3I/ATLAS, a week before its closest…", "url": "https://avi-loeb.medium.com/q-a-before-closest-approach-of-3i-atlas-to-earth-6ed6e2917b0f", "urlToImage": "https://miro.medium.com/v2/resize:fit:1080/1*P4jw-pb-ChGZUncaxoNKQQ.jpeg", "publishedAt": "2025-12-10T19:28:13Z", "content": "Image of 3I/ATLAS on November 24, 2025 at 1:58 UTC from a 12-inch telescope in Namibia. North is to the right and the sunward direction is towards the upper left. The field of view is 75 by 100 arcmi… [+13444 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "New Species of Tiny Pumpkin Toadlet Discovered in Brazil's Cloud Forests - ScienceAlert", "description": "Deep in the mountains of southern Brazil, a bright orange frog, just over a centimeter long, hops into the spotlight.", "url": "https://www.sciencealert.com/new-species-of-tiny-pumpkin-toadlet-discovered-in-brazils-cloud-forests", "urlToImage": "https://www.sciencealert.com/images/2025/12/MiniatureFrog-1.jpg", "publishedAt": "2025-12-10T19:01:47Z", "content": "Deep in the mountains of southern Brazil, a bright orange frog, just over a centimeter long, hops into the spotlight.\r\nThe tiny pumpkin toadlet is a whole new, toad-like species of frog, never formal… [+3096 chars]"}, {"source": {"id": null, "name": "St George News"}, "author": "Written by Cody Blowers", "title": "Look up: Geminids meteor shower to peak over Southern Utah, with interstellar comet and Ursids close behind - St. George News", "description": "Southern Utah’s night skies are about to put on a show. The Geminids — considered by many the year’s most dazzling meteor shower — peak this weekend, while a visit", "url": "https://www.stgeorgeutah.com/news/look-up-geminids-meteor-shower-to-peak-over-southern-utah-with-interstellar-comet-and-ursids/article_881cdc3b-ca42-4cca-b0b3-ad700747d3af.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/stgeorgeutah.com/content/tncms/assets/v3/editorial/8/81/881cdc3b-ca42-4cca-b0b3-ad700747d3af/6938614abd188.social.png", "publishedAt": "2025-12-10T18:34:19Z", "content": "Southern Utahs night skies are about to put on a show. The Geminids considered by many the years most dazzling meteor shower peak this weekend, while a visit from interstellar comet 3I-ATLAS and a sm… [+3940 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gesine Steiner", "title": "Cats' purrs reveal who's who better than their meows - Phys.org", "description": "A new study by researchers from the Museum für Naturkunde Berlin and the University of Naples Federico II shows a domestic cat's purr reveals far more about its individual identity than its meow. While meows are highly flexible and vary strongly depending on …", "url": "https://phys.org/news/2025-12-cats-purrs-reveal-meows.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/cats-purrs-reveal-whos.jpg", "publishedAt": "2025-12-10T18:11:49Z", "content": "A new study by researchers from the Museum für Naturkunde Berlin and the University of Naples Federico II shows a domestic cat's purr reveals far more about its individual identity than its meow. Whi… [+3724 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Scientists Find Human Footprints in New Mexico Emerging from the Mud - The Daily Galaxy", "description": "Ancient footprints, preserved in mud and dating back tens of thousands of years, the details are waiting to be uncovered.", "url": "https://dailygalaxy.com/2025/12/human-footprints-emerging-from-the-mud/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/12/Scientists-Find-Human-Footprints-in-New-Mexico-Emerging-from-the-Mud-scaled.jpg", "publishedAt": "2025-12-10T17:45:00Z", "content": "Ancient footprints discovered in White Sands, New Mexico, are challenging long-held beliefs about when humans first arrived in North America. These prints, preserved in ancient mud, date back to the … [+3074 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "The deep ocean is fixing carbon in ways no one expected - ScienceDaily", "description": "Researchers have uncovered surprising evidence that the deep ocean’s carbon-fixing engine works very differently than long assumed. While ammonia-oxidizing archaea were thought to dominate carbon fixation in the sunless depths, experiments show that other mic…", "url": "https://www.sciencedaily.com/releases/2025/12/251210092024.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/abstract-fractal-bioluminescent-biology-microbes.webp", "publishedAt": "2025-12-10T16:37:38Z", "content": "In an effort to better understand how the ocean stores carbon, researchers at UC Santa Barbara and their collaborators have uncovered results that challenge long-held ideas about how carbon dioxide i… [+6188 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Observation of deuteron and antideuteron formation from resonance-decay nucleons - Nature", "description": "The ALICE Collaboration provides details on the microscopic mechanism that ends up creating antideuteron in high-energy proton–proton collisions at the Large Hadron Collider.", "url": "https://www.nature.com/articles/s41586-025-09775-5", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09775-5/MediaObjects/41586_2025_9775_Fig1_HTML.png", "publishedAt": "2025-12-10T16:13:51Z", "content": "<li>INFN Sezione di Bari, Bari, Italy\r\nS. Acharya, A. R. Altamura, M. T. Camerlingo, F. Colamaria, G. de Cataldo, D. Elia, S. Kumar, V. Manzari, A. Mastroserio, E. Nappi, A. Palasciano, R. N. Patra &… [+25538 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Ariana Garcia", "title": "Colossal fireball seen over 6 states, including Texas - Chron", "description": "A massive fireball meteor was seen over six states, including across Texas, on Tuesday night.", "url": "https://www.chron.com/news/space/article/fireball-meteor-texas-21234479.php", "urlToImage": "https://s.hdnux.com/photos/01/55/36/77/28700663/3/rawImage.jpg", "publishedAt": "2025-12-10T15:14:37Z", "content": "Saltwater Recon captured the massive fireball as it flashed across the Texas sky Tuesday night. \r\nSaltwater Recon\r\nA brilliant, electric streak of light tore across the night sky Tuesday, startling s… [+2260 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Uranus may have more in common with Earth than we thought, 40-year-old Voyager 2 probe data shows - Space", "description": "Revisiting old data from Voyager 2, scientists have worked out how a dense, shocked region of the solar wind could have manipulated Uranus' magnetosphere.", "url": "https://www.space.com/astronomy/uranus/uranus-may-have-more-in-common-with-earth-than-we-thought-40-year-old-voyager-2-probe-data-shows", "urlToImage": "https://cdn.mos.cms.futurecdn.net/wBastXmc4hmejFHLSRraxE-1920-80.jpg", "publishedAt": "2025-12-10T15:00:00Z", "content": "The Voyager 2 mission may have caught Uranus at a special time during which the ice giant's radiation belts were being supercharged with electrons accelerated by a similar process to what can drive g… [+5549 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "A NASA Scientist Thinks the ‘Star of Bethlehem’ Wasn’t a Star at All… But a Comet! - Indian Defence Review", "description": "A dazzling point of light that once guided the Magi has fascinated scientists and believers for centuries.", "url": "https://indiandefencereview.com/nasa-scientist-star-of-bethlehem-wasnt-star-but-comet/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/12/the-star-of-bethlehem.jpg", "publishedAt": "2025-12-10T14:30:00Z", "content": "For generations, people have been captivated by the biblical account of the bright “Star” that led the wise men to Bethlehem. Some view it as a miraculous sign, while others look for a natural explan… [+4256 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Joachim Keppler", "title": "Quantum clues to consciousness: New research suggests the brain may harness the zero-point field - Phys.org", "description": "What if your conscious experiences were not just the chatter of neurons, but were connected to the hum of the universe? In a paper published in Frontiers in Human Neuroscience, I present new evidence indicating that conscious states may arise from the brain's…", "url": "https://phys.org/news/2025-12-quantum-clues-consciousness-brain-harness.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/quantum-clues-to-consc.jpg", "publishedAt": "2025-12-10T14:20:04Z", "content": "What if your conscious experiences were not just the chatter of neurons, but were connected to the hum of the universe? In a paper published in Frontiers in Human Neuroscience, I present new evidence… [+5409 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Neutrino observatories show promise for detecting light dark matter - Phys.org", "description": "Dark matter is an elusive type of matter that does not emit, reflect or absorb light, yet is estimated to account for most of the universe's mass. Over the past decades, many physicists worldwide have been trying to detect this type of matter or signals assoc…", "url": "https://phys.org/news/2025-12-neutrino-observatories-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-highlights-the-p.jpg", "publishedAt": "2025-12-10T14:10:02Z", "content": "Dark matter is an elusive type of matter that does not emit, reflect or absorb light, yet is estimated to account for most of the universe's mass. Over the past decades, many physicists worldwide hav… [+8918 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Oxford", "title": "Ghostly solar neutrinos caught transforming carbon atoms deep underground - Phys.org", "description": "Neutrinos are one of the most mysterious particles in the universe, often called \"ghost particles\" because they rarely interact with anything else. Trillions stream through our bodies every second, yet leave no trace. They are produced during nuclear reaction…", "url": "https://phys.org/news/2025-12-ghostly-solar-neutrinos-caught-carbon.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-breakthrough-in-de-1.jpg", "publishedAt": "2025-12-10T14:00:10Z", "content": "Neutrinos are one of the most mysterious particles in the universe, often called \"ghost particles\" because they rarely interact with anything else. Trillions stream through our bodies every second, y… [+4365 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Zurich", "title": "Uranus and Neptune might be rock giants - Phys.org", "description": "A team of researchers from the University of Zurich and the NCCR PlanetS is challenging our understanding of the solar system planets' interior. The composition of Uranus and Neptune, the two outermost planets, might be more rocky and less icy than previously…", "url": "https://phys.org/news/2025-12-uranus-neptune-giants.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/neptune.jpg", "publishedAt": "2025-12-10T14:00:01Z", "content": "A team of researchers from the University of Zurich and the NCCR PlanetS is challenging our understanding of the solar system planets' interior. The composition of Uranus and Neptune, the two outermo… [+4201 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kenna Hughes-Castleberry", "title": "Extremely Large Telescope under construction photo of the day for Dec. 10, 2025 - Space", "description": "Once completed, this telescope will help usher in a new era of astronomy.", "url": "https://www.space.com/astronomy/extremely-large-telescope-under-construction-space-photo-of-the-day-for-dec-10-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/42UAiHggfF39cvNdH6hpuB-1920-80.jpg", "publishedAt": "2025-12-10T14:00:00Z", "content": "High up in the Chilean Andes, the Extremely Large Telescope\r\n (ELT) is set to become the world's largest optical telescope and one of the most ambitious scientific instruments ever built. Developed b… [+1816 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists discover a new state of matter at Earth’s center - ScienceDaily", "description": "New research reveals that Earth’s solid inner core is actually in a superionic state, where carbon atoms flow freely through a solid iron lattice. This unusual behavior makes the core soft, matching seismic observations that have puzzled scientists for decade…", "url": "https://www.sciencedaily.com/releases/2025/12/251209043053.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/earth-structure-layers.webp", "publishedAt": "2025-12-10T13:34:38Z", "content": "Beneath Earth's molten outer core is a dense central region -- the inner core, a compact sphere made of an iron and light-element alloy squeezed by more than 3.3 million atmospheres and heated to tem… [+4262 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "An industrial project in Chile threatens Earth's darkest sky. 28 leading astronomers signed an open letter urging to move it - Space", "description": "\"We might lose the ability to observe about 30% of the faintest galaxies. We are at the point of starting to be able to see details of exoplanet atmospheres, but if the sky gets brighter, we may not be able to see those details anymore.\"", "url": "https://www.space.com/astronomy/an-industrial-project-in-chile-threatens-earths-darkest-sky-28-leading-astronomers-signed-an-open-letter-urging-to-move-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ykvv2zVPGC7QfTCydQA9yf-1920-80.jpg", "publishedAt": "2025-12-10T13:00:00Z", "content": "German Nobel Prize-winning astrophysicist Reinhard Genzel has penned a letter urging the government of Chile to halt the development of a green hydrogen plant in the vicinity of one of the world's to… [+5073 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "99.9999999% Certainty: Astronomers Confirm a Discovery with Far-Reaching Consequences for the Universe's Fate - The Daily Galaxy", "description": "Ancient stars are quietly rewriting what we thought we knew about the universe’s brightest explosions. A new analysis uncovers a hidden age-driven bias in Type Ia supernovae, revealing a pattern that could shift how cosmic distances—and even cosmic history—ar…", "url": "https://dailygalaxy.com/2025/12/supernova-age-bias-hubble-measurement-update/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/12/Supernova-Breakthrough-Reveals-Hidden-Age-Bias-in-the-Cosmos-scaled.jpg", "publishedAt": "2025-12-10T12:45:00Z", "content": "For over two decades, cosmologists have believed that the universe is expanding at an accelerating pace, driven by a mysterious force called dark energy. This assumption has shaped modern theories of… [+4986 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "'Super-Jupiter' Exoplanets May Look Like Nothing We've Ever Seen - ScienceAlert", "description": "Jupiter is the largest planet in the Solar System.", "url": "https://www.sciencealert.com/super-jupiter-exoplanets-may-look-like-nothing-weve-ever-seen", "urlToImage": "https://www.sciencealert.com/images/2025/12/super_jupiter_header.jpg", "publishedAt": "2025-12-10T12:04:35Z", "content": "Jupiter is the largest planet in the Solar System. It's also one of the largest planets in the Universe. There are planets out there with much more mass, but thanks to gravity,they are generally dens… [+3155 chars]"}, {"source": {"id": null, "name": "Dailynous.com"}, "author": "Justin Weinberg", "title": "Editors at Springer’s Journal of Philosophical Logic Resign, Launch New Open Access Journal - Grandbet88", "description": "All of the editors-in-chief and associate editors of Springer Nature's Journal of Philosophical Logic have announced their immediate or pending resignation and the launch, as of today, of a new \"diamond\" open access journal, Philosophical Logic. It appears th…", "url": "https://dailynous.com/2025/12/10/editors-at-springers-journal-of-philosophical-logic-resign-launch-new-open-access-journal/", "urlToImage": "https://dailynous.com/wp-content/uploads/2025/12/philosophical-logic-journal.png", "publishedAt": "2025-12-10T12:04:22Z", "content": "All of the editors-in-chief and associate editors of Springer Nature’s Journal of Philosophical Logic have announced their immediate or pending resignation and the launch, as of today, of a new “diam… [+6178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Paddison", "title": "Underwater ‘storms’ are eating away at the Doomsday Glacier. It could have big impacts on sea level rise - CNN", "description": "Swirling underwater eddies are aggressively melting two Antarctic glaciers, a recent study found, including the one that could raise sea levels by multiple feet.", "url": "https://www.cnn.com/2025/12/10/climate/underwater-storms-melt-doomsday-pine-island-glaciers-antarctica", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/imagesearth20190130earth20190130-16.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-12-10T12:00:59Z", "content": "Swirling underwater storms are aggressively melting the ice shelves of two vital Antarctic glaciers, with potentially far-reaching implications for global sea level rise, according to a recent study.… [+4817 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Iain Todd", "title": "Photographer captures interstellar comet 3I/ATLAS glowing over Egypt's Black Desert - BBC Sky at Night Magazine", "description": "An image of the interstellar comet 3I/ATLAS photographed glowing in the night sky over Egypt's Black Desert.", "url": "https://www.skyatnightmagazine.com/news/interstellar-comet-3i-atlas-egypt-black-desert", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2025/12/3i-atlas-black-desert-egypt.jpg?w=1200", "publishedAt": "2025-12-10T11:54:56Z", "content": "Following its passage behind the Sun in autumn 2025, interstellar comet 3I/ATLAS is now visible in the winter night sky to those with a telescope.\r\nThe emergence of 3I/ATLAS into the night sky means … [+2775 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Award-Winning Photo Reveals Secret of Strange Spider's 'Shrink-Wrap' Web - ScienceAlert", "description": "An extreme close-up of the Australian rufous net-casting spider's unique silk, captured by biologist Martín Ramírez and his colleagues, reveals in intricate detail the material qualities that make this spider's net so effective.", "url": "https://www.sciencealert.com/award-winning-photo-reveals-secret-of-strange-spiders-shrink-wrap-web", "urlToImage": "https://www.sciencealert.com/images/2025/12/deinopis-subrufa.jpg", "publishedAt": "2025-12-10T11:03:45Z", "content": "An extreme close-up of the Australian rufous net-casting spider's unique silk, captured by biologist Martín Ramírez and his colleagues, reveals in intricate detail the material qualities that make th… [+2993 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": "Texas A&M University", "title": "Scientists Discover a Way to Recharge Aging Cells - SciTechDaily", "description": "Researchers have found a way to revive tired or damaged cells by giving them a fresh supply of mitochondria, the tiny structures that power cellular life.", "url": "https://scitechdaily.com/?p=503512", "urlToImage": "https://scitechdaily.com/images/Cell-Energy-Production-Mitochondria-Boost.jpg", "publishedAt": "2025-12-10T11:01:24Z", "content": "Nanoflower-boosted stem cells may rejuvenate failing tissues by delivering fresh, energy-rich mitochondria. Credit: SciTechDaily.com\r\nResearchers at Texas A&amp;M have found a way to revive tired or … [+6442 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hear dust devils on Mars crackle with electricity in new NASA Perseverance rover video - Space", "description": "For the first time, we can see and hear lightning-like discharges in Mars' thin atmosphere.", "url": "https://www.space.com/astronomy/mars/hear-dust-devils-on-mars-crackle-with-electricity-in-new-nasa-perseverance-rover-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QwiQoFm6VeHdgzMNyZgwrk-1920-80.jpg", "publishedAt": "2025-12-10T11:00:00Z", "content": "NASA just released striking new video and audio that reveal the sounds of dust storms on Mars crackling with tiny lightning-like sparks.\r\nThe footage, which NASA released on Dec. 3, was captured by t… [+3253 chars]"}, {"source": {"id": null, "name": "Inc."}, "author": "Jessica Stillman", "title": "Physicists’ 1-Hour Rule Is the Secret to a Happy, Sustainable Daily Routine - Inc.com", "description": "The daily routines of people around the world all tend to have this in common. You’ll be happier if yours does too.", "url": "https://www.inc.com/jessica-stillman/physicists-1-hour-rule-is-the-secret-to-a-happy-sustainable-daily-routine/91272960", "urlToImage": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/12/GettyImages-1774783070.jpg", "publishedAt": "2025-12-10T10:48:43Z", "content": "Back in 1995 an Italian physicist named Cesare Marchetti wrote a paper taking note of this startling observation. No matter where you look in the world, in every kind of society and setting, people g… [+1779 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Living at High Altitudes Induces Remarkable Changes in How Genes Behave - ScienceAlert", "description": "High in the Ecuadorian Andes, at altitudes thousands of meters above sea level, humans face environmental pressures very different from those at lower altitudes.", "url": "https://www.sciencealert.com/living-at-high-altitudes-induces-remarkable-changes-in-how-genes-behave", "urlToImage": "https://www.sciencealert.com/images/2025/12/andes-eqcuador.jpg", "publishedAt": "2025-12-10T01:58:45Z", "content": "High in the Ecuadorian Andes, at altitudes thousands of meters above sea level, humans face environmental pressures very different from those at lower altitudes.\r\nThe human body can acclimatize, phys… [+4645 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Delft University of Technology", "title": "'Light-bending' material that controls blue and ultraviolet light could transform advanced chipmaking - Phys.org", "description": "Researchers from TU Delft and Radboud University (The Netherlands) have discovered that the two-dimensional ferroelectric material CuInP₂S₆ (CIPS) can be used to control the pathway and properties of blue and ultraviolet light like no other material can.", "url": "https://phys.org/news/2025-12-material-blue-ultraviolet-advanced-chipmaking.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-re-1.jpg", "publishedAt": "2025-12-09T22:50:02Z", "content": "Researchers from TU Delft and Radboud University (The Netherlands) have discovered that the two-dimensional ferroelectric material CuInPS (CIPS) can be used to control the pathway and properties of b… [+4043 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "The Nancy Grace Roman Telescope Is Complete! - Universe Today", "description": "Construction is complete on the Nancy Grace Roman Space Telescope, and its ahead of schedule. After extensive testing, the new flagship telescope should be ready to launch in Fall, 2026.", "url": "https://www.universetoday.com/articles/the-nancy-grace-roman-telescope-is-complete", "urlToImage": "https://www.universetoday.com/article_images/Roman_Assembled_complete_20251209_203332.jpg", "publishedAt": "2025-12-09T22:38:00Z", "content": "If you feel a thrill every time we discover something new about the cosmos, then November 25th may have been a noteworthy day to you. That's the day that NASA completed assembly of the Nancy Grace Ro… [+9057 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "The James Webb Space Telescope just found the oldest supernova ever seen - Space", "description": "\"This observation also demonstrates that we can use Webb to find individual stars when the universe was only 5% of its current age.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/the-james-webb-space-telescope-just-found-the-oldest-supernova-ever-seen", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TBVuqLB67VVnwZJvZFqzWT-1920-80.jpg", "publishedAt": "2025-12-09T22:16:08Z", "content": "The light of the oldest supernova ever seen, dating back 13 billion years to just 730 million years after the Big Bang, has been captured by the James Webb Space Telescope.\r\nThe supernova\r\n was accom… [+4059 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ivan Farkas", "title": "This bright star will soon die in a nuclear explosion — and could be visible in Earth's daytime skies - Live Science", "description": "The bright binary star system V Sagittae will flare up multiple times before finally going supernova within the next 100 years. When it explodes, it could be visible to the naked eye even in sunlit skies.", "url": "https://www.livescience.com/space/astronomy/this-bright-star-will-soon-die-in-a-nuclear-explosion-and-could-be-visible-in-earths-daytime-skies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZgFZ739XYrvhA9oxsoro5H-1920-80.jpg", "publishedAt": "2025-12-09T22:13:09Z", "content": "An incredibly luminous star system that has long baffled astronomers could soon light up the sky with the nuclear brilliance of thousands of suns, new research suggests. When that happens, the result… [+6249 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Sean Yoder", "title": "Lunar Outpost’s MAPP Rovers: From Commercial Exploration to Artemis Integration - NASASpaceFlight.com -", "description": "Founded in 2017 in Golden, Colorado, Lunar Outpost has rapidly evolved from a commercial lunar…", "url": "https://www.nasaspaceflight.com/2025/12/lunar-outpost-mapp/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2025/12/MAPP-Rover.webp", "publishedAt": "2025-12-09T21:48:27Z", "content": "1Founded in 2017 in Golden, Colorado, Lunar Outpost has rapidly evolved from a commercial lunar mobility startup to a key player in NASAs Artemis program. On December 4, 2025, the company announced i… [+10507 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Gayoung Lee", "title": "Newly Discovered ‘Hybrid’ Phase of Matter Blurs the Line Between Solid and Liquid - Gizmodo", "description": "During this phase, matter exists in a weird, precarious limbo that ultimately determines what it becomes.", "url": "https://gizmodo.com/newly-discovered-hybrid-phase-of-matter-blurs-the-line-between-solid-and-liquid-2000697462", "urlToImage": "https://gizmodo.com/app/uploads/2025/12/representational-image-of-solid-liquid-metal-e1765309036815-1200x675.jpeg", "publishedAt": "2025-12-09T21:30:34Z", "content": "High school science misses a lot of the science researchers actually work with. For example, you learn that there are three states of mattersolid, liquid, and gasbut in advanced physics, things get a… [+3748 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Axial Seamount Set to Erupt in 2026 – Scientists Make Alarming New Discovery - Indian Defence Review", "description": "Scientists predict that the Axial Seamount volcano off the Oregon Coast will erupt in 2026, with new models and ongoing research helping to refine predictions.", "url": "https://indiandefencereview.com/axial-seamount-set-to-erupt-in-2026/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/12/axial-seamount-set-to-erupt-in-2026-scientists-make-alarming-new-discovery.png", "publishedAt": "2025-12-09T21:15:00Z", "content": "The Axial Seamount, an active underwater volcano off the coast of Oregon, has long been a subject of study due to its unpredictable eruptions. Initially expected to erupt in 2025, new findings sugges… [+4608 chars]"}, {"source": {"id": null, "name": "Noozhawk"}, "author": "Janene Scully | Noozhawk North County Editor", "title": "Vandenberg’s Next Mission: SpaceX Rocket Launch Early Wednesday - Noozhawk", "description": "What: Falcon 9 rocket launch at Vandenberg Space Force Base in Santa Barbara County. When: Between 12:54 a.m. and 4:54 a.m. Wednesday, according to", "url": "http://www.noozhawk.com/vandenbergs-next-mission-spacex-rocket-launch-early-wednesday-120925/", "urlToImage": "https://i0.wp.com/www.noozhawk.com/wp-content/uploads/2022/12/social-fallback.png?fit=1200%2C630&quality=80&ssl=1", "publishedAt": "2025-12-09T21:11:51Z", "content": "What: Falcon 9 rocket launch at Vandenberg Space Force Base in Santa Barbara County.\r\nWhen: Between 12:54 a.m. and 4:54 a.m. Wednesday, according to SpaceX. If needed, the team has backup opportuniti… [+1689 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "This 7-hour cosmic explosion is the longest gamma-ray burst ever seen. Could it be from an elusive class of black hole? - Space", "description": "\"This is certainly an outburst unlike any other we've seen in the past 50 years.\"", "url": "https://www.space.com/astronomy/black-holes/this-7-hour-cosmic-explosion-is-the-longest-gamma-ray-burst-ever-seen-could-it-be-from-an-elusive-class-of-black-hole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Bajtf95DthzLGPoT98jhPf-1600-80.png", "publishedAt": "2025-12-09T21:00:00Z", "content": "Astronomers have spotted the longest gamma-ray burst ever seen, a cosmic explosion that lasted seven hours — and they determined it could be the work of a black hole destroying a star.\r\nGamma-ray bur… [+5597 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "What will be the first AI-designed drug? These disease-fighting antibodies are top contenders - Nature", "description": "Just a year after the first AI-designed antibody was made, scientists say clinical trials are on the horizon.", "url": "https://www.nature.com/articles/d41586-025-03965-x", "urlToImage": "https://media.nature.com/lw1200/magazine-assets/d41586-025-03965-x/d41586-025-03965-x_51787534.jpg", "publishedAt": "2025-12-09T20:42:58Z", "content": "An illustration of antibodies (pink) binding to a flu virus (brown).Credit: Juan Gaertner/Science Photo Library\r\nBiologists achieved a landmark in protein design last year: using artificial intellige… [+4294 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jordan Strickler", "title": "Antarctica's only native insect is already eating microplastics - Phys.org", "description": "A global research team led by researchers from the University of Kentucky Martin-Gatton College of Agriculture, Food and Environment has found that Antarctica's only native insect is already ingesting microplastics, even in one of the planet's most remote reg…", "url": "https://phys.org/news/2025-12-antarctica-native-insect-microplastics.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/antarcticas-toughest-i.jpg", "publishedAt": "2025-12-09T20:30:01Z", "content": "A global research team led by researchers from the University of Kentucky Martin-Gatton College of Agriculture, Food and Environment has found that Antarctica's only native insect is already ingestin… [+6087 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "Earth's crust hides enough 'gold' hydrogen to power the world for tens of thousands of years, emerging research suggests - Live Science", "description": "Reservoirs of hydrogen gas that form naturally in Earth's crust could help humans decarbonize. The challenge now is finding these accumulations and working out how best to mine them, experts say.", "url": "https://www.livescience.com/planet-earth/geology/earths-crust-hides-enough-gold-hydrogen-to-power-the-world-for-tens-of-thousands-of-years-emerging-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vntC2cepKDJD3nuaJmErQo-2560-80.png", "publishedAt": "2025-12-09T20:01:33Z", "content": "In 1987, a worker lit a cigarette by a new water well near the village of Bourakebougou in Mali.\r\nBut as he did, an explosion reverberated inside the well. We now know this was due to previously unde… [+11089 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "The University of Hong Kong", "title": "First human DNA-cutting enzyme that senses physical tension discovered - Phys.org", "description": "An international research team has identified a human protein, ANKLE1, as the first DNA-cutting enzyme (nuclease) in mammals capable of detecting and responding to physical tension in DNA. This \"tension-sensing\" mechanism plays a vital role in maintaining gen…", "url": "https://phys.org/news/2025-12-human-dna-enzyme-physical-tension.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/first-human-dna-cuttin.jpg", "publishedAt": "2025-12-09T19:48:26Z", "content": "An international research team has identified a human protein, ANKLE1, as the first DNA-cutting enzyme (nuclease) in mammals capable of detecting and responding to physical tension in DNA. This \"tens… [+4548 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "Chinese astronauts inspect debris-damaged Shenzhou-20 spacecraft during spacewalk - SpaceNews", "description": "Chinese astronauts inspect debris-damaged Shenzhou-20 spacecraft during spacewalk Two Shenzhou-21 astronauts embarked on the mission’s first spacewalk late Monday, inspecting and photographing a damaged spacecraft window which triggered an earlier emergency l…", "url": "http://spacenews.com/chinese-astronauts-inspect-debris-damaged-shenzhou-20-spacecraft-during-spacewalk/", "urlToImage": "https://spacenews.com/wp-content/uploads/2025/12/Shenzhou21-EVA1-9dec2025-CMSEO.jpg", "publishedAt": "2025-12-09T19:07:28Z", "content": "HELSINKI Two Shenzhou-21 astronauts embarked on the missions first spacewalk late Monday, inspecting and photographing a damaged spacecraft window which triggered an earlier emergency launch.\r\nShenzh… [+3997 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "NASA astronaut and Los Angeles native Jonny Kim returns to Earth after 245 days onboard International Space Station - ABC7 Los Angeles", "description": "NASA astronaut Jonny Kim, a Los Angeles native, returned to Earth after 245 days onboard the International Space Station.", "url": "https://abc7.com/post/nasa-astronaut-los-angeles-native-jonny-kim-returns-earth-245-days-onboard-international-space-station/18268132/", "urlToImage": "https://cdn.abcotvs.com/dip/images/18268176_jonny-kim-TN-img.jpg?w=1600", "publishedAt": "2025-12-09T18:42:30Z", "content": "NASA astronaut Jonny Kim, a Los Angeles native, returned to Earth after 245 days onboard the International Space Station.\r\nKim and cosmonauts Sergey Ryzhikov and Alexey Zubritsky made a safe return M… [+465 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Just Unveiled What Lies Beneath Greenland, and It Could Change Our Climate Future - Indian Defence Review", "description": "A new study on Greenland's hidden geology reveals how its ice sheet could affect global sea levels, offering critical insights into climate change.", "url": "https://indiandefencereview.com/scientists-what-lies-beneath-greenland/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/12/scientists-just-unveiled-what-lies-beneath-greenland-and-it-could-change-our-climate-future.png", "publishedAt": "2025-12-09T18:30:00Z", "content": "A groundbreaking study from the University of Ottawa, published in theProceedings of the National Academy of Sciences, has uncovered critical insights into Greenlands hidden geological structures. By… [+4058 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Voyager 1 will reach one light-day from Earth in 2026. Here’s what that means - CNN", "description": "Voyager 1, NASA’s deep-space probe, could soon become the first spacecraft to reach a historic milestone. In November 2026, the probe will be one light-day from Earth.", "url": "https://www.cnn.com/2025/12/09/science/voyager-1-light-day-earth", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/jpegpia17462-20251209144417720.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-12-09T18:23:24Z", "content": "Voyager 1, NASAs deep-space probe, could soon become the first spacecraft to reach a historic milestone. In November 2026, the probe will be one light-day from Earth.\r\nLaunched in 1977, Voyager 1 is … [+5981 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "The Sun Survived a Close Call With 2 Massive Stars 4.4 Million Years Ago, Data Shows - Gizmodo", "description": "The encounter left behind a trace in the clouds of gas and dust surrounding our solar system.", "url": "https://gizmodo.com/the-sun-survived-a-close-call-with-two-massive-stars-4-4-million-years-ago-data-shows-2000697308", "urlToImage": "https://gizmodo.com/app/uploads/2025/12/local-interstellar-cloud-1200x675.jpg", "publishedAt": "2025-12-09T18:20:20Z", "content": "In the early 1990s, the Hubble Space Telescope picked up something odd in the local clouds that surround our solar system. An unusually large number of electrons had been ripped apart from the atoms … [+2967 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Chrissy Newton, Chrissy Newton", "title": "New Warp-Drive Propulsion Concept Moves Fictional Starships Closer to Engineering Reality - The Debrief", "description": "A new warp-drive study proposes a novel segmented design that brings hyper-fast space travel one step closer to becoming a reality.", "url": "https://thedebrief.org/new-warp-drive-propulsion-concept-moves-fictional-starships-closer-to-engineering-reality/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/12/warp-nacelles.jpg", "publishedAt": "2025-12-09T17:40:53Z", "content": "A new warp-drive study proposes a novel segmented design that could sidestep many of the problems in the original decades-old concept, bringing the possibility of hyper-fast space travel one step clo… [+9063 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": null, "title": "Astronomers find first direct evidence of “Monster Stars” from the cosmic dawn - Center for Astrophysics | Harvard & Smithsonian", "description": "Cambridge, MA (December 9, 2025)— For two decades, astronomers have puzzled over how supermassive black holes, which are some of the brightest objects in the universe, could exist less than a billion years after the Big Bang. Normal stars simply couldn't crea…", "url": "https://www.cfa.harvard.edu/news/astronomers-find-first-direct-evidence-monster-stars-cosmic-dawn", "urlToImage": null, "publishedAt": "2025-12-09T17:29:04Z", "content": "Cambridge, MA (December 9, 2025) For two decades, astronomers have puzzled over how supermassive black holes, which are some of the brightest objects in the universe, could exist less than a billion … [+5124 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kerry  Breen", "title": "Black hole spotted blasting winds at 130 million mph: \"A scale almost too big to imagine\" - CBS News", "description": "The European Space Agency said that the black hole inside the spiral galaxy NGC 3783 has the mass of 30 million suns.", "url": "https://www.cbsnews.com/news/black-hole-winds-spiral-galaxy-space/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/12/09/a252f823-3b3b-4fb2-8b81-c087a602f399/thumbnail/1200x630/38d26111f084c9cc12e96d9587b91e11/screenshot-2025-12-09-at-11-57-00-am.png", "publishedAt": "2025-12-09T17:14:00Z", "content": "A black hole inside a distant spiral galaxy is devouring material from the universe around it and creating winds at speeds never before seen by astronomers. \r\nThe European Space Agency said that the … [+1867 chars]"}, {"source": {"id": null, "name": "WFTV Orlando"}, "author": "James Tutten", "title": "Falcon 9 successfully launches from the Space Coast - WFTV", "description": "People in Central Florida could hear a distant boom Tuesday afternoon.", "url": "https://www.wftv.com/news/local/sonic-boom-advisory-issued-ahead-falcon-9-rocket-launch-tuesday-florida/4IFUUPRXW5H27NOJDUPIKC5TF4/", "urlToImage": "https://cmg-cmg-tv-10070-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fcloudfront-us-east-1.images.arcpublishing.com%2Fcmg%2FS5WOK4SX5FGA7NLJSI2QDY5T4I.jpg?auth=7ef2b90a2bd077810121349333ad1ba4729ec267944e1e0e24ee3784e49c73a0&width=1200&height=630&smart=true", "publishedAt": "2025-12-09T16:34:18Z", "content": "BREVARD COUNTY, Fla. — 9:15 P.M. UPDATE:\r\nSpaceX successfully launched the Falcon 9 rocket carrying the NROL-77 payload from Florida on Tuesday afternoon.\r\nThis launch marks SpaceXs 11th National Sec… [+1170 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tohoku University", "title": "Electron-phonon interactions in crystals found to be quantized by a fundamental constant - Phys.org", "description": "A researcher at the Department of Physics at Tohoku University has uncovered a surprising quantum phenomenon hidden inside ordinary crystals: the strength of interactions between electrons and lattice vibrations—known as phonons—is not continuous, but quantiz…", "url": "https://phys.org/news/2025-12-electron-phonon-interactions-crystals-quantized.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/listening-to-the-whisp-1.jpg", "publishedAt": "2025-12-09T16:10:02Z", "content": "A researcher at the Department of Physics at Tohoku University has uncovered a surprising quantum phenomenon hidden inside ordinary crystals: the strength of interactions between electrons and lattic… [+3327 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "In a major new report, scientists build rationale for sending astronauts to Mars - Ars Technica", "description": "“Everyone is inspired by this because it’s becoming real.”…", "url": "https://arstechnica.com/space/2025/12/in-a-major-new-report-scientists-build-rationale-for-sending-astronauts-to-mars/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/file-20250327-56-dflaq1-1152x648.jpg", "publishedAt": "2025-12-09T16:00:25Z", "content": null}, {"source": {"id": null, "name": "Ctinsider.com"}, "author": "Nathaniel Rosenberg", "title": "The 'Eclipse of the Century' is coming in 2027. Here's where you can see it. - CT Insider", "description": "The eclipse, which will black out the sky for 6 minutes and 23 seconds, will cover parts of Europe and North Africa and the Middle East in August 2027.", "url": "https://www.ctinsider.com/weather/article/total-solar-eclipse-of-the-century-august-2027-21232273.php", "urlToImage": "https://s.hdnux.com/photos/01/36/76/33/24897223/3/rawImage.jpg", "publishedAt": "2025-12-09T15:47:08Z", "content": "Sophia Sadeghin, 6, reacts as she sees the solar eclipse while at Bowman Observatory in Greenwich June 3, 2022.\r\nChristian Abraham/Hearst Connecticut Media\r\nSix-hundred days.\r\nThat's how far away the… [+2853 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "People Are Just Now Realizing That The Earth Has A Tail, Stretching At Least 2 Million Kilometers - IFLScience", "description": "According to some estimates, our tail stretches up to 1000 times the Earth’s radius.", "url": "https://www.iflscience.com/people-are-just-now-realizing-that-the-earth-has-a-tail-stretching-at-least-2-million-kilometers-81832", "urlToImage": "https://assets.iflscience.com/assets/articleNo/81832/aImg/87957/earth-magnetotail-meta.png", "publishedAt": "2025-12-09T14:29:22Z", "content": "If you are of the sort of human who follows science news, you are probably aware that lately there has been a lot of discussion of tails lately, courtesy of our latest interstellar visitor comet 3I/A… [+4497 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Scientists Document Over 16,000 Footprints in the World’s Most Extensive Dinosaur Tracksite - Good News Network", "description": "The size of the prints can estimate the size of the theropod, while the space between prints can suggest the speed of their movement.", "url": "https://www.goodnewsnetwork.org/scientists-document-over-16000-footprints-in-the-worlds-most-extensive-dinosaur-tracksite/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/12/The-Carreras-Pampas-trackways-credit-Raul-Esperante-e1765275529689.jpg", "publishedAt": "2025-12-09T14:00:03Z", "content": "The Carreras Pampas trackways – credit, Raúl Esperante\r\nIn Bolivia, the largest number of dinosaur footprints ever recorded in a single spot is yielding fascinating insight on how these prehistoric a… [+2629 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Indian Institute of Technology Bombay", "title": "From light to logic: Ultrafast quantum switching in 2D materials - Phys.org", "description": "Scientists from the Indian Institute of Technology Bombay have found a way to use light to control and read tiny quantum states inside atom-thin materials. The simple technique could pave the way for computers that are dramatically faster and consume far less…", "url": "https://phys.org/news/2025-12-logic-ultrafast-quantum-2d-materials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/from-light-to-logic-ul.jpg", "publishedAt": "2025-12-09T13:51:39Z", "content": "Scientists from the Indian Institute of Technology Bombay have found a way to use light to control and read tiny quantum states inside atom-thin materials. The simple technique could pave the way for… [+4967 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "15-Year-Old Earns PhD in Quantum Physics, Now Plans to Build AI-Enhanced 'Super-Humans' - The Daily Galaxy", "description": "A 15-year-old has just earned a PhD in quantum physics—and that’s only the beginning. Now pursuing advanced research in AI and human enhancement.", "url": "https://dailygalaxy.com/2025/12/15-year-old-earns-phd-in-quantum-physics-now-plans-to-build-ai-enhanced-super-humans/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/12/laurent-simons-young-phd-quantum-physics-scaled.jpg", "publishedAt": "2025-12-09T12:45:00Z", "content": "A Belgian teenager has become one of the youngest individuals in modern history to complete a PhD in quantum physics. But for A 15-year-old has just earned a PhD in quantum physicsand thats only the … [+5294 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Samir Sebti", "title": "Frozen Creature Comes Back to Life After 46,000 Years… and Picked up Right Where It Left Off - The Daily Galaxy", "description": "A tiny creature buried deep in Siberian ice for over 46,000 years has just been brought back to life—and it's rewriting what science thought was possible.", "url": "https://dailygalaxy.com/2025/12/ice-age-frozen-worm-revived-after-46000-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/12/A-creature-from-the-Ice-Age-is-alive-again-scaled.jpg", "publishedAt": "2025-12-09T12:15:00Z", "content": "Deep beneath the Siberian permafrost, scientists revived a microscopic worm frozen in suspended animation for nearly 46,000 years. The tiny nematode, entombed inside ancient rodent burrows preserved … [+4048 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Rock Used as Doorstop For Decades Revealed to Be Worth Over $1 Million - ScienceAlert", "description": "They say one person's trash is another's treasure, but a chunk of 'rock' used to keep a door open for decades is a treasure by almost anyone's standards.", "url": "https://www.sciencealert.com/rock-used-as-doorstop-for-decades-revealed-to-be-worth-over-1-million", "urlToImage": "https://www.sciencealert.com/images/2025/12/Amber-fossil-rock-from-Romania.jpg", "publishedAt": "2025-12-09T12:02:09Z", "content": "They say one person's trash is another's treasure, but a chunk of 'rock' used to keep a door open for decades is a treasure by almost anyone's standards.\r\nA woman discovered the 3.5-kilogram (7.7-pou… [+4573 chars]"}]}