{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "650-foot mega-tsunami sends seismic waves around world and satellites captured the action - Earth.com", "description": "More than 25 million cubic yards of rock and ice broke loose and plunged into Greenland's Dickson Fjord, creating a 650-foot-high mega-tsunami", "url": "https://www.earth.com/news/650-foot-mega-tsunami-sends-seismic-waves-around-world-dickson-fjord-swot-mission/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/06095249/greenland-mega-tsunami_dickson-fjord_landslide_seismic-waves_1.jpg", "publishedAt": "2025-06-08T19:56:08Z", "content": "Greenlands eastern edge rarely causes a stir, yet instruments across the world lit up at the same time with a slow, steady beat that lasted nine full days. \r\nThe pulse rose and fell every ninety-two … [+5532 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Scientists learn how mosquitoes outsmart and evade human defenses - Earth.com", "description": "A new study uncovers how male mosquitoes are able to locate females and evade human defenses by using sound.", "url": "https://www.earth.com/news/scientists-learn-how-mosquitoes-use-sound-to-outsmart-and-evade-human-defenses/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/08095844/mosquito_evade-human-traps-defenses_hearing_1m.jpg", "publishedAt": "2025-06-08T16:14:08Z", "content": "Mosquito swarms may sound like chaos, but male mosquitoes are incredible listeners. Despite the noise, they can hear the faint sounds made by female wingbeats.\r\nA new study from Nagoya University unc… [+5445 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "James Webb telescope has photographed 3 ultra-massive galaxies, and it changes everything, according to these scientists. - Farmingdale Observer", "description": "In a groundbreaking discovery that has astronomers worldwide buzzing with excitement, the James Webb Space Telescope has identified three massive galaxies nicknamed \"red monsters\" in the distant universe. These ancient cosmic structures, observed at nearly 13…", "url": "https://farmingdale-observer.com/2025/06/08/james-webb-telescope-has-photographed-3-ultra-massive-galaxies-and-it-changes-everything-according-to-these-scientists/", "urlToImage": null, "publishedAt": "2025-06-08T15:21:00Z", "content": "In a groundbreaking discovery that has astronomers worldwide buzzing with excitement, the James Webb Space Telescope has identified three massive galaxies nicknamed “red monsters” in the distant univ… [+4356 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "\"Cocaine sharks\" found off the coast of Brazil - strange but true tale of ocean pollution consequences - Earth.com", "description": "Meet the \"cocaine sharks,\" also known as Brazilian sharpnose sharks, Rhizoprionodon lalandii, zipping around cocaine saturated coastal waters.", "url": "https://www.earth.com/news/cocaine-sharks-brazilian-waters-sharpnose-sharks-rhizoprionodon-lalandii-ocean-pollution/", "urlToImage": "https://cff2.earth.com/uploads/2024/08/05222342/cocaine-shark_brazil_Rhizoprionodon-lalandii_sharpnose_ocean-pollution_1.jpg", "publishedAt": "2025-06-08T15:07:51Z", "content": "Hollywood once spun a wild yarn about Cocaine Bear, a hapless black bear that gorged itself on lost narcotics. It turns out the plot has a saltwater sequel. In coastal Brazil, cocaine sharks – petite… [+6019 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "NASA's Parker Solar Probe spots powerful magnetic explosion aimed at the sun's surface - Live Science", "description": "NASA's Parker Solar Probe has directly observed a powerful magnetic explosion in the sun's corona that could help us predict geomagnetic storms on Earth.", "url": "https://www.livescience.com/space/the-sun/nasas-parker-solar-probe-spots-powerful-magnetic-explosion-aimed-at-the-suns-surface", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Zpi5utcf7zdggoutDiBEgB.jpg", "publishedAt": "2025-06-08T15:00:00Z", "content": "While making a death-defying dive through the sun’s atmosphere, NASA's Parker Solar Probe has directly recorded a powerful plasma explosion heading toward our star’s surface in unprecedented detail.\r… [+4361 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joel Achenbach, Christian Davenport", "title": "The NASA science missions that would be axed in Trump’s 2026 budget - The Washington Post", "description": "Deep cuts would upend missions to study other planets and Earth itself.", "url": "https://www.washingtonpost.com/science/2025/06/08/nasa-budget-voyager-space/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6XVBICNZQ4LXBYRNUDIVQZJM5I.jpg&w=1440", "publishedAt": "2025-06-08T14:32:17Z", "content": "Return to menuThe twin spacecraft, launched in 1977 and renowned for producing stunning images of the outer solar system, are now the most distant objects ever sent into space by humans. Voyager 1 is… [+2813 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s Perseverance Rover Keeps Photographing a Tiny Maze on Mars – Here’s Why - The Daily Galaxy", "description": "A tiny etched maze on NASA’s Perseverance rover is a high-precision calibration tool critical to its search for ancient life on Mars.", "url": "https://dailygalaxy.com/2025/06/nasas-perseverance-rover-tiny-maze-on-mars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASAs-Perseverance-Rover-Keeps-Photographing-a-Tiny-Maze-on-Mars-–-Heres-Why.jpg", "publishedAt": "2025-06-08T14:00:00Z", "content": "NASAs Perseverance rover has sent back thousands of images from Mars, but one recurring subject stands out: a tiny, intricate maze etched onto a metallic plate. Captured repeatedly by the rovers came… [+3341 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Astronauts track huge dust clouds over Canada and US | On the ISS this week June 2-6, 2025 - Space", "description": "A look back at the week's activities for the Expedition 73 crew.", "url": "https://www.space.com/space-exploration/international-space-station/astronauts-track-dust-clouds-us-iss-weekly-review-june-2-6-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KiH4UR56fyqYUow4ChTp4g.jpg", "publishedAt": "2025-06-08T14:00:00Z", "content": "Preparations for the arrival of a visiting crew, the continued study of how humans adapt to the microgravity environment of space, the service of systems on board a docked cargo ship and the document… [+6903 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "NASA Pulls the Plug on Europa Lander, but Scientists Propose a Plan B - Gizmodo", "description": "How a robot built to walk on alien ice got the cold shoulder—and then (possibly) lived to see another day.", "url": "https://gizmodo.com/nasa-pulls-the-plug-on-europa-lander-but-scientists-propose-a-plan-b-2000611741", "urlToImage": "https://gizmodo.com/app/uploads/2025/06/europa-clipper-1200x675.jpg", "publishedAt": "2025-06-08T14:00:00Z", "content": "NASA engineers have spent the past decade developing a rugged, partially autonomous lander designed to explore Europa, one of Jupiters most intriguing moons. The space agency got cold feet over the p… [+2594 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Experts are certain, the next major volcanic eruption will cause climate chaos. - Farmingdale Observer", "description": "The scientific community has raised an urgent alarm regarding our global unpreparedness for the next major volcanic eruption. In a compelling study published in Nature, climatologists and geographers warn that such an event could trigger unprecedented climate…", "url": "https://farmingdale-observer.com/2025/06/08/experts-are-certain-the-next-major-volcanic-eruption-will-cause-climate-chaos/", "urlToImage": null, "publishedAt": "2025-06-08T13:03:00Z", "content": "The scientific community has raised an urgent alarm regarding our global unpreparedness for the next major volcanic eruption. In a compelling study published in Nature, climatologists and geographers… [+4147 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Nonreciprocal light speed control achieved using cavity magnonics device - Phys.org", "description": "The reliable manipulation of the speed at which light travels through objects could have valuable implications for the development of various advanced technologies, including high-speed communication systems and quantum information processing devices. Convent…", "url": "https://phys.org/news/2025-06-nonreciprocal-cavity-magnonics-device.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/study-demonstrates-non.jpg", "publishedAt": "2025-06-08T13:00:01Z", "content": "The reliable manipulation of the speed at which light travels through objects could have valuable implications for the development of various advanced technologies, including high-speed communication… [+6356 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "Monster black hole M87 is spinning at 80% of the cosmic speed limit — and pulling in matter even faster - Live Science", "description": "The famous black hole M87 keeps surprising us. New research calculates its spin speed to be at 80% of the theoretical limit, with matter falling into its maw even faster.", "url": "https://www.universetoday.com/articles/new-measurements-for-m87s-supermassive-black-hole-spin-and-accretion-rate", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2YNt5o9mjhzRLEoanE2T8D.jpg", "publishedAt": "2025-06-08T12:00:00Z", "content": "The monster black hole\r\n lurking at the center of galaxy M87 is an absolute beast. It is one of the largest in our vicinity and was the ideal first target for the Event Horizon Telescope. Scientists … [+3369 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovery of a Lifetime: Student Discovers Ancient “Living Fossil” Underneath Rock - SciTechDaily", "description": "A newly discovered velvet worm species is the first ever found in South Africa's arid Karoo region. In March 2022, Stellenbosch University student Rohan Barnard was exploring a farm in the Swartberg Mountains between Calitzdorp and Oudtshoorn, turning over ro…", "url": "https://scitechdaily.com/discovery-of-a-lifetime-student-discovers-ancient-living-fossil-underneath-rock/", "urlToImage": "https://scitechdaily.com/images/New-Species-of-Velvet-Worm-P.barnardi-From-the-Arid-Karoo-scaled.jpg", "publishedAt": "2025-06-08T11:29:22Z", "content": "Peripatopsis barnardi represents the first ever species from the little Karoo, which indicates that the area was historically more forested than at present. It is one of seven new species from the Ca… [+6501 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Unveil a Method to Give Every Human the Ability to See in the Dark - The Daily Galaxy", "description": "A groundbreaking new technology could soon change how we experience the world around us. Researchers have developed an innovative wearable that offers capabilities beyond the ordinary. The potential applications are vast, from everyday use to specialized fiel…", "url": "https://dailygalaxy.com/2025/06/scientists-unveil-a-method-to-give-every-human-the-ability-to-see-in-the-dark/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Close-up-illustration-of-a-Caucasian-female-eye-with-advanced-contact-lenses.jpg", "publishedAt": "2025-06-08T11:15:00Z", "content": "A groundbreaking development in the realm of human vision has emerged from researchers at the University of Science and Technology of China. A team of scientists has created contact lenses that allow… [+3116 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Trending Desk", "title": "Scientists discover 34 million year old hidden river world buried under 2 km of Antarctic ice - Times of India", "description": "Trending News: Beneath East Antarctica's thick ice, scientists have uncovered a hidden, ancient landscape untouched for 34 million years. Using RADARSAT technology,", "url": "https://timesofindia.indiatimes.com/etimes/trending/scientists-discover-34-million-year-old-hidden-river-world-buried-under-2-km-of-antarctic-ice/articleshow/121706594.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-121706678,width-1070,height-580,imgsize-1328540,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-06-08T11:10:00Z", "content": "10 foods that have more calcium than milk"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Philip Ball", "title": "A New Law of Nature Attempts to Explain the Complexity of the Universe - WIRED", "description": "A novel suggestion that complexity increases over time, not just in living organisms but in the nonliving world, promises to rewrite notions of time and evolution.", "url": "https://www.wired.com/story/why-everything-in-the-universe-turns-more-complex/", "urlToImage": "https://media.wired.com/photos/683ebe4fdaf539c25f5e3483/191:100/w_1280,c_limit/LawOfComplexity-crIrenePerez-Lede.jpeg", "publishedAt": "2025-06-08T11:00:00Z", "content": "Kauffman argues that biological evolution is thus constantly creating not just new types of organisms but new possibilities for organisms, ones that not only did not exist at an earlier stage of evol… [+5169 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "The best time to see the Milky Way is fast approaching! How to see our galaxy at its best in June. - Live Science", "description": "\"Core season\" for the Milky Way has arrived, with our galaxy visible all night as a band of light arching across the sky. Here's where, when, and how to get the best views in June.", "url": "https://www.livescience.com/space/the-best-time-to-see-the-milky-way-is-fast-approaching-how-to-see-our-galaxy-at-its-best-in-june", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ByViAx6ktnjK2aHCCy74HU.jpg", "publishedAt": "2025-06-08T11:00:00Z", "content": "The best time to see the core of our stunning home galaxy, the Milky Way\r\n, is fast approaching.\r\nWherever you are on the planet, if you can get away from light pollution and face south without any a… [+2487 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "346 Million-Year-Old Fossil Rewrites the Story of Life on Land - SciTechDaily", "description": "Fossils from Scotland’s East Kirkton Quarry are now dated to 346 million years ago, offering rare insight into vertebrate evolution during Romer’s Gap. In 1984, an amateur paleontologist in Scotland discovered a remarkable fossil: a nearly complete skeleton r…", "url": "https://scitechdaily.com/?p=478967", "urlToImage": "https://scitechdaily.com/images/Environmental-Reconstruction-of-the-East-Kirkton-Area-Some-346-Million-Years-Ago.jpg", "publishedAt": "2025-06-08T10:39:47Z", "content": "An environmental reconstruction of the East Kirkton area, some 346 million years ago, depicts the Westlothiana lizziae resting on a rock. Credit: Hector Garza\r\nFossils from Scotland’s East Kirkton Qu… [+5066 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "China's Tianwen 2 spacecraft sends home 1st photo as it heads for mysterious 'quasi-moon' asteroid - Space", "description": "The deep-space mission is heading for Kamoʻoalewa, a strange asteroid that might be a piece of the moon.", "url": "https://www.space.com/space-exploration/missions/chinas-tianwen-2-spacecraft-sends-home-1st-photo-as-it-heads-for-mysterious-quasi-moon-asteroid", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zAQWz5kLSrYAzR7sAkcrmi.jpg", "publishedAt": "2025-06-08T10:00:00Z", "content": "China has released a first picture of its Tianwen 2 mission as the spacecraft heads for a near-Earth asteroid.\r\nTianwen 2 launched\r\n on a Long March\r\n 3B rocket on May 28 and is tasked with rendezvou… [+2811 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "Space photo of the week: James Webb telescope peeks under the brim of a 'peculiar' Sombrero - Live Science", "description": "New near-infrared observations by the James Webb Space Telescope highlight a tightly packed group of stars at the peculiar galaxy's center as well as dust on its outer fringes.", "url": "https://www.livescience.com/space/astronomy/space-photo-of-the-week-james-webb-telescope-takes-best-look-at-sombrero-galaxy-in-244-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GRSu6KV2x4khJppUGqgXbD.jpg", "publishedAt": "2025-06-08T10:00:00Z", "content": "The James Webb Space Telescope's new image of the Sombrero galaxy, captured using its Near-Infrared Camera. (Image credit: NASA, ESA, CSA, STScI)\r\nWhat it is: The Sombrero Galaxy (M104), a peculiar g… [+2570 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Planetarium’s discovery about outer solar system shocks astronomers - South China Morning Post", "description": "‘Freak accident’ finding has changed thinking on shape of the Oort Cloud, a theoretical area of deep space believed to be a source of comets.", "url": "https://www.scmp.com/lifestyle/entertainment/article/3313382/discovery-about-outer-solar-system-during-set-planetarium-show-shocks-astronomers", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/06/06/fdbfad27-a255-4bdc-bca2-9b16bec9e7ed_b914ca7e.jpg?itok=VKt5DC2P&v=1749202317", "publishedAt": "2025-06-08T09:15:07Z", "content": "Scientists may have been given new information on one of the solar systems many secrets from an unexpected source: a planetarium show opening to the public on June 7.\r\nAt the American Museum of Natur… [+744 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jeff Spry", "title": "'In our spacesuit collection for movies, we have replicas of pretty much every historic spacesuit that's been into space.' How the son of an aerospace machinist built some of Hollywood's most iconic astronaut looks (exclusive) - Space", "description": "\"I've had a number of NASA personnel come up and think that the one that was theirs was ours, and they're shocked.\"", "url": "https://www.space.com/space-exploration/human-spaceflight/in-our-spacesuit-collection-for-movies-we-have-replicas-of-pretty-much-every-historic-spacesuit-thats-been-into-space-how-the-son-of-an-aerospace-machinist-built-some-of-hollywoods-most-iconic-astronaut-looks-exclusive", "urlToImage": "https://cdn.mos.cms.futurecdn.net/q7hyRqaGQ74JSVUK47btfR.jpg", "publishedAt": "2025-06-08T09:00:00Z", "content": "Offering considerably more authentic spacesuits than your local Spirit Halloween store, Chris Gilman's Global Effects is a one-stop shop for Hollywood directors, set decorators, and costume designers… [+6002 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Chemical Kills 95% of Termites and Can’t Harm Humans - SciTechDaily", "description": "A new termite treatment blocks molting, spreads through colonies, and kills up to 95% when combined with a chemical lure. Drywood termites, which live hidden inside wooden structures, molt about seven times during their lives. Researchers at UC Riverside have…", "url": "https://scitechdaily.com/new-chemical-kills-95-of-termites-and-cant-harm-humans/", "urlToImage": "https://scitechdaily.com/images/Western-Drywood-Colony-scaled.jpg", "publishedAt": "2025-06-08T03:39:58Z", "content": "Western drywood termite colony. Credit: Dong-Hwan Choe/UCR\r\nA new termite treatment blocks molting, spreads through colonies, and kills up to 95% when combined with a chemical lure.\r\nDrywood termites… [+5309 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Protein Breaks Biological Rules by Working in a Mirror World - SciTechDaily", "description": "A molecular reinterpretation of Alice in Wonderland reveals an ancient protein with a surprising function. In a groundbreaking discovery, researchers have found that an ancient protein still works even when its molecular structure is flipped like a reflection…", "url": "https://scitechdaily.com/ancient-protein-breaks-biological-rules-by-working-in-a-mirror-world/", "urlToImage": "https://scitechdaily.com/images/Cellular-Life-Origin-Evolution.jpg", "publishedAt": "2025-06-08T03:06:01Z", "content": "Note 2506081346_Source1. Analyzing\r\n1-2.We discovered that these ancient protein motifs are functionally “two-handed.” In other words, these motifs can bind not only to natural DNA and RNA, but also … [+5514 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "NASA is launching a $488 million mission with its new telescope, which is expected to provide a lot of data. - Farmingdale Observer", "description": "NASA's ambitious SPHEREx telescope project represents a significant leap forward in our understanding of the cosmos. With a price tag of $488 million, this revolutionary instrument is designed to create an unprecedented three-dimensional map of our universe. …", "url": "https://farmingdale-observer.com/2025/06/07/nasa-is-launching-a-488-million-mission-with-its-new-telescope-which-is-expected-to-provide-a-lot-of-data/", "urlToImage": null, "publishedAt": "2025-06-08T02:36:00Z", "content": "NASA’s ambitious SPHEREx telescope project represents a significant leap forward in our understanding of the cosmos. With a price tag of $488 million, this revolutionary instrument is designed to cre… [+4151 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Pacific sediment cores unlock millions of years of climate history - Earth.com", "description": "Sediments from Pacific Highs preserve vital information on past ocean warming, extinctions, and circulation shifts.", "url": "https://www.earth.com/news/pacific-sediment-cores-unlock-millions-of-years-of-climate-history/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/07134216/Pacific-sediment.jpg", "publishedAt": "2025-06-07T20:05:17Z", "content": "The deep sea guards secrets of Earths past. Its sediment layers silently record carbon cycles, climate shifts, and ecosystem upheavals. Among the vast oceans, the Pacific holds the most heat and carb… [+4656 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Underwater Megavolcano Set to Release Millions of Tons of Lava, Experts Warn - The Daily Galaxy", "description": "Something massive is brewing beneath the ocean — and this underwater volcano might be closer to erupting than anyone thought.", "url": "https://dailygalaxy.com/2025/06/underwater-volcano-millions-tons-lava/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Underwater-Megavolcano-Set-to-Release-Millions-of-Tons-of-Lava-Experts-Warn.jpg", "publishedAt": "2025-06-07T18:00:00Z", "content": "A massive underwater volcano located approximately 300 miles off the coast of Oregon is on the verge of erupting, scientists say, and for the first time, the public can witness it live. Researchers f… [+3701 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Geologists Just Cracked Open a 500-Million-Year Mystery in the Grand Canyon — What They Found Is Rewriting Earth’s History - Indian Defence Review", "description": "Beneath the Grand Canyon’s iconic layers, scientists have uncovered a fast-paced, 500-million-year-old tale of evolution that’s turning geology on its head.", "url": "https://indiandefencereview.com/500-million-year-mystery-the-grand-canyon/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/geologists-just-cracked-open-a-500-million-year-mystery-in-the-grand-canyon-what-they-found-is-rewriting-earths-history-1.jpg", "publishedAt": "2025-06-07T17:55:00Z", "content": "A newly published study in GSA Todayhas upended decades-old theories about how some of the Grand Canyons oldest layers specifically the Tonto Group were formed. Drawing on fieldwork across over 50 si… [+3871 chars]"}, {"source": {"id": null, "name": "Dailykos.com"}, "author": null, "title": "We interrupt the Musk-Trump feud with a teensy bit of news from the climate front - Daily Kos", "description": "Ralph Keeling, director of the Scripps CO2 Program, noted Thursday: “Another year, another record,” It’s sad.” Here’s why: For the first time, the seasonal peak of carbon dioxide concentrations in the atmosphere exceeded 430 parts per million (ppm) at...", "url": "https://www.dailykos.com/stories/2025/6/7/2326505/-We-interrupt-the-Musk-Trump-feud-with-a-teensy-bit-of-news-from-the-climate-front", "urlToImage": "https://cdn.prod.dailykos.com/images/411226/story_image/burning-earth.1496345948.jpg?1497043592", "publishedAt": "2025-06-07T17:54:56Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "RuWright, Alexander Rawlings", "title": "Astronomers thought the Milky Way was doomed to crash into Andromeda. Now they're not so sure - Phys.org", "description": "For years, astronomers have predicted a dramatic fate for our galaxy: a head-on collision with Andromeda, our nearest large galactic neighbor. This merger—expected in about 5 billion years—has become a staple of astronomy documentaries, textbooks and popular …", "url": "https://phys.org/news/2025-06-astronomers-thought-milky-doomed-andromeda.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/astronomers-thought-th-1.jpg", "publishedAt": "2025-06-07T17:40:01Z", "content": "For years, astronomers have predicted a dramatic fate for our galaxy: a head-on collision with Andromeda, our nearest large galactic neighbor. This mergerexpected in about 5 billion yearshas become a… [+4708 chars]"}, {"source": {"id": null, "name": "Noozhawk"}, "author": "Janene Scully | Noozhawk North County Editor", "title": "Vandenberg’s Next Mission: SpaceX Rocket Launch on Sunday - Noozhawk", "description": "What: Falcon 9 rocket launch from Vandenberg Space Force Base in Santa Barbara County. When: 6:34 a.m. Sunday with other options until 10:34 a.m.,", "url": "http://www.noozhawk.com/vandenbergs-next-mission-spacex-rocket-launch-on-sunday-060725/", "urlToImage": "https://i0.wp.com/www.noozhawk.com/wp-content/uploads/2022/12/social-fallback.png?fit=1200%2C630&quality=80&ssl=1", "publishedAt": "2025-06-07T17:33:02Z", "content": "What: Falcon 9 rocket launch from Vandenberg Space Force Base in Santa Barbara County.\r\nWhen: 6:34 a.m. Sunday with other options until 10:34 a.m., according to SpaceX. If needed, the team has backup… [+1334 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA Spots Strange Towering Shape Breaking Through Mars’ Atmosphere - The Daily Galaxy", "description": "A newly released NASA image captures a mysterious peak piercing through Mars’ morning clouds.", "url": "https://dailygalaxy.com/2025/06/nasa-towering-shape-mars-atmosphere/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/NASA-Catches-Strange-Structure-Emerging-From-the-Martian-Fog.jpg", "publishedAt": "2025-06-07T15:30:00Z", "content": "A new image from NASAs Mars Odyssey orbiter reveals an extraordinary sight: a massive formation breaking through Mars early morning cloud cover. Taken just before dawn on May 2, 2025, and released by… [+3755 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Massive 'super-Earth' discovered in the habitable zone of its star, possibly supporting life - Earth.com", "description": "Scientists discovered a massive \"super-Earth,\" Kepler-725c, in the habitable zone using transit timing variation detection method.", "url": "https://www.earth.com/news/massive-new-super-earth-kepler-725c-found-in-habitable-zone-around-its-star/", "urlToImage": "https://cff2.earth.com/uploads/2025/06/07082653/super-earth_Kepler-725c_habitable-zone_CAS_1m.webp", "publishedAt": "2025-06-07T14:31:04Z", "content": "For years, scientists have combed the skies for signs of distant planets and potential life. Their efforts have turned up countless intriguing discoveries, inspiring even more sophisticated ways to e… [+5224 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Astronomers Astonished by Largest Explosion Since the Big Bang - futurism.com", "description": "Astronomers have discovered a whole new class of cosmic explosions that are dozens of times more powerful than supernovas.", "url": "https://futurism.com/astronomers-largest-explosion-big-bang", "urlToImage": "https://wordpress-assets.futurism.com/2025/06/astronomers-largest-explosion-big-bang.jpg", "publishedAt": "2025-06-07T14:30:40Z", "content": "You've heard of how mighty supernovas are, or of the ungodly amounts of energy released by gamma ray bursts.\r\nBut astronomers have just discovered a type of cosmic blast that puts all those to shame.… [+3353 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "The largest black hole jet ever discovered is three times bigger than the Milky Way - Boy Genius Report", "description": "Researchers discovered a large black hole jet from the early universe, and it's reshaping what we know about the early universe.", "url": "https://bgr.com/science/the-largest-black-hole-jet-ever-discovered-is-three-times-bigger-than-the-milky-way/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/02/AdobeStock_94796294.jpeg?quality=82&strip=all", "publishedAt": "2025-06-07T14:30:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Very Odd” New Sea Monster Identified After Decades of Mystery - SciTechDaily", "description": "This primitive, 85-million-year-old marine reptile was a fierce predator, measuring 12 meters in length. Unlike any known elasmosaur, it hunted its prey from above. A group of elasmosaur fossils—among the most well-known in North America—have now been formall…", "url": "https://scitechdaily.com/?p=479021", "urlToImage": "https://scitechdaily.com/images/Illustration-of-Traskasaura-Sandrae-Hunting-Pachydiscus-Ammonites-in-the-Late-Cretaceous-Pacific.jpg", "publishedAt": "2025-06-07T14:01:16Z", "content": "Two individuals of Traskasaura sandrae hunt the ammonite Pachydiscus in the northern Pacific during the Late Cretaceous. Traskasaura sandrae, named today in the Journal of Systematic Paleontology, wa… [+6667 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Million-Dollar Project Aims to Expose Bad Medical Research - Gizmodo", "description": "Armed with funding, algorithms, and a tip line, this new effort aims to dig corrupt studies out of medical literature before they do real-world harm.", "url": "https://gizmodo.com/these-researchers-are-launching-a-million-dollar-project-to-hunt-down-medical-misinformation-2000611025", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/ai-generated-articles-google-1200x675.jpg", "publishedAt": "2025-06-07T14:00:21Z", "content": "A new initiative from the watchdogs behind Retraction Watch is taking aim at flawed or faked medical science research to the tune of nearly $1 million.\r\nThe Center for Scientific Integrity just launc… [+3612 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX fires up Super Heavy booster ahead of Starship's 10th test flight (video) - Space", "description": "It's unclear when Flight 10 will lift off.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-fires-up-super-heavy-booster-ahead-of-starships-10th-test-flight-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ovJDsCXMRFGSuaWVKPU8vd.jpg", "publishedAt": "2025-06-07T14:00:00Z", "content": "SpaceX is already gearing up for the next flight of its Starship megarocket, just a week and a half after the most recent one left the ground.\r\nThe company performed a long-duration \"static fire\" tes… [+2276 chars]"}, {"source": {"id": null, "name": "Awaytogarden.com"}, "author": "margaret", "title": "designing for ‘abundance,’ with ecological landscaper kelly norris - A Way To Garden", "description": "WE MAY KNOW ONE when we see it, but what word best describes an ecological landscape? Compared to traditional, more formal gardens, such native-plant-forward designs are variously labeled as looser, or naturalistic, or wildish—all perfectly", "url": "https://awaytogarden.com/designing-for-abundance-with-ecological-landscaper-kelly-norris/", "urlToImage": "https://awaytogarden.com/wp-content/uploads/2025/06/RUDBECKIA-2023-07-17-19.06.39-2.jpeg", "publishedAt": "2025-06-07T13:16:59Z", "content": "WE MAY KNOW ONE when we see it, but what word best describes an ecological landscape? Compared to traditional, more formal gardens, such native-plant-forward designs are variously labeled as looser, … [+23628 chars]"}, {"source": {"id": null, "name": "404media.co"}, "author": "Becky Ferreira", "title": "Scientists Just Discovered a Lost Ancient Culture That Vanished - 404 Media", "description": "Plus: a surprising case of galactic eschatology, nematode cheerleading pyramids, ancient makeup kits, and more.", "url": "https://www.404media.co/scientists-just-discovered-a-lost-ancient-culture-that-vanished/", "urlToImage": "https://www.404media.co/content/images/2025/06/galaxies.png", "publishedAt": "2025-06-07T13:05:07Z", "content": "Welcome back to the Abstract! \r\nSad news: the marriage between the Milky Way and Andromeda may be off, so dont save the date (five billion years from now) just yet. \r\nThen: the air you breathe might … [+7840 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Calculate That the Entire Big Bang Must Have Taken Place Inside a Black Hole - futurism.com", "description": "If the Big Bang actually happened inside a black hole, it could neatly explain some of the universe's biggest mysteries.", "url": "https://futurism.com/big-bang-inside-black-hole", "urlToImage": "https://wordpress-assets.futurism.com/2025/06/big-bang-inside-black-hole.jpg", "publishedAt": "2025-06-07T13:00:46Z", "content": "The standard model of cosmology may be the best explanation we've got for why the universe is the way it is and how it all came to be. But it's not the only explanation.\r\nEnter black hole cosmology. … [+3626 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Just Found an Ingredient for Life in a Newborn Planet System - The Daily Galaxy", "description": "A rare molecule spotted in a young planet system could be a missing link in the story of life’s origins. Scientists are now piecing together what this means for our own solar system.", "url": "https://dailygalaxy.com/2025/06/scientists-ingredient-newborn-planet/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/06/Scientists-Just-Found-an-Ingredient-for-Life-in-a-Newborn-Planet-System.jpg", "publishedAt": "2025-06-07T12:15:00Z", "content": "Astronomers have uncovered a rare form of methanol, a basic organic molecule, in the swirling disk of gas and dust around a young starmarking a significant step forward in the search for how life-spa… [+3964 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Dave Stopera", "title": "65 Extremely Rare Historical Pictures That Will Completely And Totally Change Your Perspective On The Universe - BuzzFeed", "description": "The truth is out there... and right here.", "url": "https://www.buzzfeed.com/daves4/interesting-photos-of-space-2025", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2025-06/07/11/thumb/9nOpega93.jpg?crop=2490:1660;5,0&resize=1250:830", "publishedAt": "2025-06-07T12:05:54Z", "content": null}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ars Contributors", "title": "The nine-armed octopus and the oddities of the cephalopod nervous system - Ars Technica", "description": "A mix of autonomous and top-down control manage the octopus’s limbs.", "url": "https://arstechnica.com/science/2025/06/the-nine-armed-octopus-and-the-oddities-of-the-cephalopod-nervous-system/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/GettyImages-1168201315-1152x648.jpg", "publishedAt": "2025-06-07T12:00:55Z", "content": null}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "This is the safest place to hide when a nuclear bomb strikes - The Brighter Side of News", "description": "In buildings that remain standing beyond the blast's epicenter, the threat shifts from collapsing structures to something less visible.", "url": "https://www.thebrighterside.news/discoveries/this-is-the-safest-place-to-hide-when-a-nuclear-bomb-strikes", "urlToImage": "https://www.thebrighterside.news/uploads/2025/06/nuclear-blast.jpg?auto=webp", "publishedAt": "2025-06-07T11:51:00Z", "content": "When a nuclear bomb detonates, the devastation is immediate and terrifying. But outside the area of total destruction, the dangers dont vanishthey change. In buildings that remain standing beyond the… [+6876 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Buried for 16 Million Years, Scientists Unearth a Prehistoric Spider So Big, It Might Have Stalked Dinosaurs - Indian Defence Review", "description": "A mysterious spider fossil uncovered in Australia is turning heads with its unexpected size and age. Hidden beneath layers of ancient rainforest, it belonged to a species scientists had never seen before.", "url": "https://indiandefencereview.com/buried-for-16-million-years-scientists-unearth-a-prehistoric-spider-so-big-it-might-have-stalked-dinosaurs/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/06/a-giant-spider.jpg", "publishedAt": "2025-06-07T11:00:00Z", "content": "In a remote fossil site in eastern Australia, researchers have unearthed a prehistoric spider of such impressive size and preservation that it is reshaping how scientists view arachnid evolution on t… [+3695 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Diana Udel", "title": "Scientists discover 230 new giant viruses that shape ocean life and health - Phys.org", "description": "Giant viruses play a role in the survival of single-celled marine organisms called protists. These include algae, amoeba, and flagellates, that form the base of ocean food webs. And since these protists form an important part of the food chain, these large DN…", "url": "https://phys.org/news/2025-06-scientists-giant-viruses-ocean-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-23.jpg", "publishedAt": "2025-06-07T10:16:18Z", "content": "Giant viruses play a role in the survival of single-celled marine organisms called protists. These include algae, amoeba, and flagellates, that form the base of ocean food webs. And since these proti… [+4803 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "June's full 'Strawberry Moon' illuminates the night sky next week: Here's how to see it - Space", "description": "Don't miss the 2025 full \"Strawberry Moon\" when it rises above the southeastern horizon on June 10.", "url": "https://www.space.com/stargazing/junes-full-strawberry-moon-illuminates-the-night-sky-next-week-heres-how-to-see-it", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6VxZZXmCHNJEVUwD7VBdBa.jpg", "publishedAt": "2025-06-07T10:00:00Z", "content": "This month's full \"Strawberry Moon\" graces the night sky on June 11, putting on a spectacular show as the fully-lit disk of Earth's natural satellite rides low over the southeastern horizon.\r\nWhat is… [+3063 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Clarissa Brincat", "title": "Which animal has the best sense of smell? - Live Science", "description": "There are multiple contenders for the title of best smeller, but no clear winner just yet.", "url": "https://www.livescience.com/animals/which-animal-has-the-best-sense-of-smell", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9EpjhJQphQwt8JYTr2cvvc.jpg", "publishedAt": "2025-06-07T09:00:00Z", "content": "From hunting prey to finding mates and avoiding predators, the ability to detect odors is crucial for survival in the animal kingdom.\r\nBut which species reigns supreme when it comes to smelling power… [+5113 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Just Found the Oldest Barred Spiral Galaxy – And It’s a Monster - SciTechDaily", "description": "An ancient, massive galaxy with a bar like the Milky Way defies models and unveils early galactic secrets.", "url": "https://scitechdaily.com/scientists-just-found-the-oldest-barred-spiral-galaxy-and-its-a-monster/", "urlToImage": "https://scitechdaily.com/images/Barred-Spiral-Galaxy-Concept.jpg", "publishedAt": "2025-06-07T07:41:24Z", "content": "J0107a, the earliest known barred spiral galaxy, reveals wild star formation and high-speed gas flows—clues to galaxy growth from the dawn of time. Credit: SciTechDaily.com\r\nA massive barred spiral g… [+3716 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "15,000 Light-Years Away, Something Is Blinking – And It Might Rewrite Physics - SciTechDaily", "description": "A strange star-like object pulses every 44 minutes, hinting at new astrophysical secrets.", "url": "https://scitechdaily.com/?p=478695", "urlToImage": "https://scitechdaily.com/images/ASKAP-J1832-0911.jpg", "publishedAt": "2025-06-07T07:09:59Z", "content": "An image of the sky showing the region around ASKAP J1832-0911. X-rays from NASA’s Chandra X-ray Observatory, radio data from the South African MeerKAT radio telescope, and infrared data from NASA’s … [+5322 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches Sirius XM radio satellite to orbit, lands rocket on ship at sea (photos) - Space", "description": "It was SpaceX's 69th Falcon 9 launch of the year already.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-sirius-xm-radio-satellite-to-orbit-lands-rocket-on-ship-at-sea-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8tnDivxki5wvR4zRssWNFD.jpg", "publishedAt": "2025-06-07T05:45:11Z", "content": "SpaceX launched the SXM-10 satellite for SiriusXM early Saturday morning (June 7), adding another spacecraft to the company's broadcasting constellation.\r\nA Falcon 9 rocket carrying SXM-10 lifted off… [+2063 chars]"}, {"source": {"id": null, "name": "Iron Mountain Daily News"}, "author": null, "title": "Snakes in the yard … maybe more in the future - ironmountaindailynews.com", "description": "Advisory: Mature content, though in snake form. Last Saturday had my mom’s youngest son and wife; her grandddaughter and two great-grandchildren; and grandson, wife and toddler great-grandddaughter all up for a marvelous weekend of good food and great company…", "url": "https://www.ironmountaindailynews.com/news/local-news/2025/06/snakes-in-the-yard-maybe-more-in-the-future/", "urlToImage": "https://ogden_images.s3.amazonaws.com/www.ironmountaindailynews.com/images/2025/06/06233319/Fox-Snake-Pair1-756x500.jpg", "publishedAt": "2025-06-07T05:22:27Z", "content": "(Betsy Bloom/Daily News photo)\r\n Western fox snakes are common in the Upper Peninsula, where the population is stable.\r\nAdvisory: Mature content, though in snake form.\r\nLast Saturday had my mom’s you… [+3731 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Will Newton", "title": "Many prehistoric animals – especially dinosaurs – were absolutely enormous. A scientist explains why they were so darn big - BBC Wildlife Magazine", "description": "The Earth has always been home to giants, but during prehistory there were a lot more giants than there are today - why is that?", "url": "https://www.discoverwildlife.com/apple-news/why-prehistoric-animals-were-so-big", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2025/06/why-were-prehistoric-animals-s-big.jpg?w=1200", "publishedAt": "2025-06-07T04:13:55Z", "content": "The first animals were incredibly small, but once they evolved (around 800 million years ago) it didnt take them long to achieve giant body sizes, says Will Newton.\r\n These prehistoric giants werent … [+13571 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Pandora Dewan", "title": "Science news this week: 'City-killer' asteroid swarms and a buried toddler 'Ice Prince' - Live Science", "description": "June 7, 2025: Our weekly roundup of the latest science in the news, as well as a few fascinating articles to keep you entertained over the weekend.", "url": "https://www.livescience.com/planet-earth/science-news-this-week-city-killer-asteroid-swarms-and-a-buried-toddler-ice-prince", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9EijdiEm8okzyjrXVSwkpV.png", "publishedAt": "2025-06-07T04:00:00Z", "content": "This week's science news started off with a bang as Europe's largest active volcano erupted Monday morning (June 2), spewing ash and black smoke around 21,300 feet (6,500 meters) into the air and sen… [+6404 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "James Webb telescope unveils largest-ever map of the universe, stretching from present day to the dawn of time - Live Science", "description": "The largest map of the universe, created with data from the James Webb Space Telescope, shows almost 800,000 galaxies crammed into a tiny piece of sky and spanning almost all of time.", "url": "https://www.livescience.com/space/cosmology/scientists-unveil-the-largest-map-of-the-universe-spanning-over-13-billion-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/j4odWTSBih9XMXxBtG9Lkf.jpg", "publishedAt": "2025-06-06T23:06:00Z", "content": "Scientists have unveiled the largest map of the universe ever created. Stretching across a tiny sliver of space and almost all cosmic time, it includes almost 800,000 galaxies imaged across the unive… [+2907 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "If books could kill: The poison legacy lurking in libraries - BBC", "description": "New technology at St Andrews University helps librarians detect when old books are bad for readers' health", "url": "https://www.bbc.com/news/articles/c4g2y9xq58no", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/b804/live/51328d10-42fa-11f0-9630-fd015488de94.jpg", "publishedAt": "2025-06-06T21:57:09Z", "content": "Pauline McLeanBBC Scotland Arts Correspondent\r\nGreen dye was widely used in Victorian publishing\r\nThe Victorians loved the colour green. In particular, they loved a vibrant shade of emerald created b… [+4622 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "Acting NASA Administrator Janet Petro June 6, 2025 - NASA Watch", "description": "Since President Trump appointed me to this interim role", "url": "https://nasawatch.com/ask-the-administrator/acting-nasa-administrator-janet-petro-june-6-2025/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/02/Janet-Petro-1.png", "publishedAt": "2025-06-06T21:29:11Z", "content": "Since President Trump appointed me to this interim role, I’ve remained committed to serving his administration, the NASA workforce, and the mission we carry out every day. I want to affirm that commi… [+2687 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "‘Superorganisms’ were just seen in the wild for the first time ever - Yahoo", "description": "For years, scientists have watched nematodes build massive superorganisms in the form of writhing towers. But, they’ve only seen it happen in the lab. Now, …...", "url": "https://bgr.com/science/superorganisms-were-just-seen-in-the-wild-for-the-first-time-ever/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/XsZ2ZbXPvHoegrbEXMB5hw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/bgr_208/7d763f5394907a76fd9db9b59439caa4", "publishedAt": "2025-06-06T21:15:00Z", "content": "If you purchase an independently reviewed product or service through a link on our website, BGR may receive an affiliate commission.\r\nFor years, scientists have watched nematodes build massive supero… [+3033 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "A surprising study revealed biological activity on a distant planet. Weeks later, scientists say there’s more to the story - CNN", "description": "As astronomers study an exoplanet called K2-18b, conflicting research reveals how difficult it is to find evidence of life beyond Earth.", "url": "https://www.cnn.com/2025/06/06/science/k218b-studies-planet-habitability", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230914141939-exoplanet-k2-18b.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-06-06T14:54:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nA tiny sign revealed in April seemed like it might cha… [+10153 chars]"}]}