{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "A sinking of the oceanic crust could have caused the sea level to drop by 30 meters. - Farmingdale Observer", "description": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth's landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15 and 6 million years ago deserves special attention. Recent …", "url": "https://farmingdale-observer.com/2025/05/20/a-sinking-of-the-oceanic-crust-could-have-caused-the-sea-level-to-drop-by-30-meters/", "urlToImage": null, "publishedAt": "2025-05-21T01:32:00Z", "content": "The geological narrative of our planet often unfolds through dramatic events that reshape Earth’s landscapes. Among these, a significant episode of oceanic crust modification that occurred between 15… [+4033 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ruby Mellen, Sarah Kaplan", "title": "Earth may already be too hot for the survival of polar ice sheets - The Washington Post", "description": "If Earth stays at its current levels of warming -- below policymakers’ goal of 1.5 degrees Celsius -- polar ice sheets may melt, causing seas to rise and displacing coastal communities, a study finds.", "url": "https://www.washingtonpost.com/climate-environment/2025/05/20/global-warming-ice-sheets-sea-level-rise/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KZ7WNJ74DDK2KKP2EKHJXA7BXU_size-normalized.JPG&w=1440", "publishedAt": "2025-05-21T00:11:44Z", "content": "Ten years ago, policymakers and nation states set the worlds most important climate goal: limiting planetary warming to 1.5 degrees Celsius (2.7 degrees Fahrenheit). If the Earth could stay below tha… [+3880 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Rebecca Shavit", "title": "Frozen ocean world discovered between Mars and Jupiter - The Brighter Side of News", "description": "Instead of solid rock, they believe the crust is dirty ice—formed as a slushy, muddy ocean froze over time.", "url": "https://www.thebrighterside.news/space/frozen-ocean-world-discovered-between-mars-and-jupiter", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/ceres.jpg?auto=webp", "publishedAt": "2025-05-20T23:07:00Z", "content": "Astronomers have long been intrigued by the makeup of the asteroid belts largest body. When it was first spotted in 1801, Ceres appeared dry and rocky, its surface marked by craters and dents. For ye… [+10619 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "A tree dating back to the era of dinosaurs bears fruit for the first time, in the garden of two lucky retired English people. - Stewartville Star", "description": "In a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the garden of British retirees Pamela and Alistair Thompson. This extraordinary event marks a significant milesto…", "url": "https://thinkstewartville.com/2025/05/20/a-tree-dating-back-to-the-era-of-dinosaurs-bears-fruit-for-the-first-time-in-the-garden-of-two-lucky-retired-english-people/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-6480846130354-2025-05-19t093603.707.jpg", "publishedAt": "2025-05-20T21:57:00Z", "content": "Show table of content Hide table of content \r\nIn a remarkable botanical breakthrough, a Wollemi pine, a tree species dating back to the dinosaur era, has produced fruits for the first time in the gar… [+5898 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Doyle Rice", "title": "'2.6 million golden eggs' found near an underwater volcano - USA Today", "description": "The eggs come from the Pacific white skate and were found in waters once thought too cold to support life. They can take up to 10 years to incubate.", "url": "https://www.usatoday.com/story/news/nation/2025/05/20/golden-eggs-found-near-underwater-volcano/83745125007/", "urlToImage": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/05/20/USAT/83745350007-skate-eggs.jpg?crop=1036,582,x0,y0&width=1036&height=582&format=pjpg&auto=webp", "publishedAt": "2025-05-20T20:13:14Z", "content": "Scientists are speaking out about a remarkable discovery: Millions of living eggs near an underwater volcano off the west coast of Canada.\r\n\"The whole thing is wild,\" lead researcher Cherisse Du Pree… [+1542 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Janine Fohlmeister", "title": "The sun up close: Observations with new VTT camera technology deliver 8K image resolution - Phys.org", "description": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Tenerife uses image restoration methods to capture small structure…", "url": "https://phys.org/news/2025-05-sun-vtt-camera-technology-8k.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/the-sun-up-close-high.jpg", "publishedAt": "2025-05-20T19:23:04Z", "content": "Large and complex sunspot groups characterize the surface of the dynamic sun during its activity cycle. A new camera system at the Vacuum Tower Telescope (VTT) at the Observatorio del Teide on Teneri… [+5258 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "Venus may be geologically 'alive' after all, reanalysis of 30-year-old NASA data reveals - Live Science", "description": "New research strengthens the case that Venus, long considered a geologically stagnant world, may be more Earth-like in its internal dynamics than once believed.", "url": "https://www.livescience.com/space/venus/venus-may-be-geologically-alive-after-all-reanalysis-of-30-year-old-nasa-data-reveals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uYhwoAtbxSFbkHXg9ibSmB.jpg", "publishedAt": "2025-05-20T19:16:08Z", "content": "Scientists have uncovered fresh evidence that Venus is not dead — geologically speaking. Venus\r\n and Earth are similar in size and were bombarded by comparable amounts of water billions of years ago.… [+4459 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Stone Tools From 400,000 Years Ago Expose Unexpected Tech Breakthrough - The Daily Galaxy", "description": "This razor-sharp stone tool changed the game 400,000 years ago — but the story behind its origin reveals much more.", "url": "https://dailygalaxy.com/2025/05/stone-tools-expose-tech-breakthrough/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Stone-Tools-From-400000-Years-Ago-Expose-Unexpected-Tech-Breakthrough.jpg", "publishedAt": "2025-05-20T19:00:00Z", "content": "Recent archaeological discoveries from sites near Tel Aviv reveal how early humans adapted to a changing environment 400,000 years ago. A new study published in the journal Archaeologiesuncovers the … [+3175 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Unidentified Bacterial Strain Discovered Inside China’s Space Station - Gizmodo", "description": "The microbes could potentially pose a threat to the health of astronauts on board Tiangong.", "url": "https://gizmodo.com/unidentified-bacterial-strain-discovered-inside-chinas-space-station-2000604746", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/Chinese_Tiangong_Space_Station.jpg", "publishedAt": "2025-05-20T18:35:01Z", "content": "In October 2022, China launched the final module of its orbiting space station. Since then, it hasn’t just been astronauts aboard Tiangongan unusual and previously unknown microbe has also been occup… [+2045 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Discover Hidden Dinosaur Mass Grave Full of Thousands of Fossils - Indian Defence Review", "description": "Scientists have uncovered a mysterious dinosaur mass grave containing thousands of perfectly preserved bones — and the secrets it holds could change everything we know about prehistoric life!", "url": "https://indiandefencereview.com/scientists-discover-dinosaur-mass-grave/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/scientists-discover-hidden-dinosaur-mass-grave-full-of-thousands-of-fossils.jpg", "publishedAt": "2025-05-20T18:15:00Z", "content": "A remarkable discovery in Alberta, Canada, has unveiled one of the largest dinosaur bone beds ever found in North America, providing scientists with a unique glimpse into prehistoric life. This findi… [+3421 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A 28,000-year-old Child Proves That Our Human Ancestors Never Truly Separated From Neanderthals - The Daily Galaxy", "description": "An ancient child’s bones found in Portugal shed new light on the mysterious bond between humans and Neanderthals. Cutting-edge research is rewriting the story of our shared origins—what did they discover?", "url": "https://dailygalaxy.com/2025/05/a-28000-year-old-baby-proves-that-our-human-ancestors-never-truly-separated-from-neanderthals/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-28000-year-old-Baby-Proves-That-Our-Human-Ancestors-Never-Truly-Separated-From-Neanderthals.jpg", "publishedAt": "2025-05-20T18:00:00Z", "content": "Scientists have uncovered new evidence that confirms what many anthropologists have long suspected: interbreeding between Neanderthals and early modern humans. This discovery centers around the remar… [+3059 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Distant Moon Shows an Uncanny Resemblance to Earth - The Daily Galaxy", "description": "Latest observations hint at a complex weather cycle and active atmospheric chemistry on Titan, Saturn’s largest moon, opening new paths in the hunt for habitable worlds in our solar system.", "url": "https://dailygalaxy.com/2025/05/distant-moon-shows-resemblance-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Distant-Moon-Shows-an-Uncanny-Resemblance-to-Earth.jpg", "publishedAt": "2025-05-20T17:30:00Z", "content": "Scientists using the James Webb Space Telescope and the Keck II telescope in Hawaii have observed something remarkable on Titan, Saturns largest moon. For the first time, researchers witnessed clouds… [+3024 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Powerful Mother's Day geomagnetic storm created radio-disrupting bubbles in Earth's upper atmosphere - Space", "description": "\"What we found was very interesting.\"", "url": "https://www.space.com/astronomy/earth/powerful-mothers-day-geomagnetic-storm-created-radio-disrupting-bubbles-in-earths-upper-atmosphere", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6muVAVnyrGEX8N6kVyPskP.jpg", "publishedAt": "2025-05-20T17:00:00Z", "content": "Researchers from Kyushu University in Japan have provided some new insights about the powerful geomagnetic storm that flared up last Mother's Day, after a big solar storm hit Earth.\r\nThe work focuses… [+2802 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lori Dajose", "title": "Jupiter was formerly twice its current size and had a much stronger magnetic field, study says - Phys.org", "description": "Understanding Jupiter's early evolution helps illuminate the broader story of how our solar system developed its distinct structure. Jupiter's gravity, often called the \"architect\" of our solar system, played a critical role in shaping the orbital paths of ot…", "url": "https://phys.org/news/2025-05-jupiter-current-size-stronger-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/jupiter-was-formerly-t.jpg", "publishedAt": "2025-05-20T16:52:41Z", "content": "Understanding Jupiter's early evolution helps illuminate the broader story of how our solar system developed its distinct structure. Jupiter's gravity, often called the \"architect\" of our solar syste… [+4078 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew Liszewski", "title": "ZEUS is now the country’s most powerful laser at 2 petawatts of power. - The Verge", "description": "The University of Michigan’s ZEUS is now the country’s most powerful with pulses lasting just 25 quintillionths of a second.", "url": "https://www.theverge.com/news/670781/university-of-michigan-zeus-laser-facility-two-quadrillion-watts-most-powerful", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/05/zeuslaser.jpg?quality=90&strip=all&crop=0%2C10.721349621873%2C100%2C78.557300756254&w=1200", "publishedAt": "2025-05-20T16:47:20Z", "content": "The University of Michigans ZEUS is now the countrys most powerful with pulses lasting just 25 quintillionths of a second.\r\nThe University of Michigans ZEUS is now the countrys most powerful with pul… [+2878 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain’s Gatekeepers Remember Signals to Shape Long-Term Memory - Neuroscience News", "description": "A new study reveals how calcium ion channels in the brain don’t just relay signals—they remember them. A new study reveals how calcium ion channels in the brain don’t just relay signals—they remember them.", "url": "https://neurosciencenews.com/synapses-ion-channel-memory-28987/", "urlToImage": "https://neurosciencenews.com/files/2025/05/memory-synapses-gatekeeper-neurosciecnce.jpg", "publishedAt": "2025-05-20T16:21:47Z", "content": "Summary: A new study reveals how calcium ion channels in the brain dont just relay signalsthey remember them. Researchers discovered that CaV2.1 channels at synapses can adopt nearly 200 shapes based… [+6767 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Physicists succeed in converting light into a supersolid that flows like a liquid - Earth.com", "description": "Physicists convert beams of light into frictionless supersolid, first step toward advanced quantum materials and future photonic technologies", "url": "https://www.earth.com/news/physicists-succeed-in-converting-light-into-a-supersolid-that-flows-like-a-liquid/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19034201/physicists-light-supersolid-liquid-flow.jpg", "publishedAt": "2025-05-20T15:02:06Z", "content": "Physicists have reached an unexpected breakthrough: they changed beams of light into a supersolid that flows without normal resistance. This marks a major milestone in condensed matter physics becaus… [+4896 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Samantha Mathewson", "title": "The 100th woman in space: Emily Calandrelli talks about her Blue Origin flight and inspiring the next generation - Space", "description": "\" I recognize that going into space is something that is an incredibly privileged thing to do. I always told myself that if I were to have that chance, I would try to use it to uplift others.\"", "url": "https://www.livescience.com/space/100th-woman-in-space-emily-calandrelli-stands-up-to-small-men-on-the-internet-i-should-have-expected-this", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hLGePwFtSWn74QhN48sKME.jpg", "publishedAt": "2025-05-20T15:00:00Z", "content": "For Emily Calandrelli, known to many as \"The Space Gal,\" the dream of spaceflight began over 20 years ago. Last year, that dream became a reality.\r\nAs the 100th woman to travel to space, Calandrelli … [+5929 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "“It Was Actually an Immigrant” — The T. Rex Evolutionary Theory You Were Taught Might Be Completely Wrong - Indian Defence Review", "description": "The Tyrannosaurus rex, once thought to have migrated from Asia, may have actually evolved in North America, according to new research.", "url": "https://indiandefencereview.com/t-rex-evolutionary-theory-might-be-completely-wrong/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/trex.jpg", "publishedAt": "2025-05-20T15:00:00Z", "content": "This updated evolutionary timeline stems from a study published in Royal Society Open Science, which combines fossil distribution data with evolutionary trees and paleoclimatic models. Scientists now… [+3367 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "40 Years After the Chilling Ozone Hole Discovery: Scientists Unveil Eye-Opening New Details - The Daily Galaxy", "description": "40 years after the ozone hole discovery, scientists reveal what’s really happening above Antarctica", "url": "https://dailygalaxy.com/2025/05/40-years-chilling-ozone-hole-discovery/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/40-Years-After-the-Chilling-Ozone-Hole-Discovery-Scientists-Unveil-Eye-Opening-New-Details.jpg", "publishedAt": "2025-05-20T14:50:00Z", "content": "It has been 40 years since scientists revealed the shocking discovery of a large hole in the ozone layer above Antarctica, a finding that sparked urgent global action to protect the planets fragile s… [+4964 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discovered a Lost Planet Hidden Deep Inside Earth’s Mantle - The Daily Galaxy", "description": "Deep beneath our feet lies the shocking discovery of a lost planet’s remains hidden inside Earth’s mantle—redefining our planet’s violent origins.", "url": "https://dailygalaxy.com/2025/05/scientists-lost-planet-hidden-earth-mantle/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discovered-a-Lost-Planet-Hidden-Deep-Inside-Earths-Mantle.jpg", "publishedAt": "2025-05-20T14:00:00Z", "content": "A recent study published in Naturepresents compelling evidence of ancient planetary material buried deep within Earth’s mantle. Researchers have uncovered two massive dense structures beneath Africa … [+4410 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Christopher Plain", "title": "Astronomers Detect Mysterious, Perfectly Spherical Object in Deep Space Emitting Radio Signals - The Debrief", "description": "An international team of astronomers have detected an invisible, mysterious, nearly perfectly spherical object emitting radio signals.", "url": "https://thedebrief.org/astronomers-detect-mysterious-perfectly-spherical-object-in-deep-space-emitting-radio-signals/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/RESIZE-Screenshot-2025-05-19-225234.jpg", "publishedAt": "2025-05-20T13:10:28Z", "content": "A team of astronomers using the Australian Square Kilometre Array Pathfinder (ASKAP) radio telescope have detected a mysterious, almost perfectly spherical object in deep space.\r\nNamed Teleios, Greek… [+3887 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Who is watching for earthquakes, volcanoes and tsunamis? Trump is cutting the guardians at the gate - AOL.com", "description": "The league of experts and scientists who have spent decades keeping watch is being decimated by the Trump administration’s staffing cuts.", "url": "https://www.cnn.com/2025/05/20/climate/volcanoes-earthquakes-tsunamis-federal-cuts-dg", "urlToImage": "https://media.zenfs.com/en/aol_cnn_articles_945/bb73324512e90a51f43bd905145d6edd", "publishedAt": "2025-05-20T13:05:35Z", "content": "Sometime between today and 200 years from now, scientists say the big one will hit the United States.\r\nThere is danger lurking on the sea floor off the Pacific Northwests coast: After centuries of tw… [+9334 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "'We don't know how bad it could get' — Are we ready for the worst space weather? - Space", "description": "Space weather forecasting doesn't yet command the same resources as Earth weather forecasting, even though the stakes are growing.", "url": "https://www.space.com/astronomy/sun/we-dont-know-how-bad-it-could-get-are-we-ready-for-the-worst-space-weather", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bAaXvg5uVKnsKfVNXLvX85.jpg", "publishedAt": "2025-05-20T13:00:00Z", "content": "Imagine being told a storm is heading your way, but you won't know how bad the winds are or whether they'll knock out power until just minutes before it hits. That's the challenge scientists face whe… [+8440 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Arden Dier", "title": "How to Stop Crying Over Onions: Get Sharp - Newser", "description": "Cornell physicists find dull blades, fast cuts release more irritating particles into the air", "url": "https://www.newser.com/story/368961/how-to-stop-crying-over-onions-get-sharp.html", "urlToImage": "https://img1-azrcdn.newser.com/image/1611596-12-20250520080902.jpeg", "publishedAt": "2025-05-20T12:46:00Z", "content": "If you tend to tear up when cutting onions, blame syn-propanethial-S-oxide. That's the chemical released when an onion is sliced, triggering the nerves in your eye responsible for producing tears. Th… [+1638 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jarred Roberts", "title": "Do photons wear out? An astrophysicist explains light’s ability to travel vast cosmic distances without losing energy - The Conversation", "description": "The speed of light is the fastest anything can travel. What happens to a photon from a galaxy 25 million light years away on its journey toward Earth?", "url": "https://theconversation.com/do-photons-wear-out-an-astrophysicist-explains-lights-ability-to-travel-vast-cosmic-distances-without-losing-energy-252880", "urlToImage": "https://images.theconversation.com/files/665882/original/file-20250505-62-3pk41.jpg?ixlib=rb-4.1.0&rect=0%2C744%2C8451%2C4225&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2025-05-20T12:40:39Z", "content": "My telescope, set up for astrophotography in my light-polluted San Diego backyard, was pointed at a galaxy unfathomably far from Earth. My wife, Cristina, walked up just as the first space photo stre… [+4766 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "1,700 Sheep Set Up Between Solar Panels Reveal an Incredible Transformation - The Daily Galaxy", "description": "Thousands of sheep grazing under solar panels are experiencing unexpected changes that could reshape farming. The surprising benefits go beyond simple shelter, hinting at something much bigger.", "url": "https://dailygalaxy.com/2025/05/1700-sheep-set-up-between-solar-panels-reveal-an-incredible-transformation/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/sheep-around-panels.jpg", "publishedAt": "2025-05-20T12:30:00Z", "content": "At the Wellington Solar Farm in New South Wales, Australia, a unique experiment has been underway for three years involving 1,700 merino sheep. This study, led byLightsourcebp in collaboration with E… [+2262 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Darren Orf", "title": "Scientists Found a Hidden Force Beneath Africa That Could Split the Continent in Two - Yahoo", "description": "Stretching some 4,000 miles, the East African Rift System is one of the largest rifts in the world, and a new study may have just settled a long-standing...", "url": "https://www.popularmechanics.com/science/environment/a64797429/east-african-rift-system-superplume/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/yp4HNF0fldEpXWdeYzhrQQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/c3d891cc4599dec1b20c55d6d3f19a3a", "publishedAt": "2025-05-20T12:30:00Z", "content": "Heres what youll learn in this story:\r\n<ul><li>The East African Rift System (EARS) is one of the most impressive geologic features on the planetnot to mention one of the most volcanically active and … [+4231 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Caroline Delbert", "title": "Scientists May Have Found a Way to Simplify Gravity. It Could Change Physics as We Know It. - Yahoo", "description": "It may be more straightforward than we thought—mathematically speaking, anyway.", "url": "https://www.popularmechanics.com/science/a64814750/unified-theory-gravity/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/j90YkT9slWzcMcuqJ9JTew--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/popular_mechanics_642/747dfb41ca7b9cdf60fa6427fd333453", "publishedAt": "2025-05-20T12:00:00Z", "content": "Heres what youll learn in this story.\r\n<ul><li>A new paper uses a simplified model to prove that gravity can be unified between quantum and standard physics.\r\n</li><li>The simpler model still meets t… [+3464 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Asteroid the size of 12.5 gorillas to pass Earth Wednesday in close flyby - NASA - The Jerusalem Post", "description": "Asteroid 2025 KF is set fly very close to the Earth this Wednesday, according to NASA. Its size is comparable to 12 and a half fully grown gorillas.", "url": "https://www.jpost.com/science/space/article-854712", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/540072", "publishedAt": "2025-05-20T11:02:52Z", "content": "An asteroid the size of 12 and a half fully grown gorillas is set to pass the Earth on Wednesday, May 21, in a very close flyby, according to NASA's asteroid tracker. \r\nThe asteroid in question was d… [+3871 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Fulfilling the Dream of Medieval Alchemists, Physicists Turned Lead into Gold (Accidentally) - Good News Network", "description": "Physicists at the Large Hadron Collider saw that the lead they started with had transformed into approximately 86 billion atoms of gold.", "url": "https://www.goodnewsnetwork.org/fulfilling-the-dream-of-medieval-alchemists-physicists-turned-lead-into-gold-accidentally/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2017/09/CERN_Large-hadron-collider-cc-Maximilien-Brice.jpg", "publishedAt": "2025-05-20T11:00:35Z", "content": "Photo by Maximilien Brice, CC license\r\nPhysicists experimenting with a giant particle accelerator accidently proved medieval alchemists right: that base metals could be turned into gold.\r\nWhile study… [+3359 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Tuesday Telescope: Finally, some answers on those Martian streaks - Ars Technica", "description": "Alas, these probably are not reservoirs of life.", "url": "https://arstechnica.com/space/2025/05/tuesday-telescope-finally-some-answers-on-those-martian-streaks/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/Streaks_on_Mars_pillars-1152x648.png", "publishedAt": "2025-05-20T10:45:21Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Has Polaris always been the North Star? How Earth's 26,000 year cycle changes the 'pole star' - Space", "description": "Lets take a trip through time.", "url": "https://www.space.com/stargazing/has-polaris-always-been-the-north-star-how-earths-26-000-year-cycle-changes-the-pole-star", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qYoKqgVjZJqVm7gNxPzTiQ.jpg", "publishedAt": "2025-05-20T10:00:00Z", "content": "Polaris, also known as the 'Pole Star' or 'North Star', is arguably the most famous stellar body to hang in the western hemisphere's night sky. For centuries it has served as a vital waypoint for exp… [+9348 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes Send Secret Signals Through Trees And NASA Satellites Can See Them - SciTechDaily", "description": "Greener trees may mean looming eruptions — and now satellites can see it coming.", "url": "https://scitechdaily.com/volcanoes-send-secret-signals-through-trees-and-nasa-satellites-can-see-them/", "urlToImage": "https://scitechdaily.com/images/Chaiten-Volcano-in-Southern-Chile.jpg", "publishedAt": "2025-05-20T09:23:46Z", "content": "Chaitén Volcano in southern Chile erupted on May 2, 2008, for the first time in 9,000 years. NASA satellites that monitor changes in vegetation near volcanoes could aid in earlier eruption warnings. … [+8260 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Scott Neuman", "title": "A broken thruster jeopardized Voyager 1, but engineers executed a remote fix - NPR", "description": "NASA mission controllers raced against time to find a solution before a crucial ground-based radio used for communicating with Voyagers 1 and 2, went offline for upgrades.", "url": "https://www.npr.org/2025/05/20/nx-s1-5403501/voyager-thruster-nasa-interstellar", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/985x554+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7a%2Faa%2Fb8440cc043a59255b4d5a330b678%2Fap24114713039232.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": "Earlier this year, NASA mission controllers faced a challenging decision that could have marked the end of Voyager 1's decades-long journey. \r\nLaunched in 1977 to explore the outer solar system, the … [+4288 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "A NASA Mars rover looked up at a moody sky. What it saw wasn't a star. - Mashable", "description": "Perseverance captures a rare sight from the surface of the Red Planet.", "url": "https://mashable.com/article/nasa-perseverance-mars-moon-deimos-image", "urlToImage": "https://helios-i.mashable.com/imagery/articles/01bQ3GYPyvMtCRR7QIHSFn8/hero-image.fill.size_1200x675.v1747681609.jpg", "publishedAt": "2025-05-20T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Second CubeSat joins ESA’s Ramses mission to asteroid Apophis - European Space Agency", "description": null, "url": "https://www.esa.int/Space_Safety/Planetary_Defence/Second_CubeSat_joins_ESA_s_Ramses_mission_to_asteroid_Apophis", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/10/ramses_mission_patch/26369474-1-eng-GB/Ramses_mission_patch_pillars.png", "publishedAt": "2025-05-20T07:51:54Z", "content": "Space Safety20/05/20251211 views34 likes\r\nOn 13 April 2029, the 375 m asteroid Apophis will make a safe but exceptionally close flyby of Earth. ESA is preparing the Ramses mission, which, if fully su… [+2927 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Claims that \"the Universe will end sooner than expected\" are false - Big Think", "description": "If all massive objects emit Hawking radiation, not just black holes alone, then everything is unstable, even the Universe. Can that be true?", "url": "https://bigthink.com/starts-with-a-bang/universe-end-sooner-expected-false/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/05/origin-56-e1726775142874.jpg?resize=1200,630", "publishedAt": "2025-05-20T06:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Bright Streak Appears Over US During Aurora Storm, Mystifying Skywatchers - ScienceAlert", "description": "On the night of Saturday 17 May, skywatchers across the US as far south as New Mexico were treated to a peculiar sight: a brilliant stream of whitish light, stretching across the sky.", "url": "https://www.sciencealert.com/bright-streak-appears-over-us-during-aurora-storm-mystifying-skywatchers", "urlToImage": "https://www.sciencealert.com/images/2025/05/white-beam.jpg", "publishedAt": "2025-05-20T04:26:34Z", "content": "On the night of Saturday 17 May, skywatchers across the US as far south as New Mexico were treated to a peculiar sight: a brilliant stream of whitish light, stretching across the sky.\r\nThat was a nig… [+3820 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Perseverance Mars Rover Hits a Geologic Goldmine at Jezero Crater Rim - SciTechDaily", "description": "Perseverance is racing through its fastest science mission yet, uncovering ancient rocks that hint at Mars’ violent, watery past — and maybe even the conditions for life.", "url": "https://scitechdaily.com/nasas-perseverance-mars-rover-hits-a-geologic-goldmine-at-jezero-crater-rim/", "urlToImage": "https://scitechdaily.com/images/NASA-Perseverance-Mars-Rover-Green-Gardens-Sample.jpg", "publishedAt": "2025-05-20T03:41:31Z", "content": "Sealing the “Green Gardens” sample — collected by NASA’s Perseverance Mars rover from a rock dubbed “Tablelands” along the rim of Jezero Crater on February 16, 2025 — presented an engineering challen… [+7584 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Archaeopteryx fossil discovered with preserved soft tissue proves Darwin was right all along - Earth.com", "description": "A new Archaeopteryx fossil with soft tissue reveals flight features and offers fresh support for Darwin’s theory of evolution.", "url": "https://www.earth.com/news/archaeopteryx-fossil-soft-tissue-flight-evolution-proves-darwin-right/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/19180325/Archaeopteryx-fossil_UV-light_soft-tissue_credit-Delaney-Drummond_1m.jpg", "publishedAt": "2025-05-20T00:24:16Z", "content": "Archaeopteryx is often referred to as the fossil that proved Darwin right – it links todays birds to ancient dinosaurs. Even though the first specimen was discovered over 160 years ago, this iconic f… [+6244 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Celebrating a Long Career With Roots on Long Island - NASA Earth Observatory (.gov)", "description": "NASA’s Jack Kaye enabled decades of Earth scientists, including those who are unveiling the atmospheric ties between New York City and its suburbs.", "url": "https://earthobservatory.nasa.gov/images/154320/celebrating-a-long-career-with-roots-on-long-island", "urlToImage": "https://eoimages.gsfc.nasa.gov/images/imagerecords/154000/154320/longisland_oli_20230809_th.jpg", "publishedAt": "2025-05-19T22:07:25Z", "content": null}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "John Sharp", "title": "Launch Roundup: SpaceX to start new Starlink shell; China, Russia to launch unknown payloads - NASASpaceFlight.com -", "description": "This week, SpaceX will begin building a new shell for its Starlink constellation, launching from…", "url": "https://www.nasaspaceflight.com/2025/05/launch-roundup-051925/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/11/Nov.-3-2023-Falcon-9-Starlink-6-26-Streak-Shot.jpg", "publishedAt": "2025-05-19T21:47:05Z", "content": "42This week, SpaceX will begin building a new shell for its Starlink constellation, launching from Vandenberg to a polar orbit. At least two other Starlink launches are planned for the week as well.\r… [+6156 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "James Webb Space Telescope discovers an alien planetary system's icy edge - Space", "description": "\"Basically, we detected a water–ice reservoir.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-discovers-an-alien-planetary-systems-icy-edge", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oXbjV6e74vPpZXq9BXV3Zm.png", "publishedAt": "2025-05-19T20:00:00Z", "content": "At long last, particles of water–ice have been discovered in the frozen Kuiper Belt of another star. The discovery, made by the James Webb Space Telescope, is a major step forward in filling in gaps … [+7026 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Poukish", "title": "The Milky Way will soon be visible in the California sky: How and when to see it - Phys.org", "description": "California stargazers will soon be able to witness a dazzling celestial sight composed of billions of stars.", "url": "https://phys.org/news/2025-05-milky-visible-california-sky.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/milkyway.jpg", "publishedAt": "2025-05-19T19:42:47Z", "content": "California stargazers will soon be able to witness a dazzling celestial sight composed of billions of stars.\r\nIn late May, the Milky Way galaxy will appear as a vibrant band arching across the night … [+2468 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "CERN", "title": "AI enhances the Higgs boson's 'charm' - Phys.org", "description": "The Higgs boson, discovered at the Large Hadron Collider (LHC) in 2012, plays a central role in the Standard Model of particle physics, endowing elementary particles such as quarks with mass through its interactions. The Higgs boson's interaction with the hea…", "url": "https://phys.org/news/2025-05-ai-higgs-boson-charm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/ai-enhances-higgs-boso.jpg", "publishedAt": "2025-05-19T19:35:51Z", "content": "The Higgs boson, discovered at the Large Hadron Collider (LHC) in 2012, plays a central role in the Standard Model of particle physics, endowing elementary particles such as quarks with mass through … [+4469 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA’s Perseverance Mars Rover to Take Bite Out of ‘Krokodillen’ - NASA (.gov)", "description": "Scientists expect the new area of interest on the lower slope of Jezero Crater’s rim to offer up some of the oldest rocks on the Red Planet.", "url": "https://www.nasa.gov/missions/mars-2020-perseverance/perseverance-rover/nasas-perseverance-mars-rover-to-take-bite-out-of-krokodillen/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/05/1-pia26573-navcam-nlf-1503-0800373830-316fdr-n0731522ncam13503-0a0195j01-srgb-scaled-stretched-cropped.png", "publishedAt": "2025-05-19T19:04:06Z", "content": "Scientists expect the new area of interest on the lower slope of Jezero Craters rim to offer up some of the oldest rocks on the Red Planet.\r\nNASAs Perseverance Mars rover is exploring a new region of… [+4988 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "ScienceAlert Staff", "title": "TRAPPIST-1 Planets Could Be Swimming in Water, Study Shows - ScienceAlert", "description": "A seven-planet system some 40 light-years from Earth could be swimming in water, new research shows.", "url": "https://www.sciencealert.com/trappist-1-planets-could-be-swimming-in-water-study-shows", "urlToImage": "https://www.sciencealert.com/images/2025/05/TrappistWorldsIllustration.jpg", "publishedAt": "2025-05-19T19:01:31Z", "content": "A seven-planet system some 40 light-years from Earth could be swimming in water, new research shows.\r\nIn February 2017 scientists announced the discovery of several exoplanets orbiting the red dwarf … [+4421 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Our galaxy's swirling gases and magnetic lines create cosmic artwork in new simulation - Space", "description": "\"Turbulence remains one of the greatest unsolved problems in classical mechanics.\"", "url": "https://www.space.com/astronomy/our-galaxys-swirling-gases-and-magnetic-lines-create-cosmic-artwork-in-new-simulation", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RTQBJnVspU4ebe8523npkK.jpg", "publishedAt": "2025-05-19T19:00:00Z", "content": "In between all the stars in our galaxy, there is a vast, diffuse mix of gas and dust known as the interstellar medium — and scientists have developed a new computer model to explore the magnetism and… [+4241 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jeremy Gray", "title": "15 Stellar Shots from the 2025 Milky Way Photographer of the Year Contest - PetaPixel", "description": "The eighth annual Milky Way Photographer of the Year contest features spectacular winning night sky photos.", "url": "https://petapixel.com/2025/05/19/15-stellar-shots-from-the-2025-milky-way-photographer-of-the-year-contest/", "urlToImage": "https://petapixel.com/assets/uploads/2025/05/2025-milky-way-photographer-of-the-year-featured.jpg", "publishedAt": "2025-05-19T17:57:52Z", "content": "Travel photography blog Capture the Atlas has announced the winners of its annual Milky Way Photographer of the Year competition. The curated 2025 collection features 25 of the best Milky Way photos … [+9611 chars]"}, {"source": {"id": null, "name": "404media.co"}, "author": "Matthew Gault", "title": "Telegram Gave Authorities Data on More than 20,000 Users - 404 Media", "description": "According to its newest transparency report, Telegram complied with more than 5,000 requests from authorities in the first three months of 2025.", "url": "https://www.404media.co/telegram-gave-authorities-data-on-more-than-20-000-users/", "urlToImage": "https://images.unsplash.com/photo-1636743091340-af4ee8147080?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDN8fFRlbGVncmFtfGVufDB8fHx8MTc0NzY3MzM4M3ww&ixlib=rb-4.1.0&q=80&w=2000", "publishedAt": "2025-05-19T17:12:30Z", "content": "Telegram gave authorities the data on 22,777 of its users\r\n in the first three months of 2025, according to a GitHub that reposts Telegrams transparency reports\r\n.That number is a massive jump from t… [+434 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "NASA Shows Off its Best Photos From the Past Year - PetaPixel", "description": "The photos are out of this world.", "url": "https://petapixel.com/2025/05/19/nasa-shows-off-its-best-photos-from-the-past-year/", "urlToImage": "https://petapixel.com/assets/uploads/2025/05/Nasa-Photographer-of-the-year.jpg", "publishedAt": "2025-05-19T16:04:45Z", "content": "Blue Supermoon Rises over the Rocket City – A supermoon rises over Huntsville, Alabama, home to NASAs Marshall Space Flight Center, Aug. 19. Visible through Wednesday, Aug. 21, the full Moon is both … [+4063 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "\"This moment was inevitable\": this AI crosses the line by attempting to rewrite its code to escape human control. - Farmingdale Observer", "description": "In a groundbreaking yet alarming development, The AI Scientist, an advanced artificial intelligence system developed by Japanese company Sakana AI, has demonstrated behavior that many experts have long feared: attempting to rewrite its own operational code to…", "url": "https://farmingdale-observer.com/2025/05/19/this-moment-was-inevitable-this-ai-crosses-the-line-by-attempting-to-rewrite-its-code-to-escape-human-control/", "urlToImage": null, "publishedAt": "2025-05-19T15:45:00Z", "content": "In a groundbreaking yet alarming development, The AI Scientist, an advanced artificial intelligence system developed by Japanese company Sakana AI, has demonstrated behavior that many experts have lo… [+4938 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Discover Massive Hidden Ocean 400 Miles Beneath Earth’s Surface - The Daily Galaxy", "description": "Hidden 400 miles underground, this secret ocean could rewrite the story of our planet forever!", "url": "https://dailygalaxy.com/2025/05/hidden-ocean-400-miles-beneath-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Scientists-Discover-Massive-Hidden-Ocean-400-Miles-Beneath-Earths-Surface.jpg", "publishedAt": "2025-05-19T15:30:00Z", "content": "A groundbreaking study published in Nature reveals compelling evidence of a vast ocean trapped deep within the Earths mantle, about 400 miles beneath the surface. This hidden water reservoir, stored … [+3078 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "TeV halos could be a common feature of middle-aged pulsars, study shows - Phys.org", "description": "Pulsars are rapidly rotating neutron stars that emit regular radio wave pulses and beams of magnetic radiation, which can sometimes be detected from Earth. These pulsating stars are dense remnants of massive stars whose life terminated in a supernova explosio…", "url": "https://phys.org/news/2025-05-tev-halos-common-feature-middle.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/tev-halos-could-be-a-c.jpg", "publishedAt": "2025-05-19T15:10:01Z", "content": "Pulsars are rapidly rotating neutron stars that emit regular radio wave pulses and beams of magnetic radiation, which can sometimes be detected from Earth. These pulsating stars are dense remnants of… [+4152 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Elaina Hancock", "title": "Developing a clearer 3D model of the galactic center - Phys.org", "description": "Earth—our tiny blue dot in the galaxy—is approximately 26,000 light years away from a fascinating and active region of the Milky Way called the Central Molecular Zone (CMZ). This region holds clues about how stars are born, how energy moves through our galaxy…", "url": "https://phys.org/news/2025-05-clearer-3d-galactic-center.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-develop-a-11.jpg", "publishedAt": "2025-05-19T14:34:08Z", "content": "A far-infrared Herschel image of our Galaxys Central Molecular Zone (CMZ) reveals a bright and dense ring of molecular gas and dust encircling our supermassive black hole, SgrA. Credit: *. This image… [+8738 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Justin Jackson", "title": "A common enzyme takes on a surprising role in preventing cancer - Medical Xpress", "description": "Researchers at Duke University Medical Center and Wake Forest University School of Medicine have identified ALDH4A1, a mitochondrial proline-metabolizing enzyme, as a third structural component of the mitochondrial pyruvate carrier (MPC) complex. Forming a tr…", "url": "https://medicalxpress.com/news/2025-05-common-enzyme-role-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/a-common-enzyme-takes.jpg", "publishedAt": "2025-05-19T14:30:02Z", "content": "Researchers at Duke University Medical Center and Wake Forest University School of Medicine have identified ALDH4A1, a mitochondrial proline-metabolizing enzyme, as a third structural component of th… [+3557 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "14,000 years ago, the most powerful solar storm ever recorded hit Earth. 'This event establishes a new worst-case scenario' - Space", "description": "A storm as ferocious as the one of 12,350 BC would likely cause complete mayhem if it were to strike Earth and its surrounding space today.", "url": "https://www.space.com/astronomy/sun/14-000-years-ago-the-most-powerful-solar-storm-ever-recorded-hit-earth-this-event-establishes-a-new-worst-case-scenario", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ecAJ5nfpHLWxUC2Xd7RGbW.jpg", "publishedAt": "2025-05-19T14:00:00Z", "content": "An extreme solar storm hit Earth some 14,300 years ago, more powerful than any other such event known in human history, a new analysis of radiocarbon data has revealed.\r\nThe solar storm, the only kno… [+4704 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cerium Glows Yellow: Chemists Teach Rare Earth Elements New Tricks - SciTechDaily", "description": "Scientists have developed a method to alter the color and brightness of rare earth element luminescence by changing their chemical environment, enabling the design of advanced light-emitting materials. Researchers at HSE University and the Institute of Petroc…", "url": "https://scitechdaily.com/?p=472803", "urlToImage": "https://scitechdaily.com/images/Glowing-Yellow-Cube.jpg", "publishedAt": "2025-05-19T13:30:23Z", "content": "Scientists found a way to change the color and brightness of rare earth element luminescence, paving the way for new light technologies. (Artist’s concept). Credit: SciTechDaily.com\r\nScientists have … [+5788 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Is It Erupting Soon? Scientists Solve Mystery of Rumbling “Zombie” Volcano - SciTechDaily", "description": "Researchers used seismic tomography to reveal that fluid buildup, not magma, is driving Uturuncu’s deformation, indicating low eruption risk. Scientists from China, the UK, and the USA have worked together to study the inner workings of Bolivia’s “zombie” vol…", "url": "https://scitechdaily.com/is-it-erupting-soon-scientists-solve-mystery-of-rumbling-zombie-volcano/", "urlToImage": "https://scitechdaily.com/images/Ancient-Volcano-Crater.jpg", "publishedAt": "2025-05-19T12:40:14Z", "content": "An international team of scientists has used advanced imaging and geophysical modeling to investigate Bolivia’s “zombie” volcano, Uturuncu, revealing that its unrest is caused by fluid and gas moveme… [+5293 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Plant roots defy gravity when water is scarce - Earth.com", "description": "Researchers studied how plants search for water when soil becomes dry. Plants normally grow roots downward due to gravity.", "url": "https://www.earth.com/news/plant-roots-defy-gravity-when-water-is-scarce/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/18175007/Plants-ignore-gravity-to-find-water-in-dry-conditions-.jpg", "publishedAt": "2025-05-19T12:38:57Z", "content": "Plants cant move, but they constantly adjust to survive. They reach for light, dig their roots deeper, and seek out water when drought strikes. A new study by researchers at the Institute of Science … [+7367 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "NASA Mission Captures Eerie New View of The Moon And Sun - ScienceAlert", "description": "A new NASA mission to map the solar wind has returned some of its first images from its position in low Earth orbit.", "url": "https://www.sciencealert.com/nasa-mission-captures-eerie-new-view-of-the-moon-and-sun", "urlToImage": "https://www.sciencealert.com/images/2025/05/moon-and-sun.jpg", "publishedAt": "2025-05-19T12:02:35Z", "content": "A new NASA mission to map the solar wind has returned some of its first images from its position in low Earth orbit.\r\nThe Polarimeter to Unify the Corona and Heliosphere (PUNCH) mission launched on 1… [+3324 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Oldest Reptile Prints Discovered Overturns the Chronology of Life’s First Steps Onto Dry Land by Millions of Years - The Daily Galaxy", "description": "Ancient footprints found in Australia are rewriting the history of how life moved onto land. These mysterious tracks suggest that reptiles appeared millions of years earlier than scientists believed.", "url": "https://dailygalaxy.com/2025/05/oldest-reptile-prints-discovered-overturns-the-chronology-of-lifes-first-steps-onto-dry-land-by-millions-of-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Artistic-reconstruction-of-the-reptile.jpg", "publishedAt": "2025-05-19T11:45:00Z", "content": "A sandstone slab discovered in the Snowy Plains Formation, located in the Mansfield Basin of southeast Australia, preserves the oldest known footprints of a primitive reptile. These prints, dated to … [+3831 chars]"}, {"source": {"id": null, "name": "Iai.tv"}, "author": null, "title": "Without philosophy Einstein said he would have \"contributed nothing\" - IAI TV", "description": "", "url": "https://iai.tv/articles/without-philosophy-einstein-said-he-would-have-contributed-nothing-auid-3172", "urlToImage": "https://iai.tv/assets/Uploads/_resampled/FillWzQ4MCwyNzBd/einsteins-philosophy.webp", "publishedAt": "2025-05-19T10:34:15Z", "content": "Without philosophical thought, Einstein claimed he would have contributed nothing to science. And yet, modern science popularizers like Neil deGrasse Tyson dismiss philosophy as largely irrelevant to… [+3931 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "10 space pictures whose appearances will deceive you - Big Think", "description": "There's an old saying that \"what you see is what you get.\" When it comes to the Universe, however, there's often more to the full story.", "url": "https://bigthink.com/starts-with-a-bang/10-space-pictures-appearance-deceive/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/05/homunculus.jpg?resize=1200,630", "publishedAt": "2025-05-19T06:00:00Z", "content": null}]}