{"status": "ok", "totalResults": 49, "articles": [{"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "Breaking News: Newly-Discovered Sideways Lines Might Trace the Release of Smaller Objects by… - Avi Loeb – Medium", "description": "Today a new image of the interstellar object 3I/ATLAS was taken by M. Jäger, G. Rhemann, and E. Prosperi and reported here. The image…", "url": "https://avi-loeb.medium.com/breaking-news-newly-discovered-sideways-lines-might-trace-the-release-of-smaller-objects-by-de3e38121c6e", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*Rp9Mvpuv1timMHiKYxsDeA.jpeg", "publishedAt": "2025-11-21T00:43:02Z", "content": "A stacked image of 3I/ATLAS based on 20 exposures of 100 seconds each, taken at 4:15 UTC on November 20, 2025. The displayed field has dimensions of 16.7 arcminutes on a side, equivalent to 1.6 milli… [+11067 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Rocket returned, lightly used: Why Blue Origin's landed New Glenn booster is so clean - Space", "description": "It all comes down to the fuel.", "url": "https://www.space.com/space-exploration/launches-spacecraft/rocket-returned-lightly-used-why-blue-origins-landed-new-glenn-booster-is-so-clean", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2Qs2oFTLb3NvSEhMa2Xr8Q-1920-80.jpg", "publishedAt": "2025-11-20T23:00:00Z", "content": "Blue Origin's New Glenn rocket aced its first-ever landing last week — and even managed to stay pretty, despite the ordeal.\r\nThe milestone occurred on Nov. 13, during the launch of NASA's twin ESCAPA… [+2590 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "This Prehistoric Sea Monster Was the Apex Predator of Ancient Seas—And It Had Bone Blades! - Indian Defence Review", "description": "Imagine a sea monster with bone blades for teeth, lurking in ancient waters 360 million years ago.", "url": "https://indiandefencereview.com/prehistoric-sea-monster-was-apex-predator/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/11/this-prehistoric-sea-monster-was-the-apex-predator-of-ancient-seasand-it-had-bone-blades.png", "publishedAt": "2025-11-20T23:00:00Z", "content": "360 million years ago, Cleveland’s shallow seas were home to a fearsome predator unlike anything we see today: Dunkleosteus. This ancient fish, growing over 14 feet long, is famous for its bizarre fe… [+5312 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ellyn Lapointe", "title": "A NASA Space Telescope Is Falling Out of the Sky. Can This Startup Save it? - Gizmodo", "description": "In 2026, a first-of-its-kind spacecraft—launched on a rocket dropped out of a plane—will attempt to save NASA’s Swift observatory from a fiery demise. Yes, really.", "url": "https://gizmodo.com/a-nasa-space-telescope-is-falling-out-of-the-sky-can-this-startup-save-it-2000689124", "urlToImage": "https://gizmodo.com/app/uploads/2025/11/Swift-observatory--1200x675.jpg", "publishedAt": "2025-11-20T21:20:02Z", "content": "An Earth-orbiting NASA telescope is slowly falling out of the sky, with a 90% chance of uncontrolled reentry by the end of 2026. To avoid this risk and extend the observatorys lifespan, NASA has tapp… [+3265 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "James Webb Space Telescope spots rapidly feeding supermassive black hole in the infant universe: 'This discovery is truly remarkable.' - Space", "description": "\"This challenges our understanding of black hole and galaxy formation in the early universe.\"", "url": "https://www.space.com/astronomy/black-holes/james-webb-space-telescope-spots-rapidly-feeding-supermassive-black-hole-in-the-infant-universe-this-discovery-is-truly-remarkable", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xoJNa3HDFxJSTBgsfa68AW-1600-80.png", "publishedAt": "2025-11-20T21:00:00Z", "content": "Using the James Webb Space Telescope (JWST), astronomers have uncovered a voraciously feeding and rapidly growing supermassive black hole in the infant universe. Existing just 570 million years after… [+4774 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Max Planck Society", "title": "Theia and Earth were neighbors, new research suggests - Phys.org", "description": "About 4.5 billion years ago, the most momentous event in the history of Earth occurred: a huge celestial body called Theia collided with the young Earth. How the collision unfolded and what exactly happened afterward has not been conclusively clarified. What …", "url": "https://phys.org/news/2025-11-theia-earth-neighbors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/earth.jpg", "publishedAt": "2025-11-20T19:00:12Z", "content": "About 4.5 billion years ago, the most momentous event in the history of Earth occurred: a huge celestial body called Theia collided with the young Earth. How the collision unfolded and what exactly h… [+5614 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Our solar system is moving faster than scientists can explain - Earth.com", "description": "A large radio galaxy study finds our solar system moves faster than theory predicts, raising new questions about how matter spreads.", "url": "https://www.earth.com/news/our-solar-system-is-moving-faster-than-scientists-can-explain/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/20111407/Solar-system-motion2.jpg", "publishedAt": "2025-11-20T18:23:32Z", "content": "Our solar system appears to be moving through the universe far faster than standard cosmology says it should. \r\nA new study of radio galaxies by a team in Germany suggests the solar systems motion le… [+5941 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "AI helps build the most detailed Milky Way simulation ever, mapping 100 billion stars - Space", "description": "Simulating a billion years using previous best-resolution simulations would take almost 36 years of real computing time.", "url": "https://www.space.com/astronomy/ai-helps-build-the-most-detailed-milky-way-simulation-ever-mapping-100-billion-stars", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rRNCZvvQWAiUQtF4sKyAFg-1920-80.jpg", "publishedAt": "2025-11-20T18:00:00Z", "content": "The most detailed supercomputer simulation ever of our Milky Way galaxy has been created by combining machine learning with numerical models. By running 100 times faster than the next most detailed m… [+3879 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Overturn 20 Years of Textbook Biology With Stunning Discovery About Cell Division - SciTechDaily", "description": "Scientists have uncovered an unexpected function for a crucial protein involved in cell division. Reported in two consecutive publications, the finding challenges long-accepted models and standard descriptions found in biology textbooks. Researchers at the Ru…", "url": "https://scitechdaily.com/?p=501312", "urlToImage": "https://scitechdaily.com/images/A-Metaphase-Spindle-in-a-Human-Ovarian-Cancer-Cell.jpg", "publishedAt": "2025-11-20T17:36:47Z", "content": "The image shows a metaphase spindle in a human ovarian cancer cell, surrounded by interphase cells. Microtubules are color-coded according to imaging depth, and chromosomes are shown in gray. Most ch… [+8715 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Mason Wakley", "title": "Scientists put moss on the outside of the International Space Station for 9 months — then kept it growing back on Earth - Live Science", "description": "A species of moss survived for 9 months on the outside of the International Space Station, new research reveals — and 80% of the samples kept reproducing when returned to Earth.", "url": "https://www.livescience.com/space/scientists-put-moss-on-the-outside-of-the-international-space-station-for-9-months-then-kept-it-growing-back-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GHmVxrPP5tUMUwyj4y43LC-1920-80.jpg", "publishedAt": "2025-11-20T17:13:02Z", "content": "Moss spores have survived a prolonged trip to space, scientists reveal. The spores spent nine months on the outside of the International Space Station (ISS) before returning to our planet, and over 8… [+3402 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "\"Very Old, Undisturbed Structure\" May Have Been Discovered Beyond Neptune, Over 6 Billion Kilometers From The Sun - IFLScience", "description": "If confirmed, the structure may be primordial.", "url": "https://www.iflscience.com/a-very-old-undisturbed-structure-may-have-been-discovered-beyond-the-orbit-of-neptune-43-au-from-the-sun-81625", "urlToImage": "https://assets.iflscience.com/assets/articleNo/81625/aImg/87637/kuiper-belt-structure-meta.png", "publishedAt": "2025-11-20T16:41:55Z", "content": "A team looking at the dynamics of objects in the Kuiper belt, the ring-shaped region of icy bodies well beyond the orbit of Neptune, believe they have found evidence for a \"very old, undisturbed stru… [+5250 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "Spot Uranus shining at its brightest this year — here's what to expect on Nov. 21 - Space", "description": "Uranus will appear opposite the sun in Earth's sky on Nov. 21.", "url": "https://www.space.com/stargazing/spot-uranus-shining-at-its-brightest-this-year-what-to-expect-nov-21-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ijT4bogSmQ4eF7DekK7KyD-1920-80.jpg", "publishedAt": "2025-11-20T16:00:00Z", "content": "November is the best month of 2025 to catch a glimpse of the distant ice giant Uranus as it shines at opposition, though you'll still need a telescope if you hope to spot the elusive planet hiding am… [+2779 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Michael J. I. Brown, The Conversation", "title": "Could We Actually Launch a Supervillain Into the Sun? - Gizmodo", "description": "Tossing a bad guy into the Sun sounds simple enough, but orbital mechanics make it a far trickier task than you'd expect.", "url": "https://gizmodo.com/could-we-actually-launch-a-supervillain-into-the-sun-2000688930", "urlToImage": "https://gizmodo.com/app/uploads/2025/11/SpaceX-Starship-Launch-1200x675.jpg", "publishedAt": "2025-11-20T15:20:29Z", "content": "Editors note: This article is a lighthearted and educational exploration of orbital mechanics; no one is seriously proposing that we launch criminalsor anyoneinto the Sun. Well, not that we’re aware … [+4763 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Light has been hiding a magnetic secret for nearly 200 years - ScienceDaily", "description": "New research shows that light’s magnetic field is far more influential than scientists once believed. The team found that this magnetic component significantly affects how light rotates as it passes through certain materials. Their work challenges a 180-year-…", "url": "https://www.sciencedaily.com/releases/2025/11/251120091945.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/faraday-effect-magnetic-component.webp", "publishedAt": "2025-11-20T15:02:14Z", "content": "Researchers at the Hebrew University of Jerusalem have found that the magnetic component of light plays a direct part in the Faraday Effect, overturning a 180-year belief that only light's electric f… [+2909 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Discovery in the deep ocean defies current human knowledge - Earth.com", "description": "In a patch of the Pacific’s abyssal plain, scientists a surprising phenomenon called “dark oxygen production.”", "url": "https://www.earth.com/news/discovery-in-the-deep-ocean-dark-oxygen-defies-current-human-knowledge/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/20074217/dark-oxygen_ocean-floor-discovery_1.jpg", "publishedAt": "2025-11-20T14:59:03Z", "content": "Far below the waves, between about 1.2 and 3.1 miles (two to five kilometers) down, sunlight never reaches and the water sits just above freezing. \r\nIn that darkness, animals and microbes should prim… [+6412 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Mihai Andrei", "title": "This \"CRISPR Fungi\" Is Sustainable, Packed with Protein and Could Become the Ultimate Superfood - ZME Science", "description": "CRISPR-edited fungus is cheaper, greener, and more nutritious than chicken.", "url": "https://www.zmescience.com/science/agriculture-science/crispr-fungus-protein-alternative/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/11/Low-Res_Picture1-1.jpg", "publishedAt": "2025-11-20T14:17:06Z", "content": "Myco-protein is already used in various commercial products. This new breakthrough could supercharge them. Image via Wiki Commons.\r\nWe have a meat problem. We love eating it, but our planet hates pro… [+5164 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Watch SpaceX launch more than 100 satellites to orbit today on Transporter 15 rideshare mission - Space", "description": "These spacecraft come in all shapes and sizes, from all over the world.", "url": "https://www.space.com/space-exploration/launches-spacecraft/watch-spacex-launch-more-than-100-satellites-to-orbit-today-on-transporter-15-rideshare-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8vQv33w4FeCSDt7gwwWkCi-1779-80.jpg", "publishedAt": "2025-11-20T14:00:00Z", "content": "SpaceX's Transporter-15 mission is poised to deliver more than 100 spacecraft to Earth orbit.\r\nA Falcon 9 rocket will launch Transporter-15 today (Nov. 20) from Vandenberg Space Force Base in Califor… [+5007 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Rubin Observatory peers into the 'hidden universe' and discovers stream of stars longer than our entire Milky Way - Space", "description": "\"The discovery of this stream highlights how much is still unknown about the life histories of galaxies, how the hidden universe shapes the realms that we can see.\"", "url": "https://www.space.com/astronomy/rubin-observatory-peers-into-the-hidden-universe-and-discovers-stream-of-stars-longer-than-our-entire-milky-way", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xmz4QmZDXbu37AFS99Q5AW-1600-80.png", "publishedAt": "2025-11-20T14:00:00Z", "content": "Despite still not being fully operational, the Vera C. Rubin Observatory is already making waves. The observatory, which features the world's biggest and most sensitive digital camera, the 3.2-gigapi… [+3502 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "It's Official: The Atlantic's Giant Seaweed Belt Is Now an Unstoppable Ocean Phenomenon, Spanning Continents and Shattering Records - indiandefencereview.com", "description": "A colossal seaweed belt stretching across the Atlantic is exploding in size—and scientists have just uncovered a startling new piece of the puzzle. Fueled by unexpected forces, this massive bloom is wreaking havoc on coastlines, ecosystems, and economies.", "url": "https://indiandefencereview.com/its-official-atlantic-giant-seaweed-belt-is-unstoppable-phenomenon-spanning-continents/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/11/giant-seaweed-belt.jpg", "publishedAt": "2025-11-20T13:30:00Z", "content": "A vast, floating carpet of seaweedso large it can be tracked from spacenow stretches thousands of miles across the Atlantic Ocean, reaching from the Gulf of Mexico to the coast of West Africa. In May… [+4543 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sophie Berdugo", "title": "'A forest with bonobos has never been so quiet': Most extreme case of violence in 'hippie' species recorded, with females ganging up on male in unprecedented attack - Live Science", "description": "Female bonobos routinely form coalitions to stamp out threats from males, but the level of violence in this attack was unprecedented.", "url": "https://www.livescience.com/animals/land-mammals/a-forest-with-bonobos-has-never-been-so-quiet-most-extreme-case-of-violence-in-hippie-species-recorded-with-females-ganging-up-on-male-in-unprecedented-attack", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FM6VbDb7fCwjtrecvoA9gP-1920-80.jpg", "publishedAt": "2025-11-20T11:03:51Z", "content": "Five wild female bonobos in the Democratic Republic of the Congo brutally attacked one of their male group mates, disfiguring his face almost beyond recognition, ripping off one of his ears, and biti… [+4932 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "James Webb Space Telescope captures 'one-of-a-kind' triple star system that looks like a cosmic embryo (image) - Space", "description": "\"This is a one-of-a-kind system with an incredibly rare orbital period.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-captures-one-of-a-kind-triple-star-system-that-looks-like-a-cosmic-embryo-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NGvjRSwZWbsGdNZ4cKtKgd-1920-80.jpg", "publishedAt": "2025-11-20T11:00:00Z", "content": "A nested series of dusty spirals is captured swirling around a mighty triple star system containing two of the rarest stars in the galaxy in a new image from NASA's James Webb Space Telescope (JWST).… [+4327 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Microwave Technique Could Turn CO2 Into Fuel Far More Efficiently - SciTechDaily", "description": "A new method uses microwaves to lower the energy required for certain industrial processes. Some industrial chemical production processes depend on heat, but traditional heating methods are often wasteful because they warm large areas that do not actually nee…", "url": "https://scitechdaily.com/?p=501157", "urlToImage": "https://scitechdaily.com/images/Chemistry-Catalyst-Concept.jpg", "publishedAt": "2025-11-20T05:00:55Z", "content": "A new microwave-focused heating method selectively energizes individual atomic sites, making tough chemical reactions far more efficient and opening possibilities for greener fuels and CO₂ reuse. Cre… [+6425 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Chu | MIT News", "title": "Scientists get a first look at the innermost region of a white dwarf system - MIT News", "description": "MIT astronomers used the Imaging X-ray Polarimetry Explorer to identify key features in the innermost region of a white dwarf system called an intermediate polar. This extremely energetic environment has been inaccessible to most telescopes until now.", "url": "https://news.mit.edu/2025/first-look-innermost-region-white-dwarf-system-1120", "urlToImage": "https://news.mit.edu/sites/default/files/images/202511/MIT-polarized-dwarf-01-press.jpg", "publishedAt": "2025-11-20T05:00:00Z", "content": "Some 200 light years from Earth, the core of a dead star is circling a larger star in a macabre cosmic dance. The dead star is a type of white dwarf that exerts a powerful magnetic field as it pulls … [+7279 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Greg Wehner", "title": "Perseverance rover spots mysterious 'visitor from outer space' rock on Mars surface after 4 years - Yahoo", "description": "NASA's Perseverance rover discovers shiny metallic rock on Mars that could be a meteorite from an ancient asteroid, containing high levels of iron and nickel...", "url": "https://www.foxnews.com/tech/perseverance-rover-spots-mysterious-visitor-from-outer-space-rock-mars-surface-after-four-years", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/7iCfItEFbXfUukJiVzlWaw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/fox_news_text_979/e505d9afd50d5231305863de206328f3", "publishedAt": "2025-11-20T02:57:00Z", "content": "NASAs Perseverance rover may have stumbled on a visitor from outer space a strange, shiny rock on Mars that scientists think could be a meteorite forged in the heart of an ancient asteroid.\r\nAccordin… [+4185 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "Neanderthals And Our Ape Ancestors Probably Kissed, Study Reveals - ScienceAlert", "description": "Scientists have found evidence suggesting that kissing dates back up to 21 million years and that our ape ancestors and Neanderthals likely locked lips, research published Wednesday said.", "url": "https://www.sciencealert.com/neanderthals-and-our-ape-ancestors-probably-kissed-study-reveals", "urlToImage": "https://www.sciencealert.com/images/2025/11/Chimps-kissing.jpg", "publishedAt": "2025-11-20T01:39:10Z", "content": "Scientists have found evidence suggesting that kissing dates back up to 21 million years and that our ape ancestors and Neanderthals likely locked lips, research published Wednesday said.\r\nKissing ha… [+2027 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Institute of Science and Technology Austria", "title": "Scientist captures tiny particles for clues on what sparks lightning - Phys.org", "description": "Using lasers as tweezers to understand cloud electrification might sound like science fiction, but at the Institute of Science and Technology Austria (ISTA) it is a reality. By trapping and charging micron-sized particles with lasers, researchers can now obse…", "url": "https://phys.org/news/2025-11-scientist-captures-tiny-particles-clues.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/trapping-particles-to.jpg", "publishedAt": "2025-11-19T23:45:03Z", "content": "Using lasers as tweezers to understand cloud electrification might sound like science fiction, but at the Institute of Science and Technology Austria (ISTA) it is a reality. By trapping and charging … [+6625 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Sharon Adarlo", "title": "Amazing Telescope Photo Shows Comet Breaking Apart Into Huge Chunks - Futurism", "description": "Astronomers have captured spectacular images of a comet, C/2025 K1 (ATLAS), breaking apart in three large pieces during its journey.", "url": "http://futurism.com/space/comet-broken-solar-system", "urlToImage": "https://futurism.com/wp-content/uploads/2025/11/comet-broken-solar-system.jpg?w=1200", "publishedAt": "2025-11-19T22:49:08Z", "content": "A comet, dubbed C/2025 K1 (ATLAS), spectacularly broke apart into three huge chunks and anybody with an eight-inch telescope or bigger can catch the resulting fireworks show for the next several week… [+2682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National Research Council of Science and Technology", "title": "A new space radiation shield: Flexible boron nitride nanotube film shows promise - Phys.org", "description": "High-energy cosmic radiation damages cells and DNA, causing cancer, and secondary neutrons—generated especially from the planetary surfaces—can be up to 20 times more harmful than other radiations. Aluminum, the most widely used shielding material, has the dr…", "url": "https://phys.org/news/2025-11-space-shield-flexible-boron-nitride.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/blocking-space-radiati-1.jpg", "publishedAt": "2025-11-19T22:40:04Z", "content": "High-energy cosmic radiation damages cells and DNA, causing cancer, and secondary neutronsgenerated especially from the planetary surfacescan be up to 20 times more harmful than other radiations. Alu… [+4539 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Jennifer Michalowski | McGovern Institute for Brain Research", "title": "The cost of thinking - MIT News", "description": "MIT McGovern Institute researchers find a surprising parallel in the ways humans and new AI models solve complex problems.", "url": "https://news.mit.edu/2025/cost-of-thinking-1119", "urlToImage": "https://news.mit.edu/sites/default/files/images/202511/mit-mcgovern-costofthinking.jpg", "publishedAt": "2025-11-19T21:45:00Z", "content": "Large language models (LLMs) like ChatGPT can write an essay or plan a menu almost instantly. But until recently, it was also easy to stump them. The models, which rely on language patterns to respon… [+6475 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Shared and language-specific phonological processing in the human temporal lobe - Nature", "description": "The human&nbsp;superior temporal gyrus processes acoustic–phonetic properties of speech regardless of whether the language is familiar to the listener, but only encodes word boundaries and language-specific sound sequences&nbsp;if the language is known.", "url": "https://www.nature.com/articles/s41586-025-09748-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09748-8/MediaObjects/41586_2025_9748_Fig1_HTML.png", "publishedAt": "2025-11-19T21:22:30Z", "content": "<li>Evans, N. &amp; Levinson, S. C. The myth of language universals: language diversity and its importance for cognitive science. Behav. Brain Sci.32, 429448 (2009).\r\nArticle \r\n PubMed \r\nGoogle Schol… [+22136 chars]"}, {"source": {"id": null, "name": "Gear Patrol"}, "author": "gvandyke", "title": "Forget Off-Road Porsche 911s, This Rowdy Classic Mustang Is as Cool as Safari Builds Come - Gear Patrol", "description": "Running 31-inch Mickey Thompson tires and equipped with lights and a rack, this classic pony car makes for one wild ride.", "url": "https://www.gearpatrol.com/cars/1973-mustang-sportsroof-safari/", "urlToImage": "https://www.gearpatrol.com/wp-content/uploads/sites/2/2025/11/1973-Ford-Mustang-Rally-4.webp", "publishedAt": "2025-11-19T20:24:19Z", "content": "For one, the pony car now rides considerably higher. While it wears some period-correct 15-inch Magnum 500-style wheels, its been equipped for off-road duty by way of some raised suspension and 31-in… [+1019 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "The moon is farther from Earth tonight than it will be until 2043 - Space", "description": "The most distant moon since March 2020 takes to the sky today, but you won't be able to see it.", "url": "https://www.space.com/stargazing/the-moon-is-farther-from-earth-tonight-than-it-will-be-until-2043", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8HK5L479cVvBhTb5sfK4B9-1894-80.jpg", "publishedAt": "2025-11-19T18:53:35Z", "content": "The sun's gravity will pull the moon farther away from Earth than it's been in over five years on Nov. 19, though it'll be impossible for you to witness the lunar milestone for yourself with the nake… [+2564 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Autonomous University of Barcelona", "title": "Physicists demonstrate the constancy of the speed of light with unprecedented accuracy - Phys.org", "description": "In 1887, one of the most important experiments in the history of physics took place. American scientists Michelson and Morley failed to measure the speed of Earth by comparing the speed of light in the direction of Earth's motion with that perpendicular to it…", "url": "https://phys.org/news/2025-11-physicists-constancy-unprecedented-accuracy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/quantum.jpg", "publishedAt": "2025-11-19T17:50:01Z", "content": "In 1887, one of the most important experiments in the history of physics took place. American scientists Michelson and Morley failed to measure the speed of Earth by comparing the speed of light in t… [+4330 chars]"}, {"source": {"id": null, "name": "Minneapolis Star Tribune"}, "author": "Kyeland Jackson, Kyeland Jackson", "title": "How can Minnesotans watch the Leonids meteor shower? - Star Tribune", "description": "The annual meteor shower will send streaks through the sky at 44 miles per second.", "url": "https://www.startribune.com/leonids-meteor-shower-how-to-watch-minnesota-sunday-monday-peak-midnight/601526278", "urlToImage": "https://arc.stimg.co/startribunemedia/YKWAMKOVXFAANFWPNZZMEX6BSA.JPG?&w=1200&ar=1.91:1&fit=crop", "publishedAt": "2025-11-19T17:46:16Z", "content": "Stargazers are in for a treat this week as an annual meteor shower streaks across Minnesota skies.\r\nThe Leonids meteor shower is active until Dec. 2.\r\nThe display comes after ribbons of green, pink, … [+835 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Structural basis of regulated N-glycosylation at the secretory translocon - Nature", "description": "The structural mechanism of a natively isolated GRP94 folding intermediate tethered to a CCDC134-bound translocon is described, revealing how the nascent chain remodels the translocon to control N-glycosylation by OST.", "url": "https://www.nature.com/articles/s41586-025-09756-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09756-8/MediaObjects/41586_2025_9756_Fig1_HTML.png", "publishedAt": "2025-11-19T17:12:47Z", "content": "Antibodies\r\nThe following primary antibodies were used: mouse anti-CCDC134 (Santa Cruz Biotechnology, #sc-393390, RRID: AB_3662100, 1:500); mouse anti-GRP94 (R&amp;D Systems, #MAB7606, RRID: AB_36441… [+25721 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How do genetic association studies rank genes? - Nature", "description": "Genome-wide association studies and rare-variant burden tests reveal complementary aspects of trait biology.", "url": "https://www.nature.com/articles/d41586-025-03651-y", "urlToImage": "https://media.nature.com/lw1200/magazine-assets/d41586-025-03651-y/d41586-025-03651-y_51719038.png", "publishedAt": "2025-11-19T17:12:45Z", "content": "This is a summary of: Spence, J. P. et al. Specificity, length and luck drive gene rankings in association studies. Nature https://doi.org/10.1038/s41586-025-09703-7 (2025).\r\nThe question\r\nTo underst… [+7417 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Rare microbial relict sheds light on an ancient eukaryotic supergroup - Nature", "description": "The discovery of an unusual protist named Solarion arienae, which has a mitochondrial genome with some intriguing features, provides insight into the early radiation of eukaryotic groups.", "url": "https://www.nature.com/articles/s41586-025-09750-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09750-0/MediaObjects/41586_2025_9750_Fig1_HTML.png", "publishedAt": "2025-11-19T17:12:05Z", "content": "<li>Lax, G. et al. Hemimastigophora is a novel supra-kingdom-level lineage of eukaryotes. Nature564, 410414 (2018).\r\nArticle \r\n CAS \r\n PubMed \r\n ADS \r\nGoogle Scholar \r\n</li><li>Brown, M. W. et al. Ph… [+26199 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Safety Net Is Snapping: Satellites Reveal Accelerating Decay of “Doomsday Glacier” - SciTechDaily", "description": "A new study led by scientists at the University of Manitoba’s Centre for Earth Observation Science offers the most comprehensive account to date of how the Thwaites Eastern Ice Shelf in West Antarctica has steadily broken apart over the last twenty years. Thw…", "url": "https://scitechdaily.com/the-safety-net-is-snapping-satellites-reveal-accelerating-decay-of-doomsday-glacier/", "urlToImage": "https://scitechdaily.com/images/Giant-Glacier-Towers-in-Antarctica.jpg", "publishedAt": "2025-11-19T17:09:05Z", "content": "Researchers have traced a two-decade pattern of fracturing and acceleration within the Thwaites Eastern Ice Shelf, showing how it slipped away from a key stabilizing feature. Credit: Shutterstock\r\nA … [+4345 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "We Regret To Inform You If You Look Through An Owl's Ears You Can See Its Eyes - IFLScience", "description": "There's video, but you might not want to look at it.", "url": "https://www.iflscience.com/we-regret-to-inform-you-if-you-look-through-an-owls-ears-you-can-see-its-eyes-81618", "urlToImage": "https://assets.iflscience.com/assets/articleNo/81618/aImg/87612/owl-meta.png", "publishedAt": "2025-11-19T16:46:09Z", "content": "Owls, God bless them, are pretty weird and wonderful creatures, with some strange and impressive adaptations to their environments. Though it's a fact you know well, it's still astonishing that they … [+3132 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA Cassini Study Finds Organics ‘Fresh’ From Ocean of Enceladus - NASA (.gov)", "description": "Researchers dove deep into information gathered from the ice grains that were collected during a close and super-fast flyby through a plume of Saturn’s icy", "url": "https://www.nasa.gov/missions/cassini/nasa-cassini-study-finds-organics-fresh-from-ocean-of-enceladus/", "urlToImage": "https://images-assets.nasa.gov/image/PIA11688/PIA11688~orig.jpg", "publishedAt": "2025-11-19T16:29:19Z", "content": "Researchers dove deep into information gathered from the ice grains that were collected during a close and super-fast flyby through a plume of Saturns icy moon.\r\nA new analysis of data from NASAs Cas… [+4247 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Triplets electrically turn on insulating lanthanide-doped nanoparticles - Nature", "description": "To turn on and obtain emission from lanthanide-doped insulating nanoparticles, an electrical excitation pathway coupling them to organic optical molecules to form nanohybrids is described, enabling tunable electroluminescence properties of LEDs fabricated fro…", "url": "https://www.nature.com/articles/s41586-025-09601-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09601-y/MediaObjects/41586_2025_9601_Fig1_HTML.png", "publishedAt": "2025-11-19T16:07:30Z", "content": "LnNPs consist of an inorganic insulating host, typically fluorides or oxides such as NaGd/Y/LuF4 with a large energy gap of approximately 8eV (ref.6), with lanthanide ions embedded in the host lattic… [+22356 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Topological nodal i-wave superconductivity in PtBi2 - Nature", "description": "Angle-resolved photoemission spectroscopy shows that Weyl semimetal PtBi2 harbours nodes in its superconducting gap, implying unconventional i-wave pairing symmetry.", "url": "https://www.nature.com/articles/s41586-025-09712-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-09712-6/MediaObjects/41586_2025_9712_Fig1_HTML.png", "publishedAt": "2025-11-19T16:05:28Z", "content": "DFT calculations and BdG model\r\nWe performed DFT calculations using the full-potential local orbital code FPLO38 within the generalized gradient approximation39, using the tetrahedron method with 123… [+16161 chars]"}, {"source": {"id": null, "name": "Popular Mechanics"}, "author": "Elizabeth Rayne", "title": "Scientists Thought This Creature Had No Brain. Turns Out It’s All Brain. - AOL.com", "description": "The entire body of a sea urchin is what researchers are now calling an “all-body brain,” with neurons that function as a brain throughout its anatomy.", "url": "https://www.popularmechanics.com/science/animals/a69443677/all-brain-creature/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/s3Zgvze0LRMWJGJnmdgO_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_popular_mechanics_812/15a1d5512f48f1273c15ce441fd6da76", "publishedAt": "2025-11-19T15:48:04Z", "content": "Heres what youll learn when you read this story:\r\n<ul><li>It used to be thought that sea urchins only had a primitive nervous system, but new research has found that they are far more complex than th… [+4523 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Cosmic Paradox Reveals the Awful Consequence of an Observer-Free Universe - Quanta Magazine", "description": "Encouraged by successes in understanding black holes, theoretical physicists are applying what they’ve learned to whole universes. What they’re finding has them questioning fundamental assumptions about how physics ought to be done.", "url": "https://www.quantamagazine.org/cosmic-paradox-reveals-the-awful-consequence-of-an-observer-free-universe-20251119/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/11/OneStateUniverse-crKristinaArmitage-Social.jpg", "publishedAt": "2025-11-19T15:39:08Z", "content": "A simple system, like a computer bit that can be either zero or one, might have two dimensions.\r\nMost quantum systems are much more complex. Take a single hydrogen atom. Its electron can reach higher… [+2365 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Scientists Extract the Oldest RNA Ever Found From a 39,000-Year-Old Frozen Woolly Mammoth - Indian Defence Review", "description": "A research team has retrieved the oldest known RNA from a 39,000-year-old woolly mammoth carcass preserved in Siberian permafrost.", "url": "https://indiandefencereview.com/scientists-extract-oldest-rna-ever-found-frozen-woolly-mammoth/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/11/scientists-examine-the-mummified-remains-of-a-39000-year-old-mammoth.jpg", "publishedAt": "2025-11-19T15:30:00Z", "content": "Unlike DNA, which offers genetic potential, RNA captures a snapshot of gene activity in real time. This new approach offers scientists an unexpectedly intimate look at the final biological moments of… [+3828 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "These beautiful flowers have become very destructive ecological invaders - Earth.com", "description": "Invasive ice plants are shifting their flowering schedules, helping them outcompete native species and reshape fragile coastal ecosystems.", "url": "https://www.earth.com/news/these-beautiful-ice-plants-flowers-have-become-the-ecological-invaders-in-the-world/", "urlToImage": "https://cff2.earth.com/uploads/2025/11/19074409/ice-plants_invasive-species_destructive_1m.jpg", "publishedAt": "2025-11-19T14:55:54Z", "content": "Ice plants are famous for painting coastlines in bright pink and yellow, but a new study shows those vibrant blooms are hiding a quiet ecological takeover.\r\nBy analyzing more than 1,700 public, geota… [+5087 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sandee Oster", "title": "Decapitated fossil fish with guts still intact reveal ancient predatory habits - Phys.org", "description": "In a study appearing in Fossil Record, researchers Martin Ebert and Martina Kölbl-Ebert analyzed the remains of a unique fossil type: the decapitated head of Aspidorhynchus, with its gastrointestinal tract (guts) still attached. These extraordinary fossils ar…", "url": "https://phys.org/news/2025-11-decapitated-fossil-fish-guts-intact.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/new-study-examines-iso.jpg", "publishedAt": "2025-11-19T12:30:01Z", "content": "In a study appearing in Fossil Record, researchers Martin Ebert and Martina Kölbl-Ebert analyzed the remains of a unique fossil type: the decapitated head of Aspidorhynchus, with its gastrointestinal… [+5674 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Andrey Feldman", "title": "'Impossible' black hole collision pushed relativity to its breaking point — and scientists finally understand how - Live Science", "description": "In 2023, scientists detected the gravitational waves from a black hole collision that seemed impossible. New research finally explains how this \"forbidden\" black hole came to be, and what it can teach us about these extreme objects.", "url": "https://www.livescience.com/space/black-holes/impossible-black-hole-collision-pushed-relativity-to-its-breaking-point-and-scientists-finally-understand-how", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YvpARud8MenapMaZu8teqE-1920-80.jpg", "publishedAt": "2025-11-19T10:00:00Z", "content": "Scientists have traced the origins of the most massive black hole\r\n merger ever observed, revealing how two \"impossible\" giants may have formed despite long-standing assumptions that such objects sho… [+6410 chars]"}, {"source": {"id": null, "name": "Alwayspets.com"}, "author": "Angeline Smith", "title": "Scientists Finally Figured Out Why Birds Yell at Each Other Every Morning - AOL.com", "description": "If you’ve ever been jolted awake by a noisy flock of birds at dawn, you’re not alone in wondering what all the fuss is about. Every morning, before the sun i...", "url": "https://alwayspets.com/s/scientists-finally-figured-out-why-birds-yell-at-each-other-every-morning/", "urlToImage": "https://media.zenfs.com/en/aol_always_pets_275/637f91f3be93bdd1895a903995b1369d", "publishedAt": "2025-11-13T04:38:51Z", "content": "If youve ever been jolted awake by a noisy flock of birds at dawn, youre not alone in wondering what all the fuss is about. Every morning, before the sun is fully up and long before most people are r… [+3077 chars]"}]}