{"status": "ok", "totalResults": 45, "articles": [{"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Arezki Amiri", "title": "He Disappeared Into a Cave for 63 Days Then Returned with a Scientific Breakthrough Still Changing Biology 60 Years Later - Indian Defence Review", "description": "He vanished into total darkness for over two months, with no clock, no sunlight, and no sense of time.", "url": "https://indiandefencereview.com/63-days-in-cave-sparked-breakthrough-in-circadian-biology/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/he-spent-63-days-in-a-dark-cave-and-came-back-with-a-discovery-scaled.jpg", "publishedAt": "2026-02-08T11:30:00Z", "content": "In July 1962, a young scientist entered a deep cave in the French Alps and disconnected entirely from clocks, sunlight, and human contact. He remained underground for 63 days. The effects on his body… [+5395 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Anita Chandran", "title": "Astronomers detected a strong signal from space lasting seven hours. Now they may have worked out what it was - BBC Sky at Night Magazine", "description": "In 2025, astronomers detected a blast from space lasting seven hours. Now they’re uncovering the processes behind the exceptional outburst.", "url": "https://www.skyatnightmagazine.com/news/grb-250702b-study-interview", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2020/08/heic1921a-5de8e43.jpg?w=1200", "publishedAt": "2026-02-08T03:24:23Z", "content": "Gamma-ray bursts (GRBs) are intense sources of high-energy radiation that scientists detect on Earth in the form of gamma rays.\r\nThey were first detected in the 1960s by US military satellites lookin… [+3876 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Runaway Black Holes Are Real After All. Here's What We Know. - ScienceAlert", "description": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond.", "url": "https://www.sciencealert.com/runaway-black-holes-are-real-after-all-heres-what-we-know", "urlToImage": "https://www.sciencealert.com/images/2026/02/black_hole_in_the_sky_header.jpg", "publishedAt": "2026-02-08T01:01:27Z", "content": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond. It was moving at around 68 kilometres per second, just over double Earth's spe… [+5740 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "When Does NASA Think We'll Go To Mars? It's Sooner Than You Think - bgr.com", "description": "NASA has plans to send astronauts to Mars surprisingly soon, but their exact timeline is still rather vague for a number of different reasons.", "url": "https://www.bgr.com/2093938/nasa-humans-to-mars-timeline/", "urlToImage": "https://www.bgr.com/img/gallery/when-does-nasa-think-well-go-to-mars-its-sooner-than-you-think/l-intro-1770284635.jpg", "publishedAt": "2026-02-08T00:47:00Z", "content": "The short answer is nobody knows for certain. The long answer is when the agency can prove that getting humans there is not only possible, but realistically safe for the astronauts involved. The basi… [+1351 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "ByOlivia Dimmer", "title": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org", "description": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…", "url": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/cells-systems-cooperat.jpg", "publishedAt": "2026-02-07T21:00:04Z", "content": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The… [+3730 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "When Termites Became Monogamous, A Surprising Thing Happened to Their Sperm - ScienceAlert", "description": "Termites reveal a startling consequence of long-term monogamy – the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.", "url": "https://www.sciencealert.com/when-termites-became-monogamous-a-surprising-thing-happened-to-their-sperm", "urlToImage": "https://www.sciencealert.com/images/2026/02/TermiteSoldierCloseUp.jpg", "publishedAt": "2026-02-07T20:15:15Z", "content": "Termites reveal a startling consequence of long-term monogamy the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.\r\nThis involved l… [+2869 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ryan Weber", "title": "Starbase’s launch site lays groundwork to double in size - NASASpaceFlight.com -", "description": "While pushing for Flight 12, SpaceX has received approval to nearly double the launch site’s…", "url": "https://www.nasaspaceflight.com/2026/02/starbases-launch-site-double-size/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2026/02/Starbase-Launch-Site-with-Expansion-Outlined-622x350.jpg", "publishedAt": "2026-02-07T19:57:50Z", "content": "1While pushing for Flight 12, SpaceX has received approval to nearly double the launch sites size at Starbase. With this approval, SpaceX will be able to complete the redesign of Pad 1 and add additi… [+4844 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Emily Carter", "title": "Scientists Stumble Upon Mysterious Ancient ‘Wrinkle Structures’ in Morocco That Defy Explanation - Indian Defence Review", "description": "A team of scientists has uncovered ancient fossils in Morocco that challenge conventional theories about the origins of life on Earth.", "url": "https://indiandefencereview.com/wrinkle-structure-morocco-defy-explanation/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-stumble-on-ancient-wrinkle-structures-in-morocco-that-defy-explanation-scaled.png", "publishedAt": "2026-02-07T19:35:00Z", "content": "Hidden in the rugged landscapes of Moroccos Central High Atlas Mountains lies a discovery that could change everything we know about the origins of life on Earth. While exploring the region’s ancient… [+3488 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Keiichi Ohnaka, Jacco van Loon", "title": "A giant star is changing before our eyes and astronomers are watching in real time - Phys.org", "description": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more than 1,500 times larger than the sun and emitting over 100,000…", "url": "https://phys.org/news/2026-02-giant-star-eyes-astronomers-real.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-giant-star-is-changi.jpg", "publishedAt": "2026-02-07T19:10:01Z", "content": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more th… [+6328 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "JooHyeon Heo", "title": "Encapsulated PbS quantum dots boost solar water splitting without sacrificial agents - Phys.org", "description": "A research team affiliated with UNIST has developed stable and efficient chalcogenide-based photoelectrodes, addressing a longstanding challenge of corrosion. This advancement paves the way for the commercial viability of solar-driven water splitting technolo…", "url": "https://phys.org/news/2026-02-encapsulated-pbs-quantum-dots-boost.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/highly-durable-corrosi-1.jpg", "publishedAt": "2026-02-07T19:00:04Z", "content": "A research team affiliated with UNIST has developed stable and efficient chalcogenide-based photoelectrodes, addressing a longstanding challenge of corrosion. This advancement paves the way for the c… [+3560 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "NASA Telescope Discovers Nearby Planet With Deep Similarities to Earth - Futurism", "description": "A new candidate exoplanet appears to almost uncanny similarities to Earth — but may differ in at least one major way.", "url": "http://futurism.com/space/far-away-planet-earth-chilling", "urlToImage": "https://futurism.com/wp-content/uploads/2026/02/far-away-planet-earth-chilling.jpg?quality=85&w=1200", "publishedAt": "2026-02-07T18:30:00Z", "content": "Astronomers have discovered what appears to be an exoplanet that could be a distant Earthly paradise. Or it could be a frigid realm even chillier than Mars, incapable of supporting life.\r\nThe margins… [+3015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Webb unveils nature of distant ultraviolet-luminous galaxy CEERS2-588 - Phys.org", "description": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of the observational campaign, published January 29 on the arXiv …", "url": "https://phys.org/news/2026-02-webb-unveils-nature-distant-ultraviolet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/observations-unveil-th.jpg", "publishedAt": "2026-02-07T16:50:01Z", "content": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of th… [+3755 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Stuart Blackman", "title": "\"22% of US men believe they could beat a chimpanzee in a fight\" – Here’s how humans actually stack up against the world’s 10 strongest primates - BBC Wildlife Magazine", "description": "Discover the strongest primates on the planet…", "url": "https://www.discoverwildlife.com/animal-facts/mammals/worlds-strongest-primates", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/02/strongest-primates.jpg?w=1200", "publishedAt": "2026-02-07T16:45:00Z", "content": "From nut-cracking monkeys to tree-bending apes, primates come in an astonishing range of shapes, sizes and strength styles. Some rely on brute mass, others on explosive power, iron grips or slow, rel… [+7439 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Something supercharged Uranus when Voyager 2 flew past - ScienceDaily", "description": "Voyager 2’s flyby of Uranus in 1986 recorded radiation levels so extreme they baffled scientists for nearly 40 years. New research suggests the spacecraft caught Uranus during a rare solar wind event that flooded the planet’s radiation belts with extra energy…", "url": "https://www.sciencedaily.com/releases/2026/02/260206012217.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/uranus-planet-moon-orbits.webp", "publishedAt": "2026-02-07T16:43:26Z", "content": "Scientists at Southwest Research Institute (SwRI) say they may have found an answer to a puzzle that has lingered for nearly four decades involving the radiation belts surrounding Uranus.When NASA's … [+2647 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sam Jarman", "title": "Pulsar timing hints at a nearby dark matter 'sub-halo' - Phys.org", "description": "A group of US astronomers may have uncovered the first evidence for a dark matter sub-halo lurking just beyond our stellar neighborhood. Reporting their findings in Physical Review Letters, a team led by Sukanya Chakrabarti at the University of Alabama in Hun…", "url": "https://phys.org/news/2026-02-pulsar-hints-nearby-dark-halo.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/pulsar-timing-hints-at.jpg", "publishedAt": "2026-02-07T16:00:01Z", "content": "A group of US astronomers may have uncovered the first evidence for a dark matter sub-halo lurking just beyond our stellar neighborhood. Reporting their findings in Physical Review Letters, a team le… [+4443 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Astronomers Stunned by Black Hole Jet Now 50 Times Brighter Than Ever, It’s Beyond Anything We’ve Ever Seen! - The Daily Galaxy", "description": "Scientists discover unbelievable power in black hole jet, could it destroy entire solar systems?", "url": "https://dailygalaxy.com/2026/02/astronomers-stunned-by-black-hole-jet-now-50-times-brighter-than-ever-its-beyond-anything-weve-ever-seen/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Astronomers-Stunned-by-Black-Hole-Jet-Now-50-Times-Brighter-Than-Ever-Its-Beyond-Anything-Weve-Ever-Seen-scaled.jpg", "publishedAt": "2026-02-07T15:45:00Z", "content": "Astronomers are astounded as a supermassive black hole has unleashed an extraordinarily powerful jet, one so intense that it could potentially destroy planets located within a few light-years. This u… [+3444 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "James Webb Telescope Uncovers Key Ingredients for Life in Galaxy Over 10 Billion Light Years Away - The Daily Galaxy", "description": "The James Webb Space Telescope has uncovered organic molecules in a distant galaxy, opening new possibilities for understanding the origins of life across the universe.", "url": "https://dailygalaxy.com/2026/02/webb-uncovers-key-ingredients-life-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/James-Webb-Telescope-Uncovers-Key-Ingredients-for-Life-in-Galaxy-Over-10-Billion-Light-Years-Away-scaled.png", "publishedAt": "2026-02-07T15:15:00Z", "content": "In a groundbreaking study published in the journal Nature, astronomers using the James Webb Space Telescope (JWST) have uncovered a surprising array of organic molecules in a distant galaxy, IRAS 072… [+4327 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Ben Mather, Adriana Dutkiewicz, Dietmar Müller, Sabin Zahirovic", "title": "The way Earth's surface moves has a bigger impact on shifting the climate than we knew - Space", "description": "New research reveals the source of this carbon – and the driving forces behind it – are far more complex than previously thought.", "url": "https://www.space.com/astronomy/earth/the-way-earths-surface-moves-has-a-bigger-impact-on-shifting-the-climate-than-we-knew", "urlToImage": "https://cdn.mos.cms.futurecdn.net/n587iTqPMX6heN544QvWHQ-1920-80.jpg", "publishedAt": "2026-02-07T15:00:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "What Scientists Discovered in This Remote Cave Was Buried for 3,700 Years, and It’s Finally Been Revealed - The Daily Galaxy", "description": "A quiet cave seemed like any other archaeological site, until one genetic pattern turned routine research into something far more gripping.", "url": "https://dailygalaxy.com/2026/02/remote-cave-discovery-buried-3700-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/What-Scientists-Discovered-in-This-Remote-Cave-Was-Buried-for-3700-Years-and-Its-Finally-Been-Revealed-scaled.jpg", "publishedAt": "2026-02-07T14:45:00Z", "content": "In a cave nestled high in the Calabrian mountains, ancient bones have revealed a shocking genetic discovery: a child born from a father-daughter union over 3,700 years ago. The rare finding, backed b… [+2886 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Andromeda Is Heading Straight for the Milky Way, and Scientists Finally Know Why - The Daily Galaxy", "description": "A new study uncovers the reason why Andromeda is speeding toward the Milky Way, revealing the powerful influence of dark matter on galactic movement.", "url": "https://dailygalaxy.com/2026/02/andromeda-heading-for-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Andromeda-Is-Heading-Straight-for-the-Milky-Way-and-Scientists-Finally-Know-Why-scaled.png", "publishedAt": "2026-02-07T13:45:00Z", "content": "For years, astronomers have observed the strange motion of Andromeda, the Milky Way’s closest large galactic neighbor. While most galaxies in the universe are receding due to the expansion of space, … [+4264 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "‘Impossible’ material: Researchers create glass-plastic hybrid that defies physics theory - Interesting Engineering", "description": "Scientists have finally combined the best of both worlds into a new, impact-resistant material called a compleximer.", "url": "https://interestingengineering.com/science/impossible-material-glass-plastic-hybrid", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2026/02/Plastic.jpg", "publishedAt": "2026-02-07T12:13:00Z", "content": "Researchers at Wageningen University &amp; Research (WUR) have defied long-standing material theories by developing a brand-new class of material known as a “compleximer.” \r\nThis amber-colored substa… [+3195 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Northern Lights Alert: 10 States May See Aurora Saturday Night - Forbes", "description": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth", "url": "https://www.forbes.com/sites/jamiecartereurope/2026/02/07/northern-lights-alert-10-states-may-see-aurora-saturday-night/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5f719b705d322bfa863f2fdc/0x0.jpg?format=jpg&crop=3398,1910,x1694,y1170,safe&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-07T11:30:51Z", "content": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth. (Photo by Alex Kormann/Star Tr… [+3438 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "Submarine Disappears Beneath Antarctic Ice After Spotting Bizarre Structures No Scientist Has Seen Before - Indian Defence Review", "description": "A groundbreaking Antarctic mission ended in mystery after a high-tech sub vanished beneath the ice, just moments after uncovering bizarre structures hidden below a melting glacier.", "url": "https://indiandefencereview.com/submarine-lost-under-antarctic-ice-after-discovering-glacier-secrets/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/this-under-ice-sub-saw-something-scientists-cant-explain-scaled.jpg", "publishedAt": "2026-02-07T11:30:00Z", "content": "A robotic submersible operating beneath one of Antarcticas most closely monitored ice shelves vanished in January 2024 during a scheduled mission. The vehicle, part of a long-running international ef… [+5699 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kimberley Lane", "title": "My thoughts on the Peak Design 7L sling bag - Space", "description": "This is the ideal bag for astrophotographers looking to declutter and take out only essential gear.", "url": "https://www.space.com/stargazing/skywatching-kit/peak-design-7l-sling-bag-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jp9u5ciJNLoXnRSo4WTeEj-2133-80.jpg", "publishedAt": "2026-02-07T10:00:00Z", "content": "External dimensions: 13.78 x 8.66 x 4.33-inches (35 x 22 x 11 cm)\r\nInternal dimensions: 13.58 x 8.46 x 4.13-inches (34.5 x 21.5 x 10.5 cm)\r\nCapacity: 7.5 L\r\nPhone pocket capacity: Fits up to iPhone 1… [+6181 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Scientists Are Rethinking 60 Years of Arctic Snow Data - SciTechDaily", "description": "Decades of advances in satellite observation made it seem as though Arctic snow cover was growing, when in reality satellites were simply becoming better at detecting smaller and shrinking amounts of snow.", "url": "https://scitechdaily.com/why-scientists-are-rethinking-60-years-of-arctic-snow-data/", "urlToImage": "https://scitechdaily.com/images/Abandoned-Fishing-Boat-Heavy-Storm-Arctic.jpg", "publishedAt": "2026-02-07T05:30:27Z", "content": "New research suggests that long-standing satellite records may have been quietly misleading scientists about Arctic snow cover. What once appeared to be a surprising increase turns out to be an illus… [+5126 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "New species discovered in the Arctic could be the great-grandmother of all jawed animals - Earth.com", "description": "A 400-million-year-old jawed fish fossil found in the Arctic, Romundina gagnieri, could be a key link in the evolution of vertebrate teeth.", "url": "https://www.earth.com/news/jawed-fish-species-romundina-gagnieri-discovered-in-the-arctic-rewrites-tooth-evolution-timeline/", "urlToImage": "https://cff2.earth.com/uploads/2026/02/04121842/arctic-fossil-fish-ancestor-jawed-animals.jpg", "publishedAt": "2026-02-07T04:56:46Z", "content": "A newly described fossil fish species, Romundina gagnieri, has revealed teeth growing on bony plates that line the roof of its mouth. This extends the acquisition of teeth in jawed fishes to a far ea… [+5243 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Rewrites the Life History of the World’s Most Famous Dinosaur - SciTechDaily", "description": "The largest study ever conducted on the growth of Tyrannosaurus rex reveals that the dinosaur took a far longer and slower route to adulthood than scientists had previously believed.", "url": "https://scitechdaily.com/new-research-rewrites-the-life-history-of-the-worlds-most-famous-dinosaur/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-rex-Skeleton-Museum.jpg", "publishedAt": "2026-02-07T04:20:10Z", "content": "A new analysis of fossil bone growth suggests Tyrannosaurus rex grew far more slowly than scientists once thought, taking nearly 40 years to reach full size. Using advanced statistical methods and ne… [+5555 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX's next astronaut launch for NASA is officially on for Feb. 11 as FAA clears Falcon 9 rocket to fly again - Space", "description": "\"The FAA oversaw and accepted the findings of the SpaceX-led investigation.\"", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacexs-next-astronaut-launch-for-nasa-is-officially-on-for-feb-11-as-faa-clears-falcon-9-rocket-to-fly-again", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eqepdosgSdhu7yhzmKZyZd-1920-80.jpg", "publishedAt": "2026-02-06T23:40:05Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "The dirty afterlife of a dead satellite - Phys.org", "description": "Sometimes we humans get ahead of ourselves. We embark on grand engineering experiments without really understanding what the long-term implications of such projects are. Climate change itself is a perfect example of that—no one in the early industrial revolut…", "url": "https://phys.org/news/2026-02-dirty-afterlife-dead-satellite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-dirty-afterlife-of.jpg", "publishedAt": "2026-02-06T22:31:01Z", "content": "Sometimes we humans get ahead of ourselves. We embark on grand engineering experiments without really understanding what the long-term implications of such projects are. Climate change itself is a pe… [+5277 chars]"}, {"source": {"id": null, "name": "Thedodo.com"}, "author": "Sarah Ashley", "title": "Shivering Dog Locked Out Of House Sits On Her Babies To Keep Them Warm - The Dodo", "description": "On a frigid day in Kansas City, Kansas, a mama dog resorted to sitting on her babies to keep them warm. The dogs were locked outside. Rescuers arrived just in time to save the entire family.", "url": "https://www.thedodo.com/daily-dodo/shivering-dog-locked-out-of-house-sits-on-her-babies-to-keep-them-warm", "urlToImage": "https://assets3.thrillist.com/v1/image/3203851/1200x600/crop;;webp=auto;jpeg_quality=85.jpg", "publishedAt": "2026-02-06T22:22:39Z", "content": "In mid-January, temperatures in Kansas City, Kansas, dropped to 15 degrees Fahrenheit. Spending time outdoors, even in the bright sunshine, was dangerous without proper clothing.\r\nSo when a neighbor … [+2387 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images - Live Science", "description": "A team of researchers using the James Webb Space Telescope has produced the most detailed map of dark matter to date.", "url": "https://www.livescience.com/physics-mathematics/dark-matter/invisible-scaffolding-of-the-universe-revealed-in-ambitious-new-james-webb-telescope-images", "urlToImage": "https://cdn.mos.cms.futurecdn.net/teESBNqZ6Q4EGydNMYhAqe-2560-80.jpg", "publishedAt": "2026-02-06T22:04:42Z", "content": null}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Can apes play pretend? Scientists use an imaginary tea party to find out - PBS", "description": "For the first time, an experiment hints that an ape in captivity can have an imagination.", "url": "https://www.pbs.org/newshour/science/can-apes-play-pretend-scientists-use-an-imaginary-tea-party-to-find-out", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2026/02/AP26036547415356-1024x768.jpg", "publishedAt": "2026-02-06T21:09:35Z", "content": "NEW YORK (AP) By age 2, most kids know how to play pretend. They turn their bedrooms into faraway castles and hold make-believe tea parties.\r\nThe ability to make something out of nothing may seem uni… [+2843 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jacek Krywko", "title": "COVID-19 cleared the skies but also supercharged methane emissions - Ars Technica", "description": "Less pollution meant lower amounts of a methane-destroying chemical.", "url": "https://arstechnica.com/science/2026/02/covid-19-cleared-the-skies-but-also-supercharged-methane-emissions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg", "publishedAt": "2026-02-06T21:05:45Z", "content": null}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kate Morgan", "title": "The case for keeping your garden dark at night - The Washington Post", "description": "Outdoor lighting is having an outsize impact on the flora and fauna that share our habitats.", "url": "https://www.washingtonpost.com/home/2026/02/06/outdoor-lighting-garden-biodiversity/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NHEJBT6RO5C3NAALUDXAXMBSJA.jpg&w=1440", "publishedAt": "2026-02-06T21:00:00Z", "content": "When you picture nighttime in a perfectly landscaped garden, chances are good that you imagine it lit. According to National Association of Homebuyers survey data, close to 90 percent of people find … [+374 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Maine", "title": "New study uses Neanderthals to demonstrate gap between generative AI and scholarly knowledge - Phys.org", "description": "Technological advances over the past four decades have turned mobile devices and computers into the world's largest library, where information is just a tap away. Phones, laptops, tablets, smartwatches—they're a part of everyday life, simplifying access to en…", "url": "https://phys.org/news/2026-02-neanderthals-gap-generative-ai-scholarly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/new-study-uses-neander.jpg", "publishedAt": "2026-02-06T20:40:01Z", "content": "Technological advances over the past four decades have turned mobile devices and computers into the world's largest library, where information is just a tap away. Phones, laptops, tablets, smartwatch… [+5542 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Shibaura Institute of Technology", "title": "Researchers demonstrate organic crystal emitting red light from UV and green from near-infrared - Phys.org", "description": "Invisible light beyond the range of human vision plays a vital role in communication technologies, medical diagnostics, and optical sensing. Ultraviolet and near-infrared wavelengths are routinely used in these fields, yet detecting them directly often requir…", "url": "https://phys.org/news/2026-02-crystal-emitting-red-uv-green.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/seeing-the-unseen-scie-2.jpg", "publishedAt": "2026-02-06T20:00:07Z", "content": "Invisible light beyond the range of human vision plays a vital role in communication technologies, medical diagnostics, and optical sensing. Ultraviolet and near-infrared wavelengths are routinely us… [+5323 chars]"}, {"source": {"id": null, "name": "HPCwire"}, "author": null, "title": "Brookhaven Lab’s RHIC Concludes 25-Year Run with Final Collisions - HPCwire", "description": "Milestone caps a quarter century of groundbreaking discoveries — with more to come from final run’s largest-ever dataset — plus technological advances in accelerators, detectors, and computing UPTON, N.Y., Feb. 6, 2026 — Just after 9 a.m. on Friday, Feb. 6, 2…", "url": "https://www.hpcwire.com/off-the-wire/brookhaven-labs-rhic-concludes-25-year-run-with-final-collisions/", "urlToImage": "https://www.hpcwire.com/wp-content/uploads/2026/02/20260206_1-1024x677.png", "publishedAt": "2026-02-06T19:56:40Z", "content": "Milestone caps a quarter century of groundbreaking discoveries — with more to come from final run’s largest-ever dataset — plus technological advances in accelerators, detectors, and computing\r\nUPTON… [+14244 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "NASA space telescope sees interstellar visitor comet 3I/ATLAS flare up while exiting the solar system - Space", "description": "The infrared space telescope also detected water vapor, carbon dioxide and organic compounds streaming from the departing comet two months after it made its closest approach to the sun.", "url": "https://www.space.com/astronomy/comets/nasa-space-telescope-sees-comet-3i-atlas-dramatically-flare-as-interstellar-visitor-exits-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PcdqhxzofdWSqZV3wb9id7-1566-80.jpg", "publishedAt": "2026-02-06T19:52:08Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Augustin Baudier", "title": "A dinosaur with spikes exhibiting unprecedented properties discovered in China - Phys.org", "description": "Documented for 200 years, the Iguanodontia group is expanding with the discovery of a brand-new species, the first known to bear spikes with properties never before observed in dinosaurs. Scientists from the CNRS1 and their internationalpartners have uncovere…", "url": "https://phys.org/news/2026-02-dinosaur-spikes-unprecedented-properties-china.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-dinosaur-with-spikes.jpg", "publishedAt": "2026-02-06T19:30:01Z", "content": "Documented for 200 years, the Iguanodontia group is expanding with the discovery of a brand-new species, the first known to bear spikes with properties never before observed in dinosaurs. Scientists … [+1867 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Sarah Talbi", "title": "They Drilled Deeper Into Earth’s Crust Than Anyone Before… Then Hit Something Unexpected - Indian Defence Review", "description": "In a stunning geological feat, scientists drilled over 1,200 meters into Earth’s crust, coming closer than ever to the mantle before time ran out.", "url": "https://indiandefencereview.com/drilled-deeper-earths-crust-hit-something-unexpected/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/drilling-machine-scaled.jpg", "publishedAt": "2026-02-06T19:30:00Z", "content": "In May 2023, a team of researchers aboard the JOIDES Resolution drilled 1,268 meters into the Earth’s crust, reaching mantle-altered rock closer than ever before. Working just south of the Lost City … [+3811 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Avi Loeb", "title": "The Amazingly Fast Meteor Over New Zealand on January 30, 2026 is Not Interstellar in Origin - Avi Loeb – Medium", "description": "On January 30, 2026 at 10:25:37 UTC, a bright green fireball from a meteor was spotted over Wellington Harbour, New Zealand (as reported…", "url": "https://avi-loeb.medium.com/the-amazingly-fast-meteor-over-new-zealand-on-january-30-2026-is-not-interstellar-in-origin-8e64912a7dcd", "urlToImage": "https://miro.medium.com/v2/resize:fit:1050/1*-5KzLjpiYybO7SYLbS3Vvw.jpeg", "publishedAt": "2026-02-06T18:49:09Z", "content": "A camera image of the bright meteor over Wellington, New Zealand at 23:25:37 local time on January 30, 2026. (Image credit: RNZ)\r\nOn January 30, 2026 at 10:25:37 UTC, a bright green fireball from a m… [+6329 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ryan Schoensee", "title": "Compound in 500-million-year-old fossils sheds new light on Earth's carbon cycle - Phys.org", "description": "A UT San Antonio-led international research team has identified chitin, the primary organic component of modern crab shells and insect exoskeletons, in trilobite fossils more than 500 million years old, marking the first confirmed detection of the molecule in…", "url": "https://phys.org/news/2026-02-compound-million-year-fossils-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/trilobite.jpg", "publishedAt": "2026-02-06T18:35:20Z", "content": "A UT San Antonio-led international research team has identified chitin, the primary organic component of modern crab shells and insect exoskeletons, in trilobite fossils more than 500 million years o… [+3699 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jenny Green", "title": "The surprising power of a tiny, disordered protein in a mitochondrial supercomplex - Phys.org", "description": "For decades, scientists assumed that order drives efficiency. Yet in the bustling machinery of mitochondria—the organelles that crank out adenosine triphosphate (ATP), the universal \"energy currency\" of cells—one of the most enigmatic components is a protein …", "url": "https://phys.org/news/2026-02-power-tiny-disordered-protein-mitochondrial.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/the-surprising-power-o.jpg", "publishedAt": "2026-02-06T18:29:24Z", "content": "For decades, scientists assumed that order drives efficiency. Yet in the bustling machinery of mitochondriathe organelles that crank out adenosine triphosphate (ATP), the universal \"energy currency\" … [+9092 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "We May Have Seen a Special Kind of Black Hole Explode, Study Claims - ScienceAlert", "description": "Humanity has worked itself into a position where we can detect a single high-energy particle from space and wonder where in nature it came from.", "url": "https://www.sciencealert.com/we-may-have-seen-a-special-kind-of-black-hole-explode-study-claims", "urlToImage": "https://www.sciencealert.com/images/2026/02/purple_black_hole_header.jpg", "publishedAt": "2026-02-06T18:02:02Z", "content": "Humanity has worked itself into a position where we can detect a single high-energy particle from space and wonder where in nature it came from.\r\nBillions of people likely don't care at all about suc… [+5701 chars]"}]}