{"status": "ok", "totalResults": 41, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Sam Jarman", "title": "Topological antenna could pave the way for 6G networks - Phys.org", "description": "Using ideas borrowed from topological photonics, researchers in Singapore, France and the US have designed a compact antenna capable of handling information-rich terahertz (THz) signals. Reporting their results in Nature Photonics, the team, led by Ranjan Sin…", "url": "https://phys.org/news/2026-02-topological-antenna-pave-6g-networks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/topological-antenna-co.jpg", "publishedAt": "2026-02-08T18:40:01Z", "content": "Using ideas borrowed from topological photonics, researchers in Singapore, France and the US have designed a compact antenna capable of handling information-rich terahertz (THz) signals. Reporting th… [+4462 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "Scientists Fired Lasers at Charles Darwin's Priceless Specimens. Here's Why. - ScienceAlert", "description": "Rows of preserved specimen jars from Charles Darwin's iconic Galapagos voyage have sat, unopened, in the archives of London's Natural History Museum (NHM) for 200 years.", "url": "https://www.sciencealert.com/scientists-fired-lasers-at-charles-darwins-priceless-specimens-heres-why", "urlToImage": "https://www.sciencealert.com/images/2026/01/darwin-jars.jpg", "publishedAt": "2026-02-08T18:01:31Z", "content": "Rows of preserved specimen jars from Charles Darwin's iconic Galapagos voyage have sat, unopened, in the archives of London's Natural History Museum (NHM) for 200 years. Now, lasers have given us an … [+4389 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matthew Williams", "title": "The 'Little red dots' observed by Webb were direct-collapse black holes - Phys.org", "description": "The James Webb Space Telescope (JWST) was designed to look back in time and study galaxies that existed shortly after the Big Bang. In so doing, scientists hoped to gain a better understanding of how the universe has evolved from the earliest cosmological epo…", "url": "https://phys.org/news/2026-02-red-dots-webb-collapse-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/the-little-red-dots-ob.jpg", "publishedAt": "2026-02-08T18:00:01Z", "content": "The James Webb Space Telescope (JWST) was designed to look back in time and study galaxies that existed shortly after the Big Bang. In so doing, scientists hoped to gain a better understanding of how… [+7119 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Say Heck, Just Nuke a Killer Asteroid Heading for Earth - Futurism", "description": "In a new paper, an international team of researchers revisited the idea of blowing up an incoming asteroid with a nuclear warhead.", "url": "http://futurism.com/space/just-nuke-asteroid-heading-earth", "urlToImage": "https://futurism.com/wp-content/uploads/2026/02/just-nuke-asteroid-heading-earth.jpg?quality=85&w=1200", "publishedAt": "2026-02-08T17:00:00Z", "content": "Plenty of asteroids can survive their fiery plunge through the Earth’s atmosphere. If they’re big enough, they can prove incredibly destructive, like the 60-foot Chelyabinsk meteor that exploded over… [+3622 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "An Underwater Robot Just Found Something Unbelievable on the Seabed That Was Lost for Decades! - The Daily Galaxy", "description": "A mission off Malta’s coast took an unexpected turn when an underwater robot stumbled upon a long-forgotten wreck.", "url": "https://dailygalaxy.com/2026/02/underwater-robot-found-something-seabed/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/An-Underwater-Robot-Just-Found-Something-Unbelievable-on-the-Seabed-That-Was-Lost-for-Decades-scaled.jpg", "publishedAt": "2026-02-08T15:45:00Z", "content": "An underwater robot has uncovered a long-lost wreckage of a Second World War bomber on the seabed near Malta. The remains, identified as a Fairey Swordfish, were found during an autonomous exploratio… [+2338 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Sarah Talbi", "title": "Scientists Find Strange Circles in Scottish Waters, But They Might Not Last Long - Indian Defence Review", "description": "Mysterious “fairy circles” recently spotted in the waters off Scotland’s Outer Hebrides have left locals and experts alike scratching their heads.", "url": "https://indiandefencereview.com/scientists-find-strange-circles-scottish-waters-might-not-last-long/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/a-naturescot-monitoring-team-has-dubbed-the-formations-seagrass-doughnuts-scaled.jpg", "publishedAt": "2026-02-08T15:30:00Z", "content": "For the first time, aerial footage has captured these strange circular formations, believed to be made of seagrass, though no one fully understands how they form. The phenomenon occurs against the ba… [+3367 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "Scientists Just Found a Fossil at the Bottom of the Ocean. Here’s What It Reveals About Our Ancestors! - The Daily Galaxy", "description": "A fossil from a long-lost human species has surfaced from the depths of the ocean, but this discovery isn’t what we expected. What does this jawbone tell us about how Denisovans lived and thrived in surprising places?", "url": "https://dailygalaxy.com/2026/02/scientists-found-fossil-at-bottom-of-ocean/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Scientists-Just-Found-a-Fossil-at-the-Bottom-of-the-Ocean.-Heres-What-It-Reveals-About-Our-Ancestors-scaled.jpg", "publishedAt": "2026-02-08T15:15:00Z", "content": "A jawbone retrieved from the bottom of the Taiwan Strait has been confirmed as belonging to a Denisovan, one of humanitys most mysterious relatives. The fossil, discovered at depths of 60 to 120 mete… [+4019 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of the Basque Country", "title": "Water molecules actively reshape chiral catalyst structure, research shows - Phys.org", "description": "Researchers have analyzed the stepwise hydration of prolinol, a molecule widely used as a catalyst and as a building block in chemical synthesis. The study shows that just a few water molecules can completely change the preferred structure of prolinol. The re…", "url": "https://phys.org/news/2026-02-molecules-reshape-chiral-catalyst.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/the-spanish-biophysica.jpg", "publishedAt": "2026-02-08T12:40:02Z", "content": "Researchers have analyzed the stepwise hydration of prolinol, a molecule widely used as a catalyst and as a building block in chemical synthesis. The study shows that just a few water molecules can c… [+4194 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Damien Pine", "title": "Physicists push quantum boundaries by turning a superfluid into a supersolid — and back — for the first time - Live Science", "description": "Physicists saw excitons, a type of quasiparticle, undergo a reversible phase transition from superfluid to supersolid for the first time, opening new doors for studying extreme states of matter.", "url": "https://www.livescience.com/physics-mathematics/quantum-physics/physicists-push-quantum-boundaries-by-turning-a-superfluid-into-a-supersolid-and-back-for-the-first-time", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Wz6isXbmhL6kDMmLDLrwBg-688-80.jpg", "publishedAt": "2026-02-08T12:00:00Z", "content": null}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Arezki Amiri", "title": "He Disappeared Into a Cave for 63 Days Then Returned with a Scientific Breakthrough Still Changing Biology 60 Years Later - Indian Defence Review", "description": "He vanished into total darkness for over two months, with no clock, no sunlight, and no sense of time.", "url": "https://indiandefencereview.com/63-days-in-cave-sparked-breakthrough-in-circadian-biology/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/he-spent-63-days-in-a-dark-cave-and-came-back-with-a-discovery-scaled.jpg", "publishedAt": "2026-02-08T11:30:00Z", "content": "In July 1962, a young scientist entered a deep cave in the French Alps and disconnected entirely from clocks, sunlight, and human contact. He remained underground for 63 days. The effects on his body… [+5395 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Scientists Intrigued by Possible Hollow Structures Under Surface of Venus - Futurism", "description": "The case that Venus is harboring enormous lava tubes continues to build. A recent paper suggests they could measure up to 0.62 miles across.", "url": "http://futurism.com/space/huge-hollow-structures-venus", "urlToImage": "https://futurism.com/wp-content/uploads/2026/02/huge-hollow-structures-venus.jpg?quality=85&w=1200", "publishedAt": "2026-02-08T11:00:00Z", "content": "Venus has long been known as Earth’s evil twin. While they both are roughly the same size and formed in the same inner region of the solar system, Venus is far less hospitable to life as we know it. … [+3417 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Karen G. Lloyd", "title": "'Maybe they're waiting for something that only happens thousands of years later': The hidden life 'sleeping' deep beneath Earth for millions of years - Live Science", "description": "Deep inside Earth lies a hidden world of \"intraterrestrials\" that have been dormant for hundreds of thousands of years — what are they waiting to \"wake up\" for?", "url": "https://www.livescience.com/planet-earth/evolution/maybe-theyre-waiting-for-something-that-only-happens-thousands-of-years-later-the-hidden-life-sleeping-deep-beneath-earth-for-millions-of-years", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bceaEpv7QwEmpf2NgE5baP-1600-80.png", "publishedAt": "2026-02-08T09:00:00Z", "content": null}, {"source": {"id": null, "name": "Mexico News Daily"}, "author": "Bob Pateman", "title": "The day the world nearly ended and nobody — except one Mexican scientist — noticed - Mexico News Daily", "description": "In 1883, a comet capable of ending life on Earth narrowly missed impact. Only one man on the planet noticed, a Mexican scientist.", "url": "https://mexiconewsdaily.com/culture/the-day-the-world-nearly-ended-and-nobody-except-one-mexican-scientist-noticed/", "urlToImage": "https://mexiconewsdaily.com/wp-content/uploads/2026/01/Great_Comet_of_1882-1.jpg", "publishedAt": "2026-02-08T06:35:08Z", "content": "The internet is alive with UFO reports at the moment, the excitement sparked by a comet identified as 3I/ATLAS. Comets are not uncommon visitors to our solar system, but this is a rare type. Its spee… [+11181 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Anita Chandran", "title": "Astronomers detected a strong signal from space lasting seven hours. Now they may have worked out what it was - BBC Sky at Night Magazine", "description": "In 2025, astronomers detected a blast from space lasting seven hours. Now they’re uncovering the processes behind the exceptional outburst.", "url": "https://www.skyatnightmagazine.com/news/grb-250702b-study-interview", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2020/08/heic1921a-5de8e43.jpg?w=1200", "publishedAt": "2026-02-08T03:24:23Z", "content": "Gamma-ray bursts (GRBs) are intense sources of high-energy radiation that scientists detect on Earth in the form of gamma rays.\r\nThey were first detected in the 1960s by US military satellites lookin… [+3876 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "SpaceX resumes Falcon 9 flights with Starlink satellite launch from California - Space", "description": "The brief stand down was due to an upper stage anomaly.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-internet-satellite-launch-group-17-33-b1088-vsfb-ocisly", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hj2QbfGsDBupAE8nTFqecd-1920-80.jpg", "publishedAt": "2026-02-08T02:59:36Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Runaway Black Holes Are Real After All. Here's What We Know. - ScienceAlert", "description": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond.", "url": "https://www.sciencealert.com/runaway-black-holes-are-real-after-all-heres-what-we-know", "urlToImage": "https://www.sciencealert.com/images/2026/02/black_hole_in_the_sky_header.jpg", "publishedAt": "2026-02-08T01:01:27Z", "content": "Last year, astronomers were fascinated by a runaway asteroid passing through our Solar System from somewhere far beyond. It was moving at around 68 kilometres per second, just over double Earth's spe… [+5740 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins", "title": "When Does NASA Think We'll Go To Mars? It's Sooner Than You Think - bgr.com", "description": "NASA has plans to send astronauts to Mars surprisingly soon, but their exact timeline is still rather vague for a number of different reasons.", "url": "https://www.bgr.com/2093938/nasa-humans-to-mars-timeline/", "urlToImage": "https://www.bgr.com/img/gallery/when-does-nasa-think-well-go-to-mars-its-sooner-than-you-think/l-intro-1770284635.jpg", "publishedAt": "2026-02-08T00:47:00Z", "content": "The short answer is nobody knows for certain. The long answer is when the agency can prove that getting humans there is not only possible, but realistically safe for the astronauts involved. The basi… [+1351 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "ByOlivia Dimmer", "title": "How eggs get built: Cells use actin and microtubules as a coordinated scaffold - Phys.org", "description": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The research, published in the Journal of Cell Biology, details…", "url": "https://phys.org/news/2026-02-eggs-built-cells-actin-microtubules.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/cells-systems-cooperat.jpg", "publishedAt": "2026-02-07T21:00:04Z", "content": "A Northwestern Medicine study has shed light on one of the most intricate construction projects in biology: how cells build and coordinate the internal scaffolding needed to create a healthy egg. The… [+3730 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "When Termites Became Monogamous, A Surprising Thing Happened to Their Sperm - ScienceAlert", "description": "Termites reveal a startling consequence of long-term monogamy – the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.", "url": "https://www.sciencealert.com/when-termites-became-monogamous-a-surprising-thing-happened-to-their-sperm", "urlToImage": "https://www.sciencealert.com/images/2026/02/TermiteSoldierCloseUp.jpg", "publishedAt": "2026-02-07T20:15:15Z", "content": "Termites reveal a startling consequence of long-term monogamy the resulting lack of competition between the reproductive sperm of rival males led to the loss of tails in their sperm.\r\nThis involved l… [+2869 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Ryan Weber", "title": "Starbase’s launch site lays groundwork to double in size - NASASpaceFlight.com -", "description": "While pushing for Flight 12, SpaceX has received approval to nearly double the launch site’s…", "url": "https://www.nasaspaceflight.com/2026/02/starbases-launch-site-double-size/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2026/02/Starbase-Launch-Site-with-Expansion-Outlined-622x350.jpg", "publishedAt": "2026-02-07T19:57:50Z", "content": "1While pushing for Flight 12, SpaceX has received approval to nearly double the launch sites size at Starbase. With this approval, SpaceX will be able to complete the redesign of Pad 1 and add additi… [+4844 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Emily Carter", "title": "Scientists Stumble Upon Mysterious Ancient ‘Wrinkle Structures’ in Morocco That Defy Explanation - Indian Defence Review", "description": "A team of scientists has uncovered ancient fossils in Morocco that challenge conventional theories about the origins of life on Earth.", "url": "https://indiandefencereview.com/wrinkle-structure-morocco-defy-explanation/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/scientists-stumble-on-ancient-wrinkle-structures-in-morocco-that-defy-explanation-scaled.png", "publishedAt": "2026-02-07T19:35:00Z", "content": "Hidden in the rugged landscapes of Moroccos Central High Atlas Mountains lies a discovery that could change everything we know about the origins of life on Earth. While exploring the region’s ancient… [+3488 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Common Nutrient Could Be the Key to Faster Wound Healing - SciTechDaily", "description": "When nutrients run low, hair follicle stem cells can stop making hair and help repair the skin instead. A drop in the amino acid serine triggers this switch, accelerating wound healing.", "url": "https://scitechdaily.com/?p=509375", "urlToImage": "https://scitechdaily.com/images/Gold-Bubble-Serum-on-Skin-Layer.jpg", "publishedAt": "2026-02-07T19:22:14Z", "content": "When the body is under stress, hair stem cells sacrifice growth to help the skin heal faster. Credit: Shutterstock\r\nWhen nutrients run low, hair follicle stem cells can stop making hair and help repa… [+6977 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Keiichi Ohnaka, Jacco van Loon", "title": "A giant star is changing before our eyes and astronomers are watching in real time - Phys.org", "description": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more than 1,500 times larger than the sun and emitting over 100,000…", "url": "https://phys.org/news/2026-02-giant-star-eyes-astronomers-real.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/a-giant-star-is-changi.jpg", "publishedAt": "2026-02-07T19:10:01Z", "content": "For decades, astronomers have been watching WOH G64, an enormous heavyweight star in the Large Magellanic Cloud, a galaxy visible with the naked eye from the Southern Hemisphere. This star is more th… [+6328 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "JooHyeon Heo", "title": "Encapsulated PbS quantum dots boost solar water splitting without sacrificial agents - Phys.org", "description": "A research team affiliated with UNIST has developed stable and efficient chalcogenide-based photoelectrodes, addressing a longstanding challenge of corrosion. This advancement paves the way for the commercial viability of solar-driven water splitting technolo…", "url": "https://phys.org/news/2026-02-encapsulated-pbs-quantum-dots-boost.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/highly-durable-corrosi-1.jpg", "publishedAt": "2026-02-07T19:00:04Z", "content": "A research team affiliated with UNIST has developed stable and efficient chalcogenide-based photoelectrodes, addressing a longstanding challenge of corrosion. This advancement paves the way for the c… [+3560 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "NASA Telescope Discovers Nearby Planet With Deep Similarities to Earth - Futurism", "description": "A new candidate exoplanet appears to almost uncanny similarities to Earth — but may differ in at least one major way.", "url": "http://futurism.com/space/far-away-planet-earth-chilling", "urlToImage": "https://futurism.com/wp-content/uploads/2026/02/far-away-planet-earth-chilling.jpg?quality=85&w=1200", "publishedAt": "2026-02-07T18:30:00Z", "content": "Astronomers have discovered what appears to be an exoplanet that could be a distant Earthly paradise. Or it could be a frigid realm even chillier than Mars, incapable of supporting life.\r\nThe margins… [+3015 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Webb unveils nature of distant ultraviolet-luminous galaxy CEERS2-588 - Phys.org", "description": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of the observational campaign, published January 29 on the arXiv …", "url": "https://phys.org/news/2026-02-webb-unveils-nature-distant-ultraviolet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/observations-unveil-th.jpg", "publishedAt": "2026-02-07T16:50:01Z", "content": "Astronomers from the University of Tokyo in Japan and elsewhere have employed the James Webb Space Telescope (JWST) to observe a distant ultraviolet-luminous galaxy known as CEERS2-588. Results of th… [+3755 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Stuart Blackman", "title": "\"22% of US men believe they could beat a chimpanzee in a fight\" – Here’s how humans actually stack up against the world’s 10 strongest primates - BBC Wildlife Magazine", "description": "Discover the strongest primates on the planet…", "url": "https://www.discoverwildlife.com/animal-facts/mammals/worlds-strongest-primates", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/02/strongest-primates.jpg?w=1200", "publishedAt": "2026-02-07T16:45:00Z", "content": "From nut-cracking monkeys to tree-bending apes, primates come in an astonishing range of shapes, sizes and strength styles. Some rely on brute mass, others on explosive power, iron grips or slow, rel… [+7439 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Something supercharged Uranus when Voyager 2 flew past - ScienceDaily", "description": "Voyager 2’s flyby of Uranus in 1986 recorded radiation levels so extreme they baffled scientists for nearly 40 years. New research suggests the spacecraft caught Uranus during a rare solar wind event that flooded the planet’s radiation belts with extra energy…", "url": "https://www.sciencedaily.com/releases/2026/02/260206012217.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/uranus-planet-moon-orbits.webp", "publishedAt": "2026-02-07T16:43:26Z", "content": "Scientists at Southwest Research Institute (SwRI) say they may have found an answer to a puzzle that has lingered for nearly four decades involving the radiation belts surrounding Uranus.When NASA's … [+2647 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sam Jarman", "title": "Pulsar timing hints at a nearby dark matter 'sub-halo' - Phys.org", "description": "A group of US astronomers may have uncovered the first evidence for a dark matter sub-halo lurking just beyond our stellar neighborhood. Reporting their findings in Physical Review Letters, a team led by Sukanya Chakrabarti at the University of Alabama in Hun…", "url": "https://phys.org/news/2026-02-pulsar-hints-nearby-dark-halo.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/pulsar-timing-hints-at.jpg", "publishedAt": "2026-02-07T16:00:01Z", "content": "A group of US astronomers may have uncovered the first evidence for a dark matter sub-halo lurking just beyond our stellar neighborhood. Reporting their findings in Physical Review Letters, a team le… [+4443 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Ben Mather, Adriana Dutkiewicz, Dietmar Müller, Sabin Zahirovic", "title": "The way Earth's surface moves has a bigger impact on shifting the climate than we knew - Space", "description": "New research reveals the source of this carbon – and the driving forces behind it – are far more complex than previously thought.", "url": "https://www.space.com/astronomy/earth/the-way-earths-surface-moves-has-a-bigger-impact-on-shifting-the-climate-than-we-knew", "urlToImage": "https://cdn.mos.cms.futurecdn.net/n587iTqPMX6heN544QvWHQ-1920-80.jpg", "publishedAt": "2026-02-07T15:00:00Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Melissa Ait Lounis", "title": "What Scientists Discovered in This Remote Cave Was Buried for 3,700 Years, and It’s Finally Been Revealed - The Daily Galaxy", "description": "A quiet cave seemed like any other archaeological site, until one genetic pattern turned routine research into something far more gripping.", "url": "https://dailygalaxy.com/2026/02/remote-cave-discovery-buried-3700-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/What-Scientists-Discovered-in-This-Remote-Cave-Was-Buried-for-3700-Years-and-Its-Finally-Been-Revealed-scaled.jpg", "publishedAt": "2026-02-07T14:45:00Z", "content": "In a cave nestled high in the Calabrian mountains, ancient bones have revealed a shocking genetic discovery: a child born from a father-daughter union over 3,700 years ago. The rare finding, backed b… [+2886 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "Andromeda Is Heading Straight for the Milky Way, and Scientists Finally Know Why - The Daily Galaxy", "description": "A new study uncovers the reason why Andromeda is speeding toward the Milky Way, revealing the powerful influence of dark matter on galactic movement.", "url": "https://dailygalaxy.com/2026/02/andromeda-heading-for-the-milky-way/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/Andromeda-Is-Heading-Straight-for-the-Milky-Way-and-Scientists-Finally-Know-Why-scaled.png", "publishedAt": "2026-02-07T13:45:00Z", "content": "For years, astronomers have observed the strange motion of Andromeda, the Milky Way’s closest large galactic neighbor. While most galaxies in the universe are receding due to the expansion of space, … [+4264 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "‘Impossible’ material: Researchers create glass-plastic hybrid that defies physics theory - Interesting Engineering", "description": "Scientists have finally combined the best of both worlds into a new, impact-resistant material called a compleximer.", "url": "https://interestingengineering.com/science/impossible-material-glass-plastic-hybrid", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2026/02/Plastic.jpg", "publishedAt": "2026-02-07T12:13:00Z", "content": "Researchers at Wageningen University &amp; Research (WUR) have defied long-standing material theories by developing a brand-new class of material known as a “compleximer.” \r\nThis amber-colored substa… [+3195 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Northern Lights Alert: 10 States May See Aurora Saturday Night - Forbes", "description": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth", "url": "https://www.forbes.com/sites/jamiecartereurope/2026/02/07/northern-lights-alert-10-states-may-see-aurora-saturday-night/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5f719b705d322bfa863f2fdc/0x0.jpg?format=jpg&crop=3398,1910,x1694,y1170,safe&height=900&width=1600&fit=bounds", "publishedAt": "2026-02-07T11:30:51Z", "content": "NOAA warns of likely G1-class geomagnetic storming on Saturday, Feb. 7, through Sunday, Feb. 8, as a coronal mass ejection from an X-class solar flare approaches Earth. (Photo by Alex Kormann/Star Tr… [+3438 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "Submarine Disappears Beneath Antarctic Ice After Spotting Bizarre Structures No Scientist Has Seen Before - Indian Defence Review", "description": "A groundbreaking Antarctic mission ended in mystery after a high-tech sub vanished beneath the ice, just moments after uncovering bizarre structures hidden below a melting glacier.", "url": "https://indiandefencereview.com/submarine-lost-under-antarctic-ice-after-discovering-glacier-secrets/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/this-under-ice-sub-saw-something-scientists-cant-explain-scaled.jpg", "publishedAt": "2026-02-07T11:30:00Z", "content": "A robotic submersible operating beneath one of Antarcticas most closely monitored ice shelves vanished in January 2024 during a scheduled mission. The vehicle, part of a long-running international ef… [+5699 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "NASA's Curiosity rover is doing an incredibly rare experiment on Mars - Yahoo", "description": "Wringing out clues that could change everything.", "url": "https://mashable.com/article/nasa-mars-curiosity-rover-organics-testing", "urlToImage": "https://helios-i.mashable.com/imagery/articles/04mi4NyXoOqfGALb6uRjWYy/hero-image.fill.size_1200x675.v1770408615.jpg", "publishedAt": "2026-02-07T10:00:00Z", "content": "A NASA rover has used its last drop of a special chemical to analyze a Mars sample that may contain organics, the kinds of molecules life uses on Earth.\r\nAfter the Red Planet reemerged from conjuncti… [+5283 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kimberley Lane", "title": "My thoughts on the Peak Design 7L sling bag - Space", "description": "This is the ideal bag for astrophotographers looking to declutter and take out only essential gear.", "url": "https://www.space.com/stargazing/skywatching-kit/peak-design-7l-sling-bag-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jp9u5ciJNLoXnRSo4WTeEj-2133-80.jpg", "publishedAt": "2026-02-07T10:00:00Z", "content": "External dimensions: 13.78 x 8.66 x 4.33-inches (35 x 22 x 11 cm)\r\nInternal dimensions: 13.58 x 8.46 x 4.13-inches (34.5 x 21.5 x 10.5 cm)\r\nCapacity: 7.5 L\r\nPhone pocket capacity: Fits up to iPhone 1… [+6181 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Scientists Are Rethinking 60 Years of Arctic Snow Data - SciTechDaily", "description": "Decades of advances in satellite observation made it seem as though Arctic snow cover was growing, when in reality satellites were simply becoming better at detecting smaller and shrinking amounts of snow.", "url": "https://scitechdaily.com/why-scientists-are-rethinking-60-years-of-arctic-snow-data/", "urlToImage": "https://scitechdaily.com/images/Abandoned-Fishing-Boat-Heavy-Storm-Arctic.jpg", "publishedAt": "2026-02-07T05:30:27Z", "content": "New research suggests that long-standing satellite records may have been quietly misleading scientists about Arctic snow cover. What once appeared to be a surprising increase turns out to be an illus… [+5126 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "New species discovered in the Arctic could be the great-grandmother of all jawed animals - Earth.com", "description": "A 400-million-year-old jawed fish fossil found in the Arctic, Romundina gagnieri, could be a key link in the evolution of vertebrate teeth.", "url": "https://www.earth.com/news/jawed-fish-species-romundina-gagnieri-discovered-in-the-arctic-rewrites-tooth-evolution-timeline/", "urlToImage": "https://cff2.earth.com/uploads/2026/02/04121842/arctic-fossil-fish-ancestor-jawed-animals.jpg", "publishedAt": "2026-02-07T04:56:46Z", "content": "A newly described fossil fish species, Romundina gagnieri, has revealed teeth growing on bony plates that line the roof of its mouth. This extends the acquisition of teeth in jawed fishes to a far ea… [+5243 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Rewrites the Life History of the World’s Most Famous Dinosaur - SciTechDaily", "description": "The largest study ever conducted on the growth of Tyrannosaurus rex reveals that the dinosaur took a far longer and slower route to adulthood than scientists had previously believed.", "url": "https://scitechdaily.com/new-research-rewrites-the-life-history-of-the-worlds-most-famous-dinosaur/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-rex-Skeleton-Museum.jpg", "publishedAt": "2026-02-07T04:20:10Z", "content": "A new analysis of fossil bone growth suggests Tyrannosaurus rex grew far more slowly than scientists once thought, taking nearly 40 years to reach full size. Using advanced statistical methods and ne… [+5555 chars]"}]}