{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "A failed Soviet Venus probe is expected to fall to Earth today, but when and where? Here's what we know - Space", "description": "It's still quite uncertain just where and when the craft will fall, although it is expected to reenter around 1:54 a.m. ET (0554 GMT) on May 10, plus or minus nine hours.", "url": "https://www.space.com/space-exploration/launches-spacecraft/a-failed-soviet-venus-probe-is-expected-to-fall-to-earth-today-but-when-and-where-heres-what-we-know", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xGXvRH3sphXgd5Q9r4uvfa.jpg", "publishedAt": "2025-05-09T04:03:11Z", "content": "In 1972, the Soviet Union launched the Kosmos 482 lander, a spacecraft designed to reach Venus and land on its surface. The craft never reached Venus, however. The rocket that launched it suffered an… [+3496 chars]"}, {"source": {"id": null, "name": "Thinkstewartville.com"}, "author": "", "title": "Scientists film a rare abyssal creature during an expedition in Antarctica. - Stewartville Star", "description": "The deep waters of Antarctica have long fascinated scientists and explorers alike. On January 17, 2025, researchers from the Schmidt Ocean Institute made a remarkable discovery during their Antarctic expedition that sent ripples through the scientific communi…", "url": "https://thinkstewartville.com/2025/05/08/scientists-film-a-rare-abyssal-creature-during-an-expedition-in-antarctica/", "urlToImage": "https://thinkstewartville.com/wp-content/uploads/2025/05/thinkstewartville.com-auto-draft-5ezg610.jpg", "publishedAt": "2025-05-09T02:31:00Z", "content": "Show table of content Hide table of content \r\nThe deep waters of Antarctica have long fascinated scientists and explorers alike. On January 17, 2025, researchers from the Schmidt Ocean Institute made… [+6062 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Have a Radical Plan to Grab a Sample of Venus's Toxic Atmosphere - ScienceAlert", "description": "Offering incredibly high temperatures, crushing pressure, and a thick mix of carbon dioxide and sulfuric acid, the atmosphere on Venus is deadly to human beings, several times over – but China has plans to penetrate this hostile environment and bring samples …", "url": "https://www.sciencealert.com/scientists-have-a-radical-plan-to-grab-a-sample-of-venuss-toxic-atmosphere", "urlToImage": "https://www.sciencealert.com/images/2025/05/VenusView.jpg", "publishedAt": "2025-05-09T01:37:37Z", "content": "Offering incredibly high temperatures, crushing pressure, and a thick mix of carbon dioxide and sulfuric acid, the atmosphere on Venus is deadly to human beings, several times over but China has plan… [+2917 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Rare earth element that glows violet has scientists excited about the future - Earth.com", "description": "Scientists have discovered the elusive properties hidden within promethium, a rare earth element that has remained largely unexplored.", "url": "https://www.earth.com/news/promethium-rare-earth-element-elusive-properties-finally-decoded-after-80-year/", "urlToImage": "https://cff2.earth.com/uploads/2024/05/08181413/promethium_new-rare-earth-element_credit-Jacqueline-DeMink_1.jpg", "publishedAt": "2025-05-09T00:53:53Z", "content": "When studying rare earth elements, noticing a violet glow in the lab used to be a sign for scientists that something intriguing lay on the other side of an impenetrable wall. That glow belonged to pr… [+6196 chars]"}, {"source": {"id": null, "name": "Thebrighterside.news"}, "author": "Joseph Shavit", "title": "Every living thing on Earth evolved from one common ancestor - The Brighter Side of News", "description": "Study findings point to an organism that lived about 4.2 billion years ago. That’s earlier than many scientists expected.", "url": "https://www.thebrighterside.news/discoveries/every-living-thing-on-earth-evolved-from-one-common-ancestor", "urlToImage": "https://www.thebrighterside.news/uploads/2025/05/common-ancestor.jpg?auto=webp", "publishedAt": "2025-05-08T22:07:00Z", "content": "The mystery of lifes beginnings has long captivated scientists. Central to that search is LUCAthe last universal common ancestor. LUCA sits at the root of the evolutionary tree, where two great domai… [+7081 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "China uses 'gravity slingshot' to rescue pair of wayward moon satellites - Space", "description": "\"If the satellites were destroyed, that would have been a waste of the years of effort that we put in and the money invested in the mission.\"", "url": "https://www.space.com/astronomy/moon/china-uses-gravity-slingshot-to-rescue-pair-of-wayward-moon-satellites", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6JZPPiMWeKXj6hk8mSXAoQ.jpg", "publishedAt": "2025-05-08T22:00:00Z", "content": "After launching a pair of satellites last year that failed to reach the right orbit around the moon, China's Technology and Engineering Center for Space Utilization (CSU) came up with a novel tactic … [+2716 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Bigger Brains and Strong Immunity Linked to Longer Lifespans - Neuroscience News", "description": "New research reveals that mammals with larger brains and more robust immune systems tend to live longer lives.", "url": "https://neurosciencenews.com/brain-size-immunity-longevvity-28857/", "urlToImage": "https://neurosciencenews.com/files/2025/05/brain-size-immunity-longevity-neuroscience.jpg", "publishedAt": "2025-05-08T21:29:20Z", "content": "Summary: New research reveals that mammals with larger brains and more robust immune systems tend to live longer lives. By studying 46 species, scientists found a clear link between maximum lifespan … [+5349 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Ryan Whalen, Ryan Whalen", "title": "Strange 'Terrell-Penrose Effect' Observed in Lab For the First Time, in New Confirmation of Einstein’s Special Relativity - The Debrief", "description": "Physicists have demonstrated the Terrell-Penrose effect, which causes an object moving close to the speed of light to warp before our eyes.", "url": "https://thedebrief.org/strange-terrell-penrose-effect-observed-in-lab-for-the-first-time-in-new-confirmation-of-einsteins-special-relativity/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/Terrell-Penrose.jpg", "publishedAt": "2025-05-08T21:02:17Z", "content": "For the first time, physicists have demonstrated a phenomenon known as the Terrell-Penrose effect, which causes an object moving close to the speed of light to warp before our eyes.\r\nThe new findings… [+3708 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Is Dark Energy Changing? Mysterious New Data Challenges Einstein’s Cosmological Constant - SciTechDaily", "description": "Recent findings from the Dark Energy Spectroscopic Instrument suggest the possibility of new physics that extends beyond the current standard model of cosmology. Using the lab’s new Aurora exascale computing system, the research team conducted high-resolution…", "url": "https://scitechdaily.com/is-dark-energy-changing-mysterious-new-data-challenges-einsteins-cosmological-constant/", "urlToImage": "https://scitechdaily.com/images/Abstract-Astrophysics-Dark-Matter-Mystery.jpg", "publishedAt": "2025-05-08T20:46:58Z", "content": "Aurora-powered simulations are helping scientists unravel whether DESI’s tantalizing hints of changing dark energy could redefine our understanding of the universe.\r\nRecent findings from the Dark Ene… [+9457 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Durham University", "title": "Scientists solve 500-million-year fossil mystery - Phys.org", "description": "A peculiar spiny fossil, once thought to represent one of the earliest mollusks, has now been conclusively reclassified by scientists from Durham University and Yunnan University as something entirely different—a distant relative of sponge-like creatures know…", "url": "https://phys.org/news/2025-05-scientists-million-year-fossil-mystery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/durham-university-scie-1.jpg", "publishedAt": "2025-05-08T20:07:21Z", "content": "A peculiar spiny fossil, once thought to represent one of the earliest mollusks, has now been conclusively reclassified by scientists from Durham University and Yunnan University as something entirel… [+4790 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "What will happen to VIPER? NASA shifts into reverse on canceled moon rover - Space", "description": "VIPER won't be flying commercial after all.", "url": "https://www.space.com/astronomy/moon/what-will-happen-to-viper-nasa-shifts-into-reverse-on-canceled-moon-rover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rNTpSnSARUKJHSfVcP66DN.jpg", "publishedAt": "2025-05-08T19:00:00Z", "content": "It seems NASA's ice-hunting VIPER rover won't be hitching a ride to the moon as a part of a private sector partnership, as the space agency had previously sought.\r\nThe Volatiles Investigating Polar E… [+2740 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Every Speck of Light in This Image Is a Distant Galaxy - The Daily Galaxy", "description": "What if every point of light in the sky was a galaxy? NASA’s latest image uncovers a cosmic secret that will leave you speechless", "url": "https://dailygalaxy.com/2025/05/every-speck-light-image-distant-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Every-Speck-of-Light-in-This-Image-Is-a-Distant-Galaxy.jpg", "publishedAt": "2025-05-08T18:30:00Z", "content": "NASA’s James Webb Space Telescope (JWST) has captured a mind-blowing deep-field image of a tiny sliver of the sky, revealing that nearly every speck of light is a galaxy. \r\nThis extraordinary snapsho… [+3844 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Massive Gravity Hole Discovered in the Indian Ocean—And What’s Beneath Could Redefine Earth’s Evolution - Indian Defence Review", "description": "A massive gravity anomaly beneath the Indian Ocean, known as the Indian Ocean Geoid Low, has baffled scientists for years.", "url": "https://indiandefencereview.com/gravity-hole-discovered-indian-ocean/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/massive-gravity-hole-discovered-in-the-indian-oceanand-whats-beneath-could-redefine-earths-evolution.jpg", "publishedAt": "2025-05-08T18:15:00Z", "content": "Beneath the vast expanse of the Indian Ocean lies a strange and puzzling phenomenona massive gravitational anomaly that has stumped scientists for decades. This anomaly, known as the Indian Ocean Geo… [+5321 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Gravity could be the definitive clue that the universe is one giant computer - Earth.com", "description": "Physicist Melvin Vopson proposes gravity might emerge from cosmic information processing, hinting the universe runs on a computational code.", "url": "https://www.earth.com/news/gravity-could-be-the-definitive-clue-that-the-universe-is-a-computer-storing-information/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07042804/gravity-definitive-clue-universe-computer.jpg", "publishedAt": "2025-05-08T17:59:46Z", "content": "Modern ideas about reality sometimes sound like a wild story. The notion that everything around us might be bits and bytes is easy to brush aside, yet it continues to intrigue many curious minds.\r\nTh… [+5136 chars]"}, {"source": {"id": null, "name": "Nasawatch.com"}, "author": "Keith Cowing", "title": "What Do We Do With All Those Gateway Pieces? - NASA Watch", "description": "Now that NASA has been told to cancel Gateway what happens to all its pieces?", "url": "https://nasawatch.com/artemis/what-do-we-do-with-all-those-gateway-pieces/", "urlToImage": "https://nasawatch.com/wp-content/uploads/2025/05/HALO.jpg", "publishedAt": "2025-05-08T17:57:40Z", "content": "NASA Watch founder, Explorers Club Fellow, ex-NASA, Away Teams, Journalist, Space &amp; Astrobiology, Lapsed climber."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "NASA", "title": "Hubble pinpoints roaming massive black hole - Phys.org", "description": "Like a scene out of a sci-fi movie, astronomers using NASA telescopes have found \"Space Jaws.\" Lurking 600 million light-years away, within the inky black depths between stars, there is an invisible monster gulping down any wayward star that plummets toward i…", "url": "https://phys.org/news/2025-05-hubble-roaming-massive-black-hole.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/hubble-pinpoints-roami.jpg", "publishedAt": "2025-05-08T16:07:04Z", "content": "This six-panel illustration of a tidal disruption event around a supermassive black hole shows the following: 1) A supermassive black hole is adrift inside a galaxy, its presence only detectable by g… [+7719 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Rare 100-Million-Year-Old Amber Fossil Reveals Ferocious Spider Attack - Indian Defence Review", "description": "A 100-million-year-old amber fossil captures an extraordinary moment, showing a spider attacking a wasp.", "url": "https://indiandefencereview.com/100-million-year-old-amber-fossil-spider/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/rare-100-million-year-old-amber-fossil-reveals-ferocious-spider-attack.jpg", "publishedAt": "2025-05-08T16:05:00Z", "content": "A new paleontological discovery, as reported in theHistorical Biology journal, has shed light on a fascinating scene from the Cretaceous perioda spiders predatory attack on a wasp, preserved in amber… [+5327 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Astronomers May Have Just Discovered the Smallest Galaxy Ever - The Daily Galaxy", "description": "Could this tiny object in the Ursa Major constellation be the smallest galaxy ever discovered, or is it just an ancient star cluster hiding a dark-matter mystery?", "url": "https://dailygalaxy.com/2025/05/astronomers-discovered-smallest-galaxy/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Astronomers-May-Have-Just-Discovered-the-Smallest-Galaxy-Ever.jpg", "publishedAt": "2025-05-08T15:36:00Z", "content": "Astronomers have made a fascinating discovery in the Ursa Major constellation that could potentially challenge our understanding of galaxies and star clusters. The object in question, UMa3/U1, has sp… [+4814 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Sun’s Explosive Eruption Sends Shockwave Toward Earth - The Daily Galaxy", "description": "On May 7, 2025, the Sun erupted in a massive display of energy, releasing a solar filament that stretched across its eastern limb.", "url": "https://dailygalaxy.com/2025/05/suns-explosive-eruption-shockwave-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Suns-Explosive-Eruption-Sends-Shockwave-Toward-Earth—Planet-Dodges-the-Hit.jpg", "publishedAt": "2025-05-08T15:05:00Z", "content": "On May 7, 2025, the Sun unleashed a stunning solar filament eruption, sending a dramatic wave of solar energy across space. Captured in high-resolution images by NOAAs GOES-19 spacecraft, the eruptio… [+3207 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Anthony Wood", "title": "A stadium-sized asteroid will fly past Earth on May 9, and you can watch it live (video) - Space", "description": "The 950-foot hunk of primordial matter is classified as a \"potentially hazardous asteroid,\" but that doesn't mean it has a chance of hitting Earth.", "url": "https://www.space.com/stargazing/a-stadium-sized-asteroid-will-fly-past-earth-on-may-9-and-you-can-watch-it-live-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Mqj4SSBhzHx6ZQJtLMMs9.jpg", "publishedAt": "2025-05-08T15:00:00Z", "content": "On May 9, a stadium-sized potentially hazardous asteroid will pass by Earth, and you can watch the flyby happen in real time courtesy of a livestream from The Virtual Telescope Project.\r\nThe main bel… [+3415 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "“Anomalous” Discovery in Antarctica Has Left Climate Scientists Scratching Their Heads - The Debrief", "description": "A discovery in Antarctica has revealed something few scientists would have expected: a reversal of its decades-long ice loss.", "url": "https://thedebrief.org/anomalous-discovery-in-antarctica-has-left-climate-scientists-scratching-their-heads/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2025/05/Antarctica.jpg", "publishedAt": "2025-05-08T14:21:34Z", "content": "Antarcticas vast ice sheet has revealed something few scientists would have expected: the slowly thawing continent appears to have gained mass over the past two years, in an apparent reversal of ice … [+5379 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Holly Ober", "title": "Physicists propose a new route by which neutrinos can be produced - Phys.org", "description": "Buried deep in the ice in the Antarctic are \"eyes\" that can see elementary particles called neutrinos, and what they've observed is puzzling scientists: a remarkably strong neutrino signal accompanied by a surprisingly weak gamma-ray emission in the galaxy NG…", "url": "https://phys.org/news/2025-05-physicists-route-neutrinos.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/physicists-propose-a-n.jpg", "publishedAt": "2025-05-08T13:30:05Z", "content": "Buried deep in the ice in the Antarctic are \"eyes\" that can see elementary particles called neutrinos, and what they've observed is puzzling scientists: a remarkably strong neutrino signal accompanie… [+7606 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Earth’s Poles Are Moving Faster Than Ever—And Scientists Say This Could Trigger Global Crisis - The Daily Galaxy", "description": "A new study reveals that Earth's North and South Poles are shifting faster than ever before.", "url": "https://dailygalaxy.com/2025/05/earths-poles-are-moving-faster-than-ever/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Earths-Poles-Are-Moving-Faster-Than-Ever—And-Scientists-Say-This-Could-Trigger-Global-Crisis.jpg", "publishedAt": "2025-05-08T13:30:00Z", "content": "A groundbreaking study published inGeophysical Research Letters has revealed that Earth’s North and South Poles are shifting faster than ever before, with projections showing a potential shift of mor… [+4061 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Earth Gets Its First Deep-Space Laser Message—From 16 Million Kilometers Away! - Indian Defence Review", "description": "NASA has just pulled off a groundbreaking achievement that feels straight out of science fiction. A laser message from space has traveled a staggering 16 million kilometers, setting the stage for a new era in space communication.", "url": "https://indiandefencereview.com/earth-gets-its-first-deep-space-laser-message-from-16-million-kilometers-away/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/deep-space-laser.jpg", "publishedAt": "2025-05-08T13:10:00Z", "content": "In a groundbreaking development that feels straight out of science fiction, NASA has made a giant leap in space communication by successfully transmitting a laser message from the Psyche spacecraft t… [+2605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Elon Musk's big warning: 'All life on Earth will be destroyed eventually...' - The Economic Times", "description": "Elon Musk, head of DOGE, has warned of Earth's eventual destruction in a new interview, advocating for Mars colonization as humanity's long-term survival strategy. He emphasized the need for a self-sustaining Martian civilization, viewing it as 'life insuranc…", "url": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musks-big-warning-all-life-on-earth-will-be-destroyed-eventually-/articleshow/120999694.cms", "urlToImage": "https://img.etimg.com/thumb/msid-120999781,width-1200,height-630,imgsize-17956,overlay-economictimes/articleshow.jpg", "publishedAt": "2025-05-08T13:02:28Z", "content": "Tech mogul and billionaire Elon Musk, who also heads Donald Trump's Department of Government Efficiency (DOGE), has outlined reasons why he wants to get humanity to Mars so badly. He has issued a sta… [+3416 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "T. rex’s ancestors may have walked from Asia to North America - Earth.com", "description": "Researchers trace T. rex origins to Asia and megaraptors to Gondwana. Climate changes and predator extinction fueled their rise as predators.", "url": "https://www.earth.com/news/t-rexs-ancestors-may-have-walked-from-asia-to-north-america/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/08061535/T.-Rex-Asia.jpg", "publishedAt": "2025-05-08T12:18:44Z", "content": "A new study led by UCL researchers has traced the roots of Tyrannosaurus rex back to Asia. Before ruling North America as a colossal predator, T. rex likely crossed a land bridge from Asia more than … [+4834 chars]"}, {"source": {"id": null, "name": "kwwl.com"}, "author": "Kameryn Griesser, CNN", "title": "Mile-wide underwater volcano ready to erupt off the West Coast - KWWL", "description": "(CNN) — Things are heating up hundreds of miles off the coast of Oregon, where a large undersea volcano is showing signs of impending eruption, scientists say.", "url": "https://www.kwwl.com/news/mile-wide-underwater-volcano-ready-to-erupt-off-the-west-coast/article_17f7fbab-27aa-565f-9216-85eae283383d.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/kwwl.com/content/tncms/assets/v3/editorial/c/b9/cb9b5a0b-1f79-5c03-b079-dd719d63170b/681cb5e95f8d6.image.jpg?crop=1920%2C1008%2C0%2C35&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2025-05-08T12:00:14Z", "content": "(CNN) Things are heating up hundreds of miles off the coast of Oregon, where a large undersea volcano is showing signs of impending eruption, scientists say.\r\nThe volcano, known as Axial Seamount, is… [+6005 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "People Can’t Stop Freaking Out Over This Asteroid Photo from Space—And It’s Hard to Look Away - Indian Defence Review", "description": "The Hayabusa2 mission captured the asteroid with eerie clarity against a pitch-black backdrop. The unsettling darkness of space brings new perspective on the unknown.", "url": "https://indiandefencereview.com/people-cant-stop-freaking-out-over-this-asteroid-photo-from-space-and-its-hard-to-look-away/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/05/a-recent-photograph-of-the-asteroid-ryugu.jpg", "publishedAt": "2025-05-08T11:30:00Z", "content": "A recent photograph of the asteroid Ryugu, taken by the Japanese space probe Hayabusa2, has resurfaced online and is gaining renewed attention. This image is being described by some as the clearest e… [+3104 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "NASA JPL boss bails for 'personal reasons' as budget cuts bite - theregister.com", "description": "Updated: Laurie Leshin to leave in June", "url": "https://www.theregister.com/2025/05/08/nasa_jpl_director_quits/", "urlToImage": "https://regmedia.co.uk/2025/05/08/shutterstock_jpl_la_canada.jpg", "publishedAt": "2025-05-08T10:31:00Z", "content": "Updated Laurie Leshin, director of NASA's Jet Propulsion Laboratory (JPL), is stepping down in June and will be replaced by JPL veteran David Gallagher.\r\nJPL directors come and go, but Voyager flies … [+2185 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "How do archaeologists figure out the sex of a skeleton? - Live Science", "description": "Archaeologists can estimate a person's sex with 95% accuracy, but many experts are focused on what can be learned about humans outside the male/female gender binary.", "url": "https://www.livescience.com/archaeology/how-do-archaeologists-figure-out-the-sex-of-a-skeleton", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pb7zDuQJKhsRmpvkdCNA9i.jpg", "publishedAt": "2025-05-08T10:00:00Z", "content": "When archaeologists find ancient human remains, they often try to determine if the person was male or female based on their bones.\r\nSo how do archaeologists figure out the sex of the individual from … [+6908 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Proba-3 achieves precise formation flying - European Space Agency", "description": "For the first time, two spacecraft in orbit were aligned in formation with millimetre precision and maintained their relative position for several hours without any control from the ground.", "url": "https://www.esa.int/Enabling_Support/Space_Engineering_Technology/Proba-3_achieves_precise_formation_flying", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/11/proba-3_occulter_eclipsing_sun_for_coronagraph_spacecraft/26474797-1-eng-GB/Proba-3_Occulter_eclipsing_Sun_for_Coronagraph_spacecraft_pillars.jpg", "publishedAt": "2025-05-08T08:12:18Z", "content": "Enabling &amp; Support08/05/20251255 views17 likes\r\nFor the first time, two spacecraft in orbit were aligned in formation with millimetre precision and maintained their relative position for several … [+4811 chars]"}, {"source": {"id": null, "name": "Glassalmanac.com"}, "author": "Sarah Johnson", "title": "Study Suggests Mars Colonization May Be Impossible! - Glass Almanac", "description": "Through his company SpaceX, Elon Musk harbors an exceedingly ambitious dream: to herald the arrival of humans on Mars. According to Musk, this is a crucial ... Continue Reading →", "url": "https://glassalmanac.com/study-suggests-mars-colonization-may-be-impossible/", "urlToImage": "https://glassalmanac.com/wp-content/uploads/2025/05/Study-Suggests-Mars-Colonization-May-Be-Impossible.jpg", "publishedAt": "2025-05-08T06:13:35Z", "content": "Through his company SpaceX, Elon Musk harbors an exceedingly ambitious dream: to herald the arrival of humans on Mars. According to Musk, this is a crucial step for space colonization. However, a rec… [+2562 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Antarctic glacier caught stealing ice from neighbour - European Space Agency", "description": "Thanks largely to Copernicus Sentinel-1, scientists have discovered that a glacier in Antarctica is rapidly siphoning ice from neighbouring flows – at a pace never before seen. Until now, researchers believed that this process of ‘ice piracy’ in Antarctica to…", "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-1/Antarctic_glacier_caught_stealing_ice_from_neighbour", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/05/dotson_ice_shelf_from_sentinel-1/26623729-1-eng-GB/Dotson_Ice_Shelf_from_Sentinel-1_pillars.jpg", "publishedAt": "2025-05-08T05:38:40Z", "content": "Applications08/05/20253834 views17 likes\r\nThanks largely to Copernicus Sentinel-1, scientists have discovered that a glacier in Antarctica is rapidly siphoning ice from neighbouring flows at a pace n… [+5345 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "Adam Zewe | MIT News", "title": "System lets robots identify an object’s properties through handling - MIT News", "description": "Robots developed at MIT can now learn about an object’s weight, softness, or contents by picking it up and gently shaking it. A robot can accurately guess parameters like an object’s mass in a matter of seconds, without the need for cameras or other external …", "url": "https://news.mit.edu/2025/system-lets-robots-identify-objects-properties-through-handling-0508", "urlToImage": "https://news.mit.edu/sites/default/files/images/202505/MIT-Differentiable-Interaction-01.jpg", "publishedAt": "2025-05-08T04:00:00Z", "content": "A human clearing junk out of an attic can often guess the contents of a box simply by picking it up and giving it a shake, without the need to see whats inside. Researchers from MIT, Amazon Robotics,… [+6209 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Discover New Bacteria That Conduct Electricity Like a Wire - ScienceAlert", "description": "A newly discovered bacterium wiggling about in the mudflats of the Oregon coast could advance a new era of bioelectric devices.", "url": "https://www.sciencealert.com/scientists-discover-new-bacteria-that-conduct-electricity-like-a-wire", "urlToImage": "https://www.sciencealert.com/images/2025/05/cable-bacteria.jpg", "publishedAt": "2025-05-08T02:34:50Z", "content": "A newly discovered bacterium wiggling about in the mudflats of the Oregon coast could advance a new era of bioelectric devices.\r\nIt's been named Ca. Electrothrix yaqonensis, in honor of the First Nat… [+3344 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "John Elliot V", "title": "Superconductivity News: What Makes Floquet Majorana Fermions Special For Quantum Computing? - Hackaday", "description": "Researchers from the USA and India have proposed that Floquet Majorana fermions may improve quantum computing by controlling superconducting currents, potentially reducing errors and increasing sta…", "url": "https://hackaday.com/2025/05/07/superconductivity-news-what-makes-floquet-majorana-fermions-special-for-quantum-computing/", "urlToImage": "https://hackaday.com/wp-content/uploads/2025/05/ettore-majorana-featured.jpg", "publishedAt": "2025-05-08T02:00:00Z", "content": "Researchers from the USA and India have proposed that Floquet Majorana fermions may improve quantum computing by controlling superconducting currents, potentially reducing errors and increasing stabi… [+2068 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Cracks 30-Year X-ray Mystery With Blazing Black Hole Light Show - SciTechDaily", "description": "Astronomers using NASA’s IXPE satellite have finally cracked a cosmic mystery—how X-rays are produced in the energetic jets of supermassive black holes like the blazar BL Lacertae. The blazar BL Lacertae—a type of active galaxy powered by a supermassive black…", "url": "https://scitechdaily.com/?p=474049", "urlToImage": "https://scitechdaily.com/images/Blazar-BL-Lacertae-Concept-scaled.jpg", "publishedAt": "2025-05-08T01:54:52Z", "content": "This artist’s concept depicts the central region of the blazar BL Lacertae, a supermassive black hole surrounded by a bright disk and a jet oriented toward Earth. The galaxy’s central black hole is s… [+9831 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "NASA scrambles to cut ISS activity due to budget issues - Ars Technica", "description": "“The Budget reduces the space station’s crew size and onboard research.”…", "url": "https://arstechnica.com/space/2025/05/nasa-scrambles-to-cut-iss-activity-after-trump-budget-its-options-are-not-great/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/04/iss028e016134-1152x648.jpg", "publishedAt": "2025-05-07T22:50:39Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Uh Oh, There's a Problem With Psyche's Propulsion System - Universe Today", "description": "NASA’s Psyche mission is on its way to explore a metal-rich asteroid in the asteroid belt between Mars and Jupiter. All was going well since its launch in October 2023 until nasa announced a decrease in fuel pressure for the propulsion system. It uses a solar…", "url": "https://www.universetoday.com/articles/uh-oh-theres-a-problem-with-psyches-propulsion-system", "urlToImage": "https://www.universetoday.com/assets/psyche_spacecraft.jpeg", "publishedAt": "2025-05-07T22:36:09Z", "content": "Asteroid Psyche (formally designated 16 Psyche) is one of the most intriguing objects in our Solar System's asteroid belt. Unlike most asteroids composed primarily of rock or ice, Psyche is believed … [+2963 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "This Bold New Theory Could Finally Unite Gravity and Quantum Physics - ZME Science", "description": "A bold new theory could bridge quantum physics and gravity at last.", "url": "https://www.zmescience.com/science/physics/finland-unifying-gravity-quantum-mechanics/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2025/05/assets_task_01jtp1pcaxfv1t0ccvwd85bx1k_1746644266_img_0.webp", "publishedAt": "2025-05-07T22:13:07Z", "content": "Credit: ZME Science/SORA.\r\nAt Aalto University in Finland, two physicists believe they may have cracked a puzzle that has defied generations of scientists: how to reconcile the physics of the very bi… [+5761 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Learning Reshapes Your Brain’s Connections - Neuroscience News", "description": "New research reveals that learning doesn't just alter brain activity — it physically rewires the connections between key brain regions to make communication faster and more precise.", "url": "https://neurosciencenews.com/learning-brain-connectivity-28842/", "urlToImage": "https://neurosciencenews.com/files/2025/05/learning-brain-connectivity-neuroscience.jpg", "publishedAt": "2025-05-07T21:51:44Z", "content": "Summary: New research reveals that learning doesn’t just alter brain activity it physically rewires the connections between key brain regions to make communication faster and more precise. Scientists… [+8142 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“It Made No Sense” – Scientist Discovers California’s New Highest Tree - SciTechDaily", "description": "The highest recorded elevations of Jeffrey pines provide new evidence of a warming climate in the High Sierra. UC Davis Professor Hugh Safford was hiking for enjoyment in California’s High Sierra when he unexpectedly documented a new elevation record for the …", "url": "https://scitechdaily.com/it-made-no-sense-scientist-discovers-californias-new-highest-tree/", "urlToImage": "https://scitechdaily.com/images/Jeffrey-Pine-on-Mount-Kaweah.jpg", "publishedAt": "2025-05-07T21:50:03Z", "content": "Sandwiched between a lodgepole pine on the left and a foxtail pine on the right is the first Jeffrey pine tree UC Davis Professor Hugh Safford observed in September 2024 on a hike on the south slope … [+6097 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Retired Air Force officer nominated to be NASA deputy administrator - SpaceNews", "description": "The White House has nominated a former Air Force officer and advocate for the Space Force to be the deputy administrator of NASA.", "url": "http://spacenews.com/retired-air-force-officer-nominated-to-be-nasa-deputy-administrator/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNFwvMTJcL1NjcmVlbnNob3QtMjAyNC0xMi0xMS1hdC0yLjQ3LjU1JWUyJTgwJWFmUE0tZTE3MzM5NTYzNDI2MjMtMTAyNHg1ODQucG5nIiwidHh0IjoiUmV0aXJlZCBBaXIgRm9yY2Ugb2ZmaWNlciBub21pbmF0ZWQgdG8gYmUgTkFTQSBkZXB1dHkgYWRtaW5pc3RyYXRvciIsInRlbXBsYXRlIjoiZnVsbHNjcmVlbiIsImJsb2dfaWQiOjgwNjgxOTc5fQ.leyL2hKnPhtpt_hlogQPIWsA71exV5x7_MOSrRPE0J8MQ", "publishedAt": "2025-05-07T21:44:48Z", "content": "WASHINGTON The White House has nominated a former Air Force officer and advocate for the Space Force to be the deputy administrator of NASA.\r\nThe White House formally transmitted the nomination of Ma… [+2777 chars]"}, {"source": {"id": null, "name": "Carsonnow.org"}, "author": "admin", "title": "Northern Nevada backyards and gardens: Beware of this small invader - Carson Now", "description": "By JoAnne Skelly — I was out walking this morning in a grassy area south of Little Washoe Lake. My friend and I had been discussing ticks as we walked […]", "url": "http://www.carsonnow.org/05/07/2025/northern-nevada-backyards-and-gardens-beware-of-this-small-invader", "urlToImage": "https://www.carsonnow.org/wp-content/uploads/2025/05/Amblyomma_americanum_tick.jpg", "publishedAt": "2025-05-07T21:33:18Z", "content": "By JoAnne Skelly I was out walking this morning in a grassy area south of Little Washoe Lake. My friend and I had been discussing ticks as we walked through the grass. After about five minutes, she l… [+2411 chars]"}, {"source": {"id": null, "name": "The Mary Sue"}, "author": "Sarah Fimm", "title": "The 10 best hard sci-fi novels - The Mary Sue", "description": "These sci-fi novels? A perfect 10 on the Mohs hardness scale.", "url": "https://www.themarysue.com/the-10-best-hard-sci-fi-novels/", "urlToImage": "https://www.themarysue.com/wp-content/uploads/2025/05/the-martian-matt-damon.jpeg", "publishedAt": "2025-05-07T21:28:00Z", "content": "Are you looking for rock hard sci-fi? Sci-fi you could use to cut glass? Sci-fi so solid you could heave it through the tempered alumino-silicate glass pane separating a starship’s interior from the … [+9040 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "South Africa Is Getting Lifted out of the Ocean and Scientists Believe They Know Why - SciTechDaily", "description": "According to a study conducted by the University of Bonn, droughts caused the land in Germany to rise by six millimeters between 2012 and 2020. South Africa is gradually rising by as much as two millimeters per year depending on the region. Until now, scienti…", "url": "https://scitechdaily.com/south-africa-is-getting-lifted-out-of-the-ocean-and-scientists-believe-they-know-why/", "urlToImage": "https://scitechdaily.com/images/South-Africa-Space.jpg", "publishedAt": "2025-05-07T21:27:08Z", "content": "South Africa is slowly rising, and for years, scientists assumed this uplift was caused by movements deep within the Earth. But new research offers a surprising explanation: drought-driven water loss… [+5672 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Jeremy Gray", "title": "Scientists Capture First-Ever Images of Free-Range Atoms - PetaPixel", "description": "The new research proves theories that were previously only demonstrated using mathematics.", "url": "https://petapixel.com/2025/05/07/scientists-capture-first-ever-images-of-free-range-atoms/", "urlToImage": "https://petapixel.com/assets/uploads/2025/05/mit-atom-resolved-microscopy.jpg", "publishedAt": "2025-05-07T21:09:59Z", "content": "Physicists at the Massachusetts Institute of Technology (MIT) have captured the first photos ever of “free-range” atoms. The groundbreaking achievement will help scientists visualize quantum phenomen… [+5500 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Julian Dossett", "title": "Hours before a solar eclipse, spruce trees 'talk' to each other - Space", "description": "\"Basically, we are watching the famous 'wood wide web' in action!\"", "url": "https://www.space.com/stargazing/solar-eclipses/hours-before-a-solar-eclipse-spruce-trees-talk-to-each-other", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dfm67Wyguefgef8T6vtUDg.jpg", "publishedAt": "2025-05-07T21:00:00Z", "content": "Spruce trees retain ancient memories of their environment and communicate with one other in the hours preceding a solar eclipse, a new international study suggests.\r\n\"We now see the forest not as a m… [+2671 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Princeton University", "title": "Physicists discover an unusual chiral quantum state in a topological material - Phys.org", "description": "Chirality—the property of an object that is distinct from its mirror image—has long captivated scientists across biology, chemistry, and physics. The phenomenon is sometimes called \"handedness,\" because it refers to an object possessing a distinct left- or ri…", "url": "https://phys.org/news/2025-05-physicists-unusual-chiral-quantum-state.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/scientists-discover-an.jpg", "publishedAt": "2025-05-07T20:46:04Z", "content": "Chiralitythe property of an object that is distinct from its mirror imagehas long captivated scientists across biology, chemistry, and physics. The phenomenon is sometimes called \"handedness,\" becaus… [+7510 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "NASA just sent a giant balloon around the world in 16 days. Here's why. - Live Science", "description": "NASA's massive super-pressure balloon has completed a 16-day trip around the Southern Hemisphere — a milestone in high-altitude flight and atmospheric research.", "url": "https://www.livescience.com/space/space-exploration/nasa-just-sent-a-giant-balloon-around-the-world-in-16-days-heres-why", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HV9K87CBnRncgm2iLb4yiJ.jpg", "publishedAt": "2025-05-07T20:19:32Z", "content": "NASA just pulled off a sky-high feat: One of its massive super-pressure balloons completed a full lap around the Southern Hemisphere in just over 16 days.\r\nThe globe-trotting balloon crossed the 169.… [+2869 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "NASA diagnoses fracture in a 'huge cosmic bone' using X-ray observatory - Space", "description": "The \"bone\" is actually a galactic center filament, and it's about 230 light-years long.", "url": "https://www.space.com/astronomy/galaxies/nasa-diagnoses-fracture-in-a-huge-cosmic-bone-using-x-ray-observatory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BoegToC7Z4wENo8EDJTaD9.jpg", "publishedAt": "2025-05-07T20:00:00Z", "content": "A composite of X-ray and radio data showing galactic center filament G359.13142-0.20005. (Image credit: X-ray: NASA/CXC/Northwestern Univ./F. Yusef-Zadeh et al; Radio: NRF/SARAO/MeerKat; Image Proces… [+2606 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "'Largest structure in the universe' is even bigger than astronomers imagined and still a huge mystery - Earth.com", "description": "Astronomers reconsider the Great Wall Hercules-Corona Borealis: cosmic superstructure seems to be bigger and closer than imagined.", "url": "https://www.earth.com/news/largest-structure-in-universe-great-wall-hercules-corona-borealis-bigger-than-imagined/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/07032920/astronomers-cosmic-superwall-ten-billion-light-years.jpg", "publishedAt": "2025-05-07T19:53:37Z", "content": "Astronomers have spotted something that appears to stretch around ten billion light years across. This so-called HerculesCorona Borealis Great Wall is being reevaluated, and it might be more extensiv… [+4843 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ashley Balzer", "title": "Key portion of Nancy Grace Roman Space Telescope clears thermal vacuum test - Phys.org", "description": "A major part of NASA's nearly complete Nancy Grace Roman Space Telescope just passed a lengthy thermal test to ensure it will function properly in the space environment.", "url": "https://phys.org/news/2025-05-key-portion-nancy-grace-roman.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/key-portion-of-nasas-r-1.jpg", "publishedAt": "2025-05-07T19:15:02Z", "content": "A major part of NASA's nearly complete Nancy Grace Roman Space Telescope just passed a lengthy thermal test to ensure it will function properly in the space environment.\r\n\"This milestone tees us up t… [+2891 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Witness the World’s Biggest Telescope Rising Under a Sky Full of Stars - The Daily Galaxy", "description": "At the Paranal Observatory, a giant telescope is using lasers to create artificial stars and capture images sharper than those from space", "url": "https://dailygalaxy.com/2025/05/telescope-creates-stars-delivers-space-like-images-from-earth/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/Witness-the-Worlds-Biggest-Telescope-Rising-Under-a-Sky-Full-of-Stars.jpg", "publishedAt": "2025-05-07T19:00:00Z", "content": "At the Paranal Observatory in Chile, the UT4 telescope doesnt just observe the starsit actively creates artificial stars to combat atmospheric interference. \r\nBy shooting powerful lasers into the sky… [+2698 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "After 12 Years of Silence, This Volcano Triggered a Devastating Tsunami - The Daily Galaxy", "description": "For over a decade, satellites quietly observed a volcano's mysterious movements. What they saw—too late—could change how we predict the next deadly eruption.", "url": "https://dailygalaxy.com/2025/05/after-12-years-of-silence-this-volcano-triggered-a-devastating-tsunami/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/After-12-Years-of-Silence-This-Volcano-Triggered-a-Devastating-Tsunami.jpg", "publishedAt": "2025-05-07T18:30:00Z", "content": "In 2018, the Anak Krakatau volcano in Indonesia erupted violently, triggering a devastating tsunami that killed over 400 people. What many didnt know at the time was that the volcanos collapse had be… [+3445 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Humans Have Never Seen 99.999% of the Seafloor, Study Finds, as Trump Greenlights Deep-Sea Mining - Gizmodo", "description": "Researchers say our understanding of Earth’s largest biome is based on a tiny, unrepresentative sample dominated by just a few countries.", "url": "https://gizmodo.com/humans-have-never-seen-99-999-of-the-seafloor-study-finds-as-trump-greenlights-deep-sea-mining-2000598914", "urlToImage": "https://gizmodo.com/app/uploads/2025/05/noaa-deep-sea.jpg", "publishedAt": "2025-05-07T18:00:44Z", "content": "Weve got better visuals of Mars than we do of our own ocean floorand by a much larger margin than youd think.\r\nA new study in Science Advances crunched the numbers from 43,681 deep-sea dives conducte… [+4143 chars]"}, {"source": {"id": null, "name": "Webbtelescope.org"}, "author": null, "title": "New Visualization From NASA's Webb Telescope Explores Cosmic Cliffs - Webb Home", "description": "", "url": "https://webbtelescope.org/contents/news-releases/2025/news-2025-123", "urlToImage": "//stsci-opo.org/STScI-01JT15JCG8AHE8PEE50V308N7D.png", "publishedAt": "2025-05-07T18:00:00Z", "content": "In July 2022, NASA’s James Webb Space Telescope made its public debut with a series of breathtaking images. Among them was an ethereal landscape nicknamed the Cosmic Cliffs. This glittering realm of … [+4137 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "James Webb Space Telescope finds water in the air of exotic 'sub-Neptune' exoplanet - Space", "description": "\"I had been waiting my entire career for Webb so that we could meaningfully characterize the atmospheres of these smaller planets.\"", "url": "https://www.space.com/astronomy/james-webb-space-telescope/james-webb-space-telescope-finds-water-in-the-air-of-exotic-sub-neptune-exoplanet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hRXx8GNspzfWe2vBqUKH5Q.jpg", "publishedAt": "2025-05-07T18:00:00Z", "content": "NASA's James Webb Space Telescope (JWST) has found water swirling in the air of a distant alien planet, a new study reports.\r\nThat exotic world is TOI-421 b, a boiling-hot \"sub-Neptune\r\n\" orbiting a … [+4824 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "NASA gets keys to Orion photo of the day for May 7, 2025 - Space", "description": "Lockheed Martin officials handed over the \"keys\" to the Artemis 2 Orion spacecraft to NASA, marking the start of its processing for launch.", "url": "https://www.space.com/space-exploration/artemis/nasa-gets-keys-to-orion-space-photo-of-the-day-for-may-7-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4h7x4UeSUwP5ZnRakBuQQG.jpg", "publishedAt": "2025-05-07T17:31:00Z", "content": "NASA and Lockheed Martin officials pose together during a handover ceremony for the Artemis 2 Orion spacecraft at Kennedy Space Center in Florida on May 1, 2025. (Image credit: NASA/Cory S. Huston)\r\n… [+2746 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "NASA Mars satellite uncovers markings 'like paint dripping down a wall' on Martian surface - Yahoo", "description": "Wave-like soil patterns on the Martian surface match those found in Earth's cold, mountain regions, which could help scientists better understand the Red Planet's climate history and search for signs of life.", "url": "https://www.livescience.com/space/mars/nasa-mars-satellite-uncovers-markings-like-paint-dripping-down-a-wall-on-martian-surface", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BefafqhVkahi49pQH29GfR.jpg", "publishedAt": "2025-05-07T17:17:58Z", "content": "High-resolution satellite images have revealed dripping paint-like patterns on Mars that match those found on Earth, according to a new study.\r\nThe familiar soil patterns suggest that Mars and Earth … [+3688 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Discover Wild Birds Behaving Suspiciously Like Friends - ScienceAlert", "description": "The ability to cooperate and work together is not unique to humans; indeed, it's one of the most successful strategies for collective survival in the whole tree of life, from the give-and-take between symbionts, to the kindness of strangers in the street.", "url": "https://www.sciencealert.com/scientists-discover-wild-birds-behaving-suspiciously-like-friends", "urlToImage": "https://www.sciencealert.com/images/2025/05/birb-besties.jpg", "publishedAt": "2025-05-07T15:01:21Z", "content": "The ability to cooperate and work together is not unique to humans; indeed, it's one of the most successful strategies for collective survival in the whole tree of life, from the give-and-take betwee… [+4366 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Lunar laser: China makes 1st daytime laser-ranging measurement from Earth to the moon - Space", "description": "The laser test needed to overcome major technical challenges posed by sunlight. interference.", "url": "https://www.space.com/astronomy/moon/lunar-laser-china-makes-1st-daytime-laser-ranging-measurement-from-earth-to-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6JZPPiMWeKXj6hk8mSXAoQ.jpg", "publishedAt": "2025-05-07T15:00:00Z", "content": "China has achieved a milestone feat, making the first-ever laser ranging measurement from Earth to the moon during the daytime.\r\nResearchers at Yunnan Observatories under the Chinese Academy of Scien… [+2120 chars]"}, {"source": {"id": null, "name": "Best Life"}, "author": "Zachary Mack", "title": "\"Miracle\" Anti-Aging Supplement Hyped By Celebs Is a Waste of Money, Scientists Warn - bestlifeonline.com", "description": "Is NAD+ really the anti-aging miracle it's cracked up to be? Despite celebrity endorsements and a booming market, a new study suggests it may not live up to the hype. Are supplements worth the investment, or can you get the same benefits from natural sources?…", "url": "https://bestlifeonline.com/nad-supplement-2671900796/?utm_campaign=post-teaser&utm_content=sj23igqd", "urlToImage": "https://bestlifeonline.com/media-library/image.jpg?id=60148791&width=1200&height=600&coordinates=0%2C105%2C0%2C105", "publishedAt": "2025-05-07T14:37:13Z", "content": "At the surface, supplements claim to be able to provide all kinds of health and wellness benefitsincluding helping you age\r\n in reverse. While plenty of pills and powders are touted as \"anti-aging\" i… [+5804 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Ellie Kemp", "title": "People can't believe what they're seeing after real distance between Earth and Moon is laid bare - UNILAD", "description": "NASA's OSIRIS-REx probe captured the Earth and Moon 249,000 miles apart", "url": "https://www.unilad.com/technology/space/earth-moon-distance-nasa-reddit-reaction-373260-20250507", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt98be4490f037557a/681b42d3f5af756747c1ab06/moon-earth-distance-reddit.jpg", "publishedAt": "2025-05-07T13:56:45Z", "content": "A photo capturing the true scale of the distance between the Earth and the Moon has blown people's minds. \r\nA viral Reddit post has reminded us once again just how tiny and ultimately insignificant o… [+2241 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "The Molecular Bond That Helps Secure Your Memories - Quanta Magazine", "description": "How do memories last a lifetime when the molecules that form them turn over within days, weeks or months? An interaction between two proteins points to a molecular basis for memory.", "url": "https://www.quantamagazine.org/the-molecular-bond-that-helps-secure-your-memories-20250507/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2025/05/MolecularMemory_crCarlos-Arrojo-Social.jpg", "publishedAt": "2025-05-07T13:52:10Z", "content": "To find out if KIBRA and PKM work together in response to synaptic activity, the researchers used a technique that makes interacting proteins glow. When they applied electrical pulses to hippocampal … [+4215 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "A Particle Originating From the Edge of the Universe Detected at the Bottom of the Mediterranean Sea - The Daily Galaxy", "description": "This rare event could unlock new mysteries of the universe. What scientists uncovered could change everything we know about neutrinos.", "url": "https://dailygalaxy.com/2025/05/a-particle-originating-from-the-edge-of-the-universe-detected-at-the-bottom-of-the-mediterranean-sea/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/05/A-Completed-Digital-Optical-Module.jpg", "publishedAt": "2025-05-07T11:45:00Z", "content": "In an unprecedented breakthrough, scientists have detected a neutrino with the highest energy ever recorded, deep in the Mediterranean Sea. This discovery could provide vital clues to understanding t… [+2795 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Resilience lunar lander enters orbit around the moon - SpaceNews", "description": "Japanese company ispace says its second lunar lander in now in orbit around the moon ahead of a landing attempt in early June.", "url": "http://spacenews.com/resilience-lunar-lander-enters-orbit-around-the-moon/", "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNFwvMDlcL2lzcGFjZS1tMmxhbmRlci0xMDI0eDgzMS5qcGciLCJ0eHQiOiJSZXNpbGllbmNlIGx1bmFyIGxhbmRlciBlbnRlcnMgb3JiaXQgYXJvdW5kIHRoZSBtb29uIiwidGVtcGxhdGUiOiJmdWxsc2NyZWVuIiwiYmxvZ19pZCI6ODA2ODE5Nzl9.Q5g0cwJS7wTFK7nb8I9OHYVv5UCWXcG6CZG0EICESmwMQ", "publishedAt": "2025-05-07T11:32:00Z", "content": "WASHINGTON Japanese company ispace says its second lunar lander in now in orbit around the moon ahead of a landing attempt in early June.\r\nThe company announced May 6 its Resilience lunar lander ente… [+3352 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rose Nigam", "title": "10 animals that live today but have dinosaur traits - Times of India", "description": "​Though dinosaurs vanished 66 million years ago, their legacy lives on. Common traits include armoured bodies, sharp claws and beaks. And some modern animals still carry these traits that link them to their past. Here are 10 living creatures that share dinosa…", "url": "https://timesofindia.indiatimes.com/life-style/spotlight/web-stories/10-animals-that-live-today-but-have-dinosaur-traits/photostory/120961647.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-120961672,imgsize-83488,width-900,height-1200,resizemode-6/120961672.jpg", "publishedAt": "2025-05-07T11:30:00Z", "content": "With long claws, muscular bodies, and sharp teeth, monitor lizards, much like the Komodo dragon, resemble mini carnivorous dinosaurs. Their predatory behaviour and build make them similar to ancient … [+8 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "iain.todd@ourmedia.co.uk", "title": "The end of life on Earth? It's when our planet runs out of oxygen, and scientists have worked out how long we've got - BBC Sky at Night Magazine", "description": "When will Earth run out of oxygen? Scientists have determined the most likely caused of the end of life on Earth, and how long we've got.", "url": "https://www.skyatnightmagazine.com/news/earth-run-out-of-oxygen", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2025/05/earth-oxygen.jpg?w=1200", "publishedAt": "2025-05-07T08:55:12Z", "content": "For obvious reasons, it's impossible to imagine life on Earth without oxygen. But will it ever run out? And if so, how long will our planet continue to have oxygen?\r\nThere are a few scenarios in whic… [+5043 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Forest satellite’s big antenna opens up - European Space Agency", "description": "Just a week after its launch, ESA’s Biomass mission has reached another critical milestone on its path to delivering unprecedented insights into the world’s forests and their vital role in Earth’s carbon cycle – the satellite’s 12-metre-diameter antenna is no…", "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/Biomass/Forest_satellite_s_big_antenna_opens_up", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/05/biomass_antenna_opens/26690929-1-eng-GB/Biomass_antenna_opens_pillars.gif", "publishedAt": "2025-05-07T08:52:29Z", "content": "Applications07/05/20256792 views78 likes\r\nJust a week after its launch, ESAs Biomass mission has reached another critical milestone on its path to delivering unprecedented insights into the worlds fo… [+3428 chars]"}]}