{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Dark Energy experiment shakes Einstein's theory of Universe - BBC.com", "description": "New research could force a fundamental rethink of the nature of space and time.", "url": "https://www.bbc.com/news/articles/c4geldjjge0o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1377/live/f5841cd0-0038-11f0-b50e-9d086302645f.jpg", "publishedAt": "2025-03-19T21:59:12Z", "content": "The force that is pushing galaxies away from each other is not behaving the way it should\r\nThe mysterious force called Dark Energy, which drives the expansion of the Universe, might be changing in a … [+4226 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Jessica Stoya", "title": "Marriage advice: I have to get buzzed in order to sleep with my wife. - Slate", "description": "Maybe she needs to know the truth.", "url": "https://slate.com/advice/2025/03/marriage-advice-drinking-alcohol-appearance.html", "urlToImage": "https://compote.slate.com/images/ec38d76e-48dc-4f17-beb3-9d67d15bd37d.gif?crop=1560%2C1040%2Cx0%2Cy0&width=1560", "publishedAt": "2025-03-19T18:32:00Z", "content": "How to Do It is Slates sex advice column. Have a question? Send it to Jessica and Rich here. Its anonymous!\r\nDear How to Do It,\r\nMy wife and I are in our mid-40s, and while neither of us is what we u… [+11233 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Webb Telescope’s First-Ever Exoplanet CO2 Discovery Stuns Scientists, NASA Says - The Daily Galaxy --Great Discoveries Channel", "description": "The James Webb Space Telescope has made a groundbreaking discovery, capturing images of exoplanets that have left scientists in awe. For the first time, CO2 has been detected in their atmospheres—unlocking new clues about how distant planets form.", "url": "https://dailygalaxy.com/2025/03/webb-telescopes-first-ever-exoplanet-co2-discovery-stuns-scientists-nasa-says/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Webb-Telescopes-First-Ever-Exoplanet-CO2-Discovery-Stuns-Scientists-NASA-Says.jpg", "publishedAt": "2025-03-19T18:30:00Z", "content": "The James Webb Space Telescope (JWST) has achieved a groundbreaking feat by directly observing carbon dioxide (CO2) in the atmospheres of exoplanets for the very first time. Announced by NASA on Marc… [+2647 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Moon’s Far Side Was a Massive Magma Ocean, Chinese Scientists Reveal! - The Daily Galaxy --Great Discoveries Channel", "description": "China’s Chang'e 6 mission has uncovered surprising details about the moon’s volcanic past. Could the far side hold the key to unlocking the moon's secrets?", "url": "https://dailygalaxy.com/2025/03/moons-far-side-was-a-massive-magma-ocean/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/03/Moons-Far-Side-Was-a-Massive-Magma-Ocean-Chinese-Scientists-Reveal.jpg", "publishedAt": "2025-03-19T18:00:00Z", "content": "In a groundbreaking revelation, recent lunar samples brought back by Chinas Chang’e 6 mission have confirmed a crucial piece of the moon’s early geological history. These findings offer a glimpse int… [+2421 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Emma Burleigh", "title": "The Boeing Starliner astronauts have returned to Earth after nine long months stuck in space—but their $150,000 salary won’t come with overtime - Fortune", "description": "In comparison, bankers in New York make an average of $111,000 annually, without the risk of being exposed to an indefinite stay in dark, noiseless, uninhabited space.", "url": "https://fortune.com/2025/03/19/boeing-starliner-astronauts-six-figure-salary-overtime-compensation-job-risks/", "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/03/GettyImages-2155551333-e1742400635854.jpg?resize=1200,600", "publishedAt": "2025-03-19T16:26:00Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Lunar Lander Captures First High-Definition Video of a Sunset on the Moon - Gizmodo", "description": "Firefly's Blue Ghost watched the Sun setting on the Moon's horizon before powering down.", "url": "https://gizmodo.com/lunar-lander-captures-first-high-definition-video-of-a-sunset-on-the-moon-2000578051", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/Blue-Ghost-Lunar-Sunset.jpg", "publishedAt": "2025-03-19T16:05:55Z", "content": "The Blue Ghost lander bid farewell to the Moon by gently going into that cold lunar night. Before ending its mission on the lunar surface, Blue Ghost watched a beautiful sunset, capturing the glow of… [+2775 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "4 miniature, Earth-like planets discovered extremely close to our sun - Livescience.com", "description": "A quartet of small, rocky exoplanets likely circle Barnard's Star, around 6 billion light-years from Earth, putting them in contention as targets of missions for future human generations.", "url": "https://www.livescience.com/space/exoplanets/4-tiny-earth-like-planets-found-circling-2nd-closest-star-system-to-us-and-could-be-visited-by-future-human-generations", "urlToImage": "https://cdn.mos.cms.futurecdn.net/trTJYGMFEGyFbV6Kv2fieN-1200-80.jpg", "publishedAt": "2025-03-19T15:41:24Z", "content": "A quartet of Earth-like worlds, each about 20% to 30% the size of our planet, circle one of our closest stellar neighbors, a new study reveals. The rocky alien worlds are close enough that future gen… [+4759 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "National Radio Astronomy Observatory", "title": "Astronomers discover 'space tornadoes' around the Milky Way's core - Phys.org", "description": "Swirling through the Milky Way's central zone, in the turbulent region surrounding the supermassive black hole at the core of our galaxy, dust and gases constantly churn as energetic shock waves ripple throughout. An international team of astronomers using th…", "url": "https://phys.org/news/2025-03-astronomers-space-tornadoes-milky-core.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/astronomers-discover-s-1.jpg", "publishedAt": "2025-03-19T14:33:04Z", "content": "Swirling through the Milky Way's central zone, in the turbulent region surrounding the supermassive black hole at the core of our galaxy, dust and gases constantly churn as energetic shock waves ripp… [+5633 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Euclid opens data treasure trove, offers glimpse of deep fields - European Space Agency", "description": "On 19 March 2025, the European Space Agency’s Euclid mission released its first batch of survey data, including a preview of its deep fields. Here, hundreds of thousands of galaxies in different shapes and sizes take centre stage and show a glimpse of their l…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/Euclid_opens_data_treasure_trove_offers_glimpse_of_deep_fields", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/03/euclid_deep_field_south_16x_zoom/26614892-1-eng-GB/Euclid_Deep_Field_South_16x_zoom_pillars.jpg", "publishedAt": "2025-03-19T11:01:45Z", "content": "Science &amp; Exploration19/03/20253046 views15 likes\r\nOn 19 March 2025, the European Space Agencys Euclid mission released its first batch of survey data, including a preview of its deep fields. Her… [+10729 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sascha Pare", "title": "This is what Antarctica looks like under the ice in most-detailed ever map of the continent - Livescience.com", "description": "Bedmap3 is the most fine-grain map to date of the landscape beneath Antarctica's ice. Scientists created it using more than 60 years' worth of data from satellites, ships and dog-drawn sleds.", "url": "https://www.livescience.com/planet-earth/antarctica/scientists-create-new-map-showing-ice-free-antarctica-in-more-detail-than-ever-before", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ismNyFudcDKefFRpUiX4V7-1200-80.png", "publishedAt": "2025-03-19T10:56:07Z", "content": "Scientists have unveiled the most detailed map yet of the landscape hidden beneath Antarctica's ice.\r\nThe high-resolution map reveals what the frozen continent looks like beneath its miles-thick blan… [+3762 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Where To See 2025’s First Solar Eclipse Next Week - Forbes", "description": "The first solar eclipse in 2025 will be visible from Canada, the northeastern U.S., Europe and Africa. Here’s where and when to see it at its best.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/03/19/where-to-see-2025s-first-solar-eclipse-from-north-america-to-europe-and-africa/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67bef2774d37bf73e5e44fac/0x0.jpg?format=jpg&crop=1024,576,x0,y111,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-03-19T10:00:00Z", "content": "The first solar eclipse of 2025 will take place at sunrise on Saturday, March 29, with eastern Canada, the northeastern U.S., Europe and Africa all in the path. A deep partial eclipse will be seen fr… [+3423 chars]"}, {"source": {"id": null, "name": "Earthday.org"}, "author": "Dory Miller", "title": "14 Bizarre Consequences of Climate Change (Because Sometimes, You Just Have to Laugh) - Earth Day", "description": "Climate change is no joke — except when it is! From sex-changing lizards to longer sneeze seasons, explore some of the weirdest side effects of global warming.", "url": "https://www.earthday.org/14-bizarre-consequences-of-climate-change-because-sometimes-you-just-have-to-laugh/", "urlToImage": "https://www.earthday.org/wp-content/uploads/2025/03/250318_laugh-1024x576.png", "publishedAt": "2025-03-19T08:38:44Z", "content": "Lets face it grappling with the reality of climate change is no easy feat. At this point, the best coping mechanism might just be laughing through what feels like impending doom. Science even backs t… [+4979 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "'Big Wheel' Version of The Milky Way Discovered in Fortunate Finding - ScienceAlert", "description": "Deep observations from the James Webb Space Telescope (JWST) have revealed an exceptionally large galaxy in the early universe.", "url": "https://www.sciencealert.com/big-wheel-version-of-the-milky-way-discovered-in-fortunate-finding", "urlToImage": "https://www.sciencealert.com/images/2025/03/TheBigWheelGalaxy.png", "publishedAt": "2025-03-19T00:06:10Z", "content": "Deep observations from the James Webb Space Telescope (JWST) have revealed an exceptionally large galaxy in the early universe. It's a cosmic giant whose light has travelled over 12 billion years to … [+4724 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Jess Cockerill", "title": "New Heavy Metal Molecule Could Reveal What Goes on Inside Nuclear Waste - ScienceAlert", "description": "Since it was first synthesized in a post-WW2 American lab in 1949, berkelium has been a rebel of the periodic table, defying quantum mechanics and taking on an extra positive charge that its relatives would never.", "url": "https://www.sciencealert.com/new-heavy-metal-molecule-could-reveal-what-goes-on-inside-nuclear-waste", "urlToImage": "https://www.sciencealert.com/images/2025/03/radioactive-sign.jpg", "publishedAt": "2025-03-18T19:01:50Z", "content": "Since it was first synthesized in a post-WW2 American lab in 1949, berkelium has been a rebel of the periodic table, defying quantum mechanics and taking on an extra positive charge that its relative… [+3499 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Breakthrough DNA Analysis Reveals Everyone on Earth Shares Genes from Two Ancient Populations - Study Finds", "description": "Cambridge University researchers have uncovered evidence that two distinct populations of ancient hominins, separated for over a million years, before reuniting around 300,000 years ago. It's a missing chapter of evolution that left its mark in the DNA of eve…", "url": "https://studyfinds.org/ancient-dna-analysis-humans-share-genes/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/09/AdobeStock_119701698-scaled.jpeg", "publishedAt": "2025-03-18T17:38:39Z", "content": "Human evolution (© adrenalinapura - stock.adobe.com)\r\n<ul><li>All modern humans share DNA from two ancient populations that split 1.5 million years ago and reunited through interbreeding about 300,00… [+11481 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": null, "title": "Astronomers Think They've Found a Reliable Biosignature. But There's a Catch - Universe Today", "description": "The search for life has become one of the holy grails of science. With the increasing number of exoplanet discoveries, astronomers are hunting for a chemical that can only be present in the atmosphere of a planet with life! A new paper suggests that methyl ha…", "url": "https://www.universetoday.com/articles/astronomers-think-theyve-found-a-reliable-biosignature-but-theres-a-catch", "urlToImage": "https://www.universetoday.com/assets/exoplanet_riverside.jpeg", "publishedAt": "2025-03-18T16:34:07Z", "content": "The search for life has become one of the holy grails of science. With the increasing number of exoplanet discoveries, astronomers are hunting for a chemical that can only be present in the atmospher… [+3430 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Princeton University", "title": "Clearest images yet of 380,000-year-old universe reveal cosmic infancy - Phys.org", "description": "New research by the Atacama Cosmology Telescope (ACT) collaboration has produced the clearest images yet of the universe's infancy—the earliest cosmic time yet accessible to humans. Measuring light that traveled for more than 13 billion years to reach a teles…", "url": "https://phys.org/news/2025-03-clearest-images-year-universe-reveal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-high-definition-pi.jpg", "publishedAt": "2025-03-18T16:28:05Z", "content": "New research by the Atacama Cosmology Telescope (ACT) collaboration has produced the clearest images yet of the universe's infancythe earliest cosmic time yet accessible to humans. Measuring light th… [+10558 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chinese Academy of Sciences", "title": "Unveiling the mysterious 'red sprite' lightning strikes over the Himalayas - Phys.org", "description": "Have you ever heard of—or even seen—red lightning? These are not animated characters but real atmospheric phenomena known as electrical discharges that occur high above thunderstorms. Scientists refer to them as \"red sprites,\" named for their jellyfish-like a…", "url": "https://phys.org/news/2025-03-unveiling-mysterious-red-sprite-lightning.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/unveiling-the-mysterio.jpg", "publishedAt": "2025-03-18T15:47:26Z", "content": "Have you ever heard ofor even seenred lightning? These are not animated characters but real atmospheric phenomena known as electrical discharges that occur high above thunderstorms. Scientists refer … [+3554 chars]"}, {"source": {"id": null, "name": "Supercarblondie.com"}, "author": "https://facebook.com/alessandro.renesis", "title": "NASA's James Webb Space Telescope may have just proven our entire universe is actually inside a black hole - Supercar Blondie", "description": "Thanks to the super powerful James Webb Space Telescope, NASA may have discovered evidence to support a long-held theory about our universe", "url": "https://supercarblondie.com/nasa-james-webb-space-telescope-black-hole-universe/", "urlToImage": "https://supercarblondie.com/wp-content/uploads/James-Webb-telescope-hero-image-1.webp", "publishedAt": "2025-03-18T15:11:00Z", "content": "A new research conducted by NASA with the James Webb Space Telescope has revealed new evidence about our universe.\r\nSome scientists have long theorized that our universe might be residing within a bl… [+2146 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Before-and-After Satellite Images Show Upsetting Glacier Loss in Swiss Alps - Gizmodo", "description": "NASA's Landsats captured views of a Swiss glacier 40 years apart, showing how a warming world has reduced its footprint.", "url": "https://gizmodo.com/before-and-after-satellite-images-show-upsetting-glacier-loss-in-swiss-alps-2000576116", "urlToImage": "https://gizmodo.com/app/uploads/2025/03/glacier-melt-swiss-alps.jpg", "publishedAt": "2025-03-18T14:15:29Z", "content": "The European Alps cover over 600 miles (1,000 kilometers) across eight European countries, and their cooler upper climes contain thousands of glaciers. Unfortunately, NASA satellite imagery recently … [+2210 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "New planet named Enaiposha is unlike anything in our solar system - Earth.com", "description": "A distant exoplanet discovered, named Enaiposha, is unlike anything found in our own solar system, similar to a \"super-Venus\"", "url": "https://www.earth.com/news/new-planet-named-enaiposha-is-unlike-anything-in-our-solar-system/", "urlToImage": "https://cff2.earth.com/uploads/2025/03/18072736/super-venus_Enaiposha_GJ-1214b_credit-NASA_1m.jpg", "publishedAt": "2025-03-18T13:31:10Z", "content": "It started as another exoplanet in a group labeled “ordinary.” No one expected that a world, once thought to be a mini-Neptune, would reveal traits of a super-Venus and change how we see certain plan… [+4791 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Space Station Visitors Greeted With Wild Sight When They Open Hatch - Futurism", "description": "After docking with the ISS, the latest crew visiting the orbital outpost were greeted by a cosmonaut wearing an alien mask.", "url": "https://futurism.com/cosmonaut-alien-mask-space-station", "urlToImage": "https://wordpress-assets.futurism.com/2025/03/russian-cosmonaut-alien-mask-open-airlock-nasa-visitors-2.jpg", "publishedAt": "2025-03-18T12:50:30Z", "content": "After docking with the International Space Station, the latest crew visiting the orbital outpost were met with a startling sight.\r\nSpecifically, Russian cosmonaut Ivan Vagner greeted them while weari… [+1692 chars]"}, {"source": {"id": null, "name": "Aeon.co"}, "author": "Rebekah Wallace", "title": "Why physics today stands on the wings of angels and demons - Aeon", "description": "When medieval scholars sought to understand the nature of angels, they unwittingly laid the foundations of modern physics", "url": "https://aeon.co/essays/why-physics-today-stands-on-the-wings-of-angels-and-demons", "urlToImage": "https://images.aeonmedia.co/images/3792982b-7d18-4310-93e3-6d1813a08338/essay-9d79f89e-9024-4546-8b93-6b5fb448f932_3771.jpg?width=1200&quality=75&format=auto", "publishedAt": "2025-03-18T10:00:38Z", "content": "What do the angelic forces of the Heavenly Host have to do with orgasms? The answer, according to the 12th-century philosopher and theologian Maimonides, was simple. Some invisible forces that caused… [+19983 chars]"}]}