{"status": "ok", "totalResults": 45, "articles": [{"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Updates Coverage for Europa Clipper Following Hurricane Milton - NASA Jet Propulsion Laboratory", "description": "Find details on teleconferences with mission members and NASA leadership, the launch preview, and the live launch broadcast.", "url": "http://www.jpl.nasa.gov/news/nasa-updates-coverage-for-europa-clipper-following-hurricane-milton/", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1-PIA24321_existing_PIA.jpg", "publishedAt": "2024-10-13T01:07:33Z", "content": "NASA will provide live coverage of prelaunch and launch activities for Europa Clipper, the agencys mission to explore Jupiters icy moon Europa. NASA now is targeting launch no earlier than 12:06 p.m.… [+3902 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Neal Riley", "title": "Rare comet may be visible to naked eye. Here's where to look. - CBS Boston", "description": "Comet Tsuchinshan-ATLAS has an 80,000 year orbit and, it just so happens, that it is now approaching its closest pass to Earth.", "url": "https://www.cbsnews.com/boston/news/comet-visible-tonight-how-to-watch/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/10/10/3b742f4d-a473-472d-a795-9e09d29ec116/thumbnail/1200x630/02588aa78940a0de23d3c4afbe0981ad/comet-getty.jpg?v=29b5ccc4d237d9b284ce95a42effd073", "publishedAt": "2024-10-12T20:54:00Z", "content": "BOSTON - It isn't often that we get the chance to see a comet with the naked eye. But, in a year already filled with so many astronomical treats, it looks like we will be able to add a comet to the l… [+3036 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists created organisms in a lab that exist in a ‘third state’ beyond life and death - BGR", "description": "Scientists have created a new type of organism that transcends the states of life and death. Here's what we know.", "url": "https://bgr.com/science/scientists-created-organisms-in-a-lab-that-exist-in-a-third-state-beyond-life-and-death/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/03/AdobeStock_574737414.jpeg?quality=82&strip=all", "publishedAt": "2024-10-12T18:10:00Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX's Crew-8 astronauts to depart ISS for trip home on Oct. 13 - Space.com", "description": "Crew-8 is scheduled to undock from the ISS at 7:05 a.m. ET on Sunday (Oct. 13).", "url": "https://www.space.com/spacex-crew-8-astronauts-return-earth-webcast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XkMuf4ToqW7FGniezZ2JxE-1200-80.jpg", "publishedAt": "2024-10-12T18:09:13Z", "content": "SpaceX's Crew-8 astronaut mission begin the trip home to Earth Sunday morning (Oct. 13), and you can watch the action live.\r\nCrew-8's Dragon capsule, named Endeavour, is scheduled to undock from the … [+2192 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Adam Hadhazy", "title": "Ancient climate analysis reveals unknown global processes - Phys.org", "description": "According to highly cited conventional models, cooling and a major drop in sea levels about 34 million years ago should have led to widespread continental erosion and deposited gargantuan amounts of sandy material onto the ocean floor. This was, after all, on…", "url": "https://phys.org/news/2024-10-ancient-climate-analysis-reveals-unknown.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/ancient-climate-analys.jpg", "publishedAt": "2024-10-12T15:40:01Z", "content": "According to highly cited conventional models, cooling and a major drop in sea levels about 34 million years ago should have led to widespread continental erosion and deposited gargantuan amounts of … [+6903 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "Top-secret X-37B space plane ready for daring new orbital maneuver - The Register", "description": "The Space Force craft will attempt aerobraking for the first time", "url": "https://www.theregister.com/2024/10/12/x37b_space_plane/", "urlToImage": "https://regmedia.co.uk/2024/10/11/x-37b-aerobrake-maneuver-render.jpg", "publishedAt": "2024-10-12T15:24:00Z", "content": "After nearly a year in orbit, the US Space Force's secretive X-37B is prepped to perform some fancy new maneuvers to alter its orbit and dump its service module before carrying on with more mysteriou… [+3018 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Strain", "title": "'Killer electrons': Lightning storms play cosmic pinball with space weather - Phys.org", "description": "When lightning strikes, the electrons come pouring down. In a new study, researchers at the University of Colorado Boulder, led by an undergraduate student, have discovered a novel connection between weather on Earth and space weather. The team utilized satel…", "url": "https://phys.org/news/2024-10-killer-electrons-lightning-storms-play.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/lightning-strikes-kick-1.jpg", "publishedAt": "2024-10-12T15:11:54Z", "content": "When lightning strikes, the electrons come pouring down. In a new study, researchers at the University of Colorado Boulder, led by an undergraduate student, have discovered a novel connection between… [+5639 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Christopher Plain, Christopher Plain", "title": "James Webb Space Telescope Peers 13 Billion Years into the Past and Spots an Unusual ‘Inside-Out’ Galaxy - The Debrief", "description": "The James Webb Space Telescope has peered 13 billion years into the past and spotted an ancient inside-out galaxy.", "url": "https://thedebrief.org/james-webb-space-telescope-peers-13-billion-years-into-the-past-and-spots-an-unusual-inside-out-galaxy/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2024/10/resize-JWST_JADES.jpg", "publishedAt": "2024-10-12T15:01:19Z", "content": "Scientists using the James Webb Space Telescope have spotted an inside-out galaxy that formed around 13 billion years ago. Like a large city, the galaxy has its densest collection of stars at its cor… [+5483 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "Gravity can exist without mass and dark matter could be myth, says study - Interesting Engineering", "description": "A new study challenges the existence of dark matter, proposing that gravity can arise from 'topological defects' in spacetime.", "url": "https://interestingengineering.com/science/gravity-exists-without-mass", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/gravity-without-mass.jpg", "publishedAt": "2024-10-12T13:40:00Z", "content": "These defects might appear as long, linear formations called cosmic strings, or as flat, shell-like shapes.\r\nThe shells in my paper consist of a thin inner layer of positive mass and a thin outer lay… [+855 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: All that sparkles is plastic; woke tree diversity; the gravitational basin in which we reside - Phys.org", "description": "This week, astronomers considered whether dark energy varies over cosmic timescales. Via neutron analysis, physicists revealed that some Early Iron Age swords were altered recently by swindlers in order to be more historically exciting. And a professor in New…", "url": "https://phys.org/news/2024-10-saturday-citations-plastic-woke-tree.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/saturday-citations-all.jpg", "publishedAt": "2024-10-12T13:00:02Z", "content": "This week, astronomers considered whether dark energy varies over cosmic timescales. Via neutron analysis, physicists revealed that some Early Iron Age swords were altered recently by swindlers in or… [+5257 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Skyquakes : mysterious booms from above remain unexplained worldwide - The Daily Galaxy --Great Discoveries Channel", "description": "For centuries, mysterious sounds echoing from the sky have puzzled people worldwide. These unexplained phenomena, known as skyquakes, continue to baffle scientists and researchers alike. Despite technological advancements and numerous hypotheses, the true nat…", "url": "https://dailygalaxy.com/2024/10/skyquakes-mysterious-booms-remain-unexplained-worldwide/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/skyquakes-mysterious-booms-remain-unexplained-worldwide.jpg", "publishedAt": "2024-10-12T12:39:00Z", "content": "Skyquakes are unexplained acoustic phenomena characterized by loud, explosive sounds seemingly originating from the sky. These mysterious noises have been reported in various parts of the world, incl… [+5227 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Maggie Harrison Dupré", "title": "James Webb Spots First-Ever Alien “Steam World” - Futurism", "description": "The James Webb Space Telescope was used to spot a new kind of alien planet: a watery \"steam world\" with an atmosphere of hot water vapor.", "url": "https://futurism.com/the-byte/james-webb-alien-steam-world", "urlToImage": "https://wordpress-assets.futurism.com/2024/10/james-webb-alien-steam-world.jpg", "publishedAt": "2024-10-12T11:30:01Z", "content": "\"This is the first time were ever seeing something like this.\"\r\nFull Steam Ahead\r\nNASA's James Webb Space Telescope (JWST) was used to spot a completely new kind of alien planet: a watery, far-off \"s… [+2495 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA spacecraft flies over gullies on Mars. They could host pools. - Mashable", "description": "\"Excellent places to search for life.\"", "url": "https://mashable.com/article/mars-nasa-water-gullies-image", "urlToImage": "https://helios-i.mashable.com/imagery/articles/04fFvMCQQDlWukMRxQcByss/hero-image.fill.size_1200x675.v1728587372.jpg", "publishedAt": "2024-10-12T09:00:00Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Scientists crack the code, reveal what transported seeds of life to Earth - WION", "description": "How did life emerge on Earth? The age-old question has intrigued experts for years and now a study has hinted that rocky guests who visit us frequently might have carried the seeds of life. \n\nMeteorites likely brought the building blocks of life to the primor…", "url": "https://www.wionews.com/science/scientists-crack-the-code-reveal-what-transported-seeds-of-life-to-earth-766842", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/10/12/459802-columbus-1.png", "publishedAt": "2024-10-12T08:52:51Z", "content": "How did life emerge on Earth? The age-old question has intrigued experts for years and now a study has hinted that rocky guests who visit us frequently might have carried the seeds of life. \r\nMeteori… [+2743 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jupiter’s Great Red Spot Enigma: Unexplained Oscillations Baffle Astronomers - SciTechDaily", "description": "Jupiter's Titanic Storm Wiggles Like a Plate of Gelatin Jupiter's birthmark is an unbelievably huge storm that’s mysteriously crimson red in color. It looks like a bloodshot cycloptic eye staring back at Earth. The anticyclone churns along a southern mid-lati…", "url": "https://scitechdaily.com/?p=422253", "urlToImage": "https://scitechdaily.com/images/Voyager-Jupiter-Great-Red-Spot.jpg", "publishedAt": "2024-10-12T08:19:54Z", "content": "Hubble’s new observations reveal that Jupiter’s Great Red Spot is not as stable as it appears, showing unexpected size oscillations and varying speeds, challenging existing theories on planetary stor… [+7651 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Lee Mohon", "title": "Black Hole Destroys Star, Goes After Another, NASA Missions Find - NASA", "description": "NASA’s Chandra X-ray Observatory and other telescopes have identified a supermassive black hole that has torn apart one star and is now using that stellar", "url": "https://www.nasa.gov/image-article/black-hole-destroys-star-goes-after-another-nasa-missions-find/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2024/10/tde-crunched.jpg", "publishedAt": "2024-10-12T07:48:27Z", "content": "NASAs Chandra X-ray Observatory and other telescopes have identified a supermassive black hole that has torn apart one star and is now using that stellar wreckage to pummel another star or smaller bl… [+5452 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Rebecca Husselbee", "title": "Inside Nasa’s plan to stop dinosaur-killing asteroids wiping out Earth by unleashing 1,000 spacecraft – or... - The US Sun", "description": "NASA plans to blast “planet killer” asteroids with a 1,000-strong army of spacecraft – or even a nuke. The space agency boffins have been quietly simulating a response to an out-o…", "url": "https://www.the-sun.com/tech/12658264/nasa-asteroids-spacecraft-nuke/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2024/10/image_d1b129.jpe?strip=all&quality=100&w=960&h=539&crop=1", "publishedAt": "2024-10-12T06:55:36Z", "content": "NASA plans to blast \"planet killer\" asteroids with a 1,000-strong army of spacecraft - or even a nuke. \r\nThe space agency boffins have been quietly simulating a response to an out-of-space strike whi… [+8039 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Unveil the Deadly Secret of Black Widow Venom - SciTechDaily", "description": "Cryo-EM and MD simulations reveal the mechanism by which the potent neurotoxin α-latrotoxin forms calcium-permeable membrane pores. The black widow spider is one of the most feared spider species. Its venom is a cocktail of seven different toxins that attack …", "url": "https://scitechdaily.com/scientists-unveil-the-deadly-secret-of-black-widow-venom/", "urlToImage": "https://scitechdaily.com/images/Black-Widow-Spider-1.jpg", "publishedAt": "2024-10-12T03:09:35Z", "content": "The black widow spider’s α-latrotoxin disrupts nerve signaling by creating a calcium channel in nerve cells, causing muscle spasms. Research from the University of Münster revealed its complex mechan… [+3886 chars]"}, {"source": {"id": null, "name": "The Detroit News"}, "author": null, "title": "MI Dream Home: Midland mid-20th century was designed by Dow scion - Detroit News", "description": "Huge Savings: Subscribe today to enjoy sports, entertainment, life, money, tech, and travel news along with videos, apps, and more.", "url": "https://www.detroitnews.com/story/business/real-estate/2024/10/11/mi-dream-home-midland-mid-20th-century-was-designed-by-dow-scion/75583335007/", "urlToImage": "https://staticassets.gannettdigital.com/gci-static-assets/assets/global/checkout/meta-generic.png", "publishedAt": "2024-10-12T03:08:24Z", "content": null}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "FAA clears SpaceX to resume Falcon 9 rocket launches - Yahoo! Voices", "description": "The U.S. Federal Aviation Administration announced on Friday (Oct. 11) that it has given SpaceX the green light to resume launches of its workhorse Falcon 9 ...", "url": "https://www.space.com/faa-clears-spacex-resume-falcon-9-rocket-launches-october-2024", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/OL86s4xwtcMy.c6snSuuMQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/space_311/e39d0c75efb4519eb723cbc48c4013d2", "publishedAt": "2024-10-12T00:48:00Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nA Falcon 9 rocket launches SpaceX's Crew-9 astronaut mission to the International Space Station… [+2242 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "The Next Full Moon is a Supermoon, and the Hunter’s Moon - Science@NASA", "description": "The next full Moon will be Thursday morning, Oct. 17, 2024, at 7:26 a.m. EDT. This will be the third of four consecutive supermoons.", "url": "https://science.nasa.gov/solar-system/skywatching/the-next-full-moon-is-a-supermoon-and-the-hunters-moon/", "urlToImage": "https://science.nasa.gov/wp-content/uploads/2023/06/49641911586_4d26910aba_supermoon_March_2020-1280-jpg.webp?w=1024", "publishedAt": "2024-10-11T23:08:26Z", "content": "Friday morning, November 1, at 8:47 AM EDT: This will be the new Moon, when the Moon passes between the Earth and the Sun and will not be visible from the Earth. This new Moon is considered the darke… [+757 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "'Stunning was the word': Astronauts snap amazing aurora photo from ISS during severe geomagnetic storm - Space.com", "description": "'We were not flying above the aurora; we were flying in the aurora. And it was blood red.'", "url": "https://www.space.com/nasa-astronauts-supercharged-red-auroras-iss-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eJy4dqretMgpmV9JXPize8-1200-80.jpg", "publishedAt": "2024-10-11T21:50:32Z", "content": "The auroras were pretty special on Thursday night (Oct. 10) — especially if you got to see them from orbit.\r\nNASA astronauts Don Pettit and Matthew Dominick are in that very exclusive club, getting a… [+3566 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Researchers Unveil Haunting Sound of Earth’s Magnetic Reversal 41,000 Years Ago - The Daily Galaxy --Great Discoveries Channel", "description": "Scientists have recreated the eerie sound of Earth’s magnetic field flip from 41,000 years ago, using data from ESA’s Swarm mission. This geomagnetic reversal, known as the Laschamp event, saw Earth’s magnetic field weaken dramatically, allowing more cosmic r…", "url": "https://dailygalaxy.com/2024/10/sound-earths-magnetic-reversal-41000-years/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/Researchers-Unveil-Haunting-Sound-of-Earths-Magnetic-Reversal-41000-Years-Ago.jpg", "publishedAt": "2024-10-11T21:28:18Z", "content": "Researchers have recreated the eerie sound of Earth's magnetic reversal during the Laschamp event, a geomagnetic reversal that occurred 41,000 years ago. Using data from ESAs Swarm mission, scientist… [+4445 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA reveals damage on Curiosity rover after 12 years on Mars - The Daily Galaxy --Great Discoveries Channel", "description": "The Curiosity rover, NASA's intrepid explorer on Mars, has been diligently roaming the Red Planet's surface for over a decade. Recent images released by the space agency reveal the toll of this extended mission on the vehicle's hardware, particularly its whee…", "url": "https://dailygalaxy.com/2024/10/nasa-reveals-damage-curiosity-rover-12-years-mars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/10/nasa-reveals-damage-curiosity-rover-12-years-mars.jpg", "publishedAt": "2024-10-11T20:41:00Z", "content": "Since its landing in August 2012, Curiosity has been on a relentless quest to uncover evidence of past microbial life on Mars. The rover's primary mission focuses on analyzing the planet's geology an… [+4485 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Britt Jones", "title": "Cosmonaut told to immediately leave area after discovering blob growing outside International Space Station - UNILAD", "description": "Russian cosmonaut Oleg Kononenko was told to leave after discovering a blob outside of the International Space Station during a spacewalk", "url": "https://www.unilad.com/technology/space/cosmonaut-oleg-kononenko-blob-coolant-iss-076402-20241011", "urlToImage": "https://images.ladbible.com/resize?type=webp&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/blt949ea8e16e463049/bltd5253e02eba75a18/67097666eecec6ed4ad2682b/space-station-blob-nasa.jpg", "publishedAt": "2024-10-11T19:59:24Z", "content": "This is the story of a cosmonaut who discovered a 'blob' just outside of the International Space Station.\r\nA blob? In space? You'd better believe it.\r\nWhile many might conjure up the image of Robin W… [+2733 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Institute of Science and Technology Austria", "title": "Evolution in real time: Scientists predict—and witness—evolution in a 30-year marine snail experiment - Phys.org", "description": "Snails on a tiny rocky islet evolved before scientists' eyes. The marine snails were reintroduced after a toxic algal bloom wiped them out from the skerry. While the researchers intentionally brought in a distinct population of the same snail species, these e…", "url": "https://phys.org/news/2024-10-evolution-real-scientists-witness-year.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/evolution-in-real-time.jpg", "publishedAt": "2024-10-11T18:00:01Z", "content": "Snails on a tiny rocky islet evolved before scientists' eyes. The marine snails were reintroduced after a toxic algal bloom wiped them out from the skerry. While the researchers intentionally brought… [+7194 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hints of volcanic moon around alien planet may be 1st-of-its-kind discovery (video) - Space.com", "description": "\"Detecting an exomoon would be quite extraordinary, and because of Io, we know that a volcanic exomoon is possible.\"", "url": "https://www.space.com/possible-volcanic-exomoon-jupiter-moon-io", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ycJvyjwxxFe9aHKSMUQGE-1200-80.jpg", "publishedAt": "2024-10-11T17:30:57Z", "content": "Scientists have found new evidence of a potentially volcanic moon orbiting a planet beyond our solar system. \r\nOur solar system\r\n contains the most volcanic object in the known universe: the Jupiter … [+4157 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Raphael Rosen", "title": "Researchers uncover role of plasma waves in mysterious heating of sun's corona - Phys.org", "description": "There is a profound mystery in our sun. While the sun's surface temperature measures around 10,000 degrees Fahrenheit, its outer atmosphere, known as the solar corona, measures more like 2 million degrees Fahrenheit, about 200 times hotter.", "url": "https://phys.org/news/2024-10-uncover-role-plasma-mysterious-sun.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/researchers-find-clues.jpg", "publishedAt": "2024-10-11T16:58:03Z", "content": "There is a profound mystery in our sun. While the sun's surface temperature measures around 10,000 degrees Fahrenheit, its outer atmosphere, known as the solar corona, measures more like 2 million de… [+4128 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Astronaut Suni Williams Talks with WBZ-TV Boston – Friday, October 11, 2024 - NASA Video", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/", "urlToImage": "https://www.youtube.com/img/desktop/yt_1200.png", "publishedAt": "2024-10-11T16:36:26Z", "content": null}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "The US’s New Nuclear Weapons, Mysterious Fogbanks And Inertial Confinement Fusion - Hackaday", "description": "Keeping the United States’ nuclear arsenal ready for use is an ongoing process, one which is necessarily shrouded in complete secrecy. In an article by The War Zone these developments and the…", "url": "https://hackaday.com/2024/10/11/the-uss-new-nuclear-weapons-mysterious-fogbanks-and-inertial-confinement-fusion/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/10/thermonuclear_warhead_fogbank_aerogel.jpg", "publishedAt": "2024-10-11T15:30:00Z", "content": "Keeping the United States’ nuclear arsenal ready for use is an ongoing process, one which is necessarily shrouded in complete secrecy. In an article by The War Zone these developments and the secrets… [+1518 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Aman Tripathi", "title": "US scientists shatter high-power uranium beam record, unlock new isotopes - Interesting Engineering", "description": "FRIB scientists achieve a record-breaking 10.4 kilowatts of continuous beam power with uranium, leading to the discovery of 3 new isotopes.", "url": "https://interestingengineering.com/science/high-power-uranium-beam-unlock-new-isotopes", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/10/FRIB.jpg", "publishedAt": "2024-10-11T15:05:00Z", "content": "Uranium is the heaviest naturally occurring element and is difficult to accelerate. It is heavy, and its complex atomic structure makes it difficult to control. However, uranium is essential for scie… [+784 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Even a Single Bacterial Cell Can Sense the Seasons Changing - Quanta Magazine", "description": "Though they live only a few hours before dividing, bacteria can anticipate the approach of cold weather and prepare for it. The discovery suggests that seasonal tracking is fundamental to life.", "url": "https://www.quantamagazine.org/even-a-single-bacterial-cell-can-sense-the-seasons-changing-20241011/", "urlToImage": "https://www.quantamagazine.org/wp-content/uploads/2024/10/BacterialWinter-crCarlosArrojo-Social.webp", "publishedAt": "2024-10-11T14:23:47Z", "content": "Every year, in latitudes far enough north or south, a huge swath of life on Earth senses that winter is coming. Leaves fall from trees, sparrows fly to the tropics, raccoons grow thick winter coats, … [+4237 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Rob Beschizza", "title": "Ceres may be an \"ocean world\" only 18 months from home - Boing Boing", "description": "Water is thought by some to be common in the solar system, and conditions on Ceres invite suspicions it will be found there in abundance.", "url": "https://boingboing.net/2024/10/11/ceres-may-be-an-ocean-world-only-18-months-from-home.html", "urlToImage": "https://boingboing.net/wp-content/uploads/2024/10/image-51.png", "publishedAt": "2024-10-11T14:17:18Z", "content": "Ceres, a dwarf planet in the asteroid belt, may be an ocean worldat least in the sense that the apparently rocky surface may hide massive quantities of brine. Water is now thought by some scientists … [+2614 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jonathan O'Callaghan", "title": "Event horizon: After photographing black holes, scientists are now making a movie - Phys.org", "description": "The first moving images of a black hole could reveal swirls of plasma and collapsing stars, deepening our understanding of the universe.", "url": "https://phys.org/news/2024-10-event-horizon-black-holes-scientists.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/event-horizon-after-ph.jpg", "publishedAt": "2024-10-11T14:02:57Z", "content": "The first moving images of a black hole could reveal swirls of plasma and collapsing stars, deepening our understanding of the universe.\r\nA widespread misconception has long equated black holes in sp… [+6990 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Where have all the sperm whales gone? Scientists think they know - Earth.com", "description": "Sperm whales are disappearing from the central Gulf of California. Scientists suggest environmental changes could be responsible.", "url": "https://www.earth.com/news/where-have-the-sperm-whales-gulf-gone-gulf-jumbo-squid-scientists-think-they-know/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/09085158/sperm-whale_Physeter-macrocephalus_gulf-disappearance_1.jpg", "publishedAt": "2024-10-11T13:59:52Z", "content": "We all love a good mystery, don’t we? But when it comes to the mysteries of our vast oceanic realm, they may not always have a comforting conclusion. A recent conundrum involving the disappearance of… [+5590 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Conor Feehly", "title": "New Artemis moon camera gets 1st field test (photos) - Space.com", "description": "'The camera captured a great amount of detail in both shadowed and highly illuminated areas.'", "url": "https://www.space.com/hulc-artemis-moon-camera-first-field-test", "urlToImage": "https://cdn.mos.cms.futurecdn.net/56jVmdHuXw9EYjJ4C4w6cM-1200-80.jpg", "publishedAt": "2024-10-11T13:00:13Z", "content": "NASA's Artemis 3 mission is slated to launch in September 2026, sending four astronauts to the moon's south polar region. \r\nThose explorers — and their colleagues on subsequent Artemis\r\n missions — w… [+4092 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "NASA images Uranus with epic team up of Hubble Telescope and New Horizons Pluto probe - Space.com", "description": "The investigation shows what is needed to directly image more planets beyond the solar system.", "url": "https://www.space.com/hubble-telescope-new-horizons-image-uranus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/imbWaoQAcnvN2eninavHGe-1200-80.png", "publishedAt": "2024-10-11T12:00:34Z", "content": "Two NASA spacecraft have teamed up to capture direct images of Uranus. \r\nThe Hubble Space Telescope and the New Horizons Pluto probe formed a cool tag team to investigate the mysterious seventh plane… [+6881 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Christopher Cokinos", "title": "Planning our lunar return? Get a telescope - SpaceNews", "description": "Perhaps you’re a propulsion engineer making lunar landers as part of NASA’s CLPS program. Perhaps you’re a lawyer specializing in the OST. Or you are a chemist cracking the codes of lunar ISRU.&nbs…", "url": "https://spacenews.com/planning-our-lunar-return-get-telescope/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/10/robert-reeves.png?fit=752%2C499&ssl=1", "publishedAt": "2024-10-11T12:00:00Z", "content": "Perhaps youre a propulsion engineer making lunar landers as part of NASAs CLPS program. Perhaps youre a lawyer specializing in the OST. Or you are a chemist cracking the codes of lunar ISRU. \r\nIf you… [+6946 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Katie Spalding", "title": "Does Blowing On Hot Food Actually Do Anything, And If So... Then How? - IFLScience", "description": "The tea on cooling your tea.", "url": "https://www.iflscience.com/does-blowing-on-hot-food-actually-do-anything-and-if-so-then-how-76328", "urlToImage": "https://assets.iflscience.com/assets/articleNo/76328/aImg/79449/woman-blowing-on-a-spoonful-of-vegetable-soup-meta.jpg", "publishedAt": "2024-10-11T11:41:17Z", "content": "Weve all been there: you take the fast food chain apple pie out of its case, bite into it, and immediately regret every decision that ever took you to the point where you somehow forgot that these th… [+8598 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Rocket Report: ULA investigating SRB anomaly; Europa Clipper is ready to fly - Ars Technica", "description": "US Space Force payloads will ride on the first flight of Impulse Space’s cryogenic space tug.", "url": "https://arstechnica.com/space/2024/10/rocket-report-europa-clipper-on-hold-for-milton-spanish-startups-big-ambitions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/deneb.jpeg", "publishedAt": "2024-10-11T11:00:50Z", "content": null}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Ask Ethan: Do evolution and natural selection occur cosmically? - Big Think", "description": "The Universe changes remarkably over time, with some entities surviving and others simply decaying away. Is this cosmic evolution at work?", "url": "https://bigthink.com/starts-with-a-bang/evolution-natural-selection-cosmic/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/02/flame-e1728590174618.jpg?w=1041&h=586&crop=1", "publishedAt": "2024-10-11T06:00:00Z", "content": null}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Nasa hopes to find a future for supersonic flight - BBC.com", "description": "The space agency hopes its X-59 with a new design will overcome the national ban on supersonic flights over land.", "url": "https://www.bbc.com/reel/video/p0jx0yp0/nasa-hopes-to-find-a-future-for-supersonic-flight", "urlToImage": "https://ichef.bbci.co.uk/images/ic/1024xn/p0jx1czv.jpg", "publishedAt": "2024-10-11T05:11:12Z", "content": "Nasa researchers are hoping the X-59 will drastically reduce the noise associated with supersonic planes, from a boom to a thump, and overcome the national ban and breathe new life into supersonic tr… [+47 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2024-10-11T04:48:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "First complete map of every neuron in an adult brain revealed - Earth.com", "description": "Scientists reveal the first complete neural map of an adult brain, mapping every neuron and connection for new insights into brain function.", "url": "https://www.earth.com/news/first-complete-map-of-every-neuron-in-the-brain-revealed/", "urlToImage": "https://cff2.earth.com/uploads/2024/10/07153853/neurons_50-largest_mapped_fruit-fly-brain_UCambridge_1m.jpg", "publishedAt": "2024-10-09T21:44:16Z", "content": "Imagine gazing at the intricate yet beautiful map of an entire city, but the city is in fact a brain. Sounds fascinating, doesn’t it? Well, scientists have now made this a reality.\r\nExperts have crea… [+5736 chars]"}]}