{"status": "ok", "totalResults": 40, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Pinpoint Origins of Mysterious Signal That Traveled 200 Million Years To Reach Us - SciTechDaily", "description": "The fleeting cosmic firework likely originated within the turbulent magnetosphere surrounding a distant neutron star. Fast radio bursts are brief and brilliant explosions of radio waves emitted by extremely compact objects such as neutron stars and possibly b…", "url": "https://scitechdaily.com/astronomers-pinpoint-origins-of-mysterious-signal-that-traveled-200-million-years-to-reach-us/", "urlToImage": "https://scitechdaily.com/images/Neutron-Star-Emitting-a-Radio-Beam.jpg", "publishedAt": "2025-01-05T23:53:52Z", "content": "An artist’s illustration of a neutron star emitting a radio beam from within its magnetic environment. As the radio waves travel through dense plasma within the galaxy, they split into multiple paths… [+9445 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "MRO observes dormant InSight lander; collects data on Martian dust movements - NASASpaceflight.com", "description": "NASA’s Mars Reconnaissance Orbiter (MRO) recently imaged NASA’s Interior Exploration using Seismic Investigations, Geodesy, and…", "url": "https://www.nasaspaceflight.com/2025/01/mro-insight-2024/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/12/1-HiRISE_Spots_InSight_in_October_2024_kkZupmk.jpg", "publishedAt": "2025-01-05T21:02:26Z", "content": "7NASA’s Mars Reconnaissance Orbiter (MRO) recently imaged NASA’s Interior Exploration using Seismic Investigations, Geodesy, and Heat Transport (InSight) lander, which has been dormant on the Martian… [+5210 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "The Moon’s Middle Age Surprise: Evidence of a Long-Lost Magnetic Field - Indian Defence Review", "description": "For decades, scientists believed the Moon was a lifeless rock devoid of a magnetic field. However, groundbreaking data from China’s Chang’e 5 mission has", "url": "https://indiandefencereview.com/the-moons-middle-age-surprise-evidence-of-a-long-lost-magnetic-field/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Moons-Magnetic-Field.jpg", "publishedAt": "2025-01-05T20:20:00Z", "content": "For decades, scientists believed the Moon was a lifeless rock devoid of a magnetic field. However, groundbreaking data from Chinas Change 5 mission has flipped this assumption on its head, revealing … [+3497 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "NASA to Reveal New Mars Sample Return Plans on Jan. 7 – Here’s How to Tune In - Indian Defence Review", "description": "NASA’s Mars Sample Return mission faces a pivotal moment. With costs soaring and timelines slipping, the agency is rethinking its approach to one of its most ambitious goals: bringing Mars rocks back to Earth. A major announcement on Jan. 7 could reshape the …", "url": "https://indiandefencereview.com/nasa-to-reveal-new-mars-sample-return-plans-on-jan-7-heres-how-to-tune-in/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/01/Mars-Sample-Mission.jpg", "publishedAt": "2025-01-05T19:50:23Z", "content": "NASA is set to kick off 2025 with a significant announcement about its ambitious Mars Sample Return program. On Tuesday, Jan. 7, the agency will host an audio-only press conference at 1:00 p.m. EST (… [+3349 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Sci-Fi No More: First-Ever Image of a Sunlike Star’s Astrosphere Captured in Space - The Daily Galaxy --Great Discoveries Channel", "description": "Astronomers have captured a stunning first: an image of a protective bubble around a star like our sun. This mysterious astrosphere, a cosmic shield against harmful radiation, could hold clues about the sun’s turbulent youth. Nicknamed The Moth, this star boa…", "url": "https://dailygalaxy.com/2025/01/sci-fi-no-more-first-ever-image-of-a-sunlike-stars-astrosphere-captured-in-space/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/A-young-star-nicknamed-the-Moth-plows-through-a-dense-cloud-of-interstellar-dust-and-gas.jpg", "publishedAt": "2025-01-05T18:12:20Z", "content": "Astronomers have achieved a groundbreaking milestone by capturing the first-ever image an astrosphere around a star resembling our sun. The discovery centers on a star nicknamed The Moth, whose strik… [+4021 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Earth’s magnetic field has a dent, and NASA is watching closely - Earth.com", "description": "NASA monitors the South Atlantic Anomaly, a growing magnetic field disturbance affecting satellites and spacecraft.", "url": "https://www.earth.com/news/earths-magnetic-field-has-a-dent-and-nasa-is-watching-closely/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/05081450/earth-magnetic-field_dent_global-map_NASA_1m.jpg", "publishedAt": "2025-01-05T17:07:41Z", "content": "Something strange is happening in Earth’s magnetic field, and it has caught NASA’s attention. A massive region of lower magnetic intensity, known as the South Atlantic Anomaly (SAA), has appeared abo… [+5419 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Carbon atoms in your body took a 400,000 light-year journey through space - Earth.com", "description": "Carbon, essential for life, journeys through space in a galactic recycling process, fueling star and planet formation.", "url": "https://www.earth.com/news/carbon-atoms-in-your-body-took-a-400000-light-year-journey-through-space/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/05085024/Carbon-atom2.jpg", "publishedAt": "2025-01-05T16:03:24Z", "content": "Every atom of carbon in your body has an incredible story to tell. Before becoming part of you, the carbon atom likely spent time not just in other living things, but also floating in the vast spaces… [+5777 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unborn Babies Use Genes From Dad to “Remote-Control” Mothers for Extra Food - SciTechDaily", "description": "Scientists at Cambridge have unveiled a fascinating mechanism where fetuses use a paternal gene to control the mother's nutrient release during pregnancy. This \"remote control\" system involves hormonal signals from the placenta, which ensure the fetus grows o…", "url": "https://scitechdaily.com/unborn-babies-use-genes-from-dad-to-remote-control-mothers-for-extra-food/", "urlToImage": "https://scitechdaily.com/images/Greedy-Gene.jpg", "publishedAt": "2025-01-05T15:20:09Z", "content": "Image showing the signaling cells (in green) of the mouse placenta that are key for remote controlling the metabolism of the mother to support nutrient supply and growth of the fetus. Credit: Sferruz… [+6282 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Evidence of a massive, early-universe black hole stuns astronomers - Earth.com", "description": "Astronomers found a massive black hole that spent ages in a \"quiet\" phase when everything around it in the early universe roared.", "url": "https://www.earth.com/news/evidence-of-massive-early-universe-black-hole-stuns-astronomers/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/02035427/massive-early-universe-black-hole-evidence.jpg", "publishedAt": "2025-01-05T15:08:22Z", "content": "A sleepy cosmic heavyweight has stirred intense curiosity among astronomers who hunt for clues to the earliest beginnings. They have uncovered evidence that points to a massive black hole that spent … [+6065 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Electric Thrusters Are Revolutionizing Space Exploration - SciTechDaily", "description": "A research team at the University of Virginia is revolutionizing the future of space travel with groundbreaking studies on electric propulsion thrusters. By delving into the behavior of electrons in plasma beams, their work promises to enhance spacecraft effi…", "url": "https://scitechdaily.com/how-electric-thrusters-are-revolutionizing-space-exploration/", "urlToImage": "https://scitechdaily.com/images/Xenon-Hall-Thruster.jpg", "publishedAt": "2025-01-05T14:11:23Z", "content": "Pictured is a 6 kW Hall thruster in operation at the NASA Jet Propulsion Laboratory. Credit: NASA\r\nA research team at the University of Virginia is revolutionizing the future of space travel with gro… [+5177 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Callum Jones", "title": "Fighter aircraft ‘activates its cloaking device’ and people have a lot to say about it - UNILAD", "description": "Footage of a fighter aircraft ‘activating its cloaking device’ has gone viral and people have been left stunned, to say the least.", "url": "https://www.unilad.com/news/health/f22-aircraft-cloaking-device-footage-414818-20250103", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt504058f9e5902c8e/67783740b6b515c9a44dc8a0/fighter-jet-cloaking-device.png", "publishedAt": "2025-01-05T12:06:21Z", "content": "Incredible footage of a fighter aircraft 'activating its cloaking device has resurfaced and people can't believe it's real. \r\nWhile it may seem like something out of a Top Gun movie, this footage act… [+2752 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Physicists Measure Quantum Geometry of Electrons For First Time - ScienceAlert", "description": "A new breakthrough may help scientists solve some of the mysteries of the quantum realm.", "url": "https://www.sciencealert.com/physicists-measure-quantum-geometry-of-electrons-for-first-time", "urlToImage": "https://www.sciencealert.com/images/2024/12/quantum-geometry.jpg", "publishedAt": "2025-01-05T11:36:17Z", "content": "A new breakthrough may help scientists solve some of the mysteries of the quantum realm.\r\nFor the first time, physicists have been able to measure the geometrical 'shape' a lone electron adopts as it… [+3956 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Homo juluensis”: Scientists Claim To Have Discovered New Species of Humans - SciTechDaily", "description": "Researcher Christopher J. Bae identified Homo juluensis, a new human species that coexisted with Denisovans in Asia. A University of Hawaiʻi researcher may have identified a new human species, Homo juluensis, which could encompass enigmatic groups like the De…", "url": "https://scitechdaily.com/homo-juluensis-scientists-claim-to-have-discovered-new-species-of-humans/", "urlToImage": "https://scitechdaily.com/images/Primitive-Humans-Cavemen-Neanderthals.jpg", "publishedAt": "2025-01-05T11:33:26Z", "content": "A new human species, Homo juluensis, has been proposed based on fossils from eastern Asia, dating back 300,000 to 50,000 years ago, possibly including the Denisovans. This research uses a novel metho… [+3230 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Shreejaya Karantha", "title": "Space photo of the week: Hubble celebrates 10 years of hunting giants - Livescience.com", "description": "Behold, the giants! The Hubble Space Telescope has completed a decade of observing Jupiter, Saturn, Uranus and Neptune.", "url": "https://www.livescience.com/space/space-photo-of-the-week-hubble-celebrates-10-years-of-hunting-giants", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MoDxRjvEvbDSTZZiyMNPpa-1200-80.jpg", "publishedAt": "2025-01-05T11:00:00Z", "content": "What it is: Our solar system's four giant outer planets: Jupiter, Saturn, Uranus and Neptune\r\nWhere it is: From about 365 million to 2.8 billion miles (587 million to 4.5 billion kilometers) from Ear… [+3096 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "NASA's Stunning New Image Reveals Dust Devils in Action on Mars - ScienceAlert", "description": "An incredible image of Mars has been released that captures the relentless activity of dust devils, swirling across the planet's surface.", "url": "https://www.sciencealert.com/nasas-stunning-new-image-reveals-dust-devils-in-action-on-mars", "urlToImage": "https://www.sciencealert.com/images/2025/01/whirlwind_tracks_mars_header.jpg", "publishedAt": "2025-01-05T10:33:27Z", "content": "An incredible image of Mars has been released that captures the relentless activity of dust devils, swirling across the planet's surface. These Martian whirlwinds form, move across the surface and di… [+2989 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Indiana University", "title": "New research reveals RNA on leaves may impact microbial communities - Phys.org", "description": "Biologists at Indiana University Bloomington have shown that the surfaces of plant leaves are coated with a diverse array of RNA molecules. The finding suggests that the RNA present on the leaf surface may play a role in shaping the microbial communities that…", "url": "https://phys.org/news/2025-01-reveals-rna-impact-microbial-communities.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/arabidopsis.jpg", "publishedAt": "2025-01-05T09:41:56Z", "content": "Biologists at Indiana University Bloomington have shown that the surfaces of plant leaves are coated with a diverse array of RNA molecules. The finding suggests that the RNA present on the leaf surfa… [+3345 chars]"}, {"source": {"id": null, "name": "Homesandgardens.com"}, "author": "Sarah Wilson", "title": "Best plants for a courtyard garden – 8 favorites to grow for maximum impact in a small space - Homes & Gardens", "description": "Make the most of a small courtyard by choosing the best plants to create a thriving garden", "url": "https://www.homesandgardens.com/gardens/best-plants-for-a-courtyard-garden", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iDCBsqoEuFtpPGmozp3krL-1200-80.jpg", "publishedAt": "2025-01-05T08:00:10Z", "content": "I am constantly on the lookout for the best plants for a courtyard garden as I have a small courtyard garden myself. It's a beautifully private outdoor space, with a mix of sun and shade areas, a big… [+12797 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "2025-01-05T04:30:00Z", "content": "[Removed]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Upasna Gautam", "title": "No apps, no hacks. A guide to optimizing productivity - CNN", "description": "No app can fix your focus. Here’s how CNN’s Upasna Gautam ditched the productivity hacks and embraced the basics to get the most out of life.", "url": "https://www.cnn.com/2025/01/03/health/productivity-tips-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/productivity-apps-v8.png?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-05T01:51:00Z", "content": "Editors note: Upasna Gautam is a senior product manager on the Platforms team at CNN, where she develops and builds the content management technology that delivers news to the world.\r\nI used to be a … [+6828 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "David Bressan", "title": "Mystery Of Giant Volcanic Eruption That Has Puzzled Scientists For Almost 200 Years Has Finally Been Solved - Forbes", "description": "The mystery location of a giant volcanic eruption that has puzzled scientists for almost 200 years has finally been solved.", "url": "https://www.forbes.com/sites/davidbressan/2025/01/04/mystery-of-giant-volcanic-eruption-that-has-puzzled-scientists-for-almost-200-years-has-finally-been-solved/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67798a0b4ed4377d80bff9d5/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-04T19:41:24Z", "content": "The 2009 eruption of Sarychev Peak Volcano, Kuril Islands, viewed from the International Space ... [+] Station. A similar eruption 200 years had global impact on climate and severe consequences for h… [+3350 chars]"}, {"source": {"id": null, "name": "nj.com"}, "author": "Abigail Van Buren", "title": "Dear Abby: Man invites grandkids to meteor shower event and amateur astronomer in-law isn’t over the moon - NJ.com", "description": "I thought they understood it would be an adult event, as we’ll be up half the night and traveling 30 minutes to get to the dark sky site.", "url": "https://www.nj.com/advice/2025/01/dear-abby-man-invites-grandkids-to-meteor-shower-event-and-amateur-astronomer-in-law-isnt-over-the-moon.html", "urlToImage": "https://www.nj.com/resizer/v2/DIHDGNWZUZFGDDVWZX7SHSBAGM.png?auth=c455d8300f7d98b13e80c6ccb5b402e3eef4868eda1e934fc89f6e277ef5e402&width=1280&quality=90", "publishedAt": "2025-01-04T17:00:00Z", "content": "DEAR ABBY: I have been an amateur astronomer for 25-plus years. I always go meteor watching as well as observe any celestial event. This year I invited my brother-in-law and his wife to watch a meteo… [+1697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Why ‘Kessler Syndrome’ could turn from a hypothetical to a space disaster reality - Yahoo! Voices", "description": "This week, uncover why experts are worried about Kessler Syndrome, meet the species newly discovered in 2024, marvel at a mystery volcano revealed, and more.", "url": "https://www.cnn.com/2025/01/04/science/kessler-syndrome-science-newsletter-wt/index.html", "urlToImage": "https://media.zenfs.com/en/cnn_articles_875/19089339567d08b75f4dd9815b9fd1f8", "publishedAt": "2025-01-04T16:00:42Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nE… [+5955 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "This Week In Space podcast: Episode 142 — 2025 in Space - Space.com", "description": "The Year’s Most Anticipated Space Missions & Developments", "url": "https://www.space.com/entertainment/space-movies-shows/this-week-in-space-podcast-this-week-in-space-podcast-episode-142-2025-in-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rFCKGjnyvUshLTndGR7ER6-1200-80.jpg", "publishedAt": "2025-01-04T15:01:47Z", "content": "On Episode 142 of This Week In Space, Rod Pyle and Tariq Malik talk about 2025 in space!\r\nIt's going to be an exciting year, kicking off with the first launch attempt for Blue Origin's New Glenn heav… [+1733 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Scott Travers", "title": "Meet The Rare Oceanic Seabird That Flies To A Storm To Find A Snack - Forbes", "description": "Far from being put off by the roaring ruckus of a nearby cyclone, this elusive seabird flies closer just to stay alive.", "url": "https://www.forbes.com/sites/scotttravers/2025/01/04/meet-the-rare-oceanic-seabird-that-flies-to-a-storm-to-find-a-snack/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/67751169949f6b82ce6f82f1/0x0.jpg?format=jpg&crop=2168,1016,x0,y0,safe&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-04T14:30:58Z", "content": "Far from being put off by the roaring ruckus of a nearby cyclone, this elusive seabird flies closer ... [+] just to stay alive.\r\ngetty\r\nHurricanes churn with unrelenting power, reshaping coastlines a… [+5155 chars]"}, {"source": {"id": null, "name": "OPB News"}, "author": "Jule Gilfillan", "title": "Dog-like robots train in Northwest caves to sniff out life on Mars - Oregon Public Broadcasting", "description": "NASA scientists test autonomous dog-like robots in Northern California caves in preparation for future missions to Mars.", "url": "https://www.opb.org/article/2025/01/04/space-oregon-lava-beds-california-mars-rover-dog-robot-robotics-sniff-smell-microbes-science/", "urlToImage": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/LP6KLHL7TNBGVO37ZKPTQNGJQE.jpg?auth=25a120201ac387af3ee496edb72e1e3025032a04434a5944e8cc0f12f7ae531a&width=1200&height=675&smart=true", "publishedAt": "2025-01-04T14:01:10Z", "content": "Were long past the stage of imagining the inhabitants of Mars as little green men. But as we explore the red planet, what kind of life might we find there? \r\nNASA scientists think life on Mars might … [+316 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Hidden Beneath Antarctica’s Frozen Lake Enigma: Something Extraordinary Lurks Under 14 Meters of Ice - The Daily Galaxy --Great Discoveries Channel", "description": "Deep beneath Antarctica’s frozen Lake Enigma, hidden under 14 meters of thick ice, scientists have uncovered something extraordinary that defies expectations. This mysterious discovery challenges long-held beliefs about where life can thrive and could hold se…", "url": "https://dailygalaxy.com/2025/01/antarctica-lake-enigma-something-lurks-ice/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/01/Hidden-Beneath-Antarcticas-Frozen-Lake-Enigma-Something-Extraordinary-Lurks-Under-14-Meters-of-Ice.jpg", "publishedAt": "2025-01-04T14:00:00Z", "content": "In the heart of Antarcticas Victoria Land, hidden under 14 meters of thick ice, lies Lake Enigma, a body of water long believed to be entirely frozen. Now, scientists have discovered that this lake i… [+4586 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Hannah Osborne", "title": "Orange dwarf cave crocodiles: The crocs that crawled into a cave, ate bats, and started mutating into a new species - Livescience.com", "description": "Dwarf crocodiles in Gabon found living in a cave, with their skin turning orange from swimming in guano. It's unclear how long they've been down there, but genetic research indicates they may be morphing into a new species.", "url": "https://www.livescience.com/animals/alligators-crocodiles/orange-dwarf-cave-crocodiles-the-crocs-that-crawled-into-a-cave-ate-bats-and-started-mutating-into-a-new-species", "urlToImage": "https://cdn.mos.cms.futurecdn.net/btTYLhHD7dyW72GQLEURuH-1200-80.jpg", "publishedAt": "2025-01-04T13:00:00Z", "content": "Name: Cave-dwelling dwarf crocodiles (Osteolaemus tetraspis)\r\nWhere it lives: Abanda cave system, Ogooue-Maritime Province, Gabon\r\nWhat it eats: Cave crickets and bats\r\nWhy it's awesome: Deep inside … [+2628 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Gerrard Kaonga", "title": "Scientists warn of huge underwater volcano expected to erupt this year after 'swelling' was spotted - UNILAD", "description": "A volcano eruption near Oregon could be imminent and apparently it would be a good thing", "url": "https://www.unilad.com/news/world-news/volcano-eruption-warning-scientist-swelling-oregon-217980-20250104", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/blt949ea8e16e463049/blt51670cf52149053f/67792d0d0ed6a7522a700fa4/huge-volcano-warned-eruption.png", "publishedAt": "2025-01-04T12:44:16Z", "content": "Scientists have warned a volcano off the coast of Oregon could be set to erupt in 2025, but it could prove to be very useful for experts. \r\nYou dont need to worry, you havent somehow missed there bei… [+2409 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rory Bathgate", "title": "Chinese 'robot dog' that moves like a cat could revolutionize space exploration and asteroid mining - Livescience.com", "description": "Using AI training, researchers designed a \"robot dog\" that moves like a cat, and has no trouble navigating low-gravity environments", "url": "https://www.livescience.com/technology/robotics/chinese-robot-dog-that-moves-like-a-cat-could-revolutionize-space-exploration-and-asteroid-mining", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7RZCkGUpSQ9yZyYMUQp22a-1200-80.jpg", "publishedAt": "2025-01-04T11:45:00Z", "content": "A cat-like exploration robot could one day scramble over the surface of asteroids using a unique movement system designed to keep it in motion even in the most extreme conditions.\r\nScientists designe… [+2252 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Blakemore", "title": "Study: Sulfur helps gold reach Earth’s surface - The Washington Post", "description": "Scientists have long suspected that sulfur, which forms strong chemical bonds with gold, allows it to be transported up to the surface.", "url": "https://www.washingtonpost.com/science/2025/01/04/sulfur-gold-ore-deposits-volcanoes/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/E5O2PIA4YH43GEC45SSRITBANQ.jpg&w=1440", "publishedAt": "2025-01-04T11:34:19Z", "content": "Gold deposits are often found in places with intense volcanic activity, and scientists have long known that the sparkly substance gets there with the help of magma, the molten rock that fuels volcano… [+1989 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Monisha Ravisetti", "title": "What I learned from a black hole in Los Angeles - Space.com", "description": "French artist Marcel Duchamp believed the creative act is a specific dance between artist and spectator.", "url": "https://www.space.com/the-universe/what-i-learned-from-a-black-hole-in-los-angeles", "urlToImage": "https://cdn.mos.cms.futurecdn.net/F2qM9GBVYhTWeZ9W3C7Eij-1200-80.jpg", "publishedAt": "2025-01-04T11:01:20Z", "content": "On York Boulevard in Los Angeles, a blurred black hole hangs on a dark wall, joined only by a pair of headphones playing looping echoes of its siblings colliding.\r\nIt's a familiar scene of our galaxy… [+10965 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jamie Carter", "title": "Today Earth Is Closest To A ‘Solar Maximum’ Sun. So Why Is It So Cold? - Forbes", "description": "Earth is now closer to the sun than at any other time of the year. Here's why our planet's axial tilt, not proximity to the sun, is the key factor.", "url": "https://www.forbes.com/sites/jamiecartereurope/2025/01/04/today-earth-is-closest-to-a-solar-maximum-sun-so-why-is-it-so-cold/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/1134057045/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2025-01-04T11:00:00Z", "content": "A time-sequence composite of the August 21, 2017 total solar eclipse. (Photo by: VW Pics/Universal ... [+] Images Group via Getty Images)\r\nUniversal Images Group via Getty Images\r\nEarth will reach pe… [+2906 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "Planet's Odd Atmosphere Doesn't Match The Disc It Was Born in - ScienceAlert", "description": "If the modern age of astronomy could be summarized in a few words, it would probably be \"the age of shifting paradigms.\" Thanks to next-generation telescopes, instruments, and machine learning, astronomers are conducting deeper investigations into cosmologica…", "url": "https://www.sciencealert.com/planets-odd-atmosphere-doesnt-match-the-disc-it-was-born-in", "urlToImage": "https://www.sciencealert.com/images/2025/01/planet_atomsphere_unlike_sun_header.jpg", "publishedAt": "2025-01-04T10:32:16Z", "content": "If the modern age of astronomy could be summarized in a few words, it would probably be \"the age of shifting paradigms.\"\r\nThanks to next-generation telescopes, instruments, and machine learning, astr… [+6018 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Marilyn Perkins", "title": "Are cats and dogs smarter than babies? - Livescience.com", "description": "It's possible to compare some aspects of animal and human intelligence, but not all researchers like to.", "url": "https://www.livescience.com/animals/are-cats-and-dogs-smarter-than-babies", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2DKkDndRdRy5Pc8MMuUvF8-1200-80.jpg", "publishedAt": "2025-01-04T10:00:00Z", "content": "Compared with other animals, human babies start out with a lot to learn\r\n. Whereas some animals walk within hours of being born or hatching, human babies take months or years to master even the most … [+6935 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Gene Inherited From Neanderthals Influenced The Shape of Our Teeth - ScienceAlert", "description": "A new study identifies 18 genome regions that influence tooth size and shape, of which 17 have not been linked to our chompers before – and shows how genetic variation affects tooth dimensions across ethnicities.", "url": "https://www.sciencealert.com/gene-inherited-from-neanderthals-influenced-the-shape-of-our-teeth", "urlToImage": "https://www.sciencealert.com/images/2024/12/SmilingFace.jpg", "publishedAt": "2025-01-04T09:00:28Z", "content": "A new study identifies 18 genome regions that influence tooth size and shape, of which 17 have not been linked to our chompers before and shows how genetic variation affects tooth dimensions across e… [+2831 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Venus Moon duo and Quadrantids meteors stun stargazers - BBC.com", "description": "The planet appeared shining brightly above a crescent Moon on Friday.", "url": "https://www.bbc.com/news/articles/c3rqe2ndl0lo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/067e/live/83aab620-ca67-11ef-8e0d-273f188c66a4.jpg", "publishedAt": "2025-01-04T07:28:46Z", "content": "Stargazers around the globe were treated to a stunning celestial scene on Friday as Venus appeared shining brightly above a crescent Moon.\r\nThe planet was visible to the naked eye from the UK to the … [+983 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "SpaceX launches 1st Falcon 9 rocket of 2025, sends Thuraya 4 communications satellite to orbit (video) - Space.com", "description": "This was the 20th flight and recovery for this Falcon 9 first stage booster, and SpaceX's 341st recovery of an orbital-class rocket.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-launches-1st-falcon-9-rocket-of-2025", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6dEQD8kozATFYG4cKoXfGk-1200-80.jpg", "publishedAt": "2025-01-04T02:08:51Z", "content": "SpaceX launched its first Falcon 9 rocket of 2025 tonight, in what should be another busy year for the company.\r\nA SpaceX Falcon 9 rocket took off on Friday (Jan. 3) at 8:27 p.m. EST (0127 GMT) from … [+2507 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "How plants and trees are able to predict volcano eruptions - Earth.com", "description": "Scientists are turning to satellite imagery of plant life for clues and signs that a volcano is close to erupting.", "url": "https://www.earth.com/news/plants-and-trees-predict-volcano-eruptions-when-viewed-from-space-satellites/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/02161226/plants_predict_volcano-eruptions_satellite-imagery_1m.jpg", "publishedAt": "2025-01-02T23:40:49Z", "content": "Volcanoes hold incredible power, but similar to plants and their root systems, most volcanic activity that occurs before an eruption happens beneath the surface.\r\nTraditional monitoring tools focus o… [+6310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Lindell", "title": "166-million-year-old dinosaur tracks found in the UK - CNN", "description": "Researchers say they found the most important discovery of dinosaur tracks in the UK for over 25 years.", "url": "https://www.cnn.com/2025/01/02/science/video/new-dinosaur-tracks-found-uk-digvid", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/dinosaur-tracks-uk-thumb.png?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-02T23:08:15Z", "content": "Researchers say they found the most important discovery of dinosaur tracks in the UK for over 25 years."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Storm Surfers: How Bats Harness Weather to Travel Thousands of Miles - SciTechDaily", "description": "Scientists used ultra-light sensors connected “like cell phones” across Europe to study how bats migrate over the continent. Birds may dominate the skies when it comes to long-distance travel, but they’re not the only masters of epic journeys. A select few ba…", "url": "https://scitechdaily.com/storm-surfers-how-bats-harness-weather-to-travel-thousands-of-miles/", "urlToImage": "https://scitechdaily.com/images/Flying-Bats-Close.jpg", "publishedAt": "2025-01-02T19:00:34Z", "content": "Scientists have made a significant discovery about how common noctule bats navigate long distances by riding storm fronts across Europe.\r\nScientists used ultra-light sensors connected “like cell phon… [+5843 chars]"}]}