{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Stunned as Perseverance Uncovers Something Unlike Anything Seen Before on Mars - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s Perseverance rover has just made a mysterious discovery on Mars, and scientists are calling it unlike anything ever seen before on the Red Planet. Found in an ancient region believed to hold clues to Mars’ distant past, this unexpected find could resha…", "url": "https://dailygalaxy.com/2025/02/perseverance-uncovers-something-on-mars/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Scientists-Stunned-as-Perseverance-Uncovers-Something-Unlike-Anything-Seen-Before-on-Mars.jpg", "publishedAt": "2025-02-08T19:23:54Z", "content": "NASAs Perseverance rover has uncovered something never seen before on Mars, a find that could offer a rare glimpse into the Red Planets ancient past. The discovery was made in Jezero Crater, a site t… [+4487 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Skye Jacobs", "title": "Hubble captures massive \"bullseye\" galaxy with unprecedented nine rings - TechSpot", "description": "The discovery was made by Imad Pasha, a doctoral student at Yale University, who stumbled upon the unique galaxy while examining a ground-based imaging survey. This was...", "url": "https://www.techspot.com/news/106699-hubble-captures-massive-bullseye-galaxy-unprecedented-nine-rings.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2025/02/2025-02-08-image-6.jpg", "publishedAt": "2025-02-08T16:15:00Z", "content": "The big picture: NASA's Hubble Space Telescope has captured an extraordinary cosmic event that astronomers are calling the \"Bullseye.\" The massive galaxy LEDA 1313424 has been observed with an unprec… [+2889 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Solar Orbiter Captures Incredible Footage of Tiny Jets Near the Sun’s South Pole - Gizmodo", "description": "The jets were first discovered in 2023, and new evidence reveals they drive both fast and slow solar wind.", "url": "https://gizmodo.com/solar-orbiter-captures-incredible-footage-of-tiny-jets-near-the-suns-south-pole-2000560231", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/Tiny_jets_escape_the_Sun.jpg", "publishedAt": "2025-02-08T15:00:49Z", "content": "For nearly five years, a Sun-observing probe has been making close approaches to the Sun, capturing close-up views of the star’s polar regions to collect clues about its magnetic activity, corona, an… [+2531 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Pravrajya Suruchi", "title": "10 stunning pics of interacting galaxies by NASA Hubble Space Telescope - DNA India", "description": "10 stunning pics of interacting galaxies by NASA Hubble Space Telescope", "url": "https://www.dnaindia.com/web-stories/viral/10-stunning-pics-of-interacting-galaxies-shared-by-nasa-hubble-space-telescope-1739023830234", "urlToImage": null, "publishedAt": "2025-02-08T14:23:01Z", "content": "This vibrant portrait of our Milky Way galaxy reveals a dynamic mix of gas, charged particles, and various types of cosmic dust."}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Elon Musk's Massive Rocket Explosion May Have Caused Significant Atmospheric Pollution - Futurism", "description": "The explosion of a Starship rocket during its seventh orbital flight test may have released literal tons of harmful pollutants into the air.", "url": "https://futurism.com/elon-musk-rocket-explosion-pollution", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/elon-musk-rocket-explosion-pollution.jpg", "publishedAt": "2025-02-08T14:00:20Z", "content": "When a multi-ton spacecraft blows up mid-air, you can't just brush aside its environmental impact.\r\nFollowing the explosion of the upper stage of SpaceX's Starship, which sent fiery streaks of debris… [+3057 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Scientists Stunned by Mysterious Pyramid Beneath the Ice in Antarctica—Could It Be Evidence of a Lost Civilization? - The Daily Galaxy --Great Discoveries Channel", "description": "Deep within Antarctica’s Ellsworth Mountains, a pyramid-shaped peak has intrigued scientists and conspiracy theorists alike. With its four steep, symmetrical", "url": "https://dailygalaxy.com/2025/02/mysterious-pyramid-beneath-ice-antarctica/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Pyramid-Beneath-the-Ice-in-Antarctica.jpg", "publishedAt": "2025-02-08T14:00:00Z", "content": "Deep within Antarcticas Ellsworth Mountains, a pyramid-shaped peak has intrigued scientists and conspiracy theorists alike. With its four steep, symmetrical sides, the mountain looks eerily similar t… [+6709 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "In 1831, the Sun Turned Blue for Months—Scientists Have Finally Uncovered the Chilling Truth - Indian Defence Review", "description": "In the summer of 1831, an unexpected chill turned warm months into a season of snow and hardship. Skies took on an eerie hue, crops withered, and famine loomed across the Northern Hemisphere. For nearly two centuries, the cause remained buried in history. New…", "url": "https://indiandefencereview.com/in-1831-the-sun-turned-blue-for-months-scientists-have-finally-uncovered-why-2/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/A-breathtaking-snowy-mountain-landscape-under-a-clear-blue-sky.jpg", "publishedAt": "2025-02-08T13:30:00Z", "content": "In the summer of 1831, German composer Felix Mendelssohn recorded an eerie sight in his journal while traveling through the Alpsdeep snow covering the hills in the middle of the warm season. Across t… [+2753 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lydia Smith", "title": "Mount Kaputar pink slug: The giant hot-pink mollusk found only on a single, extinct volcano - Livescience.com", "description": "The 8-inch, bright pink slug has been isolated in a \"sky island\" for millions of years.", "url": "https://www.livescience.com/animals/mount-kaputar-pink-slug-the-giant-hot-pink-mollusk-found-only-on-a-single-extinct-volcano", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qWEredzbrbnEWMzN54H6Vd-1200-80.jpg", "publishedAt": "2025-02-08T13:00:00Z", "content": "Name: Mount Kaputar pink slug (Triboniophorus sp. nov. 'Kaputar' or Triboniophorus aff. graeffei)\r\nWhere it lives: Mount Kaputar, New South Wales, Australia\r\nWhat it eats: Algae, moss, mushrooms, mol… [+2399 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "Exploring Venus may require exotic tech like balloons and 'aerobots' - Space.com", "description": "Scientists are proposing ways to explore Venus in the next decade and beyond by way of a host of advanced technologies, from balloons to long-lived landers.", "url": "https://www.space.com/the-universe/venus/exploring-venus-may-require-exotic-tech-like-balloons-and-aerobots", "urlToImage": "https://cdn.mos.cms.futurecdn.net/aKoXP5Ss65oMVrV9fFzv7R-1200-80.jpg", "publishedAt": "2025-02-08T13:00:00Z", "content": "Despite being a hellish world, the hot, cloud-enveloped world Venus is a tantalizing target for scientists eager to learn more about its history, evolution and present state.\r\nAt the forefront of tac… [+7576 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Oxford", "title": "Researchers confirm an exoplanet potentially capable of sustaining life - Phys.org", "description": "An international team has confirmed the discovery of a super-Earth orbiting in the habitable zone of a nearby sun-like star. The planet was originally detected two years ago by Oxford University scientist Dr. Michael Cretignier. This result, drawing on more t…", "url": "https://phys.org/news/2025-02-exoplanet-potentially-capable-sustaining-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/earthplanet.jpg", "publishedAt": "2025-02-08T12:20:01Z", "content": "An international team has confirmed the discovery of a super-Earth orbiting in the habitable zone of a nearby sun-like star. The planet was originally detected two years ago by Oxford University scie… [+4372 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Scientists Grow Living \"Replacement Teeth\" for Dental Implants - Futurism", "description": "Like something out of \"Repo! The Genetic Opera,\" scientists have managed to grow human-like \"replacement teeth\" in a lab.", "url": "https://futurism.com/neoscope/replacement-teeth-dental-implants", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/replacement-teeth-dental-implants.jpg", "publishedAt": "2025-02-08T11:45:19Z", "content": "Like something out of \"Repo! The Genetic Opera,\" scientists have managed to grow human-like teeth in a lab and implant them inside a miniature pig's mouth, in a harbinger of weird new frontiers for d… [+2549 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Scientists Discover New Class of Quantum States in Graphene - ScienceAlert", "description": "Forced to run a labyrinth of carbon atoms uniquely arranged in twisted stacks, electrons do some rather peculiar things.", "url": "https://www.sciencealert.com/scientists-discover-new-class-of-quantum-states-in-graphene", "urlToImage": "https://www.sciencealert.com/images/2025/01/graphene_stacked_header.jpg", "publishedAt": "2025-02-08T11:33:18Z", "content": "Forced to run a labyrinth of carbon atoms uniquely arranged in twisted stacks, electrons do some rather peculiar things.\r\nResearchers from the University of British Columbia in Canada, the University… [+3581 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Margaret Osborne", "title": "Why are flies attracted to humans? - Livescience.com", "description": "Flies are attracted to our pungent \"cloud of effervescence,\" experts say.", "url": "https://www.livescience.com/animals/insects/why-are-flies-attracted-to-humans", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5naukfKeWzdpyy5cc98oSR-1200-80.jpg", "publishedAt": "2025-02-08T10:00:00Z", "content": "There's hardly a more irritating noise than the sound of a fly buzzing around your head. These tiny insects\r\n have the uncanny ability to track down humans and nimbly dodge our attempts to swat them … [+4481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles", "title": "NASA staff asked to take ‘inspiration’ from DOGE as employees express concern - CNN", "description": "NASA’s acting administrator said in a Friday email to staff that employees should take an open-minded approach to SpaceX CEO Elon Musk’s efforts to gain efficiencies.", "url": "https://www.cnn.com/2025/02/07/science/nasa-staff-asked-to-take-inspiration-from-doge-as-employees-express-concern/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/spacex-crew-9-dragon-spacecraft-1.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-08T03:19:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nIn a Friday afternoon email to NASA staff, the agencys… [+5104 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Astronomers discover 'Quipu', the single largest structure in the known universe - Livescience.com", "description": "Newly discovered Quipu, a superstructure in which galaxies group together in clusters and clusters of clusters, is the largest known structure in the universe in terms of length, scientists claim.", "url": "https://www.livescience.com/space/astronomy/astronomers-discover-quipu-the-single-largest-structure-in-the-known-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3X9m9xUVCtaDAACZba4SxN-1200-80.jpg", "publishedAt": "2025-02-07T22:14:15Z", "content": "Astronomers have discovered what may be the largest-scale structure in the known universe — a group of galaxy clusters and clusters of galaxy clusters that spans roughly 1.3 billion light-years acros… [+4623 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Cells Use Muscle-Like Signals to Strengthen Learning and Memory - Neuroscience News", "description": "New research reveals that brain cells use a muscle-like signaling mechanism to relay information over long distances.", "url": "https://neurosciencenews.com/dendrite-memory-learning-muscle-28406/", "urlToImage": "https://neurosciencenews.com/files/2025/02/muscle-memory-brain-neurosicence.jpg", "publishedAt": "2025-02-07T22:07:24Z", "content": "Summary: New research reveals that brain cells use a muscle-like signaling mechanism to relay information over long distances. Scientists discovered that dendrites, the branch-like extensions of neur… [+8160 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "'Marsquakes' may solve 50-year-old mystery about the Red Planet - Space.com", "description": "Data collected by NASA's InSight lander suggest that ancient internal processes are responsible for the \"Martian dichotomy\" that splits the Red Planet into two distinct halves.", "url": "https://www.livescience.com/space/mars/marsquakes-may-solve-50-year-old-mystery-about-the-red-planet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/J64ZH2P57TaMZpoWJo4Moc-1200-80.jpg", "publishedAt": "2025-02-07T22:04:25Z", "content": "Recordings of Martian earthquakes, or \"marsquakes,\" collected by a robot on the Red Planet may have finally solved a 50-year-old mystery: why one half of Mars is so drastically different from the oth… [+3683 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gaia Just Found Two Massive Objects That Shouldn’t Exist – And Astronomers Are Stunned - SciTechDaily", "description": "Scientists using data from the European Space Agency’s Gaia mission have made a groundbreaking discovery: a massive exoplanet and a brown dwarf. This marks the first time a planet has been identified solely through Gaia’s ability to detect the tiny gravitatio…", "url": "https://scitechdaily.com/gaia-just-found-two-massive-objects-that-shouldnt-exist-and-astronomers-are-stunned/", "urlToImage": "https://scitechdaily.com/images/Brown-Dwarf-Gaia-5b.jpg", "publishedAt": "2025-02-07T21:23:02Z", "content": "This is an artist impression of the exoplanet Gaia-4b and the brown dwarf Gaia-5b, which were both discovered by ESA’s Gaia mission. This artist impression visualises a portion of the orbital motions… [+7960 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kristina Killgrove", "title": "In a 1st, ancient proteins reveal sex of human relative from 3.5 million years ago - Livescience.com", "description": "Researchers have extracted ancient proteins from australopithecine fossils and determined whether they were male or female — a first for human evolution studies.", "url": "https://www.livescience.com/archaeology/in-a-1st-ancient-proteins-reveal-sex-of-human-relative-from-3-5-million-years-ago", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CNoD85sQCDo39etJyNur9d-1200-80.png", "publishedAt": "2025-02-07T20:42:28Z", "content": "In a first, scientists have used ancient proteins to determine the sex of an archaic human relative that lived up to 3.5 million years ago, a new study reports.\r\nAn international team of scientists e… [+3435 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "First Look! NASA’s Europa Clipper Captures Stunning Starry Image on Its Way to Jupiter’s Icy Moon - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s Europa Clipper has sent back its first starry image from deep space, marking a key milestone on its 1.8-billion-mile journey to Jupiter’s icy moon, Europa. Captured just two months after launch, the image showcases distant stars that will help the spac…", "url": "https://dailygalaxy.com/2025/02/europa-clipper-starry-image-jupiter-moon/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/First-Look-NASAs-Europa-Clipper-Captures-Stunning-Starry-Image-on-Its-Way-to-Jupiters-Icy-Moon.jpg", "publishedAt": "2025-02-07T20:15:26Z", "content": "NASAs Europa Clipper spacecraft has sent back its first starry image, a significant milestone as it makes its way toward Jupiters moon Europa. The image, released by NASA this week, is a mosaic of a … [+2849 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "NASA solar mission data recovering after server room flood fiasco - The Register", "description": "Spacecraft weather solar storms, but ground processing laid low by water", "url": "https://www.theregister.com/2025/02/07/nasa_solar_mission_data_recovering/", "urlToImage": "https://regmedia.co.uk/2021/04/06/shutterstock_flooded_data_center.jpg", "publishedAt": "2025-02-07T19:15:00Z", "content": "They can put a man on the Moon - but back on Earth, a busted water pipe managed to knock out NASA's solar mission data for months.\r\nData from two NASA solar missions is becoming available again follo… [+2330 chars]"}, {"source": {"id": null, "name": "Orlando Sentinel"}, "author": "Richard Tribou, Orlando Sentinel", "title": "Watchdog panel’s annual NASA safety report reveals new Boeing Starliner issue, questions viable future - Yahoo! Voices", "description": "The annual watchdog report tasked to gauge NASA safety commended the agency’s handling of last year’s beleaguered Boeing’s Starliner mission, but revealed...", "url": "https://www.orlandosentinel.com/2025/02/07/watchdog-panels-annual-nasa-safety-report-reveals-new-boeing-starliner-issue-questions-viable-future/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aqo08JJ124eWcKdAmz33CQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/orlando_sentinel_national_858/e5e22caa3b15659d2fe46f969b192a0f", "publishedAt": "2025-02-07T18:45:00Z", "content": "The annual watchdog report tasked to gauge NASA safety commended the agencys handling of last years beleaguered Boeings Starliner mission, but revealed yet another issue found during the flight and q… [+6015 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "Tiny spacecraft could travel across interstellar space with this 'trampoline' lightsail - Space.com", "description": "\"The lightsail will travel faster than any previous spacecraft, with potential to eventually open interstellar distances to direct spacecraft exploration.\"", "url": "https://www.space.com/space-exploration/tech/tiny-spacecraft-could-travel-to-distant-star-systems-with-this-trampoline-lightsail", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Kak6gMtFDKjLPVVBW73njY-1200-80.jpg", "publishedAt": "2025-02-07T18:00:00Z", "content": "Scientists at the California Institute of Technology have taken a major step toward developing lightsails that could one day carry tiny spacecraft to distant star systems.\r\nThe new findings detail a … [+4705 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "There could be a supermassive black hole in the Large Magellanic Cloud hurling stars at the Milky Way - Phys.org", "description": "Hypervelocity stars (HVSs) were first theorized to exist in the late 1980s. In 2005, the first discoveries were confirmed. HVSs travel much faster than normal stars, and sometimes, they can exceed the galactic escape velocity. Astronomers estimate that the Mi…", "url": "https://phys.org/news/2025-02-supermassive-black-hole-large-magellanic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/there-could-be-a-super.jpg", "publishedAt": "2025-02-07T17:55:36Z", "content": "Hypervelocity stars (HVSs) were first theorized to exist in the late 1980s. In 2005, the first discoveries were confirmed. HVSs travel much faster than normal stars, and sometimes, they can exceed th… [+6583 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Black holes could 'bend it like Beckham' to reveal hidden asymmetries of the universe - Space.com", "description": "\"This cosmic soccer game is far from over!\"", "url": "https://www.space.com/black-hole-mirror-image-hidden-symmetry-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SMxrL7cmeWjnpFbBaY8fWU-1200-80.png", "publishedAt": "2025-02-07T17:49:42Z", "content": "By observing tiny ripples in spacetime called \"gravitational waves\" that propagate away from colliding black holes, scientists could reveal hidden asymmetries in the universe.\r\nThe team behind new re… [+9407 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Stunning, rainbow-colored object spotted by James Webb telescope could be an alien solar system in the making - Livescience.com", "description": "The James Webb Space Telescope has captured a belching protostar in its infancy. By studying the dust grains whirling around it, astronomers hope to better understand how solar systems like our own take shape.", "url": "https://www.livescience.com/space/astronomy/stunning-rainbow-colored-object-spotted-by-james-webb-telescope-could-be-an-alien-solar-system-in-the-making", "urlToImage": "https://cdn.mos.cms.futurecdn.net/WpUe2E2jTETuMXMRrQYwNK-1200-80.jpg", "publishedAt": "2025-02-07T17:10:36Z", "content": "The James Webb Space Telescope\r\n (JWST) has captured a stunning image of a young star firing energy into space, illuminating a protoplanetary disk from which a new solar system may form.\r\nThe young s… [+2504 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Supermassive black hole captured in an unexpected spin shift - Earth.com", "description": "New details have been discovered about M87*, the first black hole ever photographed, revealing its plasma, its brightness and its evolution.", "url": "https://www.earth.com/news/supermassive-black-hole-m87-captured-in-an-unexpected-spin-shift/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/03052649/black-hole-spin-shift-discovery.jpg", "publishedAt": "2025-02-07T16:26:47Z", "content": "M87* is the first black hole ever photographed. It sits in the center of the massive galaxy Messier 87, which is located about 340 quintillion miles from Earth.\r\nThis cosmic giant, which holds roughl… [+4049 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mary Beth King", "title": "New DNA research examines predecessors of Red Lady of El Mirón - Phys.org", "description": "About 19,000 years ago, a woman from a group of hunter-gatherers died and was buried in a cave in northern Spain. In 1996, archaeologists started exploring the cave, finding abundant evidence of prehistoric people and their activities.", "url": "https://phys.org/news/2025-02-dna-predecessors-red-lady-el.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-dna-research-exami.jpg", "publishedAt": "2025-02-07T16:17:46Z", "content": "About 19,000 years ago, a woman from a group of hunter-gatherers died and was buried in a cave in northern Spain. In 1996, archaeologists started exploring the cave, finding abundant evidence of preh… [+6068 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Loretta Waldman", "title": "Genetic study sheds light on changes that shaped human brain evolution - Phys.org", "description": "A new Yale study provides a fuller picture of the genetic changes that shaped the evolution of the human brain, and how the process differed from the evolution of chimpanzees.", "url": "https://phys.org/news/2025-02-genetic-human-brain-evolution.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/human-who-is-person-of.jpg", "publishedAt": "2025-02-07T16:17:28Z", "content": "A new Yale study provides a fuller picture of the genetic changes that shaped the evolution of the human brain, and how the process differed from the evolution of chimpanzees.\r\nFor the study, publish… [+4517 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Largest radio jet ever seen provides a glimpse of the young universe - Earth.com", "description": "By revealing a massive radio jet in the early universe, J1601+3102 offers a rare snapshot of early quasar activity.", "url": "https://www.earth.com/news/largest-radio-jet-ever-seen-provides-a-glimpse-of-the-young-universe/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/07090913/Radio-jet.jpg", "publishedAt": "2025-02-07T16:11:46Z", "content": "For decades, astronomers have known that supermassive black holes lie at the centers of most galaxies. These gravitational giants devour infalling gas and dust, releasing extraordinary amounts of ene… [+6016 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launching 21 Starlink satellites from Florida on Feb. 8 - Space.com", "description": "Liftoff is scheduled for 1:23 p.m. ET.", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-satellite-launch-group-12-9", "urlToImage": "https://cdn.mos.cms.futurecdn.net/GSpy4ziAEFviHPN4dMqcCf-1200-80.jpg", "publishedAt": "2025-02-07T16:00:10Z", "content": "SpaceX is set to launch another batch of its Starlink internet satellites from Florida's Space Coast on Saturday (Feb. 8).\r\nA Falcon 9 rocket carrying 21 Starlink spacecraft, including 13 with direct… [+1685 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kavli Institute for the Physics and Mathematics of the Universe (Kavli IPMU)", "title": "Astronomers find dark matter dominating in early universe galaxies - Phys.org", "description": "An international team of researchers has found dark matter dominating the halos of two supermassive black holes in galaxies roughly 13 billion light years away. Their study, published in The Astrophysical Journal, gives new insight into the relationship betwe…", "url": "https://phys.org/news/2025-02-astronomers-dark-dominating-early-universe.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-find-dark.jpg", "publishedAt": "2025-02-07T15:10:48Z", "content": "An international team of researchers has found dark matter dominating the halos of two supermassive black holes in galaxies roughly 13 billion light years away. Their study, published in The Astrophy… [+3637 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Scientists say 2 asteroids may actually be fragments of destroyed planets from our early solar system - Space.com", "description": "They're calling them \"planetary embryos\".", "url": "https://www.space.com/the-universe/solar-system/scientists-say-2-asteroids-may-actually-be-fragments-of-destroyed-planets-from-our-early-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Sc85CEpUMGEaxFnK8ewGWD-1200-80.jpg", "publishedAt": "2025-02-07T15:00:00Z", "content": "Scientists believe that two asteroids might be fragments of long-lost \"planetary embryos\" from the early solar system.\r\nThese embryos, somewhere between small planetesimals and fully formed planets, … [+6526 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "The ‘Great Comet of 2025’ Lights Up the Skies in Stunning Photos - PetaPixel", "description": "Astrophotographers in the southern hemisphere captured remarkable images.", "url": "https://petapixel.com/2025/02/07/the-great-comet-of-2025-g3-atlas-lights-up-the-skies-in-stunning-photos/", "urlToImage": "https://petapixel.com/assets/uploads/2025/02/CometG3.jpg", "publishedAt": "2025-02-07T14:48:05Z", "content": "Photo credit: Tapiaphotos, left, Yuri Beletsky/ESO, right.\r\nComet G3 (ATLAS) recently appeared in the skies above Earth: a rare celestial visitor that is thought to appear just once every 600,000 yea… [+2404 chars]"}, {"source": {"id": null, "name": "Defector.com"}, "author": null, "title": "Chimpanzee Culture Is Disappearing Because Of Us - Defector", "description": "For millennia, the western chimpanzees of Taï National Park in Ivory Coast have communicated with each other in a dialect of their own. They do not speak in words, but rather through gestures. In one gesture called leaf clip, a chimpanzee will take a leaf off…", "url": "https://defector.com/chimpanzee-culture-is-disappearing-because-of-us", "urlToImage": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2025/02/Chimpanzee_in_Tai_National_Forest.jpg", "publishedAt": "2025-02-07T14:27:00Z", "content": "For millennia, the western chimpanzees of Taï National Park in Ivory Coast have communicated with each other in a dialect of their own. They do not speak in words, but rather through gestures. In one… [+5977 chars]"}, {"source": {"id": null, "name": "Slate Magazine"}, "author": "Shannon Stirone", "title": "There Is Basically One Point to Space Exploration. Right Now, We’re Missing It. - Slate", "description": "Efforts to scrub DEI from NASA's websites get it all wrong.", "url": "https://slate.com/technology/2025/02/nasa-dei-trump-webb-telescope-carl-sagan.html", "urlToImage": "https://compote.slate.com/images/801fcde7-a6b3-40b5-838f-231f0c4a2a3c.png?crop=1900%2C1267%2Cx61%2Cy0&width=1560", "publishedAt": "2025-02-07T14:00:00Z", "content": "Sign up for the Slatest to get the most insightful analysis, criticism, and advice out there, delivered to your inbox daily.\r\nWhats the function of a galaxy? the speculative fiction writer Ursula K. … [+6207 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Once Thought to Be the Ocean’s Ultimate Predator, “Great White Sharks” Now Face a Deadly New Threat - The Daily Galaxy --Great Discoveries Channel", "description": "For years, great white sharks ruled the oceans without fear. But something has changed—an unexpected predator is targeting them with surgical precision. A recent discovery in Australia has confirmed what scientists long suspected. The balance of power in the …", "url": "https://dailygalaxy.com/2025/02/once-thought-to-be-the-oceans-ultimate-predator-great-white-sharks-now-face-a-deadly-new-threat/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Great-White-Shark.jpg", "publishedAt": "2025-02-07T14:00:00Z", "content": "A new marine predator rivalry is emerging in the waters of Australia, shaking up the long-established hierarchy of the oceans. The great white shark, long feared as the apex predator of the seas, is … [+3238 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Hopping robot will hunt for moon water on China's Chang'e 7 lunar mission in 2026 - Space.com", "description": "The hopper will carry a water molecule analyzer into permanently shadowed craters.", "url": "https://www.space.com/the-universe/moon/hopping-robot-will-hunt-for-moon-water-on-chinas-2026-lunar-mission", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8it9UzqahpcpTECQbdUQDY-1200-80.jpg", "publishedAt": "2025-02-07T13:00:00Z", "content": "China is preparing to launch a pioneering mission to the moon next year to search for definitive evidence of water at the lunar south pole.\r\nThe Chang'e 7 mission\r\n will consist of a lander, a rover … [+2224 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sudeep Singh Rawat", "title": "Failing Starlink satellites worry scientists, 120 fell from space in Jan - Business Standard", "description": "Elon Musk's Starlink Satellites: As the cases of SpaceX's Starlink satellite falling from space rise, scientists are concerned over its environmental impact which could potentially harm the ozone layer", "url": "https://www.business-standard.com/world-news/failing-starlink-satellites-worry-scientists-120-fell-from-space-in-jan-nc-125020701419_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2025-02/07/full/1738930984-217.png", "publishedAt": "2025-02-07T12:41:01Z", "content": "As the cases of SpaceX's Starlink satellite falling from space rise, scientists are concerned over its environmental impact which could potentially harm the ozone layer\r\n120 SpaceX Starlink satellite… [+2814 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Rocket Report: Another hiccup with SpaceX upper stage; Japan’s H3 starts strong - Ars Technica", "description": "Vast’s schedule for deploying a mini-space station in low-Earth orbit was always ambitious.", "url": "https://arstechnica.com/space/2025/02/rocket-report-blue-origin-flies-for-lunar-research-dods-new-interest-in-starship/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/f9_starlink_stack1-1152x648.jpg", "publishedAt": "2025-02-07T12:00:27Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Quantum Device Successfully Simulated Terrifying Way For The Universe To End - IFLScience", "description": "The breakthrough paves the way to better understanding the peculiar False Vacuum Decay.", "url": "https://www.iflscience.com/quantum-device-successfully-simulated-terrifying-way-for-the-universe-to-end-77954", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77954/aImg/81984/fvd-meta.jpg", "publishedAt": "2025-02-07T11:40:46Z", "content": "Quantum computers hold the promise to revolutionize so many different aspects of science. They can tackle problems that even the most powerful supercomputer wouldnt be able to deal with. The problem … [+3571 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Amateur Astrophotographer Photographs NASA Astronaut Conducting Record-Breaking Space Walk - IFLScience", "description": "Suni Williams conducted a record-breaking spacewalk outside the ISS. An amateur astrophotographer photographed her from Earth.", "url": "https://www.iflscience.com/amateur-astrophotographer-photographs-nasa-astronaut-conducting-record-breaking-space-walk-77947", "urlToImage": "https://assets.iflscience.com/assets/articleNo/77947/aImg/81975/suni-williams-meta.png", "publishedAt": "2025-02-07T11:02:30Z", "content": "An amateur astrophotographer has captured an astonishing image of NASA astronaut Suni Williams conducting a record-breaking spacewalk outside the International Space Station (ISS).Last week, NASA ast… [+2898 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Timothy McGill", "title": "Scientists sound alarm over disturbing discovery about Earth's major ocean currents: 'The urgency for ... action has never been clearer' - Yahoo! Voices", "description": "\"We gain a clearer understanding of how these dynamics have varied over millennia and what this means for our current climate trajectory.\"", "url": "https://www.yahoo.com/news/scientists-sound-alarm-over-disturbing-110018315.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ziD7E43TwVfa8hlcafxfVw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/the_cool_down_737/b8ab82e8d387464f017617c9f9d71f08", "publishedAt": "2025-02-07T11:00:18Z", "content": "A recent study reveals our warming world is triggering shifts in winds and ocean currents, which is likely contributing to an increase in harmful carbon pollution.\r\nWhat's happening?\r\nAn internationa… [+2923 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "John Loeffler", "title": "New fast radio burst detector could sift through 'a whole beach of sand' to solve big cosmic mystery - Space.com", "description": "The system, called CRACO, can search through 100 billion pixels of night sky a second", "url": "https://www.space.com/space-exploration/tech/new-fast-radio-burst-detector-could-sift-through-a-whole-beach-of-sand-to-solve-big-cosmic-mystery", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LWUfutjYNVUz3uAN7GKfmf-1200-80.jpg", "publishedAt": "2025-02-07T11:00:00Z", "content": "Researchers have successfully tested a new technology that detects fast radio bursts in the night sky faster than ever before, uncovering a treasure trove of data to help astronomers investigate the … [+3554 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "There’s a Way to Make Ringworlds and Dyson Spheres Stable - Universe Today", "description": "The idea of Dyson Sphere’s has been around for decades. When Freeman Dyson explored the concept he acknowledged that they may not be a physical sphere but could be a swarm of satellites in a spherical configuration around a star. The challenge with a solid sp…", "url": "https://www.universetoday.com/170814/theres-a-way-to-make-ringworlds-and-dyson-spheres-stable/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2025/02/dyson-sphere.jpeg", "publishedAt": "2025-02-07T09:29:01Z", "content": "The idea of Dyson Spheres has been around for decades. When Freeman Dyson explored the concept he acknowledged that they may not be a physical sphere but could be a swarm of satellites in a spherical… [+3357 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA endorses Year of Asteroid Awareness and Planetary Defence - European Space Agency", "description": "The European Space Agency (ESA) has endorsed the United Nations' (UN) designation of 2029 as the International Year of Asteroid Awareness and Planetary Defence.The initiative will foster international collaboration in the field of planetary defence and educat…", "url": "https://www.esa.int/Space_Safety/Planetary_Defence/ESA_endorses_Year_of_Asteroid_Awareness_and_Planetary_Defence", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2011/10/space_safety_programme_-_near_earth_objects/9686616-7-eng-GB/Space_Safety_Programme_-_Near_Earth_Objects_pillars.jpg", "publishedAt": "2025-02-07T09:06:22Z", "content": "Space Safety07/02/20251271 views17 likes\r\nThe European Space Agency (ESA) has endorsed the United Nations' (UN) designation of 2029 as the International Year of Asteroid Awareness and Planetary Defen… [+6700 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": null, "title": "Ask Ethan: What are the worst cosmic misnomers? - Big Think", "description": "Historically, astronomers have often named things creatively, bizarrely, and often inaccurately. But which terms are the most egregious?", "url": "https://bigthink.com/starts-with-a-bang/worst-cosmic-misnomers/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/10/https___specials-images.forbesimg.com_imageserve_5bbd20ca4bbe6f7684a669c9_The-protoplanetary-nebula-known-as-the-Egg-Nebula-in-its-dying-stages-_960x0-e1738863490284.jpg?w=960&h=541&crop=1", "publishedAt": "2025-02-07T07:00:00Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Water Arrived in the Final Stages of Earth's Formation - Universe Today", "description": "Roughly 4.6 billion years ago, the Sun was born from the gas and dust of a nebula that underwent gravitational collapse. The remaining gas and dust settled into a protoplanetary disk that slowly accreted to form the planets, including Earth. About 4.5 billion…", "url": "https://www.universetoday.com/170759/water-arrived-in-the-final-stages-of-earths-formation/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/earlyearth.jpg__1240x510_q85_crop_subsampling-2-e1690838699445.jpg", "publishedAt": "2025-02-07T03:14:34Z", "content": "Roughly 4.6 billion years ago, the Sun was born from the gas and dust of a nebula that underwent gravitational collapse. The remaining gas and dust settled into a protoplanetary disk that slowly accr… [+4940 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "The Pandemic Did Not Affect The Moon After All, Scientists Say - ScienceAlert", "description": "Can a global pandemic affect temperatures on the Moon? A 2024 study linked worldwide lockdowns with a drop in heat radiation reaching the Moon from Earth – but now scientists say that wasn't actually what was going on.", "url": "https://www.sciencealert.com/the-pandemic-did-not-affect-the-moon-after-all-scientists-say", "urlToImage": "https://www.sciencealert.com/images/2025/02/MoonSky.jpg", "publishedAt": "2025-02-07T01:10:16Z", "content": "Can a global pandemic affect temperatures on the Moon? A 2024 study linked worldwide lockdowns with a drop in heat radiation reaching the Moon from Earth but now scientists say that wasn't actually w… [+2953 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "AI invented a new miracle material that’s as strong as steel but light as foam - BGR", "description": "A new AI-created wonder material is stronger than steel but as light as styrofoam and could revolutionize transportation designs.", "url": "https://bgr.com/science/ai-invented-a-new-miracle-material-thats-as-strong-as-steel-but-light-as-foam/", "urlToImage": "https://bgr.com/wp-content/uploads/2023/01/AdobeStock_129269744.jpeg?quality=82&strip=all", "publishedAt": "2025-02-07T00:12:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Bonobos Know Something You Don't Know, And Are Willing to Tell For a Price - ScienceAlert", "description": "Previously thought to be an exclusively human skill, knowing when a friend could use a clue appears to be a talent we share with our primate cousins.", "url": "https://www.sciencealert.com/bonobos-know-something-you-dont-know-and-are-willing-to-tell-for-a-price", "urlToImage": "https://www.sciencealert.com/images/2025/02/BabyBonobo.jpg", "publishedAt": "2025-02-06T22:01:32Z", "content": "Previously thought to be an exclusively human skill, knowing when a friend could use a clue appears to be a talent we share with our primate cousins.\r\nResearchers from Johns Hopkins University in Mar… [+2717 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ABC News", "title": "Falling space debris is increasingly threatening airplanes, researchers say - ABC News", "description": null, "url": "https://abcnews.go.com/Technology/falling-space-debris-increasingly-threatening-airplanes-researchers/story?id\\\\u003d118534247", "urlToImage": null, "publishedAt": "2025-02-06T21:59:24Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "NASA’s PUNCH Mission Will Capture the Solar Wind in 3D—And It Could Change Space Weather Forever - The Daily Galaxy --Great Discoveries Channel", "description": "NASA’s PUNCH mission is set to revolutionize our understanding of the solar wind by capturing it in 3D for the first time. Using a network of four satellites, PUNCH will track how the Sun’s corona extends into space, providing critical insights into solar sto…", "url": "https://dailygalaxy.com/2025/02/nasas-punch-mission-capture-the-solar-wind/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/NASAs-PUNCH-Mission-Will-Capture-the-Solar-Wind-in-3D—And-It-Could-Change-Space-Weather-Forever.jpg", "publishedAt": "2025-02-06T20:08:44Z", "content": "NASA is preparing to launch PUNCH (Polarimeter to Unify the Corona and Heliosphere), a groundbreaking mission that will use four satellites to study the solar wind in 3D. The mission, set to launch o… [+4376 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Gretchen Rundorff", "title": "How to see Jupiter 'kiss' the moon tonight — before Mars breaks them up this weekend - Livescience.com", "description": "Jupiter and Mars will appear to make ultraclose approaches to the moon on two nights this week. Here's how to get the best view, starting tonight.", "url": "https://www.livescience.com/space/planets/how-to-see-jupiter-kiss-the-moon-tonight-before-mars-breaks-them-up-this-weekend", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qzUzfCbo272aGrepZV2GzV-1200-80.jpg", "publishedAt": "2025-02-06T17:06:23Z", "content": "The bright moon is about to host some special guests in the night sky: On two nights this week, you'll have the opportunity to see Mars\r\n and Jupiter make a close approach to Earth's natural satellit… [+3224 chars]"}]}