{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 52 Starlink satellites, lands rocket at sea - Space.com", "description": "The early-morning liftoff was the first of two planned SpaceX missions today (June 12).", "url": "https://www.space.com/spacex-starlink-launch-group-5-11", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9L6NjnNwodQ9ddfEYdFqQ-1200-80.jpeg", "publishedAt": "2023-06-12T07:31:47Z", "content": "SpaceX launched another big batch of its Starlink internet satellites to orbit early Monday morning (June 12) and landed the returning rocket at sea.\r\nA Falcon 9 rocket topped with 52 Starlink spacec… [+1882 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Scientists Ponder When Our Ancestors First Started Cranking the Hog - Futurism", "description": "Our primate predecessors may have enjoyed masturbation for millions of years before we ever entered the picture.", "url": "https://futurism.com/the-byte/scientists-ponder-ancestors-masturbating", "urlToImage": "https://wp-assets.futurism.com/2023/06/scientists-ponder-ancestors-masturbating.jpg", "publishedAt": "2023-06-12T07:04:57Z", "content": "\"It's not that some species woke up one day and started doing it. This is an ancient, evolved trait.\"\r\nOld Habits\r\nThanks to science, we may now have a good idea of when our ancestors first started p… [+2897 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Recipe for how to kill a galaxy revealed at last - Big Think", "description": "With hundreds of billions of stars burning bright, some galaxies are already dead. Their inhabitants might not know it, but we're certain.", "url": "https://bigthink.com/starts-with-a-bang/how-to-kill-a-galaxy/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/cover-NGC1277.jpg?resize=1184,630", "publishedAt": "2023-06-12T06:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Physicists Conduct The Most Massive Test Ever of The Einstein-Podolsky-Rosen Paradox - ScienceAlert", "description": "In the most massive test to date, physicists have probed a major paradox in quantum mechanics and found it still holds even for clouds of hundreds of atoms.", "url": "https://www.sciencealert.com/physicists-conduct-the-most-massive-test-ever-of-the-einstein-podolsky-rosen-paradox", "urlToImage": "https://www.sciencealert.com/images/2023/06/quantum-entanglement.jpg", "publishedAt": "2023-06-12T04:31:11Z", "content": "In the most massive test to date, physicists have probed a major paradox in quantum mechanics and found it still holds even for clouds of hundreds of atoms.\r\nUsing two entangled Bose-Einstein condens… [+5313 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers “Split” Phonons in Step Toward New Type of Linear Mechanical Quantum Computer - SciTechDaily", "description": "The experiments are the first of their kind and could lead to new advances in computing. A team at the University of Chicago has explored the quantum properties of phonons, the quantum particles that transmit sound. They have shown that phonons can be \"split\"…", "url": "https://scitechdaily.com/researchers-split-phonons-in-step-toward-new-type-of-linear-mechanical-quantum-computer/", "urlToImage": "https://scitechdaily.com/images/Researchers-Split-Phonons.jpg", "publishedAt": "2023-06-12T03:07:12Z", "content": "ByUniversity of ChicagoJune 11, 2023\r\nArtists impression of a platform for linear mechanical quantum computing (LMQC). The central transparent element is a phonon beam splitter. Blue and red marbles … [+9612 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Revolution in neuroscience: 2D nanomaterials propel advances in brain repair, treatment, and diagnosis - News-Medical.Net", "description": "Review discusses the increasing importance of two-dimensional nanomaterials like graphene in neuroscience, highlighting their potential in nerve repair, creating brain-mimicking synaptic devices, and treating neurological disorders. It also considers the chal…", "url": "https://www.news-medical.net/news/20230611/Revolution-in-neuroscience-2D-nanomaterials-propel-advances-in-brain-repair-treatment-and-diagnosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_750643_16863303716952839.jpg", "publishedAt": "2023-06-12T01:47:00Z", "content": "Different types of nanomaterials have been used in neuroscience, including two-dimensional (2D) nanomaterials widely known for their unique structures and physicochemical properties. In a recent Jour… [+5976 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "New Device Detects Radiation at a Trillionth of The Usual Scale - ScienceAlert", "description": "A team of researchers has accurately measured power at a scale that's a trillion times smaller than what's possible with standard instruments.", "url": "https://www.sciencealert.com/new-device-detects-radiation-at-a-trillionth-of-the-usual-scale", "urlToImage": "https://www.sciencealert.com/images/2023/06/CryogenicMeasurement.jpg", "publishedAt": "2023-06-11T23:31:11Z", "content": "A team of researchers has accurately measured power at a scale that's a trillion times smaller than what's possible with standard instruments. It means microwave radiation can be more precisely asses… [+3208 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Italian supervolcano may erupt after more than 500 years - study - The Jerusalem Post", "description": "Researchers emphasize that further investigation is needed to accurately predict the occurrence of an eruption.", "url": "https://www.jpost.com/science/article-745979", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/474415", "publishedAt": "2023-06-11T22:48:00Z", "content": "The Campi Flegrei supervolcano in southern Italy has reportedly weakened, increasing the likelihood of an eruption, according to new research conducted by the University College London (UCL) and Ital… [+4387 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "New discoveries in U. Health study find brain mechanism that potentially causes anxiety - KSL.com", "description": "A study conducted by University of Utah Health scientists may be one of the first steps toward understanding the root causes of anxiety and anxiety-related conditions.", "url": "https://www.ksl.com/article/50662023/new-discoveries-in-u-health-study-find-brain-mechanism-that-potentially-causes-anxiety", "urlToImage": "https://img.ksl.com/slc/2933/293351/29335147.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-06-11T22:12:21Z", "content": "Estimated read time: 3-4\r\n minutes\r\nSALT LAKE CITY Over 33% of adults in Utah have reported having symptoms of anxiety and/or depression a figure that has only climbed in recent years. But a study co… [+4200 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "From Thought to Text: AI Converts Silent Speech into Written Words - Neuroscience News", "description": "A novel artificial intelligence system, the semantic decoder, can translate brain activity into continuous text.", "url": "https://neurosciencenews.com/thoight-text-ai-decoder-23437/", "urlToImage": "https://neurosciencenews.com/files/2023/06/ai-thought-speech-neurosuce.jpg", "publishedAt": "2023-06-11T19:51:28Z", "content": "Summary: A novel artificial intelligence system, the semantic decoder, can translate brain activity into continuous text. The system could revolutionize communication for people unable to speak due t… [+6687 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  AARON REICH", "title": "Titanic asteroid the size of 84 orcas to pass Earth on Monday - NASA - The Jerusalem Post", "description": "Asteroid 488453 (1994 XD) is as wide as 830 meters, according to NASA. However, it is in no danger of hitting the Earth.", "url": "https://www.jpost.com/science/article-745973", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/514024", "publishedAt": "2023-06-11T19:26:00Z", "content": "A massive asteroid the size of 84 orcas is set to pass by the Earth on Monday, June 12, according to NASA's asteroid tracker.\r\nThe asteroid in question has been designated 488453 (1994 XD), according… [+4289 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jessica Orwig", "title": "NASA scientist: Microbial life hiding on moon's south pole - Business Insider", "description": "Extreme microbes on Earth have demonstrated they can survive harsh conditions similar to the lunar surface. The question is: Are they there right now?", "url": "https://www.businessinsider.com/nasa-scientist-microbial-life-hiding-on-moon-south-pole-2023-6", "urlToImage": "https://i.insider.com/6486114d05024f0019029b99?width=1200&format=jpeg", "publishedAt": "2023-06-11T18:55:00Z", "content": "Compared to Earth, the moon is a desolate place. Devoid of flowing water, wispy clouds, and signs of life. Except, one NASA scientist thinks there's more to the moon than meets the eye. \r\nPrabal Saxe… [+2416 chars]"}, {"source": {"id": null, "name": "St George News"}, "author": null, "title": "Bryce Canyon National Park: Monster crocs hungry for more than scenery once roamed the area - St George News", "description": "TROPIC — Standing at Sunrise Point in Bryce Canyon today, visitors can see a forest of colorful hoodoos reaching skyward in the natural amphitheater that make up this unique Southern Utah national park. Standing in the same place eons ago, they would have see…", "url": "https://www.stgeorgeutah.com/news/archive/2023/06/11/prc-bryce-canyon-national-park-monster-crocs-hungry-for-more-than-scenery-once-roamed-the-area/", "urlToImage": "https://www.stgeorgeutah.com/wp-content/uploads/2023/06/Croc-FI.jpg", "publishedAt": "2023-06-11T18:52:21Z", "content": "TROPIC Standing at Sunrise Point in Bryce Canyon today, visitors can see a forest of colorful hoodoos reaching skyward in the natural amphitheater that make up this unique Southern Utah national park… [+8121 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genetic Jigsaw: Piecing Together the Human Pangenome - SciTechDaily", "description": "Dr. Eimear Kenny, a renowned professor of Medicine, Genetics, and Genomic Sciences at the Icahn School of Medicine at Mount Sinai, has made substantial contributions to the international Human Pangenome Reference Consortium, leading to the creation of a more …", "url": "https://scitechdaily.com/genetic-jigsaw-piecing-together-the-human-pangenome/", "urlToImage": "https://scitechdaily.com/images/Human-Puzzle-Pieces-Illustration-Art.jpg", "publishedAt": "2023-06-11T18:43:40Z", "content": "ByThe Mount Sinai Hospital / Mount Sinai School of MedicineJune 11, 2023\r\nDr. Eimear Kenny has significantly contributed to the creation of an inclusive human pangenome reference, led by the internat… [+12570 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Nasa to the rescue after potential internet apocalypse - The News International", "description": "Nasa has come to the world's rescue to avoid a potential threat to internet access, better known as the internet apocalypse, a situation that might end people's access to the internet for months or...", "url": "https://www.thenews.com.pk/latest/1079454-nasa-to-the-rescue-after-potential-internet-apocalypse", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-11/1079454_105253_updates.jpg", "publishedAt": "2023-06-11T18:31:00Z", "content": "Nasa has come to the world's rescue to avoid a potential threat to internet access, better known as the internet apocalypse, a situation that might end people's access to the internet for months or y… [+1957 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exotic Matter Uncovered: Physicists Stumble Upon a Material Composed of Bosons - SciTechDaily", "description": "Take a lattice — a flat section of a grid of uniform cells, like a window screen or a honeycomb — and lay another, similar lattice above it. But instead of trying to line up the edges or the cells of both lattices, give the top grid a twist so that you can se…", "url": "https://scitechdaily.com/?p=284932", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Exotic-Material.jpg", "publishedAt": "2023-06-11T17:32:22Z", "content": "Scientists have discovered a new state of matter, termed a bosonic correlated insulator, through the interaction of bosonic particles called excitons. This research could pave the way for new underst… [+5197 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "China to launch lunar telescope in 2026 - The News International", "description": "Just when people believed there were enough satellites in space, China announced its plans to launch a satellite constellation that orbits the moon in an attempt to explore the early days of the...", "url": "https://www.thenews.com.pk/latest/1079434-china-to-launch-lunar-telescope-in-2026", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-11/1079434_091402_updates.jpg", "publishedAt": "2023-06-11T16:31:00Z", "content": "Just when people believed there were enough satellites in space, China announced its plans to launch a satellite constellation that orbits the moon in an attempt to explore the early days of the univ… [+1828 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Inspiring America: James Webb telescope team transforms understanding of our universe - NBC News", "description": "The team behind NASA’s James Webb telescope has inspired awe and has helped humankind to look into the past of how our universe was created like never before...", "url": "https://www.youtube.com/watch?v=WnwVjMKqASM", "urlToImage": "https://i.ytimg.com/vi/WnwVjMKqASM/maxresdefault.jpg", "publishedAt": "2023-06-11T16:19:39Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lost in Space? Why – and How – NASA Gives a Name to Every Spot It Studies on Mars - SciTechDaily", "description": "Martian maps are full of monikers recognizing places on Earth, explorers, and even cartoon characters. NASA’s Perseverance rover is currently investigating rock outcrops alongside the rim of Mars’ Belva Crater. Some 2,300 miles (3,700 kilometers) away, NASA’s…", "url": "https://scitechdaily.com/lost-in-space-why-and-how-nasa-gives-a-name-to-every-spot-it-studies-on-mars/", "urlToImage": "https://scitechdaily.com/images/Belva-Crater-Mars-Close-Up.jpg", "publishedAt": "2023-06-11T16:18:09Z", "content": "ByJet Propulsion LaboratoryJune 11, 2023\r\nThis image from a map of Jezero Crater shows the area NASAs Perseverance Mars rover is currently exploring, including Belva Crater, just below the center of … [+7715 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "Mars isn't as red as you might have thought - Mashable", "description": "A new mosaic image of Mars shows Earth's closest neighbor as much more than a rusty sphere.", "url": "https://mashable.com/article/mars-image-from-space", "urlToImage": "https://helios-i.mashable.com/imagery/articles/03ZIBOH8H7JsWI2vkDLRDOR/hero-image.fill.size_1200x675.v1686495665.jpg", "publishedAt": "2023-06-11T15:41:25Z", "content": null}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Editor", "title": "Ancient sea monsters twice the size of killer whales discovered in museum storage - Study Finds", "description": "This discovery suggests that these ancient creatures could have grown to a jaw-dropping length of up to 47 feet.", "url": "https://studyfinds.org/ancient-sea-monster-killer-whales/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/06/230515161006-pliosaur-artwork.webp", "publishedAt": "2023-06-11T15:00:22Z", "content": "PORTSMOUTH, United Kingdom — A remarkable finding at an Oxfordshire museum is shedding new light on the size of prehistoric marine reptiles. Paleontologists from the University of Portsmouth are shar… [+3095 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Kristin Houser", "title": "New NASA video shows just how big black holes really are - Big Think", "description": "There are 40 billion billion black holes in the universe. Here’s how our Solar System stacks up against ten of them.", "url": "https://bigthink.com/hard-science/nasa-video-big-black-holes/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/black-holes-thumb.jpg?resize=1200,630", "publishedAt": "2023-06-11T15:00:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "What would happen if you fell in a black hole? - Daily Mail", "description": "MailOnline looks at five gruesome deaths that could happen due to astronomical events, from being swallowed by a black hole to a collision with another galaxy.", "url": "https://www.dailymail.co.uk/sciencetech/article-12139805/What-happen-fell-black-hole.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/31/15/71615069-0-image-a-48_1685545027682.jpg", "publishedAt": "2023-06-11T14:55:27Z", "content": "For all the chaos going on down here on Earth, it's easy to forget that we live in a volatile galaxy full of formidable dangers. \r\nFrom space rocks flying at thousands of miles per hour, to black hol… [+13027 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Final countdown? Celebrity supergiant star Betelgeuse in its last flicker - Geo News", "description": "An expert from Japan believes that the core will collapse a few tens of years after the carbon exhaustion", "url": "https://www.geo.tv/latest/492545-final-countdown-celebrity-supergiant-star-betelgeuse-in-its-last-flicker", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-06-11/492545_064950_updates.jpg", "publishedAt": "2023-06-11T13:40:05Z", "content": "Scientists have started debating about when Betelgeuse a red giant star around 500 to 600 lightyears away is going to die in an explosion, as it glowing at 150% of its baseline brightness, becoming a… [+2593 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "We Might Soon Detect the Gravitational Waves from Dying Stars - Universe Today", "description": "Researchers have discovered an exciting new source of gravitational waves. They are the remnants left over from a supernova explosion.", "url": "https://www.universetoday.com/161795/we-might-soon-detect-the-gravitational-waves-from-dying-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/06/remnant.jpg", "publishedAt": "2023-06-11T11:25:49Z", "content": "Researchers have discovered an exciting new source of gravitational waves. They are the remnants left over from a supernova explosion, and they may just reveal the secrets to how those explosions wor… [+3520 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Donavyn Coffey", "title": "25 beautiful nebulas that showcase the wonder of the universe - Livescience.com", "description": "Nebulas — colorful clouds of expanding gas and dust — have long captivated stargazers with their beauty. Here are 25 of the most stunning nebulas in the universe.", "url": "https://www.livescience.com/space/25-gorgeous-nebula-photos-that-capture-the-beauty-of-the-universe", "urlToImage": "https://cdn.mos.cms.futurecdn.net/SCuPrYTx5w7oYqexpkLTU3-1200-80.jpg", "publishedAt": "2023-06-11T11:00:00Z", "content": "Nebulas, which are both hubs of star birth and products of stars' demise, explode and transform with light and color as the stellar life cycle unfolds within them. These giant clouds of dust and gas … [+7205 chars]"}, {"source": {"id": null, "name": "EarthSky"}, "author": null, "title": "The motion of the solar system through our galaxy - EarthSky", "description": null, "url": "https://earthsky.org/space/the-motion-of-the-solar-system-through-milky-way-galaxy/", "urlToImage": "https://earthsky.org/upl/2011/09/ES-logo.clearvoice.LARGE_.jpg", "publishedAt": "2023-06-11T10:43:05Z", "content": "The solar system cruising through the galaxy. pic.twitter.com/CpBaRjyjau\r\n— Tony Dunn (@tony873004) May 25, 2023\r\nThe motion of the solar system\r\nTony Dunn’s newest simulation, produced on software h… [+2015 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Ariana Garcia", "title": "NASA to voyage to 'golden asteroid' worth quadrillions - Chron", "description": "NASA announces a new launch date for its mission to Psyche, a high valuable, metal-rich asteroid.", "url": "https://www.chron.com/news/space/article/nasa-golden-asteroid-18144519.php", "urlToImage": "https://s.hdnux.com/photos/01/33/17/65/23919984/3/rawImage.jpg", "publishedAt": "2023-06-11T10:09:56Z", "content": "NASA plans to launch its mission to the metallic asteroid Psyche this fall. \r\nNASA/JPL-Caltech/ASU\r\nNASA has finally set a new date for its high-anticipated space mission to a massive, metal-rich ast… [+1870 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Waugh Tech Correspondent", "title": "This is what the space colonies of the near future might look like, according to experts - Daily Mail", "description": "Human exploration of space will begin with 'technauts' building structures near Earth, experts say.", "url": "https://www.dailymail.co.uk/sciencetech/article-12177475/This-space-colonies-near-future-look-like-according-experts.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/12/71951947-0-image-a-2_1686309202836.jpg", "publishedAt": "2023-06-11T09:31:07Z", "content": "From Interstellar to the Martian, human space exploration has been a key feature in science fiction blockbusters throughout the years. \r\nBut what will human colonies in space look like in reality?  \r… [+9435 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": null, "title": "Why do horses sleep standing up? - msnNOW", "description": "How do horses snooze where they stand without falling over?", "url": "https://www.livescience.com/animals/land-mammals/why-do-horses-sleep-standing-up", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1coPa5.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-11T09:00:00Z", "content": "If you've ever passed by a field of horses at night, you've probably noticed that they rarely lie down to sleep. So why do these mammals sleep standing up? \r\n© dageldog via Getty Images\r\n Horses slee… [+3749 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Transient Radio Pulses Provide Clues to Mysterious Origin - SciTechDaily", "description": "A mysterious cosmological object in a distant dwarf galaxy is producing Fast Radio Bursts (FRBs), with new research revealing a rare astronomical environment around its source, where magnetic fields twist and undulate. This is the first observation of a magne…", "url": "https://scitechdaily.com/strange-transient-radio-pulses-provide-clues-to-mysterious-origin/", "urlToImage": "https://scitechdaily.com/images/Green-Bank-Telescope-FRB-Directional-Changes.jpg", "publishedAt": "2023-06-11T08:48:27Z", "content": "ByGreen Bank ObservatoryJune 11, 2023\r\nThe Green Bank Telescope was able to observe the directional changes of waves from FRB20190520B as viewed through the lens of a massive stars atmosphere. Credit… [+5649 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Aliens saying `hello` through signals from centre of Milky Way, suggests new study | WION - WION", "description": "The scientists, in their latest search for extraterrestrial life, are trying to carefully listen to the radio pulses that are emerging from the centre of our...", "url": "https://www.youtube.com/watch?v=8JWsvmNZtTw", "urlToImage": "https://i.ytimg.com/vi/8JWsvmNZtTw/maxresdefault.jpg", "publishedAt": "2023-06-11T08:31:05Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "White Dwarf Star Enters Its Crystallization Era, Turning Into A 'Cosmic Diamond' - ScienceAlert", "description": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky.", "url": "https://www.sciencealert.com/white-dwarf-star-enters-its-crystallization-era-turning-into-a-cosmic-diamond", "urlToImage": "https://www.sciencealert.com/images/2023/06/diamond-star.jpg", "publishedAt": "2023-06-11T06:01:15Z", "content": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky. And for some of them, that may actually be sort of true.\r\nAs a certain type of dead star cools, i… [+5584 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "We Asked a NASA Scientist: Has COVID Affected Climate Change? - SciTechDaily", "description": "Has COVID affected climate change? This is a question we actually get a lot because one of the first things that people notice in terms of the environment during COVID was that the air seemed to be a little bit cleaner. And when scientists started looking at …", "url": "https://scitechdaily.com/we-asked-a-nasa-scientist-has-covid-affected-climate-change/", "urlToImage": "https://scitechdaily.com/images/Earth-Climate-Change-Art-Concept.jpg", "publishedAt": "2023-06-11T05:43:55Z", "content": "The COVID-19 pandemic led to a significant decrease in air pollutants like nitrogen dioxide, but its impact on climate change was minimal. Reductions in greenhouse gas emissions were only about 5 to … [+2107 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Gravitational Waves To Explore the Early Universe and Answer Fundamental Questions in Cosmology - SciTechDaily", "description": "A recent study reveals a new mechanism for the production of gravitational waves, involving oscillons—localized non-linear structures that form from oscillating fields. These oscillons, formed after the rapid expansion of the Universe during the inflationary …", "url": "https://scitechdaily.com/harnessing-gravitational-waves-to-explore-the-early-universe-and-answer-fundamental-questions-in-cosmology/", "urlToImage": "https://scitechdaily.com/images/Inflaton-Field-Fragmented-Into-Oscillons.jpg", "publishedAt": "2023-06-10T22:41:16Z", "content": "ByKavli IPMUJune 10, 2023\r\nFigure 1. Schematic of the inflaton field fragmented into oscillons, with superimposed gravitational waves. Credit: Kavli IPMU, Volodymyr Takhistov\r\nA recent study reveals … [+4170 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Built Into the Genome of the Microbes – Scientists Uncover Over 30,000 “Hidden” Viruses - SciTechDaily", "description": "Unveiled within the DNA of unicellular organisms lie thousands of enigmatic viruses. Researchers at the University of Innsbruck, utilizing the high-performance computing cluster known as \"Leo,\" have identified more than 30,000 new viruses embedded within the …", "url": "https://scitechdaily.com/built-into-the-genome-of-the-microbes-scientists-uncover-over-30000-hidden-viruses/", "urlToImage": "https://scitechdaily.com/images/Stowaways-in-the-Genome-scaled.jpg", "publishedAt": "2023-06-10T19:50:57Z", "content": "ByUniversity of InnsbruckJune 10, 2023\r\nThe scientists analysed several gigabyte of microbial DNA sequences. Credit: Fabian Oswald\r\nUnveiled within the DNA of unicellular organisms lie thousands of e… [+6072 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Harness Biology's Favorite Chemical - SciTechDaily", "description": "Diversity is an essential path to discovery for chemists like Professor John Moses of Cold Spring Harbor Laboratory (CSHL). The broader the spectrum of molecules they investigate, the higher the chances of identifying something of value. Moses' lab's recent p…", "url": "https://scitechdaily.com/scientists-harness-biologys-favorite-chemical/", "urlToImage": "https://scitechdaily.com/images/Futuristic-Chemistry-Concept.jpg", "publishedAt": "2023-06-10T18:40:41Z", "content": "ByCold Spring Harbor LaboratoryJune 10, 2023\r\nScientists have developed a new technique called phosphorus fluoride exchange (PFEx), expanding the realm of click chemistry by using phosphorous as a ch… [+4788 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Bella Richards", "title": "Gravimeter for ESA's Hera mission is ready to launch to Dimorphos asteroid - NASASpaceFlight.com - NASASpaceflight.com", "description": "A tiny instrument that can measure the gravity levels of an asteroid has completed its…", "url": "https://www.nasaspaceflight.com/2023/06/grass-update/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/06/Juventas_CubeSat_coming_in_for_asteroid_landing_pillars.jpg", "publishedAt": "2023-06-10T18:35:01Z", "content": "6A tiny instrument that can measure the gravity levels of an asteroid has completed its ground tests, pushing the European Space Agencys (ESA) Hera mission closer to launch. Hera will complete the fi… [+8788 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Defying Fundamental Laws of Biology – Scientists Discover Real-Life Chimeras - SciTechDaily", "description": "Male yellow crazy ants exhibit a unique characteristic of possessing two distinct genomes, each contained within separate cell clusters. The yellow crazy ant, known scientifically as Anoplolepis gracilipes, is notorious for being one of the most devastating i…", "url": "https://scitechdaily.com/defying-fundamental-laws-of-biology-scientists-discover-real-life-chimeras/", "urlToImage": "https://scitechdaily.com/images/Male-Yellow-Crazy-Ant-in-Wild.jpg", "publishedAt": "2023-06-10T17:31:18Z", "content": "ByJohannes Gutenberg University MainzJune 10, 2023\r\nInternational researchers studying the yellow crazy ant, or Anoplolepis gracilipes, found that male ants of this species are chimeras, containing t… [+3494 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hendrik Van Eerten", "title": "Brightest cosmic explosion of all time: How we may have solved the mystery of its puzzling persistence - Phys.org", "description": "First detected accidentally by US military satellites in the late 1960s, cosmic explosions known as gamma ray bursts (GRBs) have come to be understood as the brightest explosions in the universe.", "url": "https://phys.org/news/2023-06-brightest-cosmic-explosion-mystery-puzzling.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/brightest-cosmic-explo.jpg", "publishedAt": "2023-06-10T14:10:01Z", "content": "First detected accidentally by US military satellites in the late 1960s, cosmic explosions known as gamma ray bursts (GRBs) have come to be understood as the brightest explosions in the universe.\r\nTy… [+5435 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unprecedented Image of Black Hole's Powerful Jet and Shadow Captured by Astronomers - SciTechDaily", "description": "Millimeter-VLBI image of the jet and the black hole shadow in Messier 87, obtained with the GMVA array including ALMA, the Greenland Telescope, and the telescope at Metsähovi. An international team of scientists, including Aalto University researchers, has us…", "url": "https://scitechdaily.com/unprecedented-image-of-black-holes-powerful-jet-and-shadow-captured-by-astronomers/", "urlToImage": "https://scitechdaily.com/images/M87-Black-Hole-Jet-and-Shadow-scaled.jpg", "publishedAt": "2023-06-10T14:03:13Z", "content": "ByAalto UniversityJune 10, 2023\r\nScientists have used millimeter-wavelength observations to create an unprecedented image displaying both matter falling into the central black hole and the powerful r… [+11010 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Adam Frew", "title": "Hidden carbon: Fungi and their 'necromass' absorb one-third of the carbon emitted by burning fossil fuels every year - Phys.org", "description": "Beneath our feet, remarkable networks of fungal filaments stretch out in all directions. These mycorrhizal fungi live in partnership with plants, offering nutrients, water and protection from pests in exchange for carbon-rich sugars.", "url": "https://phys.org/news/2023-06-hidden-carbon-fungi-necromass-absorb.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/hidden-carbon-fungi-an.jpg", "publishedAt": "2023-06-10T13:40:38Z", "content": "Beneath our feet, remarkable networks of fungal filaments stretch out in all directions. These mycorrhizal fungi live in partnership with plants, offering nutrients, water and protection from pests i… [+5843 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Thomas Hertog", "title": "Stephen Hawking wanted scientists to 'make black holes' on Earth. Physics says it's possible. - Livescience.com", "description": "When Stephen Hawking and I visited the Large Hadron Collider, he hoped for an unexpected physics breakthrough. His dreams may not be impossible.", "url": "https://www.livescience.com/physics-mathematics/stephen-hawking-wanted-scientists-to-make-black-holes-on-earth-physics-says-its-possible", "urlToImage": "https://cdn.mos.cms.futurecdn.net/K4psEqg5XfYpF3yigFsYUX-1200-80.jpg", "publishedAt": "2023-06-10T13:00:00Z", "content": "\"I hope you'll make black holes,\" Stephen said with a broad smile. \r\nWe exited the cargo lift that had taken us underground into the five-story cavern housing the ATLAS experiment at the CERN lab, th… [+4886 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Ancient reptile Rhynchosaur died off before the dinosaurs due to weak teeth - Earth.com", "description": "Ancient reptile Rhynchosaur died off before the dinosaurs due to weak teeth • Earth.com", "url": "https://www.earth.com/news/ancient-reptile-rhynchosaur-died-off-before-the-dinosaurs-due-to-weak-teeth/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/10065252/Ancient-reptile-scaled.jpg", "publishedAt": "2023-06-10T12:57:25Z", "content": "A recent exploration into the prehistoric past by a research team from the University of Bristol has unveiled fascinating aspects about the Rhynchosaur, an ancient reptile that roamed our planet betw… [+8734 chars]"}, {"source": {"id": null, "name": "Explorersweb.com"}, "author": "Sam Anderson", "title": "New Moon Discovered Orbiting Earth » Explorersweb - ExplorersWeb", "description": "Why should Saturn and Jupiter have all the new moon fun? Turns out planet Earth has a newly-discovered natural satellite, too.", "url": "https://explorersweb.com/earth-new-moon-2023-fw13/", "urlToImage": "https://s3.amazonaws.com/www.explorersweb.com/wp-content/uploads/2023/06/01152201/shutterstock_2290357599-copy.jpg", "publishedAt": "2023-06-10T12:38:33Z", "content": "Why should Saturn and Jupiter have all the new moon fun? Turns out planet Earth has a newly-discovered natural satellite, too.\r\nThats technically correct, because to call the object a proper “moon” i… [+1759 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "Catch a glimpse of the half-lit moon in its third quarter phase today - Space.com", "description": "Unfortunately, the moon sets around midday, so get out and look up early.", "url": "https://www.space.com/third-quarter-moon-june-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HD3BEgZDxk8wzFTXpSYWV7-1200-80.jpg", "publishedAt": "2023-06-10T11:59:02Z", "content": "The moon will be half-lit tonight as it reaches its third quarter phase.\r\nThis phase, also known as the last quarter, marks the halfway point between the full moon and the next new moon which will oc… [+2079 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "A star blew up, and scientists snapped a photo of the violent explosion - Mashable", "description": "The blast was so bright, we can see it on Earth from 21 million light-years away.", "url": "https://mashable.com/article/star-explosion-supernova-space", "urlToImage": "https://helios-i.mashable.com/imagery/articles/07aMr1Qz1T0NkvRthtoKFPt/hero-image.fill.size_1200x675.v1686332069.jpg", "publishedAt": "2023-06-10T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Is THIS the solution to global warming? Scientist claims we should MOVE the Earth away from the sun - Daily Mail", "description": "EXCLUSIVE: Albert Zijlstra, a professor of astrophysics at the University of Manchester, suggests shifting Earth further back from the sun by about three million miles.", "url": "https://www.dailymail.co.uk/sciencetech/article-12165975/Is-solution-global-warming-Scientist-claims-Earth-away-sun.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/16/71961435-0-image-a-6_1686325779017.jpg", "publishedAt": "2023-06-10T08:57:09Z", "content": "Astronomers know full well that the sun is very slowly getting brighter, and in a billion or so years time it will make Earth too hot to live on. \r\nOne scientist is now proposing a radical solution t… [+6883 chars]"}]}