{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Bullseye galaxy reveals stunning rings after galactic impact - Earth.com", "description": "A small blue dwarf galaxy passed through the massive Bullseye galaxy. This impact created nine rings of new stars.", "url": "https://www.earth.com/news/bullseye-galaxy-reveals-stunning-rings-after-galactic-impact/", "urlToImage": "https://cff2.earth.com/uploads/2025/02/05075708/bullseye-galaxy_LEDA-1313424_9-rings_hubble_NASA_1.jpg", "publishedAt": "2025-02-05T14:31:40Z", "content": "Galaxies often collide and interact over vast timescales, reshaping their structures in unpredictable ways. Some merge, others drift past one another, but few experience a direct impact through the c… [+6661 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joshua Howgego", "title": "'It was so simple': How Antarctica's missing meteorites were discovered using a block of ice, a freezer and a lamp - Livescience.com", "description": "\"What if the iron stones were warming up to the point where they would actually melt the glacial ice beneath them and sink into it, perhaps even descending far enough so as to be hidden below the surface?\"", "url": "https://www.livescience.com/planet-earth/antarctica/it-was-so-simple-how-antarcticas-missing-meteorites-were-discovered-using-a-block-of-ice-a-freezer-and-a-lamp", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R7JRj6QshhnnYkREKm9mrR-1200-80.jpg", "publishedAt": "2025-02-05T13:08:09Z", "content": "There are hundreds of thousands of meteorites hidden beneath Antarctica's icy surface, some of which are slowly sinking out of reach. You might think that these submerged space rocks would be very tr… [+4914 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Two Grand Canyon-size valleys on the far side of the moon formed within 10 minutes, scientists say - CNN", "description": "Two Grand Canyon-size features on the far side of the moon were likely formed in about 10 minutes after an unknown object slammed into the moon 3.8 billion years ago.", "url": "https://www.cnn.com/2025/02/05/science/lunar-grand-canyons-far-side-moon/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/03-lunar-canoyons-image-two.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-05T12:32:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nAbout 3.8 billion years ago, two massive canyons likel… [+8627 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Elon Musk Opens the Doors to His Tiny $50,000 House Where He Lives with His 12 Kids - The Daily Galaxy --Great Discoveries Channel", "description": "Elon Musk, one of the world’s richest men, has made an unexpected housing choice—one that few would associate with a billionaire. Instead of lavish mansions, he’s opted for a compact €50,000 home, raising eyebrows across the globe. Even more surprising? He sh…", "url": "https://dailygalaxy.com/2025/02/elon-musk-opens-the-doors-to-his-tiny-50000-house-where-he-lives-with-his-12-kids/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Elon-Musk-Opens-the-Doors-to-His-Tiny-50000-House-Where-He-Lives-with-His-12-Kids.jpg", "publishedAt": "2025-02-05T12:30:00Z", "content": "Elon Musk, the eccentric billionaire behind Tesla, SpaceX, and X, has once again shocked the world with an unexpected decision: he now lives in a tiny house worth just $50,000! Yes, you read that rig… [+3304 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Astronauts on the ISS experience vision changes — should Mars travelers be worried? - Space.com", "description": "70% of astronauts who have spent between six and 12 months aboard the International Space Station experienced significant changes to their vision.", "url": "https://www.space.com/space-exploration/human-spaceflight/astronauts-on-the-iss-experience-vision-changes-should-mars-travelers-be-worried", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kQDszuqzBmgjLovKmNQ4Dg-1200-80.jpg", "publishedAt": "2025-02-05T11:00:00Z", "content": "According to a new study, 70% of astronauts who have spent between six and 12 months aboard the International Space Station (ISS) experienced significant changes to their vision due to a condition ca… [+4813 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joshua Korber Hoffman", "title": "Light pollution is getting worse, but there is a movement to make our skies dark again - CNN", "description": "Light pollution is increasing globally, and having a negative impact on wildlife and humans. But according to DarkSky International, the solutions are surprisingly simple.", "url": "https://www.cnn.com/science/light-pollution-dark-skies-c2e-spc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/milky-way-stars-over-grand-canyon-and-the-colorado-river-from-nankoweap-canyon-area-grand-canyon-national-park-arizona-roycebair-copy-1000px-20250205092251138.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-05T09:27:00Z", "content": "Editors Note: Call to Earth is a CNN editorial series committed to reporting on the environmental challenges facing our planet, together with the solutions. Rolexs Perpetual Planet Initiative has par… [+7399 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Holes Cook Their Own Fuel in a Cosmic Feast - SciTechDaily", "description": "Supermassive black holes can fuel their own growth by cooling and recycling gas, creating a continuous cycle of feeding and outbursts. The central regions of galaxy clusters host the universe’s largest galaxies, each containing a supermassive black hole. Blac…", "url": "https://scitechdaily.com/black-holes-cook-their-own-fuel-in-a-cosmic-feast/", "urlToImage": "https://scitechdaily.com/images/Centaurus-Cluster-Composite-Crop-scaled.jpg", "publishedAt": "2025-02-05T09:21:15Z", "content": "Astronomers have found that the largest black holes in the universe don’t just consume matter—they also help create it. (Centaurus Cluster composite image.) Credit: X-ray: NASA/CXC/SAO/V. Olivaresi e… [+4596 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": null, "title": "SpaceX launches Maxar 3 satellite mission from NASA's Kennedy Space Center - Florida Today", "description": "SpaceX launches Falcon 9 rocket on Maxar 3 mission at 6:13 p.m. EST Tuesday, Feb. 4, amid thick fog from NASA's Kennedy Space Center in Florida.", "url": "https://www.floridatoday.com/picture-gallery/tech/science/space/2025/02/04/spacex-launches-maxar-3-worldview-legion-satellite-mission-from-nasa-kennedy-space-center-florida/78176251007/", "urlToImage": "https://www.floridatoday.com/gcdn/authoring/authoring-images/2025/02/05/PBRE/78225357007-crb-020425-2-spacex.jpg?crop=2934,1651,x0,y0&width=2934&height=1651&format=pjpg&auto=webp", "publishedAt": "2025-02-05T07:01:19Z", "content": "A SpaceX Falcon 9 rocket emerges from the fog after liftoff from Pad 39A at Kennedy Space Center, FL Tuesday, February 4, 2025 carrying a pair of Maxar WorldView Legion satellites. Craig Bailey/FLORI… [+7063 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "DNA Confirms Orcas Prey Upon One of Australia's Deadliest Marine Predators - ScienceAlert", "description": "It's not just the white sharks off the South African coast of Gansbaai that feel the deep, primal fear known only to prey.", "url": "https://www.sciencealert.com/dna-confirms-orcas-prey-upon-one-of-australias-deadliest-marine-predators", "urlToImage": "https://www.sciencealert.com/images/2025/02/orcas_leaping_header.jpg", "publishedAt": "2025-02-05T06:08:06Z", "content": "It's not just the white sharks off the South African coast of Gansbaai that feel the deep, primal fear known only to prey.\r\nFor years now, a single pair of orcas (Orcinus orca) has been recorded off … [+4350 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "LA Coast Community Accelerates Towards Pacific Amid Increasing Landslides - ScienceAlert", "description": "As if Los Angeles doesn't have enough to contend with in the aftermath of its catastrophic fires, NASA is now warning slow landslides are accelerating to threaten hundreds of buildings on the Palos Verdes Peninsula.", "url": "https://www.sciencealert.com/la-coast-community-accelerates-towards-pacific-amid-increasing-landslides", "urlToImage": "https://www.sciencealert.com/images/2025/02/HeatMapOfPalosVerdesSlowLandslideSentinal1SatelliteOctober2024.jpg", "publishedAt": "2025-02-05T05:26:27Z", "content": "As if Los Angeles doesn't have enough to contend with in the aftermath of its catastrophic fires, NASA is now warning slow landslides are accelerating to threaten hundreds of buildings on the Palos V… [+2669 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "'Beyond Doubt': Proteins in Fossil From Actual Dinosaur, Claim Scientists - ScienceAlert", "description": "Researchers have discovered clear chemical traces of decaying collagen in a duck-billed dinosaur fossil, upending previously held notions that any organic material found within such ancient fossils must be from some source of contamination.", "url": "https://www.sciencealert.com/beyond-doubt-proteins-in-fossil-from-actual-dinosaur-claim-scientists", "urlToImage": "https://www.sciencealert.com/images/2025/02/EdmontosaurusDuckBilledDinosaurFromCetaceous.jpg", "publishedAt": "2025-02-05T04:35:37Z", "content": "Researchers have discovered clear chemical traces of decaying collagen in a duck-billed dinosaur fossil, upending previously held notions that any organic material found within such ancient fossils m… [+2798 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "David Landsel", "title": "Falling space junk poses a growing risk to air travel safety — and could harm the economy too, experts warn - New York Post ", "description": "Talk about a potentially explosive issue.", "url": "https://nypost.com/2025/02/04/science/space-junk-a-growing-risk-to-air-travel-as-rocket-traffic-climbs/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/02/97902579.jpg?quality=75&strip=all&w=1024", "publishedAt": "2025-02-05T01:10:00Z", "content": "Talk about a potentially explosive issue.\r\nThe risk of rogue rocket debris and other man-made space junk colliding with planes is a growing challenge that’s only going to get worse as interplanetary … [+2557 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bright Planets, Bold Encounters: February’s Sky Comes Alive - SciTechDaily", "description": "A Month of Bright Planets Venus blazes at its brightest for the year after sunset, then Mars and Jupiter to rule the night amid the menagerie of bright winter stars. https://youtu.be/5C0QMb5LuJ8 What are some skywatching highlights in February 2025? Venus bla…", "url": "https://scitechdaily.com/bright-planets-bold-encounters-februarys-sky-comes-alive/", "urlToImage": "https://scitechdaily.com/images/Jupiter-and-Mars-Side-scaled.jpg", "publishedAt": "2025-02-04T22:18:23Z", "content": "Venus shines at its peak brilliance, Mars and Jupiter command the night, and Saturn makes a fleeting appearance in the west. Meanwhile, the Moon embarks on a celestial journey, passing close to Venus… [+5353 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "'Lost City' Deep Under The Ocean Is Unlike Anything We've Ever Seen Before on Earth - Yahoo! Voices", "description": "Now that we've found it, we can't afford to lose it.", "url": "https://www.sciencealert.com/lost-city-deep-under-the-ocean-is-unlike-anything-weve-ever-seen-before-on-earth", "urlToImage": "https://media.zenfs.com/en/sciencealert_160/d542b82f8115c9a187dd0223a206ed55", "publishedAt": "2025-02-04T21:54:47Z", "content": "Close to the summit of an underwater mountain west of the Mid-Atlantic Ridge, a jagged landscape of towers rises from the gloom.\r\nTheir creamy carbonate walls and columns appear ghostly blue in the l… [+3867 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paige Colley", "title": "How telecommunications cables can image the ground beneath us - Phys.org", "description": "When people think about fiber optic cables, it's usually about how they're used for telecommunications and accessing the internet. But fiber optic cables—strands of glass or plastic that allow for the transmission of light—can be used for another purpose: ima…", "url": "https://phys.org/news/2025-02-telecommunications-cables-image-ground-beneath.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/how-telecommunications.jpg", "publishedAt": "2025-02-04T21:54:05Z", "content": "When people think about fiber optic cables, it's usually about how they're used for telecommunications and accessing the internet. But fiber optic cablesstrands of glass or plastic that allow for the… [+7302 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Hicks Wogan", "title": "This monstrous mama laid the world’s largest egg - National Geographic", "description": "It was 10 feet tall and weighed more than 1,000 pounds. But that didn’t stop it from going extinct.", "url": "https://www.nationalgeographic.com/animals/article/elephant-bird-worlds-biggest-egg", "urlToImage": "https://i.natgeofe.com/n/8ba76e3f-b2f4-4dc2-94fb-10e6ea83326b/MM10298_20240930_0088_16x9.jpg?w=1200", "publishedAt": "2025-02-04T21:51:00Z", "content": "The average chicken egg can fit comfortably in the palm of your hand. This rare, fossilized specimen from National Geographics historical collection is more than 100 times larger. At just over a foot… [+833 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "Island Littered With Debris After Elon Musk’s Starship Explodes Overhead - Futurism", "description": "On the British islands of Turks and Caicos, residents and tourists have been left to deal with the aftermath of SpaceX's Starship explosion.", "url": "https://futurism.com/the-byte/island-littered-starship-debris", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/island-littered-starship-debris.jpg", "publishedAt": "2025-02-04T21:44:24Z", "content": "On the British islands of Turks and Caicos, residents and tourists have been left to deal with the aftermath of SpaceX's Starship explosion, which rained down debris onto the archipelago last month.\r… [+3597 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Stanford University", "title": "Biochar's carbon storage potential undervalued due to outdated assessment methods, study finds - Phys.org", "description": "Biochar, a charcoal-like material derived from plant biomass, has long been hailed as a promising tool for carbon dioxide removal. However, a new study by Stanford researchers highlights a critical issue: current methods for assessing biochar's carbon storage…", "url": "https://phys.org/news/2025-02-biochar-carbon-storage-potential-undervalued.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/biochar.jpg", "publishedAt": "2025-02-04T21:38:04Z", "content": "Biochar, a charcoal-like material derived from plant biomass, has long been hailed as a promising tool for carbon dioxide removal. However, a new study by Stanford researchers highlights a critical i… [+5040 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Certain animal navigation abilities found to operate at or near quantum limit of magnetic field detection - Phys.org", "description": "A pair of physicists at the University of Crete has found that some types of biological magnetoreceptors used by various creatures to navigate, operate at or near the quantum limit. In their paper published in the journal PRX Life, I. K. Kominis and E. Gkoudi…", "url": "https://phys.org/news/2025-02-animal-abilities-quantum-limit-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/biological-magnetorece.jpg", "publishedAt": "2025-02-04T21:10:39Z", "content": "A pair of physicists at the University of Crete has found that some types of biological magnetoreceptors used by various creatures to navigate, operate at or near the quantum limit. In their paper pu… [+2816 chars]"}, {"source": {"id": null, "name": "Artofmanliness.com"}, "author": "Brett & Kate McKay", "title": "Podcast #1,055: Sleep Like a Caveman - Art of Manliness", "description": "For several decades, people’s reported sleep quality has declined. This, despite the fact that specially optimized sheets, mattresses, and sleep trackers have emerged during that time, and despite the fact that the amount of time people are sleeping hasn’t de…", "url": "https://www.artofmanliness.com/health-fitness/health/podcast-1055-sleep-like-a-caveman/", "urlToImage": "https://content.artofmanliness.com/uploads/2025/02/sleep-thumb-3.jpg", "publishedAt": "2025-02-04T20:03:34Z", "content": "For several decades, people’s reported sleep quality has declined. This, despite the fact that specially optimized sheets, mattresses, and sleep trackers have emerged during that time, and despite th… [+48535 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Industrial Pollution is Cleaned by Converting Toxic Heavy Metals into Essential Nutrients - Good News Network", "description": "Biochar, a form of charcoal produced by heating agri waste without oxygen, is being studied as a potential tool for cleaning up chromium", "url": "https://www.goodnewsnetwork.org/charcoal-like-substance-can-clean-industrial-pollution-by-converting-toxic-heavy-metal-into-essential-nutrient/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2025/02/Biochar-is-a-form-of-charcoal-made-by-burning-without-oxygen-credit-Canadian-Light-Source-via-Flickr-CC-BY-SA-2.0-e1738666365467.jpg", "publishedAt": "2025-02-04T19:30:16Z", "content": "Biochar is a form of charcoal made by burning without oxygen – credit Canadian Light Source, via Flickr CC BY-SA 2.0.\r\nResearchers from the University of Waterloo have discovered that a special form … [+2712 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Five key facts about SPHEREx, NASA’s new space telescope - The Daily Galaxy --Great Discoveries Channel", "description": "NASA is preparing to launch its latest space observatory, SPHEREx (Spectro-Photometer for the History of the Universe, Epoch of Reionization, and Ices", "url": "https://dailygalaxy.com/2025/02/five-key-facts-about-spherex-nasas-new-space-telescope/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Five-key-facts-about-SPHEREx-NASAs-new-space-telescope.jpg", "publishedAt": "2025-02-04T19:30:00Z", "content": "NASA is preparing to launch its latest space observatory, SPHEREx (Spectro-Photometer for the History of the Universe, Epoch of Reionization, and Ices Explorer), a mission that promises to revolution… [+4760 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "En Route to Jupiter, NASA’s Europa Clipper Captures Images of Stars - NASA", "description": "The spacecraft’s star trackers help engineers orient the orbiter throughout its long journey to Jupiter’s icy moon Europa.", "url": "https://www.nasa.gov/missions/europa-clipper/en-route-to-jupiter-nasas-europa-clipper-captures-images-of-stars/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/e1-pia26562-star-tracker-in-atlo-.jpg", "publishedAt": "2025-02-04T18:51:30Z", "content": "The spacecrafts star trackers help engineers orient the orbiter throughout its long journey to Jupiters icy moon Europa.\r\nThree months after its launch from NASAs Kennedy Space Center in Florida, the… [+4493 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Association of Universities for Research in Astronomy", "title": "High-precision spectrograph confirms massive exoplanet orbiting a low-mass star - Phys.org", "description": "With an assist from the NEID spectrograph, a team of astronomers have confirmed the existence of exoplanet Gaia-4b—one of the most massive planets known to orbit a low-mass star. Gaia-4b is also the first planet detected by the European Space Agency's Gaia sp…", "url": "https://phys.org/news/2025-02-high-precision-spectrograph-massive-exoplanet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/high-precision-neid-sp-1.jpg", "publishedAt": "2025-02-04T18:43:46Z", "content": "With an assist from the NEID spectrograph, a team of astronomers have confirmed the existence of exoplanet Gaia-4bone of the most massive planets known to orbit a low-mass star. Gaia-4b is also the f… [+6506 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Newcastle University", "title": "Model shows spinning neutron stars gain enormous magnetic fields - Phys.org", "description": "An international team of scientists has modeled the formation and evolution of the strongest magnetic fields in the universe.", "url": "https://phys.org/news/2025-02-neutron-stars-gain-enormous-magnetic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/spinning-neutron-star.jpg", "publishedAt": "2025-02-04T18:08:03Z", "content": "An international team of scientists has modeled the formation and evolution of the strongest magnetic fields in the universe.\r\nLed by scientists from Newcastle University, University of Leeds and Fra… [+2581 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Annette Trabold", "title": "Study finds complex languages may be more efficient for communication - Phys.org", "description": "How do languages balance the richness of their structures with the need for efficient communication? To investigate, researchers at the Leibniz Institute for the German Language (IDS) in Mannheim, Germany, trained computational language models on a vast datas…", "url": "https://phys.org/news/2025-02-complex-languages-efficient-communication.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/how-languages-make-com.jpg", "publishedAt": "2025-02-04T18:02:59Z", "content": "How do languages balance the richness of their structures with the need for efficient communication? To investigate, researchers at the Leibniz Institute for the German Language (IDS) in Mannheim, Ge… [+4693 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Ocean plate from time of Pangaea is now being torn apart under Iraq and Iran - Livescience.com", "description": "What was once the floor of an ancient ocean is still shaping the landscape between Arabia and Eurasia.", "url": "https://www.livescience.com/planet-earth/geology/ocean-plate-from-time-of-pangaea-is-now-being-torn-apart-under-iraq-and-iran", "urlToImage": "https://cdn.mos.cms.futurecdn.net/8JK8qdCYre4JSaMs9zButc-1200-80.jpg", "publishedAt": "2025-02-04T17:53:08Z", "content": "A long-lost oceanic plate is diving deep into the mantle, dragging down the crust above, researchers say. However, the plate is also tearing apart below the Zagros Mountains in Iraq as it plunges dow… [+2758 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "NASA Is In Tatters - Futurism", "description": "The future of NASA is uncertain, with the chaotic start of president Donald Trump's second term raising plenty of unanswered questions.", "url": "https://futurism.com/nasa-is-in-tatters", "urlToImage": "https://wordpress-assets.futurism.com/2025/02/nasa-is-in-tatters.jpg", "publishedAt": "2025-02-04T17:21:35Z", "content": "The future of NASA is uncertain, with the chaotic start of president Donald Trump's second term raising plenty of unanswered questions regarding the space agency's fate.\r\nAmid a leadership vacuum, Sp… [+3218 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "VIPER back from the dead? NASA asks US companies to partner on ice-hunting moon rover - Space.com", "description": "\"NASA is looking forward to partnering with U.S. industry to meet the challenges of performing volatiles science in the lunar environment.\"", "url": "https://www.space.com/space-exploration/moon-rovers/viper-back-from-the-dead-nasa-asks-us-companies-to-partner-on-ice-hunting-moon-rover", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MoJwdBZFvo7DWzJnssQ2tm-1200-80.jpg", "publishedAt": "2025-02-04T17:00:00Z", "content": "NASA's ice-hunting VIPER rover could fly to the moon after all — with some help from the private sector.\r\nThe agency announced on Monday (Feb. 3) that it's seeking proposals from U.S. companies to pa… [+3370 chars]"}, {"source": {"id": null, "name": "Financial Times"}, "author": "Attracta Mooney", "title": "Record temperatures highlight ‘Faustian bargain’, says leading scientist - Financial Times", "description": "Air pollution, which has masked the true extent of global warming, is declining, warns James Hansen", "url": "https://www.ft.com/content/6589205c-b865-447d-bbc9-437b4806b59f", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7f72f8c2-ccd5-4cbd-acab-bb17c55d8ff2.jpg?source=next-barrier-page", "publishedAt": "2025-02-04T16:31:41Z", "content": "FT newspaper delivered Monday-Saturday, plus FT Digital Edition delivered to your device Monday-Saturday.\r\n<ul><li></li>Weekday Print Edition<li></li>FT Weekend<li></li>FT Digital Edition<li>Global n… [+105 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Gecko feet inspire anti-slip shoe soles - Ars Technica", "description": "Adding zirconia nanoparticles to the mix enhances slip-resistant hydrophilic effects.", "url": "https://arstechnica.com/science/2025/02/gecko-feet-inspire-anti-slip-shoe-soles/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/05/gecko2B-1152x648.jpg", "publishedAt": "2025-02-04T16:07:32Z", "content": null}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Could the US Land Astronauts on Mars by 2029? A Bold Goal That Might Be Closer Than We Think - The Daily Galaxy --Great Discoveries Channel", "description": "Is it really possible for astronauts to land on Mars by 2029? President Donald Trump has set an ambitious goal of sending humans to Mars within the next four years, but the challenges involved in getting there remain immense. SpaceX's Starship, fuel productio…", "url": "https://dailygalaxy.com/2025/02/us-land-astronauts-on-mars-2029-bold-goal/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/Could-the-US-Land-Astronauts-on-Mars-by-2029-A-Bold-Goal-That-Might-Be-Closer-Than-We-Think.jpg", "publishedAt": "2025-02-04T16:00:00Z", "content": "Recently, President Donald Trump announced an ambitious goal to land astronauts on Mars by the end of his presidential term, targeting 2029. While this might seem like a bold vision, many experts are… [+4432 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Margherita Bassi", "title": "Ice Age Kids Sported Cheek Piercings, 29,000-Year-Old Teeth Suggest - Gizmodo", "description": "Strange wear marks on the teeth of Paleolithic people in Central Europe have long puzzled scientists, but new research may finally reveal the cause.", "url": "https://gizmodo.com/ice-age-kids-sported-cheek-piercings-29000-year-old-teeth-suggest-2000558812", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/Pavlovian-teeth-and-cheek-piercings.jpg", "publishedAt": "2025-02-04T15:40:15Z", "content": "Numerous human remains discovered in central Europe dating to the last Ice Age have unusual abrasions on their teeth that have stumped experts for decades. Now, a researcher in Portugal has put forth… [+2951 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Jupiter's 'tormented moon' Io just unleashed the most powerful volcanic event ever seen - Yahoo! Voices", "description": "NASA's Juno spacecraft has discovered a giant volcanic hot spot on the surface of Jupiter's hellish moon Io. The eruptions in this area are chucking out six ...", "url": "https://www.livescience.com/space/planets/jupiters-tormented-moon-io-just-unleashed-the-most-powerful-volcanic-event-ever-seen", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/xOTCxD9Uqvs4ID6YHJj.OQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/live_science_953/67e86116d9a3e3318e34a605fe468dab", "publishedAt": "2025-02-04T15:25:40Z", "content": "When you buy through links on our articles, Future and its syndication partners may earn a commission.\r\nIo is the most volcanic world in the solar system, with around 400 volcanoes. Its extreme activ… [+5103 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Isaac Schultz", "title": "Famous Alvin Submersible Upgraded to Dive More Than 20,000 Feet Under the Sea - Gizmodo", "description": "The veteran HOV can now officially dive deeper into the sea, broadening the horizons of scientific discoveries under the surface.", "url": "https://gizmodo.com/famous-alvin-submersible-upgraded-to-dive-more-than-20000-feet-under-the-sea-2000558435", "urlToImage": "https://gizmodo.com/app/uploads/2025/02/alvin-2-upgraded-dive.jpg", "publishedAt": "2025-02-04T15:10:55Z", "content": "The Alvin submersible is now capable of diving to 21,325 feet (6,500 meters), putting 99% of the ocean floor within its reach.\r\nAlvin’s upgrade has been in the works for over four years, with its las… [+2673 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": null, "title": "Revolutionary AI Can Predict Solar Storms and CMEs Before They Hit Earth - Indian Defence Review", "description": "Solar storms pose a serious threat to power grids, satellites, and communications, yet predicting them has always been a challenge. Now, for the first time, AI has accurately forecasted powerful solar storms before they struck Earth, giving scientists a cruci…", "url": "https://indiandefencereview.com/ai-predict-solar-storms-cmes-before-hit/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2025/02/Revolutionary-AI-Can-Predict-Solar-Storms-and-CMEs-Before-They-Hit-Earth.jpg", "publishedAt": "2025-02-04T15:00:00Z", "content": "For the first time, artificial intelligence has successfully predicted powerful solar storms before they hit Earth, marking a major breakthrough in space weather forecasting. A research team from the… [+5550 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "People Left Shocked After Spotting ‘Mysterious Doorway’ When Looking At Antarctica on Google Maps - The Daily Galaxy --Great Discoveries Channel", "description": "A mysterious ‘doorway’ has appeared in the middle of Antarctica, baffling internet sleuths and fueling wild theories. Could it be a secret underground base, a long-lost Nazi bunker, or something even more bizarre? While some claim it's proof of a hidden world…", "url": "https://dailygalaxy.com/2025/02/people-left-shocked-after-spotting-mysterious-doorway-when-looking-at-antarctica-on-google-maps/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/mysterious-doorway-when-looking-at-Antarctica-on-Google-Maps.jpg", "publishedAt": "2025-02-04T15:00:00Z", "content": "A bizarre entrance appearing out of nowhere in the middle of Antarctica has left internet sleuths scrambling for answers. Is it a secret underground base? A hidden Nazi bunker? Or something even more… [+2747 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Scientists discover black holes spinning unexpectedly quickly: 'You’re essentially looking at its fossil record' - Space.com", "description": "\"Black holes really do sit at the frontier of human understanding.\"", "url": "https://www.space.com/Spinning-black-holes-reveal-details-dinner", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HTkvHDmZkAk4eLi8Gp4oYh-1200-80.png", "publishedAt": "2025-02-04T15:00:00Z", "content": "Scientists have discovered that some supermassive black holes rotate much more rapidly than expected. The discovery came as the result of a new form of \"black hole archeology\" that links black hole s… [+6451 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "NASA Puts Science Panels on Pause After Wave of Trump Orders - Gizmodo", "description": "After terminating its diversity programs, the space agency is reviewing whether several science committees are complying with presidential orders.", "url": "https://gizmodo.com/nasa-puts-science-on-pause-after-wave-of-trump-orders-2000558539", "urlToImage": "https://gizmodo.com/app/uploads/2024/09/europa-clipper-illustration-jupiter.jpg", "publishedAt": "2025-02-04T14:50:12Z", "content": "In a worrying move, NASA has paused the work of several astrophysics and planetary science committees as it works to figure out where those groups stand following numerous executive orders issued by … [+3288 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Extending a paradox: Quantum mechanics experiment measures a pulse of light in 37 dimensions - Phys.org", "description": "A team of physicists affiliated with multiple institutions in China has measured a pulse of light in 37 dimensions. In their paper published in Science Advances, the group explains that their experiment was meant to demonstrate that quantum mechanics is more …", "url": "https://phys.org/news/2025-02-paradox-quantum-mechanics-pulse-dimensions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/experiment-in-quantum.jpg", "publishedAt": "2025-02-04T14:19:17Z", "content": "A team of physicists affiliated with multiple institutions in China has measured a pulse of light in 37 dimensions. In their paper published in Science Advances, the group explains that their experim… [+2624 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Webb investigates a dusty and dynamic disc - European Space Agency", "description": "This new NASA/ESA/CSA James Webb Space Telescope&nbsp;Picture of the Month&nbsp;presents HH 30 in unprecedented detail. This target is an edge-on protoplanetary disc that is surrounded by jets and a disc wind, and is located in the dark cloud LDN 1551 in the …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_investigates_a_dusty_and_dynamic_disc", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/02/hh_30_miri_nircam_image/26563274-1-eng-GB/HH_30_MIRI_NIRCam_image_pillars.jpg", "publishedAt": "2025-02-04T14:04:31Z", "content": "This new NASA/ESA/CSA James Webb Space Telescope Picture of the Month presents HH 30 in unprecedented detail. This target is an edge-on protoplanetary disc that is surrounded by jets and a disc wind,… [+3648 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "AP", "title": "Newly Spotted Asteroid Has Tiny Chance Of Hitting Earth In 2032 - HuffPost", "description": "Scientists put the odds of a strike at slightly more than 1%.", "url": "https://www.huffpost.com/entry/newly-spotted-asteroid_n_67a21068e4b0cf0f0a35e5ff", "urlToImage": "https://img.huffingtonpost.com/asset/67a2106a1d000027003b5652.jpeg?cache=h1atN1u42z&ops=1200_630", "publishedAt": "2025-02-04T13:14:48Z", "content": "CAPE CANAVERAL, Fla. (AP) A newly discovered asteroid has a tiny chance of smacking Earth in 2032, space agency officials said Wednesday.\r\nScientists put the odds of a strike at slightly more than 1%… [+2206 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Superman-like alloy defies laws of heat, withstands 400 Kelvin with zero expansion - Interesting Engineering", "description": "Researchers developed a new alloy, the pyrochlore magnet, which exhibits even less thermal expansion than Invar.", "url": "https://interestingengineering.com/innovation/superman-like-alloy-defies-laws-of-heat", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2025/02/IE-19.jpg", "publishedAt": "2025-02-04T12:36:00Z", "content": "The research began with an investigation into Invar’s unusual property of low thermal expansion. They found that its magnetic properties are the key to its stability.\r\nThe effect is due to certain el… [+811 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Male-Only Reproduction Is Now Real: First-Ever Mice Born from “Two Fathers” Survive to Adulthood - The Daily Galaxy --Great Discoveries Channel", "description": "For the first time, scientists have successfully created mice with two fathers that survived to adulthood. This breakthrough challenges long-standing genetic barriers in mammalian reproduction. By targeting specific genes, researchers have unlocked new possib…", "url": "https://dailygalaxy.com/2025/02/first-ever-mice-born-from-two-fathers-survive-to-adulthood/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/One-of-the-adult-bipaternal-mice-.jpg", "publishedAt": "2025-02-04T12:30:00Z", "content": "In a groundbreaking experiment, researchers from the Chinese Academy of Sciences (CAS) have successfully created a bi-paternal mousea mouse with two biological fathers. This marks the first time a ma… [+3304 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "SpaceX launches 21 Starlink satellites from Florida on 15th launch of 2025 (video) - Space.com", "description": "Liftoff occurred at 5:14 a.m. EST (1014 GMT).", "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-starlink-satellite-launch-group-12-3", "urlToImage": "https://cdn.mos.cms.futurecdn.net/d6nn7un5tvMpYBvQeqbadf-1200-80.jpg", "publishedAt": "2025-02-04T10:35:50Z", "content": "SpaceX launched another batch of Starlink satellites to orbit from Florida's Space Coast early this morning (Feb. 4).\r\nA Falcon 9 rocket carrying 21 Starlink spacecraft, including 13 with direct-to-c… [+1846 chars]"}, {"source": {"id": null, "name": "Jasondeegan.com"}, "author": "Smith Noah", "title": "After disappearing 17 km into an Antarctic cavity, the Ran submarine revealed the South Pole’s hidden side - Jason Deegan", "description": "A recent expedition in the icy realms of Antarctica has provided a rare glimpse into a world few of us ever imagine. An international research team ... Continue Reading →", "url": "https://jasondeegan.com/after-disappearing-17-km-into-an-antarctic-cavity-the-ran-submarine-revealed-the-south-poles-hidden-side/", "urlToImage": "https://jasondeegan.com/wp-content/uploads/2025/02/Ran-submarine.jpg", "publishedAt": "2025-02-04T10:00:31Z", "content": "A recent expedition in the icy realms of Antarctica has provided a rare glimpse into a world few of us ever imagine. An international research team from the University of Gothenburg deployed an auton… [+4401 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Leeds", "title": "Quantum machine simulates universe's potential false vacuum decay - Phys.org", "description": "Physicists have performed a simulation they say sheds new light on an elusive phenomenon that could determine the ultimate fate of the universe.", "url": "https://phys.org/news/2025-02-quantum-machine-simulates-universe-potential.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/quantum-machine-offers-1.jpg", "publishedAt": "2025-02-04T10:00:01Z", "content": "Physicists have performed a simulation they say sheds new light on an elusive phenomenon that could determine the ultimate fate of the universe.\r\nPioneering research in quantum field theory around 50… [+7883 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover Mysterious Nuclear “Bump” That Challenges Current Physics Models - SciTechDaily", "description": "Scientists found an unexpected nuclear energy shift in radioactive lanthanum isotopes, challenging existing models and impacting astrophysical research. Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have precisely measured…", "url": "https://scitechdaily.com/scientists-uncover-mysterious-nuclear-bump-that-challenges-current-physics-models/", "urlToImage": "https://scitechdaily.com/images/Particle-Physics-Data-Analysis-Art-Concept.jpg", "publishedAt": "2025-02-04T09:19:10Z", "content": "Researchers at the University of Jyväskylä precisely measured atomic masses of radioactive lanthanum isotopes and discovered an unexpected “bump” in their nuclear binding energies. This finding chall… [+4250 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hassan Tayir", "title": "China plans to send a flying robot to search for water on the moon’s far side - CNN", "description": "China plans to send a flying robot to the far side of the moon next year to search for the frozen water that could hold the key to future lunar exploration, as the country pushes forward with its ambitious space program.", "url": "https://www.cnn.com/2025/02/04/science/china-moon-flying-robot-change-7-intl-hnk-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/still-21346081-78438-still.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-04T07:16:00Z", "content": "China plans to send a flying robot to the far side of the moon next year to search for the frozen water that could hold the key to future lunar exploration, as the country pushes forward with its amb… [+3416 chars]"}, {"source": {"id": null, "name": "Big Island Video News"}, "author": null, "title": "New StarCam Now Livestreaming Atop Maunakea - Big Island Video News", "description": "MAUNAKEA, Hawaiʻi - The Canada-France-Hawaii Telescope has partnered with Japanese media company Asahi Shimbun to provide a 24/7 livestream of Maunakea’s summit.", "url": "https://www.bigislandvideonews.com/2025/02/03/new-starcam-now-livestreaming-atop-maunakea/", "urlToImage": "https://www.bigislandvideonews.com/wp-content/uploads/2025/02/2025-02-03-cfht-FEATURE.jpg", "publishedAt": "2025-02-04T07:07:58Z", "content": "StarCam images courtesy CFHT &amp; Asahi Shimbun in collaboration with Subaru Telescope, NAOJ\r\n(BIVN) – A new, 24/7 livestream from the Canada-France-Hawaii Telescope (CFHT) at the summit of Maunakea… [+1747 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Mike McRae", "title": "Our Ears Still Try to Swivel Around to Hear Better, Study Discovers - ScienceAlert", "description": "Tens of millions of years ago, our primate ancestors responded to noises in much the same way many other mammals do, pricking their ears and deftly turning them towards the sound's source.", "url": "https://www.sciencealert.com/our-ears-still-try-to-swivel-around-to-hear-better-study-discovers", "urlToImage": "https://www.sciencealert.com/images/2025/02/boy_pulling_ears_header.jpg", "publishedAt": "2025-02-04T03:18:46Z", "content": "Tens of millions of years ago, our primate ancestors responded to noises in much the same way many other mammals do, pricking their ears and deftly turning them towards the sound's source.\r\nWhile a f… [+3869 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Lunar-bound Blue Ghost captures stunning video of Earth - Digital Trends", "description": "Firefly Aerospace's Blue Ghost spacecraft has captured a stunning video clip of Earth ahead of its arrival on the lunar surface.", "url": "https://www.digitaltrends.com/space/lunar-bound-blue-ghost-captures-stunning-video-of-earth/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2025/02/blue-ghost-earth.jpg?resize=1200%2C630&p=1", "publishedAt": "2025-02-04T01:50:11Z", "content": "After launching aboard a SpaceX Falcon 9 rocket from the Kennedy Space Center in Florida on January 15, Firefly Aerospace’s moon-bound Blue Ghost spacecraft has been orbiting Earth ahead of a trans-l… [+2598 chars]"}, {"source": {"id": null, "name": "Farmingdale-observer.com"}, "author": null, "title": "Straight out of a sci-fi movie, scientists on high alert after the discovery of a sea monster in a Moroccan mine - farmingdale-observer.com", "description": "In a stunning discovery that blurs the line between science fiction and reality, researchers have unearthed a potential sea monster fossil in a Moroccan mine. This find has sent shockwaves through the scientific community, raising questions about our understa…", "url": "https://farmingdale-observer.com/2025/02/03/straight-out-of-a-sci-fi-movie-scientists-on-high-alert-after-the-discovery-of-a-sea-monster-in-a-moroccan-mine/", "urlToImage": null, "publishedAt": "2025-02-04T01:41:00Z", "content": "In a stunning discovery that blurs the line between science fiction and reality, researchers have unearthed a potential sea monster fossil in a Moroccan mine. This find has sent shockwaves through th… [+5178 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Aaron McCrea", "title": "Launch Roundup: Soyuz set to fly; New Shepard simulates lunar gravity - NASASpaceflight.com", "description": "This week’s launch manifest is quite diverse, featuring the launches of four different rockets worldwide.…", "url": "https://www.nasaspaceflight.com/2025/02/launch-roundup-020325/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2025/02/241023-newshepard1-1-768x541-1.jpg", "publishedAt": "2025-02-03T23:41:02Z", "content": "55This week’s launch manifest is quite diverse, featuring the launches of four different rockets worldwide. Blue Origin’s New Shepard suborbital rocket has simulated the Moon’s gravity from just beyo… [+6592 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Scientists Find ‘Chorus Waves’ in Unexpected Part of Space - VOA Learning English", "description": "Scientists have detected bursts of radiation, called chorus waves, in an unexpected place. This discovery raises questions about how they were formed.", "url": "https://learningenglish.voanews.com/a/scientists-find-chorus-waves-in-unexpected-part-of-space/7953679.html", "urlToImage": "https://gdb.voanews.com/84f639b0-d205-4ab1-aa8f-c1c89806bc6c_w1200_r1.jpg", "publishedAt": "2025-02-03T21:45:00Z", "content": "International researchers recently released a study on bursts of energy in an unexpected area of space.\r\nScientists call the energetic activity chorus waves because they are said to move at the same … [+2680 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "DPA", "title": "Magma found under volcanoes thought dormant in the Cascade Range - Yahoo! Voices", "description": "Unlike old soldiers, old volcanoes seemingly don't even fade away, much less die, with researchers discovering magma chambers under cones previously classed ...", "url": "https://www.yahoo.com/news/magma-found-under-volcanoes-thought-210323189.html", "urlToImage": "https://media.zenfs.com/en/dpa_international_526/e50307e1334dd5d55499504d35f3410c", "publishedAt": "2025-02-03T21:03:23Z", "content": "Unlike old soldiers, old volcanoes seemingly don't even fade away, much less die, with researchers discovering magma chambers under cones previously classed as dormant after thousands of years of ina… [+2360 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "SETI Institute", "title": "How a twin Earth could detect Earth - Phys.org", "description": "A research team led by Dr. Sofia Sheikh of the SETI Institute, in collaboration with the Characterizing Atmospheric Technosignatures project and the Penn State Extraterrestrial Intelligence Center, set out to answer a simple question: If an extraterrestrial c…", "url": "https://phys.org/news/2025-02-twin-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/earth-detecting-earth.jpg", "publishedAt": "2025-02-03T20:47:51Z", "content": "A research team led by Dr. Sofia Sheikh of the SETI Institute, in collaboration with the Characterizing Atmospheric Technosignatures project and the Penn State Extraterrestrial Intelligence Center, s… [+4282 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Dirk Schulze-Makuch", "title": "New findings raise questions about when (and where) life began - Big Think", "description": "Life may have arisen far earlier — and more rapidly — than previously thought.", "url": "https://bigthink.com/hard-science/new-findings-raise-questions-about-when-and-where-life-began/", "urlToImage": "https://bigthink.com/wp-content/uploads/2025/02/life-arrived-from-somewhere-else_compressed.jpg?resize=1200,630", "publishedAt": "2025-02-03T20:27:58Z", "content": null}, {"source": {"id": null, "name": "Scientific American"}, "author": "Jack Tamisiea", "title": "Bonobos Can Tell When a Human Doesn’t Know Something - Scientific American", "description": "An experiment shows that bonobos can understand when a human lacks knowledge and point them in the right direction", "url": "https://www.scientificamerican.com/article/bonobos-can-tell-when-a-human-doesnt-know-something/", "urlToImage": "https://static.scientificamerican.com/dam/m/5143ec34ba2d6e3b/original/female-bonobo.jpg?m=1738610578.458&w=1200", "publishedAt": "2025-02-03T20:00:00Z", "content": "A few captive bonobos recently faced a seemingly simple task: locate a tasty snack hidden under one of three cups. Because bonobos are brainiacs, pinpointing the cup with the treat should have been n… [+4822 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "'Roasting marshmallow' exoplanet is so hot, it rains metal. How did it form? - Space.com", "description": "\"The climate of this planet is extreme and nothing like that of Earth. The planet's dayside is so hot that elements typically thought of as 'metal' are vaporized into the atmosphere.\"", "url": "https://www.space.com/roasting-marshmellow-exoplanet-wasp121b", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FBH6ck6vnisXhhTXG433MX-1200-80.png", "publishedAt": "2025-02-03T20:00:00Z", "content": "Astronomers may have inadvertently complicated the mystery of how strange \"roasting marshmallow\" planets form. Using the Gemini South telescope, researchers found that the \"hot and puffy\" ultra-hot J… [+5929 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "100 years ago: Edwin Hubble proved the Milky Way is not the only galaxy in the universe - Earth.com", "description": "In the 1920s, astronomers thought that the Milky Way was the entire universe. Hubble's discovery revealed a much bigger cosmos.", "url": "https://www.earth.com/news/100-years-ago-edwin-hubble-proved-the-milky-way-is-not-the-only-galaxy-in-the-universe/", "urlToImage": "https://cff2.earth.com/uploads/2025/01/30030459/100-years-ago-edwin-hubble-proved-not-only-galaxy-in-universe.jpg", "publishedAt": "2025-02-03T19:42:24Z", "content": "In early 1920s astronomy, most researchers believed our Milky Way was the entire universe. They assumed those faint spiral patches in the sky were just cloudy formations within our own galaxy.\r\nLittl… [+3870 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Is the moon still geologically active? Evidence says it's possible - Space.com", "description": "The moon is still shrinking as it cools off, causing its surface to wrinkle.", "url": "https://www.space.com/the-universe/moon/is-the-moon-still-geologically-active-evidence-says-its-possible", "urlToImage": "https://cdn.mos.cms.futurecdn.net/n8RcUvWFPDPMGDaZrV3GNa-1200-80.jpg", "publishedAt": "2025-02-03T19:00:00Z", "content": "The moon may still be geologically active, judging from the way the lunar far side is wrinkling as the moon contracts. At least, that's what planetary scientists who have discovered 266 lunar \"wrinkl… [+5430 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Hallermayer", "title": "Barbecue grill approach helps researchers understand puzzling Rayleigh–Bloch waves - Phys.org", "description": "So-called Rayleigh–Bloch waves can release an enormous amount of energy that can damage technical systems under certain circumstances. They only exist below a precisely defined cut-off frequency; above this, they disappear abruptly. Strangely enough, however,…", "url": "https://phys.org/news/2025-02-barbecue-grill-approach-puzzling-rayleighbloch.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/exotic-waves-with-conc.jpg", "publishedAt": "2025-02-03T18:15:47Z", "content": "So-called RayleighBloch waves can release an enormous amount of energy that can damage technical systems under certain circumstances. They only exist below a precisely defined cut-off frequency; abov… [+5519 chars]"}, {"source": {"id": null, "name": "Newser"}, "author": "Jenn Gidman", "title": "Underwater Volcano Inflating 'Like a Balloon' Will Blow 'Soon' - Newser", "description": "Scientists say Axial Seamount off Oregon's coast will likely erupt by end of 2025 but isn't dangerous", "url": "https://www.newser.com/story/363564/underwater-volcano-taking-a-nap-is-now-waking-up.html", "urlToImage": "https://img2-azrcdn.newser.com/image/1589737-12-20250203122332.jpeg", "publishedAt": "2025-02-03T18:08:00Z", "content": "Over the last eight centuries, a huge underwater volcano 300 miles off the coast of what's now Oregon has erupted dozens of times, its last outburst registered a decade ago. Now, researchers predict … [+2154 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "High-resolution imaging of Dyson sphere candidate reveals no radio signals - Phys.org", "description": "In the more than 60 years in which scientists have engaged in the Search for Extraterrestrial Intelligence (SETI), several potential examples of technological activity (\"technosignatures\") have been considered.", "url": "https://phys.org/news/2025-02-high-resolution-imaging-dyson-sphere.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2025/high-resolution-imagin.jpg", "publishedAt": "2025-02-03T16:52:05Z", "content": "In the more than 60 years in which scientists have engaged in the Search for Extraterrestrial Intelligence (SETI), several potential examples of technological activity (\"technosignatures\") have been … [+7871 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Jet Propulsion Laboratory", "title": "NASA’s InSight Finds Marsquakes From Meteoroids Go Deeper Than Expected - NASA", "description": "With help from AI, scientists discovered a fresh crater made by an impact that shook material as deep as the Red Planet’s mantle.", "url": "https://www.nasa.gov/missions/nasas-insight-finds-marsquakes-from-meteoroids-go-deeper-than-expected/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2025/02/1-pia26518-hirise-views-an-impact-crater-matched-to-insights-seismic-data.jpg", "publishedAt": "2025-02-03T16:38:11Z", "content": "With help from AI, scientists discovered a fresh crater made by an impact that shook material as deep as the Red Planets mantle.\r\nMeteoroids striking Mars produce seismic signals that can reach deepe… [+6742 chars]"}, {"source": {"id": null, "name": "Jalopnik"}, "author": "Ryan Erik King", "title": "China Creates Rocket Fuel In Orbit With Just Carbon Dioxide, Water And Electricity - Jalopnik", "description": "The CMSA didn't state how much oxygen and ethylene was produced by artificial photosynthesis technology", "url": "https://jalopnik.com/china-creates-rocket-fuel-in-orbit-with-just-carbon-dio-1851753935", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/4a7207b3d82b3a88056797371efefc47.jpg", "publishedAt": "2025-02-03T16:25:00Z", "content": "Space is the only place where rocket fuel could be more precious than water.The China Manned Space Agency announced last month that taikonauts on the ongoing Shenzhou-19 mission successfully produced… [+1982 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Octopuses May Have The Oldest Sex Chromosomes in The Animal Kingdom - ScienceAlert", "description": "Cephalopods may have the oldest sex chromosomes of any animal, according to a new discovery in the octopus genome.", "url": "https://www.sciencealert.com/octopuses-may-have-the-oldest-sex-chromosomes-in-the-animal-kingdom", "urlToImage": "https://www.sciencealert.com/images/2024/03/SexChromosomesOctopus.jpg", "publishedAt": "2025-02-03T16:01:26Z", "content": "Cephalopods may have the oldest sex chromosomes of any animal, according to a new discovery in the octopus genome.\r\nThat's a big deal given that scientists didn't know until now if these oddball crea… [+4894 chars]"}]}