{"status": "ok", "totalResults": 41, "articles": [{"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "What Is the Farmer’s Walk and Why Everyone’s Using It to Build Strength and Improve Balance - Indian Defence Review", "description": "An old-school strength move used by farmers is quietly revolutionizing modern fitness and rehab. Trainers, doctors, and elite athletes are all turning to this brutally simple exercise for results machines can’t match.", "url": "https://indiandefencereview.com/farmers-walk-benefits-strength-balance-workout/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/the-simple-weighted-walk-thats-quietly-taking-over-gyms-scaled.jpg", "publishedAt": "2026-02-01T15:17:00Z", "content": "An old-world technique rooted in agricultural labor is quietly redefining how strength and endurance are being built in modern fitness and rehabilitation settings. Once confined to strongman contests… [+5816 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Artemis 2 SLS wet dress rehearsal latest news: NASA begins countdown for critical fueling test - Space", "description": "Sunday, Feb. 1, 2026: Follow NASA's last major test of SLS before the launch of Artemis 2 and a crew of astronauts around the moon.", "url": "https://www.space.com/news/live/artemis-2-moon-rocket-nasa-fueling-test-feb-1-2026", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qRVhBQEibVub9oy4V3P82V-2560-80.jpg", "publishedAt": "2026-02-01T14:17:49Z", "content": "2026-02-01T14:17:45.435ZCountdown begins for Artemis 2 fueling test\r\n(Image credit: NASA/Joel Kowsky)\r\nGood morning, space fans! Happy Sunday.\r\nNASA officially began the countdown last night for its … [+5884 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lily Hautau", "title": "We asked retired astronauts about their favorite space movies, and this is what they shared with us - CNN", "description": "Ahead of the launch of Artemis II, the first crewed mission to the moon in more than 50 years, astronauts share the movies that capture the danger, teamwork, and wonder of spaceflight. Their picks offer cinematic glimpses into the real challenges and triumphs…", "url": "https://www.cnn.com/2026/02/01/entertainment/astronauts-favorite-space-movies", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/shutterstock-editorial-1541350a.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-02-01T13:00:55Z", "content": "NASAs Artemis II mission is set to launch as early as February 6, putting human spaceflight to the moon back in the spotlight after a 50-plus year hiatus which may inspire future filmmakers to explor… [+7440 chars]"}, {"source": {"id": null, "name": "WTOP"}, "author": "Greg Redfern", "title": "Eyes to the Skies for February: Rocket launch, winter constellations, eclipse and more - WTOP", "description": "NASA has scheduled the launch for the Artemis II moon rocket for no earlier than Feb. 8. WTOP will have details on the mission as they become available.", "url": "https://wtop.com/the-space-place/2026/02/eyes-to-the-skies-for-february-rocket-launch-winter-constellations-eclipse-and-more/", "urlToImage": "https://wtop.com/wp-content/uploads/2026/01/DSC_6732-St_ORION-e1769443035959.jpg", "publishedAt": "2026-02-01T12:34:45Z", "content": "Eyes to the Skies is a recurring feature and publishes on the first of every month. You can find it on WTOPs The Space Place. Email Greg your space questions and he might answer them in the next edit… [+6548 chars]"}, {"source": {"id": null, "name": "Indiandefencereview.com"}, "author": "Evelyn Hart", "title": "A 512-Million-Year-Old Fossil Site in China Reveals Strange Sea Creatures From an Ancient Underwater World - Indian Defence Review", "description": "A 512-million-year-old ecosystem, frozen in stone, reveals an explosive comeback after a mass extinction no one fully understood, until now.", "url": "https://indiandefencereview.com/china-fossil-discovery-ancient-sea-creatures-resurface/", "urlToImage": "https://indiandefencereview.com/wp-content/uploads/2026/02/ancient-marine-ecosystem-emerges-from-fossil-record-scaled.jpg", "publishedAt": "2026-02-01T12:30:00Z", "content": "In a quarry nestled in the hills of southern China, paleontologists have uncovered a fossil bed unlike any previously found from its time. The discovery, quietly developing over the past five years, … [+4781 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Arezki Amiri", "title": "Buried for 3.4 Million Years, New Fossil Evidence Is Removing Lucy From the Story of Human Evolution - The Daily Galaxy", "description": "A 3.4-million-year-old fossil foot uncovered in Ethiopia is shaking the foundations of human origins. Hidden for over a decade, this ancient find reveals a shocking twist in how early ancestors moved.", "url": "https://dailygalaxy.com/2026/02/ethiopia-fossil-discovery-removes-lucy-from-evolution-story/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/02/New-evidence-from-Ethiopia-challenges-Lucys-evolutionary-throne-scaled.jpg", "publishedAt": "2026-02-01T11:45:00Z", "content": "A fossilized foot found in the dusty sediments of northern Ethiopia has reopened one of paleoanthropologys most consequential questions: how many species of early hominins walked the Earth at the sam… [+5307 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Scientists discover hidden geometry that bends electrons like gravity - ScienceDaily", "description": "Researchers have discovered a hidden quantum geometry inside materials that subtly steers electrons, echoing how gravity warps light in space. Once thought to exist only on paper, this effect has now been observed experimentally in a popular quantum material.…", "url": "https://www.sciencedaily.com/releases/2026/01/260131084616.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/atom-electron-orbits-technology.webp", "publishedAt": "2026-02-01T10:05:29Z", "content": "How can information move at incredible speeds, or electricity flow without wasting energy? Answering these questions has pushed scientists and technology companies toward quantum materials, whose beh… [+3439 chars]"}, {"source": {"id": null, "name": "Skyatnightmagazine.com"}, "author": "Iain Todd", "title": "Tonight's Snow Moon is a last chance to see a high Moon of winter. Here are 6 reasons to catch it - BBC Sky at Night Magazine", "description": "Reasons why you should see the Snow Moon rise on Sunday 1 February 2026, the last high full Moon of this winter.", "url": "https://www.skyatnightmagazine.com/news/snow-moon-2026", "urlToImage": "https://c02.purpledshub.com/uploads/sites/48/2026/01/snowy-full-moon-rising.jpg?w=1200", "publishedAt": "2026-02-01T06:19:34Z", "content": "Tonight, Sunday 1 February, the full Moon will rise in the eastern sky, kicking off the month with a beautiful lunar spectacle.\r\nThis is the Snow Moon, which is the name given to February's full Moon… [+4174 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Zachary Ehrmann", "title": "Researchers reveal hidden landscape beneath miles of ice: 'Now you've got a properly zoomed-in digital image' - Yahoo", "description": "\"[This study gives] us a better picture of what's going to happen in the future.\"", "url": "https://www.yahoo.com/news/articles/researchers-reveal-hidden-landscape-beneath-031500095.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/C9r872P709hxlhT6JyR14w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/4288464ac10b5e916c5a22ac0ec38111", "publishedAt": "2026-02-01T03:15:00Z", "content": "Scientists unveiled the most detailed map ever created of Antarctica's hidden landscape beneath miles of ice, revealing thousands of previously unknown features that could transform predictions about… [+2702 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "Giant Virus Discovered in Japanese Pond May Hint at Multicellular Life's Origins - ScienceAlert", "description": "Scientists in Japan have discovered a previously unknown giant virus, offering new insight into this enigmatic category of viruses – and possibly also into the origins of multicellular life.", "url": "https://www.sciencealert.com/giant-virus-discovered-in-japanese-pond-may-hint-at-multicellular-lifes-origins", "urlToImage": "https://www.sciencealert.com/images/2026/01/ushikuvirus_header.jpg", "publishedAt": "2026-01-31T21:03:21Z", "content": "Scientists in Japan have discovered a previously unknown giant virus, offering new insight into this enigmatic category of viruses and possibly also into the origins of multicellular life.\r\nThe virus… [+4967 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "Thomas Edison May Have Discovered Graphene - Hackaday", "description": "Thomas Edison is well known for his inventions (even if you don’t agree he invented all of them). However, he also occasionally invented things he didn’t understand, so they had to be r…", "url": "https://hackaday.com/2026/01/31/thomas-edison-may-have-discovered-graphene/", "urlToImage": "https://hackaday.com/wp-content/uploads/2026/01/edison.png", "publishedAt": "2026-01-31T21:00:00Z", "content": "Thomas Edison is well known for his inventions (even if you don’t agree he invented all of them). However, he also occasionally invented things he didn’t understand, so they had to be reinvented agai… [+1043 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tiare Dunlap", "title": "Sprint or marathon? Aging muscle stem cells shift from rapid repair to long-term survival - Phys.org", "description": "Aging muscles heal more slowly after injury—a frustrating reality familiar to many older adults. A UCLA study conducted in mice reveals an unexpected cause: Stem cells in aged muscle accumulate higher levels of a protein that slows their ability to activate a…", "url": "https://phys.org/news/2026-01-sprint-marathon-aging-muscle-stem.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/muscle-stem-cells-buil.jpg", "publishedAt": "2026-01-31T17:20:01Z", "content": "Aging muscles heal more slowly after injurya frustrating reality familiar to many older adults. A UCLA study conducted in mice reveals an unexpected cause: Stem cells in aged muscle accumulate higher… [+5545 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Adelaide", "title": "Optical atomic clocks poised to redefine how the world measures seconds - Phys.org", "description": "Time is almost up on the way we track each second of the day, with optical atomic clocks set to redefine the way the world measures one second in the near future. Researchers from Adelaide University worked with the National Institute of Standards and Technol…", "url": "https://phys.org/news/2026-01-optical-atomic-clocks-poised-redefine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/taking-a-second-to-cha.jpg", "publishedAt": "2026-01-31T16:50:09Z", "content": "Time is almost up on the way we track each second of the day, with optical atomic clocks set to redefine the way the world measures one second in the near future. Researchers from Adelaide University… [+4316 chars]"}, {"source": {"id": null, "name": "Ground.news"}, "author": null, "title": "Particle Accelerator Decodes Lost Ancient Greek Star Catalog - Ground News", "description": "Researchers led by Victor Gysembergh of CNRS used a synchrotron at SLAC National Accelerator Laboratory to decode erased ancient Greek text from the Codex Climaci Rescriptus, revealing star coordinates from astronomer Hipparchus dating back to around 150 B.C.", "url": "https://ground.news/article/particle-accelerator-decodes-lost-ancient-greek-star-catalog_b5a1b3", "urlToImage": null, "publishedAt": "2026-01-31T16:39:06Z", "content": "Using powerful X-rays, researchers at SLAC are trying to recover erased traces of a 2,000-year-old star catalog that could rewrite the early history of astronomy."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Charles Helm, Willo Stear", "title": "Fossil hunters uncover 132-million-year-old dinosaur footprints on South Africa's coast - Phys.org", "description": "Southern Africa is world renowned for its fossil record of creatures that lived in the very distant past, including dinosaurs. But, about 182 million years ago, a huge eruption of lava covered much of the landscape (the inland Karoo Basin) where most of the d…", "url": "https://phys.org/news/2026-01-fossil-hunters-uncover-million-year.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/fossil-hunters-find-a-1.jpg", "publishedAt": "2026-01-31T16:20:01Z", "content": "Southern Africa is world renowned for its fossil record of creatures that lived in the very distant past, including dinosaurs. But, about 182 million years ago, a huge eruption of lava covered much o… [+6903 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Lydia Amazouz", "title": "NASA’s Artemis 2 Suits Are Ready for Historic Mission! - The Daily Galaxy", "description": "NASA's Artemis 2 mission is ready to make history, with innovative spacesuits playing a critical role in the crew’s safety and success.", "url": "https://dailygalaxy.com/2026/01/nasas-artemis-2-suits-are-ready-mission/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/NASAs-Artemis-2-Suits-Are-Ready-for-Historic-Mission-scaled.png", "publishedAt": "2026-01-31T16:15:00Z", "content": "NASA’s Artemis program is preparing for an incredible journey that could reshape humanity’s presence on the Moon. As part of this groundbreaking mission, the Artemis 2 crew will wear specially design… [+3948 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ivan Farkas", "title": "Astronomers spot 'time-warped' supernovas whose light both has and hasn't reached Earth - Live Science", "description": "Will two rare supernovas finally tell us how fast the universe is expanding? Perhaps, but we'll have to wait for it for them to 'reappear'.", "url": "https://www.livescience.com/space/cosmology/astronomers-spot-2-warped-supernovas-whose-light-both-has-and-hasnt-reached-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EmrZpViJwgfYNBAvmcuCCm-1396-80.jpg", "publishedAt": "2026-01-31T16:00:00Z", "content": "Two incredibly rare supernovas that erupted billions of years ago provide a unique opportunity to explain cosmology's biggest mystery — How fast is the universe expanding?\r\nBut there's a twist: Even … [+7204 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Helen Pilcher", "title": "With speeds of 100 miles per hour, it leaves birds like swifts and albatrosses eating its dust. - BBC Wildlife Magazine", "description": "did you know the fastest flying animal in the world isn't a bird", "url": "https://www.discoverwildlife.com/animal-facts/mammals/fastest-flying-bats", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/01/Free-tailed_bats.jpg?w=1200", "publishedAt": "2026-01-31T15:45:00Z", "content": "You can forget your swifts, your peregrine falcons, and your grey-headed albatrosses. They may be fast, but when it comes to level flight, its not a bird, but a mammal that holds the record. \r\nBrazil… [+2654 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Jupiter’s clouds are hiding something big - ScienceDaily", "description": "Jupiter’s swirling storms have concealed its true makeup for centuries, but a new model is finally peeling back the clouds. Researchers found the planet likely holds significantly more oxygen than the Sun, a key clue to how Jupiter—and the rest of the solar s…", "url": "https://www.sciencedaily.com/releases/2026/01/260131084138.htm", "urlToImage": "https://www.sciencedaily.com/images/1920/churning-texture-in-jupiters-atmosphere-left.webp", "publishedAt": "2026-01-31T15:31:54Z", "content": "Towering clouds ripple across Jupiter's surface in dramatic patterns. Like Earth's clouds, they contain water, but on Jupiter they are far denser and far deeper. These layers are so thick that no spa… [+5069 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": "Popkin", "title": "This website calculates how far you've traveled through space just by being alive - Boing Boing", "description": "The Cosmic Odometer calculates how far you've traveled through space just by being alive. Enter your birthdate and see.", "url": "https://boingboing.net/2026/01/31/this-website-calculates-how-far-youve-traveled-through-space-just-by-being-alive.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2026/01/Comets_Kick_up_Dust_in_Helix_Nebula_PIA09178.jpg?fit=1920%2C1597&quality=60&ssl=1", "publishedAt": "2026-01-31T15:00:00Z", "content": "The Cosmic Odometer calculates how far you've traveled through space just by being alive. Even if you've never left Earth, you've orbited the sun, rotated with the planet, and embarked on both solar … [+632 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Elliot Williams", "title": "Secret Ingredients - Hackaday", "description": "We were talking on the podcast about rope. But not just any rope – especially non-stretchy rope for using in a mechanical context. The hack in question was a bicycle wheel that swapped out normal m…", "url": "https://hackaday.com/2026/01/31/secret-ingredients/", "urlToImage": "https://hackaday.com/wp-content/uploads/2020/05/Automation.jpg", "publishedAt": "2026-01-31T15:00:00Z", "content": "We were talking on the podcast about rope. But not just any rope especially non-stretchy rope for using in a mechanical context. The hack in question was a bicycle wheel that swapped out normal metal… [+1371 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Institute of Science Tokyo", "title": "A world-first mouse that makes gene activity visible - Phys.org", "description": "DNA can be thought of as a vast library that stores all genetic information. Cells do not use this information all at once. Instead, they copy only the necessary parts into RNA, which is then used to produce proteins—the essential building blocks of life. Thi…", "url": "https://phys.org/news/2026-01-world-mouse-gene-visible.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/a-world-first-mouse-th.jpg", "publishedAt": "2026-01-31T14:30:01Z", "content": "DNA can be thought of as a vast library that stores all genetic information. Cells do not use this information all at once. Instead, they copy only the necessary parts into RNA, which is then used to… [+4138 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: Understanding procrastination; delicious baby sauropods; a study on musical 'pleasure chills' - Phys.org", "description": "This week, researchers identified the role of the brain's protein clean-up system in dementia. Fecal transplants show promising benefits in treating multiple cancer types. And biologists found that saltwater crocodiles traveled thousands of miles across the I…", "url": "https://phys.org/news/2026-01-saturday-citations-procrastination-delicious-baby.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/saturday-citations-und.jpg", "publishedAt": "2026-01-31T13:50:01Z", "content": "This week, researchers identified the role of the brain's protein clean-up system in dementia. Fecal transplants show promising benefits in treating multiple cancer types. And biologists found that s… [+5192 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Thomas Claburn", "title": "NASA taps Claude to conjure Mars rover's travel plan - theregister.com", "description": ": Is there life on Mars? Well, there's Claude in the machine", "url": "https://www.theregister.com/2026/01/31/nasa_taps_claude_to_conjure/", "urlToImage": "https://regmedia.co.uk/2021/03/12/perseverance.jpg", "publishedAt": "2026-01-31T13:13:00Z", "content": "Anthropic's Claude machine learning model has boldly planned what no Claude has planned before a path across Mars for NASA's Perseverance rover.\r\nPerseverance traveled about 400 meters on the Martian… [+4806 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": "Sarah Jones", "title": "It Took 400,000 MPH to Get There, Here’s What NASA’s Probe Found Near the Sun - The Daily Galaxy", "description": "Scientists sent a probe into the Sun’s atmosphere, and it came back with answers no one expected.", "url": "https://dailygalaxy.com/2026/01/nasa-probe-found-near-the-sun-400000mph/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2026/01/It-Took-400000-MPH-to-Get-There-Heres-What-NASAs-Probe-Found-Near-the-Sun-scaled.jpg", "publishedAt": "2026-01-31T12:45:00Z", "content": "In a groundbreaking effort to study the Sun up close, NASAs Parker Solar Probe has captured unprecedented data on the source of the solar wind. A research team led by the University of Arizona has no… [+3973 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "Our Entire Galaxy Appears to Be Embedded in a Colossal Sheet of Dark Matter - Futurism", "description": "The vast \"sheet\" of dark matter could explain why almost all of our galactic neighbors are running away from us.", "url": "http://futurism.com/space/entire-galaxy-sheet-dark-matter", "urlToImage": "https://futurism.com/wp-content/uploads/2026/01/entire-galaxy-sheet-dark-matter.jpg?quality=85&w=1200", "publishedAt": "2026-01-31T11:45:00Z", "content": "The Milky Way and in fact our entire galactic neighborhood known as the Local Group appear to be lodged in a vast, extended “sheet” of dark matter flanked on each side by cosmic voids, new research s… [+3593 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "AI Discovers Hundreds of Anomalies in Archive of Hubble Images - Futurism", "description": "Astronomers used an a custom-built AI tool to scour millions of Hubble images, uncovering the universe's overlooked curiosities.", "url": "http://futurism.com/space/ai-anomalies-hubble-images", "urlToImage": "https://futurism.com/wp-content/uploads/2026/01/ai-anomalies-hubble-images.jpg?quality=85&w=1200", "publishedAt": "2026-01-31T11:00:00Z", "content": "The universe is unfathomably vast, and for the astronomers trying to understand it, that means having to gather a commensurately mind-boggling amount of data. Wouldn’t it be nice if there was somethi… [+3185 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Weekend reads: Did a researcher ‘Obscure a Baby’s Poisoning?’; ‘Critical social media posts linked to retractions’; arXiv ‘clamps down on AI slop’ - Retraction Watch", "description": "If your week flew by — we know ours did — catch up here with what you might have missed. The week at Retraction Watch featured: Study is stolen, sold, published. Now the victim is accused of plagia…", "url": "https://retractionwatch.com/2026/01/31/weekend-reads-new-yorker-researcher-baby-opioid-poisoning-social-media-posts-retractions-arxiv-ai-slop/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2024/01/rw.jpeg", "publishedAt": "2026-01-31T11:00:00Z", "content": "If your week flew by we know ours did catch up here with what you might have missed.\r\nThe week at Retraction Watch featured:\r\nIn case you missed the news, the Hijacked Journal Checker now has more th… [+942 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Kimberley Lane", "title": "Here's my review of the Peak Design 25L Outdoor Backpack - Space", "description": "If you're looking for versatility and quality, look no further — the Peak Design 25L Outdoor Backpack offers a good solution.", "url": "https://www.space.com/stargazing/skywatching-kit/peak-design-25l-outdoor-backpack-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/R49sUjQWwoXtnuZxqZ7dy7-2133-80.jpg", "publishedAt": "2026-01-31T11:00:00Z", "content": "External dimensions: 19.09 x 11.02 x 5.91-inches (48.5 x 28 x 15 cm) with roll top down; 25.98 x 11.02 x 5.91-inches (66 x 28 x 15 cm) with roll top extended\r\nInternal dimensions: 18.90 x 10.83 x 5.7… [+6420 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "What actually happens to a spacecraft during its fiery last moments? Here's why ESA wants to find out - Space", "description": "\"Understanding how different materials behave as they burn up could help engineers design satellites that fully disintegrate, leaving nothing behind in orbit or in the atmosphere.\"", "url": "https://www.space.com/space-exploration/satellites/what-actually-happens-to-a-spacecraft-during-its-fiery-last-moments-heres-why-esa-wants-to-find-out", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iSwxvMQZESz2HpCrVn6tpY-1920-80.jpg", "publishedAt": "2026-01-31T11:00:00Z", "content": "What actually happens to a spacecraft during its fiery last moments? That's the key question for the European Space Agency's (ESA) Destructive Reentry Assessment Container Object (Draco) mission.\r\nES… [+5922 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rupendra Brahambhatt", "title": "New optical method bypasses light's limit by 100,000× to image atoms - Interesting Engineering", "description": "Scientists have shattered the diffraction limit, using continuous-wave lasers to resolve images at 0.1 nanometers.", "url": "https://interestingengineering.com/science/squeeze-light-to-see-matter-at-atomic-scale", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2026/01/squeeze-light-for-atomic-scale-observation.jpg", "publishedAt": "2026-01-31T07:59:00Z", "content": "For over a century, light has both helped and limited our view of the tiny world. Microscopes use light to magnify cells, microbes, and nanomaterialsbut light also behaves like a wave, and waves cann… [+3536 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "Axiom wins fifth private astronaut mission to space station - SpaceNews", "description": "NASA has selected Axiom Space for its fifth private astronaut mission to the International Space Station, scheduled for 2027.", "url": "http://spacenews.com/axiom-wins-fifth-private-astronaut-mission-to-space-station/", "urlToImage": "https://spacenews.com/wp-content/uploads/2026/01/54676240636_a38e83ea8a_k.jpg", "publishedAt": "2026-01-31T02:20:29Z", "content": "ORLANDO, Fla. NASA has selected Axiom Space for its fifth private astronaut mission to the International Space Station, scheduled for 2027.\r\nIn a statement late Jan. 30, NASA said it signed an agreem… [+2819 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "NASA's Artemis 2 mission to the moon puts Crew-12 SpaceX launch in delicate dance - Yahoo", "description": "Artemis seems to be NASA's primary focus.", "url": "https://www.space.com/space-exploration/human-spaceflight/nasas-artemis-2-mission-to-the-moon-puts-crew-12-spacex-launch-in-delicate-dance", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qjFhWEU8YNq5fPZX6C7ENY-1366-80.jpg", "publishedAt": "2026-01-30T23:25:50Z", "content": "It is the best of times, and it is (far from, actually,) the worst of time for NASA, with two big astronaut launches converging toward the same week, as a rare Arctic cold front pushes mission schedu… [+7355 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Will Dunham, Reuters", "title": "Baby long-necked dinosaurs were a 'perfect snack' for predators - KSL.com", "description": "New research shows Brachiosaurus and other sauropod babies appear to have been regular dinner fare for meat-eating dinosaurs 150 million years ago.", "url": "https://www.ksl.com/article/51440742/baby-long-necked-dinosaurs-were-a-perfect-snack-for-predators", "urlToImage": "https://img.ksl.com/slc/3142/314268/31426815.JPG?filter=kslv2/responsive_story_lg", "publishedAt": "2026-01-30T22:38:12Z", "content": "WASHINGTON It may have been suicidal for a predator to go after a healthy adult Brachiosaurus, a behemoth weighing perhaps 60 tons that was a member of the long-necked group of dinosaurs called sauro… [+4230 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Japan Botched a Satellite Launch in One of the Weirdest Ways Possible - Gizmodo", "description": "Japan's H3 rocket lost its payload fairing around 4 minutes after launch, leaving a satellite exposed and hanging on for dear life.", "url": "https://gizmodo.com/japan-botched-a-satellite-launch-in-one-of-the-weirdest-ways-possible-2000716172", "urlToImage": "https://gizmodo.com/app/uploads/2023/03/82ff9229d6ab41bfc77110af5adf8587.jpg", "publishedAt": "2026-01-30T22:15:16Z", "content": "New details have emerged regarding Japan’s H3 rocket failure last month, revealing the strange way its payloada navigation satellitewas lost prior to reaching its target orbit.\r\nJapan Aerospace Explo… [+3176 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Csanád Horváth, Natasha Hurley-Walker", "title": "Puzzling slow radio pulses are coming from space. A new study could finally explain them - Phys.org", "description": "Cosmic radio pulses repeating every few minutes or hours, known as long-period transients, have puzzled astronomers since their discovery in 2022. Our new study, published in Nature Astronomy today, might finally add some clarity.", "url": "https://phys.org/news/2026-01-puzzling-radio-pulses-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/puzzling-slow-radio-pu-2.jpg", "publishedAt": "2026-01-30T20:30:28Z", "content": "Cosmic radio pulses repeating every few minutes or hours, known as long-period transients, have puzzled astronomers since their discovery in 2022. Our new study, published in Nature Astronomy today, … [+6633 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Large Hadron Collider reveals 'primordial soup' of the early universe was surprisingly soupy - Space", "description": "Waiter, there's a quark in my soup!", "url": "https://www.space.com/science/particle-physics/large-hadron-collider-reveals-primordial-soup-of-the-early-universe-was-surprisingly-soupy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5NaWmr9jCdrYw7DAdw3fj3-1600-80.png", "publishedAt": "2026-01-30T20:00:00Z", "content": "Using the world's most powerful particle accelerator, CERN's Large Hadron Collider, scientists have discovered that the trillion-degree hot primordial \"soup\" that filled the cosmos for mere millionth… [+6739 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Stuttgart", "title": "Record-breaking photons at telecom wavelengths—on demand - Phys.org", "description": "A team of researchers from the University of Stuttgart and the Julius-Maximilians-Universität Würzburg led by Prof. Stefanie Barz (University of Stuttgart) has demonstrated a source of single photons that combines on-demand operation with record-high photon q…", "url": "https://phys.org/news/2026-01-photons-telecom-wavelengths-demand.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/record-breaking-photon.jpg", "publishedAt": "2026-01-30T18:59:49Z", "content": "A team of researchers from the University of Stuttgart and the Julius-Maximilians-Universität Würzburg led by Prof. Stefanie Barz (University of Stuttgart) has demonstrated a source of single photons… [+5089 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Lab study suggests longer waves fracture floating ice sheets at lower stress - Phys.org", "description": "When waves are moving across ice-covered seas, they can cause sheets of ice to bend and ultimately break. Understanding the processes underlying these wave-induced ice fractures and predicting when they will occur could help to better forecast how climate cha…", "url": "https://phys.org/news/2026-01-lab-longer-fracture-ice-sheets.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2026/studying-how-waves-bre-1.jpg", "publishedAt": "2026-01-30T18:50:04Z", "content": "When waves are moving across ice-covered seas, they can cause sheets of ice to bend and ultimately break. Understanding the processes underlying these wave-induced ice fractures and predicting when t… [+5352 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Research Center for Materials Nanoarchitectonics (MANA)", "title": "Liquid-repellent particle coating enables near-frictionless motion of pico- to nanoliter droplets - Phys.org", "description": "The precise control of tiny droplets on surfaces is essential for advanced manufacturing, pharmaceuticals, and next‐generation lab‐on‐a‐chip diagnostics. However, once droplet volume reaches pico- and nanoliter scales, the droplets become extremely sensitive …", "url": "https://phys.org/news/2026-01-liquid-repellent-particle-coating-enables.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/scientists-enable-near.jpg", "publishedAt": "2026-01-30T18:24:31Z", "content": "The precise control of tiny droplets on surfaces is essential for advanced manufacturing, pharmaceuticals, and nextgeneration labonachip diagnostics. However, once droplet volume reaches pico- and na… [+2597 chars]"}, {"source": {"id": null, "name": "Discoverwildlife.com"}, "author": "Sophie Ellis", "title": "Measuring up to the length of a bus, these creatures have the longest tentacles in the world - BBC Wildlife Magazine", "description": "Discover the creatures that have the longest tentacles in the world – with some reaching up to 30 metres", "url": "https://www.discoverwildlife.com/animal-facts/marine-animals/longest-tentacles", "urlToImage": "https://c02.purpledshub.com/uploads/sites/62/2026/01/GettyImages-918492636.jpg?w=1200", "publishedAt": "2026-01-30T14:43:55Z", "content": "When we think of tentacled animals, we usually think of marine creatures. But many other species have them too. For example, the eyestalks of slugs and snails are actually specialised types of tentac… [+2560 chars]"}]}