{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Financial Times"}, "author": null, "title": "Amazon, the NFL and the Post: Jeff Bezos's plans for Washington hit trouble - Financial Times", "description": "Turmoil at newspaper that billionaire bought 11 years ago is his latest setback in US capital", "url": "https://www.ft.com/content/88d5b589-9dbe-4dc1-b8d3-0d42f4e1eb87", "urlToImage": null, "publishedAt": "2024-06-23T12:00:42Z", "content": "Then $75 per month.Complete digital access to quality FT journalism on any device. Cancel anytime during your trial."}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Iain Thomson", "title": "From network security to nyet work in perpetuity: What's up with the Kaspersky US ban? - The Register", "description": "It's been a long time coming. Now our journos speak their brains", "url": "https://www.theregister.com/2024/06/22/kaspersky_kettle/", "urlToImage": "https://regmedia.co.uk/2024/06/21/shutterstock_kaspersky_usa.jpg", "publishedAt": "2024-06-22T08:16:00Z", "content": "Kettle The US government on Thursday banned Kaspersky Lab from selling its antivirus and other products in America from late July, and from issuing updates and malware signatures from October.\r\nThen … [+684 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Thomas Claburn", "title": "Apple Intelligence won't be available in Europe because Tim's terrified of watchdogs - The Register", "description": "These privacy rules might harm privacy! No, really, that's totally why we're doing this", "url": "https://www.theregister.com/2024/06/21/apple_intelligence_eu/", "urlToImage": "https://regmedia.co.uk/2024/06/21/tantrum_shutterstock.jpg", "publishedAt": "2024-06-21T22:59:00Z", "content": "Apple has delayed plans to deploy artificial intelligence features in Europe because the American giant is unhappy with the continent's privacy regulations.\r\nIn a statement on Friday, the iPhone make… [+3212 chars]"}]}