{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Hamas refuses to discuss new hostage deal before ceasefire - Financial Times", "description": "Talks to broker an agreement to release the remaining captives have gathered pace in recent days", "url": "https://www.ft.com/content/ba95dc0c-c5f1-45a0-98be-5659bf3898b9", "urlToImage": null, "publishedAt": "2023-12-21T14:34:08Z", "content": "Keep abreast of significant corporate, financial and political developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert comment… [+30 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomical Artistry: NASA Brings “Christmas Tree Cluster” to Life - SciTechDaily", "description": "NGC 2264, the “Christmas Tree Cluster,” is a star cluster in the Milky Way, depicted in a newly enhanced image to resemble a cosmic Christmas tree. NGC 2264 is a cluster of young stars that has been colored and rotated to emphasize its nickname of the “Christ…", "url": "https://scitechdaily.com/astronomical-artistry-nasa-brings-christmas-tree-cluster-to-life/", "urlToImage": "https://scitechdaily.com/images/Christmas-Tree-Cluster.jpg", "publishedAt": "2023-12-21T09:21:34Z", "content": "The “Christmas Tree Cluster,” NGC 2264, is a cluster of young stars in the Milky Way, about 2,500 light-years from Earth. This composite image, enhanced by specific color choices and rotation, depict… [+4288 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Accurate detection of identity-by-descent segments in human ancient DNA - Nature.com", "description": "ancIBD identifies identity-by-descent regions in ancient DNA using a hidden Markov model optimized for these low-coverage data. Analysis of 4,248 individuals demonstrates that ancIBD can identify up to sixth-degree relatives and provides genealogical insights…", "url": "https://www.nature.com/articles/s41588-023-01582-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01582-w/MediaObjects/41588_2023_1582_Fig1_HTML.png", "publishedAt": "2023-12-20T10:13:36Z", "content": null}]}