{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Waugh Tech Correspondent", "title": "I'm a cellphone repair expert - here's the big charging mistake everyone makes - Daily Mail", "description": "The way many of us recharge our phones - including leaving it on charge overnight or plugged in while we work - can actually damage the battery, permanently diminishing the battery.", "url": "https://www.dailymail.co.uk/sciencetech/article-11998881/Im-cellphone-repair-expert-heres-big-charging-mistake-makes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/21/17/70088383-0-image-a-48_1682093309480.jpg", "publishedAt": "2023-04-23T17:15:16Z", "content": "Most of us have been charging our phones wrong, according to a phone repair expert who specializes in refurbishing old handsets.\r\nThe way many of us recharge our phones - including leaving it on char… [+4368 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rachael Bunyan", "title": "I was sexually abused by male passenger sitting next to me throughout ten-hour Air Europa flight - Daily Mail", "description": "EXCLUSIVE: Emma was travelling on a flight from Santa Cruz, Bolivia, to Madrid, Spain, with her husband on Saturday when a man seated next to her began touching her inappropriately.", "url": "https://www.dailymail.co.uk/news/article-11984775/I-sexually-abused-male-passenger-sitting-ten-hour-Air-Europa-flight.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/21/14/70092433-0-image-a-34_1682084412425.jpg", "publishedAt": "2023-04-23T08:23:20Z", "content": "A British woman today revealed she was sexually assaulted by a male passenger sitting next to her on a ten-hour Air Europa flight to Madrid before being shouted at by cabin crew for crying.\r\nEmma, wh… [+7173 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Kevin C. Neece", "title": "See A Runaway Black Hole Tearing Through Space Right Now - Giant Freakin Robot", "description": "NASA caught amazing images of a black hole moving across space that answers some questions but raises many more.", "url": "https://www.giantfreakinrobot.com/sci/black-hole-creating-new-stars.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2022/06/black-hole-interstellar.jpg", "publishedAt": "2023-04-22T19:40:19Z", "content": "A black hole moving through space was photographed by NASA. \r\nBy Kevin C. Neece\r\n| Published 4 hours ago\r\nAstronomers have spotted what they believe to be a supermassive black hole making a hot strea… [+2933 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Wonder Material Graphene Stuns Again: Shatters Magnetoresistance Records - SciTechDaily", "description": "Researchers at The University of Manchester have discovered record-high magnetoresistance in graphene, offering potential breakthroughs in understanding strange metals and applications in magnetic sensors. In a paper published in the journal Nature on April 1…", "url": "https://scitechdaily.com/wonder-material-graphene-stuns-again-shatters-magnetoresistance-records/", "urlToImage": "https://scitechdaily.com/images/Abstract-Hex-Graphene-Energy-Concept.jpg", "publishedAt": "2023-04-22T07:00:00Z", "content": "ByUniversity of ManchesterApril 20, 2023\r\nIn a recent publication in Nature, researchers have discovered record-high magnetoresistance in graphene under ambient conditions. The team utilized high-qua… [+6804 chars]"}]}