{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Home.cern"}, "author": null, "title": "CERN pays tribute to Peter Higgs - CERN", "description": "Peter Higgs has passed away at the age of 94. An iconic figure in modern science, Higgs in 1964 postulated the existence of the eponymous Higgs boson. Its discovery at CERN in 2012 was the crowning achievement of the Standard Model (SM) of particle physics – …", "url": "https://home.cern/news/obituary/physics/cern-pays-tribute-peter-higgs", "urlToImage": "https://cds.cern.ch/images//file?size=medium", "publishedAt": "2024-04-10T07:21:42Z", "content": "Peter Higgs has passed away at the age of 94. An iconic figure in modern science, Higgs in 1964 postulated the existence of the eponymous Higgs boson. Its discovery at CERN in 2012 was the crowning a… [+2057 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Sharmishta Sarkar", "title": "Color me surprised: Kobo's finally beaten Kindle with its latest ereaders - TechRadar", "description": "The Kobo Libra Colour and the Kobo Clara Colour join the Clara BW as the latest ereaders on the market", "url": "https://www.techradar.com/tablets/ereaders/color-me-surprised-kobos-finally-beaten-kindle-with-its-latest-ereaders", "urlToImage": "https://cdn.mos.cms.futurecdn.net/paaiPEmJZYiTBGD89m8aZg-1200-80.jpg", "publishedAt": "2024-04-10T04:00:30Z", "content": "Color ereaders aren’t new – brands like Onyx and PocketBook have been making them for a while – but I’ve been waiting a long time to see a color-screen Kindle or Kobo. It’s finally happened with the … [+6253 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "Long COVID leaves distinctive signs in blood which could be targets for treatment, study suggests - Sky News", "description": "", "url": "https://news.sky.com/story/long-covid-leaves-distinctive-signs-in-blood-which-could-be-targets-for-treatment-study-suggests-13111198", "urlToImage": "https://e3.365dm.com/24/04/1600x900/skynews-depression-mental-problems_6515339.jpg?20240408231717", "publishedAt": "2024-04-08T22:20:19Z", "content": "Long COVID leaves distinctive signs in the blood which could potentially be targeted for treatment, research suggests.\r\nFindings from the largest UK study of patients admitted to hospital with corona… [+3275 chars]"}]}