{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Jay Peters", "title": "Apple might announce “several” Macs at WWDC - The Verge", "description": "Apple could have a pretty big Worldwide Developers Conference next week, according to Bloomberg’s Mark Gurman. In addition to the rumored mixed reality headset and the usual updates to its operating system, Gurman said in a tweet that he’s expecting Apple to …", "url": "https://www.theverge.com/2023/5/31/23744193/apple-wwdc-2023-several-macs-macbook-air-15-inch", "urlToImage": "https://cdn.vox-cdn.com/thumbor/tqMQ0bh87oHsNkc_QNJ0lOnw0E8=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23759761/bfarsace_190101_5333_0008.jpg", "publishedAt": "2023-05-31T19:10:54Z", "content": "Apple might announce several Macs at WWDC\r\nApple might announce several Macs at WWDC\r\n / Bloombergs Mark Gurman says we might be seeing some new Macs very soon.\r\nByJay Peters, a news editor who write… [+2384 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "Warning over 'nature's own Ozempic': Experts alarmed by viral TikTok weight loss drug - Daily Mail", "description": "The dietary supplement can be bought online, including on Amazon, from just 20p per pill. But UK medics today warned the trend 'can be dangerous' and raised concerns over its effectiveness.", "url": "https://www.dailymail.co.uk/health/article-12142797/Warning-natures-Ozempic-Experts-alarmed-viral-TikTok-weight-loss-drug.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/31/12/71607697-0-image-a-2_1685534359972.jpg", "publishedAt": "2023-05-31T12:26:43Z", "content": "Experts are concerned about TikTok's newest health trend a plant-based weight-loss supplement.\r\nVideos highlighting the seemingly remarkable benefits of berberine capsules have racked up millions of … [+10412 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Junk Food vs Sleep: New Study Reveals Impact of Diet on Sleep Quality - Neuroscience News", "description": "The study revealed that consuming a diet high in sugars and saturated fats leads to deterioration in the quality of deep sleep.", "url": "https://neurosciencenews.com/sleep-junk-food-23363/", "urlToImage": "https://neurosciencenews.com/files/2023/05/junk-food-sleep-neurosincnes.jpg", "publishedAt": "2023-05-30T18:41:06Z", "content": "Summary: Researchers uncovered how an unhealthy diet affects deep sleep quality. The study revealed that consuming a diet high in sugars and saturated fats leads to deterioration in the quality of de… [+8545 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "UAE to launch mission to asteroid belt to discover life's origins - The News International", "description": "The United Arab Emirates  revealed its latest space project Monday to send a spaceship to explore the solar system's main asteroid belt, following the successful launch of the Hope spacecraft to...", "url": "https://www.thenews.com.pk/latest/1075404-uae-to-launch-mission-to-asteroid-belt-to-discover-lifes-origins", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-05-30/1075404_101451_updates.jpg", "publishedAt": "2023-05-30T18:29:00Z", "content": "The United Arab Emirates (UAE) revealed its latest space project Monday to send a spaceship to explore the solar system's main asteroid belt, following the successful launch of the Hope spacecraft to… [+2968 chars]"}]}