{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Roland Moore-Colyer", "title": "How to watch Samsung Galaxy Unpacked 2024 - TechRadar", "description": "Get ready for the launch of the Samsung Galaxy S24, Galaxy S24 Plus and Galaxy S24 Ultra", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/how-to-watch-samsung-galaxy-unpacked-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/77hKrJE9sbf6aaAELatYE5-1200-80.jpg", "publishedAt": "2024-01-17T10:09:43Z", "content": "The inaugural Samsung Galaxy Unpacked showcase of 2024 is taking place on Wednesday, January 17) where we expect to see the reveal of the much-rumored and teased Samsung Galaxy S24 range, comprising … [+3406 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Further measles outbreaks expected in England as cases rise - BBC.com", "description": "Medics issue the warning after cases in the West Midlands rose by more than 30% in less than a week.", "url": "https://www.bbc.com/news/articles/cw0d7rpr6ndo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/a7ae/live/938f6880-b495-11ee-9015-e1b313b8fdbe.jpg", "publishedAt": "2024-01-16T18:12:00Z", "content": "Health officials have warned of further measles outbreaks across England after cases in the West Midlands rose by more than 30% in less than a week.\r\nThe region has seen the largest surge in cases ou… [+2626 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "UK-wide study reveals harm done by people not getting COVID jabs - Medical Xpress", "description": "More than 7,000 people were hospitalized or died from COVID-19 in the UK during the summer of 2022 because they had not received the recommended number of vaccine doses, according to a study released Tuesday that was the first to cover Britain's entire popula…", "url": "https://medicalxpress.com/news/2024-01-uk-wide-reveals-people-covid.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/covid-jab.jpg", "publishedAt": "2024-01-16T09:28:10Z", "content": "More than 7,000 people were hospitalized or died from COVID-19 in the UK during the summer of 2022 because they had not received the recommended number of vaccine doses, according to a study released… [+3321 chars]"}]}