{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Signs of Monster Stars 10000 Times Our Sun's Mass Found at The Dawn of Time - ScienceAlert", "description": "We don't know what the first stars in the Universe were like.", "url": "https://www.sciencealert.com/signs-of-monster-stars-10000-times-our-suns-mass-found-at-the-dawn-of-time", "urlToImage": "https://www.sciencealert.com/images/2023/05/globular-cluster.jpg", "publishedAt": "2023-05-24T04:43:13Z", "content": "We don't know what the first stars in the Universe were like. Peering into the distant reaches of the early Universe, we've seen only traces of their presence.\r\nBut a new line of evidence traced in i… [+5157 chars]"}, {"source": {"id": null, "name": "Manchester Evening News"}, "author": "Kyle Newbould", "title": "Neymar signing would revive Cristiano Ronaldo problem at Man Utd - Manchester Evening News", "description": "Reports have suggested the Brazilian wants out of Paris Saint-Germain and has been offered to Man United ahead of the summer transfer window", "url": "https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-neymar-cristiano-ronaldo-26973239", "urlToImage": "https://i2-prod.business-live.co.uk/incoming/article26973294.ece/ALTERNATES/s1200/0_GettyImages-1467972095.jpg", "publishedAt": "2023-05-24T03:00:00Z", "content": "Erik ten Hag has overseen major change in his debut season at Manchester United and a sensible approach to transfer business has been one of his biggest strengths.\r\nUnited spent over £200million last… [+3377 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Jaw-dropping pictures from Earth's most powerful solar telescope reveal new details of the Sun - Study Finds", "description": "These images include larger-than-Earth sunspots, with one even resembling a ghoulish face.", "url": "https://studyfinds.org/jaw-dropping-pictures-the-sun/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/05/incredible-sun-1008671-scaled-e1684867259785.jpg", "publishedAt": "2023-05-23T18:53:05Z", "content": "MAUI, Hawaii — Stunning images from the world’s most potent solar telescope, the Daniel K. Inouye Solar Telescope, are revealing the Sun in extraordinary detail. These images include larger-than-Eart… [+4236 chars]"}, {"source": {"id": null, "name": "SETI Institute"}, "author": null, "title": "First Contact: Global team simulates message from extraterrestrial intelligence to Earth - SETI Institute", "description": "May 22, 2023, Mountain View, CA – What would happen if we received a message from an extraterrestrial civilization? Daniela de Paulis, an established interdisciplinary artist and licensed radio operator who currently serves as Artist in Residence at the SETI …", "url": "https://www.seti.org/press-release/first-contact-global-team-simulates-message-extraterrestrial-intelligence-earth", "urlToImage": "https://www.seti.org/sites/default/files/2023-05/3_telescopes.jpg", "publishedAt": "2023-05-22T16:25:23Z", "content": "May 22, 2023, Mountain View, CA What would happen if we received a message from an extraterrestrial civilization? Daniela de Paulis, an established interdisciplinary artist and licensed radio operato… [+7756 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Immunovirological and environmental screening reveals actionable risk factors for fatal COVID-19 during post-vaccination nursing home outbreaks - Nature.com", "description": "Although vaccination drops COVID-19 mortality in older adults, post-vaccine fatal COVID-19 in nursing home outbreaks was linked to Delta, Gamma and Mu variants, persistently detected in aerosols. Mortality was predicted by IFNB1 or age, ORF7a and ACE2 mRNAs.", "url": "https://www.nature.com/articles/s43587-023-00421-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs43587-023-00421-1/MediaObjects/43587_2023_421_Fig1_HTML.png", "publishedAt": "2023-05-22T15:15:24Z", "content": null}]}