{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers “Split” Phonons in Step Toward New Type of Linear Mechanical Quantum Computer - SciTechDaily", "description": "The experiments are the first of their kind and could lead to new advances in computing. A team at the University of Chicago has explored the quantum properties of phonons, the quantum particles that transmit sound. They have shown that phonons can be \"split\"…", "url": "https://scitechdaily.com/researchers-split-phonons-in-step-toward-new-type-of-linear-mechanical-quantum-computer/", "urlToImage": "https://scitechdaily.com/images/Researchers-Split-Phonons.jpg", "publishedAt": "2023-06-12T03:07:12Z", "content": "ByUniversity of ChicagoJune 11, 2023\r\nArtists impression of a platform for linear mechanical quantum computing (LMQC). The central transparent element is a phonon beam splitter. Blue and red marbles … [+9612 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "\"He's Never Had A Tough Interview\" | Royal Roundup 11th June 2023 - TalkTV", "description": "Prince Harry was court over allegations that the Mirror Group Newspapers (MGN), who he is suing alongside used allegedly unlawful tactics to get stories abou...", "url": "https://www.youtube.com/watch?v=NWpafhI1K78", "urlToImage": "https://i.ytimg.com/vi/NWpafhI1K78/maxresdefault.jpg", "publishedAt": "2023-06-11T20:30:01Z", "content": null}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Robert Smith, Owen Walker", "title": "UBS sets 'red lines' for Credit Suisse staff after takeover completion - Financial Times", "description": "Diktat is designed to reduce the risk of the transaction, orchestrated by the Swiss government", "url": "https://www.ft.com/content/dcadb6dc-482f-4a76-9db8-9bcbb337c40f", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9e99d321-2511-4689-83dc-e1845429df44.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2023-06-11T20:00:47Z", "content": "UBS is to impose tight restrictions on Credit Suisse bankers including a ban on new clients from high-risk countries and on complex financial products as it prepares to take over its ailing rival as … [+3907 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "White Dwarf Star Enters Its Crystallization Era, Turning Into A 'Cosmic Diamond' - ScienceAlert", "description": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky.", "url": "https://www.sciencealert.com/white-dwarf-star-enters-its-crystallization-era-turning-into-a-cosmic-diamond", "urlToImage": "https://www.sciencealert.com/images/2023/06/diamond-star.jpg", "publishedAt": "2023-06-11T06:01:15Z", "content": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky. And for some of them, that may actually be sort of true.\r\nAs a certain type of dead star cools, i… [+5584 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}]}