{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "SAG strike: Actors join writers on Hollywood picket lines - BBC", "description": "The industry's biggest shutdown since 1960 has already impacted major films and promotional events.", "url": "https://www.bbc.com/news/world-us-canada-66205719", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11B1E/production/_130387427_susan.jpg", "publishedAt": "2023-07-14T18:10:13Z", "content": "Media caption, Watch: How the Hollywood strike affects you in 75 seconds\r\nJason Sudeikis, Susan Sarandon and thousands of actors have joined screenwriters on Hollywood picket lines in its biggest str… [+4705 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Harvard claims it found elixir of youth - but biologists have expressed concerns over the claims - Daily Mail", "description": "Biologists and Harvard staff are slamming a study co-authored by David Sinclair with Harvard Medical School that claims to have found a way to reverse ageing - saying it provides no evidence.", "url": "https://www.dailymail.co.uk/sciencetech/article-12295585/Harvard-claims-elixir-youth-biologists-expressed-concerns-claims.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/07/14/00/73197345-0-image-a-17_1689291106479.jpg", "publishedAt": "2023-07-14T14:32:41Z", "content": "Harvard scientists believe they are one step closer to a fountain of youth pill that can de-age people.\r\nThe team discovered six chemical cocktails that reversed the aging process in human and mice s… [+9246 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "Volcanic Hotspot Found on the Moon - Universe Today", "description": "A recent study published in Nature examines a volcanic hotspot that potentially exists beneath a feature on the Moon’s farside (the side facing away from the Earth) called the Compton-Belkovich Thorium Anomaly. Researchers led by the Planetary Science Institu…", "url": "https://www.universetoday.com/162364/volcanic-hotspot-found-on-the-moon/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/07/Low-Res_Figure-location-of-granite-on-Moon.jpg", "publishedAt": "2023-07-14T02:12:00Z", "content": "A recent study published in Nature examines a volcanic hotspot that potentially exists beneath a feature on the Moons farside (the side facing away from the Earth) called the Compton-Belkovich Thoriu… [+3976 chars]"}]}