{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Antidepressant Withdrawal Should Be Taken Seriously - Neuroscience News", "description": "It can take nine months or more for people who have used antidepressants for a long term to find relief from withdrawal symptoms. Researchers address the common symptoms of antidepressant withdrawal and steps to take to help improve symptoms.", "url": "https://neurosciencenews.com/antidepressant-withdrawal-22873/", "urlToImage": "https://neurosciencenews.com/files/2023/03/antidepressant-withdrawl-neurosicencce.jpg", "publishedAt": "2023-03-26T21:36:22Z", "content": "Summary: It can take nine months or more for people who have used antidepressants for the long term to find relief from withdrawal symptoms. Researchers address the common symptoms of antidepressant … [+6584 chars]"}, {"source": {"id": null, "name": "HarpersBAZAAR.com"}, "author": "Quinci LeGardye", "title": "Gwyneth Paltrow Denies Fault in Ski Collision Trial - Harper's BAZAAR", "description": "Here's what we know about the case (including why Taylor Swift came up during questioning).", "url": "https://www.harpersbazaar.com/celebrity/latest/a43421076/gwyneth-paltrow-ski-collision-trial/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1249295266-6420a5597ccad.jpg?crop=1xw:0.7498500299940012xh;center,top&resize=1200:*", "publishedAt": "2023-03-26T20:59:26Z", "content": "Gwyneth Paltrow has taken the stand in a trial involving a 2016 ski accident.\r\nThe Academy Award-winning actress and Goop founder is currently involved in a trial regarding an alleged hit-and-run ski… [+3571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ingenious Photosynthesis \"Hack\" Paves Way for Renewable Energy Breakthroughs - SciTechDaily", "description": "Researchers have ‘hacked’ the earliest stages of photosynthesis, the natural machine that powers the vast majority of life on Earth, and discovered new ways to extract energy from the process, a finding that could lead to new ways of generating clean fuel and…", "url": "https://scitechdaily.com/ingenious-photosynthesis-hack-paves-way-for-renewable-energy-breakthroughs/", "urlToImage": "https://scitechdaily.com/images/Photosynthesis-Hack-New-Ways-of-Generating-Renewable-Energy.jpg", "publishedAt": "2023-03-26T15:32:48Z", "content": "ByUniversity of CambridgeMarch 26, 2023\r\nIn a groundbreaking development, researchers have successfully hacked the initial stages of photosynthesis the natural process that fuels the majority of life… [+7340 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Christian Oliver", "title": "Seven signs your 'online romance' is really an artificial intelligence SCAMMER - Daily Mail", "description": "Dating apps have transformed the way in which we find love. But what if AI chatbots can access those same apps? An expert has provided top tips to help you stay safe online.", "url": "https://www.dailymail.co.uk/sciencetech/article-11898319/Seven-signs-online-romance-really-artificial-intelligence-SCAMMER.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/24/16/66274417-0-image-a-12_1679675390227.jpg", "publishedAt": "2023-03-26T08:11:30Z", "content": "The recent emergence of artificial intelligence chatbots has already changed the world. From ChatGPT, to Microsoft's Bing AI, and Google's newly released Bard, the advancement in human technology is … [+5110 chars]"}, {"source": {"id": null, "name": "Dark Horizons"}, "author": "Garth Franklin", "title": "Microsoft Activision Deal Scores UK Win - Dark Horizons", "description": "One of the biggest hurdles in the way of Microsoft’s $69 billion acquisition deal to buy Activision Blizzard appears to have fallen as UK regulators have announced a provisional finding that the acquisition would not harm competition. The UK’s Competition and…", "url": "https://www.darkhorizons.com/microsoft-activision-deal-scores-uk-win/", "urlToImage": "https://cdndh.darkhorizons.com/wp-content/uploads/2023/03/microsoft-activision-deal-scores-uk-win.jpg", "publishedAt": "2023-03-26T01:58:42Z", "content": "One of the biggest hurdles in the way of Microsoft’s $69 billion acquisition deal to buy Activision Blizzard appears to have fallen as UK regulators have announced a provisional finding that the acqu… [+2535 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surreal! NASA shares DEAFENING screams of the Sun; Listen to the scary sound - HT Tech", "description": "The audio tech aboard the NASA Solar and Helioscopic Observatory (SOHO) has detected sound waves emerging from the Sun. It can drive anyone DEAF!", "url": "https://tech.hindustantimes.com/tech/news/surreal-nasa-shares-deafening-screams-of-the-sun-listen-to-the-scary-sound-71679742639421.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/faintyoung_1648896828205_1679742736270_1679742736270.jpg", "publishedAt": "2023-03-25T11:16:48Z", "content": "Last month, NASA made a remarkable discovery when it recorded the sound coming from RS Puppis, a Cepheid variable star which is located about 6,500 light-years away. But that's not all the sound we c… [+1818 chars]"}]}