{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Views of Mars Captured by Ultraviolet Eye Aboard NASA's MAVEN Spacecraft - SciTechDaily", "description": "NASA's MAVEN spacecraft has produced two captivating ultraviolet images of Mars, taken during opposite points in the planet's orbit around the Sun in 2022 and 2023. These images, vividly colorized for visibility, give unique insights into the Martian atmosphe…", "url": "https://scitechdaily.com/stunning-views-of-mars-captured-by-ultraviolet-eye-aboard-nasas-maven-spacecraft/", "urlToImage": "https://scitechdaily.com/images/NASA-MAVEN-Spacecraft-Ultraviolet-Views-of-Mars.jpg", "publishedAt": "2023-06-25T21:14:41Z", "content": "ByWillow Reed, LASP, University of Colorado BoulderJune 25, 2023\r\nNASAs MAVEN mission has captured two remarkable ultraviolet images of Mars at different points in its orbit in 2022 and 2023, offerin… [+6054 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": null, "title": "If Humans Went Extinct, What Would The Earth Look Like One Year Later? - IFLScience", "description": "Have You Ever Wondered What The World Would Be Like If Everyone Suddenly Disappeared?", "url": "https://www.iflscience.com/if-humans-went-extinct-what-would-the-earth-look-like-one-year-later-69510", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69510/aImg/68784/world-meta.jpg", "publishedAt": "2023-06-25T20:19:20Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to curiouskidsus@theconversation.com.\r\nIf humans went extinct, what would the Earth lo… [+6382 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Latest News on Wagner Group Mutiny in Russia - Bloomberg", "description": "Russian officials met with allies, including in China and North Korea, a day after the leader of the Wagner mercenary group, Yevgeny Prigozhin, halted his advance toward Moscow. That sudden turnaround defused the biggest threat to President Vladimir Putin’s a…", "url": "https://www.bloomberg.com/news/articles/2023-06-25/latest-news-on-russia-and-wagner-mercenary-group", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/imZsmLGEJBio/v1/1200x800.jpg", "publishedAt": "2023-06-25T19:55:31Z", "content": "Sign up to receive the Balance of Power newsletter in your inbox, and follow Bloomberg Politics on Twitter and Facebook for more.\r\nRussian officials met with allies, including in China and North Kore… [+226 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coolest Rocky Exoplanet Ever: James Webb Reveals Surprising Atmosphere of TRAPPIST-1 C - SciTechDaily", "description": "Infrared measurements of TRAPPIST-1 c indicate that it is probably not as Venus-like as once imagined. NASA’s James Webb Space Telescope has successfully measured the heat radiating from TRAPPIST-1 c, an exoplanet orbiting a red dwarf star 40 light-years from…", "url": "https://scitechdaily.com/coolest-rocky-exoplanet-ever-james-webb-reveals-surprising-atmosphere-of-trappist-1-c/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Illustration.jpg", "publishedAt": "2023-06-25T15:25:29Z", "content": "BySpace Telescope Science InstituteJune 25, 2023\r\nNASAs James Webb Space Telescope has discovered that exoplanet TRAPPIST-1 c, despite being the same size as Venus and receiving similar radiation, do… [+18400 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "The Earth's Rotational Pole has Shifted from All the Groundwater We've Pumped Out - Universe Today", "description": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geological Survey. Glaciers and ice caps make up another 1.74%, but…", "url": "https://www.universetoday.com/162069/the-earths-rotational-pole-has-shifted-from-all-the-groundwater-weve-pumped-out/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/9837.jpg", "publishedAt": "2023-06-23T21:31:39Z", "content": "Earth is, in many ways, a water world. Around two-thirds of its surface is covered in water, and the oceans that provide that cover make up over 96% of all water on Earth, according to the US Geologi… [+4136 chars]"}]}