{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ukraine counter-offensive: Kyiv says it has liberated villages in Donetsk region - BBC", "description": "The four small villages are the first officially publicised gains in Kyiv's counter-offensive.", "url": "https://www.bbc.com/news/world-europe-65873831", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16964/production/_130061529_ukraine.jpg", "publishedAt": "2023-06-12T11:08:10Z", "content": "Ukraine says it has liberated four villages in the south-east of the country in the first victories of its much-anticipated counter-offensive.\r\nOfficials reported on Monday that \"the national flag is… [+4438 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Tim Hardwick", "title": "Cheaper Apple Vision Headset Likely to Launch by End of 2025 - MacRumors", "description": "Apple still plans to launch a more affordable version of its Vision Pro headset by the end of 2025, with the non-Pro model likely to be called...", "url": "https://www.macrumors.com/2023/06/12/cheaper-apple-vision-headset-2025/", "urlToImage": "https://images.macrumors.com/t/MlukHR9e4qcpsAVv5mA-UvNP5qg=/1600x/article-new/2023/06/vision-pro-headset.jpg", "publishedAt": "2023-06-12T11:02:17Z", "content": "Apple still plans to launch a more affordable version of its Vision Pro headset by the end of 2025, with the non-Pro model likely to be called \"Apple Vision One,\" or more simply, \"Apple Vision,\" acco… [+1896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "\"He's Never Had A Tough Interview\" | Royal Roundup 11th June 2023 - TalkTV", "description": "Prince Harry was court over allegations that the Mirror Group Newspapers (MGN), who he is suing alongside used allegedly unlawful tactics to get stories abou...", "url": "https://www.youtube.com/watch?v=NWpafhI1K78", "urlToImage": "https://i.ytimg.com/vi/NWpafhI1K78/maxresdefault.jpg", "publishedAt": "2023-06-11T20:30:01Z", "content": null}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Final countdown? Celebrity supergiant star Betelgeuse in its last flicker - Geo News", "description": "An expert from Japan believes that the core will collapse a few tens of years after the carbon exhaustion", "url": "https://www.geo.tv/latest/492545-final-countdown-celebrity-supergiant-star-betelgeuse-in-its-last-flicker", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-06-11/492545_064950_updates.jpg", "publishedAt": "2023-06-11T13:40:05Z", "content": "Scientists have started debating about when Betelgeuse a red giant star around 500 to 600 lightyears away is going to die in an explosion, as it glowing at 150% of its baseline brightness, becoming a… [+2593 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}]}