{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Crazy Mystery of Jupiter's Stunning Color Changes Finally Solved? - SciTechDaily", "description": "Researchers have used NASA's Juno mission data to suggest that Jupiter's changing stripes could be caused by torsional oscillations in the planet's magnetic field. These wave-like motions may bridge the understanding gap between Jupiter's surface phenomena an…", "url": "https://scitechdaily.com/?p=280399", "urlToImage": "https://scitechdaily.com/images/Jupiter-May-2001-and-December-2011.jpg", "publishedAt": "2023-05-27T03:42:39Z", "content": "ByUniversity of LeedsMay 26, 2023\r\nImages from a ground-based infra-red telescope, showing Jupiter at 5 micron wavelength radiation. The remarkable change between May 2001 and December 2011 in the No… [+6965 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Matt Wales", "title": "Microsoft lays out appeal against CMA's Activision Blizzard acquisition block - Eurogamer.net", "description": "Just as it said it would, Microsoft has appealed the CMA's decision to block its acquisition of Activision Blizzard, an…", "url": "https://www.eurogamer.net/microsoft-lays-out-appeal-against-cmas-activision-blizzard-acquisition-block", "urlToImage": "https://assetsio.reedpopcdn.com/activision-blizzard_p0yB13e.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp", "publishedAt": "2023-05-26T19:12:15Z", "content": "Just as it said it would, Microsoft has appealed the CMA's decision to block its acquisition of Activision Blizzard, and its summary of arguments is now available for scrutiny.\r\nIn April, after month… [+2490 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "New volatile sunspot grows 4 times bigger than the Earth; Will it unleash a solar storm? - HT Tech", "description": "A new sunspot has emerged on the Sun, which has grown overnight to gain a size four times the size of the Earth. The sunspot likely harbors an unstable magnetic field and can explode, sparking a solar storm.", "url": "https://tech.hindustantimes.com/tech/news/new-volatile-sunspot-grows-4-times-bigger-than-the-earth-will-it-unleash-a-solar-storm-71685072205218.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/faintyoung_1652920721271_1685072261434.jpg", "publishedAt": "2023-05-26T03:42:37Z", "content": "As astronomers continue to monitor the sunspot AR3311 for any signs of eruption, a new sunspot is making a mark on the Sun. This new sunspot was practically invisible to the telescopes of NASA and th… [+2854 chars]"}]}