{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "New Drug to Lower Brain Pressure Could Treat Blinding Headaches - Neuroscience News", "description": "Exenatide, an injectable peptide currently in phase two clinical trials for treating type 2 diabetes, reduces symptoms of Idiopathic Intercranial Hypertension blinding headaches, a new study reports.", "url": "https://neurosciencenews.com/blinding-iih-headache-22768/", "urlToImage": "https://neurosciencenews.com/files/2023/03/blinding-headache-neurosicences-public-1.jpg", "publishedAt": "2023-03-13T13:01:24Z", "content": "Summary: Exenatide, an injectable peptide currently in phase two clinical trials for treating type 2 diabetes, reduces symptoms of Idiopathic Intercranial Hypertension blinding headaches, a new study… [+6721 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Iwao Hakamada: Japan retrial for world's longest-serving death row inmate - BBC", "description": "Iwao Hakamada, now 87, was on death row for nearly half a century after being convicted of murder.", "url": "https://www.bbc.com/news/world-asia-64938840", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12BC/production/_128969740_iwao-gettyimages-1184523391.jpg", "publishedAt": "2023-03-13T11:31:37Z", "content": "A Japanese man who was on death row for nearly half a century has been granted a retrial.\r\nIwao Hakamada, now 87, is the world's longest-serving death row inmate, according to Amnesty International.\r… [+2445 chars]"}, {"source": {"id": null, "name": "Android Police"}, "author": "Arol Wright", "title": "Google stops accepting new Pixel Superfans in the UK shortly after launch - Android Police", "description": "All four UK countries could briefly join the club", "url": "https://www.androidpolice.com/google-pixel-superfans-club-uk-full/", "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2023/02/android-14-dp-1-upside-down-cake-google-pixel-6-desk.jpg", "publishedAt": "2023-03-13T10:22:00Z", "content": "There's a lot to love about Pixel phones. Maybe it's the software, or the cameras, or the unique design and feel, but there's something about the Pixels that just draws people in. Google might not se… [+3239 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Peter", "title": "Weekly deals: the best smartphone deals from the UK, Germany, India and the US - GSMArena.com", "description": "We found some straight discounts this week, as well as offer that bundle devices with headphones. Finding the best deals is a game of patience – pre-order...", "url": "https://www.gsmarena.com/weekly_deals_the_best_smartphone_deals_from_germany_the_uk_india_and_the_us-news-57858.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/23/03/weekly-deals-10/-952x498w6/gsmarena_000.jpg", "publishedAt": "2023-03-12T19:01:01Z", "content": "Finding the best deals is a game of patience pre-order promos and sales events like Black Friday lean heavily on advertising, but sometimes its better to wait things out. This week we found a lot of … [+8496 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "Enzymes Make Electricity From Thin Air - Hackaday", "description": "There’s an old magic trick known as the miser’s dream, where the magician appears to pull coins from thin air. Australian scientists say they can now generate electricity out of thin ai…", "url": "https://hackaday.com/2023/03/11/enzymes-make-electricity-from-thin-air/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/hucs.png", "publishedAt": "2023-03-11T18:00:00Z", "content": "There’s an old magic trick known as the miser’s dream, where the magician appears to pull coins from thin air. Australian scientists say they can now generate electricity out of thin air with the hel… [+831 chars]"}]}