{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Scientists discover water inside tiny beads of glass on moon - Al Jazeera English", "description": "Analysis of lunar soil samples shows spheres of glass hold water inside them, scientists have said.", "url": "https://www.aljazeera.com/news/2023/3/27/scientists-find-water-inside-glass-beads-scattered-across-moon", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/03/33AE7T4-highres.jpg?resize=1920%2C1440", "publishedAt": "2023-03-27T17:58:42Z", "content": "Scientists say they have discovered water trapped inside tiny beads of glass scattered across the moon, suggesting a potential reservoir of this precious resource for future human activities on the l… [+2962 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Joe Rossignol", "title": "iPhone 15 Rumored to Lack SIM Card Tray in France and Likely Other Countries - MacRumors", "description": "iPhone 15 and iPhone 15 Pro models could launch without a SIM card tray in France this year, according to information obtained by French website...", "url": "https://www.macrumors.com/2023/03/27/iphone-15-esim-only-france-rumor/", "urlToImage": "https://images.macrumors.com/t/b6OfenYVmCDmN7mZMHPeGvZiIac=/1600x/article-new/2023/03/iPhone-eSIM-Setup.jpeg", "publishedAt": "2023-03-27T13:15:30Z", "content": "iPhone 15 and iPhone 15 Pro models could launch without a SIM card tray in France this year, according to information obtained by French website MacGeneration. This means the devices would work with … [+1466 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Risk of death following COVID-19 vaccination or positive SARS-CoV-2 test in young people in England - Nature.com", "description": "Rare but serious cardiac disease side effects have been linked to COVID-19 vaccinations, especially in young people. Here, the authors find very little evidence of an association between vaccination and mortality, except for in females after a non mRNA vaccin…", "url": "https://www.nature.com/articles/s41467-023-36494-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-023-36494-0/MediaObjects/41467_2023_36494_Fig1_HTML.png", "publishedAt": "2023-03-27T08:16:31Z", "content": "Characteristics of the study population\r\nThere were 3807 deaths of 12 to 29 year-olds in England that occurred between 8 December 2020 and 25 May 2022 and were registered by 8 June 2022 (Supplementar… [+13808 chars]"}]}