{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Dinah Van Tulleken", "title": "What it's REALLY like being married to a healthy-eating fanatic - Daily Mail", "description": "It all started with the Alpen, but things didn't really come to a head until the night of the Aldi pre-prepared lasagne.", "url": "https://www.dailymail.co.uk/femail/article-12031207/What-REALLY-like-married-healthy-eating-fanatic.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/30/20/70409677-0-image-a-2_1682881332900.jpg", "publishedAt": "2023-04-30T19:14:48Z", "content": "It all started with the Alpen, but things didn't really come to a head until the night of the Aldi pre-prepared lasagne.\r\nThat evening, after a full day of work, I'd rushed home, running late as usua… [+11800 chars]"}, {"source": {"id": null, "name": "Push Square"}, "author": "Ryan Craddock", "title": "Upcoming PS5, PS4 Games for May and June 2023 - Push Square", "description": "Lord of the Rings! Street Fighter! Final Fantasy!", "url": "https://www.pushsquare.com/guides/upcoming-ps5-ps4-games-for-may-and-june-2023", "urlToImage": "https://images.pushsquare.com/bdd03970e9739/1280x720.jpg", "publishedAt": "2023-04-30T16:00:00Z", "content": "Summer is fast approaching and the games just keep on coming, with plenty of fantastic titles heading our way over the next couple of months.\r\nAs always, we've been busy putting together some highlig… [+4562 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mammalian Tree of Life Redefined: Genomic Time Machine Traces Back 100 Million Years of Evolution - SciTechDaily", "description": "The research uses the genomes of 241 species and can be used to support animal and human health outcomes. Research led by a team of scientists from the Texas A&M School of Veterinary Medicine and Biomedical Sciences puts to bed the heated scientific debate re…", "url": "https://scitechdaily.com/?p=273013", "urlToImage": "https://scitechdaily.com/images/New-Research-Redefines-Mammalian-Tree-of-Life-scaled.jpg", "publishedAt": "2023-04-30T15:29:16Z", "content": "ByTexas A&amp;M UniversityApril 30, 2023\r\nResearchers from Texas A&amp;M University have used the largest mammalian genomic dataset to track the evolutionary history of mammals, concluding that mamma… [+11339 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Where was YOUR home at the time of the dinosaurs? Check out this map - Daily Mail", "description": "The map was built using research from Northern Arizona University and reveals that humans are 'just a blip in history', according to Ian Webster, the former Google engineer behind it.", "url": "https://www.dailymail.co.uk/sciencetech/article-12016535/Where-home-time-dinosaurs-Check-map.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/26/21/70272399-0-image-a-44_1682540041896.jpg", "publishedAt": "2023-04-30T08:12:02Z", "content": "Let's be honest, we've all wondered it.\r\nObviously Britain wasn't Britain when dinosaurs walked the Earth, but where exactly was your home at the time of T.Rex, Stegosaurus and Diplodocus?\r\nWell, an … [+7898 chars]"}, {"source": {"id": null, "name": "Fosspatents.com"}, "author": "Florian Mueller", "title": "CMA issued schizophrenic statement on digital markets shortly after announcing to block Microsoft's purchase of Activision Blizzard: UK regulator contradicts own ruling - FOSS Patents", "description": "Were the CMA a person, one would really have to worry about it. As I'll show in this post, the CMA even contradicted itself on a fundamental...", "url": "http://www.fosspatents.com/2023/04/cma-issued-schizophrenic-statement-on.html", "urlToImage": null, "publishedAt": "2023-04-30T07:04:00Z", "content": "Were the CMA a person, one would really have to worry about it. As I'll show in this post, the CMA even contradicted itself on a fundamental question--competition among mobile app stores--on the very… [+11882 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "China's Zhurong Mars Rover Finds Evidence of Water in Martian Sand Dunes - SciTechDaily", "description": "The Zhurong rover, part of China's Tianwen-1 Mars mission, has found evidence of liquid water at low Martian latitudes, indicating potentially habitable environments. This discovery, contradicting previous beliefs that water could only exist in solid or gaseo…", "url": "https://scitechdaily.com/?p=272933", "urlToImage": "https://scitechdaily.com/images/Zhurong-Mars-Rover-Selfie.jpg", "publishedAt": "2023-04-30T02:02:54Z", "content": "ByChinese Academy of SciencesApril 29, 2023\r\nA selfie taken by the Zhurong rover alongside its landing platform, captured with a wireless camera. Credit: Chinese National Space Administration\r\nThe Zh… [+6523 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "ESA's Jupiter-bound Juice spacecraft has a sticky problem with its radar - The Register", "description": "Time to shake, rattle, and roll the probe to remove pesky antenna pin", "url": "https://www.theregister.com/2023/04/29/esa_juice_jupiter_problem/", "urlToImage": "https://regmedia.co.uk/2023/04/28/juice.jpg", "publishedAt": "2023-04-29T09:23:00Z", "content": "A tiny pin stuck in place on ESA's Juice spacecraft may be preventing engineers from unfurling its 16-metre-long antenna as it zooms toward Jupiter.\r\nLaunched two weeks ago, the probe just started it… [+2221 chars]"}]}