{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Ancient dormant viruses found in permafrost, once revived, can infect amoeba - Phys.org", "description": "A team of climate scientists from France, Russia and Germany has found that ancient viruses dormant for tens of thousands of years in permafrost can infect modern amoeba when they are revived. For their study, reported on the open-access site Viruses, the gro…", "url": "https://phys.org/news/2023-03-ancient-dormant-viruses-permafrost-revived.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ancient-dormant-viruse.jpg", "publishedAt": "2023-03-10T18:30:01Z", "content": "A team of climate scientists from France, Russia and Germany has found that ancient viruses dormant for tens of thousands of years in permafrost can infect modern amoeba when they are revived. For th… [+2569 chars]"}, {"source": {"id": null, "name": "Rock Paper Shotgun"}, "author": "Kaan Serin", "title": "Exoprimal deploys its mechs vs. dinos action in July, with an Open Beta next week - Rock Paper Shotgun", "description": "Capcom's dino-hunting live-service is holding an open beta next week, with the full game launching into Game Pass in July", "url": "https://www.rockpapershotgun.com/exoprimal-deploys-its-mechs-vs-dinos-action-in-july-with-an-open-beta-next-week", "urlToImage": "https://assets2.rockpapershotgun.com/exoprimal-network-test.jpg/BROK/thumbnail/1200x630/exoprimal-network-test.jpg", "publishedAt": "2023-03-10T11:02:18Z", "content": "Looks like we won’t need to wait until Exoprimal’s 2040 setting to play the game, as Capcom’s live service dino-hunter is releasing on July 14th, now with a day one Game Pass launch. If that still se… [+2010 chars]"}, {"source": {"id": null, "name": "Techmonitor.ai"}, "author": "Matthew Gooding", "title": "OpenAI's GPT-4 'to launch next week' - Microsoft Germany - Tech Monitor", "description": "Rumours about ChatGPT maker OpenAI's next large language AI model have been swirling for some time. We may not have much longer to wait.", "url": "https://techmonitor.ai/technology/ai-and-automation/gpt-4-openai-microsoft-chatgpt", "urlToImage": "https://techmonitor.ai/wp-content/uploads/sites/4/2023/03/shutterstock_2245489169.jpg?1678467309", "publishedAt": "2023-03-10T09:14:00Z", "content": "GPT-4, the much anticipated new large language AI model from ChatGPT-maker OpenAI, could be released next week according to Microsoft Germanys CTO. The model is likely to be exponentially more powerf… [+2652 chars]"}]}