{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Twitter threatens legal action over Threads app - BBC", "description": "Its owner Elon Musk says \"competition is fine, cheating is not\" a day after the rival app launches.", "url": "https://www.bbc.com/news/world-us-canada-66129215", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F443/production/_130313526_gettyimages-1507106681.jpg", "publishedAt": "2023-07-06T21:53:58Z", "content": "Twitter is considering legal action against Meta over its fast-growing rival app Threads.\r\nThreads, which was launched to millions on Wednesday, is similar to Twitter and has been pitched by Meta bos… [+2769 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "OceanGate: Owner of Titan submersible suspends exploration - BBC", "description": "The firm posts a one-line statement saying it has stopped \"all exploration and commercial operations\".", "url": "https://www.bbc.com/news/world-us-canada-66124767", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9C14/production/_130165993_3e29a70a976ffa3f80f4646fa0ed9045c17216e2313_486_2482_13961000x563.jpg", "publishedAt": "2023-07-06T20:01:24Z", "content": "Media caption, Watch: What debris has been found and what does it mean?\r\nOceanGate, the owner of the Titan submersible that imploded last month, killing all five passengers on board, has fully suspen… [+1667 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Astronaut shares stunning view of July's supermoon from space (photo) - Space.com", "description": "The July full moon was the first of four straight 'supermoons.'", "url": "https://www.space.com/astronaut-iss-july-supermoon-full-moon-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CpXQTU5LpmF68L3MW3r5hg-1200-80.jpg", "publishedAt": "2023-07-06T17:00:09Z", "content": "Astronaut Sultan Al Neyadi of the United Arab Emirates took this stunning photo of the July 3, 2023 supermoon from the International Space Station. (Image credit: Sultan Al Neyadi via Twitter )\r\nAstr… [+3026 chars]"}, {"source": {"id": null, "name": "Rock Paper Shotgun"}, "author": "Ollie Toms", "title": "Today's Wordle hint and answer for Thursday, July 6 - Rock Paper Shotgun", "description": "Struggling with today's Wordle? Use our handy Wordle hint selection to help you, or learn the Wordle answer today with our guide!", "url": "https://www.rockpapershotgun.com/wordle-hint-and-answer-today-06-07-23", "urlToImage": "https://assetsio.reedpopcdn.com/wordle-cat.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp", "publishedAt": "2023-07-06T00:00:00Z", "content": "Need a hint for today's Wordle answer? Time for a break in the day, and a chance to wake up your brain with the old reliable daily Wordle.\r\nEvery day, Wordle presents its legions of players with a de… [+8262 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Planetary Scientists Find Large Granite Formation on Moon’s Far Side - Sci.News", "description": "The 50-km-diameter granitic system discovered below the far side feature known as Compton-Belkovich Volcanic Complex likely was formed from the cooling of molten lava that fed a volcano or volcanoes that erupted approximately 3.5 billion years ago.", "url": "https://www.sci.news/space/lunar-granite-formation-12067.html", "urlToImage": "https://cdn.sci.news/images/2023/07/image_12067-Compton-Belkovich-Volcanic-Complex.jpg", "publishedAt": "2023-07-05T20:07:03Z", "content": "The 50-km-diameter granitic system discovered below the far side feature known as Compton-Belkovich Volcanic Complex likely was formed from the cooling of molten lava that fed a volcano or volcanoes … [+3104 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers discover unique blood plasma protein patterns in patients with long COVID - Medical Xpress", "description": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID that could improve patient outcomes. This research, which used…", "url": "https://medicalxpress.com/news/2023-07-unique-blood-plasma-protein-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fatigue-1.jpg", "publishedAt": "2023-07-05T14:07:50Z", "content": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID th… [+4047 chars]"}]}