{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking New Dark Matter Map Validates Einstein's Theory of General Relativity - SciTechDaily", "description": "Research by the Atacama Cosmology Telescope collaboration has culminated in a significant breakthrough in understanding the evolution of the universe. For millennia, humans have been fascinated by the mysteries of the cosmos. Unlike ancient philosophers imagi…", "url": "https://scitechdaily.com/groundbreaking-new-dark-matter-map-validates-einsteins-theory-of-general-relativity/", "urlToImage": "https://scitechdaily.com/images/ACT-Lensing-Map-scaled.jpg", "publishedAt": "2023-04-12T08:29:55Z", "content": "ByPrinceton UniversityApril 12, 2023\r\nResearchers used the Atacama Cosmology Telescope to create this new map of the dark matter. The orange regions show where there is more mass; purple where there … [+11689 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Volcanic eruption blankets parts of Russia's east in ash - Reuters", "description": "One of Russia's most active volcanoes erupted on the far eastern Kamchatka peninsula, shooting a vast cloud of ash that smothered villages in drifts of gray ...", "url": "https://www.youtube.com/watch?v=P7YONlc5rfU", "urlToImage": "https://i.ytimg.com/vi/P7YONlc5rfU/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGBMgWih_MA8=&rs=AOn4CLDq4l4ydUBzmZe5oR9WEUrFx4G1-w", "publishedAt": "2023-04-11T22:18:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Baking Soda Saves the World: New Additive in Concrete Mix Could Slash Carbon Emissions - SciTechDaily", "description": "MIT engineers discover new carbonation pathways for creating more environmentally friendly concrete. Concrete's carbon footprint could be reduced by 15% if sodium bicarbonate is introduced during the early stages of mixing, according to MIT researchers. The a…", "url": "https://scitechdaily.com/baking-soda-saves-the-world-new-additive-in-concrete-mix-could-slash-carbon-emissions/", "urlToImage": "https://scitechdaily.com/images/Carbon-Dioxide-CO2-Concrete.jpg", "publishedAt": "2023-04-11T21:10:25Z", "content": "When OPC is mixed with water, sand, and gravel material during the production of concrete, it becomes highly alkaline, creating a seemingly ideal environment for the sequestration and long-term stora… [+3844 chars]"}]}