{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Mirror Online"}, "author": "Robbie Savage", "title": "Pep Guardiola must rest Haaland vs Everton to satisfy Man City owners' demands - The Mirror", "description": "ROBBIE FOWLER: Man City have to make changes. They can afford to make 11 changes if Pep Guardiola seriously believes that will help against Real Madrid this week", "url": "https://www.mirror.co.uk/sport/football/news/pep-guardiola-must-rest-erling-29971656", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article29433269.ece/ALTERNATES/s1200/1_Manchester-City-v-Fulham-FC-Premier-League.jpg", "publishedAt": "2023-05-14T06:30:00Z", "content": "Ive got to admit, a couple of weeks ago I thought Everton were down.\r\nSo to be writing in this column that I can see them going into a game against Manchester City with (an admittedly slim) chance of… [+4121 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Vikki Blake", "title": "Players are not happy you cannot pet the dog in Zelda: Tears of the Kingdom - Eurogamer.net", "description": "The world and his dog may be ignoring the sunshine this weekend and shutting themselves away in favour of playing Zelda…", "url": "https://www.eurogamer.net/players-are-not-happy-that-you-cannot-pet-the-dog-in-zelda-tears-of-the-kingdom", "urlToImage": "https://assetsio.reedpopcdn.com/Screenshot-2023-05-13-at-18.01.13.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp", "publishedAt": "2023-05-13T17:05:01Z", "content": "The world and his dog may be ignoring the sunshine this weekend and shutting themselves away in favour of playing Zelda: Tears of the Kingdom, but what happens when you can't even pet the dog? \r\nThat… [+1840 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Astronomers say they've seen the largest explosion yet – and we just had to talk to them - The Register", "description": "The culprit: A supermassive black hole, a billion times more massive than the Sun, feeding on a giant gas cloud", "url": "https://www.theregister.com/2023/05/13/astroboffins_have_witnessed_the_largest/", "urlToImage": "https://regmedia.co.uk/2023/05/12/handout_black_hole.jpg", "publishedAt": "2023-05-13T10:24:00Z", "content": "Astronomers have observed the largest explosion yet in space that we're aware of, a years-long event involving a supermassive black hole estimated to be one billion times more massive than the Sun th… [+3267 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Pangenome Breakthrough: A Crystal Clear Image of Human Genomic Diversity - SciTechDaily", "description": "In a major advance, scientists have assembled genomic sequences of 47 people from diverse backgrounds to create a pangenome, which offers a more accurate representation of human genetic diversity than the existing reference genome. This new pangenome will hel…", "url": "https://scitechdaily.com/?p=277594", "urlToImage": "https://scitechdaily.com/images/Human-Genetic-Diversity-Concept-Image.jpg", "publishedAt": "2023-05-13T10:20:19Z", "content": "ByRockefeller UniversityMay 13, 2023\r\nThe Human Pangenome Reference Consortium has made significant progress in creating a more inclusive human reference genome by assembling genomic sequences of 47 … [+17108 chars]"}]}