{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Twitter threatens legal action over Threads app - BBC", "description": "Its owner Elon Musk says \"competition is fine, cheating is not\" a day after the rival app launches.", "url": "https://www.bbc.com/news/world-us-canada-66129215", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F443/production/_130313526_gettyimages-1507106681.jpg", "publishedAt": "2023-07-06T21:53:58Z", "content": "Twitter is considering legal action against Meta over its fast-growing rival app Threads.\r\nThreads, which was launched to millions on Wednesday, is similar to Twitter and has been pitched by Meta bos… [+2769 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Planetary Scientists Find Large Granite Formation on Moon’s Far Side - Sci.News", "description": "The 50-km-diameter granitic system discovered below the far side feature known as Compton-Belkovich Volcanic Complex likely was formed from the cooling of molten lava that fed a volcano or volcanoes that erupted approximately 3.5 billion years ago.", "url": "https://www.sci.news/space/lunar-granite-formation-12067.html", "urlToImage": "https://cdn.sci.news/images/2023/07/image_12067-Compton-Belkovich-Volcanic-Complex.jpg", "publishedAt": "2023-07-05T20:07:03Z", "content": "The 50-km-diameter granitic system discovered below the far side feature known as Compton-Belkovich Volcanic Complex likely was formed from the cooling of molten lava that fed a volcano or volcanoes … [+3104 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Gwendolyn Rak", "title": "Postacute Effects of COVID on par With Those of Sepsis, Flu - Medscape", "description": "Compared with influenza and sepsis, severe COVID-19 infections resulted in similar risk for neurological and cardiovascular conditions, suggesting a common need for long-term support.", "url": "https://www.medscape.com/viewarticle/994019", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230705_covid_ppi_patient_800x450.jpg", "publishedAt": "2023-07-05T16:02:42Z", "content": "Posthospitalization risks associated with COVID-19 are similar to those associated with other infectious diseases, new research finds.\r\nA large observational study examined population-wide data for 1… [+6191 chars]"}]}