{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "SpaceX launches OneWeb Gen 2 technology demonstrator - SpaceNews", "description": "SpaceX launched a technology demonstration satellite for OneWeb’s second-generation broadband constellation May 20, along with spares for the British firm’s current low Earth orbit network and another that U.S.-based Iridium Communications operates.", "url": "https://spacenews.com/spacex-launches-oneweb-gen-2-technology-demonstrator/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/05/JoeySat-pair-separates-scaled.jpg", "publishedAt": "2023-05-20T15:12:37Z", "content": "TAMPA, Fla. SpaceX launched a technology demonstration satellite for OneWebs second-generation broadband constellation May 20, along with spares for the British firms current low Earth orbit (LEO) ne… [+2727 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "Diet Coke or Coke Zero: Experts give their verdict on which option is healthier - Daily Mail", "description": "Diet Coke and Coke Zero have zero sugar and are low calorie, but many debate which one is healthier. Dietitians have given DailyMail.com their verdict, along with five other matchups.", "url": "https://www.dailymail.co.uk/health/article-12011615/Diet-Coke-Coke-Zero-Experts-verdict-option-healthier.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/25/20/70224157-0-image-a-12_1682450634607.jpg", "publishedAt": "2023-05-20T11:21:29Z", "content": "They are both sugar-free, low-calorie and taste almost as good as the real thing. \r\nBut there have been arguments aplenty over whether Diet Coke or Coke Zero is the healthier option.\r\nNow experts hav… [+9971 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Bevan Hurley", "title": "A British scientist died by a 'freak of nature' stray bullet. Family hope his final act will catch his killer - The Independent", "description": "Gifted astrophysicist Matthew Willson was killed after being struck by a stray bullet while lying in bed with his girlfriend in her Georgia apartment. Sixteen months on, with police yet to identify a suspect, his loved ones tell Bevan Hurley they are desperat…", "url": "https://www.independent.co.uk/news/world/americas/crime/matthew-willson-brookhaven-georgia-gun-violence-b2342426.html", "urlToImage": "https://static.independent.co.uk/2023/05/17/22/MattBlackandWhite.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-05-19T20:57:34Z", "content": "Sign up to our free US news bulletin sent straight to your inbox each weekday morning\r\nSign up to our free morning US email news bulletin\r\nKatherine Shepard describes the shot that killed her boyfrie… [+11256 chars]"}]}