{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysicist Reveals Planet That Could End Life on Earth - SciTechDaily", "description": "Experiment demonstrates our solar system’s fragility. A terrestrial planet hovering between Mars and Jupiter would be able to push Earth out of the solar system and wipe out life on this planet, according to a University of California, Riverside (UCR) experim…", "url": "https://scitechdaily.com/astrophysicist-reveals-planet-that-could-end-life-on-earth/", "urlToImage": "https://scitechdaily.com/images/Solar-System-Montage-Rosette-Nebula-scaled.jpg", "publishedAt": "2023-03-08T09:23:26Z", "content": "ByUniversity of California - RiversideMarch 8, 2023\r\nThis solar system montage of the nine planets and four large moons of Jupiter in our solar system are set against a false-color view of the Rosett… [+5140 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrea Blanco", "title": "Mexico kidnapping — live: Americans seized by drug cartel asked for directions before deadly Matamoros attack - The Independent", "description": "Video appears to capture the moment Latavia ‘Tay’ Mcgee, Shaeed Woodard, Zindell Brown and Eric James Williams were kidnapped in Matamoros – an area dominated by the Gulf drug cartel", "url": "https://www.independent.co.uk/news/world/americas/crime/matamoros-mexico-americans-kidnapping-latest-news-b2296246.html", "urlToImage": "https://static.independent.co.uk/2023/03/08/01/AP23066721072548.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-03-08T07:00:00Z", "content": "Gulf drug cartel believed to be behind attack\r\nGovernor of Tamaulipas Américo Villarreal said during a press conference that the group was moved from different locations, including a clinic, during t… [+1248 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Bumblebees learn to solve puzzles by watching peers, study finds - BBC", "description": "Scientists who trained bees to open a puzzle find that they pass the knowledge on to their colonies.", "url": "https://www.bbc.com/news/uk-64884107", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/101F6/production/_128883066_gettyimages-509084655.jpg", "publishedAt": "2023-03-08T03:38:05Z", "content": "Bumblebees learn to solve puzzles by watching their more experienced peers, scientists in Britain have found.\r\nExperts from Queen Mary University of London trained a set of bees to open a puzzle box … [+2053 chars]"}]}