{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Cosmic Coup: Sniffing Out Methane on a Distant World - SciTechDaily", "description": "NASA's James Webb Space Telescope has detected methane in the atmosphere of the exoplanet WASP-80 b, a milestone in space exploration. This discovery, confirmed through advanced light analysis methods, sheds light on the planet’s formation and allows for comp…", "url": "https://scitechdaily.com/webbs-cosmic-coup-sniffing-out-methane-on-a-distant-world/", "urlToImage": "https://scitechdaily.com/images/Methane-Exoplanet-WASP-80-b-scaled.jpg", "publishedAt": "2023-11-23T09:45:18Z", "content": "ByTaylor Bell and Luis WelbanksNovember 23, 2023\r\nAn artists rendering of the warm exoplanet WASP-80 b whose color may appear bluish to human eyes due to the lack of high-altitude clouds and the pres… [+12773 chars]"}, {"source": {"id": null, "name": "Rock Paper Shotgun"}, "author": "James Archer", "title": "Black Friday deal spotlight: an RTX 4060 GPU that's cheaper than most RTX 3060s - Rock Paper Shotgun", "description": "Black Friday is delivering the deals on RTX 40 series graphics cards. Here's an Gigabyte-made RTX 4060, factory overclocked, for just £274.", "url": "https://www.rockpapershotgun.com/black-friday-deal-spotlight-an-rtx-4060-gpu-thats-cheaper-than-most-rtx-3060s", "urlToImage": "https://assetsio.reedpopcdn.com/Gigabyte-GeForce-RTX-4060-Windforce-OC_8T0gQqR.JPG?width=1200&height=630&fit=crop&enable=upscale&auto=webp", "publishedAt": "2023-11-22T15:46:07Z", "content": "Nvidia don’t really make budget graphics cards anymore, so it’s up to the Black Friday sales to provide the next best thing: price-slashed mid-rangers. This RTX 4060 deal is just the ticket, with Ama… [+1461 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Looking for the last universal common ancestor of all living organisms - Phys.org", "description": "LUCA, the \"last universal common ancestor\" of all living organisms, lived 4.32–4.52 billion years ago, according to a study from NIOZ biologists Tara Mahendrarajah and senior author Anja Spang, with collaborating partners from Universities in Bristol, Hungary…", "url": "https://phys.org/news/2023-11-universal-common-ancestor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/looking-for-luca-and-t.jpg", "publishedAt": "2023-11-21T17:41:03Z", "content": "LUCA, the \"last universal common ancestor\" of all living organisms, lived 4.324.52 billion years ago, according to a study from NIOZ biologists Tara Mahendrarajah and senior author Anja Spang, with c… [+3368 chars]"}]}