{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astonishing Discovery Reveals Water in Our Solar System May Have Originated Billions of Years Before the Sun - SciTechDaily", "description": "ALMA Traces History of Water in Planet Formation Back to the Interstellar Medium Observations of water in the disk forming around protostar V883 Ori have unlocked clues about the formation of comets and planetesimals in our own Solar System. Scientists studyi…", "url": "https://scitechdaily.com/?p=259198", "urlToImage": "https://scitechdaily.com/images/History-of-Water-in-Planet-Formation.jpg", "publishedAt": "2023-03-09T09:24:38Z", "content": "ByNational Radio Astronomy ObservatoryMarch 9, 2023\r\nV883 Ori is a remarkable protostar that boasts a temperature that is just hot enough for converting water in its circumstellar disk into gas. This… [+10014 chars]"}, {"source": {"id": null, "name": "Android Authority"}, "author": null, "title": "Google Pixel Fold allegedly spotted in the wild for the first time - Android Authority", "description": "The highly anticipated Google Pixel Fold might have just been seen in the wild for the very first time thanks to a Reddit user.", "url": "https://www.androidauthority.com/google-pixel-fold-3294462/", "urlToImage": "https://www.androidauthority.com/wp-content/uploads/2021/10/Google-Logo-on-Google-Pixel-6.jpg", "publishedAt": "2023-03-08T21:12:39Z", "content": "<ul><li>A Reddit user claims they saw a Google employee with a Pixel Fold while on a train.</li><li>The user described the device as dark blue or black, thin bezels on the outside, and thin.</li><li>… [+1558 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "What's It Like to Take Ozempic? A Doctor's Own Story - Medscape", "description": "With the rising popularity of weight loss drug injections, you may be getting many more questions from patients. Here, a doctor shares her own experience of taking these medications.", "url": "https://www.medscape.com/viewarticle/989076", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_190920_ozempic_800x450.jpg", "publishedAt": "2023-03-08T15:33:19Z", "content": "With the rising popularity of weight loss drug injections, I've received many questions from patients about the pros, cons, and costs. While Ozempic (semaglutide) is perhaps the best known, it's tech… [+6677 chars]"}]}