{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Johnny Depp discusses return to cinema after Amber Heard court case - BBC News - BBC News", "description": "Johnny Depp has spoken to the BBC about his return to cinema following a three year break.The Hollywood actor attended the premiere of Jeanne du Barry, in wh...", "url": "https://www.youtube.com/watch?v=Tpq3IXfrejc", "urlToImage": "https://i.ytimg.com/vi/Tpq3IXfrejc/maxresdefault.jpg", "publishedAt": "2023-05-18T13:12:35Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New DNA Research Changes Origin of Human Species - SciTechDaily", "description": "New model for human evolution suggests Homo sapiens arose from multiple closely related populations. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations across Africa, with the earliest …", "url": "https://scitechdaily.com/new-dna-research-changes-origin-of-human-species/", "urlToImage": "https://scitechdaily.com/images/Human-Homo-Sapien-Concept-Art-Illustration.jpg", "publishedAt": "2023-05-18T12:44:46Z", "content": "ByUniversity of California - DavisMay 18, 2023\r\nA new model for human evolution asserts that modern Homo sapiens stemmed from multiple genetically diverse populations across Africa rather than a sing… [+6176 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Currie", "title": "We regret to inform you Earth will not be destroyed by an asteroid within 1,000 years - The Register", "description": "Never mind, there's always nuclear war and climate catastrophe", "url": "https://www.theregister.com/2023/05/17/no_earth_killing_asteroids/", "urlToImage": "https://regmedia.co.uk/2022/02/01/shutterstock_asteroid.jpg", "publishedAt": "2023-05-17T14:31:00Z", "content": "War, genocide, TikTok if it could all end today, some of us would die with a smile on our face knowing there was little about humanity worth preserving.\r\nHowever, we have bad news for the misanthrope… [+3364 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A predatory dinosaur from Brazil and its surprising anatomy - Phys.org", "description": "Irritator challengeri was a two-legged, meat-eating dinosaur, or more precisely—a spinosaurid. The knowledge of the species is based on the most complete fossil skull known from this group. With the aid of X-ray computed tomographs usually used in the context…", "url": "https://phys.org/news/2023-05-predatory-dinosaur-brazil-anatomy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-predatory-dinosaur-f.jpg", "publishedAt": "2023-05-16T20:04:13Z", "content": "Irritator challengeri was a two-legged, meat-eating dinosaur, or more preciselya spinosaurid. The knowledge of the species is based on the most complete fossil skull known from this group. With the a… [+4227 chars]"}]}