{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "ign", "name": "IGN"}, "author": "Anthony Wood", "title": "Scientists May Have Found an ‘Ultramassive Black Hole’ With a Mass of 30 Billion Suns - IGN", "description": "Scientists have found evidence of an \"ultramassive black hole\" with a mass the equivilent of 30 billion Suns hidden in the heart of a distant galaxy.", "url": "https://www.ign.com/articles/scientists-may-have-found-an-ultramassive-black-hole-with-a-mass-of-30-billion-suns", "urlToImage": "https://assets-prd.ignimgs.com/2023/03/30/behemoth-blackhole-1680197096279.jpg?width=1280", "publishedAt": "2023-03-30T19:48:54Z", "content": "Scientists may have identified an ultramassive black hole 30 billion times the mass of our sun hiding in an image captured by the Hubble Space Telescope.\r\nBlack holes are born when colossal stars man… [+3368 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Comparison of seven popular structured dietary programmes and risk of mortality and major cardiovascular events in patients at increased cardiovascular risk: systematic review and network meta-analysis - The BMJ", "description": "Objective To determine the relative efficacy of structured named diet and health behaviour programmes (dietary programmes) for prevention of mortality and major cardiovascular events in patients at increased risk of cardiovascular disease.\n\nDesign Systematic …", "url": "https://www.bmj.com/content/380/bmj-2022-072003", "urlToImage": "https://www.bmj.com/sites/default/files/highwire/bmj/380/8376.cover-source.jpg", "publishedAt": "2023-03-29T22:45:02Z", "content": "Abstract\r\nObjective To determine the relative efficacy of structured named diet and health behaviour programmes (dietary programmes) for prevention of mortality and major cardiovascular events in pat… [+5117 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Losing weight cuts your risk of heart attacks and type 2 diabetes - even if you put it back on - Daily Mail", "description": "Oxford University researchers found those who shed the pounds still enjoyed health benefits five years later, even if they regained a proportion of the weight.", "url": "https://www.dailymail.co.uk/health/article-11914501/Losing-weight-cuts-risk-heart-attacks-type-2-diabetes-on.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/29/08/69237481-0-image-a-3_1680073829878.jpg", "publishedAt": "2023-03-29T07:17:44Z", "content": "Losing weight can cut the chances of heart attacks and type 2 diabetes even if you put some of it back on.\r\nOxford University researchers found those who shed the pounds still enjoyed health benefits… [+3482 chars]"}]}