{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Rishi Sunak vows to end asylum claims from small boat arrivals - BBC", "description": "Anyone coming to the UK on a small boat will be removed to Rwanda or another country, under new laws.", "url": "https://www.bbc.com/news/uk-64848101", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11E47/production/_122278237_gettyimages-1236771382.jpg", "publishedAt": "2023-03-05T01:40:54Z", "content": "Anyone arriving in the UK on a small boat will be prevented from claiming asylum, under new laws expected to be announced next week.\r\nMinisters will have a duty to \"detain and swiftly remove\" anyone … [+3912 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Ellie Cannon", "title": "DR ELLIE CANNON: My breast has not got lumps but it's itchy, should I be concerned about cancer? - Daily Mail", "description": "DR ELLIE CANNON: Today's reader, aged 72, is asking if she should be worried about a recent itchiness on her left breast, even though she has not found any lumps.", "url": "https://www.dailymail.co.uk/health/article-11820315/DR-ELLIE-CANNON-breast-not-got-lumps-itchy-concerned-cancer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/04/16/68334835-0-image-a-7_1677948213738.jpg", "publishedAt": "2023-03-04T22:01:14Z", "content": "Recently I've been suffering an irritating itch in the centre of my left breast. I've checked for lumps but can't find anything unusual apart from a white blob on the nipple. Should I see my GP? I'm … [+7162 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Watch NASA test fire new and improved Artemis moon rocket engine (video) - Space.com", "description": "The four engines will provide as much as 2 million pounds of thrust to launch the SLS to orbit.", "url": "https://www.space.com/nasa-artemis-moon-rocket-engine-test", "urlToImage": "https://cdn.mos.cms.futurecdn.net/r5xLmySzXDaXZLcoMJJQH7-1200-80.jpg", "publishedAt": "2023-03-04T13:00:10Z", "content": "NASA engineers have hot-fired the redesigned Artemis moon rocket in preparation for future Space Launch System (SLS) flights that will take humanity back to the moon and beyond. \r\nThe test of the RS-… [+2845 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Madeleine Ross", "title": "Netflix subscribers can access hidden upgrade to their favourite shows - Daily Mail", "description": "A Netflix upgrade allows viewers to activate a sound quality upgrade on hundreds of shows. But it's only available to its highest-paying subscribers - here's how to check if that's you.", "url": "https://www.dailymail.co.uk/sciencetech/article-11820023/Netflix-subscribers-access-hidden-upgrade-favourite-shows.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/04/12/68331995-0-image-a-25_1677934341973.jpg", "publishedAt": "2023-03-04T12:54:37Z", "content": "Are you tired of listening to actors mumbling their lines when you watch your favourite shows at home? \r\nA Netflix upgrade allows viewers to activate a sound quality upgrade on hundreds of its most-w… [+1914 chars]"}]}