{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "There's a New Supernova in a Familiar Galaxy. You Can See it in a Small Telescope - Universe Today", "description": "Astronomers discover dozens of supernovae yearly, but seeing one bright and close is rare. If you have a small telescope and camera, you can take pictures of a supernova flaring in the famous Pinwheel Galaxy (M101).", "url": "https://www.universetoday.com/161707/theres-a-new-supernova-in-a-familiar-galaxy-you-can-see-it-in-a-small-telescope/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/M101Sn_Stocks_after_960.jpg", "publishedAt": "2023-05-31T17:38:09Z", "content": "The Pinwheel Galaxy, also known as M101, is a spiral galaxy just 21 million light years away. It’s a popular galaxy for photographs because it’s oriented to us face-on. This means you can see the bri… [+1607 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Junk Food vs Sleep: New Study Reveals Impact of Diet on Sleep Quality - Neuroscience News", "description": "The study revealed that consuming a diet high in sugars and saturated fats leads to deterioration in the quality of deep sleep.", "url": "https://neurosciencenews.com/sleep-junk-food-23363/", "urlToImage": "https://neurosciencenews.com/files/2023/05/junk-food-sleep-neurosincnes.jpg", "publishedAt": "2023-05-30T18:41:06Z", "content": "Summary: Researchers uncovered how an unhealthy diet affects deep sleep quality. The study revealed that consuming a diet high in sugars and saturated fats leads to deterioration in the quality of de… [+8545 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "UAE to launch mission to asteroid belt to discover life's origins - The News International", "description": "The United Arab Emirates  revealed its latest space project Monday to send a spaceship to explore the solar system's main asteroid belt, following the successful launch of the Hope spacecraft to...", "url": "https://www.thenews.com.pk/latest/1075404-uae-to-launch-mission-to-asteroid-belt-to-discover-lifes-origins", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-05-30/1075404_101451_updates.jpg", "publishedAt": "2023-05-30T18:29:00Z", "content": "The United Arab Emirates (UAE) revealed its latest space project Monday to send a spaceship to explore the solar system's main asteroid belt, following the successful launch of the Hope spacecraft to… [+2968 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Risk of long COVID in the United Kingdom and Hong Kong cohorts - News-Medical.Net", "description": "Study evaluates the risk of post-acute sequelae of COVID-19 in the United Kingdom (UK) and Hong Kong (HK).", "url": "https://www.news-medical.net/news/20230530/Risk-of-long-COVID-in-the-United-Kingdom-and-Hong-Kong-cohorts.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749488_16854442428702468.jpg", "publishedAt": "2023-05-30T11:00:00Z", "content": "A recent study published in the eClinicalMedicine Journal evaluated the risk of post-acute sequelae of coronavirus disease 2019 (COVID-19) in the United Kingdom (UK) and Hong Kong (HK).\r\nStudy: Long-… [+5085 chars]"}]}