{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Nicola Davis", "title": "Toddler's mystery infection traced back to cake-snatching iguana - The Guardian", "description": "Three-year-old was on beach in Costa Rica when reptile tried to steal her dessert and bit her hand", "url": "https://www.theguardian.com/science/2023/mar/31/toddlers-mystery-infection-traced-back-to-cake-snatching-iguana", "urlToImage": "https://i.guim.co.uk/img/media/8fbb34097d2e7a7f4f3f9d47c559fdc0799bd251/0_36_2925_1755/master/2925.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e87c1d5c48e04b305519092823d4e265", "publishedAt": "2023-03-31T22:01:00Z", "content": "It could almost be a fable from Aesop, or a story from the Brothers Grimm: the toddler, the lizard and the cake. But for one small child, whose baked treat was snatched by an iguana, it was a tale wi… [+3627 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Surprising link between exercise and negative memory bias discovered - PsyPost", "description": "New research has found that a single bout of exercise is not sufficient to relieve memory bias or rumination, rather it may even aggravate these depressotypic cognitive processes in some individuals. ...", "url": "https://www.psypost.org/2023/03/surprising-link-between-exercise-and-negative-memory-bias-discovered-74611", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/03/woman-struggling-on-exercise-bike.jpg", "publishedAt": "2023-03-31T20:02:33Z", "content": "Exercise typically has positive impacts on mental health outcomes. But a new study suggests that engaging in physical activity might have a surprising side effect. The findings indicate that exercise… [+4841 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Man goes partially blind after adopted cat scratched him on the arm - Daily Mail", "description": "The individual, who has not been named, said the cat would scratch him repeatedly on his arm. Doctors initially thought his symptoms were Covid before diagnosing cat scratch disease.", "url": "https://www.dailymail.co.uk/health/article-11924853/Man-goes-partially-blind-adopted-cat-scratched-arm.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/31/17/69343393-0-image-a-28_1680278867686.jpg", "publishedAt": "2023-03-31T17:05:50Z", "content": "A man from Texas went partially blind in one eye after being scratched by his adopted pet cat.\r\nThe 47-year-old, who has not been named, was infected with bacteria that triggered inflammation in his … [+5384 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Warning signs you are suffering from colorectal cancer - Daily Mail", "description": "Candace Henley, 55, was diagnosed with colorectal cancer at age 35. While the cancer is often considered 'old man's disease' - the average age of diagnosis in the US is getting younger.", "url": "https://www.dailymail.co.uk/health/article-11921625/Warning-signs-suffering-colorectal-cancer.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/31/14/69310587-0-image-a-10_1680268119055.jpg", "publishedAt": "2023-03-31T13:21:02Z", "content": "A woman diagnosed with cancer in her 30s is warning others not to ignore early signs of the disease, amid an epidemic of cases striking young people.\r\nCandace Henley, now 55, was diagnosed with color… [+6796 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ticking Time Bombs: How Our Biological Clock Influences Cluster Headaches and Migraines - SciTechDaily", "description": "Meta-analysis: Cluster headache, migraine have strong links to circadian system. Both cluster headache and migraine have strong links to the circadian system, the internal clock that regulates body processes, according to a meta-analysis published in the Marc…", "url": "https://scitechdaily.com/?p=265168", "urlToImage": "https://scitechdaily.com/images/Woman-Bad-Headache.jpg", "publishedAt": "2023-03-31T12:40:18Z", "content": "A meta-analysis published in Neurology reveals strong links between cluster headaches, migraines, and the circadian system, which regulates internal body processes. The study emphasizes the role of t… [+4061 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Mann", "title": "Toll of San Francisco's homelessness nightmare: Woman filmed after battling flesh eating disease - Daily Mail", "description": "A homeless woman who was filmed saying she did not want to seek medical treatment for a flesh-eating disease destroying her feet has now had both of them amputated.", "url": "https://www.dailymail.co.uk/news/article-11923037/Toll-San-Franciscos-homelessness-nightmare-Woman-filmed-battling-flesh-eating-disease.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/31/05/69321471-0-image-a-40_1680237644581.jpg", "publishedAt": "2023-03-31T06:00:40Z", "content": "A homeless San Francisco woman filmed refusing treatment for a flesh-eating infection on her feet had to have them amputated just weeks later.\r\nThe woman, who was captured on camera by JJ Smith early… [+6346 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "I'm a podiatrist - here's what your feet say about your health - Daily Mail", "description": "From pesky cracked heels to more serious problems, such as swelling, feet often show signs of disease before any other part of your body, says Emma McConnachie, a podiatrist in Falkirk, Scotland.", "url": "https://www.dailymail.co.uk/health/article-11915463/Im-podiatrist-heres-feet-say-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/30/10/69283891-0-image-a-7_1680169672774.jpg", "publishedAt": "2023-03-30T11:35:27Z", "content": "You might not think it but your feet can tell you a surprising amount about your health.\r\nFrom pesky cracked heels and calluses to more serious problems, such as swelling, they often show signs of di… [+9304 chars]"}, {"source": {"id": null, "name": "Oprahdaily.com"}, "author": null, "title": "Ozempic Is Not a Weight-Loss Magic Bullet - Oprah Mag", "description": "The wonder weight-loss drug was just the beginning of one woman’s long journey to heal her traumatic relationship with food.", "url": "https://www.oprahdaily.com/life/health/a43391971/ozempic-weight-loss-experience/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-145671932-6424be472b2a8.png?crop=1.00xw:0.731xh;0,0.131xh&resize=1200:*", "publishedAt": "2023-03-30T11:03:36Z", "content": "Ive been on Ozempic for about a year and a half for my \r\ntype 2 diabetes. My blood sugar levels are normal, and yes, Ive lost weight. I started taking the drug before its wonder-weight-loss propertie… [+9817 chars]"}]}