{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  DR. ITAY GAL", "title": "Breakthrough in HIV cure: Seventh person worldwide appears cured - The Jerusalem Post", "description": "The man has remained in a state of \"viral remission,\" meaning that repeated tests have not detected any trace of HIV in his body.", "url": "https://www.jpost.com/health-and-wellness/article-811150", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/610768", "publishedAt": "2024-07-21T02:55:04Z", "content": "A German resident may be part of a groundbreaking medical milestone after apparently being cured of HIV, a feat accomplished by only six people worldwide in over four decades since the AIDS epidemic … [+4317 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Menopause: Woman with endometriosis shares medication story - BBC.com", "description": "Emma Williams-Tully felt \"vulnerable and alone\" when she was put into a chemical menopause at 20.", "url": "https://www.bbc.com/news/articles/cql835xw819o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7db4/live/ff6952d0-451f-11ef-9e1c-3b4a473456a6.png", "publishedAt": "2024-07-20T20:47:54Z", "content": "By Catriona Aitken, BBC News\r\nAt 20 years old, Emma Williams-Tully had just started a relationship with her now-husband Dan when she was put into a chemical menopause\r\nA woman who was put into a chem… [+6091 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "Low testosterone and high neurofilament protein predict cognitive decline in older men - PsyPost", "description": "A recent study found that older men with low testosterone and high neurofilament protein levels are at a significantly higher risk of cognitive decline, suggesting these biomarkers can effectively predict future dementia.", "url": "https://www.psypost.org/low-testosterone-and-high-neurofilament-protein-predict-cognitive-decline-in-older-men/", "urlToImage": "https://www.psypost.org/wp-content/uploads/2024/07/older-asian-man.jpg", "publishedAt": "2024-07-20T12:01:18Z", "content": "In a recent study conducted by researchers at Fudan University in Shanghai, it was discovered that lower levels of testosterone, combined with higher levels of a protein called neurofilament light ch… [+5505 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Adolescent alcohol use linked to altered hippocampal structure in young adulthood - PsyPost", "description": "Adolescent alcohol use is linked to larger hippocampal volumes, while tobacco and cannabis show no such effect, revealing substance-specific impacts on brain development.", "url": "https://www.psypost.org/adolescent-alcohol-use-linked-to-altered-hippocampal-structure-in-young-adulthood/", "urlToImage": "https://www.psypost.org/wp-content/uploads/2024/07/brain-2.jpg", "publishedAt": "2024-07-19T22:05:54Z", "content": "A recent study published in Experimental and Clinical Psychopharmacology has uncovered a surprising link between adolescent alcohol use and brain structure. Researchers found that larger hippocampal … [+6074 chars]"}]}