{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "PsyPost"}, "author": "Elena Koning", "title": "Psilocybin shows promise for treating eating disorders, but more controlled research is needed - PsyPost", "description": "Recent psychedelic research shows promising results for mental illnesses and eating disorders, with surveys and reports indicating psilocybin-assisted therapy's potential. However, challenges in research methodology, patient safety concerns, and the need for …", "url": "https://www.psypost.org/2023/12/psilocybin-shows-promise-for-treating-eating-disorders-but-more-controlled-research-is-needed-215187", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/12/psychedelic-brain-1.jpg", "publishedAt": "2023-12-26T18:14:38Z", "content": "Psychedelic research has surged in recent years, sparking enthusiasm among clinicians, investors and the general public. Clinical trials are indicating transformative outcomes for people struggling w… [+5433 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Concerning Findings – Substance Found in Common Household and Cosmetic Products Can Change the Epigenetics of Cells - SciTechDaily", "description": "Epigenetics involves chemical processes that regulate gene activity, enabling our cells, tissues, and organs to adapt to environmental changes. However, this adaptive benefit has a downside: epigenetic regulation is more susceptible to disruption by toxins th…", "url": "https://scitechdaily.com/concerning-findings-substance-found-in-common-household-and-cosmetic-products-can-change-the-epigenetics-of-cells/", "urlToImage": "https://scitechdaily.com/images/Epigenetics-Nucleosome.jpg", "publishedAt": "2023-12-26T14:09:44Z", "content": "New research highlights the dangers of formaldehyde, a widespread chemical, on epigenetics. It disrupts key processes controlling gene activity, potentially leading to cancer and other diseases. The … [+4599 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vitamin deficiencies linked to hair loss - IndiaTimes", "description": "Thinning or falling of hair, or suffering from poor hair quality can be deficiencies of several vitamins which are lacking in our body. Having the required amount and a perfect diet can also lead to good quality hair.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vitamin-deficiencies-linked-to-hair-loss/photostory/106021314.cms", "urlToImage": "https://static.toiimg.com/photo/106021328.cms", "publishedAt": "2023-12-25T10:30:00Z", "content": "If you are dealing with dry hair, split ends, increased shedding, slow growth, brittle hair, and breakage, then you are dealing with vitamin C deficiency. One should include vitamin C-rich foods such… [+235 chars]"}]}