{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Catch a Cold, Catch Dementia? The Surprising Connection Unveiled - SciTechDaily", "description": "A study by Tulane University reveals that frequent illness may accelerate brain aging and increase the risk of dementia or cognitive decline. The findings highlight the importance of maintaining good health to prevent infections, especially among the elderly …", "url": "https://scitechdaily.com/catch-a-cold-catch-dementia-the-surprising-connection-unveiled/", "urlToImage": "https://scitechdaily.com/images/Sick-Senior-Woman-Cold-Flu.jpg", "publishedAt": "2023-04-23T09:44:08Z", "content": "Researchers discovered a link between frequent illness and accelerated brain aging, increasing the risk of dementia or cognitive decline. The study, published in Brain, Behavior and Immunity, used ag… [+3902 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Early Indicators of Autism May Be Identified in Fetal Brain Scans - Neuroscience News", "description": "A study by King's College researchers has identified a link between autism traits and isolated fetal ventriculomegaly - a common antenatal brain abnormality. Using MRI brain scans, the study supports the need for early identification and intervention for fami…", "url": "https://neurosciencenews.com/asd-fetal-scan-23082/", "urlToImage": "https://neurosciencenews.com/files/2023/04/fetal-scan-autism-neurosicences.jpg", "publishedAt": "2023-04-22T22:36:46Z", "content": "Summary: A study by King’s College researchers has identified a link between autism traits and isolated fetal ventriculomegaly – a common antenatal brain abnormality. Using MRI brain scans, the study… [+4373 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Van Tulleken", "title": "DR CHRIS VAN TULLEKEN reveals why everyone should care about ultra-processed food - Daily Mail", "description": "Far from buying my little daughter a proper ice cream, I'd given her what one scientist later memorably described to me as 'an industrially produced edible substance'.", "url": "https://www.dailymail.co.uk/health/article-12003173/DR-CHRIS-VAN-TULLEKEN-reveals-care-ultra-processed-food.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/22/23/70130873-0-image-a-29_1682201515748.jpg", "publishedAt": "2023-04-22T22:14:42Z", "content": "Ultra-processed foods (or UPFs) make up a shocking 60 per cent of the average diet in the UK and increasing evidence links their high consumption with the rise in obesity, type 2 diabetes and other d… [+19808 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrea Blanco", "title": "These two men were consumed by Covid psychosis. Only one survived - The Independent", "description": "Two men developed psychosis after becoming infected with Covid-19. One of them ultimately received treatment after his concerns were repeatedly dismissed, while the other died of a possible suicide. Now, their families are trying to raise awareness about the …", "url": "https://www.independent.co.uk/news/world/americas/covid-psychosis-cdc-long-term-effects-vaccine-b2324848.html", "urlToImage": "https://static.independent.co.uk/2023/04/07/18/Screen%20Shot%202023-04-07%20at%201.53.49%20PM.png?quality=75&width=1200&auto=webp", "publishedAt": "2023-04-22T12:38:34Z", "content": "Sign up to our Evening Headlines email for your daily guide to the latest news\r\nSign up to our free US Evening Headlines email\r\nNatalie Barry and her husband Aaron Bazzone became infected with Covid-… [+9434 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "TikToker reveals she has deadly lung disease after vaping for just one YEAR - Daily Mail", "description": "Lucy Turchin, 35, from Oakland, California, was diagnosed with pneumonitis after she had been vaping for only one year. She now shares her story to spread awareness on the dangers of vaping.", "url": "https://www.dailymail.co.uk/health/article-11995409/TikToker-reveals-deadly-lung-disease-vaping-just-one-YEAR.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/21/14/70092591-0-image-a-9_1682084242158.jpg", "publishedAt": "2023-04-22T11:43:46Z", "content": "Before her diagnosis, Ms Turchin worked as a personal trainer. However, her illness now makes it difficult just to walk long distances or get out of bed\r\nA TikToker and personal trainer from Californ… [+5986 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "Urgent warning over illegal tanning nasal sprays being sold online for just £20 - Daily Mail", "description": "EXCLUSIVE: MailOnline found products branded as containing melanotan-2, an artificial hormone that accelerates tanning, were being openly advertised on the likes of websites like Etsy and Depop.", "url": "https://www.dailymail.co.uk/health/article-11986537/Urgent-warning-illegal-tanning-nasal-sprays-sold-online-just-20.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/21/17/70100437-0-image-a-11_1682096288127.jpg", "publishedAt": "2023-04-22T08:38:20Z", "content": "Illegal nasal tanning sprays are being sold online for as little as £20, MailOnline can reveal today.\r\nProducts branded as containing melanotan-2, an artificial hormone that accelerates tanning, were… [+10825 chars]"}, {"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Newsroom", "title": "Calories key to longevity, study finds - Kathimerini English Edition", "description": "The enzyme responsible for the reliable transcription of cells, as the copying of information from DNA is called, lies behind aging, according to researchers at German institutes.", "url": "https://www.ekathimerini.com/news/1209219/calories-key-to-longevity-study-finds/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2023/04/diet_web-960x600.jpg", "publishedAt": "2023-04-22T08:21:56Z", "content": "The enzyme responsible for the reliable transcription of cells, as the copying of information from DNA is called, lies behind aging, according to researchers at German institutes.\r\nA group of researc… [+1728 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Sugar drinks are tasty but they may be killing you slowly - Geo News", "description": "Study reveales drinks with sugar are associated with increased risk of heart disease and can cause death in some cases", "url": "https://www.geo.tv/latest/483414-sugar-drinks-are-tasty-but-they-may-be-killing-you-slowly", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-22/483414_105606_updates.jpg", "publishedAt": "2023-04-22T08:20:00Z", "content": "People will now think carefully before they opt for any cool and sweet drink in the hot weather after a study revealed that drinks with sugar are associated with an increased risk of heart disease an… [+2975 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Scientists Uncover New Strategy for Repairing DNA Damage in Neurons - SciTechDaily", "description": "Researchers discover a mechanism used by neurons to repair damage that occurs during neuronal activity. Researchers have uncovered a novel mechanism for repairing DNA damage in neurons The study reveals a protein complex that initiates a pathway to repair DNA…", "url": "https://scitechdaily.com/harvard-scientists-uncover-new-strategy-for-repairing-dna-damage-in-neurons/", "urlToImage": "https://scitechdaily.com/images/Neuron-Illustration.jpg", "publishedAt": "2023-04-22T05:23:44Z", "content": "I think it opens up the idea that all cell types in the body probably specialize their repair mechanisms depending on their life span, the kinds of stimuli they see, and their transcriptional activit… [+913 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Listen Up: Hearing Aids Could Help Fend Off Dementia - SciTechDaily", "description": "The Lancet Public Health: Hearing aids may protect against a higher risk of dementia associated with hearing loss, study suggests Study of 437,704 people suggests those experiencing hearing loss and not using hearing aids may have a higher risk of dementia th…", "url": "https://scitechdaily.com/listen-up-hearing-aids-could-help-fend-off-dementia/", "urlToImage": "https://scitechdaily.com/images/Man-Holding-Hearing-Aid.jpg", "publishedAt": "2023-04-22T01:03:02Z", "content": "ByThe LancetApril 21, 2023\r\nA study published in The Lancet Public Health suggests that using hearing aids may protect against the higher risk of dementia associated with hearing loss. The study of 4… [+9473 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Michael Mosley", "title": "DR MICHAEL MOSLEY: The anti-ageing foods that can help you hold back time - Daily Mail", "description": "DR MICHAEL MOSLEY: Genetics plays a relatively small part in how well you age - your lifestyle is far more important.", "url": "https://www.dailymail.co.uk/health/article-12001199/DR-MICHAEL-MOSLEY-anti-ageing-foods-help-hold-time.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/22/00/70112117-0-image-a-15_1682120879616.jpg", "publishedAt": "2023-04-21T23:56:43Z", "content": "Most of us would like to live a long and healthy life, though few would go as far as 45-year-old U.S. tech multi-millionaire Bryan Johnson, who reportedly eats more than 70lb of vegetables a month, p… [+5289 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Tiny Polystyrene Particles Detected in the Brain Just Two Hours After Ingestion - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/polystyrene-brain-23079/", "urlToImage": null, "publishedAt": "2023-04-21T20:46:21Z", "content": null}, {"source": {"id": null, "name": "WebMD"}, "author": "Amanda Loudin", "title": "Rethinking the Goal of 10,000 Steps a Day - WebMD", "description": "A new study rejects the idea that you need 10,000 daily steps to lower all-cause and cardiovascular death. Instead, people who walked at least 8,000 steps 1 to 2 days per week were less likely to die within 10 years.", "url": "https://www.webmd.com/fitness-exercise/news/20230421/rethinking-the-goal-of-10000-steps-a-day", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/articles/health_tools/simple_steps_to_boost_bone_health_slideshow/1800ss_getty_rf_mature_woman_walking.jpg", "publishedAt": "2023-04-21T16:13:27Z", "content": "What to Do With the Data\r\nAll this data can be confusing, especially if youre someone who has been aiming for the 10,000-step goal. Theres no need to back off that number if its something you enjoy a… [+1986 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Gabija Saveiskyte", "title": "“My Feet Look More Like Paws Than Human Feet”: 35 People Confess What Body Anomalies They Have - Bored Panda", "description": "Everybody is unique, and every body is special! From the shape of our belly buttons to the birth marks and freckles that adorn our skin, none of us are exactly the same. But some lucky individuals have particularly unique characteristics that deserve to be ce…", "url": "https://www.boredpanda.com/people-confess-unusual-things-about-body/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/04/people-confess-unusual-things-about-body-fb-6442a2379fdfc__700-png.jpg", "publishedAt": "2023-04-21T07:28:29Z", "content": null}]}