{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Turn Back Time: Lifestyle Program Reverses Biological Age - SciTechDaily", "description": "An 8-week methylation-supportive diet and lifestyle program was found to significantly decrease biological age in a case series of women, suggesting that such interventions may affect underlying mechanisms of aging rather than disease-driven aging, and be eff…", "url": "https://scitechdaily.com/?p=266147", "urlToImage": "https://scitechdaily.com/images/Woman-Face-Aging-Concept.jpg", "publishedAt": "2023-04-05T20:14:51Z", "content": "ByImpact Journals LLCApril 5, 2023\r\nThe data suggest that a methylation-supportive diet and lifestyle intervention may favorably influence biological age in both sexes during middle age and older.\r\nA… [+3663 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Do Altered Gut Microbes Affect Risk of ADHD? - Neuroscience News", "description": "The Candida albicans species of gut bacteria are abundant in children with ADHD. Candida albicans increase the permeability of cells lining the intestines. This may create a \"leaky gut\" that allows bacteria to flow into the bloodstream and ultimately results …", "url": "https://neurosciencenews.com/adhd-microbiome-22941/", "urlToImage": "https://neurosciencenews.com/files/2023/04/microbiome-adhd-neurosciences-public.jpg", "publishedAt": "2023-04-05T19:39:51Z", "content": "Summary: The Candida albicans species of gut bacteria are abundant in children with ADHD. Candida albicans increase the permeability of cells lining the intestines. This may create a “leaky gut” that… [+3749 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Brain switch that gets people hooked on booze, alcohol or cigarettes identified by scientists - Daily Mail", "description": "Researchers in New York exposed mice to particular noises before giving them either a reward or a punishment. They found that the rodents' amygdalas lit up in response.", "url": "https://www.dailymail.co.uk/health/article-11943179/Brain-switch-gets-people-hooked-booze-alcohol-cigarettes-identified-scientists.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/20/69521109-0-image-a-5_1680721408781.jpg", "publishedAt": "2023-04-05T19:09:52Z", "content": "Scientists say they have identified a brain switch that gets people hooked on alcohol, drugs and cigarettes.\r\nThe finding opens the door to developing treatments to fight addictions like the opioid e… [+3327 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "Western diet may result in increased aggression for adolescent girls, study suggests - PsyPost", "description": "Research recently published in Brain and Behavior suggests diet could be to blame for increasing rates of aggression seen in adolescent girls. When surveyed for dietary habits and aggression, the researchers discovered that their subjects who ate a Western di…", "url": "https://www.psypost.org/2023/04/western-diet-may-result-in-increased-aggression-for-adolescent-girls-study-suggests-74821", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/eating-a-big-hamburger.jpg", "publishedAt": "2023-04-05T17:12:18Z", "content": "Research recently published in Brain and Behavior suggests diet could be to blame for increasing rates of aggression seen in adolescent girls. When surveyed for dietary habits and aggression, the res… [+4078 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "I thought my colon cancer was a hemorrhoid... here's how to tell the difference - Daily Mail", "description": "Joshua Sanchez, a freelance artist in New York City, first became concerned when blood kept cropping up in his stool. Doctors diagnosed him with stage four colon cancer.", "url": "https://www.dailymail.co.uk/health/article-11942119/I-thought-colon-cancer-hemorrhoid-heres-tell-difference.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/16/69513409-0-image-a-5_1680706954765.jpg", "publishedAt": "2023-04-05T16:34:16Z", "content": "A New Yorker went to the doctor with what he thought were hemorrhoids only to be told he had late-stage cancer.\r\nJoshua Sanchez, now 38, from Harlem, first became concerned when he noticed blood appe… [+8618 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Amygdala Unveiled: How Our Brains Process Threats, Rewards, and Dopamine - SciTechDaily", "description": "Neuroscientist Bo Li at Cold Spring Harbor Laboratory has made significant discoveries about the role of somatostatin-expressing (Sst+) central amygdala (CeA) neurons in learning about threats and rewards, and their relation to dopamine. By training mice to a…", "url": "https://scitechdaily.com/?p=266236", "urlToImage": "https://scitechdaily.com/images/Brain-Signals-Activity-Technology-Concept.jpg", "publishedAt": "2023-04-05T15:00:38Z", "content": "Research at Cold Spring Harbor Laboratory has revealed that specific neurons in the central amygdala are crucial for learning about threats and rewards, and are directly connected to dopamine neurons… [+4430 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "How Tattoos Interact With The Immune System Could Have Impacts For Vaccines - Hackaday", "description": "Tattoos are an interesting technology. They’re a way of marking patterns and designs on the skin that can last for years or decades. All this, despite the fact that our skin sloughs off on a …", "url": "https://hackaday.com/2023/04/05/how-tattoos-interact-with-the-immune-system-could-have-impacts-for-vaccines/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/04/GOGO-TATTOO-MACHINE_featured.png", "publishedAt": "2023-04-05T14:00:00Z", "content": "Tattoos are an interesting technology. They’re a way of marking patterns and designs on the skin that can last for years or decades. All this, despite the fact that our skin sloughs off on a regular … [+5410 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The evolution of SARS-CoV-2 - Nature.com", "description": "In this Review, Markov, Katzourakis and colleagues explore the evolution of SARS-CoV-2 at different scales, the phases of the COVID-19 pandemic, factors that drive the evolution of the virus, theories for the emergence of epidemiologically important variants …", "url": "https://www.nature.com/articles/s41579-023-00878-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41579-023-00878-2/MediaObjects/41579_2023_878_Fig1_HTML.png", "publishedAt": "2023-04-05T09:17:42Z", "content": "<li>Khare, S. et al. GISAIDs role in pandemic response. China CDC Wkly 3, 10491051 (2021).\r\nArticle \r\n PubMed \r\n PubMed Central \r\nGoogle Scholar \r\n</li><li>Pybus, O. G. &amp; Rambaut, A. Evolutionary… [+47341 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Dozens of Brain Proteins May Play a Critical Role in Body Weight Regulation - Neuroscience News", "description": "60 unique proteins expressed in the brain may be key to regulating body weight, a new study reveals.", "url": "https://neurosciencenews.com/weight-genetics-brain-22932/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-protein-body-weight-neurosicence-public.jpg", "publishedAt": "2023-04-04T17:52:33Z", "content": "Summary: 60 unique proteins expressed in the brain may be key to regulating body weight, a new study reveals.\r\nSource: Université Lava\r\nGenetic factors could contribute to up to 50-75% of the varianc… [+5718 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover Connection Between Traumatic Brain Injury and Long COVID - SciTechDaily", "description": "The Linseman Laboratory is studying the long-term brain health effects of COVID-19 in individuals with and without traumatic brain injury (TBI). Preliminary data suggest that those with a history of both COVID-19 and TBI experience more severe long COVID symp…", "url": "https://scitechdaily.com/researchers-discover-connection-between-traumatic-brain-injury-and-long-covid/", "urlToImage": "https://scitechdaily.com/images/Brain-Glitch-Stress-Disorder-Concept.jpg", "publishedAt": "2023-04-04T17:30:10Z", "content": "ByUniversity of DenverApril 4, 2023\r\nThe Linseman Laboratorys study investigates long-term brain health effects of COVID-19 in individuals with and without traumatic brain injury (TBI). Preliminary f… [+7843 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jim Norton Technology", "title": "ChatGPT makes up fake data about cancer, doctors warn - Daily Mail", "description": "The AI chatbot answered one in ten questions about breast cancer screening wrongly and correct answers were not as 'comprehensive' as those found through a simple Google search.", "url": "https://www.dailymail.co.uk/sciencetech/article-11938205/ChatGPT-makes-fake-data-cancer-doctors-warn.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/04/16/69349783-0-Doctors_are_warning_against_using_ChatGPT_for_medical_advice-a-11_1680622042088.jpg", "publishedAt": "2023-04-04T15:27:33Z", "content": "Doctors are warning against using ChatGPT for medical advice after a study found it made up health data when asked for information about cancer.\r\nThe AI chatbot answered one in ten questions about br… [+3553 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Minnesota man dies from RABIES after waking up to a rabid BAT biting his hand - Daily Mail", "description": "Man, 84, batted away the animal and quickly washed his hands with soap and water. He was started on treatment but five months later started experiencing an infection later confirmed as rabies.", "url": "https://www.dailymail.co.uk/health/article-11937619/Minnesota-man-dies-RABIES-waking-rabid-BAT-biting-hand.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/04/16/69465973-0-image-a-18_1680621598380.jpg", "publishedAt": "2023-04-04T14:45:22Z", "content": "A man in Minnesota died from rabies last year after waking up to find a rabid bat biting his hand, US health officials have revealed.\r\nThe 84-year-old, who has not been named, batted away the animal … [+4712 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "ExtremeTech", "title": "New Inhalable Nanoparticles Perform Gene Editing Inside the Lungs - ExtremeTech", "description": null, "url": "https://www.extremetech.com/science/new-inhalable-nanoparticles-perform-gene-editing-inside-the-lungs", "urlToImage": null, "publishedAt": "2023-04-04T14:00:00Z", "content": null}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "'Major moment in MS research' as new Octopus trial starts - BBC", "description": "Ailsa explains what it is like facing progressive MS and hopes the new Octopus trial can help her.", "url": "https://www.bbc.com/news/health-65135637", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13A27/production/_129232408_7ac8a518-2c03-4e24-834e-86d03e61797b.jpg", "publishedAt": "2023-04-04T12:13:08Z", "content": "\"I was playing a game of ultimate frisbee and got fuzzy vision in one eye - a bit like looking through a steamed-up windscreen.\"\r\nAilsa Guidi was 22 at the time, studying at University of Manchester.… [+8481 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Craig Senior", "title": "Are your mood swings regular... or a sign you have bipolar? Three signs to tell - Daily Mail", "description": "How do you know if your day spent riding an emotional rollercoaster of manic highs and depressive lows is normal or a sign of bipolar?", "url": "https://www.dailymail.co.uk/health/article-11934161/Are-mood-swings-regular-sign-bipolar-Three-signs-tell.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/04/12/69427743-0-image-a-45_1680607387452.jpg", "publishedAt": "2023-04-04T11:26:42Z", "content": "Mood swings are something we all suffer.\r\nYet, how do you know if your day spent riding an emotional rollercoaster of manic highs and depressive lows is normal or a sign of bipolar? \r\nIn hope of answ… [+4659 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Ieva Pečiulytė", "title": "Someone Asked People “What Is A True Fact So Baffling, It Should Be False?” And 65 Delivered Illuminating Responses - Bored Panda", "description": "Truth is stranger than fiction, they say. This recent Ask Reddit thread is a great example of that.", "url": "https://www.boredpanda.com/interesting-real-facts-that-should-be-false/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/04/interesting-real-facts-that-should-be-false-fb.png", "publishedAt": "2023-04-04T07:14:11Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Haslett", "title": "Dietitian: The six warning signs you're running on stress hormones - and how you can fix it today - Daily Mail", "description": "Brisbane dietitian Leanne Ward has shared the six warning signs you're running on stress hormones, and why it's leading to health problems, weight gain and lack of sleep.", "url": "https://www.dailymail.co.uk/femail/health/article-11935469/Dietitian-six-warning-signs-youre-running-stress-hormones-fix-today.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/04/03/69445181-0-image-a-9_1680576256727.jpg", "publishedAt": "2023-04-04T03:23:02Z", "content": "A dietitian has shared the six warning signs you're running on stress hormones, and why it's leading to health problems, weight gain and lack of sleep.\r\nLeanne Ward, from Brisbane, said if you're try… [+4154 chars]"}]}