{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Anxious and avoidant attachment are elevated among individuals with eating disorders - PsyPost", "description": "Struggling with an eating disorder can be related to many aspects of an individual’s life, but can it be associated with attachment style? A study published in the International Journal of Eating Disorders explores the existing literature suggesting that peop…", "url": "https://www.psypost.org/2023/05/anxious-and-avoidant-attachment-are-elevated-among-individuals-with-eating-disorders-163253", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/sad-depressed-woman.jpg", "publishedAt": "2023-05-18T13:11:54Z", "content": "Struggling with an eating disorder can be related to many aspects of an individuals life, but can it be associated with attachment style? A study published in the International Journal of Eating Diso… [+4936 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "Do YOU have 'tokophobia'? Study suggests 62% of women suffer from little-known condition - Daily Mail", "description": "A study published last month found that 62 percent of American women have tokophobia, or the fear of childbirth. This fear was most pronounced in black and disadvantaged women.", "url": "https://www.dailymail.co.uk/health/article-12094971/Do-tokophobia-Study-suggests-62-women-suffer-little-known-condition.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/17/16/71098043-0-image-a-5_1684337873869.jpg", "publishedAt": "2023-05-18T13:05:44Z", "content": "The condition 'tokophobia' probably means nothing to you, but doctors warn that there's a high chance you have it.\r\nA study suggests that six in 10 American women have the phobia, which can result in… [+4391 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "A surprisingly simple technique may help reduce cravings for high calorie foods - PsyPost", "description": "A new study published in Appetite explores the potential for visualization techniques to help reduce poor food choices among those who wish to eat less. The findings indicate that those who imagine high-calorie foods and then imagine getting rid of the food b…", "url": "https://www.psypost.org/2023/05/a-surprisingly-simple-technique-may-help-reduce-cravings-for-high-calorie-foods-163251", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/pushing-away-denying-healthy-food.jpg", "publishedAt": "2023-05-18T11:11:45Z", "content": "A new study published in Appetiteexplores the potential for visualization techniques to help reduce poor food choices among those who wish to eat less. The findings indicate that those who imagine hi… [+4529 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ageing body scans to aid understanding of why diseases occur - BBC", "description": "The results could open up new ways to spot, treat and prevent some diseases, including cancer, experts say.", "url": "https://www.bbc.com/news/health-65615782", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/42C7/production/_129759071_fergus_scan2.jpg", "publishedAt": "2023-05-17T23:53:00Z", "content": "The world's biggest human imaging project is set to rescan the brains and bodies of 60,000 UK volunteers to find new ways of treating and preventing disease. \r\nBy looking at how bodies age, the study… [+3906 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Olivia Day", "title": "Australian woman with eczema reveals what you should never say to her - Daily Mail", "description": "University student Leilah Johnson, 20, says her struggle with eczema, a type of dermatitis, has impacted her self confidence and cost her thousands of dollars on expensive treatments.", "url": "https://www.dailymail.co.uk/news/article-12087537/Australian-woman-eczema-reveals-never-say-her.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/16/05/71031329-0-image-a-46_1684210515182.jpg", "publishedAt": "2023-05-17T23:32:58Z", "content": "A young woman has shared how a debilitating skin condition rocked her self-confidence and saw her unable to go to the gym, work or university.\r\nLeilah Johnson, 20, says her struggle with eczema, a ty… [+6151 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Regular Cardio Exercise May Shield Against Flu and Pneumonia Deaths - Neuroscience News", "description": "A new study suggests that regular aerobic exercise may significantly reduce the risk of death from flu or pneumonia.", "url": "https://neurosciencenews.com/cardio-exercise-flu-23264/", "urlToImage": "https://neurosciencenews.com/files/2023/05/exercise-flu-neurosicences.jpg", "publishedAt": "2023-05-17T18:21:26Z", "content": "Summary: A new study suggests that regular aerobic exercise, even less than the recommended 150 minutes per week, may significantly reduce the risk of death from flu or pneumonia.\r\nHowever, the benef… [+8392 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Sexual dimorphism in the response to chronic circadian misalignment on a high-fat diet - Science", "description": null, "url": "https://www.science.org/doi/10.1126/scitranslmed.abo2022", "urlToImage": null, "publishedAt": "2023-05-17T18:11:15Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clock Out of Losing Sleep: A Simple and Effective Solution To Manage Insomnia - SciTechDaily", "description": "Indiana University research led by Spencer Dawson finds that clock-watching while trying to sleep worsens insomnia and boosts sleep aid usage. The study suggests that avoiding checking the time could be a simple and effective solution to manage insomnia. Watc…", "url": "https://scitechdaily.com/clock-out-of-losing-sleep-a-simple-and-effective-solution-to-manage-insomnia/", "urlToImage": "https://scitechdaily.com/images/Insomnia-Watching-Clock-Nightmare.jpg", "publishedAt": "2023-05-17T08:27:49Z", "content": "ByIndiana UniversityMay 17, 2023\r\nResearch suggests that the behavior of clock-watching while trying to fall asleep intensifies insomnia symptoms and increases the use of sleep aids. The study, which… [+4500 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "Microbubbles And Ultrasound: Getting Drugs Through The Blood-Brain Barrier - Hackaday", "description": "The brain is a rather important organ, and as such, nature has gone to great lengths to protect it. The skull provides physical protection against knocks and bumps, but there’s a lesser-known…", "url": "https://hackaday.com/2023/05/16/microbubbles-and-ultrasound-getting-drugs-through-the-blood-brain-barrier/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/sonabend1940__FitMaxWzk3MCw2NTBd_featured.png", "publishedAt": "2023-05-16T17:00:00Z", "content": "The brain is a rather important organ, and as such, nature has gone to great lengths to protect it. The skull provides physical protection against knocks and bumps, but there’s a lesser-known defense… [+6526 chars]"}]}