{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "The Cold Truth: Frequent Common Colds Linked to Alzheimer’s Risk - Neuroscience News", "description": "Suffering from frequent colds and flu may impact brain aging, accelerate cognitive decline, and could increase the risk of developing Alzheimer's disease. In mice, intermittent experiences of moderate inflammation, such as that caused by the flu or common col…", "url": "https://neurosciencenews.com/colds-dementia-22949/", "urlToImage": "https://neurosciencenews.com/files/2023/04/cold-dementia-neurosicnes-public.jpg", "publishedAt": "2023-04-06T15:39:35Z", "content": "Summary: Suffering from frequent colds and flu may impact brain aging, accelerate cognitive decline, and could increase the risk of developing Alzheimer’s disease. In mice, intermittent experiences o… [+5612 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews, Xantha Leatham", "title": "Personalized 'his and hers' anti-obesity pills could be on the horizon, study suggests - Daily Mail", "description": "Researchers in California quizzed 183 people, nearly half of whom were obese, and carried out brain scans. Results showed changes in the brains of obese people.", "url": "https://www.dailymail.co.uk/health/article-11945875/Personalized-anti-obesity-pills-horizon-study-suggests.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/06/16/69555739-0-image-a-4_1680796635322.jpg", "publishedAt": "2023-04-06T14:53:23Z", "content": "Scientists have found sex-specific brain signals that fuel obesity and it could open the door to 'his and hers' weight-loss pills.\r\nThey found obese women are driven more by comfort eating and cravin… [+3879 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "Aggressive responses to being victimized by peers vary based on testosterone and cortisol levels - PsyPost", "description": "A study in Spain found that adolescents with high levels of the hormones testosterone and cortisol as well as adolescents with low levels of these hormones react more aggressively when they are victimized or provoked by peers. In girls, the ratio of these two…", "url": "https://www.psypost.org/2023/04/aggressive-responses-to-being-victimized-by-peers-vary-based-on-testosterone-and-cortisol-levels-74845", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/children-bullying-a-peer-in-school.jpg", "publishedAt": "2023-04-06T14:21:36Z", "content": "A study in Spain found that adolescents with high levels of the hormones testosterone and cortisol as well as adolescents with low levels of these hormones react more aggressively when they are victi… [+6751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Want To Burn Belly Fat? Try This Nutritionist-Approved Methi-Saunf Drink - NDTV Food", "description": "Weight loss tips: Dietitian Manpreet Kalra posted a recipe for a special concoction for belly fat, made using everyday spices.", "url": "https://food.ndtv.com/health/want-to-burn-belly-fat-try-this-nutritionist-approved-methi-saunf-drink-3925610", "urlToImage": "https://c.ndtvimg.com/2023-04/vpv74mgg_fennel-drink_625x300_06_April_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-04-06T09:32:17Z", "content": "If you're seeking to lose weight, chances are you're also wanting to reduce belly fat. Tackling belly fat is also important for your overall health, as failing to do so is linked with a great risk of… [+4476 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Belinda Cleary", "title": "Derm Doctor explains why you should think twice before kissing a man with facial hair: 'It's gross' - Daily Mail", "description": "A dermatologist has revealed exactly why you should never kiss a man with a beard - and the horrific result if you don't.", "url": "https://www.dailymail.co.uk/femail/article-11940757/Derm-Doctor-explains-think-twice-kissing-man-facial-hair-gross.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/06/03/69534545-0-image-a-22_1680748609139.jpg", "publishedAt": "2023-04-06T04:56:14Z", "content": "A dermatologist has revealed the importance of 'thinking twice' before kissing men with facial hair - especially if you don't know their grooming routine.\r\nMuneeb Shah, who is known as the Derm Docto… [+3724 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How to Prevent a High-Fat Diet From Throwing Metabolism Out of Whack - Neuroscience News", "description": "Eliminating SAPS3 from the genome of mice allowed the AMPK protein complex to activate and maintain normal energy balance, even with high-fat meals. This discovery could pave the way for developing a new approach to metabolic disorders such as obesity, diabet…", "url": "https://neurosciencenews.com/high-fat-diet-metabolism-22945/", "urlToImage": "https://neurosciencenews.com/files/2023/04/high-fat-diet-metabolism-neurosicnes-public.jpg", "publishedAt": "2023-04-05T21:22:14Z", "content": "Summary: Eliminating SAPS3 from the genome of mice allowed the AMPK protein complex to activate and maintain a normal energy balance, even with high-fat meals. This discovery could pave the way for d… [+4366 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Do Altered Gut Microbes Affect Risk of ADHD? - Neuroscience News", "description": "The Candida albicans species of gut bacteria are abundant in children with ADHD. Candida albicans increase the permeability of cells lining the intestines. This may create a \"leaky gut\" that allows bacteria to flow into the bloodstream and ultimately results …", "url": "https://neurosciencenews.com/adhd-microbiome-22941/", "urlToImage": "https://neurosciencenews.com/files/2023/04/microbiome-adhd-neurosciences-public.jpg", "publishedAt": "2023-04-05T19:39:51Z", "content": "Summary: The Candida albicans species of gut bacteria are abundant in children with ADHD. Candida albicans increase the permeability of cells lining the intestines. This may create a “leaky gut” that… [+3749 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "I thought my colon cancer was a hemorrhoid... here's how to tell the difference - Daily Mail", "description": "Joshua Sanchez, a freelance artist in New York City, first became concerned when blood kept cropping up in his stool. Doctors diagnosed him with stage four colon cancer.", "url": "https://www.dailymail.co.uk/health/article-11942119/I-thought-colon-cancer-hemorrhoid-heres-tell-difference.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/16/69513409-0-image-a-5_1680706954765.jpg", "publishedAt": "2023-04-05T16:34:16Z", "content": "A New Yorker went to the doctor with what he thought were hemorrhoids only to be told he had late-stage cancer.\r\nJoshua Sanchez, now 38, from Harlem, first became concerned when he noticed blood appe… [+8618 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Hannah Mcdonald", "title": "Finger-prick test can diagnose 'most common STI you've never heard of' in just 5 minutes - Daily Mail", "description": "The little-known infection, caused by a parasite, strikes millions every year and is more rife than chlamydia and gonorrhoea in some parts of the world.", "url": "https://www.dailymail.co.uk/health/article-11941003/Finger-prick-test-diagnose-common-STI-youve-never-heard-just-5-minutes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/11/69504343-0-image-a-31_1680691725703.jpg", "publishedAt": "2023-04-05T10:19:06Z", "content": "A new finger-prick test can diagnose one of the world's most common STIs in just five minutes.\r\nTrichomoniasis, or trich, often goes undetected because 70 per cent of cases are asymptomatic. \r\nThe li… [+4572 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The evolution of SARS-CoV-2 - Nature.com", "description": "In this Review, Markov, Katzourakis and colleagues explore the evolution of SARS-CoV-2 at different scales, the phases of the COVID-19 pandemic, factors that drive the evolution of the virus, theories for the emergence of epidemiologically important variants …", "url": "https://www.nature.com/articles/s41579-023-00878-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41579-023-00878-2/MediaObjects/41579_2023_878_Fig1_HTML.png", "publishedAt": "2023-04-05T09:17:42Z", "content": "<li>Khare, S. et al. GISAIDs role in pandemic response. China CDC Wkly 3, 10491051 (2021).\r\nArticle \r\n PubMed \r\n PubMed Central \r\nGoogle Scholar \r\n</li><li>Pybus, O. G. &amp; Rambaut, A. Evolutionary… [+47341 chars]"}, {"source": {"id": null, "name": "Unherd.com"}, "author": "Sunetra Gupta", "title": "Was I wrong about the Covid infection fatality rate? - UnHerd", "description": "For suggesting that the average IFR of Covid-19 might be between 0.01% and 0.05% during an early 2020 interview with UnHerd, I was mocked by large sections of the media and accused of minimising the harms of Covid-19 in service of a Right-wing libertarian age…", "url": "http://unherd.com/thepost/how-wrong-was-i-on-covid-ifr/", "urlToImage": "https://unherd.com/wp-content/uploads/2023/04/covid.jpg", "publishedAt": "2023-04-04T19:33:51Z", "content": "I was mocked at the time, but new data supports my thinking\r\nNew data puts the average mortality risk over the last three years for those above 20 at 0.089%.\r\nFor suggesting that the average IFR of C… [+3588 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover Connection Between Traumatic Brain Injury and Long COVID - SciTechDaily", "description": "The Linseman Laboratory is studying the long-term brain health effects of COVID-19 in individuals with and without traumatic brain injury (TBI). Preliminary data suggest that those with a history of both COVID-19 and TBI experience more severe long COVID symp…", "url": "https://scitechdaily.com/researchers-discover-connection-between-traumatic-brain-injury-and-long-covid/", "urlToImage": "https://scitechdaily.com/images/Brain-Glitch-Stress-Disorder-Concept.jpg", "publishedAt": "2023-04-04T17:30:10Z", "content": "ByUniversity of DenverApril 4, 2023\r\nThe Linseman Laboratorys study investigates long-term brain health effects of COVID-19 in individuals with and without traumatic brain injury (TBI). Preliminary f… [+7843 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Ieva Pečiulytė", "title": "Someone Asked People “What Is A True Fact So Baffling, It Should Be False?” And 65 Delivered Illuminating Responses - Bored Panda", "description": "Truth is stranger than fiction, they say. This recent Ask Reddit thread is a great example of that.", "url": "https://www.boredpanda.com/interesting-real-facts-that-should-be-false/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/04/interesting-real-facts-that-should-be-false-fb.png", "publishedAt": "2023-04-04T07:14:11Z", "content": null}]}