{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Here are some signs that may indicate heart attack - Geo News", "description": "Overall chances of survival from a heart attack are seven in 10 but chances increase for those who reach hospital early", "url": "https://www.geo.tv/latest/481154-here-are-some-signs-that-may-indicate-heart-attack", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-09/481154_024804_updates.jpg", "publishedAt": "2023-04-09T10:23:00Z", "content": "Cardiovascular diseases (CVD) are the leading cause of death globally. However, the overall chances of survival from a heart attack are seven in 10 but the chances increase for those who reach the ho… [+1927 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Magnesium Magic: New Drug Delivers Weight Loss Even on Sugary, Fatty Diet - SciTechDaily", "description": "Compound limits magnesium transport in cellular power plants called mitochondria. A small-molecule drug, CPACC, developed by researchers, has been shown to prevent weight gain and liver issues in mice by limiting magnesium transport in cellular power plants, …", "url": "https://scitechdaily.com/magnesium-magic-new-drug-delivers-weight-loss-even-on-sugary-fatty-diet/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss.jpg", "publishedAt": "2023-04-09T09:51:57Z", "content": "ByUniversity of Texas Health Science Center at San AntonioApril 9, 2023\r\nResearchers at UT Health San Antonio, along with collaborators from the University of Pennsylvania and Cornell University, hav… [+5755 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Pandemic May Have Triggered Second \"Midlife Crisis\" for Over-50s - Neuroscience News", "description": "Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second \"midlife crisis\" in those aged 50 and older. Researchers say women struggled more than men with psychological distress during the pandemic, and this may exace…", "url": "https://neurosciencenews.com/pandemic-midlife-crisis-22971/", "urlToImage": "https://neurosciencenews.com/files/2023/04/midlife-crisis-pandemic-neurosicencce-public.jpg", "publishedAt": "2023-04-08T23:27:29Z", "content": "Summary: Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second “midlife crisis” in those aged 50 and older. Researchers say women struggled more than me… [+6658 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Do We Know if Our Brain Is Capable of Repairing Itself? - Neuroscience News", "description": "A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restoring brain function. Recent single-cell transcriptomic studies in the ad…", "url": "https://neurosciencenews.com/neuroregeneration-neuroscience-22969/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-repair-neurosinces-public.jpg", "publishedAt": "2023-04-08T21:06:33Z", "content": "Summary: A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restorin… [+8686 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain Slows Down When We Focus Our Gaze - Neuroscience News", "description": "A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight into how the structure of neural networks determines the speed at whic…", "url": "https://neurosciencenews.com/gaze-focus-brain-slows-22966/", "urlToImage": "https://neurosciencenews.com/files/2023/04/gaze-focus-brain-neurosciences-public.jpg", "publishedAt": "2023-04-08T19:44:22Z", "content": "Summary: A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight i… [+6342 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Your own voice \"is not just a sound\": Bone-conduction tech offers new insights into voice perception - PsyPost", "description": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which sound waves travel through bones in your skull and inner ea…", "url": "https://www.psypost.org/2023/04/your-own-voice-is-not-just-a-sound-bone-conduction-tech-offers-new-insights-into-voice-perception-74872", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/soundwave-ear-hearing-perception.jpg", "publishedAt": "2023-04-08T17:06:23Z", "content": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which… [+5777 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Abi Turner", "title": "Expert lifts the lid on the BAD HABITS for our Brain Health we do every day - Daily Mail", "description": "Dr Miriam Ferrer, from Cambridge, told FEMAIL the four everyday habits which could be damaging your brain health, and making your memory worse.", "url": "https://www.dailymail.co.uk/femail/article-11780703/Expert-lifts-lid-BAD-HABITS-Brain-Health-day.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/22/18/67970173-0-image-a-16_1677090470741.jpg", "publishedAt": "2023-04-08T11:26:35Z", "content": "Many of us grow worried about our memories after a particularly forgetful moment. \r\nAnd now an expert has revealed the four everyday habits which could be damaging your brain health, and making your … [+8948 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Muscle Pain or Fatigue From Statins? What Cholesterol Patients Need To Know - SciTechDaily", "description": "Statins do not increase muscle injury after prolonged walking, important for heart health in statin users. A study published in the Journal of the American College of Cardiology found that statin therapy does not worsen muscle injury, pain, or fatigue in indi…", "url": "https://scitechdaily.com/muscle-pain-or-fatigue-from-statins-what-cholesterol-patients-need-to-know/", "urlToImage": "https://scitechdaily.com/images/Senior-Shoulder-Muscle-Pain.jpg", "publishedAt": "2023-04-08T10:40:32Z", "content": "A recent study found that statin therapy does not exacerbate muscle injury, pain, or fatigue during moderate-intensity exercise, allowing statin users to safely maintain an active lifestyle and benef… [+5158 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cracking the Autism Code: Brain Study Reveals Four Distinct Subtypes - SciTechDaily", "description": "Researchers at Weill Cornell Medicine identified four distinct subtypes of autism spectrum disorder through machine learning analysis of neuroimaging data, potentially paving the way for more personalized treatments. People with autism spectrum disorder can b…", "url": "https://scitechdaily.com/cracking-the-autism-code-brain-study-reveals-four-distinct-subtypes/", "urlToImage": "https://scitechdaily.com/images/Three-Brain-Behavior-Dimensions.jpg", "publishedAt": "2023-04-08T07:48:32Z", "content": "ByWeill Cornell MedicineApril 8, 2023\r\nMachine learning of brain-behavior dimensions reveals four subtypes of autism spectrum disorder linked to distinct molecular pathways. Here, the 3D prism cube r… [+9495 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Busts Myths About 5 Common Foods That Seem Healthy, But Aren't - NDTV Food", "description": "Nutritionist Lovneet Batra explains how some health foods can do harm to our body even when they are usually considered healthy.", "url": "https://food.ndtv.com/health/nutritionist-shares-5-foods-that-aren-t-as-healthy-as-you-may-think-3930532", "urlToImage": "https://c.ndtvimg.com/2023-01/it7humj8_whey-protein_625x300_16_January_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-04-08T06:32:50Z", "content": "Whether you are on a weight loss diet or aiming to gain muscles, its it important to eat healthy. Most of us vow to ditch delicious cakes and chocolates and switch to protein bars, shakes and salads … [+2668 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Uncovers Potential Explanation for COVID Vaccine Blood Clot Connection - SciTechDaily", "description": "Scientists identify key differences in immune responses to the AstraZeneca and Pfizer vaccines. A recent study conducted by a team from SAHMRI and Flinders University in Australia has revealed significant variations in the way the AstraZeneca and Pfizer COVID…", "url": "https://scitechdaily.com/new-research-uncovers-potential-explanation-for-covid-vaccine-blood-clot-connection/", "urlToImage": "https://scitechdaily.com/images/New-COVID-Vaccine-Illustration.jpg", "publishedAt": "2023-04-08T02:15:43Z", "content": "ByFlinders UniversityApril 7, 2023\r\nA recent Australian study discovered fundamental differences in immune responses between the AstraZeneca and Pfizer COVID-19 vaccines. The AstraZeneca vaccine elic… [+8388 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Linda Geddes", "title": "'A silver lining': how Covid ushered in a vaccines golden era - The Guardian", "description": "Pandemic accelerated advances in vaccine technology, opening up possibilities for combating array of diseases", "url": "https://www.theguardian.com/science/2023/apr/07/covid-vaccines-golden-era-pandemic-techology-diseases", "urlToImage": "https://i.guim.co.uk/img/media/3a9996cec8bbf52f3dd2b9c7dcced10334d10df5/0_375_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d6b52fbf29ea9c71a7dab999d3cced0", "publishedAt": "2023-04-07T18:00:00Z", "content": "The Covid-19 pandemic has been awful for many reasons. But if there is a bright side to the past three years, it is vaccines. Development and testing has advanced at an unprecedented pace since the a… [+9483 chars]"}, {"source": {"id": null, "name": "Healthnews.com"}, "author": "Healthnews.com", "title": "Snoring Could Impact Your Brain | HealthNews - Healthnews.com", "description": null, "url": "https://healthnews.com/news/snoring-declines-brain-functioning-in-men-study-suggests/", "urlToImage": null, "publishedAt": "2023-04-07T17:14:08Z", "content": null}]}