{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "Countries with worst diabetes rates in world REVEALED (and America's position will shock you) - Daily Mail", "description": "Our World in Data ranked Pakistan as the country with the highest rate of diabetes. However, despite scares about poor diets and sedentary lifestyles, the US and UK both ranked much lower.", "url": "https://www.dailymail.co.uk/health/article-12136373/Countries-worst-diabetes-rates-world-REVEALED-Americas-position-shock-you.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/30/13/71537893-0-image-a-9_1685448021478.jpg", "publishedAt": "2023-05-30T12:02:34Z", "content": "Americans might get a hard time for their high-sugar diets, but the US isn't even in the top 50 worst countries for diabetes, a new survey has revealed.\r\nAnd despite Britons having a notoriously swee… [+8547 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Hannah Mcdonald", "title": "Miracle recovery of worker whose fingers were crushed by a noodle-cutting machine - Daily Mail", "description": "WARNING GRAPHIC CONTENT: The unnamed man, who was in his 40s and from Indonesia, pulled his hand out of the machine, revealing crush injuries to his middle, ring and little fingers.", "url": "https://www.dailymail.co.uk/health/article-12084803/Miracle-recovery-worker-fingers-crushed-noodle-cutting-machine.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/15/14/71005447-0-image-a-14_1684158481738.jpg", "publishedAt": "2023-05-30T10:14:21Z", "content": "An Indonesian man's fingers were crushed after getting his hand stuck in a noodle machine when he tripped at work.\r\nThe unnamed man, in his 40s, managed to pull his left hand out, but it was too late… [+2847 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "David Cox", "title": "Why you should exercise in the morning to lose weight… and in the afternoon if you have diabetes - Daily Mail", "description": "Scientists are increasingly finding that the circadian rhythm - i.e. our internal body clock - within each of our tissues plays an important role in how efficiently they perform at different times of the day.", "url": "https://www.dailymail.co.uk/health/article-12136855/Why-exercise-morning-lose-weight-afternoon-diabetes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/29/18/71539333-0-image-a-15_1685382141112.jpg", "publishedAt": "2023-05-29T20:58:21Z", "content": "Every year, millions of us commit to a new exercise regimen, seeking a quick way to trim our waistlines. \r\nBut what if the secret to burning fat effectively is not merely exercising, but when we choo… [+9422 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Megan Rossi", "title": "DR MEGAN ROSSI: Steam, boil, bake, fry (or even barbecue): Which is the healthiest? - Daily Mail", "description": "DR MEGAN ROSSI: If you want to get the maximum goodness from your diet, you need to vary your cooking style - don't stick to the same old routine.", "url": "https://www.dailymail.co.uk/health/article-12136825/DR-MEGAN-ROSSI-Steam-boil-bake-fry-barbecue-healthiest.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/29/18/71539321-0-image-a-10_1685380964123.jpg", "publishedAt": "2023-05-29T19:24:30Z", "content": "If you're one of those people who always steams their vegetables in the belief that it's the healthiest way to cook, I'm afraid I'm going to have to disappoint you.\r\nFor steaming is not always the be… [+9447 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "Diversity of the gut microbiota is associated with the severity of depression - PsyPost", "description": "A new study indicates that microbial diversity in the gut is closely related to the severity of the major depressive disorder. Compared to healthy individuals, the abundance of Bacteroides species was significantly increased in participants with moderate and …", "url": "https://www.psypost.org/2023/05/diversity-of-the-gut-microbiota-is-associated-with-the-severity-of-depression-163866", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/bacteria-in-gut.jpg", "publishedAt": "2023-05-29T17:15:14Z", "content": "A new study indicates that microbial diversity in the gut is closely related to the severity of the major depressive disorder. Compared to healthy individuals, the abundance of Bacteroides species wa… [+5108 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Last two monkeypox patients in Pakistan recover from virus - The News International", "description": "ISLAMABAD: The last two patients of monkeypox in Pakistan have recovered from the virus putting the current number of active cases to zero. Till now there were two positive cases of monkeypox...", "url": "https://www.thenews.com.pk/latest/1075058-last-two-monkeypox-patients-in-pakistan-recover-from-virus", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-05-29/1075058_091837_updates.jpg", "publishedAt": "2023-05-29T16:22:00Z", "content": "ISLAMABAD: The last two patients of monkeypox in Pakistan have recovered from the virus putting the current number of active cases to zero. \r\nTill now there were two positive cases of monkeypox in Is… [+1805 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gene Therapy Breakthrough in Treatment of Age-Related Hearing Loss - SciTechDaily", "description": "Researchers at Mass Eye and Ear, part of Mass General Brigham, have successfully used adeno-associated virus vectors in gene therapies to treat genetic hearing loss in aged mouse models. This breakthrough suggests the potential for similar therapies to treat …", "url": "https://scitechdaily.com/gene-therapy-breakthrough-in-treatment-of-age-related-hearing-loss/", "urlToImage": "https://scitechdaily.com/images/Ear-Hearing-Concept.jpg", "publishedAt": "2023-05-29T09:45:43Z", "content": "ByMassachusetts Eye and Ear InfirmaryMay 29, 2023\r\nA recent breakthrough by a research team from Mass Eye and Ear, part of Mass General Brigham, demonstrated successful application of adeno-associate… [+3760 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": ", USA TODAY", "title": "Is butter bad for you? Here's the healthiest butter to keep in your fridge. - USA TODAY", "description": "Butter has been a staple in our diet for hundreds of years, but recent times have seen alternatives rise. Here's how they measure up in our health.", "url": "https://www.usatoday.com/story/life/food-dining/2023/05/28/what-is-the-healthiest-butter/70233684007/", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2021/03/02/USATODAY/usatsports/247WallSt.com-247WS-844255-imageforentry3-bsz.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2023-05-28T11:01:10Z", "content": "Is butter bad for us?\r\nButter alternatives like margarine have been around for ages, but many gained popularity in the 80s and 90s during a fat-free frenzy. The message to consumers was clear: fat wa… [+6462 chars]"}]}