{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "That’s Nuts! Eating Walnuts Regularly Improves Cognitive Development and Psychological Maturation in Teens - Neuroscience News", "description": "Teens who added walnuts to their diet for 100 days showed improvements in attention function, and for those with ADHD, frequent walnut consumption was associated with improvements in behavior. Researchers also noted an increase in fluid intelligence in those …", "url": "https://neurosciencenews.com/thats-nuts-eating-walnuts-regularly-improves-cognitive-development-and-psychological-maturation-in-teens/", "urlToImage": "https://neurosciencenews.com/files/2023/04/walnut-cognition-neurosicences-public.jpg", "publishedAt": "2023-04-20T23:59:30Z", "content": "Summary: Teens who added walnuts to their diet for 100 days showed improvements in attention function, and for those with ADHD, frequent walnut consumption was associated with improvements in behavio… [+8535 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Multiple Sclerosis Drug May Delay Earliest Symptoms - Neuroscience News", "description": "Early intervention with the multiple sclerosis treatment Teriflunomide delays the preliminary symptoms of the autoimmune disease, a new study reports. Those who took teriflunomide had a 72% lower risk of experiencing the initial symptoms of MS than those who …", "url": "https://neurosciencenews.com/symptom-delay-ms-23071/", "urlToImage": "https://neurosciencenews.com/files/2023/04/ms-drug-progression-neurosicnes-public.jpg", "publishedAt": "2023-04-20T22:41:47Z", "content": "Summary: Early intervention with the multiple sclerosis treatment Teriflunomide delays the preliminary symptoms of the autoimmune disease, a new study reports. Those who took teriflunomide had a 72% … [+3012 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Gene Activity Analysis Provides Better Classification for Brain Diseases - Neuroscience News", "description": "Analyzing the gene activity map or transcriptome of different brain diseases can help identify underlying mechanisms and comorbidity. The method could also uncover new relationships among diseases and improve treatment options.", "url": "https://neurosciencenews.com/neurology-gene-analysis-23067/", "urlToImage": "https://neurosciencenews.com/files/2023/04/gene-activity-brain-disorders-neurosicnes.jpg", "publishedAt": "2023-04-20T21:09:08Z", "content": "Summary: Analyzing the gene activity map or transcriptome of different brain diseases can help identify underlying mechanisms and comorbidity. The method could also uncover new relationships among di… [+4560 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Drain: Common Infections Tied to Cognitive Decline - Neuroscience News", "description": "Common infections, including the chickenpox virus and herpes simplex virus type 1, can worsen cognitive performance and increase the risk of developing Alzheimer's disease in middle-aged and older adults, a new study reports. The findings add to the growing b…", "url": "https://neurosciencenews.com/aging-infection-cognition-23066/", "urlToImage": "https://neurosciencenews.com/files/2023/04/infection-cognitive-decline-neurosciences-public.jpg", "publishedAt": "2023-04-20T20:33:16Z", "content": "Summary: Common infections, including the chickenpox virus and herpes simplex virus type 1, can worsen cognitive performance and increase the risk of developing Alzheimer’s disease in middle-aged and… [+7973 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Ear EEG Tests for Alzheimer’s and Parkinson’s at Home - Neuroscience News", "description": "Researchers are developing and testing a novel EEG system that is worn in the ear, similar to an earbud, that maps brain activities during sleep and could help diagnose neurodegenerative diseases from the data it collects.", "url": "https://neurosciencenews.com/ear-eeg-neurotech-23065/", "urlToImage": "https://neurosciencenews.com/files/2023/04/ear-eeg-alzheimers-neurosciences.jpg", "publishedAt": "2023-04-20T20:01:05Z", "content": "Summary: Researchers are developing and testing a novel EEG system that is worn in the ear, similar to an earbud, that maps brain activities during sleep and could help diagnose neurodegenerative dis… [+5815 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "\"Sweet\" Research Sheds Light on Glucose Metabolism in Neurons - Neuroscience News", "description": "Neurons in the brain directly metabolize glucose to function normally, contrary to previous beliefs that glial cells metabolized the sugar and indirectly fueled neurons. The findings could provide insights into the development of new therapeutic approaches fo…", "url": "https://neurosciencenews.com/glucose-neuron-metabolism-23064/", "urlToImage": "https://neurosciencenews.com/files/2023/04/glucose-metabolism-neurosciences-public.jpg", "publishedAt": "2023-04-20T19:16:34Z", "content": "Summary: Neurons in the brain directly metabolize glucose to function normally, contrary to previous beliefs that glial cells metabolized the sugar and indirectly fuel neurons. The findings could pro… [+8906 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Cognitive Decline May Be Triggered by Astrocyte Dysfunction - Neuroscience News", "description": "A new study reveals astrocyte dysfunction may be a driver of cognitive decline and memory loss in those with dementia. This may be caused by a protein build-up in the astrocytes that appears to trigger abnormal antiviral activity that results in memory loss.", "url": "https://neurosciencenews.com/cognitive-decline-astrocytes-23063/", "urlToImage": "https://neurosciencenews.com/files/2023/04/astrocyte-cognition-neurosicences-.jpg", "publishedAt": "2023-04-20T18:48:58Z", "content": "Summary: A new study reveals astrocyte dysfunction may be a driver of cognitive decline and memory loss in those with dementia. This may be caused by a protein build-up in the astrocytes that appears… [+7318 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Matthew Weaver", "title": "Worms crave junk food after consuming cannabis, study suggests - The Guardian", "description": "Worms soaked in cannabinoid found to have stronger preference than usual for higher-calorie foods", "url": "https://www.theguardian.com/society/2023/apr/20/worms-crave-junk-food-after-consuming-cannabis-study-suggests", "urlToImage": "https://i.guim.co.uk/img/media/5844072039f6507ed30ea80c1a4f913f13d4e82c/0_430_1840_1103/master/1840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c8b5c6a152f3069756b99cf820cd3da1", "publishedAt": "2023-04-20T17:33:00Z", "content": "It is not just humans that get the munchies: worms also display the same craving for their favourite snacks after consuming cannabis, new research has found.\r\nIn the study, published in the journal C… [+2108 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "I was diagnosed with Parkinson's at 45. These were my 'shocking' first symptoms - Daily Mail", "description": "Vikas Chinnan, from San Carlos, California, was diagnosed with young onset Parkinson's disease after suffering stiffness in his right side, apathy and a lack of interest in activities he once loved.", "url": "https://www.dailymail.co.uk/health/article-11994979/I-diagnosed-Parkinsons-45-shocking-symptoms.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/20/17/70047513-0-image-a-6_1682009088265.jpg", "publishedAt": "2023-04-20T15:53:12Z", "content": "A Californian man who was diagnosed with Parkinson's in his 40s said he initially wrote off his earliest symptoms.\r\nVikas Chinnan, from San Carlos, near San Francisco, said his early warning signs in… [+7369 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "Laser eye surgery patients reveal what REALLY happens when procedure goes wrong - Daily Mail", "description": "Laser eye surgery, also known as LASIK, is a vision corrective procedure which uses a laser to reshape the inner cornea. Roughly half a million Americans have the surgery every year.", "url": "https://www.dailymail.co.uk/health/article-11994983/Patients-left-permanent-damage-reveal-laser-eye-surgery-REALLY-like.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/20/16/70053367-0-image-a-23_1682004595545.jpg", "publishedAt": "2023-04-20T15:20:28Z", "content": "Patients suffering from severe long-term issues after receiving laser eye surgery are speaking out as doctors allege complications are more common than advertised.\r\nGloria McConnell, from Florida, ki… [+6256 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hidden Linkages: Scientists Find Mind-Body Connection Is Built Into Brain - SciTechDaily", "description": "Findings point to brain areas that integrate planning, purpose, physiology, behavior, and movement. Calm body, calm mind, say the practitioners of mindfulness. A new study by researchers at Washington University School of Medicine in St. Louis indicates that …", "url": "https://scitechdaily.com/hidden-linkages-scientists-find-mind-body-connection-is-built-into-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Signals-Activity-Technology-Concept.jpg", "publishedAt": "2023-04-20T08:23:06Z", "content": "Researchers have discovered a connection between the brain areas controlling movement and those involved in thinking, planning, and involuntary bodily functions like blood pressure and heartbeat. The… [+10508 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Childhood Abuse and Biological Sex Linked to Epigenetic Changes in Functional Neurological Disorder - Neuroscience News", "description": "Functional movement/conversion disorder (FMD) is characterized by epigenetic changes, and women and child abuse survivors with FMD have different epigenetic profiles linked to the condition.", "url": "https://neurosciencenews.com/fmd-epigenetics-23059/", "urlToImage": "https://neurosciencenews.com/files/2023/04/child-abuse-epigenetics-neurology-neurosice-public.jpg", "publishedAt": "2023-04-19T22:10:06Z", "content": "Summary: Functional movement/conversion disorder (FMD) is characterized by epigenetic changes, and women and child abuse survivors with FMD have different epigenetic profiles linked to the condition.… [+6609 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Newfound Link Between Alzheimer’s and Iron Could Lead to New Medical Interventions - Neuroscience News", "description": "A new imaging probe revealed an increase in iron redox in brain areas where amyloid plaques occur in the brain in Alzheimer's disease.", "url": "https://neurosciencenews.com/alzheimers-iron-23057/", "urlToImage": "https://neurosciencenews.com/files/2023/04/iron-alzheimers-neurosicences.jpg", "publishedAt": "2023-04-19T21:36:56Z", "content": "Summary: A new imaging probe revealed an increase in iron redox in brain areas where amyloid plaques occur in the brain in Alzheimer’s disease.\r\nSource: UT Austin\r\nThere is a growing body of evidence… [+5736 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Strong Sense of Purpose in Life Promotes Cognitive Resilience Among Middle-Aged Adults - Neuroscience News", "description": "A stronger sense of purpose enhances cognitive resilience in middle-aged adults, a new study reports. Those who report greater purpose in life have greater functional connectivity between the default mode network and other brain areas, which represents a neur…", "url": "https://neurosciencenews.com/purposes-life-cognition-23056/", "urlToImage": "https://neurosciencenews.com/files/2023/04/sense-of-purpose-resilience-neurosinces-public.jpg", "publishedAt": "2023-04-19T21:21:22Z", "content": "Summary: A stronger sense of purpose enhances cognitive resilience in middle-aged adults, a new study reports. Those who report greater purpose in life have greater functional connectivity between th… [+7944 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Infectious particles of the SARS-CoV-2 virus isolated from hospital air - News-Medical.Net", "description": "Quebec scientists have succeeded in isolating infectious particles of the SARS-CoV-2 virus from air samples collected from hospital rooms of COVID-19 patients and kept frozen for more than a year, a new study shows.", "url": "https://www.news-medical.net/news/20230419/Infectious-particles-of-the-SARS-CoV-2-virus-isolated-from-hospital-air.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2023-04-19T20:22:00Z", "content": "Quebec scientists have succeeded in isolating infectious particles of the SARS-CoV-2 virus from air samples collected from hospital rooms of COVID-19 patients and kept frozen for more than a year, a … [+3380 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Covid vaccine MHRA report: 'Yet again us conspiracy factualists are proved right' | Laurence Fox - GBNews", "description": "'Yet again us conspiracy factualists are proved right for the 100th bleeping time.'Laurence Fox gives his view on a new report which criticises MHRA's approv...", "url": "https://www.youtube.com/watch?v=MbbuP-6P5qo", "urlToImage": "https://i.ytimg.com/vi/MbbuP-6P5qo/maxresdefault.jpg", "publishedAt": "2023-04-19T18:28:58Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Breakthrough Test Detects Parkinson's Biomarker With 90 Percent Accuracy - IFLScience", "description": "It's a promising leap forward in our understanding of Parkinson's.", "url": "https://www.iflscience.com/breakthrough-test-detects-parkinsons-biomarker-with-90-percent-accuracy-michael-j-fox-foundation-announces-68532", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68532/aImg/67340/michael-j-fox-meta.jpg", "publishedAt": "2023-04-19T14:49:30Z", "content": "The Michael J Fox Foundation has announced the findings of a landmark paper that identified a biomarker for Parkinsons disease with high accuracy, which may be able to indicate disease before typical… [+3948 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Loren Cecil", "title": "Social Media Made Me Do A Cold Plunge. It Was Harder Than Influencers Make It Look. - BuzzFeed News", "description": "After nearly hyperventilating, I was able to stay in a plunge pool for a full five minutes, thanks to some Wim Hof method–esque breathwork and peer pressure.", "url": "https://www.buzzfeednews.com/article/lorencecil1/cold-plunge-pool-review", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2023-04/18/21/asset/08284db4e4d5/sub-buzz-1932-1681853903-2.jpg?crop=1600:837;0,229%26downsize=1250:*", "publishedAt": "2023-04-19T12:31:03Z", "content": "As it turns out, my fear of looking like a quitter is more powerful than my fight-or-flight, so I closed my eyes and focused on my breathing until I was able to somewhat regulate it. I cant say I was… [+4182 chars]"}]}