{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Do We Know if Our Brain Is Capable of Repairing Itself? - Neuroscience News", "description": "A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restoring brain function. Recent single-cell transcriptomic studies in the ad…", "url": "https://neurosciencenews.com/neuroregeneration-neuroscience-22969/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-repair-neurosinces-public.jpg", "publishedAt": "2023-04-08T21:06:33Z", "content": "Summary: A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restorin… [+8686 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Four Different Autism Subtypes Identified by Brain Activity - Neuroscience News", "description": "Using a combination of machine learning and neuroimaging data, researchers report people on the autism spectrum can be classified into four different subtype groups based on brain activity and behavior.", "url": "https://neurosciencenews.com/asd-subtypes-machine-learning-22968/", "urlToImage": "https://neurosciencenews.com/files/2023/04/autism-subtypes-brain-activity-neuroscience-public.jpg", "publishedAt": "2023-04-08T20:45:01Z", "content": "Summary: Using a combination of machine learning and neuroimaging data, researchers report people on the autism spectrum can be classified into four different subtype groups based on brain activity a… [+9063 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain Slows Down When We Focus Our Gaze - Neuroscience News", "description": "A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight into how the structure of neural networks determines the speed at whic…", "url": "https://neurosciencenews.com/gaze-focus-brain-slows-22966/", "urlToImage": "https://neurosciencenews.com/files/2023/04/gaze-focus-brain-neurosciences-public.jpg", "publishedAt": "2023-04-08T19:44:22Z", "content": "Summary: A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight i… [+6342 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Your own voice \"is not just a sound\": Bone-conduction tech offers new insights into voice perception - PsyPost", "description": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which sound waves travel through bones in your skull and inner ea…", "url": "https://www.psypost.org/2023/04/your-own-voice-is-not-just-a-sound-bone-conduction-tech-offers-new-insights-into-voice-perception-74872", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/soundwave-ear-hearing-perception.jpg", "publishedAt": "2023-04-08T17:06:23Z", "content": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which… [+5777 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Abi Turner", "title": "Expert lifts the lid on the BAD HABITS for our Brain Health we do every day - Daily Mail", "description": "Dr Miriam Ferrer, from Cambridge, told FEMAIL the four everyday habits which could be damaging your brain health, and making your memory worse.", "url": "https://www.dailymail.co.uk/femail/article-11780703/Expert-lifts-lid-BAD-HABITS-Brain-Health-day.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/22/18/67970173-0-image-a-16_1677090470741.jpg", "publishedAt": "2023-04-08T11:26:35Z", "content": "Many of us grow worried about our memories after a particularly forgetful moment. \r\nAnd now an expert has revealed the four everyday habits which could be damaging your brain health, and making your … [+8948 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Uncovers Potential Explanation for COVID Vaccine Blood Clot Connection - SciTechDaily", "description": "Scientists identify key differences in immune responses to the AstraZeneca and Pfizer vaccines. A recent study conducted by a team from SAHMRI and Flinders University in Australia has revealed significant variations in the way the AstraZeneca and Pfizer COVID…", "url": "https://scitechdaily.com/new-research-uncovers-potential-explanation-for-covid-vaccine-blood-clot-connection/", "urlToImage": "https://scitechdaily.com/images/New-COVID-Vaccine-Illustration.jpg", "publishedAt": "2023-04-08T02:15:43Z", "content": "ByFlinders UniversityApril 7, 2023\r\nA recent Australian study discovered fundamental differences in immune responses between the AstraZeneca and Pfizer COVID-19 vaccines. The AstraZeneca vaccine elic… [+8388 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "High Blood Pressure in Your 30s Is Associated With Worse Brain Health in Your 70s - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/blood-pressure-aging-dementia-22961/", "urlToImage": null, "publishedAt": "2023-04-07T19:33:26Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Linda Geddes", "title": "'A silver lining': how Covid ushered in a vaccines golden era - The Guardian", "description": "Pandemic accelerated advances in vaccine technology, opening up possibilities for combating array of diseases", "url": "https://www.theguardian.com/science/2023/apr/07/covid-vaccines-golden-era-pandemic-techology-diseases", "urlToImage": "https://i.guim.co.uk/img/media/3a9996cec8bbf52f3dd2b9c7dcced10334d10df5/0_375_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d6b52fbf29ea9c71a7dab999d3cced0", "publishedAt": "2023-04-07T18:00:00Z", "content": "The Covid-19 pandemic has been awful for many reasons. But if there is a bright side to the past three years, it is vaccines. Development and testing has advanced at an unprecedented pace since the a… [+9483 chars]"}, {"source": {"id": null, "name": "Healthnews.com"}, "author": "Healthnews.com", "title": "Snoring Could Impact Your Brain | HealthNews - Healthnews.com", "description": null, "url": "https://healthnews.com/news/snoring-declines-brain-functioning-in-men-study-suggests/", "urlToImage": null, "publishedAt": "2023-04-07T17:14:08Z", "content": null}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Here are some healthy ways to lose weight - The News International", "description": "Weight loss is a common goal for many people, but it's important to approach weight loss in a healthy way. Crash diets, extreme exercise routines, and weight loss supplements may promise fast...", "url": "https://www.thenews.com.pk/latest/1058316-healthy-ways-to-lose-weight", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-04-07/1058316_091632_updates.jpg", "publishedAt": "2023-04-07T16:26:00Z", "content": "Weight loss is a common goal for many people, but it's important to approach weight loss in a healthy way. Crash diets, extreme exercise routines, and weight loss supplements may promise fast results… [+1658 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "The six signs of a stroke that AREN'T the ones you've been told about - Daily Mail", "description": "Stroke symptoms are commonly remembered under the four-letter acronym, FAST. But other - just as common - tell-tale signs of a looming stroke, often fall under the radar.", "url": "https://www.dailymail.co.uk/health/article-11925357/The-six-signs-stroke-ARENT-ones-youve-told-about.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/06/15/69553495-0-image-a-20_1680791498633.jpg", "publishedAt": "2023-04-07T14:44:18Z", "content": "Face, arms, speech, time.  \r\nStroke symptoms are commonly remembered under this four-letter acronym, FAST. \r\nPatients experiencing a stroke can often have their face drop on one side, struggle to lif… [+10416 chars]"}, {"source": {"id": null, "name": "HuffPost UK"}, "author": "Sarah-Louise Kelly", "title": "This Diet Change Could Slash Your Risk Of Heart And Stroke Conditions - HuffPost UK", "description": "Good news if you love potatoes (who doesn't?)", "url": "https://www.huffingtonpost.co.uk/entry/this-diet-change-could-slash-your-risk-of-heart-and-stroke-conditions_uk_642ed0f6e4b0c2da15056b2d", "urlToImage": "https://img.huffingtonpost.com/asset/642ed12523000038009bf1dd.jpeg?ops=1200_630", "publishedAt": "2023-04-07T04:00:20Z", "content": "Do you have a soft spot for the Mediterranean diet? Great news it could be prolonging your life and improving your heart health! \r\nNew global research conducted by The BMJ has found that the southern… [+2814 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study: Smells Influence Metabolism and Aging - SciTechDaily", "description": "Researchers at the University of Otago have discovered that exposure to female odors and pheromones in mice can lead to weight loss and longer lifespans. These findings may have potential implications for humans. According to Dr. Michael Garratt, the lead res…", "url": "https://scitechdaily.com/new-study-smells-influence-metabolism-and-aging/", "urlToImage": "https://scitechdaily.com/images/Smoke-Odor-Concept.jpg", "publishedAt": "2023-04-06T23:27:49Z", "content": "The University of Otago researchers found that exposure to female odors and pheromones can cause weight loss and extend the life spans of mice, with potential implications for humans. This study high… [+3000 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Risk factors and vectors for SARS-CoV-2 household transmission: a prospective, longitudinal cohort study - The Lancet", "description": "Presence of SARS-CoV-2 RNA on primary cases' and contacts' hands and on frequently-touched\nhousehold surfaces associates with transmission, identifying these as potential vectors\nfor spread in households.", "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247%2823%2900069-1/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/1720e851-1733-497a-b4a0-3712387c90cd/gr1.jpg", "publishedAt": "2023-04-06T22:34:22Z", "content": "The content on this site is intended for science and health care professionals.\r\nWe use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, ple… [+254 chars]"}]}