{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Morning Chalk Up"}, "author": "Tino Marini", "title": "The Strength Numbers You Need to be Competitive in CrossFit - Morning Chalk Up", "description": "Since the inception of the CrossFit Games, we have seen the sport develop and athletes continually push the limits of their athletic abilities. They’re doing things that, according to research…", "url": "https://morningchalkup.com/2023/08/10/the-strength-numbers-you-need-to-be-competitive-in-crossfit/", "urlToImage": "https://static.morningchalkup.com/2023/08/oldLift.jpg", "publishedAt": "2023-08-10T17:17:46Z", "content": "Enjoying Morning Chalk Up? Access additional exclusive interviews, analyses, and stories with an Rx membership. \r\nSince the inception of the CrossFit Games, we have seen the sport develop and athlete… [+1469 chars]"}, {"source": {"id": null, "name": "menshealth.com"}, "author": "Cori Ritchey", "title": "How to Lose Fat and Gain Muscle - What Is Body Recomposition - Men's Health", "description": "The answer is more complicated than you might've been led to believe. Here's what you need to know.", "url": "https://www.menshealth.com/fitness/a44639317/lose-fat-and-gain-muscle/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/gym-royalty-free-image-1691601385.jpg?crop=1.00xw:0.752xh;0,0.192xh&resize=1200:*", "publishedAt": "2023-08-09T17:29:50Z", "content": "IF YOU'RE LOOKING to get in shape, your goals probably boil down to achieving two specific things: \r\nlosing fat and gaining muscle. Achieving just one of these is no small feat. Achieving them togeth… [+6527 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "How getting your appendix out may become a thing of the past: Experts claim antibiotics alone can treat life-t - Daily Mail", "description": "Swift removal of the appendix has been standard treatment for over a century. But Swedish experts say the only risk of not operating and relying on drugs instead is appendicitis recurring.", "url": "https://www.dailymail.co.uk/health/article-12388833/How-getting-appendix-thing-past.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/08/09/15/74126225-0-image-a-24_1691589963649.jpg", "publishedAt": "2023-08-09T15:42:09Z", "content": "Operations to remove the appendix could soon become a thing of the past.\r\nSwedish experts claim appendicitis when the mysterious, worm-shaped organ gets infected can be treated effectively with antib… [+4051 chars]"}]}