{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Louise Allingham", "title": "Get health doctor Megan Rossi reveals how to get rid of bad garlic bread by eating an apple - Daily Mail", "description": "Gut health doctor Megan Rossi has revealed a simple hack for eliminating smelly garlic breath. The doctor also raved about the health benefits of garlic and why you should leave it to stand before cooking.", "url": "https://www.dailymail.co.uk/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/02/70601017-0-image-a-27_1683249255623.jpg", "publishedAt": "2023-05-05T05:27:17Z", "content": "A top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. \r\nDr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breat… [+2808 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Mother who woke up with pain on one side of her face told she had brain tumor - Daily Mail", "description": "Andreea Vanacker, from Montreal, Canada, said the sensation was so bad that she became afraid to talk, laugh or even eat. Doctors diagnosed her with a benign brain tumor.", "url": "https://www.dailymail.co.uk/health/article-12047983/Mother-woke-pain-one-face-told-brain-tumor.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/04/21/70591931-0-image-a-42_1683232812972.jpg", "publishedAt": "2023-05-04T20:53:45Z", "content": "A mother-of-two who woke up with an electric shock-like pain on the right side of her face was shocked to learn brain tumor.\r\nAndreea Vanacker, from Montreal, Canada, said the feeling emerged without… [+5132 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleeping Deeply to Remember Better: Deep Sleep Could Reduce Memory Loss in Alzheimer's - Neuroscience News", "description": "Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimer’s disease. The research indicates that superior amounts of deep sleep can act as a protective factor against memory decline …", "url": "https://neurosciencenews.com/memory-alzheimers-sleep-23173/", "urlToImage": "https://neurosciencenews.com/files/2023/05/sleep-alzheimers-neurosicences.jpg", "publishedAt": "2023-05-04T19:52:50Z", "content": "Summary: Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimers disease. The research indicates that superior amounts … [+10371 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "40 Frightening Scientific Facts That Folks In This Online Group Had The Misfortune To Learn - Bored Panda", "description": "The great German philosopher Friedrich Nietzsche once sagely remarked that \"if you gaze into the abyss, the abyss gazes also into you.\" Damn rightly noticed, especially when you consider that for several millennia of its existence, humanity has been actively …", "url": "https://www.boredpanda.com/scientific-fact-theory-scares-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/scientific-fact-theory-scares-you-fb19.png", "publishedAt": "2023-05-04T15:32:19Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "My brain exploded when I SNEEZED: Alabama man, 26, needed surgery after blood clot burst in skull - Daily Mail", "description": "University student Sam Messina, 26, was lying in bed in September 2016 when a blood clot in his brain ruptured. Doctors discovered a deadly aneurysm in his head.", "url": "https://www.dailymail.co.uk/health/article-12046941/My-brain-exploded-SNEEZED-Alabama-man-26-needed-surgery-blood-clot-burst-skull.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/04/15/70578191-0-image-a-5_1683209543836.jpg", "publishedAt": "2023-05-04T15:29:37Z", "content": "An Alabama man suffered a dangerous brain bleed after a sneeze caused a blood clot to rupture in his skull.\r\nUniversity student Sam Messina, 26, was lying in bed in September 2016 when he let out a s… [+4102 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Parallel sequencing of extrachromosomal circular DNAs and transcriptomes in single cancer cells - Nature.com", "description": "scEC&T-seq profiles extrachromosomal circular DNA and full-length mRNA from single human cancer cells, and may be used to interrogate heterogeneity in both cell lines and primary tumor samples.", "url": "https://www.nature.com/articles/s41588-023-01386-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01386-y/MediaObjects/41588_2023_1386_Fig1_HTML.png", "publishedAt": "2023-05-04T15:23:24Z", "content": "scEC&amp;T sequencing\r\nA detailed, step-by-step protocol of scEC&amp;T-seq is available on the Nature Protocol Exchange46 and is described below. The duration of the protocol is approximately 8days p… [+31969 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "People with more pronounced openness to experience tend to have nightmares more often - PsyPost", "description": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently. Individuals with higher levels of neuroticism, on the other…", "url": "https://www.psypost.org/2023/05/people-with-pronounced-openness-to-experience-tend-to-have-nightmares-more-often-80314", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/nightmare.jpg", "publishedAt": "2023-05-04T14:04:07Z", "content": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently.… [+4020 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Joe Sommerlad", "title": "6 mouth cancer symptoms everyone should know - The Independent", "description": "Cases have risen dramatically over last decade, according to recent research", "url": "https://www.independent.co.uk/life-style/health-and-families/mouth-cancer-symptoms-nhs-treatment-b2332172.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/03/11/22/web-smoking-alamy.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-05-04T05:47:57Z", "content": "Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter\r\nStay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter \r\nCases of m… [+3039 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Restricting e-cigarettes to 'tobacco flavour' could slash teens vapers by 70 per cent - Daily Mail", "description": "Ditching fruit flavours in favour of pure tobacco would significantly reduce the appeal of vaping among young people according to a survey carried out by US researchers in Ohio.", "url": "https://www.dailymail.co.uk/health/article-12043037/Restricting-e-cigarettes-tobacco-flavour-slash-teens-vapers-70-cent.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/03/17/70538745-0-image-a-10_1683132526370.jpg", "publishedAt": "2023-05-04T05:00:49Z", "content": "Limiting e-cigarette flavours to tobacco could cut use among teens by 70 per cent, a study found.\r\nDitching fruit flavours would significantly reduce the appeal of vaping among the young, according t… [+3730 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Ignore Your Slowing Mobility: It Could Be a Sign of Something More Sinister - SciTechDaily", "description": "According to widely held belief, aging leads to a decline in muscle strength and a slower pace, but recent studies suggest that it may also be a warning sign of a more sinister age-related health issue. As we age, it is widely acknowledged that our muscle str…", "url": "https://scitechdaily.com/dont-ignore-your-slowing-mobility-it-could-be-a-sign-of-something-more-sinister/", "urlToImage": "https://scitechdaily.com/images/Clock-Aging-Time-Old.jpg", "publishedAt": "2023-05-04T00:19:01Z", "content": "ByEdith Cowan UniversityMay 3, 2023\r\nNew research suggests that decreased muscle strength and slowed movement in older adults may signal a higher risk of late-life dementia. Incorporating simple, ine… [+5480 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleep Spindles Play a Role in Soothing PTSD Anxiety and Enhancing Memory Retention - Neuroscience News", "description": "Brief bursts of brain activity during sleep known as sleep spindles could potentially help regulate anxiety in people with post-traumatic stress disorder (PTSD). Researchers believe that the study's findings may be useful for people with anxiety disorders and…", "url": "https://neurosciencenews.com/ptsd-sleep-anxiety-23167/", "urlToImage": "https://neurosciencenews.com/files/2023/05/sleep-anxiety-ptsd-neurosciences.jpg", "publishedAt": "2023-05-03T21:34:16Z", "content": "Summary: Brief bursts of brain activity during sleep known as sleep spindles could potentially help regulate anxiety in people with post-traumatic stress disorder (PTSD). Researchers believe that the… [+7859 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Psychopathic women show reduced structural integrity in brain region linked to emotional responses - PsyPost", "description": "What are the neurocognitive mechanisms that contribute to antisocial behaviors? A study in Brain Imaging and Behavior suggests that decreased white matter connectivity could be linked to psychopathy for incarcerated women. ...", "url": "https://www.psypost.org/2023/05/psychopathic-woman-show-reduced-structural-integrity-in-brain-region-linked-to-emotional-responses-80295", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/multicolor-brain.jpg", "publishedAt": "2023-05-03T17:13:22Z", "content": "What are the neurocognitive mechanisms that contribute to antisocial behaviors? A study in Brain Imaging and Behavior suggests that decreased white matter connectivity could be linked to psychopathy … [+3922 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Manal Mohammed", "title": "Arcturus: what to know about the new COVID variant, omicron XBB.1.16 - The Conversation", "description": "This variant seems to be causing a new symptom not commonly seen with earlier COVID strains.", "url": "https://theconversation.com/arcturus-what-to-know-about-the-new-covid-variant-omicron-xbb-1-16-204598", "urlToImage": "https://images.theconversation.com/files/524056/original/file-20230503-14-zp5j43.jpg?ixlib=rb-1.1.0&rect=0%2C482%2C7680%2C3840&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-05-03T15:07:29Z", "content": "A new COVID variant XBB.1.16, or Arcturus, has now been identified in at least 34 countries including the UK. \r\nArcturus is a subvariant of omicron and was first detected in India in January 2023.\r\nA… [+4311 chars]"}]}