{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Do We Know if Our Brain Is Capable of Repairing Itself? - Neuroscience News", "description": "A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restoring brain function. Recent single-cell transcriptomic studies in the ad…", "url": "https://neurosciencenews.com/neuroregeneration-neuroscience-22969/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-repair-neurosinces-public.jpg", "publishedAt": "2023-04-08T21:06:33Z", "content": "Summary: A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restorin… [+8686 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Helen Carroll", "title": "Cancer-stricken scientist who created first antibiotic type in 40 years may die before Nobel Prize - Daily Mail", "description": "Kirsty Smitten (pictured), 28, harbours fantasies of one day collecting a Nobel Prize for her scientific work - and rightly so, given that it could save millions of lives and avert a medical catastrophe.", "url": "https://www.dailymail.co.uk/health/article-11952247/Cancer-stricken-scientist-created-antibiotic-type-40-years-die-Nobel-Prize.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/08/16/69622939-0-image-a-16_1680968747258.jpg", "publishedAt": "2023-04-08T21:00:56Z", "content": "Kirsty Smitten harbours fantasies of one day collecting a Nobel Prize for her scientific work and rightly so, given that it could save millions of lives and avert a medical catastrophe.\r\nAt just 28, … [+13685 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How the Brain Slows Down When We Focus Our Gaze - Neuroscience News", "description": "A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight into how the structure of neural networks determines the speed at whic…", "url": "https://neurosciencenews.com/gaze-focus-brain-slows-22966/", "urlToImage": "https://neurosciencenews.com/files/2023/04/gaze-focus-brain-neurosciences-public.jpg", "publishedAt": "2023-04-08T19:44:22Z", "content": "Summary: A new study reveals that the brain can switch between slow and fast integration of information, allowing it to modulate the timescales on which it operates. The study also provides insight i… [+6342 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Your own voice \"is not just a sound\": Bone-conduction tech offers new insights into voice perception - PsyPost", "description": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which sound waves travel through bones in your skull and inner ea…", "url": "https://www.psypost.org/2023/04/your-own-voice-is-not-just-a-sound-bone-conduction-tech-offers-new-insights-into-voice-perception-74872", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/soundwave-ear-hearing-perception.jpg", "publishedAt": "2023-04-08T17:06:23Z", "content": "Bone conduction helps you distinguish between your own voice and the voice of others, according to new research published in Royal Society Open Science. Bone conduction refers to the process by which… [+5777 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "7 Supplements To Help You Poop Immediately — Eat This Not That - Eat This, Not That", "description": "If you're having trouble going to the bathroom, try one of these dietitian-recommended supplements to help you poop.", "url": "https://www.eatthis.com/supplements-to-help-you-poop/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/05/supplement-in-water.jpg?quality=82&strip=all", "publishedAt": "2023-04-08T13:01:04Z", "content": "Having something go wrong with your digestion is enough to completely derail whatever plans you had for the day. Whether it's having to sprint to the restroom way too much, or having the opposite iss… [+5669 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Abi Turner", "title": "Expert lifts the lid on the BAD HABITS for our Brain Health we do every day - Daily Mail", "description": "Dr Miriam Ferrer, from Cambridge, told FEMAIL the four everyday habits which could be damaging your brain health, and making your memory worse.", "url": "https://www.dailymail.co.uk/femail/article-11780703/Expert-lifts-lid-BAD-HABITS-Brain-Health-day.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/22/18/67970173-0-image-a-16_1677090470741.jpg", "publishedAt": "2023-04-08T11:26:35Z", "content": "Many of us grow worried about our memories after a particularly forgetful moment. \r\nAnd now an expert has revealed the four everyday habits which could be damaging your brain health, and making your … [+8948 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Busts Myths About 5 Common Foods That Seem Healthy, But Aren't - NDTV Food", "description": "Nutritionist Lovneet Batra explains how some health foods can do harm to our body even when they are usually considered healthy.", "url": "https://food.ndtv.com/health/nutritionist-shares-5-foods-that-aren-t-as-healthy-as-you-may-think-3930532", "urlToImage": "https://c.ndtvimg.com/2023-01/it7humj8_whey-protein_625x300_16_January_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-04-08T06:32:50Z", "content": "Whether you are on a weight loss diet or aiming to gain muscles, its it important to eat healthy. Most of us vow to ditch delicious cakes and chocolates and switch to protein bars, shakes and salads … [+2668 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Uncovers Potential Explanation for COVID Vaccine Blood Clot Connection - SciTechDaily", "description": "Scientists identify key differences in immune responses to the AstraZeneca and Pfizer vaccines. A recent study conducted by a team from SAHMRI and Flinders University in Australia has revealed significant variations in the way the AstraZeneca and Pfizer COVID…", "url": "https://scitechdaily.com/new-research-uncovers-potential-explanation-for-covid-vaccine-blood-clot-connection/", "urlToImage": "https://scitechdaily.com/images/New-COVID-Vaccine-Illustration.jpg", "publishedAt": "2023-04-08T02:15:43Z", "content": "ByFlinders UniversityApril 7, 2023\r\nA recent Australian study discovered fundamental differences in immune responses between the AstraZeneca and Pfizer COVID-19 vaccines. The AstraZeneca vaccine elic… [+8388 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Linda Geddes", "title": "'A silver lining': how Covid ushered in a vaccines golden era - The Guardian", "description": "Pandemic accelerated advances in vaccine technology, opening up possibilities for combating array of diseases", "url": "https://www.theguardian.com/science/2023/apr/07/covid-vaccines-golden-era-pandemic-techology-diseases", "urlToImage": "https://i.guim.co.uk/img/media/3a9996cec8bbf52f3dd2b9c7dcced10334d10df5/0_375_5000_3001/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6d6b52fbf29ea9c71a7dab999d3cced0", "publishedAt": "2023-04-07T18:00:00Z", "content": "The Covid-19 pandemic has been awful for many reasons. But if there is a bright side to the past three years, it is vaccines. Development and testing has advanced at an unprecedented pace since the a… [+9483 chars]"}, {"source": {"id": null, "name": "Healthnews.com"}, "author": "Healthnews.com", "title": "Snoring Could Impact Your Brain | HealthNews - Healthnews.com", "description": null, "url": "https://healthnews.com/news/snoring-declines-brain-functioning-in-men-study-suggests/", "urlToImage": null, "publishedAt": "2023-04-07T17:14:08Z", "content": null}]}