{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Healthy Prenatal Diet Linked to Lower Autism Risk - Neuroscience News", "description": "A new study suggests that a healthy prenatal diet may lower the risk of autism and social communication difficulties in children, according to researchers who analyzed data from two large cohort studies in Norway and the UK.", "url": "https://neurosciencenews.com/pregnancy-diet-autism-26466/", "urlToImage": "https://neurosciencenews.com/files/2024/07/pregnancy-diet-autism-neurosicence.jpg", "publishedAt": "2024-07-19T12:35:49Z", "content": "Summary: A new study suggests that a healthy prenatal diet may lower the risk of autism and social communication difficulties in children, according to researchers who analyzed data from two large co… [+11172 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Surprising Truth About Ultra-Processed Foods: Redefining Health and Nutrition - SciTechDaily", "description": "A new study calls into question the level of processing as a proxy for diet quality. Recent research challenges the notion that minimally processed foods automatically lead to a healthier diet, revealing that both minimally and ultra-processed diets can be eq…", "url": "https://scitechdaily.com/the-surprising-truth-about-ultra-processed-foods-redefining-health-and-nutrition/", "urlToImage": "https://scitechdaily.com/images/Hamburger-Fries-Beer.jpg", "publishedAt": "2024-07-19T12:31:15Z", "content": "Diets rich in minimally processed foods dont necessarily offer better nutritional benefits than those with more ultra-processed items. A study comparing two Western diets found similar nutritional sc… [+7287 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Viktorija Ošikaitė", "title": "Dad Beyond Livid After Boomer Poisons His Son Trying To Prove His Delusional Point - Bored Panda", "description": "A father vented online about a boomer who purposely and knowingly switched out his son’s dish for one with wheat after refusing to believe that celiac disease is real.", "url": "https://www.boredpanda.com/boomer-gives-celiac-child-gluten-on-purpose/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2024/07/boomer-gives-celiac-child-gluten-on-purpose-fb54.png", "publishedAt": "2024-07-19T11:59:34Z", "content": "There is a particularly annoying subset of people both online and in real life who live under the impression that just because they dont have an allergy or disease, then it must basically not be real… [+4996 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Video shows drug's 'life-changing' effect on man with Parkinson's - BBC.com", "description": "Damien Gath says the severe symptoms he has had for years have improved in a matter of days.", "url": "https://www.bbc.com/news/articles/cd1xwr2qy3do", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1ddf/live/cf7bcce0-45bc-11ef-96a8-e710c6bfc866.jpg", "publishedAt": "2024-07-18T14:50:33Z", "content": "By Dan Martin, BBC News, East Midlands\r\nA man living with Parkinson's has said a new drug has transformed his life in a matter of days.\r\nDamien Gath, 52, has experienced years of daily involuntary sh… [+3735 chars]"}]}