{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Lillian Gissen", "title": "Doctor reveals what your TONGUE says about your health - Daily Mail", "description": "Dr. Siobhan Deshauer, a rheumatology specialist from Canada, broke down the various things that she can determine about a patient's body - just based off the way their tongue looks and acts.", "url": "https://www.dailymail.co.uk/femail/article-12034401/Doctor-reveals-TONGUE-says-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/03/13/70528403-0-image-a-27_1683118224859.jpg", "publishedAt": "2023-05-06T17:51:05Z", "content": "A doctor has shared all the things that your tongue can reveal about your health - from how the color and coating can tell you when you're sick to certain things you should look out for that can pose… [+12501 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Cannabis Use Disorder Linked to Increased Schizophrenia Risk in Males - Neuroscience News", "description": "Young men who suffer from cannabis use disorder are more likely to develop schizophrenia, according to a new study.", "url": "https://neurosciencenews.com/cud-male-schizophernia-23184/", "urlToImage": "https://neurosciencenews.com/files/2023/05/cud-schizophrenia-neurosince.jpg", "publishedAt": "2023-05-06T16:31:27Z", "content": "Summary: Young men who suffer from cannabis use disorder are more likely to develop schizophrenia, according to a new study. \r\nThe study analyzed health records data of over 6 million people in Denma… [+9005 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Breaking the Darkness: Reactivating Dormant Cells in the Retina Brings New Hope for Vision Regeneration - Neuroscience News", "description": "Researchers discovered a way to reactivate dormant cells in the retina of mice to restore vision, without the need for transplantation.", "url": "https://neurosciencenews.com/vision-restoration-genetic-23183/", "urlToImage": "https://neurosciencenews.com/files/2023/05/vision-restoration-neurosnc.jpg", "publishedAt": "2023-05-06T14:36:59Z", "content": "Summary: Researchers discovered a way to reactivate dormant cells in the retina of mice to restore vision, without the need for transplantation. \r\nThe team discovered dormant glial cells can be trans… [+5526 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": null, "title": "'Everyone Thought My Post-COVID POTS Symptoms Were Just Anxiety' - Women's Health", "description": "\"I started passing out for no reason.\"", "url": "https://www.womenshealthmag.com/health/a43594385/long-covid-pots-postural-orthostatic-tachycardia-syndrome/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/img-5840-64500297838f4.jpg?crop=1xw:0.6332872928176796xh;center,top&resize=1200:*", "publishedAt": "2023-05-06T11:03:58Z", "content": "I got my first \r\nCOVID infection in January 2020, before most people even realized the coronavirus was here. I was a third-year medical student, and I saw a patient who had just returned from Japan. … [+6278 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Michael Mosley", "title": "From eating dairy and spicy food to doing squats simple steps to speed up metabolism - Daily Mail", "description": "People often tell me that, despite eating healthily, they continue to put on weight - and they wonder if this could be because their metabolism has slowed down.", "url": "https://www.dailymail.co.uk/columnists/article-12053043/From-eating-dairy-spicy-food-doing-squats-simple-steps-speed-metabolism.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/06/01/70639291-0-image-a-80_1683332441965.jpg", "publishedAt": "2023-05-06T00:21:30Z", "content": "People often tell me that, despite eating healthily, they continue to put on weight and they wonder if this could be because their metabolism has slowed down.\r\nThough Ive long been sceptical about th… [+8578 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Scientists find toxic metals in 60 common beverages - Daily Mail", "description": "Researchers at Tulane University, in New Orleans, Louisiana, found toxic metals such as arsenic and cadmium in five of 60 store-bought drinks they tested.", "url": "https://www.dailymail.co.uk/health/article-12051777/Scientists-toxic-metals-60-common-beverages.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/19/70630117-0-image-a-72_1683312146034.jpg", "publishedAt": "2023-05-05T18:53:33Z", "content": "Sodas, fruit juices and plant-based milk at your local grocery store may be packed with toxic metals, a study suggests.\r\nResearchers at Tulane University in New Orleans, Louisiana, found toxic metals… [+4176 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Louise Allingham", "title": "Get health doctor Megan Rossi reveals how to get rid of bad garlic bread by eating an apple - Daily Mail", "description": "Gut health doctor Megan Rossi has revealed a simple hack for eliminating smelly garlic breath. The doctor also raved about the health benefits of garlic and why you should leave it to stand before cooking.", "url": "https://www.dailymail.co.uk/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/02/70601017-0-image-a-27_1683249255623.jpg", "publishedAt": "2023-05-05T05:27:17Z", "content": "A top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. \r\nDr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breat… [+2808 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "40 Frightening Scientific Facts That Folks In This Online Group Had The Misfortune To Learn - Bored Panda", "description": "The great German philosopher Friedrich Nietzsche once sagely remarked that \"if you gaze into the abyss, the abyss gazes also into you.\" Damn rightly noticed, especially when you consider that for several millennia of its existence, humanity has been actively …", "url": "https://www.boredpanda.com/scientific-fact-theory-scares-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/scientific-fact-theory-scares-you-fb19.png", "publishedAt": "2023-05-04T15:32:19Z", "content": null}]}