{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Weight Loss' Secret Weapon: GDF15 Powers Calorie Burn During Dieting - SciTechDaily", "description": "Research opens new possibilities to help people maintain weight loss after dieting. Researchers led by McMaster University professor Gregory Steinberg and postdoctoral research fellow Dongdong Wang have uncovered a key mechanism for promoting weight loss and …", "url": "https://scitechdaily.com/weight-loss-secret-weapon-gdf15-powers-calorie-burn-during-dieting/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss.jpg", "publishedAt": "2023-07-02T15:16:10Z", "content": "Researchers at McMaster University have found that the hormone GDF15, previously linked to reduced appetite due to metformin, could also help with weight loss by maintaining metabolism during dieting… [+3707 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "Study finds altered composition of gut species of fungi in children and adolescents with depression - PsyPost", "description": "A recent study conducted in China examined the types of fungi found in the digestive systems of children and teenagers with depression. The researchers compared these individuals to children without depression and found that the depressed group had higher lev…", "url": "https://www.psypost.org/2023/07/study-finds-altered-composition-of-gut-species-of-fungi-in-children-and-adolescents-with-depression-166081", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/06/illustration-of-the-human-gut.jpg", "publishedAt": "2023-07-02T11:06:07Z", "content": "A recent study conducted in China examined the types of fungi found in the digestive systems of children and teenagers with depression. The researchers compared these individuals to children without … [+5642 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "15+ Healthy Raspberry Breakfast Recipes - EatingWell", "description": "From make-ahead muffins and oatmeal cakes to quick and easy smoothies and yogurt bowls, these raspberry recipes are healthy choices for breakfast.", "url": "https://www.eatingwell.com/gallery/8054514/healthy-breakfast-recipes-with-raspberries/", "urlToImage": "https://www.eatingwell.com/thmb/eCf6PHCYftk1Ru4VcJ9mdS4Z3b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/chocolate-raspberry-breakfast-banana-split-4f08071e71844db384cce0b68fd8a642.jpg", "publishedAt": "2023-07-02T11:00:00Z", "content": "These raspberry recipes are healthy choices for breakfast. From make-ahead muffins and oatmeal cakes to quick and easy smoothies and yogurt bowls, these morning meals feature the gut-healthy berry in… [+4011 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Lecanemab Alzheimer's Treatment Set for FDA Approval - Neuroscience News", "description": "Doctors are preparing to administer lecanemab, a promising new Alzheimer's disease treatment nearing FDA approval.", "url": "https://neurosciencenews.com/lecanemab-alzheimers-fda-23563/", "urlToImage": "https://neurosciencenews.com/files/2023/07/lacanemab-alzheimers-neurosicences.jpg", "publishedAt": "2023-07-01T17:38:42Z", "content": "Summary: Doctors are preparing to administer lecanemab, a promising new Alzheimer’s disease treatment nearing FDA approval.\r\nThis therapy, marketed as Leqembi, slows cognitive decline by extracting a… [+6972 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Toby Amidor, MS, RD, CDN", "title": "9 Foods That Cause Digestive Problems — Eat This Not That - Eat This, Not That", "description": "A dietitian explains which foods can cause digestive problems, while also providing tips for how to make these foods easier on your stomach.", "url": "https://www.eatthis.com/foods-that-cause-digestive-problems/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/06/foods-that-cause-digestive-issues.jpg?quality=82&strip=all", "publishedAt": "2023-07-01T12:30:37Z", "content": "Digestive issues including acid reflux, gas, upset stomach, and bloating affect many of us. There are certain foods that can trigger these types of symptoms within the gastrointestinal tract. Foods t… [+5508 chars]"}, {"source": {"id": null, "name": "Hackspirit.com"}, "author": "Adrian Volenik", "title": "12 signs you're more than just tired, you're completely burnt out - Hack Spirit", "description": "Burnout isn’t just the aftermath of pulling too many late nights at the office or juggling an extraordinary load of responsibilities.  It’s a subtle thief, robbing you of energy, optimism, […] More", "url": "https://hackspirit.com/signs-youre-completely-burnt-out/", "urlToImage": "https://mlhmvq6amqed.i.optimole.com/cb:WANK~27a14/w:auto/h:auto/q:mauto/f:avif/https://hackspirit.com/wp-content/uploads/2023/06/signs-youre-completely-burnt-out.jpg", "publishedAt": "2023-07-01T00:38:25Z", "content": "Burnout isnt just the aftermath of pulling too many late nights at the office or juggling an extraordinary load of responsibilities. \r\nIts a subtle thief, robbing you of energy, optimism, and drive. … [+8992 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "GLP-1 Agonists Help in Type 2 Diabetes With Liver Cirrhosis - Medscape", "description": "In adults with cirrhosis and type 2 diabetes, glucagon-like peptide-1 receptor agonist therapy significantly lowered the risk for death and other adverse outcomes, a study found.", "url": "https://www.medscape.com/viewarticle/993948", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230630_ozempic_800x450.jpg", "publishedAt": "2023-06-30T21:50:10Z", "content": "TOPLINE: Glucagon-like peptide-1 receptor agonist(GLP-1 RA) use lowers the risk for death, cardiovascular disease, decompensated cirrhosis, and liver failure in adults with type 2 diabetes (T2D) and … [+2150 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Breathing helps to synchronize neural activity in cognitive areas of the waking brain, study finds - PsyPost", "description": "New research published in Scientific Reports suggests that breathing has a crucial role in coordinating brain activity in the prefrontal brain network during wakefulness. The findings provide new insights into the relationship between respiration and cognitiv…", "url": "https://www.psypost.org/2023/06/breathing-helps-to-synchronize-neural-activity-in-cognitive-areas-of-the-waking-brain-study-finds-165839", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/10/neuron-cells.jpg", "publishedAt": "2023-06-30T21:16:04Z", "content": "New research published in Scientific Reports suggests that breathing has a crucial role in coordinating brain activity in the prefrontal brain network during wakefulness. The findings provide new ins… [+6348 chars]"}, {"source": {"id": null, "name": "menshealth.com"}, "author": "Perri O. Blumberg", "title": "Here's What You Need to Know About B-Complex Vitamins - Men's Health", "description": "To learn the ABCs of vitamin B, you’ve come to the right place.", "url": "https://www.menshealth.com/nutrition/a44390685/vitamin-b-complex-benefits/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/man-looking-at-bottles-from-medicine-cabinet-royalty-free-image-1688144409.jpg?crop=1.00xw:0.752xh;0,0.106xh&resize=1200:*", "publishedAt": "2023-06-30T18:48:44Z", "content": "IF YOU KNOW anyone who's deficient in a B \r\nvitamin, you may see them taking a vitamin B-complex supplement. They're being touted as a cure to all your vitamin B related needsbut do you really need i… [+8477 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Loneliness Alters Brain Processing, Unique to Each Individual - Neuroscience News", "description": "Lonely people process the world uniquely, differing significantly from those who are not lonely.", "url": "https://neurosciencenews.com/loneliness-individual-brain-processing-23553/", "urlToImage": "https://neurosciencenews.com/files/2023/06/loneliness-brain-processing-neurosicence.jpg", "publishedAt": "2023-06-30T17:49:31Z", "content": "Summary: Lonely people process the world uniquely, differing significantly from those who are not lonely.\r\nThe research utilized functional magnetic resonance imaging (fMRI) to examine the brain proc… [+6571 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "New AHA Statement on Ischemia After Cardiac Surgery - Medscape", "description": "A high level of suspicion is needed to diagnose postoperative ischemia after cardiac surgery, and prompt treatment is the key to a good clinical outcome, the AHA says in a new scientific statement.", "url": "https://www.medscape.com/viewarticle/993932", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_211004_female_surgeons_operation_800x450.jpg", "publishedAt": "2023-06-30T17:49:05Z", "content": "The American Heart Association (AHA) outlines \"considerations\" on the management of acute postoperative myocardial ischemia (PMI) after cardiac surgery in a scientific statement.\r\nAlthough an infrequ… [+2769 chars]"}]}