{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Emily Atkinson", "title": "Oral sex stoking throat cancer 'epidemic' in UK and US, say experts - The Independent", "description": "Experts say people with multiple partners were up almost nine times more likely to develop the cancer", "url": "https://www.independent.co.uk/news/health/oral-sex-throat-cancer-uk-us-b2327921.html", "urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/27/12/istock-813892152.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-04-27T08:41:31Z", "content": "Sign up for our free Health Check email to receive exclusive analysis on the week in health\r\nGet our free Health Check email\r\nOral sex is stoking an epidemic of throat cancer, which is now more commo… [+2390 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Long COVID: Cedars-Sinai Researchers Find COVID-19 Vaccine Produces Antibodies Far Longer Than Expected - SciTechDaily", "description": "Findings show people with long COVID-19 respond differently to COVID-19 vaccines. A new study by investigators from the Smidt Heart Institute at Cedars-Sinai suggests long COVID-19 might be caused by a dysfunction of the immune system. The study, published in…", "url": "https://scitechdaily.com/long-covid-cedars-sinai-researchers-find-covid-19-vaccine-produces-antibodies-far-longer-than-expected/", "urlToImage": "https://scitechdaily.com/images/Illustration-COVID-19-Antibodies.jpg", "publishedAt": "2023-04-27T08:36:00Z", "content": "ByCedars-Sinai Medical CenterApril 27, 2023\r\nA study from Cedars-Sinais Smidt Heart Institute suggests that immune system dysfunction could be causing long COVID-19. The study found that patients wit… [+6860 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "Even moderate alcohol intake affects your episodic foresight - PsyPost", "description": "A new study published in the Journal of Psychopharmacology found that alcohol consumption may impair one's capacity to make decisions and be mindful of the future. The study concludes that alcohol intoxication at moderate levels can impair the ability of epis…", "url": "https://www.psypost.org/2023/04/even-moderate-alcohol-intake-affects-your-episodic-foresight-78096", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/04/woman-drinking-alcoholic-wine.jpg", "publishedAt": "2023-04-26T23:05:23Z", "content": "A new study published in the Journal of Psychopharmacology found that alcohol consumption may impair one’s capacity to make decisions and be mindful of the future. The study concludes that alcohol in… [+4105 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Long COVID's Lingering Impact: Brain Function Changes Can Persist for Months - Neuroscience News", "description": "People with long COVID have abnormal brain activity during memory tests, months after their initial COVID-19 infection, with less activity in the regions normally used for memory tasks, but more activity in other areas of the brain. Although people who had CO…", "url": "https://neurosciencenews.com/brain-function-long-covid-23121/", "urlToImage": "https://neurosciencenews.com/files/2023/04/long-covid-brain-neurosicences.jpg", "publishedAt": "2023-04-26T22:13:00Z", "content": "Summary: People with long COVID have abnormal brain activity during memory tests, months after their initial COVID-19 infection, with less activity in the regions normally used for memory tasks, but … [+4610 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Correlation Between Social Vulnerability and Elevated Suicide Risks Discovered - Neuroscience News", "description": "Social determinants of health are linked to suicide risk, with the suicide rate nearly doubling between the least and most socially vulnerable counties. The study proposes several public health and economic policies that could reduce suicide rates by targetin…", "url": "https://neurosciencenews.com/suicide-risk-social-vulnerability-23118/", "urlToImage": "https://neurosciencenews.com/files/2023/04/social-vulnerability-suicide-neurosincnes.jpg", "publishedAt": "2023-04-26T20:55:16Z", "content": "Summary: Social determinants of health are linked to suicide risk, with the suicide rate nearly doubling between the least and most socially vulnerable counties. \r\nThe study proposes several public h… [+8541 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Glaucoma Drugs Prevent Cognitive Impairment Associated With Alzheimer’s Disease in Mice - Neuroscience News", "description": "Drugs used to treat glaucoma and high-altitude sickness may prevent cognitive impairment caused by Alzheimer's disease in mice. The research indicates that carbonic anhydrase inhibitors, already approved by the US Food and Drug Administration (FDA), promote t…", "url": "https://neurosciencenews.com/cognition-alzheimers-neuropharmacology-23116/", "urlToImage": "https://neurosciencenews.com/files/2023/04/fda-drug-alzheimers-pathology-neurosince.jpg", "publishedAt": "2023-04-26T20:17:52Z", "content": "Summary: Drugs used to treat glaucoma and high-altitude sickness may prevent cognitive impairment caused by Alzheimer’s disease in mice. The research indicates that carbonic anhydrase inhibitors, alr… [+8645 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Erica Nardozzi", "title": "I'm a dietician - these are the worst mistakes you can make when trying to lose weight - Daily Mail", "description": "Vanessa Rissetto, CEO and co-founder of Culina Health, opened up about how people can reach their health goals without going to extremes during her recent appearance on the Today show.", "url": "https://www.dailymail.co.uk/femail/article-12013209/Im-dietician-worst-mistakes-make-trying-lose-weight.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/26/02/70236023-0-image-a-85_1682474211538.jpg", "publishedAt": "2023-04-26T16:54:41Z", "content": "A registered dietician has lifted the lid on the six mistakes people make when overhauling their diets for the summer, from eliminating entire food groups to not drinking enough water. \r\nVanessa Riss… [+6023 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "Fresh pandemic fears as virologists discover bird flu spreads 'efficiently' in ferrets - Daily Mail", "description": "Experts called the discovery 'very concerning', claiming it shows the pathogen is one step closer to infecting humans. It is the first study confirming it can spread between mammals.", "url": "https://www.dailymail.co.uk/health/article-12015805/Fresh-pandemic-fears-virologists-discover-bird-flu-spreads-efficiently-ferrets.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/26/16/70261747-0-image-a-15_1682522401385.jpg", "publishedAt": "2023-04-26T16:38:27Z", "content": "Bird flu spreads 'efficiently' in ferrets, scientists have warned amid growing fears it could spark another pandemic.\r\nExperts called the discovery 'very concerning', claiming it shows that the patho… [+8174 chars]"}, {"source": {"id": null, "name": "Slipped Disc"}, "author": "norman lebrecht", "title": "Mozart is no aid in mild Alzheimers - Slippedisc - Slipped Disc", "description": "A Spanish study finds that listening to ‘classical...", "url": "https://slippedisc.com/2023/04/mozart-cannot-aid-mild-alzheimers/", "urlToImage": "https://slippedisc.com/wp-content/uploads/2013/01/mozartportraifake1.jpg", "publishedAt": "2023-04-26T14:27:20Z", "content": "A Spanish study finds that listening to ‘classical music’ does no appreciable good to with mild cognitive impairment (MCI). However, it appears they only played them Mozart.\r\nFrom the summary:\r\nGiven… [+980 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Possible links between COVID vaccine and tinnitus raise concerns - The News International", "description": "Research has suggested a possible connection between the COVID-19 vaccine and tinnitus, a condition where a person perceives sounds originating from within their body, such as a ringing in the...", "url": "https://www.thenews.com.pk/latest/1064211-possible-links-between-covid-vaccine-and-tinnitus-raises-concerns", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-04-26/1064211_045812_updates.jpg", "publishedAt": "2023-04-26T11:24:25Z", "content": "Research has suggested a possible connection between the COVID-19 vaccine and tinnitus, a condition where a person perceives sounds originating from within their body, such as a ringing in the ears. … [+1580 chars]"}, {"source": {"id": "buzzfeed", "name": "Buzzfeed"}, "author": "Daniella Emanuel", "title": "14 Unusual Body Discoveries You Need to See - BuzzFeed", "description": "You probably didn't know that you can get stitches in your eye, but now you do.", "url": "https://www.buzzfeed.com/daniellaemanuel/unusual-body-discoveries", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2023-04/24/23/enhanced/3e3aa2b49c58/original-1789-1682377614-8.jpg?crop=1250:655;0,47%26downsize=1250:*", "publishedAt": "2023-04-26T07:16:03Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Gray Matter Volume Linked to Language Deficits in Autism - Neuroscience News", "description": "Children with Autism Spectrum Disorder (ASD) who have language impairment show lower gray matter volume and greater gyrification in the temporal and frontal lobes of the cerebral cortex, which are crucial for language function. The study's findings could help…", "url": "https://neurosciencenews.com/asd-language-gray-matter-23112/", "urlToImage": "https://neurosciencenews.com/files/2023/04/gray-matter-volume-asd-language.jpg", "publishedAt": "2023-04-26T06:44:00Z", "content": "Summary: Children with Autism Spectrum Disorder (ASD) who have language impairment show lower gray matter volume and greater gyrification in the temporal and frontal lobes of the cerebral cortex, whi… [+6192 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Food for Thought: Nutrient Intake Linked to Cognition and Healthy Brain Aging - Neuroscience News", "description": "A new study reveals that nutrient intake, brain structure and cognitive function jointly contribute to brain health in older adults. The research discovered that blood markers of certain fatty acids are linked with better memory and larger brain structures in…", "url": "https://neurosciencenews.com/nutrition-cognition-brain-aging-23110/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-aging-nutrition-cognition-neurosicenw-public.jpg", "publishedAt": "2023-04-25T23:37:56Z", "content": "Summary: A new study reveals that nutrient intake, brain structure and cognitive function jointly contribute to brain health in older adults. The research discovered that blood markers of certain fat… [+6728 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Depression and Anxiety Linked to Accelerated Biological Aging in Adults - Neuroscience News", "description": "Adults with advanced biological age are at a higher risk of depression and anxiety, according to a study that found participants with older biological age were 6% more likely to develop these mental health conditions at the 8.7-year follow-up compared to thos…", "url": "https://neurosciencenews.com/mental-health-accelerated-age-23104/", "urlToImage": "https://neurosciencenews.com/files/2023/04/accelerated-aging-depression-neurosicences-public.jpg", "publishedAt": "2023-04-25T21:04:42Z", "content": "Summary: Adults with advanced biological age are at a higher risk of depression and anxiety, according to a study that found participants with older biological age were 6% more likely to develop thes… [+7195 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/jillian-kubala-ms-rd", "title": "Is Decaf Coffee Good For You? How It Compares To Regular - mindbodygreen", "description": "Yes, decaf is chock-full of health benefits too.", "url": "https://www.mindbodygreen.com/articles/is-decaf-coffee-good-for-you", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_0,w_2300,h_1535/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/4njob8trlkhkw71wg.jpg", "publishedAt": "2023-04-25T19:05:43Z", "content": "Even though all of these methods are considered safe, the water-only methodalso known as the Swiss water process1\r\nis solvent-free and is the preferred method used to make organic decaf coffee. \r\nThe… [+472 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Now Ozempic patients say they're going BALD while on fat-loss shot - Daily Mail", "description": "Patients taking Ozempic and Wegovy say their hair is starting to fall out. Doctors in the US are not clear on what is causing the side effect, but say that it has been linked to rapid weight loss.", "url": "https://www.dailymail.co.uk/health/article-12000533/Now-Ozempic-patients-say-theyre-going-BALD-fat-loss-shot.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/25/18/70220005-0-image-a-29_1682442160724.jpg", "publishedAt": "2023-04-25T16:41:42Z", "content": "Patients using the blockbuster weight-loss drugs Ozempic and Wegovy say their hair has started to fall out in clumps.\r\nAn American TikToker who lost 60lbs while on Ozempic was among those to reveal t… [+5053 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "The gene-therapy revolution risks stalling if we don't talk about drug pricing - Nature.com", "description": "Regulation and new intellectual property laws are needed to reduce the cost of gene-editing treatments and fulfil their promise to improve human health.", "url": "https://www.nature.com/articles/d41586-023-01389-z", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01389-z/d41586-023-01389-z_25274928.jpg", "publishedAt": "2023-04-25T15:04:04Z", "content": "A gene-editing therapy to correct deformed red blood cells in sickle-cell disease is in the works but at what cost?Credit: Eric Grave/SPL\r\nWe wish to suggest a structure for the salt of deoxyribose n… [+7267 chars]"}]}