{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Therapeutic Target for Glaucoma Discovered - Neuroscience News", "description": "Restoring mitochondrial homeostasis in diseased neurons can protect the optic nerve from being damaged and potentially reverse symptoms of glaucoma.", "url": "https://neurosciencenews.com/mitochondria-glaucoma-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/gaulcoma-target-neurosicences-public.jpg", "publishedAt": "2023-03-10T21:50:38Z", "content": "Summary: Restoring mitochondrial homeostasis in diseased neurons can protect the optic nerve from being damaged and potentially reverse symptoms of glaucoma.\r\nSource: Indiana University\r\nIndiana Univ… [+4706 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "An Association Between Autism in Children and Cardiometabolic Diseases - Neuroscience News", "description": "As many as 1 in 44 children are diagnosed with autism, and those with ASD are at greater risk of obesity. Obesity has been linked to an increased risk of diabetes and other cardiometabolic diseases, including dyslipidemia. Researchers say physicians should mo…", "url": "https://neurosciencenews.com/asd-cardiometabolic-disease-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/asd-cardiometabolic-disease-neurosinces-public.jpg", "publishedAt": "2023-03-10T21:06:38Z", "content": "Summary: As many as 1 in 44 children are diagnosed with autism, and those with ASD are at greater risk of obesity. Obesity has been linked to an increased risk of diabetes and other cardiometabolic d… [+8981 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Astrocyte Cells Critical for Learning Skilled Movements - Neuroscience News", "description": "Study reveals two specific ways in which astrocytes directly impact motor learning.", "url": "https://neurosciencenews.com/astrocyte-motor-learning-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/astrocytes-learning-neurosciences-public.jpg", "publishedAt": "2023-03-10T20:42:39Z", "content": "Summary: Study reveals two specific ways in which astrocytes directly impact motor learning.\r\nSource: Picower Institute for Learning and Memory\r\nFrom steering a car to swinging a tennis racket, we le… [+7045 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Ancient dormant viruses found in permafrost, once revived, can infect amoeba - Phys.org", "description": "A team of climate scientists from France, Russia and Germany has found that ancient viruses dormant for tens of thousands of years in permafrost can infect modern amoeba when they are revived. For their study, reported on the open-access site Viruses, the gro…", "url": "https://phys.org/news/2023-03-ancient-dormant-viruses-permafrost-revived.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ancient-dormant-viruse.jpg", "publishedAt": "2023-03-10T18:30:01Z", "content": "A team of climate scientists from France, Russia and Germany has found that ancient viruses dormant for tens of thousands of years in permafrost can infect modern amoeba when they are revived. For th… [+2569 chars]"}, {"source": {"id": null, "name": "Runner's World (UK)"}, "author": null, "title": "Strength training beginners - Runner's World", "description": "New to lifting? Let these tips guide you towards a successful workout and better performance on the run", "url": "https://www.runnersworld.com/uk/training/cross-training/a43272395/strength-training-for-beginners/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/strength-training-for-beginners-640b6560662b8.jpg?crop=1.00xw:0.669xh;0,0.167xh&resize=1200:*", "publishedAt": "2023-03-10T17:33:47Z", "content": "When it comes to making strides, runners are, more often than not, laser-focused on adding mileage. That’s not a bad approach – more miles are one way of becoming a better runner. But there’s more yo… [+6742 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Could an Ancient Virus Be a Genetic Driver of Autism? - Neuroscience News", "description": "Genome and transcriptome analysis revealed BTBR autism mouse models have increased levels of endogenous retrovirus genes. BTBR/R models of ASD showed differences in the expression of a variety of genes that are indicative of endogenous retrovirus activation. …", "url": "https://neurosciencenews.com/retrovirus-asd-genetics-22755/", "urlToImage": "https://neurosciencenews.com/files/2023/03/ancient-dna-asd-neurosciencen-public.jpg", "publishedAt": "2023-03-10T09:56:04Z", "content": "Summary: Genome and transcriptome analysis revealed BTBR autism mouse models have increased levels of endogenous retrovirus genes. BTBR/R models of ASD showed differences in the expression of a varie… [+6972 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Nitrate in Tap and Bottled Drinking Water May Be a Risk Factor for Prostate Cancer - SciTechDaily", "description": "Nitrate is present in tap water and bottled water, largely due to the use of fertilizer in agriculture and the manure produced by intensive livestock farming. The nitrate ingested over the course of a person’s adult lifetime through the consumption of tap wat…", "url": "https://scitechdaily.com/warning-nitrate-in-tap-and-bottled-drinking-water-may-be-a-risk-factor-for-prostate-cancer/", "urlToImage": "https://scitechdaily.com/images/No-Bottled-Water.jpg", "publishedAt": "2023-03-10T09:21:49Z", "content": "Nitrate is commonly found in tap water and bottled water as a result of agricultural fertilizers and intensive livestock farming. Consuming nitrate through water consumption over a lifetime may incre… [+8415 chars]"}, {"source": {"id": null, "name": "Unherd.com"}, "author": "Katherine Dee", "title": "Zach Willmore: TikTok's new HIV 'influencer' - The Post - UnHerd", "description": "Zach Willmore is an LGBT TikTok influencer whose bright and bubbly style draws a sharp contrast with other creators on the platform. Often appearing with a cheerleader’s somersault and a blinding smile, he is a departure from the dark and dour late-millennial…", "url": "http://unherd.com/thepost/zach-willmore-tiktoks-latest-hiv-influencer/", "urlToImage": "https://unherd.com/wp-content/uploads/2023/03/Screenshot-2023-03-09-at-17.21.03.png", "publishedAt": "2023-03-09T18:10:47Z", "content": "The creator is one of many documenting their journey with the virus\r\nZach Willmore is an LGBT TikTok influencer whose bright and bubbly style draws a sharp contrast with other creators on the platfor… [+3725 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "'Comparable to statins': The type of milk that could significantly lower cholesterol - Express", "description": "Research suggests the main ingredient in this milk could lower high cholesterol by a whopping 70 percent.", "url": "https://www.express.co.uk/life-style/health/1744262/high-cholesterol-lower-diet-soya-milk", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4614456.jpg?r=1678360999668", "publishedAt": "2023-03-09T11:17:00Z", "content": null}]}