{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Damian Carrington", "title": "Fungal attacks threaten global food supply, say experts - The Guardian", "description": "Climate crisis is exacerbating damage caused by crop-destroying fungi, risking ‘global health catastrophe’", "url": "https://www.theguardian.com/science/2023/may/03/fungal-attacks-threaten-global-food-supply-say-experts", "urlToImage": "https://i.guim.co.uk/img/media/ed0e16a92003aec136e4e8611c30d5beaf72dc48/0_176_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a17076f877988131b1daa859bd019b62", "publishedAt": "2023-05-03T12:23:00Z", "content": "Fast-rising fungal attacks on the worlds most important crops threaten the planets future food supply, scientists have said, warning that failing to tackle fungal pathogens could lead to a global hea… [+9119 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Double Danger for Young Women: High Risk of Rehospitalization After Heart Attack - SciTechDaily", "description": "NIH-supported findings identify risk factors in women and suggest the need for closer monitoring. A study funded by the National Institutes of Health shows that women aged 55 and younger are nearly twice as likely to be rehospitalized within a year of a heart…", "url": "https://scitechdaily.com/?p=273871", "urlToImage": "https://scitechdaily.com/images/Woman-Heart-Attack.jpg", "publishedAt": "2023-05-03T08:23:40Z", "content": "Women aged 55 and younger face nearly twice the risk of rehospitalization in the year following a heart attack compared to similarly aged men, as per a study supported by the National Institutes of H… [+6262 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Low carb diets INCREASE your risk of an early death - Daily Mail", "description": "Harvard University, in Cambridge, Massachusetts, researchers were a part of a study that compared whether low fat or low carb diets could expand a person's lifespan.", "url": "https://www.dailymail.co.uk/health/article-12038715/Low-carb-diets-INCREASE-risk-early-death.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/02/21/70501687-0-image-a-4_1683060516362.jpg", "publishedAt": "2023-05-03T07:01:46Z", "content": "It's a debate that has raged on for years in health circles what's worse, fat or sugar?\r\nIn the late 20th century and early 2000s, fat was vilified after routinely being linked to heart disease and h… [+4598 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Healthier Diet and Exercise Linked to Heart Health, While Skipping Meals and Diet Pills Fail for Weight Loss - Neuroscience News", "description": "A recent study on more than 20,000 U.S. adults indicates that individuals adopting healthier diets and exercising more were linked to weight loss that reduces the risk of heart disease. In contrast, those who skipped meals or took prescription diet pills saw …", "url": "https://neurosciencenews.com/weight-loss-heart-healt-23166/", "urlToImage": "https://neurosciencenews.com/files/2023/05/diet-behavior-weight-loss-neurosicences.jpg", "publishedAt": "2023-05-02T23:12:23Z", "content": "Summary: A recent study on more than 20,000 U.S. adults indicates that individuals adopting healthier diets and exercising more were linked to weight loss that reduces the risk of heart disease. In c… [+9752 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Harnessing Psilocybin to Treat PTSD - Neuroscience News", "description": "Psilocybin, the active ingredient in magic mushrooms, can restore fear extinction and help treat post-traumatic stress disorder (PTSD). The study found that psilocybin promotes the growth of new neurons and synapses in the hippocampus, a brain region involved…", "url": "https://neurosciencenews.com/ptsd-psychedelic-psilocybin-pharmacology-23158/", "urlToImage": "https://neurosciencenews.com/files/2023/05/ptsd-psilocybin-neurosicens.jpg", "publishedAt": "2023-05-02T20:46:33Z", "content": "Summary: Psilocybin, the active ingredient in magic mushrooms, can restore fear extinction and help treat post-traumatic stress disorder (PTSD). The study found that psilocybin promotes the growth of… [+8163 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Happy Music Could Combat Effects of Cybersickness - Neuroscience News", "description": "Listening to music could reduce symptoms of cybersickness, which can cause dizziness, nausea and headaches when using virtual reality devices. The study discovered that joyful music significantly decreased the overall intensity of cybersickness, while both jo…", "url": "https://neurosciencenews.com/cybersickness-music-23157/", "urlToImage": "https://neurosciencenews.com/files/2023/05/music-cybersickness-neurosicnes.jpg", "publishedAt": "2023-05-02T20:23:44Z", "content": "Summary: Listening to music could reduce symptoms of cybersickness, which can cause dizziness, nausea and headaches when using virtual reality devices. The study discovered that joyful music signific… [+5359 chars]"}, {"source": {"id": null, "name": "Pasadena Now"}, "author": null, "title": "Autism: Separating Fact from Fiction – Pasadena Weekendr - Pasadena Now", "description": "According to the Centers for Disease Control and Prevention, about 1 in 36 children has been identified with autism spectrum disorder (ASD) based to estimates from the CDC’s Autism and Developmental Disabilities Monitoring Network. Having a better understandi…", "url": "https://www.pasadenanow.com/weekendr/autism-separating-fact-from-fiction/", "urlToImage": "https://www.pasadenanow.com/weekendr/wp-content/uploads/2023/05/Family.jpg", "publishedAt": "2023-05-02T20:06:33Z", "content": "Thanks to additional research and treatment options today, if a child has been diagnosed with autism, they can still live productive and rewarding lives with proper behavioral and medical treatment.\r… [+2755 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "My baby will never walk or talk after being born with rare brain disease - Daily Mail", "description": "Lucy Landman, now one, from California, has been diagnosed with a rare brain condition that pushes her development 'off a cliff'. Parents are currently fundraising to develop a treatment.", "url": "https://www.dailymail.co.uk/health/article-12038115/My-baby-never-walk-talk-born-rare-brain-disease.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/02/18/70493037-0-image-a-29_1683047110691.jpg", "publishedAt": "2023-05-02T18:45:25Z", "content": "A mother has revealed how her baby will never walk or talk because of a brain disease that affects just 30 people in the world.\r\nLucy Landman, now one, has been diagnosed with Mabry Syndrome, a genet… [+6182 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "MDMA use in humans is not associated with severe white matter lesions, study finds - PsyPost", "description": "It is widely known that doing drugs can cause neurological impairments, but it can be difficult to know why. A study published in NeuroImage: Clinical provides evidence that chronic MDMA may not cause white matter lesions that are seen from long-term use of o…", "url": "https://www.psypost.org/2023/05/mdma-use-in-humans-is-not-associated-with-severe-white-matter-lesions-study-finds-80253", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/03/mri-brain-imaging-scans.jpg", "publishedAt": "2023-05-02T17:04:31Z", "content": "It is widely known that doing drugs can cause neurological impairments, but it can be difficult to know why. A study published in NeuroImage: Clinical provides evidence that chronic MDMA may not caus… [+3385 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rebecca Whittaker", "title": "The simple breathing trick that scientists say could slash your risk of Alzheimer's - Daily Mail", "description": "A simple breathing exercise can benefit your brain by slashing the number of toxic proteins in your blood. Scientists say this could reduce your risk of Alzheimer's disease.", "url": "https://www.dailymail.co.uk/health/article-12037655/The-simple-breathing-trick-scientists-say-slash-risk-Alzheimers.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/02/16/70490213-0-image-a-4_1683042637481.jpg", "publishedAt": "2023-05-02T16:09:00Z", "content": "It's one of the cruellest diseases known to mankind, slowly robbing sufferers of all their memories until they can no longer function.\r\nBut scientists now claim there's a simple trick that could, the… [+5923 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "New COVID-19 Variant Could Be Giving People \"Pink Eye\", Claims LA County - IFLScience", "description": "It's a rare but possible symptom of the new variant.", "url": "https://www.iflscience.com/new-covid-19-variant-could-be-giving-people-pink-eye-claims-la-county-68713", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68713/aImg/67606/pink-eye-meta.jpg", "publishedAt": "2023-05-02T14:09:55Z", "content": "XBB.1.16 Arcturus, a new COVID-19 variant that appears to be more infectious than previous strains, has been confirmed in Los Angeles and comes with a strange new symptom that was previously extremel… [+1846 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "John Ely Senior", "title": "Miracle new slimming jabs may leave you with jowls - Daily Mail", "description": "Game-changing weight loss jabs are driving a surge in patients seeking to fix their faces after weekly slimming injections eliminate facial fat as well, leaving people looking like 'chemo patients'.", "url": "https://www.dailymail.co.uk/health/article-12036945/Miracle-new-slimming-jabs-leave-jowls.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/02/13/70482351-0-image-a-19_1683031744753.jpg", "publishedAt": "2023-05-02T12:18:52Z", "content": "Miracle new weight loss jabs are sparking a surge for facelifts, with Brits left 'gaunt' after beating the bulge.\r\nCosmetic doctors based in London have reported an influx of patients demanding tight… [+7115 chars]"}, {"source": {"id": null, "name": "HuffPost UK"}, "author": "Adrianne Webster", "title": "These Are The Five Melanoma Signs Everyone Needs To Know - HuffPost UK", "description": "This simple alphabet trick will help you remember.", "url": "https://www.huffingtonpost.co.uk/entry/signs-and-symptoms-of-melanoma-skin-cancer_uk_6450f69ce4b03c1b88cf415d", "urlToImage": "https://img.huffingtonpost.com/asset/6450f8931f00002e0028fd87.jpeg?ops=1200_630", "publishedAt": "2023-05-02T12:09:55Z", "content": "Skin cancer cases are on the rise in the UK, with Cancer Research UK projecting that there could be around 26,500 new cases of melanoma the more deadly type of cancer by 2038-2040.\r\nTo put that into … [+5106 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Adeela Crown", "title": "Ask Adeela: should I have Botox? - Financial Times", "description": "All you need to know about one of the beauty industry’s most controversial procedures", "url": "https://www.ft.com/content/2795e767-0168-4059-bfef-f875bffcf859", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F89c4837e-0e0e-418c-9bad-2b14bd15866c.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2023-05-02T08:47:26Z", "content": "Im often asked if I recommend Botox. My answer? It can be great, if used judiciously.\r\nWhat is it?Botulinum toxin was first harnessed by scientists in the 70s to treat strabismus (crossed eyes) and, … [+6314 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Ieva Pečiulytė", "title": "84 People Share The First Signs Of Cancer, Based On Their Personal Experience - Bored Panda", "description": "Talking about illness is not easy; however, it helps to raise awareness and emphasizes things that shouldn’t be overlooked when it comes to health. And even though no two stories are the same, some symptoms are specific to certain illnesses, which is why lear…", "url": "https://www.boredpanda.com/sharing-warning-signs-of-cancer/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/sharing-warning-signs-of-cancer-fb-6450f4a2a876a__700-png.jpg", "publishedAt": "2023-05-02T08:01:53Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Megan Rossi", "title": "It's better to have a little sugar than any sweetener at all, says Gut Health Guru Dr Megan Rossi - Daily Mail", "description": "DR MEGAN ROSSI: Sweeteners are between 200 and 20,000 times sweeter than sugar, so most of them come with fillers to bulk them out.", "url": "https://www.dailymail.co.uk/health/article-12034149/Its-better-little-sugar-sweetener-says-Gut-Health-Guru-Dr-Megan-Rossi.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/18/70443681-0-image-a-17_1682962206700.jpg", "publishedAt": "2023-05-01T19:24:07Z", "content": "Let me be frank about added sugar yes it tastes good, but the reality is that most of us are having far too much of it.\r\nNot only does it add calories without any nutritional benefits, but excess con… [+9445 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Martin Scurr", "title": "Dr Martin Scurr: Why have I had a runny nose for 30 years - and what can I do to make it stop? - Daily Mail", "description": "DR MARTIN SCURR: Having a constantly dripping nose is a common problem, affecting around one person in ten.", "url": "https://www.dailymail.co.uk/health/article-12034099/Dr-Martin-Scurr-runny-nose-30-years-make-stop.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/17/70442263-0-image-a-11_1682959534032.jpg", "publishedAt": "2023-05-01T19:17:36Z", "content": "My nose drips all year round summer and winter, in warm weather and cold, whether I'm inside or out. I've had this problem for years and it is embarrassing. Is there anything I can do?\r\nJess Webster,… [+5790 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Leslie Barrie", "title": "9 Tips for a Healthier Quesadilla - Everyday Health", "description": "From choosing the right tortilla to filling it with good-for-you veggies, discover how you can make nutritious and delicious quesadillas according to registered dietitian-nutritionists.", "url": "https://www.everydayhealth.com/diet-nutrition/easy-ways-to-make-a-healthier-quesadilla/", "urlToImage": "https://images.everydayhealth.com/images/tips-for-making-a-healthier-quesadilla-1440x810.jpg?sfvrsn=b44cadf4_1", "publishedAt": "2023-05-01T19:17:08Z", "content": "After a busy day, one of the easiest meals to whip up quickly is quesadillas. Thats because the most basic quesadillas require just a few ingredients. Not to mention, quesadillas are often crowd-plea… [+8603 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rachel Ellis", "title": "Have scientists finally created a jab to keep ALL flu strains at bay? - Daily Mail", "description": "The annual flu vaccine currently protects against four strains of the virus which scientists believe are most likely to be in circulation in the coming winter.", "url": "https://www.dailymail.co.uk/health/article-12034403/Have-scientists-finally-created-jab-flu-strains-bay.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/19/70444899-0-image-a-14_1682965659946.jpg", "publishedAt": "2023-05-01T19:00:24Z", "content": "A universal vaccine that protects against all strains of the flu virus may be a step closer.\r\nThe annual flu vaccine currently protects against four strains of the virus which scientists believe are … [+4455 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Justine Hancock Good", "title": "Can the Keto diet help mental illness? US tech billionaire's Matt Baszucki found diet helped bipolar - Daily Mail", "description": "Matt Baszucki (right), 26, was diagnosed with bipolar disorder at 19\nand prescribed 29 different drugs over five years. He found that the Keto diet really helped with the disorder.", "url": "https://www.dailymail.co.uk/health/article-12034257/Can-Keto-diet-help-mental-illness-tech-billionaires-Matt-Baszucki-diet-helped-bipolar.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/18/70444345-0-image-a-13_1682963696594.jpg", "publishedAt": "2023-05-01T19:00:08Z", "content": "Matt Baszucki is a musician and tech professional living in San Francisco. At just 26, he could be expected to be leading a certain kind of life as befits his age and profession.\r\nInstead, every morn… [+18578 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "Daily Mail", "title": "Your tampon may cause cancer - states are stepping in with laws mandating disclosure of ingredients - Daily Mail", "description": null, "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvaGVhbHRoL2FydGljbGUtMTIwMzQwMDkvWW91ci10YW1wb24tY2F1c2UtY2FuY2VyLXN0YXRlcy1zdGVwcGluZy1sYXdzLW1hbmRhdGluZy1kaXNjbG9zdXJlLWluZ3JlZGllbnRzLmh0bWzSAQA?oc=5", "urlToImage": null, "publishedAt": "2023-05-01T17:45:26Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Cryptic Covid strains found in 13 states, including California, New York - Daily Mail", "description": "A scientists at the University of Missouri is leading the hunt for 'cryptic lineages' of Covid. These cases emerge in people that are carrying to virus for long periods of time with limited symptoms.", "url": "https://www.dailymail.co.uk/health/article-12033637/Cryptic-Covid-strains-13-states-including-California-New-York.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/19/70445233-0-image-a-117_1682966066253.jpg", "publishedAt": "2023-05-01T17:25:16Z", "content": "More than 30 extremely mutated, never-before-seen Covid strains are lurking in multiple US states, DailyMail.com can reveal. \r\nA team of scientists from the University of Missouri has been tracking t… [+8468 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Transforming tuberculosis diagnosis - Nature.com", "description": "Diagnosis is the weakest aspect of tuberculosis (TB) care and control. We describe seven critical transitions that can close the massive TB diagnostic gap and enable TB programmes worldwide to recover from the pandemic setbacks.", "url": "https://www.nature.com/articles/s41564-023-01365-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41564-023-01365-3/MediaObjects/41564_2023_1365_Fig1_HTML.png", "publishedAt": "2023-05-01T15:28:11Z", "content": "The crucial importance of simple, easy-to-collect samples to expanded testing and case finding was brought home by the COVID-19 pandemic. When nasopharyngeal swabs, which required skilled healthcare … [+3201 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Biobank-scale inference of ancestral recombination graphs enables genealogical analysis of complex traits - Nature.com", "description": "ARG-Needle is a method to infer genome-wide genealogies from large-scale genotyping data that can be used in association analyses. Applied to UK Biobank data, genealogy-based testing finds more trait associations than using imputed genotypes.", "url": "https://www.nature.com/articles/s41588-023-01379-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01379-x/MediaObjects/41588_2023_1379_Fig1_HTML.png", "publishedAt": "2023-05-01T15:16:49Z", "content": "ARG-Needle and ASMC-clust algorithms\r\nWe introduce two algorithms to construct the ARG of a set of samples, called ARG-Needle and ASMC-clust. Both approaches leverage output from the ASMC algorithm11… [+24030 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Doctors thought I was morbidly obese from eating too much. It turns out I had ovarian cysts - Daily Mail", "description": "Jess Cisco, 32, a mental health nurse in Columbus, Ohio, spent a whole year dieting and exercising but did not lose a single one of her 245lbs. It was then that doctors revealed she had ovarian cysts.", "url": "https://www.dailymail.co.uk/health/article-12033385/Doctors-thought-morbidly-obese-eating-turns-ovarian-cysts.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/01/14/70433481-0-image-a-15_1682949189031.jpg", "publishedAt": "2023-05-01T14:52:39Z", "content": "A morbidly obese woman in Ohio couldn't lose weight despite dieting and exercising has revealed the surprising diagnosis curbing her fat loss.\r\nJess Cisco, who weighed 245lbs at her peak, spent 12 mo… [+4332 chars]"}]}