{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Common Seizure Drug Blocks Deadly Brain Cancer Growth - Neuroscience News", "description": "Researchers discovered that the drug gabapentin, commonly used to prevent seizures, could inhibit this activity in mice with glioblastoma.", "url": "https://neurosciencenews.com/glioblstoma-cancer-brain-neuropharmacology-23224/", "urlToImage": "https://neurosciencenews.com/files/2023/05/brain-cancere-neuropharmacology-neurosicence.jpg", "publishedAt": "2023-05-12T17:43:42Z", "content": "Summary: Researchers discovered a promising new avenue for treating glioblastoma, a deadly brain cancer.\r\nThe study found that these tumors restructure connections in surrounding brain tissue, leadin… [+8101 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "Scientists find bat protein that can slow aging and even fight Covid, heart disease and arthritis - Daily Mail", "description": "Bats live for around 20 years and are unharmed from pathogens deadly to humans such as Ebola and Covid. This has led scientists to investigate if their resilience can work for humans too.", "url": "https://www.dailymail.co.uk/health/article-12074441/Scientists-bat-protein-slow-aging-fight-Covid-heart-disease-arthritis.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/12/15/70910629-0-image-a-7_1683900694026.jpg", "publishedAt": "2023-05-12T15:06:13Z", "content": "A protein from bats could contain the key to slowing human aging and fight off conditions like Covid, heart disease and arthritis, a study suggests.\r\nBats live for around 20 years on average, and are… [+3670 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Researchers may have found a way to treat long-COVID fatigue - Interesting Engineering", "description": "Researchers have shed light on one of the most common side effects of COVID-19: fatigue. They may indeed have a treatment for this debilitating condition.", "url": "https://interestingengineering.com/health/way-to-treat-long-covid-fatigue", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/05/12/image/jpeg/4vxCXHK1L8AoQNvcK4hW8nnTWIr5nyOIsfFP2vG7.jpg", "publishedAt": "2023-05-12T14:11:00Z", "content": "Were examining a non-invasive method which involves clipping an earpiece to the tragus on the ear and delivering small electrical currents to the vagus nerve using a TENS machine familiar to many thr… [+1636 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "3 high protein recipes for fat loss, from sports nutritionist - Insider", "description": "\"The Ultimate High Protein Handbook\" is full of easy recipes that everyone will enjoy to help you lose fat, maintain muscle, and curb cravings.", "url": "https://www.insider.com/high-protein-recipes-for-fat-loss-muscle-gain-sports-nutritionist-2023-5", "urlToImage": "https://i.insider.com/645bc15ad391de0019bd646e?width=1200&format=jpeg", "publishedAt": "2023-05-11T17:22:00Z", "content": "Eating a high protein diet is crucial for fat loss and muscle maintenance, but that doesn't mean only eating plain chicken, hard-boiled eggs, and protein shakes.\r\nSports nutritionist, weight loss coa… [+6419 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Jonathan R. Goodman", "title": "Psychopaths: why they've thrived through evolutionary history – and how that may change - PsyPost", "description": "From an evolutionary point of view, psychopathy is puzzling. Given that psychopathic traits are so negative, why do they remain in successive generations? Assuming there’s a genetic component to this family of disorders, we’d expect it to decrease over time. …", "url": "https://www.psypost.org/2023/05/psychopaths-why-theyve-thrived-through-evolutionary-history-and-how-that-may-change-159763", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/04/dark-evil-psychopathic-businessman.jpg", "publishedAt": "2023-05-11T16:05:50Z", "content": "When you start to notice them, psychopaths seem to be everywhere. This is especially true of people in powerful places. By one estimate, as many as 20% of business leaders have clinically relevant le… [+6305 chars]"}, {"source": {"id": null, "name": "HuffPost UK"}, "author": "Sarah-Louise Kelly", "title": "Yet Another Victorian Disease Is Making A Comeback In The UK – This Is Why - HuffPost UK", "description": "\"It is clear that when [vaccine] uptake falls, infections rise,\" said Steve Russell of the NHS.", "url": "https://www.huffingtonpost.co.uk/entry/why-is-measles-on-the-rise-again-in-the-uk_uk_645ccd97e4b018d846bc0d56", "urlToImage": "https://img.huffingtonpost.com/asset/645cd0c21f000015039c071d.jpeg?ops=1200_630", "publishedAt": "2023-05-11T11:34:59Z", "content": "Not only are tuberculosis rates surging for the first time in over 20 years, but the government is now urging parents to ensure children are up to date with MMR vaccinations as theres been a rise in … [+2704 chars]"}]}