{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Lillian Gissen", "title": "Doctor reveals what your TONGUE says about your health - Daily Mail", "description": "Dr. Siobhan Deshauer, a rheumatology specialist from Canada, broke down the various things that she can determine about a patient's body - just based off the way their tongue looks and acts.", "url": "https://www.dailymail.co.uk/femail/article-12034401/Doctor-reveals-TONGUE-says-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/03/13/70528403-0-image-a-27_1683118224859.jpg", "publishedAt": "2023-05-06T17:51:05Z", "content": "A doctor has shared all the things that your tongue can reveal about your health - from how the color and coating can tell you when you're sick to certain things you should look out for that can pose… [+12501 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Breaking the Darkness: Reactivating Dormant Cells in the Retina Brings New Hope for Vision Regeneration - Neuroscience News", "description": "Researchers discovered a way to reactivate dormant cells in the retina of mice to restore vision, without the need for transplantation.", "url": "https://neurosciencenews.com/vision-restoration-genetic-23183/", "urlToImage": "https://neurosciencenews.com/files/2023/05/vision-restoration-neurosnc.jpg", "publishedAt": "2023-05-06T14:36:59Z", "content": "Summary: Researchers discovered a way to reactivate dormant cells in the retina of mice to restore vision, without the need for transplantation. \r\nThe team discovered dormant glial cells can be trans… [+5526 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Boost: Special Omega-3 Fatty Acid Lipid's Key Role in Aging Uncovered - SciTechDaily", "description": "Researchers have discovered that the transporter protein Mfsd2a is critical for regulating brain cells that maintain myelin sheaths, which protect nerves. This discovery could help reduce the effects of aging on the brain and lead to therapies for neurologica…", "url": "https://scitechdaily.com/brain-boost-special-omega-3-fatty-acid-lipids-key-role-in-aging-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-With-Myelinated-Axons.jpg", "publishedAt": "2023-05-06T10:38:59Z", "content": "ByDuke-NUS Medical SchoolMay 6, 2023\r\nThe developing preclinical models brain with myelinated axons (shown in green color). Scientists from Singapore have discovered the crucial role of a transporter… [+6250 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Michael Mosley", "title": "From eating dairy and spicy food to doing squats simple steps to speed up metabolism - Daily Mail", "description": "People often tell me that, despite eating healthily, they continue to put on weight - and they wonder if this could be because their metabolism has slowed down.", "url": "https://www.dailymail.co.uk/columnists/article-12053043/From-eating-dairy-spicy-food-doing-squats-simple-steps-speed-metabolism.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/06/01/70639291-0-image-a-80_1683332441965.jpg", "publishedAt": "2023-05-06T00:21:30Z", "content": "People often tell me that, despite eating healthily, they continue to put on weight and they wonder if this could be because their metabolism has slowed down.\r\nThough Ive long been sceptical about th… [+8578 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Louise Allingham", "title": "Get health doctor Megan Rossi reveals how to get rid of bad garlic bread by eating an apple - Daily Mail", "description": "Gut health doctor Megan Rossi has revealed a simple hack for eliminating smelly garlic breath. The doctor also raved about the health benefits of garlic and why you should leave it to stand before cooking.", "url": "https://www.dailymail.co.uk/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/02/70601017-0-image-a-27_1683249255623.jpg", "publishedAt": "2023-05-05T05:27:17Z", "content": "A top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. \r\nDr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breat… [+2808 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "The 7 Best Anti-Inflammatory Snacks for Joint Pain, According to a Dietitian - EatingWell", "description": "If you have arthritis, you might experience symptoms like joint pain. Here are 7 anti-inflammatory snacks that will help relieve your symptoms.", "url": "https://www.eatingwell.com/article/8044874/best-anti-inflammatory-snacks-for-joint-pain/", "urlToImage": "https://www.eatingwell.com/thmb/x_Dh2W8ICXFGiYQfnFqbyReHcy8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Berry-Orange-Chia-Pudding-1x1-5052-2f6803fefa86471e8b5746c3590f3b4c.jpg", "publishedAt": "2023-05-04T21:48:08Z", "content": "Review\r\nLet's have a hand for your joints: These structures give your body the flexibility and freedom to move in various ways. A normal joint function allows two or more bones to move smoothly again… [+7337 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Mother who woke up with pain on one side of her face told she had brain tumor - Daily Mail", "description": "Andreea Vanacker, from Montreal, Canada, said the sensation was so bad that she became afraid to talk, laugh or even eat. Doctors diagnosed her with a benign brain tumor.", "url": "https://www.dailymail.co.uk/health/article-12047983/Mother-woke-pain-one-face-told-brain-tumor.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/04/21/70591931-0-image-a-42_1683232812972.jpg", "publishedAt": "2023-05-04T20:53:45Z", "content": "A mother-of-two who woke up with an electric shock-like pain on the right side of her face was shocked to learn brain tumor.\r\nAndreea Vanacker, from Montreal, Canada, said the feeling emerged without… [+5132 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleeping Deeply to Remember Better: Deep Sleep Could Reduce Memory Loss in Alzheimer's - Neuroscience News", "description": "Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimer’s disease. The research indicates that superior amounts of deep sleep can act as a protective factor against memory decline …", "url": "https://neurosciencenews.com/memory-alzheimers-sleep-23173/", "urlToImage": "https://neurosciencenews.com/files/2023/05/sleep-alzheimers-neurosicences.jpg", "publishedAt": "2023-05-04T19:52:50Z", "content": "Summary: Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimers disease. The research indicates that superior amounts … [+10371 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Almost a third of schizophrenia cases in young men triggered by cannabis use - The Telegraph", "description": "Heavy use of the drug described as ‘a major public health issue’ despite an increasing number of countries embracing legalisation", "url": "https://www.telegraph.co.uk/news/2023/05/04/schizophrenia-cannabis-use-marijuana-young-men-study/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2023/05/04/TELEMMGLPICT000334415517_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?impolicy=logo-overlay", "publishedAt": "2023-05-04T19:19:00Z", "content": "Young men with a serious cannabis addiction are at increased risk of developing schizophrenia, a new study suggests.\r\nExperts estimate that nearly one third of cases of schizophrenia in 21 to 30-year… [+1744 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "What really killed COVID-19 patients: It wasn't a cytokine storm, suggests study - Medical Xpress", "description": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying machine learning to medical record data, scientists at North…", "url": "https://medicalxpress.com/news/2023-05-covid-patients-wasnt-cytokine-storm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/covid-patient.jpg", "publishedAt": "2023-05-04T19:12:45Z", "content": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying … [+4749 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "40 Frightening Scientific Facts That Folks In This Online Group Had The Misfortune To Learn - Bored Panda", "description": "The great German philosopher Friedrich Nietzsche once sagely remarked that \"if you gaze into the abyss, the abyss gazes also into you.\" Damn rightly noticed, especially when you consider that for several millennia of its existence, humanity has been actively …", "url": "https://www.boredpanda.com/scientific-fact-theory-scares-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/scientific-fact-theory-scares-you-fb19.png", "publishedAt": "2023-05-04T15:32:19Z", "content": null}]}