{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Michael Mosley", "title": "From eating dairy and spicy food to doing squats simple steps to speed up metabolism - Daily Mail", "description": "People often tell me that, despite eating healthily, they continue to put on weight - and they wonder if this could be because their metabolism has slowed down.", "url": "https://www.dailymail.co.uk/columnists/article-12053043/From-eating-dairy-spicy-food-doing-squats-simple-steps-speed-metabolism.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/06/01/70639291-0-image-a-80_1683332441965.jpg", "publishedAt": "2023-05-06T00:21:30Z", "content": "People often tell me that, despite eating healthily, they continue to put on weight and they wonder if this could be because their metabolism has slowed down.\r\nThough Ive long been sceptical about th… [+8578 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "High blood pressure in young adulthood linked to worse brain health in later life, especially for men - PsyPost", "description": "A new study has found that having high blood pressure is linked to worse brain health in later life, especially for men. The study, published in JAMA Network Open, compared brain scans of older adults who had high blood pressure in their 30s to those who had …", "url": "https://www.psypost.org/2023/05/high-blood-pressure-in-young-adulthood-linked-to-worse-brain-health-in-later-life-especially-for-men-80304", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/03/brain.jpg", "publishedAt": "2023-05-05T14:09:16Z", "content": "A new study has found that having high blood pressure is linked to worse brain health in later life, especially for men. The study, published in JAMA Network Open, compared brain scans of older adult… [+5039 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Ilona Baliūnaitė", "title": "Guy Asks If He's A Jerk For Getting In A Fight With His MIL About His Daughter Having “Real” Private Parts - Bored Panda", "description": "This redditor made sure his daughter knew how to take proper care of herself. However, to his surprise, his MIL was lacking knowledge about personal hygiene, which led to a huge fight.", "url": "https://www.boredpanda.com/mil-insists-toddler-granddaughter-private-parts-not-real/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/mil-insists-toddler-granddaughter-private-parts-not-real-fb40.png", "publishedAt": "2023-05-05T10:24:01Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Louise Allingham", "title": "Get health doctor Megan Rossi reveals how to get rid of bad garlic bread by eating an apple - Daily Mail", "description": "Gut health doctor Megan Rossi has revealed a simple hack for eliminating smelly garlic breath. The doctor also raved about the health benefits of garlic and why you should leave it to stand before cooking.", "url": "https://www.dailymail.co.uk/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/02/70601017-0-image-a-27_1683249255623.jpg", "publishedAt": "2023-05-05T05:27:17Z", "content": "A top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. \r\nDr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breat… [+2808 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Reproductive Aging May Be Slowed by SSRI Antidepressants - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/ssri-reproduction-23175/", "urlToImage": null, "publishedAt": "2023-05-04T22:01:39Z", "content": null}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "https://www.facebook.com/EatingWell/", "title": "The 7 Best Anti-Inflammatory Snacks for Joint Pain, According to a Dietitian - EatingWell", "description": "If you have arthritis, you might experience symptoms like joint pain. Here are 7 anti-inflammatory snacks that will help relieve your symptoms.", "url": "https://www.eatingwell.com/article/8044874/best-anti-inflammatory-snacks-for-joint-pain/", "urlToImage": "https://www.eatingwell.com/thmb/x_Dh2W8ICXFGiYQfnFqbyReHcy8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Berry-Orange-Chia-Pudding-1x1-5052-2f6803fefa86471e8b5746c3590f3b4c.jpg", "publishedAt": "2023-05-04T21:48:08Z", "content": "Review\r\nLet's have a hand for your joints: These structures give your body the flexibility and freedom to move in various ways. A normal joint function allows two or more bones to move smoothly again… [+7337 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Mother who woke up with pain on one side of her face told she had brain tumor - Daily Mail", "description": "Andreea Vanacker, from Montreal, Canada, said the sensation was so bad that she became afraid to talk, laugh or even eat. Doctors diagnosed her with a benign brain tumor.", "url": "https://www.dailymail.co.uk/health/article-12047983/Mother-woke-pain-one-face-told-brain-tumor.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/04/21/70591931-0-image-a-42_1683232812972.jpg", "publishedAt": "2023-05-04T20:53:45Z", "content": "A mother-of-two who woke up with an electric shock-like pain on the right side of her face was shocked to learn brain tumor.\r\nAndreea Vanacker, from Montreal, Canada, said the feeling emerged without… [+5132 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleeping Deeply to Remember Better: Deep Sleep Could Reduce Memory Loss in Alzheimer's - Neuroscience News", "description": "Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimer’s disease. The research indicates that superior amounts of deep sleep can act as a protective factor against memory decline …", "url": "https://neurosciencenews.com/memory-alzheimers-sleep-23173/", "urlToImage": "https://neurosciencenews.com/files/2023/05/sleep-alzheimers-neurosicences.jpg", "publishedAt": "2023-05-04T19:52:50Z", "content": "Summary: Deep sleep, also known as non-REM slow-wave sleep, may help reduce memory loss in older adults facing a heightened burden of Alzheimers disease. The research indicates that superior amounts … [+10371 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "What really killed COVID-19 patients: It wasn't a cytokine storm, suggests study - Medical Xpress", "description": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying machine learning to medical record data, scientists at North…", "url": "https://medicalxpress.com/news/2023-05-covid-patients-wasnt-cytokine-storm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/covid-patient.jpg", "publishedAt": "2023-05-04T19:12:45Z", "content": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying … [+4749 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "GISAID in crisis: can the controversial COVID genome database survive? - Nature.com", "description": "The most popular repository for sharing SARS-CoV-2 sequence data has come under increasing scrutiny. Scientists and funders around the world must now consider what lies ahead for the open sharing of genome data.", "url": "https://www.nature.com/articles/d41586-023-01517-9", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01517-9/d41586-023-01517-9_25316866.jpg", "publishedAt": "2023-05-04T17:56:02Z", "content": "During the COVID-19 pandemic, one online platform emerged as the main repository for viral genome data. GISAID, an initiative launched in 2008 to improve the global sharing of influenza data, earned … [+14964 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Patrick Barkham", "title": "Irises of gannets that survive avian flu turn from blue to black, study finds - The Guardian", "description": "‘Fascinating’ discovery could prove a useful non-invasive diagnostic tool to apply to other species, say scientists", "url": "https://www.theguardian.com/environment/2023/may/04/irises-of-gannets-that-survive-avian-flu-turn-from-black-study-finds", "urlToImage": "https://i.guim.co.uk/img/media/f90b06f79ebc8580d511f4687e20cc159e1d405f/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bccb50d07ec0c438631602efc9d8f791", "publishedAt": "2023-05-04T15:43:00Z", "content": "The vivid blue irises of northern gannets turn black if they survive avian flu, according to a study which provides evidence that some wild birds are shaking off the deadly virus.\r\nAvian flu has kill… [+2733 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "40 Frightening Scientific Facts That Folks In This Online Group Had The Misfortune To Learn - Bored Panda", "description": "The great German philosopher Friedrich Nietzsche once sagely remarked that \"if you gaze into the abyss, the abyss gazes also into you.\" Damn rightly noticed, especially when you consider that for several millennia of its existence, humanity has been actively …", "url": "https://www.boredpanda.com/scientific-fact-theory-scares-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/scientific-fact-theory-scares-you-fb19.png", "publishedAt": "2023-05-04T15:32:19Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Parallel sequencing of extrachromosomal circular DNAs and transcriptomes in single cancer cells - Nature.com", "description": "scEC&T-seq profiles extrachromosomal circular DNA and full-length mRNA from single human cancer cells, and may be used to interrogate heterogeneity in both cell lines and primary tumor samples.", "url": "https://www.nature.com/articles/s41588-023-01386-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01386-y/MediaObjects/41588_2023_1386_Fig1_HTML.png", "publishedAt": "2023-05-04T15:23:24Z", "content": "scEC&amp;T sequencing\r\nA detailed, step-by-step protocol of scEC&amp;T-seq is available on the Nature Protocol Exchange46 and is described below. The duration of the protocol is approximately 8days p… [+31969 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "People with more pronounced openness to experience tend to have nightmares more often - PsyPost", "description": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently. Individuals with higher levels of neuroticism, on the other…", "url": "https://www.psypost.org/2023/05/people-with-pronounced-openness-to-experience-tend-to-have-nightmares-more-often-80314", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/nightmare.jpg", "publishedAt": "2023-05-04T14:04:07Z", "content": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently.… [+4020 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "The 5-Minute Daily Workout for Women To Melt Hanging Belly Fat - Eat This, Not That", "description": "Belly fat can be eliminated through diet and exercise. A fitness pro shares a five-minute daily workout for women to melt hanging belly fat.", "url": "https://www.eatthis.com/daily-workout-for-women-to-melt-hanging-belly-fat/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/05/woman-belly-fat-concept-gym.jpg?quality=82&strip=all", "publishedAt": "2023-05-04T14:01:03Z", "content": "Picture this: You go to slip into your favorite pair of jeans only to realize they won't zip and there's some excess belly spillage, well, spilling over the waistline. A larger midsection is sometime… [+4186 chars]"}]}