{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Multi-cancer blood test shows real promise in NHS study - BBC", "description": "The Galleri test revealed the correct site of a tumour 85% of the time in a study with 5,000 patients.", "url": "https://www.bbc.com/news/health-65775159", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7495/production/_129954892_blood_test_getty.jpg", "publishedAt": "2023-06-01T23:08:46Z", "content": "A blood test for more than 50 types of cancer has shown real promise in a major NHS trial, researchers say.\r\nThe test correctly revealed two out of every three cancers among 5,000 people who had visi… [+2412 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Empathy's Influence on Drinking Patterns - Neuroscience News", "description": "A recent study reports a surprising correlation between daily affective empathy and alcohol consumption.", "url": "https://neurosciencenews.com/empathy-alcohol-consumption-23380/", "urlToImage": "https://neurosciencenews.com/files/2023/06/empathy-alcohol-neurosicence.jpg", "publishedAt": "2023-06-01T21:45:44Z", "content": "Summary: A recent study reports a surprising correlation between daily affective empathy and alcohol consumption.\r\nThe study found that on days when people experienced higher levels of affective empa… [+6351 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Sleep Apnea and Its Link to Alzheimer's Associated Brain Changes - Neuroscience News", "description": "A new study uncovers a new link between sleep apnea and brain volume in Alzheimer's susceptible regions.", "url": "https://neurosciencenews.com/sleep-apnea-alzheimers-23379/", "urlToImage": "https://neurosciencenews.com/files/2023/06/sleep-apnea-alzheimers-neurosincces.jpg", "publishedAt": "2023-06-01T21:18:50Z", "content": "Summary: A new study uncovers a new link between sleep apnea and brain volume in Alzheimer’s susceptible regions.\r\nThe study found that people with Alzheimer’s disease-linked amyloid plaques and seve… [+3784 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Getting the Skinny on Cannabis Use: The Effect of Cannabis on Weight and Metabolism - Neuroscience News", "description": "Researchers shed light on the enigma of cannabis users tending to be leaner and less diabetes-prone despite appetite stimulation.", "url": "https://neurosciencenews.com/cud-weight-metabolism-23378/", "urlToImage": "https://neurosciencenews.com/files/2023/06/cannabis-metabolism-weight-neuroosince.jpg", "publishedAt": "2023-06-01T20:52:32Z", "content": "Summary: Researchers shed light on the enigma of cannabis users tending to be leaner and less diabetes-prone despite appetite stimulation. The study shows that cannabis exposure during adolescence di… [+5646 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Unexpected Role of Immune Autoantibodies in Schizophrenia - Neuroscience News", "description": "The researchers identified autoantibodies against the synaptic protein neurexin 1α in about 2% of patients with schizophrenia.", "url": "https://neurosciencenews.com/schizophrenia-autoantibodies-23376/", "urlToImage": "https://neurosciencenews.com/files/2023/06/schizophrenia-immune-cells-neurosicnes.jpg", "publishedAt": "2023-06-01T19:53:09Z", "content": "Summary: A study reveals a connection between schizophrenia and autoimmune reactions. The researchers identified autoantibodies against the synaptic protein neurexin 1 in about 2% of patients with sc… [+5988 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "I'm a mom - here's why I give my 12-year-old breast milk - Daily Mail", "description": "Mothers have countless reasons to breastfeed their children beyond babyhood, but many feel publicly shamed into stopping. North Carolina mom Priscilla Morton is still nursing her 4 year old.", "url": "https://www.dailymail.co.uk/health/article-12141389/DM-com-explores-extended-breastfeeding-trend-mothers.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/31/23/71630961-0-image-a-62_1685573986898.jpg", "publishedAt": "2023-06-01T14:32:27Z", "content": "Most moms stop breastfeeding after just a few months, but some are bucking the trend by nursing until their children reach school age and beyond.\r\nPriscilla Morton of North Carolina told DailyMail.co… [+8966 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rebecca Whittaker", "title": "From cow's and oat to soya and almond - dietician reveals which milk is really best for health - Daily Mail", "description": "There is an overwhelming amount of choice when it comes to milk, from cow's and almond to soya and oat. Dr Duane Mellor, a top dietary researcher in the UK, told MailOnline which is best for your health.", "url": "https://www.dailymail.co.uk/health/article-12147359/From-cows-oat-soya-almond-dietician-reveals-milk-really-best-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/01/11/71647771-0-image-a-4_1685615284285.jpg", "publishedAt": "2023-06-01T12:01:50Z", "content": "Shoppers are spoilt for choice when choosing which milk to add to their shopping basket. \r\nWhile cow's milk remains Britain's favourite, all major retailers offer a range of dairy-free alternatives, … [+4664 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "Vegans are perceived as less suitable for jobs stereotypically associated with masculinity, study finds - PsyPost", "description": "Revealing you are vegan can hurt your job prospects, especially if the job is perceived as more masculine, according to new research. The study was published in the Journal of Social Psychology. ...", "url": "https://www.psypost.org/2023/06/vegans-are-perceived-as-less-suitable-for-jobs-stereotypically-associated-with-masculinity-study-finds-164217", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/vegan-man-eating-healthy-salad-sitting-indoors.jpg", "publishedAt": "2023-06-01T11:55:55Z", "content": "Revealing you are vegan can hurt your job prospects, especially if the job is perceived as more masculine, according to new research. The study was published in the Journal of Social Psychology.\r\nVeg… [+5268 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New variants of human metapneumovirus surge in Spain post-COVID, highlighting evolution and impact - News-Medical.Net", "description": "Investigating Human metapneumovirus (HMPV) prevalence, genetic diversity, and evolution in respiratory tract infections (RTIs) for better understanding and management.", "url": "https://www.news-medical.net/news/20230531/New-variants-of-human-metapneumovirus-surge-in-Spain-post-COVID-highlighting-evolution-and-impact.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_749738_16855811059639386.jpg", "publishedAt": "2023-06-01T01:36:00Z", "content": "An important aetiologic agent of upper respiratory tract infection (URTI) and lower respiratory tract infection (LRTI) in adults and children is the human metapneumovirus (HMPV). A recent Journal of … [+4582 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "People with social anxiety more likely to become overdependent on conversational artificial intelligence agents - PsyPost", "description": "A recent study examined how social anxiety, loneliness, and rumination contribute to the problematic use of conversational artificial intelligence agents. Results showed that persons high in social anxiety are more likely to feel lonely and engage in ruminati…", "url": "https://www.psypost.org/2023/05/people-with-social-anxiety-more-likely-to-become-overdependent-on-conversational-artificial-intelligence-agents-163958", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/artificial-intelligence-chat-AI.jpg", "publishedAt": "2023-05-31T19:20:33Z", "content": "A recent study examined how social anxiety, loneliness, and rumination contribute to the problematic use of conversational artificial intelligence agents. Results showed that persons high in social a… [+4849 chars]"}, {"source": {"id": null, "name": "Nutraceuticalbusinessreview.com"}, "author": "", "title": "New research identifies SAMe in human breast milk - Nutraceutical Business Review", "description": "\"It is tempting to speculate that SAMe may be a crucial nutrient in infant growth and development and may play an essential role during early stages of life\"", "url": "https://nutraceuticalbusinessreview.com/news/article_page/New_research_identifies_SAMe_in_human_breast_milk/209198", "urlToImage": "/article-image-alias/new-research-identifies-same-in-human.jpeg", "publishedAt": "2023-05-31T14:21:47Z", "content": "31-May-2023\"It is tempting to speculate that SAMe may be a crucial nutrient in infant growth and development and may play an essential role during early stages of life\"\r\nGnosis by Lesaffre (Gnosis) h… [+4499 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "More obese teens, children going under knife to lose weight: study - Geo News", "description": "The number of youth seeking surgeries surged to 19% between the years 2020 and 2021, study", "url": "https://www.geo.tv/latest/490422-more-obese-teens-children-going-under-knife-to-lose-weight-study", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-05-31/l_490422_071818_updates.jpg", "publishedAt": "2023-05-31T14:08:12Z", "content": "A new study published Tuesday has revealed that more and more US teens and children are undergoing bariatric surgeries to lose weight, making it a common and easy way to deal with the problem. \r\nThe … [+2146 chars]"}, {"source": {"id": null, "name": "Spectrum"}, "author": "Shaena Montanari", "title": "Debate remains over changes in DSM-5 a decade on - Spectrum - Autism Research News ", "description": "Changes to the DSM-5’s diagnostic criteria for autism were meant to add clarity, but instead they generated new questions.", "url": "https://www.spectrumnews.org/news/debate-remains-over-changes-in-dsm-5-a-decade-on/", "urlToImage": "https://spectrumnews-web-assets.s3.amazonaws.com/wp-content/uploads/2023/05/30121915/1200-DSM-5.jpg", "publishedAt": "2023-05-31T10:55:18Z", "content": "Just over 13 years ago, when the draft of the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) was released, debates erupted almost immediately. Many of them centere… [+13939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Botox Breakthrough – New Discovery Could Save Lives - SciTechDaily", "description": "Professor Frederic Meunier and Dr. Merja Joensuu, affiliated with the Queensland Brain Institute at The University of Queensland, have unveiled the precise molecular process through which Botulinum neurotoxin type-A, commonly referred to as Botox, penetrates …", "url": "https://scitechdaily.com/?p=282243", "urlToImage": "https://scitechdaily.com/images/Botox-Syringe.jpg", "publishedAt": "2023-05-31T05:13:14Z", "content": "ByUniversity of QueenslandMay 30, 2023\r\nBotox, short for botulinum toxin, is a neurotoxic protein derived from the bacterium Clostridium botulinum. It is widely known for its use in cosmetic procedur… [+2924 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jo Waters", "title": "Could the new drugs for early Alzheimer's really signal the end of dementia? - Daily Mail", "description": "Rachel (right), 70, was diagnosed with Alzheimer's seven years ago. But Rachel was one of the lucky ones - she read a newspaper article about a trial for a new drug.", "url": "https://www.dailymail.co.uk/health/article-12136993/Could-new-drugs-early-Alzheimers-really-signal-end-dementia.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/29/21/71544161-0-image-a-13_1685390838239.jpg", "publishedAt": "2023-05-29T19:25:31Z", "content": "Rachel Hawley was 63 when she began noticing minor memory problems. \r\n'They were little things, such as repeating myself people would say I'd told them things before and struggling to remember recipe… [+16597 chars]"}]}