{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "Mediterranean diet: Dietitian shares favorite breakfasts - Insider", "description": "Kirsten Jackson told Insider that she follows the Mediterranean diet and eats oatmeal with fruit, peanut butter, and seeds 70% of the time.", "url": "https://www.insider.com/mediterranean-diet-healthy-breakfast-ideas-dietitian-2023-4", "urlToImage": "https://i.insider.com/6440f3a7632fda001803c620?width=1200&format=jpeg", "publishedAt": "2023-04-25T08:00:00Z", "content": "A dietitian who follows the Mediterranean diet has shared her go-to breakfasts with Insider.\r\nThe Mediterranean diet has for years been widely considered one of the healthiest ways to eat. It focuses… [+3160 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Tim Spector", "title": "Eat fibre first – and ditch the juice: five quick and easy tips for a much healthier meal - The Guardian", "description": "Scientist and author Tim Spector shows how to make small but important changes to improve the way you eat – while still enjoying your food", "url": "https://www.theguardian.com/food/2023/apr/25/eat-fibre-first-and-ditch-the-juice-five-quick-and-easy-tips-for-a-much-healthier-meal", "urlToImage": "https://i.guim.co.uk/img/media/48704b1c0d1bae1317c9c76009292f4e15607f25/0_224_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=3ad3bf80552492c71e367d5a366a149a", "publishedAt": "2023-04-25T07:00:00Z", "content": "Whilst researching my latest book, Food for Life, I learnt that were very short of practical advice on food choices which are the most important things we can do for our health (humans and our gut mi… [+7073 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Lung cancer: Liquid biopsies could speed up treatment - BBC", "description": "Liquid biopsies could replace the need for invasive procedures under general anaesthetic.", "url": "https://www.bbc.com/news/uk-wales-65377533", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/14C56/production/_129487058_magda3.jpg", "publishedAt": "2023-04-25T05:52:57Z", "content": "A new blood test could dramatically speed up lung cancer treatment in Wales. \r\nLiquid biopsies would remove the need for patients to have uncomfortable tissue biopsies under general anaesthetic. \r\nDr… [+3732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Common Synthetic Chemicals Disrupt Key Biological Processes – Linked to a Diverse Array of Diseases - SciTechDaily", "description": "Exposure to a mixture of chemicals known as PFAS results in changes in biological processes that are linked to a diverse array of diseases. Researchers from the Keck School of Medicine of USC have discovered that being exposed to a mixture of synthetic chemic…", "url": "https://scitechdaily.com/warning-common-synthetic-chemicals-disrupt-key-biological-processes-linked-to-a-diverse-array-of-diseases/", "urlToImage": "https://scitechdaily.com/images/Methane-or-Ammonium-Molecules.jpg", "publishedAt": "2023-04-25T03:27:28Z", "content": "ByKeck School of Medicine of USCApril 24, 2023\r\nForever chemicals, also known as PFAS (Per- and Polyfluoroalkyl Substances), are a group of synthetic chemicals that have been widely used in various i… [+7462 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Prioritizing Brain Health: Blood Pressure Control Reduces Alzheimer's Risk and Minimizes Brain Aging - Neuroscience News", "description": "A recent study suggests that intensive blood pressure treatment with a target of less than 120 mm Hg can reduce the risk of adverse cerebrovascular events and improve overall brain health in adults over 50. Patients who more intensely managed their hypertensi…", "url": "https://neurosciencenews.com/blood-pressure-brain-aging-23097/", "urlToImage": "https://neurosciencenews.com/files/2023/04/blood-pressure-brain-health-neurosinces-public.jpg", "publishedAt": "2023-04-24T21:51:27Z", "content": "Summary: A recent study suggests that intensive blood pressure treatment with a target of less than 120 mm Hg can reduce the risk of adverse cerebrovascular events and improve overall brain health in… [+6616 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "High-Fat Diets During Early Life Lead to Cravings for Salty Foods Later On - Neuroscience News", "description": "In utero and early life exposure to high-fat diets result in a preference for foods that are higher in salt later in life, a new study reports. Researchers say high-fat diets increase the expression of the AT1 protein in the taste buds. This occurs as early a…", "url": "https://neurosciencenews.com/salt-craving-high-fat-diet-23095/", "urlToImage": "https://neurosciencenews.com/files/2023/04/early-diet-salty-food-neurosinces-public.jpg", "publishedAt": "2023-04-24T20:51:03Z", "content": "Summary: In utero and early life exposure to high-fat diets results in a preference for foods that are higher in salt later in life, a new study reports. Researchers say high-fat diets increase the e… [+5330 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "New Gel Treatment Wipes Out Deadly Brain Cancer in Mice - Offers Hope For Defeating Glioblastoma in Humans - Neuroscience News", "description": "Combining an anticancer drug with an antibody, researchers developed a novel gel that cured glioblastoma brain cancer in 100% of mouse models. The findings offer new hope in the fight against the most deadly form of brain cancer in humans. The gel triggers an…", "url": "https://neurosciencenews.com/brain-cancer-gel-23093/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-cancer-gel-neurosicences-public.jpg", "publishedAt": "2023-04-24T20:11:35Z", "content": "Summary: Combining an anticancer drug with an antibody, researchers developed a novel gel that cured glioblastoma brain cancer in 100% of mouse models. The findings offer new hope in the fight agains… [+4908 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Megan Rossi", "title": "Gut Health Guru Dr Meghan Rossi on how eating little and often can help tackle nausea - Daily Mail", "description": "Persistently feeling or being sick can make day-to-day life incredibly challenging and make it difficult to take in adequate nutrition, with effects for the rest of your health.", "url": "https://www.dailymail.co.uk/health/article-12008563/Gut-Health-Guru-Dr-Meghan-Rossi-eating-little-help-tackle-nausea.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/24/19/70182001-0-image-a-7_1682361959620.jpg", "publishedAt": "2023-04-24T19:56:54Z", "content": "Nausea is something we don't take as seriously as we should. Persistently feeling or being sick can make day-to-day life incredibly challenging and make it difficult to take in adequate nutrition, wi… [+7880 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Roger Dobson", "title": "Have scientists found a way to reverse sight loss? A jab of skin cells could hold the key - Daily Mail", "description": "An estimated 250,000 people in the UK live with severe visual problems due to dry age-related macular degeneration (AMD) and there is no treatment.", "url": "https://www.dailymail.co.uk/health/article-12008141/Have-scientists-way-reverse-sight-loss-jab-skin-cells-hold-key.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/24/17/70177169-0-image-a-5_1682352527494.jpg", "publishedAt": "2023-04-24T19:42:29Z", "content": "A jab of stem cells from a patient's own skin could be the first treatment for a leading cause of sight loss.\r\nAn estimated 250,000 people in the UK live with severe visual problems due to dry age-re… [+6203 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Antiviral Pathway a Potential New Target for Alzheimer’s Treatment - Neuroscience News", "description": "Inhibiting cGAS, an innate immune system enzyme allows neurons to become more resilient to tau fibrils. The new finding may serve in the development of new therapies to help treat Alzheimer's disease and frontotemporal dementia, two neurodegenerative disorder…", "url": "https://neurosciencenews.com/ftd-alzheimers-antiviral-pathway-23091/", "urlToImage": "https://neurosciencenews.com/files/2023/04/antiviral-pathway-dementia-neurosicnes-public.jpg", "publishedAt": "2023-04-24T19:21:12Z", "content": "Summary: Inhibiting cGAS, an innate immune system enzyme allows neurons to become more resilient to tau fibrils. The new finding may serve in the development of new therapies to help treat Alzheimer’… [+6265 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Classical Conditioning Through Brain Stimulation - Neuroscience News", "description": "Brain activity can be conditioned through external brain stimulation, researchers discovered. The findings have implications for using TMS as a therapeutic approach, potentially leading to more straightforward treatment for conditions such as Parkinson's dise…", "url": "https://neurosciencenews.com/tms-classical-conditioning-23087/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-stimulation-classical-conditioning-neurosines-ppublic.jpg", "publishedAt": "2023-04-24T17:37:26Z", "content": "Summary: Brain activity can be conditioned through external brain stimulation, researchers discovered. The findings have implications for using TMS as a therapeutic approach, potentially leading to m… [+4821 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Study explores link between attachment styles and sexual dysfunction in young adults - PsyPost", "description": "Young adulthood is often associated with exciting developments in intimacy and relationships, but research showing increased sexual dysfunction among the 18-25 age group has emerged in recent years. A study published in The Journal of Sex Research explores ho…", "url": "https://www.psypost.org/2023/04/study-explores-link-between-attachment-styles-and-sexual-dysfunction-in-young-adults-77874", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/08/unhappy-couple-in-bed.jpg", "publishedAt": "2023-04-24T17:10:34Z", "content": "Young adulthood is often associated with exciting developments in intimacy and relationships, but research showing increased sexual dysfunction among the 18-25 age group has emerged in recent years. … [+4043 chars]"}, {"source": {"id": null, "name": "Delish.com"}, "author": null, "title": "Best Lemon Butter Feta Chicken Pasta Recipe - How To Make Butter Feta Pasta - Delish", "description": "Feta and pasta strike again.", "url": "https://www.delish.com/cooking/recipe-ideas/a43604316/lemon-butter-feta-chicken-pasta-recipe/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/lemonbutterfetachickenpasta-index-6442fb419fa42.jpeg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2023-04-24T14:50:02Z", "content": "A creamy, rich pasta sauce with fresh lemon and tangy feta, plus juicy chicken thighs all come together in one pot for a very simple but satisfying meal. Its the even easier version of everyones favo… [+410 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Microplastics Can Enter The Brain After Ingestion, Finds Breakthrough Animal Study - IFLScience", "description": "Microplastics have previously been found in human placentas, but it could be even worse.", "url": "https://www.iflscience.com/microplastics-detected-entering-the-brain-just-2-hours-after-ingestion-68593", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68593/aImg/67439/microplastics-meta.jpg", "publishedAt": "2023-04-24T14:42:20Z", "content": "Microplastics can cross the blood-brain barrier and enter the brain after being ingested, a new study on mice reveals. The brains of mice fed micro- and nano-plastics (MNPs) were found to contain the… [+2753 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "First-time experiences with alcohol and cannabis appear to predict future substance abuse - PsyPost", "description": "A recent study provides evidence that the initial subjective effects of alcohol and cannabis can vary greatly among individuals and may be indicative of future substance abuse problems. The new findings have been published in Experimental and Clinical Psychop…", "url": "https://www.psypost.org/2023/04/first-time-experiences-with-alcohol-and-cannabis-appear-to-predict-future-substance-abuse-77707", "urlToImage": "https://www.psypost.org/wp-content/uploads/2021/02/brain-1.jpg", "publishedAt": "2023-04-24T14:00:24Z", "content": "A recent study provides evidence that the initial subjective effects of alcohol and cannabis can vary greatly among individuals and may be indicative of future substance abuse problems. The new findi… [+5198 chars]"}, {"source": {"id": null, "name": "HuffPost UK"}, "author": "Habiba Katsha", "title": "Working Out In The Morning? We've Got Bad News For You - HuffPost UK", "description": "Are you a morning or evening gym girly?", "url": "https://www.huffingtonpost.co.uk/entry/working-out-in-the-morning-weve-got-news-for-you_uk_64465602e4b039ec4e7fd9c9", "urlToImage": "https://img.huffingtonpost.com/asset/64466ff02200006000d3c86f.jpeg?ops=1200_630", "publishedAt": "2023-04-24T13:30:42Z", "content": "With summer around the corner, many of us are dragging ourselves to the gym now that the mornings arent so miserable.\r\nHowever, finding the time to go to the gym is difficult. Waking up at 6:00 am to… [+8183 chars]"}, {"source": {"id": null, "name": "Multiple Sclerosis News Today"}, "author": "Margarida Maia, PhD", "title": "Region in Japan sees 20-year increase in MS prevalence: Study |... - Multiple Sclerosis News Today", "description": "Tokachi, a region in north Japan, has registered a steady increase in prevalence, or the proportion of people with MS, in the past 20 years.", "url": "https://multiplesclerosisnewstoday.com/news-posts/2023/04/24/northern-japan-region-sees-20-year-increase-ms-prevalence-study/", "urlToImage": "https://multiplesclerosisnewstoday.com/wp-content/uploads/2022/08/Rare.png", "publishedAt": "2023-04-24T13:02:41Z", "content": "Tokachi, a region in northern Japan, has seen a steady increase in the prevalence or proportion of people in the population living with multiple sclerosis (MS) over the past two decades, a recent stu… [+4885 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Noa Leach", "title": "Here's how you can reverse your biological age, according to breakthrough new study - BBC Science Focus Magazine", "description": "Your biological age is ticking, but this study shows how you can slow it down – and even turn it around.", "url": "https://www.sciencefocus.com/news/reverse-ageing-caused-by-stress/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/04/ageing-eyes-b95b158.jpg?resize=960,413", "publishedAt": "2023-04-24T10:27:26Z", "content": "Humans can effectively de-age after recovering from stressful events, a new study from Harvard Medical School and Duke University School of Medicine has found.\r\nThe breakthrough research shows that w… [+6016 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Amy Fleming", "title": "The hell of somniphobia: 'On a bad night I get zero to two hours' sleep' - The Guardian", "description": "The fear of falling asleep can have many causes, from trauma to sleep apnea, and the effects are debilitating. But there are effective treatments", "url": "https://www.theguardian.com/lifeandstyle/2023/apr/24/somniphobia-fear-of-falling-asleep-causes-treatments", "urlToImage": "https://i.guim.co.uk/img/media/37e5bd31fea4aff6199d1e75a6f80d46c1a9b688/1_0_2645_1587/master/2645.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8182016584c7597e37cbdc36860cc6ef", "publishedAt": "2023-04-24T09:00:00Z", "content": "When Elizabeth Johnson tries to fall asleep, anxiety often takes over. After going to bed, she starts to relax, but feels as though she is losing control. Instead of continuing, she says, I get a sen… [+8865 chars]"}, {"source": {"id": null, "name": "Cam.ac.uk"}, "author": null, "title": "Cambridge University's needle-free coronavirus vaccine begins clinical trials in home city - University of Cambridge news", "description": "Recruitment is underway in Cambridge for volunteers to take part in clinical trials of a revolutionary new needle-free vaccine to protect against SARS-CoV-2 –", "url": "https://www.cam.ac.uk/research/news/cambridge-universitys-needle-free-coronavirus-vaccine-begins-clinical-trials-in-home-city", "urlToImage": "https://www.cam.ac.uk/sites/www.cam.ac.uk/files/news/research/news/needle-free-covid-vaccine-web.jpg", "publishedAt": "2023-04-24T07:54:13Z", "content": "The vaccine known as DIOS-CoVax has been developed by Professor Jonathan Heeney at the University of Cambridge and spin-out company DIOSynVax. It is envisaged as a booster targeting SARS-CoV-2 and re… [+1767 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Camille Bello", "title": "German scientists make a 'major discovery' that could slow down the ageing process - Euronews", "description": "At last, a new study has found the answers to “basic biology questions” that could help explain what drives ageing and what can we do to reverse it.", "url": "https://www.euronews.com/next/2023/04/20/german-scientists-make-a-major-discovery-that-could-slow-down-the-ageing-process", "urlToImage": "https://static.euronews.com/articles/stories/07/54/82/80/1000x563_cmsv2_c63c23ae-1e2e-5d23-96b6-9dc2d21ef977-7548280.jpg", "publishedAt": "2023-04-24T00:29:25Z", "content": "Despite centuries of research and progress in medicine, there are still many mysteries that remain unresolved, chief among them being an understanding of what causes ageing and how can we slow it dow… [+5377 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Worm Model Weeds Out New Insight Into Endocannabinoid System - Neuroscience News", "description": "A new study of worms brings new insight into the workings of the endocannabinoid system and helps answer the question of why cannabis consumption enhances mood and gives people \"the munchies\". Researchers found cannabis consumption activates the endocannabino…", "url": "https://neurosciencenews.com/endocannabinoid-worms-23086/", "urlToImage": "https://neurosciencenews.com/files/2023/04/endocannabinoid-system-worm-neurosicnes-.jpg", "publishedAt": "2023-04-23T21:54:55Z", "content": "Summary: A new study of worms brings new insight into the workings of the endocannabinoid system and helps answer the question of why cannabis consumption enhances mood and gives people “the munchies… [+8043 chars]"}]}