{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A New Hope: Diabetes Drug May Ward Off Dementia - SciTechDaily", "description": "A study in the Neurology journal suggests that the diabetes drug pioglitazone may reduce dementia risk in newly diagnosed type 2 diabetics, with benefits amplified in those with a history of ischemic heart disease or stroke. However, the drug's potential side…", "url": "https://scitechdaily.com/a-new-hope-diabetes-drug-may-ward-off-dementia/", "urlToImage": "https://scitechdaily.com/images/Brain-Disease-Alzheimers-Treatment.jpg", "publishedAt": "2023-05-05T17:25:34Z", "content": "ByAmerican Academy of NeurologyMay 5, 2023\r\nRecent research suggests a potential link between the diabetes drug pioglitazone and a reduced risk of dementia in people with newly diagnosed type 2 diabe… [+4780 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Nourishing the Mind: Nutritional Interventions to Slow Alzheimer's Disease - Neuroscience News", "description": "A new systematic review examined nutritional interventions for Alzheimer's disease (AD). The review identified 38 studies, including randomized clinical trials, systematic reviews, and meta-analyses. The findings indicate that nutritional interventions such a…", "url": "https://neurosciencenews.com/nutrition-alzheimers-cognition-23180/", "urlToImage": "https://neurosciencenews.com/files/2023/05/alzheimers-diet-neurosicens.jpg", "publishedAt": "2023-05-05T16:17:53Z", "content": "Summary: A new systematic review examined nutritional interventions for Alzheimer’s disease (AD). The review identified 38 studies, including randomized clinical trials, systematic reviews, and meta-… [+7057 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Unique Omega-3 Fatty Acid Lipid Could Revolutionize Our Understanding of Brain Development and Aging - Neuroscience News", "description": "Researchers identified a special transporter protein, Mfsd2a, that plays a critical role in regulating the brain cells responsible for protecting nerves with myelin sheaths. Loss of myelin sheaths can occur during the normal aging process and in neurological …", "url": "https://neurosciencenews.com/myelin-omega3-aging-23180/", "urlToImage": "https://neurosciencenews.com/files/2023/05/fatty-omega-3-aging-brain-neurosicences.jpg", "publishedAt": "2023-05-05T13:02:31Z", "content": "Summary: Researchers identified a special transporter protein, Mfsd2a, that plays a critical role in regulating the brain cells responsible for protecting nerves with myelin sheaths. Loss of myelin s… [+5279 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Ilona Baliūnaitė", "title": "Guy Asks If He's A Jerk For Getting In A Fight With His MIL About His Daughter Having “Real” Private Parts - Bored Panda", "description": "This redditor made sure his daughter knew how to take proper care of herself. However, to his surprise, his MIL was lacking knowledge about personal hygiene, which led to a huge fight.", "url": "https://www.boredpanda.com/mil-insists-toddler-granddaughter-private-parts-not-real/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/mil-insists-toddler-granddaughter-private-parts-not-real-fb40.png", "publishedAt": "2023-05-05T10:24:01Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Louise Allingham", "title": "Get health doctor Megan Rossi reveals how to get rid of bad garlic bread by eating an apple - Daily Mail", "description": "Gut health doctor Megan Rossi has revealed a simple hack for eliminating smelly garlic breath. The doctor also raved about the health benefits of garlic and why you should leave it to stand before cooking.", "url": "https://www.dailymail.co.uk/femail/food/article-12049105/Get-health-doctor-Megan-Rossi-reveals-rid-bad-garlic-bread-eating-apple.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/05/02/70601017-0-image-a-27_1683249255623.jpg", "publishedAt": "2023-05-05T05:27:17Z", "content": "A top doctor has shared a simple trick for getting rid of garlic breath without having to brush your teeth. \r\nDr Megan Rossi revealed eating an apple is the most effective way to get rid of bad breat… [+2808 chars]"}, {"source": {"id": null, "name": "Retractionwatch.com"}, "author": null, "title": "Australian study supporting mask mandates earns expression of concern - Retraction Watch", "description": "A journal has issued an expression of concern for an Australian study that supported mask mandates after researchers raised several potential problems with the design and methodology of the study. …", "url": "https://retractionwatch.com/2023/05/05/australian-study-supporting-mask-mandates-earns-expression-of-concern/", "urlToImage": "https://retractionwatch.com/wp-content/uploads/2020/06/masks-scaled.jpeg", "publishedAt": "2023-05-05T04:01:32Z", "content": "A journal has issued an expression of concern for an Australian study that supported mask mandates after researchers raised several potential problems with the design and methodology of the study.\r\nT… [+9701 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Mother who woke up with pain on one side of her face told she had brain tumor - Daily Mail", "description": "Andreea Vanacker, from Montreal, Canada, said the sensation was so bad that she became afraid to talk, laugh or even eat. Doctors diagnosed her with a benign brain tumor.", "url": "https://www.dailymail.co.uk/health/article-12047983/Mother-woke-pain-one-face-told-brain-tumor.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/04/21/70591931-0-image-a-42_1683232812972.jpg", "publishedAt": "2023-05-04T20:53:45Z", "content": "A mother-of-two who woke up with an electric shock-like pain on the right side of her face was shocked to learn brain tumor.\r\nAndreea Vanacker, from Montreal, Canada, said the feeling emerged without… [+5132 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "What really killed COVID-19 patients: It wasn't a cytokine storm, suggests study - Medical Xpress", "description": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying machine learning to medical record data, scientists at North…", "url": "https://medicalxpress.com/news/2023-05-covid-patients-wasnt-cytokine-storm.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/covid-patient.jpg", "publishedAt": "2023-05-04T19:12:45Z", "content": "Secondary bacterial infection of the lung (pneumonia) was extremely common in patients with COVID-19, affecting almost half the patients who required support from mechanical ventilation. By applying … [+4749 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "GISAID in crisis: can the controversial COVID genome database survive? - Nature.com", "description": "The most popular repository for sharing SARS-CoV-2 sequence data has come under increasing scrutiny. Scientists and funders around the world must now consider what lies ahead for the open sharing of genome data.", "url": "https://www.nature.com/articles/d41586-023-01517-9", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01517-9/d41586-023-01517-9_25316866.jpg", "publishedAt": "2023-05-04T17:56:02Z", "content": "During the COVID-19 pandemic, one online platform emerged as the main repository for viral genome data. GISAID, an initiative launched in 2008 to improve the global sharing of influenza data, earned … [+14964 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "40 Frightening Scientific Facts That Folks In This Online Group Had The Misfortune To Learn - Bored Panda", "description": "The great German philosopher Friedrich Nietzsche once sagely remarked that \"if you gaze into the abyss, the abyss gazes also into you.\" Damn rightly noticed, especially when you consider that for several millennia of its existence, humanity has been actively …", "url": "https://www.boredpanda.com/scientific-fact-theory-scares-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/05/scientific-fact-theory-scares-you-fb19.png", "publishedAt": "2023-05-04T15:32:19Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Parallel sequencing of extrachromosomal circular DNAs and transcriptomes in single cancer cells - Nature.com", "description": "scEC&T-seq profiles extrachromosomal circular DNA and full-length mRNA from single human cancer cells, and may be used to interrogate heterogeneity in both cell lines and primary tumor samples.", "url": "https://www.nature.com/articles/s41588-023-01386-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01386-y/MediaObjects/41588_2023_1386_Fig1_HTML.png", "publishedAt": "2023-05-04T15:23:24Z", "content": "scEC&amp;T sequencing\r\nA detailed, step-by-step protocol of scEC&amp;T-seq is available on the Nature Protocol Exchange46 and is described below. The duration of the protocol is approximately 8days p… [+31969 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "People with more pronounced openness to experience tend to have nightmares more often - PsyPost", "description": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently. Individuals with higher levels of neuroticism, on the other…", "url": "https://www.psypost.org/2023/05/people-with-pronounced-openness-to-experience-tend-to-have-nightmares-more-often-80314", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/nightmare.jpg", "publishedAt": "2023-05-04T14:04:07Z", "content": "A new study examining links between personality traits and experiences with nightmares has found that people with more pronounced openness to experience tend to experience nightmares more frequently.… [+4020 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Restricting e-cigarettes to 'tobacco flavour' could slash teens vapers by 70 per cent - Daily Mail", "description": "Ditching fruit flavours in favour of pure tobacco would significantly reduce the appeal of vaping among young people according to a survey carried out by US researchers in Ohio.", "url": "https://www.dailymail.co.uk/health/article-12043037/Restricting-e-cigarettes-tobacco-flavour-slash-teens-vapers-70-cent.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/03/17/70538745-0-image-a-10_1683132526370.jpg", "publishedAt": "2023-05-04T05:00:49Z", "content": "Limiting e-cigarette flavours to tobacco could cut use among teens by 70 per cent, a study found.\r\nDitching fruit flavours would significantly reduce the appeal of vaping among the young, according t… [+3730 chars]"}]}