{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ethan Ennals", "title": "UK hepatitis outbreak: How worried should we be about mystery virus giving kids liver condition? - Daily Mail", "description": "One child has died, according to the World Health Organisation - it did not reveal in which country - while US health officials are investigating the death of another youngster with suspected hepatitis.", "url": "https://www.dailymail.co.uk/health/article-10770383/UK-hepatitis-outbreak-worried-mystery-virus-giving-kids-liver-condition.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/30/13/57237469-0-image-a-23_1651320320664.jpg", "publishedAt": "2022-04-30T21:01:48Z", "content": "Few parents will fail to have been concerned by reports of hundreds of children being hospitalised with the liver condition hepatitis.\r\nWhile many have recovered, 11 have required an urgent liver tra… [+8090 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Do You Want a Long Healthy Lifespan? The Characteristics of a “Longevity Diet” - SciTechDaily", "description": "Professor Valter Longo leads a review of research in animals and humans to identify how nutrition affects aging and a healthy lifespan. According to University of Southern California (USC) Leonard Davis School of Gerontology Professor Valter Longo, examining …", "url": "https://scitechdaily.com/do-you-want-a-long-healthy-lifespan-the-characteristics-of-a-longevity-diet/", "urlToImage": "https://scitechdaily.com/images/Salad-Olive-Oil.jpg", "publishedAt": "2022-04-30T15:46:11Z", "content": "ByUniversity of Southern CaliforniaApril 30, 2022\r\nUSC professor outlines the characteristics of a longevity diet based on a range of nutrition research from studies in laboratory animals to epidemio… [+6939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Warn That Climate Change Could Spark the Next Major Pandemic - SciTechDaily", "description": "Researchers anticipate that as the earth's temperature continues to warm, wild animals will be compelled to migrate their habitats – most likely to areas with dense human populations – drastically raising the danger of a viral jump to humans, which might lead…", "url": "https://scitechdaily.com/scientists-warn-that-climate-change-could-spark-the-next-major-pandemic/", "urlToImage": "https://scitechdaily.com/images/Global-Infectious-Disease-Pandemic.gif", "publishedAt": "2022-04-30T11:29:40Z", "content": "As the global climate continues to warm, scientists predict wild animals will be forced to relocate their habitats likely to regions with large human populations. This will dramatically increase the … [+5947 chars]"}, {"source": {"id": null, "name": "Liverpool Echo"}, "author": "Danny Rigg", "title": "Mum woke up on life support after shooting pains - Liverpool Echo", "description": "Joanne Sheridan, 45, had a common condition many people don't know they have", "url": "https://www.liverpoolecho.co.uk/news/health/mum-woke-up-life-support-23813037", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article23812854.ece/ALTERNATES/s1200/0_Joanne-Sheridan-endometriosis.jpg", "publishedAt": "2022-04-30T04:00:00Z", "content": "A woman said a common condition many people don't know they have \"nearly killed\" her.\r\n Joanne Sheridan, 45, found herself on life support after emergency surgery that led to her being diagnosed with… [+5292 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Abi Turner", "title": "Now that restaurants are publishing calorie counts FEMAIL reveals the most surprising numbers - Daily Mail", "description": "FEMAIL reveals high street meals with surprisingly sizeable calorie counts - including a Slug and Lettuce hummus sandwich that racks up nearly 1,000 calories.", "url": "https://www.dailymail.co.uk/femail/article-10732911/Now-restaurants-publishing-calorie-counts-FEMAIL-reveals-surprising-numbers.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/25/21/57040197-0-image-a-32_1650918171154.jpg", "publishedAt": "2022-04-29T15:32:47Z", "content": "Larger restaurants and café chains in the UK must now be fully transparent about the calorie counts of dishes they serve up - and some diners are likely to be left a little shocked at how meals dress… [+6015 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Stacey Colino", "title": "Fruits and vegetables are less nutritious than they used to be - National Geographic", "description": "Mounting evidence shows that many of today’s whole foods aren't as packed with vitamins and nutrients as they were 70 years ago, potentially putting people's health at risk.", "url": "https://www.nationalgeographic.com/magazine/article/fruits-and-vegetables-are-less-nutritious-than-they-used-to-be", "urlToImage": "https://i.natgeofe.com/n/efd3dfc6-d3b0-41a0-a3c3-08965cb178c9/MM9914_220406_002165_16x9.jpg?w=1200", "publishedAt": "2022-04-29T15:06:15Z", "content": "As you gaze across the rows of brightly colored fruits and vegetables in the produce section of the grocery store, you may not be aware that the quantity of nutrients in these crops has been declinin… [+771 chars]"}, {"source": {"id": null, "name": "Daily Post"}, "author": "Steffan Rhys, Matthew Evans", "title": "10 symptoms of Vitamin B deficiency and how to deal with it - North Wales Live", "description": "Symptoms include fatigue, shortness of breath and dizziness", "url": "https://www.dailypost.co.uk/news/north-wales-news/10-symptoms-vitamin-b-deficiency-23825127", "urlToImage": "https://i2-prod.edinburghlive.co.uk/incoming/article23683025.ece/ALTERNATES/s1200/2_GettyImages-1310962034.jpg", "publishedAt": "2022-04-29T14:16:38Z", "content": "Vitamin B12 deficiency or folate deficiency anaemia can cause all manner of day to day problems which prevent the sufferer from living their life to the full. Symptoms can include fatigue, shortness … [+3481 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Liam Buckler", "title": "Scarlet fever symptoms: Parents urged to check for warning signs as cases rise - The Mirror", "description": "Public health bodies have issued advice following rising cases of scarlet fever in England with health bosses urging parents to check possible symptoms", "url": "https://www.mirror.co.uk/news/uk-news/scarlet-fever-symptoms-parents-urged-26832928", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26833232.ece/ALTERNATES/s1200/0_Mother-taking-care-of-baby-with-chicken-pox.jpg", "publishedAt": "2022-04-29T14:03:50Z", "content": "Parents are being urged to check for possible warning signs of scarlet fever following a rise of cases across the country.\r\nPublic health bodies have issued advice following the north west having the… [+2293 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Solen Le Net", "title": "Supplements: Three pills linked to elevations in blood pressure and ‘possible death’ - Express", "description": "HIGH blood pressure is inextricably linked with adverse health events - yet millions in the UK are unaware that their reading exceeds healthy limits. The condition is widely understood as the result of poor lifestyle choices. Sometimes, however, common dietar…", "url": "https://www.express.co.uk/life-style/health/1602155/supplement-warning-yohimbe-green-tea-extract-liquorice", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1602155_1.jpg", "publishedAt": "2022-04-29T07:14:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Britons with arthritis told to exercise more and use painkillers less - The Guardian", "description": "Exercise better than relying on painkillers to improve quality of life long term, says guidance", "url": "https://amp.theguardian.com/society/2022/apr/29/lose-weight-and-exercise-for-arthritis-pain-says-nice", "urlToImage": null, "publishedAt": "2022-04-29T06:40:00Z", "content": "HealthExercise better than relying on painkillers to improve quality of life long term, says guidance\r\nFri 29 Apr 2022 07.44 BST\r\nBritons with arthritis are being urged to lose weight and exercise mo… [+4564 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "High cholesterol: The colour of your nails could be a symptom - ‘Great’ way to spot it - Express", "description": "HIGH cholesterol can boost your risk of serious medical conditions, including heart disease and stroke. Silent but dangerous, the condition often doesn't present many signs. However, an expert shared the colour in your nails that could point to high levels.", "url": "https://www.express.co.uk/life-style/health/1602469/high-cholesterol-symptoms-dark-lines-under-nails-sign", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/1602469_1.jpg", "publishedAt": "2022-04-28T10:24:00Z", "content": null}]}