{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "AI Pinpoints Parkinson’s Subtypes Using Stem Cell Images - Neuroscience News", "description": "Researchers enabled machine learning to accurately predict Parkinson's disease subtypes using stem cell images.", "url": "https://neurosciencenews.com/parkinsons-ai-stem-cells-23783/", "urlToImage": "https://neurosciencenews.com/files/2023/08/ai-parkinsons-stem-cells-neuroscien.jpg", "publishedAt": "2023-08-11T21:08:14Z", "content": "Summary: Researchers enabled machine learning to accurately predict Parkinson’s disease subtypes using stem cell images. This breakthrough showcases computer models classifying four Parkinsons subtyp… [+7693 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Long-term Acid Reflux Drugs Linked to Higher Dementia Risk? - Neuroscience News", "description": "Long-term use (over 4.4 years) of proton pump inhibitors, prescribed for acid reflux, may be associated with an increased risk of dementia.", "url": "https://neurosciencenews.com/dementia-acid-reflux-meds-23780/", "urlToImage": "https://neurosciencenews.com/files/2023/08/dementia-acid-reflux-neurosinces.jpg", "publishedAt": "2023-08-11T19:28:58Z", "content": "Summary: Long-term use (over 4.4 years) of proton pump inhibitors, prescribed for acid reflux, may be associated with an increased risk of dementia. However, this research does not establish a direct… [+5016 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Dopamine Tunes the Brain for Both Singing and Speech - Neuroscience News", "description": "Contrary to popular belief, speech and singing use overlapping brain circuits, primarily located in the left hemisphere.", "url": "https://neurosciencenews.com/dopamine-speech-singing-23779/", "urlToImage": "https://neurosciencenews.com/files/2023/08/dopamine-speech-singing-neurosicnes.jpg", "publishedAt": "2023-08-11T19:09:47Z", "content": "Summary: Contrary to popular belief, speech and singing use overlapping brain circuits, primarily located in the left hemisphere.\r\nThis discovery challenges the 50-year notion that the right hemisphe… [+6222 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "I'm the world's oldest practicing doctor who turned 101 last month - here's my number one rule for keeping you - Daily Mail", "description": "Ohio native Dr Howard Tucker has been a practicing neurologist for over seven decades and, at age 101 and still treating patients, has issued his own prescription for staying sharp.", "url": "https://www.dailymail.co.uk/health/article-12397471/Im-worlds-oldest-practicing-doctor-turned-101-month-heres-number-one-rule-keeping-mind-sharp.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/08/11/16/74216653-0-image-m-37_1691766002090.jpg", "publishedAt": "2023-08-11T15:03:49Z", "content": "Dr Howard Tucker has been a practicing neurologist for over seven decades and, at age 101 and still treating patients, has issued his own prescription for staying sharp. \r\nThe Cleveland, Ohio-born do… [+5213 chars]"}, {"source": {"id": null, "name": "Morning Chalk Up"}, "author": "Tino Marini", "title": "The Strength Numbers You Need to be Competitive in CrossFit - Morning Chalk Up", "description": "Since the inception of the CrossFit Games, we have seen the sport develop and athletes continually push the limits of their athletic abilities. They’re doing things that, according to research…", "url": "https://morningchalkup.com/2023/08/10/the-strength-numbers-you-need-to-be-competitive-in-crossfit/", "urlToImage": "https://static.morningchalkup.com/2023/08/oldLift.jpg", "publishedAt": "2023-08-10T17:17:46Z", "content": "Enjoying Morning Chalk Up? Access additional exclusive interviews, analyses, and stories with an Rx membership. \r\nSince the inception of the CrossFit Games, we have seen the sport develop and athlete… [+1469 chars]"}]}