{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "MailOnline", "title": "Revitalise your joint health with the power of Boswellia - Daily Mail", "description": "A major hindrance to staying active is joint health. The NHS reports around 10 million people in the UK have a condition that affects their joints.", "url": "https://www.dailymail.co.uk/news/article-11745605/Revitalise-joint-health-power-Boswellia.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/23/17/67709337-0-image-a-2_1677173259225.jpg", "publishedAt": "2023-02-24T06:55:46Z", "content": "The NHS emphasises the importance of regular physical exercise as the key to staying healthy.\r\nIt has been shown that 150 minutes of physical activity a week can reduce the risk of health conditions … [+7393 chars]"}, {"source": {"id": null, "name": "Positive.News"}, "author": null, "title": "What went right this week: how to stay healthy, plus more good news - Positive.News", "description": "Studies revealed the secrets to good health, the four-day week had a breakthrough, and Spain introduced menstrual leave, plus more good news", "url": "https://www.positive.news/society/good-news-stories-from-week-8-of-2023/", "urlToImage": "https://www.positive.news/wp-content/uploads/2023/02/hans-isaacson-d7i2YWBFaE4-unsplash.jpg", "publishedAt": "2023-02-23T17:29:25Z", "content": "Studies unraveled the secrets to good health Having satisfying relationships boosts your health in old age, but youll still need to exercise regularly.\r\nThose are the findings of two unrelated studie… [+836 chars]"}, {"source": {"id": null, "name": "Kent Online"}, "author": "Ruth Cassidy", "title": "'He literally saved our little girl's life' - Kent Online", "description": "The grateful family of a nine-year-old girl have thanked the optician who saved her life.", "url": "https://www.kentonline.co.uk/herne-bay/news/she-was-moments-away-from-a-seizure-which-could-have-killed-282704/", "urlToImage": "https://www.kentonline.co.uk/_media/img/TUTVA1TSCAQ0U5TO2NJS.jpg", "publishedAt": "2023-02-23T15:34:00Z", "content": "A young girl was moments away from having a life-threatening seizure when her optician found a build-up of fluid that required emergency brain surgery.\r\nPoppy-May Leeds, from Herne Bay, was having a … [+3097 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Lindsay Clark", "title": "Petaflops help scientists understand why some COVID-19 variants are more contagious - The Register", "description": "'If we did one of these calculations in our lab, we are talking weeks or months'", "url": "https://www.theregister.com/2023/02/23/petaflops_covid/", "urlToImage": "https://regmedia.co.uk/2022/06/16/covid_shuttertock.jpg", "publishedAt": "2023-02-23T13:40:00Z", "content": "Supercomputer-power calculations have helped to uncover how certain variants of the COVID-19 virus \"improve\" ie, become more contagious through their binding energy with human cells.\r\nA lab at Ohios … [+2574 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "In a 1st, scientists grow stem cells that could show how bats harbor lethal viruses without dying - Livescience.com", "description": "Scientists grew stem cells from bats that may help explain why they can carry deadly viruses without being harmed by them.", "url": "https://www.livescience.com/in-a-1st-scientists-grow-stem-cells-that-could-show-how-bats-harbor-lethal-viruses-without-dying", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BwEnvvd29LiFjPcSHPeZKd-1200-80.jpg", "publishedAt": "2023-02-23T11:00:38Z", "content": "For the first time, scientists generated stem cells from bats that can give rise to any type of cell found in the animals' fuzzy bodies. These cells, the researchers say, may help explain how bats ca… [+2570 chars]"}]}