{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ticking Time Bombs: How Our Biological Clock Influences Cluster Headaches and Migraines - SciTechDaily", "description": "Meta-analysis: Cluster headache, migraine have strong links to circadian system. Both cluster headache and migraine have strong links to the circadian system, the internal clock that regulates body processes, according to a meta-analysis published in the Marc…", "url": "https://scitechdaily.com/?p=265168", "urlToImage": "https://scitechdaily.com/images/Woman-Bad-Headache.jpg", "publishedAt": "2023-03-31T12:40:18Z", "content": "A meta-analysis published in Neurology reveals strong links between cluster headaches, migraines, and the circadian system, which regulates internal body processes. The study emphasizes the role of t… [+4061 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Mann", "title": "Toll of San Francisco's homelessness nightmare: Woman filmed after battling flesh eating disease - Daily Mail", "description": "A homeless woman who was filmed saying she did not want to seek medical treatment for a flesh-eating disease destroying her feet has now had both of them amputated.", "url": "https://www.dailymail.co.uk/news/article-11923037/Toll-San-Franciscos-homelessness-nightmare-Woman-filmed-battling-flesh-eating-disease.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/31/05/69321471-0-image-a-40_1680237644581.jpg", "publishedAt": "2023-03-31T06:00:40Z", "content": "A homeless San Francisco woman filmed refusing treatment for a flesh-eating infection on her feet had to have them amputated just weeks later.\r\nThe woman, who was captured on camera by JJ Smith early… [+6346 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Alcohol’s Impact on the Brain Makes Us More Likely to Drink - Neuroscience News", "description": "Researchers have uncovered a neural mechanism involving the brain's immune system that spurs alcohol use disorder.", "url": "https://neurosciencenews.com/alcohol-immune-brain-22903/", "urlToImage": "https://neurosciencenews.com/files/2023/03/alcohol-brain-neuroscience-public.jpg", "publishedAt": "2023-03-30T20:44:02Z", "content": "Summary: Researchers have uncovered a neural mechanism involving the brain’s immune system that spurs alcohol use disorder.\r\nSource: Binghamton University\r\nHeavy alcohol use creates a vicious cycle: … [+6725 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Man who cut off his pinky while drunk 20 years ago FINALLY gets a 3D-printed finger - Daily Mail", "description": "A Nebraska man was gifted a 3D-printed prosthetic 20 years after accidently chopping his pinky off with a power tool. The design is also cheaper than the $20,000 price tag of a medial prosthetic.", "url": "https://www.dailymail.co.uk/sciencetech/article-11920473/Man-cut-pinky-drunk-20-years-ago-FINALLY-gets-3D-printed-finger.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/30/16/69295427-0-image-a-3_1680188868065.jpg", "publishedAt": "2023-03-30T15:50:00Z", "content": "A Nebraska man who chopped his pinky off with a power tool while drinking 20 years ago has finally received a new finger with the help of modern technology.\r\nAdam Cutshall, 47, was gifted a 3D-printe… [+4035 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Monika Pašukonytė", "title": "“You'll Be Dead In Minutes”: Netizens Discuss 30 Everyday Things That May Cost You Your Life - Bored Panda", "description": "Most people no longer have to live in the “jungle”, therefore there is no need to constantly worry about one’s survival. It gives us plenty of free time if only we take a minute to actually enjoy it or use it in a way that makes us happy. However, it would be…", "url": "https://www.boredpanda.com/everyday-things-can-end-you/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/03/everyday-things-can-end-you-fb.png", "publishedAt": "2023-03-30T15:19:24Z", "content": null}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Here are top five stress relievers you should know about - The News International", "description": "Stress is a term used to describe the body's response to a perceived threat or challenge. Many of us do not realise it but stress is a natural and normal response that can be triggered by both...", "url": "https://www.thenews.com.pk/latest/1055577-here-are-top-five-stress-relievers-you-should-know-about", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-03-30/1055577_064807_updates.jpg", "publishedAt": "2023-03-30T13:47:00Z", "content": "Stress is a term used to describe the body's response to a perceived threat or challenge. Many of us do not realise it but stress is a natural and normal response that can be triggered by both positi… [+2814 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "I'm a podiatrist - here's what your feet say about your health - Daily Mail", "description": "From pesky cracked heels to more serious problems, such as swelling, feet often show signs of disease before any other part of your body, says Emma McConnachie, a podiatrist in Falkirk, Scotland.", "url": "https://www.dailymail.co.uk/health/article-11915463/Im-podiatrist-heres-feet-say-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/30/10/69283891-0-image-a-7_1680169672774.jpg", "publishedAt": "2023-03-30T11:35:27Z", "content": "You might not think it but your feet can tell you a surprising amount about your health.\r\nFrom pesky cracked heels and calluses to more serious problems, such as swelling, they often show signs of di… [+9304 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "Dispute simmers over who first shared SARS-CoV-2's genome - Science", "description": "Scientists suggest GISAID, a virus sequence database, is rewriting pandemic history", "url": "https://www.science.org/content/article/dispute-simmers-over-who-first-shared-sars-cov-2-s-genome", "urlToImage": "https://www.science.org/do/10.1126/science.adi0300/abs/_20230328_on_gisaid_covid.jpg", "publishedAt": "2023-03-29T18:46:53Z", "content": "When GISAID, the widely used database for influenza and SARS-CoV-2 genomes, issued a statement last week about a set of controversial sequences from the Huanan Seafood Wholesale Market in Wuhan, Chin… [+11530 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Spatial multiomics map of trophoblast development in early pregnancy - Nature.com", "description": "A multiomics single-cell atlas of the human maternal–fetal interface including the myometrium, combining spatial transcriptomics data with chromatin accessibility, provides a comprehensive analysis of cell states as placental cells infiltrate the uterus durin…", "url": "https://www.nature.com/articles/s41586-023-05869-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05869-0/MediaObjects/41586_2023_5869_Fig1_HTML.png", "publishedAt": "2023-03-29T15:33:45Z", "content": "Human samples\r\nPlacental and decidual samples used for the in vivo and in vitro profiling were obtained from elective terminations from: The MRC and Wellcome-funded Human Developmental Biology Resour… [+48769 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "An atlas of genetic scores to predict multi-omic traits - Nature.com", "description": "A machine learning approach is used to analyse multi-omics (proteomics, metabolomics and transcriptomics) data, producing genetic scores for more than 17,000 biomolecular traits in human blood, and identifying possible associations with disease.", "url": "https://www.nature.com/articles/s41586-023-05844-9", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05844-9/MediaObjects/41586_2023_5844_Fig1_HTML.png", "publishedAt": "2023-03-29T15:05:49Z", "content": "<li>Barbeira, A. N. et al. Exploring the phenotypic consequences of tissue specific gene expression variation inferred from GWAS summary statistics. Nat. Commun.9, 1825 (2018).\r\nArticle \r\n ADS \r\n Pub… [+18001 chars]"}]}