{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify 4 Important Warning Signs of Early-Onset Colon Cancer - SciTechDaily", "description": "Early detection of symptoms and signs can lead to quicker colorectal cancer diagnoses, enhancing the chances of survival. Researchers from the Washington University School of Medicine in St. Louis have pinpointed four critical signs and symptoms that suggest …", "url": "https://scitechdaily.com/scientists-identify-4-important-warning-signs-of-early-onset-colon-cancer/", "urlToImage": "https://scitechdaily.com/images/Colon-Cancer-Illustration.jpg", "publishedAt": "2023-05-13T16:10:10Z", "content": "Early-onset colorectal cancer refers to the development of colorectal cancer in individuals under the age of 50. This type of cancer is less common than other forms of colorectal cancer, but it is be… [+5597 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Could Low Vitamin D Influence Long-COVID Risk? - Neuroscience News", "description": "New research suggests a link between low vitamin D levels and an increased risk of long COVID.", "url": "https://neurosciencenews.com/vitamin-d-long-covid-23230/", "urlToImage": "https://neurosciencenews.com/files/2023/05/vitamin-d-long-covid-neurosince.jpg", "publishedAt": "2023-05-13T14:45:57Z", "content": "Summary: New research suggests a link between low vitamin D levels and an increased risk of long COVID. The condition, which extends COVID-19 symptoms beyond 12 weeks, affects a significant percentag… [+6255 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Common Seizure Drug Blocks Deadly Brain Cancer Growth - Neuroscience News", "description": "Researchers discovered that the drug gabapentin, commonly used to prevent seizures, could inhibit this activity in mice with glioblastoma.", "url": "https://neurosciencenews.com/glioblstoma-cancer-brain-neuropharmacology-23224/", "urlToImage": "https://neurosciencenews.com/files/2023/05/brain-cancere-neuropharmacology-neurosicence.jpg", "publishedAt": "2023-05-12T17:43:42Z", "content": "Summary: Researchers discovered a promising new avenue for treating glioblastoma, a deadly brain cancer.\r\nThe study found that these tumors restructure connections in surrounding brain tissue, leadin… [+8101 chars]"}, {"source": {"id": null, "name": "Homesandgardens.com"}, "author": "Lucy Searle", "title": "How to get rid of turmeric stains: an expert guide | - Homes & Gardens", "description": "Yes, there are fail-safe ways to get rid of those yellow-orange stains", "url": "https://www.homesandgardens.com/life-design/how-to-get-rid-of-turmeric-stains", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bG3KhEYqL9VKjgafAafKo-1200-80.jpg", "publishedAt": "2023-05-12T16:28:16Z", "content": "I love to cook with turmeric, but hate the stains it leaves on my countertops and, if I'm careless, my clothes.\r\nI've often resorted to bleach and scrubbing, never quite getting the stain-free result… [+5962 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "Scientists find bat protein that can slow aging and even fight Covid, heart disease and arthritis - Daily Mail", "description": "Bats live for around 20 years and are unharmed from pathogens deadly to humans such as Ebola and Covid. This has led scientists to investigate if their resilience can work for humans too.", "url": "https://www.dailymail.co.uk/health/article-12074441/Scientists-bat-protein-slow-aging-fight-Covid-heart-disease-arthritis.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/12/15/70910629-0-image-a-7_1683900694026.jpg", "publishedAt": "2023-05-12T15:06:13Z", "content": "A protein from bats could contain the key to slowing human aging and fight off conditions like Covid, heart disease and arthritis, a study suggests.\r\nBats live for around 20 years on average, and are… [+3670 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "6 Foods That Are Disrupting Your Gut Health - NDTV", "description": "Diet plays a significant role in determining gut health. Making healthy food choices can ensure normal bowl movements", "url": "https://www.ndtv.com/health/6-foods-that-are-disrupting-your-gut-health-4029281", "urlToImage": "https://c.ndtvimg.com/2023-02/4l359ne8_gut-health_625x300_17_February_23.jpg", "publishedAt": "2023-05-12T14:07:19Z", "content": "Poor diet choices can increase your risk of gut-related issues\r\nThe gut plays a crucial role in our immune system, metabolism, digestion, and overall health. The gut is home to millions of beneficial… [+1892 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Maria Okanrende", "title": "We're nutrition experts and these are 5 foods we wouldn't eat for breakfast - Daily Mail", "description": "Dietitian Natalie Forester told The Sun that opting for natural, unprocessed foods to start the day should always be your first step - and revealed why white toast is a no-no.", "url": "https://www.dailymail.co.uk/femail/article-12076097/Were-nutrition-experts-5-foods-wouldnt-eat-breakfast.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/12/09/70898593-0-image-a-3_1683878970563.jpg", "publishedAt": "2023-05-12T10:07:33Z", "content": "Breakfast is touted as the most important meal of the day, however a balanced diet is just as crucial.\r\nThat's why two nutrition experts have revealed the top breakfast foods to avoid if you want to … [+3758 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "6 Medical Conditions That Can Cause Back Pain | TheHealthSite.com - TheHealthSite", "description": "Your back pain may be a symptom of an underlying medical condition. Following are some medical conditions that can cause back pain.  TheHealthSite.com", "url": "https://www.thehealthsite.com/photo-gallery/6-medical-conditions-that-can-cause-back-pain-977332/", "urlToImage": "https://www.thehealthsite.com/wp-content/uploads/2023/05/Medical-Conditions-That-Can-Cause-Back-Pain-1.jpg", "publishedAt": "2023-05-12T07:19:05Z", "content": "TheHealthSite.com is India's fastest growing health information site with a team of health professionals and writers committed to providing unique, authentic, credible, well-researched, and timely in… [+355 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Rachel Hosie", "title": "3 high protein recipes for fat loss, from sports nutritionist - Insider", "description": "\"The Ultimate High Protein Handbook\" is full of easy recipes that everyone will enjoy to help you lose fat, maintain muscle, and curb cravings.", "url": "https://www.insider.com/high-protein-recipes-for-fat-loss-muscle-gain-sports-nutritionist-2023-5", "urlToImage": "https://i.insider.com/645bc15ad391de0019bd646e?width=1200&format=jpeg", "publishedAt": "2023-05-11T17:22:00Z", "content": "Eating a high protein diet is crucial for fat loss and muscle maintenance, but that doesn't mean only eating plain chicken, hard-boiled eggs, and protein shakes.\r\nSports nutritionist, weight loss coa… [+6419 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Jonathan R. Goodman", "title": "Psychopaths: why they've thrived through evolutionary history – and how that may change - PsyPost", "description": "From an evolutionary point of view, psychopathy is puzzling. Given that psychopathic traits are so negative, why do they remain in successive generations? Assuming there’s a genetic component to this family of disorders, we’d expect it to decrease over time. …", "url": "https://www.psypost.org/2023/05/psychopaths-why-theyve-thrived-through-evolutionary-history-and-how-that-may-change-159763", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/04/dark-evil-psychopathic-businessman.jpg", "publishedAt": "2023-05-11T16:05:50Z", "content": "When you start to notice them, psychopaths seem to be everywhere. This is especially true of people in powerful places. By one estimate, as many as 20% of business leaders have clinically relevant le… [+6305 chars]"}]}