{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sleeping Too Little or Too Much Is Linked With a Shorter Life – But There Is a Simple Way To Counteract These Negative Effects - SciTechDaily", "description": "Engaging in physical exercise can mitigate the negative effects of insufficient or excessive sleep on lifespan, according to a study of over 90,000 adults. The research suggests that promoting both physical activity and proper sleep duration is more effective…", "url": "https://scitechdaily.com/sleeping-too-little-or-too-much-is-linked-with-a-shorter-life-but-there-is-a-simple-way-to-counteract-these-negative-effects/", "urlToImage": "https://scitechdaily.com/images/Woman-Sleeping-in-Bed-at-Night.jpg", "publishedAt": "2023-04-10T08:24:47Z", "content": "A recent study has found that physical activity can counteract some of the negative effects of sleeping too little or too long. Involving over 90,000 adults, the research used accelerometer devices t… [+5740 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "These are the nine foods dietitians say are hampering your weight loss goals - Daily Mail", "description": "If it feels like you can never shift those last few pounds despite eating 'clean', experts say it's probably due to a handful of key food groups, three top US dieticians have told DailyMail.com.", "url": "https://www.dailymail.co.uk/health/article-11937919/These-nine-foods-dietitians-say-hampering-weight-loss-goals.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/22/69513329-0-image-a-24_1680728515181.jpg", "publishedAt": "2023-04-09T16:49:07Z", "content": "By now, anyone embarking on a weight loss journey knows the basics avoid junk food, sugary sodas and candies.\r\nBut if it feels like you can never shift those last few pounds despite eating 'clean', e… [+12304 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Life-saving vaccines for cancer, heart diseases to be available by 2030 - Geo News", "description": "If a sufficient amount of funding is not provided for the cause, all efforts of years would be wasted, warn experts", "url": "https://www.geo.tv/latest/481192-life-saving-vaccines-for-cancer-heart-diseases-to-be-available-by-2030", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-09/481192_054702_updates.jpg", "publishedAt": "2023-04-09T15:56:00Z", "content": "Experts have said that new vaccines aimed to cure heart diseases and autoimmune diseases can potentially save millions of lives around the world.\r\nAdditionally, Dr Paul Burton of Medorna also maintai… [+5801 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Here are some signs that may indicate heart attack - Geo News", "description": "Overall chances of survival from a heart attack are seven in 10 but chances increase for those who reach hospital early", "url": "https://www.geo.tv/latest/481154-here-are-some-signs-that-may-indicate-heart-attack", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-09/481154_024804_updates.jpg", "publishedAt": "2023-04-09T10:23:00Z", "content": "Cardiovascular diseases (CVD) are the leading cause of death globally. However, the overall chances of survival from a heart attack are seven in 10 but the chances increase for those who reach the ho… [+1927 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Magnesium Magic: New Drug Delivers Weight Loss Even on Sugary, Fatty Diet - SciTechDaily", "description": "Compound limits magnesium transport in cellular power plants called mitochondria. A small-molecule drug, CPACC, developed by researchers, has been shown to prevent weight gain and liver issues in mice by limiting magnesium transport in cellular power plants, …", "url": "https://scitechdaily.com/magnesium-magic-new-drug-delivers-weight-loss-even-on-sugary-fatty-diet/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss.jpg", "publishedAt": "2023-04-09T09:51:57Z", "content": "ByUniversity of Texas Health Science Center at San AntonioApril 9, 2023\r\nResearchers at UT Health San Antonio, along with collaborators from the University of Pennsylvania and Cornell University, hav… [+5755 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Five healthy foods that could raise your cholesterol levels, nutritionist urges warning - Express", "description": "From Greek yoghurt to granola, certain healthy staples could be packed with saturated fat and sugar, raising your cholesterol levels, according to an expert.", "url": "https://www.express.co.uk/life-style/health/1756011/high-cholesterol-diet-risk-greek-yoghurt-prawns-granola", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4677407.jpg?r=1680873097067", "publishedAt": "2023-04-09T03:00:00Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Pandemic May Have Triggered Second \"Midlife Crisis\" for Over-50s - Neuroscience News", "description": "Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second \"midlife crisis\" in those aged 50 and older. Researchers say women struggled more than men with psychological distress during the pandemic, and this may exace…", "url": "https://neurosciencenews.com/pandemic-midlife-crisis-22971/", "urlToImage": "https://neurosciencenews.com/files/2023/04/midlife-crisis-pandemic-neurosicencce-public.jpg", "publishedAt": "2023-04-08T23:27:29Z", "content": "Summary: Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second “midlife crisis” in those aged 50 and older. Researchers say women struggled more than me… [+6658 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Dr. Adrian Wong", "title": "Did Switzerland Stop All COVID-19 Vaccinations?! - Tech ARP", "description": "Did Switzerland just order a stop to all COVID-19 vaccinations?! Take a look at the viral claim, and find out what the facts really are!", "url": "https://www.techarp.com/facts/switzerland-covid-19-vaccinations/", "urlToImage": "https://www.techarp.com/wp-content/uploads/2023/04/Switzerland-stop-COVID-19-vaccination-fact-check.jpg", "publishedAt": "2023-04-08T20:34:20Z", "content": "Did Switzerland just order a stop to all COVID-19 vaccinations?!\r\nTake a look at the viral claim, and find out what the facts really are!\r\nClaim : Switzerland Stops All COVID-19 Vaccinations!\r\nPeople… [+4833 chars]"}]}