{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover a New Potential Way To Stop Dementia Progression - SciTechDaily", "description": "Scientists from the University of Helsinki have successfully demonstrated that a compound known as a PREP inhibitor can prevent the build-up of a harmful protein responsible for memory disorders, among other things. This harmful protein buildup, similar to th…", "url": "https://scitechdaily.com/scientists-discover-a-new-potential-way-to-stop-dementia-progression/", "urlToImage": "https://scitechdaily.com/images/Neuroscience-Brain-Mapping-Confusion-Dementia.jpg", "publishedAt": "2023-06-26T08:23:46Z", "content": "ByUniversity of HelsinkiJune 26, 2023\r\nDementia, a prevalent and distressing neurodegenerative disorder, exerts its grip on countless individuals across the globe. This condition manifests through a … [+3667 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Neanderthal Handshake: Unraveling the Genetic Origins of “Viking Disease” - SciTechDaily", "description": "Dupuytren's disease, a hand disorder common among Northern Europeans, is found to have genetic links to Neanderthals, according to a study in Molecular Biology and Evolution. Three of the 61 genetic risk variants for the disease identified by researchers are …", "url": "https://scitechdaily.com/the-neanderthal-handshake-unraveling-the-genetic-origins-of-viking-disease/", "urlToImage": "https://scitechdaily.com/images/Bent-Hand-Viking-Disease.jpg", "publishedAt": "2023-06-26T04:15:05Z", "content": "A ring finger locked in a bent position as seen in Dupuytrens disease, colloquially known as the Viking disease. Credit: Hugo Zeberg/ Molecular Biology and Evolution\r\nDupuytrens disease, a hand disor… [+3443 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": null, "title": "If Humans Went Extinct, What Would The Earth Look Like One Year Later? - IFLScience", "description": "Have You Ever Wondered What The World Would Be Like If Everyone Suddenly Disappeared?", "url": "https://www.iflscience.com/if-humans-went-extinct-what-would-the-earth-look-like-one-year-later-69510", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69510/aImg/68784/world-meta.jpg", "publishedAt": "2023-06-25T20:19:20Z", "content": "Curious Kids is a series for children of all ages. If you have a question youd like an expert to answer, send it to curiouskidsus@theconversation.com.\r\nIf humans went extinct, what would the Earth lo… [+6382 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Miriam E. Tucker", "title": "Surgery, Radioactive Iodine for Hyperthyroidism Up Survival - Medscape", "description": "In large cohort study, both radioactive iodine and thyroidectomy extended longevity compared with antithyroid medications, while surgery raised the risk for weight gain.", "url": "https://www.medscape.com/viewarticle/993669", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230625_woman_hyperthyroidism_800x450.jpg", "publishedAt": "2023-06-25T17:41:47Z", "content": "CHICAGO Treatment of hyperthyroidism with surgery or radioactive iodine significantly extends survival compared to antithyroid medication, while surgery raises the risk for obesity, new data from a l… [+7441 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Cognitive Biotype: A Novel Depression Subcategory Defying Conventional Treatments Identified - Neuroscience News", "description": "Researchers discovered a new depression subtype, the 'cognitive biotype,' affecting 27% of patients who respond poorly to typically prescribed antidepressants.", "url": "https://neurosciencenews.com/cognitive-biotype-a-novel-depression-subcategory-defying-conventional-treatments-identified/", "urlToImage": "https://neurosciencenews.com/files/2023/06/depression-cognitive-biotype.jpg", "publishedAt": "2023-06-24T17:29:58Z", "content": "Summary: Researchers discovered a new depression subtype, the ‘cognitive biotype,’ affecting 27% of patients who respond poorly to typically prescribed antidepressants. These patients struggle with p… [+12270 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Intelligence and thinking speed: Surprising relationship revealed in a recent study - PsyPost", "description": "A recent study challenges the belief that intelligent people think faster, finding that individuals with higher problem-solving abilities actually took more time to solve difficult tasks compared to those with lower abilities. The research suggests that synch…", "url": "https://www.psypost.org/2023/06/intelligence-and-thinking-speed-surprising-relationship-revealed-in-a-recent-study-165950", "urlToImage": "https://www.psypost.org/wp-content/uploads/2022/03/brain.jpg", "publishedAt": "2023-06-24T11:13:48Z", "content": "A recently published study challenges the conventional belief that intelligent people think faster. The study discovered that people with higher fluid intelligence, which is a measure of problem-solv… [+5184 chars]"}]}