{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Missing Link Between Risk Genes Associated With Alzheimer’s Disease Discovered - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/alzheimers-genetics-23013/", "urlToImage": null, "publishedAt": "2023-04-14T20:34:25Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Disrupted Rhythms of Rest and Wakefulness Contribute to Worse Symptoms in Schizophrenia Patients - Neuroscience News", "description": "Those with schizophrenia who had more erratic sleep patterns, excessively rigid daily routines, and dysregulated patterns between sleep and wake transition had worse symptoms associated with schizophrenia and poorer quality of life.", "url": "https://neurosciencenews.com/schizophrenia-sleep-wake-23011/", "urlToImage": "https://neurosciencenews.com/files/2023/04/sleep-wake-schizophrenia-neuroscience-public.jpg", "publishedAt": "2023-04-14T19:46:07Z", "content": "Summary: Those with schizophrenia who had more erratic sleep patterns, excessively rigid daily routines, and dysregulated patterns between sleep and wake transition had worse symptoms associated with… [+7364 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "I'm a stomach doctor: Here is what the shape of your poop means about your bowel health - Daily Mail", "description": "Dr Nigma Talib (at left), a naturopathic doctor, went viral after explaining what different shapes of poop signify for health. While some effects are minor, others could point to serious health problems.", "url": "https://www.dailymail.co.uk/health/article-11973595/Im-stomach-doctor-shape-poop-means-bowel-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/14/18/69842169-0-image-a-5_1681495172770.jpg", "publishedAt": "2023-04-14T19:14:06Z", "content": "Dr Nigma Talib is a naturopathic doctor and gut health expert who shared on TikTok what different stool shapes show about overall health\r\nA doctor has revealed the shocking reason our stools are diff… [+4001 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "3D Printed Artificial Nose Is Totally Vegan - Hackaday", "description": "Prosthetics are complicated, highly personal things. They must often be crafted and customized precisely to suit the individual. Additive manufacturing is proving a useful tool in this arena, as de…", "url": "https://hackaday.com/2023/04/14/3d-printed-artificial-nose-is-totally-vegan/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/04/123638142_scarring_printedear.jpg-e1681286968510.webp", "publishedAt": "2023-04-14T18:30:00Z", "content": "Prosthetics are complicated, highly personal things. They must often be crafted and customized precisely to suit the individual. Additive manufacturing is proving a useful tool in this arena, as demo… [+1162 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Kombucha to Kimchi: Unveiling the Best Fermented Foods for Boosting Brain Health - SciTechDaily", "description": "A study on the effects of fermented foods on brain health has revealed that nearly all of the 200 fermented foods analyzed showed potential for improving gut and brain health. Fermented sugar-based and vegetable-based products demonstrated the most significan…", "url": "https://scitechdaily.com/?p=268412", "urlToImage": "https://scitechdaily.com/images/Brain-Boost-Mental-Focus-Clarity-Concept.jpg", "publishedAt": "2023-04-14T18:25:20Z", "content": "ByMicrobiology SocietyApril 14, 2023\r\nResearchers are conducting a large study to determine the impact of fermented foods on brain health. Preliminary results have shown that almost all of the 200 fe… [+5274 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Novel device smaller than rice successfully shrinks pancreatic cancer - Interesting Engineering", "description": "By precisely delivering the NDES into the tumor, the device protects the body from being exposed to the powerful cancer drug.", "url": "https://interestingengineering.com/innovation/tiny-device-shrinks-pancreatic-cancer", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/14/image/jpeg/lTkflnaMR8Bl45huKKV54LyiaOiBtQDCYl2XwXQl.jpg", "publishedAt": "2023-04-14T15:29:00Z", "content": "Nano-device uses less dosage to shrink cancer \r\nThe nanofluidic drug-eluting seed (NDES) delivers low-dose immunotherapy in the form of CD40 monoclonal antibodies (mAb).\r\nAs seen in murine models, th… [+1630 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "John Ely Senior", "title": "Over-65s with dementia are up to FIVE TIMES more likely to die from Covid - Daily Mail", "description": "Analysis from the Office for National Statistics found men over the age of 65 with dementia had a 4.7 times greater risk of dying from the virus in 2022, compared to those who didn't have the condition.", "url": "https://www.dailymail.co.uk/health/article-11972733/Over-65s-dementia-FIVE-TIMES-likely-die-Covid.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/14/13/69829751-0-image-a-15_1681474082395.jpg", "publishedAt": "2023-04-14T13:54:38Z", "content": "Older Brits with dementia can be up to five times more likely to die if they catch Covid, compared to those that don't, official death data suggests.  \r\nAnalysis from the Office for National Statisti… [+4797 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Rachel Hall", "title": "Major study reveals genetic causes of severe developmental disorders - The Guardian", "description": "Genome sequencing of children with rare conditions should improve speed and accuracy of NHS diagnoses", "url": "https://www.theguardian.com/science/2023/apr/14/major-study-reveals-genetic-causes-of-severe-developmental-disorders", "urlToImage": "https://i.guim.co.uk/img/media/73340b5b613501da9d70ce6f09b8f4a51e90ebe3/0_81_1440_864/master/1440.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=aa85f7a3e0ce909a88222ac31dfef80d", "publishedAt": "2023-04-14T12:00:00Z", "content": "About 5,500 people with severe developmental disorders now know the genetic cause of their condition thanks to a major study that will be used to improve the speed and accuracy of NHS diagnoses.\r\nMor… [+3958 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Maternally Inherited Diseases: New Technology Uncovers Hidden Mitochondrial DNA Mutations - SciTechDaily", "description": "A high-throughput single-cell single-mitochondrial genome sequencing technology known as iMiGseq has provided new insights into mutations of mitochondrial DNA (mtDNA) and offers a platform for assessing mtDNA editing strategies and genetic diagnosis of embryo…", "url": "https://scitechdaily.com/maternally-inherited-diseases-new-technology-uncovers-hidden-mitochondrial-dna-mutations/", "urlToImage": "https://scitechdaily.com/images/Human-Blastocyst-Like-Synthetic-Embryo-Called-Blastoid.jpg", "publishedAt": "2023-04-14T11:35:55Z", "content": "ByKing Abdullah University of Science &amp; Technology (KAUST)April 14, 2023\r\nA human blastocyst-like synthetic embryo called blastoid showing the presence of an enveloping layer of extra-embryonic c… [+6518 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Association between hearing aid use and all-cause and cause-specific dementia: an analysis of the UK Biobank cohort - The Lancet", "description": "In people with hearing loss, hearing aid use is associated with a risk of dementia\nof a similar level to that of people without hearing loss. With the postulation that\nup to 8% of dementia cases could be prevented with proper hearing loss management,\nour find…", "url": "https://www.thelancet.com/journals/lanpub/article/PIIS2468-2667%2823%2900048-8/fulltext", "urlToImage": "https://www.thelancet.com/pb-assets/Lancet/lanpub/ogImg-1592318591217.png", "publishedAt": "2023-04-13T22:32:28Z", "content": "The content on this site is intended for science and health care professionals.\r\nWe use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, ple… [+254 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Study Casts Doubt on Causal Link Between Cognitive Ability and Obesity - Neuroscience News", "description": null, "url": "https://neurosciencenews.com/cognition-ability-23009/", "urlToImage": null, "publishedAt": "2023-04-13T21:27:58Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kelsi Karruli", "title": "I'm a dietitian, here are the TikTok diets you should avoid - Daily Mail", "description": "New York dietitian Lisa Young has debunked the wildest diets seen on TikTok and even revealed the ones that may actually help you shed off pounds - from counting calories to consuming baby food.", "url": "https://www.dailymail.co.uk/femail/article-11968947/Im-dietitian-TikTok-diets-avoid.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/13/18/69792915-0-image-a-58_1681406778963.jpg", "publishedAt": "2023-04-13T19:45:27Z", "content": "A health expert has debunked the wildest diets seen on TikTok and even revealed the ones that may actually help you shed off the pounds.\r\nLisa Young - a registered dietitian nutritionist at New York … [+9299 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "I have more than a HUNDRED tumors in my body. But I'm still fighting - Daily Mail", "description": "Michele Holbrook (shown left and right) has a rare form of neurofibromatosis, which causes her to grow tumors all over her body. Tumors grow in the brain, pelvis, spine, and chest cavity (shown in inset).", "url": "https://www.dailymail.co.uk/health/article-11965179/I-tumors-body-Im-fighting.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/13/16/69795643-0-image-a-10_1681401461468.jpg", "publishedAt": "2023-04-13T16:51:42Z", "content": "A Florida woman who has more than 100 tumors growing in her body is still fighting 30 years later. \r\nMichele Holbrook, 56, has a rare condition that causes her body to grow small masses along nerves … [+5663 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rebecca Whittaker", "title": "I'm a vascular surgeon - these are the five warning signs that you've got bad circulation - Daily Mail", "description": "Being obese, smoking and having diabetes raises the risk of poor circulation. MailOnline reveals some of the unexpected warning signs, according to a London-based vascular surgeon.", "url": "https://www.dailymail.co.uk/health/article-11960577/Im-vascular-surgeon-five-warning-signs-youve-got-bad-circulation.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/12/10/69739697-0-image-a-15_1681291852876.jpg", "publishedAt": "2023-04-13T07:16:07Z", "content": "Cold hands and feet are a common bugbear and they're also tell-tale signs that you have poor circulation. \r\nBut they aren't the only giveaways, experts say. \r\nHere, MailOnline reveals some of the une… [+6374 chars]"}]}