{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Man who cut off his pinky while drunk 20 years ago FINALLY gets a 3D-printed finger - Daily Mail", "description": "A Nebraska man was gifted a 3D-printed prosthetic 20 years after accidently chopping his pinky off with a power tool. The design is also cheaper than the $20,000 price tag of a medial prosthetic.", "url": "https://www.dailymail.co.uk/sciencetech/article-11920473/Man-cut-pinky-drunk-20-years-ago-FINALLY-gets-3D-printed-finger.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/30/16/69295427-0-image-a-3_1680188868065.jpg", "publishedAt": "2023-03-30T15:50:00Z", "content": "A Nebraska man who chopped his pinky off with a power tool while drinking 20 years ago has finally received a new finger with the help of modern technology.\r\nAdam Cutshall, 47, was gifted a 3D-printe… [+4035 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Here are top five stress relievers you should know about - The News International", "description": "Stress is a term used to describe the body's response to a perceived threat or challenge. Many of us do not realise it but stress is a natural and normal response that can be triggered by both...", "url": "https://www.thenews.com.pk/latest/1055577-here-are-top-five-stress-relievers-you-should-know-about", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-03-30/1055577_064807_updates.jpg", "publishedAt": "2023-03-30T13:47:00Z", "content": "Stress is a term used to describe the body's response to a perceived threat or challenge. Many of us do not realise it but stress is a natural and normal response that can be triggered by both positi… [+2814 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Stearn", "title": "I'm a podiatrist - here's what your feet say about your health - Daily Mail", "description": "From pesky cracked heels to more serious problems, such as swelling, feet often show signs of disease before any other part of your body, says Emma McConnachie, a podiatrist in Falkirk, Scotland.", "url": "https://www.dailymail.co.uk/health/article-11915463/Im-podiatrist-heres-feet-say-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/30/10/69283891-0-image-a-7_1680169672774.jpg", "publishedAt": "2023-03-30T11:35:27Z", "content": "You might not think it but your feet can tell you a surprising amount about your health.\r\nFrom pesky cracked heels and calluses to more serious problems, such as swelling, they often show signs of di… [+9304 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Eleanor Hayward", "title": "Run for your life: exercise 'wipes out' heart disease risk from insomnia - The Times", "description": "After a bad night’s sleep, the thought of dragging yourself out of bed to go for a run can seem especially unappealing. However, a study has found that exerci", "url": "https://www.thetimes.co.uk/article/run-for-your-life-exercise-wipes-out-heart-disease-risk-from-insomnia-5f5xsjzzz", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F1b256396-ce49-11ed-9a00-73fd2b90e22e.jpg?crop=3700%2C2081%2C0%2C193&resize=1200", "publishedAt": "2023-03-29T23:01:00Z", "content": "After a bad nights sleep, the thought of dragging yourself out of bed to go for a run can seem especially unappealing.\r\nHowever, a study has found that exercise becomes even more important if you hav… [+541 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Comparison of seven popular structured dietary programmes and risk of mortality and major cardiovascular events in patients at increased cardiovascular risk: systematic review and network meta-analysis - The BMJ", "description": "Objective To determine the relative efficacy of structured named diet and health behaviour programmes (dietary programmes) for prevention of mortality and major cardiovascular events in patients at increased risk of cardiovascular disease.\n\nDesign Systematic …", "url": "https://www.bmj.com/content/380/bmj-2022-072003", "urlToImage": "https://www.bmj.com/sites/default/files/highwire/bmj/380/8376.cover-source.jpg", "publishedAt": "2023-03-29T22:45:02Z", "content": "Abstract\r\nObjective To determine the relative efficacy of structured named diet and health behaviour programmes (dietary programmes) for prevention of mortality and major cardiovascular events in pat… [+5117 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Spatial multiomics map of trophoblast development in early pregnancy - Nature.com", "description": "A multiomics single-cell atlas of the human maternal–fetal interface including the myometrium, combining spatial transcriptomics data with chromatin accessibility, provides a comprehensive analysis of cell states as placental cells infiltrate the uterus durin…", "url": "https://www.nature.com/articles/s41586-023-05869-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05869-0/MediaObjects/41586_2023_5869_Fig1_HTML.png", "publishedAt": "2023-03-29T15:33:45Z", "content": "Human samples\r\nPlacental and decidual samples used for the in vivo and in vitro profiling were obtained from elective terminations from: The MRC and Wellcome-funded Human Developmental Biology Resour… [+48769 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Josephine Franks", "title": "Next wave of weight loss jabs could be coming - without the nausea Ozempic and Wegovy can cause - Sky News", "description": "", "url": "https://news.sky.com/story/next-wave-of-weight-loss-jabs-could-be-coming-without-the-nausea-ozempic-and-wegovy-can-cause-12844910", "urlToImage": "https://e3.365dm.com/19/04/1600x900/skynews-man-bathroom-scales_4634580.jpg?20190410090702", "publishedAt": "2023-03-29T14:23:34Z", "content": "Weight loss jabs such as Ozempic and Wegovy have been hailed as the future of obesity treatment - but some users are debilitated by nausea and regain the lost pounds as soon as they stop injections. … [+2491 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Austėja Akavickaitė", "title": "People Who've Been To Or Worked In Psychiatric Hospitals Share The Most Messed Up Things They've Witnessed (73 Stories) - Bored Panda", "description": "Mental health continues to be a topic that many people ignore entirely. Some think it’s taboo to speak about it openly. Others might rush to judge those with mental health issues without digging deeper. While still others choose to ignore their problems inste…", "url": "https://www.boredpanda.com/weirdest-things-witnessed-psych-ward/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/03/craziest-things-witnessed-psych-ward-fb64.png", "publishedAt": "2023-03-29T10:26:56Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Losing weight cuts your risk of heart attacks and type 2 diabetes - even if you put it back on - Daily Mail", "description": "Oxford University researchers found those who shed the pounds still enjoyed health benefits five years later, even if they regained a proportion of the weight.", "url": "https://www.dailymail.co.uk/health/article-11914501/Losing-weight-cuts-risk-heart-attacks-type-2-diabetes-on.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/29/08/69237481-0-image-a-3_1680073829878.jpg", "publishedAt": "2023-03-29T07:17:44Z", "content": "Losing weight can cut the chances of heart attacks and type 2 diabetes even if you put some of it back on.\r\nOxford University researchers found those who shed the pounds still enjoyed health benefits… [+3482 chars]"}]}