{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Megan Rossi", "title": "DR MEGAN ROSSI: Steam, boil, bake, fry (or even barbecue): Which is the healthiest? - Daily Mail", "description": "DR MEGAN ROSSI: If you want to get the maximum goodness from your diet, you need to vary your cooking style - don't stick to the same old routine.", "url": "https://www.dailymail.co.uk/health/article-12136825/DR-MEGAN-ROSSI-Steam-boil-bake-fry-barbecue-healthiest.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/29/18/71539321-0-image-a-10_1685380964123.jpg", "publishedAt": "2023-05-29T19:24:30Z", "content": "If you're one of those people who always steams their vegetables in the belief that it's the healthiest way to cook, I'm afraid I'm going to have to disappoint you.\r\nFor steaming is not always the be… [+9447 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Vladimir Hedrih", "title": "Diversity of the gut microbiota is associated with the severity of depression - PsyPost", "description": "A new study indicates that microbial diversity in the gut is closely related to the severity of the major depressive disorder. Compared to healthy individuals, the abundance of Bacteroides species was significantly increased in participants with moderate and …", "url": "https://www.psypost.org/2023/05/diversity-of-the-gut-microbiota-is-associated-with-the-severity-of-depression-163866", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/bacteria-in-gut.jpg", "publishedAt": "2023-05-29T17:15:14Z", "content": "A new study indicates that microbial diversity in the gut is closely related to the severity of the major depressive disorder. Compared to healthy individuals, the abundance of Bacteroides species wa… [+5108 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gene Therapy Breakthrough in Treatment of Age-Related Hearing Loss - SciTechDaily", "description": "Researchers at Mass Eye and Ear, part of Mass General Brigham, have successfully used adeno-associated virus vectors in gene therapies to treat genetic hearing loss in aged mouse models. This breakthrough suggests the potential for similar therapies to treat …", "url": "https://scitechdaily.com/gene-therapy-breakthrough-in-treatment-of-age-related-hearing-loss/", "urlToImage": "https://scitechdaily.com/images/Ear-Hearing-Concept.jpg", "publishedAt": "2023-05-29T09:45:43Z", "content": "ByMassachusetts Eye and Ear InfirmaryMay 29, 2023\r\nA recent breakthrough by a research team from Mass Eye and Ear, part of Mass General Brigham, demonstrated successful application of adeno-associate… [+3760 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Max Pemberton", "title": "Six ways to stop your anxiety from spiralling out of control, from the Mind Doctor DR MAX PEMBERTON - Daily Mail", "description": "While we hear a lot about depression these days, anxiety is actually far more common, affecting about one in six adults. Dr MAX PEMBERTON shares six simple strategies that can make all the difference.", "url": "https://www.dailymail.co.uk/femail/article-12133795/Six-ways-stop-anxiety-spiralling-control-Mind-Doctor-DR-MAX-PEMBERTON.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/28/23/71511595-0-image-a-5_1685313077370.jpg", "publishedAt": "2023-05-28T22:54:51Z", "content": "While we read and hear a lot about depression these days, anxiety is actually far more common, affecting about one in six adults. \r\nA seriously debilitating condition, it often goes hand in hand with… [+7875 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Tips for avoiding mosquitoes this summer - The News International", "description": "In many regions of the country, mosquito season has begun as a result of warmer temperatures and rain. Mosquito season means an increase in mosquito bites. Entomologist Sonja Swiger, PhD, of...", "url": "https://www.thenews.com.pk/latest/1074744-tips-for-avoiding-mosquitoes-this-summer", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-05-28/1074744_101746_updates.jpg", "publishedAt": "2023-05-28T17:56:00Z", "content": "In many regions of the country, mosquito season has begun as a result of warmer temperatures and rain. \r\nMosquito season means an increase in mosquito bites. Entomologist Sonja Swiger, PhD, of Texas … [+3006 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Emily Manis", "title": "Sun avoidance and lack of vitamin D dietary intake linked to heightened anxiety among college women - PsyPost", "description": "Have you ever heard that sunshine is the best medicine? Well, it might be medicine for your mental health. A study published in Nutrients suggests that sun avoidance and lower vitamin D intake are associated with higher levels of anxiety. ...", "url": "https://www.psypost.org/2023/05/sun-avoidance-and-lack-of-vitamin-d-dietary-intake-linked-to-heightened-anxiety-among-college-women-163787", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/happy-woman-outside-in-the-sun.jpg", "publishedAt": "2023-05-28T11:09:15Z", "content": "Have you ever heard that sunshine is the best medicine? Well, it might be medicine for your mental health. A study published in Nutrients suggests that sun avoidance and lower vitamin D intake are as… [+4076 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Jane McGuire", "title": "Can walking give you abs? We ask an expert - Tom's Guide", "description": "Here’s how to use walking as part of your fitness regime", "url": "https://www.tomsguide.com/news/can-walking-give-you-abs-we-ask-an-expert", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2BdSmKYTo7nwdfaQx6ZYYV-1200-80.jpg", "publishedAt": "2023-05-28T08:30:00Z", "content": "Walking is an excellent way to get fitter, tone up, and lose weight — it’s suitable for beginners, you don’t need any extra equipment, and it’s completely free! Whether you’re looking to add more ste… [+4102 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Three 'anti-inflammatory' foods that could reduce your risk of cancer - doctor advice - Express", "description": "From blueberries to kimchi, a doctor has recommended three foods that could stave off cancer.", "url": "https://www.express.co.uk/life-style/health/1774675/cancer-inflammation-reduce-risk-diet", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4774926.jpg?r=1685186098046", "publishedAt": "2023-05-28T03:00:00Z", "content": null}]}