{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Climbing Just 50 Steps a Day Can Cut Your Risk of Heart Disease by 20% - SciTechDaily", "description": "Forget walking 10,000 steps a day. Climbing at least 50 steps daily can greatly reduce the risk of heart disease, a new study from Tulane University suggests. Published in Atherosclerosis, the research found that climbing more than five flights of stairs dail…", "url": "https://scitechdaily.com/climbing-just-50-steps-a-day-can-cut-your-risk-of-heart-disease-by-20/", "urlToImage": "https://scitechdaily.com/images/Climbing-Stairs-Heart.jpg", "publishedAt": "2023-11-26T16:36:55Z", "content": "ByTulane UniversityNovember 26, 2023\r\nA study from Tulane University has found that climbing at least 50 steps or more than five flights of stairs daily can reduce the risk of heart disease by 20%. T… [+3307 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Why does hair turn grey? Journey of hair aging and potential solutions - Geo News", "description": "Historically, stress has been linked to premature greying, a connection now supported by research", "url": "https://www.geo.tv/latest/520548-why-does-hair-turn-grey-journey-of-hair-aging-and-potential-solutions", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-11-26/l_520548_070636_updates.jpg", "publishedAt": "2023-11-26T14:24:00Z", "content": "The enigma of why our hair turns grey has fascinated humanity for centuries, leading to various cultural beliefs and myths. \r\nAs science progresses, our understanding of this natural process expands,… [+1291 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "New research links dietary nutrient intake with cognitive health in older adults - PsyPost", "description": "A recent large-scale study suggests a link between higher intake of certain nutrients and a lower risk of cognitive impairment in older adults, indicating that diet plays a crucial role in maintaining cognitive health as we age. The research was motivated by …", "url": "https://www.psypost.org/2023/11/new-research-links-dietary-nutrient-intake-with-cognitive-health-in-older-adults-214730", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/11/brain-5.jpg", "publishedAt": "2023-11-26T12:03:05Z", "content": "Recent research has found a connection between higher intake of certain dietary nutrients and a lower risk of cognitive impairment in older adults. This large-scale study, involving thousands of part… [+6082 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "In New Doctor's Office, Stethoscope Wears You - Hackaday", "description": "The medical professional wearing a stethoscope is a familiar image, but Northwestern University wants to change that. Instead of someone hanging an ancient device around their neck to listen inside…", "url": "https://hackaday.com/2023/11/26/in-new-doctors-office-stethoscope-wears-you/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/11/mic.png", "publishedAt": "2023-11-26T12:00:00Z", "content": "The medical professional wearing a stethoscope is a familiar image, but Northwestern University wants to change that. Instead of someone hanging an ancient device around their neck to listen inside o… [+1279 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Scent of Hope: Innovative Treatment Restores Sense of Smell in Patients With Long COVID - SciTechDaily", "description": "Using an image-guided minimally invasive procedure, researchers may be able to restore the sense of smell in patients who have suffered with long-COVID, according to research being presented this week at the annual meeting of the Radiological Society of North…", "url": "https://scitechdaily.com/the-scent-of-hope-innovative-treatment-restores-sense-of-smell-in-patients-with-long-covid/", "urlToImage": "https://scitechdaily.com/images/Sense-of-Smell-Restored-Art-Concept.jpg", "publishedAt": "2023-11-26T11:15:34Z", "content": "ByRadiological Society of North AmericaNovember 26, 2023\r\nA new minimally invasive treatment using CT-guided stellate ganglion block shows promise in restoring the sense of smell in long-COVID patien… [+3736 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "E. coli can evolve to become virtually immune to common antibiotics - Interesting Engineering", "description": "According to a recent study, E. coli bacteria have the capacity to acquire an alarmingly high antibiotic resistance, more so than scientists previously assumed in past research.", "url": "https://interestingengineering.com/science/e-coli-can-evolve-to-become-virtually-immune-to-common-antibiotics", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/11/25/image/jpeg/5ba3ysHOufS3Df18AovfmGswg51VHxjPJ81IGR7L.jpg", "publishedAt": "2023-11-25T22:00:00Z", "content": "According to current fitness landscape theory, most E. coli populations will become imprisoned at lower peaks and never achieve the feared pinnacle of evolutionary adaptation that makes them immune t… [+1383 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Exercise Boosts Brain Power Amidst Sleep Deprivation - Neuroscience News", "description": "This groundbreaking study adds to the understanding of how physical activity can mitigate the cognitive deficits caused by common stressors.", "url": "https://neurosciencenews.com/exercise-sleep-deprivation-brain-25254/", "urlToImage": "https://neurosciencenews.com/files/2023/11/exercise-brain-sleep-neuroscience.jpg", "publishedAt": "2023-11-25T21:50:15Z", "content": "Summary: New research reveals that moderate exercise improves cognitive performance (CP) even under conditions of sleep deprivation and low oxygen levels.\r\nThe study involved two experiments with 24 … [+8948 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Alzheimers Alert: How much whole grains in diet can slow down memory loss in Blacks? - Geo News", "description": "Study on whole grain consumption, however, did not identify a similar trend among White participants", "url": "https://www.geo.tv/latest/520441-alzheimers-alert-how-much-whole-grains-in-diet-can-slow-down-memory-loss-in-blacks", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-11-25/l_520441_103148_updates.jpg", "publishedAt": "2023-11-25T17:07:28Z", "content": "A groundbreaking study published in the online issue of Neurology® on November 22, 2023, reveals a potential connection between increased whole grain consumption and a decelerated rate of memory decl… [+2283 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover Potentially Serious Side Effect of Common Cancer Drug - SciTechDaily", "description": "The research evaluated the occurrence, contributing factors, and treatment strategies for high blood sugar caused by alpelisib in individuals with metastatic breast cancer. Recent studies have revealed that breast cancer patients undergoing treatment with the…", "url": "https://scitechdaily.com/scientists-uncover-potentially-serious-side-effect-of-common-cancer-drug/", "urlToImage": "https://scitechdaily.com/images/Cancer-Cells-Illustration.jpg", "publishedAt": "2023-11-25T16:18:12Z", "content": "Recent research has revealed a significant occurrence of hyperglycemia in breast cancer patients treated with the drug alpelisib. The study highlights the importance of early detection and management… [+3787 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Want to get rid of thigh fat? 5 yoga poses that can help you - IndiaTimes", "description": "If you are someone who frequently refrains from wearing cherished outfits due to concerns about thigh appearance, which impacts your  self-confidence, you have come to the right place. Although these worries shouldn't diminish confidence, reducing thigh fat f…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/want-to-get-rid-of-thigh-fat-5-yoga-poses-that-can-help-you/photostory/105482192.cms", "urlToImage": "https://static.toiimg.com/photo/105482205.cms", "publishedAt": "2023-11-25T07:30:00Z", "content": "Evident by the name, Natarajasana is the dancer's pose. As the hips are stretched and the whole body engaged, it helps burn calories and tone your thighs. As you balance your body on one leg, it also… [+526 chars]"}, {"source": {"id": null, "name": "Marie Claire UK"}, "author": "Abbi Henderson", "title": "How to improve cardio fitness – 5 simple methods - Marie Claire UK", "description": "Did you know? Even five to ten minutes of exercise can improve your cardio fitness.", "url": "https://www.marieclaire.co.uk/life/health-fitness/how-to-improve-cardio-fitness", "urlToImage": "https://cdn.mos.cms.futurecdn.net/34ezZTyePuzXeApca93byg-1200-80.jpg", "publishedAt": "2023-11-25T07:07:38Z", "content": "If taking care of your health and athletic ability is high on your priority list, you’re probably keen to know how to improve cardio fitness. \r\nCardio fitness, in short, refers to the efficiency with… [+7252 chars]"}, {"source": {"id": null, "name": "Scientific American"}, "author": "John Krakauer, Tamar Makin", "title": "Human brains aren't as plastic as you might think - Livescience.com", "description": "The idea of treating neurological disorders by marshaling vast unused neural reserves is more wishful thinking than reality.", "url": "https://www.scientificamerican.com/article/the-brain-isnt-as-adaptable-as-some-neuroscientists-claim/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/G8hT33DGFUCgWbQQQjNoGe-1200-80.jpg", "publishedAt": "2023-11-24T20:35:19Z", "content": "The human brain's ability to adapt and change, known as neuroplasticity, has long captivated both the scientific community and the public imagination. It's a concept that brings hope and fascination,… [+8301 chars]"}]}