{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Therapeutic Target for Glaucoma Discovered - Neuroscience News", "description": "Restoring mitochondrial homeostasis in diseased neurons can protect the optic nerve from being damaged and potentially reverse symptoms of glaucoma.", "url": "https://neurosciencenews.com/mitochondria-glaucoma-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/gaulcoma-target-neurosicences-public.jpg", "publishedAt": "2023-03-10T21:50:38Z", "content": "Summary: Restoring mitochondrial homeostasis in diseased neurons can protect the optic nerve from being damaged and potentially reverse symptoms of glaucoma.\r\nSource: Indiana University\r\nIndiana Univ… [+4706 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "An Association Between Autism in Children and Cardiometabolic Diseases - Neuroscience News", "description": "As many as 1 in 44 children are diagnosed with autism, and those with ASD are at greater risk of obesity. Obesity has been linked to an increased risk of diabetes and other cardiometabolic diseases, including dyslipidemia. Researchers say physicians should mo…", "url": "https://neurosciencenews.com/asd-cardiometabolic-disease-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/asd-cardiometabolic-disease-neurosinces-public.jpg", "publishedAt": "2023-03-10T21:06:38Z", "content": "Summary: As many as 1 in 44 children are diagnosed with autism, and those with ASD are at greater risk of obesity. Obesity has been linked to an increased risk of diabetes and other cardiometabolic d… [+8981 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Astrocyte Cells Critical for Learning Skilled Movements - Neuroscience News", "description": "Study reveals two specific ways in which astrocytes directly impact motor learning.", "url": "https://neurosciencenews.com/astrocyte-motor-learning-22758/", "urlToImage": "https://neurosciencenews.com/files/2023/03/astrocytes-learning-neurosciences-public.jpg", "publishedAt": "2023-03-10T20:42:39Z", "content": "Summary: Study reveals two specific ways in which astrocytes directly impact motor learning.\r\nSource: Picower Institute for Learning and Memory\r\nFrom steering a car to swinging a tennis racket, we le… [+7045 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "Brushing your teeth properly today may lower your risk of arthritis later in life, a study suggests - Daily Mail", "description": "Researchers from Rice University in Texas found that regular visits to the dentist now might help prevent artthritis flareups later. Their study finds robust oral health can help prevent chronic joint pain.", "url": "https://www.dailymail.co.uk/health/article-11844665/Brushing-teeth-properly-today-lower-risk-arthritis-later-life-study-suggests.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/10/18/68563621-0-image-a-6_1678474309418.jpg", "publishedAt": "2023-03-10T19:15:15Z", "content": "Keeping your teeth clean can ward off the misery of arthritis flare ups, a new study suggests. \r\nBacteria associated with gum disease can worsen severe joint pain that worsens rheumatoid arthritis wh… [+4501 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Mo Costandi", "title": "The case for viewing depression as a consciousness disorder - Big Think", "description": "Depression might be similar to dreaming.", "url": "https://bigthink.com/neuropsych/depression-consciousness-disorder/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/03/Group-16558.png?resize=1200,630", "publishedAt": "2023-03-10T19:00:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Cassidy Morrison Senior", "title": "Woman's urine turns PURPLE after rare side effect of extreme constipation and UTI - Daily Mail", "description": "Doctors from University of Pikeville in Kentucky detailed a rare case in which an elderly woman's urine turned a deep purple, a complication of a severe bladder infection and constipation.", "url": "https://www.dailymail.co.uk/health/article-11845215/Womans-urine-turns-PURPLE-rare-effect-extreme-constipation-UTI.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/10/16/68559757-0-image-a-9_1678466882549.jpg", "publishedAt": "2023-03-10T17:56:05Z", "content": "Doctors in Kentucky have detailed a rare case in which an elderly womans urine turned deep purple due to a bladder infection complication.\r\nThe 76-year-old unnamed patient suffering from heart failur… [+4919 chars]"}, {"source": {"id": null, "name": "Runner's World (UK)"}, "author": null, "title": "Strength training beginners - Runner's World", "description": "New to lifting? Let these tips guide you towards a successful workout and better performance on the run", "url": "https://www.runnersworld.com/uk/training/cross-training/a43272395/strength-training-for-beginners/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/strength-training-for-beginners-640b6560662b8.jpg?crop=1.00xw:0.669xh;0,0.167xh&resize=1200:*", "publishedAt": "2023-03-10T17:33:47Z", "content": "When it comes to making strides, runners are, more often than not, laser-focused on adding mileage. That’s not a bad approach – more miles are one way of becoming a better runner. But there’s more yo… [+6742 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Nitrate in Tap and Bottled Drinking Water May Be a Risk Factor for Prostate Cancer - SciTechDaily", "description": "Nitrate is present in tap water and bottled water, largely due to the use of fertilizer in agriculture and the manure produced by intensive livestock farming. The nitrate ingested over the course of a person’s adult lifetime through the consumption of tap wat…", "url": "https://scitechdaily.com/warning-nitrate-in-tap-and-bottled-drinking-water-may-be-a-risk-factor-for-prostate-cancer/", "urlToImage": "https://scitechdaily.com/images/No-Bottled-Water.jpg", "publishedAt": "2023-03-10T09:21:49Z", "content": "Nitrate is commonly found in tap water and bottled water as a result of agricultural fertilizers and intensive livestock farming. Consuming nitrate through water consumption over a lifetime may incre… [+8415 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Disturbing Truth: Opioids Dominate as Primary Cause of Poisoning Deaths in Children - SciTechDaily", "description": "Researchers find rate of fatal opioid poisonings among children more than doubled over 13-year span Over-the-counter drugs also continue to pose fatal risks to young children despite measures to reduce exposure. Researchers from Children’s Hospital of Philade…", "url": "https://scitechdaily.com/disturbing-truth-opioids-dominate-as-primary-cause-of-poisoning-deaths-in-children/", "urlToImage": "https://scitechdaily.com/images/Opioid-Drug-Addiction-Death-Concept.jpg", "publishedAt": "2023-03-09T22:30:05Z", "content": "A study conducted by researchers from Childrens Hospital of Philadelphia (CHOP) found that opioids were responsible for more than half of all fatal poisonings in children under the age of 5, a number… [+4958 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Betsy Ladyzhets", "title": "Chronic fatigue syndrome is a puzzle. Your gut microbiome may have the key. - National Geographic", "description": "New research reveals connections between certain gut bacteria and chronic fatigue syndrome, an ailment often connected to long COVID.", "url": "https://www.nationalgeographic.com/magazine/article/chronic-fatigue-syndrome-gut-microbiome-may-have-the-key", "urlToImage": "https://i.natgeofe.com/n/ab6d925c-c070-4e02-bdb8-b761f2faf5c0/Micronaut-Intestinal-Bacteria-007373_16x9.jpg?w=1200", "publishedAt": "2023-03-09T11:02:47Z", "content": "A growing body of research suggests that the gut microbiome could play a major role in a debilitating chronic disease that has been on the rise. The illness, known as myalgic encephalomyelitis and co… [+7846 chars]"}]}