{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Carina Stathis", "title": "Meningococcal symptoms in babies: Baby treated for meningococcal after red rash appeared on leg - Daily Mail", "description": "When a mum noticed a small red mark on her baby's leg recently she jumped into action and took her bub straight to the hospital.", "url": "https://www.dailymail.co.uk/femail/real-life/article-11955123/Meningococcal-symptoms-babies-Baby-treated-meningococcal-red-rash-appeared-leg.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/10/01/69652711-0-image-a-40_1681088355285.jpg", "publishedAt": "2023-04-10T00:39:51Z", "content": "When a mum noticed a small red mark on her baby's leg recently she jumped into action and took her bub straight to the hospital. \r\nAnd she's lucky she did because the rash 'didn't turn white' when pr… [+3616 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Joshu", "title": "These are the nine foods dietitians say are hampering your weight loss goals - Daily Mail", "description": "If it feels like you can never shift those last few pounds despite eating 'clean', experts say it's probably due to a handful of key food groups, three top US dieticians have told DailyMail.com.", "url": "https://www.dailymail.co.uk/health/article-11937919/These-nine-foods-dietitians-say-hampering-weight-loss-goals.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/05/22/69513329-0-image-a-24_1680728515181.jpg", "publishedAt": "2023-04-09T16:49:07Z", "content": "By now, anyone embarking on a weight loss journey knows the basics avoid junk food, sugary sodas and candies.\r\nBut if it feels like you can never shift those last few pounds despite eating 'clean', e… [+12304 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Here are some signs that may indicate heart attack - Geo News", "description": "Overall chances of survival from a heart attack are seven in 10 but chances increase for those who reach hospital early", "url": "https://www.geo.tv/latest/481154-here-are-some-signs-that-may-indicate-heart-attack", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-04-09/481154_024804_updates.jpg", "publishedAt": "2023-04-09T10:23:00Z", "content": "Cardiovascular diseases (CVD) are the leading cause of death globally. However, the overall chances of survival from a heart attack are seven in 10 but the chances increase for those who reach the ho… [+1927 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Magnesium Magic: New Drug Delivers Weight Loss Even on Sugary, Fatty Diet - SciTechDaily", "description": "Compound limits magnesium transport in cellular power plants called mitochondria. A small-molecule drug, CPACC, developed by researchers, has been shown to prevent weight gain and liver issues in mice by limiting magnesium transport in cellular power plants, …", "url": "https://scitechdaily.com/magnesium-magic-new-drug-delivers-weight-loss-even-on-sugary-fatty-diet/", "urlToImage": "https://scitechdaily.com/images/Obesity-Weight-Loss.jpg", "publishedAt": "2023-04-09T09:51:57Z", "content": "ByUniversity of Texas Health Science Center at San AntonioApril 9, 2023\r\nResearchers at UT Health San Antonio, along with collaborators from the University of Pennsylvania and Cornell University, hav… [+5755 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "Five healthy foods that could raise your cholesterol levels, nutritionist urges warning - Express", "description": "From Greek yoghurt to granola, certain healthy staples could be packed with saturated fat and sugar, raising your cholesterol levels, according to an expert.", "url": "https://www.express.co.uk/life-style/health/1756011/high-cholesterol-diet-risk-greek-yoghurt-prawns-granola", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4677407.jpg?r=1680873097067", "publishedAt": "2023-04-09T03:00:00Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Pandemic May Have Triggered Second \"Midlife Crisis\" for Over-50s - Neuroscience News", "description": "Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second \"midlife crisis\" in those aged 50 and older. Researchers say women struggled more than men with psychological distress during the pandemic, and this may exace…", "url": "https://neurosciencenews.com/pandemic-midlife-crisis-22971/", "urlToImage": "https://neurosciencenews.com/files/2023/04/midlife-crisis-pandemic-neurosicencce-public.jpg", "publishedAt": "2023-04-08T23:27:29Z", "content": "Summary: Anxiety and depression that occurred as a result of the COVID-19 pandemic appear to trigger a second “midlife crisis” in those aged 50 and older. Researchers say women struggled more than me… [+6658 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "How Do We Know if Our Brain Is Capable of Repairing Itself? - Neuroscience News", "description": "A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restoring brain function. Recent single-cell transcriptomic studies in the ad…", "url": "https://neurosciencenews.com/neuroregeneration-neuroscience-22969/", "urlToImage": "https://neurosciencenews.com/files/2023/04/brain-repair-neurosinces-public.jpg", "publishedAt": "2023-04-08T21:06:33Z", "content": "Summary: A new study examines the regenerative potential of the human brain in aging and neurological diseases, which could provide an alternative to conventional strategies for enhancing or restorin… [+8686 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Dr. Adrian Wong", "title": "Did Switzerland Stop All COVID-19 Vaccinations?! - Tech ARP", "description": "Did Switzerland just order a stop to all COVID-19 vaccinations?! Take a look at the viral claim, and find out what the facts really are!", "url": "https://www.techarp.com/facts/switzerland-covid-19-vaccinations/", "urlToImage": "https://www.techarp.com/wp-content/uploads/2023/04/Switzerland-stop-COVID-19-vaccination-fact-check.jpg", "publishedAt": "2023-04-08T20:34:20Z", "content": "Did Switzerland just order a stop to all COVID-19 vaccinations?!\r\nTake a look at the viral claim, and find out what the facts really are!\r\nClaim : Switzerland Stops All COVID-19 Vaccinations!\r\nPeople… [+4833 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Abi Turner", "title": "Expert lifts the lid on the BAD HABITS for our Brain Health we do every day - Daily Mail", "description": "Dr Miriam Ferrer, from Cambridge, told FEMAIL the four everyday habits which could be damaging your brain health, and making your memory worse.", "url": "https://www.dailymail.co.uk/femail/article-11780703/Expert-lifts-lid-BAD-HABITS-Brain-Health-day.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/22/18/67970173-0-image-a-16_1677090470741.jpg", "publishedAt": "2023-04-08T11:26:35Z", "content": "Many of us grow worried about our memories after a particularly forgetful moment. \r\nAnd now an expert has revealed the four everyday habits which could be damaging your brain health, and making your … [+8948 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Muscle Pain or Fatigue From Statins? What Cholesterol Patients Need To Know - SciTechDaily", "description": "Statins do not increase muscle injury after prolonged walking, important for heart health in statin users. A study published in the Journal of the American College of Cardiology found that statin therapy does not worsen muscle injury, pain, or fatigue in indi…", "url": "https://scitechdaily.com/muscle-pain-or-fatigue-from-statins-what-cholesterol-patients-need-to-know/", "urlToImage": "https://scitechdaily.com/images/Senior-Shoulder-Muscle-Pain.jpg", "publishedAt": "2023-04-08T10:40:32Z", "content": "A recent study found that statin therapy does not exacerbate muscle injury, pain, or fatigue during moderate-intensity exercise, allowing statin users to safely maintain an active lifestyle and benef… [+5158 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Diana Buntajova", "title": "The red juice that could lower blood pressure by a 'significant' amount in 'hours' - Express", "description": "The nitrates in the juice can help improve blood flow and significantly decrease your blood pressure, according to an expert.", "url": "https://www.express.co.uk/life-style/health/1754290/high-blood-pressure-diet-beetroot-juice", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/1200x712/4668089.jpg?r=1680533522942", "publishedAt": "2023-04-08T08:00:00Z", "content": "To achieve these hypertension-lowering benefits, the expert recommended consuming between 250 to 500 millilitres of beet juice per day.\r\n“It's important to note that individual responses may vary, an… [+628 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Uncovers Potential Explanation for COVID Vaccine Blood Clot Connection - SciTechDaily", "description": "Scientists identify key differences in immune responses to the AstraZeneca and Pfizer vaccines. A recent study conducted by a team from SAHMRI and Flinders University in Australia has revealed significant variations in the way the AstraZeneca and Pfizer COVID…", "url": "https://scitechdaily.com/new-research-uncovers-potential-explanation-for-covid-vaccine-blood-clot-connection/", "urlToImage": "https://scitechdaily.com/images/New-COVID-Vaccine-Illustration.jpg", "publishedAt": "2023-04-08T02:15:43Z", "content": "ByFlinders UniversityApril 7, 2023\r\nA recent Australian study discovered fundamental differences in immune responses between the AstraZeneca and Pfizer COVID-19 vaccines. The AstraZeneca vaccine elic… [+8388 chars]"}]}