{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "PsyPost"}, "author": "Laura Staloch", "title": "A surprisingly simple technique may help reduce cravings for high calorie foods - PsyPost", "description": "A new study published in Appetite explores the potential for visualization techniques to help reduce poor food choices among those who wish to eat less. The findings indicate that those who imagine high-calorie foods and then imagine getting rid of the food b…", "url": "https://www.psypost.org/2023/05/a-surprisingly-simple-technique-may-help-reduce-cravings-for-high-calorie-foods-163251", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/05/pushing-away-denying-healthy-food.jpg", "publishedAt": "2023-05-18T11:11:45Z", "content": "A new study published in Appetiteexplores the potential for visualization techniques to help reduce poor food choices among those who wish to eat less. The findings indicate that those who imagine hi… [+4529 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ageing body scans to aid understanding of why diseases occur - BBC", "description": "The results could open up new ways to spot, treat and prevent some diseases, including cancer, experts say.", "url": "https://www.bbc.com/news/health-65615782", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/42C7/production/_129759071_fergus_scan2.jpg", "publishedAt": "2023-05-17T23:53:00Z", "content": "The world's biggest human imaging project is set to rescan the brains and bodies of 60,000 UK volunteers to find new ways of treating and preventing disease. \r\nBy looking at how bodies age, the study… [+3906 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Olivia Day", "title": "Australian woman with eczema reveals what you should never say to her - Daily Mail", "description": "University student Leilah Johnson, 20, says her struggle with eczema, a type of dermatitis, has impacted her self confidence and cost her thousands of dollars on expensive treatments.", "url": "https://www.dailymail.co.uk/news/article-12087537/Australian-woman-eczema-reveals-never-say-her.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/16/05/71031329-0-image-a-46_1684210515182.jpg", "publishedAt": "2023-05-17T23:32:58Z", "content": "A young woman has shared how a debilitating skin condition rocked her self-confidence and saw her unable to go to the gym, work or university.\r\nLeilah Johnson, 20, says her struggle with eczema, a ty… [+6151 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Regular Exercise Linked to Lower Parkinson’s Risk - Neuroscience News", "description": "Regular physical activity, from cycling and walking to gardening and household chores, may reduce the risk of developing Parkinson’s disease.", "url": "https://neurosciencenews.com/pakinsons-exercise-neurology-23266/", "urlToImage": "https://neurosciencenews.com/files/2023/05/parkinsons-exercise-neurosinces.jpg", "publishedAt": "2023-05-17T20:52:34Z", "content": "Summary: Regular physical activity, from cycling and walking to gardening and household chores, may reduce the risk of developing Parkinsons disease.\r\nThe study found that women who exercised the mos… [+5463 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Epstein-Barr Virus Antibodies Linked to Multiple Sclerosis Progression - Neuroscience News", "description": "Researchers have discovered a new link between the Epstein-Barr virus (EBV) and the progression of multiple sclerosis (MS).", "url": "https://neurosciencenews.com/ms-progression-epstein-barr-23265/", "urlToImage": "https://neurosciencenews.com/files/2023/05/epstein-barr-ms-neurosinces.jpg", "publishedAt": "2023-05-17T19:23:25Z", "content": "Summary: Researchers have discovered a new link between the Epstein-Barr virus (EBV) and the progression of multiple sclerosis (MS).\r\nTheir study revealed that certain antibodies, originally aimed at… [+6410 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Regular Cardio Exercise May Shield Against Flu and Pneumonia Deaths - Neuroscience News", "description": "A new study suggests that regular aerobic exercise may significantly reduce the risk of death from flu or pneumonia.", "url": "https://neurosciencenews.com/cardio-exercise-flu-23264/", "urlToImage": "https://neurosciencenews.com/files/2023/05/exercise-flu-neurosicences.jpg", "publishedAt": "2023-05-17T18:21:26Z", "content": "Summary: A new study suggests that regular aerobic exercise, even less than the recommended 150 minutes per week, may significantly reduce the risk of death from flu or pneumonia.\r\nHowever, the benef… [+8392 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": "Science", "title": "Sexual dimorphism in the response to chronic circadian misalignment on a high-fat diet - Science", "description": null, "url": "https://www.science.org/doi/10.1126/scitranslmed.abo2022", "urlToImage": null, "publishedAt": "2023-05-17T18:11:15Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clock Out of Losing Sleep: A Simple and Effective Solution To Manage Insomnia - SciTechDaily", "description": "Indiana University research led by Spencer Dawson finds that clock-watching while trying to sleep worsens insomnia and boosts sleep aid usage. The study suggests that avoiding checking the time could be a simple and effective solution to manage insomnia. Watc…", "url": "https://scitechdaily.com/clock-out-of-losing-sleep-a-simple-and-effective-solution-to-manage-insomnia/", "urlToImage": "https://scitechdaily.com/images/Insomnia-Watching-Clock-Nightmare.jpg", "publishedAt": "2023-05-17T08:27:49Z", "content": "ByIndiana UniversityMay 17, 2023\r\nResearch suggests that the behavior of clock-watching while trying to fall asleep intensifies insomnia symptoms and increases the use of sleep aids. The study, which… [+4500 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "Microbubbles And Ultrasound: Getting Drugs Through The Blood-Brain Barrier - Hackaday", "description": "The brain is a rather important organ, and as such, nature has gone to great lengths to protect it. The skull provides physical protection against knocks and bumps, but there’s a lesser-known…", "url": "https://hackaday.com/2023/05/16/microbubbles-and-ultrasound-getting-drugs-through-the-blood-brain-barrier/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/sonabend1940__FitMaxWzk3MCw2NTBd_featured.png", "publishedAt": "2023-05-16T17:00:00Z", "content": "The brain is a rather important organ, and as such, nature has gone to great lengths to protect it. The skull provides physical protection against knocks and bumps, but there’s a lesser-known defense… [+6526 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Maddy Chapman", "title": "This “Vicious Cycle” May Take Its Toll On Mental Health In Relationships - IFLScience", "description": "New research reveals the potential negative impact that partners can have on one another.", "url": "https://www.iflscience.com/this-vicious-cycle-may-take-its-toll-on-mental-health-in-relationships-68944", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68944/aImg/67950/depression-in-relationships-meta.jpg", "publishedAt": "2023-05-16T13:51:20Z", "content": "Its well established that our moods and behaviors can impact our relationships and the other people in them, but their moods and behaviors can impact us right back, which in turn impacts them, and so… [+3346 chars]"}]}