{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "DNA Treatment Could Delay Paralysis That Strikes Nearly All Patients With ALS - Neuroscience News", "description": "DNA designer therapeutics restored levels of a protein critical to motor neuron function, restoring the activity that is impaired as a result of ALS.", "url": "https://neurosciencenews.com/dna-als-paralysis-22811/", "urlToImage": "https://neurosciencenews.com/files/2023/03/dna-paralysis-als-neurosicence-public.jpg", "publishedAt": "2023-03-16T20:12:49Z", "content": "Summary: DNA designer therapeutics restored levels of a protein critical to motor neuron function, restoring the activity that is impaired as a result of ALS.\r\nSource: UCSD\r\nIn virtually all persons … [+7656 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Matcha Tea Powder Has Antidepressant-Like Effects - Neuroscience News", "description": "Researchers say Matcha, a traditional Japanese tea, can help boost mood and mental performance. Match tea powder activates dopaminergic neural networks and improves depressive symptoms in mice that previously experienced stress as a result of social isolation.", "url": "https://neurosciencenews.com/matcha-tea-depression-22810/", "urlToImage": "https://neurosciencenews.com/files/2023/03/matcha-tea-antidepressant-neurosicnes-1.jpg", "publishedAt": "2023-03-16T19:41:19Z", "content": "Summary: Researchers say Matcha, a traditional Japanese tea, can help boost mood and mental performance. Match tea powder activates dopaminergic neural networks and improves depressive symptoms in mi… [+6471 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Nicoletta Lanese", "title": "1st woman given stem cell transplant to cure HIV is still virus-free 5 years later - Livescience.com", "description": "A woman who received a stem cell transplant to treat her HIV is still virus-free more than five years after the procedure and 30 months after she stopped taking HIV medication.", "url": "https://www.livescience.com/1st-woman-given-stem-cell-transplant-to-cure-hiv-is-still-virus-free-5-years-later", "urlToImage": "https://cdn.mos.cms.futurecdn.net/kDAkRHQEvEoAZzW72e36Q9-1200-80.jpg", "publishedAt": "2023-03-16T15:00:37Z", "content": "A woman known as the \"New York patient\" received a stem cell transplant to cure her HIV\r\n, and now, she's been virus-free and off her HIV medication for about 30 months, researchers report.\r\n\"We're c… [+3646 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Sahir", "title": "Neolithic Solutions to Lactose Intolerance Revealed in New Study - Ancient Origins", "description": "During the Neolithic period up until the Late Bronze Age, lactose intolerance was prevalent among the European population.", "url": "https://www.ancient-origins.net/news-evolution-human-origins/neolithic-milk-consumption-0018069", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Neolithic-milk-consumption.png", "publishedAt": "2023-03-16T13:59:00Z", "content": "During the Neolithic period up until the Late Bronze Age, lactose intolerance was prevalent among the European population. However, a genetic mutation eventually became widespread, allowing adults to… [+4851 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Hannah Mcdonald", "title": "The five signs you're not getting enough sleep - Daily Mail", "description": "Snoozing is vital for healing the heart and blood vessels. Here, MailOnline reveals the five signs you're not getting enough sleep, according to retailer Bed Kingdom.", "url": "https://www.dailymail.co.uk/health/article-11866955/The-five-signs-youre-not-getting-sleep.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/16/12/68768599-0-image-a-4_1678970858063.jpg", "publishedAt": "2023-03-16T13:03:52Z", "content": "Balancing work, a social life and staying fit and healthy can mean a good night's sleep is often sacrificed.\r\nBut a lack of shut-eye can trigger wide-ranging and severe health problems, beyond just f… [+6279 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "HM Government", "title": "The simple health test that could save your life - Express", "description": "High blood pressure can be a killer and often there are no symptoms. But a test only takes a minute - and the condition can be treatable with medication and lifestyle changes", "url": "https://www.express.co.uk/partner-stories/news/uk/1744458/simple-health-test-save-life", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/1/1200x712/4615377.jpg?r=1678716616790", "publishedAt": "2023-03-16T06:07:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Alarming” Findings – High Blood Pressure Can Cause Heart Damage in Adolescents - SciTechDaily", "description": "A recent study published in the Journal of Pediatrics highlights the detrimental effects of elevated blood pressure and hypertension during adolescence, leading to early cardiac damage which is exacerbated by young adulthood. This collaborative research effor…", "url": "https://scitechdaily.com/?p=260836", "urlToImage": "https://scitechdaily.com/images/Man-Heart-Attack-Chest-Pain-Illustration.jpg", "publishedAt": "2023-03-16T04:22:24Z", "content": "High blood pressure, also known as hypertension, is a common yet silent health concern that affects millions of people worldwide. Often without noticeable symptoms, this condition increases the force… [+5370 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Rachael Robertson", "title": "Gut Check: Are All Yogurts Created Equal? - Everyday Health", "description": "Experts weigh in on how to maximize your gut health with yogurt.", "url": "https://www.everydayhealth.com/digestive-health/gut-check-are-all-yogurts-created-equal/", "urlToImage": "https://images.everydayhealth.com/images/is-yogurt-good-for-your-microbiome-1440x810.jpg?sfvrsn=72f42260_1", "publishedAt": "2023-03-15T23:43:12Z", "content": "People have been eating yogurt for thousands of years, since ancient cultures learned how to ferment milk for the sake of preservation. Indian ayurvedic scripts from around 6,000 B.C. mention the hea… [+5423 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Carissa Wong", "title": "Why are sexually transmitted infections on the rise in the US? - Livescience.com", "description": "Surging STIs are being driven by a \"perfect storm\" of factors in the U.S.", "url": "https://www.livescience.com/why-are-sexually-transmitted-infections-on-the-rise-in-the-us", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eiuBNY9tcihUGe53XSiLYn-1200-80.jpg", "publishedAt": "2023-03-15T19:10:20Z", "content": "Rates of sexually transmitted infections (STIs), such as syphilis, have been rising over the past few years in the U.S. But why are STI rates surging now, and what can be done to reverse that trend?\r… [+7832 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Joanna Moncrieff, Katharine Wallis, Mark Horowitz", "title": "Antidepressant withdrawal should be taken seriously – we're investigating ways to help people come off the pills - The Conversation", "description": "Antidepressants have been prescribed to millions of people with little thought about how those people will come off them.", "url": "https://theconversation.com/antidepressant-withdrawal-should-be-taken-seriously-were-investigating-ways-to-help-people-come-off-the-pills-201101", "urlToImage": "https://images.theconversation.com/files/514816/original/file-20230312-3908-i5k8dp.jpg?ixlib=rb-1.1.0&rect=0%2C381%2C2995%2C1495&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2023-03-15T16:56:45Z", "content": "Misinformation about antidepressants is rife and is probably fuelling their rise in use. Chief among these false ideas are: \r\n<ul><li>Antidepressant withdrawal effects are mild and only last two to t… [+6192 chars]"}]}