{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA's Artemis 1 Orion spacecraft aced moon mission despite heat shield issue - Space.com", "description": "Orion lost more material from its heat shield during reentry than predicted.", "url": "https://www.space.com/artemis-1-orion-moon-mission-heat-shield-issue", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Wbpwmd52hamKFkhV2QLWye-1200-80.jpg", "publishedAt": "2023-03-07T22:32:38Z", "content": "NASA's Orion spacecraft performed better than expected on its first deep-space flight despite experiencing unpredicted loss of its heat shield material.\r\nIn a teleconference on Tuesday (March 7), NAS… [+4378 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Should Not Exist: Baby Star Found in Close Proximity to Milky Way's Black Hole - SciTechDaily", "description": "A team of international researchers led by Dr. Florian Peißker at the Institute of Astrophysics at the University of Cologne has discovered a newly forming star near the supermassive black hole, Sagittarius A*, located at the center of the Milky Way. The newl…", "url": "https://scitechdaily.com/should-not-exist-baby-star-found-in-close-proximity-to-milky-ways-black-hole/", "urlToImage": "https://scitechdaily.com/images/Center-of-the-Milky-Way-1.jpg", "publishedAt": "2023-03-07T22:31:43Z", "content": "ByUniversity of CologneMarch 7, 2023\r\nThe Galactic center at a distance of about 30000 light years. In the center of the image is the supermassive black hole Sgr A* (not visible). The position of Sgr… [+8872 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Puzzle-Solving Behavior Spreads Through Bumblebee Colonies - Neuroscience News", "description": "Bumblebees are able to learn to solve puzzles by watching more experienced bees complete a task. This new behavioral preference then spreads throughout the entire colony. The bees that learned from others became more adept and began to prefer the learned solu…", "url": "https://neurosciencenews.com/problem-solving-bee-behavior-22728/", "urlToImage": "https://neurosciencenews.com/files/2023/03/bee-problem-solving-neurosicences-public.jpg", "publishedAt": "2023-03-07T20:30:53Z", "content": "Summary: Bumblebees are able to learn to solve puzzles by watching more experienced bees complete a task. This new behavioral preference then spreads throughout the entire colony. The bees that learn… [+4574 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "André Julião", "title": "Hollow bones that let dinosaurs become giants evolved at least three times independently, shows study - Phys.org", "description": "Dinosaurs as big as buses or five-story buildings would not be possible if their bones were dense and heavy like ours. Like present-day birds, dinosaurs had hollow bones with inner structures known as air sacs, which made their skeletons lighter and less dens…", "url": "https://phys.org/news/2023-03-hollow-bones-dinosaurs-giants-evolved.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/hollow-bones-that-let.jpg", "publishedAt": "2023-03-07T17:42:58Z", "content": "Dinosaurs as big as buses or five-story buildings would not be possible if their bones were dense and heavy like ours. Like present-day birds, dinosaurs had hollow bones with inner structures known a… [+6424 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "100 Million Years Unveiled: The Most Detailed Model of Earth's Surface Ever - SciTechDaily", "description": "An advanced digital tool can assist us in comprehending the past and forecasting the evolution of the Earth's surface. The interplay of climate, tectonic activity, and the passage of time result in formidable forces that shape the appearance of our planet. Th…", "url": "https://scitechdaily.com/100-million-years-unveiled-the-most-detailed-model-of-earths-surface-ever/", "urlToImage": "https://scitechdaily.com/images/Landscape-Evolution-Over-the-Past-100-Million-Years.jpg", "publishedAt": "2023-03-07T13:43:51Z", "content": "ByUniversity of SydneyMarch 7, 2023\r\nLandscape evolution over the past 100 million years. Credit: Dr. Tristan Salles, The University of Sydney / AAAS\r\nAn advanced digital tool can assist us in compre… [+4728 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Dark energy could lead to a second (and third, and fourth) Big Bang, new research suggests - Space.com", "description": "Scientists have proposed a way that the universe could stop expanding, ending in a 'Big Crunch' that resets space and time as we know it.", "url": "https://www.space.com/https://www.livescience.com/dark-energy-could-lead-to-a-second-and-third-and-fourth-big-bang-new-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Be5EtabBFPuMQfT4yjiLpU-1200-80.jpg", "publishedAt": "2023-03-07T13:00:36Z", "content": "Will the universe end in a bang or a whimper? A pair of theoretical physicists have proposed a third path: perhaps the universe will never end.\r\nIn a study that attempts to define the nature of dark … [+3927 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "NASA fixes solar observation spacecraft by turning it off and turning it on again - The Register", "description": "'Firemode reset' sees Interstellar Boundary Explorer back on the job", "url": "https://www.theregister.com/2023/03/07/nasa_ibex_reboot/", "urlToImage": "https://regmedia.co.uk/2023/03/07/restart_shutterstock.jpg", "publishedAt": "2023-03-07T13:00:00Z", "content": "NASA engineers have managed to restore the Interstellar Boundary Explorer spacecraft to working condition by using the oldest trick in the computing book.\r\nIBEX was put into contingency mode in Febru… [+1956 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "An internal thermometer tells seeds when to germinate, researchers find - Phys.org", "description": "Germination is a crucial stage in the life of a plant, as it will leave the stage of seed resistant to various environmental constraints (climatic conditions, absence of nutritive elements, etc.) to become a seedling that is much more vulnerable. The survival…", "url": "https://phys.org/news/2023-03-internal-thermometer-seeds-germinate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/an-internal-thermomete.jpg", "publishedAt": "2023-03-07T10:00:01Z", "content": "Germination is a crucial stage in the life of a plant, as it will leave the stage of seed resistant to various environmental constraints (climatic conditions, absence of nutritive elements, etc.) to … [+4708 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Mind-boggling James Webb Telescope image shows the same galaxy at three different points in time - TechSpot", "description": "The image in question features a supernova-hosting galaxy captured at three different points in time, all in the same photo. The time-defying feat is the result of...", "url": "https://www.techspot.com/news/97831-mind-boggling-james-webb-telescope-image-shows-same.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/03/2023-03-06-image-10.jpg", "publishedAt": "2023-03-06T17:54:15Z", "content": "WTF?! The James Webb Space Telescope continues to boggle the mind with images of the distant universe that often defy our wildest imaginations. This recent example from the space observatory slots pe… [+1837 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Moment a powerful flare 10 TIMES the size of Earth explodes from our sun is captured by NASA - Daily Mail", "description": "NASA's Solar Dynamics Observatory has captured the moment a powerful X-class  solar flare , up to 10 times the size of Earth, shot out from a sunspot that has quadrupled in size over the past month.", "url": "https://www.dailymail.co.uk/sciencetech/article-11826369/Moment-powerful-flare-10-TIMES-size-Earth-explodes-sun-captured-NASA.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/06/15/68389051-0-image-a-6_1678117594398.jpg", "publishedAt": "2023-03-06T15:48:21Z", "content": "The moment a powerful flare exploded on our sun's surface was captured by NASA's Solar Dynamics Observatory.\r\nA strong X-class, which can be 10 times the size of Earth, was released from the blazing … [+5471 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Computing Breakthrough: Silicon Encoded Spin Qubits Achieve Universality - SciTechDaily", "description": "HRL Laboratories, LLC, has published the first demonstration of universal control of encoded spin qubits. This newly emerging approach to quantum computation uses a novel silicon-based qubit device architecture, fabricated in HRL’s Malibu cleanroom, to trap s…", "url": "https://scitechdaily.com/quantum-computing-breakthrough-silicon-encoded-spin-qubits-achieve-universality/", "urlToImage": "https://scitechdaily.com/images/Silicon-Encoded-Spin-Qubits-Universality.jpg", "publishedAt": "2023-03-06T14:59:41Z", "content": "Render of a six-dot SLEDGE device in silicon, which implemented universal logic with encoded spin qubits. Credit: HRL Laboratories\r\nHRL Laboratories, LLC, has published the first demonstration of uni… [+4956 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Nasa's new science chief says 'it's the best job on the planet' - BBC", "description": "Dr Nicola Fox, originally from Hertfordshire, is the first woman to become Nasa's head of science.", "url": "https://www.bbc.com/news/uk-england-beds-bucks-herts-64855011", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2FF3/production/_128857221_nicola_fox.jpg", "publishedAt": "2023-03-06T06:05:53Z", "content": "The first woman to become Nasa's head of science has said \"it's the best job on the planet\". \r\nDr Nicola Fox, Nasa's former director of Heliophysics, comes from Hertfordshire and now works in Washing… [+2166 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Odds Of A Quantum Tunnelling Event Are One In A Hundred Billion - IFLScience", "description": "Quantum tunnelling is a rare event that should be impossible under classical physics, but it is only now we are learning just how rare real-world examples are.", "url": "https://www.iflscience.com/odds-of-a-quantum-tunneling-event-are-one-in-a-hundred-billion-67820", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67820/aImg/66190/quantum-wall-meta.png", "publishedAt": "2023-03-06T04:25:00Z", "content": "The rate at which the rare but crucial quantum phenomenon known as tunneling occurs has been measured experimentally for the first time, and found to match theoretical calculations. The theoretical e… [+3357 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Time Is It on the Moon? Advancing a New Lunar Timezone - SciTechDaily", "description": "A new era of lunar exploration is on the rise, with dozens of Moon missions planned for the coming decade. Europe is in the forefront here, contributing to building the Gateway lunar station and the Orion spacecraft – set to return humans to our natural satel…", "url": "https://scitechdaily.com/what-time-is-it-on-the-moon-advancing-a-new-lunar-timezone/", "urlToImage": "https://scitechdaily.com/images/Moon-Surface-Scenario-scaled.jpg", "publishedAt": "2023-03-06T03:30:25Z", "content": "ByEuropean Space Agency (ESA)March 5, 2023\r\nA high-definition image of Earth taken by Japans Kaguya lunar orbiter in November 2007. Credit: JAXA/NHK\r\nA new era of lunar exploration is on the rise, wi… [+11936 chars]"}]}