{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "In Case of Climate Emergency: Deploying Space Bubbles To Block Out the Sun - SciTechDaily", "description": "“Space Bubbles” – The Deflection of Solar Radiation Using Thin-Film Inflatable Bubble Rafts An interdisciplinary group of scientists at the Massachusetts Institute of Technology is exploring a space-based solar shield to reduce incoming radiation on Earth’s s…", "url": "https://scitechdaily.com/in-case-of-climate-emergency-deploying-space-bubbles-to-block-out-the-sun/", "urlToImage": "https://scitechdaily.com/images/Space-Bubbles.jpg", "publishedAt": "2022-07-16T20:10:29Z", "content": "BySciTechDailyJuly 16, 2022\r\nIf climate change has already gone too far, what could be our emergency solutions? Credit: MIT\r\nSpace Bubbles The Deflection of Solar Radiation Using Thin-Film Inflatable… [+15548 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb’s New Look at the Cosmos, Scouting Landing Sites for Mars Sample Return - SciTechDaily", "description": "The Webb Space Telescope’s new look at the cosmos … Technology used to fine-tune Webb improves the vision of millions on Earth …. And a new climate study heads to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be…", "url": "https://scitechdaily.com/this-week-nasa-webbs-new-look-at-the-cosmos-scouting-landing-sites-for-mars-sample-return/", "urlToImage": "https://scitechdaily.com/images/NASA-Webbs-New-Look-at-the-Cosmos.gif", "publishedAt": "2022-07-16T15:49:38Z", "content": "ByNASAJuly 16, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisor… [+3576 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Journey to the mystery planet: why Uranus is the new target for space exploration - The Guardian", "description": "The last time a probe visited the distant ice giant was in 1986, yet learning more about this cold world could tell us a lot about the galaxy", "url": "https://amp.theguardian.com/science/2022/jul/16/uranus-mission-space-exploration-nasa", "urlToImage": null, "publishedAt": "2022-07-16T15:00:00Z", "content": "UranusThe last time a probe visited the distant ice giant was in 1986, yet learning more about this cold world could tell us a lot about the galaxy\r\nSat 16 Jul 2022 11.00 EDT\r\nOn the night of 13 Marc… [+11097 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Antony Ashkenaz", "title": "James Webb horror as £8.4bn NASA space telescope damaged by meteorite collision - Express", "description": "THE JAMES Webb Space Telescope (JWST), NASA's most expensive and powerful telescope ever made, has suffered damage after being smashed by a space rock.", "url": "https://www.express.co.uk/news/science/1641522/james-webb-horror-nasa-10-billion-space-telescope-damaged-meteorite-collision", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/1200x712/1641522_1.jpg", "publishedAt": "2022-07-16T12:13:05Z", "content": "However, scientists have noted that given Webb’s orbit around Lagrangian point 2 about one million miles from Earth, the observatory will only face potentially hazardous micrometeoroids about once pe… [+850 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "'Rebooting' the moon: the Artemis quest for sustainability - Space.com", "description": "Innovative technologies are needed to forge the first long-term presence on the moon.", "url": "https://www.space.com/rebooting-moon-nasa-artemis-sustainability", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PrhKgMzY9tqM5gsnWLpTRc-1200-80.jpeg", "publishedAt": "2022-07-16T11:00:10Z", "content": "Earth's moon is far from being a \"been there, done that\" world, notwithstanding a dozen Apollo short-stay visitors between 1969 and 1972. \r\nToday, our celestial neighbor could serve as homeland for a… [+13251 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Physicists Harness Quantum “Time Reversal” for Detecting Gravitational Waves and Dark Matter - SciTechDaily", "description": "A new technique to measure vibrating atoms could improve the precision of atomic clocks and of quantum sensors for detecting dark matter or gravitational waves. A tiny universe of information is contained in the quantum vibrations in atoms. Scientists can hon…", "url": "https://scitechdaily.com/mit-physicists-harness-quantum-time-reversal-for-detecting-gravitational-waves-and-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Time-Reversal-Phenomena-Concept.gif", "publishedAt": "2022-07-16T10:23:08Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 16, 2022\r\nA new technique to measure vibrating atoms could improve the precision of atomic clocks and of quantum sensors for detecting dark m… [+10319 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Zombie fly fungus 'bewitches' males to mate with female corpses that have been dead for a day - Daily Mail", "description": "The study found that the longer a female was dead, the more alluring it was- 73% of male flies mated with female carcasses that had died from the fungal infection between 25 to 30 hours earlier.", "url": "https://www.dailymail.co.uk/sciencetech/article-11018875/Zombie-fly-fungus-bewitches-males-mate-female-corpses-dead-day.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/15/21/60323655-0-image-a-67_1657917970345.jpg", "publishedAt": "2022-07-15T20:48:14Z", "content": "A fungus that turns houseflies into zombies ensures its survival by 'bewitching' males into mating with the fungal-infected corpses of dead females - and a new study finds the longer the female is de… [+3977 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Maddy Chapman", "title": "JWST Has Shown It Can Detect Life Signatures On Exoplanets - IFLScience", "description": "JWST is killing it right now.", "url": "https://iflscience.com/jwst-has-shown-it-can-detect-life-signatures-on-exoplanets-64478", "urlToImage": "https://assets.iflscience.com/assets/articleNo/64478/aImg/56750/trappist-1e-rocky-exoplanet-l.png", "publishedAt": "2022-07-15T17:52:16Z", "content": "The ingredients for life are spread throughout the universe. While Earth is the only known place in the universe with life, detecting life beyond Earth is a major goal of modern astronomy and planeta… [+7235 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Mindaugas Balčiauskas", "title": "This Online Community Is Sharing Pictures Of Extinct Creatures To Prove That Nature Is “Metal”, Here Are 97 Of The Best - Bored Panda", "description": "We can only guess what the future will look like. But the past? We have evidence to help us paint a picture of it. To visit it.", "url": "https://www.boredpanda.com/nature-was-metal-pics/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2022/07/nature-was-metal-pics-fb-62d1687d63392.png", "publishedAt": "2022-07-15T08:37:35Z", "content": null}]}