{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising Phenomena Observed by NASA's NuSTAR in Brightest Cosmic Explosion Ever Detected - SciTechDaily", "description": "Observations by NASA’s NuSTAR X-ray telescope give astronomers new clues about the brightest and most energetic gamma-ray burst ever detected. Scientists detected the brightest gamma-ray burst ever, dubbed GRB 221009A or BOAT, in October 2022. Unlike previous…", "url": "https://scitechdaily.com/surprising-phenomena-observed-by-nasas-nustar-in-brightest-cosmic-explosion-ever-detected/", "urlToImage": "https://scitechdaily.com/images/Record-Breaking-Gamma-Ray-Burst.gif", "publishedAt": "2023-06-10T10:05:49Z", "content": "ByJet Propulsion LaboratoryJune 10, 2023\r\nAstronomers think GRB 221009A represents the birth of a new black hole formed within the heart of a collapsing star. In this illustration, the black hole dri… [+13511 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Daniel Lawler", "title": "UK hobbyist stuns math world with 'amazing' new shapes - Phys.org", "description": "David Smith, a retired print technician from the north of England, was pursuing his hobby of looking for interesting shapes when he stumbled onto one unlike any other in November.", "url": "https://phys.org/news/2023-06-uk-hobbyist-stuns-math-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-spectre-one-of-the.jpg", "publishedAt": "2023-06-10T09:56:07Z", "content": "David Smith, a retired print technician from the north of England, was pursuing his hobby of looking for interesting shapes when he stumbled onto one unlike any other in November.\r\nWhen Smith shared … [+4554 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Is THIS the solution to global warming? Scientist claims we should MOVE the Earth away from the sun - Daily Mail", "description": "EXCLUSIVE: Albert Zijlstra, a professor of astrophysics at the University of Manchester, suggests shifting Earth further back from the sun by about three million miles.", "url": "https://www.dailymail.co.uk/sciencetech/article-12165975/Is-solution-global-warming-Scientist-claims-Earth-away-sun.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/16/71961435-0-image-a-6_1686325779017.jpg", "publishedAt": "2023-06-10T08:57:09Z", "content": "Astronomers know full well that the sun is very slowly getting brighter, and in a billion or so years time it will make Earth too hot to live on. \r\nOne scientist is now proposing a radical solution t… [+6883 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Have Mapped the Ground Beneath Antarctica's Most Vulnerable Glacier for the First Time - SciTechDaily", "description": "For the first time, a team including an expert from Swansea has charted the ground beneath Antarctica's most at-risk glacier, providing vital insights into its susceptibility to climate change. The team's study of the sub-glacial geology of West Antarctica's …", "url": "https://scitechdaily.com/scientists-have-mapped-the-ground-beneath-antarcticas-most-vulnerable-glacier-for-the-first-time/", "urlToImage": "https://scitechdaily.com/images/Glimpse-of-Future-of-Thwaites-Glacier.jpg", "publishedAt": "2023-06-10T08:20:04Z", "content": "BySwansea UniversityJune 10, 2023\r\nBritish Antarctic Survey Twin Otter aircraft flies over Thwaites Glacier with instrumentation attached to the wing. Credit: Carl Robinson/British Antarctic Survey\r\n… [+5599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Way To Develop Drugs Without Side Effects – To Treat Obesity, Pain, Osteoporosis, and Neurological Disorders - SciTechDaily", "description": "Researchers discovered a novel method to activate G-protein coupled receptors from inside the cells, and it helps develop drugs without side effects. The team identified a molecule, PCO371, that interacts with the intracellular region of a specific GPCR, offe…", "url": "https://scitechdaily.com/new-way-to-develop-drugs-without-side-effects-to-treat-obesity-pain-osteoporosis-and-neurological-disorders/", "urlToImage": "https://scitechdaily.com/images/GPCR-Trageted-Response.jpg", "publishedAt": "2023-06-10T02:26:36Z", "content": "An artists impression of the GPCR activation from inside the cell. Credit: Kobayashi and Kawakami et al., 2023\r\nResearchers discovered a novel method to activate G-protein coupled receptors from insi… [+4508 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Charlene Badasie", "title": "Supergiant Star Is Acting Very Strange And Scientists Are Stumped - Giant Freakin Robot", "description": "A supergiant star has been found to be doing something incredibly strange. What is going on with it, and what could it mean?", "url": "https://www.giantfreakinrobot.com/sci/supergiant-star-betelgeuse-strange.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/06/space-stars-.jpg", "publishedAt": "2023-06-09T23:38:35Z", "content": null}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Has JWST Finally Found the First Stars in the Univese? - Universe Today", "description": "New observations from JWST hint at pockets of new gas in the halo of more evolved galaxies, where these first-generation stars could still form.", "url": "https://www.universetoday.com/161888/has-jwst-finally-found-the-first-stars-in-the-univese/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/popiii.jpg", "publishedAt": "2023-06-09T23:10:18Z", "content": "In astronomy, elements other than hydrogen and helium are called metals. While that might make your high-school chemistry teacher cringe, it makes sense for astronomers. The two lightest elements wer… [+4141 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "If Black Holes Evaporate, Everything Evaporates - Universe Today", "description": "Stephen Hawking predicted that black holes wouldn't last forever, eventually evaporating into a smear of particles. According to a new study, Hawking's theories don't go far enough.", "url": "https://www.universetoday.com/161877/if-black-holes-evaporate-everything-evaporates/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/pairs-scaled.jpg", "publishedAt": "2023-06-09T18:06:23Z", "content": "Hawking radiation is one of the most famous physical processes in astronomy. Through Hawking radiation, the mass, and energy of a black hole escape over time. It’s a brilliant theory, and it means th… [+3397 chars]"}, {"source": {"id": null, "name": "Softonic"}, "author": "Chema Carvajal Sarabia", "title": "NASA finally gets its more Ambitious Mission: and it is Costly! - Softonic EN", "description": "Can you imagine a space mission with a budget of 10 billion dollars? At NASA they can't imagine it, they have decided to do it.", "url": "https://en.softonic.com/articles/green-light-to-nasa-10-trillion-dollar-mission", "urlToImage": "https://articles-img.sftcdn.net/f_auto,t_article_cover_xl/auto-mapping-folder/sites/3/2023/06/NASA-cohete-espacio-1.jpg", "publishedAt": "2023-06-09T16:27:42Z", "content": "The space fascinates us. Rockets, stars, spaceships, NASA and for all that, today we bring you news that would bankrupt any company. Fortunately, NASA is not just any company.\r\nNASA greenlights its l… [+2636 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "See Mars like never before in this amazing new photo from a 20-year-old probe - Space.com", "description": "Celebrate 20 years of the Mars Express spacecraft with this incredible view of the Red Planet.", "url": "https://www.space.com/mars-express-20th-anniversary-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UZFbXZhDohUvPXNyqgwbJZ-1200-80.jpg", "publishedAt": "2023-06-09T15:00:01Z", "content": "In this simulated view of Mars with enhanced color and contrast, darker grey-toned areas of Mars represent grey-black basaltic sands of volcanic origin; lighter patches show clay and sulphate mineral… [+4154 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Campi Flegrei volcano edges closer to possible eruption - Phys.org", "description": "The Campi Flegrei volcano in southern Italy has become weaker and more prone to rupturing, making an eruption more likely, according to a new study by researchers at UCL (University College London) and Italy's National Research Institute for Geophysics and Vo…", "url": "https://phys.org/news/2023-06-campi-flegrei-volcano-edges-closer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/campi-flegrei-volcano.jpg", "publishedAt": "2023-06-09T14:02:00Z", "content": "The Campi Flegrei volcano in southern Italy has become weaker and more prone to rupturing, making an eruption more likely, according to a new study by researchers at UCL (University College London) a… [+5494 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Watch live: NASA astronauts conduct spacewalk to install new solar arrays outside ISS - Sky News", "description": "Watch the coverage of US Spacewalk 87 which installs an ISS Roll-Out Solar Array (iROSA) on the starboard truss of the International Space Station. #nasa #Sp...", "url": "https://www.youtube.com/watch?v=DUvdAC3AAcM", "urlToImage": "https://i.ytimg.com/vi/DUvdAC3AAcM/maxresdefault.jpg", "publishedAt": "2023-06-09T12:02:37Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Flash of Light Brighter Than a Trillion Stars Leads to Supermassive Black Hole Breakthrough - SciTechDaily", "description": "First Detection of Secondary Black Hole in OJ 287 Binary System An international team of astronomers observed the second one of the two supermassive black holes circling each other in an active galaxy OJ 287. Researchers have discovered two supermassive black…", "url": "https://scitechdaily.com/?p=284368", "urlToImage": "https://scitechdaily.com/images/Binary-Black-Hole-System-OJ-287-scaled.jpg", "publishedAt": "2023-06-09T08:15:35Z", "content": "ByUniversity of TurkuJune 9, 2023\r\nArtistic illustration of OJ287 as a binary black hole system. The secondary black hole of 150 million solar masses moves around the primary black hole of 18 billion… [+9774 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm DANGER looming! NASA's SOHO shows high number of sunspots will face Earth soon - HT Tech", "description": "The solar storm threat is going to increase massively for Earth next week as NASA's Solar and Heliospheric Observatory has detected a high number of sunspots on the farside of the Sun.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-danger-looming-nasas-soho-shows-high-number-of-sunspots-will-face-earth-soon-71686290743659.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/Solar_Flare_1630605449921_1686290901320.jpg", "publishedAt": "2023-06-09T06:16:23Z", "content": "The second half of May and the first week of June were relatively quiet in terms of solar activity. The Earth did suffer a radio blackout earlier this week when sunspot AR3327 exploded and produced a… [+2258 chars]"}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "Nanoblock reveals new space model kits created with astronaut's advice - collectSPACE.com", "description": "An astronaut who helped assemble the sprawling International Space Station is now behind a new series of space building projects that are on a very different scale. Naoko Yamazaki has worked with Kawada to launch a collection of Nanoblock kits.", "url": "http://www.collectspace.com/news/news-060823a-nanoblock-space-series-astronaut-naoko-yamazaki.html", "urlToImage": "http://www.collectspace.com/images/news-060823a-fb.jpg", "publishedAt": "2023-06-08T16:32:53Z", "content": "June 8, 2023\r\n — An astronaut who helped assemble the sprawling International Space Station is now behind a new series of space building projects that are on a very different scale.\r\nNaoko Yamazaki, … [+2312 chars]"}]}