{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Shares First Moon to Mars Architecture Concept Review Results - NASA", "description": "As NASA builds a blueprint for human exploration throughout the solar system for the benefit of humanity, the agency released Tuesday the outcomes from its first Architecture Concept Review, a robust analysis process designed to align NASA’s Moon to Mars expl…", "url": "https://www.nasa.gov/press-release/nasa-shares-first-moon-to-mars-architecture-concept-review-results", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/nsp-2018_concept_01b-no-text_moon-mars2.jpeg", "publishedAt": "2023-04-18T16:32:55Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Leonardo da Vinci, a new discovery on folio 843 of Codex Atlanticus - Phys.org", "description": "The Codex Atlanticus is one of the most extensive and fascinating collections of Leonardo da Vinci's drawings and writings. Its preservation is a great challenge for scholars and researchers. An in-depth study, published in Scientific Reports, was conducted b…", "url": "https://phys.org/news/2023-04-leonardo-da-vinci-discovery-folio.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/leonardo-da-vinci-a-ne.jpg", "publishedAt": "2023-04-18T14:36:58Z", "content": "The Codex Atlanticus is one of the most extensive and fascinating collections of Leonardo da Vinci's drawings and writings. Its preservation is a great challenge for scholars and researchers. An in-d… [+4141 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Xantha Leatham", "title": "Scientists confirm the best way to make swings go HIGHER - Daily Mail", "description": "Researchers from Jumonji University in Japan worked out equations that accounted for a person being able to lean forwards or backwards at any point during a swing's arc.", "url": "https://www.dailymail.co.uk/sciencetech/article-11985517/Scientists-confirm-best-way-make-swings-HIGHER.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/18/12/69954149-0-image-a-445_1681816692510.jpg", "publishedAt": "2023-04-18T11:20:39Z", "content": "For thrill-seeking children, there's nothing more exciting than trying to get a playground swing to go higher and higher.\r\nNow, scientists have developed a mathematical model to explain this intuitiv… [+2188 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Trailblazing Aeolus mission winding down - European Space Agency", "description": "On 30 April 2023, all nominal operations of Aeolus, the first mission to observe Earth’s wind profiles on a global scale, will conclude in preparation for a series of end of life activities.", "url": "https://www.esa.int/Applications/Observing_the_Earth/FutureEO/Aeolus/Trailblazing_Aeolus_mission_winding_down", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2015/06/measuring_cyclones/15418279-1-eng-GB/Measuring_cyclones_pillars.jpg", "publishedAt": "2023-04-18T11:20:28Z", "content": "Applications18/04/20231495 views49 likes\r\nOn 30 April 2023, all nominal operations of Aeolus, the first mission to observe Earths wind profiles on a global scale, will conclude in preparation for a s… [+5989 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Collision Ignites a Trillion-Sun Spectacle: James Webb Space Telescope Unveils Arp 220 - SciTechDaily", "description": "A Dazzling Display of Star Birth Captured in Infrared A stunning smash-up of two spiral galaxies shines in infrared with the light of more than a trillion suns. Collectively called Arp 220, the colliding galaxies ignited a tremendous burst of star birth. Each…", "url": "https://scitechdaily.com/cosmic-collision-ignites-a-trillion-sun-spectacle-james-webb-space-telescope-unveils-arp-220/", "urlToImage": "https://scitechdaily.com/images/Webb-Captures-Spectacular-Galactic-Merger-Arp-220-scaled.jpg", "publishedAt": "2023-04-18T08:38:32Z", "content": "Arp 220, a merging ultra-luminous infrared galaxy, was captured by the James Webb Space Telescope, showcasing its trillion-sun luminosity, massive star formation, and vivid evidence of the ongoing ga… [+1519 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Menacing asteroid racing towards Earth for dangerously close approach today - HT Tech", "description": "A menacing asteroid is hurtling towards Earth, and it will make a close approach to Earth today. Know what NASA has revealed about this space rock.", "url": "https://tech.hindustantimes.com/tech/news/menacing-asteroid-racing-towards-earth-for-dangerously-close-approach-today-71681792769226.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/18/1600x900/asteroid_1681792994471_1681792994687.jpg", "publishedAt": "2023-04-18T04:43:44Z", "content": "Apocalyptic movies like Armageddon have explored the possibility of total annihilation if an asteroid strikes on Earth. Although asteroids make close approaches to Earth nearly every day, none of the… [+2395 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Orb weaver spider glue properties evolve faster than their glue genes, scientists find - Phys.org", "description": "Spiders that don't weave good silk don't get to eat. The silk spiders produce to create their webs is key to their survival—but spiders live in many different places that require webs fine-tuned for local success. Scientists have now studied the glue that mak…", "url": "https://phys.org/news/2023-04-orb-weaver-spider-properties-evolve.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/orb-weaver-spider.jpg", "publishedAt": "2023-04-18T04:00:01Z", "content": "Spiders that don't weave good silk don't get to eat. The silk spiders produce to create their webs is key to their survivalbut spiders live in many different places that require webs fine-tuned for l… [+4662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jade Boyd", "title": "Physicists find unusual waves in nickel-based magnet - Phys.org", "description": "Perturbing electron spins in a magnet usually results in excitations called \"spin waves\" that ripple through the magnet like waves on a pond that's been struck by a pebble. In a new study, Rice University physicists and their collaborators have discovered dra…", "url": "https://phys.org/news/2023-04-physicists-unusual-nickel-based-magnet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/physicists-find-unusua.jpg", "publishedAt": "2023-04-17T20:14:04Z", "content": "Perturbing electron spins in a magnet usually results in excitations called \"spin waves\" that ripple through the magnet like waves on a pond that's been struck by a pebble. In a new study, Rice Unive… [+6314 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "Astronomer Captures NASA's Mysterious Green Laser Beams - PetaPixel", "description": "Many have tried and failed to capture the laser beams.", "url": "https://petapixel.com/2023/04/17/astronomer-captures-nasas-mysterious-green-laser-beams/", "urlToImage": "https://petapixel.com/assets/uploads/2023/04/laserbeamstreak.jpg", "publishedAt": "2023-04-17T18:58:18Z", "content": "A homemade motion detection camera has become the first instrument on Earth to capture NASA’s enigmatic ICESat-2 satellite firing laser beams at Earth. \r\nDaichi Fujii, director of the Hiratsuka City … [+2567 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "mars.nasa.gov", "title": "Look at All Those Boulders! - NASA Mars - NASA Mars Exploration", "description": "This past week, Perseverance has been exploring the top of the western fan in Jezero crater. Scientists have been waiting a long time to examine, up close, one of the terrains observed in this area: boulder fields.", "url": "https://mars.nasa.gov/mars2020/mission/status/459/look-at-all-those-boulders/", "urlToImage": "https://mars.nasa.gov/images/mepjpl/ZL0_0754_0733879529_832EBY_N0371798ZCAM03596_0340LMJ01_1200-web.jpg", "publishedAt": "2023-04-17T18:50:49Z", "content": "This past week, Perseverance has been exploring the top of the western fan in Jezero crater. Scientists have been waiting a long time to examine, up close, one of the terrains observed in this area: … [+1785 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "ChatGPT's citation approach may amplify the Matthew Effect in environmental science - Phys.org", "description": "ChatGPT (GPT) has become one of the most talked-about innovations in recent years, with over 100 million users worldwide. However, there is still limited knowledge about the sources of information GPT utilizes. As a result, we carried out a study focusing on …", "url": "https://phys.org/news/2023-04-chatgpt-citation-approach-amplify-matthew.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/chatgpt-cites-the-most.jpg", "publishedAt": "2023-04-17T18:28:02Z", "content": "ChatGPT (GPT) has become one of the most talked-about innovations in recent years, with over 100 million users worldwide. However, there is still limited knowledge about the sources of information GP… [+2559 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jordan Mendoza", "title": "Asteroid hits Earth hours after being spotted, meteor turns into 'beautiful' fireball over Europe - Phys.org", "description": "An asteroid hit Earth hours after it was discovered Monday, turning into a dazzling fireball that was spotted throughout Europe.", "url": "https://phys.org/news/2023-04-asteroid-earth-hours-meteor-beautiful.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/3-asteroid.jpg", "publishedAt": "2023-04-17T18:00:01Z", "content": "An asteroid hit Earth hours after it was discovered Monday, turning into a dazzling fireball that was spotted throughout Europe.\r\nAround 12:18 p.m. ET Sunday, astronomer Krisztián Sárneczky detected … [+2807 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Prof Stephon Alexander", "title": "How one particle could soon rewrite our laws of the Universe - BBC Science Focus Magazine", "description": "The particle that gives all matter mass may have played a key role in the birth of the Universe.", "url": "https://www.sciencefocus.com/news/higgs-boson-cosmic-inflation/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/04/The-expanding-Universe-77bea4b.jpg?resize=960,413", "publishedAt": "2023-04-17T15:24:32Z", "content": "When we look out at the night sky across vast, cosmic distances using our most sensitive and advanced telescopes, we look back in time. Einstein taught us that light has a finite speed; therefore, it… [+5077 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Mysterious 300-million-year-old 'Tully monster' was an invertebrate, scientists say - Daily Mail", "description": "Scientists have been debating the morphology of the 'Tully monster' since the discovery of its fossils in the 1950s. Now, a team at the University of Tokyo say it definitely did not have a backbone.", "url": "https://www.dailymail.co.uk/sciencetech/article-11980927/Mysterious-300-million-year-old-Tully-monster-invertebrate-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/17/11/69909569-0-image-a-51_1681725672462.jpg", "publishedAt": "2023-04-17T13:39:46Z", "content": "A mysterious 300-million-year-old sea creature, known as the 'Tully monster', definitely did not have a backbone, a new study has claimed.\r\nScientists have been debating the morphology of Tullimonstr… [+8589 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "JWST surpasses Hubble's deepest image ever - Big Think", "description": "With infrared capabilities and image sharpness far beyond Hubble's limits, JWST looked at Hubble's deepest field, revealing so much more.", "url": "https://bigthink.com/starts-with-a-bang/jwst-surpasses-hubbles-deepest-image/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/04/STScI-2023-503b-m-2000x1107-1.jpg?resize=1200,630", "publishedAt": "2023-04-17T06:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Intelligence Reveals a Stunning, High-Definition View of M87's Big Black Hole - SciTechDaily", "description": "Astronomers used machine learning to improve the Event Horizon Telescope's first black hole image, aiding in black hole behavior understanding and testing gravitational theories. The new technique, called PRIMO, has potential applications in various fields, i…", "url": "https://scitechdaily.com/artificial-intelligence-reveals-a-stunning-high-definition-view-of-m87s-big-black-hole/", "urlToImage": "https://scitechdaily.com/images/M87-Black-Hole-Comparison-scaled.jpg", "publishedAt": "2023-04-17T02:29:55Z", "content": "ByAlan Boyle, Universe TodayApril 16, 2023\r\nM87 supermassive black hole originally imaged by the EHT collaboration in 2019 (left); and new image generated by the PRIMO algorithm using the same data s… [+4658 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Welcome to Mars! Caltech's Jaw-Dropping, 5.7 Terapixel Virtual Expedition Across the Red Planet - SciTechDaily", "description": "Both scientists and the public can navigate a new global image of the Red Planet that was made at Caltech using data from NASA’s Mars Reconnaissance Orbiter. Caltech has used data from NASA's Mars Reconnaissance Orbiter to create the highest-resolution global…", "url": "https://scitechdaily.com/welcome-to-mars-caltechs-jaw-dropping-5-7-terapixel-virtual-expedition-across-the-red-planet/", "urlToImage": "https://scitechdaily.com/images/Global-CTX-Mosaic-of-Mars.jpg", "publishedAt": "2023-04-16T20:45:08Z", "content": "ByJet Propulsion LaboratoryApril 16, 2023\r\nThe Global CTX Mosaic of Mars allows scientists and the public to explore the planet like never before. It includes different layers of data that can be tur… [+6614 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clearing the Path for CO2 Capture: MIT's Anti-Fouling Breakthrough in Photobioreactor Technology - SciTechDaily", "description": "Applying a small voltage to the walls of algae-growing tanks can prevent cloudy buildup and allow more photosynthesis to happen. Algae grown in transparent tanks or tubes supplied with carbon dioxide can convert the greenhouse gas into other compounds, such a…", "url": "https://scitechdaily.com/clearing-the-path-for-co2-capture-mits-anti-fouling-breakthrough-in-photobioreactor-technology/", "urlToImage": "https://scitechdaily.com/images/Prevent-Fouling-in-Photobioreactors-for-CO2-Capture.jpg", "publishedAt": "2023-04-16T19:30:06Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyApril 16, 2023\r\nA new, inexpensive technology can limit the buildup of algae on the walls of photobioreactors that can help convert carbon di… [+9240 chars]"}]}