{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Scientists discover gigantic 'structure' under the surface of the Moon - indy100", "description": "The Moon has been a subject of awe and fascination for millennia, with its shape-shifting powers and enigmatic dark side.And though it’s the one celestial body on which man has taken (small) steps, we still have big leaps to go in understanding its potential …", "url": "https://www.indy100.com/science-tech/structure-under-moon-surface-scientists", "urlToImage": "https://www.indy100.com/media-library/check-out-this-amazing-video-of-the-moon-going-in-reverse.jpg?id=33577866&width=1200&height=600&coordinates=0%2C31%2C0%2C55", "publishedAt": "2023-05-02T08:26:57Z", "content": "The Moon has been a subject of awe and fascination for millennia, with its shape-shifting powers and enigmatic dark side.\r\nAnd though its the one celestial body on which man has taken (small) steps, … [+2002 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 2 May 2023: Flat Martian rocks shot by Curiosity Rover - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Flat rock hills on the surface of Mars, captured by the Curiosity Rover.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-2-may-2023-flat-martian-rocks-shot-by-curiosity-rover-71683010410398.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/mars_1683010589607_1683010598261.jpg", "publishedAt": "2023-05-02T06:57:41Z", "content": "Mars, popularly known as the Red Planet, has captured the attention of astronomers, scientists and sci-fi geeks for decades. This is mainly due to its fascinating geographical features such as myster… [+1906 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm DANGER! Intense solar flare explosion sparks blackouts on Earth, NASA says - HT Tech", "description": "In the evening hours of May 1, NASA recorded a solar flare eruption on the Sun. The explosion occurred on the unstable sunspot AR3288. Is a solar storm on its way to the Earth now?", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-danger-intense-solar-flare-explosion-sparks-blackouts-on-earth-nasa-says-71682998801145.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/25937026477_4b7949e87d_o_1660042849056_1682999001988.jpg", "publishedAt": "2023-05-02T03:46:48Z", "content": "On April 30, the forecasters from the National Oceanic and Atmospheric Administration (NOAA) warned about a sunspot, named AR3288, which was growing at an exponential rate and contained unstable delt… [+2371 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Luke Plunkett", "title": "The Spaceships, Robots, Firearms, Worlds And Concept Art Of OHA - Kotaku", "description": "Tonight's Fine Art looks at the work of Korean artist OHA", "url": "https://kotaku.com/oha-concept-art-illustration-nasa-artemis-moon-mech-1850393797", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/361441b951159429446621c0a7986679.jpg", "publishedAt": "2023-05-02T02:20:00Z", "content": "Humans are going back to the Moon! NASAs Artemis program is going to send a bunch of astronauts to the Lunar surface in the coming years, initially for Moon business, but later to start work on the e… [+996 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Tom Nardi", "title": "ESA's Jupiter-bound Probe Hits Antenna Snag - Hackaday", "description": "While the few minutes it takes for a spacecraft’s booster rocket to claw its way out of Earth’s gravity well might be the most obviously hazardous period of the mission, an incredible n…", "url": "https://hackaday.com/2023/05/01/esas-jupiter-bound-probe-hits-antenna-snag/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/juice_feat.jpg", "publishedAt": "2023-05-02T02:00:00Z", "content": "While the few minutes it takes for a spacecraft’s booster rocket to claw its way out of Earth’s gravity well might be the most obviously hazardous period of the mission, an incredible number of thing… [+1991 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "China Finally Tells us What's Going on With its Mars Rover - Universe Today", "description": "The Zhurong Rover has sat unmoving and unresponsive on Mars since May 20th, 2022, when one of the planet’s infamous dust storms forced the science team to switch the rover to hibernation mode. It was expected to wake in late December, but has yet to show any …", "url": "https://www.universetoday.com/161136/china-finally-tells-us-whats-going-on-with-its-mars-rover/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/06/E3lRYYEVEAEpLlq.jpg", "publishedAt": "2023-05-01T22:19:19Z", "content": "The Zhurong Rover has sat unmoving and unresponsive on Mars since May 20th, 2022, when one of the planets infamous dust storms forced the science team to switch the rover to hibernation mode. It was … [+2600 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Feeding the Future: Artificial Photosynthesis Transforms CO2 Into Food - SciTechDaily", "description": "Researchers produce important amino acid from greenhouse gas CO2 Growing demand for food in the world Biotechnological process via methanol as intermediate product Less ground required than for plant cultivation Ensuring the supply of food to the constantly g…", "url": "https://scitechdaily.com/feeding-the-future-artificial-photosynthesis-transforms-co2-into-food/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-05-01T18:13:47Z", "content": "ByTechnical University of Munich (TUM)May 1, 2023\r\nResearchers at the Technical University of Munich have developed a sustainable method to create the essential amino acid L-alanine from CO2. This pr… [+3363 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "NASA's Found A Way To Keep Voyager 2's Full Science Operations Going Until 2026 - IFLScience", "description": "Its power source is getting fainter, and its signals have to travel further, but this extraordinary spacecraft is not done yet.", "url": "https://www.iflscience.com/nasas-found-a-way-to-keep-voyager-2s-full-science-operations-going-until-2026-68694", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68694/aImg/67582/voyager-2-meta.png", "publishedAt": "2023-05-01T16:20:42Z", "content": "A small reserve of backup power has been pressed into service to keep all Voyager 2s scientific instruments operating until 2026, postponing a shutdown planned for this year. The operation will mean … [+2776 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This asteroid will come alarmingly close to Earth! NASA clocks it at 32152 kmph - HT Tech", "description": "Earth is set for a dangerously close encounter with an asteroid on May 3, NASA has warned.", "url": "https://tech.hindustantimes.com/tech/news/this-asteroid-will-come-alarmingly-close-to-earth-nasa-clocks-it-at-32152-kmph-71682957829609.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/asteroid-6099696_1280_1682570598551_1682957957749.jpg", "publishedAt": "2023-05-01T16:19:38Z", "content": "A 100-feet wide asteroid just passed Earth, but there is another space rock on the way and it is set to make quite a scary encounter with our planet. NASA's Jet Propulsion Laboratory has issued an al… [+1699 chars]"}, {"source": {"id": null, "name": "SETI Institute"}, "author": null, "title": "Massive Radio Array to Search for Extraterrestrial Signals from Other Civilizations - SETI Institute", "description": "May 1, 2023, Mountain View, CA – One of the world’s most powerful radio telescope arrays is joining the hunt for signals from other galactic civilizations. The National Science Foundation’s Karl G. Jansky Very Large Array (VLA), situated about 50 miles west o…", "url": "https://www.seti.org/press-release/massive-radio-array-search-extraterrestrial-signals-other-civilizations", "urlToImage": "https://www.seti.org/sites/default/files/2023-04/VLA_DSC_0524-1054px.jpg", "publishedAt": "2023-05-01T16:08:50Z", "content": "May 1, 2023, Mountain View, CA One of the worlds most powerful radio telescope arrays is joining the hunt for signals from other galactic civilizations. The National Science Foundations Karl G. Jansk… [+5447 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A Middle Ordovician Burgess Shale-type fauna from Castle Bank, Wales (UK) - Nature.com", "description": "The authors report a highly diverse Middle Ordovician Burgess Shale-type fauna from Wales (UK) that compares with the Burgess Shale and Chengjiang biotas in palaeoenvironment and preservational style.", "url": "https://www.nature.com/articles/s41559-023-02038-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41559-023-02038-4/MediaObjects/41559_2023_2038_Fig1_HTML.png", "publishedAt": "2023-05-01T15:02:07Z", "content": "<li>Zhang, X., Liu, W. &amp; Zhao, Y. Cambrian Burgess shale-type Lagerstätten in south China: distribution and significance. Gondwana Res.14, 255262 (2008).\r\nArticle \r\nGoogle Scholar \r\n</li><li>Holm… [+9764 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Stargazers make big discovery in tricky atmosphere of a far off exoplanet - The News International", "description": "Astronomers have struck terbium, a rare metal, in the atmosphere of an exoplanet — planets revolving around a star outside our solar system — 670 lightyears away from Earth.This...", "url": "https://www.thenews.com.pk/latest/1066003-stargazers-make-big-discovery-in-tricky-atmosphere-of-a-far-off-exoplanet", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-05-01/1066003_074252_updates.jpg", "publishedAt": "2023-05-01T14:39:00Z", "content": "Astronomers have struck terbium, a rare metal, in the atmosphere of an exoplanet planets revolving around a star outside our solar system 670 lightyears away from Earth.\r\nThis breakthrough was made t… [+2365 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Ultramassive black hole discovered that is 30 billion times bigger than the Sun - indy100", "description": "A new ultramassive black hole has been discovered, and we’re not even going to try to get our heads around its scale. The enormous object observed for the first time is 30 billion times bigger than the Sun and is located hundreds of millions of light-years aw…", "url": "https://www.indy100.com/science-tech/ultramassive-black-hole-larger-sun", "urlToImage": "https://www.indy100.com/media-library/astronomers-capture-first-image-of-a-black-holes-relativistic-jet.jpg?id=33574025&width=1200&height=600&coordinates=0%2C136%2C0%2C104", "publishedAt": "2023-05-01T11:40:28Z", "content": "A new ultramassive black hole has been discovered, and were not even going to try to get our heads around its scale. \r\nThe enormous object observed for the first time is 30 billion times bigger than … [+2164 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supernova Showers: A Deadly Rain of X-rays Threatens Planets - SciTechDaily", "description": "New research reveals that supernovae can pose an additional, previously unidentified threat to nearby planets. This involves intense X-rays, generated when a supernova’s blast wave hits dense surrounding gas, potentially damaging planets' atmospheres up to 16…", "url": "https://scitechdaily.com/?p=270846", "urlToImage": "https://scitechdaily.com/images/Supernova-Planet-scaled.jpg", "publishedAt": "2023-05-01T11:29:49Z", "content": "ByChandra X-ray CenterMay 1, 2023\r\nA new study has examined the possible impact X-rays could have on planets within a certain distance of supernova explosions. Data from Chandra and other telescopes … [+10075 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Moonquakes could 'smooth out' the surfaces of Jupiter and Saturn's icy moons - Space.com", "description": "Tectonic activity triggered by the gravitational influence of the gas giants causes landslides of icy debris.", "url": "https://www.space.com/moonquakes-shape-surfaces-gas-giant-moons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DBhnqEzZj2m5umRFgZwwyj-1200-80.jpg", "publishedAt": "2023-05-01T11:15:44Z", "content": "Moonquakes may be  be smoothing out the surfaces of moons orbiting gas giant planets Jupiter and Saturn, new research has revealed. The findings could solve a long-standing mystery regarding why many… [+3993 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Rare planet found twice the size of Earth that could be entirely covered by an ocean - indy100", "description": "A rare planet has been discovered hundreds of light years away, and it could prove key to our understanding of planetary formations out there in the universe.There have been more than 5,300 exoplanets discovered, but few match the description of the newly rec…", "url": "https://www.indy100.com/science-tech/rare-planet-found-earth-ocean-2659933683", "urlToImage": "https://www.indy100.com/media-library/astronomer-detect-a-possible-ocean-world-on-a-planet-quite-similar-to.jpg?id=33528830&width=1200&height=600&coordinates=0%2C177%2C0%2C177", "publishedAt": "2023-05-01T09:46:14Z", "content": "A rare planet has been discovered hundreds of light years away, and it could prove key to our understanding of planetary formations out there in the universe.\r\nThere have been more than 5,300 exoplan… [+2342 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "The out-of-control rockets and spacecraft that could become deadly - Daily Mail", "description": "The European Space Agency estimates there is more than 10,800 tonnes of space junk currently orbiting the Earth. MailOnline takes a look at the biggest debris and when it could come down.", "url": "https://www.dailymail.co.uk/sciencetech/article-12021389/The-control-rockets-spacecraft-deadly.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/28/20/70363419-0-image-a-29_1682709086280.jpg", "publishedAt": "2023-05-01T09:40:24Z", "content": "Just last week a dead NASA satellite crashed back to Earth amid warnings it had a one in 2,500 chance of killing someone.\r\nAs it was, the spacecraft smashed harmlessly into the Sahara Desert somewher… [+10064 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 1 May 2023: The Great Carina Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is NGC 3372, also known as the Great Carina Nebula which is located in the constellation of Carina.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-1-may-2023-the-great-carina-nebula-71682931600468.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/carina_nebula_1682931649743_1682931649948.jpg", "publishedAt": "2023-05-01T09:02:52Z", "content": "A Nebula can contain as few as ten stars or as many as millions of stars, according to NASA. Although most nebulae belong to just three types - spherical, elliptical and bipolar, some of them might b… [+1811 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Ghosts: Atoms Become Transparent to Certain Frequencies of Light - SciTechDaily", "description": "Newly Observed Effect Makes Atoms Transparent to Certain Frequencies of Light Researchers at Caltech have discovered a new phenomenon, \"collectively induced transparency\" (CIT), where light passes unimpeded through groups of atoms at certain frequencies. This…", "url": "https://scitechdaily.com/quantum-ghosts-atoms-become-transparent-to-certain-frequencies-of-light/", "urlToImage": "https://scitechdaily.com/images/Collectively-Induced-Transparency.jpg", "publishedAt": "2023-05-01T08:26:45Z", "content": "Artists visualization of a laser striking atoms in an optical cavity. Scientists discovered a new phenomenon called collectively induced transparency (CIT) where groups of atoms cease to reflect ligh… [+2774 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Do Nutrients Enter Cells? Solving the Mystery - SciTechDaily", "description": "Proteins integrated into the cell membrane play a crucial role in transporting nutrients to the intended destination within our cells. If this transportation system malfunctions and metabolites are unable to reach their target, it can have adverse effects on …", "url": "https://scitechdaily.com/how-do-nutrients-enter-cells-solving-the-mystery/", "urlToImage": "https://scitechdaily.com/images/Mouse-Embryo.jpg", "publishedAt": "2023-05-01T06:21:24Z", "content": "Mouse embryos, like the one depicted here, die in utero if they are missing the choline transporter FLVCR1. But giving them supplemental choline can increase their lifespan. Credit: Laboratory of Met… [+4639 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Amazing” – Astrophysicists Have Identified the Shortest-Period, Low-Mass Stellar Binary System Ever Observed - SciTechDaily", "description": "Astrophysicists from Northwestern University and the University of California San Diego have identified the tightest binary system ever observed among ultracool dwarfs. The two stars are in such proximity that they complete a revolution around each other in l…", "url": "https://scitechdaily.com/amazing-astrophysicists-have-identified-the-shortest-period-low-mass-stellar-binary-system-ever-observed/", "urlToImage": "https://scitechdaily.com/images/Eclipsing-Binary-Illustration-scaled.jpg", "publishedAt": "2023-04-30T22:20:29Z", "content": "This illustration depicts a pair of stars in close orbit. Credit: ESO/L. Calçada\r\nAstrophysicists from Northwestern University and the University of California San Diego have identified the tightest … [+5688 chars]"}, {"source": {"id": null, "name": "Hot Hardware"}, "author": "Tim Sweezy", "title": "NASA’s Ingenuity Helicopter Captured These Amazing Shots Of Mars - Hot Hardware", "description": "In a 'Where's Waldo?' type tweet, NASA asked Twitter if its followers could spot two of its Martian spacecraft photobombing each other.", "url": "https://hothardware.com/news/nasas-ingenuity-helicopter-captured-amazing-shots-of-mars", "urlToImage": "https://images.hothardware.com/contentimages/newsitem/61509/content/small_hero-nasa-ingenuity-image.jpg", "publishedAt": "2023-04-30T15:58:00Z", "content": "NASA's Ingenuity helicopter captured a breathtaking image of the Mars landscape, and had a fellow Martian spacecraft photobomb the picture. During Ingenuity's 51st flight over the Belva crater, NASA'… [+1861 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mammalian Tree of Life Redefined: Genomic Time Machine Traces Back 100 Million Years of Evolution - SciTechDaily", "description": "The research uses the genomes of 241 species and can be used to support animal and human health outcomes. Research led by a team of scientists from the Texas A&M School of Veterinary Medicine and Biomedical Sciences puts to bed the heated scientific debate re…", "url": "https://scitechdaily.com/?p=273013", "urlToImage": "https://scitechdaily.com/images/New-Research-Redefines-Mammalian-Tree-of-Life-scaled.jpg", "publishedAt": "2023-04-30T15:29:16Z", "content": "ByTexas A&amp;M UniversityApril 30, 2023\r\nResearchers from Texas A&amp;M University have used the largest mammalian genomic dataset to track the evolutionary history of mammals, concluding that mamma… [+11339 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Harry Baker", "title": "See Mercury's giant, comet-like tail in stunning new image as it passes close to the sun - Space.com", "description": "Mercury's comet-like tail is made predominantly of sodium ions.", "url": "https://www.space.com/https://www.livescience.com/space/mercury/see-mercurys-giant-comet-like-tail-in-stunning-new-image-as-it-passes-close-to-the-sun", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qncuoAiN94DreHXVojAuD6-1200-80.jpg", "publishedAt": "2023-04-30T14:22:56Z", "content": "Mercury's comet-like tail streaks across the sky in this image captured April 12. (Image credit: Dr. Sebastian Voltmer | www.voltmer.photo)\r\nMercury has been spotted cosplaying as a comet recently wh… [+2979 chars]"}]}