{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "The 10 biggest physics and astronomy lies from 2023 - Big Think", "description": "Misinformation was extremely popular in 2023, as bad science often made global headlines. Learn the truth behind these 10 dubious stories.", "url": "https://bigthink.com/starts-with-a-bang/10-biggest-physics-astronomy-lies-2023/", "urlToImage": "https://bigthink.com/wp-content/uploads/2022/05/eso2208-eht-mwe.jpg?resize=1200,630", "publishedAt": "2023-12-18T07:00:00Z", "content": null}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Scientists made an ultra-tough substance as strong as diamonds that could be used to coat spacecraft - BGR", "description": "A group of scientists have created an ultra-tough substance that rivals the hardness of diamonds. It may even be used to coat spacecraft.", "url": "https://bgr.com/science/scientists-made-an-ultra-tough-substance-as-hard-as-diamonds/", "urlToImage": "https://bgr.com/wp-content/uploads/2022/09/AdobeStock_313933958.jpg?quality=82&strip=all", "publishedAt": "2023-12-17T17:06:00Z", "content": "Diamonds are one of the hardest naturally occurring substances on Earth, and while we’ve discovered minerals even stronger than diamonds, scientists may have just taken things a step further. Accordi… [+2122 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Jess Battison", "title": "NASA still can't open canister containing asteroid sample two months after discovery - LADbible", "description": "The sample of rocks and dust could potentially help answer major questions but NASA just cannot open it", "url": "https://www.ladbible.com/news/science/nasa-asteroid-sample-cannot-open-571872-20231217", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&url=https://images.ladbiblegroup.com/v3/assets/bltcd74acc1d0a99f3a/bltfedfcd0e9bcb9355/657f138d8ffcd1040a0e571c/NASA-still-can_t-open-asteroid-container.png", "publishedAt": "2023-12-17T15:28:24Z", "content": "Two months after its discovery, NASA still cant open the canister containing an asteroid sample.\r\nSo, back in September, the space agency had a special sample of rocks and dust returned to Earth afte… [+2460 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Think That Volcano Is Asleep? Think Again: Explosive Secrets Unveiled - SciTechDaily", "description": "Even in a quiet dormant phase, a volcano can rapidly become active and its eruption can pose a previously unknown threat to the surrounding area. Can a volcano erupt after tens of thousands of years of dormancy? If so, how can this be explained and what makes…", "url": "https://scitechdaily.com/think-that-volcano-is-asleep-think-again-explosive-secrets-unveiled/", "urlToImage": "https://scitechdaily.com/images/Dormant-Volcano-Explosive-Eruption-Art-Concept.jpg", "publishedAt": "2023-12-17T11:41:30Z", "content": "Researchers have studied the Ciomadul volcano to understand how long-dormant volcanoes can suddenly erupt. Their findings on the chemical and mineral composition of the magma provide valuable insight… [+6970 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious New Signals Detected by SETI: Unlocking the Strange Puzzle of Fast Radio Bursts - SciTechDaily", "description": "This work proves that new telescopes with unique capabilities, like the ATA, can provide a new angle on outstanding mysteries in FRB science. A team of SETI Institute scientists have unveiled new insights into a cosmic mystery known as Fast Radio Bursts (FRBs…", "url": "https://scitechdaily.com/mysterious-new-signals-detected-by-seti-unlocking-the-strange-puzzle-of-fast-radio-bursts/", "urlToImage": "https://scitechdaily.com/images/Telescope-Array-Space-Signal-Art-Concept.jpg", "publishedAt": "2023-12-17T04:03:00Z", "content": "Researchers at the SETI Institute have observed 35 bursts from FRB 20220912A using the Allen Telescope Array, shedding light on the mysterious nature of Fast Radio Bursts and their possible origins f… [+5581 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Scientists are Recommending IceCube Should be Eight Times Bigger - Universe Today", "description": "The IceCube Neutrino Observatory, operated by the University of Wisconsin-Madison (UW-M), located at the Amundsen–Scott South Pole Station in Antarctica, is one of the most ambitious neutrino observatories in the world. Behind this observatory is the IceCube …", "url": "https://www.universetoday.com/164709/scientists-are-recommending-icecube-should-be-eight-times-bigger/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/12/055.jpg", "publishedAt": "2023-12-16T23:55:18Z", "content": "The IceCube Neutrino Observatory, operated by the University of Wisconsin-Madison (UW-M), located at the AmundsenScott South Pole Station in Antarctica, is one of the most ambitious neutrino observat… [+4315 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Cheyenne MacDonald", "title": "These tomatoes were lost on the International Space Station for almost a year - Engadget", "description": "NASA shared a photo of two tomatoes that turned up on the International Space Station after eight months lost. They were harvested by astronaut Frank Rubio, ...", "url": "https://www.engadget.com/these-tomatoes-were-lost-on-the-international-space-station-for-almost-a-year-182601610.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/5KyknOg6VlBGB_r5fkFH.w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-12/341ea3c0-9c3f-11ee-bff3-57c60d105d36", "publishedAt": "2023-12-16T18:26:01Z", "content": "In an interview this fall following his return to Earth from the International Space Station, NASA astronaut Frank Rubio shared a little mission anecdote that had us gripped: after hed harvested one … [+2084 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Edward Armstrong", "title": "The Sahara Desert used to be a green savannah: Research explains why - Phys.org", "description": "Algeria's Tassili N'Ajjer plateau is Africa's largest national park. Among its vast sandstone formations is perhaps the world's largest art museum. Over 15,000 etchings and paintings are exhibited there, some as much as 11,000 years old according to scientifi…", "url": "https://phys.org/news/2023-12-sahara-green-savannah.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/saharadesert.jpg", "publishedAt": "2023-12-16T17:50:01Z", "content": "Algeria's Tassili N'Ajjer plateau is Africa's largest national park. Among its vast sandstone formations is perhaps the world's largest art museum. Over 15,000 etchings and paintings are exhibited th… [+6334 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "Could There Be a Black Hole Inside the Sun? - Universe Today", "description": "Primordial black holes are one explanation for dark matter, although it's not widely accepted. These black holes would have formed at the beginning of the Universe and would be at least the mass of a medium-sized asteroid. These black holes may have fallen in…", "url": "https://www.universetoday.com/164864/could-there-be-a-black-hole-inside-the-sun/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/12/052.jpg", "publishedAt": "2023-12-16T17:37:50Z", "content": "It’s a classic tale of apocalyptic fiction. The Sun, our precious source of heat and light, collapses into a black hole. Or perhaps a stray black hole comes along and swallows it up. The End is Nigh!… [+2990 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Research finds women 'turn inward' when they experience ambiguous workplace incidents - Phys.org", "description": "That gender discrimination is wrong is beyond argument. But identifying which incidents are cases of it is not always so clear cut. That's why researchers are recommending that organizations develop processes that encourage workers to share their concerns whe…", "url": "https://phys.org/news/2023-12-women-ambiguous-workplace-incidents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/gender-discrimination-2.jpg", "publishedAt": "2023-12-16T16:10:01Z", "content": "That gender discrimination is wrong is beyond argument. But identifying which incidents are cases of it is not always so clear cut. That's why researchers are recommending that organizations develop … [+4218 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "Halley's Comet Just Began its 38-year Journey Back Toward Earth–The Big Comeback - Good News Network", "description": "The most famous of all comets has a flattened elliptical orbit that sees it go from the Sun to the outer limits of the solar system", "url": "https://www.goodnewsnetwork.org/halleys-comet-just-began-its-38-year-journey-back-toward-earth-the-big-comeback/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/12/Halleys-Comet-as-seen-from-the-Kuiper-Airborne-Observatory-NASA.jpg", "publishedAt": "2023-12-16T12:00:30Z", "content": "Halley’s Comet as seen from the Kuiper Airborne Observatory – NASA.\r\nHalley’s Comet passed the farthest point in its orbit beyond Neptune and is now heading back toward Earth.\r\nThe most famous of all… [+1000 chars]"}]}