{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking New Dark Matter Map Validates Einstein's Theory of General Relativity - SciTechDaily", "description": "Research by the Atacama Cosmology Telescope collaboration has culminated in a significant breakthrough in understanding the evolution of the universe. For millennia, humans have been fascinated by the mysteries of the cosmos. Unlike ancient philosophers imagi…", "url": "https://scitechdaily.com/groundbreaking-new-dark-matter-map-validates-einsteins-theory-of-general-relativity/", "urlToImage": "https://scitechdaily.com/images/ACT-Lensing-Map-scaled.jpg", "publishedAt": "2023-04-12T08:29:55Z", "content": "ByPrinceton UniversityApril 12, 2023\r\nResearchers used the Atacama Cosmology Telescope to create this new map of the dark matter. The orange regions show where there is more mass; purple where there … [+11689 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Gravitational waves could reveal hidden histories of black holes – Physics World - physicsworld.com", "description": "Signatures from infalling objects would help resolve Hawking-radiation information paradox", "url": "https://physicsworld.com/a/gravitational-waves-could-reveal-hidden-histories-of-black-holes/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/04/Artistic-impression-of-a-black-hole.jpg", "publishedAt": "2023-04-12T00:20:37Z", "content": "Infalling matter: research suggests that information could be recovered from a black hole via gravitational waves. (Courtesy: Shutterstock/Rost9)\r\nSince they were first observed in 2015, gravitationa… [+5872 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Baking Soda Saves the World: New Additive in Concrete Mix Could Slash Carbon Emissions - SciTechDaily", "description": "MIT engineers discover new carbonation pathways for creating more environmentally friendly concrete. Concrete's carbon footprint could be reduced by 15% if sodium bicarbonate is introduced during the early stages of mixing, according to MIT researchers. The a…", "url": "https://scitechdaily.com/baking-soda-saves-the-world-new-additive-in-concrete-mix-could-slash-carbon-emissions/", "urlToImage": "https://scitechdaily.com/images/Carbon-Dioxide-CO2-Concrete.jpg", "publishedAt": "2023-04-11T21:10:25Z", "content": "When OPC is mixed with water, sand, and gravel material during the production of concrete, it becomes highly alkaline, creating a seemingly ideal environment for the sequestration and long-term stora… [+3844 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Philosopher Of Science Asks If We Are In A Mass Extinction - IFLScience", "description": "The question requires not just measurements of the rate of species loss, but also hard thinking about what a mass extinction is.", "url": "https://www.iflscience.com/are-we-in-a-sixth-mass-extinction-right-now-68405", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68405/aImg/67116/dodo-meta.png", "publishedAt": "2023-04-11T16:31:14Z", "content": "The Earth is losing species much faster than normal, or than new ones are evolving. The rate of loss may be the fastest since the aftermath of the asteroid that ended the reign of the dinosaurs, 65 m… [+3103 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "Sea Cucumbers Kill Predators By Firing Sticky Organs Out Their Butts - IFLScience", "description": "Beware the Holothuriidae’s ass grass.", "url": "https://www.iflscience.com/sea-cucumbers-kill-predators-by-firing-sticky-organs-out-their-butts-68395", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68395/aImg/67091/sea-cucumber-expel-organ-meta.png", "publishedAt": "2023-04-11T16:06:42Z", "content": "Ghostly white tendrils exploding out the rear end of a sea cucumber might look like a horrible parasite infection to the uninitiated, but those trained in the ways of Holothuriidae know its a trap. W… [+2630 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New discovery points the way to more compact fusion power plants - Phys.org", "description": "A magnetic cage keeps the more than 100 million degree Celsius hot plasmas in nuclear fusion devices at a distance from the vessel wall so that they do not melt. Now researchers at the Max Planck Institute for Plasma Physics (IPP) have found a way to signific…", "url": "https://phys.org/news/2023-04-discovery-compact-fusion-power.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-discovery-points-t.jpg", "publishedAt": "2023-04-11T13:34:03Z", "content": "A magnetic cage keeps the more than 100 million degree Celsius hot plasmas in nuclear fusion devices at a distance from the vessel wall so that they do not melt. Now researchers at the Max Planck Ins… [+6412 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "Useless Shell Of A Semislug Reminds Us Evolution Is A Work In Progress - IFLScience", "description": "Is the \"snug\" a snail or a slug? He screams, for he does not known.", "url": "https://www.iflscience.com/new-species-of-semi-slug-reminds-us-evolution-is-a-work-in-progress-68389", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68389/aImg/67081/semislug-meta.png", "publishedAt": "2023-04-11T12:07:27Z", "content": "A new species of semi-slug has been discovered in the hot lowland forests of Ulu Temburong National Park, Brunei, with the aid of citizen scientists. In case this is the first time youre hearing of a… [+2831 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Suspected Mass Extinction Was A Volcanic Double-Punch Three Million Years Apart - IFLScience", "description": "A long-debated mass extinction 260 million years ago was actually two events, both caused by massive eruptions, a team of paleontologists claim.", "url": "https://www.iflscience.com/suspected-mass-extinction-was-actually-a-volcanic-double-punch-3-million-years-apart-68387", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68387/aImg/67077/permian-volcano-meta.png", "publishedAt": "2023-04-11T11:11:10Z", "content": "During the Capitanian age 260 million years ago, the oceans suffered a drastic loss of oxygen causing, or perhaps amplifying, widespread global extinctions. Then 3 million years later the same thing … [+3949 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Acres, technology reporter", "title": "Venus has more volcanoes than we thought - and this map shows where they are - Sky News", "description": "", "url": "https://news.sky.com/story/venus-has-more-volcanoes-than-we-thought-and-this-map-shows-where-they-are-12854918", "urlToImage": "https://e3.365dm.com/21/12/1600x900/skynews-venus-aliens-science_5622114.jpg?20211221123303", "publishedAt": "2023-04-11T09:49:12Z", "content": "Venus has long been known as a home to plenty of volcanoes - but not quite this many.\r\nA new map of the red-hot planet, which has a surface temperature of about 450C (842F), reveals there are around … [+2081 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "NASA Reveals What Made an Entire Starlink Satellite Fleet Go Down - Slashdot - Slashdot", "description": "schwit1 shares a report from Inverse:  On March 23, sky observers marveled at a gorgeous display of northern and southern lights. It was a reminder that when our Sun gets active, it can spark a phenomenon called \"space weather.\" Aurorae are among the most ben…", "url": "https://science.slashdot.org/story/23/04/11/0136200/nasa-reveals-what-made-an-entire-starlink-satellite-fleet-go-down", "urlToImage": "https://a.fsdn.com/sd/topics/space_64.png", "publishedAt": "2023-04-11T08:51:28Z", "content": "On March 23, sky observers marveled at a gorgeous display of northern and southern lights. It was a reminder that when our Sun gets active, it can spark a phenomenon called \"space weather.\" Aurorae a… [+1759 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Cartography: MIT Astronomers Map “Disk Winds” in a Distant Neutron Star System - SciTechDaily", "description": "The 2D map of this “disk wind” may reveal clues to galaxy formation. MIT astronomers have successfully mapped the vertical shape and structure of disk winds in the Hercules X-1 system, marking the first time such winds have been observed in two dimensions. Th…", "url": "https://scitechdaily.com/cosmic-cartography-mit-astronomers-map-disk-winds-in-a-distant-neutron-star-system/", "urlToImage": "https://scitechdaily.com/images/Disk-Winds-Around-Hercules-X-1-scaled.jpg", "publishedAt": "2023-04-11T08:32:50Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyApril 11, 2023\r\nMIT astronomers mapped the disk winds associated with the accretion disk around Hercules X-1, a system in which a neutron star is … [+11120 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Ancient formation discovered wrapped around Earth's core - indy100", "description": "The structure of the Earth beneath our feet has been fascinating to members of the scientific community recently, and it turns out it’s far more complex than people initially thought.First, we learned of the news that there’s a massive ocean beneath the Earth…", "url": "https://www.indy100.com/science-tech/ancient-formation-earth-core", "urlToImage": "https://www.indy100.com/media-library/the-earths-core-is-cooling-faster-than-previously-expected.jpg?id=33443990&width=1200&height=600&coordinates=0%2C106%2C0%2C168", "publishedAt": "2023-04-11T08:25:48Z", "content": "The structure of the Earth beneath our feet has been fascinating to members of the scientific community recently, and it turns out its far more complex than people initially thought.\r\nFirst, we learn… [+1992 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Mystery of Fast Radio Bursts. One Step Closer to The Answer? - Fraser Cain", "description": "What are Fast Radio Bursts? Did we get a step closer to answering this question by associating some of them with a Kilonova event? What Cosmology questions c...", "url": "https://www.youtube.com/watch?v=o8uTWGBSLcU", "urlToImage": "https://i.ytimg.com/vi/o8uTWGBSLcU/maxresdefault.jpg", "publishedAt": "2023-04-10T21:16:19Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stellar Revelation: AI Discovers the Universe's First Stars Weren't Alone - SciTechDaily", "description": "Using artificial intelligence, an international team analyzed the chemical composition of extremely metal-poor stars, finding that the first stars in the Universe were likely born in groups rather than individually. This method will be applied to future obser…", "url": "https://scitechdaily.com/stellar-revelation-ai-discovers-the-universes-first-stars-werent-alone/", "urlToImage": "https://scitechdaily.com/images/AI-Finds-That-First-Stars-Were-Clustered-Together.jpg", "publishedAt": "2023-04-10T16:40:24Z", "content": "Ejecta from the first supernovae (cyan, green, and purple objects surrounded by clouds of ejected material) enrich the primordial hydrogen and helium gas with heavy elements. If the first stars were … [+4196 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "Manganese Tubers Are Precious Deep-Sea Potatoes That Battery Makers Lust After - IFLScience", "description": "What’s manganese tubers, precious?", "url": "https://www.iflscience.com/manganese-tubers-are-precious-deep-sea-potatoes-that-battery-makers-lust-after-68383", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68383/aImg/67074/manganese-nodules-meta.png", "publishedAt": "2023-04-10T16:39:05Z", "content": "There are treasures to be found among the sediments of abyssal plains for those willing to dive 3,0006,000 meters (9,80019,600 feet) to go searching. Here, vast fields of manganese nodules can be fou… [+3657 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Meteorite Hunters Using Magnets Wiped Our Best Chance To Confirm Mars' Ancient Magnetic Field - IFLScience", "description": "The process being used to verify precious packages from space is also destroying one of the most valuable things about some of them.", "url": "https://www.iflscience.com/meteorite-hunters-using-magnets-wiped-our-best-chance-to-confirm-mars-ancient-magnetic-field-68384", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68384/aImg/67072/black-beauty-meta.png", "publishedAt": "2023-04-10T16:05:48Z", "content": "Even in an age of rovers on Mars and probes to asteroids, meteorites provide vital information that we often cant get anywhere else. Some of the knowledge we seek is stored magnetically, making its w… [+3368 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rachael Funnell", "title": "World's Slimiest Animal Makes Goo That Can Expand 10000 Times In 0.4 Seconds - IFLScience", "description": "As one driver found out the hard way when a truckload of hagfish landed on their car.", "url": "https://www.iflscience.com/worlds-slimiest-animal-makes-goo-that-can-expand-10000-times-in-04-seconds-68381", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68381/aImg/67071/hagfish-slime-meta.png", "publishedAt": "2023-04-10T15:55:11Z", "content": "Nobody does slime better than hagfish. Also known as slime eels, these slippery Myxiniformes have evolved to use goo as a defense mechanism by clogging the gills of predators in less than a second. T… [+2755 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Rollable 'membrane mirrors' could pave way for bigger, more powerful space telescopes - Space.com", "description": "'It could make lightweight mirrors that are 15 or 20 meters in diameter a reality.'", "url": "https://www.space.com/membrane-mirrors-big-space-telescopes", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vjneBsmLhPJKuTCWcbHXFb-1200-80.jpeg", "publishedAt": "2023-04-10T13:00:14Z", "content": "A scientist says it may be possible to create low-cost foldable telescope mirrors that are more than twice the size of those onboard the James Webb Space Telescope (JWST), whose giant iconic golden h… [+4521 chars]"}, {"source": {"id": null, "name": "Boredpanda.com"}, "author": "Gabija Saveiskyte", "title": "79 Pictures And Illustrations That Might Make You Say “Nature Was Metal” - Bored Panda", "description": "Mother nature never ceases to amaze us. It’s a source of life for awe-inspiring creatures, from delicate to humongous, and everything in between. However, some of the latter might seem delicate, too, compared to the living things that have gone extinct.", "url": "https://www.boredpanda.com/extinct-nature-was-metal/", "urlToImage": "https://www.boredpanda.com/blog/wp-content/uploads/2023/04/extinct-nature-was-metal-fb12.png", "publishedAt": "2023-04-10T07:24:52Z", "content": null}]}