{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Live Science"}, "author": "Joshua A. Krisch", "title": "Scientists just found a hidden 6th mass extinction in Earth's ancient past - Livescience.com", "description": "A global drop in oxygen levels about 550 million years ago led to Earth's first known mass extinction, new evidence suggests.", "url": "https://www.livescience.com/1st-mass-extinction-oxygen-drop", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ckfsXACvh5n2WCSeBvfbZP-1200-80.jpg", "publishedAt": "2022-11-15T12:00:00Z", "content": "The height of the Ediacaran period, about 550 million years ago, was a boom time for life in Earth's oceans. Petalonamids shaped like feathers sucked nutrients from the water, slug-like Kimberella gr… [+5368 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Go!” – NASA’s Artemis I Launch Set To Make History - SciTechDaily", "description": "NASA Managers Give “Go” to Proceed Toward Artemis I Launch, Countdown Progressing Artemis I managers convened on Monday afternoon to review the status of countdown operations as well as two open technical items, and gave a “go” to proceed toward launch on Wed…", "url": "https://scitechdaily.com/go-nasas-artemis-i-launch-set-to-make-history/", "urlToImage": "https://scitechdaily.com/images/SLS-Rocket-and-Orion-Spacecraft-scaled.jpg", "publishedAt": "2022-11-15T10:33:29Z", "content": "ByNASANovember 15, 2022\r\nIllustrations of the Space Launch System rocket and Orion spacecraft on the launch pad. Credit: NASA\r\nNASA Managers Give Go to Proceed Toward Artemis I Launch, Countdown Prog… [+5420 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Alejandro Alcantarilla Romera", "title": "Booster 7 resumes static fire testing as SpaceX ramps up Starship production - NASASpaceFlight.com - NASASpaceflight.com", "description": "Booster 7 resumed its static fire test campaign Monday with a full-duration firing of 14…", "url": "https://www.nasaspaceflight.com/2022/11/b7-resumes-static-fire/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/11/Fhi9vgsXgAUWSwW-508x350.jpeg", "publishedAt": "2022-11-14T17:51:49Z", "content": "Booster 7 resumed its static fire test campaign Monday with a full-duration firing of 14 Raptor engines in a significant event before the long-awaited 33-engine static fire test. This milestone puts … [+12754 chars]"}]}