{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 3 April 2023: Olympus Mons volcano on Mars - HT Tech", "description": "Today's NASA Astronomy Picture of the Day is an aerial snapshot of Olympus Mons, the largest volcano in the solar system which is located on Mars.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-3-april-2023-olympus-mons-volcano-on-mars-71680502592908.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/03/1600x900/Mars_olympus_mons_volcano_1680502715765_1680502716012_1680502716012.jpg", "publishedAt": "2023-04-03T06:19:39Z", "content": "A volcano is an opening on the surface of a planet or moon that allows material hotter than its surroundings to escape from its interior. Although numerous volcanoes exist on Earth, the biggest volca… [+1958 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Mercury, Moon and Planets, and Lyrid Meteor Shower! - SciTechDaily", "description": "What are some skywatching highlights in April 2023? Mercury reaches its highest in the evening sky for the year for Northern Hemisphere observers. The Moon makes its monthly rounds to pair up beautifully with several planets. And viewing conditions may be ide…", "url": "https://scitechdaily.com/?p=265602", "urlToImage": "https://scitechdaily.com/images/Meteor-Shower-Artist-Depiction.jpg", "publishedAt": "2023-04-02T20:48:09Z", "content": "April 26-27 The Moon is at its first-quarter phase, which is a great time to observe with binoculars or a telescope if you have access to them. Around this time you can observe details in the lunar c… [+2758 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "NASA will unveil its first moon crew in 50 years tomorrow - Daily Mail", "description": "Three Americans and a Canadian will be revealed to the world on Monday (April 3) as they gear up to fly around our lunar satellite as part of the Artemis II mission scheduled for 2024.", "url": "https://www.dailymail.co.uk/sciencetech/article-11920921/NASA-unveil-moon-crew-50-years-tomorrow.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/31/13/69334693-0-image-a-40_1680266547579.jpg", "publishedAt": "2023-04-02T15:46:17Z", "content": "Fifty two years ago, David Bowie was headlining Glastonbury, Muhammad Ali and Joe Frazier traded blows in the 'Fight of the Century', and John Lennon left Britain for the final time before his murder… [+14406 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Leonard David", "title": "The eyes have it! Focus on microgravity's impact on astronaut vision - Space.com", "description": "Clearly, on any lengthy trek to space and back, being \"blindsided\" by blurry eyesight is not ideal.", "url": "https://www.space.com/microgravity-vision-effects-astronauts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EeHrnDw2mg7Asan4HYuopU-1200-80.jpg", "publishedAt": "2023-04-02T10:00:05Z", "content": "After decades of collecting data about how astronauts' vision is affected by spaceflight, scientists have identified a set of microgravity-induced changes to the human eye known as Spaceflight-Associ… [+6272 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Take MailOnline's science quiz and test what you REALLY know about life and the universe - Daily Mail", "description": "MailOnline has put together 20 multiple choice questions that will test your knowledge of life on Earth and the universe beyond.", "url": "https://www.dailymail.co.uk/sciencetech/article-11916437/Take-MailOnlines-science-quiz-test-REALLY-know-life-universe.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/29/17/69257209-0-image-a-9_1680109119196.jpg", "publishedAt": "2023-04-02T09:19:35Z", "content": "1. How long would it take to fall through an airless, frictionless hole all the way through the Earth?\r\nAnswer: 42 minutes\r\nAlthough building a tunnel through the centre of the Earth would be a major… [+10483 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "How long will it take for humans to colonize another planet? - Livescience.com", "description": "There's a huge difference between sending humans to Mars and colonizing worlds outside our solar system.", "url": "https://www.livescience.com/how-long-will-it-take-for-humans-to-colonize-another-planet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uP7qVWL7Cp7JLu7C5Y4Euj-1200-80.jpg", "publishedAt": "2023-04-02T09:00:00Z", "content": "A concept image of an astronaut on Mars. How long would it take for us to colonize the Red Planet? (Image credit: Janiecbros via Getty Images)\r\nSpaceX CEO Elon Musk wants to have a city of a million … [+5685 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Saturn's Moon Titan Beckons As NASA's Dragonfly Mission Achieves Critical Milestone - SciTechDaily", "description": "NASA’s Dragonfly Team Soars through Major Design Review The Dragonfly mission, led by the Johns Hopkins Applied Physics Laboratory (APL), recently passed the weeklong Preliminary Design Review (PDR), a critical milestone. APL, NASA's Goddard Space Flight Cent…", "url": "https://scitechdaily.com/saturns-moon-titan-beckons-as-nasas-dragonfly-mission-achieves-critical-milestone/", "urlToImage": "https://scitechdaily.com/images/Dragonfly-Rotorcraft-Lander-on-Surface-of-Titan-scaled.jpg", "publishedAt": "2023-04-02T08:02:14Z", "content": "ByNASAApril 2, 2023\r\nArtists impression of the Dragonfly rotorcraft-lander on the surface of Titan, Saturns largest moon and a major target in NASAs quest to assess habitability and search for potent… [+5841 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Two giant holes opened up on Sun potentially sending million mph winds to Earth - indy100", "description": "A giant hole has opened up on the surface of the Sun, which could soon result in solar winds measuring millions of miles per hour hurtling towards Earth.The coronal hole measures 20 times larger than our planet and it’s the second of its type to be detected i…", "url": "https://www.indy100.com/science-tech/sun-hole-solar-winds-earth-2659713729", "urlToImage": "https://www.indy100.com/media-library/giant-sunspot-predicted-to-unleash-rare-and-incredible-aurora-borealis-all-across.png?id=33371573&width=1200&height=600&coordinates=0%2C155%2C0%2C156", "publishedAt": "2023-04-02T07:24:23Z", "content": "A giant hole has opened up on the surface of the Sun, which could soon result in solar winds measuring millions of miles per hour hurtling towards Earth.\r\nThe coronal hole measures 20 times larger th… [+2660 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Saturn's Strange Ring-Heat Phenomenon: Solving a Solar System Mystery - SciTechDaily", "description": "A Rain of Icy Particles Is Affecting the Giant Planet's Weather The planet Saturn is easily recognizable for its opulent ring system that can easily be seen through a small telescope. Astronomers have now found that the rings are not as placid as they look. T…", "url": "https://scitechdaily.com/saturns-strange-ring-heat-phenomenon-solving-a-solar-system-mystery/", "urlToImage": "https://scitechdaily.com/images/Saturn-Rings-Art-Illustration.jpg", "publishedAt": "2023-04-02T01:21:35Z", "content": "BySpace Telescope Science InstituteApril 1, 2023\r\nA veteran astronomer has discovered that Saturns vast ring system is heating the planets upper atmosphere, a phenomenon never before observed in our … [+12334 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Lewin Day", "title": "Blender And OpenEMS Teamed Up Make Stunning Simulations - Hackaday", "description": "There’s tons of theory out there to explain the behavior of electronic circuits and electromagnetic waves. When it comes to visualization though, most of us have had to make do with our lectu…", "url": "https://hackaday.com/2023/04/01/blender-and-openems-teamed-up-make-stunning-simulations/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/emqbtm6frwpa1-e1680071874205.webp", "publishedAt": "2023-04-01T20:00:00Z", "content": "There’s tons of theory out there to explain the behavior of electronic circuits and electromagnetic waves. When it comes to visualization though, most of us have had to make do with our lecturer’s ve… [+1052 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Breakthrough: Researchers Overcome Long-Standing Limitation of First Law of Thermodynamics - SciTechDaily", "description": "Physicists at West Virginia University have overcome a long-standing limitation of the first law of thermodynamics. Paul Cassak, a professor and associate director of the Center for KINETIC Plasma Physics at West Virginia University, and Hasan Barbhuiya, a gr…", "url": "https://scitechdaily.com/physics-breakthrough-researchers-overcome-long-standing-limitation-of-first-law-of-thermodynamics/", "urlToImage": "https://scitechdaily.com/images/Argon-Plasma-Glows-a-Bluish-Color.jpg", "publishedAt": "2023-04-01T19:10:41Z", "content": "Research findings led by Paul Cassak, WVU professor and associate director of the WVU Center for KINETIC Plasma Physics, have broken new ground on how scientists can understand the first law of therm… [+3684 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Evan Gough, Universe Today", "title": "9 Years Ago, Astronomers Found Two Rogue Planets — But They Didn't Realize It Until Now - Inverse", "description": "Scientists have found what appear to be rogue planets hidden in old survey data.", "url": "https://www.inverse.com/science/rogue-planets", "urlToImage": "https://imgix.bustle.com/uploads/shutterstock/2023/3/31/27b350df-ef22-4efe-949c-cc203a95d6b0-shutterstock-2061939557.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-04-01T19:00:24Z", "content": "Scientists have found what appear to be rogue planets hidden in old survey data. Their results are starting to define the poorly-understood rogue planet population. In the near future, the Nancy Grac… [+8869 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jurassic Makeover: Revealing the True Faces of Predatory Dinosaurs Like T. rex - SciTechDaily", "description": "A recent study challenges the depiction of predatory dinosaurs like Tyrannosaurus rex with exposed teeth, suggesting they had scaly, lizard-like lips instead. By examining tooth structure, wear patterns, and jaw morphology of reptile groups, researchers concl…", "url": "https://scitechdaily.com/?p=264958", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-Lipped-Mouth-Eating-Edmontosaurus-scaled.jpg", "publishedAt": "2023-04-01T10:32:53Z", "content": "ByUniversity of PortsmouthApril 1, 2023\r\nA juvenile Edmontosaurus disappears into the enormous, lipped mouth of Tyrannosaurus. Credit: Mark Witton\r\nA recent study challenges the depiction of predator… [+8968 chars]"}]}