{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Listverse.com"}, "author": "Jamie Frater", "title": "Top Ten Misunderstood Animal Behaviors - Listverse", "description": "Animal behavior is a classic example of a topic most of us believe to be more knowledgeable about than we really are. Often, we turn out to be wrong because we should have checked our sources. However, it could also be because humans have a tendency to try to…", "url": "https://listverse.com/2022/10/16/top-ten-misunderstood-animal-behaviors/", "urlToImage": "https://listverse.com/wp-content/uploads/2019/12/cat.jpg", "publishedAt": "2022-10-16T07:06:12Z", "content": "Animal behavior is a classic example of a topic most of us believe to be more knowledgeable about than we really are. Often, we turn out to be wrong because we should have checked our sources. Howeve… [+9497 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Splashdown of SpaceX capsule takes astronauts back to Earth - The Sun", "description": "The fourth long-duration astronaut team launched by SpaceX to the International Space Station (ISS) safely returned to Earth on Friday (October 14), splashin...", "url": "https://www.youtube.com/watch?v=ImTw3ljLi_U", "urlToImage": "https://i.ytimg.com/vi/ImTw3ljLi_U/maxresdefault.jpg", "publishedAt": "2022-10-15T14:30:04Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "This Black Hole Devoured a Star Years Ago. Now It's 'Burped' Something Out - ScienceAlert", "description": "Originally predicted by Einstein's Theory of General Relativity, black holes are the most extreme object in the known Universe.", "url": "https://www.sciencealert.com/this-black-hole-devoured-a-star-years-ago-now-its-burped-something-out", "urlToImage": "https://www.sciencealert.com/images/2022/10/TidalDisruptionEvent.jpg", "publishedAt": "2022-10-14T17:01:09Z", "content": "Originally predicted by Einstein's Theory of General Relativity, black holes are the most extreme object in the known Universe.\r\nThese objects form when stars reach the end of their life cycle, blow … [+5911 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Anna-Lena Lindskog", "title": "Bacteria with interesting properties discovered in underground caves - Phys.org", "description": "A research team from Umeå University, SLU and Algeria has found bacteria with a number of interesting properties in previously unexplored caves at a depth of several hundred meters in Algeria. One of these properties is the breakdown of gluten, which can ther…", "url": "https://phys.org/news/2022-10-bacteria-properties-underground-caves.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/discovery-of-exciting.jpg", "publishedAt": "2022-10-14T16:30:01Z", "content": "A research team from Umeå University, SLU and Algeria has found bacteria with a number of interesting properties in previously unexplored caves at a depth of several hundred meters in Algeria. One of… [+3405 chars]"}]}