{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Identify Real-Life Planet With Two Suns – Like “Tatooine” From Star Wars - SciTechDaily", "description": "Study proves ground-based telescopes can search for planets with two suns. Astronomers have used a new technique to confirm a real-life Tatooine, the fictional planet with two suns that was home to Luke Skywalker in “Star Wars.” The planet, Kepler-16b, is abo…", "url": "https://scitechdaily.com/astronomers-identify-real-life-planet-with-two-suns-like-tatooine-from-star-wars/", "urlToImage": "https://scitechdaily.com/images/Kepler-16b-1-scaled.jpg", "publishedAt": "2022-02-26T11:43:04Z", "content": "Artist’s impression of Kepler-16b, the first planet known to definitively orbit two stars – what’s called a circumbinary planet. The planet, which can be seen in the foreground, was discovered by NAS… [+4663 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Svetlana Ekimenko", "title": "Asteroid 'Taller Than Dubai Skyscraper, Wider than The Vatican' to Skim Past Earth - Sputnik International", "description": "NASA had earlier warned that a kilometre-plus wide, potentially hazardous asteroid would be passing near Earth in early March. The agency’s Jet Propulsion Laboratory (JPL) considers any asteroid of at least 150 metres in diameter passing...", "url": "https://sputniknews.com/20220226/asteroid-taller-than-dubai-skyscraper-wider-than-the-vatican-to-skim-past-earth-1093387124.html", "urlToImage": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1093387124.jpg?10793747951645862244", "publishedAt": "2022-02-26T07:58:01Z", "content": "https://sputniknews.com/20220226/asteroid-taller-than-dubai-skyscraper-wider-than-the-vatican-to-skim-past-earth-1093387124.html\r\nAsteroid 'Taller Than Dubai Skyscraper, Wider than The Vatican' to Sk… [+6487 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Argentina scientists unearth dinosaur with ‘puny arms’ and hard head - The Guardian", "description": "Dinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey", "url": "https://amp.theguardian.com/science/2022/feb/25/argentina-dinosaur-fossil-skull-guemesia-ochoai", "urlToImage": null, "publishedAt": "2022-02-25T23:24:00Z", "content": "DinosaursDinosaur probably belongs to carnivorous group called abelisaurs and may have used its head to ram its prey\r\nFri 25 Feb 2022 22.56 GMT\r\nScientists in Argentina have unearthed the remains of … [+2420 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Chelyabinsk meteor may have been involved in the impact that formed the moon - Daily Mail", "description": "Researchers led by the University of Cambridge think it may have been been part of an ancient collision that broke off a chunk of baby Earth to form the moon 4.5 billion years ago.", "url": "https://www.dailymail.co.uk/sciencetech/article-10551265/Chelyabinsk-meteor-involved-impact-formed-moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/25/18/54662579-0-image-a-23_1645815547765.jpg", "publishedAt": "2022-02-25T18:53:11Z", "content": "The Chelyabinsk meteor that exploded over Russia in 2013 may also have been involved in the massive impact that formed the moon, a new study suggests.\r\nResearchers led by the University of Cambridge … [+5407 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Death Spiral: A Black Hole Spins on Its Side – “Completely Unexpected” - SciTechDaily", "description": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding challenges current theoretical models of black hole formati…", "url": "https://scitechdaily.com/death-spiral-a-black-hole-spins-on-its-side-completely-unexpected/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Binary-System-MAXI-J1820-070.gif", "publishedAt": "2022-02-25T18:15:38Z", "content": "Researchers from the University of Turku, Finland, found that the axis of rotation of a black hole in a binary system is tilted more than 40 degrees relative to the axis of stellar orbit. The finding… [+4163 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope is nearly halfway through its mirror alignment stages - Space.com", "description": "NASA recently completed the third of seven planned steps to align the 18 hexagonal segments of Webb's mirror, marking nearly the halfway point in a complex, weeks-long process.", "url": "https://www.space.com/jwst-nearly-halfway-through-mirror-alignment", "urlToImage": "https://cdn.mos.cms.futurecdn.net/THnUxu2cNZXezoXKDRqBHX-1200-80.gif", "publishedAt": "2022-02-25T17:34:51Z", "content": "Stars are getting sharper in the James Webb Space Telescope's field of view.\r\nThe team recently completed the third of seven planned steps to align the 18 hexagonal segments of Webb's mirror, marking… [+2978 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Jamie Harris", "title": "Space sleuths can’t work out what weird ‘bowling pin’ object is on Mars... - The Sun", "description": "", "url": "https://www.thesun.co.uk/tech/17770341/mars-weird-object-spotted-nasa-space/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/02/crop-17771433.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-25T14:28:00Z", "content": "SPACE fans have been left baffled by something on Mars shaped like a bowling pin.\r\nThe odd object was captured by Nasa's Curiosity Rover earlier this month but observers have been scratching their he… [+1691 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists reveal 4.4 million galaxies in an - EurekAlert", "description": "Durham University astronomer collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low Frequency Array (LOFAR), a pan-European radio telescope.", "url": "https://www.eurekalert.org/news-releases/944281", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-02-25T13:45:45Z", "content": "Durham University astronomer collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low Frequency Array (LOFAR), a pan-European radio tele… [+4391 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New simulations refine axion mass, refocusing dark matter search - Phys.org", "description": "Physicists searching—unsuccessfully—for today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were produced shortly after the Big Bang 13.6 billion years ago.", "url": "https://phys.org/news/2022-02-simulations-refine-axion-mass-refocusing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/new-simulations-refine.jpg", "publishedAt": "2022-02-25T10:00:09Z", "content": "Physicists searchingunsuccessfullyfor today's most favored candidate for dark matter, the axion, have been looking in the wrong place, according to a new supercomputer simulation of how axions were p… [+11546 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Kirill Kurevlev", "title": "Chinese Researchers Explain Mysterious Glass Balls on Moon's Surface - Photo - Sputnik International", "description": "Since landing on the far side of the Moon in early 2019, the rover has traveled a complete kilometer. On January 11, it marked three years of exploration of the rocky satellite's far side – the first rover to accomplish it in history.", "url": "https://sputniknews.com/20220225/chinese-researchers-explain-mysterious-glass-balls-on-moons-surface---photo-1093352012.html", "urlToImage": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1093352012.jpg?10933525481645756761", "publishedAt": "2022-02-25T02:43:49Z", "content": "\"Their existence on the Moon indicate that impact events on the other planetary bodies could also form tektite-like impact glasses. Such glass globules should be commonly produced by ancient impact b… [+278 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "New fast radio burst found in area that shouldn’t have any sources - Ars Technica", "description": "Source narrowed down to a cluster where the stars are too old for bursts.", "url": "https://arstechnica.com/science/2022/02/new-fast-radio-burst-found-in-area-that-shouldnt-have-any-sources/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/image-2-760x380.jpeg", "publishedAt": "2022-02-24T22:25:36Z", "content": "Enlarge/ Artist's conception of a high-energy burst coming off the surface of a magnetar.\r\n95 with 72 posters participating\r\nFast radio bursts were an enigma when they were first spotted. At first, e… [+5443 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists create the world's largest family tree that links 27 MILLION people - Daily Mail", "description": "Developed at the University of Oxford, the new genealogical network  reveals how individuals across the world are related to each other in 'unprecedented detail'.", "url": "https://www.dailymail.co.uk/sciencetech/article-10547881/Scientists-create-worlds-largest-family-tree-links-27-MILLION-people.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/24/16/54608303-0-image-a-15_1645720648317.jpg", "publishedAt": "2022-02-24T20:15:54Z", "content": "Scientists have created the 'world's largest family tree' that links around 27 million people around the world both living and dead. \r\nDeveloped at the University of Oxford, the new genealogical netw… [+8012 chars]"}]}