{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Scientists have solved a great mystery at the dawn of time itself - indy100", "description": "Many of us will never get our heads around the fact that scientists can actually look back in time.The power of telescopes enables us to study phenomena that occurred billions of years ago, and even gaze upon the dawn of creation itself.Now, astrophysicists h…", "url": "https://www.indy100.com/science-tech/epoch-of-reionization-new-research-2661918108", "urlToImage": "https://www.indy100.com/media-library/10-astonishing-theories-to-explain-the-universe-unveiled.png?id=34181197&width=1200&height=600&coordinates=0%2C0%2C13%2C0", "publishedAt": "2023-06-27T06:54:41Z", "content": "Many of us will never get our heads around the fact that scientists can actually look back in time.\r\nThe power of telescopes enables us to study phenomena that occurred billions of years ago, and eve… [+4747 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm looming over Earth as POWERFUL solar flares set to explode today, says NOAA - HT Tech", "description": "NOAA forecasters have revealed there is a 40 percent chance of an M-class solar flare eruption today, June 27, as the sunspot AR3340 turns unstable. Is another solar storm coming towards Earth? Find out.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-looming-over-earth-as-powerful-solar-flares-set-to-explode-today-says-noaa-71687846343301.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/clement-714404_1674110601961_1687846382818.jpg", "publishedAt": "2023-06-27T06:16:03Z", "content": "After an unremarkable weekend, solar activity is again picking up speed. Last week, we witnessed two separate radio blackout events triggered by an X-class solar flare and an M-class solar flare. Whi… [+2764 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unseen Intruders: Ancient Viruses Discovered in Coral Symbionts' DNA - SciTechDaily", "description": "Researchers surprised to find fragments of RNA viruses in coral partners’ genomes. Scientists have discovered ancient RNA virus remnants in the DNA of organisms living within reef-building corals. This unexpected find, detailed in Communications Biology, coul…", "url": "https://scitechdaily.com/unseen-intruders-ancient-viruses-discovered-in-coral-symbionts-dna/", "urlToImage": "https://scitechdaily.com/images/Ancient-Viruses-DNA-Illustration.jpg", "publishedAt": "2023-06-26T16:39:15Z", "content": "ByRice UniversityJune 26, 2023\r\nAn international team of scientists has uncovered remnants of ancient RNA viruses in the DNA of symbiotic organisms within reef-building corals. This surprising discov… [+10077 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "The JWST Has Taken This Stunning Image Of Saturn And More - IFLScience", "description": "The rings shine in a narrow wavelength where the planet is almost as dark as space behind.", "url": "https://www.iflscience.com/the-jwst-has-taken-this-stunning-image-of-saturn-and-more-69523", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69523/aImg/68800/jwst-saturn-meta.png", "publishedAt": "2023-06-26T15:51:59Z", "content": "The JWST devoted more than two and a half hours of its precious time to observing Saturn this weekend, and the images above and below are among the products. The different images show the planet, its… [+2473 chars]"}, {"source": {"id": null, "name": "Push Square"}, "author": "Robert Ramsey", "title": "Final Fantasy 16: Dozmare Location and How to Beat - Push Square", "description": "Where to find Dozmare", "url": "https://www.pushsquare.com/guides/final-fantasy-16-dozmare-location-and-how-to-beat", "urlToImage": "https://images.pushsquare.com/1da53aff6f9b0/1280x720.jpg", "publishedAt": "2023-06-26T15:05:31Z", "content": "Dozmare is one of the Notorious Mark Hunts in Final Fantasy 16.\r\nImages: Push Square\r\nRank B\r\nLocation: Caer Norvent West Gate, Sanbreque - right at the bottom of the map, next to the Caer Norvent Ri… [+870 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Asgard Archaea and All Eukaryotes Share Common Ancestor, Study Says - Sci.News", "description": "Understanding how complex eukaryotic cells emerged from prokaryotic ancestors represents a major challenge in biology.", "url": "https://www.sci.news/genetics/asgard-eukaryotes-12035.html", "urlToImage": "https://cdn.sci.news/images/2022/04/image_10751-Asgard-Archaeon.jpg", "publishedAt": "2023-06-26T14:55:08Z", "content": "Understanding how complex eukaryotic cells emerged from prokaryotic ancestors represents a major challenge in biology. A main point of contention in refining eukaryogenesis scenarios revolves around … [+4940 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shattering Preconceptions: Diverse Spinosaur Species Roamed Cretaceous Britain - SciTechDaily", "description": "A recent study by the University of Southampton indicates that distinct spinosaur groups lived in Cretaceous Britain, challenging previous beliefs. Using a spinosaur tooth from the Hastings Museum, researchers found it belonged to a different species, not the…", "url": "https://scitechdaily.com/shattering-preconceptions-diverse-spinosaur-species-roamed-cretaceous-britain/", "urlToImage": "https://scitechdaily.com/images/White-Rock-Spinosaurid-scaled.jpg", "publishedAt": "2023-06-26T11:11:22Z", "content": "ByPeerJJune 26, 2023\r\nIllustration of White Rock spinosaurid by Anthony Hutchings. A new study by paleontologists at the University of Southamptons EvoPalaeoLab shows that several distinct groups of … [+6228 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Nearby Star Cluster May Be Nearly As Old As The Universe - IFLScience", "description": "We knew the globular cluster M92 was old, but these dates may force us to up the estimated age of the whole universe.", "url": "https://www.iflscience.com/nearby-star-cluster-may-be-nearly-as-old-as-the-universe-69512", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69512/aImg/68786/m92-meta.png", "publishedAt": "2023-06-26T11:04:10Z", "content": "A new technique has been used to estimate the age of globular star cluster M92 at 13.8 billion years, plus or minus 0.75 billion years. This is an almost exact match for the estimated age of the Univ… [+3712 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Neanderthal Handshake: Unraveling the Genetic Origins of “Viking Disease” - SciTechDaily", "description": "Dupuytren's disease, a hand disorder common among Northern Europeans, is found to have genetic links to Neanderthals, according to a study in Molecular Biology and Evolution. Three of the 61 genetic risk variants for the disease identified by researchers are …", "url": "https://scitechdaily.com/the-neanderthal-handshake-unraveling-the-genetic-origins-of-viking-disease/", "urlToImage": "https://scitechdaily.com/images/Bent-Hand-Viking-Disease.jpg", "publishedAt": "2023-06-26T04:15:05Z", "content": "A ring finger locked in a bent position as seen in Dupuytrens disease, colloquially known as the Viking disease. Credit: Hugo Zeberg/ Molecular Biology and Evolution\r\nDupuytrens disease, a hand disor… [+3443 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coolest Rocky Exoplanet Ever: James Webb Reveals Surprising Atmosphere of TRAPPIST-1 C - SciTechDaily", "description": "Infrared measurements of TRAPPIST-1 c indicate that it is probably not as Venus-like as once imagined. NASA’s James Webb Space Telescope has successfully measured the heat radiating from TRAPPIST-1 c, an exoplanet orbiting a red dwarf star 40 light-years from…", "url": "https://scitechdaily.com/coolest-rocky-exoplanet-ever-james-webb-reveals-surprising-atmosphere-of-trappist-1-c/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Illustration.jpg", "publishedAt": "2023-06-25T15:25:29Z", "content": "BySpace Telescope Science InstituteJune 25, 2023\r\nNASAs James Webb Space Telescope has discovered that exoplanet TRAPPIST-1 c, despite being the same size as Venus and receiving similar radiation, do… [+18400 chars]"}]}