{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "New Hubble telescope image reveals giant cosmic ‘keyhole’ in the blackness of space - The Independent", "description": "A new look at old Hubble telescope imagery shows a void in a distant nebula is a vast hole through the gas and dust through to the blackness of space", "url": "https://www.independent.co.uk/space/hubble-telescope-nebula-keyhole-b2209630.html", "urlToImage": "https://static.independent.co.uk/2022/10/24/21/potw2243a.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-24T21:09:58Z", "content": "Sign up to our free WhatsApp news alerts and daily briefing updates\r\nSign up to our free daily WhatsApp news alerts\r\nA newly released image from the Hubble Space Telescope reveals a smoke-wreathed ke… [+2179 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Dual ancestries and ecologies of the Late Glacial Palaeolithic in Britain - Nature.com", "description": "The authors report genetic, archaeological and stable isotopic data from two late Palaeolithic individuals in Britain, from Gough's Cave and Kendrick's Cave. The individuals differ not only in their ancestry but also their diets, ecologies and mortuary practi…", "url": "https://www.nature.com/articles/s41559-022-01883-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41559-022-01883-z/MediaObjects/41559_2022_1883_Fig1_HTML.png", "publishedAt": "2022-10-24T15:06:10Z", "content": "<li>Housley, R. A., Gamble, C. S., Street, M. &amp; Pettitt, P. Radiocarbon evidence for the lateglacial human recolonisation of Northern Europe. Proc. Prehist. Soc.63, 2554 (1997).\r\nGoogle Scholar \r… [+14339 chars]"}, {"source": {"id": null, "name": "Ras.ac.uk"}, "author": "Florin Simion @Yonescat", "title": "The RAS and JWST - The Royal Astronomical Society", "description": "At its meeting in July the governing council of the Royal Astronomical Society (RAS) took a decision to write to the UK Space Agency, the European Space\nAgency (ESA)...", "url": "https://ras.ac.uk/news-and-press/news/ras-and-jwst", "urlToImage": "https://ras.ac.uk/sites/default/files/2020-04/RoyalAstronomicalSociety_SecondaryLogo_Black_2.jpg", "publishedAt": "2022-10-24T09:32:00Z", "content": "At its meeting in July the governing council of the Royal Astronomical Society (RAS) took a decision to write to the UK Space Agency, the European Space Agency (ESA) and NASA to express its concerns … [+2172 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tantalizing Science and Dangerous Hazards: NASA’s Curiosity Mars Rover Reaches Long-Awaited Salty Region - SciTechDaily", "description": "NASA’s Curiosity Mars Rover has arrived at a special region believed to have formed as Mars’ climate was drying. After trekking this summer through a narrow, sand-lined pass, NASA’s Curiosity Mars rover recently arrived in the “sulfate-bearing unit.” This lon…", "url": "https://scitechdaily.com/tantalizing-science-and-dangerous-hazards-nasas-curiosity-mars-rover-reaches-long-awaited-salty-region/", "urlToImage": "https://scitechdaily.com/images/NASA-Curiosity-Mars-Rover-scaled.jpg", "publishedAt": "2022-10-24T08:27:55Z", "content": "ByJet Propulsion LaboratoryOctober 24, 2022\r\nLow-angle self-portrait of NASAs Curiosity Mars rover. Credit: NASA/JPL-Caltech/MSSS\r\nNASA\r\nEstablished in 1958, the National Aeronautics and Space Admini… [+6089 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "To build a better quantum computer, look into a black hole, says professor Brian Cox - The Register", "description": "The black hole information paradox and quantum error correction codes overlap almost completely", "url": "https://www.theregister.com/2022/10/24/brian_cox_quantum_computers_black_holes/", "urlToImage": "https://regmedia.co.uk/2020/07/02/quasar.jpg", "publishedAt": "2022-10-24T05:01:00Z", "content": "It's hard for professor Brian Cox to hide his enthusiasm for black holes, and he didn't really try as he explained to The Register how progress in understanding the celestial phenomena contributes to… [+2725 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Kaya Burgess", "title": "Mystery deepens over the universe expanding too fast - The Times", "description": "The fabric of space in the universe is expanding at more than 160,000 miles per hour, according to the most precise study ever of the composition and evolution", "url": "https://www.thetimes.co.uk/article/mystery-deepens-over-the-universe-expanding-too-fast-dhd6j6t2v", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F483ee06a-5305-11ed-a03e-f7ac672386f7.jpg?crop=1905%2C1071%2C21%2C388&resize=1200", "publishedAt": "2022-10-23T23:01:00Z", "content": "The fabric of space in the universe is expanding at more than 160,000 miles per hour, according to the most precise study ever of the composition and evolution of the cosmos.\r\nThe measurement has dee… [+573 chars]"}]}