{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover a 4-Billion-Year-Old Ancient Piece of Earth's Crust Underneath Western Australia - SciTechDaily", "description": "Lasers pave the path for finding ancient crust. Curtin University researchers have discovered evidence of an approximately four billion-year-old piece of the Earth's crust that exists beneath the South-West of Western Australia by using lasers smaller than a …", "url": "https://scitechdaily.com/scientists-discover-a-4-billion-year-old-ancient-piece-of-earths-crust-underneath-western-australia/", "urlToImage": "https://scitechdaily.com/images/Earth-Slice-Interior-Core.jpg", "publishedAt": "2022-08-21T19:58:47Z", "content": "The earth is composed of three main layers: the crust, the mantle, and the core.\r\nLasers pave the path for finding ancient crust.\r\nCurtin University researchers have discovered evidence of an approxi… [+2785 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "What I discovered about myself after reuniting with my long-lost uncle on holiday - The Telegraph", "description": "When TV presenter George Clarke was reunited with a beloved relative in New Zealand, he was instantly hooked on a new way of life", "url": "https://www.telegraph.co.uk/travel/destinations/oceania/new-zealand/what-discovered-reuniting-long-lost-uncle-holiday/", "urlToImage": "https://www.telegraph.co.uk/content/dam/travel/2022/08/19/TELEMMGLPICT000305729622_trans_NvBQzQNjv4BqtsrXwXfDMX8NJ9etRuFw3PRQh07x62fe0tZ18yT2XGk.jpeg?impolicy=logo-overlay", "publishedAt": "2022-08-21T11:00:00Z", "content": "I started doing a huge amount of walking: beach walks on the North Island; forest and mountain walks on the South; then hiking through Arthurs Pass near Christchurch and around Queenstown. It was mag… [+1571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Researchers Discover Global Warming Spawned the Age of Reptiles - SciTechDaily", "description": "Harvard researchers find rapid evolution of reptiles was triggered by nearly 60 million years of global warming and climate change. Researchers can explore the impact of environmental crises on organismal evolution by studying climate change-induced mass exti…", "url": "https://scitechdaily.com/?p=196742", "urlToImage": "https://scitechdaily.com/images/Reptile-Adaptive-Radiation-Reconstruction-scaled.jpg", "publishedAt": "2022-08-21T03:44:46Z", "content": "ByHarvard University, Department of Organismic and Evolutionary BiologyAugust 20, 2022\r\nArtistic reconstruction of the reptile adaptive radiation in a terrestrial ecosystem during the warmest period … [+9771 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "Voyager turns 45: What the iconic mission taught us and what's next - Space.com", "description": "Can the first probe to visit Neptune and Uranus make it to its 50th anniversary?", "url": "https://www.space.com/voyager-spacecraft-45th-launch-anniversary-science", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Jq4P7U5QtZZbp2U6rNNeNU-1200-80.jpg", "publishedAt": "2022-08-20T10:00:23Z", "content": "Forty-five years ago, on Aug. 20, 1977, NASA's Voyager 2 spacecraft launched from Cape Canaveral, Florida, on a Titan III-Centaur rocket, embarking on a \"grand tour\" of the solar system that would in… [+7348 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Best close-up of universe's most massive star reveals it might be smaller than thought - Space.com", "description": "The finding might have implications for our understanding of giant stars.", "url": "https://www.space.com/most-massive-known-star-universe-image", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CeynuNAzQB4fXBoAiPfNtT-1200-80.jpg", "publishedAt": "2022-08-19T15:40:36Z", "content": "The universe's most massive known star just got its best ever close-up, and it reveals the star might be smaller than astronomers previously thought.\r\nAstronomers using the Gemini South telescope in … [+3189 chars]"}]}