{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Jessica Goudreault", "title": "Space Rock Worth $25K If You Can Find It On Earth - Giant Freakin Robot", "description": "There's a hefty bounty out on a hunk of space rock that crash landed in the woods of Maine, good luck collecting the money!", "url": "https://www.giantfreakinrobot.com/sci/space-rock-25k-find-earth.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2020/02/meteor-4-900x606.png", "publishedAt": "2023-05-18T03:49:18Z", "content": "A space rock that landed in Maine is worth $25k to anyone that can find it. \r\nBy Jessica Goudreault\r\n| Published 9 seconds ago\r\nIf you live in New England, then you should drop everything to grab you… [+2767 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Mighty Martian River? Latest Astonishing Discovery by NASA's Perseverance Mars Rover - SciTechDaily", "description": "Evidence left in rocks is leading scientists to rethink what watery environments looked like on ancient Mars. New images from NASA's Perseverance rover reveal evidence of a powerful river on Mars, possibly deeper and faster-moving than previously known. The i…", "url": "https://scitechdaily.com/?p=278199", "urlToImage": "https://scitechdaily.com/images/Fast-River-on-Mars.jpg", "publishedAt": "2023-05-17T18:10:49Z", "content": "ByJet Propulsion LaboratoryMay 17, 2023\r\nScientists think that these bands of rocks may have been formed by a very fast, deep river the first of its kind evidence has been found for on Mars. NASAs Pe… [+7381 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Tom Nardi", "title": "Change Of Plans For New Horizons Sparks Debate - Hackaday", "description": "In 2015 NASA’s New Horizons spacecraft provided humanity with the first up-close views of Pluto, passing just 12,472 km (7,750 mi) from the surface. What had always been little more than a fu…", "url": "https://hackaday.com/2023/05/17/change-of-plans-for-new-horizons-sparks-debate/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/newhorizons23_feat.jpg", "publishedAt": "2023-05-17T18:00:00Z", "content": "In 2015 NASA’s New Horizons spacecraft provided humanity with the first up-close views of Pluto, passing just 12,472 km (7,750 mi) from the surface. What had always been little more than a fuzzy blip… [+5661 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Currie", "title": "We regret to inform you Earth will not be destroyed by an asteroid within 1,000 years - The Register", "description": "Never mind, there's always nuclear war and climate catastrophe", "url": "https://www.theregister.com/2023/05/17/no_earth_killing_asteroids/", "urlToImage": "https://regmedia.co.uk/2022/02/01/shutterstock_asteroid.jpg", "publishedAt": "2023-05-17T14:31:00Z", "content": "War, genocide, TikTok if it could all end today, some of us would die with a smile on our face knowing there was little about humanity worth preserving.\r\nHowever, we have bad news for the misanthrope… [+3364 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Scientists discover hidden Ice Age 'treasure' that is spewing out the Earth's innards - indy100", "description": "Arctic explorers have uncovered a jaw-dropping blast from the past which they’ve described as a “hidden treasure”.The discovery was made in the Barents Sea, about 70 miles (113km) south of Norway’s remote Bear Island.Researchers were exploring the seabed when…", "url": "https://www.indy100.com/science-tech/ice-age-mud-volcano-norway", "urlToImage": "https://www.indy100.com/media-library/mud-volcanoes-such-as-these-offer-important-clues-about-the-earth-s-past-as-well-its-current-inner-workings.jpg?id=33683213&width=1200&height=600&coordinates=0%2C64%2C0%2C11", "publishedAt": "2023-05-17T11:15:01Z", "content": "Arctic explorers have uncovered a jaw-dropping blast from the past which theyve described as a hidden treasure.\r\nThe discovery was made in the Barents Sea, about 70 miles (113km) south of Norways rem… [+2981 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Hannah Osborne", "title": "Yellowstone volcano super-eruptions appear to involve multiple explosive events - Livescience.com", "description": "The last caldera-forming eruption at Yellowstone \"was much more complex than previously thought,\" according to the annual report about activity at the supervolcano.", "url": "https://www.livescience.com/planet-earth/volcanos/yellowstone-volcano-super-eruptions-appear-to-involve-multiple-explosive-events", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rN7WQ959ZMY7LLUb8xdBtN-1200-80.jpg", "publishedAt": "2023-05-17T09:44:33Z", "content": "The last super-eruption at Yellowstone volcano, which occurred 631,000 years ago, was not one huge explosion. Instead, new research suggests it was a series of eruptions or multiple vents spewing vol… [+3995 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Found in the trash: these floating snails hang out in the ocean's garbage patch - Nature.com", "description": "Ocean currents that collect plastic also round up sea life — this striking image shows its bubbly life raft.", "url": "https://www.nature.com/articles/d41586-023-01645-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01645-2/d41586-023-01645-2_25365444.jpg", "publishedAt": "2023-05-17T08:21:17Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Quark Matter: Gravitational Waves Hold Clues to the Universe's Densest Matter - SciTechDaily", "description": "Gravitational waves could reveal whether the quark soup that existed in the early Universe is created in neutron-star mergers. RIKEN researchers suggest that gravitational-wave signals from merging neutron stars could reveal the existence of ultra-dense quark…", "url": "https://scitechdaily.com/strange-quark-matter-gravitational-waves-hold-clues-to-the-universes-densest-matter/", "urlToImage": "https://scitechdaily.com/images/Neutron-Star-Collision-scaled.jpg", "publishedAt": "2023-05-17T04:00:20Z", "content": "ByRIKENMay 16, 2023\r\nFigure 1: Gravitational waves generated by mergers between two neutron stars could reveal the creation of free quarks through such mergers. Credit: NASAs Goddard Space Flight Cen… [+5784 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Experiment Inspired by Earth's Core Leads to Groundbreaking Discovery in Fluid Flow Turbulence - SciTechDaily", "description": "Turbulent flows take on a surprising spin in an experiment inspired by the Earth’s core. A team of physicists has discovered a new role for a specific type of turbulence—a finding that sheds light on fluid flows ranging from the Earth’s liquid core to boiling…", "url": "https://scitechdaily.com/physics-experiment-inspired-by-earths-core-leads-to-groundbreaking-discovery-in-fluid-flow-turbulence/", "urlToImage": "https://scitechdaily.com/images/Swirling-Fire-Energy-Molten-Core.jpg", "publishedAt": "2023-05-16T23:36:12Z", "content": "ByNew York UniversityMay 16, 2023\r\nPhysicists have discovered a new aspect of turbulent convection, demonstrating that it can cause a freely moving solid within the fluid to rotate in two directions,… [+3200 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "62 New Moons Discovered Orbiting Saturn Using Innovative Astronomy - SciTechDaily", "description": "An international team of astronomers has found 62 new moons around Saturn using an innovative technique. These irregular moons contribute to Saturn's total moon count of 145, surpassing Jupiter, and provide insights into the planet's moon system's collisional…", "url": "https://scitechdaily.com/?p=278527", "urlToImage": "https://scitechdaily.com/images/Hubble-View-of-Saturn-2019.jpg", "publishedAt": "2023-05-16T19:55:59Z", "content": "ByUniversity of British ColumbiaMay 16, 2023\r\nNASAs Hubble Space Telescope captured exquisite details of the ring system in this 2019 observation. An international team of astronomers led by Edward A… [+7275 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "NASA Shuts Down the Lunar Flashlight Mission After it Fails to Go into Orbit - Universe Today", "description": "NASA missions can be categorized into two types. One type includes headline-grabbing missions, such as the JWST or New Horizons, that take decades to design and plan. Typically those larger missions include many flight-tested components that had already been …", "url": "https://www.universetoday.com/161392/nasa-shuts-down-the-lunar-flashlight-mission-after-it-fails-to-go-into-orbit/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/9518.jpg", "publishedAt": "2023-05-16T14:54:49Z", "content": "NASA missions can be categorized into two types. One type includes headline-grabbing missions, such as the JWST or New Horizons, that take decades to design and plan. Typically those larger missions … [+3993 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Making The Case For All-Female Exploration Missions To Mars And Beyond - Hackaday", "description": "A recent study in Nature Scientific Reports by Jonathan P. R. Scott and colleagues makes the case for sending exclusively all-female crews on long-duration missions. The reasoning here is simple: w…", "url": "https://hackaday.com/2023/05/16/making-the-case-for-all-female-exploration-missions-to-mars-and-beyond/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/astronaut_tracy_caldwell_international_space_station.jpg", "publishedAt": "2023-05-16T14:00:00Z", "content": "A recent study in Nature Scientific Reports by Jonathan P. R. Scott and colleagues makes the case for sending exclusively all-female crews on long-duration missions. The reasoning here is simple: wom… [+8654 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "We can't avoid a singularity inside every black hole - Big Think", "description": "Yes, \"the laws of physics break down\" at singularities. But something really weird must have happened for black holes to not possess them.", "url": "https://bigthink.com/starts-with-a-bang/singularity-inside-black-hole/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/07/134390-134391.jpg?resize=1200,630", "publishedAt": "2023-05-16T06:00:00Z", "content": null}]}