{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Watch house-size asteroid 2023 MU2 fly by Earth at over 2000 mph (video) - Space.com", "description": "The near-Earth object 2023 MU2 was seen by the Virtual Project as it made a close approach to our planet on the evening of June 25.", "url": "https://www.space.com/asteroid-flyby-video-june-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HrVhTwofjmNCC8wkeyqiqf-1200-80.jpg", "publishedAt": "2023-06-26T18:30:18Z", "content": "A house-size asteroid raced past Earth at a staggering 2,000 miles per hour on Sunday, June 25. But even at this incredible speed, the near-Earth object (NEO) 2023 MU2 couldn't outrace observation by… [+2449 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unseen Intruders: Ancient Viruses Discovered in Coral Symbionts' DNA - SciTechDaily", "description": "Researchers surprised to find fragments of RNA viruses in coral partners’ genomes. Scientists have discovered ancient RNA virus remnants in the DNA of organisms living within reef-building corals. This unexpected find, detailed in Communications Biology, coul…", "url": "https://scitechdaily.com/unseen-intruders-ancient-viruses-discovered-in-coral-symbionts-dna/", "urlToImage": "https://scitechdaily.com/images/Ancient-Viruses-DNA-Illustration.jpg", "publishedAt": "2023-06-26T16:39:15Z", "content": "ByRice UniversityJune 26, 2023\r\nAn international team of scientists has uncovered remnants of ancient RNA viruses in the DNA of symbiotic organisms within reef-building corals. This surprising discov… [+10077 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Unlocks Hidden Secrets of Primate Evolution - SciTechDaily", "description": "Analyses of 50 primate genomes through comparative genomics unveil essential genetic processes involved in primate speciation, adaptive phenotypic changes, and the evolution of social systems. A series of publications from the first phase program of the Prima…", "url": "https://scitechdaily.com/new-research-unlocks-hidden-secrets-of-primate-evolution/", "urlToImage": "https://scitechdaily.com/images/Rainbow-Monkey-Evolution-Primate.jpg", "publishedAt": "2023-06-26T14:11:38Z", "content": "ByBGI GroupJune 26, 2023\r\nAn international research consortium co-led by scientists from multiple universities has released a series of studies detailing new high-quality reference genomes from 50 pr… [+17021 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shattering Preconceptions: Diverse Spinosaur Species Roamed Cretaceous Britain - SciTechDaily", "description": "A recent study by the University of Southampton indicates that distinct spinosaur groups lived in Cretaceous Britain, challenging previous beliefs. Using a spinosaur tooth from the Hastings Museum, researchers found it belonged to a different species, not the…", "url": "https://scitechdaily.com/shattering-preconceptions-diverse-spinosaur-species-roamed-cretaceous-britain/", "urlToImage": "https://scitechdaily.com/images/White-Rock-Spinosaurid-scaled.jpg", "publishedAt": "2023-06-26T11:11:22Z", "content": "ByPeerJJune 26, 2023\r\nIllustration of White Rock spinosaurid by Anthony Hutchings. A new study by paleontologists at the University of Southamptons EvoPalaeoLab shows that several distinct groups of … [+6228 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Nearby Star Cluster May Be Nearly As Old As The Universe - IFLScience", "description": "We knew the globular cluster M92 was old, but these dates may force us to up the estimated age of the whole universe.", "url": "https://www.iflscience.com/nearby-star-cluster-may-be-nearly-as-old-as-the-universe-69512", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69512/aImg/68786/m92-meta.png", "publishedAt": "2023-06-26T11:04:10Z", "content": "A new technique has been used to estimate the age of globular star cluster M92 at 13.8 billion years, plus or minus 0.75 billion years. This is an almost exact match for the estimated age of the Univ… [+3712 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Humans' evolutionary relatives butchered one another 1.45 million years ago - Phys.org", "description": "Researchers from the Smithsonian's National Museum of Natural History have identified the oldest decisive evidence of humans' close evolutionary relatives butchering and likely eating one another.", "url": "https://phys.org/news/2023-06-humans-evolutionary-butchered-million-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/humans-evolutionary-re.jpg", "publishedAt": "2023-06-26T09:31:59Z", "content": "Researchers from the Smithsonian's National Museum of Natural History have identified the oldest decisive evidence of humans' close evolutionary relatives butchering and likely eating one another.\r\nI… [+6589 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Why today really isn't 24 hours long - Big Think", "description": "As the Earth spins and wobbles on its axis and revolves elliptically around the Sun, each day changes from the last. \"24 hours\" isn't right.", "url": "https://bigthink.com/starts-with-a-bang/day-isnt-24-hours/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/The_Earth_seen_from_Apollo_17_Original_Orientation.jpg?resize=1200,630", "publishedAt": "2023-06-26T06:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Neanderthal Handshake: Unraveling the Genetic Origins of “Viking Disease” - SciTechDaily", "description": "Dupuytren's disease, a hand disorder common among Northern Europeans, is found to have genetic links to Neanderthals, according to a study in Molecular Biology and Evolution. Three of the 61 genetic risk variants for the disease identified by researchers are …", "url": "https://scitechdaily.com/the-neanderthal-handshake-unraveling-the-genetic-origins-of-viking-disease/", "urlToImage": "https://scitechdaily.com/images/Bent-Hand-Viking-Disease.jpg", "publishedAt": "2023-06-26T04:15:05Z", "content": "A ring finger locked in a bent position as seen in Dupuytrens disease, colloquially known as the Viking disease. Credit: Hugo Zeberg/ Molecular Biology and Evolution\r\nDupuytrens disease, a hand disor… [+3443 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coolest Rocky Exoplanet Ever: James Webb Reveals Surprising Atmosphere of TRAPPIST-1 C - SciTechDaily", "description": "Infrared measurements of TRAPPIST-1 c indicate that it is probably not as Venus-like as once imagined. NASA’s James Webb Space Telescope has successfully measured the heat radiating from TRAPPIST-1 c, an exoplanet orbiting a red dwarf star 40 light-years from…", "url": "https://scitechdaily.com/coolest-rocky-exoplanet-ever-james-webb-reveals-surprising-atmosphere-of-trappist-1-c/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Illustration.jpg", "publishedAt": "2023-06-25T15:25:29Z", "content": "BySpace Telescope Science InstituteJune 25, 2023\r\nNASAs James Webb Space Telescope has discovered that exoplanet TRAPPIST-1 c, despite being the same size as Venus and receiving similar radiation, do… [+18400 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "JPL and the Space Age: Triumph at Saturn – Part II (NASA Documentary) - SciTechDaily", "description": "With the Cassini spacecraft, built by NASA’s Jet Propulsion Laboratory, safely in orbit around Saturn, science takes center stage, beginning with the dramatic descent of the European Space Agency’s Huygens probe to the surface of Saturn’s shrouded moon Titan.…", "url": "https://scitechdaily.com/jpl-and-the-space-age-triumph-at-saturn-part-ii-nasa-documentary/", "urlToImage": "https://scitechdaily.com/images/Cassini-Saturn-Orbit-Insertion-scaled.jpg", "publishedAt": "2023-06-25T07:56:52Z", "content": "ByNASAs Jet Propulsion LaboratoryJune 25, 2023\r\nCassini reached Saturn in July 2004 and spent more than 13 years studying the planet. The mission was noted for its many significant discoveries, inclu… [+5131 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Laurence Tognetti", "title": "The Clouds of Venus Could Support Life - Universe Today", "description": "A recent study published in Astrobiology examines the likelihood of the planet Venus being able to support life within the thick cloud layer that envelopes it. This study holds the potential to help us better understand how life could exist under the intense …", "url": "https://www.universetoday.com/162086/the-clouds-of-venus-could-support-life/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/06/715px-venuspioneeruv_1-750.jpg", "publishedAt": "2023-06-25T04:54:00Z", "content": "A recent study published in Astrobiology examines the likelihood of the planet Venus being able to support life within the thick cloud layer that envelopes it. This study holds the potential to help … [+4062 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily", "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…", "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg", "publishedAt": "2023-06-25T01:30:26Z", "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"}]}