{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Join the Hunt: Astronomers Need Help Finding Asteroids Hurtling Through Our Solar System - SciTechDaily", "description": "Anyone with an internet connection can now join University of Arizona researchers as they work to discover asteroids hurtling through our solar system. Anyone can become an asteroid hunter thanks to a new program launched by astronomers at the University of A…", "url": "https://scitechdaily.com/?p=279521", "urlToImage": "https://scitechdaily.com/images/Near-Earth-Asteroid-Illustration.jpg", "publishedAt": "2023-05-20T21:09:02Z", "content": "ByKylianne Chadwick, University of ArizonaMay 20, 2023\r\nThe University of Arizona Lunar and Planetary Laboratory has created an online portal as part of the NASA-funded Catalina Sky Survey, allowing … [+6016 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Bella Richards", "title": "Perseverance finds Mars river could have been 'wilder,' Mars Express takes new volcano images - NASASpaceFlight.com - NASASpaceflight.com", "description": "May has been a big month for scientific discoveries on Mars, as NASA’s Perseverance rover…", "url": "https://www.nasaspaceflight.com/2023/05/perseverance-mars-express-update/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/05/27262_PIA25681-web.jpg", "publishedAt": "2023-05-20T18:10:00Z", "content": "6May has been a big month for scientific discoveries on Mars, as NASAs Perseverance rover has continued to find more convincing evidence of what could have once been a deeper and faster-moving river … [+8553 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Stuart Ryder, Erik Kool", "title": "For the first time, astronomers have detected a radio signal from the massive explosion of a dying white dwarf - Phys.org", "description": "When stars like our sun die, they tend to go out with a whimper and not a bang—unless they happen to be part of a binary (two) star system that could give rise to a supernova explosion.", "url": "https://phys.org/news/2023-05-astronomers-radio-massive-explosion-dying.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/for-the-first-time-ast-3.jpg", "publishedAt": "2023-05-20T15:26:16Z", "content": "When stars like our sun die, they tend to go out with a whimper and not a bangunless they happen to be part of a binary (two) star system that could give rise to a supernova explosion.\r\nNow, for the … [+5135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bridging Quantum Theory and Relativity: Curved Spacetime in a Quantum Simulator - SciTechDaily", "description": "New techniques can answer questions that were previously inaccessible experimentally — including questions about the relationship between quantum mechanics and relativity. Scientists at TU Wien and other institutions have developed a \"quantum simulator\" using…", "url": "https://scitechdaily.com/bridging-quantum-theory-and-relativity-curved-spacetime-in-a-quantum-simulator/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Lens-EffectQuantum-Particles.jpg", "publishedAt": "2023-05-20T11:39:04Z", "content": "ByTU WienMay 20, 2023\r\nIn the background: the gravitational lens effect, an example of an effect explained by relativity. With quantum particles, analogous effects can be studied. Credit: NASA / TU W… [+6777 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "The most fascinating star in our sky inches closer to exploding - Mashable", "description": "Whenever it happens, it will be astonishing.", "url": "https://mashable.com/article/betelgeuse-supernova-when-explode", "urlToImage": "https://helios-i.mashable.com/imagery/articles/00OcKHgLTUWKlnX6fY6qNew/hero-image.fill.size_1200x675.v1684183213.jpg", "publishedAt": "2023-05-20T09:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The “Rosetta Stone” of Paleontology: 400 Million-Year-Old Fossil Cache Unveils Early Life - SciTechDaily", "description": "Cutting-edge technology has revealed new insights about a globally famous fossil treasure trove, which may provide critical evidence concerning early life on Earth. Scientists investigating the 400 million-year-old fossil cache, discovered in the remote north…", "url": "https://scitechdaily.com/the-rosetta-stone-of-paleontology-400-million-year-old-fossil-cache-unveils-early-life/", "urlToImage": "https://scitechdaily.com/images/Rhynie-Fossil-Plant-With-Fossil-Fungi-scaled.jpg", "publishedAt": "2023-05-19T21:07:58Z", "content": "ByUniversity of EdinburghMay 19, 2023\r\nA small piece of Rhynie fossil plant with fossil fungi colonizing the ends, viewed through a microscope. Credit: Loron et al.\r\nCutting-edge technology has revea… [+3536 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Bevan Hurley", "title": "A British scientist died by a 'freak of nature' stray bullet. Family hope his final act will catch his killer - The Independent", "description": "Gifted astrophysicist Matthew Willson was killed after being struck by a stray bullet while lying in bed with his girlfriend in her Georgia apartment. Sixteen months on, with police yet to identify a suspect, his loved ones tell Bevan Hurley they are desperat…", "url": "https://www.independent.co.uk/news/world/americas/crime/matthew-willson-brookhaven-georgia-gun-violence-b2342426.html", "urlToImage": "https://static.independent.co.uk/2023/05/17/22/MattBlackandWhite.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-05-19T20:57:34Z", "content": "Sign up to our free US news bulletin sent straight to your inbox each weekday morning\r\nSign up to our free morning US email news bulletin\r\nKatherine Shepard describes the shot that killed her boyfrie… [+11256 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "The Largest Explosion Ever Seen in the Universe - Universe Today", "description": "Astronomers have witnessed the most powerful supernova on record, which could provide insight into the forces that shape galaxies.", "url": "https://www.universetoday.com/161344/the-largest-explosion-ever-seen-in-the-universe/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/Black_hole_accretion-ac5db921.jpg", "publishedAt": "2023-05-19T17:01:32Z", "content": "Throughout recorded history, humans have looked up at the night sky and witnessed the major astronomical events known as a “supernova.” The name, still used by astronomers, referred to the belief tha… [+6685 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "What Time Is It On The Moon? - IFLScience", "description": "Past, current, and future approaches are very different when it comes to Lunar time.", "url": "https://www.iflscience.com/what-time-is-it-on-the-moon-69024", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69024/aImg/68051/moonclock-meta.png", "publishedAt": "2023-05-19T16:43:11Z", "content": "Time shapes our lives and we cant avoid it. We are influenced and stressed out by clocks and alarms, and even if we were to get rid of our tech and go back to nature wed be at the mercy of the rotati… [+2265 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Ben Taub", "title": "Scientists Once Scanned The Brains Of 3 Suspected Zombies In Haiti - IFLScience", "description": "Turns out they're not so dead behind the eyes.", "url": "https://www.iflscience.com/scientists-once-scanned-the-brains-of-3-suspected-zombies-in-haiti-69013", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69013/aImg/68038/zombies-meta.jpg", "publishedAt": "2023-05-19T14:50:27Z", "content": "The undead dont usually participate in clinical studies, although three supposed zombies once agreed to have their brain activity measured by researchers in Haiti. Like an episode of Scooby Doo, the … [+3216 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Suspected Realtime Gravitational Waves Detection Of A Black Hole Eating A Neutron Star - IFLScience", "description": "We’ve seen black holes merging, and neutron star collisions, but this could be the first example of the third type of cataclysmic event the network of gravitational wave detectors was established to seek.", "url": "https://www.iflscience.com/suspected-real-time-gravitational-wave-detection-of-a-black-hole-eating-a-neutron-star-69012", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69012/aImg/68037/dissolving-neturon-star-meta.png", "publishedAt": "2023-05-19T14:08:43Z", "content": "A likely detection has been made of gravitational waves from a long-sought event: a black hole consuming a neutron star, and telescopes worldwide are hoping to confirm it. The signal was picked up by… [+3123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Discover New Way To Fight the Aging Process - SciTechDaily", "description": "Researchers at the University of Cologne have found that a protein complex impedes the repair of genomic damage in human cells, mice, and the nematode Caenorhabditis elegans. Furthermore, they were able to successfully obstruct this complex with a pharmaceuti…", "url": "https://scitechdaily.com/researchers-discover-new-way-to-fight-the-aging-process/", "urlToImage": "https://scitechdaily.com/images/Damaged-DNA.jpg", "publishedAt": "2023-05-19T12:44:02Z", "content": "ByUniversity of CologneMay 19, 2023\r\nResearchers at the University of Cologne have discovered a protein complex, called DREAM, that inhibits DNA repair mechanisms in human, mouse, and nematode cells,… [+6212 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Alfredo Carpineti", "title": "Glorious New Images Of Jupiter's Moon Io Are The Closest Yet From NASA's Juno - IFLScience", "description": "Juno passed by the volcanic moon in its latest close encounter with Jupiter", "url": "https://www.iflscience.com/glorious-new-images-of-jupiters-moon-io-are-the-closest-yet-from-juno-69008", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69008/aImg/68028/io-meta.png", "publishedAt": "2023-05-19T11:54:18Z", "content": "NASAs Juno has completed its 51st perijove, the closest passage to Jupiter in its elongated orbit around the gas giant. But it did not just get up close and personal to the planet on May 16, it also … [+3061 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Katie Spalding", "title": "When Two Wrongs Actually Do Make A Right: What Is Parrondo's Paradox? - IFLScience", "description": "It's inspired by an impossibility. It doesn't seem to make any sense. And it might hold the key to life itself.", "url": "https://www.iflscience.com/when-two-wrongs-actually-do-make-a-right-what-is-parrondos-paradox-69005", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69005/aImg/68024/random-meta.png", "publishedAt": "2023-05-19T11:00:16Z", "content": "Have you ever seen Oceans Eleven? Spoiler alert if you havent: in it, we see a ragtag group of lovable crooks and shysters attempt to take down a Las Vegas casino essentially an impenetrable fortress… [+8280 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Lauren Haughey", "title": "'Planet killer' asteroids pose 'no threat' to Earth for at least 1000 YEARS, scientists say - Daily Mail", "description": "Scientists at the University of Colorado and the California Institute of Technology claim that giant rock collisions pose no real threat to Earth for at least 1,000 years.", "url": "https://www.dailymail.co.uk/sciencetech/article-12102075/Planet-killer-asteroids-pose-no-threat-Earth-1-000-YEARS-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/19/10/71172871-0-image-a-10_1684487609907.jpg", "publishedAt": "2023-05-19T10:29:24Z", "content": "Planet killing asteroids have been a nerve-wracking prospect ever since we learned of the dinosaurs' demise. \r\nBut scientists claims we can rest easy for now, as giant asteroid collisions pose no rea… [+3415 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Breakthrough: First-Ever Measurement of a Quantum Paradox - SciTechDaily", "description": "How do quantum particles exchange information? An intriguing hypothesis regarding quantum information has recently been validated through experimental verification conducted at TU Wien. If you were to randomly pick an individual from a crowd who stands remark…", "url": "https://scitechdaily.com/physics-breakthrough-first-ever-measurement-of-a-quantum-paradox/", "urlToImage": "https://scitechdaily.com/images/Vacuum-Chamber-Containing-Atom-Chip-scaled.jpg", "publishedAt": "2023-05-19T09:49:49Z", "content": "ByVienna University of TechnologyMay 19, 2023\r\nVacuum chamber containing the atom chip. Credit: Thomas Schweigler, TU Wien\r\nHow do quantum particles exchange information? An intriguing hypothesis reg… [+3401 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Earth from Space: Oslo, Norway - European Space Agency", "description": "The Copernicus Sentinel-2 mission takes us over Oslo, Norway’s capital and largest city, and host of the 2023 Global Space Conference on Climate Change, taking place on 23–25 May.", "url": "https://www.esa.int/ESA_Multimedia/Images/2023/05/Earth_from_Space_Oslo_Norway", "urlToImage": null, "publishedAt": "2023-05-19T08:09:07Z", "content": null}]}