{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sun's Chromosphere Revealed in Stunning Inaugural Images From World's Most Powerful Solar Telescope - SciTechDaily", "description": "NSF’s flagship solar telescope, the largest in the world, to herald a new era of solar science. New observations released in celebration of the Inouye Solar Telescope Inauguration Ceremony. On August 31, 2022, a delegation of U.S. National Science Foundation …", "url": "https://scitechdaily.com/suns-chromosphere-revealed-in-stunning-inaugural-images-from-worlds-most-powerful-solar-telescope/", "urlToImage": "https://scitechdaily.com/images/Chromosphere-Inouye-Solar-Telescope-Crop.jpg", "publishedAt": "2022-09-09T12:32:00Z", "content": "One of the first images of the chromosphere the area of the Suns atmosphere above the surface taken with the Daniel K. Inouye Solar Telescope. Credit: National Solar Observatory (NSO), AURA, NSF\r\nNSF… [+7489 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "Doomsday glacier \"hanging on by its fingernails\" scientist says - Boing Boing", "description": "Good news, everyone. According to Rob Larter, marine geophysicist at the British Antarctic Survey, Thwaites Glacier in West Antarctica, nicknamed the “Doomsday” glacier because of its potential cat…", "url": "https://boingboing.net/2022/09/09/doomsday-glacier-hanging-on-by-its-fingernails-scientist-says.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/09/supp4rignot.jpg?fit=1200%2C674&ssl=1", "publishedAt": "2022-09-09T11:02:53Z", "content": "Good news, everyone. According to Rob Larter, marine geophysicist at the British Antarctic Survey, Thwaites Glacier in West Antarctica, nicknamed the \"Doomsday\" glacier because of its potential catas… [+1102 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Joe Rao", "title": "An early harvest full moon rises Saturday (Sept. 10) - Space.com", "description": "Many think that the Harvest Moon remains in the night sky longer than any of the other full moons we see during the year, but that is not so.", "url": "https://www.space.com/early-harvest-full-moon-sept-10-22", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ao2LmLU2DFFE5eZuTiiXGk-1200-80.jpg", "publishedAt": "2022-09-09T10:00:01Z", "content": "You don't want to miss the moon this weekend.\r\nThe full moon of Saturday (Sept. 10) also carries the title of the Harvest Moon for those living in the Northern Hemisphere. The moon officially turns f… [+3992 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Key Differences Revealed Between Brains of Modern Humans and Neanderthals - SciTechDaily", "description": "Scientists uncover a greater neuron production in the frontal lobe during brain development in modern humans than Neanderthals due to the change of a single amino acid in the protein TKTL1. What makes modern humans unique? It is a question that has long been …", "url": "https://scitechdaily.com/key-differences-revealed-between-brains-of-modern-humans-and-neanderthals/", "urlToImage": "https://scitechdaily.com/images/Brain-Neural-Network-Illustration.jpg", "publishedAt": "2022-09-09T08:46:53Z", "content": "ByMax Planck Institute of Molecular Cell Biology and Genetics (MPI-CBG)September 9, 2022\r\nNew research reveals that a change in a single amino acid in the protein TKTL1 results in greater neuron prod… [+7485 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Hubble Space Telescope Finds Window Into Early Universe - SciTechDaily", "description": "Astronomers Find Spiraling Stars May Be Feeding Star Formation in a Nearby Stellar Nursery Stars are the machines that sculpt the universe, yet researchers still don't fully know how they form. Scientists turned to the Small Magellanic Cloud, a satellite gala…", "url": "https://scitechdaily.com/nasas-hubble-space-telescope-finds-window-into-early-universe/", "urlToImage": "https://scitechdaily.com/images/Spatial-Distribution-of-NGC-346-Stars-Annotated.jpg", "publishedAt": "2022-09-09T03:24:27Z", "content": "BySpace Telescope Science InstituteSeptember 8, 2022\r\nThe massive star cluster NGC 346, located in the Small Magellanic Cloud, has long intrigued astronomers with its unusual shape. Now researchers u… [+10766 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Explosions: New Way To Measure the Distant Universe - SciTechDaily", "description": "Using star-shattering explosions to measure the universe. An multinational team of 23 scientists, led by Maria Dainotti, Assistant Professor at the National Astronomical Observatory of Japan (NAOJ), has analyzed archival data for massive cosmic explosions pro…", "url": "https://scitechdaily.com/cosmic-explosions-new-way-to-measure-the-distant-universe/", "urlToImage": "https://scitechdaily.com/images/Gamma-Ray-Bursts-to-Determine-Space-scaled.jpg", "publishedAt": "2022-09-08T20:56:29Z", "content": "Conceptual image of this research: using Gamma Ray Bursts to determine distance in space. Credit: NAOJ\r\nUsing star-shattering explosions to measure the universe.\r\nAn multinational team of 23 scientis… [+2758 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mary Beth Griggs", "title": "NASA’s next Artemis 1 launch attempt could be as early as late September - The Verge", "description": "NASA is making repairs at the launchpad as it looks to the next possible launch dates for its Artemis 1 mission. Many things will have to go right for the agency for it to launch later this month.", "url": "https://www.theverge.com/2022/9/8/23342701/nasa-artemis-possible-launch-late-september", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pFDN1BsXskmbWjR-Io_TozfyNxk=/0x279:3900x2321/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24005385/1242985031.jpg", "publishedAt": "2022-09-08T17:39:49Z", "content": "The agency is currently working on repairs and scheduling issues ahead of another launch attempt\r\nThe SLS rocket and Orion spacecraft sit on the launchpad on September 6th, 2022.\r\nPhoto by CHANDAN KH… [+3325 chars]"}]}