{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Space Telescopes First Full Color Images, Important Mission to the Moon - SciTechDaily", "description": "Ready to showcase the Webb space telescope’s first full-color images … Back in touch with a spacecraft on an important mission to the Moon …. And our Artemis I Moon rocket and spacecraft move a step closer to launch … a few of the stories to tell you about – …", "url": "https://scitechdaily.com/this-week-nasa-webb-space-telescopes-first-full-color-images-important-mission-to-the-moon/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Webb-First-Full-Color-Images.gif", "publishedAt": "2022-07-09T14:37:33Z", "content": "ByNASAJuly 9, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisory… [+2452 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Astonishing” 500-Million-Year-Old Fossilized Brains Prompt a Rethink of the Evolution of Insects and Spiders - SciTechDaily", "description": "An ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan. New research based on a cache of fossils that contains the brain and nervous system of a half-billion-year-old marine predator from the Burge…", "url": "https://scitechdaily.com/?p=183195", "urlToImage": "https://scitechdaily.com/images/Stanleycaris-hirpex.jpg", "publishedAt": "2022-07-09T10:33:33Z", "content": "Stanleycaris hirpex. Credit: Sabrina Cappelli © Royal Ontario Museum\r\nAn ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan.\r\nNew resear… [+6607 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Scientists think they've solved the Earth's oldest mystery - The Independent", "description": "Researchers believe they have cracked the strange circumstances behind how the Earth was formed", "url": "https://www.independent.co.uk/space/earth-formation-theory-eth-zurich-b2119416.html", "urlToImage": "https://static.independent.co.uk/2022/07/08/15/image.imageformat.carousel.835692018.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-07-09T09:54:11Z", "content": "Scientists have a new theory of how our planet formed.\r\nAs well as answering the mystery of how our planet got here, the theory would explain the Earths perculiar chemical composition. And it could h… [+2647 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "A Disturbing Shift Has Affected Earth's Delicate Energy Balance, Scientists Report - ScienceAlert", "description": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth depends on many finely balanced, interwoven cycles t", "url": "https://www.sciencealert.com/we-ve-completely-imbalanced-earth-s-energy-cycle-shunting-most-of-it-into-the-oceans", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/GoldLightAndCloudsBeneathBlueGlowOfEarthsAtmosphereInBlackOfSpace_1024.jpg", "publishedAt": "2022-07-09T00:02:08Z", "content": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth d… [+4018 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA's Perseverance Mars rover collects 9th Red Planet rock sample - Space.com", "description": "The sample may hold signs of ancient running water on Mars.", "url": "https://www.space.com/nasa-perseverance-mars-rover-9th-rock-sample", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xpbmDgMRGdfY2nPiPAK446-1200-80.jpg", "publishedAt": "2022-07-08T20:06:42Z", "content": "NASA's Perseverance Mars rover is digging into the surface of the Red Planet on the hunt for evidence of running water in the planet's past — and signs of ancient Mars life, if it ever existed.\r\nPers… [+3088 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Sara Odeen-Isbister", "title": "NASA makes 'astonishing' discovery about surface of giant distant asteroid Bennu - The Mirror", "description": "A NASA spacecraft sent to investigate a massive asteroid that could one day hit earth discovered its surface is so loosely packed, stepping on it would be like stepping into a kids' ball pit", "url": "https://www.mirror.co.uk/news/weird-news/nasa-makes-astonishing-discovery-surface-27433562", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article27434238.ece/ALTERNATES/s1200/0_FILE-PHOTO-Artist-rendering-of-NASAs-OSIRIS-REx-spacecraft-is-seen-in-this-undated-handout-image.jpg", "publishedAt": "2022-07-08T16:37:02Z", "content": "NASA scientists analysing a giant asteroid that could hit earth sometime between 2175 and 2199 have uncovered some fascinating facts about its surface.\r\n In 2020 NASA's spacecraft OSIRIS-REx collecte… [+3670 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Christopher Carbone", "title": "Watch the ISS dump 172 pounds of trash in space as waste removal gets upgraded - Daily Mail", "description": "Taking out the trash on the International Space Station just got much easier. Nanoracks has tested a new technology that will streamline the process of waste disposal in outer space.", "url": "https://www.dailymail.co.uk/sciencetech/article-10995299/Taking-garbage-International-Space-Station-just-got-easier.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/08/15/60039985-0-image-a-32_1657290161492.jpg", "publishedAt": "2022-07-08T14:44:48Z", "content": "Taking out the trash on the International Space Station just got much easier.\r\nNanoracks, a private space company based in Houston, successfully tested a new technology that will streamline the proce… [+4616 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "Artemis 1 launch team overcomes obstacles to complete WDR test objectives - NASASpaceFlight.com - NASASpaceflight.com", "description": "NASA’s Exploration Ground Systems (EGS) program and prime launch processing contractor Jacobs completed the Wet…", "url": "https://www.nasaspaceflight.com/2022/07/artemis-1-wdr-review/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/07/20220620_201113.small_.jpg", "publishedAt": "2022-07-08T14:44:02Z", "content": "NASA’s Exploration Ground Systems (EGS) program and prime launch processing contractor Jacobs completed the Wet Dress Rehearsal (WDR) countdown demonstration test for Artemis 1 at the Kennedy Space C… [+20968 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Perkins", "title": "Unusual superconductivity observed in twisted trilayer graphene - Phys.org", "description": "The ability to turn superconductivity off and on with a literal flip of a switch in so-called \"magic-angle twisted graphene\" has allowed engineers at Caltech to observe an unusual phenomenon that may shed new light on superconductivity in general.", "url": "https://phys.org/news/2022-07-unusual-superconductivity-trilayer-graphene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/unusual-superconductiv.jpg", "publishedAt": "2022-07-08T13:43:21Z", "content": "The ability to turn superconductivity off and on with a literal flip of a switch in so-called \"magic-angle twisted graphene\" has allowed engineers at Caltech to observe an unusual phenomenon that may… [+5582 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Oldest species with a backbone dates back more than 500 million years - Daily Mail", "description": "Fossils in China's Yunnan Province show that yunnanozoan is the oldest-known stem vertebrate - a vertebrate that's extinct but related to living vertebrates.", "url": "https://www.dailymail.co.uk/sciencetech/article-10991873/Oldest-species-backbone-dates-500-million-years.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/08/12/60033861-0-image-a-17_1657278186719.jpg", "publishedAt": "2022-07-08T11:25:37Z", "content": "The oldest known relative of all vertebrates on Earth swam the oceans 518 million years ago, a new study reveals. \r\nResearchers in China have analysed fossils of yunnanozoans, an extinct soft-bodied … [+6292 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Anugraha Sundaravelu", "title": "A shift in Neptune's orbit could cause the collapse of solar system - Metro.co.uk", "description": "Planets could smash into one another or get thrown out of the solar system entirely.", "url": "https://metro.co.uk/2022/07/08/a-shift-in-neptunes-orbit-could-cause-the-collapse-of-solar-system-16965740/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/07/nasa-ScBkW9AKgcA-unsplash-9aa2_1657277369.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-07-08T10:49:00Z", "content": "A star getting too close to our solar system could cause chaos (Picture: PA)\r\nResearchers have found that if a star flying past our solar system moved Neptunes orbit by just 0.1 per cent, it would re… [+2205 chars]"}, {"source": {"id": null, "name": "Listverse.com"}, "author": "Jamie Frater", "title": "10 Weird Critters That Lived Alongside the Dinosaurs - Listverse", "description": "The reign of the dinosaurs on Earth was a lengthy one. For about 165 million years, they dominated every continent, and today they have conquered our imaginations. But they were far from the only animals on Earth. They shared their world with many species jus…", "url": "https://listverse.com/2022/07/08/10-weird-critters-that-lived-alongside-the-dinosaurs/", "urlToImage": "https://listverse.com/wp-content/uploads/2022/07/Mosasaurus.jpeg", "publishedAt": "2022-07-08T07:34:30Z", "content": "The reign of the dinosaurs on Earth was a lengthy one. For about 165 million years, they dominated every continent, and today they have conquered our imaginations. But they were far from the only ani… [+10107 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Katy Evans", "title": "A Crack Opened In Earth's Magnetic Field Yesterday And Stayed Open For 14 Hours - IFLScience", "description": "What did it let in or out?", "url": "https://www.iflscience.com/a-crack-opened-in-earths-magnetic-field-yesterday-and-stayed-open-for-14-hours-64372", "urlToImage": "https://assets.iflscience.com/assets/articleNo/64372/aImg/56581/aurora-l.jpg", "publishedAt": "2022-07-08T05:52:00Z", "content": "Yesterday, a crack opened in Earths magnetic field and stayed open for nearly 14 hours, allowing Vecna and his minions through from the Upside Down. OK, perhaps not that last bit, but it did allow so… [+2414 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Ben Taub", "title": "Record-Breaking Experiment Quantum Entangles Two Atoms 20 Miles Apart - IFLScience", "description": "By quantum entangling two stationary atoms across 20 miles of fiber optic cable, researchers may have paved the way for the creation of a quantum internet.", "url": "https://www.iflscience.com/record-breaking-experiment-quantum-entangles-two-atoms-20-miles-apart-64374", "urlToImage": "https://assets.iflscience.com/assets/articleNo/64374/aImg/56580/quantum-entanglement-l.jpg", "publishedAt": "2022-07-08T05:03:00Z", "content": "A new quantum entanglement record has just been set by physicists at Ludwig Maximilian University (LMU) who successfully connected two rubidium atoms across 33 kilometers (20 miles) of fiber optic ca… [+2612 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Frank Landymore", "title": "We Finally Know Why NASA Lost Contact With Moonbound Spacecraft - Futurism", "description": "NASA dropped an update on its official blog detailing the causes of their satellite's dropout. In a nutshell? A bad command and a software error.", "url": "https://futurism.com/the-byte/why-nasa-lost-contact-moonbound-spacecraft", "urlToImage": "https://wp-assets.futurism.com/2022/07/why-nasa-lost-contact-moonbound-spacecraft.jpg", "publishedAt": "2022-07-07T00:51:35Z", "content": "\"Hard not to root for the little guy.\"\r\nAll Figured Out\r\nScientists at NASA let out a huge sigh of relief yesterday when NASA was able to successfully restore contact with its CAPSTONE satellite afte… [+1912 chars]"}]}