{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Georgina Torbet", "title": "How supernovae are helping uncover the mysteries of dark energy - The Verge", "description": "A new survey of supernovae is giving scientists unique insight into one of the universe’s greatest mysteries: dark energy.", "url": "https://www.theverge.com/24049140/dark-energy-universe-expand-mystery-survey-supernova", "urlToImage": "https://cdn.vox-cdn.com/thumbor/k61Ihs8y-Gs2w8cZ4A74J2aVq9s=/0x0:4117x2020/1200x628/filters:focal(2059x1010:2060x1011)/cdn.vox-cdn.com/uploads/chorus_asset/file/25246464/noirlab2401f.jpeg", "publishedAt": "2024-01-25T13:00:00Z", "content": "Dark energy, a force responsible for the expansion of the universe, is mostly unknown. But this month, researchers released a new survey meant to unpack its mysteries. \r\nByGeorgina Torbet\r\nJan 25, 20… [+9544 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Abha Jain", "title": "Physics-breaking 'rogue' objects spotted by James Webb telescope are emitting radio signals that scientists can't explain - Livescience.com", "description": "A bizarre object discovered by the James Webb Space Telescope may be a pair of 'rogue' planets ― but a new study finds they are emitting radio signals rarely seen from other worlds.", "url": "https://www.livescience.com/space/exoplanets/physics-breaking-rogue-objects-spotted-by-james-webb-telescope-are-emitting-radio-signals-that-scientists-cant-explain", "urlToImage": "https://cdn.mos.cms.futurecdn.net/evkeq5BdW4KABBG3H3xRtd-1200-80.jpg", "publishedAt": "2024-01-25T11:00:00Z", "content": "In 2023, the James Webb Space Telescope\r\n (JWST) helped identify hundreds of free-floating \"rogue\" planets that don't orbit a parent star. Now, astronomers have found that a pair of these planets may… [+4036 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Is Mars Worth Exploring, Imaging Our Galaxy, Rogue Planets | Q&A 244 - Fraser Cain", "description": "How can we possibly know how does the Milky Way look like? Is Marth worth further exploration after not finding any life there for years? How can we realisti...", "url": "https://www.youtube.com/watch?v=GbPaytLhCoM", "urlToImage": "https://i.ytimg.com/vi/GbPaytLhCoM/maxresdefault.jpg", "publishedAt": "2024-01-24T21:41:09Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Paul M. Sutter", "title": "Planetary size and associated cooling rate may explain why Mars died while Earth survived - Phys.org", "description": "We know of Mars as the red planet, for its surface and atmosphere is caked in endless swirling dust of rusted iron, the rusting action provided by the always-eager oxygen. But this was not always so.", "url": "https://phys.org/news/2024-01-planetary-size-cooling-mars-died.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/why-mars-died.jpg", "publishedAt": "2024-01-24T21:01:38Z", "content": "We know of Mars as the red planet, for its surface and atmosphere is caked in endless swirling dust of rusted iron, the rusting action provided by the always-eager oxygen. But this was not always so.… [+4282 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Methane pulses on Mars possibly driven by atmospheric pressure changes - Phys.org", "description": "New research shows that atmospheric pressure fluctuations that pull gases up from underground could be responsible for releasing subsurface methane into Mars's atmosphere; knowing when and where to look for methane can help the Curiosity rover search for sign…", "url": "https://phys.org/news/2024-01-methane-pulses-mars-possibly-driven.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/mars-methane-pulses-po.jpg", "publishedAt": "2024-01-24T20:23:02Z", "content": "New research shows that atmospheric pressure fluctuations that pull gases up from underground could be responsible for releasing subsurface methane into Mars's atmosphere; knowing when and where to l… [+2758 chars]"}, {"source": {"id": null, "name": "Gbnews.com"}, "author": "Jack Walters", "title": "Earth to be struck by two solar storms that risk causing major radio blackouts - GB News", "description": "Two solar storms which could cause radio blackouts will strike Earth this week, an expert has warned.A top physicist warned the sun looks set to release two powerful streams of energised particles.", "url": "https://www.gbnews.com/news/earth-solar-storms-radio-blackouts", "urlToImage": "https://www.gbnews.com/media-library/watch-now-nasa-s-solar-footage.jpg?id=51177492&width=1200&height=600&coordinates=0%2C668%2C0%2C668", "publishedAt": "2024-01-24T19:47:21Z", "content": "Two solar storms which could cause radio blackouts will strike Earth this week, an expert has warned.\r\nA top physicist warned the sun looks set to release two powerful streams of energised particles.… [+2288 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "The real Paleo diet was heavy on plants with very little meat: study - Business Insider", "description": "The study looked at the remains of ancient people buried in the Andean Altiplano of Peru about 9,000 years ago.", "url": "https://www.businessinsider.com/real-paleo-diet-plants-little-meat-study-early-human-remains-2024-1", "urlToImage": "https://i.insider.com/65b0e5bf6c8f0a134f797848?width=1200&format=jpeg", "publishedAt": "2024-01-24T19:01:00Z", "content": "The popular Paleo diet is based on the belief that we are better off eating like our ancestors by sticking to a largely meat-heavy diet.\r\nBut a new study suggests that some of our ancestors didn't go… [+5378 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "North China fossils show that eukaryotes first acquired multicellularity 1.63 billion years ago - Phys.org", "description": "In a study published in Science Advances, researchers led by Prof. Zhu Maoyan from the Nanjing Institute of Geology and Palaeontology of the Chinese Academy of Sciences have reported their recent discovery of 1.63-billion-year-old multicellular fossils from N…", "url": "https://phys.org/news/2024-01-north-china-fossils-eukaryotes-multicellularity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/north-china-fossils-sh.jpg", "publishedAt": "2024-01-24T19:00:01Z", "content": "In a study published in Science Advances, researchers led by Prof. Zhu Maoyan from the Nanjing Institute of Geology and Palaeontology of the Chinese Academy of Sciences have reported their recent dis… [+5628 chars]"}, {"source": {"id": null, "name": "Thedebrief.org"}, "author": "Micah Hanks, Micah Hanks", "title": "NASA’s Lunar Reconnaissance Orbiter Fired a Laser at a Spacecraft on the Moon. Here’s the Reason Why. - The Debrief", "description": "NASA recently revealed that a laser beam was fired from its Lunar Reconnaissance Orbiter (LRO) at a spacecraft on the Moon’s surface.", "url": "https://thedebrief.org/nasas-lunar-reconnaissance-orbiter-fired-a-laser-at-a-spacecraft-on-the-moon-heres-the-reason-why/", "urlToImage": "https://thedebrief.b-cdn.net/wp-content/uploads/2024/01/lunar-reconnaissance-orbiter.jpg", "publishedAt": "2024-01-24T15:35:09Z", "content": "NASA recently revealed that a laser beam was fired from its Lunar Reconnaissance Orbiter (LRO) at a spacecraft on the Moons surface, in a technological first that could pave the path toward new metho… [+5613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Melting Misconceptions: NASA's Startling Findings on Greenland's Ice Loss - SciTechDaily", "description": "A new, comprehensive analysis of satellite data finds more Greenland ice lost than previously estimated and that the majority of glaciers on the landmass have retreated significantly. The Greenland Ice Sheet has shed about one-fifth more ice mass in the past …", "url": "https://scitechdaily.com/melting-misconceptions-nasas-startling-findings-on-greenlands-ice-loss/", "urlToImage": "https://scitechdaily.com/images/Jakobshavn-Isbrae-Glacier-in-Greenland-Breaking.jpg", "publishedAt": "2024-01-24T13:34:59Z", "content": "Jakobshavn Isbrae, a glacier on Greenland’s western coast, is shown in imagery taken on September 4, 2022, by Landsat 8, breaking at its edge. A recent study found that from 1985 to 2022 the Greenlan… [+7009 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Liz Kruesi", "title": "The lost continent of Zealandia has been mapped for the first time - National Geographic", "description": "This enormous chunk of submerged continental crust sits between Antarctica and Australia, where it connected the landmasses as part of a supercontinent some 300 million years ago.", "url": "https://www.nationalgeographic.com/premium/article/the-lost-continent-of-zealandia-has-been-mapped-for-the-first-time", "urlToImage": "https://i.natgeofe.com/n/e028fa9f-53c9-4e90-aa2b-4cc5cf60af04/R97HEN_16x9.jpg?w=1200", "publishedAt": "2024-01-24T12:04:35Z", "content": "After years of exploration and research, scientists have finished mapping a sunken continent that lurks beneath the South Pacific. This chunk of continental crust, driven to the depths millions of ye… [+6660 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Dan Maloney", "title": "This Unique Flip-Flop Uses Chemistry And Lasers - Hackaday", "description": "One of the first logic circuits most of us learn about is the humble flip-flop. They’re easy enough to build with just a couple of NOR or NAND gates, and even building one up from discrete co…", "url": "https://hackaday.com/2024/01/24/this-unique-flip-flop-uses-chemistry-and-lasers/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/01/optical_flip_flop.png", "publishedAt": "2024-01-24T12:00:00Z", "content": "One of the first logic circuits most of us learn about is the humble flip-flop. They’re easy enough to build with just a couple of NOR or NAND gates, and even building one up from discrete components… [+1773 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Andrew Jones", "title": "Happy 20th, Spirit and Opportunity! How the Mars rovers expanded our horizons - Space.com", "description": "The trailblazing Mars rovers covered marathon distances while making fresh discoveries.", "url": "https://www.space.com/mars-rovers-spirit-opportunity-20th-anniversary", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3hgec7iPZccY9eiZWTUCdd-1200-80.jpg", "publishedAt": "2024-01-24T11:00:14Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Russell McLendon", "title": "The Very First Cells Could Have Bubbled Out of Hot Springs on The Ocean Floor - ScienceAlert", "description": "We still don't know how life on Earth began some point more than 3.5 billion years ago, but a new study supports the idea that vital components of our earliest ancestors emerged from reactions involving ancient hydrothermal vents.", "url": "https://www.sciencealert.com/the-very-first-cells-could-have-bubbled-out-of-hot-springs-on-the-ocean-floor", "urlToImage": "https://www.sciencealert.com/images/2024/01/Eifuku_chimneys_bubbles.jpg", "publishedAt": "2024-01-24T03:08:28Z", "content": "We still don't know how life on Earth began some point more than 3.5 billion years ago, but a new study supports the idea that vital components of our earliest ancestors emerged from reactions involv… [+3188 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "NASA Invests in New Nuclear Rocket Concept for the Future of Space Exploration and Astrophysics - Universe Today", "description": "In the coming years, NASA plans to send several astrobiology missions to Venus and Mars to search for evidence of extraterrestrial life. These will occur alongside crewed missions to the Moon (for the first time since the Apollo Era) and the first crewed miss…", "url": "https://www.universetoday.com/165258/nasa-invests-in-new-nuclear-rocket-concept-for-the-future-of-space-exploration-and-astrophysics/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/01/2024-ph-i-bickford-graphic.jpg", "publishedAt": "2024-01-24T00:28:19Z", "content": "In the coming years, NASA plans to send several astrobiology missions to Venus and Mars to search for evidence of extraterrestrial life. These will occur alongside crewed missions to the Moon (for th… [+5358 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "U.S. bracing for tougher satellite radio wave negotiations - SpaceNews", "description": "It will become increasingly challenging to protect national interests during treaty-level talks over how radio waves should be allocated for satellite connectivity, according to the ambassador who led U.S. efforts at the 2023 World Radiocommunication Conferen…", "url": "https://spacenews.com/u-s-bracing-for-tougher-satellite-radio-wave-negotiations/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2024/01/Steve-Lang-scaled.jpg?fit=2560%2C1440&ssl=1", "publishedAt": "2024-01-23T20:31:20Z", "content": "TAMPA, Fla. It will become increasingly challenging to protect national interests during treaty-level talks over how radio waves should be allocated for satellite connectivity, according to the ambas… [+4356 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mark Thompson", "title": "Now we know why Starship's second flight test failed - Phys.org", "description": "SpaceX is often in the headlines; unfortunately, it is not always good news. On 18 November we saw the second of the Starship and SuperHeavy booster get off the launchpad successfully; it failed before reaching orbit. In a recent event, Elon Musk explained ho…", "url": "https://phys.org/news/2024-01-starship-flight.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/now-we-know-why-starsh.jpg", "publishedAt": "2024-01-23T19:40:21Z", "content": "SpaceX is often in the headlines; unfortunately, it is not always good news. On 18 November we saw the second of the Starship and SuperHeavy booster get off the launchpad successfully; it failed befo… [+2284 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "What Could the Extremely Large Telescope See at Proxima Centauri's Planet? - Universe Today", "description": "Astronomers discovered a rocky exoplanet in the habitable zone of Proxima Centauri, the closest star to the Sun. Could there be life there? The European Southern Observatory's 39-meter Extremely Large Telescope is under construction and expected to be complet…", "url": "https://www.universetoday.com/165383/what-could-the-extremely-large-telescope-see-at-proxima-centauris-planet/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2016/08/eso1629a.jpg", "publishedAt": "2024-01-23T16:59:20Z", "content": "Proxima Centauri B is the closest exoplanet to Earth. It is an Earth-mass world right in the habitable zone of a red dwarf star just 4 light-years from Earth. It receives about 65% of the energy Eart… [+4020 chars]"}]}