{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Marcia Dunn", "title": "NASA's Lucy spacecraft swoops past first of 10 asteroids on long journey to Jupiter - Phys.org", "description": "NASA's Lucy spacecraft on Wednesday encountered the first of 10 asteroids on its long journey to Jupiter.", "url": "https://phys.org/news/2023-11-nasa-lucy-spacecraft-swoops-asteroids.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/nasas-lucy-spacecraft-5.jpg", "publishedAt": "2023-11-01T20:58:23Z", "content": "NASA's Lucy spacecraft on Wednesday encountered the first of 10 asteroids on its long journey to Jupiter.\r\nThe spacecraft on Wednesday swooped past the pint-sized Dinkinesh, about 300 million miles (… [+2399 chars]"}, {"source": {"id": null, "name": "Spaceflight Now"}, "author": null, "title": "Mixed results for spacewalkers after time lost dealing with difficult-to-loosen bolts – Spaceflight Now - Spaceflight Now", "description": "Astronauts Jasmin Moghbeli and Loral O'Hara worked outside the International Space Station Wednesday to replace a bearing assembly in one of the lab's solar array rotation mechanisms. But the task too", "url": "https://spaceflightnow.com/2023/11/01/mixed-results-for-spacewalkers-after-time-lost-dealing-with-difficult-to-loosen-bolts/", "urlToImage": "http://spaceflightnow.com/wp-content/uploads/2023/11/20231101-EVA.jpg", "publishedAt": "2023-11-01T20:14:27Z", "content": "Jasmin Moghbeli, wearing a spacesuit with red stripes, works with Loral O’Hara to secure insulation around a failed radio communications unit during the fourth all-female spacewalk. Image: NASA TV.\r\n… [+3553 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "White Dwarfs Could Support Life. So Where are All Their Planets? - Universe Today", "description": "Astronomers have found plenty of white dwarf stars surrounded by debris disks. Those disks are the remains of planets destroyed by the star as it evolved. But they’ve found one intact Jupiter-mass planet orbiting a white dwarf. Are there more white dwarf plan…", "url": "https://www.universetoday.com/163999/white-dwarfs-could-support-life-so-where-are-all-their-planets/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2022/11/whitedwarf.jpg", "publishedAt": "2023-11-01T18:12:06Z", "content": "Astronomers have found plenty of white dwarf stars surrounded by debris disks. Those disks are the remains of planets destroyed by the star as it evolved. But they’ve found one intact Jupiter-mass pl… [+7657 chars]"}, {"source": {"id": null, "name": "Iai.tv"}, "author": null, "title": "A new theory of matter may help explain life | Lee Cronin - IAI", "description": "Lee Cronin argues that the assembly theory of matter shows how evolution by modification and selection isn’t simply the preserve of life but describes how all matter develops.", "url": "https://iai.tv/articles/a-new-theory-of-matter-may-help-explain-life-lee-cronin-auid-2656", "urlToImage": "", "publishedAt": "2023-11-01T18:02:59Z", "content": "The current picture of matter that physics offers us is unable to explain how life evolved from inorganic materials. The problem seems to be with physics defining matter simply in terms of its buildi… [+10923 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Condensin dysfunction is a reproductive isolating barrier in mice - Nature.com", "description": "Species divergence in condensin regulation and centromere organization between the mice Mus musculus domesticus and Mus spretus drives chromosome decondensation and mis-segregation in their F1 hybrid oocytes, reducing female fertility.", "url": "https://www.nature.com/articles/s41586-023-06700-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-06700-6/MediaObjects/41586_2023_6700_Fig1_HTML.png", "publishedAt": "2023-11-01T16:24:54Z", "content": null}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Astronomers have just discovered an 8 billion-year-old radio signal - indy100", "description": "An eight billion-year-old radio signal containing extreme levels of energy has been discovered by astronomers. According to the journal Science, a “fast radio burst” was recorded as lasting for just a millisecond. The radio-frequency electromagnetic radiation…", "url": "https://www.indy100.com/science-tech/astronomers-discovered-radio-signal-2666123054", "urlToImage": "https://www.indy100.com/media-library/scientists-have-received-powerful-fast-radio-burst-from-the-depths-of-the.jpg?id=50279220&width=1200&height=600&coordinates=0%2C133%2C0%2C163", "publishedAt": "2023-11-01T16:03:23Z", "content": "An eight billion-year-old radio signal containing extreme levels of energy has been discovered by astronomers. \r\nAccording to the journal Science, a fast radio burst was recorded as lasting for just … [+1697 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "The First-Ever Lunar Farm Shows That Plants Can Grow On The Moon - IFLScience", "description": "Low gravity has benefits, it seems, including increased cold resistance.", "url": "https://www.iflscience.com/the-first-ever-lunar-farm-shows-that-plants-can-grow-on-the-moon-71370", "urlToImage": "https://assets.iflscience.com/assets/articleNo/71370/aImg/71778/farming-on-the-moon-meta.jpg", "publishedAt": "2023-11-01T14:25:35Z", "content": "Plants are not just able to survive in low gravity such as on the Moon, two new papers suggest they may prefer it, at least based on the only species to sprout.\r\nWhen Change 4 landed on the Moon in J… [+4117 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astronomers now know how far the Earth is from 200 galaxies - Phys.org", "description": "On July 11, 2022, the very first image taken by the James Webb Space Telescope (JWST) was released to the general public. It's called Webb's First Deep Field, centered on a cluster of galaxies named SMACS 0723 and containing no less than 7,000 galaxies.", "url": "https://phys.org/news/2023-11-astronomers-earth-galaxies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astronomers-now-know-h.jpg", "publishedAt": "2023-11-01T13:51:04Z", "content": "On July 11, 2022, the very first image taken by the James Webb Space Telescope (JWST) was released to the general public. It's called Webb's First Deep Field, centered on a cluster of galaxies named … [+6666 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Jenny List", "title": "Need A Low-Mass Antenna In Space? Just Blow It Up! - Hackaday", "description": "A parabolic antenna is a simple enough device, a curved reflector designed to focus all the radiation from the direction it’s pointed into a waveguide or antenna at its feedpoint. They’…", "url": "https://hackaday.com/2023/10/31/need-a-low-mass-antenna-in-space-just-blow-it-up/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/10/inflatable-antenna-featured.jpg", "publishedAt": "2023-11-01T02:00:00Z", "content": "A parabolic antenna is a simple enough device, a curved reflector designed to focus all the radiation from the direction it’s pointed into a waveguide or antenna at its feedpoint. They’re easy enough… [+1695 chars]"}, {"source": {"id": null, "name": "Spaceflight Now"}, "author": null, "title": "Astrobotic's Peregrine lander arrives in Florida ahead of Christmas Eve Moon-bound launch – Spaceflight Now - Spaceflight Now", "description": "The Peregrine-1 mission for Astrobotic will also be the first certification mission for ULA's Vulcan rocket.", "url": "https://spaceflightnow.com/2023/11/01/astrobotics-peregrine-lander-arrives-in-florida-ahead-of-christmas-eve-moon-bound-launch/", "urlToImage": "http://spaceflightnow.com/wp-content/uploads/2023/11/20231031-Peregrine-arrives-small.jpg", "publishedAt": "2023-11-01T01:13:48Z", "content": "Astrobotic’s Peregrine lunar lander in the clean room at Astrotech in Titusville, Florida. The spacecraft will be the main payload onboard the first launch of ULA’s Vulcan rocket. Image: ULA\r\nThe fir… [+10956 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Woolly-rhino genome emerges from cave hyena's fossilized poo - Nature.com", "description": "Analysis shows that the now-extinct beast split into two populations almost half a million years ago.", "url": "https://www.nature.com/articles/d41586-023-03351-5", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-03351-5/d41586-023-03351-5_26244292.jpg", "publishedAt": "2023-11-01T00:06:50Z", "content": null}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "As NASA struggles to open OSIRIS-REx's asteroid sample can, probe heads off to next rock - The Register", "description": "Screw it... no wait, unscrew it, cry boffins", "url": "https://www.theregister.com/2023/11/01/osirisapex_spacecraft_apophis_target/", "urlToImage": "https://regmedia.co.uk/2021/05/10/osirisrex.jpg", "publishedAt": "2023-11-01T00:05:00Z", "content": "NASA's first-ever asteroid sample-collecting spacecraft OSIRIS-REx has had its mission extended and will next visit Apophis, a near-Earth object expected to fly as close as 20,000 miles to our home p… [+3653 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Alchemy – New Findings Demonstrate That Supermassive Black Holes Alter Galactic Chemistry - SciTechDaily", "description": "Recent research has demonstrated that the supermassive black hole at the center of a galaxy can significantly influence the chemical composition of the host galaxy. This finding adds a crucial element to our understanding of galactic evolution. Challenges in …", "url": "https://scitechdaily.com/cosmic-alchemy-new-findings-demonstrate-that-supermassive-black-holes-alter-galactic-chemistry/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Galaxy-Colorful-Stars.jpg", "publishedAt": "2023-10-31T23:38:58Z", "content": "ByNational Institutes of Natural SciencesOctober 31, 2023\r\nNew ALMA observations have uncovered the impact of supermassive black holes on the chemical composition of galaxies, revealing how they brea… [+4328 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Evan Gough", "title": "Did Betelgeuse Consume a Smaller Star? - Universe Today", "description": "Betelgeuse generates a lot of headlines. New research suggests that the star may have consumed a companion some time in the past.", "url": "https://www.universetoday.com/163998/did-betelgeuse-consume-a-smaller-star/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/10/Betelgeuse-ALMA.jpg", "publishedAt": "2023-10-31T22:25:17Z", "content": "What’s going on with Betelgeuse? In recent years it’s generated a lot of headlines as its luminosity has shifted dramatically several times. The red supergiant brightened by almost 50% earlier this y… [+6259 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Trek to the Stars With October's Most Compelling Spaceflight Images - Gizmodo", "description": "NASA got its hands on a space rock, Juno saw a volcanic moon up close, and SpaceX stuck the landing once again.", "url": "https://gizmodo.com/nasa-spacex-space-images-io-jupiter-asteroid-sample-1850925439", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f3821d8ce8d44ed65f5cedb33ec119ba.jpg", "publishedAt": "2023-10-31T20:54:00Z", "content": "NASA shared exciting images from the OSIRIS-REx asteroid sample return mission. The canister, now in the hands of technicians, is still in the process of being opened (the space agency is struggling … [+642 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "David L. Chandler", "title": "A surprising finding shows that light can make water evaporate without heat could enable new approaches to desalination - Tech Xplore", "description": "Evaporation is happening all around us all the time, from the sweat cooling our bodies to the dew burning off in the morning sun. But science's understanding of this ubiquitous process may have been missing a piece all this time.", "url": "https://techxplore.com/news/2023-10-evaporate-enable-approaches-desalination.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/dew-drops.jpg", "publishedAt": "2023-10-31T20:21:36Z", "content": "Evaporation is happening all around us all the time, from the sweat cooling our bodies to the dew burning off in the morning sun. But science's understanding of this ubiquitous process may have been … [+7278 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "indy100"}, "author": "Alex Daniel", "title": "Scientists think close kilonova explosion could end all life on Earth - indy100", "description": "Scientists have worked out how close a neutron star collision would have to be to threaten all life on Earth, in a not-remotely-terrifying new study.The event, known as a kilonova, is among the most powerful and explosive in the known universe. It’s not quite…", "url": "https://www.indy100.com/science-tech/kilonova-explosion-neutron-star", "urlToImage": "https://www.indy100.com/media-library/kilonova-when-neutron-stars-collide.png?id=50340794&width=1200&height=600&coordinates=0%2C40%2C0%2C40", "publishedAt": "2023-10-31T15:56:50Z", "content": "Scientists have worked out how close a neutron star collision would have to be to threaten all life on Earth, in a not-remotely-terrifying new study.\r\nThe event, known as a kilonova, is among the mos… [+3052 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "GHOST finds an extremely metal-poor star - Phys.org", "description": "An international team of astronomers reports the detection of a new extremely metal-poor star using the Gemini High-resolution Optical SpecTrograph (GHOST) at the Gemini South telescope in Chile. The finding was presented in a paper published October 25 on th…", "url": "https://phys.org/news/2023-10-ghost-extremely-metal-poor-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/ghost-finds-an-extreme.jpg", "publishedAt": "2023-10-31T15:20:01Z", "content": "An international team of astronomers reports the detection of a new extremely metal-poor star using the Gemini High-resolution Optical SpecTrograph (GHOST) at the Gemini South telescope in Chile. The… [+3117 chars]"}, {"source": {"id": null, "name": "Aps.org"}, "author": null, "title": "Observation of a Single Top Quark and a Photon - Physics", "description": "The Large Hadron Collider’s ATLAS Collaboration observes, for the first time, the coincident production of a photon and a top quark.", "url": "https://physics.aps.org/articles/v16/187", "urlToImage": "https://physics.aps.org/assets/6d9b6455-f3fc-46b2-b0a4-9aea668bb980/e187_2_thumb.png", "publishedAt": "2023-10-31T15:01:51Z", "content": "Figure 1: This schematic “Feynman diagram” illustrates the particles and interactions involved in the coincident production of a single top quark and a photon from a proton–proton collision. The init… [+9138 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "In 1952, 3 Stars Vanished From The Night Sky. What Happened To Them? - IFLScience", "description": "The objects have never been seen again.", "url": "https://www.iflscience.com/in-1952-3-stars-vanished-from-the-night-sky-what-happened-to-them-71358", "urlToImage": "https://assets.iflscience.com/assets/articleNo/71358/aImg/71742/stars-disappear-meta.png", "publishedAt": "2023-10-31T13:14:07Z", "content": "On 19 July 1952, the Palomar Observatory near San Diego, California, undertook a survey of the night sky, focusing on a particular region and photographing it multiple times, in an attempt to spot bo… [+3681 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Ham Radio Operators' Ionospheric Science During The Solar Eclipse - Hackaday", "description": "The Earth’s ionosphere is the ionized upper part of the atmosphere, and it’s also the most dynamic as it swells and ebbs depending on whether it’s exposed to the Sun or not. It&#8…", "url": "https://hackaday.com/2023/10/31/ham-radio-operators-ionospheric-science-during-the-solar-eclipse/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/10/Ionospheric_layers_from_night_to_day.png", "publishedAt": "2023-10-31T11:00:00Z", "content": "The Earth’s ionosphere is the ionized upper part of the atmosphere, and it’s also the most dynamic as it swells and ebbs depending on whether it’s exposed to the Sun or not. It’s the ionosphere that … [+1760 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jules Bernstein", "title": "Giant planets cast a deadly pall: How they can prevent life in other solar systems - Phys.org", "description": "Giant gas planets can be agents of chaos, ensuring nothing lives on their Earth-like neighbors around other stars. New studies show, in some planetary systems, the giants tend to kick smaller planets out of orbit and wreak havoc on their climates.", "url": "https://phys.org/news/2023-10-giant-planets-deadly-pall-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/giant-planets-cast-a-d.jpg", "publishedAt": "2023-10-31T10:13:39Z", "content": "Giant gas planets can be agents of chaos, ensuring nothing lives on their Earth-like neighbors around other stars. New studies show, in some planetary systems, the giants tend to kick smaller planets… [+4403 chars]"}]}