{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA to announce Hubble Space Telescope discovery next week - Space.com", "description": "For now, it's a mystery.", "url": "https://www.space.com/hubble-space-telescope-observations-announcement-coming", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bErCocXtK7uZLiQ8BtyvQ5-1200-80.jpg", "publishedAt": "2022-03-25T15:49:36Z", "content": "Officials with the Hubble Space Telescope program have some new science to share on Wednesday (March 30).\r\nA NASA statement promises \"one for the record books\" and an \"exciting new observation\" from … [+2319 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Exclusive: Documents reveal NASA's internal struggles over renaming Webb telescope - Nature.com", "description": "E-mails show agency’s controversial response to astronomers concerned about past LGBT+ discrimination.", "url": "https://www.nature.com/articles/d41586-022-00845-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-00845-6/d41586-022-00845-6_20246884.jpg", "publishedAt": "2022-03-25T13:30:33Z", "content": "Shown here being packed up for shipment to its launch site last year, the James Webb Space Telescope was designed to probe the early Universe.Credit: Chris Gunn/NASA\r\nInternal NASA documents obtained… [+8941 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Video Showcases the Largest, Most Detailed Simulation of the Early Universe to Date - SciTechDaily", "description": "Named after a goddess of the dawn, the Thesan simulation of the first billion years helps explain how radiation shaped the early universe. It all started around 13.8 billion years ago with a big, cosmological “bang” that brought the universe suddenly and spec…", "url": "https://scitechdaily.com/stunning-video-showcases-the-largest-most-detailed-simulation-of-the-early-universe-to-date/", "urlToImage": "https://scitechdaily.com/images/Thesan-Simulation-Clip.gif", "publishedAt": "2022-03-25T12:49:52Z", "content": "Small clip of the Thesan simulation. See video in article below.\r\nNamed after a goddess of the dawn, the Thesan simulation of the first billion years helps explain how radiation shaped the early univ… [+7570 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Chaos Terrains” Could Be Shuttling Oxygen to Ocean on Jupiter's Moon Europa - SciTechDaily", "description": "Salt water within the icy shell of Jupiter’s moon Europa could be transporting oxygen into an ice-covered ocean of liquid water where it could potentially help sustain alien life, according to a team of researchers led by The University of Texas at Austin. Th…", "url": "https://scitechdaily.com/chaos-terrains-could-be-shuttling-oxygen-to-ocean-on-jupiters-moon-europa/", "urlToImage": "https://scitechdaily.com/images/Water-and-Chaos-Terrain-Jupiter-Europa.jpg", "publishedAt": "2022-03-25T08:32:09Z", "content": "An artist’s interpretation of liquid water on the surface of the Europa pooling beneath chaos terrain. Credit: NASA/JPL-Caltech\r\nSalt water within the icy shell of Jupiter’s moon Europa could be tran… [+4928 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Scientists solve the mystery of the Sun’s puzzling heat - The Independent", "description": "Scientists now know why the Sun’s corona is so much hotter than its surface — and what that might mean for understanding space weather", "url": "https://www.independent.co.uk/space/sun-solar-corona-solar-physics-nasa-b2043680.html", "urlToImage": "https://static.independent.co.uk/2022/03/24/23/PIA09322~orig.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-03-25T07:21:06Z", "content": "Scientists have developed a new, unified theory of why the Sun is hot or more specifically, why its upper atmosphere is so hot when its furthest from our stars core.\r\nThe new theory could help scient… [+3405 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Boas Save Themselves From Suffocating When Squeezing Their Prey to Death - SciTechDaily", "description": "Boa constrictors breathe with different sections of rib cage when constricting prey and digesting dinner. The later stages of pregnancy can make life difficult as the fetus presses against the diaphragm making it hard to breathe. But snakes that constrict the…", "url": "https://scitechdaily.com/how-boas-save-themselves-from-suffocating-when-squeezing-their-prey-to-death/", "urlToImage": "https://scitechdaily.com/images/Rainbow-Boa.jpg", "publishedAt": "2022-03-25T04:16:19Z", "content": "Boa constrictors breathe with different sections of rib cage when constricting prey and digesting dinner.\r\nThe later stages of pregnancy can make life difficult as the fetus presses against the diaph… [+4003 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Cameron Duke", "title": "'Informational simplicity' may explain why nature favors symmetry - Livescience.com", "description": "Life favors simple structures over complex ones.", "url": "https://www.livescience.com/why-symmetry-common-in-biology", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9jpfQQqvQZfo3RWnDRwuDk-1200-80.jpg", "publishedAt": "2022-03-24T18:15:15Z", "content": "In biology, symmetry is typically the rule rather than the exception. Our bodies have left and right halves, starfish radiate from a central point and even trees, though not largely symmetrical, stil… [+4753 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Solar Orbiter probe captures the most detailed ever image of the Sun's explosive lower atmosphere - Daily Mail", "description": "A joint project between NASA and the European Space Agency (ESA), the Solar Orbiter was 46 million miles from the surface of the sun when it took the images.", "url": "https://www.dailymail.co.uk/sciencetech/article-10648235/Solar-Orbiter-probe-captures-detailed-image-Suns-explosive-lower-atmosphere.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/24/15/55755523-0-image-a-20_1648137338191.jpg", "publishedAt": "2022-03-24T15:42:42Z", "content": "The Solar Orbiter space probe has captured the most detailed ever image of the sun's explosive lower atmosphere, revealing volatile, dynamic eruptions.\r\nA joint project between NASA and the European … [+8231 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dense Bones Allowed Spinosaurus – The Biggest Carnivorous Dinosaur Ever Discovered – To Hunt Underwater - SciTechDaily", "description": "Its close cousin Baryonyx probably swam too, but Suchomimus might’ve waded like a heron. Spinosaurus is the biggest carnivorous dinosaur ever discovered—even bigger than T. rex—but the way it hunted has been a subject of debate for decades. It’s hard to guess…", "url": "https://scitechdaily.com/dense-bones-allowed-spinosaurus-the-biggest-carnivorous-dinosaur-ever-discovered-to-hunt-underwater/", "urlToImage": "https://scitechdaily.com/images/Spinosaurus-Hunting-scaled.jpg", "publishedAt": "2022-03-24T12:35:39Z", "content": "Spinosaurus, the longest predatory dinosaur known, is opening its elongate jaws, studded with conical teeth, to catch a sawskate. Contrary to previous suggestions, this animal was not a heron-like wa… [+9295 chars]"}]}