{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA urged to probe URANUS and study its gaseous atmosphere - Daily Mail", "description": "Known as the Committee on the Planetary Science and Astrobiology Decadal Survey, it designates a Uranus Orbiter and Probe as the highest-priority flagship mission.", "url": "https://www.dailymail.co.uk/sciencetech/article-10732511/NASA-urged-probe-URANUS-study-gaseous-atmosphere.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/19/18/56798061-0-image-a-7_1650390018624.jpg", "publishedAt": "2022-04-19T17:42:33Z", "content": "NASA has been urged to launch the first mission to giant Uranus, in a report by the National Academy of Sciences, outlining space priorities for the next decade.\r\nKnown as the Committee on the Planet… [+9927 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Jupiter’s moon Europa may have water where life could exist, say scientists - The Guardian", "description": "Surface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter", "url": "https://amp.theguardian.com/science/2022/apr/19/jupiters-moon-europa-may-have-water-life-could-exist", "urlToImage": null, "publishedAt": "2022-04-19T15:27:00Z", "content": "JupiterSurface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter\r\nSubterranean pools of salty water may be commonplace on Jupiters m… [+4410 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Doorbells and dashcams in Shrewsbury could help solve the mystery of life on Earth - The Telegraph", "description": "The UK’s Fireball Alliance has urged households and car owners to check footage after a meteorite landed in the town last Thursday", "url": "https://www.telegraph.co.uk/news/2022/04/19/doorbells-dashcams-shrewsbury-could-help-solve-mystery-life/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/04/19/TELEMMGLPICT000293279297_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?impolicy=logo-overlay", "publishedAt": "2022-04-19T14:02:00Z", "content": "Doorbells and dashboard camera footage could help solve the mystery of life on Earth if they capture footage of meteorites entering the atmosphere, the UKs Fireball Alliance has said, as it appeals f… [+747 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Private Ax-1 Astronauts Extend Stay on Space Station: Dragon Endeavour Departure Postponed - SciTechDaily", "description": "NASA Mission Control has informed the Expedition 67 and Axiom Mission 1 (Ax-1) crews aboard the International Space Station that because of unfavorable weather at the splashdown location for recovery of the Dragon Endeavour and the Ax-1 crew, the integrated o…", "url": "https://scitechdaily.com/private-ax-1-astronauts-extend-stay-on-space-station-dragon-endeavour-departure-postponed/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Dragon-Endeavour-Carrying-Axiom-Ax-1-Astronauts-scaled.jpg", "publishedAt": "2022-04-19T09:57:59Z", "content": "The SpaceX Dragon Endeavour carrying four Axiom Mission 1 astronauts approaches the International Space Station on April 9, 2022, less than a day after launching from NASAs Kennedy Space Center in Fl… [+2225 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Russian Cosmonauts Complete Spacewalk To Set Up 37-Foot-Long Robotic Arm - SciTechDaily", "description": "Expedition 67 Flight Engineers Oleg Artemyev and Denis Matveev of Roscosmos concluded their spacewalk at 5:37 p.m. EDT today after 6 hours and 37 minutes. Russian spacewalk 52 began at 11:01 a.m. EDT to activate a new robotic arm attached to the Nauka multipu…", "url": "https://scitechdaily.com/russian-cosmonauts-complete-spacewalk-to-set-up-37-foot-long-robotic-arm/", "urlToImage": "https://scitechdaily.com/images/Spacewalkers-Oleg-Artemyev-and-Denis-Matveev-Configure-New-Robotic-Arm.jpg", "publishedAt": "2022-04-19T04:16:56Z", "content": "Spacewalkers Oleg Artemyev and Denis Matveev configure new robotic arm components on the Nauka multiupurpose laboratory module. Credit: NASA\r\nExpedition 67 Flight Engineers Oleg Artemyev and Denis Ma… [+1879 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Antony Ashkenaz", "title": "Solar storm sparks blackouts in Asia and Australia as earth hit by major solar flare - Express", "description": "ON EASTER weekend, the Earth was rocked by a major solar flare that sparked radio blackouts around southeast Asia and Australia.", "url": "https://www.express.co.uk/news/science/1597578/solar-storm-blackout-asia-australia-sun-major-solar-flare-space-weather", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/750x445/1597578.jpg", "publishedAt": "2022-04-18T15:33:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Scientists hope to broadcast DNA and Earth’s location for curious aliens - The Guardian", "description": "Beacon of Galaxy message could be sent into heart of Milky Way, where life is deemed most likely to exist", "url": "https://amp.theguardian.com/science/2022/apr/18/scientists-hope-to-broadcast-dna-and-earths-location-for-curious-aliens", "urlToImage": null, "publishedAt": "2022-04-18T12:15:00Z", "content": "ScienceBeacon of Galaxy message could be sent into heart of Milky Way, where life is deemed most likely to exist\r\nEven if the aliens are short, dour and sexually obsessed, the late cosmologist Carl S… [+4089 chars]"}]}