{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Collision Ignites a Trillion-Sun Spectacle: James Webb Space Telescope Unveils Arp 220 - SciTechDaily", "description": "A Dazzling Display of Star Birth Captured in Infrared A stunning smash-up of two spiral galaxies shines in infrared with the light of more than a trillion suns. Collectively called Arp 220, the colliding galaxies ignited a tremendous burst of star birth. Each…", "url": "https://scitechdaily.com/cosmic-collision-ignites-a-trillion-sun-spectacle-james-webb-space-telescope-unveils-arp-220/", "urlToImage": "https://scitechdaily.com/images/Webb-Captures-Spectacular-Galactic-Merger-Arp-220-scaled.jpg", "publishedAt": "2023-04-18T08:38:32Z", "content": "Arp 220, a merging ultra-luminous infrared galaxy, was captured by the James Webb Space Telescope, showcasing its trillion-sun luminosity, massive star formation, and vivid evidence of the ongoing ga… [+1519 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Orb weaver spider glue properties evolve faster than their glue genes, scientists find - Phys.org", "description": "Spiders that don't weave good silk don't get to eat. The silk spiders produce to create their webs is key to their survival—but spiders live in many different places that require webs fine-tuned for local success. Scientists have now studied the glue that mak…", "url": "https://phys.org/news/2023-04-orb-weaver-spider-properties-evolve.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/orb-weaver-spider.jpg", "publishedAt": "2023-04-18T04:00:01Z", "content": "Spiders that don't weave good silk don't get to eat. The silk spiders produce to create their webs is key to their survivalbut spiders live in many different places that require webs fine-tuned for l… [+4662 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jade Boyd", "title": "Physicists find unusual waves in nickel-based magnet - Phys.org", "description": "Perturbing electron spins in a magnet usually results in excitations called \"spin waves\" that ripple through the magnet like waves on a pond that's been struck by a pebble. In a new study, Rice University physicists and their collaborators have discovered dra…", "url": "https://phys.org/news/2023-04-physicists-unusual-nickel-based-magnet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/physicists-find-unusua.jpg", "publishedAt": "2023-04-17T20:14:04Z", "content": "Perturbing electron spins in a magnet usually results in excitations called \"spin waves\" that ripple through the magnet like waves on a pond that's been struck by a pebble. In a new study, Rice Unive… [+6314 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "ChatGPT's citation approach may amplify the Matthew Effect in environmental science - Phys.org", "description": "ChatGPT (GPT) has become one of the most talked-about innovations in recent years, with over 100 million users worldwide. However, there is still limited knowledge about the sources of information GPT utilizes. As a result, we carried out a study focusing on …", "url": "https://phys.org/news/2023-04-chatgpt-citation-approach-amplify-matthew.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/chatgpt-cites-the-most.jpg", "publishedAt": "2023-04-17T18:28:02Z", "content": "ChatGPT (GPT) has become one of the most talked-about innovations in recent years, with over 100 million users worldwide. However, there is still limited knowledge about the sources of information GP… [+2559 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jordan Mendoza", "title": "Asteroid hits Earth hours after being spotted, meteor turns into 'beautiful' fireball over Europe - Phys.org", "description": "An asteroid hit Earth hours after it was discovered Monday, turning into a dazzling fireball that was spotted throughout Europe.", "url": "https://phys.org/news/2023-04-asteroid-earth-hours-meteor-beautiful.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/3-asteroid.jpg", "publishedAt": "2023-04-17T18:00:01Z", "content": "An asteroid hit Earth hours after it was discovered Monday, turning into a dazzling fireball that was spotted throughout Europe.\r\nAround 12:18 p.m. ET Sunday, astronomer Krisztián Sárneczky detected … [+2807 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Prof Stephon Alexander", "title": "How one particle could soon rewrite our laws of the Universe - BBC Science Focus Magazine", "description": "The particle that gives all matter mass may have played a key role in the birth of the Universe.", "url": "https://www.sciencefocus.com/news/higgs-boson-cosmic-inflation/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/04/The-expanding-Universe-77bea4b.jpg?resize=960,413", "publishedAt": "2023-04-17T15:24:32Z", "content": "When we look out at the night sky across vast, cosmic distances using our most sensitive and advanced telescopes, we look back in time. Einstein taught us that light has a finite speed; therefore, it… [+5077 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "A Sinkhole Swallowed A Man's Bedroom In 2013. No Trace Of Him Has Been Found - IFLScience", "description": "His brother heard a loud bang and a scream. By the time he got down the hallway, most of the bedroom was gone.", "url": "https://www.iflscience.com/a-sinkhole-swallowed-a-mans-bedroom-in-2013-no-trace-of-him-has-been-found-68484", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68484/aImg/67259/sink-hole-meta.png", "publishedAt": "2023-04-17T15:08:12Z", "content": "A distressing story has resurfaced on Reddit over the last few days, concerning a man who was swallowed up by a sinkhole in Florida on March 1, 2013. \r\nJeff Bush, 37, was asleep when a sinkhole opene… [+2081 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Mysterious 300-million-year-old 'Tully monster' was an invertebrate, scientists say - Daily Mail", "description": "Scientists have been debating the morphology of the 'Tully monster' since the discovery of its fossils in the 1950s. Now, a team at the University of Tokyo say it definitely did not have a backbone.", "url": "https://www.dailymail.co.uk/sciencetech/article-11980927/Mysterious-300-million-year-old-Tully-monster-invertebrate-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/17/11/69909569-0-image-a-51_1681725672462.jpg", "publishedAt": "2023-04-17T13:39:46Z", "content": "A mysterious 300-million-year-old sea creature, known as the 'Tully monster', definitely did not have a backbone, a new study has claimed.\r\nScientists have been debating the morphology of Tullimonstr… [+8589 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Tiny magnetic episodes may have large consequences on the Sun - European Space Agency", "description": null, "url": "https://www.esa.int/ESA_Multimedia/Videos/2023/04/Tiny_magnetic_episodes_may_have_large_consequences_on_the_Sun", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/videos/2023/04/tiny_magnetic_episodes_may_have_large_consequences_on_the_sun/24831872-4-eng-GB/Tiny_magnetic_episodes_may_have_large_consequences_on_the_Sun_pillars.jpg", "publishedAt": "2023-04-17T08:39:36Z", "content": null}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "JWST surpasses Hubble's deepest image ever - Big Think", "description": "With infrared capabilities and image sharpness far beyond Hubble's limits, JWST looked at Hubble's deepest field, revealing so much more.", "url": "https://bigthink.com/starts-with-a-bang/jwst-surpasses-hubbles-deepest-image/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/04/STScI-2023-503b-m-2000x1107-1.jpg?resize=1200,630", "publishedAt": "2023-04-17T06:00:00Z", "content": null}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Simon Sharwood", "title": "Mars Helicopter completes 50th flight, 45 more than NASA planned - The Register", "description": "And sets a Martian height record for good measure", "url": "https://www.theregister.com/2023/04/17/mars_helicopter_ingenuity_50th_flight/", "urlToImage": "https://regmedia.co.uk/2021/04/09/shutetrstock_ingenuity.jpg", "publishedAt": "2023-04-17T03:24:00Z", "content": "NASAs Ingenuity Mars Helicopter was designed to fly just five times, but last week the little rotorcraft that could clocked up its 50th flight in the red planets thin atmosphere.\r\nFlight 50 departed … [+2897 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Intelligence Reveals a Stunning, High-Definition View of M87's Big Black Hole - SciTechDaily", "description": "Astronomers used machine learning to improve the Event Horizon Telescope's first black hole image, aiding in black hole behavior understanding and testing gravitational theories. The new technique, called PRIMO, has potential applications in various fields, i…", "url": "https://scitechdaily.com/artificial-intelligence-reveals-a-stunning-high-definition-view-of-m87s-big-black-hole/", "urlToImage": "https://scitechdaily.com/images/M87-Black-Hole-Comparison-scaled.jpg", "publishedAt": "2023-04-17T02:29:55Z", "content": "ByAlan Boyle, Universe TodayApril 16, 2023\r\nM87 supermassive black hole originally imaged by the EHT collaboration in 2019 (left); and new image generated by the PRIMO algorithm using the same data s… [+4658 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Welcome to Mars! Caltech's Jaw-Dropping, 5.7 Terapixel Virtual Expedition Across the Red Planet - SciTechDaily", "description": "Both scientists and the public can navigate a new global image of the Red Planet that was made at Caltech using data from NASA’s Mars Reconnaissance Orbiter. Caltech has used data from NASA's Mars Reconnaissance Orbiter to create the highest-resolution global…", "url": "https://scitechdaily.com/welcome-to-mars-caltechs-jaw-dropping-5-7-terapixel-virtual-expedition-across-the-red-planet/", "urlToImage": "https://scitechdaily.com/images/Global-CTX-Mosaic-of-Mars.jpg", "publishedAt": "2023-04-16T20:45:08Z", "content": "ByJet Propulsion LaboratoryApril 16, 2023\r\nThe Global CTX Mosaic of Mars allows scientists and the public to explore the planet like never before. It includes different layers of data that can be tur… [+6614 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clearing the Path for CO2 Capture: MIT's Anti-Fouling Breakthrough in Photobioreactor Technology - SciTechDaily", "description": "Applying a small voltage to the walls of algae-growing tanks can prevent cloudy buildup and allow more photosynthesis to happen. Algae grown in transparent tanks or tubes supplied with carbon dioxide can convert the greenhouse gas into other compounds, such a…", "url": "https://scitechdaily.com/clearing-the-path-for-co2-capture-mits-anti-fouling-breakthrough-in-photobioreactor-technology/", "urlToImage": "https://scitechdaily.com/images/Prevent-Fouling-in-Photobioreactors-for-CO2-Capture.jpg", "publishedAt": "2023-04-16T19:30:06Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyApril 16, 2023\r\nA new, inexpensive technology can limit the buildup of algae on the walls of photobioreactors that can help convert carbon di… [+9240 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "We Asked a NASA Scientist: Is There Life on Mars? - SciTechDaily", "description": "Is there life on Mars? There's lots of pieces of evidence that say there was once a huge ocean on Mars and an atmosphere that could have supported life. But there's still a lot of Mars left to explore. There are places that are potentially habitable, like the…", "url": "https://scitechdaily.com/we-asked-a-nasa-scientist-is-there-life-on-mars/", "urlToImage": "https://scitechdaily.com/images/NASA-Perseverance-Rover-Artistic-Rendering-scaled.jpg", "publishedAt": "2023-04-16T14:17:12Z", "content": "ByNASAApril 16, 2023\r\nNASAs Perseverance rover, shown in this artistic rendering, landed at Mars Jezero Crater in February 2021 and started gathering soil samples soon after that. Although Perseveran… [+1408 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Quesst Mission: X-59 Quiet Supersonic Technology Aircraft Gets Its Tail - SciTechDaily", "description": "NASA’s X-59 has undergone final installation of its lower empennage, better known as the tail assembly. This series of images was taken at Lockheed Martin Skunk Works in Palmdale, California. This installation allows the team to continue final wiring and syst…", "url": "https://scitechdaily.com/nasas-quesst-mission-x-59-quiet-supersonic-technology-aircraft-gets-its-tail/", "urlToImage": "https://scitechdaily.com/images/NASA-X-59-Quiet-SuperSonic-Technology-Aircraft.jpg", "publishedAt": "2023-04-16T11:44:11Z", "content": "ByNASAApril 16, 2023\r\nNASAs X-59 Quiet SuperSonic Technology aircraft, or QueSST, is designed to fly faster than the speed of sound without producing a loud, disruptive sonic boom, which is typically… [+4596 chars]"}]}