{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Hackaday"}, "author": "Navarre Bartz", "title": "Biomimetic Building Facades To Reduce HVAC Loads - Hackaday", "description": "Buildings currently consume about 50% of the world’s electricity, so finding ways to reduce the loads they place on the grid can save money and reduce carbon emissions. Scientists at the Univ…", "url": "https://hackaday.com/2023/04/29/biomimetic-building-facades-to-reduce-hvac-loads/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/04/optofluidic.png", "publishedAt": "2023-04-29T08:00:00Z", "content": "Buildings currently consume about 50% of the world’s electricity, so finding ways to reduce the loads they place on the grid can save money and reduce carbon emissions. Scientists at the University o… [+1180 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Biological Brains Outpace AI in Learning, Thanks to Structured Exploration - Neuroscience News", "description": "When it comes to rapid learning, the biological brain seems to have an edge over current AI technology. Scientists worked with different models of reinforcement learning to understand the algorithms that the brain uses to learn. They found that the directed e…", "url": "https://neurosciencenews.com/learning-brain-ai-23132/", "urlToImage": "https://neurosciencenews.com/files/2023/04/ai-brain-learning-neurosicence.jpg", "publishedAt": "2023-04-28T17:52:49Z", "content": "Summary: When it comes to rapid learning, the biological brain seems to have an edge over current AI technology. \r\nScientists worked with different models of reinforcement learning to understand the … [+6638 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Nasa scientists successfully extract oxygen from lunar surface - The News International", "description": "Scientists from Nasa — in a major development in space exploration activities — have been able to extract oxygen from regolith , which will allow space explorers to use the surface of...", "url": "https://www.thenews.com.pk/latest/1064974-nasa-scientists-successfully-extract-oxygen-from-lunar-surface", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-04-28/1064974_104637_updates.jpg", "publishedAt": "2023-04-28T17:40:00Z", "content": "Scientists from Nasa in a major development in space exploration activities have been able to extract oxygen from regolith (lunar soil), which will allow space explorers to use the surface of the moo… [+1639 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Conquering the Abyss: Navy's New DSEND Suit Revolutionizes Deep Sea Diving - SciTechDaily", "description": "The U.S. Navy has tested a revolutionary dive suit system, the Deep Sea Expeditionary with No Decompression (DSEND), which offers enhanced flexibility and safety for deep sea divers. The DSEND suit maintains steady internal pressure, eliminating the risk of d…", "url": "https://scitechdaily.com/conquering-the-abyss-navys-new-dsend-suit-revolutionizes-deep-sea-diving/", "urlToImage": "https://scitechdaily.com/images/US-Navy-Diver-Tests-DSEND-System.jpg", "publishedAt": "2023-04-28T14:30:16Z", "content": "A U.S. Navy diver (center) tests the Office of Naval Research-sponsored Deep Sea Expeditionary with No Decompression (DSEND) system at the Navy Experimental Diving Unit in Florida. DSEND includes a h… [+5179 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "World's first disabled astronaut takes part in flying exercise - BBC News - BBC News", "description": "John McFall is the European Space Agency's first ever para-astronaut.He was selected to study how feasible it is for someone with a physical disability to li...", "url": "https://www.youtube.com/watch?v=2TGEoGaP6BE", "urlToImage": "https://i.ytimg.com/vi/2TGEoGaP6BE/maxresdefault.jpg", "publishedAt": "2023-04-28T12:59:06Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "Russia will continue supporting the International Space Station until 2028 | Engadget - Engadget", "description": "Russia has formally agreed to remain aboard the International Space Station (ISS) until 2028, NASA has announced..", "url": "https://www.engadget.com/russia-will-continue-supporting-the-international-space-station-until-2028-121505126.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/Jk7UDCVyMJdtQhmXgdHcAg--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-04/6f5c5730-e5b4-11ed-84d9-67332f097dff.cf.jpg", "publishedAt": "2023-04-28T12:15:48Z", "content": "Russia has formally agreed to remain aboard the International Space Station (ISS) until 2028, NASA has announced. Yuri Borisov, the Director General of Roscosmos, previously said that the country was… [+1887 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Earth from Space: Blooming California - European Space Agency", "description": "Captured by the Copernicus Sentinel-2 mission on 8 April 2023, this image shows Los Angeles and part of the hinterland in Southern California.", "url": "https://www.esa.int/ESA_Multimedia/Images/2023/04/Earth_from_Space_Blooming_California", "urlToImage": null, "publishedAt": "2023-04-28T08:13:19Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Cluster of asteroids approaching Earth TODAY! From 25 feet to 203 feet, check details - HT Tech", "description": "Cluster of asteroids approaching Earth TODAY From 25 feet to 203 feet check details 5 asteroids with sizes varying from 25 feet to 203 feet have been tracked by NASA approaching Earth. Asteroid 2023 HW1 It will make its extremely close approach to the planet …", "url": "https://tech.hindustantimes.com/web-stories/cluster-of-asteroids-approaching-earth-today-from-25-feet-to-203-feet-check-details-71682662912791.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/28/1600x900/asteroid-field-7646062_1280_1682663234265_1682663238471.jpg/", "publishedAt": "2023-04-28T06:31:58Z", "content": "Photo Credit: Pixabay\r\n 5 asteroids, with sizes varying from 25 feet to 203 feet have been tracked by NASA approaching Earth. \r\nPhoto Credit: Pixabay\r\n Asteroid 2023 HW1  It will make its extremely c… [+1453 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Billions of tons of plasma from the sun are set to hit Earth TODAY - Daily Mail", "description": "Billions of tons of particles released from a massive explosion on the sun Monday is set to hit Earth today. Reports who there is a slight chance the intense stream could trigger blackouts.", "url": "https://www.dailymail.co.uk/sciencetech/article-12020985/Billions-tons-plasma-sun-set-hit-Earth-TODAY.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/27/17/70312273-0-image-a-2_1682614251136.jpg", "publishedAt": "2023-04-27T17:30:55Z", "content": "A massive explosion on the sun's surface this week released billions of tons of plasma that are set to hit Earth today.\r\nThe eruption, known as a coronal mass ejection (CME), shot out from the southw… [+4135 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Self-Building Radio Telescope On The Far Side of The Moon [NIAC 2023] - Fraser Cain", "description": "The FarView Observatory is a NIAC project that's a giant self-building radio telescope on the far side of the Moon. In this interview, I'm discussing the det...", "url": "https://www.youtube.com/watch?v=a99QXRIO1g4", "urlToImage": "https://i.ytimg.com/vi/a99QXRIO1g4/maxresdefault.jpg", "publishedAt": "2023-04-27T16:03:00Z", "content": null}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Deena Theresa", "title": "Rare earth metal discovered for first time in our galaxy's hottest exoplanet atmosphere - Interesting Engineering", "description": "KELT-9, which has an average temperature of 4,000 degrees Celsius, orbits its distant star about 670 light years from Earth.", "url": "https://interestingengineering.com/science/rare-earth-metal-galaxys-exoplanets", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/27/image/jpeg/tHpBV44Uq31ZIoQ36EB2cXHhGYipZ6dF9DZqB8oe.jpg", "publishedAt": "2023-04-27T15:13:00Z", "content": "\"Detecting heavy elements in the atmospheres of ultra-hot exoplanets is another step towards learning how the atmospheres of planets work. The better we get to know these planets, the greater chance … [+1419 chars]"}, {"source": {"id": null, "name": "Iai.tv"}, "author": null, "title": "Dark energy is the product of quantum universe interaction | Artyom Yurov and Valerian Yurov - IAI", "description": "Quantum objects make up classical objects. But the two behave very differently. The collapse of the wave-function prevents classical objects from doing the weird things quantum objects do; like quantum entanglement or quantum tunneling. Is the universe as a w…", "url": "https://iai.tv/articles/dark-energy-is-the-product-of-quantum-universe-interaction-artyom-yurov-valerian-yurov-auid-2467", "urlToImage": "", "publishedAt": "2023-04-27T15:09:13Z", "content": "Quantum objects make up classical objects. But the two behave very differently. The collapse of the wave-function prevents classical objects from doing the weird things quantum objects do; like quant… [+19175 chars]"}]}