{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Venus Rotates, Slowly, Despite Sun’s Powerful Gravitational Pull - SciTechDaily", "description": "The planet’s atmosphere explains the gravity of the situation. Venus, Earth’s sister planet would likely not rotate, if not for its soupy, fast-moving atmosphere. Instead, Venus would be fixed in place, always facing the sun the way the same side of the moon …", "url": "https://scitechdaily.com/why-venus-rotates-slowly-despite-suns-powerful-gravitational-pull/", "urlToImage": "https://scitechdaily.com/images/Venus-in-Transit.jpg", "publishedAt": "2022-04-25T09:29:23Z", "content": "ByUniversity of California - RiversideApril 25, 2022\r\nA sequence of images from Solar Dynamic Observatory in 171 angstroms of the Venus transit, merged together to show the path of Venus across the s… [+2201 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ganymede Casts a Massive Shadow Across Jupiter in Spectacular New Image From NASA’s Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft captured this magnificent view of Jupiter during the mission’s 40th close pass by the giant planet on February 25, 2022. The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede. Citizen scientist Thomas …", "url": "https://scitechdaily.com/ganymede-casts-a-massive-shadow-across-jupiter-in-spectacular-new-image-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-04-25T04:21:29Z", "content": "Figure 1. Citizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was about 44,000 … [+2849 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}]}