{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Ynetnews"}, "author": "Yogev Israely", "title": "Book-shaped rock photographed on Mars - Ynetnews", "description": "Curiosity rover photographs a rock on Mars called Terra Firme, which is shaped like an open book, formed naturally by erosion due to water seeping through crevices and powerful winds", "url": "https://www.ynetnews.com/health_science/article/r1s5sva42", "urlToImage": "https://ynet-pic1.yit.co.il/picserver5/crop_images/2023/05/11/rk48gAvcN3/rk48gAvcN3_0_0_1000_659_0_large.jpg", "publishedAt": "2023-05-14T18:30:09Z", "content": "NASA's Curiosity Mars rover took a close-up picture of a rock nicknamed Terra Firme, whose shape resembles an open book. The picture was taken with a specialized camera called the Mars Hand Lens Imag… [+1928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Google Quantum AI Braids Non-Abelian Anyons – A Breakthrough That Could Revolutionize Quantum Computing - SciTechDaily", "description": "Google Quantum AI has observed non-Abelian anyons for the first time, a breakthrough that could revolutionize quantum computing by making it more robust to noise and leading to topological quantum computation. Our intuition tells us that it should be impossib…", "url": "https://scitechdaily.com/?p=277928", "urlToImage": "https://scitechdaily.com/images/Non-Abelian-Braiding.jpg", "publishedAt": "2023-05-14T16:25:01Z", "content": "ByGoogle Quantum AIMay 14, 2023\r\nResearchers were able to observe the curious effects of braiding non-Abelian anyons for the first time. Credit: Google Quantum AI\r\nGoogle Quantum AI has observed non-… [+5697 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Joseph Long", "title": "Artemis II Will Phone Home From The Moon Using Laser Beams - Hackaday", "description": "[NASA] Astronauts will be testing the Orion Artemis II Optical Communications System (O2O) to transmit live, 4K ultra-high-definition video back to Earth from the Moon. The system will also support…", "url": "https://hackaday.com/2023/05/14/artemis-ii-will-phone-home-from-the-moon-using-laser-beams/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/Artemis-2-Laser.png", "publishedAt": "2023-05-14T11:00:00Z", "content": "[NASA] Astronauts will be testing the Orion Artemis II Optical Communications System (O2O) to transmit live, 4K ultra-high-definition video back to Earth from the Moon. The system will also support c… [+1378 chars]"}, {"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "Astronaut now on space station recalls Skylab launch 50 years ago - collectSPACE.com", "description": "Stephen Bowen remembers seeing Skylab fly overhead. At eight years old, Bowen's experience watching the United States' first space station cross the night sky fueled his interest in spaceflight. Little did he know where that would take him 50 years later.", "url": "http://www.collectspace.com/news/news-051423a-skylab-launch-50th-iss-astronaut-remembers.html", "urlToImage": "http://www.collectspace.com/images/news-051423a-fb.jpg", "publishedAt": "2023-05-14T05:05:15Z", "content": "May 14, 2023\r\n — Stephen Bowen remembers seeing Skylab fly overhead.\r\nAt eight years old, Bowen's experience watching the United States' first space station cross the night sky fueled his interest in… [+2813 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "ESA Juice's RIME Antenna Breaks Free After Some Jiggling And Percussive Action - Hackaday", "description": "After ESA’s Jupiter-bound space probe Juice (Jupiter Icy Moons Explorer) launched on April 14th of this year, it initially looked as if it had squeezed out a refreshingly uneventful deploymen…", "url": "https://hackaday.com/2023/05/13/esa-juices-rime-antenna-breaks-free-after-some-jiggling-and-percussive-action/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/juice_feat.jpg", "publishedAt": "2023-05-14T02:00:00Z", "content": "After ESA’s Jupiter-bound space probe Juice (Jupiter Icy Moons Explorer) launched on April 14th of this year, it initially looked as if it had squeezed out a refreshingly uneventful deployment, until… [+1630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Protein Power Unleashed: Spitrobot Makes Time-Resolved Crystallography Accessible - SciTechDaily", "description": "Spitrobot is a groundbreaking experimental device developed by scientists in Hamburg that simplifies observing protein changes and makes time-resolved crystallography more accessible. This will speed up research in health and disease and allow more research g…", "url": "https://scitechdaily.com/protein-power-unleashed-spitrobot-makes-time-resolved-crystallography-accessible/", "urlToImage": "https://scitechdaily.com/images/Spitrobot.jpg", "publishedAt": "2023-05-13T19:52:52Z", "content": "ByMax Planck Institute for the Structure and Dynamics of MatterMay 13, 2023\r\nScientists from four research institutes in Hamburg have developed the Spitrobot, a groundbreaking experimental setup that… [+5948 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Nancy Atkinson", "title": "New Photos Show Collapsed Chains of Craters on a Martian Volcano - Universe Today", "description": "Most everyone is familiar with Olympus Mons, the largest volcano on Mars and also the largest in the Solar System. But there are several other enormous shield volcanoes on Mars. The second largest is Ascraeus Mons, and new images from ESA’s Mars Express space…", "url": "https://www.universetoday.com/161353/new-photos-show-collapsed-chains-of-craters-on-a-martian-volcano/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/The_flanks_of_Ascraeus_Mons_pillars-scaled.jpg", "publishedAt": "2023-05-13T18:42:26Z", "content": "Most everyone is familiar with Olympus Mons, the largest volcano on Mars and also the largest in the Solar System. But there are several other enormous shield volcanoes on Mars. The second largest is… [+2067 chars]"}, {"source": {"id": null, "name": "Arkeonews.net"}, "author": "oguz kayra", "title": "Particle physics and archeology collaboration uncovers secret Hellenistic underground chamber in Naples - arkeonews", "description": "The ruins of the ancient necropolis of Neapolis, built by the Greeks between the end of the fourth and the beginning of the third century BC, are located about 10 meters beneath modern-day Naples.", "url": "https://arkeonews.net/particle-physics-and-archeology-collaboration-uncovers-secret-hellenistic-underground-chamber-in-naples/", "urlToImage": "https://arkeonews.net/wp-content/uploads/2023/05/Napoli-Necropolis-min-1-e1683999408359.png", "publishedAt": "2023-05-13T17:42:03Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Robin McKie", "title": "Scientists criticise Nasa for scaling back mission to explore beyond Pluto - The Guardian", "description": "Anger at decision to axe the main task of the New Horizons spacecraft to probe the remote Kuiper belt", "url": "https://www.theguardian.com/science/2023/may/13/scientists-criticise-nasa-for-scaling-back-mission-to-explore-beyond-pluto", "urlToImage": "https://i.guim.co.uk/img/media/b8b5f6b8a5c9dd6895b92b984e9a3bffc7676fac/269_0_4562_2739/master/4562.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=24f27f4d12f2bdf8619f0c7d0633c6e3", "publishedAt": "2023-05-13T15:50:00Z", "content": "It may have reached the edge of the solar system and travelled more than 5 billion miles through space, but the New Horizons spacecraft is causing major ripples on Earth. A dispute has erupted betwee… [+4468 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Astronomers say they've seen the largest explosion yet – and we just had to talk to them - The Register", "description": "The culprit: A supermassive black hole, a billion times more massive than the Sun, feeding on a giant gas cloud", "url": "https://www.theregister.com/2023/05/13/astroboffins_have_witnessed_the_largest/", "urlToImage": "https://regmedia.co.uk/2023/05/12/handout_black_hole.jpg", "publishedAt": "2023-05-13T10:24:00Z", "content": "Astronomers have observed the largest explosion yet in space that we're aware of, a years-long event involving a supermassive black hole estimated to be one billion times more massive than the Sun th… [+3267 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Pangenome Breakthrough: A Crystal Clear Image of Human Genomic Diversity - SciTechDaily", "description": "In a major advance, scientists have assembled genomic sequences of 47 people from diverse backgrounds to create a pangenome, which offers a more accurate representation of human genetic diversity than the existing reference genome. This new pangenome will hel…", "url": "https://scitechdaily.com/?p=277594", "urlToImage": "https://scitechdaily.com/images/Human-Genetic-Diversity-Concept-Image.jpg", "publishedAt": "2023-05-13T10:20:19Z", "content": "ByRockefeller UniversityMay 13, 2023\r\nThe Human Pangenome Reference Consortium has made significant progress in creating a more inclusive human reference genome by assembling genomic sequences of 47 … [+17108 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Scientist makes alien weather forecast for distant planet - BBC", "description": "Dr Michael Roman made the observations about the atmospheric conditions on the planet GJ 1214b.", "url": "https://www.bbc.com/news/uk-england-leicestershire-65560562", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/168DB/production/_129697329_planet239.jpg", "publishedAt": "2023-05-13T08:30:29Z", "content": "A scientist's \"alien weather forecast\" for a distant planet has helped a NASA-coordinated team gain a new understanding of it.\r\nDr Michael Roman, from the University of Leicester, made the observatio… [+2549 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Giants Uncovered: Fossil Site Sheds Light on Arthropod Dominance 470 Million Years Ago - SciTechDaily", "description": "New fossil site in Taichoute, Morocco, suggests giant arthropods, up to 2 meters long, dominated the seas 470 million years ago. The site offers new insights into the Fezouata Biota and early life on Earth. A new fossil site in Taichoute, Morocco, reveals tha…", "url": "https://scitechdaily.com/ancient-giants-uncovered-fossil-site-sheds-light-on-arthropod-dominance-470-million-years-ago/", "urlToImage": "https://scitechdaily.com/images/Fezouata-Shale-Fossils.jpg", "publishedAt": "2023-05-13T02:15:01Z", "content": "ByUniversity of ExeterMay 12, 2023\r\nFossils from the Fezouata Shale. From left to right, a non-mineralized arthropod (Marrellomorpha), a palaeoscolecid worm, and a trilobite. Credit: Emmanuel Martin\r… [+5248 chars]"}]}