{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Holes' Glowing Secrets: New Findings Challenge Existing Theories - SciTechDaily", "description": "Cardiff astronomers, along with international partners, have revealed a novel method to investigate how black holes feast. An international team of astronomers has uncovered an entirely new method to investigate the behavior of active black holes. They observ…", "url": "https://scitechdaily.com/black-holes-glowing-secrets-new-findings-challenge-existing-theories/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Powerful-Jet-Illustration.jpg", "publishedAt": "2024-01-13T20:22:54Z", "content": "Astronomers have discovered a new way to analyze active black holes, revealing that their microwave and X-ray emissions are similar across different consumption rates. This insight, which challenges … [+4573 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Are bugs bugging humans or the other way around? Study reveals a few surprises - Phys.org", "description": "Insects and spiders often receive little attention from people, except when we're swatting them away. However, as arthropods—creatures distinguished by a hard exoskeleton and jointed legs— they play an essential role in sustaining the ecosystems humans rely o…", "url": "https://phys.org/news/2024-01-bugs-bugging-humans-reveals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spider.jpg", "publishedAt": "2024-01-13T16:12:14Z", "content": "Insects and spiders often receive little attention from people, except when we're swatting them away. However, as arthropodscreatures distinguished by a hard exoskeleton and jointed legs they play an… [+5602 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Space.com Staff", "title": "This Week In Space podcast: Episode 93 — Does America really want to go back to the moon? - Space.com", "description": "Former NASA Chief Historian Roger Launius reveals the history of America's dedication to moon exploration and what it means today.", "url": "https://www.space.com/this-week-in-space-episode-93-america-and-the-moon", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yBqHAfxEvYbRVEy3oPPjL3-1200-80.jpg", "publishedAt": "2024-01-13T16:09:57Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Chris Packham", "title": "Saturday Citations: The Dark Energy Survey; the origins of colorblindness; the evolution of heads - Phys.org", "description": "The Dark Energy Survey took an entire decade to produce a value for the cosmological constant—and it's smaller than you might think! There were other stories as well, including one about primeval black holes, and because I am inescapably drawn by the relentle…", "url": "https://phys.org/news/2024-01-saturday-citations-dark-energy-survey.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/saturday-citations-the.jpg", "publishedAt": "2024-01-13T14:00:01Z", "content": "The Dark Energy Survey took an entire decade to produce a value for the cosmological constantand it's smaller than you might think! There were other stories as well, including one about primeval blac… [+5018 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "Martin Hodás", "title": "Elon Musk has finally revealed the reason behind Starship mid-flight explosion - Neowin", "description": "The November test flight of SpaceX&#039;s Starship rocket, although successful, ended in flames. Much was speculated on social media about the cause, but only now we finally know what actually happened.", "url": "https://www.neowin.net/news/elon-musk-has-finally-revealed-the-reason-behind-starship-mid-flight-explosion/", "urlToImage": "https://cdn.neowin.com/news/images/uploaded/2024/01/1705138135_starship_ift-2_explanation_ico_story.jpg", "publishedAt": "2024-01-13T11:20:00Z", "content": "The second integrated test flight of the biggest space rocket that mankind ever built, SpaceXs Starship, was a huge success. It roared to the sky in mid-November from Boca Chica in Texas, cleared the… [+2477 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Elisha Sauers", "title": "SpaceX says refueling its Starship in space won't be scary - Mashable", "description": "Here's how they'll fill'er up with 11 tons of propellant in orbit.", "url": "https://mashable.com/article/spacex-starship-propellant-transfer", "urlToImage": "https://helios-i.mashable.com/imagery/articles/0325nbFUKaNWn3iFEImoIPj/hero-image.fill.size_1200x675.v1704914004.webp", "publishedAt": "2024-01-13T11:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Fossil Discovery Sheds Light on Tyrannosaurus Rex's Earliest Known Relative - SciTechDaily", "description": "Restudy of fossils collected in New Mexico digs up key clues about T. rex’s origins in North America. A new study published in Scientific Reports reshapes our understanding of how the most famous dinosaur to ever walk the earth – Tyrannosaurus rex – first arr…", "url": "https://scitechdaily.com/new-fossil-discovery-sheds-light-on-tyrannosaurus-rexs-earliest-known-relative/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-mcraeensis-Reconstruction.jpg", "publishedAt": "2024-01-13T09:05:05Z", "content": "Reconstruction of Tyrannosaurus mcraeensis. Credit: Sergei Krasinski, edited\r\nRestudy of fossils collected in New Mexico digs up key clues about T. rex’s origins in North America.\r\nA new study publis… [+5736 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Stellar Sleuthing: Unlocking the Secrets of a “Hot Saturn” and Its Spotted Star - SciTechDaily", "description": "Astronomers used the JWST to study the atmosphere of the exoplanet HAT-P-18 b, finding water vapor and CO2 while emphasizing the impact of the host star's characteristics on data analysis. Led by researchers from Université de Montréal's Trottier Institute fo…", "url": "https://scitechdaily.com/webbs-stellar-sleuthing-unlocking-the-secrets-of-a-hot-saturn-and-its-spotted-star/", "urlToImage": "https://scitechdaily.com/images/Hot-Saturn-Exoplanet-Art-Concept.jpg", "publishedAt": "2024-01-13T03:58:22Z", "content": "Astronomers analyzed HAT-P-18 b using the James Webb Space Telescope, revealing water vapor and CO2 in its atmosphere. They highlighted the challenges of distinguishing between atmospheric and stella… [+6723 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Tomaswick", "title": "Solar electric propulsion systems could be just what we need for efficient trips to Mars - Phys.org", "description": "There are many different ways to get to Mars, but there are always tradeoffs. Chemical propulsion, proven the most popular, can quickly get a spacecraft to the red planet. But they come at a high cost of bringing their fuel, thereby increasing the mission's o…", "url": "https://phys.org/news/2024-01-solar-electric-propulsion-efficient-mars.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/solar-electric-propuls.jpg", "publishedAt": "2024-01-12T19:07:03Z", "content": "There are many different ways to get to Mars, but there are always tradeoffs. Chemical propulsion, proven the most popular, can quickly get a spacecraft to the red planet. But they come at a high cos… [+4699 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Megan Watzke", "title": "Astronomers find spark of star birth across billions of years - Phys.org", "description": "Astronomers have completed the largest and most detailed study of what triggers stars to form in the universe's biggest galaxies, using NASA's Chandra X-ray Observatory and other telescopes. They were surprised to find that the conditions for stellar concepti…", "url": "https://phys.org/news/2024-01-astronomers-star-birth-billions-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/astronomers-find-spark.jpg", "publishedAt": "2024-01-12T18:39:04Z", "content": "Astronomers have completed the largest and most detailed study of what triggers stars to form in the universe's biggest galaxies, using NASA's Chandra X-ray Observatory and other telescopes. They wer… [+6109 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Study uncovers potential origins of life in ancient hot springs - Phys.org", "description": "Newcastle University research turns to ancient hot springs to explore the origins of life on Earth.", "url": "https://phys.org/news/2024-01-uncovers-potential-life-ancient-hot.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/study-uncovers-potenti.jpg", "publishedAt": "2024-01-12T17:49:10Z", "content": "Newcastle University research turns to ancient hot springs to explore the origins of life on Earth.\r\nThe research team investigated how the emergence of the first living systems from inert geological… [+4405 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Peter Crockford", "title": "How much life has ever existed on Earth? - Phys.org", "description": "All organisms are made of living cells. While it is difficult to pinpoint exactly when the first cells came to exist, geologists' best estimates suggest at least as early as 3.8 billion years ago. But how much life has inhabited this planet since the first ce…", "url": "https://phys.org/news/2024-01-life-earth.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/1-earth.jpg", "publishedAt": "2024-01-12T14:44:05Z", "content": "All organisms are made of living cells. While it is difficult to pinpoint exactly when the first cells came to exist, geologists' best estimates suggest at least as early as 3.8 billion years ago. Bu… [+5798 chars]"}, {"source": {"id": null, "name": "Dailynous.com"}, "author": null, "title": "Solidarity among Philosophers Leads to New Journal: Political Philosophy - Daily Nous", "description": "Philosophers may be known for disagreeing with each another, but an agreement last year by a thousand of them helped lead to the creation of a new journal and a cautionary tale to publishers about the importance of editorial independence and academic freedom.…", "url": "https://dailynous.com/2024/01/12/solidarity-among-philosophers-leads-to-new-journal-political-philosophy/", "urlToImage": "https://dailynous.com/wp-content/uploads/2024/01/shahn-ben-phoenix-1024x729.jpg", "publishedAt": "2024-01-12T14:00:48Z", "content": "Philosophers may be known for disagreeing with each another, but an agreement last year by a thousand of them helped lead to the creation of a new journal and a cautionary tale to publishers about th… [+5004 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Hagfish genome elucidates vertebrate whole-genome duplication events and their evolutionary consequences - Nature.com", "description": "Analysis of a newly sequenced genome of the inshore hagfish, Eptatretus burgeri, together with genomes of lampreys and jawed vertebrates, provides insights into whole-genome duplication events and their implications for vertebrate genome evolution.", "url": "https://www.nature.com/articles/s41559-023-02299-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41559-023-02299-z/MediaObjects/41559_2023_2299_Fig1_HTML.png", "publishedAt": "2024-01-12T10:33:23Z", "content": null}]}