{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Patagotitan: Colossal dinosaur heading for UK display - BBC", "description": "A cast of what may be the biggest ever dinosaur - 70-tonne Patagotitan - will go on show in London.", "url": "https://www.bbc.co.uk/news/science-environment-63741208", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1334F/production/_87817687_87817686.jpg", "publishedAt": "2022-11-28T01:21:19Z", "content": "A replica of what could have been the largest animal ever to walk on land is coming to London in the New Year.\r\nA cast of the sauropod dinosaur known as Patagotitan will go on show at the Natural His… [+3562 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Science Textbooks Wrong? 525-Million-Year-Old Fossil Defies Common Explanation for Brain Evolution - SciTechDaily", "description": "According to a new study, fossils of a tiny sea creature with a delicately preserved nervous system solve a century-old debate over how the brain evolved in arthropods, the most species-rich group in the animal kingdom. Fossils of a tiny sea creature that die…", "url": "https://scitechdaily.com/?p=228334", "urlToImage": "https://scitechdaily.com/images/Armored-Lobopodian-Cardiodictyon-catenulum-Reconstruction.jpg", "publishedAt": "2022-11-27T20:08:26Z", "content": "Artists impression of an individual 525-million-year-old Cardiodictyon catenulum on the shallow coastal sea floor, emerging from the shelter of a small stromatolite built by photosynthetic bacteria. … [+7318 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Artemis I – Orion Spacecraft Surpasses Apollo 13 Record Distance From Earth - SciTechDaily", "description": "On day 11 of the Artemis I mission, Orion continues its journey beyond the Moon after entering a distant retrograde orbit on Friday, November 25, at 3:52 p.m. CST. Orion will remain in this orbit for six days before exiting lunar orbit to put the spacecraft o…", "url": "https://scitechdaily.com/nasa-artemis-i-orion-spacecraft-surpasses-apollo-13-record-distance-from-earth/", "urlToImage": "https://scitechdaily.com/images/Orion-Looks-Back-at-Earth-scaled.jpg", "publishedAt": "2022-11-27T11:04:24Z", "content": "On flight day 11, NASAS Orion spacecraft captured imagery looking back at the Earth from a camera mounted on one of its solar arrays. The spacecraft is currently in a distant retrograde orbit around … [+2415 chars]"}, {"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "What Could Go Wrong?! 48500-Year-Old Siberian Virus is Revived - Ancient Origins", "description": "The world’s oldest known frozen and dormant virus has been revived in a French laboratory leading many to express concerns about the dangers of bringing to life ancient microbes.", "url": "https://www.ancient-origins.net/news-science-space/siberian-virus-0017581", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/Siberian-virus.jpg", "publishedAt": "2022-11-26T22:02:00Z", "content": "The worlds oldest known frozen and dormant virus has been revived in a French laboratory leading many to express concerns about the dangers of bringing to life ancient microbes. The virus was removed… [+7839 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nicholas R. Longrich", "title": "What if the dinosaurs hadn't gone extinct? Why our world might look very different - Phys.org", "description": "Sixty-six million years ago, an asteroid hit the Earth with the force of 10 billion atomic bombs and changed the course of evolution. The skies darkened and plants stopped photosynthesising. The plants died, then the animals that fed on them. The food chain c…", "url": "https://phys.org/news/2022-11-dinosaurs-hadnt-extinct-world.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/what-if-the-dinosaurs.jpg", "publishedAt": "2022-11-26T17:10:01Z", "content": "Sixty-six million years ago, an asteroid hit the Earth with the force of 10 billion atomic bombs and changed the course of evolution. The skies darkened and plants stopped photosynthesising. The plan… [+6683 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Sinead Butler", "title": "Scientists created a mini black hole and it started radiating - indy100", "description": "Scientists have managed to simulate their very own black hole in their lab and witnessed how it began to glow.The black hole event horizon was created by a team of physicists from the University of Amsterdam, who used a chain of atoms in a single file to gain…", "url": "https://www.indy100.com/science-tech/scientists-created-mini-black-hole-2658785515", "urlToImage": "https://www.indy100.com/media-library/astronomers-detect-mysterious-star-that-defies-black-hole-theory.jpg?id=32126757&width=1200&height=600&coordinates=0%2C95%2C0%2C259", "publishedAt": "2022-11-26T14:11:41Z", "content": "Scientists have managed to simulate their very own black hole in their lab and witnessed how it began to glow.\r\nThe black hole event horizon was created by a team of physicists from the University of… [+2240 chars]"}]}