{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Satellite powered by 48 AA batteries and a $20 microprocessor shows a low-cost way to reduce space junk - Phys.org", "description": "Common sense suggests that space missions can only happen with multimillion-dollar budgets, materials built to withstand the unforgiving conditions beyond Earth's atmosphere, and as a result of work done by highly trained specialists.", "url": "https://phys.org/news/2023-03-satellite-powered-aa-batteries-microprocessor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/satellite-shows-a-low.jpg", "publishedAt": "2023-03-16T18:10:02Z", "content": "Common sense suggests that space missions can only happen with multimillion-dollar budgets, materials built to withstand the unforgiving conditions beyond Earth's atmosphere, and as a result of work … [+8514 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Stephanie Pappas", "title": "Watch 'unprecedented' animation showcasing 100 million years of Earth history - Livescience.com", "description": "A new model shows how the planet's surface evolved over the past 100 million years, from the shifting of tectonic plates to the movement of sediments.", "url": "https://www.livescience.com/watch-unprecedented-animation-showcasing-100-million-years-of-earth-history", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3zZyZUWxXDvbV3zZjnKxiU-1200-80.jpg", "publishedAt": "2023-03-16T16:21:30Z", "content": "New \"unprecedented\" animations of the Earth show how the planet's surface has shifted and changed over the past 100 million years. \r\nThese animations are the most detailed view of the history of Eart… [+3791 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Anthony Wood", "title": "Webb Spots Rare Star Destined To Die In Dramatic Supernova Explosion - IGN", "description": "The James Webb Space Telescope has spotted a rare gigantic star in the final stage of its life prior to going supernova.", "url": "https://www.ign.com/articles/webb-spots-rare-star-destined-to-die-in-dramatic-supernova-explosion", "urlToImage": "https://assets-prd.ignimgs.com/2023/03/16/stsci-01gtyana7snwzaftfrdhqb8chd-thumbnail-1678979379273.png?width=1280", "publishedAt": "2023-03-16T16:17:49Z", "content": "NASAs James Webb Space Telescope (JWST) has captured an image of a gigantic star 30 times the mass of our Sun that has entered the final stage of its life prior to exploding in a spectacular supernov… [+1922 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "2 pairs of gigantic runaway black holes spotted on collision course, and they're bringing four entire galaxies with them - Livescience.com", "description": "Astronomers used NASA's Chandra X-ray Observatory to spot two pairs of gigantic black holes set for two separate, first-of-their-kind collisions.", "url": "https://www.livescience.com/2-pairs-of-gigantic-runaway-black-holes-spotted-on-collision-course-and-theyre-bringing-four-entire-galaxies-with-them", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pGh9xs3cKhRS2AfR3HYRQA-1200-80.jpg", "publishedAt": "2023-03-16T15:35:46Z", "content": "Two pairs of gigantic black holes, each in a different dwarf galaxy, are speeding towards each other, and they're set for two separate, never-before-seen collisions.\r\nAstronomers used NASA's Chandra … [+4065 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": null, "title": "We Used To Think Diamonds Were Everywhere. New Research Suggests They've Always Been Rare - IFLScience", "description": "Diamonds are actually rarer than we thought but a good way to find them is to follow their purple pals.", "url": "https://www.iflscience.com/we-used-to-think-diamonds-were-everywhere-new-research-suggests-theyve-always-been-rare-68002", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68002/aImg/66466/rhodolite-meta.jpg", "publishedAt": "2023-03-16T12:08:50Z", "content": "New research is shedding light on the tumultuous processes that give rise to diamonds, by homing in on a distinct purple companion found alongside them.\r\nDiamonds are highly prized for their qualitie… [+5122 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Extraordinary “Rapunzel” Virus: An Evolutionary Marvel - SciTechDaily", "description": "Extremely long tail provides a window into how bacteria-infecting viruses assemble. A recent study in the Journal of Biological Chemistry has revealed the secret behind an evolutionary marvel: a bacteriophage with an extremely long tail. This extraordinary ta…", "url": "https://scitechdaily.com/?p=260912", "urlToImage": "https://scitechdaily.com/images/Bacteriophage-P74-26-Structure-Illustration.jpg", "publishedAt": "2023-03-16T09:35:08Z", "content": "ByAmerican Society for Biochemistry and Molecular BiologyMarch 16, 2023\r\nBacteriophage P74-26 structure illustration. Phage tails come in varying lengths and styles. The P74-26 bacteriophage has a ta… [+4855 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Modern glacier remains found near Mars equator suggest water ice possibly present today at low latitudes - Phys.org", "description": "In a groundbreaking announcement at the 54th Lunar and Planetary Science Conference held in The Woodlands, Texas, scientists revealed the discovery of a relict glacier near the equator of Mars. Located in Eastern Noctis Labyrinthus at coordinates 7° 33' S, 93…", "url": "https://phys.org/news/2023-03-modern-glacier-mars-equator-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/modern-glacier-remains.jpg", "publishedAt": "2023-03-15T18:37:49Z", "content": "In a groundbreaking announcement at the 54th Lunar and Planetary Science Conference held in The Woodlands, Texas, scientists revealed the discovery of a relict glacier near the equator of Mars. Locat… [+6072 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "In situ structure of the red algal phycobilisome–PSII–PSI–LHC megacomplex - Nature.com", "description": "In situ structures of PBS–PSII–PSI–LHC megacomplexes from the alga P. purpureum at near-atomic resolution using cryogenic-electron tomography and in situ single-particle analysis are reported, providing interaction details between PBS, PSII and PSI.", "url": "https://www.nature.com/articles/s41586-023-05831-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-023-05831-0/MediaObjects/41586_2023_5831_Fig1_HTML.png", "publishedAt": "2023-03-15T16:46:46Z", "content": "<li>Glazer, A. N. Light harvesting by phycobilisomes. Annu. Rev. Biophys. Biophys. Chem.14, 4777 (1985).\r\nArticle \r\n CAS \r\n PubMed \r\nGoogle Scholar \r\n</li><li>Croce, R. &amp; van Amerongen, H. Natura… [+15002 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "'Spell-checker for statistics' reduces errors in the psychology literature - Nature.com", "description": "Developed to detect statistical errors, statcheck reduces mistakes in reported P values by up to 4.5-fold.", "url": "https://www.nature.com/articles/d41586-023-00788-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00788-6/d41586-023-00788-6_24084974.jpg", "publishedAt": "2023-03-15T16:42:59Z", "content": "Illustration by The Project Twins\r\nA free-to-use tool designed to detect statistical errors is significantly reducing the number of mistakes creeping into papers, suggests a study published this Janu… [+3048 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Charlene Badasie", "title": "NASA Planning To Destroy The International Space Station? - Giant Freakin Robot", "description": "After launching 25 years ago, NASA is now planning to completely destroy the International Space Station. Here's how they plan to do it.", "url": "https://www.giantfreakinrobot.com/sci/nasa-destroying-international-space-station.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2014/04/ISS.jpg", "publishedAt": "2023-03-15T15:28:13Z", "content": "NASA is developing a spacecraft capable of pulling the International Space Station to a controlled destruction point in Earths atmosphere.\r\nNASA wants to develop a spacecraft capable of pulling the I… [+3200 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "Firefly gets nod from NASA to deliver Lunar Pathfinder to the Moon - The Register", "description": "LuSEE in the sky with ... data", "url": "https://www.theregister.com/2023/03/15/firefly_gets_nod_from_nasa/", "urlToImage": "https://regmedia.co.uk/2023/03/15/firefly-lunar-pathfinder.jpg", "publishedAt": "2023-03-15T14:40:00Z", "content": "Firefly Aerospace has won a second NASA contract to take hardware to the Moon including the hotly anticipated Lunar Pathfinder satellite that will serve as a communication relay between future Lunari… [+4203 chars]"}]}