{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Oldest Planetary Debris in Our Galaxy – Remnants of Destroyed Solar System - SciTechDaily", "description": "A new study puts an age to a faint white dwarf star of over ten billion years Engulfed remains of recently orbiting planetesimals make this the oldest dead star with an evolved planetary system Provides insight into the formation and evolution of asteroids, i…", "url": "https://scitechdaily.com/astronomers-discover-oldest-planetary-debris-in-our-galaxy-remnants-of-destroyed-solar-system/", "urlToImage": "https://scitechdaily.com/images/White-Dwarf-Accreting-Debris-scaled.jpg", "publishedAt": "2022-11-09T10:12:55Z", "content": "ByUniversity of WarwickNovember 9, 2022\r\nArtists impression of the old white dwarfs WDJ2147-4035 and WDJ1922+0233 surrounded by orbiting planetary debris, which will accrete onto the stars and pollut… [+7140 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX, NASA batten down the hatches as another storm approaches Florida - TESLARATI", "description": "SpaceX, NASA, and the rest of the Kennedy Space Center (KSC) and Cape Canaveral Space Force Station (CCSFS) are doing what they can to prepare for Tropical Storm Nicole’s imminent arrival. The somewhat unexpected storm grew quickly in recent days and has beco…", "url": "https://www.teslarati.com/spacex-nasa-prepare-for-storm-nicole/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/11/SLS-Artemis-I-LC-39B-launch-attempt-_1-082922-Richard-Angle-F9-LC40-1-c.jpg", "publishedAt": "2022-11-09T00:39:51Z", "content": "SpaceX, NASA, and the rest of the Kennedy Space Center (KSC) and Cape Canaveral Space Force Station (CCSFS) are doing what they can to prepare for Tropical Storm Nicole’s imminent arrival.\r\nThe somew… [+4805 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A study discovers a surprising relationship between the teeth and the evolution of pregnancy - Phys.org", "description": "Humans have the highest prenatal growth rate of all extant primates, but how this exceptional rate came about has been a mystery up to now. Leslea Hlusko, a scientist at the Centro Nacional de Investigación sobre la Evolución Humana (CENIEH), has participated…", "url": "https://phys.org/news/2022-11-relationship-teeth-evolution-pregnancy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/a-study-discovers-a-su.jpg", "publishedAt": "2022-11-08T20:46:03Z", "content": "Humans have the highest prenatal growth rate of all extant primates, but how this exceptional rate came about has been a mystery up to now. Leslea Hlusko, a scientist at the Centro Nacional de Invest… [+3270 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Shaheena Uddin, news reporter", "title": "Rare 'beaver blood moon' marks last total lunar eclipse for three years - Sky News", "description": "", "url": "https://news.sky.com/story/rare-beaver-blood-moon-marks-last-total-lunar-eclipse-for-three-years-12741521", "urlToImage": "https://e3.365dm.com/22/11/1600x900/skynews-beaver-blood-moon-eclipse_5958251.jpg?20221108103519", "publishedAt": "2022-11-08T13:51:09Z", "content": "Stargazers in eastern Asia, Australia, the Pacific and North America were treated to a rare \"beaver blood moon\" on Tuesday in the last total lunar eclipse for three years.\r\nTotal lunar eclipses usual… [+931 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Mysterious blue 'aurora' spotted over Lapland is 'unlike anything ever seen' - Daily Mail", "description": "Swedish skywatchers first thought the phenomenon was a strange kind of aurora but as they continued to stare the blue light remained stationary, while the green aurora danced around it.", "url": "https://www.dailymail.co.uk/sciencetech/article-11399729/Mysterious-blue-aurora-spotted-Lapland-unlike-seen.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/08/10/64306145-0-image-a-6_1667903889922.jpg", "publishedAt": "2022-11-08T10:49:48Z", "content": "As beautiful as they are mysterious, these images capture a blue ribbon of light which lit up a small Lapland village and left locals bemused.\r\nSwedish skywatchers first thought the phenomenon was a … [+8020 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A structural biology community assessment of AlphaFold2 applications - Nature.com", "description": "Here, the authors evaluate the performance of AlphaFold2 and its predicted structures on common structural biological applications, including missense variants, function and ligand binding site prediction, modeling of interactions and modeling of experimental…", "url": "https://www.nature.com/articles/s41594-022-00849-w", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41594-022-00849-w/MediaObjects/41594_2022_849_Fig1_HTML.png", "publishedAt": "2022-11-07T16:13:49Z", "content": "Added structural coverage by AlphaFold2 predictions of model proteomes\r\nThe AF2 database has released predictions of the canonical protein isoforms for 21 model species, covering nearly every residue… [+35654 chars]"}]}