{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Evidence That Giant Asteroid Impacts Created the Continents - SciTechDaily", "description": "New research has uncovered the strongest evidence yet that Earth’s continents were formed by giant meteorite impacts, which were especially common during the first billion years or so of our planet’s four-and-a-half-billion-year history. Curtin University res…", "url": "https://scitechdaily.com/new-evidence-that-giant-asteroid-impacts-created-the-continents/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Collision-Earth-Impact.jpg", "publishedAt": "2022-08-13T10:43:59Z", "content": "Evidence that Earths continents were formed by giant meteorite impacts has been uncovered in new research.\r\nNew research has uncovered the strongest evidence yet that Earths continents were formed by… [+2565 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Mars enters the evening sky tonight, here's how to find the Red Planet - Space.com", "description": "The Red Planet will be visible along with Jupiter, Saturn and Uranus.", "url": "https://www.space.com/mars-planet-evening-sky-lineup-august-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2mHSn4UMnhs37MawhKt8em-1200-80.jpg", "publishedAt": "2022-08-13T10:00:06Z", "content": "The Red Planet is finally rising before midnight.\r\nMars will start showing up in the evening sky Saturday (Aug. 13), although finding it will be tough for the first few days. The upshot, however, is … [+1882 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Mikhaila Friel", "title": "Why I'll never go back to countryside after move to Glasgow, Scotland - Insider", "description": "Insider's Mikhaila Friel recently moved to Glasgow, the Scottish city that was named one of the coolest in the world by Time Out.", "url": "https://www.insider.com/moved-to-glasgow-scotland-after-countryside-photos-2022-8", "urlToImage": "https://i.insider.com/62f4eb9dcc15bf00182fe487?width=1200&format=jpeg", "publishedAt": "2022-08-13T09:20:45Z", "content": null}, {"source": {"id": null, "name": "Airlive.net"}, "author": "AIRLIVE", "title": "A Russian spy satellite has been launched at the exact moment the mysterious American USA-326 passed over the cosmodrome - AIRLIVE", "description": "On Monday August 1 , a rocket took off in the middle of the night from the Plesetsk cosmodrome in northern Russia. Its mission, to place the military satellite Kosmos-2558 in orbit. If its precise role is kept secret, it is very likely that it is a spy satell…", "url": "https://www.airlive.net/a-russian-spy-satellite-has-been-launched-at-the-exact-moment-the-mysterious-american-usa-326-passed-over-the-cosmodrome/", "urlToImage": "https://www.airlive.net/wp-content/uploads/2022/08/IMG_9265.jpg", "publishedAt": "2022-08-12T16:57:32Z", "content": "Its mission, to place the military satellite Kosmos-2558 in orbit. If its precise role is kept secret, it is very likely that it is a spy satellite: its sensors are not turned towards the Earth, but … [+1592 chars]"}, {"source": {"id": null, "name": "inews"}, "author": "Jaymi McCann", "title": "Why was the moon so big and orange last night? What causes a supermoon and best pictures of Sturgeon full moon - iNews", "description": "A supermoon occurs because the moon moves nearer and further away from the Earth at different points during its elliptic orbit", "url": "https://inews.co.uk/news/science/moon-why-so-big-orange-last-night-what-causes-supermoon-sturgeon-1792279", "urlToImage": "https://wp.inews.co.uk/wp-content/uploads/2022/08/SEI_118987401-e1660310114807.jpg", "publishedAt": "2022-08-12T13:18:00Z", "content": "If you were wondering why Thursday nights moon was so large and dazzling youre not along.\r\nThursday 12 August saw a supermoon, a rare phenomenon that makes the moon look bigger and change colour in t… [+3967 chars]"}, {"source": {"id": null, "name": "Daily Record"}, "author": "Danni Scott", "title": "Here's the best time to see the Perseid meteor shower in the UK - Daily Record", "description": "One of the biggest celestial marvels of the year is the Perseid Meteor Shower and you can watch it tonight and tomorrow", "url": "https://www.dailyrecord.co.uk/news/science-technology/best-time-perseid-meteor-shower-27724907", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article27687341.ece/ALTERNATES/s1200/0_JS96294295.jpg", "publishedAt": "2022-08-12T13:15:00Z", "content": "After four months of supermoons, stargazers will be treated to another space spectacle - the Perseid meteor shower. This annual event takes place over three days, although this year it is harder to s… [+1872 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Sees Red Supergiant Star Betelgeuse Recovering After Never-Seen-Before Titanic Eruption - SciTechDaily", "description": "Monster Star Had Never-Seen-Before Titanic Eruption Betelgeuse, a red supergiant star, appears as a brilliant, ruby-red, twinkling spot of light in the upper right shoulder of the winter constellation Orion the Hunter. However, when viewed close up, astronome…", "url": "https://scitechdaily.com/hubble-sees-red-supergiant-star-betelgeuse-recovering-after-never-seen-before-titanic-eruption/", "urlToImage": "https://scitechdaily.com/images/Betelgeuse-Southern-Region-Evolving.gif", "publishedAt": "2022-08-12T08:47:26Z", "content": "BySpace Telescope Science InstituteAugust 12, 2022\r\nThis graphic illustrates how the southern region of the rapidly evolving, bright, red supergiant star Betelgeuse may have suddenly become fainter f… [+8655 chars]"}]}