{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Strange new type of solar wave defies physics - Livescience.com", "description": "Scientists think this could also help to explain mysterious phenomena on Earth.", "url": "https://www.livescience.com/solar-waves-moving-too-fast", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2oyRVsMEcb3GxEhQPKJYdV-1200-80.jpeg", "publishedAt": "2022-03-25T18:51:45Z", "content": "Scientists have detected a strange new type of high-frequency wave on the sun's surface, and the waves are moving three times faster than scientists thought was possible.\r\nThe acoustic waves, called … [+2484 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "New 83 Million Pixel Zoomable Image Of The Sun From Solar Orbiter - IFLScience", "description": "Looking at the Sun in extreme ultraviolet reveals the ever-changing structure in the solar corona, the upper atmosphere of the Sun. This view is now delive", "url": "https://www.iflscience.com/space/new-83-million-pixel-zoomable-image-of-the-sun-from-solar-orbiter/", "urlToImage": "https://cdn.iflscience.com/images/c56585c1-7400-5988-8485-08b4fe2c3612/default-1648210597-cover-image.jpg", "publishedAt": "2022-03-25T15:20:00Z", "content": "Looking at the Sun in extreme ultraviolet reveals the ever-changing structure in the solar corona, the upper atmosphere of the Sun. This view is now delivered in ultra-high-definition thanks to new o… [+1235 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Exclusive: Documents reveal NASA's internal struggles over renaming Webb telescope - Nature.com", "description": "E-mails show agency’s controversial response to astronomers concerned about past LGBT+ discrimination.", "url": "https://www.nature.com/articles/d41586-022-00845-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-00845-6/d41586-022-00845-6_20246884.jpg", "publishedAt": "2022-03-25T13:30:33Z", "content": "Shown here being packed up for shipment to its launch site last year, the James Webb Space Telescope was designed to probe the early Universe.Credit: Chris Gunn/NASA\r\nInternal NASA documents obtained… [+8941 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Chaos Terrains” Could Be Shuttling Oxygen to Ocean on Jupiter's Moon Europa - SciTechDaily", "description": "Salt water within the icy shell of Jupiter’s moon Europa could be transporting oxygen into an ice-covered ocean of liquid water where it could potentially help sustain alien life, according to a team of researchers led by The University of Texas at Austin. Th…", "url": "https://scitechdaily.com/chaos-terrains-could-be-shuttling-oxygen-to-ocean-on-jupiters-moon-europa/", "urlToImage": "https://scitechdaily.com/images/Water-and-Chaos-Terrain-Jupiter-Europa.jpg", "publishedAt": "2022-03-25T08:32:09Z", "content": "An artist’s interpretation of liquid water on the surface of the Europa pooling beneath chaos terrain. Credit: NASA/JPL-Caltech\r\nSalt water within the icy shell of Jupiter’s moon Europa could be tran… [+4928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Boas Save Themselves From Suffocating When Squeezing Their Prey to Death - SciTechDaily", "description": "Boa constrictors breathe with different sections of rib cage when constricting prey and digesting dinner. The later stages of pregnancy can make life difficult as the fetus presses against the diaphragm making it hard to breathe. But snakes that constrict the…", "url": "https://scitechdaily.com/how-boas-save-themselves-from-suffocating-when-squeezing-their-prey-to-death/", "urlToImage": "https://scitechdaily.com/images/Rainbow-Boa.jpg", "publishedAt": "2022-03-25T04:16:19Z", "content": "Boa constrictors breathe with different sections of rib cage when constricting prey and digesting dinner.\r\nThe later stages of pregnancy can make life difficult as the fetus presses against the diaph… [+4003 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Cameron Duke", "title": "'Informational simplicity' may explain why nature favors symmetry - Livescience.com", "description": "Life favors simple structures over complex ones.", "url": "https://www.livescience.com/why-symmetry-common-in-biology", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9jpfQQqvQZfo3RWnDRwuDk-1200-80.jpg", "publishedAt": "2022-03-24T18:15:15Z", "content": "In biology, symmetry is typically the rule rather than the exception. Our bodies have left and right halves, starfish radiate from a central point and even trees, though not largely symmetrical, stil… [+4753 chars]"}]}