{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "NASA's Juno spacecraft snaps its most detailed view of Jupiter's icy moon Europa - Space.com", "description": "The landscape in the image is only illuminated by Jupiter's night glow.", "url": "https://www.space.com/juno-photo-europa-jupiter-moon-most-detail", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9SeJAiyupjK8HAZnmVkBLP-1200-80.jpg", "publishedAt": "2022-10-06T15:00:55Z", "content": "NASA's Jupiter-exploring Juno spacecraft captured its most detailed image of the ice-covered, ocean-bearing moon Europa, which scientists think is one of the likeliest places in the solar system to h… [+4404 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Shivali Best", "title": "How NASA's asteroid smashing technology could save YOU from a painful death - Daily Mail", "description": "But will NASA's asteroid-smashing technology really work if a planet-killing space rock like the six-mile-wide one that wiped out the dinosaurs is about to hit our planet?", "url": "https://www.dailymail.co.uk/news/article-11284265/How-NASAs-asteroid-smashing-technology-save-painful-death.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/06/11/63176291-0-image-a-10_1665053309899.jpg", "publishedAt": "2022-10-06T10:54:45Z", "content": "Do you want to automatically post your MailOnline comments to your Facebook Timeline?\r\nYour comment will be posted to MailOnline as usual\r\n We will automatically post your comment and a link to the n… [+427 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Greenland's future may be written under North Sea - BBC", "description": "Immense valleys smothered by North Sea muds have lessons for ice sheets in a warming world.", "url": "https://www.bbc.com/news/science-environment-63147947", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7006/production/_126987682_greenland.jpg", "publishedAt": "2022-10-05T21:44:23Z", "content": "There are clues to the near-future behaviour of a warming Greenland, and perhaps even a warming Antarctic, buried under the North Sea.\r\nLook below its bottom muds and you will find immense valleys. H… [+4233 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Buncombe", "title": "Meet ‘Amasia’ – the new supercontinent that will be created as the Pacific ocean closes up - The Independent", "description": "Landmasses to come together – but not for two hundred million years", "url": "https://www.independent.co.uk/news/science/amasia-new-continent-pacific-ocean-close-shrink-b2196874.html", "urlToImage": "https://static.independent.co.uk/2022/10/05/19/amasia.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-05T20:23:20Z", "content": "The Pacific Ocean is closing in on itself and will form a new supercontinent called Amasia, according to scientists.\r\nThe experts in Australia say the Pacific Ocean is slowly but consistently getting… [+2575 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "New supercomputer simulation suggests the Moon may have formed in mere hours, not months or years - TechSpot", "description": "One leading theory suggests ancient Earth was hit by an object called Theia that was roughly the size of Mars. It was previously believed that debris from...", "url": "https://www.techspot.com/news/96216-new-supercomputer-simulation-suggests-moon-may-have-formed.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/10/2022-10-05-image-8.jpg", "publishedAt": "2022-10-05T16:36:04Z", "content": "In brief: The Moon is a staple in the night sky, but have you ever stopped to consider how it came to be? Researchers have been asking this question for decades and a new simulation adds an interesti… [+1805 chars]"}, {"source": {"id": null, "name": "Upday.com"}, "author": null, "title": "Asteroid leaves a 10000km trail after being struck by Nasa's Dart spacecraft - upday", "description": "Nasa's DART spacecraft has left a 10,000km trail of broken rocks and debris after crashing into a small asteroid last month.", "url": "https://www.upday.com/uk/asteroid-leaves-a-10-000km-trail-after-being-struck-by-nasas-dart-spacecraft", "urlToImage": null, "publishedAt": "2022-10-05T15:45:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Astronomers spot a pair of stars with shortest orbit detected to date - Daily Mail", "description": "It is one of a rare class of binaries known as a 'cataclysmic variable,' in which a star similar to our sun orbits tightly around a white dwarf, experts at the Massachusetts Institute of Technology say.", "url": "https://www.dailymail.co.uk/sciencetech/article-11283785/Astronomers-spot-pair-stars-shortest-orbit-detected-date.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/05/15/63141227-0-image-a-11_1664981313707.jpg", "publishedAt": "2022-10-05T15:34:45Z", "content": "Astronomers have discovered a pair of stars with such a short orbit they appear to circle each other in just 51 minutes.\r\nThe system seems to be one of a rare class of binaries known as a 'cataclysmi… [+5517 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Jon Kelvey", "title": "Nasa’s Webb and Hubble telescope team up to create astonishing image of a pair of galaxies - The Independent", "description": "By combining observations in different wavelengths of light, the Hubble-Webb team up allowed scientists to see new details in distant galaxies.", "url": "https://www.independent.co.uk/space/nasa-james-webb-hubble-telescope-image-new-b2196173.html", "urlToImage": "https://static.independent.co.uk/2022/10/05/15/Galaxies%20cropped-1.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-05T14:55:58Z", "content": "Whats better than one iconic space telescope? Two iconic space telescopes. \r\nBy combining observations from both the James Webb and Hubble Space Telescopes, Nasa just revealed never before seen detai… [+2177 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanic Super-Eruptions Are Millions of Years in the Making - SciTechDaily", "description": "While the magma supplying super-eruptions develops over long periods of time, the magma disturbs the crust and then erupts in a matter of decades. Super-eruptions happen when enormous magma accumulations deep in the Earth's crust, created over millions of yea…", "url": "https://scitechdaily.com/volcanic-super-eruptions-are-millions-of-years-in-the-making/", "urlToImage": "https://scitechdaily.com/images/Supervolcano-Eruption.gif", "publishedAt": "2022-10-05T13:36:09Z", "content": "A supervolcano is a volcano that has produced an eruption with a Volcanic Explosivity Index of 8, the highest recorded number on the index.\r\nWhile the magma supplying super-eruptions develops over lo… [+3450 chars]"}]}