{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Express"}, "author": "Antony Ashkenaz", "title": "NASA astronauts clash with Russian cosmonauts on ISS: 'We are not the bad guys!' - Express", "description": "CONFLICTS arising from Russia's invasion of Ukraine are beginning to spill over onto space, with tensions growing between NASA astronauts and Russian cosmonauts on board the ISS.", "url": "https://www.express.co.uk/news/science/1615841/nasa-astronauts-russia-roscosmos-cosmonauts-iss-fight-space-rogozin", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/1200x712/1615841_1.jpg", "publishedAt": "2022-05-25T13:09:01Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "5 Bizarre Medical Conditions You've Never Heard Of - SciTechDaily", "description": "You've probably heard of many diseases and health problems that befall humanoids, but there are some strange syndromes out there that you probably aren't familiar with. How many of these unusual medical conditions have you heard of? Exploding Head Syndrome Im…", "url": "https://scitechdaily.com/5-bizarre-medical-conditions-youve-never-heard-of/", "urlToImage": "https://scitechdaily.com/images/Abstract-Disfigured-Man.jpg", "publishedAt": "2022-05-25T12:31:02Z", "content": "Youve probably heard of many diseases and health problems that befall humanoids, but there are some strange syndromes out there that you probably arent familiar with. How many of these unusual medica… [+6022 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Jeff Parsons", "title": "Nasa snaps eruption of underwater volcano home to mutant sharks - Metro.co.uk", "description": "The active underwater Kavachi volcano in the waters off the Solomon Islands is home to at least two known species of shark.", "url": "https://metro.co.uk/2022/05/25/nasa-snaps-eruption-of-underwater-volcano-home-to-mutant-sharks-16706683/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/05/Hammerhead-9d93_1653491312.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-05-25T11:19:00Z", "content": "A scalloped hammerhead shark swimming in the volcanic waters around the Kavachi volcano (Credit: The Oceanography Society)\r\nA Nasa satellite has captured the moment a massive underwater volcano erupt… [+2558 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Hubble telescope spots enormous elliptical galaxy surrounded by mysterious shells - Space.com", "description": "The Hubble Space Telescope imaged the elliptical galaxy NGC 474, which is 2.5 times the size of the Milky Way and boasts complex shell structures.", "url": "https://www.space.com/hubble-telescope-galaxy-strange-shell-layers-photo", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AWz9PBwkqVsD2vCoTbwgYZ-1200-80.jpg", "publishedAt": "2022-05-25T10:37:44Z", "content": "The Hubble Space Telescope imaged the elliptical galaxy NGC 474, which is located approximately 100 million light-years from Earth and is 2.5 times the size of the Milky Way. (Image credit: NASA, ESA… [+2092 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Innovative Diffractive Solar Sail Funded by NASA Could Take Science to Exciting New Destinations - SciTechDaily", "description": "As NASA's exploration continues to push boundaries, a new solar sail concept has been selected by the agency for development toward a demonstration mission that could carry science to new destinations. The Diffractive Solar Sailing project was selected for Ph…", "url": "https://scitechdaily.com/?p=173553", "urlToImage": "https://scitechdaily.com/images/Diffractive-Solar-Sails.jpg", "publishedAt": "2022-05-25T08:46:46Z", "content": "ByNASAMay 25, 2022\r\nDiffractive solar sails, depicted in this conceptual illustration, could enable missions to hard-to-reach places, like orbits over the Suns poles. Credit: MacKenzi Martin\r\nAs NASA… [+5274 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "NASA denies SpaceX Crew Dragon propellant leak report, reveals unrelated heat shield defect - Teslarati", "description": "In a partial response to a report alleging evidence of several significant anomalies during a recent private astronaut launch that could affect a crew of NASA astronauts launched last month, the space agency has issued a statement denying those claims. Howeve…", "url": "https://www.teslarati.com/spacex-crew-dragon-heat-shield-nasa-denies-propellant-leak-report/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/05/Crew-3-Dragon-C210-recovery-050622-NASA-8-crop-c-1024x634.jpg", "publishedAt": "2022-05-24T21:30:32Z", "content": "In a partial response to a report alleging evidence of several significant anomalies during a recent private astronaut launch that could affect a crew of NASA astronauts launched last month, the spac… [+6626 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Skydiving Salamanders Parachute and Glide From the Tallest Trees [High Speed Video] - SciTechDaily", "description": "Salamanders that live their entire lives in the crowns of the world's tallest trees, California's coast redwoods, have evolved a behavior well-adapted to the dangers of falling from great heights: the ability to parachute, glide, and maneuver in mid-air. Flyi…", "url": "https://scitechdaily.com/skydiving-salamanders-parachute-and-glide-from-tallest-trees-high-speed-video/", "urlToImage": "https://scitechdaily.com/images/Skydiving-Salamander.gif", "publishedAt": "2022-05-24T16:15:31Z", "content": "ByUniversity of California - BerkeleyMay 24, 2022\r\nHigh-speed video of an arboreal salamander in a vertical wind tunnel.\r\nSalamanders that live their entire lives in the crowns of the worlds tallest … [+11446 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Controversial Alternative Gravity Theory Revived by New Spin on Galaxy Rotation - SciTechDaily", "description": "An international group of astronomers, led by a physicist at the University of St Andrews, has revived an alternative gravity theory. Headed by Dr. Indranil Banik of the School of Physics and Astronomy at the University of St Andrews, the research revealed a …", "url": "https://scitechdaily.com/controversial-alternative-gravity-theory-revived-by-new-spin-on-galaxy-rotation/", "urlToImage": "https://scitechdaily.com/images/Neutral-Hydrogen-Gas-in-Galaxy-AGC-114905.jpg", "publishedAt": "2022-05-24T09:48:41Z", "content": "ByUniversity of St. AndrewsMay 24, 2022Radio image of the neutral hydrogen gas in the galaxy AGC 114905. Its inclination is estimated from the black ellipse, which fits the data better. Assuming the … [+5312 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "'Dragon of Death' ancient flying reptile is unearthed in Argentina - Daily Mail", "description": "Measuring about 30ft (9m) long, the fossilised remains of Thanatosdrakon amaru were discovered in the Andes mountains in Argentina's western Mendoza province.", "url": "https://www.dailymail.co.uk/sciencetech/article-10848495/Dragon-Death-ancient-flying-reptile-unearthed-Argentina.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/24/10/58213361-0-image-a-47_1653385017245.jpg", "publishedAt": "2022-05-24T09:37:35Z", "content": "The fossilised remains of a huge flying reptile dubbed the 'Dragon of Death'  which lived alongside the dinosaurs 86 millions of years ago  have been unearthed in Argentina.\r\nMeasuring about 30ft (9m… [+4276 chars]"}]}