{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "SpaceX Starship prototype ignites six engines, starts major brush fire - TESLARATI", "description": "SpaceX has successfully ignited all six engines on its latest Starship prototype, taking a significant step towards ensuring that the upper stage will be ready for the rocket’s first orbital launch attempt. Unfortunately, the same successful static fire of a …", "url": "https://www.teslarati.com/spacex-starship-six-engine-test-brush-fire/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/09/Starship-S24-six-Raptor-static-fire-090822-SpaceX-1-crop-c.jpg", "publishedAt": "2022-09-09T04:50:33Z", "content": "SpaceX has successfully ignited all six engines on its latest Starship prototype, taking a significant step towards ensuring that the upper stage will be ready for the rocket’s first orbital launch a… [+6225 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Explosions: New Way To Measure the Distant Universe - SciTechDaily", "description": "Using star-shattering explosions to measure the universe. An multinational team of 23 scientists, led by Maria Dainotti, Assistant Professor at the National Astronomical Observatory of Japan (NAOJ), has analyzed archival data for massive cosmic explosions pro…", "url": "https://scitechdaily.com/cosmic-explosions-new-way-to-measure-the-distant-universe/", "urlToImage": "https://scitechdaily.com/images/Gamma-Ray-Bursts-to-Determine-Space-scaled.jpg", "publishedAt": "2022-09-08T20:56:29Z", "content": "Conceptual image of this research: using Gamma Ray Bursts to determine distance in space. Credit: NAOJ\r\nUsing star-shattering explosions to measure the universe.\r\nAn multinational team of 23 scientis… [+2758 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Damian Carrington", "title": "World on brink of five ‘disastrous’ climate tipping points, study finds - The Guardian", "description": "Giant ice sheets, ocean currents and permafrost regions may already have passed point of irreversible change", "url": "https://amp.theguardian.com/environment/2022/sep/08/world-on-brink-five-climate-tipping-points-study-finds", "urlToImage": null, "publishedAt": "2022-09-08T19:46:00Z", "content": "Climate crisisGiant ice sheets, ocean currents and permafrost regions may already have passed point of irreversible change\r\nThe climate crisis has driven the world to the brink of multiple disastrous… [+5467 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Devlin", "title": "Study reveals striking differences in brains of modern humans and Neanderthals - The Guardian", "description": "Results believed to be first compelling evidence that modern humans were cognitively better than Neanderthals", "url": "https://amp.theguardian.com/science/2022/sep/08/study-reveals-striking-differences-in-brains-of-modern-humans-and-neanderthals", "urlToImage": null, "publishedAt": "2022-09-08T18:13:00Z", "content": "NeanderthalsResults believed to be first compelling evidence that modern humans were cognitively better than Neanderthals\r\nNeanderthals have long been portrayed as our dim-witted, thuggish cousins. N… [+4477 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Mary Beth Griggs", "title": "NASA’s next Artemis 1 launch attempt could be as early as late September - The Verge", "description": "NASA is making repairs at the launchpad as it looks to the next possible launch dates for its Artemis 1 mission. Many things will have to go right for the agency for it to launch later this month.", "url": "https://www.theverge.com/2022/9/8/23342701/nasa-artemis-possible-launch-late-september", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pFDN1BsXskmbWjR-Io_TozfyNxk=/0x279:3900x2321/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24005385/1242985031.jpg", "publishedAt": "2022-09-08T17:39:49Z", "content": "The agency is currently working on repairs and scheduling issues ahead of another launch attempt\r\nThe SLS rocket and Orion spacecraft sit on the launchpad on September 6th, 2022.\r\nPhoto by CHANDAN KH… [+3325 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Stunning new images show the sun's chromosphere in exquisite detail - Daily Mail", "description": "Stunning shots of the sun's chromosphere were taken by the Daniel K. Inouye Solar Telescope, the world's most powerful solar telescope on the island of Maui, Hawaii.", "url": "https://www.dailymail.co.uk/sciencetech/article-11189801/Stunning-new-images-suns-chromosphere-exquisite-detail.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/07/16/62165231-0-image-a-23_1662565130419.jpg", "publishedAt": "2022-09-07T16:28:50Z", "content": "Stunning new images captured by the world's most powerful solar telescope show the face of the sun in astonishing never-before-seen detail. \r\nThe amazing shots, released by the US National Solar Obse… [+5977 chars]"}]}