{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New DNA Research Changes Origin of Human Species - SciTechDaily", "description": "New model for human evolution suggests Homo sapiens arose from multiple closely related populations. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations across Africa, with the earliest …", "url": "https://scitechdaily.com/new-dna-research-changes-origin-of-human-species/", "urlToImage": "https://scitechdaily.com/images/Human-Homo-Sapien-Concept-Art-Illustration.jpg", "publishedAt": "2023-05-18T12:44:46Z", "content": "ByUniversity of California - DavisMay 18, 2023\r\nA new model for human evolution asserts that modern Homo sapiens stemmed from multiple genetically diverse populations across Africa rather than a sing… [+6176 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Day meets night on Earth-sized exoplanet rocked by volcanism - Al Jazeera English", "description": "It is a planet that does not rotate – with one side perpetually in daylight and the other in darkness.", "url": "https://www.aljazeera.com/news/2023/5/18/day-meets-night-on-earth-sized-exoplanet-rocked-by-volcanism", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/05/Exoplanet-1684393218.jpg?resize=1920%2C1152", "publishedAt": "2023-05-18T07:42:24Z", "content": "Evidence has emerged of an Earth-sized planet in the Milky Way about 86 light years away that is a rugged and rocky world tormented by constant eruptions.\r\nScientists said on Wednesday the planet is … [+3069 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "Nope, the Universe wasn't born \"ready for life\" - Big Think", "description": "When the Universe was first born, the ingredients necessary for life were nowhere to be found. Only our \"lucky stars\" enabled our existence.", "url": "https://bigthink.com/starts-with-a-bang/universe-born-life/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/05/meteordeliverorganics.jpg?resize=1200,630", "publishedAt": "2023-05-18T06:00:00Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Radio Signals From a Dying Star Raise Questions About Supernova Explosions - ScienceAlert", "description": "When stars like our Sun die, they tend to go out with a whimper and not a bang – unless they happen to be part of a binary (two) star system that could give rise to a supernova explosion.", "url": "https://www.sciencealert.com/radio-signals-from-a-dying-star-raise-questions-about-supernova-explosions", "urlToImage": "https://www.sciencealert.com/images/2023/05/IllustrationOfASupernovaEjectingAWhiteDwarf.jpg", "publishedAt": "2023-05-18T04:56:14Z", "content": "When stars like our Sun die, they tend to go out with a whimper and not a bang unless they happen to be part of a binary (two) star system that could give rise to a supernova explosion.\r\nNow, for the… [+4875 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Jessica Goudreault", "title": "Space Rock Worth $25K If You Can Find It On Earth - Giant Freakin Robot", "description": "There's a hefty bounty out on a hunk of space rock that crash landed in the woods of Maine, good luck collecting the money!", "url": "https://www.giantfreakinrobot.com/sci/space-rock-25k-find-earth.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2020/02/meteor-4-900x606.png", "publishedAt": "2023-05-18T03:49:18Z", "content": "A space rock that landed in Maine is worth $25k to anyone that can find it. \r\nBy Jessica Goudreault\r\n| Published 9 seconds ago\r\nIf you live in New England, then you should drop everything to grab you… [+2767 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Mighty Martian River? Latest Astonishing Discovery by NASA's Perseverance Mars Rover - SciTechDaily", "description": "Evidence left in rocks is leading scientists to rethink what watery environments looked like on ancient Mars. New images from NASA's Perseverance rover reveal evidence of a powerful river on Mars, possibly deeper and faster-moving than previously known. The i…", "url": "https://scitechdaily.com/?p=278199", "urlToImage": "https://scitechdaily.com/images/Fast-River-on-Mars.jpg", "publishedAt": "2023-05-17T18:10:49Z", "content": "ByJet Propulsion LaboratoryMay 17, 2023\r\nScientists think that these bands of rocks may have been formed by a very fast, deep river the first of its kind evidence has been found for on Mars. NASAs Pe… [+7381 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scales or feathers? It all comes down to a few genes - Phys.org", "description": "Scales, spines, feathers and hair are examples of vertebrate skin appendages, which constitute a remarkably diverse group of micro-organs. Despite their natural multitude of forms, these appendages share early developmental processes at the embryonic stage. T…", "url": "https://phys.org/news/2023-05-scales-feathers-genes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/scales-or-feathers-it.jpg", "publishedAt": "2023-05-17T18:00:54Z", "content": "Scales, spines, feathers and hair are examples of vertebrate skin appendages, which constitute a remarkably diverse group of micro-organs. Despite their natural multitude of forms, these appendages s… [+4592 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Virtual reality brings ESA's Argonaut Moon lander to life - European Space Agency", "description": "A team of students and researchers are using virtual reality (VR) to bring ESA’s Argonaut lunar lander concept to life at the European Astronaut Centre.Argonaut is a lunar lander that will deliver scientific instruments and cargo to the Moon at the end of thi…", "url": "https://www.esa.int/Science_Exploration/Human_and_Robotic_Exploration/Virtual_reality_brings_ESA_s_Argonaut_Moon_lander_to_life", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/05/vr_rendering_of_the_argonaut_lunar_lander/24888895-1-eng-GB/VR_rendering_of_the_Argonaut_lunar_lander_pillars.jpg", "publishedAt": "2023-05-17T15:42:28Z", "content": "Science &amp; Exploration17/05/20231791 views24 likes\r\nA team of students and researchers are using virtual reality (VR) to bring ESAs Argonaut lunar lander concept to life at the European Astronaut … [+3892 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Currie", "title": "We regret to inform you Earth will not be destroyed by an asteroid within 1,000 years - The Register", "description": "Never mind, there's always nuclear war and climate catastrophe", "url": "https://www.theregister.com/2023/05/17/no_earth_killing_asteroids/", "urlToImage": "https://regmedia.co.uk/2022/02/01/shutterstock_asteroid.jpg", "publishedAt": "2023-05-17T14:31:00Z", "content": "War, genocide, TikTok if it could all end today, some of us would die with a smile on our face knowing there was little about humanity worth preserving.\r\nHowever, we have bad news for the misanthrope… [+3364 chars]"}, {"source": {"id": null, "name": "Good News Network"}, "author": "Andy Corbley", "title": "For New Rover, NASA is Swapping Buggy Shape for a Giant Snake in Hopes it Can Explore Icy Moon of Saturn - Good News Network", "description": "The autonomous robot is being tested in sand and ice, along steep cliffs, craters, underground lava tubes, and even within glaciers.", "url": "https://www.goodnewsnetwork.org/for-new-rover-nasa-is-swapping-buggy-shape-for-a-giant-snake-in-hopes-it-can-explore-icy-moon-of-saturn/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2023/05/NASA-JPL-CALTECH.jpg", "publishedAt": "2023-05-17T13:00:45Z", "content": "Using stereo cameras and lidar, EELS is able to create a 3D map of its surroundings, understanding the environment before navigating through it. NASA JPL-CALTECH\r\nNASA is testing an all-terrain slith… [+3229 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Scientists discover hidden Ice Age 'treasure' that is spewing out the Earth's innards - indy100", "description": "Arctic explorers have uncovered a jaw-dropping blast from the past which they’ve described as a “hidden treasure”.The discovery was made in the Barents Sea, about 70 miles (113km) south of Norway’s remote Bear Island.Researchers were exploring the seabed when…", "url": "https://www.indy100.com/science-tech/ice-age-mud-volcano-norway", "urlToImage": "https://www.indy100.com/media-library/mud-volcanoes-such-as-these-offer-important-clues-about-the-earth-s-past-as-well-its-current-inner-workings.jpg?id=33683213&width=1200&height=600&coordinates=0%2C64%2C0%2C11", "publishedAt": "2023-05-17T11:15:01Z", "content": "Arctic explorers have uncovered a jaw-dropping blast from the past which theyve described as a hidden treasure.\r\nThe discovery was made in the Barents Sea, about 70 miles (113km) south of Norways rem… [+2981 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Found in the trash: these floating snails hang out in the ocean's garbage patch - Nature.com", "description": "Ocean currents that collect plastic also round up sea life — this striking image shows its bubbly life raft.", "url": "https://www.nature.com/articles/d41586-023-01645-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-01645-2/d41586-023-01645-2_25365444.jpg", "publishedAt": "2023-05-17T08:21:17Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Quark Matter: Gravitational Waves Hold Clues to the Universe's Densest Matter - SciTechDaily", "description": "Gravitational waves could reveal whether the quark soup that existed in the early Universe is created in neutron-star mergers. RIKEN researchers suggest that gravitational-wave signals from merging neutron stars could reveal the existence of ultra-dense quark…", "url": "https://scitechdaily.com/strange-quark-matter-gravitational-waves-hold-clues-to-the-universes-densest-matter/", "urlToImage": "https://scitechdaily.com/images/Neutron-Star-Collision-scaled.jpg", "publishedAt": "2023-05-17T04:00:20Z", "content": "ByRIKENMay 16, 2023\r\nFigure 1: Gravitational waves generated by mergers between two neutron stars could reveal the creation of free quarks through such mergers. Credit: NASAs Goddard Space Flight Cen… [+5784 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Experiment Inspired by Earth's Core Leads to Groundbreaking Discovery in Fluid Flow Turbulence - SciTechDaily", "description": "Turbulent flows take on a surprising spin in an experiment inspired by the Earth’s core. A team of physicists has discovered a new role for a specific type of turbulence—a finding that sheds light on fluid flows ranging from the Earth’s liquid core to boiling…", "url": "https://scitechdaily.com/physics-experiment-inspired-by-earths-core-leads-to-groundbreaking-discovery-in-fluid-flow-turbulence/", "urlToImage": "https://scitechdaily.com/images/Swirling-Fire-Energy-Molten-Core.jpg", "publishedAt": "2023-05-16T23:36:12Z", "content": "ByNew York UniversityMay 16, 2023\r\nPhysicists have discovered a new aspect of turbulent convection, demonstrating that it can cause a freely moving solid within the fluid to rotate in two directions,… [+3200 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How to Find The Voyagers, Deorbiting the ISS, Non-Rotational Artificial Gravity | Q&A 224 - Fraser Cain", "description": "How can we get artificial gravity in space without rotating a spacecraft? Will there be bigger Mars helicopters in future? How exactly will they deorbit the ...", "url": "https://www.youtube.com/watch?v=M7xy6LYyH6k", "urlToImage": "https://i.ytimg.com/vi/M7xy6LYyH6k/maxresdefault.jpg", "publishedAt": "2023-05-16T22:23:41Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "62 New Moons Discovered Orbiting Saturn Using Innovative Astronomy - SciTechDaily", "description": "An international team of astronomers has found 62 new moons around Saturn using an innovative technique. These irregular moons contribute to Saturn's total moon count of 145, surpassing Jupiter, and provide insights into the planet's moon system's collisional…", "url": "https://scitechdaily.com/?p=278527", "urlToImage": "https://scitechdaily.com/images/Hubble-View-of-Saturn-2019.jpg", "publishedAt": "2023-05-16T19:55:59Z", "content": "ByUniversity of British ColumbiaMay 16, 2023\r\nNASAs Hubble Space Telescope captured exquisite details of the ring system in this 2019 observation. An international team of astronomers led by Edward A… [+7275 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Solar 'superflares' millions of times stronger than anything today may have sparked life on earth - Livescience.com", "description": "Intense solar storms may have delivered Earth its earliest building blocks of life, new research suggests.", "url": "https://www.livescience.com/space/the-sun/solar-superflares-millions-of-times-stronger-than-anything-today-may-have-sparked-life-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nooWtExtsSXqRyYCTgWZTY-1200-80.png", "publishedAt": "2023-05-16T16:10:33Z", "content": "Life on Earth could have been sparked by enormous superflares from a hyperactive young sun, a new study suggests. \r\nBy firing charged particles found in the solar wind at a concoction of gases presen… [+4586 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "NASA Shuts Down the Lunar Flashlight Mission After it Fails to Go into Orbit - Universe Today", "description": "NASA missions can be categorized into two types. One type includes headline-grabbing missions, such as the JWST or New Horizons, that take decades to design and plan. Typically those larger missions include many flight-tested components that had already been …", "url": "https://www.universetoday.com/161392/nasa-shuts-down-the-lunar-flashlight-mission-after-it-fails-to-go-into-orbit/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/9518.jpg", "publishedAt": "2023-05-16T14:54:49Z", "content": "NASA missions can be categorized into two types. One type includes headline-grabbing missions, such as the JWST or New Horizons, that take decades to design and plan. Typically those larger missions … [+3993 chars]"}]}