{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Surprise: Plants Might Be Able To Absorb More CO2 Than Expected - SciTechDaily", "description": "A new study reveals that plants might absorb more CO2 than expected, offering hope in combating climate change. However, reducing emissions remains crucial, as planting trees alone isn't a sufficient solution. New research published on November 17 in Science …", "url": "https://scitechdaily.com/natures-surprise-plants-might-be-able-to-absorb-more-co2-than-expected/", "urlToImage": "https://scitechdaily.com/images/Forest-Absorbs-Carbon-Dioxide-Like-Lungs-Concept-Art.jpg", "publishedAt": "2023-11-26T21:19:55Z", "content": "ByTrinity College DublinNovember 26, 2023\r\nRecent research indicates that plants could absorb more atmospheric CO2 than previously believed, providing a hopeful perspective on climate change mitigati… [+6390 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Extraordinary Claims About Small-Brained Human Ancestor Overhyped, Say Experts - ScienceAlert", "description": "In 2013, a group of scientists squeezed through a deep, twisting cave system to examine hundreds of bones belonging to a newly discovered species of human ancestor named Homo naledi .", "url": "https://www.sciencealert.com/extraordinary-claims-about-small-brained-human-ancestor-overhyped-say-experts", "urlToImage": "https://www.sciencealert.com/images/2023/06/Homonaledi.jpg", "publishedAt": "2023-11-26T20:01:24Z", "content": "In 2013, a group of scientists squeezed through a deep, twisting cave system to examine hundreds of bones belonging to a newly discovered species of human ancestor named Homo naledi .\r\nEver since, th… [+4331 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "TeeJay Small", "title": "Cosmic Ray Hits Utah And It Comes From Beyond Our Galaxy - Giant Freakin Robot", "description": "A cosmic ray just hit the state of Utah. Here's the intergalactic origin story of this bizarre happening and what you should know about it.", "url": "https://www.giantfreakinrobot.com/sci/cosmic-ray.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/10/planet-earth.jpg", "publishedAt": "2023-11-26T18:26:51Z", "content": null}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "The Earth's axis is shifting because of water - indy100", "description": "We’re discovering new things about the Earth all the time – just like scientists recently found water is slowly leaking down there from the surface, and people only just realising that there’s a massive ocean hidden under the Earth’s crust.Now, experts have f…", "url": "https://www.indy100.com/science-tech/earth-axis-shifting-reason-2666358490", "urlToImage": "https://www.indy100.com/media-library/experts-say-the-earths-core-is-changing-and-it-may-have-a.jpg?id=50537814&width=1200&height=600&coordinates=0%2C43%2C0%2C43", "publishedAt": "2023-11-26T15:30:44Z", "content": "Were discovering new things about the Earth all the time just like scientists recently found water is slowly leaking down there from the surface, and people only just realising that theres a massive … [+1942 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Hannah Bird", "title": "Reservoir construction may be reducing carbon storage in ocean sediments - Phys.org", "description": "Carbon storage has been a key focus in recent years to draw down natural and anthropogenic sources of carbon dioxide and help the fight against global warming, and particularly focuses on terrestrial forests and soils, as well as wetland mangroves and seagras…", "url": "https://phys.org/news/2023-11-reservoir-carbon-storage-ocean-sediments.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/reservoir-construction.jpg", "publishedAt": "2023-11-26T14:00:01Z", "content": "Carbon storage has been a key focus in recent years to draw down natural and anthropogenic sources of carbon dioxide and help the fight against global warming, and particularly focuses on terrestrial… [+4263 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "KiDS in the sky: New stellar system discovered by the Kilo-Degree Survey - Phys.org", "description": "Astronomers have discovered a new stellar system in the outskirts of the Milky Way as part of the Kilo-Degree Survey (KiDS). The newfound system, named Sextans II, is most likely an ultra-faint dwarf galaxy. The finding is reported in a paper published Novemb…", "url": "https://phys.org/news/2023-11-kids-sky-stellar-kilo-degree-survey.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/kids-in-the-sky-new-st.jpg", "publishedAt": "2023-11-25T16:00:02Z", "content": "Astronomers have discovered a new stellar system in the outskirts of the Milky Way as part of the Kilo-Degree Survey (KiDS). The newfound system, named Sextans II, is most likely an ultra-faint dwarf… [+3205 chars]"}, {"source": {"id": null, "name": "Bulgarianmilitary.com"}, "author": "Boyko Nikolov", "title": "Russian satellite Kosmos-2570 detached two military objects - US - Bulgarian Military", "description": "Specialists from LeoLabs, have drawn parallels between the Russian military satellite Kosmos-2570 and the well-known \"Matryoshka\" Russian nesting dolls in space", "url": "https://bulgarianmilitary.com/2023/11/25/russian-satellite-kosmos-2570-detached-two-military-objects-us/", "urlToImage": "https://bulgarianmilitary.com/wp-content/uploads/2023/11/Russian-satellite-Kosmos-2570-detached-two-military-objects-US.jpg", "publishedAt": "2023-11-25T15:41:07Z", "content": "Specialists from LeoLabs, an American firm, have drawn parallels between the Russian military satellite Kosmos-2570 and the well-known “Matryoshka” Russian nesting dolls in space. The satellite, simi… [+3719 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Alex Daniel", "title": "Water discovered to be leaking from Earth's crust into the planet's core - indy100", "description": "There is much we still don’t know about the inside of our planet – but scientists recently discovered water is slowly leaking down there from the surface.\nIt’s not a simple journey. The liquid is dripping down descending tectonic plates, before eventually rea…", "url": "https://www.indy100.com/science-tech/water-leaking-earth-crust-core-science-2666354273", "urlToImage": "https://www.indy100.com/media-library/earth-s-core-may-be-leaking-ancient-helium.jpg?id=29378777&width=1200&height=600&coordinates=0%2C25%2C0%2C25", "publishedAt": "2023-11-25T14:39:20Z", "content": "There is much we still dont know about the inside of our planet but scientists recently discovered water is slowly leaking down there from the surface.\r\nIts not a simple journey. The liquid is drippi… [+1658 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Recurring Supereruption Discovered Near Italy Could Blow Again - ScienceAlert", "description": "Four gargantuan undersea sediment deposits – or 'megabeds' – discovered in the western Marsili Basin near Italy show evidence of a series of supereruptions stretching back some 50,000 years, suggesting another one could be on the way.", "url": "https://www.sciencealert.com/recurring-supereruption-discovered-near-italy-could-blow-again", "urlToImage": "https://www.sciencealert.com/images/2023/11/BigVolcano.jpg", "publishedAt": "2023-11-25T11:36:18Z", "content": "Four gargantuan undersea sediment deposits or 'megabeds' discovered in the western Marsili Basin near Italy show evidence of a series of supereruptions stretching back some 50,000 years, suggesting a… [+2895 chars]"}]}