{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "The News International"}, "author": "AFP", "title": "Alarm sounded over light pollution from satellites as global threat to nature - The News International", "description": "PARIS: Astronomers warned that the light pollution created by the soaring number of satellites orbiting Earth poses an unprecedented global threat to nature. The number of satellites in low...", "url": "https://www.thenews.com.pk/latest/1052142-alarm-sounded-over-light-pollution-from-satellites", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-03-21/1052142_125520_updates.jpg", "publishedAt": "2023-03-20T19:59:59Z", "content": "PARIS: Astronomers warned that the light pollution created by the soaring number of satellites orbiting Earth poses an \"unprecedented global threat to nature.\" \r\nThe number of satellites in low Earth… [+3091 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Another Room-Temperature Superconductivity Claim And Questions Of Scientific Integrity - Hackaday", "description": "In early March of 2023, a paper was published in Nature, with the researchers claiming that they had observed superconductivity at room temperature in a conductive alloy, at near-ambient pressure. …", "url": "https://hackaday.com/2023/03/20/another-room-temperature-superconductivity-claim-and-questions-of-scientific-integrity/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/superconducting_magnet.jpg", "publishedAt": "2023-03-20T17:00:00Z", "content": "In early March of 2023, a paper was published in Nature, with the researchers claiming that they had observed superconductivity at room temperature in a conductive alloy, at near-ambient pressure. Wh… [+9627 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "As launch approaches, JUICE project manager discusses trajectories and science - NASASpaceFlight.com - NASASpaceflight.com", "description": "The European Space Agency’s (ESA) Jupiter Icy Moons Explorer (JUICE) spacecraft recently arrived in French…", "url": "https://www.nasaspaceflight.com/2023/03/juice-project-manager/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/03/JUICE_exploring_Jupiter_1280.jpg", "publishedAt": "2023-03-20T15:13:03Z", "content": "19The European Space Agency’s (ESA) Jupiter Icy Moons Explorer (JUICE) spacecraft recently arrived in French Guiana for its upcoming launch, which is currently set for April 13, 2023. JUICE is curren… [+20224 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New eyes discovered in trilobites - Phys.org", "description": "Trilobites, prehistoric sea creatures, had so-called median eyes, single eyes on their foreheads, in addition to their compound eyes, research conducted by Dr. Brigitte Schoenemann at the University of Cologne's Institute of Zoology and Professor Dr. Euan Cla…", "url": "https://phys.org/news/2023-03-eyes-trilobites.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-eyes-discovered-in.jpg", "publishedAt": "2023-03-20T14:00:03Z", "content": "Compound and median eyes of trilobites. (a) Aulacopleura koninckii (Barrande, 1846), Silurian, Czech Republik, partly with shell preserved. (b) Holochroal compound eyes of (a). (c) Compound eye of Ge… [+5440 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deep Impact: Heat Waves Happen at the Bottom of the Ocean Too - SciTechDaily", "description": "First assessment of bottom marine heat waves opens a window on the deep. The 2013-2016 marine heat wave known as “The Blob” warmed a vast expanse of surface waters across the northeastern Pacific, disrupting West Coast marine ecosystems, depressing salmon ret…", "url": "https://scitechdaily.com/deep-impact-heat-waves-happen-at-the-bottom-of-the-ocean-too/", "urlToImage": "https://scitechdaily.com/images/Bathymetric-Features-Western-Atlantic-Ocean-Basin.jpg", "publishedAt": "2023-03-20T12:33:39Z", "content": "ByNational Oceanic and Atmospheric Administration (NOAA)March 20, 2023\r\nThis visualization depicts bathymetric features of the western Atlantic Ocean Basin, including the continental shelf, captured … [+9286 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr. Katie Spalding", "title": "Gasoline Has A Shelf Life, And It's Way Shorter Than You Think - IFLScience", "description": "I've seen cheeses that last longer than this.", "url": "https://www.iflscience.com/gasoline-has-a-shelf-life-and-its-way-shorter-than-you-think-68043", "urlToImage": "https://assets.iflscience.com/assets/articleNo/68043/aImg/66547/dirty-red-jerry-can-meta.jpg", "publishedAt": "2023-03-20T12:07:07Z", "content": "The gasoline in your car began its life (for want of a better term) around 360 million years ago. Thats long before even the first dinosaurs wandered the Earth; despite the popular image of the typic… [+6457 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Lindsay Clark", "title": "Potatoes in space: Boffins cook up cosmic concrete for off-world habitats - The Register", "description": "Extraterrestrial regolith biocomposite, you say? I’ll have two", "url": "https://www.theregister.com/2023/03/20/spuds_in_space_make_cosmic/", "urlToImage": "https://regmedia.co.uk/2023/03/17/shutterstock_potato_space.jpg", "publishedAt": "2023-03-20T11:32:00Z", "content": "Have you ended up on Mars or the Moon and do you want to build a safe home from the dusty material surrounding you? Then potatoes are what you need, according to researchers at Manchester University.… [+2448 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Katherine Sidnell", "title": "Scientists discover missing continent after 375 years - UNILAD", "description": "Geologists made the discovery in 2017, but the ‘great Southern Continent’ had been theorised about since Roman times", "url": "https://www.unilad.com/news/new-continent-zealandia-discovered-178751-20230320", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&dpr=1&url=https://eu-images.contentstack.com/v3/assets/blt949ea8e16e463049/blt390f8c4ca8b7da92/6418227c0785c23c5225f7d7/Zealandia.png", "publishedAt": "2023-03-20T09:12:23Z", "content": "Scientists discovered a missing content after 375 years, which was once part of an ancient supercontinent which included Western Antarctica and Eastern Australia. \r\nThe great Southern Continent has b… [+2499 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Robotic Exploration of Caves on Mars and Beyond Inspired by Hansel and Gretel's Breadcrumb Trick - SciTechDaily", "description": "University of Arizona engineers have developed a system that allows autonomous vehicles to scout out underground habitats for astronauts. House hunting on Mars could soon become a thing, and researchers at the University of Arizona are already in the business…", "url": "https://scitechdaily.com/robotic-exploration-of-caves-on-mars-and-beyond-inspired-by-hansel-and-gretels-breadcrumb-trick/", "urlToImage": "https://scitechdaily.com/images/Autonomous-Rovers-Exploring-Lava-Tube.jpg", "publishedAt": "2023-03-20T05:11:56Z", "content": "ByUniversity of ArizonaMarch 19, 2023\r\nIn this artists impression of the breadcrumb scenario, autonomous rovers can be seen exploring a lava tube after being deployed by a mother rover that remains a… [+10802 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "JWST Found Six \"Impossible\" Galaxies. Here's What The Researchers Have To Say - Fraser Cain", "description": "James Webb recently found six examples of galaxies that are too big too early. This discovery can significantly change our understanding of the early Univers...", "url": "https://www.youtube.com/watch?v=xPK9kF2tqfk", "urlToImage": "https://i.ytimg.com/vi/xPK9kF2tqfk/maxresdefault.jpg", "publishedAt": "2023-03-20T01:02:47Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss Eclipses: NASA Releases New Map of Upcoming Solar Eclipses - SciTechDaily", "description": "Where will you be for the 2023 and 2024 solar eclipses in the United States? NASA has released a new map that could help you decide. Based on observations from several NASA missions, the map details the path of the Moon’s shadow as it crosses the contiguous U…", "url": "https://scitechdaily.com/?p=261604", "urlToImage": "https://scitechdaily.com/images/Moon-Appearance-November-2022-Total-Lunar-Eclipse.gif", "publishedAt": "2023-03-19T21:22:28Z", "content": "ByVanessa Thomas, NASAs Goddard Space Flight CenterMarch 19, 2023\r\nThe appearance of the Moon during the November 2022 total lunar eclipse. NASA has released a new map that details the 2023 and 2024 … [+9845 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Humans Are Leaving Behind a Frozen Legacy of Microbes on Mount Everest - SciTechDaily", "description": "Located nearly 5 miles above sea level in the Himalayas, the barren, wind-swept depression between Mount Everest and its neighboring summit, Lhotse, remains devoid of snow. At the South Col, hundreds of thrill-seekers set up their final camp annually, prepari…", "url": "https://scitechdaily.com/humans-are-leaving-behind-a-frozen-legacy-of-microbes-on-mount-everest/", "urlToImage": "https://scitechdaily.com/images/Site-of-Soil-Samples-Near-South-Col-Camp-scaled.jpg", "publishedAt": "2023-03-19T18:47:50Z", "content": "A camp on the South Col, where hundreds of adventurers pitch their final camp each year before attempting to scale the worlds tallest peak from the southeastern side. Photo was taken near the site of… [+4941 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Perspective on the Fundamental Structure of the Universe - SciTechDaily", "description": "The universe is peppered with galaxies, which, on large scales, exhibit a filamentary pattern, referred to as the cosmic web. This heterogeneous distribution of cosmic material is in some ways like blueberries in a muffin where material clusters in certain ar…", "url": "https://scitechdaily.com/new-perspective-on-the-fundamental-structure-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Perspective-on-Universe-Structure.jpg", "publishedAt": "2023-03-19T17:37:46Z", "content": "ByInstitute for Advanced StudyMarch 19, 2023\r\nResearchers have used simulations to investigate the cosmic web, the filamentary pattern of galaxies that exists on large scales throughout the universe.… [+7671 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "On the Origin of Time by Thomas Hertog: inside Stephen Hawking's mind-blowing final theory - The Telegraph", "description": "Everything, everywhere, all at once? Forget it – there are ideas about time far more outrageous than simply the multiverse", "url": "https://www.telegraph.co.uk/books/what-to-read/origin-time-thomas-hertog-inside-stephen-hawkings-mind-blowing/", "urlToImage": "https://www.telegraph.co.uk/content/dam/books/2023/03/16/TELEMMGLPICT000011903114_trans_NvBQzQNjv4BqnFj3e4miEk7T1MwMTZXkj3uqFFkW70PKKitnWUGuSbY.jpeg?impolicy=logo-overlay", "publishedAt": "2023-03-19T06:00:00Z", "content": "Most striking, perhaps, is how willing he is to bite the bullet of backwards causation, in which, as Hertog explicitly says, the past [is] contingent on the present. He does not even shy away from ac… [+1458 chars]"}]}