{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ingenious Photosynthesis \"Hack\" Paves Way for Renewable Energy Breakthroughs - SciTechDaily", "description": "Researchers have ‘hacked’ the earliest stages of photosynthesis, the natural machine that powers the vast majority of life on Earth, and discovered new ways to extract energy from the process, a finding that could lead to new ways of generating clean fuel and…", "url": "https://scitechdaily.com/ingenious-photosynthesis-hack-paves-way-for-renewable-energy-breakthroughs/", "urlToImage": "https://scitechdaily.com/images/Photosynthesis-Hack-New-Ways-of-Generating-Renewable-Energy.jpg", "publishedAt": "2023-03-26T15:32:48Z", "content": "ByUniversity of CambridgeMarch 26, 2023\r\nIn a groundbreaking development, researchers have successfully hacked the initial stages of photosynthesis the natural process that fuels the majority of life… [+7340 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Martha McHardy", "title": "Strongest solar storm in years hits Earth catching forecasters by surprise - The Independent", "description": "The storm made auroras visible as far south as New Mexico in the US", "url": "https://www.independent.co.uk/news/world/solar-storm-new-mexico-us-b2308196.html", "urlToImage": "https://static.independent.co.uk/2023/02/28/10/iStock-1423939850.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-03-26T14:29:39Z", "content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nThe most powerful solar storm in nearly six years ha… [+1989 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Copper Deposits Turned a Village Into One of the Most Important Trade Hubs of the Late Bronze Age - SciTechDaily", "description": "Researchers from the University of Gothenburg have uncovered evidence that highlights the significance of the Cypriot village of Hala Sultan Tekke during the Late Bronze Age. Through excavations, the team has established that the village's strategic location …", "url": "https://scitechdaily.com/how-copper-deposits-turned-a-village-into-one-of-the-most-important-trade-hubs-of-the-late-bronze-age/", "urlToImage": "https://scitechdaily.com/images/Copper-Slag-Cyprus.jpg", "publishedAt": "2023-03-26T13:01:30Z", "content": "Copper slag from one of the citys workshops. Credit: T. Bürge\r\nResearchers from the University of Gothenburg have uncovered evidence that highlights the significance of the Cypriot village of Hala Su… [+5426 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Astrobiologist suggests we look for signs of life from elsewhere in the galaxy by studying space dust - Phys.org", "description": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal International Journal of Astrobiology, he suggests that space dust…", "url": "https://phys.org/news/2023-03-astrobiologist-life-galaxy-space.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/spacedust.jpg", "publishedAt": "2023-03-26T10:00:01Z", "content": "Tomonori Totani, an astrobiologist with the University of Tokyo is proposing that the search for life beyond Earth be expanded to the study of space dust. In his paper published in the journal Intern… [+2521 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "Boeing Starliner's 1st crewed trip to the ISS delayed again over battery overheating risk - The Register", "description": "May fly in the summer, with some presumably pretty nervous pilots", "url": "https://www.theregister.com/2023/03/26/boeing_starliner_iss_delay/", "urlToImage": "https://regmedia.co.uk/2023/03/24/starliner_shutterstock.jpg", "publishedAt": "2023-03-26T09:21:00Z", "content": "Boeing's first mission carrying astronauts to the International Space Station aboard its Starliner capsule, scheduled for April, is now delayed until summer due to the risk of overheating batteries.\r… [+2234 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Hubble Telescope captures image of Galactic Jellyfish - Geo News", "description": "The picture shows thread-like stars moving away from the body of the galaxy making it appear like a jellyfish", "url": "https://www.geo.tv/latest/478630-hubble-telescope-captures-image-of-galactic-jellyfish", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-03-26/478630_011747_updates.jpg", "publishedAt": "2023-03-26T09:00:00Z", "content": "Hubble Space Telescope released a photo of beautiful and shining galaxies in which it focused on capturing a giant galaxy of stars forming a shape like a jellyfish JW100 , which is located at a dista… [+1912 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harry Fletcher", "title": "Reclassified galaxy is now a supermassive black hole that's pointing at Earth - indy100", "description": "We don’t want to alarm you, but there’s a black hole pointing Earth squarely in the face. Scientists have reclassified a galaxy after finding that the supermassive black hole in its centre has changed direction and it is now aiming right at us. The galaxy in …", "url": "https://www.indy100.com/science-tech/reclassified-galaxy-black-hole-earth-2659656303", "urlToImage": "https://www.indy100.com/media-library/a-mystery-object-being-dragged-into-the-center-of-our-galaxy-perplexes.jpg?id=33348528&width=1200&height=600&coordinates=0%2C32%2C0%2C33", "publishedAt": "2023-03-26T08:54:22Z", "content": "We dont want to alarm you, but theres a black hole pointing Earth squarely in the face. \r\nScientists have reclassified a galaxy after finding that the supermassive black hole in its centre has change… [+1925 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Chad Langen", "title": "Alpha Centauri Mission Searching For Life, Signals Already Found - Giant Freakin Robot", "description": "Alpha Centauri is our neighboring solar system, but we know little about it, except it's out best shot at finding life beyond Earth.", "url": "https://www.giantfreakinrobot.com/sci/alpha-centauri-mission-searching-life.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2021/01/planets-planetary-protection-scaled.jpg", "publishedAt": "2023-03-25T21:41:05Z", "content": "A team of researchers out of the University of Sydney will search Alpha Centauri for signs of life in the hope of finding another habitable planet. \r\nThe search for extra-terrestrial life has always … [+3119 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surreal! NASA shares DEAFENING screams of the Sun; Listen to the scary sound - HT Tech", "description": "The audio tech aboard the NASA Solar and Helioscopic Observatory (SOHO) has detected sound waves emerging from the Sun. It can drive anyone DEAF!", "url": "https://tech.hindustantimes.com/tech/news/surreal-nasa-shares-deafening-screams-of-the-sun-listen-to-the-scary-sound-71679742639421.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/faintyoung_1648896828205_1679742736270_1679742736270.jpg", "publishedAt": "2023-03-25T11:16:48Z", "content": "Last month, NASA made a remarkable discovery when it recorded the sound coming from RS Puppis, a Cepheid variable star which is located about 6,500 light-years away. But that's not all the sound we c… [+1818 chars]"}]}