{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Lyndon Nicholas", "title": "Supermassive Black Hole Spotted Moving Between Galaxies - Giant Freakin Robot", "description": "Science fiction has always been fascinating with black holes, but this terrifying astronomical body is no fiction.", "url": "https://www.giantfreakinrobot.com/sci/black-hole-moving-between-galaxies.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/02/black-hole.jpg", "publishedAt": "2023-03-12T18:55:32Z", "content": "A supermassive black hole has been spotted passing through several galaxies at high speed.\r\nNew electrifying scientific discoveries can often cause a buzz within the scientific community, and these d… [+3750 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/igor-bonifacic", "title": "SpaceX’s Crew-5 mission safely returns to Earth after five months in space - Engadget", "description": "SpaceX’s Crew-5 mission safely splashed down on Saturday evening, bringing home four astronauts..", "url": "https://www.engadget.com/spacexs-crew-5-mission-safely-returns-to-earth-after-five-months-in-space-184759470.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jT9NpBqYuHP5rJxoFWurEg--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-03/a1c4c290-c104-11ed-92db-d1ce9300d3be.cf.jpg", "publishedAt": "2023-03-12T18:49:33Z", "content": "SpaceXs Crew-5 mission has safely returned to Earth. On Saturday evening, the companys Endurance Dragon spacecraft splashed down off the coast of Florida following a five-month stay at the Internatio… [+1550 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Unexpected” – Researchers Pinpoint Mysterious Source of Sun's “Heartbeat-Like” Signals - SciTechDaily", "description": "According to a new study, scientists have pinpointed a solar radio burst in the Sun's atmosphere that exhibits a signal pattern similar to that of a heartbeat. An international team of researchers has published their discovery of the source location of a radi…", "url": "https://scitechdaily.com/unexpected-researchers-pinpoint-mysterious-source-of-suns-heartbeat-like-signals/", "urlToImage": "https://scitechdaily.com/images/Sun-With-Solar-Flares.jpg", "publishedAt": "2023-03-12T16:03:32Z", "content": "ByNew Jersey Institute of TechnologyMarch 12, 2023\r\nAn illustration showing EOVSA capturing a pulsating radio burst from a solar flare. Credit: Sijie Yu of NJIT/CSTR; Yuankun Kou of NJU; NASA SDO/AIA… [+4324 chars]"}, {"source": {"id": null, "name": "Knowablemagazine.org"}, "author": "Elizabeth Preston, Knowable Magazine", "title": "Animal personalities can trip up science, but there’s a solution - Ars Technica", "description": "Individual behavior patterns may skew studies, but a new approach could help.", "url": "https://knowablemagazine.org/article/living-world/2023/animal-personalities-trip-up-science", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/hermit-crabs-760x380.jpg", "publishedAt": "2023-03-12T10:50:10Z", "content": "Enlarge/ Even hermit crabs have individual patterns of behavior personalities, if you like. When scientists ignore the effects of such differences, they may produce research thats flawed.\r\n32 with \r\n… [+4297 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Anti-Aging Breakthrough: Detoxing Body of Harmful Fat By-Products To Extend Lifespan - SciTechDaily", "description": "Scientists from the University of Virginia (UVA) have identified a promising approach to delay aging by detoxifying the body of glycerol and glyceraldehyde, harmful by-products of fat that naturally accumulate over time. The new findings come from UVA researc…", "url": "https://scitechdaily.com/anti-aging-breakthrough-detoxing-body-of-harmful-fat-by-products-to-extend-lifespan/", "urlToImage": "https://scitechdaily.com/images/Rejuvenation-Anti-Aging-Concept.jpg", "publishedAt": "2023-03-12T10:45:00Z", "content": "A promising approach to delay aging has been identified by scientists in a recent study. They suggest detoxifying the body of glycerol and glyceraldehyde, harmful by-products of fat that naturally ac… [+5831 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day March 12, 2023: Saturn's Hyperion- Moon with Odd Craters - HT Tech", "description": "NASA's astronomy picture of the day is about Saturn's moon named Hyperion, which is said to be the largest of the planet's irregular, nonspherical moons.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-march-12-2023-saturn-s-hyperion-moon-with-odd-craters-71678606983318.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/12/1600x900/hyperion_cassini_1024_1678607095056_1678607117206_1678607117206.jpg", "publishedAt": "2023-03-12T07:48:26Z", "content": "Do you know how many moons Saturn has? The planet has a total of 83 moons, out of which 63 moons are confirmed and named. While, the other 20 moons are awaiting confirmation of discovery and official… [+1856 chars]"}, {"source": {"id": null, "name": "Explorersweb.com"}, "author": "Sam Anderson", "title": "A First Ascent of 'Earth's Loneliest Volcano' » Explorersweb - ExplorersWeb", "description": "If you're standing on Mount Michael, the humans you're closest to are on the International Space Station. Now that's remote.", "url": "https://explorersweb.com/mount-michael-first-ascent-lonely-volcano/", "urlToImage": "https://s3.amazonaws.com/www.explorersweb.com/wp-content/uploads/2023/03/10200844/Screen-Shot-2023-03-10-at-2.08.07-PM.jpg", "publishedAt": "2023-03-12T05:28:25Z", "content": "Theres a lonely volcano in the South Atlantic Ocean, covered in snow and concealing a lake of fire.\r\nWhen British volcanologist Emma Nicholson climbed to the top and gazed into the caldera last Novem… [+2587 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Geometry – The Newest “Magic” Twist in Superconductivity - SciTechDaily", "description": "A new mechanism that gives rise to superconductivity in a material where the speed of electrons is almost zero has been discovered by scientists at The University of Texas at Dallas and their partners at The Ohio State University. This breakthrough could pave…", "url": "https://scitechdaily.com/quantum-geometry-the-newest-magic-twist-in-superconductivity/", "urlToImage": "https://scitechdaily.com/images/Abstract-Energy-Superconductivity-Concept-Art.jpg", "publishedAt": "2023-03-12T03:18:12Z", "content": "ByUniversity of Texas at DallasMarch 11, 2023\r\nThe new study provides significant insights into how superconductivity can arise in materials with nearly frozen electrons.\r\nA new mechanism that gives … [+4571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breathtaking Early Stages of Star Formation Captured With James Webb Space Telescope - SciTechDaily", "description": "Webb space telescope’s mid-infrared capabilities allowed scientists to see past gas and dust clouds to observe previously obscured details in faraway galaxies. A team of researchers has been able to see inside faraway spiral galaxies for the first time to stu…", "url": "https://scitechdaily.com/breathtaking-early-stages-of-star-formation-captured-with-james-webb-space-telescope/", "urlToImage": "https://scitechdaily.com/images/Webb-Reveals-Intricate-Networks-of-Gas-and-Dust.jpg", "publishedAt": "2023-03-11T22:16:08Z", "content": "ByUniversity of AlbertaMarch 11, 2023\r\nResearchers are getting their first glimpses inside distant spiral galaxies to see how stars formed and how they change over time, thanks to the James Webb Spac… [+5816 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Al Williams", "title": "Enzymes Make Electricity From Thin Air - Hackaday", "description": "There’s an old magic trick known as the miser’s dream, where the magician appears to pull coins from thin air. Australian scientists say they can now generate electricity out of thin ai…", "url": "https://hackaday.com/2023/03/11/enzymes-make-electricity-from-thin-air/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/03/hucs.png", "publishedAt": "2023-03-11T18:00:00Z", "content": "There’s an old magic trick known as the miser’s dream, where the magician appears to pull coins from thin air. Australian scientists say they can now generate electricity out of thin air with the hel… [+831 chars]"}, {"source": {"id": null, "name": "BGR"}, "author": "Joshua Hawkins, Joshua Hawkins", "title": "Check out the only photos of Venus' surface that have ever been taken - BGR", "description": "Humanity's only photos of Venus' surface are over 40 years old but that could soon change as new missions set their sights on Earth's twin.", "url": "https://bgr.com/science/check-out-the-only-photos-of-venus-surface-that-have-ever-been-taken/", "urlToImage": "https://bgr.com/wp-content/uploads/2020/09/bgrpic-copy-15.jpg?quality=82&strip=all", "publishedAt": "2023-03-11T14:01:00Z", "content": "Despite decades spent exploring our solar system, there’s still a lot that humanity hasn’t accomplished, and still a lot that we haven’t properly explored. Chief among those things that still need ex… [+2517 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Lies Beneath Melting Glaciers and Thawing Permafrost? Precious Metals, Fossil Fuels, and Deadly Microbes - SciTechDaily", "description": "Across the planet, ice is rapidly disappearing. From mountain tops, the poles, the seas, and the tundra. As the ice melts, it’s exposing new surfaces, new opportunities, and new threats — including valuable mineral deposits, archaeological relics, novel virus…", "url": "https://scitechdaily.com/what-lies-beneath-melting-glaciers-and-thawing-permafrost-precious-metals-fossil-fuels-and-deadly-microbes/", "urlToImage": "https://scitechdaily.com/images/Greenlandic-Ice-Cap-Melting-Glacier.jpg", "publishedAt": "2023-03-11T12:10:55Z", "content": "ByColumbia Climate SchoolMarch 11, 2023\r\nIce is melting at an alarming pace all over the world. Whether its on mountain peaks, at the poles, in the seas, or on the tundra, no place is immune. The mel… [+20443 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Images show what sunsets look like on Mars - The News International", "description": "In 1976, NASA's Viking 1 lander provided the first glimpse of a Martian sunset for humans. Since then, a number of additional robots from the Red Planet have sent back numerous images of Martian...", "url": "https://www.thenews.com.pk/latest/1048813-mars-sunset-images", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-03-11/1048813_112736_updates.jpg", "publishedAt": "2023-03-11T06:06:26Z", "content": "In 1976, NASA's Viking 1 lander provided the first glimpse of a Martian sunset for humans. Since then, a number of additional robots from the Red Planet have sent back numerous images of Martian sunr… [+2242 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Identify “Pioneer Peptide” That May Have Sparked Life on Earth - SciTechDaily", "description": "Research could provide clues to extraterrestrial life. A team of Rutgers University scientists dedicated to pinpointing the primordial origins of metabolism – a set of core chemical reactions that first powered life on Earth – has identified part of a protein…", "url": "https://scitechdaily.com/scientists-identify-pioneer-peptide-that-may-have-sparked-life-on-earth/", "urlToImage": "https://scitechdaily.com/images/Abstract-Biochemistry-Origin-of-life-Concept.gif", "publishedAt": "2023-03-11T02:52:19Z", "content": "ByRutgers UniversityMarch 10, 2023\r\nRutgers University scientists have identified a portion of a protein called Nickelback that is a likely candidate for kickstarting life on Earth over 3 billion yea… [+7678 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "This is the first wiring map of an insect's brain - Boing Boing", "description": "A fruit fly larva’s brain has 3,016 neurons and now, for the first time, scientists have mapped how they’re connected together. This is the largest brain “connectome” every …", "url": "https://boingboing.net/2023/03/10/this-is-the-first-wiring-map-of-an-insects-brain.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/03/screenshot-21.png?fit=1200%2C792&ssl=1", "publishedAt": "2023-03-11T01:00:40Z", "content": "A fruit fly larva's brain has 3,016 neurons and now, for the first time, scientists have mapped how they're connected together. This is the largest brain \"connectome\" every completed. Previously, one… [+1461 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Solving Previously Unsolvable Problems: A New Type of Analog Quantum Computer - SciTechDaily", "description": "Physicists have created a novel type of analog quantum computer capable of addressing challenging physics problems that the most powerful digital supercomputers cannot solve. A groundbreaking study published in Nature Physics by a team of scientists from Stan…", "url": "https://scitechdaily.com/solving-previously-unsolvable-problems-a-new-type-of-analog-quantum-computer/", "urlToImage": "https://scitechdaily.com/images/Abstract-Quantum-Physics-Alien-Technology-Illustration.jpg", "publishedAt": "2023-03-11T00:01:21Z", "content": "ByUCD Research &amp; InnovationMarch 10, 2023\r\nAnalog quantum computers are a type of quantum computer that operates using continuous variables, such as the amplitude and phase of a quantum wavefunct… [+8573 chars]"}]}