{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sea Corals Found To Be a Source of an Elusive “Anti-Cancer” Compound - SciTechDaily", "description": "Researchers find that sea corals are a source of a sought-after \"anti-cancer\" compound The ocean floor is riddled with mysteries, but scientists have just discovered one of its best-kept secrets. For the last 25 years, researchers have been looking for the so…", "url": "https://scitechdaily.com/sea-corals-found-to-be-a-source-of-an-elusive-anti-cancer-compound/", "urlToImage": "https://scitechdaily.com/images/White-Blood-Cells-Attacking-Cancer.jpg", "publishedAt": "2022-06-29T12:29:12Z", "content": "ByUniversity of UtahJune 29, 2022\r\nResearchers proved that sea corals are a source of eleutherobin, a chemical with anti-cancer properties.\r\nResearchers find that sea corals are a source of a sought-… [+7562 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Scientists surprised as geomagnetic storm opens 'crack' in Earth's magnetosphere - Sky News", "description": "", "url": "https://news.sky.com/story/scientists-surprised-as-geomagnetic-storm-opens-crack-in-earths-magnetosphere-12642375", "urlToImage": "https://e3.365dm.com/22/06/1600x900/skynews-sun-nasa-solar-flare_5818047.png?20220629101717", "publishedAt": "2022-06-29T09:54:53Z", "content": "A geomagnetic storm hit our planet over the weekend, surprising scientists as it did not appear to originate from a solar flare.\r\nThe storm came amid a rare alignment of five planets, offering photog… [+2356 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "China's Tianwen-1 spacecraft captures STUNNING photos of Mars - Daily Mail", "description": "The China National Space Administration has released photos taken by the Tianwen-1 spacecraft that show the entire planet of Mars. This includes high-resolution images of the planet's south pole.", "url": "https://www.dailymail.co.uk/sciencetech/article-10963905/Chinese-spacecraft-acquires-images-entire-planet-Mars.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/29/09/59661131-0-image-a-14_1656493152575.jpg", "publishedAt": "2022-06-29T06:13:50Z", "content": "A spacecraft that has circled Mars over 1,300 times has captured a stunning series photos covering the entire planet.\r\nChina's Tianwen-1 orbiter has returned high-resolution images of the Martian sou… [+7102 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Curiosity Rover Measures Key Life Ingredient on Mars for First Time - SciTechDaily", "description": "Newly published research quantifies the presence of organic carbon in Martian rocks. For the first time, scientists using data from NASA’s Curiosity rover measured the total organic carbon – a key component in the molecules of life – in Martian rocks. “Total …", "url": "https://scitechdaily.com/nasas-curiosity-rover-measures-key-life-ingredient-on-mars-for-first-time/", "urlToImage": "https://scitechdaily.com/images/Yellowknife-Bay-Mars-Crop-scaled.jpg", "publishedAt": "2022-06-29T03:35:34Z", "content": "ByJet Propulsion LaboratoryJune 28, 2022\r\nNASAs Curiosity Mars rover used its Mast Camera, or Mastcam, to capture this area at the edge of a location nicknamed Yellowknife Bay. Credit: NASA/JPL-Calte… [+6960 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA CAPSTONE Launches Successfully – Will Test New Lunar Orbit for Artemis Moon Missions - SciTechDaily", "description": "Today (June 28, 2022) Rocket Lab launched a CubeSat on a historic pathfinding mission to the moon to support NASA’s Artemis program. NASA’s CAPSTONE, a CubeSat designed to test a unique lunar orbit, is safely in space and on the first leg of its journey to th…", "url": "https://scitechdaily.com/nasa-capstone-launches-successfully-will-test-new-lunar-orbit-for-artemis-moon-missions/", "urlToImage": "https://scitechdaily.com/images/NASA-C.APSTONE-Mission.gif", "publishedAt": "2022-06-28T20:56:48Z", "content": "ByNASAJune 28, 2022\r\nCAPSTONE in orbit near the Moon: Once released from Rocket Labs Photon satellite bus, CAPSTONE will use its propulsion system to travel for approximately three months before ente… [+7405 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Physicists confront the neutron lifetime puzzle - Phys.org", "description": "To solve a long-standing puzzle about how long a neutron can \"live\" outside an atomic nucleus, physicists entertained a wild but testable theory positing the existence of a right-handed version of our left-handed universe. They designed a mind-bending experim…", "url": "https://phys.org/news/2022-06-physicists-neutron-lifetime-puzzle.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/physicists-confront-th.jpg", "publishedAt": "2022-06-28T20:23:03Z", "content": "To solve a long-standing puzzle about how long a neutron can \"live\" outside an atomic nucleus, physicists entertained a wild but testable theory positing the existence of a right-handed version of ou… [+7546 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "New method significantly speeds up the search for dangerous asteroids - Syfy", "description": "There are a lot of potentially hazardous asteroids out there that could impact Earth. A new method, THOR, has been developed to find them a lot faster.", "url": "https://www.syfy.com/syfy-wire/bad-astronomy-thor-program-speeds-up-search-for-near-earth-asteroids", "urlToImage": "https://www.syfy.com/sites/syfy/files/2021/12/earth_mathilde_big_litright.jpg", "publishedAt": "2022-06-28T13:00:14Z", "content": "Note: This article was written in part to help promote Asteroid Day on June 30, a global effort to raise awareness about the dangers and scientific importance of asteroids. Its on June 30 every year,… [+5291 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "One of Webb Space Telescope's Primary Instruments Ready To See Cosmos in Over 2000 Infrared Colors - SciTechDaily", "description": "One of the James Webb Space Telescope’s four primary scientific instruments, known as NIRISS, has concluded its postlaunch preparations and is now ready for science. NIRISS, which stands for Near-Infrared Imager and Slitless Spectrograph instrument, provides …", "url": "https://scitechdaily.com/one-of-webb-space-telescopes-primary-instruments-ready-to-see-cosmos-in-over-2000-infrared-colors/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Light-Path-Animation.gif", "publishedAt": "2022-06-28T12:30:40Z", "content": "ByNASAJune 28, 2022\r\nThis animation shows the path light will follow as it hits the primary James Webb Space Telescope (JWST) mirror, and is reflected to the secondary, and then in through the aft op… [+3960 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Two Genes Crucial for Plants Colonizing the Earth 470 Million Ago Have Been Identified - SciTechDaily", "description": "Researchers shed new light on how plant life became established on the surface of the Earth Researchers from the University of Copenhagen have shed new light on how plant life got established on the surface of our planet. They specifically demonstrated that t…", "url": "https://scitechdaily.com/two-genes-crucial-for-plants-colonizing-the-earth-470-million-ago-have-been-identified/", "urlToImage": "https://scitechdaily.com/images/Earth-DNA-Genetics.jpg", "publishedAt": "2022-06-28T01:31:29Z", "content": "Scientists believe it likely that the two genes, PEN1 and SYP122, paved the way for all terrestrial plant life.\r\nResearchers shed new light on how plant life became established on the surface of the … [+6097 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Mystery rocket crashes into the Moon – and no one (on Earth) is owning up - The Telegraph", "description": "Nasa scientists baffled at who was behind the launch and why its impact was spread over two distinct craters", "url": "https://www.telegraph.co.uk/world-news/2022/06/27/mystery-rocket-crashes-moon-leaves-large-double-crater/", "urlToImage": "https://www.telegraph.co.uk/content/dam/world-news/2022/06/27/TELEMMGLPICT000301053897_trans_NvBQzQNjv4Bq1WWhU9cXe4cGE27zxsNGhlHwtdpQwyNje2OyIL7x97s.jpeg?impolicy=logo-overlay", "publishedAt": "2022-06-27T16:47:00Z", "content": "Amateur astrologists first pointed the finger at SpaceX, but then recalculated that it was likely to be from a 2014 Chinese lunar mission (Chang'e 5-T1). China has contested this, saying that the boo… [+1170 chars]"}]}