{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Meredith Garofalo", "title": "SpaceX wants to build 1 Starship megarocket a day with new Starfactory - Space.com", "description": "\"This will enable us to increase our production rate significantly as we build toward our long-term goal of producing one Ship per day.\"", "url": "https://www.space.com/spacex-starship-one-a-day-starfactory", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qbWGWejDCCbmQRmoHaHoiT-1200-80.jpg", "publishedAt": "2024-06-08T13:00:07Z", "content": "Sure, the test flight of the world's most powerful rocket this week was nail-biting. But it was also a massive win for SpaceX with a successful fourth test for Starship.\r\nThe company's goals for this… [+2630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Uncovers a Mysterious Carbon Treasure Trove Around Young Star - SciTechDaily", "description": "Using the James Webb Space Telescope, scientists have discovered a rich variety of carbon molecules in a protoplanetary disk around a low-mass star, suggesting a unique type of planet-forming environment that could lead to the creation of carbon-poor planets.…", "url": "https://scitechdaily.com/webb-telescope-uncovers-a-mysterious-carbon-treasure-trove-around-young-star/", "urlToImage": "https://scitechdaily.com/images/Artists-Impression-of-Protoplanetary-Disc-scaled.jpg", "publishedAt": "2024-06-08T10:31:49Z", "content": "This is an artist’s impression of a young star surrounded by a disk of gas and dust. An international team of astronomers has used NASA’s James Webb Space Telescope to study the disk around a young a… [+6524 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Tiny Overlooked Creatures May Have Triggered Explosion of Life on Earth - ScienceAlert", "description": "A dazzling assortment of life's variety of flavors burst into existence on Earth roughly 480 million years ago.", "url": "https://www.sciencealert.com/tiny-overlooked-creatures-may-have-triggered-explosion-of-life-on-earth", "urlToImage": "https://www.sciencealert.com/images/2024/06/EarlyPrehistoricWormOttoiaFromTheCambrian-.jpg", "publishedAt": "2024-06-08T10:03:15Z", "content": "A dazzling assortment of life's variety of flavors burst into existence on Earth roughly 480 million years ago. There's long been speculation over what spurred this prolific radiation of new species,… [+3709 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "We're Now Just Weeks Away from a Stellar Explosion You Can See With Your Own Eyes - Universe Today", "description": "I’ve seen some pretty incredible things using my eyes.. First off of course, is the stunning sight of a dark star filled sky, then there is the incredible sight of the Andromeda Galaxy 2.5 million light years away. Planets too can of course be seen as they sl…", "url": "https://www.universetoday.com/167320/were-now-just-weeks-away-from-a-stellar-explosion-you-can-see-with-your-own-eyes/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/06/T-CrB.jpeg", "publishedAt": "2024-06-08T01:04:27Z", "content": "Ive seen some pretty incredible things using my eyes.. First off of course, is the stunning sight of a dark star filled sky, then there is the incredible sight of the Andromeda Galaxy 2.5 million lig… [+3754 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "NASA is commissioning 10 studies on Mars Sample Return—most are commercial - Ars Technica", "description": "SpaceX will show NASA how Starship could one day return rock samples from Mars.", "url": "https://arstechnica.com/space/2024/06/nasa-is-commissioning-10-studies-on-mars-sample-return-most-are-commercial/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/06/mav_mars_orbit-760x380.jpg", "publishedAt": "2024-06-08T00:20:47Z", "content": "Enlarge/ An artist's concept of a Mars Ascent Vehicle orbiting the red planet.\r\n22\r\nNASA announced Friday that it will award contracts to seven companies, including SpaceX and Blue Origin, to study h… [+5878 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "At the Dawn of Time: MIT Physicists Link Dark Matter to “Super-Charged” Microscopic Black Holes - SciTechDaily", "description": "In the first quintillionth of a second, the universe may have sprouted microscopic black holes with enormous amounts of nuclear charge, according to MIT physicists. MIT researchers propose that primordial black holes, possibly a form of dark matter, could hav…", "url": "https://scitechdaily.com/at-the-dawn-of-time-mit-physicists-link-dark-matter-to-super-charged-microscopic-black-holes/", "urlToImage": "https://scitechdaily.com/images/Primordial-Black-Hole-Forming-Amid-Quarks-and-Gluons.jpg", "publishedAt": "2024-06-07T20:21:59Z", "content": "Depiction of a primordial black hole forming amid a sea of hot, color-charged quarks and gluons, a tiny fraction of a second after the Big Bang. Credit: Kaća Bradonjić\r\nIn the first quintillionth of … [+8871 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "New research finds lake under Mars ice cap unlikely - Phys.org", "description": "Cornell University researchers have provided a simple and comprehensive—if less dramatic—explanation for bright radar reflections initially interpreted as liquid water beneath the ice cap on Mars' south pole.", "url": "https://phys.org/news/2024-06-lake-mars-ice-cap.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/mars-2.jpg", "publishedAt": "2024-06-07T18:00:01Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+3753 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Victoria Corless", "title": "Weird magnetic fields of Uranus and Neptune may come from strange space chemistry - Space.com", "description": "A molecule that can't be formed on Earth may lurk within Neptune — and Uranus, too.", "url": "https://www.space.com/uranus-neptune-aquodiium-magnetic-fields", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5jomR7dvRywfF7pdKQVWr8-1200-80.jpg", "publishedAt": "2024-06-07T18:00:01Z", "content": "In the depths of our solar system — a realm where chemistry meets speculation — scientists have reported the possible existence of a molecule known as aquodiium, an elusive cousin of the ammonium ion… [+4506 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Alien-Looking Species Seen For First Time Ever in Ocean's Darkest Depths - ScienceAlert", "description": "A collection of new species discovered lurking on the seafloor exemplifies exactly how alien this strange world is.", "url": "https://www.sciencealert.com/alien-looking-species-seen-for-first-time-ever-in-oceans-darkest-depths", "urlToImage": "https://www.sciencealert.com/images/2024/06/sea-cucumber.jpg", "publishedAt": "2024-06-07T11:01:23Z", "content": "A collection of new species discovered lurking on the seafloor exemplifies exactly how alien this strange worldis.\r\nIn the Clarion-Clipperton Zone of the Pacific Ocean between Mexico and Hawaii, mari… [+3942 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Matt Reynolds", "title": "The World's Largest Fungarium May Unlock the Mysteries of Carbon Capture - WIRED", "description": "Research is uncovering the key role that fungi play in getting soils to absorb carbon, and how humanity’s actions aboveground are wreaking havoc in the mysterious fungal world below.", "url": "https://www.wired.com/story/mushrooms-fungi-carbon-capture-kew/", "urlToImage": "https://media.wired.com/photos/665dbda6666074812dc00329/191:100/w_1280,c_limit/2024_04_26_WIRED_FUNGI_225_deeperBlue.jpg", "publishedAt": "2024-06-07T11:00:00Z", "content": "Martinez-Suzs research focuses on mycorrhizal fungia large group of fungi that coexist with plant root systems. The mycorrhizal fungi form networks that can go around and sometimes inside plant roots… [+2940 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's X-59 Quesst: Overturning the 50-Year-Old Supersonic Speed Limit - SciTechDaily", "description": "NASA is addressing the longstanding ban on civilian supersonic flights over land by developing the X-59 aircraft, which aims to minimize sonic booms to mere \"thumps.\" This initiative could lead to regulatory changes that prioritize noise level over speed, pot…", "url": "https://scitechdaily.com/nasas-x-59-quesst-overturning-the-50-year-old-supersonic-speed-limit/", "urlToImage": "https://scitechdaily.com/images/NASA-X-59-Lockheed-Martin-Illustration.jpg", "publishedAt": "2024-06-06T22:28:24Z", "content": "NASA’s X-59, seen in this illustration, is designed to fly faster than sound but generate quieter sonic “thumps” rather than booms. To test the public’s perception of this noise, part of the Quesst p… [+9435 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Evan Gough", "title": "The JWST is rewriting astronomy textbooks - Phys.org", "description": "When the James Webb Space Telescope was launched at the end of 2021, we expected stunning images and illuminating scientific results. So far, the powerful space telescope has lived up to our expectations. The JWST has shown us things about the early universe …", "url": "https://phys.org/news/2024-06-jwst-rewriting-astronomy-textbooks.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/the-jwst-is-rewriting.jpg", "publishedAt": "2024-06-06T16:24:05Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+7897 chars]"}]}