{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysicist Reveals Planet That Could End Life on Earth - SciTechDaily", "description": "Experiment demonstrates our solar system’s fragility. A terrestrial planet hovering between Mars and Jupiter would be able to push Earth out of the solar system and wipe out life on this planet, according to a University of California, Riverside (UCR) experim…", "url": "https://scitechdaily.com/astrophysicist-reveals-planet-that-could-end-life-on-earth/", "urlToImage": "https://scitechdaily.com/images/Solar-System-Montage-Rosette-Nebula-scaled.jpg", "publishedAt": "2023-03-08T09:23:26Z", "content": "ByUniversity of California - RiversideMarch 8, 2023\r\nThis solar system montage of the nine planets and four large moons of Jupiter in our solar system are set against a false-color view of the Rosett… [+5140 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Bumblebees learn to solve puzzles by watching peers, study finds - BBC", "description": "Scientists who trained bees to open a puzzle find that they pass the knowledge on to their colonies.", "url": "https://www.bbc.com/news/uk-64884107", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/101F6/production/_128883066_gettyimages-509084655.jpg", "publishedAt": "2023-03-08T03:38:05Z", "content": "Bumblebees learn to solve puzzles by watching their more experienced peers, scientists in Britain have found.\r\nExperts from Queen Mary University of London trained a set of bees to open a puzzle box … [+2053 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "'Giant' ant fossil raises questions about ancient Arctic migrations - Phys.org", "description": "Simon Fraser University scientists say their research on the latest fossil find near Princeton, B.C. is raising questions about how the dispersal of animals and plants occurred across the Northern Hemisphere some 50 million years ago, including whether brief …", "url": "https://phys.org/news/2023-03-giant-ant-fossil-ancient-arctic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/giant-ant-fossil-raise.jpg", "publishedAt": "2023-03-07T20:21:03Z", "content": "Simon Fraser University scientists say their research on the latest fossil find near Princeton, B.C. is raising questions about how the dispersal of animals and plants occurred across the Northern He… [+4311 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "100 Million Years Unveiled: The Most Detailed Model of Earth's Surface Ever - SciTechDaily", "description": "An advanced digital tool can assist us in comprehending the past and forecasting the evolution of the Earth's surface. The interplay of climate, tectonic activity, and the passage of time result in formidable forces that shape the appearance of our planet. Th…", "url": "https://scitechdaily.com/100-million-years-unveiled-the-most-detailed-model-of-earths-surface-ever/", "urlToImage": "https://scitechdaily.com/images/Landscape-Evolution-Over-the-Past-100-Million-Years.jpg", "publishedAt": "2023-03-07T13:43:51Z", "content": "ByUniversity of SydneyMarch 7, 2023\r\nLandscape evolution over the past 100 million years. Credit: Dr. Tristan Salles, The University of Sydney / AAAS\r\nAn advanced digital tool can assist us in compre… [+4728 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Paul Sutter", "title": "Dark energy could lead to a second (and third, and fourth) Big Bang, new research suggests - Space.com", "description": "Scientists have proposed a way that the universe could stop expanding, ending in a 'Big Crunch' that resets space and time as we know it.", "url": "https://www.space.com/https://www.livescience.com/dark-energy-could-lead-to-a-second-and-third-and-fourth-big-bang-new-research-suggests", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Be5EtabBFPuMQfT4yjiLpU-1200-80.jpg", "publishedAt": "2023-03-07T13:00:36Z", "content": "Will the universe end in a bang or a whimper? A pair of theoretical physicists have proposed a third path: perhaps the universe will never end.\r\nIn a study that attempts to define the nature of dark … [+3927 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "NASA fixes solar observation spacecraft by turning it off and turning it on again - The Register", "description": "'Firemode reset' sees Interstellar Boundary Explorer back on the job", "url": "https://www.theregister.com/2023/03/07/nasa_ibex_reboot/", "urlToImage": "https://regmedia.co.uk/2023/03/07/restart_shutterstock.jpg", "publishedAt": "2023-03-07T13:00:00Z", "content": "NASA engineers have managed to restore the Interstellar Boundary Explorer spacecraft to working condition by using the oldest trick in the computing book.\r\nIBEX was put into contingency mode in Febru… [+1956 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Using a data cube to monitor forest loss in the Amazon - European Space Agency", "description": null, "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Sentinel-1/Using_a_data_cube_to_monitor_forest_loss_in_the_Amazon", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/03/forest_loss_across_the_amazon/24740814-1-eng-GB/Forest_loss_across_the_Amazon_pillars.jpg", "publishedAt": "2023-03-07T12:09:42Z", "content": "Applications07/03/20231277 views52 likes\r\nForests hold a vast amount of Earths terrestrial carbon and play an important role in offsetting anthropogenic emissions of fossil fuels. Since 2015, the wor… [+3629 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "An internal thermometer tells seeds when to germinate, researchers find - Phys.org", "description": "Germination is a crucial stage in the life of a plant, as it will leave the stage of seed resistant to various environmental constraints (climatic conditions, absence of nutritive elements, etc.) to become a seedling that is much more vulnerable. The survival…", "url": "https://phys.org/news/2023-03-internal-thermometer-seeds-germinate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/an-internal-thermomete.jpg", "publishedAt": "2023-03-07T10:00:01Z", "content": "Germination is a crucial stage in the life of a plant, as it will leave the stage of seed resistant to various environmental constraints (climatic conditions, absence of nutritive elements, etc.) to … [+4708 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Mind-boggling James Webb Telescope image shows the same galaxy at three different points in time - TechSpot", "description": "The image in question features a supernova-hosting galaxy captured at three different points in time, all in the same photo. The time-defying feat is the result of...", "url": "https://www.techspot.com/news/97831-mind-boggling-james-webb-telescope-image-shows-same.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/03/2023-03-06-image-10.jpg", "publishedAt": "2023-03-06T17:54:15Z", "content": "WTF?! The James Webb Space Telescope continues to boggle the mind with images of the distant universe that often defy our wildest imaginations. This recent example from the space observatory slots pe… [+1837 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Computing Breakthrough: Silicon Encoded Spin Qubits Achieve Universality - SciTechDaily", "description": "HRL Laboratories, LLC, has published the first demonstration of universal control of encoded spin qubits. This newly emerging approach to quantum computation uses a novel silicon-based qubit device architecture, fabricated in HRL’s Malibu cleanroom, to trap s…", "url": "https://scitechdaily.com/quantum-computing-breakthrough-silicon-encoded-spin-qubits-achieve-universality/", "urlToImage": "https://scitechdaily.com/images/Silicon-Encoded-Spin-Qubits-Universality.jpg", "publishedAt": "2023-03-06T14:59:41Z", "content": "Render of a six-dot SLEDGE device in silicon, which implemented universal logic with encoded spin qubits. Credit: HRL Laboratories\r\nHRL Laboratories, LLC, has published the first demonstration of uni… [+4956 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanna Thompson", "title": "What's the smallest known asteroid? What about the largest? - Livescience.com", "description": "Not all asteroids are planet-killers — most are tiny and others are huge. So what are the largest and smallest asteroids in the solar system?", "url": "https://www.livescience.com/whats-the-smallest-known-asteroid-what-about-the-largest", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nztBC5TzcPhHe3kTDyJUY4-1200-80.jpg", "publishedAt": "2023-03-06T10:00:00Z", "content": "Asteroids constantly zoom around our solar system and sometimes smash into planets, including Earth. As such, in the name of planetary defense NASA conducted a test, dubbed DART (Double Asteroid Redi… [+5047 chars]"}]}