{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Never-before-seen armoured dinosaur is unearthed in Argentina - Daily Mail", "description": "The species probably would have been able to eat tough, woody vegetation, according to palaeontologists at the Félix de Azara Natural History Foundation in Argentina.", "url": "https://www.dailymail.co.uk/sciencetech/article-11112367/Never-seen-armoured-dinosaur-unearthed-Argentina.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/15/10/61392593-0-image-a-20_1660556563070.jpg", "publishedAt": "2022-08-15T09:53:54Z", "content": "The fossilised remains of a never-before-seen armoured dinosaur that was the size of a house cat have been unearthed in Argentina.\r\nPalaeontologists say Jakapil kaniukura looks like a primitive relat… [+5121 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Starwatch: Saturn makes its closest approach to Earth of the year - The Guardian", "description": "Earth undertakes the ringed planet every 378 days, passing directly between it and the sun", "url": "https://amp.theguardian.com/science/2022/aug/15/starwatch-saturn-makes-closest-approach-earth", "urlToImage": null, "publishedAt": "2022-08-15T05:00:00Z", "content": "StarwatchEarth undertakes the ringed planet every 378 days, passing directly between it and the sun\r\nThe beautiful ringed planet Saturn has arrived at its closest approach to Earth of the year.\r\nOn 1… [+1437 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicist Claims To Have Solved the Mystery of Consciousness - SciTechDaily", "description": "According to the theory, all that's needed to solve the hard problem of consciousness is to change our assumptions about it. When we realize that consciousness is a physical, relativistic phenomenon, the mystery of consciousness naturally dissolves. How do 3 …", "url": "https://scitechdaily.com/physicist-claims-to-have-solved-the-mystery-of-consciousness/", "urlToImage": "https://scitechdaily.com/images/Brain-Memory-Intelligence-Consciousness.jpg", "publishedAt": "2022-08-14T18:42:48Z", "content": "Scientists have developed a new conceptual and mathematical framework to understand consciousness from a relativistic point of view.\r\nAccording to the theory, all thats needed to solve the hard probl… [+7714 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nuclear Fusion Energy Breakthrough: Ignition Confirmed in Record 1.3 Megajoule Shot - SciTechDaily", "description": "After decades of inertial confinement fusion research, a yield of more than 1.3 megajoules (MJ) was achieved for the first time on August 8, 2021. This put scientists at Lawrence Livermore National Laboratory’s (LLNL’s) National Ignition Facility (NIF) at the…", "url": "https://scitechdaily.com/nuclear-fusion-energy-breakthrough-ignition-confirmed-in-record-1-3-megajoule-shot/", "urlToImage": "https://scitechdaily.com/images/Cryogenic-Target-Fusion-Ignition.jpg", "publishedAt": "2022-08-14T09:37:47Z", "content": "ByLawrence Livermore National LaboratoryAugust 14, 2022\r\nOn the one-year anniversary of achieving a yield of more than 1.3 megajoules at LLNLs National Ignition Facility, the scientific results of th… [+5816 chars]"}]}