{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coming Soon: First Images From NASA's Webb Space Telescope - SciTechDaily", "description": "The first full-color images and other data, coming July 12, 2022, will showcase Webb’s capabilities and kick off its science mission. NASA has announced that it will release the James Webb Space Telescope’s first full-color images and additional spectroscopic…", "url": "https://scitechdaily.com/coming-soon-first-images-from-nasas-webb-space-telescope/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-06-02T15:04:14Z", "content": "BySpace Telescope Science InstituteJune 2, 2022\r\nNASAs James Webb Space Telescope. Credit: NASA Goddard Space Flight Center and Northrup Grumman\r\nThe first full-color images and other data, coming Ju… [+9137 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Super-Earth exoplanet orbiting nearby star discovered - Phys.org", "description": "An international team of astronomers reports the discovery of a new super-Earth exoplanet orbiting a nearby M-dwarf star known as Ross 508. The newly found alien world, which received designation Ross 508 b, turns out to be at least four times more massive th…", "url": "https://phys.org/news/2022-06-super-earth-exoplanet-orbiting-nearby-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/super-earth-exoplanet.jpg", "publishedAt": "2022-06-02T13:10:06Z", "content": "An international team of astronomers reports the discovery of a new super-Earth exoplanet orbiting a nearby M-dwarf star known as Ross 508. The newly found alien world, which received designation Ros… [+3414 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bending the Laws of Physics: Time Crystals “Impossible” but Obey Quantum Physics - SciTechDaily", "description": "Time crystals were long believed to be impossible because their perpetual motion would seem to defy the laws of physics. However, using quantum physics scientists have not only created time crystals, but they have also now shown that they have the potential t…", "url": "https://scitechdaily.com/bending-the-laws-of-physics-time-crystals-impossible-but-obey-quantum-physics/", "urlToImage": "https://scitechdaily.com/images/Abstract-Time-Crystal-Concept.gif", "publishedAt": "2022-06-02T09:00:23Z", "content": "In a new experiment, scientists created two time crystals inside the superfluid, and brought them to touch.\r\nTime crystals were long believed to be impossible because their perpetual motion would see… [+2792 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Rare sight for amateur astronomers as five planets align - The Guardian", "description": "Mercury, Venus, Mars, Jupiter and Saturn will be visible in order of their distance from the sun from Friday", "url": "https://amp.theguardian.com/science/2022/jun/02/rare-sight-for-amateur-astronomers-as-five-planets-align", "urlToImage": null, "publishedAt": "2022-06-02T06:00:00Z", "content": "ScienceMercury, Venus, Mars, Jupiter and Saturn will be visible in order of their distance from the sun from Friday \r\nAmateur astronomers are preparing for a heavenly treat from Friday as the five pl… [+3611 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Rosie McCall", "title": "Which Planet Is Closest To Earth? Ok, Now Guess Again. - IFLScience", "description": "The order of the planets is something most of us learn in school: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and (until 2006) Pluto.\nSo", "url": "https://www.iflscience.com/space/which-planet-is-closest-to-earth-ok-now-guess-again/", "urlToImage": "https://cdn.iflscience.com/images/cc13095a-ef2c-5de9-a710-847e086ea598/default-1654098149-ok-two-more-guesses.jpg", "publishedAt": "2022-06-01T15:42:00Z", "content": "The order of the planets is something most of us learn in school: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and (until 2006) Pluto.\r\nSo, you would be forgiven for thinking that a… [+3636 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Lunar Research Station: Russia, China Almost Ready To Ink Pact On ‘Moon Base’ That Will Rival Artemis Accords – Rogozin - EurAsian Times", "description": "Russian space chief Dmitry Rogozin recently said that Moscow and Beijing were very close to signing the agreement on creating the joint Lunar Station. Chinese Taikonaut ‘Apes’ ISS Astronaut At Space Station; Makes Strikingly Similar Video On Life In Space — W…", "url": "https://eurasiantimes.com/russia-china-almost-ready-to-ink-pact-on-moon-base/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2021/02/IRLS-e1613840302657.jpg", "publishedAt": "2022-06-01T10:20:25Z", "content": "Russian space chief Dmitry Rogozin recently said that Moscow and Beijing were very close to signing the agreement on creating the joint Lunar Station.\r\n“We are now almost ready to sign an intergovern… [+6657 chars]"}]}