{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Astronomers discover immense swarms of sunspots that could lead to solar flares - Daily Mail", "description": "Sunspots are dark regions of the Sun where it is cooler than other parts of the  surface. Solar flares originate close to these dark areas of the star.", "url": "https://www.dailymail.co.uk/sciencetech/article-10736877/Astronomers-discover-immense-swarms-sunspots-lead-solar-flares.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/20/21/56847667-0-image-a-19_1650485191932.jpg", "publishedAt": "2022-04-20T20:08:33Z", "content": "A pair of massive sunspot swarms, some large enough to devour the Earth whole, have appeared on the surface of the Sun, increasing the chance of an intense solar storm.\r\nSunspots are dark regions of … [+7221 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Celebrating Hubble's 32nd Birthday: A Magnificent View of an Unusual Collection of Five Galaxies - SciTechDaily", "description": "NASA is celebrating the Hubble Space Telescope's 32nd birthday with a spectacular look at The Hickson Compact Group 40, an unusual close-knit collection of five galaxies. This menagerie includes three spiral-shaped galaxies, an elliptical galaxy, and a lentic…", "url": "https://scitechdaily.com/celebrating-hubbles-32nd-birthday-a-magnificent-view-of-an-unusual-collection-of-five-galaxies/", "urlToImage": "https://scitechdaily.com/images/Hubble-Hickson-Compact-Group-40-scaled.jpg", "publishedAt": "2022-04-20T18:41:34Z", "content": "NASA is celebrating the Hubble Space Telescopes 32nd birthday with a spectacular look at The Hickson Compact Group 40, an unusual close-knit collection of five galaxies.\r\nThis menagerie includes thre… [+4709 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Griffin", "title": "Scientists see entirely new kind of explosion happening in space - The Independent", "description": "Scientists have spotted an entirely new kind of explosion happening in space.", "url": "https://www.independent.co.uk/tech/explosion-universe-micronovae-star-sun-b2061684.html", "urlToImage": "https://static.independent.co.uk/2022/04/20/16/Low-Res_Micronova%201%20CREDIT%20Mark%20Garlick.jpg.png?quality=75&width=1200&auto=webp", "publishedAt": "2022-04-20T15:12:19Z", "content": "Scientists have spotted an entirely new kind of explosion happening in space.\r\nAstronomers say the explosion could change our understanding of how stars erupt. And their kind  micronovae, a thermonuc… [+1793 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Katie Spalding", "title": "You Can Tell If Someone Doesn't Have A Mind's Eye By Looking At Their Pupils - IFLScience", "description": "Let's do a thought experiment: imagine a ball sitting on a table. Now imagine some person comes in and pushes that ball, making it roll across the surface", "url": "https://www.iflscience.com/brain/you-can-tell-if-someone-doesnt-have-a-minds-eye-by-looking-at-their-pupils/", "urlToImage": "https://cdn.iflscience.com/images/fad2acef-1559-5e1f-9195-b6b449e52cf2/default-1650457633-cover-image.jpg", "publishedAt": "2022-04-20T13:55:00Z", "content": "Let's do a thought experiment: imagine a ball sitting on a table. Now imagine some person comes in and pushes that ball, making it roll across the surface of the table until it reaches the edge and f… [+5458 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Anthropologist Believes Ancient Human Species Could Still Be Alive In The Forests Of Flores Island - IFLScience", "description": "In 2003, archaeologists looking for evidence of the migration of modern humans from Asia to Australia stumbled across a small, fairly complete skeleton of", "url": "https://www.iflscience.com/plants-and-animals/anthropologist-believes-ancient-human-species-could-still-be-alive-on-flores-island/", "urlToImage": "https://cdn.iflscience.com/images/e5c8c029-6613-5c08-b6e0-0a4f3e0b149b/default-1650450357-flores-where-one-anthropologist-believes-an-ancient-human-may-lurk.jpg", "publishedAt": "2022-04-20T11:09:00Z", "content": "In 2003, archaeologists looking for evidence of the migration of modern humans from Asia to Australia stumbled across a small, fairly complete skeleton of an extinct human species on the Indonesian i… [+2644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Why Venus rotates, slowly, despite sun's powerful grip: Planet's atmosphere explains the gravity of the situation - Phys.org", "description": "If not for the soupy, fast-moving atmosphere on Venus, Earth's sister planet would likely not rotate. Instead, Venus would be locked in place, always facing the sun the way the same side of the moon always faces Earth.", "url": "https://phys.org/news/2022-04-venus-rotates-slowly-sun-powerful.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/why-venus-rotates-slow.jpg", "publishedAt": "2022-04-20T10:25:47Z", "content": "If not for the soupy, fast-moving atmosphere on Venus, Earth's sister planet would likely not rotate. Instead, Venus would be locked in place, always facing the sun the way the same side of the moon … [+3863 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Mars Perseverance Rover Arrives at Ancient Delta for New Science Campaign - SciTechDaily", "description": "Collecting samples as it explores an ancient and now-dry river channel is but one goal the six-wheeled geologist will pursue during its second Red Planet exploration. After collecting eight rock-core samples from its first science campaign and completing a re…", "url": "https://scitechdaily.com/second-red-planet-exploration/", "urlToImage": "https://scitechdaily.com/images/NASA-Mars-Perseverance-Rover-Driving.gif", "publishedAt": "2022-04-20T09:59:49Z", "content": "Animation of the Perseverance Rover driving on Mars. NASA/JPL-Caltech\r\nCollecting samples as it explores an ancient and now-dry river channel is but one goal the six-wheeled geologist will pursue dur… [+5836 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Curtis", "title": "Hunt is on for fallen meteorite after massive fireball is seen streaking over the west of England - Daily Mail", "description": "Scientists from the UK Fireball Alliance (UKFAll) believe that fragments of the meteorite landed somewhere south of the market town of Shrewsbury.", "url": "https://www.dailymail.co.uk/sciencetech/article-10734583/Hunt-fallen-meteorite-massive-fireball-seen-streaking-west-England.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/20/08/56821021-0-image-a-13_1650441374402.jpg", "publishedAt": "2022-04-20T08:56:48Z", "content": "A spectacular fireball seen streaking over the west of England last Wednesday night may have dropped a meteorite in Shropshire, scientists claim.\r\nScientists from the UK Fireball Alliance (UKFAll) be… [+6939 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Scientists Want to Send a NASA Probe to Uranus as a Major Research Priority - ScienceAlert", "description": "Uranus has been sadly neglected. Probes have visited Mars, Venus, Saturn, Jupiter, and Mercury. Heck, even Jupiter's moons are getting their own spacecraft. But the ice giants Uranus and Neptune, in the distant reaches of our Solar System, have not h", "url": "https://www.sciencealert.com/scientists-want-to-send-a-probe-to-uranus", "urlToImage": "https://www.sciencealert.com/images/2022-04/processed/uranus-imaged-by-voyager_1024.jpg", "publishedAt": "2022-04-20T06:59:05Z", "content": "Uranus has been sadly neglected. Probes have visited Mars, Venus, Saturn, Jupiter, and Mercury. Heck, even Jupiter's moons are getting their own spacecraft. But the ice giants Uranus and Neptune, in … [+5299 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Jupiter’s moon Europa may have water where life could exist, say scientists - The Guardian", "description": "Surface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter", "url": "https://amp.theguardian.com/science/2022/apr/19/jupiters-moon-europa-may-have-water-life-could-exist", "urlToImage": null, "publishedAt": "2022-04-19T15:27:00Z", "content": "JupiterSurface features similar to ones seen on Greenland ice sheet suggest underground liquid water that could host organic matter\r\nSubterranean pools of salty water may be commonplace on Jupiters m… [+4410 chars]"}]}