{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "NASA will soon bid farewell to its Mars InSight lander - Engadget", "description": "The lander is expected to end its science activities by the end of summer and to be completely unresponsive by December..", "url": "https://www.engadget.com/nasa-mars-insight-lander-farewell-095620031.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-05/122d80e0-d681-11ec-bbab-26710f7fe9c2", "publishedAt": "2022-05-18T09:57:34Z", "content": "NASA's Mars InSight lander will soon no longer be able to send back data and images scientists can analyze to better understand the red planet. It's been gradually losing power for a while now as dus… [+1815 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Astronauts may one day drink water from ancient moon volcanoes - Phys.org", "description": "Billions of years ago, a series of volcanic eruptions broke loose on the moon, blanketing hundreds of thousands of square miles of the orb's surface in hot lava. Over the eons, that lava created the dark blotches, or maria, that give the face of the moon its …", "url": "https://phys.org/news/2022-05-astronauts-day-ancient-moon-volcanoes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/moon.jpg", "publishedAt": "2022-05-18T08:06:40Z", "content": "Billions of years ago, a series of volcanic eruptions broke loose on the moon, blanketing hundreds of thousands of square miles of the orb's surface in hot lava. Over the eons, that lava created the … [+4835 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Fundamental New Law Unchains Fusion Energy - SciTechDaily", "description": "Physicists at EPFL, within a large European collaboration, have revised one of the fundamental laws that has been foundational to plasma and fusion research for over three decades, even governing the design of megaprojects like ITER. The update demonstrates t…", "url": "https://scitechdaily.com/a-fundamental-new-law-unchains-fusion-energy/", "urlToImage": "https://scitechdaily.com/images/ITER-Fusion-Reactor.gif", "publishedAt": "2022-05-18T02:57:01Z", "content": "ByÉcole polytechnique fédérale de Lausanne (EPFL)May 17, 2022\r\nIllustration of cloud-like ionized plasma in the ITER fusion reactor tokamak. Credit: ITER\r\nPhysicists at EPFL, within a large European … [+7209 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Child’s 130,000-year-old tooth could offer clues to extinct human relative - The Guardian", "description": "Researchers believe the discovery in a Laos cave proves that Denisovans lived in the warm tropics of southeast Asia", "url": "https://amp.theguardian.com/science/2022/may/17/childs-130000-year-old-tooth-could-offer-clues-to-extinct-human-relative", "urlToImage": null, "publishedAt": "2022-05-17T23:02:00Z", "content": "ScienceResearchers believe the discovery in a Laos cave proves that Denisovans lived in the warm tropics of southeast Asia\r\nTue 17 May 2022 18.46 EDT\r\nA childs tooth at least 130,000 years old found … [+5243 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "These organisms are 830 million-years-old and may still be alive - Boing Boing", "description": "Geologists have identified tiny lifeforms that have been trapped inside of crystals for 830 million years. And they are likely still alive. The prokaryotic and algal life is contained in tiny amoun…", "url": "https://boingboing.net/2022/05/17/these-organisms-are-830-million-years-old-and-may-still-be-alive.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/05/screenshot-35.jpg?fit=1200%2C406&ssl=1", "publishedAt": "2022-05-17T17:38:07Z", "content": "Geologists have identified tiny lifeforms that have been trapped inside of crystals for 830 million years. And they are likely still alive. The prokaryotic and algal life is contained in tiny amounts… [+843 chars]"}, {"source": {"id": null, "name": "Coventry Telegraph"}, "author": "Enda Mullen", "title": "Huge meteor flash captured on doorbell camera as friends enjoy late night cigarette - Coventry Live", "description": "There were sightings of the meteor near Coventry and in Leamington", "url": "https://www.coventrytelegraph.net/news/local-news/huge-meteor-flash-captured-doorbell-23983317", "urlToImage": "https://i2-prod.birminghammail.co.uk/incoming/article23979823.ece/ALTERNATES/s1200/0_CaptureJPG.jpg", "publishedAt": "2022-05-17T14:42:33Z", "content": "A huge meteor lit up the night sky in Warwickshire as it hurtled above two friends after they had gone outside for a late-night cigarette. The UK Meteor Network said they had received more than 100 s… [+1397 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "CRISPR Gene Editing Now Possible in Cockroaches - SciTechDaily", "description": "According to a paper published in the journal Cell Reports Methods by Cell Press on May 16th, 2022, researchers devised a CRISPR-Cas9 technique to enable gene editing in cockroaches. The straightforward and effective \"direct parental\" CRISPR (DIPA-CRISPR) pro…", "url": "https://scitechdaily.com/crispr-gene-editing-now-possible-in-cockroaches/", "urlToImage": "https://scitechdaily.com/images/CRISPR-in-Cockroaches.jpg", "publishedAt": "2022-05-17T13:11:14Z", "content": "Cartoon of CRISPR in cockroaches. Credit: Shirai et al./Cell Reports Methods\r\nAccording to a paper published in the journal Cell Reports Methods by Cell Press on May 16th, 2022, researchers devised a… [+3994 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Direct Visual Evidence That the Object in the Center of the Milky Way Is Indeed a Black Hole - SciTechDaily", "description": "Astronomers reveal the first image of the black hole at the heart of our galaxy. It is the first direct visual evidence of a ring-like structure like M87*. Theoretical Physicists of Goethe University Frankfurt were instrumental in interpreting the data. Astro…", "url": "https://scitechdaily.com/first-direct-visual-evidence-that-the-object-in-the-center-of-the-milky-way-is-indeed-a-black-hole/", "urlToImage": "https://scitechdaily.com/images/Simulation-of-Accretion-Disk-Around-Black-Hole-Sgr-A.jpg", "publishedAt": "2022-05-17T10:38:40Z", "content": "ByGoethe UniversityMay 17, 2022\r\nThis is the first image of Sagittarius A* (Sgr A*), the supermassive black hole at the center of our galaxy, captured by the Event Horizon Telescope (EHT). It is the … [+13374 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Tonga eruption on a par with Krakatoa, study says - Daily Mail", "description": "Hunga Tonga-Hunga Ha'apai, an underwater volcano in the South Pacific, created sound waves heard as far as Alaska 6,200 miles away when it erupted on January 15, a study says.", "url": "https://www.dailymail.co.uk/sciencetech/article-10824063/Tonga-eruption-par-Krakatoa-study-says.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/17/11/57915341-0-image-a-8_1652782243135.jpg", "publishedAt": "2022-05-17T09:23:26Z", "content": "Tonga's volcanic eruption in January produced the strongest recorded waves from a volcano since the eruption of Krakatoa in 1883, scientists say. \r\nHunga Tonga-Hunga Ha'apai, an underwater volcano in… [+9379 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Peek-a-Boo Moon: Astronaut on Space Station Captures Spectacular Photos of the Lunar Eclipse - SciTechDaily", "description": "On the evening of May 15, 2022, Earth passed between the Sun and the Moon blocking sunlight and casting a shadow on the lunar surface. ESA astronaut Samantha Cristoforetti witnessed this lunar eclipse from the International Space Station and captured it in a …", "url": "https://scitechdaily.com/peek-a-boo-moon-astronaut-on-space-station-captures-spectacular-photos-of-the-lunar-eclipse/", "urlToImage": "https://scitechdaily.com/images/Lunar-Eclipse-From-International-Space-Station.gif", "publishedAt": "2022-05-17T08:35:44Z", "content": "ESA astronaut Samantha Cristoforetti captured pictures of the May 2022 lunar eclipse from the International Space Station.\r\nOn the evening of May 15, 2022, Earth passed between the Sun and the Moon b… [+1160 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Antony Ashkenaz", "title": "Antarctica breakthrough: Ice sheets have GROWN over last 20 years despite climate change - Express", "description": "A NEW study has found that despite climate change causing global temperatures to rise, some ice sheets in Antarctica have actually grown over the past two decades.", "url": "https://www.express.co.uk/news/science/1611362/antarctica-breakthrough-ice-sheets-grown-last-20-years-climate-change", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/1200x712/1611362_1.jpg", "publishedAt": "2022-05-17T07:38:00Z", "content": null}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "NASA, Air Liquide continue working on Artemis 1 WDR issues - NASASpaceFlight.com - NASASpaceflight.com", "description": "NASA’s Artemis 1 flight vehicle remains in the Vehicle Assembly Building (VAB) at the Kennedy…", "url": "https://www.nasaspaceflight.com/2022/05/nasa-air-liquide-artemis-1-wdr/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/05/VAB-20220428-Composite.jpg", "publishedAt": "2022-05-16T22:42:20Z", "content": "NASA’s Artemis 1 flight vehicle remains in the Vehicle Assembly Building (VAB) at the Kennedy Space Center (KSC) in Florida while work to investigate and fix problems found in April at the launch pad… [+17569 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Linda Geddes", "title": "New US lab to create versions of atoms never recorded on Earth - The Guardian", "description": "By studying isotopes scientists hope to gain insight into how elements within exploding stars came to be", "url": "https://amp.theguardian.com/science/2022/may/16/new-us-lab-aims-create-versions-atoms-never-recorded-on-earth", "urlToImage": null, "publishedAt": "2022-05-16T15:01:00Z", "content": "Particle physicsBy studying isotopes scientists hope to gain insight into how elements within exploding stars came to be\r\nMon 16 May 2022 15.51 BST\r\nFrom carbon to uranium, oxygen to iron, chemical e… [+5001 chars]"}]}