{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Class of “Strange Metals” Yields Quantum Secrets - SciTechDaily", "description": "Physicists at Rutgers University have offered theoretical perspectives on an experiment involving a \"strange metal,\" which could play a crucial role in the development of future quantum technologies. Researchers investigating a compound referred to as \"Y-ball…", "url": "https://scitechdaily.com/mysterious-class-of-strange-metals-yields-quantum-secrets/", "urlToImage": "https://scitechdaily.com/images/Quantum-Computing-Materials.jpg", "publishedAt": "2023-04-29T18:57:50Z", "content": "ByRutgers UniversityApril 29, 2023\r\nScientists have made progress in understanding the behavior of a strange metal called Y-ball, which is central to next-generation quantum materials and could drive… [+6203 chars]"}, {"source": {"id": null, "name": "Unilad.com"}, "author": "Katherine Sidnell", "title": "Scientists divided over what will happen to men as Y chromosome is disappearing - UNILAD", "description": "It seems the scientific community are split on the disappearing Y chromosome and whether it means the end of the ‘man’ part of humanity.", "url": "https://www.unilad.com/news/is-the-y-chromosome-disappearing-077677-20230429", "urlToImage": "https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&url=https://eu-images.contentstack.com/v3/assets/blt949ea8e16e463049/blt2c44ac53cca416b3/644d3ec6c996bc64afbff2a1/image.png", "publishedAt": "2023-04-29T16:36:34Z", "content": "Scientists are divided after discovering that the Y Chromosome is disappearing.\r\nThe genetic marker largely determines our assigned sex at birth, but it's thought to have slowly disintegrated over th… [+2658 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Hope for Neurodegenerative Diseases: Stanford Researchers Uncover New Pathway for Clearing Misfolded Proteins - SciTechDaily", "description": "Misfolded proteins pose a threat to cellular health, as they interfere with normal functions and contribute to age-associated degenerative conditions such as Alzheimer's, Parkinson's, and Huntington's diseases. The mechanisms by which cells eliminate these ha…", "url": "https://scitechdaily.com/new-hope-for-neurodegenerative-diseases-stanford-researchers-uncover-new-pathway-for-clearing-misfolded-proteins/", "urlToImage": "https://scitechdaily.com/images/Neuroscience-Brain-Mapping-Confusion-Dementia.jpg", "publishedAt": "2023-04-29T16:26:14Z", "content": "ByStanford UniversityApril 29, 2023\r\nStanford University researchers discovered a new cellular pathway that clears misfolded proteins from the nucleus, which could be targeted for age-related disease… [+9238 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Chinas Mars sample-return mission may include helicopter and robot - The News International", "description": "China's upcoming Mars sample return mission, the Tianwen-3, is expected to launch sometime around 2030, according to a presentation by Liu Jizhong, director of China's Lunar Exploration and Space...", "url": "https://www.thenews.com.pk/latest/1065327-chinas-mars-sample-return-mission-may-include-helicopter-and-robot", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-04-29/1065327_071628_updates.jpg", "publishedAt": "2023-04-29T14:22:00Z", "content": "China's upcoming Mars sample return mission, the Tianwen-3, is expected to launch sometime around 2030, according to a presentation by Liu Jizhong, director of China's Lunar Exploration and Space Pro… [+2192 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Mark Kaufman", "title": "NASA helicopter captures glorious view of Mars, with some surprises - Mashable", "description": "Look closely at the Martian desert.", "url": "https://mashable.com/article/mars-nasa-perseverance-rover-images", "urlToImage": "https://helios-i.mashable.com/imagery/articles/07rI4N2xMMNbvF5TXPYjRJe/hero-image.fill.size_1200x675.v1682705760.png", "publishedAt": "2023-04-29T09:30:00Z", "content": null}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "ESA's Jupiter-bound Juice spacecraft has a sticky problem with its radar - The Register", "description": "Time to shake, rattle, and roll the probe to remove pesky antenna pin", "url": "https://www.theregister.com/2023/04/29/esa_juice_jupiter_problem/", "urlToImage": "https://regmedia.co.uk/2023/04/28/juice.jpg", "publishedAt": "2023-04-29T09:23:00Z", "content": "A tiny pin stuck in place on ESA's Juice spacecraft may be preventing engineers from unfurling its 16-metre-long antenna as it zooms toward Jupiter.\r\nLaunched two weeks ago, the probe just started it… [+2221 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Navarre Bartz", "title": "Biomimetic Building Facades To Reduce HVAC Loads - Hackaday", "description": "Buildings currently consume about 50% of the world’s electricity, so finding ways to reduce the loads they place on the grid can save money and reduce carbon emissions. Scientists at the Univ…", "url": "https://hackaday.com/2023/04/29/biomimetic-building-facades-to-reduce-hvac-loads/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/04/optofluidic.png", "publishedAt": "2023-04-29T08:00:00Z", "content": "Buildings currently consume about 50% of the world’s electricity, so finding ways to reduce the loads they place on the grid can save money and reduce carbon emissions. Scientists at the University o… [+1180 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Defying the Eddington Limit: NASA Unveils the Secret Behind Ultra-Luminous X-Ray Sources - SciTechDaily", "description": "These objects are more than 100 times brighter than they should be. Observations by the agency’s NuSTAR X-ray telescope support a possible solution to this puzzle. Ultra-luminous X-ray sources (ULXs) produce about 10 million times more energy than the Sun, re…", "url": "https://scitechdaily.com/defying-the-eddington-limit-nasa-unveils-the-secret-behind-ultra-luminous-x-ray-sources/", "urlToImage": "https://scitechdaily.com/images/Magnetic-Fields-Around-an-Ultraluminous-X-ray-Source-scaled.jpg", "publishedAt": "2023-04-29T03:16:12Z", "content": "ByJet Propulsion LaboratoryApril 28, 2023\r\nIn this illustration of an ultra-luminous X-ray source, two rivers of hot gas are pulled onto the surface of a neutron star. Strong magnetic fields, shown i… [+10560 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scary Barbie: Supermassive Black Hole Tears Apart a Giant Star With “Terrifying” Energy - SciTechDaily", "description": "Uncovering a star’s demise: Supermassive black hole tears apart a giant star in a display brighter, more energetic, and longer lasting than any observed before. Astronomers have identified a highly energetic and long-lasting transient object, dubbed \"Scary Ba…", "url": "https://scitechdaily.com/scary-barbie-supermassive-black-hole-tears-apart-a-giant-star-with-terrifying-energy/", "urlToImage": "https://scitechdaily.com/images/Star-Being-Tidally-Disrupted-Supermassive-Black-Hole-scaled.jpg", "publishedAt": "2023-04-28T20:22:40Z", "content": "ByPurdue UniversityApril 28, 2023\r\nScary Barbie is the affectionate nickname astronomers are calling one of the most energetic and luminous transients ever observed: a supermassive black hole tearing… [+7237 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Brian Koberlein", "title": "You Don't Want to Be Within 160 Light-Years of a Supernova - Universe Today", "description": "When it comes to supernovae, what is the minimum safe distance for habitable planets? Larger than we thought.", "url": "https://www.universetoday.com/161113/you-dont-want-to-be-within-160-light-years-of-a-supernova/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/04/supernova-scaled.jpg", "publishedAt": "2023-04-28T19:30:51Z", "content": "Supernovae are incredibly common in the universe. Based on observations of isotopes such as aluminum-26, we know that a supernova occurs on average about every fifty years in the Milky Way alone. A s… [+3685 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientist Solves Nearly 60-Year-Old Game Theory Conundrum - SciTechDaily", "description": "To comprehend the capability of autonomous vehicles in navigating the complexities of the road, scientists frequently resort to game theory - a branch of mathematics that deals with modeling the rational behavior of agents as they strive to achieve their obje…", "url": "https://scitechdaily.com/scientist-solves-nearly-60-year-old-game-theory-conundrum/", "urlToImage": "https://scitechdaily.com/images/Game-Theory-Probability.jpg", "publishedAt": "2023-04-28T15:55:18Z", "content": "Game theory is a branch of mathematics that studies decision making and strategic interactions between individuals or groups. It is used to analyze situations in which participants must make choices … [+6713 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Conquering the Abyss: Navy's New DSEND Suit Revolutionizes Deep Sea Diving - SciTechDaily", "description": "The U.S. Navy has tested a revolutionary dive suit system, the Deep Sea Expeditionary with No Decompression (DSEND), which offers enhanced flexibility and safety for deep sea divers. The DSEND suit maintains steady internal pressure, eliminating the risk of d…", "url": "https://scitechdaily.com/conquering-the-abyss-navys-new-dsend-suit-revolutionizes-deep-sea-diving/", "urlToImage": "https://scitechdaily.com/images/US-Navy-Diver-Tests-DSEND-System.jpg", "publishedAt": "2023-04-28T14:30:16Z", "content": "A U.S. Navy diver (center) tests the Office of Naval Research-sponsored Deep Sea Expeditionary with No Decompression (DSEND) system at the Navy Experimental Diving Unit in Florida. DSEND includes a h… [+5179 chars]"}]}