{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Curiosity Rover Views First Dazzling “Sun Rays” on Mars - SciTechDaily", "description": "The veteran Martian rover captured a dazzling sunset at the start of a new cloud-imaging campaign. Although Martian sunsets are uniquely moody, NASA’s Curiosity rover captured one last month that really stands out. As the Sun descended over the horizon on Feb…", "url": "https://scitechdaily.com/nasas-curiosity-rover-views-first-dazzling-sun-rays-on-mars/", "urlToImage": "https://scitechdaily.com/images/NASA-Curiosity-Mars-Rover-Feather-Shaped-Iridescent-Cloud-scaled.jpg", "publishedAt": "2023-03-07T09:31:18Z", "content": "ByJet Propulsion LaboratoryMarch 7, 2023\r\nNASAs Curiosity Mars rover captured these sun rays shining through clouds at sunset on February 2, 2023, the 3,730th Martian day, or sol, of the mission. It … [+4523 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Problem of satellite trails marring Hubble images is growing worse - Phys.org", "description": "An international team of space scientists is drawing attention to the growing problem of satellite trails marring images taken by space-based telescopes such as Hubble. In their study, published in the journal Nature Astronomy, the group used data from more t…", "url": "https://phys.org/news/2023-03-problem-satellite-trails-marring-hubble.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/problem-of-satellite-t.jpg", "publishedAt": "2023-03-06T17:30:02Z", "content": "An international team of space scientists is drawing attention to the growing problem of satellite trails marring images taken by space-based telescopes such as Hubble. In their study, published in t… [+2724 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Look up! Full worm moon will appear in the morning sky TOMORROW - Daily Mail", "description": "A full worm moon will peak at 7:40 am ET, beaming brightly until Wednesday morning. The nickname comes from comes from how the ground would thaw, allowing earthworms to appear.", "url": "https://www.dailymail.co.uk/sciencetech/article-11826723/Look-worm-moon-rise-morning-sky-TOMORROW.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/06/16/68390365-0-image-a-7_1678119641372.jpg", "publishedAt": "2023-03-06T16:22:22Z", "content": "A full worm moon is set to appear in the morning sky Tuesday, marking the last full moon of astronomical winter and paving the way for spring in some parts of the world.\r\nThe nickname comes from Nati… [+4251 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Moment a powerful flare 10 TIMES the size of Earth explodes from our sun is captured by NASA - Daily Mail", "description": "NASA's Solar Dynamics Observatory has captured the moment a powerful X-class  solar flare , up to 10 times the size of Earth, shot out from a sunspot that has quadrupled in size over the past month.", "url": "https://www.dailymail.co.uk/sciencetech/article-11826369/Moment-powerful-flare-10-TIMES-size-Earth-explodes-sun-captured-NASA.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/06/15/68389051-0-image-a-6_1678117594398.jpg", "publishedAt": "2023-03-06T15:48:21Z", "content": "The moment a powerful flare exploded on our sun's surface was captured by NASA's Solar Dynamics Observatory.\r\nA strong X-class, which can be 10 times the size of Earth, was released from the blazing … [+5471 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Computing Breakthrough: Silicon Encoded Spin Qubits Achieve Universality - SciTechDaily", "description": "HRL Laboratories, LLC, has published the first demonstration of universal control of encoded spin qubits. This newly emerging approach to quantum computation uses a novel silicon-based qubit device architecture, fabricated in HRL’s Malibu cleanroom, to trap s…", "url": "https://scitechdaily.com/quantum-computing-breakthrough-silicon-encoded-spin-qubits-achieve-universality/", "urlToImage": "https://scitechdaily.com/images/Silicon-Encoded-Spin-Qubits-Universality.jpg", "publishedAt": "2023-03-06T14:59:41Z", "content": "Render of a six-dot SLEDGE device in silicon, which implemented universal logic with encoded spin qubits. Credit: HRL Laboratories\r\nHRL Laboratories, LLC, has published the first demonstration of uni… [+4956 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Organoid Intelligence” – Revolutionary Biocomputers Powered by Human Brain Cells - SciTechDaily", "description": "Despite AI’s impressive track record, its computational power pales in comparison with a human brain. Now, scientists unveil a revolutionary path to drive computing forward: organoid intelligence, where lab-grown brain organoids act as biological hardware. Ar…", "url": "https://scitechdaily.com/organoid-intelligence-revolutionary-biocomputers-powered-by-human-brain-cells/", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-Neural-Network-Concept-Art.jpg", "publishedAt": "2023-03-06T09:17:34Z", "content": "Scientists are collaborating across multiple fields to create biocomputers that utilize three-dimensional cultures of brain cells, called brain organoids, as biological hardware. They have outlined t… [+4852 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Why Finding Life On Mars Could Be The \"Worst News Ever\" For Humanity - IFLScience", "description": "\"Such a discovery would be a crushing blow. It would be by far the worst news ever printed on a newspaper cover.\"", "url": "https://www.iflscience.com/why-finding-life-on-mars-could-be-the-worst-news-ever-for-humanity-67835", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67835/aImg/66209/mars-meta.png", "publishedAt": "2023-03-06T08:38:00Z", "content": "You may have heard of the Fermi Paradox, but if you haven't, here it is in a nutshell: Given the high probability that alien life exists out there in the universe, why has nobody gotten in touch? If … [+3654 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Nasa's new science chief says 'it's the best job on the planet' - BBC", "description": "Dr Nicola Fox, originally from Hertfordshire, is the first woman to become Nasa's head of science.", "url": "https://www.bbc.com/news/uk-england-beds-bucks-herts-64855011", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/2FF3/production/_128857221_nicola_fox.jpg", "publishedAt": "2023-03-06T06:05:53Z", "content": "The first woman to become Nasa's head of science has said \"it's the best job on the planet\". \r\nDr Nicola Fox, Nasa's former director of Heliophysics, comes from Hertfordshire and now works in Washing… [+2166 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Stephen Luntz", "title": "Odds Of A Quantum Tunnelling Event Are One In A Hundred Billion - IFLScience", "description": "Quantum tunnelling is a rare event that should be impossible under classical physics, but it is only now we are learning just how rare real-world examples are.", "url": "https://www.iflscience.com/odds-of-a-quantum-tunneling-event-are-one-in-a-hundred-billion-67820", "urlToImage": "https://assets.iflscience.com/assets/articleNo/67820/aImg/66190/quantum-wall-meta.png", "publishedAt": "2023-03-06T04:25:00Z", "content": "The rate at which the rare but crucial quantum phenomenon known as tunneling occurs has been measured experimentally for the first time, and found to match theoretical calculations. The theoretical e… [+3357 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Time Is It on the Moon? Advancing a New Lunar Timezone - SciTechDaily", "description": "A new era of lunar exploration is on the rise, with dozens of Moon missions planned for the coming decade. Europe is in the forefront here, contributing to building the Gateway lunar station and the Orion spacecraft – set to return humans to our natural satel…", "url": "https://scitechdaily.com/what-time-is-it-on-the-moon-advancing-a-new-lunar-timezone/", "urlToImage": "https://scitechdaily.com/images/Moon-Surface-Scenario-scaled.jpg", "publishedAt": "2023-03-06T03:30:25Z", "content": "ByEuropean Space Agency (ESA)March 5, 2023\r\nA high-definition image of Earth taken by Japans Kaguya lunar orbiter in November 2007. Credit: JAXA/NHK\r\nA new era of lunar exploration is on the rise, wi… [+11936 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Surprises: Hubble Captures Stunning Movie of DART Asteroid Impact Debris - SciTechDaily", "description": "Never-Before-Seen Spacecraft Collision Yields Unexpected Surprises In 2022 NASA embarked on a bold experiment to see if they could change an asteroid's velocity by smacking it with a ballistic probe – kind of like hitting it with a hammer. This experiment was…", "url": "https://scitechdaily.com/unexpected-surprises-hubble-captures-stunning-movie-of-dart-asteroid-impact-debris/", "urlToImage": "https://scitechdaily.com/images/NASA-DART-Spacecraft-Prior-to-Impact-scaled.jpg", "publishedAt": "2023-03-05T21:15:37Z", "content": "BySpace Telescope Science InstituteMarch 5, 2023\r\nThis illustration depicts NASAs Double Asteroid Redirection Test (DART) spacecraft prior to impact at the Didymos binary asteroid system. Credit: NAS… [+11339 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Uncover Black Hole Closer to Earth Than Ever Before - SciTechDaily", "description": "Gemini North Telescope on Hawaii reveals first dormant, stellar-mass black hole. Astronomers have discovered the closest black hole to Earth, the first unambiguous detection of a dormant stellar-mass black hole in the Milky Way. Its close proximity to Earth, …", "url": "https://scitechdaily.com/astronomers-uncover-black-hole-closer-to-earth-than-ever-before/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Event-Horizon-Artistic-Illustration.jpg", "publishedAt": "2023-03-05T15:22:13Z", "content": "ByNational Science FoundationMarch 5, 2023\r\nAstronomers made a groundbreaking discovery by detecting a dormant stellar-mass black hole, the closest one to Earth yet found in the Milky Way. This first… [+5272 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "‘It’s like finding needles in a haystack’: the mission to discover if Jupiter’s moons support life - The Guardian", "description": "The European Space Agency’s Juice mission launches next month, flying closer to icy moons – including Ganymede, the solar system’s largest – than ever before", "url": "https://www.theguardian.com/science/2023/mar/05/could-jupiters-icy-moons-support-life", "urlToImage": "https://i.guim.co.uk/img/media/eddad817d3c0876402a7ea47796c7b24a5af07f9/0_400_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=c7b0059688f4d7aec95300a258d4db6b", "publishedAt": "2023-03-05T12:00:00Z", "content": "For most of the past 200 years, were you to ask an astronomer where the most likely place in the solar system is to find life, the answer will have been Mars. The red planet and its potential inhabit… [+12944 chars]"}]}