{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Over a Million Miles per Hour: NASA's Chandra Catches Pulsar in X-Ray Speed Trap - SciTechDaily", "description": "A pulsar is racing through the debris of an exploded star at a speed of over a million miles per hour. To measure this, researchers compared NASA Chandra X-ray Observatory images of G292.0+1.8 taken in 2006 and 2016. Pulsars can form when massive stars run ou…", "url": "https://scitechdaily.com/over-a-million-miles-per-hour-nasas-chandra-catches-pulsar-in-x-ray-speed-trap/", "urlToImage": "https://scitechdaily.com/images/Supernova-Remnant-G292-0-1-8.jpg", "publishedAt": "2022-06-18T18:16:50Z", "content": "This result may help explain how some pulsars are accelerated to such remarkably high speeds.The G292.0+1.8 supernova remnant contains a pulsar moving at over a million miles per hour. This image fea… [+5254 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Daisy Dobrijevic", "title": "Look up! See the moon shine near massive asteroid Vesta this weekend. - Space.com", "description": "The pair will be visible to observers using a widefield telescope eyepiece.", "url": "https://www.space.com/moon-approaches-asteroid-vesta-june-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/maJ6nbG6aPXDdF9DMKhVYm-1200-80.jpg", "publishedAt": "2022-06-18T11:13:10Z", "content": "In the early hours of Sunday morning (June 19) the waning moon will pass within a thumbs width of asteroid Vesta in the east-southeastern sky. \r\nDuring this close approach, the pair will share the vi… [+2696 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "New Images Show The Dust in Nearby Galaxies, And You've Never Seen Them Like This - ScienceAlert", "description": "When we see pictures of galaxies outside the Milky Way, what we're usually looking at is primarily the light of their stars. But stars are far from the only ingredient that makes up a galaxy. Think of stars as the chunks of vegetables in the galactic", "url": "https://www.sciencealert.com/new-images-show-the-dust-in-nearby-galaxies-and-you-ve-never-seen-them-like-this", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/andromeda-soup_1024.jpg", "publishedAt": "2022-06-18T03:05:33Z", "content": "When we see pictures of galaxies outside the Milky Way, what we're usually looking at is primarily the light of their stars. But stars are far from the only ingredient that makes up a galaxy. Think o… [+4386 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Green Light for Starship, Rouge Black Hole's Mass, Balancing Rock on Mars | Space Bites - Fraser Cain", "description": "FAA finally gave its approval to SpaceX for Starship launches from Boca Chica, Gaia released its third data drop, China stars continuous space presence, Pers...", "url": "https://www.youtube.com/watch?v=GyIMw-i5sLA", "urlToImage": "https://i.ytimg.com/vi/GyIMw-i5sLA/maxresdefault.jpg", "publishedAt": "2022-06-18T00:36:16Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Meteorite that landed on Earth 200 years ago upends previous theories of how Mars formed - Daily Mail", "description": "New analysis by the University of California, Davis suggests that the interior chemical make-up of Mars largely came from meteorite collisions, rather than from a giant cloud of gas as previously thought.", "url": "https://www.dailymail.co.uk/sciencetech/article-10927381/Meteorite-landed-Earth-200-years-ago-upends-previous-theories-Mars-formed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/17/16/59200927-0-image-a-49_1655481347800.jpg", "publishedAt": "2022-06-17T16:46:12Z", "content": "A meteorite that hit Earth more than 200 years ago could fundamentally change our understanding of how Mars was formed.\r\nMost of what we know about the Red Planet's interior comes from three space ro… [+5912 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "SpaceX launches a Falcon 9 booster for a record-setting 13th flight TODAY - Daily Mail", "description": "SpaceX has set a new record after it launched a Falcon 9 for its 13th flight. The booster took a new batch of 53 Starlinks to low Earth orbit, brining the constellation to more than 2,200.", "url": "https://www.dailymail.co.uk/sciencetech/article-10927685/SpaceX-set-launch-Falcon-9-booster-record-setting-13th-flight-TODAY.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/17/18/59203257-0-image-a-11_1655485971192.jpg", "publishedAt": "2022-06-17T15:40:37Z", "content": "Elon Musks SpaceX launched a Falcon 9 for its 13th flight on Friday, setting a new record for the most times one of its rockets have ventured off into space and returned safely back on Earth. \r\nThe t… [+6137 chars]"}]}