{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mind-Bending Discovery: Neutrons Defy Classical Physics in Astonishing Experiment - SciTechDaily", "description": "Is nature really as strange as quantum theory says — or are there simpler explanations? Neutron measurements prove: It doesn't work without the strange properties of quantum theory. Quantum theory allows particles to exist in superposition states, defying cla…", "url": "https://scitechdaily.com/mind-bending-discovery-neutrons-defy-classical-physics-in-astonishing-experiment/", "urlToImage": "https://scitechdaily.com/images/Abstract-Qubits-Quantum-Computing.jpg", "publishedAt": "2024-08-01T08:22:08Z", "content": "ByVienna University of TechnologyAugust 1, 2024\r\nQuantum particles can exist in superpositions, challenging classical realism. The Leggett-Garg inequality tests this, and neutron experiments at TU Wi… [+8689 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "Hubble spots a stunning spiral galaxy shining in the 'Little Lion' (image) - Space.com", "description": "NGC 3430 gets its moment in the spotlight!", "url": "https://www.space.com/hubble-classic-spiral-galaxy-ngc3430", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XDKYPr8E2JxnAszCVJrXQE-1200-80.png", "publishedAt": "2024-07-31T21:00:17Z", "content": "Hubble has just dropped more galactic eye candy!\r\nFrom its vantage point in low-Earth orbit, the Hubble Space Telescope recently captured an intricate portrait of the NGC 3430 galaxy, a classic spira… [+3981 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "Michael Heuer", "title": "Discovery Deep In Pacific Ocean Changes Everything We Know About Origin Of Life - Giant Freakin Robot", "description": "This discovery found on the ocean floor is so unbelievable that the scientists who discovered it thought it was a mistake!", "url": "https://www.giantfreakinrobot.com/sci/pacific-ocean-dark-oxygen.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2024/02/ocean-bubbles.jpg", "publishedAt": "2024-07-31T20:49:43Z", "content": "They used lab tests to determine microbes didnt create the dark oxygen. Then they took a closer look at the lumpy potato-sized sedimentary rock formations created when metals like manganese and cobal… [+708 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Aaron McCrea", "title": "Successful Static Fire Leads to Final Preparation Before Full Stack - NASASpaceflight.com", "description": "Activities at Starbase are on full throttle as Starship flight five pulls ever closer. Major…", "url": "https://www.nasaspaceflight.com/2024/07/starship-7-30-24/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2024/07/NSF-2024-07-31-21-05-54-814.jpg", "publishedAt": "2024-07-31T20:07:30Z", "content": "14Activities at Starbase are on full throttle as Starship flight five pulls ever closer. Major work has been completed on Launch Pad B, altering the skyline, glimpses of the future have been witnesse… [+6745 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "David Appell", "title": "New technique measures superconductivity at very high pressures - Phys.org", "description": "In 1911, Heike Kamerlingh Onnes discovered the first superconductor, metallic mercury when cooled to a critical temperature of 4.2 Kelvin, where it conducts electricity without resistance. Ever since materials scientists have been on a quest to better underst…", "url": "https://phys.org/news/2024-07-technique-superconductivity-high-pressures.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-technique-measures-1.jpg", "publishedAt": "2024-07-31T13:40:02Z", "content": "In 1911, Heike Kamerlingh Onnes discovered the first superconductor, metallic mercury when cooled to a critical temperature of 4.2 Kelvin, where it conducts electricity without resistance. Ever since… [+5505 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "New Map Of \"Hydrogen Forest\" Supports The Existence Of Dark Matter - IFLScience", "description": "Astrophysicists attempted to map dark matter indirectly, like pouring dye in a stream.", "url": "https://www.iflscience.com/new-map-of-hydrogen-forest-supports-the-existence-of-dark-matter-75339", "urlToImage": "https://assets.iflscience.com/assets/articleNo/75339/aImg/77880/indirect-map-of-dark-matter-meta.png", "publishedAt": "2024-07-31T12:33:50Z", "content": "A team of astrophysicists have mapped the Lyman-Alpha Forest\", and provided further supporting evidence that galaxy and galaxy cluster formations are better explained by dark matter than alternative … [+3141 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Lisa D. Sparks", "title": "Packing qubits into 'defects' in silicon chips could hasten the arrival of a future quantum internet - Livescience.com", "description": "Using manufacturing defects in silicon chips to house signal-amplifying qubits could help to usher in the much-anticipated quantum internet.", "url": "https://www.livescience.com/technology/computing/harnessing-defects-in-silicon-chips-to-store-signal-boosting-qubits-could-hasten-arrival-of-a-quantum-internet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4mZJPzKckhd8iVeufZrG9R-1200-80.jpg", "publishedAt": "2024-07-31T11:00:22Z", "content": "Researchers in quantum mechanics believe theyve found a standard way to assess the viability of quantum memory in silicon chips meaning existing components can be used as the fabric for a future quan… [+3002 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Parker Solar Probe Shatters Theory on Sun’s Extremely Hot Corona - SciTechDaily", "description": "NASA's Parker Solar Probe found that S-shaped magnetic field bends are not responsible for the sun's corona's extreme heat. While these switchbacks appear in the solar wind, they are absent in the corona. This discovery challenges the idea that magnetic field…", "url": "https://scitechdaily.com/nasas-parker-solar-probe-shatters-theory-on-suns-extremely-hot-corona/", "urlToImage": "https://scitechdaily.com/images/Yellow-Plasma-Sun-Surface.jpg", "publishedAt": "2024-07-31T08:16:51Z", "content": "ByDerek Smith, University of MichiganJuly 31, 2024\r\nThe Parker Solar Probe ruled out S-shaped bends in the suns magnetic field as the source of the coronas heat. These bends, common in the solar wind… [+10035 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Universe Today", "title": "New Study Challenges Established Theories About Moon's Early History - ScienceAlert", "description": "The origins of the Moon have been the cause of many a scientific debate over the years but more recently we seem to have settled on a consensus.", "url": "https://www.sciencealert.com/new-study-challenges-established-theories-about-moons-early-history", "urlToImage": "https://www.sciencealert.com/images/2021-04/processed/earth_theia_impact_1024.jpg", "publishedAt": "2024-07-31T05:18:40Z", "content": "The origins of the Moon have been the cause of many a scientific debate over the years but more recently we seem to have settled on a consensus. That a Mars-sized object crashed into Earth billions o… [+3601 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Rahul Rao", "title": "These inventive ideas could help Artemis astronauts make drinking water on the moon - Space.com", "description": "There's lots of water ice on the moon, but making it potable will require some work.", "url": "https://www.space.com/uk-canada-moon-water-purification-aqualunar-challenge", "urlToImage": "https://cdn.mos.cms.futurecdn.net/UPKjGwCRwhhgLwBijBd4hN-1200-80.jpg", "publishedAt": "2024-07-30T22:00:01Z", "content": "There's a simple reason that forthcoming NASA Artemis missions are slated to land around the moon's south pole: the area is thought to harbor lots of water ice. \r\nNot only can humans theoretically dr… [+3065 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Incredibly Worrying” – Alaskan Glacier Melting Accelerates, Approaching Irreversible Tipping Point - SciTechDaily", "description": "Recent research indicates a significant acceleration in the melting of the Juneau Icefield glaciers in Alaska, with glacier loss rates doubling since 2010 and potentially leading to irreversible declines earlier than predicted. This accelerated melting and in…", "url": "https://scitechdaily.com/incredibly-worrying-alaskan-glacier-melting-accelerates-approaching-irreversible-tipping-point/", "urlToImage": "https://scitechdaily.com/images/Alaskan-Glacier.jpg", "publishedAt": "2024-07-30T20:57:58Z", "content": "ByNewcastle UniversityJuly 30, 2024\r\nRecent research led by Newcastle University indicates that the Juneau Icefield in Alaska is experiencing unprecedented glacier loss, with the rate of ice thinning… [+5928 chars]"}]}