{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hackaday"}, "author": "Donald Papp", "title": "The Ultimate Seed Vault Backup? How About The Moon - Hackaday", "description": "A safe haven to preserve samples of biodiversity from climate change, habitat loss, natural disaster, and other threats is recognized as a worthwhile endeavor. Everyone knows good backup practice i…", "url": "https://hackaday.com/2024/08/04/the-ultimate-seed-vault-backup-how-about-the-moon/", "urlToImage": "https://hackaday.com/wp-content/uploads/2024/08/Moon-Earth-View-featured.png", "publishedAt": "2024-08-05T05:00:00Z", "content": "A safe haven to preserve samples of biodiversity from climate change, habitat loss, natural disaster, and other threats is recognized as a worthwhile endeavor. Everyone knows good backup practice inv… [+1226 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "Using data from DART's impact, scientists investigate characteristics of Dimorphos and Didymos - NASASpaceflight.com", "description": "In September 2022, NASA’s Double Asteroid Redirection Test (DART) mission successfully slammed into the side…", "url": "https://www.nasaspaceflight.com/2024/08/dart-impact-data/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/09/DART_still-revisedA-622x350.jpeg", "publishedAt": "2024-08-04T21:41:11Z", "content": "3In September 2022, NASAs Double Asteroid Redirection Test (DART) mission successfully slammed into the side of asteroid moonlet Dimorphos. Initial data from the event indicated that DART had success… [+6544 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Scott Travers", "title": "A Herpetologist Spotlights The 4 ‘Coolest’ Extinct Reptiles (Hint: None Are Dinosaurs) - Forbes", "description": "Extinct species are every bit as interesting as those that are found in the wild today–perhaps moreso. Here are four reptiles that would make your jaw drop if they had survived into the present-day.", "url": "https://www.forbes.com/sites/scotttravers/2024/08/04/a-herpetologist-spotlights-the-4-coolest-extinct-reptiles-hint-none-are-dinosaurs/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66aa4996313c897e8e12664d/0x0.jpg?format=jpg&crop=1881,881,x94,y0,safe&height=900&width=1600&fit=bounds", "publishedAt": "2024-08-04T20:11:32Z", "content": "Extinct species are every bit as interesting as those that are found in the wild todayperhaps ... [+] moreso. Here are four reptiles that would make your jaw drop if they had survived into the presen… [+5229 chars]"}]}