{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "Japan's SLIM 'moon sniper' lander arrives in lunar orbit for Christmas - Space.com", "description": "SLIM will attempt to pull off Japan's first-ever moon landing next month.", "url": "https://www.space.com/japan-slim-moon-lander-arrives-lunar-orbit", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E6bm6JHy7uB5vfnhPb7Uak-1200-80.jpg", "publishedAt": "2023-12-25T14:10:56Z", "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Saturn's Seasonal Spectacle: Hubble's Ultra-Sharp Vision Unveils Ring Spoke Phenomenon - SciTechDaily", "description": "Levitated Dust Takes a Carousel Ride Around the Giant Ringworld Though Saturn's unusual-looking \"cup handle\" features were first noted by Galileo in 1610, it would be another 45 years before they were described by Christiaan Huygens as a disk surrounding Satu…", "url": "https://scitechdaily.com/saturns-seasonal-spectacle-hubbles-ultra-sharp-vision-unveils-ring-spoke-phenomenon/", "urlToImage": "https://scitechdaily.com/images/Hubble-Saturn-October-2023.jpg", "publishedAt": "2023-12-25T11:05:47Z", "content": "This photo of Saturn was taken by NASA’s Hubble Space Telescope on October 22, 2023, when the ringed planet was approximately 850 million miles from Earth. Hubble’s ultra-sharp vision reveals a pheno… [+4444 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Amanda Heidt", "title": "Which animal is the best hunter? (And which is the worst?) - Livescience.com", "description": "There are lots of ways to measure predatory prowess, and the animal kingdom is full of worthy contenders.", "url": "https://www.livescience.com/animals/which-animal-is-the-best-hunter-and-which-is-the-worst", "urlToImage": "https://cdn.mos.cms.futurecdn.net/XEJRiSASHpHXFiyyidXCAb-1200-80.jpg", "publishedAt": "2023-12-25T10:00:00Z", "content": "The animal kingdom is full of predators and prey, with some predators being extraordinary killers. But there are many ways to catch a meal and many ways to define what makes a successful predator.\r\nS… [+4491 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Have Determined the Cause of Lethal Climate Change That Occurred Millions of Years Ago - SciTechDaily", "description": "New research reveals that Earth's geological history is tied to astronomical motions—not just the planet’s interior. A team of scientists has concluded that that has occurred over the past 260 million years and brought about mass extinctions of life during th…", "url": "https://scitechdaily.com/scientists-have-determined-the-cause-of-lethal-climate-change-that-occurred-millions-of-years-ago/", "urlToImage": "https://scitechdaily.com/images/Global-Warming-Earth-Climate-Crisis-Concept-Art.jpg", "publishedAt": "2023-12-25T00:22:31Z", "content": "Scientists have linked mass extinctions and climate change over the past 260 million years to massive volcanic eruptions and Earth’s astronomical cycles. This research, emphasizing the role of CO2 em… [+3795 chars]"}, {"source": {"id": null, "name": "HeritageDaily"}, "author": "Mark Milligan", "title": "Ancient celestial map found at Castelliere di Rupinpiccolo - HeritageDaily", "description": "Castelliere di Rupinpiccolo is an ancient hillfort, located in the Province of Trieste, Italy. - HeritageDaily - Archaeology News", "url": "https://www.heritagedaily.com/2023/12/ancient-celestial-map-found-at-castelliere-di-rupinpiccolo/150031", "urlToImage": "https://www.heritagedaily.com/wp-content/uploads/2023/12/celestialmap1.jpg", "publishedAt": "2023-12-24T20:36:18Z", "content": "Castelliere di Rupinpiccolo is an ancient hillfort, located in the Province of Trieste, Italy.\r\nThe hillfort housed a fortified settlement that emerged during the Middle Bronze Age, with archaeologic… [+2139 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Mario Petzold", "title": "Creating gold: Physicists show how the precious metal is created - Notebookcheck.net", "description": "Alchemists puzzled over it for centuries, physicists have now been able to calculate it precisely. A comprehensive model shows how gold and other precious, rare and heavy metals are formed. The only ingredients: Just two neutron stars.", "url": "https://www.notebookcheck.net/Creating-gold-Physicists-show-how-the-precious-metal-is-created.787120.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc4/20231224-neutronensterne2.jpg", "publishedAt": "2023-12-24T18:06:14Z", "content": "When a violent shake of space-time hit the Earth on August 17, 2017, it was not only possible to measure gravitational waves for the first time, which had previously only existed in theory. It also p… [+1690 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "SIx historical mysteries decoded by scientists in 2023 - Geo News", "description": "Paleogenetics, artificial intelligence, and chemical analysis have played pivotal roles in illuminating the past", "url": "https://www.geo.tv/latest/524309-6-historical-mysteries-decoded-by-scientists-in-2023", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-12-24/l_524309_080711_updates.jpg", "publishedAt": "2023-12-24T16:09:00Z", "content": "In 2023, scientific advancements have unravelled captivating mysteries of human history, revealing secrets concealed for millennia. \r\nPaleogenetics, artificial intelligence, and chemical analysis hav… [+1743 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Rizwan Choudhury", "title": "Jupiter's atmosphere probed by ESPRESSO spectrograph - Interesting Engineering", "description": "This technique allows them to determine the speed of the clouds relative to the Earth by measuring the shift in the wavelength of the reflected light.", "url": "https://interestingengineering.com/science/jupiters-wind-speeds-measured-by-exoplanet-hunting-instrument", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/12/24/image/jpeg/qX4FWNLTqWslM5tbGTBosL46pfDDztBinK94a3BE.jpg", "publishedAt": "2023-12-24T13:42:00Z", "content": "ESPRESSO spectrograph control console, during the observation of Jupiter with one of the VLT telescopes, at the Paranal Observatory, in Chile.\r\nPedro Machado \r\nDoppler velocimetry\r\nThe study also dem… [+1414 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "ESA's Mars Express continues to avoid retirement home - The Register", "description": "Another chunk of science, another mission extension. But probe is running on fumes", "url": "https://www.theregister.com/2023/12/24/mars_express_mission_extension/", "urlToImage": "https://regmedia.co.uk/2022/03/01/mars_shutterstock.jpg", "publishedAt": "2023-12-24T09:54:00Z", "content": "Space Extenders II The Mars Express recorded the highest clouds ever seen above the surface of a planet, as well as water ice on Mars' polar caps. And although the veteran spacecraft is now seemingly… [+5250 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Christopher McFadden", "title": "OSIRIS finally gets a new name for its bonus mission to Apophis - Interesting Engineering", "description": "NASA's highly successful asteroid probe OSIRIS has officially been given its new name OSIRIS-APEX for its bonus mission to Apophis.", "url": "https://interestingengineering.com/science/osiris-enroute-to-new-asteroid", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/12/23/image/jpeg/fllPjnq1cIhH8nr8GbbOLpJ2kPANFLc5xs9D0t6c.jpg", "publishedAt": "2023-12-24T04:27:00Z", "content": "OSIRIS-APEX will study Apophis immediately after such a pass, allowing us to see how its surface changes by interacting with Earths gravity, said Amy Simon, the missions project scientist based at NA… [+1388 chars]"}]}