{"status": "ok", "totalResults": 27, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Cellular Custodians: 'Big Eater' Macrophages May Hold Key to Autoimmune Disease Treatment - Neuroscience News", "description": "This discovery may offer a key to the treatment of currently incurable autoimmune diseases.", "url": "https://neurosciencenews.com/macrophages-autoimmune-disease-23440/", "urlToImage": "https://neurosciencenews.com/files/2023/06/macrophage-autoimmunne-neurosinces.jpg", "publishedAt": "2023-06-12T14:16:38Z", "content": "Summary: The mysterious workings of tingible body macrophages (TBMs) have been substantially demystified. These TBMs, a subtype of macrophages within our lymph nodes, were found to devour antibody-pr… [+9685 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Lisa Feldman Barrett", "title": "An evolutionary history of the human brain, in 7 minutes - Big Think", "description": "Plato and Carl Sagan were wrong about the human brain, says a top neuroscientist.", "url": "https://bigthink.com/the-well/the-evolution-of-the-human-brain/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/06/A-Web-Barrett.jpg?resize=1200,630", "publishedAt": "2023-06-12T13:00:31Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Top Guns of AI: MIT's Maverick Approach Toward Safe and Reliable Autopilots for Flying - SciTechDaily", "description": "A new AI-based approach for controlling autonomous robots satisfies the often-conflicting goals of safety and stability. In the film “Top Gun: Maverick,” Maverick, played by Tom Cruise, is charged with training young pilots to complete a seemingly impossible …", "url": "https://scitechdaily.com/top-guns-of-ai-mits-maverick-approach-toward-safe-and-reliable-autopilots-for-flying/", "urlToImage": "https://scitechdaily.com/images/AI-Pilot-Concept.jpg", "publishedAt": "2023-06-12T09:42:02Z", "content": "ByAdam Zewe, Massachusetts Institute of TechnologyJune 12, 2023\r\nMIT researchers have developed an AI-based method to improve safety and stability in autonomous robots, successfully addressing the st… [+8323 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Is THIS the solution to global warming? Scientist claims we should MOVE the Earth away from the sun - Daily Mail", "description": "EXCLUSIVE: Albert Zijlstra, a professor of astrophysics at the University of Manchester, suggests shifting Earth further back from the sun by about three million miles.", "url": "https://www.dailymail.co.uk/sciencetech/article-12165975/Is-solution-global-warming-Scientist-claims-Earth-away-sun.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/16/71961435-0-image-a-6_1686325779017.jpg", "publishedAt": "2023-06-12T07:02:19Z", "content": "Astronomers know full well that the sun is very slowly getting brighter, and in a billion or so years time it will make Earth too hot to live on. \r\nOne scientist is now proposing a radical solution t… [+7004 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Half The Gut Microbes In Our Primate Ancestors Abandoned Us - ScienceAlert", "description": "There are all kinds of bacteria living in our gut, contributing to the healthy (or unhealthy) processes going on inside our bodies, but it turns out that we've lost a lot of the microbes that we once shared with our ancient primate ancestors.", "url": "https://www.sciencealert.com/half-the-gut-microbes-in-our-primate-ancestors-abandoned-us", "urlToImage": "https://www.sciencealert.com/images/2023/06/ChimpanzeesWatching.jpg", "publishedAt": "2023-06-12T06:31:12Z", "content": "There are all kinds of bacteria living in our gut, contributing to the healthy (or unhealthy) processes going on inside our bodies, but it turns out that we've lost a lot of the microbes that we once… [+3380 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Characterizing Singular Atoms Using X-Ray Spectroscopy And Scanning Tunneling Microscopy - Hackaday", "description": "Scanning Tunneling Microscopes (STMs) are amazing tools which can manipulate singular atoms, but they cannot characterize these atoms as they act only on the outer electron shell. Meanwhile X-ray s…", "url": "https://hackaday.com/2023/06/11/characterizing-singular-atoms-using-x-ray-spectroscopy-and-scanning-tunneling-microscopy/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/06/single_atom_sx-stm_ajayi_et_al_2023.png", "publishedAt": "2023-06-12T05:00:00Z", "content": "Scanning Tunneling Microscopes (STMs) are amazing tools which can manipulate singular atoms, but they cannot characterize these atoms as they act only on the outer electron shell. Meanwhile X-ray spe… [+1934 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Physicists Conduct The Most Massive Test Ever of The Einstein-Podolsky-Rosen Paradox - ScienceAlert", "description": "In the most massive test to date, physicists have probed a major paradox in quantum mechanics and found it still holds even for clouds of hundreds of atoms.", "url": "https://www.sciencealert.com/physicists-conduct-the-most-massive-test-ever-of-the-einstein-podolsky-rosen-paradox", "urlToImage": "https://www.sciencealert.com/images/2023/06/quantum-entanglement.jpg", "publishedAt": "2023-06-12T04:31:11Z", "content": "In the most massive test to date, physicists have probed a major paradox in quantum mechanics and found it still holds even for clouds of hundreds of atoms.\r\nUsing two entangled Bose-Einstein condens… [+5313 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers “Split” Phonons in Step Toward New Type of Linear Mechanical Quantum Computer - SciTechDaily", "description": "The experiments are the first of their kind and could lead to new advances in computing. A team at the University of Chicago has explored the quantum properties of phonons, the quantum particles that transmit sound. They have shown that phonons can be \"split\"…", "url": "https://scitechdaily.com/researchers-split-phonons-in-step-toward-new-type-of-linear-mechanical-quantum-computer/", "urlToImage": "https://scitechdaily.com/images/Researchers-Split-Phonons.jpg", "publishedAt": "2023-06-12T03:07:12Z", "content": "ByUniversity of ChicagoJune 11, 2023\r\nArtists impression of a platform for linear mechanical quantum computing (LMQC). The central transparent element is a phonon beam splitter. Blue and red marbles … [+9612 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars As Never Seen Before: ESA's Mars Express New Global Color Mosaic - SciTechDaily", "description": "ESA's Mars Express mission has released a color-rich, detailed mosaic of Mars to mark its 20th anniversary, using high-altitude images that reveal unprecedented color variations and the planet's diverse composition. The mosaic highlights reddish oxidized iron…", "url": "https://scitechdaily.com/mars-as-never-seen-before-esas-mars-express-new-global-color-mosaic/", "urlToImage": "https://scitechdaily.com/images/Global-Mars-in-Color-scaled.jpg", "publishedAt": "2023-06-12T00:13:52Z", "content": "ByEuropean Space Agency (ESA)June 11, 2023\r\nTo mark 20 years of ESAs Mars Express, the High Resolution Stereo Camera (HRSC) team has produced a new global color mosaic: Mars as never seen before. The… [+8025 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "From Thought to Text: AI Converts Silent Speech into Written Words - Neuroscience News", "description": "A novel artificial intelligence system, the semantic decoder, can translate brain activity into continuous text.", "url": "https://neurosciencenews.com/thoight-text-ai-decoder-23437/", "urlToImage": "https://neurosciencenews.com/files/2023/06/ai-thought-speech-neurosuce.jpg", "publishedAt": "2023-06-11T19:51:28Z", "content": "Summary: A novel artificial intelligence system, the semantic decoder, can translate brain activity into continuous text. The system could revolutionize communication for people unable to speak due t… [+6687 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genetic Jigsaw: Piecing Together the Human Pangenome - SciTechDaily", "description": "Dr. Eimear Kenny, a renowned professor of Medicine, Genetics, and Genomic Sciences at the Icahn School of Medicine at Mount Sinai, has made substantial contributions to the international Human Pangenome Reference Consortium, leading to the creation of a more …", "url": "https://scitechdaily.com/genetic-jigsaw-piecing-together-the-human-pangenome/", "urlToImage": "https://scitechdaily.com/images/Human-Puzzle-Pieces-Illustration-Art.jpg", "publishedAt": "2023-06-11T18:43:40Z", "content": "ByThe Mount Sinai Hospital / Mount Sinai School of MedicineJune 11, 2023\r\nDr. Eimear Kenny has significantly contributed to the creation of an inclusive human pangenome reference, led by the internat… [+12570 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Nasa to the rescue after potential internet apocalypse - The News International", "description": "Nasa has come to the world's rescue to avoid a potential threat to internet access, better known as the internet apocalypse, a situation that might end people's access to the internet for months or...", "url": "https://www.thenews.com.pk/latest/1079454-nasa-to-the-rescue-after-potential-internet-apocalypse", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-11/1079454_105253_updates.jpg", "publishedAt": "2023-06-11T18:31:00Z", "content": "Nasa has come to the world's rescue to avoid a potential threat to internet access, better known as the internet apocalypse, a situation that might end people's access to the internet for months or y… [+1957 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exotic Matter Uncovered: Physicists Stumble Upon a Material Composed of Bosons - SciTechDaily", "description": "Take a lattice — a flat section of a grid of uniform cells, like a window screen or a honeycomb — and lay another, similar lattice above it. But instead of trying to line up the edges or the cells of both lattices, give the top grid a twist so that you can se…", "url": "https://scitechdaily.com/?p=284932", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Exotic-Material.jpg", "publishedAt": "2023-06-11T17:32:22Z", "content": "Scientists have discovered a new state of matter, termed a bosonic correlated insulator, through the interaction of bosonic particles called excitons. This research could pave the way for new underst… [+5197 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "China to launch lunar telescope in 2026 - The News International", "description": "Just when people believed there were enough satellites in space, China announced its plans to launch a satellite constellation that orbits the moon in an attempt to explore the early days of the...", "url": "https://www.thenews.com.pk/latest/1079434-china-to-launch-lunar-telescope-in-2026", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-06-11/1079434_091402_updates.jpg", "publishedAt": "2023-06-11T16:31:00Z", "content": "Just when people believed there were enough satellites in space, China announced its plans to launch a satellite constellation that orbits the moon in an attempt to explore the early days of the univ… [+1828 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lost in Space? Why – and How – NASA Gives a Name to Every Spot It Studies on Mars - SciTechDaily", "description": "Martian maps are full of monikers recognizing places on Earth, explorers, and even cartoon characters. NASA’s Perseverance rover is currently investigating rock outcrops alongside the rim of Mars’ Belva Crater. Some 2,300 miles (3,700 kilometers) away, NASA’s…", "url": "https://scitechdaily.com/lost-in-space-why-and-how-nasa-gives-a-name-to-every-spot-it-studies-on-mars/", "urlToImage": "https://scitechdaily.com/images/Belva-Crater-Mars-Close-Up.jpg", "publishedAt": "2023-06-11T16:18:09Z", "content": "ByJet Propulsion LaboratoryJune 11, 2023\r\nThis image from a map of Jezero Crater shows the area NASAs Perseverance Mars rover is currently exploring, including Belva Crater, just below the center of … [+7715 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "What would happen if you fell in a black hole? - Daily Mail", "description": "MailOnline looks at five gruesome deaths that could happen due to astronomical events, from being swallowed by a black hole to a collision with another galaxy.", "url": "https://www.dailymail.co.uk/sciencetech/article-12139805/What-happen-fell-black-hole.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/31/15/71615069-0-image-a-48_1685545027682.jpg", "publishedAt": "2023-06-11T14:55:27Z", "content": "For all the chaos going on down here on Earth, it's easy to forget that we live in a volatile galaxy full of formidable dangers. \r\nFrom space rocks flying at thousands of miles per hour, to black hol… [+13027 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Final countdown? Celebrity supergiant star Betelgeuse in its last flicker - Geo News", "description": "An expert from Japan believes that the core will collapse a few tens of years after the carbon exhaustion", "url": "https://www.geo.tv/latest/492545-final-countdown-celebrity-supergiant-star-betelgeuse-in-its-last-flicker", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-06-11/492545_064950_updates.jpg", "publishedAt": "2023-06-11T13:40:05Z", "content": "Scientists have started debating about when Betelgeuse a red giant star around 500 to 600 lightyears away is going to die in an explosion, as it glowing at 150% of its baseline brightness, becoming a… [+2593 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Paul M. Sutter", "title": "We Might Soon Detect the Gravitational Waves from Dying Stars - Universe Today", "description": "Researchers have discovered an exciting new source of gravitational waves. They are the remnants left over from a supernova explosion.", "url": "https://www.universetoday.com/161795/we-might-soon-detect-the-gravitational-waves-from-dying-stars/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2021/06/remnant.jpg", "publishedAt": "2023-06-11T11:25:49Z", "content": "Researchers have discovered an exciting new source of gravitational waves. They are the remnants left over from a supernova explosion, and they may just reveal the secrets to how those explosions wor… [+3520 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Waugh Tech Correspondent", "title": "This is what the space colonies of the near future might look like, according to experts - Daily Mail", "description": "Human exploration of space will begin with 'technauts' building structures near Earth, experts say.", "url": "https://www.dailymail.co.uk/sciencetech/article-12177475/This-space-colonies-near-future-look-like-according-experts.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/12/71951947-0-image-a-2_1686309202836.jpg", "publishedAt": "2023-06-11T09:31:07Z", "content": "From Interstellar to the Martian, human space exploration has been a key feature in science fiction blockbusters throughout the years. \r\nBut what will human colonies in space look like in reality?  \r… [+9435 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Transient Radio Pulses Provide Clues to Mysterious Origin - SciTechDaily", "description": "A mysterious cosmological object in a distant dwarf galaxy is producing Fast Radio Bursts (FRBs), with new research revealing a rare astronomical environment around its source, where magnetic fields twist and undulate. This is the first observation of a magne…", "url": "https://scitechdaily.com/strange-transient-radio-pulses-provide-clues-to-mysterious-origin/", "urlToImage": "https://scitechdaily.com/images/Green-Bank-Telescope-FRB-Directional-Changes.jpg", "publishedAt": "2023-06-11T08:48:27Z", "content": "ByGreen Bank ObservatoryJune 11, 2023\r\nThe Green Bank Telescope was able to observe the directional changes of waves from FRB20190520B as viewed through the lens of a massive stars atmosphere. Credit… [+5649 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "White Dwarf Star Enters Its Crystallization Era, Turning Into A 'Cosmic Diamond' - ScienceAlert", "description": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky.", "url": "https://www.sciencealert.com/white-dwarf-star-enters-its-crystallization-era-turning-into-a-cosmic-diamond", "urlToImage": "https://www.sciencealert.com/images/2023/06/diamond-star.jpg", "publishedAt": "2023-06-11T06:01:15Z", "content": "To us, stars may resemble cut jewels, glittering coldly against the velvet darkness of the night sky. And for some of them, that may actually be sort of true.\r\nAs a certain type of dead star cools, i… [+5584 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Gravitational Waves To Explore the Early Universe and Answer Fundamental Questions in Cosmology - SciTechDaily", "description": "A recent study reveals a new mechanism for the production of gravitational waves, involving oscillons—localized non-linear structures that form from oscillating fields. These oscillons, formed after the rapid expansion of the Universe during the inflationary …", "url": "https://scitechdaily.com/harnessing-gravitational-waves-to-explore-the-early-universe-and-answer-fundamental-questions-in-cosmology/", "urlToImage": "https://scitechdaily.com/images/Inflaton-Field-Fragmented-Into-Oscillons.jpg", "publishedAt": "2023-06-10T22:41:16Z", "content": "ByKavli IPMUJune 10, 2023\r\nFigure 1. Schematic of the inflaton field fragmented into oscillons, with superimposed gravitational waves. Credit: Kavli IPMU, Volodymyr Takhistov\r\nA recent study reveals … [+4170 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Built Into the Genome of the Microbes – Scientists Uncover Over 30,000 “Hidden” Viruses - SciTechDaily", "description": "Unveiled within the DNA of unicellular organisms lie thousands of enigmatic viruses. Researchers at the University of Innsbruck, utilizing the high-performance computing cluster known as \"Leo,\" have identified more than 30,000 new viruses embedded within the …", "url": "https://scitechdaily.com/built-into-the-genome-of-the-microbes-scientists-uncover-over-30000-hidden-viruses/", "urlToImage": "https://scitechdaily.com/images/Stowaways-in-the-Genome-scaled.jpg", "publishedAt": "2023-06-10T19:50:57Z", "content": "ByUniversity of InnsbruckJune 10, 2023\r\nThe scientists analysed several gigabyte of microbial DNA sequences. Credit: Fabian Oswald\r\nUnveiled within the DNA of unicellular organisms lie thousands of e… [+6072 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Bella Richards", "title": "Gravimeter for ESA's Hera mission is ready to launch to Dimorphos asteroid - NASASpaceFlight.com - NASASpaceflight.com", "description": "A tiny instrument that can measure the gravity levels of an asteroid has completed its…", "url": "https://www.nasaspaceflight.com/2023/06/grass-update/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/06/Juventas_CubeSat_coming_in_for_asteroid_landing_pillars.jpg", "publishedAt": "2023-06-10T18:35:01Z", "content": "6A tiny instrument that can measure the gravity levels of an asteroid has completed its ground tests, pushing the European Space Agencys (ESA) Hera mission closer to launch. Hera will complete the fi… [+8788 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Artificial photosynthesis could help astronauts breathe on Mars - Interesting Engineering", "description": "\"This work seeks to establish the theoretical foundations of PEC devices on the Moon and Mars and delivers the first foray into utilizing them for oxygen.\"", "url": "https://interestingengineering.com/science/artificial-photosynthesis-astronauts-mars", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/06/10/image/jpeg/6nXTwE8CyivWtlwq7Rbj8AmAUiZqzMT6sVzP5OmK.jpg", "publishedAt": "2023-06-10T16:40:00Z", "content": "Whereas plants rely on chlorophyll to absorb light, the proposed device would instead utilize semiconductor materials coated with metallic catalysts that support the desired chemical reaction.\r\nFurth… [+1180 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}]}