{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Donna Lu", "title": "‘This one’s for the dinosaurs’: how the world reacted to Nasa’s asteroid smashing success - The Guardian", "description": "Astrophiles and professionals celebrated humanity’s accomplishment at hitting a speeding space rock with a probe the size of a vending machine", "url": "https://amp.theguardian.com/science/2022/sep/28/this-ones-for-the-dinosaurs-how-the-world-reacted-to-nasas-asteroid-smashing-success", "urlToImage": null, "publishedAt": "2022-09-27T22:12:00Z", "content": "SpaceAstrophiles and professionals celebrated humanitys accomplishment at hitting a speeding space rock with a probe the size of a vending machine\r\nThe crashing of a spacecraft is, for once, a cause … [+2532 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Detect a Neighboring Galaxy Filled With Dark Matter - SciTechDaily", "description": "Researchers have used gamma rays to detect a small neighboring galaxy. According to a new study recently published in the journal Nature Astronomy, an international team of researchers has discovered a small satellite galaxy of the Milky Way filled with dark …", "url": "https://scitechdaily.com/scientists-detect-a-neighboring-galaxy-filled-with-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Sagittarius-Galaxy.jpg", "publishedAt": "2022-09-27T20:55:24Z", "content": "ByKavli Institute for the Physics and Mathematics of the UniverseSeptember 27, 2022\r\nA small satellite galaxy (green globe on the bottom left) of the Milky Way called Sagittarius has been observed fr… [+5347 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jade Hobman", "title": "Jupiter will be the closest it has been in 59 years in Australia for the next few nights - Daily Mail", "description": "Jupiter will be making a close encounter for the first time in almost 60 years, with Australians able to see the gas giant up close at sunset, sunrise and through the night for the coming weeks.", "url": "https://www.dailymail.co.uk/news/article-11253165/Jupiter-closest-59-years-Australia-nights.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/27/06/62831577-0-image-a-30_1664254821960.jpg", "publishedAt": "2022-09-27T06:56:29Z", "content": "Jupiter will be brighter and bigger in night skies as it swings by our planet at the closest distance it has been in 59 years. \r\nAustralians will be able to see the largest planet up close in the com… [+5332 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Hurricane Ian forces Nasa to shelter Artemis Moon rocket - BBC", "description": "The Artemis-I vehicle will be pulled off the launch pad in Florida to protect it from storm forces.", "url": "https://www.bbc.com/news/science-environment-63036757", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1B58/production/_126800070_index.jpg", "publishedAt": "2022-09-26T14:57:18Z", "content": "By Jonathan AmosBBC Science Correspondent\r\nThe American space agency is to pull its Artemis-I Moon rocket off the launch pad in Florida because of an approaching hurricane.\r\nNasa says the Space Launc… [+2030 chars]"}]}