{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Chris Bergin", "title": "Amid Starship milestones, Booster 7 set to return for pre-launch testing - NASASpaceFlight.com - NASASpaceflight.com", "description": "SpaceX’s Starship program continues to march through a fluid set of milestones, ranging from a…", "url": "https://www.nasaspaceflight.com/2022/10/starship-booster-7-return/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2009/06/Screen_Shot_2022-09-21_at_1.53.15_PM-wmarked-509x350.png", "publishedAt": "2022-10-02T20:27:58Z", "content": "SpaceXs Starship program continues to march through a fluid set of milestones, ranging from a new record number of Raptor engines firing simultaneously, to the anticipated presence of a vehicle on th… [+7284 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Keith Cooper", "title": "Missing element for life may be present in ocean of Saturn's moon Enceladus - Space.com", "description": "The chances of life on Enceladus have just risen thanks to a new understanding of the chemistry of the moon's ocean.", "url": "https://www.space.com/saturn-moon-enceladus-ocean-phosphorus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hqF5Gf4CtFmmrbFkDJSXjY-1200-80.jpg", "publishedAt": "2022-10-02T10:00:34Z", "content": "The ocean inside Saturn's moon Enceladus may be enriched with phosphorus, an important element for life as we know it, new research reveals.\r\nPhosphorus is a vital component of life's biochemistry. F… [+3838 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Ingenuity Helicopter Spots Foreign Object Debris on Mars - SciTechDaily", "description": "Footage from the Mars helicopter’s navigation camera reveals a small piece of foreign object debris (FOD). During a portion of the Ingenuity Mars helicopter’s 33rd flight, a small piece of foreign object debris (FOD) was seen in footage (see video below) from…", "url": "https://scitechdaily.com/nasas-ingenuity-helicopter-spots-foreign-object-debris-on-mars/", "urlToImage": "https://scitechdaily.com/images/Mars-Helicopter-Sol-254-Navigation-Camera.jpg", "publishedAt": "2022-10-02T09:23:07Z", "content": "ByNASA/JPLOctober 2, 2022\r\nNASAs Ingenuity Mars Helicopter acquired this image using its navigation camera. This camera is mounted in the helicopters fuselage and pointed directly downward to track t… [+2211 chars]"}, {"source": {"id": null, "name": "Spiked"}, "author": "Norman Lewis", "title": "NASA's DART: science fiction has become reality - Spiked", "description": "We could soon be able to save the Earth from incoming asteroids.", "url": "https://www.spiked-online.com/2022/10/01/nasas-dart-science-fiction-has-become-reality/", "urlToImage": "https://www.spiked-online.com/wp-content/uploads/2022/09/dart-1536x864.jpg", "publishedAt": "2022-10-01T14:47:35Z", "content": "The destruction of a multimillion-dollar spacecraft is not normally something to celebrate. But the crashing of NASAs Double Asteroid Redirection Test (DART) spacecraft into an asteroid is an importa… [+3500 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "When is October's partial solar eclipse and who can see it? - Space.com", "description": "Just before Halloween 2022, the sun will appear as if a monstrous bite has been taken from it as the moon's shadow falls on parts of the Earth.", "url": "https://www.space.com/when-is-october-partial-solar-eclipse-october-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rSSaSGshfhxzKybPiJNgTP-1200-80.jpg", "publishedAt": "2022-10-01T10:00:26Z", "content": "On Tuesday, Oct. 25, 2022, just six days before Halloween the moon will pass in front of the sun creating a partial solar eclipse. The sun\r\n will appear as if a huge bite has been taken from it depen… [+3583 chars]"}]}