{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dark Matter May Not Exist: These Physicists Favor of a New Theory of Gravity - SciTechDaily", "description": "Using Newton’s laws of physics, we can model the motions of planets in the Solar System quite accurately. However, in the early 1970s, scientists discovered that this didn’t work for disc galaxies – stars at their outer edges, far from the gravitational force…", "url": "https://scitechdaily.com/dark-matter-may-not-exist-these-physicists-favor-of-a-new-theory-of-gravity/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-Spin.gif", "publishedAt": "2022-07-10T19:09:05Z", "content": "ByIndranil Banik, Postdoctoral Research Fellow of Astrophysics, University of St AndrewsJuly 10, 2022Dark matter was proposed to explain why stars at a galaxys far edge were able to move much faster … [+7559 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Building blocks of life found floating in Milky Way in discovery that suggests we are not alone - The Telegraph", "description": "The find increases the chances that life could have evolved on other planets across the galaxy", "url": "https://www.telegraph.co.uk/news/2022/07/10/building-blocks-life-found-floating-milky-way-discovery-suggests/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/07/10/TELEMMGLPICT000302481599_trans_NvBQzQNjv4Bqv3mJfB5KuVXogFbLPenC3T-jmHU0As8lkCdoT4jTZxQ.jpeg?impolicy=logo-overlay", "publishedAt": "2022-07-10T17:41:00Z", "content": "The building blocks of life have been found floating near the centre of the Milky Way in a discovery that raises the chance that life could have evolved on other planets in the galaxy.\r\nOrganic molec… [+2485 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "What time will the huge comet K2 make its closest approach to Earth? - Space.com", "description": "It will swing by our planet in just a few days.", "url": "https://www.space.com/what-time-comet-k2-closest-approach", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nqsMkEYo6duUrcbyH5nhLY-1200-80.png", "publishedAt": "2022-07-10T10:00:03Z", "content": "A huge comet is going to make a safe flyby of Earth in just a few more days.\r\nComet C/2017 K2 (PANSTARRS), called K2 for short, is one of the farthest active comets ever spotted. This little world wi… [+2434 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Physicists Discover a Family of “Magic” Superconducting Graphene Structures - SciTechDaily", "description": "The discovery could inform the design of practical superconducting devices. When it comes to graphene, it appears that superconductivity runs in the family. Graphene is a single-atom-thin 2D material that can be produced by exfoliation from the same graphite …", "url": "https://scitechdaily.com/mit-physicists-discover-a-family-of-magic-superconducting-graphene-structures/", "urlToImage": "https://scitechdaily.com/images/Superconducting-Cooper-Pairs-in-Magic-Angle-Multilayer-Graphene.jpg", "publishedAt": "2022-07-10T09:36:35Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 10, 2022\r\nAn illustration showing superconducting Cooper pairs in magic-angle multilayer graphene family. The adjacent layers are twisted in … [+9584 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "A 4-Billion-Year-Old Piece of Earth's Crust Has Been Identified Beneath Australia - ScienceAlert", "description": "Scientists can use various clues to figure out what's under Earth's surface without actually having to do any digging – including firing super-fine lasers thinner than a human hair at minerals found in beach sand.", "url": "https://www.sciencealert.com/scientists-use-laser-light-to-spot-a-4-billion-year-old-piece-of-earth-s-crust", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/BeachDig_1024.jpg", "publishedAt": "2022-07-09T22:00:22Z", "content": "Scientists can use various clues to figure out what's under Earth's surface without actually having to do any digging including firing super-fine lasers thinner than a human hair at minerals found in… [+3367 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Space Telescopes First Full Color Images, Important Mission to the Moon - SciTechDaily", "description": "Ready to showcase the Webb space telescope’s first full-color images … Back in touch with a spacecraft on an important mission to the Moon …. And our Artemis I Moon rocket and spacecraft move a step closer to launch … a few of the stories to tell you about – …", "url": "https://scitechdaily.com/this-week-nasa-webb-space-telescopes-first-full-color-images-important-mission-to-the-moon/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Webb-First-Full-Color-Images.gif", "publishedAt": "2022-07-09T14:37:33Z", "content": "ByNASAJuly 9, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisory… [+2452 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Mars spacecraft may have to dig deeper than thought to find traces of life - Space.com", "description": "Radiation might destroy intriguing compounds much faster than scientists realized.", "url": "https://www.space.com/mars-surface-radiation-destroys-amino-acids", "urlToImage": "https://cdn.mos.cms.futurecdn.net/E95ZSoxdCKyWZWzkm2EyNe-1200-80.jpg", "publishedAt": "2022-07-09T11:00:20Z", "content": "Mars rovers may have to dig deeper to find signs of ancient life.\r\nNew research shows that certain protein-building amino acids that could be evidence of ancient life on Mars\r\n are more susceptible t… [+4984 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Astonishing” 500-Million-Year-Old Fossilized Brains Prompt a Rethink of the Evolution of Insects and Spiders - SciTechDaily", "description": "An ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan. New research based on a cache of fossils that contains the brain and nervous system of a half-billion-year-old marine predator from the Burge…", "url": "https://scitechdaily.com/?p=183195", "urlToImage": "https://scitechdaily.com/images/Stanleycaris-hirpex.jpg", "publishedAt": "2022-07-09T10:33:33Z", "content": "Stanleycaris hirpex. Credit: Sabrina Cappelli © Royal Ontario Museum\r\nAn ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan.\r\nNew resear… [+6607 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Scientists think they've solved the Earth's oldest mystery - The Independent", "description": "Researchers believe they have cracked the strange circumstances behind how the Earth was formed", "url": "https://www.independent.co.uk/space/earth-formation-theory-eth-zurich-b2119416.html", "urlToImage": "https://static.independent.co.uk/2022/07/08/15/image.imageformat.carousel.835692018.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-07-09T09:54:11Z", "content": "Scientists have a new theory of how our planet formed.\r\nAs well as answering the mystery of how our planet got here, the theory would explain the Earths perculiar chemical composition. And it could h… [+2647 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Creatures Fill Puzzling Gap in the Fossil Record - SciTechDaily", "description": "Research reveals yunnanozoans as the oldest known stem vertebrates. New findings answer questions in the fossil record. The puzzling gap in the fossil record that would explain the evolution of invertebrates to vertebrates has long perplexed scientists. Verte…", "url": "https://scitechdaily.com/extinct-creatures-fill-puzzling-gap-in-the-fossil-record/", "urlToImage": "https://scitechdaily.com/images/Yunnanozoan-Artistic-Reconstruction-scaled.jpg", "publishedAt": "2022-07-09T03:36:51Z", "content": "Artistic reconstruction of the yunnanozoan from the Cambrian Chengjiang biota shows basket-like pharyngeal skeletons. Credit: Dinghua Yang\r\nResearch reveals yunnanozoans as the oldest known stem vert… [+4848 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "A Disturbing Shift Has Affected Earth's Delicate Energy Balance, Scientists Report - ScienceAlert", "description": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth depends on many finely balanced, interwoven cycles t", "url": "https://www.sciencealert.com/we-ve-completely-imbalanced-earth-s-energy-cycle-shunting-most-of-it-into-the-oceans", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/GoldLightAndCloudsBeneathBlueGlowOfEarthsAtmosphereInBlackOfSpace_1024.jpg", "publishedAt": "2022-07-09T00:02:08Z", "content": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth d… [+4018 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Brett Tingley", "title": "NASA's Perseverance Mars rover collects 9th Red Planet rock sample - Space.com", "description": "The sample may hold signs of ancient running water on Mars.", "url": "https://www.space.com/nasa-perseverance-mars-rover-9th-rock-sample", "urlToImage": "https://cdn.mos.cms.futurecdn.net/xpbmDgMRGdfY2nPiPAK446-1200-80.jpg", "publishedAt": "2022-07-08T20:06:42Z", "content": "NASA's Perseverance Mars rover is digging into the surface of the Red Planet on the hunt for evidence of running water in the planet's past — and signs of ancient Mars life, if it ever existed.\r\nPers… [+3088 chars]"}]}