{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Signs of Monster Stars 10000 Times Our Sun's Mass Found at The Dawn of Time - ScienceAlert", "description": "We don't know what the first stars in the Universe were like.", "url": "https://www.sciencealert.com/signs-of-monster-stars-10000-times-our-suns-mass-found-at-the-dawn-of-time", "urlToImage": "https://www.sciencealert.com/images/2023/05/globular-cluster.jpg", "publishedAt": "2023-05-24T04:43:13Z", "content": "We don't know what the first stars in the Universe were like. Peering into the distant reaches of the early Universe, we've seen only traces of their presence.\r\nBut a new line of evidence traced in i… [+5157 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Did The Universe Come From Nothing? Can Stars Be Alive? What's The Best Nebula? | Q&A 225 - Fraser Cain", "description": "Could stars and planets be living organisms? Is LHC dangerous for the Earth? How do neutrino detectors work? Does the Big Bang suggest that everything around...", "url": "https://www.youtube.com/watch?v=lLcvFFpK-MI", "urlToImage": "https://i.ytimg.com/vi/lLcvFFpK-MI/maxresdefault.jpg", "publishedAt": "2023-05-23T17:17:30Z", "content": null}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Holly Spanner", "title": "Earthshine tonight: How to see May's spectacular Moon event - BBC Science Focus Magazine", "description": "Lifting the veil on the Moon’s eery glow: here’s when and how to see lunar Earthlight this May.", "url": "https://www.sciencefocus.com/news/earthshine-may-2023/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2023/05/Everything-you-need-to-know-about-Earthshine-1ab2a50.jpg?resize=960,413", "publishedAt": "2023-05-23T17:05:41Z", "content": "You may have noticed the Moon exhibiting a ghostly glow lately, where a subtle light is illuminating the usually unlit portion of the lunar surface. This is a phenomenon called Earthshine, and it can… [+7626 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Watch the moon snuggle up to Earth's 'evil twin' Venus today with free livestream - Space.com", "description": "Of course, despite making a close approach in the sky over Earth, the moon and Venus remain fairly widely separated in the actual solar system. And this is probably a good thing.", "url": "https://www.space.com/moon-venus-conjunction-livestream-may-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QzRXmsYasRy7fKrwyiyezb-1200-80.jpg", "publishedAt": "2023-05-23T17:00:14Z", "content": "The moon will meet up with Venus, the solar system's hottest planet and the second closest to the sun, in the sky on Tuesday (May 23). The two celestial objects will make a close approach with the wa… [+5162 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "James Felton", "title": "Apollo 10 Astronauts Heard Weird Music On The Far Side Of The Moon - IFLScience", "description": "Footage of the \"music\" was not released for over 50 years.", "url": "https://www.iflscience.com/apollo-10-astronauts-heard-weird-music-on-the-far-side-of-the-moon-69051", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69051/aImg/68091/apollo-10-meta.png", "publishedAt": "2023-05-23T11:24:04Z", "content": "In May 1969, Apollo 10 staged a dress rehearsal for the first human landing on the lunar surface. The mission was a success, with the crew of three orbiting the Moon for over 10 hours, and separating… [+1547 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Gravitational lensing of supernova yields new value for Hubble constant – Physics World - physicsworld.com", "description": "New measurement adds to the mystery of the universe’s expansion", "url": "https://physicsworld.com/a/gravitational-lensing-of-supernova-yields-new-value-for-hubble-constant/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2023/05/Gravitational-lensing.jpg", "publishedAt": "2023-05-23T07:48:39Z", "content": "Early arrivals: the first four images of the gravitationally lensed supernova are shown in yellow. (Courtesy: NASA/ESA/JHU/UCLA/UC Berkeley/STScI)\r\nA study of how light from a distant supernova was g… [+5601 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Andy Tomaswick", "title": "The Heaviest Neutron Stars Could Have Strange Matter Cores - Universe Today", "description": "Physics gets weird at the extremes. Astrophysics usually deals with the extremely large – large energies, large gravities, and lots and lots of stuff. Quantum mechanics, on the other hand, typically deals with the extremely small – quarks and other particles …", "url": "https://www.universetoday.com/161514/the-heaviest-neutron-stars-could-have-strange-matter-cores/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/9579.jpg", "publishedAt": "2023-05-22T22:13:58Z", "content": "Physics gets weird at the extremes. Astrophysics usually deals with the extremely large – large energies, large gravities, and lots and lots of stuff. Quantum mechanics, on the other hand, typically … [+3585 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "62 New Moons Discovered: Saturn Takes the Crown for Most Natural Satellites in Solar System - SciTechDaily", "description": "Scientists have discovered 62 new moons orbiting Saturn, bringing its total to 145 and surpassing Jupiter's count of 95. Using a technique called \"shift and stack,\" the international research team, led by Edward Ashton, found moons as small as 1.5 miles in di…", "url": "https://scitechdaily.com/62-new-moons-discovered-saturn-takes-the-crown-for-most-natural-satellites-in-solar-system/", "urlToImage": "https://scitechdaily.com/images/Spokes-Spotted-in-Saturns-Rings.jpg", "publishedAt": "2023-05-22T21:15:30Z", "content": "ByEvan Gough, Universe TodayMay 22, 2023\r\nNASAs Hubble Space Telescope captured this image of Saturn in February 2023. Saturn has regained its title as the planet with the most moons in the solar sys… [+7077 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "In-situ observations of marine sedimentary rocks suggest ancient northern ocean on Mars - Phys.org", "description": "An international research team led by Professor Long Xiao from the School of Earth Sciences of China University of Geosciences (Wuhan) has discovered the presence of marine sedimentary rocks on the surface of Mars for the first time by comprehensively analyzi…", "url": "https://phys.org/news/2023-05-in-situ-marine-sedimentary-ancient-northern.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/ancient-northern-ocean.jpg", "publishedAt": "2023-05-22T20:40:12Z", "content": "An international research team led by Professor Long Xiao from the School of Earth Sciences of China University of Geosciences (Wuhan) has discovered the presence of marine sedimentary rocks on the s… [+7003 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "Water Vapor Detected in The Solar System's Asteroid Belt For First Time - ScienceAlert", "description": "There's a fair amount of water in the Solar System.", "url": "https://www.sciencealert.com/water-vapor-detected-in-the-solar-systems-asteroid-belt-for-first-time", "urlToImage": "https://www.sciencealert.com/images/2023/05/comet-read-art.jpg", "publishedAt": "2023-05-22T18:01:13Z", "content": "There's a fair amount of water in the Solar System. Several moons and planets are loaded with it, while comets from the far reaches are packed with the stuff. Where it warms in the heat of the Sun, i… [+4893 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Individuals' DNA Can Be Easily Identified From Thin Air, And That's A Big Problem - IFLScience", "description": "We can't do anything without leaving a trail.", "url": "https://www.iflscience.com/individuals-dna-can-be-easily-identified-from-thin-air-and-thats-a-big-problem-69047", "urlToImage": "https://assets.iflscience.com/assets/articleNo/69047/aImg/68081/dna-from-air-meta.jpg", "publishedAt": "2023-05-22T16:32:15Z", "content": "DNA left behind in the surrounding environment could act as an invisible fingerprint, identifying the exact people to have been there previously, according to new research. The findings suggest there… [+2397 chars]"}, {"source": {"id": null, "name": "SETI Institute"}, "author": null, "title": "First Contact: Global team simulates message from extraterrestrial intelligence to Earth - SETI Institute", "description": "May 22, 2023, Mountain View, CA – What would happen if we received a message from an extraterrestrial civilization? Daniela de Paulis, an established interdisciplinary artist and licensed radio operator who currently serves as Artist in Residence at the SETI …", "url": "https://www.seti.org/press-release/first-contact-global-team-simulates-message-extraterrestrial-intelligence-earth", "urlToImage": "https://www.seti.org/sites/default/files/2023-05/3_telescopes.jpg", "publishedAt": "2023-05-22T16:25:23Z", "content": "May 22, 2023, Mountain View, CA What would happen if we received a message from an extraterrestrial civilization? Daniela de Paulis, an established interdisciplinary artist and licensed radio operato… [+7756 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "A massive quiescent galaxy at redshift 4.658 - Nature.com", "description": "Nature - A massive quiescent galaxy at redshift 4.658", "url": "https://www.nature.com/articles/s41586-023-06158-6", "urlToImage": null, "publishedAt": "2023-05-22T15:42:38Z", "content": null}, {"source": {"id": null, "name": "tor.com"}, "author": "James Davis Nicoll", "title": "Five Ways SF Writers Sidestep the Problem of Relativity - tor.com", "description": "Relativity! Extremely well supported by the evidence, and extremely inconvenient for SF authors who want jaunts to the galactic core to be as easy as popping down the road. Given a universe so larg…", "url": "https://www.tor.com/2023/05/22/five-ways-sf-writers-sidestep-the-problem-of-relativity/", "urlToImage": "https://i0.wp.com/www.tor.com/wp-content/uploads/2018/11/LightSpeed-NASA.jpg?fit=740%2C+9999&crop=0%2C0%2C100%2C460px&quality=100&ssl=1", "publishedAt": "2023-05-22T14:04:35Z", "content": "Relativity! Extremely well supported by the evidence, and extremely inconvenient for SF authors who want jaunts to the galactic core to be as easy as popping down the road. Given a universe so large … [+6785 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Researchers explore the inner ring of CI Tauri - Phys.org", "description": "Using ESO's Very Large Telescope (VLT), an international team of astronomers has probed the inner dusty ring of a young star known as CI Tauri (or CI Tau for short). Results of the study, published May 14 on the arXiv pre-print server, deliver important insig…", "url": "https://phys.org/news/2023-05-explore-ci-tauri.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/research-explores-the-1.jpg", "publishedAt": "2023-05-22T12:35:43Z", "content": "Using ESO's Very Large Telescope (VLT), an international team of astronomers has probed the inner dusty ring of a young star known as CI Tauri (or CI Tau for short). Results of the study, published M… [+3169 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Eruption of Tonga underwater volcano found to disrupt satellite signals halfway around the world - Phys.org", "description": "An international team has used satellite- and ground-based ionospheric observations to demonstrate that an air pressure wave triggered by volcanic eruptions could produce an equatorial plasma bubble (EPB) in the ionosphere, severely disrupting satellite-based…", "url": "https://phys.org/news/2023-05-eruption-tonga-underwater-volcano-disrupt.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/eruption-of-tonga-unde.jpg", "publishedAt": "2023-05-22T11:05:59Z", "content": "An international team has used satellite- and ground-based ionospheric observations to demonstrate that an air pressure wave triggered by volcanic eruptions could produce an equatorial plasma bubble … [+5292 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Instrument to measure asteroid gravity tested for space - European Space Agency", "description": "The first instrument to directly measure gravity on the surface of an asteroid has undergone testing in ESA’s Mechanical Systems Laboratory.", "url": "https://www.esa.int/Space_Safety/Hera/Instrument_to_measure_asteroid_gravity_tested_for_space", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/05/grass_gravimeter_on_shaker/24891591-1-eng-GB/GRASS_gravimeter_on_shaker_pillars.gif", "publishedAt": "2023-05-22T10:19:02Z", "content": "Space Safety22/05/20231117 views36 likes\r\nThe first instrument to directly measure gravity on the surface of an asteroid has undergone testing in ESAs Mechanical Systems Laboratory.\r\nGRASS gravimeter… [+4930 chars]"}]}