{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Melting Greenland ice sheet could cause sea levels to rise by 0.5 INCHES by the end of the century - Daily Mail", "description": "The flow rate of the Northeast Greenland Ice Stream has increased since 2012, and experts from the  Technical University of Denmark modelled how this affects ice loss on the sheet.", "url": "https://www.dailymail.co.uk/sciencetech/article-11407741/Melting-Greenland-ice-sheet-cause-sea-levels-rise-0-5-INCHES-end-century.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/09/14/64367689-0-image-a-57_1668005801852.jpg", "publishedAt": "2022-11-09T16:00:46Z", "content": "Melting of the Northeast Greenland Ice Sheet could cause sea levels to rise by half an inch by the end of the century, a new study has warned.\r\nThis is equivalent to the contribution made by the enti… [+6940 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Brandon Vigliarolo", "title": "This ancient quasar may be the remains of the first-gen star that started us all - The Register", "description": "Ah, so now we know who to blame for all of this", "url": "https://www.theregister.com/2022/11/09/quasar_star_big_bang/", "urlToImage": "https://regmedia.co.uk/2020/03/20/quasar_tsunami.jpg", "publishedAt": "2022-11-09T07:35:00Z", "content": "Scientists taking a look at the second-most distant observed quasar believe it's actually the remnants of one of the universe's earliest stars the so-called Population III stars that seeded the early… [+2870 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A study discovers a surprising relationship between the teeth and the evolution of pregnancy - Phys.org", "description": "Humans have the highest prenatal growth rate of all extant primates, but how this exceptional rate came about has been a mystery up to now. Leslea Hlusko, a scientist at the Centro Nacional de Investigación sobre la Evolución Humana (CENIEH), has participated…", "url": "https://phys.org/news/2022-11-relationship-teeth-evolution-pregnancy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/a-study-discovers-a-su.jpg", "publishedAt": "2022-11-08T20:46:03Z", "content": "Humans have the highest prenatal growth rate of all extant primates, but how this exceptional rate came about has been a mystery up to now. Leslea Hlusko, a scientist at the Centro Nacional de Invest… [+3270 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "UK startup's nuclear fusion gun will fire a 1-billion-G projectile at a fusion fuel pellet - Interesting Engineering", "description": "U.K.-based startup First Light Fusion is developing its prototype Big Friendly Gun (BFG) in a bid to achieve nuclear fusion without relying on lasers and powerful magnets.", "url": "https://interestingengineering.com/innovation/nuclear-fusion-gun-fire-fusion-fuel-pellet", "urlToImage": "https://inteng-storage-us.s3.amazonaws.com/2022/11/08/image/jpeg/Ya4sJYaRkWiYngTT2CWgZts3MdZkLz7r9NlKaKRy.jpg", "publishedAt": "2022-11-08T15:39:25Z", "content": "First Light Fusion calls its approach inertial fusion. The company claims it is closer to achieving net energy production the production of more energy than is required to run the machinery required … [+1168 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Shaheena Uddin, news reporter", "title": "Rare 'beaver blood moon' marks last total lunar eclipse for three years - Sky News", "description": "", "url": "https://news.sky.com/story/rare-beaver-blood-moon-marks-last-total-lunar-eclipse-for-three-years-12741521", "urlToImage": "https://e3.365dm.com/22/11/1600x900/skynews-beaver-blood-moon-eclipse_5958251.jpg?20221108103519", "publishedAt": "2022-11-08T13:51:09Z", "content": "Stargazers in eastern Asia, Australia, the Pacific and North America were treated to a rare \"beaver blood moon\" on Tuesday in the last total lunar eclipse for three years.\r\nTotal lunar eclipses usual… [+931 chars]"}]}