{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "KiDS in the sky: New stellar system discovered by the Kilo-Degree Survey - Phys.org", "description": "Astronomers have discovered a new stellar system in the outskirts of the Milky Way as part of the Kilo-Degree Survey (KiDS). The newfound system, named Sextans II, is most likely an ultra-faint dwarf galaxy. The finding is reported in a paper published Novemb…", "url": "https://phys.org/news/2023-11-kids-sky-stellar-kilo-degree-survey.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/kids-in-the-sky-new-st.jpg", "publishedAt": "2023-11-25T16:00:02Z", "content": "Astronomers have discovered a new stellar system in the outskirts of the Milky Way as part of the Kilo-Degree Survey (KiDS). The newfound system, named Sextans II, is most likely an ultra-faint dwarf… [+3205 chars]"}, {"source": {"id": null, "name": "Bulgarianmilitary.com"}, "author": "Boyko Nikolov", "title": "Russian satellite Kosmos-2570 detached two military objects - US - Bulgarian Military", "description": "Specialists from LeoLabs, have drawn parallels between the Russian military satellite Kosmos-2570 and the well-known \"Matryoshka\" Russian nesting dolls in space", "url": "https://bulgarianmilitary.com/2023/11/25/russian-satellite-kosmos-2570-detached-two-military-objects-us/", "urlToImage": "https://bulgarianmilitary.com/wp-content/uploads/2023/11/Russian-satellite-Kosmos-2570-detached-two-military-objects-US.jpg", "publishedAt": "2023-11-25T15:41:07Z", "content": "Specialists from LeoLabs, an American firm, have drawn parallels between the Russian military satellite Kosmos-2570 and the well-known “Matryoshka” Russian nesting dolls in space. The satellite, simi… [+3719 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Alex Daniel", "title": "Water discovered to be leaking from Earth's crust into the planet's core - indy100", "description": "There is much we still don’t know about the inside of our planet – but scientists recently discovered water is slowly leaking down there from the surface.\nIt’s not a simple journey. The liquid is dripping down descending tectonic plates, before eventually rea…", "url": "https://www.indy100.com/science-tech/water-leaking-earth-crust-core-science-2666354273", "urlToImage": "https://www.indy100.com/media-library/earth-s-core-may-be-leaking-ancient-helium.jpg?id=29378777&width=1200&height=600&coordinates=0%2C25%2C0%2C25", "publishedAt": "2023-11-25T14:39:20Z", "content": "There is much we still dont know about the inside of our planet but scientists recently discovered water is slowly leaking down there from the surface.\r\nIts not a simple journey. The liquid is drippi… [+1658 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": "TeeJay Small", "title": "See The Dinosaurs That Lived Near You - Giant Freakin Robot", "description": "Want to know what type of dinosaurs roamed your hometown 750 million years ago? Now you can see them for yourself with this new tool.", "url": "https://www.giantfreakinrobot.com/sci/see-dinosaurs-lived-near-you.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2023/11/dinosaurs.jpg", "publishedAt": "2023-11-25T02:00:00Z", "content": null}, {"source": {"id": null, "name": "IFLScience"}, "author": "Laura Simmons", "title": "Crystals Grown With Help From Electron Beam Solve 200-Year-Old Geological Mystery - IFLScience", "description": "The “Dolomite Problem” has a solution at last.", "url": "https://www.iflscience.com/crystals-grown-with-help-from-electron-beam-solve-200-year-old-geological-mystery-71703", "urlToImage": "https://assets.iflscience.com/assets/articleNo/71703/aImg/72271/dolomites-meta.jpg", "publishedAt": "2023-11-24T19:22:13Z", "content": "A mystery that has dogged materials science for 200 years has finally been solved. A mineral found in many ancient rock formations had stubbornly resisted the efforts of scientists to grow it in the … [+4370 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Interesting Engineering", "title": "Companion Robots: Battling Loneliness in an Aging World - Interesting Engineering", "description": "Discover how companion robots are addressing loneliness in an aging society and reshaping human connections.", "url": "https://interestingengineering.com/ie-originals/ie-explainer/season-5/ep-28-why-is-china-creating-humanoid-robots", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/11/24/image/jpeg/UQzD0dYX2WSGsS9uQxKBh1KJGuJ1WPC6f544p5eJ.jpg", "publishedAt": "2023-11-24T19:00:00Z", "content": "In response to the challenges posed by an aging population and a rising number of individuals living alone, companion robots are emerging as a potential remedy for loneliness. With over 92 million ad… [+1686 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Jamie Carter", "title": "The full 'Beaver Moon' rises next to bright Jupiter this weekend. Here's how to watch. - Livescience.com", "description": "The full 'Beaver Moon' will be best viewed as it rises in the east at dusk on Monday, Nov. 27, though it will appear full on Sunday and Tuesday as well.", "url": "https://www.livescience.com/space/the-moon/the-full-beaver-moon-rises-next-to-bright-jupiter-this-weekend-heres-how-to-watch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mMP9zTm6wn6whtVGWwgYKC-1200-80.jpg", "publishedAt": "2023-11-24T17:18:02Z", "content": "On Monday, Nov. 27, look east in the evening to see the full \"Beaver Moon\" rise into the sky.\r\nNovember's full moon occurs as Earth gets between the sun and moon. It's consequently 100% illuminated —… [+1612 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tejasri Gururaj", "title": "Breaking the stillness: Scientists observe and explain the oscillations of circular hydraulic jumps - Phys.org", "description": "In a new study published in Physical Review Letters, scientists explore how small water jets can create stable periodic oscillations on a solid disk, uncovering a connection between these movements and the waves they generate and providing insights into the d…", "url": "https://phys.org/news/2023-11-stillness-scientists-oscillations-circular-hydraulic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/breaking-the-stillness.jpg", "publishedAt": "2023-11-24T14:00:02Z", "content": "In a new study published in Physical Review Letters, scientists explore how small water jets can create stable periodic oscillations on a solid disk, uncovering a connection between these movements a… [+6436 chars]"}]}