{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Mighty Martian River? Latest Astonishing Discovery by NASA's Perseverance Mars Rover - SciTechDaily", "description": "Evidence left in rocks is leading scientists to rethink what watery environments looked like on ancient Mars. New images from NASA's Perseverance rover reveal evidence of a powerful river on Mars, possibly deeper and faster-moving than previously known. The i…", "url": "https://scitechdaily.com/?p=278199", "urlToImage": "https://scitechdaily.com/images/Fast-River-on-Mars.jpg", "publishedAt": "2023-05-17T18:10:49Z", "content": "ByJet Propulsion LaboratoryMay 17, 2023\r\nScientists think that these bands of rocks may have been formed by a very fast, deep river the first of its kind evidence has been found for on Mars. NASAs Pe… [+7381 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Curved spacetime in a quantum simulator - Phys.org", "description": "The theory of relativity works well when you want to explain cosmic-scale phenomena—such as the gravitational waves created when black holes collide. Quantum theory works well when describing particle-scale phenomena—such as the behavior of individual electro…", "url": "https://phys.org/news/2023-05-spacetime-quantum-simulator.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/curved-spacetime-in-a.jpg", "publishedAt": "2023-05-17T14:31:03Z", "content": "The theory of relativity works well when you want to explain cosmic-scale phenomenasuch as the gravitational waves created when black holes collide. Quantum theory works well when describing particle… [+5676 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Currie", "title": "We regret to inform you Earth will not be destroyed by an asteroid within 1,000 years - The Register", "description": "Never mind, there's always nuclear war and climate catastrophe", "url": "https://www.theregister.com/2023/05/17/no_earth_killing_asteroids/", "urlToImage": "https://regmedia.co.uk/2022/02/01/shutterstock_asteroid.jpg", "publishedAt": "2023-05-17T14:31:00Z", "content": "War, genocide, TikTok if it could all end today, some of us would die with a smile on our face knowing there was little about humanity worth preserving.\r\nHowever, we have bad news for the misanthrope… [+3364 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Hannah Osborne", "title": "Yellowstone volcano super-eruptions appear to involve multiple explosive events - Livescience.com", "description": "The last caldera-forming eruption at Yellowstone \"was much more complex than previously thought,\" according to the annual report about activity at the supervolcano.", "url": "https://www.livescience.com/planet-earth/volcanos/yellowstone-volcano-super-eruptions-appear-to-involve-multiple-explosive-events", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rN7WQ959ZMY7LLUb8xdBtN-1200-80.jpg", "publishedAt": "2023-05-17T09:44:33Z", "content": "The last super-eruption at Yellowstone volcano, which occurred 631,000 years ago, was not one huge explosion. Instead, new research suggests it was a series of eruptions or multiple vents spewing vol… [+3995 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Experiment Inspired by Earth's Core Leads to Groundbreaking Discovery in Fluid Flow Turbulence - SciTechDaily", "description": "Turbulent flows take on a surprising spin in an experiment inspired by the Earth’s core. A team of physicists has discovered a new role for a specific type of turbulence—a finding that sheds light on fluid flows ranging from the Earth’s liquid core to boiling…", "url": "https://scitechdaily.com/physics-experiment-inspired-by-earths-core-leads-to-groundbreaking-discovery-in-fluid-flow-turbulence/", "urlToImage": "https://scitechdaily.com/images/Swirling-Fire-Energy-Molten-Core.jpg", "publishedAt": "2023-05-16T23:36:12Z", "content": "ByNew York UniversityMay 16, 2023\r\nPhysicists have discovered a new aspect of turbulent convection, demonstrating that it can cause a freely moving solid within the fluid to rotate in two directions,… [+3200 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "62 New Moons Discovered Orbiting Saturn Using Innovative Astronomy - SciTechDaily", "description": "An international team of astronomers has found 62 new moons around Saturn using an innovative technique. These irregular moons contribute to Saturn's total moon count of 145, surpassing Jupiter, and provide insights into the planet's moon system's collisional…", "url": "https://scitechdaily.com/?p=278527", "urlToImage": "https://scitechdaily.com/images/Hubble-View-of-Saturn-2019.jpg", "publishedAt": "2023-05-16T19:55:59Z", "content": "ByUniversity of British ColumbiaMay 16, 2023\r\nNASAs Hubble Space Telescope captured exquisite details of the ring system in this 2019 observation. An international team of astronomers led by Edward A… [+7275 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Ben Turner", "title": "Solar 'superflares' millions of times stronger than anything today may have sparked life on earth - Livescience.com", "description": "Intense solar storms may have delivered Earth its earliest building blocks of life, new research suggests.", "url": "https://www.livescience.com/space/the-sun/solar-superflares-millions-of-times-stronger-than-anything-today-may-have-sparked-life-on-earth", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nooWtExtsSXqRyYCTgWZTY-1200-80.png", "publishedAt": "2023-05-16T16:10:33Z", "content": "Life on Earth could have been sparked by enormous superflares from a hyperactive young sun, a new study suggests. \r\nBy firing charged particles found in the solar wind at a concoction of gases presen… [+4586 chars]"}, {"source": {"id": null, "name": "Hackaday"}, "author": "Maya Posch", "title": "Making The Case For All-Female Exploration Missions To Mars And Beyond - Hackaday", "description": "A recent study in Nature Scientific Reports by Jonathan P. R. Scott and colleagues makes the case for sending exclusively all-female crews on long-duration missions. The reasoning here is simple: w…", "url": "https://hackaday.com/2023/05/16/making-the-case-for-all-female-exploration-missions-to-mars-and-beyond/", "urlToImage": "https://hackaday.com/wp-content/uploads/2023/05/astronaut_tracy_caldwell_international_space_station.jpg", "publishedAt": "2023-05-16T14:00:00Z", "content": "A recent study in Nature Scientific Reports by Jonathan P. R. Scott and colleagues makes the case for sending exclusively all-female crews on long-duration missions. The reasoning here is simple: wom… [+8654 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Ethan Siegel", "title": "We can't avoid a singularity inside every black hole - Big Think", "description": "Yes, \"the laws of physics break down\" at singularities. But something really weird must have happened for black holes to not possess them.", "url": "https://bigthink.com/starts-with-a-bang/singularity-inside-black-hole/", "urlToImage": "https://bigthink.com/wp-content/uploads/2021/07/134390-134391.jpg?resize=1200,630", "publishedAt": "2023-05-16T06:00:00Z", "content": null}, {"source": {"id": "independent", "name": "Independent"}, "author": "Vishwam Sankaran", "title": "How to see moon's 'Da Vinci glow' this week as phenomenon threatened by climate crisis - The Independent", "description": "Lunar phenomenon shows faint glow of moon’s ‘dark’ side due to sunlight reflecting off Earth’s surface", "url": "https://www.independent.co.uk/space/da-vinci-glow-moon-earthshine-b2339524.html", "urlToImage": "https://static.independent.co.uk/2022/02/04/12/download%20%281%29.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-05-16T05:05:19Z", "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox\r\nSign up to our free IndyTech newsletter\r\nA lunar phenomenon called the Da Vinci glow which lights up the unlit side of… [+2635 chars]"}]}