{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Streaks in space! ISS astronaut's incredible timelapse photos highlight ghostly solar panels and lovely star trails - Space.com", "description": "\"I'm learning as I go up here.\"", "url": "https://www.space.com/nasa-astronaut-photo-timelapse-iss-space", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sV5jpfGgsGZUZ4JsnjJ7Ld-1200-80.jpg", "publishedAt": "2024-07-03T21:00:01Z", "content": "The space station is always in motion, but only rarely does orbital photography bring that movement to our screens on Earth.\r\nInternational Space Station\r\n (ISS) astronaut Matthew Dominick has an ong… [+3588 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Webb Telescope Unveils Spectacular Star Formation in Celestial Hourglass - The Daily Galaxy --Great Discoveries Channel", "description": "The James Webb Space Telescope (JWST) has provided a breathtaking glimpse into the early stages of star formation, capturing the dramatic development of a", "url": "https://dailygalaxy.com/2024/07/webb-telescope-unveils-celestial-hourglass/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2024/07/L1527.jpg", "publishedAt": "2024-07-03T20:30:20Z", "content": "The James Webb Space Telescope (JWST) has provided a breathtaking glimpse into the early stages of star formation, capturing the dramatic development of a protostar within a luminous hourglass-shaped… [+4212 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Brain Energy Boost Mechanism Discovered - Neuroscience News", "description": "Researchers identified a key mechanism that detects when the brain needs an energy boost, involving astrocytes and the molecule adenosine.", "url": "https://neurosciencenews.com/energy-brain-astrocytes-26398/", "urlToImage": "https://neurosciencenews.com/files/2024/07/energy-brain-neurosiceince.jpg", "publishedAt": "2024-07-03T19:32:23Z", "content": "Summary: Researchers identified a key mechanism that detects when the brain needs an energy boost, involving astrocytes and the molecule adenosine. This discovery could lead to new therapies for main… [+6979 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA Astronauts Send Fourth of July Wishes From the International Space Station - NASA", "description": "NASA astronauts Mike Barratt, Matt Dominick, Tracy C. Dyson, Jeanette Epps, Butch Wilmore, and Suni Williams share a Fourth of July message and extend their ...", "url": "https://www.youtube.com/watch?v=ijkkPoXQukY", "urlToImage": "https://i.ytimg.com/vi/ijkkPoXQukY/maxresdefault.jpg", "publishedAt": "2024-07-03T14:40:23Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": "https://www.jpl.nasa.gov/", "title": "NASA's Planetary Radar Tracks Two Large Asteroid Close Approaches - NASA Jet Propulsion Laboratory", "description": "The Deep Space Network’s Goldstone planetary radar had a busy few days observing asteroids 2024 MK and 2011 UL21 as they safely passed Earth.", "url": "https://www.jpl.nasa.gov/news/nasas-planetary-radar-tracks-two-large-asteroid-close-approaches", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1_2024mk.2024Jun30_CROP.png", "publishedAt": "2024-07-03T14:07:18Z", "content": "Two days later, on June 29, the same team observed the asteroid 2024 MK pass our planet from a distance of only 184,000 miles (295,000 kilometers), or slightly more than three-quarters of the distanc… [+1899 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extremely Large Telescope: World's Largest Telescope Mirror Will Bring the Stars Closer to Earth - SciTechDaily", "description": "Last Segment of the World’s Largest Telescope Mirror Successfully Cast Set for completion this decade, the Extremely Large Telescope in Chile will be the largest telescope globally, with a main mirror spanning 39 meters and made from 798 precision-engineered …", "url": "https://scitechdaily.com/extremely-large-telescope-worlds-largest-telescope-mirror-will-bring-the-stars-closer-to-earth/", "urlToImage": "https://scitechdaily.com/images/Extremely-Large-Telescope-ELT-in-Operation-Rendering-scaled.jpg", "publishedAt": "2024-07-03T10:49:24Z", "content": "This artist’s rendering shows a night view of the Extremely Large Telescope in operation on Cerro Armazones in northern Chile. The telescope is shown using lasers to create artificial stars high in t… [+5832 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - A snaking scar on Mars - European Space Agency", "description": "A fascinating feature takes centre stage in this new image from ESA’s Mars Express: a dark, uneven scar slicing through marbled ground at the foot of a giant volcano.", "url": "https://www.esa.int/Science_Exploration/Space_Science/Mars_Express/A_snaking_scar_on_Mars", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2024/07/a_snaking_scar_on_mars/26208432-1-eng-GB/A_snaking_scar_on_Mars_pillars.jpg", "publishedAt": "2024-07-03T09:09:42Z", "content": "Science &amp; Exploration03/07/20241368 views11 likes\r\nA fascinating feature takes centre stage in this new image from ESAs Mars Express: a dark, uneven scar slicing through marbled ground at the foo… [+3132 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists discover way to 'grow' sub-nanometer sized transistors - Phys.org", "description": "A research team led by Director Jo Moon-Ho of the Center for Van der Waals Quantum Solids within the Institute for Basic Science (IBS) has implemented a novel method to achieve epitaxial growth of 1D metallic materials with a width of less than 1 nm. The grou…", "url": "https://phys.org/news/2024-07-scientists-nanometer-sized-transistors.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/scientists-discover-wa-1.jpg", "publishedAt": "2024-07-03T09:00:01Z", "content": "A research team led by Director Jo Moon-Ho of the Center for Van der Waals Quantum Solids within the Institute for Basic Science (IBS) has implemented a novel method to achieve epitaxial growth of 1D… [+3700 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Clare Watson", "title": "Ultra-Precise Atomic Clock Doubles Previous Accuracy, Could Detect Dark Matter - ScienceAlert", "description": "Time: It bends and warps, or seems to speed up or slow down, depending on your position or perception.", "url": "https://www.sciencealert.com/ultra-precise-atomic-clock-doubles-previous-accuracy-could-detect-dark-matter", "urlToImage": "https://www.sciencealert.com/images/2024/07/StrontiumOpticalLatticeAtomicClock.jpg", "publishedAt": "2024-07-03T07:20:35Z", "content": "Time: It bends and warps, or seems to speed up or slow down, depending on your positionor perception. So measuring its passing accurately is one of the most fundamental tasks in physics which could h… [+4355 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Experiment To “Trap” Dark Matter Could Unravel Mysteries of the Universe - SciTechDaily", "description": "Scientists have devised a 3D-printed vacuum system to detect dark matter and explore dark energy, using ultra-cold lithium atoms to identify domain walls and potentially explain the universe's accelerating expansion. Scientists have developed a novel 3D-print…", "url": "https://scitechdaily.com/new-experiment-to-trap-dark-matter-could-unravel-mysteries-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Laser-Photon-System-University-of-Nottingham-scaled.jpg", "publishedAt": "2024-07-03T03:02:19Z", "content": "Researchers at the University of Nottingham have developed a new method using a 3D printed vacuum system to detect dark matter and potentially uncover the nature of dark energy. This system manipulat… [+4536 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Scott Alan Johnston", "title": "Plate Tectonics Might Only Occur on 0.003% of Planets. That Makes Earth Very Special Indeed. - Universe Today", "description": "Plate tectonics, oceans, and continents might just be the secret ingredients for complex life on Earth. And if these geological features are rare elsewhere in the universe, then perhaps that explains why we haven’t yet discovered intelligent alien life. New r…", "url": "https://www.universetoday.com/167659/plate-tectonics-might-only-occur-on-0-003-of-planets-that-makes-earth-very-special-indeed/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2024/07/tectonics-2024.jpg", "publishedAt": "2024-07-02T23:41:47Z", "content": "Plate tectonics, oceans, and continents might just be the secret ingredients for complex life on Earth. And if these geological features are rare elsewhere in the universe, then perhaps that explains… [+5201 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Michelle Starr", "title": "The Whole Surface of This Hellish Moon Is Covered in Lakes of Lava - ScienceAlert", "description": "As bristling with volcanoes as a porcupine with quills, Jupiter's moon Io is the most volcanically active world in the Solar System.", "url": "https://www.sciencealert.com/the-whole-surface-of-this-hellish-moon-is-covered-in-lakes-of-lava", "urlToImage": "https://www.sciencealert.com/images/2023/01/juno-io-infrared.jpg", "publishedAt": "2024-07-02T23:04:23Z", "content": "As bristling with volcanoes as a porcupine with quills, Jupiter's moon Io is the most volcanically active world in the Solar System. At any given time, around 150 of the 400 or so active volcanoes on… [+4074 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Robert Lea", "title": "Scientists finally found 2 of the Milky Way's missing dwarf galaxies. What could this mean for astronomy? - Space.com", "description": "Down the line, this could tell us something about dark matter.", "url": "https://www.space.com/milky-way-satellite-dwarf-galaxies-found", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4M4TAhJ2L4wRRQ4d456R8Z-1200-80.png", "publishedAt": "2024-07-02T20:00:01Z", "content": "Astronomers have discovered two new satellite galaxies of the Milky Way, and these findings could help us better understand dark matter — the mysterious stuff that accounts for around 85% of the matt… [+6785 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kimm Fesenmaier", "title": "Cosmic simulation reveals how black holes grow and evolve - Phys.org", "description": "A team of astrophysicists led by Caltech has managed for the first time to simulate the journey of primordial gas dating from the early universe to the stage at which it becomes swept up in a disk of material fueling a single supermassive black hole. The new …", "url": "https://phys.org/news/2024-07-cosmic-simulation-reveals-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/cosmic-simulation-reve-1.jpg", "publishedAt": "2024-07-02T18:07:52Z", "content": "A team of astrophysicists led by Caltech has managed for the first time to simulate the journey of primordial gas dating from the early universe to the stage at which it becomes swept up in a disk of… [+8858 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Alan Cooper, Pavle Arsenovic", "title": "New study shows mysterious solar particle blasts can devastate the ozone layer, bathing Earth in radiation for years - Phys.org", "description": "The remarkable aurora in early May this year demonstrated the power that solar storms can emit as radiation, but occasionally the sun does something far more destructive. Known as \"solar particle events,\" these blasts of protons directly from the surface of t…", "url": "https://phys.org/news/2024-07-mysterious-solar-particle-blasts-devastate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/auroras.jpg", "publishedAt": "2024-07-02T15:44:53Z", "content": "The remarkable aurora in early May this year demonstrated the power that solar storms can emit as radiation, but occasionally the sun does something far more destructive. Known as \"solar particle eve… [+6264 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Infrared glow high in Jupiter's atmosphere may be dark matter particles colliding - Phys.org", "description": "A pair of astrophysicists with Princeton University and the SLAC National Accelerator Laboratory found possible evidence of dark matter particles colliding. In their study, published in Physical Review Letters, Carlos Blanco and Rebecca Leane conducted measur…", "url": "https://phys.org/news/2024-07-infrared-high-jupiter-atmosphere-dark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/infrared-glow-high-in.jpg", "publishedAt": "2024-07-02T13:04:08Z", "content": "A pair of astrophysicists with Princeton University and the SLAC National Accelerator Laboratory found possible evidence of dark matter particles colliding. In their study, published in Physical Revi… [+2537 chars]"}, {"source": {"id": null, "name": "Leonarddavid.com"}, "author": "Leonard David", "title": "Find a piece of SpaceX space junk? Call the hotline - Space.com", "description": "\"If you believe you have identified a piece of debris, please do not attempt to handle or retrieve the debris directly.\"", "url": "https://www.leonarddavid.com/got-spacex-dragon-debris-call-the-hotline/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/idzT5o6S4JmthszTLGLqB7-1200-80.jpg", "publishedAt": "2024-07-02T13:00:15Z", "content": "Space junk, it turns out, can be a tourist attraction.\r\nThe Glamping Collective in North Carolina was recently on the receiving end\r\n of leftovers from the SpaceX\r\n Dragon Crew-7 mission to the Inter… [+2513 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "Matt Growcoot", "title": "International Space Station is Pictured Crossing the Fiery Surface of the Sun - PetaPixel", "description": "Blink and you'll miss it.", "url": "https://petapixel.com/2024/07/02/international-space-station-is-pictured-crossing-the-fiery-surface-of-the-sun/", "urlToImage": "https://petapixel.com/assets/uploads/2024/07/ISS-Transit-Feature.jpg", "publishedAt": "2024-07-02T12:25:59Z", "content": "Astrophotographer Miguel Claro captured this magnificent image of the International Space Station (ISS) transiting the surface of the Sun in the blink of an eye. \r\nClaro captured the stupendous image… [+2169 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Sharmila Kuthunur", "title": "If alien terraforming emits greenhouse gases, our telescopes could detect it - Space.com", "description": "\"You wouldn't need extra effort to look for these technosignatures, if your telescope is already characterizing the planet for other reasons — and it would be jaw-droppingly amazing to find them.\"", "url": "https://www.space.com/alien-greenhouse-gases-technosignatures", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v5xDL9Z57hW9p9GbcDXBw7-1200-80.jpg", "publishedAt": "2024-07-02T10:00:01Z", "content": "If aliens wrap their planets in potent greenhouse gases like we do, we'd be able to tell.\r\nThat's according to a recent thought experiment in which scientists identified five \"artificial\" greenhouse … [+4699 chars]"}, {"source": {"id": null, "name": "Rmg.co.uk"}, "author": null, "title": "Astronomy Photographer of the Year 2024 shortlist REVEALED - Royal Museums Greenwich", "description": "See a selection of the incredible space images shortlisted in Astronomy Photographer of the Year 2024", "url": "https://www.rmg.co.uk/whats-on/astronomy-photographer-year/galleries/2024-shortlist", "urlToImage": "https://www.rmg.co.uk/sites/default/files/styles/large/public/2024-01/OS-2913-67%20Solar%20Flare%20X1%20from%20AR2994%20in%20%27Motion%27%20%C2%A9%20Miguel%20Claro%20-%20Astronomy%20Photographer%20of%20the%20Year%202023%20Our%20Sun.jpg?itok=AqEIAJwx", "publishedAt": "2024-07-02T08:19:08Z", "content": "The Galaxy Devourer by ShaRA (Shared Remote Astrophotography) Team\r\nEl Sauce Observatory, Río Hurtado, Chile\r\n\"Is this the cosmic sandworm of Arrakis, from Dune, or the terrifying Graboid from the fi… [+1226 chars]"}, {"source": {"id": null, "name": "indy100"}, "author": "Harriet Brewis", "title": "Strange X and C shapes discovered in Earth's ionosphere - indy100", "description": "NASA scientists have just identified mysterious shapes flying above the Earth but, don’t worry, this doesn’t mean that aliens are about to strike.Using an imaging instrument called the Global-scale Observations of the Limb and Disk (GOLD), the experts uncover…", "url": "https://www.indy100.com/science-tech/shapes-ionosphere-plasma-earth", "urlToImage": "https://www.indy100.com/media-library/plasma-field-envelops-spacex-rocket-on-re-entry-to-earth-s-atmosphere.jpg?id=52533055&width=1200&height=600&coordinates=0%2C250%2C0%2C250", "publishedAt": "2024-07-02T08:11:49Z", "content": "NASA scientists have just identified mysterious shapes flying above the Earth but, dont worry, this doesnt mean that aliens are about to strike.\r\nUsing an imaging instrument called the Global-scale O… [+3570 chars]"}]}