{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Astonishing” 500-Million-Year-Old Fossilized Brains Prompt a Rethink of the Evolution of Insects and Spiders - SciTechDaily", "description": "An ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan. New research based on a cache of fossils that contains the brain and nervous system of a half-billion-year-old marine predator from the Burge…", "url": "https://scitechdaily.com/?p=183195", "urlToImage": "https://scitechdaily.com/images/Stanleycaris-hirpex.jpg", "publishedAt": "2022-07-09T10:33:33Z", "content": "Stanleycaris hirpex. Credit: Sabrina Cappelli © Royal Ontario Museum\r\nAn ancient radiodont predator with three eyes reveals key information about the evolution of the arthropod body plan.\r\nNew resear… [+6607 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Creatures Fill Puzzling Gap in the Fossil Record - SciTechDaily", "description": "Research reveals yunnanozoans as the oldest known stem vertebrates. New findings answer questions in the fossil record. The puzzling gap in the fossil record that would explain the evolution of invertebrates to vertebrates has long perplexed scientists. Verte…", "url": "https://scitechdaily.com/extinct-creatures-fill-puzzling-gap-in-the-fossil-record/", "urlToImage": "https://scitechdaily.com/images/Yunnanozoan-Artistic-Reconstruction-scaled.jpg", "publishedAt": "2022-07-09T03:36:51Z", "content": "Artistic reconstruction of the yunnanozoan from the Cambrian Chengjiang biota shows basket-like pharyngeal skeletons. Credit: Dinghua Yang\r\nResearch reveals yunnanozoans as the oldest known stem vert… [+4848 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "A Disturbing Shift Has Affected Earth's Delicate Energy Balance, Scientists Report - ScienceAlert", "description": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth depends on many finely balanced, interwoven cycles t", "url": "https://www.sciencealert.com/we-ve-completely-imbalanced-earth-s-energy-cycle-shunting-most-of-it-into-the-oceans", "urlToImage": "https://www.sciencealert.com/images/2022-07/processed/GoldLightAndCloudsBeneathBlueGlowOfEarthsAtmosphereInBlackOfSpace_1024.jpg", "publishedAt": "2022-07-09T00:02:08Z", "content": "Our living planet is unique among all we've been able to explore in the Universe so far. From our axial tilt preventing too many temperature extremes, to our goldilocks zone position, life on Earth d… [+4018 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Tom Clarke", "title": "'Wait for your mind to be blown': James Webb Space Telescope to show the universe as it has never been seen before - Sky News", "description": "", "url": "https://news.sky.com/story/wait-for-your-mind-to-be-blown-james-webb-space-telescope-to-show-the-universe-as-it-has-never-been-seen-before-12648490", "urlToImage": "https://e3.365dm.com/22/07/1600x900/skynews-carina-nebula_5828316.jpg?20220708205008", "publishedAt": "2022-07-08T21:04:08Z", "content": "Ahead of the biggest premiere the world of astronomy has ever seen, NASA has published the cosmic A-list that will be appearing through the lens of its colossal new space telescope.\r\nAnd it's not jus… [+3835 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Michelle Jalbert", "title": "Newly Discovered Dinosaur Species Shares the T. Rex's Tiny Arms, But Has 'No Direct Relation' - IGN - IGN", "description": "A newly discovered dinosaur species shares similarly small arms as the T. Rex but is not related to the species, according to paleontologists.", "url": "https://www.ign.com/articles/newly-discovered-dinosaur-species-shares-t-rex-tiny-arms-but-has-no-direct-relation", "urlToImage": "https://assets-prd.ignimgs.com/2022/07/08/meraxes-gigas-1657304322633.jpg?width=1280", "publishedAt": "2022-07-08T19:30:02Z", "content": "Paleontologists have discovered a new giant predatory dinosaur and it had teeny tiny itty bitty arms.\r\nThe Meraxes Gigas, uncovered in northern Patagonia, Argentina, roamed the earth millions of year… [+1292 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Smith", "title": "Scientists think they've solved the Earth's oldest mystery - The Independent", "description": "Researchers believe they have cracked the strange circumstances behind how the Earth was formed", "url": "https://www.independent.co.uk/space/scientists-solve-earth-oldest-mystery-b2118949.html", "urlToImage": "https://static.independent.co.uk/2022/07/08/15/image.imageformat.carousel.835692018.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-07-08T16:05:23Z", "content": "Scientists have a new theory of how our planet formed.\r\nAs well as answering the mystery of how our planet got here, the theory would explain the Earths perculiar chemical composition. And it could h… [+2647 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Christopher Carbone", "title": "Watch the ISS dump 172 pounds of trash in space as waste removal gets upgraded - Daily Mail", "description": "Taking out the trash on the International Space Station just got much easier. Nanoracks has tested a new technology that will streamline the process of waste disposal in outer space.", "url": "https://www.dailymail.co.uk/sciencetech/article-10995299/Taking-garbage-International-Space-Station-just-got-easier.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/08/15/60039985-0-image-a-32_1657290161492.jpg", "publishedAt": "2022-07-08T14:44:48Z", "content": "Taking out the trash on the International Space Station just got much easier.\r\nNanoracks, a private space company based in Houston, successfully tested a new technology that will streamline the proce… [+4616 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Philip Sloss", "title": "Artemis 1 launch team overcomes obstacles to complete WDR test objectives - NASASpaceFlight.com - NASASpaceflight.com", "description": "NASA’s Exploration Ground Systems (EGS) program and prime launch processing contractor Jacobs completed the Wet…", "url": "https://www.nasaspaceflight.com/2022/07/artemis-1-wdr-review/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2022/07/20220620_201113.small_.jpg", "publishedAt": "2022-07-08T14:44:02Z", "content": "NASA’s Exploration Ground Systems (EGS) program and prime launch processing contractor Jacobs completed the Wet Dress Rehearsal (WDR) countdown demonstration test for Artemis 1 at the Kennedy Space C… [+20968 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Robert Perkins", "title": "Unusual superconductivity observed in twisted trilayer graphene - Phys.org", "description": "The ability to turn superconductivity off and on with a literal flip of a switch in so-called \"magic-angle twisted graphene\" has allowed engineers at Caltech to observe an unusual phenomenon that may shed new light on superconductivity in general.", "url": "https://phys.org/news/2022-07-unusual-superconductivity-trilayer-graphene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/unusual-superconductiv.jpg", "publishedAt": "2022-07-08T13:43:21Z", "content": "The ability to turn superconductivity off and on with a literal flip of a switch in so-called \"magic-angle twisted graphene\" has allowed engineers at Caltech to observe an unusual phenomenon that may… [+5582 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprise – Again! NASA Spacecraft Reveals Asteroid Bennu Is Not What It Seemed - SciTechDaily", "description": "Scientists have learned something astonishing after analyzing data gathered when NASA’s OSIRIS-REx spacecraft collected a sample from asteroid Bennu in October 2020. The spacecraft would have sunk into the asteroid had it not fired its thrusters to back away …", "url": "https://scitechdaily.com/surprise-again-nasa-spacecraft-reveals-asteroid-bennu-is-not-what-it-seemed/", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Spacecraft-Leaving-Bennu-Surface.gif", "publishedAt": "2022-07-08T12:31:54Z", "content": "ByLonnie Shekhtman, NASA's Goddard Space Flight CenterJuly 8, 2022\r\nNASAs OSIRIS-REx spacecraft leaving the surface of asteroid Bennu after collecting a sample. Credit: NASAs Goddard Space Flight Cen… [+8965 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Anugraha Sundaravelu", "title": "A shift in Neptune's orbit could cause the collapse of solar system - Metro.co.uk", "description": "Planets could smash into one another or get thrown out of the solar system entirely.", "url": "https://metro.co.uk/2022/07/08/a-shift-in-neptunes-orbit-could-cause-the-collapse-of-solar-system-16965740/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/07/nasa-ScBkW9AKgcA-unsplash-9aa2_1657277369.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-07-08T10:49:00Z", "content": "A star getting too close to our solar system could cause chaos (Picture: PA)\r\nResearchers have found that if a star flying past our solar system moved Neptunes orbit by just 0.1 per cent, it would re… [+2205 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Key Building Blocks for Life Discovered in Cloud Near Center of Our Galaxy - SciTechDaily", "description": "Key precursors for life on Earth are abundant in interstellar molecular clouds and could have arrived on Earth inside comets and meteors. Nitriles, a class of organic molecules with a cyano group (a carbon atom bound with a triple unsaturated bond to a nitrog…", "url": "https://scitechdaily.com/key-building-blocks-for-life-discovered-in-cloud-near-center-of-our-galaxy/", "urlToImage": "https://scitechdaily.com/images/Image-of-the-“pigtail”-molecule-cloud.jpg", "publishedAt": "2022-07-08T08:45:21Z", "content": "ByFrontiersJuly 8, 2022\r\nNew research finds that molecular clouds are loaded with key precursors for life on Earth. This image is of the Pigtail Molecular Cloud. Credit: Keio University, NAOJ\r\nKey pr… [+8623 chars]"}, {"source": {"id": null, "name": "Listverse.com"}, "author": "Jamie Frater", "title": "10 Weird Critters That Lived Alongside the Dinosaurs - Listverse", "description": "The reign of the dinosaurs on Earth was a lengthy one. For about 165 million years, they dominated every continent, and today they have conquered our imaginations. But they were far from the only animals on Earth. They shared their world with many species jus…", "url": "https://listverse.com/2022/07/08/10-weird-critters-that-lived-alongside-the-dinosaurs/", "urlToImage": "https://listverse.com/wp-content/uploads/2022/07/Mosasaurus.jpeg", "publishedAt": "2022-07-08T07:34:30Z", "content": "The reign of the dinosaurs on Earth was a lengthy one. For about 165 million years, they dominated every continent, and today they have conquered our imaginations. But they were far from the only ani… [+10107 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Katy Evans", "title": "A Crack Opened In Earth's Magnetic Field Yesterday And Stayed Open For 14 Hours - IFLScience", "description": "What did it let in or out?", "url": "https://www.iflscience.com/a-crack-opened-in-earths-magnetic-field-yesterday-and-stayed-open-for-14-hours-64372", "urlToImage": "https://assets.iflscience.com/assets/articleNo/64372/aImg/56581/aurora-l.jpg", "publishedAt": "2022-07-08T05:52:00Z", "content": "Yesterday, a crack opened in Earths magnetic field and stayed open for nearly 14 hours, allowing Vecna and his minions through from the Upside Down. OK, perhaps not that last bit, but it did allow so… [+2414 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Ben Taub", "title": "Record-Breaking Experiment Quantum Entangles Two Atoms 20 Miles Apart - IFLScience", "description": "By quantum entangling two stationary atoms across 20 miles of fiber optic cable, researchers may have paved the way for the creation of a quantum internet.", "url": "https://www.iflscience.com/record-breaking-experiment-quantum-entangles-two-atoms-20-miles-apart-64374", "urlToImage": "https://assets.iflscience.com/assets/articleNo/64374/aImg/56580/quantum-entanglement-l.jpg", "publishedAt": "2022-07-08T05:03:00Z", "content": "A new quantum entanglement record has just been set by physicists at Ludwig Maximilian University (LMU) who successfully connected two rubidium atoms across 33 kilometers (20 miles) of fiber optic ca… [+2612 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Mike Wall", "title": "NASA's CAPSTONE moon probe bounces back from glitch, aces engine burn - Space.com", "description": "CAPSTONE has bounced back from its recent communication dropout.", "url": "https://www.space.com/nasa-capstone-moon-cubesat-first-engine-burn", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RtoKrNr8Q9G4ZuHpMU7Zr3-1200-80.jpg", "publishedAt": "2022-07-07T21:15:10Z", "content": "NASA's little CAPSTONE moon probe has bounced back from its recent hiccup.\r\nThe 55-pound (25 kilograms) CAPSTONE\r\n successfully performed its first engine burn today (July 7), an 11-minute maneuver t… [+3783 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Indranil Banik", "title": "Dark matter: our review suggests it's time to ditch it in favour of a new theory of gravity - The Conversation", "description": "Recent results cast doubt on dark matter.", "url": "https://theconversation.com/dark-matter-our-review-suggests-its-time-to-ditch-it-in-favour-of-a-new-theory-of-gravity-186344", "urlToImage": "https://images.theconversation.com/files/472844/original/file-20220706-25-fxgof1.jpg?ixlib=rb-1.1.0&rect=0%2C216%2C1020%2C510&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-07-07T16:47:33Z", "content": "We can model the motions of planets in the Solar System quite accurately using Newtons laws of physics. But in the early 1970s, scientists noticed that this didnt work fordisc galaxies stars at their… [+6804 chars]"}]}