{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Male Spiders Catapult off Their Mates To Avoid Sexual Cannibalism [High-Speed Video] - SciTechDaily", "description": "These male spiders catapult at impressive speeds to flee their mates before they get eaten. After males of the orb-weaving spider Philoponella prominens mate with a female, they quickly launch themselves away, researchers report today (April 25, 2022) in the …", "url": "https://scitechdaily.com/male-spiders-catapult-off-their-mates-to-avoid-sexual-cannibalism-high-speed-video/", "urlToImage": "https://scitechdaily.com/images/Male-Spider-Catapulting-off-Female.gif", "publishedAt": "2022-04-25T18:35:49Z", "content": "A male spider catapulting off a female during mating.\r\nThese male spiders catapult at impressive speeds to flee their mates before they get eaten.\r\nAfter males of the orb-weaving spider Philoponella … [+3341 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "We’ve Arrived! NASA’s Mars Perseverance Rover Starts the Delta Front Campaign - SciTechDaily", "description": "We made it! Perseverance is at the delta, and showering us with incredible images to pore over. Mars 2020 is officially out of “Rapid Traverse” mode, where we put the pedal to the metal and focused on driving quickly. We are back to standard operations now, a…", "url": "https://scitechdaily.com/weve-arrived-nasas-mars-perseverance-rover-starts-the-delta-front-campaign/", "urlToImage": "https://scitechdaily.com/images/NASAs-Perseverance-Rover-Operating-on-the-Surface-of-Mars.jpg", "publishedAt": "2022-04-25T14:03:29Z", "content": "ByEleni Ravanis, University of Hawaii at MnoaApril 25, 2022\r\nThis illustration depicts NASAs Perseverance rover operating on the surface of Mars. Credit: NASA\r\nWe made it! Perseverance is at the delt… [+3585 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Alexander Martin", "title": "Businessmen return from $55m trip to space station after over-staying by a week - Sky News", "description": "", "url": "https://news.sky.com/story/businessmen-return-from-55m-trip-to-space-station-after-over-staying-by-a-week-12598731", "urlToImage": "https://e3.365dm.com/22/04/1600x900/skynews-axiom-space_5751036.jpg?20220425125628", "publishedAt": "2022-04-25T12:45:37Z", "content": "The first all-private crew to travel to the International Space Station, comprised of three millionaire businessmen and their former NASA astronaut escort, is returning to Earth today\r\nTheir journey … [+2547 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "First 'space tourists' to visit ISS are heading home after bad weather delayed return journey - Daily Mail", "description": "Three businessmen - who each paid $55 million (£41 million) to take part in the trip - undocked from the ISS at 1:10 BST and are due to land off the coast of Florida at around 18:00 BST (13:00 ET).", "url": "https://www.dailymail.co.uk/sciencetech/article-10750677/First-space-tourists-visit-ISS-heading-home-bad-weather-delayed-return-journey.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/25/19/57036313-0-image-a-7_1650911373570.jpg", "publishedAt": "2022-04-25T10:02:40Z", "content": "The crew of the first fully private mission to the International Space Station are now back on Earth after a two-week stay.\r\nThree wealthy businessmen  who each paid $55 million (£41 million) to take… [+9963 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Venus Rotates, Slowly, Despite Sun’s Powerful Gravitational Pull - SciTechDaily", "description": "The planet’s atmosphere explains the gravity of the situation. Venus, Earth’s sister planet would likely not rotate, if not for its soupy, fast-moving atmosphere. Instead, Venus would be fixed in place, always facing the sun the way the same side of the moon …", "url": "https://scitechdaily.com/why-venus-rotates-slowly-despite-suns-powerful-gravitational-pull/", "urlToImage": "https://scitechdaily.com/images/Venus-in-Transit.jpg", "publishedAt": "2022-04-25T09:29:23Z", "content": "ByUniversity of California - RiversideApril 25, 2022\r\nA sequence of images from Solar Dynamic Observatory in 171 angstroms of the Venus transit, merged together to show the path of Venus across the s… [+2201 chars]"}, {"source": {"id": null, "name": "Giantfreakinrobot.com"}, "author": null, "title": "One Of Mars's Moons Is Going To Crash Into The Planet - Giant Freakin Robot", "description": "It's looking very much like one of the moons of Mars is going to break into pieces and actually crash into the red planet.", "url": "https://www.giantfreakinrobot.com/sci/mars-moon-phobos.html", "urlToImage": "https://www.giantfreakinrobot.com/wp-content/uploads/2021/11/mars-g6c84ce05d_1280.jpg", "publishedAt": "2022-04-25T06:44:37Z", "content": "By Doug Norrie\r\n| 2 hours ago\r\nEver been able to see a moon crash all the way into a planet before? Me neither, but one day folks might get that very chance. Though its going to take a while. Scienti… [+2717 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ganymede Casts a Massive Shadow Across Jupiter in Spectacular New Image From NASA’s Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft captured this magnificent view of Jupiter during the mission’s 40th close pass by the giant planet on February 25, 2022. The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede. Citizen scientist Thomas …", "url": "https://scitechdaily.com/ganymede-casts-a-massive-shadow-across-jupiter-in-spectacular-new-image-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-04-25T04:21:29Z", "content": "Figure 1. Citizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was about 44,000 … [+2849 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}]}