{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Say Refreezing Earth’s Poles Is Feasible and Remarkably Cheap - SciTechDaily", "description": "Earth’s poles are warming several times faster than the global average. In fact, record-smashing heatwaves were reported earlier this year in both the Arctic and Antarctic. Melting ice and collapsing glaciers at high latitudes would accelerate sea level rise …", "url": "https://scitechdaily.com/scientists-say-refreezing-earths-poles-is-feasible-and-remarkably-cheap/", "urlToImage": "https://scitechdaily.com/images/Planet-Earth-Panoramic-Arctic.jpg", "publishedAt": "2022-09-19T12:39:18Z", "content": "ByIOP PublishingSeptember 19, 2022\r\nAccording to new research, refreezing the poles by reducing incoming sunlight would be both feasible and remarkably cheap.\r\nEarths poles are warming several times … [+4145 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Really Killed Dinosaurs and Other Life on Earth? Maybe NOT an Asteroid Strike - SciTechDaily", "description": "Dartmouth-led research fortifies link between mega volcanoes and mass extinctions. What killed the dinosaurs 66 million years ago at the end of the Cretaceous Period? It has long been the topic of scientific debate, and many researchers have set out to determ…", "url": "https://scitechdaily.com/what-really-killed-dinosaurs-and-other-life-on-earth-maybe-not-an-asteroid-strike/", "urlToImage": "https://scitechdaily.com/images/Dinosaur-Extinction-Asteroid.jpg", "publishedAt": "2022-09-19T08:31:43Z", "content": "ByDartmouth CollegeSeptember 19, 2022\r\nWhile some scientists think that asteroid and comet strikes are the cause of mass extinction events on Earth, new research from Dartmouth points to volcanic eru… [+8330 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Rhys Blakely", "title": "Nasa rover finds a clue to life on Mars - The Times", "description": "A hunt by Nasa for signs of life on Mars has unearthed some of the most promising clues so far. Rocks analysed by Nasa’s Perseverance rover have been found to", "url": "https://www.thetimes.co.uk/article/nasa-rover-finds-a-clue-to-life-on-mars-7g26v9cf3", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F282a9db0-3761-11ed-a8ae-d2d57cd0511a.jpg?crop=4096%2C2304%2C0%2C213&resize=1200", "publishedAt": "2022-09-18T23:01:00Z", "content": "A hunt by Nasa for signs of life on Mars has unearthed some of the most promising clues so far. Rocks analysed by Nasas Perseverance rover have been found to contain intriguing organic compounds whic… [+504 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Historic Event for Human Spaceflight, New Artemis I Launch Date - SciTechDaily", "description": "Commemorating a historic event for human spaceflight … “We choose to go to the Moon …” An update on plans for Artemis I … And what NASA’s Perseverance rover is up to on Mars … a few of the stories to tell you about – This Week at NASA! https://youtu.be/1Ll0Fd…", "url": "https://scitechdaily.com/this-week-nasa-historic-event-for-human-spaceflight-new-artemis-i-launch-date/", "urlToImage": "https://scitechdaily.com/images/NASA-Historic-Event-for-Human-Spaceflight.gif", "publishedAt": "2022-09-18T10:16:14Z", "content": "ByNASASeptember 18, 2022\r\nMars is the second smallest planet in our solar system and the fourth planet from the sun. It is a dusty, cold, desert world with a very thin atmosphere. Iron oxide is preva… [+5593 chars]"}]}