{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Chaotic Triple Drama: Black Hole Billiards in the Centers of Galaxies - SciTechDaily", "description": "Researchers provide the first plausible explanation to why one of the most massive black hole pairs observed to date by gravitational waves also seemed to merge on a non-circular orbit. Their suggested solution, now published in Nature, involves a chaotic tri…", "url": "https://scitechdaily.com/chaotic-triple-drama-black-hole-billiards-in-the-centers-of-galaxies/", "urlToImage": "https://scitechdaily.com/images/Swarm-of-Smaller-Black-Holes-in-Gas-Disk.jpg", "publishedAt": "2022-03-09T16:00:56Z", "content": "Illustration of a swarm of smaller black holes in a gas disk rotating around a giant black hole. Credit: J. Samsing/Niels Bohr Institute\r\nResearchers provide the first plausible explanation to why on… [+6979 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gigantic Bubbles at Center of Milky Way Caused by Powerful Jet of Energy From Supermassive Black Hole - SciTechDaily", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy. Since then, astronomers have debated their origin. Now, a study including University of Michigan research suggests the bubbles are…", "url": "https://scitechdaily.com/gigantic-bubbles-at-center-of-milky-way-caused-by-powerful-jet-of-energy-from-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Gigantic-Bubbles.jpg", "publishedAt": "2022-03-09T10:42:06Z", "content": "The NASA visualization team created a superposition of an image of the Milky Way, taken by the European Space Agency’s Gaia space observatory, and a visualization of the simulations of the eRosita an… [+6681 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Tessa Koumoundouros", "title": "Biologists Just Totally Proved Wrong a Long-Standing Rumor About Sharks - ScienceAlert", "description": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.", "url": "https://www.sciencealert.com/marine-biologists-confirm-sharks-do-indeed-sleep-often-with-both-eyes-open", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/SpottedSwellSharkInDarkEnvironmentLitByGoldenLight_1024.jpg", "publishedAt": "2022-03-09T06:22:54Z", "content": "It's been rumored that sharks don't sleep at all; the fact some sharks must stay on the move to facilitate their breathing has contributed to this idea.\r\nA new study, however, finally confirms what a… [+3238 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Mark Waghorn", "title": "Ten-armed squid thought to be 328 million years old named after Joe Biden - The Independent", "description": "Syllipsimopodi bideni was armed with two more limbs than its descendants today and roamed the oceans 328 million years ago", "url": "https://www.independent.co.uk/news/science/squid-named-after-joe-biden-b2030948.html", "urlToImage": "https://static.independent.co.uk/2022/03/08/11/squidy-joe-weir-.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-03-08T17:48:15Z", "content": "A prehistoric squid with ten arms has been named after US President Joe Biden. The creature is the oldest ancestor of cephalopods, which also include octopuses.\r\nSyllipsimopodi bideni was armed with … [+4179 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Planet forming 444 light years away contains large organic molecule - Daily Mail", "description": "Astronomers discovered the chemical, known as dimethyl ether, a key building block of life, inside the planet forming disk around the young star IRS 48.", "url": "https://www.dailymail.co.uk/sciencetech/article-10590041/Planet-forming-444-light-years-away-contains-large-organic-molecule.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/08/15/55099607-0-image-a-23_1646753409661.jpg", "publishedAt": "2022-03-08T16:33:43Z", "content": "A ring of dust, gas and ice 444 light years from the Earth has been found to contain a large organic molecule, that could one day go on to form life.\r\nAstronomers discovered the chemical, known as di… [+8599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Junk Just Crashed Into the Far Side of the Moon at 5,800 MPH - SciTechDaily", "description": "Observers have been tracking a chunk of space junk, waiting for it to strike the Moon. It should’ve hit the far side of the Moon, and hopefully, orbiters will have images of the impact site, though that might take a while. The origins of the junk are in dispu…", "url": "https://scitechdaily.com/space-junk-just-crashed-into-the-far-side-of-the-moon-at-5800-mph/", "urlToImage": "https://scitechdaily.com/images/Rocket-Booster-Crash-Moon.gif", "publishedAt": "2022-03-08T09:37:36Z", "content": "Artist’s animation of a rocket booster crashing into the moon.\r\nObservers have been tracking a chunk of space junk, waiting for it to strike the Moon. It should’ve hit the far side of the Moon, and h… [+8669 chars]"}]}