{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Posts Tesla Job Ad On Twitter, Receives Hilarious Responses - NDTV", "description": "SpaceX and Tesla CEO Elon Musk recently posted a job advertisement on Twitter and internet users could not help but troll the billionaire.", "url": "https://www.ndtv.com/world-news/elon-musk-posts-tesla-job-ad-on-twitter-receives-hilarious-responses-2998759", "urlToImage": "https://c.ndtvimg.com/2022-04/pg7khrag_elon-musk_650x400_26_April_22.jpg", "publishedAt": "2022-05-22T11:18:23Z", "content": "Tesla is looking to build a litigation department to initiate and execute lawsuits. (File)\r\nSpaceX and Tesla CEO Elon Musk recently posted a job advertisement on Twitter and internet users could not … [+3371 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Apple looking to India, not China, to produce iPhones and more: Report - Hindustan Times", "description": "Apple iPhones: Manufacturing of Apple products was hit by Covid restrictions in China, and the company warned of an $8 bn loss.", "url": "https://www.hindustantimes.com/india-news/apple-looking-to-india-not-china-to-produce-iphones-and-more-report-101653213950176.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/22/1600x900/EU-APPLE-ANTITRUST-0_1653214083532_1653214088296.JPG", "publishedAt": "2022-05-22T10:17:14Z", "content": "Apple Inc. is looking to India to help boost production outside China, people involved in these discussions told the Wall Street Journal this week, citing strict Covid-19 norms in China that are affe… [+2829 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "Jordan Lyanchev", "title": "Terraform Labs Has Paid in Full its Taxes in South Korea, Says Do Kwon - CryptoPotato", "description": "Terraform's Do Kwon refuted reports that the company owns nearly $80 million in taxes to the South Korean government.", "url": "https://cryptopotato.com/terraform-labs-has-paid-in-full-its-taxes-in-south-korea-says-do-kwon/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2022/05/ezgif.com-gif-maker.jpg", "publishedAt": "2022-05-22T09:59:12Z", "content": "A lot has been said about Do Kwon, his cryptocurrency project, and the failure of the two native digital assets in the past two weeks. One of them included owning $78 million in taxes to South Korea,… [+371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Salil Parekh Reappointed Infosys Chief For Next 5 Years - NDTV Profit", "description": "Salil Parekh has been the Chief Executive Officer and Managing Director of Infosys since January 2018", "url": "https://www.ndtv.com/business/salil-parekh-reappointed-infosys-chief-for-next-5-years-2998495", "urlToImage": "https://c.ndtvimg.com/2019-10/s6ofk9h8_infosys-ceo-salil-parekh-650_650x400_22_October_19.jpg", "publishedAt": "2022-05-22T09:52:41Z", "content": "Salil Parekh has been reappointed as Infosys chief for next five years\r\nBengaluru (Karnataka): Infosys Limited, India's second-largest IT services company, on Sunday said it has reappointed Salil Par… [+1894 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "“Poor Again,” Tweets Founder Of Cryptocurrency Exchange Binance After Luna Crashes - NDTV Profit", "description": "Despite the crash and the fall in the price of Luna, Chanpeng Zhao has a net worth of around $14.9 billion", "url": "https://www.ndtv.com/business/after-luna-crash-binance-founder-changpeng-zhao-says-he-is-poor-again-2998454", "urlToImage": "https://c.ndtvimg.com/2022-05/lc3pbgqo_binance3_625x300_22_May_22.jpg", "publishedAt": "2022-05-22T09:13:52Z", "content": "Despite Luna crash, Chanpeng Zhao has a net worth of around $14.9 billion\r\nChangpeng Zhao, the founder of cryptocurrency exchange Binance, tweeted a few days ago that he was poor again after losing b… [+2642 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Royal Enfield 650 Twins Register Nearly 67% Sales Growth In April 2022 - GaadiWaadi.com", "description": "Last month, RE Interceptor 650 and Continental GT 650 logged a combined sales figure of 2,159 units, with YoY sales growth of 66.98 per cent", "url": "https://gaadiwaadi.com/royal-enfield-650-twins-register-nearly-67-sales-growth-in-april-2022/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/12/Royal-Enfield-Continental-GT650-wallpaper.jpg", "publishedAt": "2022-05-22T08:30:11Z", "content": "Royal Enfield is the most popular premium motorcycle brand in India, with products ranging from 350cc to 650cc in engine capacity. The brand enjoys a cult-like following among enthusiasts. In April, … [+1936 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Mahindra Scorpio-N revealed, Hyundai Tucson details, Jeep Meridian price & more |News| Autocar India - Autocar India", "description": "In this week's edition of Autocar Quick News, we have the first official images of the new Mahindra Scorpio-N, prices for the Jeep Meridian, details of the u...", "url": "https://www.youtube.com/watch?v=7wzFHum9gxI", "urlToImage": "https://i.ytimg.com/vi/7wzFHum9gxI/hqdefault.jpg", "publishedAt": "2022-05-22T08:30:01Z", "content": null}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Mihir R. Barve", "title": "New Maruti-Suzuki Vitara Brezza Spotted Undisguised - carandbike", "description": "The new Maruti-Suzuki Vitara Brezza will get a refreshed look and updated tech to bring it at par with rivals.", "url": "https://www.carandbike.com/news/new-maruti-suzuki-vitara-brezza-spotted-undisguised-2998304", "urlToImage": "https://c.ndtvimg.com/2022-05/9u0crsbc_2022-vitara-brezza_625x300_22_May_22.jpg", "publishedAt": "2022-05-22T07:21:45Z", "content": "Maruti-Suzuki is looking to up its game in the SUV segment, with two new SUVs coming its way soon. The first of which will be the new Vitara Brezza, which is expected to go on sale in the coming mont… [+1902 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "FPIs dump Indian equities worth over Rs 35,000 crore in May so far - Economic Times", "description": "With this, net outflow by Foreign Portfolio Investors (FPIs) from equities reached Rs 1.63 lakh crore so far in 2022.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-dump-indian-equities-worth-over-rs-35000-crore-in-may-so-far/articleshow/91720715.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91720680,width-1070,height-580,imgsize-45360,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-22T06:26:00Z", "content": "New Delhi: Exodus of foreign money from the Indian equity markets continues unabated with FPIs pulling out over Rs 35,000 crore so far this month on concerns over the prospects of more aggressive rat… [+2905 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Markets may face volatility amid derivatives expiry; global trends and FII trading key: Experts - Moneycontrol", "description": "Last week, the Sensex climbed 1,532.77 points or 2.90 percent, while the Nifty jumped 484 points or 3.06 percent. Last week, the Sensex climbed 1,532.77 points or 2.90 percent, while the Nifty jumped 484 points or 3.06 percent.", "url": "https://www.moneycontrol.com/news/business/markets/markets-may-face-volatility-amid-derivatives-expiry-global-trends-and-fii-trading-key-experts-8552711.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/stocks_sensex_nifty_stockmarket-1-770x433.jpg", "publishedAt": "2022-05-22T06:19:05Z", "content": "Global factors and trading activity of foreign institutional investors are expected to guide domestic market sentiments this week, while equity benchmarks may face volatility amid monthly derivatives… [+2248 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Brand new Volkswagen Taigun gets involved in a crash: Owner Satisfied With The Build Quality - CarToq.com", "description": "People of India have recently become conscious about the build quality of their vehicles. All this happened when Tata Nexon became the first car to score 5 stars on the Global NCAP crash test. So, Mahindra and Tata are known to produce well-built products. Th…", "url": "https://www.cartoq.com/brand-new-volkswagen-taigun-gets-involved-in-a-crash/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/taigun-accident-featured.jpg", "publishedAt": "2022-05-22T05:05:56Z", "content": "People of India have recently become conscious about the build quality of their vehicles. All this happened when Tata Nexon became the first car to score 5 stars on the Global NCAP crash test. So, Ma… [+2721 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Actor Mahesh Babu spotted riding a Jawa motorcycle - CarToq.com", "description": "Popular actor, Mahesh Babu was recently spotted riding a  Jawa motorcycle. Mahesh Babu is very popular in Telugu cinema. The images of the actor were shared on Twitter by Anupam Thareja who is the co-founder of Classic Legends. The post says that Mahesh Babu …", "url": "https://www.cartoq.com/actor-mahesh-babu-spotted-riding-a-jawa-motorcycle/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/mahesh-babu-jawa-featured.jpg", "publishedAt": "2022-05-22T03:23:11Z", "content": "Popular actor, Mahesh Babu was recently spotted riding a  Jawa motorcycle. Mahesh Babu is very popular in Telugu cinema. The images of the actor were shared on Twitter by Anupam Thareja who is the co… [+2689 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Bill Gates: Crypto Has No Valuable Output — It's Not Adding to Society Like Other Investments – Featured Bitcoin News - Bitcoin News", "description": "Microsoft co-founder Bill Gates has explained why he does not own any bitcoin or other cryptocurrencies.", "url": "https://news.bitcoin.com/bill-gates-crypto-has-no-valuable-output-its-not-adding-to-society-like-other-investments/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/bill-gates.jpg", "publishedAt": "2022-05-22T01:34:47Z", "content": "Microsoft co-founder Bill Gates has explained why he does not own any bitcoin or other cryptocurrencies. “I like investing in things that have valuable output,” Gates said, adding that crypto is “not… [+2194 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Lijee Philip and Pranav Balakrishnan", "title": "Rising fuel costs, less sops forcing most cabbies out - Economic Times", "description": "Commuters are, in short, getting a raw deal, as a steep increase in the price of CNG and slashing of incentives by the aggregators such as Ola and Uber have made it unviable for drivers to ply, experts said.", "url": "https://economictimes.indiatimes.com/tech/technology/rising-fuel-costs-less-sops-forcing-most-cabbies-out/articleshow/91714402.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91714513,width-1070,height-580,imgsize-414957,overlay-ettech/photo.jpg", "publishedAt": "2022-05-22T00:31:00Z", "content": "Mumbai | Bengaluru: Frequent users of cabs are facing trip cancellations, higher fares and longer wait times. They are also dealing with drivers refusing to go to certain locations or demanding extra… [+4765 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sreeradha D Basu and Prachi Verma", "title": "IT firms trying to win attrition war with bonus, Esops - Economic Times", "description": "​​Attrition rates may have moderated for IT cos, but continue to remain a real concern given the huge demand for tech workers, across a variety of digital sectors", "url": "https://economictimes.indiatimes.com/tech/technology/it-giants-are-offering-more-benefits-to-retain-top-talent/articleshow/91710883.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91711122,width-1070,height-580,imgsize-2155739,overlay-ettech/photo.jpg", "publishedAt": "2022-05-22T00:30:00Z", "content": "New Delhi: Indian IT services providers are going all out to arrest attrition rates amid a war for talent in areas such as digital, data science, machine learning, artificial intelligence, blockchain… [+3492 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Gold Price Outlook: Top 5 Triggers That May Dictate Yellow Metal Rates | Mint - Mint", "description": "Gold price outlook: Movement in dollar will be worth watching as dollar index has shed from 105 levels to around 103. Further downside in dollar index may boost demand for precious metal", "url": "https://www.livemint.com/market/commodities/gold-price-outlook-top-5-triggers-that-may-dictate-yellow-metal-rates-11653121445319.html", "urlToImage": "https://images.livemint.com/img/2022/05/21/600x338/gold-price-kOZF--621x414@LiveMint_1653121630478.jpg", "publishedAt": "2022-05-22T00:10:50Z", "content": "Gold prices regained some its lost ground after a four-week consecutive fall and settled in green zone on Friday. The yellow metal found traction as the US Dollar (USD) retreated from a 20-year high,… [+2645 chars]"}, {"source": {"id": null, "name": "ZyCrypto"}, "author": null, "title": "Bitcoin, Ether, Cardano, Solana Bull Rally In Second Half Of 2022 Is ‘Unquestionable’, Says Crypto Exec - ZyCrypto", "description": "The prices of cryptocurrencies have left investors scratching their heads on whether the worst of the storm has passed or prices could plunge", "url": "https://zycrypto.com/bitcoin-ether-cardano-solana-bull-rally-in-second-half-of-2022-is-unquestionable-says-crypto-exec/", "urlToImage": "https://zycrypto.com/wp-content/uploads/2022/05/Bitcoin-Ether-Cardano-Solana-Bull-Rally-In-Second-Half-Of-2022-Is-Unquestionable-Says-Crypto-Exec.jpg", "publishedAt": "2022-05-21T21:17:50Z", "content": "<ul><li>Cryptocurrencies are going to recover in 2022 after the broad sell-off in the last few weeks, says an analyst.</li><li>The narrative of Bitcoin as a hedge against inflation is changing thanks… [+2917 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Lizard in cold drink’, AMC seals McDonald’s outlet - The Indian Express", "description": "Taking cognisance of the complaint by one Bhargav Joshi, AMC Food Safety Officer Devang Patel collected cold drink samples from the outlet for testing at the public health laboratory in Ahmedabad", "url": "https://indianexpress.com/article/cities/ahmedabad/lizard-in-cold-drink-amc-seals-mcdonalds-outlet-7929721/", "urlToImage": "https://images.indianexpress.com/2022/05/mcd.jpg", "publishedAt": "2022-05-21T18:37:13Z", "content": "The Ahmedabad Municipal Corporation (AMC) Saturday sealed a McDonald’s outlet at Sola after a picture of a dead lizard in a cold drink that was served by the restaurant surfaced on social media.Buy N… [+1142 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Kuntala Sarkar", "title": "Buy This Pharma Stock For High Returns, Companys India Sales Up Sharply By 137%: Motilal Oswal - Goodreturns", "description": "Acknowledged brokerage firm Motilal Oswal suggests buying the stocks of Gland Pharma, for good returns in the short term. Mentioning the expected up-gradation of the stock, the brokerage firm stated, Based on its launch momentum, filing pace, the upside from …", "url": "https://www.goodreturns.in/personal-finance/investment/buy-this-pharma-stock-for-high-returns-company-s-india-sales-up-sharply-by-137-motilal-oswal-1250037.html", "urlToImage": "https://www.goodreturns.in/img/2016/11/stockmarket13-15-1479204680.jpg", "publishedAt": "2022-05-21T18:10:05Z", "content": "The Current Market Price (CMP) of Gland Pharma is Rs. 3,096. Motilal Oswal has estimated a Target Price for the stock at Rs. 3,700. Stock is anticipated to give a +20% return, in 1 year.\r\n<table><tr>… [+3407 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas", "title": "Everyone is drafting their own startup Black Swan memo - TechCrunch", "description": "Welcome to Startups Weekly, a fresh, human-first take on this week’s startup news and trends. To get this in your inbox, subscribe here. “You can often pick up significant market share in an economic downturn by just staying alive,” top startup accelerator Y …", "url": "https://techcrunch.com/2022/05/21/everyone-is-drafting-up-their-own-startup-black-swan-memo/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2015/09/writing-dna.jpg?w=711", "publishedAt": "2022-05-21T18:08:08Z", "content": "Welcome to Startups Weekly, a fresh, human-first take on this weeks startup news and trends. To get this in your inbox, subscribe here.\r\nYou can often pick up significant market share in an economic … [+4490 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Tesla CEO Elon Musk accused of sexual assault by SpaceX flight attendant - CarToq.com", "description": "The multi-billionaire CEO of Tesla Inc. and SpaceX Elon Musk is a very vocal person as everyone might have understood by now because of his unsupervised tweets. Also, it is not uncommon for him to get a ton of negative criticism. However, this time around, a …", "url": "https://www.cartoq.com/tesla-ceo-elon-musk-accused-of-sexual-assault-by-spacex-flight-attendant/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/musk-sexual-assault-allegation-fb.jpg", "publishedAt": "2022-05-21T17:49:01Z", "content": "The multi-billionaire CEO of Tesla Inc. and SpaceX Elon Musk is a very vocal person as everyone might have understood by now because of his unsupervised tweets. Also, it is not uncommon for him to ge… [+4823 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Crypto's Barren Wasteland: A Look at What's Left of Terra's Defi and Token Ruins – Bitcoin News - Bitcoin News", "description": "Following the Terra fallout and the great UST de-pegging event, the Terra network ecosystem is now a wasteland of almost worthless tokens.", "url": "https://news.bitcoin.com/cryptos-barren-wasteland-a-look-at-whats-left-of-terras-defi-and-token-ruins/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/hhhgfffddsssss.jpg", "publishedAt": "2022-05-21T16:31:44Z", "content": "Following the Terra blockchain fallout and the great UST de-pegging event, the Terra network ecosystem is now a wasteland of almost worthless tokens and protocols. While both UST and LUNA were top te… [+4960 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Nikhil Patwardhan", "title": "Healthtech startup MFine lays off over 500 employees amid funding crunch - Moneycontrol", "description": "Employees were told that the startup is short on funds to release salaries for coming months.", "url": "https://www.moneycontrol.com/news/business/startup/healthtech-startup-mfine-lays-off-over-500-employees-amid-funding-crunch-8551941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/layoffs-770x433.jpg", "publishedAt": "2022-05-21T16:06:31Z", "content": "Healthtech startup MFine, run by Novocura Tech Health Services, has laid off over 500 employees amid a funding crunch at the Beenext and Stellaris-backed startup, according to employees Moneycontrol … [+3215 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ukraine-Russia conflict: McDonald's to leave Russia after 30 years | International News | WION - WION", "description": "McDonald's became one of the biggest brands to exit Russia, 850 restaurants being sold to a Russian licensee after operating in the country for more than thr...", "url": "https://www.youtube.com/watch?v=g-dbcWeY9yw", "urlToImage": "https://i.ytimg.com/vi/g-dbcWeY9yw/maxresdefault.jpg", "publishedAt": "2022-05-21T15:58:06Z", "content": null}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "10 things that you DON’T know about the Tata Nexon Electric SUV - CarToq.com", "description": "Tata Nexon EV is currently the best selling electric SUV in India. It was launched in the market back in 2020 and ever since then, it is a well received product among electric car buyers in India. It won’t be actually wrong to say that Nexon EV is what made e…", "url": "https://www.cartoq.com/10-things-that-you-dont-know-about-the-tata-nexon-electric-suv/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/02/Tata-Nexon-EV-1.jpg", "publishedAt": "2022-05-21T15:51:38Z", "content": "Tata Nexon EV is currently the best selling electric SUV in India. It was launched in the market back in 2020 and ever since then, it is a well received product among electric car buyers in India. It… [+3695 chars]"}, {"source": {"id": null, "name": "CryptoSlate"}, "author": null, "title": "Brazilian crypto exchange refunds all UST holders 1:1 - CryptoSlate", "description": "Nox Bitcoin, a Brazilian crypto exchange will be reimbursing customers up to $3 million for losses associated to the UST de-peg", "url": "https://cryptoslate.com/brazilian-crypto-exchange-refunds-all-ust-holders-11/", "urlToImage": "https://cryptoslate.com/wp-content/uploads/2022/05/brazil-bitcoin.jpg", "publishedAt": "2022-05-21T14:50:00Z", "content": "Brazil-based crypto exchange Nox Bitcoin announced it will spend 620.000 Brazilian reais to reimburse UST holders, crypto news outlet Portal do Bitcoin reported.\r\nThe exchange will make up the differ… [+3978 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "The Quint", "title": "Start-Up at 23, Nearly $1 Billion Valuation at 26: Who Is Zilingo’s Ankiti Bose? - The Quint", "description": "Ankiti Bose Sacked: Profile of Zilingo co-founder, who started fashion e-commerce platform at the age of 23, now embroiled in struggle with co-founder and major investor Sequoia Capital.", "url": "https://www.thequint.com/news/business/ankiti-bose-profile-zilingo-cofounder-sacked", "urlToImage": "https://images.thequint.com/thequint%2F2022-05%2F52e3a571-4c4c-4714-b0ca-95fd919d83f4%2FZilingo_Ankiti_Bose.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-05-21T13:58:29Z", "content": "But with growth being targeted by the company following discussions between Bose and Sequoia in 2018, things soon began to go off the rails. The first problem came from the B2C business, into which m… [+687 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Cryptocurrency Is 'Based on Nothing,' Should Be Regulated, ECB's Lagarde Says – Regulation Bitcoin News - Bitcoin News", "description": "President of the European Central Bank Christine Lagarde has insisted that unlike a digital euro, cryptocurrency has no underlying asset.", "url": "https://news.bitcoin.com/cryptocurrency-is-based-on-nothing-should-be-regulated-ecbs-lagarde-says/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/shutterstock_1637531557.jpg", "publishedAt": "2022-05-21T13:32:43Z", "content": "President of the European Central Bank Christine Lagarde has insisted that unlike a digital euro, cryptocurrency has no underlying asset. It should be regulated to prevent people from losing their li… [+3439 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "The Second Ever Rolls-Royce Boat Tail Unveiled, Priced Rs. 217+ Crore - GaadiWaadi.com", "description": "This Rolls-Royce Boat Tail acts as tribute to the client's family and his father's history taking design inspiration from the mother of pearl", "url": "https://gaadiwaadi.com/the-second-ever-rolls-royce-boat-tail-unveiled-priced-rs-217-crore/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/05/Rolls-Royce-Boat-Tail-Front.jpg", "publishedAt": "2022-05-21T13:09:35Z", "content": "Rolls-Royce has unveiled the second unit of the Boat Tail project and it will make its public debut at the 2022 Concorso dEleganza, Villa dEste in Italy. Created for a special client, it acts as a tr… [+1981 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Ola S1 Pro Gets Price Hike As The New Purchase Window Goes Live | Mint - Mint", "description": "Ola S1 Pro was launched at  ₹1.29 lakh", "url": "https://www.livemint.com/auto-news/ola-s1-pro-gets-price-hike-as-the-new-purchase-window-goes-live-11653135359158.html", "urlToImage": "https://images.livemint.com/img/2022/05/21/600x338/Screenshot_(510)_1629531180258_1653135498081.png", "publishedAt": "2022-05-21T12:21:07Z", "content": "Ola has hiked the price of its S1 Pro electric scooter today. The mobility firm had already announced this probable hike in the past and now with the opening of new purchase window the new price of O… [+1372 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Maruti-Toyota Midsize SUV (Creta Rival) To Be Feature Rich – Details - GaadiWaadi.com", "description": "Maruti Suzuki and Toyota have already begun trial production of their upcoming jointly-developed midsize SUV, which will debut this year", "url": "https://gaadiwaadi.com/maruti-toyota-midsize-suv-creta-rival-to-be-feature-rich-details/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/11/2021-suzuki-SX4-Scross-6.jpg", "publishedAt": "2022-05-21T12:09:54Z", "content": "Maruti Suzuki and Toyota are currently working together on a few new vehicles for the Indian car market. Among these upcoming models, the most anticipated vehicle is their new midsize SUV. Codenamed … [+2045 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "BHEL returns to black, posts Rs 912-cr net profit in Q4, declares dividend - Business Standard", "description": "Total income during January-March 2022, rose to Rs 8,181.72 crore, from Rs 7,245.16 crore in the year-ago period", "url": "https://www.business-standard.com/article/companies/bhel-returns-to-black-posts-rs-912-cr-net-profit-in-q4-declares-dividend-122052100588_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-07/15/full/1563206875-2075.jpg", "publishedAt": "2022-05-21T11:35:00Z", "content": "State-owned engineering firm BHEL on Saturday returned to black posting Rs 912.47 crore consolidated net profit in the March quarter, backed by higher income.\r\nIn the year-ago quarter, the company ha… [+2147 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Paytm Sets Up General Insurance Jv, Plans To Invest ₹950 Cr In 10 Years | Mint - Mint", "description": "The investment will be made in trances and will result in Paytm holding an upfront equity stake of 74% in the JV.", "url": "https://www.livemint.com/companies/news/paytm-sets-up-general-insurance-jv-plans-to-invest-rs-950-cr-in-10-years-11653132320815.html", "urlToImage": "https://images.livemint.com/img/2022/05/21/600x338/paytm-kBLD--621x414@LiveMint_1653132666958.jpg", "publishedAt": "2022-05-21T11:32:32Z", "content": "The board of directors of One 97 Communications which is listed under the brand name Paytm, on Saturday approved the proposal to pump in 950 crore in their newly formed joint venture general insuranc… [+1842 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Apply and get loan amount in account in 30 minutes! HDFC Bank introduces XPress car loans - CarToq.com", "description": "The Xpress Car Loan is a simplified and intuitive method to get a car loan and it makes the process a lot more comprehensive, faster and convenient for car buyers. Buyers can use the Xpress Car Loan to apply for up to Rs 20 lakh and the loan amount will be cr…", "url": "https://www.cartoq.com/apply-and-get-loan-amount-in-account-in-30-minutes-hdfc-bank-introduces-xpress-car-loans/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2020/12/maruti-suzuki-showroom-car-buyers.jpg", "publishedAt": "2022-05-21T10:43:08Z", "content": "The Xpress Car Loan is a simplified and intuitive method to get a car loan and it makes the process a lot more comprehensive, faster and convenient for car buyers. Buyers can use the Xpress Car Loan … [+3248 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Ambar Warrick", "title": "Just-In: Vitalik Buterin No Longer A Billionaire As Ethereum Crashes - CoinGape", "description": "Ethereum founder Vitalik Buterin said he is no longer a billionaire, following a severe drop in Ethereum (ETH) prices this year.", "url": "https://coingape.com/just-in-vitalik-buterin-no-longer-a-billionaire-as-ethereum-crashes/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/05/05175323/vitalik-b.jpg", "publishedAt": "2022-05-21T10:31:50Z", "content": "Ethereum co-founder Vitalik Buterin said on Friday that he is no longer a billionaire, following a severe drop in Ethereum (ETH) prices this year.\r\nButerin, who had co-created Ethereum in 2014, repor… [+1899 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "PayTm Re-Appoints Founder Vijay Shekhar Sharma as MD and CEO; Details Here - News18", "description": "PayTm communicated the decision in a BSE filing on Saturday, May 21 and said Vijay Shekhar Sharma's tenure has been extended", "url": "https://www.news18.com/news/business/paytm-re-appoints-founder-vijay-shekhar-sharma-as-md-and-ceo-details-here-5220295.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-3-39-164700853216x9.jpg", "publishedAt": "2022-05-21T10:24:00Z", "content": "Digital payment company Paytm on Saturday announced that the firm had re appointed its founder Vijay Shekhar Sharma as managing director and chief executive officer till May 2027, thereby extending t… [+2893 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Gaurav Sharma", "title": "Shree Cement Q4 Results | Standalone profit falls 16% YoY to Rs 645 crore; revenue grows 3.6% to Rs 4,099... - Moneycontrol", "description": "The sequential growth was aided by higher volumes and better realizations during the quarter. The year-on-year decline in profit was due to surge in power &amp; fuel costs and the high base of last year’s quarter.", "url": "https://www.moneycontrol.com/news/business/earnings/shree-cement-q4-results-standalone-profit-falls-16-yoy-to-rs-645-crore-revenue-grows-3-6-to-rs-4099-crore-8550591.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/12/Shree-Cement-770x433.jpg", "publishedAt": "2022-05-21T09:33:33Z", "content": "Shree Cement Limited on May 21 reported a 16 percent decline in standalone net profit of Rs 645 crore in the fourth quarter of FY22, as against Rs 768 crore recorded a year ago. On a sequential basis… [+2552 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Yamaha XMax 250cc Darth Vader edition launched: Key highlights - HT Auto", "description": "Yamaha XMax 250cc scooter has been launched in a new special Darth Vader edition in the market of Brazil.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/yamaha-xmax-250cc-darth-vader-edition-launched-key-highlights-41653118458542.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/05/21/600x338/Darth_Vadar_Yamaha_1653123993069_1653124002614.jpg", "publishedAt": "2022-05-21T09:09:35Z", "content": "Yamaha XMax 250cc scooter has been launched in a new special edition in the market of Brazil. The new special edition model has been rolled out in a new Darth Vader Edition. This special iteration of… [+1577 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Ambar Warrick", "title": "Is Andre Cronje Back On Fantom? FTM Jumps 13% - CoinGape", "description": "FTM, the native token for the Fantom blockchain rallied on Saturday after DeFi developer Andre Cronje was spotted writing code on the chain.", "url": "https://coingape.com/is-andre-cronje-back-on-fantom-ftm-jumps-13/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2020/10/15180807/Yearn-Finance-Founder-Andre-Cronje-Puts-Himself-Up-As-Uniswap-Delegate.jpg", "publishedAt": "2022-05-21T08:27:21Z", "content": "FTM, the native token for the Fantom blockchain rallied on Saturday after DeFi developer Andre Cronje was spotted writing code on the chain.\r\nFTM jumped 13% from intraday lows to $0.3746, outpacing a… [+2023 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "FY22 earnings report card: Here are top 10 most profitable companies in India - India Inc report card - Economic Times", "description": "The private lender reported 28 per cent profit growth during the year to report profits at Rs 25783.83 crore. Lately, it has become a crowd favourite, at least on Dalal Street, as HDFC Bank has lagged in terms of stock market performance. ​ICICI Bank | Profit…", "url": "https://economictimes.indiatimes.com/fy22-earnings-report-card-here-are-top-10-most-profitable-companies-in-india/icici-bank-profit-rs-25783-83-crore/slideshow/91705060.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91705180,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-21T07:52:00Z", "content": "21 May 2022, 01:22 PM IST\r\nThe March quarter and fiscal year 2022 earnings season is all but over. The year has been largely a story of recovery for India Inc. after a forgetful pandemic affected yea… [+3441 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Ambar Warrick", "title": "After Terra Crash, Galaxy Digital CEO Warns Against Bottom Buying - CoinGape", "description": "Mike Novogratz, CEO of digital asset manager Galaxy Digital, warned against trying to predict a bottom to the recent crypto crash.", "url": "https://coingape.com/after-terra-crash-galaxy-digital-ceo-warns-against-bottom-buying/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2020/02/06110501/mike_novogratz-e1647430985128.jpg", "publishedAt": "2022-05-21T07:38:45Z", "content": "Mike Novogratz, CEO of digital asset manager Galaxy Digital, warned against trying to predict a bottom to the recent crypto crash.\r\nNovogratz’s comments come in the wake of one of the worst downturns… [+1822 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Jayashree Bhosale", "title": "Consumers expected to get relief from high cooking oil prices as Indonesia lifts export ban on palm oil - Economic Times", "description": "Indonesia has asked its cooking oil industry to reserve 10 million tonnes of palm oil for domestic consumption. Traders said the availability of different types of cooking oils would improve in the coming months. Indonesias palm oil production season begins n…", "url": "https://economictimes.indiatimes.com/industry/cons-products/food/consumers-expected-to-get-relief-from-high-cooking-oil-prices-as-indonesia-lifts-export-ban-on-palm-oil/articleshow/91704754.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91704737,width-1070,height-580,imgsize-70352,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-21T07:36:00Z", "content": "Cooking oil prices are expected to cool gradually from June as Indonesia, the largest producer and exporter of palm oil, has announced to lift its export ban on May 23.\r\nSupplies of sunflower oil fro… [+1509 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Rumour: 4th-gen Hyundai Tucson could be launched by July 2022 - Team-BHP", "description": "The fourth-generation Hyundai Tucson has been testing in India for quite some time. While we still don't have an official launch date, rumours suggest that the SUV might go on sale by July 2022. Reports also suggest that the Tucson could be offered with a 7-s…", "url": "https://www.team-bhp.com/news/rumour-4th-gen-hyundai-tucson-could-be-launched-july-2022", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/FB_IMG_1653112580196.jpg", "publishedAt": "2022-05-21T07:26:53Z", "content": "The fourth-generation Hyundai Tucson has been testing in India for quite some time. While we still don't have an official launch date, rumours suggest that the SUV might go on sale by July 2022.\r\nRep… [+733 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Tim Draper Bullish on Bitcoin Due to Its Inflation Hedge Traits – Bitcoin News - Bitcoin News", "description": "Tim Draper, an early bitcoin investor, declared he is bullish on the value of bitcoin even with the downturn its price is taking.", "url": "https://news.bitcoin.com/tim-draper-bullish-on-bitcoin-due-to-its-inflation-hedge-traits/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/shutterstock_1922305823.jpg", "publishedAt": "2022-05-21T06:59:22Z", "content": "Tim Draper, an early bitcoin investor, has declared he is still optimistic about the value of the first cryptocurrency even with the downturn its price has taken in the last months. Draper believes t… [+3215 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neeraj Joshi", "title": "From blood-on-the-streets to a full-blown bubble, some conversations post-crypto crash - Economic Times", "description": "​Terra (UST), a stablecoin designed to peg the value of the US dollar, and its sister coin, Luna, both plummeted. Luna, a not-so-stable stablecoin, was selling at around $118 just a month ago, but it is now virtually worthless. The crypto currency managed to …", "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/from-blood-on-the-streets-to-a-full-blown-bubble-some-conversations-post-crypto-crash/articleshow/91703839.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91703839,width-1070,height-580,imgsize-67388,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-21T06:48:00Z", "content": "People frequently seek for other investing options, particularly during stock market downturns. Traditionally, gold was seen to be a safe haven, but recently, the market has been buzzing about crypto… [+4717 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Jayshree P. Upadhyay", "title": "Nse Co-location Case: Cbi Conducts Searches On Brokers | Mint - Mint", "description": "CBI is conducting searches on brokers across 10 locations in Delhi, Mumbai, Gandhinagar and Kolkata.", "url": "https://www.livemint.com/news/india/nse-co-location-case-cbi-conducts-searches-on-brokers-11653114617952.html", "urlToImage": "https://images.livemint.com/img/2022/05/21/600x338/Screenshot_2022-05-16_at_6.06.33_PM_1652704611518_1653115107918.png", "publishedAt": "2022-05-21T06:42:44Z", "content": "Mumbai: The Central Bureau of Investigation (CBI) on Saturday began nationwide searches on brokers who allegedly misused the NSE co-location facility during 2010-2015 and had unfair access to some ne… [+3499 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "More than 100 smallcaps gain 10-50% as market bounces back in volatile week - Moneycontrol", "description": "The BSE Sensex and Nifty50 recovered some of their monthly losses but were still down nearly four percent in the month of May.", "url": "https://www.moneycontrol.com/news/business/markets/more-than-100-smallcaps-gain-10-50-as-market-bounces-back-8549071.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/sensex_stocks-1-770x433.jpg", "publishedAt": "2022-05-21T05:53:30Z", "content": "After losing four percent each in previous two weeks, Indian markets bounced back gaining three percent in the highly volatile week ended May 20 despite worries over rising inflation, persistent fore… [+6253 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Tech Desk", "title": "No More Unknown Callers, Govt Working On Its Own 'Truecaller-like' Framework: Report - News18", "description": "Trai has received a reference to begin consultation on the same from the Department of Telecom (DoT). The consultation on this is expected to begin in a couple of months, Trai Chairman PD Vaghela said.", "url": "https://www.news18.com/news/tech/no-more-unknown-callers-govt-working-on-its-own-truecaller-like-framework-report-5217553.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/truecaller_calling-165311182416x9.jpg", "publishedAt": "2022-05-21T05:44:15Z", "content": "The Telecom Regulatory Authority of India (Trai) is working on a new framework that would essentially flash the callers name on the recipients phone screen. Currently, a name flashes on the phone scr… [+1976 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "Three mid-flight engine shutdowns spark regulatory probe - Moneycontrol", "description": "The so-called commanded in-flight shutdowns -- when pilots intentionally turn off one of the two engines after encountering problems -- may have stemmed from different issues", "url": "https://www.moneycontrol.com/news/business/three-mid-flight-engine-shutdowns-spark-regulatory-probe-8549161.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Airline-770x433.jpg", "publishedAt": "2022-05-21T04:49:14Z", "content": "India is investigating three separate incidents in the past two months where airline pilots had to shut down plane engines mid-flight made by a joint venture of General Electric Co. and Frances Safra… [+2777 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Airtel prepaid plans to get another price hike this year, CEO confirms - India Today", "description": "Airtel CEO Gopal Vittal has confirmed that Airtel may hike the price of its prepaid plans again. This time, the average revenue per user (ARPU) will be set at Rs 200.", "url": "https://www.indiatoday.in/technology/news/story/airtel-prepaid-plans-to-get-costlier-ceo-gopal-vittal-reveals-1952219-2022-05-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/Screenshot_2022-05-21_at_10.13-647x363.png?6s2GPIXzosffpCAFq.n6oEJ0OFdAas2s", "publishedAt": "2022-05-21T04:45:33Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mehab Qureshi", "title": "No more cancellations? Uber’s new policy to improve rider experience - The Indian Express", "description": "The top reasons for most such ride cancellations are drop locations and modes of payment (either cash, card or UPI) chosen by customers but deemed unfavourable by drivers.", "url": "https://indianexpress.com/article/technology/tech-news-technology/no-more-uber-cancellations-new-policy-to-improve-rider-experience-7927764/", "urlToImage": "https://images.indianexpress.com/2022/05/taxi-1200.jpg", "publishedAt": "2022-05-21T04:07:20Z", "content": "Commuters in metro cities are frustrated over the increasing number of cancellations on Uber, the app-based taxi service. Geetika Sachdev–a communication professional based in Gurgaon– is extremely d… [+3156 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "State Bank Of India (sbi) To Soon Turn Ex-dividend Stock. Details Here | Mint - Mint", "description": "SBI dividend 2022: The central board of State Bank of India has announced 710 per cent dividend for FY22", "url": "https://www.livemint.com/market/stock-market-news/state-bank-of-india-sbi-to-soon-turn-ex-dividend-stock-details-here-11653098831095.html", "urlToImage": "https://images.livemint.com/img/2022/05/21/600x338/SBI_1650306908941_1653098954474.jpg", "publishedAt": "2022-05-21T02:13:25Z", "content": "Dividend paying stock: The State Bank of India (SBI) has informed Indian exchanges that the Central Board of the bank at its meeting held on 13th May 2022 has declared a dividend of 7.10 per equity s… [+1366 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "CNG price in Delhi increased by Rs 2 per kg to Rs 75.61 per kg, second hike in 6 days - Economic Times", "description": "The firm sees rates staying elevated in the near future due to high international prices of natural gas and the management was looking at cutting operational costs to soften the blow for consumers.", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/cng-price-in-delhi-increased-by-rs-2-per-kg-to-rs-75-61-per-kg-second-hike-in-6-days/articleshow/91699115.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91699121,width-1070,height-580,imgsize-23606,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-21T01:18:00Z", "content": "() has hiked CNG (compressed natural gas) prices in the Delhi to Rs 75.61 per kg. For Noida, Greater Noida and Ghaziabad, CNG price has been hiked to Rs 78.17 per kg, while in Gurugram, it will cost … [+1226 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saikat Das and Shailesh Kadam", "title": "Re loses to dollar, but wins against other heavyweights - Economic Times", "description": "The rupee has shed about 4.32% against the dollar this calendar year; by contrast, it has advanced up to 6.21% against the other major global currencies, Bloomberg data compiled by ETIG showed.", "url": "https://economictimes.indiatimes.com/markets/forex/re-loses-to-dollar-but-wins-against-other-heavyweights/articleshow/91698810.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91698898,width-1070,height-580,imgsize-25922,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-21T00:35:00Z", "content": "The rupee's recent slide vis-a-vis the US dollar masks its relative strength against a basket of top world currencies, including the pound, euro, yen and yuan, illustrating the evident disconnect bet… [+2841 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lucas Matney", "title": "Coinbase’s lost momentum - TechCrunch", "description": "Chain Reaction is TechCrunch's weekly crypto newsletter", "url": "https://techcrunch.com/2022/05/20/coinbases-lost-momentum/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/09/coinbase-disrupt-brian-armstrong-1.jpg?w=601", "publishedAt": "2022-05-20T23:45:52Z", "content": "Hey everyone, and welcome back to Chain Reaction.\r\nIn our Chain Reaction podcast this week, Anita and I chatted with Mercedes Bent of Lightspeed Venture Partners on backing blockchain startups and th… [+5574 chars]"}, {"source": {"id": null, "name": "The Daily Hodl"}, "author": "Daily Hodl Staff", "title": "After TerraUSD (UST) De-Pegging Scare, Tether (USDT) Releases Report Claiming It Has Fully Backed Reserves - The Daily Hodl", "description": "As the most recent crypto market crash is putting the spotlight on stablecoins, one of the leading dollar-pegged tokens says its valuation remains secure.", "url": "https://dailyhodl.com/2022/05/20/after-terrausd-ust-de-pegging-scare-tether-usdt-releases-report-claiming-it-has-fully-backed-reserves/", "urlToImage": "https://dailyhodl.com/wp-content/uploads/2022/05/scare-tether-fully.jpg", "publishedAt": "2022-05-20T18:45:57Z", "content": "As the most recent crypto market crash is putting the spotlight on stablecoins, one of the leading dollar-pegged tokens says its valuation remains secure.\r\nIn a new post, Tether Holdings Limited anno… [+2169 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Editorial Dept", "title": "Will Crude Hit $120 Again - OilPrice.com", "description": "A number of bullish factors could push oil prices higher in the next few weeks, but uncertainty surrounding an EU ban or tariff on Russian crude could keep prices down", "url": "https://oilprice.com/Energy/Energy-General/Will-Crude-Hit-120-Again.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-05-20_x7n3skaobv.jpg", "publishedAt": "2022-05-20T17:00:00Z", "content": "China added some downward pressure…\r\nThe global economy is in…\r\nSaudi Aramco, taking advantage of…\r\nBy Editorial Dept - May 20, 2022, 12:00 PM CDTU.S. West Texas Intermediate crude oil futures are in… [+6333 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Shivani Shinde", "title": "Hackers steal Rs 7.3 cr in 831 transactions over three months from Razorpay - Business Standard", "description": "Fraudsters were using the browser to tamper with authorisation data on some merchant sites that were using an older version of Razorpay's integration", "url": "https://www.business-standard.com/article/companies/hackers-steal-rs-7-3-cr-in-831-transactions-over-three-months-from-razorpay-122052001659_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2015-10/16/full/1445013929-9054.jpg", "publishedAt": "2022-05-20T15:51:00Z", "content": "Online payment gateway Razorpay said hackers stole Rs 7.3 crore worth of funds in 831 transactions over a period of three months.\r\nThe fraud came to light, during an audit the company carried on tran… [+3241 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saikat Das", "title": "India’s forex fell by $2.68 bn aided by drop in gold reserves for week ended May 13 - Economic Times", "description": "According to an article 'State of the Economy', published in the RBI's Bulletin for May, foreign exchange reserves at USD 596 billion as on May 6 were equivalent to about 10 months of imports projected for 2022-23.", "url": "https://economictimes.indiatimes.com/markets/forex/forex-reserves-down-by-usd-2-676-billion-to-usd-593-279-billion/articleshow/91693718.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91693742,width-1070,height-580,imgsize-57024,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-20T15:22:00Z", "content": "Indias forex reserves fell by 2.68 billion to around $593.2 billion for the week ended May 13 with a sizable contraction of gold reserves aiding the fall, show latest data from the Reserve Bank of In… [+637 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Renu Baliyan", "title": "2 Stocks To Buy For Gains Up To 83% - Goodreturns", "description": "CL Educate and Zydus Lifesciences Ltd have announced their share buyback. The two leading companies have also announced their Q4 results. Buyback is a scenario wherein a company decides to buy back its own shares from the existing shareholders and normally at…", "url": "https://www.goodreturns.in/personal-finance/investment/2-stocks-to-buy-for-gains-up-to-83-1249969.html", "urlToImage": "https://www.goodreturns.in/img/2021/10/stock-1633078633.jpg", "publishedAt": "2022-05-20T14:59:01Z", "content": "The Board of CL Educate has approved a proposal for the company to buyback its fully-paid up equity shares of face value of Rs 5/each from equity shareholders of the company (except promoters, promot… [+2490 chars]"}]}