{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Goodbye LML: 10 LML scooters & motorcycles you've forgotten - CarToq.com", "description": "LML (Lohia Machinery Ltd) was a popular two-wheeler manufacturer in India. The manufacturer finally shut its operations back in 2017 after bankers rejected a resolution plan for the company. The Kanpur-based manufacturer announced last year that they will be …", "url": "https://www.cartoq.com/goodbye-lml-10-lml-scooters-motorcycles-forgotten/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/lml-scooters-featured.jpg", "publishedAt": "2023-01-29T14:05:35Z", "content": "LML (Lohia Machinery Ltd) was a popular two-wheeler manufacturer in India. The manufacturer finally shut its operations back in 2017 after bankers rejected a resolution plan for the company. The Kanp… [+3739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Adani Confident Of New Issue Sailing Through, Stock Sell-Off Under Probe - NDTV", "description": "Richest Asian Gautam Adani's group on Sunday expressed confidence that the Rs 20,000 crore follow-on share sale of its flagship firm will sail through despite a massive hammering of the conglomerate's stocks.", "url": "https://www.ndtv.com/india-news/adani-confident-of-new-issue-sailing-through-stock-sell-off-under-probe-3733902", "urlToImage": "https://c.ndtvimg.com/2023-01/9u1oc074_gautam-adani-reuters_625x300_07_January_23.jpg", "publishedAt": "2023-01-29T13:22:53Z", "content": "Gautam Adani started as a trader and has been on a rapid diversification spree. (File)\r\nNew Delhi: Richest Asian Gautam Adani's group on Sunday expressed confidence that the Rs 20,000 crore follow-on… [+7267 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikhil Agarwal", "title": "ETMarkets Trade Talk: How this Lucknow MBA trader shifts seamlessly between futures & options - The Economic Times", "description": "I am a Nifty Bank option seller but whenever I find momentum in Nifty, I buy Nifty futures. The strategy there is to hold for 2 months.  Sometimes if the market is trending, you may not get anything by selling options. Then you have to sell in the money optio…", "url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-trade-talk-how-this-lucknow-mba-trader-shifts-seamlessly-between-futures-options/articleshow/97418509.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97418511,width-1070,height-580,imgsize-20640,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T11:44:00Z", "content": "Lucknows star trader Virendra Pandey, who made a killing in the stock market by starting with a meager capital of just Rs 30,000, isnt tied to any particular trading style or even segment. Pandey, wh… [+3541 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Roshni Agarwal", "title": "Ahead of Market: 10 things that will decide stock action on Monday - The Economic Times", "description": "After three weeks of good consolidation, Nifty index has given a major range breakdown. With good volumes, Nifty has broken down from the 18200- 17800 levels, indicating that bears are in control. Around 17550, Nifty took a minor support at its 200 EMA. To re…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-monday/articleshow/97418070.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97418091,width-1070,height-580,imgsize-47976,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T11:25:00Z", "content": "Ahead of the crucial Union Budget 2023 lined up next week, Indian equity indices tumbled sharply in Fridays trade, with Nifty dropping to 17,600 levels, down 1.6%. Pre-budget nervousness, rise in the… [+4718 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Editor", "title": "Home-made single-wheeled self-balancing KTM bike! (Video) - CarToq.com", "description": "Remember that guy who built the one-wheeled scooter? Well, he’s at it again! This time he’s made a self-balancing one-wheeled KTM motorcycle. He’s even made a video about it and shared the step-by-step process on YouTube through the Creative Science channel. …", "url": "https://www.cartoq.com/home-made-single-wheeled-self-balancing-ktm-bike-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/ktm-motor-unicycle-fb.jpg", "publishedAt": "2023-01-29T11:05:59Z", "content": "Remember that guy who built the one-wheeled scooter? Well, he’s at it again! This time he’s made a self-balancing one-wheeled KTM motorcycle. He’s even made a video about it and shared the step-by-st… [+2620 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Team GaadiWaadi", "title": "Tata Cars Waiting Period In January 2023 – Check Details - GaadiWaadi.com", "description": "The waiting period on Tata cars goes as high as 26 weeks on select models", "url": "https://gaadiwaadi.com/tata-cars-waiting-period-in-january-2023-check-details/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/01/tata-punch-39.jpg", "publishedAt": "2023-01-29T08:49:01Z", "content": "Tata Motors is currently one of the best selling car brands in the Indian market and offers an extensive portfolio for the buyers looking for good-looking, well-built, comfortable, and feature-rich c… [+2031 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "SEBI may probe short selling to hammer down Indian markets - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/sebi-may-probe-short-selling-to-hammer-down-indian-markets-3500117", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/89699ff8b0f2d7706e5ff7b9cea439e9_w_800_h_450.jpg", "publishedAt": "2023-01-29T08:17:37Z", "content": "New Delhi, Jan 29 (IANS) Markets regulator, SEBI is likely to probe short selling in the Indian stock markets in the last few days.\r\nSources said Indian markets have been under onslaught in the last … [+3172 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "Will bulls make a comeback post Budget after last week's carnage? Anand James decodes history - Economic Times", "description": "Fridays turn of events presents an opportunity in the near-term though. Firstly, we have slipped over 1400 points from the record peak and are at a 3 Standard Deviation (SD) boundary, which suggests that an end to downtrend is nearing. Secondly Nifty PCR (put…", "url": "https://economictimes.indiatimes.com/markets/expert-view/will-bulls-make-a-comeback-post-budget-after-last-weeks-carnage-anand-james-decodes-history/articleshow/97414590.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97415027,width-1070,height-580,imgsize-19098,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T08:17:00Z", "content": "We have slipped over 1,400 points from the record peak and are at 3 Standard Deviation (SD) boundary, which suggests that an end to downtrend is nearing, says Anand James, Chief Market Strategist at … [+4835 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Will Adani stocks escape bears this week? ₹20,000 cr FPO, Hindenburg case in focus | Mint - Mint", "description": "Adani's FPO alongside its actions against Hindenburg are some of the key factors that will influence its listed stocks on market bourses in the week ahead.", "url": "https://www.livemint.com/market/stock-market-news/will-adani-stocks-escape-bears-this-week-rs-20-000-cr-fpo-hindenburg-case-in-focus-11674976465881.html", "urlToImage": "https://images.livemint.com/img/2023/01/29/600x338/ADANI_1674898897615_1674977723793_1674977723793.JPG", "publishedAt": "2023-01-29T07:36:36Z", "content": "The overwrought selling in Adani stocks last week dragged the broader market. January 27th turned into a black Friday for the billionaire Gautam Adani-backed group's seven listed stocks, which were b… [+6730 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": "Kevin Helms", "title": "Institutional Investors Forecast 'Strong Year' for Bitcoin — 65% Expect BTC to Hit $100K, Survey Shows – Markets and Prices Bitcoin News - Bitcoin News", "description": "A new survey shows that institutional investors see \"a strong year ahead for bitcoin,\" with 65% expecting BTC to hit $100K.", "url": "https://news.bitcoin.com/institutional-investors-forecast-strong-year-for-bitcoin-65-expect-btc-to-hit-100k-survey-shows/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2023/01/nickel-survey-bitcoin.jpg", "publishedAt": "2023-01-29T07:35:17Z", "content": "A new survey shows that institutional investors expect “a strong year ahead for bitcoin” and are confident about the cryptocurrency’s long-term valuation. In addition, 65% of institutional investors … [+2936 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "etimes.in", "title": "From Anupam hearing a pitch in Disneyland to Peyush clicking selfies at the airport; Here's how life has changed for the Sharks after Shark Tank India - Indiatimes.com", "description": "Shark Tank India's first season surely brought a revolution in the country and even in the Sharks' lives as they not only became the face of the show but it encouraged many entrepreneurs to come and recognize their businesses and become serious about building…", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/from-anupam-hearing-a-pitch-in-disneyland-to-peyush-clicking-selfies-at-the-airport-heres-how-life-has-changed-for-the-sharks-after-shark-tank-india/photostory/97414805.cms", "urlToImage": "https://static.toiimg.com/photo/msid-97415022.cms", "publishedAt": "2023-01-29T07:30:00Z", "content": "Vineeta shared an inspiring story on how kids have got inspired by the show and they want to get serious about starting their own businesses once they grow up. She said, “When I go to the park with m… [+656 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Navdeep Singh", "title": "LTI Mindtree, Siemens among 4 stocks to trade ex-dividend on Monday - The Economic Times", "description": "While announcing its earnings for the third quarter of December 2022, LTIMindtree's board also approved an interim dividend of Rs 20 per share. Shares of LTIMindtree fell nearly 1% to Rs 4,397 apiece on the BSE in Friday's trade. LTI Mindtree is a large-cap I…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/lti-mindtree-siemens-among-4-stocks-to-trade-ex-dividend-on-monday/articleshow/97414327.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97414330,width-1070,height-580,imgsize-47468,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T07:28:36Z", "content": "Shares of LTI Mindtree, , 360 One Wam and will trade ex-dividend on Monday.While announcing its earnings for the third quarter of December 2022, LTIMindtree's board also approved an interim dividend … [+1569 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "5 market infrastructure institution stocks with “strong buy” and “buy” recos with up to 38% upside potenti - Economic Times", "description": "Every time a trader executes a trade, invests in a company or buys and sells gold futures, there are some companies which will be a part of that trade. Some of these companies form part of what is called “market infrastructure institutions” (MII). These compa…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/5-market-infrastructure-institution-stocks-with-strong-buy-and-buy-recos-with-up-to-38-upside-potential/articleshow/97413831.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97413890,width-1070,height-580/photo.jpg", "publishedAt": "2023-01-29T06:55:00Z", "content": "SynopsisEvery time a trader executes a trade, invests in a company or buys and sells gold futures, there are some companies which will be a part of that trade. Some of these companies form part of wh… [+356 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Team GaadiWaadi", "title": "Maruti Suzuki To Soon Launch Two 7-Seater Cars In India - GaadiWaadi.com", "description": "Maruti is said to be working on two new 7-seater cars including a Grand Vitara-based version to take on the rivals like the XUV700", "url": "https://gaadiwaadi.com/maruti-suzuki-to-soon-launch-two-7-seater-cars-in-india/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/12/toyota-innova-hycross-16.jpg", "publishedAt": "2023-01-29T06:43:32Z", "content": "Maruti Suzuki will soon be expanding its line-up in the country with the launch of the new utility vehicles for the buyers looking for a practical and reliable family mover. From what we know so far,… [+1786 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Utkarsh Deshmukh", "title": "This Audi R8 supercar is available for sale – Cheaper than a Toyota Fortuner Legender - CarToq.com", "description": "The German automotive manufacturer of luxury vehicles Audi AG has always been regarded as one of the most important luxury carmakers in the world and in India as well it holds a place of high esteem. The carmaker over the years has produced some amazing cars …", "url": "https://www.cartoq.com/this-audi-r8-supercar-is-available-for-sale-cheaper-than-a-toyota-fortuner-legender/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/audi-r8-supercar-used-car.jpg", "publishedAt": "2023-01-29T06:22:25Z", "content": "The German automotive manufacturer of luxury vehicles Audi AG has always been regarded as one of the most important luxury carmakers in the world and in India as well it holds a place of high esteem.… [+2556 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Navdeep Singh", "title": "Q3 results this week: L&T, Bajaj Finserv, Sun Pharma, Tech Mahindra, Ashok Leyland and others - Economic Times", "description": "Results that will be out on January 30 include Larsen & Toubro, Bajaj Finserv, Tech Mahindra, Bharat Petroleum Corporation, Bajaj Holdings & Investment, GAIL, SRF, Punjab National Bank, REC, Laurus Labs, IIFL Finance, Trident, Exide Industries, Nippon Life In…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/q3-results-this-week-lt-bajaj-finserv-sun-pharma-tech-mahindra-ashok-leyland-and-others/articleshow/97413124.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97413242,width-1070,height-580,imgsize-55992,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T06:13:00Z", "content": "Various widely tracked companies like L&amp;T, Bajaj Finserv, Sun Pharma, Coal India, Tech Mahindra, Britannia, Ashok Leyland and Jubilant FoodWorks would be releasing their December quarter report c… [+1448 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "We have been in bear market for some time now; it’s going to be tough: Siddhartha Bhaiya - Economic Times", "description": "“The bear market has been underway for some time and I have said that earlier. It is going to be very selective. The auto index was up on Friday. I think a lot of the previous momentum names will continue to go down and we will have a new rung of leaders comi…", "url": "https://economictimes.indiatimes.com/markets/expert-view/we-have-been-in-bear-market-for-some-time-now-its-going-to-be-tough-siddhartha-bhaiya/articleshow/97405234.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97405254,width-1070,height-580,imgsize-41470,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T05:30:00Z", "content": "We are fully invested but we are deep value investors. So we are not worried. But am I worried about the overall market? Yes, I am very worried. This is the first time I am worried about the market a… [+2225 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Budget 2023: Finance Ministry to stick to privatisation of already announced CPSEs next fiscal - Moneycontrol", "description": "The disinvestment target outlined in the Budget for the next fiscal is likely to be a scaled-down and realistic one, as the budgeted PSU sell-off target is going to be missed for the fourth year in a row this fiscal.", "url": "https://www.moneycontrol.com/news/business/budget/budget-2023-finance-ministry-to-stick-to-privatisation-of-already-announced-cpses-next-fiscal-9955761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/finance-ministry-north-block-770x433.jpg", "publishedAt": "2023-01-29T05:18:23Z", "content": "The Finance Ministry will move ahead with the already-announced and planned privatisation of state-owned companies in the next fiscal, and the chances of the new addition to that list of CPSEs in the… [+3133 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy - Moneycontrol", "description": "The coming week is crucial for the market as there are lot of events lined up, including the Union Budget, the US Federal Reserve commentary, monthly auto sales numbers, and corporate earnings, all of which will give a direction to the market", "url": "https://www.moneycontrol.com/news/business/budget/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-15-9953911.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/Markets7-770x433.jpg", "publishedAt": "2023-01-29T05:05:20Z", "content": "The carnage on Friday has decisively broken a month-long consolidation and dragged the market to a four-month closing low on the first day of the new monthly series, January 27. This resulted in equi… [+12629 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "It’s PEG ratio, not P/E, that matters. 5 stocks that could be possible wealth creators - The Economic Times", "description": "As the market corrects, some stocks may start to look cheap judged on the basis of price earning (PE) ratio. But they may not be as cheap as they might appear to be. This may lead to wrong investment decisions given the huge difference in what is value and wh…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/its-peg-ratio-not-p/e-that-matters-5-stocks-that-could-be-possible-wealth-creators/articleshow/97405818.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97405835,width-1070,height-580/photo.jpg", "publishedAt": "2023-01-29T05:00:00Z", "content": "Offer Exclusively For You\r\nGet Flat 30% Off\r\nON ET PRIME MEMBERSHIP\r\nAvail Offer\r\nOffer Exclusively For You\r\nGet 1 Year Free\r\nWith 1 and 2-Year ET prime membership\r\nAvail Offer\r\nOffer Exclusively For… [+331 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Oil & Gas Q3 previews: GAIL, BPCL's PAT, revenue likely to decline. Key factors to watch out for | Mint - Mint", "description": "The Q3 is likely to be operationally better for BPCL but sequentially will be under pressure owing to diesel marketing loss. Meanwhile, GAIL's profitability are likely to drop on lower LPG realization and gas trading.", "url": "https://www.livemint.com/companies/news/oil-gas-q3-previews-gail-bpcl-s-pat-revenue-likely-to-decline-key-factors-to-watch-out-for-11674966312733.html", "urlToImage": "https://images.livemint.com/img/2023/01/29/600x338/5cfbc526-38d5-11ed-aa0a-736e94ef98be_1663672527171_1674966884815_1674966884815.jpg", "publishedAt": "2023-01-29T04:39:43Z", "content": "Among the major oil and gas companies, BPCL and GAIL (India) are the next to announce their December 2022 quarterly earnings on Monday. The Q3 is likely to be operationally better for BPCL but sequen… [+4295 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "What to buy as Sensex dives below 59,500? Dilip Bhat answers - Economic Times", "description": "Pharma is certainly one of the spaces that one should look at because that is one of the space which has not done anything at all. They have only gone down. I think one should definitely look into some of the frontline pharma stocks like Sun Pharma, Lupin, Ci…", "url": "https://economictimes.indiatimes.com/markets/expert-view/what-to-buy-as-sensex-dives-below-59500-dilip-bhat-answers/articleshow/97403900.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97403914,width-1070,height-580,imgsize-25904,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T03:41:00Z", "content": "My sense is that at these times of panic, it is very difficult to call a bottom but some of the better known stocks like , which has fallen quite a bit, one can buy on a slightly longer term basis ir… [+2763 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Blood on the Street? Pankaj Murarka is looking to mop up midcaps in 4 sectors - Economic Times", "description": "“Friday was a good day and over the next few days, any investor with a time horizon of one year and above can go and buy into these stocks because these companies are doing well and will continue to do well. The banks clearly stand out in that sense because t…", "url": "https://economictimes.indiatimes.com/markets/expert-view/blood-on-the-street-pankaj-murarka-is-looking-to-mop-up-midcaps-in-4-sectors/articleshow/97403795.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97403794,width-1070,height-580,imgsize-26238,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-29T03:30:00Z", "content": "For someone like us who is a permabull on India, these are great times to go out and buy good businesses be it largecaps, midcaps, smallcaps and own them for a two to three-year time horizon which is… [+5291 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Tech Mahindra Q3 preview: EBIT margins likely to improve; slower growth seen in BFSI, hi-tech | Mint - Mint", "description": "Tech Mahindra's attrition rate and net addition of employee counts will be keenly watched. Its peers TCS and Wipro have reduced their workforce in Q3FY23, while Infosys and HCL Tech made lower additions on a quarter-on-quarter basis.", "url": "https://www.livemint.com/companies/news/tech-mahindra-q3-preview-ebit-margins-likely-to-improve-slower-growth-seen-in-bfsi-hi-tech-11674961934285.html", "urlToImage": "https://images.livemint.com/img/2023/01/29/600x338/369170800_0-16_1618420008632_1674962105709_1674962105709.jpg", "publishedAt": "2023-01-29T03:17:10Z", "content": "Tech Mahindra is set to announce its financial results for the third quarter of FY23 on Monday. Accordingly, the IT major's stock will be in focus on exchanges. The Q3 of FY23 is likely to be a mixed… [+3615 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Sneha Saha", "title": "Google CEO Sundar Pichai to take massive pay cut after firing 12000 employees - India Today", "description": "It appears that Google CEO Sundar Pichai will take a large chunk of his salary cut amid layoffs and tough macro economic conditions.", "url": "https://www.indiatoday.in/technology/news/story/sundar-pichai-to-take-massive-pay-cut-heres-what-google-ceo-said-after-firing-12000-employees-2327670-2023-01-29", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/google_ceo_0-sixteen_nine.jpg?VersionId=TpArdEUEFnKJB7aLh4RDlpAzeeywT1Gi", "publishedAt": "2023-01-29T02:47:26Z", "content": "By Sneha Saha: It appears that CEO Sundar Pichai will take a large chunk of his salary cut amid layoffs and tough macro-economic conditions. In a recent town hall meeting with Google employees, Picha… [+2402 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Team GaadiWaadi", "title": "Honda Activa Electric Scooter Launch Date Confirmed – Check Details - GaadiWaadi.com", "description": "The Honda Activa electric scooter will boast strong performance and impressive long-term reliability that will help it give strong competition to rivals", "url": "https://gaadiwaadi.com/honda-activa-electric-scooter-launch-date-confirmed-check-details/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/swappable-battery-Honda-Benly.jpg", "publishedAt": "2023-01-29T02:42:43Z", "content": "It’s a no secret to anyone that Honda is working on a new electric scooter that will soon be launched in the country. The Japanese brand recently confirmed that it will be launching the Honda Activa … [+1726 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Utkarsh Deshmukh", "title": "Mahindra Scorpio-N modified to 'Mafia Spec' looks hot [Video] - CarToq.com", "description": "The country’s largest utility carmaker Mahindra’s Scorpio-N quickly took over the hearts of the Scorpio lovers in India. And like the previous Scorpio, the owners of the new Scorpio-N’s have started modifying this recently launched SUV with some great mods. O…", "url": "https://www.cartoq.com/mahindra-scorpio-n-modified-to-mafia-spec-looks-hot-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/mahindra-scorpio-n-Mafia-Edition.jpg", "publishedAt": "2023-01-29T02:17:49Z", "content": "The country’s largest utility carmaker Mahindra’s Scorpio-N quickly took over the hearts of the Scorpio lovers in India. And like the previous Scorpio, the owners of the new Scorpio-N’s have started … [+3062 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "BSNL Prepaid Plans for a Secondary SIM Usage Detailed - TelecomTalk", "description": "Here's a list of the best prepaid recharge options from BSNL if you want to recharge your Secondary SIM for minimalistic usage.", "url": "https://telecomtalk.info/bsnl-prepaid-plans-for-secondary-sim-usage/660924/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2023/01/bsnl-prepaid-plans-for-secondary-sim-usage.jpg", "publishedAt": "2023-01-29T02:15:22Z", "content": "Bharat Sanchar Nigam Limited (BSNL), a state-owned telecommunications company in India, offers a wide range of prepaid mobile plans to its customers. The telco provides PAN India services except in D… [+5928 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Lijee Philip", "title": "Small SUVs are winning big in India as hatches get sidelaned - The Economic Times", "description": "The SUV segment has been growing in volume and consequently market share, with several new models being introduced, whereas passenger car model launches have come down drastically, experts said.", "url": "https://economictimes.indiatimes.com/industry/auto/cars-uvs/small-suvs-are-winning-big-in-india-as-hatches-get-sidelaned/articleshow/97409247.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97409270,width-1070,height-580,imgsize-1965841,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-29T01:13:00Z", "content": "Mumbai: For SUVs, small is big. The seemingly insatiable demand for sport utility vehicles is set to continue unabated - this year will see at least 18 launches, a majority of them in the sub-4 metre… [+2642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukalp Sharma", "title": "Surge in oil imports from Russia, sharp dip from Nigeria, US - The Indian Express", "description": "Overall imports up 6.8% over last yr; steady supply from Iraq, Saudi, UAE", "url": "https://indianexpress.com/article/india/surge-in-oil-imports-from-russia-sharp-dip-from-nigeria-us-8410107/", "urlToImage": "https://images.indianexpress.com/2023/01/crude-oil.jpg", "publishedAt": "2023-01-28T22:34:11Z", "content": "With Indian refiners snapping up discounted Russian crude supplies sanctioned by Western buyers in the aftermath of Moscows February invasion of Ukraine, some of the inflows are at the expense of sup… [+4005 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prachi Verma", "title": "Uncertainty, layoff fears raise tech pros' stress, anxiety levels - The Economic Times", "description": "Fatigue due to overworking, anxiety of getting laid off, worry about performance, pressure to perform, and overall career concerns in a tepid job market are a few of the stress triggers prevalent now across India Inc employees that rose significantly over the…", "url": "https://economictimes.indiatimes.com/jobs/uncertainty-layoff-fears-raise-tech-pros-stress-anxiety-levels/articleshow/97405290.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97411360,width-1070,height-580,imgsize-27094,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-28T17:28:00Z", "content": "At a time when companies like Microsoft, Google, Amazon and IBM are announcing job cuts, work expectations from the employees, especially those in IT and startup domains, are rising and so are the wo… [+3257 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Lijee Philip and Shantanu Nandan Sharma", "title": "Some more PLIs: FY24 could be inflection point for surge in India’s manufacturing capex - Economic Times", "description": "​​With the PLI scheme in place, the annual investment in Indias manufacturing sector may remain high for a few years from FY2023-24. But questions remain on whether the global economic uncertainty will delay the execution of projects and mess up the governmen…", "url": "https://economictimes.indiatimes.com/news/economy/policy/some-more-plis-fy24-could-be-inflection-point-for-surge-in-indias-manufacturing-capex/articleshow/97404866.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97405043,width-1070,height-580,imgsize-32634,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-28T17:22:00Z", "content": "Ahead of next weeks Union Budget, speculation over an expansion of the governments Production-Linked Incentive (PLI) scheme is running rife. Finance Minister Nirmala Sitharaman may either allocate mo… [+8166 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Here's how Suzuki plans to power cars using cow dung - Times Of India", "description": "Not just EVs, car companies are also thinking of other green solutions to power the future. Suzuki's unique initiative to tackle this challenge is the biogas...", "url": "https://www.youtube.com/watch?v=PqKqO2mBzf8", "urlToImage": "https://i.ytimg.com/vi/PqKqO2mBzf8/maxresdefault.jpg", "publishedAt": "2023-01-28T16:30:04Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tamanna Inamdar", "title": "India should catch up with global peers once Union Budget is over: Safir Anand - The Economic Times", "description": "If you have a global portfolio and your portfolio starts going up, then your allocation to India as a percentage will fall and there is no doubt in the world that India is going to grow, the debates are not on growth, it is on issues that seem to be more temp…", "url": "https://economictimes.indiatimes.com/markets/expert-view/india-should-catch-up-with-global-peers-once-union-budget-is-over-safir-anand/articleshow/97400821.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97400830,width-1070,height-580,imgsize-988797,overlay-etmarkets/photo.jpg", "publishedAt": "2023-01-28T12:28:00Z", "content": "\"The issues right now seem to be more India related but hopefully looking at the global market, I do believe or sense that India will catch up at some point in time with the others, particularly once… [+8853 chars]"}, {"source": {"id": null, "name": "Officechai.com"}, "author": null, "title": "Zoho Registers Profit Of Rs. 2,749 Crore In FY22, Highest Ever For An Indian Internet Firm - OfficeChai", "description": "Even as India's VC-funded loss-making startups are having to lay off employees to survive the funding winter, the country's bootstrapped champions seem to be breaking their own records at making profits.    Chennai-based SaaS company Zoho, which", "url": "https://officechai.com/startups/zoho-registers-profit-of-rs-2749-crore-in-fy22-highest-ever-for-an-indian-internet-firm/", "urlToImage": "https://officechai.com/wp-content/uploads/2022/02/pjimage-2022-02-17T204155.658.jpg", "publishedAt": "2023-01-28T11:31:10Z", "content": "Even as India’s VC-funded loss-making startups are having to lay off employees to survive the funding winter, the country’s bootstrapped champions seem to be breaking their own records at making prof… [+2451 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Navratna PSU Bharat Electronics declares dividend, revenue surges 11% in Q3 | Mint - Mint", "description": "Bharat Electronics Limited (BEL) is a Navratna PSU under the Ministry of Defence, Government of India and the company manufactures electronic products and systems for the defense sector of the country.", "url": "https://www.livemint.com/market/stock-market-news/navratna-psu-bharat-electronics-declares-dividend-revenue-surges-11-in-q3-11674904697863.html", "urlToImage": "https://images.livemint.com/img/2023/01/28/600x338/GLOBAL-MARKETS-1_1649923615403_1674904734615_1674904734615.JPG", "publishedAt": "2023-01-28T11:21:05Z", "content": "Bharat Electronics Limited (BEL) is a Navratna PSU under the Ministry of Defence, Government of India and the company manufactures electronic products and systems for the defense sector of the countr… [+2415 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "BharatPe filings reveal salaries of senior execs. Ashneer Grover earned… - Hindustan Times", "description": "The fintech firm's co-founder and former MD, and his wife, left the company last year.", "url": "https://www.hindustantimes.com/business/bharatpe-reveals-salaries-of-senior-executives-here-s-how-much-ashneer-grover-earned-in-fy22-101674901507717.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/28/1600x900/Ashneer_Grover_1645449990248_1674901623504_1674901623504.jpg", "publishedAt": "2023-01-28T11:09:21Z", "content": "BharatPe co-founder and former MD Ashneer Grover, who resigned in March last year, drew a salary of 1.69 crore in financial year (FY) 2022, while his wife, Madhuri, took home 63 lakh as her pay for t… [+1182 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "NTPC's consolidated PAT rises over 43% sequentially to ₹4,777 cr in Q3, declares dividend | Mint - Mint", "description": "The PAT has climbed by 6.18% from  ₹4498.58 crore in Q3FY22, but posted a huge growth of 43.07% from the profit of  ₹3338.45 crore witnessed in Q2 of FY23.", "url": "https://www.livemint.com/companies/company-results/ntpc-s-consolidated-pat-rises-over-43-sequentially-to-rs-4-777-cr-in-q3-declares-dividend-11674901132817.html", "urlToImage": "https://images.livemint.com/img/2023/01/28/600x338/ntpc_1674901208880_1674901208880.jpg", "publishedAt": "2023-01-28T10:21:21Z", "content": "India's largest energy conglomerate, NTPC garnered a consolidated net profit of 4776.61 crore attributable to owners in the third quarter of FY23. The PAT has climbed by 6.18% from 4498.58 crore in Q… [+2505 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sanchari Ghosh", "title": "‘Laid off L-1 visa holders worse off than H1B’: 4 expert tips on what they should do to stay in the US | Mint - Mint", "description": "Nearly 200,000 IT workers have been laid off since November last year, many of them are L-1 and H1B visa holders", "url": "https://www.livemint.com/news/world/laid-off-l-1-visa-holders-worse-off-than-h1b-4-expert-tips-on-what-they-should-do-to-stay-in-the-us-11674896292950.html", "urlToImage": "https://images.livemint.com/img/2023/01/28/600x338/visa_1674898875410_1674898875673_1674898875673.jpg", "publishedAt": "2023-01-28T09:43:06Z", "content": "As thousands of laid-off work visa holders in the US are currently grappling to deal with the current situation, the experts are of the opinion that L-1 visa holders who have been laid off are much w… [+2058 chars]"}, {"source": {"id": null, "name": "Dsij.in"}, "author": "Karan Dsij", "title": "Penny stock under Rs 5 hits back-to-back 33 upper circuits; rallies 400 per cent! - Dalal Street Investment Journal", "description": "The stock embarked on this journey on December 12, 2022, and thereafter, there is no looking back as it has gone from strength to strength and within no time from Rs 0.52 it touched the level of...", "url": "https://www.dsij.in/dsijarticledetail/penny-stock-under-rs-5-hits-back-to-back-33-upper-circuits-rallies-400-per-cent-28504-1", "urlToImage": "https://www.dsij.in/Portals/0/EasyDNNnews/28504/image_2.jpg", "publishedAt": "2023-01-28T09:30:41Z", "content": "Penny stock under Rs 5 hits back-to-back 33 upper circuits; rallies 400 per cent!\r\n“There are decades where nothing happens, and there are weeks where decades happen”- Vladimir Ilyich Lenin. \r\nThe st… [+1039 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Emma Goldberg", "title": "Laid off in your living room: The chaos of remote job cuts - Indiatimes.com", "description": "International Business News: Kerensa Cadenas opened Slack on Friday morning to an expletive-laden message from a colleague that said essentially: “I got let go.", "url": "https://timesofindia.indiatimes.com/business/international-business/laid-off-in-your-living-room-the-chaos-of-remote-job-cuts/articleshow/97396969.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97396988,width-1070,height-580,imgsize-20484,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-28T09:23:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Harshith KN", "title": "2023 BMW X1 launched in India at Rs 45.95 lakh - Indiatimes.com", "description": "Cars News: The bookings for the SUV will start today. Customers interested can book the car by visiting the company’s official website or by visiting their neare", "url": "https://timesofindia.indiatimes.com/auto/cars/2023-bmw-x1-launched-in-india-at-rs-45-95-lakh/articleshow/97395824.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97395874,width-1070,height-580,imgsize-69668,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-28T08:30:00Z", "content": "Porsche 718 GT4 RS walkaround: 493 hp track-focused car comes to India | TOI Auto"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Another Ola S1 Pro owner shares pictures on how his scooter’s front fork broke at 35 Kmph - CarToq.com", "description": "Recently, we came across an incident where the front suspension of an Ola S1 Pro electric scooter. The front suspension broke while riding at the speed of 35 kmph. The lad who was riding the scooter was admitted to ICU due to injuries. Ola did come up with an…", "url": "https://www.cartoq.com/another-ola-s1-pro-owner-shares-pictures-on-how-his-scooters-front-fork-broke-at-35-kmph/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/ola-s1-pro-suspension-breakage-featured.jpg", "publishedAt": "2023-01-28T07:07:30Z", "content": "Recently, we came across an incident where the front suspension of an Ola S1 Pro electric scooter. The front suspension broke while riding at the speed of 35 kmph. The lad who was riding the scooter … [+3234 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sahil Kukreja", "title": "Upcoming Maruti Suzuki cars in India this year: Jimny 5-door to Brezza CNG - Indiatimes.com", "description": "Cars News: Maruti Suzuki is India's largest four-wheeler manufacturer as far as sales numbers are concerned, and in a bid to further increase its dominance in th", "url": "https://timesofindia.indiatimes.com/auto/cars/upcoming-maruti-suzuki-cars-in-india-this-year-jimny-5-door-to-brezza-cng/articleshow/97393057.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97393516,width-1070,height-580,imgsize-1139406,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-28T07:02:00Z", "content": "CNG technology not suitable for large SUVs but will grow at a healthy rate | TOI Auto"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Aditya Nadkarni", "title": "Maruti Alto K10 Xtra Edition debuts; launch in India and price reveal likely soon - CarWale", "description": "Maruti Alto K10 Xtra Edition debuts; launch in India and price reveal likely soon", "url": "https://www.carwale.com/news/maruti-alto-k10-xtra-edition-debuts-launch-in-india-and-price-reveal-likely-soon/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/140749/maruti-suzuki-alto-k10-left-front-three-quarter1.jpeg?isig=0&art=1&q=75", "publishedAt": "2023-01-28T05:23:09Z", "content": "- The Alto K10 Xtra Edition features cosmetic updates inside out\r\n- Powered by the same 66bhp, 1.0-litre petrol engine\r\nMaruti Suzuki has unveiled the Alto K10 Xtra Edition ahead of its launch and pr… [+1040 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Multibagger stock to consider bonus shares, stock split. Jumps 1000% in one year | Mint - Mint", "description": "Multibagger stock: If an investor had invested  ₹1 lakh in this stock six months ago, its  ₹1 lakh would have turned to around  ₹5 lakh today", "url": "https://www.livemint.com/market/stock-market-news/multibagger-stock-to-consider-bonus-shares-stock-split-jumps-1000-in-one-year-11674882002475.html", "urlToImage": "https://images.livemint.com/img/2023/01/28/600x338/Multibagger_stocks_1674882119908_1674882120044_1674882120044.PNG", "publishedAt": "2023-01-28T05:08:04Z", "content": "Bonus shares, stock split: Captain Pipes shares are one of the multibagger stocks that Indian stock market has delivered in last one year. The small-cap stock has risen to the tune of 1,000 per cent … [+2449 chars]"}, {"source": {"id": null, "name": "Gulf News"}, "author": "Reuters", "title": "Tata's Air India to seal half of jumbo plane order - Gulf News", "description": "Airline is set to place an order for 190 Boeing 737 MAX, 20 Boeing 787s & 10 Boeing 77X", "url": "https://gulfnews.com/business/aviation/tatas-air-india-to-seal-half-of-jumbo-plane-order-1.1674877121072", "urlToImage": "https://imagevars.gulfnews.com/2021/10/29/Air-India_17ccc89b57a_medium.jpg", "publishedAt": "2023-01-28T03:30:39Z", "content": "New Delhi: Air India will soon seal half of an order for some 495 jets with Boeing and engine suppliers General Electric and CFM International, industry sources said, as its new owner seeks to revive… [+3261 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Intel's 'historic collapse' erases $8 billion from market value - Economic Times", "description": "The company predicted a surprise loss for the first quarter and its revenue forecast was $3 billion below estimates as it also struggled with slowing growth in the data center business.", "url": "https://economictimes.indiatimes.com/tech/technology/intels-historic-collapse-erases-8-billion-from-market-value/articleshow/97389324.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97389367,width-1070,height-580,imgsize-102730,overlay-ettech/photo.jpg", "publishedAt": "2023-01-28T02:48:00Z", "content": "Intel Corp saw about $8 billion wiped off its market value on Friday after the US chipmaker stumped Wall Street with dismal earnings projections, fanning fears around a slump in the personal computer… [+2053 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Shreyash", "title": "Car News That Mattered This Week (Jan 23-27): New Launches & Updates, Product Recalls, Fresh Spyshots And More - CarDekho", "description": "The Republic Day-inclusive week of January was jam-packed with multiple new launches and a couple of booking updates, while two carmakers announced a recall for their latest SUV offerings  In the last full week of January, we saw the return of Toyota’s most a…", "url": "https://www.cardekho.com/india-car-news/car-news-that-mattered-this-week-jan-2327-new-launches-updates-product-recalls-fresh-spyshots-and-more-30330.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/30329/1674873065684/Weeklywrap-up.jpg", "publishedAt": "2023-01-28T02:01:00Z", "content": "The Republic Day-inclusive week of January was jam-packed with multiple new launches and a couple of booking updates, while two carmakers announced a recall for their latest SUV offerings\r\nIn the las… [+3238 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Shahid Iqbal", "title": "Open, black markets align closely after dollar surge - DAWN.com", "description": "Some currency dealers say the late evening rate of the open market rate was Rs275, but trading was almost negligible.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2023/01/280733171f950e3.jpg?r=074315", "publishedAt": "2023-01-28T01:57:38Z", "content": "KARACHI: Days after the removal of an artificial upper cap on the rupee that sent the local currency into a nosedive, the dollars rate in the black market has come on a par with that in the open mark… [+2923 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Jio Lost 2 Million Active Users While Airtel Added: TRAI Data for Nov 2022 - TelecomTalk", "description": "The only apparent reason that comes to mind is a weaker quality service. But according to Opensignal, Jio's 4G networks are the best in India when it comes to availability and coverage. It is also worth noting that Jio is offering its 5G for no additional cos…", "url": "https://telecomtalk.info/jio-lost-2-million-active-users-while/660570/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2023/01/jio-lost-2-million-active-users-while.jpeg", "publishedAt": "2023-01-28T01:46:35Z", "content": "Numbers can often be deceptive. Reliance Jio, India's largest telecom operator, added around 1.42 million wireless subscribers in November 2022. The data has been pulled from the latest monthly perfo… [+2024 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Gold price retraces from record high. Right time to accumulate? | Mint - Mint", "description": "Gold rates have immediate hurdle placed at  ₹57,200 levels whereas it has immediate support placed at  ₹56,200 per 10 gm levels, believe commodity market experts", "url": "https://www.livemint.com/market/commodities/gold-price-retraces-from-record-high-right-time-to-accumulate-11674866988867.html", "urlToImage": "https://images.livemint.com/img/2023/01/28/600x338/Gold__rate_today_1674867348345_1674867348612_1674867348612.JPG", "publishedAt": "2023-01-28T01:02:03Z", "content": "Gold rate today: On account of weak US treasury weighing on dollar index and US Fed softening stand on interest rate hike, gold price on Multi Commodity Exchange (MCX) climbed to a new high of 57,150… [+4254 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "Venkat", "title": "Do You Know? Lamborghini Market Growing In India - Greatandhra", "description": "The company sold 92 vehicles in India in 2022 and expects to sell over 100 vehicles in the current calendar year, due to the rising number of ultra-high net-worth individuals in India.", "url": "https://www.greatandhra.com/movies/news/do-you-know-lamborghini-market-growing-in-india-126887", "urlToImage": "https://www.greatandhra.com/newphotos10/lambar11674867266.jpg", "publishedAt": "2023-01-28T00:54:26Z", "content": "Globally, Lamborghini's order book stands at over 18 months. The company sold 92 vehicles in India in 2022 and expects to sell over 100 vehicles in the current calendar year, due to the rising number… [+1356 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tarush Bhalla", "title": "Multiple fintechs impacted with RBI’s order against SBM India - The Economic Times", "description": "While Niyo has temporarily paused international transactions for its forex card in association with SBM India, Vested and IndMoney had to change user transaction flows to help load US brokerage accounts.", "url": "https://economictimes.indiatimes.com/tech/startups/multiple-fintechs-impacted-with-rbis-order-against-sbm-india/articleshow/97383099.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97383119,width-1070,height-580,imgsize-2411267,overlay-ettech/photo.jpg", "publishedAt": "2023-01-28T00:41:00Z", "content": "Several Indian fintechs continue to be impacted by the Reserve Bank of Indias order earlier this week asking State Bank of Mauritius (SBM) India to stop all transactions under the liberalised remitta… [+5657 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Will the Fed stop gold's run? Gold price sees longest weekly winning streak since the summer of 2020 - Kitco NEWS", "description": "", "url": "https://www.kitco.com/news/2023-01-27/Will-the-Fed-stop-gold-s-run-Gold-price-sees-longest-weekly-winning-streak-since-the-summer-of-2020.html", "urlToImage": "https://www.kitco.com/news/2023-01-27/images/shutterstock_2165855155-min.jpg", "publishedAt": "2023-01-27T19:56:00Z", "content": "(Kitco News) Gold is looking to close Friday with its sixth weekly gain — the longest winning streak since the summer of 2020 when gold hit new record highs above $2,000 an ounce. But the question is… [+3989 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Interest may remain high for long: Shaktikanta Das - Economic Times", "description": "This is probably the first signal from the central banker that global factors are getting less tight for the first time in nearly a year when inflation around the world forced central banks to tighten monetary conditions. While inflation still worries develop…", "url": "https://economictimes.indiatimes.com/news/economy/policy/interest-rates-may-not-remain-high-for-long-shaktikanta-das/articleshow/97384281.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97384280,width-1070,height-580,imgsize-61588,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-27T19:36:00Z", "content": "Interest rates may remain high for a long time even as central banks around the world are beginning to pivot toward lower interest rate increases or even a pause amid signs of peaking inflation, said… [+2827 chars]"}, {"source": {"id": null, "name": "Zigwheels.com"}, "author": null, "title": "This Italian Supersport Will Make Apache RR 310 Sweat - ZigWheels", "description": "The Aprilia RS 350 will make its debut early next year", "url": "https://www.zigwheels.com/news-features/spiedteasers/this-italian-supersport-will-make-apache-rr-310-sweat/48618/", "urlToImage": "https://media.zigcdn.com/media/content/2023/Jan/cover_63d38078b9e31.jpg", "publishedAt": "2023-01-27T07:47:26Z", "content": "Get latest updates on the automobile community\r\nA spy shot of a mysterious, heavily camouflaged supersport being tested in Maharashtra has surfaced on the Internet. Going by the styling, it is clear … [+1542 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Meet Nithin Kamath, ex-call centre worker with 8k salary whose Zerodha made Rs 2094 crore - DNA India", "description": "Who is Nithin Kamath, Zerodha founder? Kamath had started stocks trading at a tender age of 17.", "url": "https://www.dnaindia.com/business/report-meet-nithin-kamath-call-centre-worker-with-8k-salary-whose-zerodha-made-rs-2094-crore-why-doesn-t-he-hire-f-3019535", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/01/27/2568778-zerodha.jpg", "publishedAt": "2023-01-27T03:24:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Jan 27, 2023, 08:54 AM ISTZerodha is one of the biggest online brokerage companies in the country. The company was started by Nit… [+2844 chars]"}]}