{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ketan Thakkar and Nehal Chaliawala", "title": "Ola shuts down used cars and quick commerce businesses to focus on EVs, ride hailing - Economic Times", "description": "In an official response, the company spokesperson confirmed the development and said, Ola has reassessed its priorities and decided to shut down the quick commerce business. The Ola Cars infrastructure, technology and capabilities will now “be repurposed towa…", "url": "https://economictimes.indiatimes.com/industry/renewables/ola-to-shut-down-used-cars-business-food-delivery-service-to-focus-on-evs/articleshow/92443724.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92443740,width-1070,height-580,imgsize-24906,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-24T18:30:00Z", "content": "Shared mobility major Ola has shut its used car division Ola Cars within eight months of its commencement, as it sharpens its focus on its electric vehicle and mobility business.\r\nThe company has als… [+2407 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Abhishek Shingare", "title": "SR Industries Standalone March 2022 Net Sales at Rs 2.41 crore, down 43% Y-o-Y - Moneycontrol", "description": "", "url": "https://www.moneycontrol.com/news/business/earnings/sr-industries-standalone-march-2022-net-sales-at-rs-2-41-crore-down-43-y-o-y-8736671.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/04/shutterstock_310523045-462x435.jpg", "publishedAt": "2022-06-24T17:14:51Z", "content": "Reported Standalone quarterly numbers for SR Industries are:Net Sales at Rs 2.41 crore in March 2022 down 43% from Rs. 4.22 crore in March 2021.\r\nQuarterly Net Profit at Rs. 1.21 crore in March 2022 … [+386 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Pooja Malik", "title": "Zomato joins race for quick-commerce with Blinkit acquisition - YourStory", "description": "Zomato's looking to catch up with Swiggy and a rush of other younger startups in the quick-commerce space as it diversifies beyond its core food-delivery business with its latest purchase.", "url": "https://yourstory.com/2022/06/zomato-joins-race-for-quick-commerce-with-blinkit-acquisition/amp", "urlToImage": "https://images.yourstory.com/cs/2/6c7d986093a511ec98ee9fbd8fa414a8/WhatsAppImage2022-06-24at6-1656076816599.jpeg", "publishedAt": "2022-06-24T16:49:00Z", "content": "Logistics platform Zomato has acquired Blink Commerce in a deal valuing the quick-commerce platform at $626 million, as it ventures into a fiercely competitive sector where rival Swiggy is already bu… [+4213 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Sebi comes out with guidelines for 'Large Value Fund' for accredited investors - Economic Times", "description": "While filing the placement memorandum for LVF schemes with Sebi, a duly signed and stamped undertaking by CEO of the manager to the AIF (or person holding equivalent role or position depending on the legal structure of manager) and compliance officer of manag…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-comes-out-with-guidelines-for-large-value-fund-for-accredited-investors/articleshow/92441868.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92442043,width-1070,height-580,imgsize-32406,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-24T15:51:00Z", "content": "Capital markets regulator Sebi on Friday came out with new guidelines for \"Large Value Fund\" for accredited investors, pertaining to filing of such schemes and extension of their tenures beyond two y… [+2311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "RBI Penalises Indian Overseas Bank - NDTV Profit", "description": "RBI said on Friday it has imposed a monetary penalty of Rs 57.50 lakh on Indian Overseas Bank", "url": "https://www.ndtv.com/business/rbi-penalises-indian-overseas-bank-3097770", "urlToImage": "https://c.ndtvimg.com/2022-06/dchjset_rbi-fresh_625x300_23_June_22.jpg", "publishedAt": "2022-06-24T15:40:10Z", "content": "Indian Overseas Bank has been penalised by RBI\r\nMumbai (Maharashtra): Reserve Bank of India (RBI) said on Friday it has imposed a monetary penalty of Rs 57.50 lakh on Indian Overseas Bank for non-com… [+953 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rakesh Jhunjhunwala-Backed Akasa Airline Starts Operations July-End - NDTV", "description": "Akasa, India's newest airline, will conduct a proving flight with the country's Directorate General of Civil Aviation as early as next week as it looks to start commercial services by around the end of July, Chief Executive Officer Vinay Dube said.", "url": "https://www.ndtv.com/india-news/akasa-airlines-rakesh-jhunjhunwala-backed-akasa-airline-expects-test-flight-next-week-3097913", "urlToImage": "https://c.ndtvimg.com/2021-07/6aoii26_rakesh-jhunjhunwala_625x300_30_July_21.jpg", "publishedAt": "2022-06-24T15:36:39Z", "content": "Rakesh Jhunjunwala's Akasa Air: Akasa will likely receive its certificate within days of proving flight.\r\nAkasa, India's newest airline, will conduct a proving flight with the country's Directorate G… [+2577 chars]"}, {"source": {"id": null, "name": "Autocarindia.com"}, "author": "Zaran Mody", "title": "Kawasaki Ninja 400 BS6 launched at Rs 4.99 lakh - Autocar India", "description": "Team Green&amp;#8217;s little supersport returns to the Indian market as a BS6-compliant motorcycle, after a hiatus of over two years.", "url": "https://www.autocarindia.com/bike-news/kawasaki-ninja-400-bs6-launched-at-rs-499-lakh-424908", "urlToImage": "https://cdni.autocarindia.com/ExtraImages/20220624041848_Ninja1.jpg", "publishedAt": "2022-06-24T14:43:00Z", "content": "Team Greens little supersport returns to the Indian market as a BS6-compliant motorcycle, after a hiatus of over two years.Kawasaki has launched the Ninja 400 in India at Rs. 4.99 lakh, marking the r… [+1796 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Run-up in auto stocks continues for yet another session, Morgan Stanley bullish on these five - Moneycontrol", "description": "The Nifty Auto index has gained 20 percent since its March lows, turning out to be the biggest gainer among all sectors, pricing in expected benefits of falling commodity prices, especially steel and aluminium, the key material for making vehicles, resulting …", "url": "https://www.moneycontrol.com/news/business/markets/run-up-in-auto-stocks-continues-for-yet-another-session-morgan-stanley-bullish-on-these-five-8733261.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/auto-manufacturing-770x433.jpg", "publishedAt": "2022-06-24T13:05:35Z", "content": "Auto stocks extended gains for yet another session on June 24, with the Nifty Auto index rising 2 percent as most shares witnessed a long build-up given the stability in metal prices that had raised … [+2980 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "RBI extends deadline for card tokenisation till 30 Sept | Mint - Mint", "description": "Currently, many entities, including merchants, involved in an online card transaction chain store card data like card number, expiry date, etc. Card-on-File (CoF) citing cardholder convenience and comfort for undertaking transactions in future.", "url": "https://www.livemint.com/news/india/rbi-extends-deadline-for-card-tokenisation-till-30-sept-11656075364163.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/debit-card_1656075441595.jpg", "publishedAt": "2022-06-24T12:58:36Z", "content": "The Reserve Bank of India (RBI) on Friday extended the timeline for tokenisation of debit and credit cards by another three months till September 30, 2022. The decision was made in consultation with … [+3764 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Pratik Rakshit", "title": "2022 Hyundai Venue Facelift Review: Korean Automaker's Subcompact SUV Grows Fashionable - carandbike", "description": "2022 Hyundai Venue Facelift Review: Korean Subcompact SUV Grows Fashionable", "url": "https://www.carandbike.com/reviews/2022-hyundai-venue-facelift-review-koreans-tiny-suv-grows-fashionable-3089643", "urlToImage": null, "publishedAt": "2022-06-24T12:38:38Z", "content": "The Hyundai Venue has been one of the most popular compact SUVs in the sub-4 metre space and for good reasons. Ever since its debut in 2019, the Korean marque's tiniest SUV has been a favourite among… [+11438 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "BMW M340i 50 Jahre M Edition launched in India - Team-BHP", "description": "BMW has launched the M340 50 Jahre M Edition at a price of Rs. 68.90 lakh (ex-showroom). The M340i 50 Jahre Edition celebrates 50 years of BMW’s M Performance division. It will be followed by nine more 50 Jahre Editions based on cars like the 5 Series, 6 Seri…", "url": "https://www.team-bhp.com/news/bmw-m340i-50-jahre-m-edition-launched-india", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20220624031556_BMW_M340i_ Jahre.jpg", "publishedAt": "2022-06-24T12:34:33Z", "content": "BMW has launched the M340 50 Jahre M Edition at a price of Rs. 68.90 lakh (ex-showroom).\r\nThe M340i 50 Jahre Edition celebrates 50 years of BMWs M Performance division. It will be followed by nine mo… [+761 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mahindra XUV700 wins Global NCAP’s Safer Choice award - CarToq.com", "description": "The Mahindra XUV700 has already got several accolades to its name, and it has got one more – this time from Global NCAP. The new blockbuster SUV from Mahindra has bagged the ‘Safer Choice’ award from Global NCAP for its excellent performance in the crash test…", "url": "https://www.cartoq.com/mahindra-xuv700-wins-global-ncaps-safer-choice-award/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/11/XUV700-feature-reduction-featured.jpg", "publishedAt": "2022-06-24T12:05:37Z", "content": "The Mahindra XUV700 has already got several accolades to its name, and it has got one more this time from Global NCAP. The new blockbuster SUV from Mahindra has bagged the Safer Choice award from Glo… [+2530 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Upcoming Toyota UC Hyryder Hybrid SUV Teased, India Debut on 1st July - GaadiWaadi.com", "description": "Toyota Urban Cruiser Hyryder will debut on July 1, with its launch following later, and it will be the first mass-market hybrid SUV in India", "url": "https://gaadiwaadi.com/upcoming-toyota-uc-hyryder-hybrid-suv-teased-india-debut-on-1st-july/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/06/2022-toyota-hyryder-hybrid-india-1.jpg", "publishedAt": "2022-06-24T12:00:12Z", "content": "Toyota Kirloskar Motor is all set to debut its new midsize SUV in India on July 1. The manufacturer has released the first teaser video for this upcoming SUV, giving us brief glimpses of the sharp-lo… [+1744 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Closing Bell: Nifty ends around 15,700, Sensex gains over 462 pts; autos shine - Moneycontrol", "description": "Among sectors, auto, oil &amp; gas, power, bank, metal and FMCG indices up 1 percent each, while selling was seen in the IT names.", "url": "https://www.moneycontrol.com/news/business/markets/share-market-live-updates-stock-market-today-june-24-latest-news-bse-nse-sensex-nifty-covid-coronavirus-hero-motocorp-jammu-kashmir-bank-thermax-cigniti-technologies-dcm-shriram-ongc-century-plyboards-8730911.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/marketup_sensexup-Niftyup-1-770x433.jpg", "publishedAt": "2022-06-24T10:42:22Z", "content": "June 24, 2022 / 03:34 PM IST\r\nMarket Close: Benchmark indices ended higher for the second consecutive day on June 24 with Nifty around 15700.\r\nAt close, the Sensex was up 462.26 points or 0.88% at 52… [+519 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Oil up more than $1 but set for second weekly drop on recession fears By Reuters - Investing.com", "description": "Oil rises over 2%, but still set for weekly drop on recession fears", "url": "https://www.investing.com/news/commodities-news/oil-prices-rise-on-tight-supply-inventory-uncertainty-2840443", "urlToImage": "https://i-invdn-com.investing.com/news/LYNXMPEDAD000_L.jpg", "publishedAt": "2022-06-24T10:15:00Z", "content": "By Laura Sanicola\r\n(Reuters) -Oil rose by more than 2% on Friday supported by tight supply, although crude was heading for a second weekly fall on concern that rising interest rates could push the wo… [+1877 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Second Okinawa Electric Vehicle dealership catches fire: This time, in Mangaluru [Video] - CarToq.com", "description": "The incident happened in Naguri, Mangaluru where an Okinawa dealership caught fire. It is expected that the cause of the fire is a short circuit. This is the second Okinawa dealership to catch fire. The first incident that happened in Tamil Nadu and Okinawa c…", "url": "https://www.cartoq.com/okinawas-dealership-catches-fire-in-mangaluru-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/okinawa-dealership-fire-featured.jpg", "publishedAt": "2022-06-24T10:07:30Z", "content": "The incident happened in Naguri, Mangaluru where an Okinawa dealership caught fire. It is expected that the cause of the fire is a short circuit. This is the second Okinawa dealership to catch fire. … [+3609 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sanya Jain", "title": "Paytm to allow ‘work from home’ for these roles. See CEO Vijay Sharma’s tweet - Moneycontrol", "description": "“We at Paytm allow you to work from home/anywhere for product, tech and business roles,” Vijay Shekhar Sharma wrote on Twitter.", "url": "https://www.moneycontrol.com/news/trends/paytm-to-allow-work-from-home-for-these-roles-see-ceo-vijay-sharmas-tweet-8733571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Vijay-Shekhar-Sharma-770x421.jpg", "publishedAt": "2022-06-24T09:03:14Z", "content": "At a time when companies across the world are ordering employees to return to office, Paytms Vijay Shekhar Sharma is expounding the benefits of working from home.\r\nOn Thursday, the Paytm chief announ… [+1757 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Seshan Vijayraghvan", "title": "Nitin Gadkari Approves Bharat NCAP; Cars In India To Get Safety Rating Based On Crash Tests - carandbike", "description": "Nitin Gadkari, the Minister of Road Transport and Highways has approved Bharat NCAP, which will test the crashworthiness of automobiles sold in India by giving them star ratings based on their performance in crash tests.", "url": "https://www.carandbike.com/news/nitin-gadkari-approves-bharat-ncap-cars-in-india-to-get-safety-rating-based-on-crash-tests-3096481", "urlToImage": "https://c.ndtvimg.com/2022-06/8j342f9o_nitin-gadkari-approves-bharat-ncap-cars-in-india-to-get-safety-rating-based-on-crash-tests_625x300_24_June_22.jpg", "publishedAt": "2022-06-24T08:59:05Z", "content": "Nitin Gadkari, the Minister of Road Transport and Highways (MoRTH) has announced that he has approved the draft GSR (General Statutory Rules) notification for Bharat NCAP or New Car Assessment Progra… [+3252 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "All new 2022 Maruti Brezza: New teaser reveals connected car technology - CarToq.com", "description": "Maruti Suzuki will launch the 2022 Brezza on June 30th. The manufacturer is releasing new teasers daily. The latest teaser shows Maruti Suzuki’s Suzuki Connect which is a connected car technology. We have seen Suzuki Connect on the Baleno as well as the XL6. …", "url": "https://www.cartoq.com/all-new-2022-maruti-brezza-new-teaser-reveals-connected-car-technology/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/brezza-new-teaser-featured.jpg", "publishedAt": "2022-06-24T08:55:20Z", "content": "Maruti Suzuki will launch the 2022 Brezza on June 30th. The manufacturer is releasing new teasers daily. The latest teaser shows Maruti Suzuki’s Suzuki Connect which is a connected car technology.\r\nW… [+2715 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Three charts show trouble for Indian stocks nearing a bear market - The Indian Express", "description": "The S&P BSE Sensex Index has fallen more than 15% from its October high, nearing the 20% loss that denotes a bear market.", "url": "https://indianexpress.com/article/business/market/three-charts-show-trouble-for-indian-stocks-nearing-a-bear-market-7988028/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-bloomberg-1200.jpg", "publishedAt": "2022-06-24T08:19:41Z", "content": "As surging inflation and the end of global easy-money policies send Indian stocks spiraling down from all-time highs, three charts show the pain is unlikely to end anytime soon.The S&amp;P BSE Sensex… [+2250 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Commodity prices slide to pre-Ukraine war levels - Economic Times", "description": "The soft commodity prices slumped back to pre-Ukraine conflict levels, including wheat which  is down by 26.4 per cent, corn lower by 14.5 per cent, and sugar by 9.4 per cent. Cotton futures hit a 3-month low on demand concerns. While raw sugar hit a 6-week l…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/commodity-prices-slide-to-pre-ukraine-war-levels/articleshow/92431396.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92431580,width-1070,height-580,imgsize-130826,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-24T08:08:00Z", "content": "Soft commodity prices slumped back to pre-Ukraine conflict levels after an intense first half of 2022 dominated by the supply turmoil and inflationary shocks unleashed by Russias attack on Ukraine.\r\n… [+1683 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "https://www.facebook.com/amitsharma294", "title": "Honda RS SUV Production Model Could Be Called Next Gen WR-V – August Debut - India Car News", "description": "Japanese automaker, Honda is reportedly to showcase the production version of the Honda RS SUV Concept at the 2022 GIIAS in August. Indonesian media believes that the new model could be called the next gen Honda WR-V; however, Honda is yet to make an official…", "url": "https://www.indiacarnews.com/news/honda-rs-suv-production-model-could-be-called-next-gen-wr-v-august-debut-52727/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2022/04/Honda-Compact-SUV-1000x600.jpg", "publishedAt": "2022-06-24T07:35:52Z", "content": "Japanese automaker, Honda is reportedly to showcase the production version of the Honda RS SUV Concept at the 2022 GIIAS in August. Indonesian media believes that the new model could be called the ne… [+2010 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "India's inflation fight will not be painless, says RBI deputy governor Michael Patra - Economic Times", "description": "Patra said the central bank will not allow  jerky movements  of Rupee and stressed that the Indian currency has witnessed least depreciation in recent times. Addressing an interactive session on 'Geo-Political Spillovers and Indian Economy', he attributed the…", "url": "https://economictimes.indiatimes.com/news/economy/policy/hopeful-monetary-actions-needed-are-moderate-vs-peers-rbi-deputy-governor-michael-patra/articleshow/92430667.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92430901,width-1070,height-580,imgsize-34442,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-24T07:27:00Z", "content": "Inflation will return to the Reserve Bank of Indias mid-point target in two years, a senior central banker said, with policy actions aimed at cooling price pressures set to take a toll on the economy… [+2145 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Massive layoffs at Netflix again! Streaming company fires 300 employees in second round - Zee News", "description": "After laying off several employees recently, popular video streaming platform Netflix has once again shown the exit door to an additional 300 employees in the second round of layoffs.", "url": "https://zeenews.india.com/companies/massive-layoffs-at-netflix-again-streaming-company-fires-300-employees-in-second-round-2477381.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/24/1057304-netflix-1.jpg", "publishedAt": "2022-06-24T07:10:39Z", "content": "New Delhi: After laying off several employees recently, popular video streaming platform Netflix has once again shown the exit door to an additional 300 employees in the second round of layoffs.\r\nAcc… [+1183 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Harsha Jethmalani", "title": "Accenture's Q3 earnings: The good and the bad | Mint - Mint", "description": "Accenture's management indicated a strong demand environment and order bookings and added that there has not been any change in the decision-making cycle by its clients", "url": "https://www.livemint.com/market/mark-to-market/accentures-q3-earnings-the-good-and-the-bad-11656051376940.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/accenture-kgHC--621x414@LiveMint_1656052258603.JPG", "publishedAt": "2022-06-24T06:41:46Z", "content": "The earnings of US-based IT company Accenture are often seen as an indicator of the performance of the Indian IT sector. The good news is that Accenture's March-May quarter results were decent. Reven… [+2422 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "RBI has surged ahead of curve: Deputy Governor Michael Patra - Moneycontrol", "description": "The RBI's rate-setting panel has since early May raised the policy repo rate by 90 basis points to 4.90 percent as it seeks to curb elevated inflation which could threaten economic recovery.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-has-surged-ahead-of-curve-deputy-governor-michael-patra-8732181.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/RBI_shutterstock_1686527644-770x433.jpg", "publishedAt": "2022-06-24T06:34:24Z", "content": "The Reserve Bank of India has surged ahead of the curve with its recent monetary tightening, deputy governor Michael Patra said on June 24.\r\n\"RBI's action will prevent the second round effects from f… [+1109 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jet Airways Begins Hiring, Invites Former Cabin Crew To Rejoin - NDTV", "description": "Jet Airways began its operational hiring today and asked its former cabin crew members to rejoin the airline.", "url": "https://www.ndtv.com/india-news/jet-airways-begins-hiring-invites-former-cabin-crew-to-rejoin-3096021", "urlToImage": "https://c.ndtvimg.com/2022-05/kg47n0k4_jet-airways-650_625x300_17_May_22.jpg", "publishedAt": "2022-06-24T06:21:39Z", "content": "Jet Airways intends to restart commercial flight operations in the July-September quarter.\r\nNew Delhi: Jet Airways began its operational hiring today and asked its former cabin crew members to rejoin… [+1253 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Indian Oil Recommends Issue of Bonus Shares; Know Record Date, Share Ratio, Other Details - News18", "description": "Indian Oil Corporation Limited (IOC) has declared that it will issue bonus shares to its shareholders. Know details", "url": "https://www.news18.com/news/business/markets/indian-oil-recommends-issue-of-bonus-shares-know-record-date-share-ratio-other-details-5430775.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/indian-oil-1-165278978716x9.jpg", "publishedAt": "2022-06-24T06:19:00Z", "content": "Indian Oil Bonus Shares: Government-owned Indian Oil Corporation Limited (IOC) has declared that it will issue bonus shares to its shareholders in the ratio of 1:2, i.e, for every two existing shares… [+3011 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Italian bikemaker Moto Morini to enter the Indian market - Team-BHP", "description": "Italian bikemaker Moto Morini has partnered with Adishwar Auto Ride India (AARI) to enter the Indian market. Moto Morini’s product portfolio includes the X-Cape ADV and the Seiemmezzo roadster. The latter is offered in two variants – STR and SCR.", "url": "https://www.team-bhp.com/news/italian-bikemaker-moto-morini-enter-indian-market", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Moto-Morini-X-Cape-650.jpg", "publishedAt": "2022-06-24T06:05:20Z", "content": "Italian bikemaker Moto Morini has partnered with Adishwar Auto Ride India (AARI) to enter the Indian market.\r\nMoto Morinis product portfolio includes the X-Cape ADV and the Seiemmezzo roadster. The l… [+485 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saloni Goel", "title": "This one factor holds a clue to when the worst FII selloff might end - Economic Times", "description": "There are fundamental reasons behind FII selloff. India was relatively expensive to start with and that has added some kind of fuel to the fire to the current account worsening for India as a consequence of the fuel prices rising and the consequent weakness t…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/this-one-factor-holds-a-clue-to-when-the-worst-fii-selloff-might-end/articleshow/92428312.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92428382,width-1070,height-580,imgsize-124442,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-24T05:58:00Z", "content": "NEW DELHI: $39 billion and counting... That's how much foreign institutional investors (FIIs) have sold in the last nine months, making it the most brutal and longest such selling by them, even worse… [+3448 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Rakesh Jhunjhunwala portfolio stock trades ex-bonus, shares rally 20% | Mint - Mint", "description": "Nazara Tech's board has fixed June 27 as the record date for the proposed bonus issue of shares", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-portfolio-stock-nazara-tech-shares-rally-ahead-of-record-date-for-bonus-issue-11656049223796.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/bonus_shares_1656049576007_1656049576194.jpg", "publishedAt": "2022-06-24T05:49:38Z", "content": "Shares of Nazara Technologies rallied about 20% to 623 apiece on the BSE in Friday's trading session as the stock started trading ex-bonus ahead of its record date for the bonus shares issue. Bonus s… [+1917 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Rajendra Prasad Mohapatra", "title": "Gold, silver prices see big fall today, check new prices in Cuttack and Bhubaneswar - OTV News", "description": "For 23-carat, the price of 10 grams of yellow metal is Rs 50,400 while the rate of 22-carat gold has reached 49,400.", "url": "https://odishatv.in/news/business/gold-silver-prices-see-big-fall-today-check-new-prices-in-cuttack-and-bhubaneswar-179474", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1653973947.jpeg", "publishedAt": "2022-06-24T05:10:29Z", "content": "Amid the fluctuation in gold and silver rates across the country, the price for 24-carat gold per 10 gram has reached Rs 52,250 on Friday in twin cities of Bhubaneswar and Cuttack with a fall of Rs 2… [+1019 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Electric Vehicle fires will happen: Ola’s Bhavish Aggarwal after Tata Nexon EV fire - CarToq.com", "description": "After a Tata Nexon EV caught fire, Ola’s Bhavish Aggarwal was quick to make a point. The Ola CEO Bhavish Aggarwal said that electric vehicle fires will happen. He quoted a video of the burning Tata Nexon EV and shared it on a social media platform. In case yo…", "url": "https://www.cartoq.com/electric-vehicle-fires-will-happen-olas-bhavish-aggarwal-after-tata-nexon-ev-fire/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/ola-bhavish-aggarwal-on-tata-nexon-electric-fire.jpg", "publishedAt": "2022-06-24T05:07:06Z", "content": "After a Tata Nexon EV caught fire, Ola’s Bhavish Aggarwal was quick to make a point. The Ola CEO Bhavish Aggarwal said that electric vehicle fires will happen. He quoted a video of the burning Tata N… [+2558 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sneha Kulkarni", "title": "HDFC Bank Vs ICICI Bank: Which bank is offering highest 1-3 FD interest rates after hike - Economic Times", "description": "The fact that HDFC Bank and ICICI Bank raised their fixed deposit interest rates twice in a short period of time is good news for FD investors who, in prior years, had to deal with historically low interest rates.", "url": "https://economictimes.indiatimes.com/wealth/invest/hdfc-bank-vs-icici-bank-which-bank-is-offering-highest-1-3-fd-interest-rates-after-hike/articleshow/92425989.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92426240,width-1070,height-580,imgsize-77971,overlay-etwealth/photo.jpg", "publishedAt": "2022-06-24T04:23:00Z", "content": "and have raised their fixed deposit interest rates twice within a short period of time which is good news for FD investors, who have been stuck with record low interest rates in previous years.\r\nBank… [+2102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Rs 30 for 90 mins: Co-working space for freelancers, working mothers - The Indian Express", "description": "The Happy Works space essentially comprises working pods, which provide a comfortable setting for people to work — at minimal rates.", "url": "https://indianexpress.com/article/governance/rs-30-for-90-mins-co-working-space-for-freelancers-working-mothers-7987485/", "urlToImage": "https://images.indianexpress.com/2022/06/Happy-Works-co-working-space.jpg", "publishedAt": "2022-06-24T04:16:55Z", "content": "Until recently, Kolkata-based Pooja Maitra, a media professional and a mother of a four-year-old girl, had a nickname for her car: mobile office. She would often use it to work in after dropping off … [+3330 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Hero MotoCorp shares gain as two wheeler maker rolls out price hikes to ride out input inflation - Moneycontrol", "description": "The share touched a 52 week high of Rs 2,994.55 and a 52 week low of Rs 2,148.00 on 23 June 2021 and 8 March 2022 respectively", "url": "https://www.moneycontrol.com/news/business/stocks/hero-motocorp-races-as-two-wheeler-maker-rolls-out-price-hikes-to-offset-input-inflation-8731581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/05/hero_motocorp-770x433.jpg", "publishedAt": "2022-06-24T04:08:11Z", "content": "Hero MotoCorp share price rose more than a percent in early trade on June 24 after the company said it is going to hike prices of motorcycles and scooters.\r\nHero MotoCorp will make hike ex-showroom p… [+746 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Govt to Soon Become Biggest Shareholder of Vodafone Idea; Close to Holding 33% Stake - News18", "description": "The government will convert Vodafone Idea's accrued interest liability on deferred dues worth Rs 16,133 crore into equities", "url": "https://www.news18.com/news/business/govt-close-to-holding-33-stake-in-vodafone-idea-to-be-a-silent-investor-5429953.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/vodafone-1-165604645216x9.jpg", "publishedAt": "2022-06-24T03:50:00Z", "content": "The Union government is all set to become the biggest shareholder of Vodafone Idea Limited (Vi) soon. The government will hold around 33 per cent in the company after converting the telcos accrued in… [+2755 chars]"}, {"source": {"id": null, "name": "TelecomTALK"}, "author": "https://www.facebook.com/TelecomTalk/", "title": "Vodafone Idea Now in Better Position - TelecomTalk", "description": "Vodafone Idea just needs to focus on maximising revenues now and reinvesting it as much as possible.", "url": "https://telecomtalk.info/vodafone-idea-now-in-better-position-today/529056/", "urlToImage": "https://telecomtalk.info/wp-content/uploads/2022/06/vodafone-idea-now-in-better-position-today.jpeg", "publishedAt": "2022-06-24T03:41:23Z", "content": "Vodafone Idea (Vi), the third-largest telco in India, is in a better position as it has received the option to defer additional AGR (adjusted gross revenue) dues worth Rs 8,837 crore. This amount is … [+1603 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vidnyan Sawant", "title": "Hot Stocks | Sapphire Foods, Asahi India Glass, Indian Hotels can give 16-26% return in short term - Moneycontrol", "description": "Asahi India and Indian Hotels show clear uptrend. Read on to know what Vidnyan Sawant of GEPL Capital suggests you should do with the stocks:", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-sapphire-foods-asahi-india-glass-indian-hotels-can-give-16-26-return-in-short-term-8730561.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/sensex_nifty-marketup_sensexup-Niftyup-770x433.jpg", "publishedAt": "2022-06-24T02:35:10Z", "content": "Since mid-October 2021, Nifty has shown price and time correction. The benchmark index, in the last week, breached its major support level of 15,650. Post that, prices have failed to move above 15,65… [+3234 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Arindam Roy", "title": "Stocks to Watch: ONGC, Hero MotoCorp, J&K Bank | Mint - Mint", "description": "Indian indices on Thursday closed higher, led by IT and auto stocks, while a fall in oil prices boosted domestic sentiment.", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-ongc-hero-motocorp-j-k-bank-11656035553890.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/stock-kpeE--621x414@LiveMint_1656035651704.jpg", "publishedAt": "2022-06-24T02:01:59Z", "content": "ONGC: ONGC Videsh Ltd, the overseas investment arm of state-owned Oil and Natural Gas Corporation (ONGC), has made an oil discovery in a block in Colombia, the company said on Thursday.\r\nHero MotoCor… [+1765 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Fed says U.S. banks can weather severe downturn comfortably - Reuters", "description": "The largest U.S. banks on Thursday easily cleared the Federal Reserve's annual health check, in a vote of confidence for the sector amid signs the U.S. economy could tip into a recession in the months ahead.", "url": "https://www.reuters.com/markets/us/us-fed-says-banks-can-weather-severe-downturn-comfortably-2022-06-23/", "urlToImage": "https://www.reuters.com/resizer/iGSxk9OE08JjDSCCCcOrnveYhoY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/HJWVJUHNIZJVHBBFQ74Q56M2BY.jpg", "publishedAt": "2022-06-24T01:18:00Z", "content": "WASHINGTON, June 23 (Reuters) - The largest U.S. banks on Thursday easily cleared the Federal Reserve's annual health check, in a vote of confidence for the sector amid signs the U.S. economy could t… [+4505 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Piyush Shukla", "title": "SBI versus HDFC Bank: How will the battle of titans in Indian banking shape up? - Moneycontrol", "description": "On April 13, SBI Chairman Dinesh Khara had said that the bank will likely see more than 10 per cent loan growth in FY23.", "url": "https://www.moneycontrol.com/news/business/banks/sbi-versus-hdfc-bank-how-will-the-battle-of-titans-in-indian-banking-shape-up-8729291.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/Blank-2-Grids-Collage-435x435.png", "publishedAt": "2022-06-24T00:51:41Z", "content": "State Bank of India (SBI) Chairman Dinesh Kumar Khara on Wednesday said the bank was very mindful of the HDFC-HDFC Bank merger and was taking necessary steps to beat competition.\r\nHis comments came o… [+5953 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Vlad", "title": "Instagram tests age verification via video selfie and social vouching - GSMArena.com news - GSMArena.com", "description": "That's in addition to uploading your ID.", "url": "https://www.gsmarena.com/instagram_tests_age_verification_via_video_selfie_and_social_vouching-news-54787.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/22/06/instagram-age-verification-test/-952x498w6/gsmarena_000.jpg", "publishedAt": "2022-06-23T23:59:01Z", "content": "Over in the US, Instagram has started testing new ways to have you verify your age. In addition to simply uploading your ID, a method that may take up to two days to verify, you now have two more opt… [+1199 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sagar Malviya", "title": "Facing most difficult economic situation, says HUL chairman Nitin Paranjpe - Economic Times", "description": "Last month, wholesale prices rose to a record when referenced to the new reporting benchmark, with the gauge climbing to just shy of 16%.", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/facing-most-difficult-economic-situation-says-hul-chairman-nitin-paranjpe/articleshow/92422927.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92422934,width-1070,height-580,imgsize-21000,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T23:44:00Z", "content": "() chairman Nitin Paranjpe said India is going through the most difficult economic situation and inflationary pressures are beginning to weigh on demand.\r\nThis has prompted some buyers of fast-moving… [+2518 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saikat Das", "title": "As rupee plunges against dollar, importers bet big on currency hedges - Economic Times", "description": "With exporters also holding on to their earnings in anticipation of a further slide in the local unit, odds are shortening on a demand surge for hedging instruments in the currency market.", "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/as-rupee-plunges-against-dollar-importers-bet-big-on-currency-hedges/articleshow/92422809.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92422836,width-1070,height-580,imgsize-45598,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T23:21:00Z", "content": "Companies with US dollar loans on their balance sheets and importers are rushing to cover unhedged foreign currency exposures after the Federal Reserve's latest resolve to restrain inflation stoked c… [+3703 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mayur Shetty,Surojit Gupta,Sidhartha", "title": "Inflation over 6% hurts growth... It has become broad-based and RBI is addressing it, says Das - Times of India", "description": "India Business News: The revival of economic activity continues to be steady and is gaining traction, and RBI is on track to bring down inflation and inflationary expectat", "url": "https://timesofindia.indiatimes.com/business/india-business/economic-revival-steady-rbi-calming-inflation-governor/articleshow/92422394.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92422480,width-1070,height-580,imgsize-17700,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-23T22:02:00Z", "content": ""}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Alex Kimani", "title": "The World Is Failing In Both Energy Affordability And Climate Goals - OilPrice.com", "description": "In its World Energy Investment Report, the IEA concludes that today's energy investment trends show a world falling short on climate goals, and on reliable and affordable energy", "url": "https://oilprice.com/Energy/Energy-General/The-World-Is-Failing-In-Both-Energy-Affordability-And-Climate-Goals.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-06-23_yiu4j0vnn3.jpg", "publishedAt": "2022-06-23T22:00:00Z", "content": "The U.S. construction industry appears…\r\nGermany will rely on more…\r\nFor decades, Chinas thirst for…\r\nBy Alex Kimani - Jun 23, 2022, 5:00 PM CDTGlobal energy investment is on the rise and expected to… [+6258 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kala Vijayraghavan", "title": "Tata Power gearing up to build pan-India electric vehicle charging stations - Economic Times", "description": "Tata Power has tied up with OEMs like Tata Motors under which home charger solution is provided to each of the vehicle owner, as part of the vehicle purchase and nearly 15,000 home chargers have been provided. In addition to this, nearly 2,000 plus public cha…", "url": "https://economictimes.indiatimes.com/industry/renewables/tata-power-gearing-up-to-build-pan-india-electric-vehicle-charging-stations/articleshow/92421226.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92421232,width-1070,height-580,imgsize-40450,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T19:23:00Z", "content": "Mumbai: Tata Power has kicked off an ambitious nation-wide plan of setting up electric vehicle (EV) charging stations from North to South, connecting Kashmir to Kanyakumari and from East to West, fro… [+1891 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Gawande", "title": "Amazon faces uphill battle with Future Retail insolvency, say legal experts | Mint - Mint", "description": "In its intervention application, Amazon argued that 26 banks led by BoI colluded with FRL to deny the company its rights", "url": "https://www.livemint.com/companies/news/amazon-faces-uphill-battle-with-future-retail-insolvency-say-legal-experts-11656009931185.html", "urlToImage": "https://images.livemint.com/img/2022/06/23/600x338/Amazon_1656009971177_1656009982774.jpg", "publishedAt": "2022-06-23T18:47:50Z", "content": "MUMBAI : Amazons efforts to oppose Bank of Indias move to initiate corporate insolvency resolution proceedings against debt-laden Future Retail Ltd will be an uphill task, experts said. The National … [+2417 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "RBI issues guidelines for outsourcing of IT services by banks, NBFCs | Mint - Mint", "description": "The central bank said that regulated entities (REs) will not require prior approval from the RBI for the outsourcing of IT and IT-enabled services", "url": "https://www.livemint.com/news/india/rbi-issues-norms-for-outsourcing-of-it-services-by-banks-nbfcs-11655997040884.html", "urlToImage": "https://images.livemint.com/img/2022/06/23/600x338/RBI_1655998210543_1655998210827.jpg", "publishedAt": "2022-06-23T15:31:06Z", "content": "The Reserve Bank of India (RBI) has put forward a few norms on Thursday for the outsourcing of IT services to ring-fence banks and other regulated entities from financial, operational and reputationa… [+3471 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Kayezad E Adajania", "title": "Axis MF front running case | Sacked fund manager Viresh Joshi sues MF house alleging wrongful termination - Moneycontrol", "description": "Joshi, a former fund manager and chief dealer at Axis MF, has sued the asset manager even as investigations are still underway into an alleged case of front-running.", "url": "https://www.moneycontrol.com/news/business/personal-finance/axis-front-running-case-sacked-fund-manager-and-dealer-viresh-joshi-sues-axis-mf-alleging-wrongful-termination-8707801.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/Axis-MF-770x433.png", "publishedAt": "2022-06-23T12:53:29Z", "content": "Viresh Joshi, a former fund manager and chief trader of Axis Mutual Fund, has filed a lawsuit accusing the asset management company of unfairly terminating his employment in connection with a suspect… [+8841 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Madhurima Nandy", "title": "Macrotech enters Bengaluru market, signs first project | Mint - Mint", "description": "Macrotech will acquire the stake of G Corp Developers in a clutch of residential projects in Bengaluru", "url": "https://www.livemint.com/companies/news/macrotech-enters-bengaluru-market-signs-first-project-11655984440770.html", "urlToImage": "https://images.livemint.com/img/2022/06/23/600x338/thumbnail_Project_Lodha_World_Towers_(Lower_Parel)_1617259799177_1655984691991.jpg", "publishedAt": "2022-06-23T11:48:35Z", "content": "Bengaluru: Mumbai-based Macrotech Developers Ltd, which operates under the Lodha brand, is in the process of acquiring the stake of G Corp Developers Pvt Ltd in a clutch of residential projects in Be… [+2641 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "LIC Policy: Invest Rs 253 Daily, Get Rs 55 Lakh at Maturity; All You Need to Know - News18", "description": "LIC's Jeevan Labh is a limited premium paying, non-linked, with-profits endowment plan which offers a combination of protection and savings.", "url": "https://www.news18.com/news/business/savings-and-investments/lic-jeevan-labh-policy-offers-rs-55-lakh-at-maturity-if-you-invest-this-amount-know-more-5427169.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/money-6-165512101916x9.jpg", "publishedAt": "2022-06-23T11:33:50Z", "content": "LIC Jeevan Labh Policy:  The Life Insurance Corporation, or LIC, of India is one of the go-to options for Indians when it comes to buy insurance policies. The LIC, has for this reason, curated specif… [+2714 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kalyan Parbat", "title": "Telcos may save Rs 5,400 crore in annual SUC payments - Economic Times", "description": "ICICI Securities estimates that the applicable SUC rates for Airtel, Vi and Jio would plunge to “0.4%, 0.4% and 0.3% of adjusted gross revenue (AGR) respectively if they buy as much as 500 units of 26 GHz and 100 units of 3.3-3.67 GHz spectrum in the July sal…", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/telcos-may-save-rs5400-crore-in-annual-suc-payments/articleshow/92408472.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92408449,width-1070,height-580,imgsize-196780,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T08:59:00Z", "content": "Bharti , Jio and (Vi) may annually save around Rs 2,100 crore, Rs 2,300 crore and Rs 1,000 crore respectively in spectrum usage charges (SUC) after the government removed the 3% floor rate on the sta… [+2644 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Talqeen Zubairi", "title": "PKR gains Rs4 against dollar in interbank after news of $2.3bn China rollover - DAWN.com", "description": "Analyst says rupee's correction \"long due\", predicts that the local currency will strengthen in coming sessions.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2022/06/62b400331af78.jpg", "publishedAt": "2022-06-23T08:30:37Z", "content": "The rupee further recovered against the dollar on Thursday, gaining Rs4.7 in the interbank market, with analysts attributing the development to the announcement of a $2.3 billion loan from Chinese ba… [+2093 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tarush Bhalla", "title": "Digital payments provider Pine Labs acquires API infra firm Setu for $70-75 million - Economic Times", "description": "Post the acquisition, Setu will work independently and retain its brand entity and continue to serve its existing merchants and Pine Labs will enter into embedded finance, and gain access to Setus API infrastructure stack to extend newer services for its onli…", "url": "https://economictimes.indiatimes.com/tech/startups/digital-payments-provider-pine-labs-acquires-api-infra-firm-setu-for-70-75-million/articleshow/92406820.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92406779,width-1070,height-580,imgsize-95746,overlay-ettech/photo.jpg", "publishedAt": "2022-06-23T08:23:07Z", "content": "Digital payments service provider Pine Labs has acquired application programming interface (API)-based infrastructure company Setu in a cash-and-stock deal worth $70-$75 million.\r\nPine Labs chief exe… [+3500 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anand JC", "title": "US recession set to impact India, may lead to growth slowdown in medium-term - Economic Times", "description": "The impending growth slowdown in the United States is set to hamper the growth trajectory of India in the medium term, analysts say. In the medium term, with a ‘prolonged mild recession in the US, as the firm has forecasted, Indias economy is likely to see a …", "url": "https://economictimes.indiatimes.com/news/economy/indicators/us-recession-set-to-impact-india-may-lead-to-growth-slowdown-in-medium-term/articleshow/92407199.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92407226,width-1070,height-580,imgsize-310012,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T08:06:00Z", "content": "The impending growth slowdown in the United States is set to hamper the growth trajectory of India in the medium term, analysts say.\r\nResearch firm Nomura in a note on Thursday said that as per its N… [+2494 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DH News Service", "title": "A peek into IKEA's largest store in India opened in Bengaluru - Deccan Herald", "description": "Global Swedish home furnishing retailer IKEA opened its third and largest store in India, in Bengaluru on June 22. Spread over 12.2 acres, the 4,60,000 sq ft Nagasandra store will feature more than 7,000 well-designed home furnishing products along with 65-pl…", "url": "https://www.deccanherald.com/dh-galleries/photos/a-peek-into-ikeas-largest-store-in-india-opened-in-bengaluru-1120298", "urlToImage": "https://www.deccanherald.com/sites/dh/files/styles/largehorizontal/public/gallery_images/2022/06/23/Ikea%20Bengaluru%20Store%20%287%29.jpg?itok=eBu2XmOe", "publishedAt": "2022-06-23T07:38:00Z", "content": "Global Swedish home furnishing retailer IKEA opened its third and largest store in India, in Bengaluru on June 22. Spread over 12.2 acres, the 4,60,000 sq ft Nagasandra store will feature more than 7… [+156 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Analysts are bullish on this Rs 667 crore-Jhunjhunwala bet. Here’s why - Economic Times", "description": "Ace investor Rakesh Jhunjhunwala and his wife Rekha owned a total 2.12 per cent stake in IHCL as of March 31, which is valued at Rs 667 crore as of Thursdays trade.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-are-bullish-on-this-rs-667-crore-jhunjhunwala-bet-heres-why/articleshow/92405108.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92405111,width-1070,height-580,imgsize-47632,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-23T06:37:00Z", "content": "NEW DELHI: Tata Group firm (IHCL) is out with its annual report and the key takeaways from it includes the managements focus on asset-light growth through management contracts. Revenue growth and mar… [+2816 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Reliance seeks new technologies to make cheaper green hydrogen - Economic Times", "description": "Green hydrogen has drawn tens of billions of dollars in investment commitments from investors, including Ambani and rival tycoon Gautam Adani. The fuel, produced by splitting water with the help of clean energy like wind power, is seen as critical to decarbon…", "url": "https://economictimes.indiatimes.com/industry/renewables/reliance-seeks-new-technologies-to-make-cheaper-green-hydrogen/articleshow/92402351.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92402376,width-1070,height-580,imgsize-17072,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-23T04:48:00Z", "content": "Industries Ltd., controlled by Indian billionaire Mukesh Ambani, is assessing new technologies for making electrolyzers in its efforts to produce low-cost green hydrogen in the country.\r\nAs part of t… [+1697 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "RIL share price correction a buying opportunity: Jefferies | Mint - Mint", "description": "Shares of Reliance Industries (RIL) have corrected about 12% from its recent high", "url": "https://www.livemint.com/news/reliance-industries-ril-share-price-correction-a-buying-opportunity-jefferies-11655957162266.html", "urlToImage": "https://images.livemint.com/img/2022/06/23/600x338/reliance_industries_shares_1655957546944_1655957547119.jpg", "publishedAt": "2022-06-23T04:37:43Z", "content": "Shares of Reliance Industries (RIL) have corrected about 12% from its recent high. Multi year-low inventories, declining Russian exports, muted Chinese exports, lower diesel production in Europe and … [+2170 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "The Iconic Contessa by Hindustan Motors Could be Coming Back Soon, Here's Why - News18", "description": "The Contessa was a premium sedan sold in India by Hindustan Motors from the 1980s to the early 2000s", "url": "https://www.news18.com/news/auto/the-iconic-contessa-by-hindustan-motors-could-be-coming-back-soon-heres-why-5420041.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/hindustan-motors-contessa-165588774416x9.jpg", "publishedAt": "2022-06-22T08:51:52Z", "content": "CK Birla Group firm, Hindustan Motors Ltd has said that it has agreed to sell its Contessa brand to SG Corporate Mobility Pvt Ltd for an undisclosed sum. The company has executed a brand transfer agr… [+1192 chars]"}]}