{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": null, "name": "DailyFX"}, "author": "Diego Colman", "title": "March Jobs Report: Nonfarm Payrolls Rise by 236,000, Wage Growth Cools to 4.2% - DailyFX", "description": "The U.S. economy added 236,000 jobs in March, a healthy but slower pace of hiring than seen earlier in the year. Meanwhile, the unemployment rate fell to 3.5% from 3.6% previously.", "url": "https://www.dailyfx.com/news/march-jobs-report-nonfarm-payrolls-nfp-rise-by-236-000-wage-growth-cools-20230407.html", "urlToImage": "https://a.c-dn.net/b/32tbH3/jobs_NFP_report.JPG", "publishedAt": "2023-04-07T12:55:00Z", "content": "<ul><li>U.S. employers add 236,000 workers in March versus expectations of a gain of 239,000 jobs</li><li>Meanwhile, the unemployment rate edges lower to 3.5%, one-tenth of a percent below consensus … [+3594 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Shubhangi Mathur", "title": "Russia supplies 1.64 million bpd of crude to India in March; retains top position - Moneycontrol", "description": "Russia has become a major source of crude oil to India after Moscow sent troops into Ukraine in February 2022.", "url": "https://www.moneycontrol.com/news/business/russia-supplies-1-64-million-bpd-of-crude-to-india-in-march-retains-top-position-10379521.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/01/Crude-Oil_May-7-770x433.jpg", "publishedAt": "2023-04-07T12:19:32Z", "content": "India met the bulk of its crude oil requirements in March from Russia, according to energy tracker Vortexa.\r\nDuring the month, Russia supplied 1.64 million barrels per day (bpd) of crude oil to India… [+2355 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'4 million Pakistanis...': World Bank's big warning as Islamabad inches closer to economic doom - Hindustan Times", "description": "The World Bank has said that various economic shocks have resulted in nearly four million Pakistanis getting pushed into poverty this fiscal year, The Expres...", "url": "https://www.youtube.com/watch?v=GJys1ssh9Q0", "urlToImage": "https://i.ytimg.com/vi/GJys1ssh9Q0/maxresdefault.jpg", "publishedAt": "2023-04-07T11:50:00Z", "content": null}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Yordan", "title": "Samsung Q1 earnings guidance reveals plummeting profits - GSMArena.com news - GSMArena.com", "description": "Operating profit will be under KRW 1 trillion - a six-time decline in just three months. Samsung posted its Q1 earnings guidance, and it shows results...", "url": "https://www.gsmarena.com/samsung_prepares_for_a_catastrophic_sales_and_profit_decline_in_q1_earnings_guidance-news-58164.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/17/04/samsung-q1-2017/-952x498w6/gsmarena_001.jpg", "publishedAt": "2023-04-07T11:35:01Z", "content": "Samsung posted its Q1 earnings guidance, and it shows results bleaker than anything we've seen in over a decade. Sales will be between KRW 62-64 trillion (about $48 billion), 10% down QoQ and almost … [+1435 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Skoda discontinues Octavia from Indian market: Delists car from official website - CarToq.com", "description": "The popular car manufacturer Skoda recently removed its popular D-segment sedan, the Octavia, from its website. This indicates that the premium sedan has been officially discontinued from the Indian market. Skoda had launched the current generation Octavia in…", "url": "https://www.cartoq.com/skoda-discontinues-octavia-from-indian-market-delists-car-from-official-website/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/08/skoda-octavia.jpg", "publishedAt": "2023-04-07T11:25:07Z", "content": "The popular car manufacturer Skoda recently removed its popular D-segment sedan, the Octavia, from its website. This indicates that the premium sedan has been officially discontinued from the Indian … [+3362 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Toyota Temporarily Stops Innova Hycross Bookings For Top-End Trims - GaadiWaadi.com", "description": "The bookings for the Innova Hycross top-end variants have been temporarily stopped in India due to supply constraints", "url": "https://gaadiwaadi.com/toyota-temporarily-stops-innova-hycross-bookings-for-top-end-trims/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/04/Toyota-Innova-Hycross.jpg", "publishedAt": "2023-04-07T10:51:37Z", "content": "Toyota Kirloskar Motor (TKM) has officially announced that bookings for the Innova Hycross top-end variants have been temporarily stopped in India. The move will come into effect from tomorrow as res… [+2054 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Maulik Madhu", "title": "Search for unclaimed bank deposits to get easier with RBI’s centralised portal - Moneycontrol", "description": "With unclaimed deposits of over Rs 35,000 crore across public sector banks, a centralised portal will make it easier to track such deposits. Today, you have to go to each bank website to check if you and your family members have any unclaimed deposits.", "url": "https://www.moneycontrol.com/news/business/personal-finance/search-for-unclaimed-bank-deposits-to-get-easier-with-rbis-centralised-portal-10378881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/rupee_inr_indian-rupee-770x433.jpg", "publishedAt": "2023-04-07T10:30:57Z", "content": "The Reserve Bank of India (RBI) Governor Shaktikanta Das announced at the monetary policy meeting on April 6, 2023, that an online portal would be set up to enable search for unclaimed deposits acros… [+5308 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Yamaha big bikes showcased in India: R3, R7, MT-07, MT-09 - Team-BHP", "description": "Yamaha recently showcased its big bike range in India during a dealer meet. On display were models like the Yamaha R3, R7, R1M, MT-03, MT-07 and MT-09. Reports suggest that Yamaha could introduce these models in India in the coming months. Most likely, these …", "url": "https://www.team-bhp.com/news/yamaha-big-bikes-showcased-india-r3-r7-mt-07-mt-09", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/20230407120342_Yam_2.jpg", "publishedAt": "2023-04-07T09:50:40Z", "content": "Yamaha recently showcased its big bike range in India during a dealer meet. On display were models like the Yamaha R3, R7, R1M, MT-03, MT-07 and MT-09.\r\nReports suggest that Yamaha could introduce th… [+859 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Reliance Capital resolution process deadline may be extended - The Economic Times", "description": "Lenders of Reliance Capital may consider extending the deadline for completing the resolution process until May 30 as the second auction round is yet to take place and three bidders still have concerns regarding the compliance of resolution plans with regulat…", "url": "https://economictimes.indiatimes.com/industry/banking/finance/reliance-capital-resolution-process-deadline-may-be-extended/articleshow/99317787.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99317913,width-1070,height-580,imgsize-39894,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-07T09:26:00Z", "content": "Lenders of debt-ridden Reliance Capital (RCap) may consider extending the deadline for completing the resolution process till May 30 this year, sources said. The current deadline ends on April 16. Co… [+2875 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Mohammad Haris", "title": "ZestMoney To Lay Off 20% of Its Workforce As Part Of Business Continuity Plan: Report - News18", "description": "ZestMoney has promised to pay a month's salary as severance and other benefits like insurance and mental health assistance", "url": "https://www.news18.com/business/zestmoney-to-lay-off-20-of-its-workforce-as-part-of-business-continuity-plan-report-7488457.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/zestmoney-phonepe-acquisition-166936676016x9.jpg", "publishedAt": "2023-04-07T08:46:44Z", "content": "Goldman Sachs-backed ZestMoney will lay off 100 employees, or about 20 per cent of its workforce, weeks after its talks with PhonePe for a sale fell through, according to a Moneycontrol report. It is… [+1464 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Addiction Forced Into System\": Raghuram Rajan Expects More Bank Troubles - NDTV", "description": "Raghuram Rajan, the former IMF chief economist who predicted the global financial crisis more than a decade ago - warned that the banking system is headed for more turmoil after the rescues of Silicon Valley Bank and Credit Suisse.", "url": "https://www.ndtv.com/india-news/raghuram-rajan-who-foresaw-2008-crisis-expects-more-bank-troubles-3928114", "urlToImage": "https://c.ndtvimg.com/2020-12/h3kdhfps_raghuram-rajan-bloomberg-650_625x300_15_December_20.jpg", "publishedAt": "2023-04-07T08:41:00Z", "content": "Raghuram Rajan was the Governor of Reserve Bank of India. (File)\r\nRaghuram Rajan - the former International Monetary Fund chief economist who predicted the global financial crisis more than a decade … [+2292 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Upcoming MG Comet EV Interior Teased, Launch Soon In India - GaadiWaadi.com", "description": "MG Comet EV interior looks similar to the one found in the Wuling Air EV and it will be packed with features and technologies", "url": "https://gaadiwaadi.com/upcoming-mg-comet-ev-interior-teased-launch-soon-in-india/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/04/2023-mg-comet-ev-interior.jpg", "publishedAt": "2023-04-07T08:35:03Z", "content": "MG Motor India has released the official teaser image of the interior of the upcoming Comet EV today. The British manufacturer says the upcoming urban EV ‘makes a perfect car for the urban tribe’ and… [+1882 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Auto Desk", "title": "Top 10 largest-selling cars in FY23: WagonR, Baleno at top; Nexon beats Creta, Brezza to emerge numero uno SUV - India Today", "description": "WagonR, Baleno, Alto, Swift, Nexon, Dzire, Creta, Brezza, Punch and Eeco were the top 10 largest-selling cars in India in FY23.", "url": "https://www.indiatoday.in/auto/cars/story/top-10-largest-selling-cars-in-fy23-wagonr-baleno-at-top-nexon-beats-creta-brezza-to-emerge-numero-uno-suv-2356960-2023-04-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/top_10_cars_in_fy23-sixteen_nine.jpg?VersionId=5cQzAn9PueqlrtZuXI8m_s.3Pyv6nWIt", "publishedAt": "2023-04-07T08:32:29Z", "content": "By India Today Auto Desk: For the passenger vehicle (PV) segment, FY23 was a record-breaking year\r\n with the best-ever fiscal volumes at 3,889,545 units. The previous best of 3,377,436 units came in … [+1682 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "2023 Suzuki Hayabusa Launched In India At Rs. 16.90 Lakh - GaadiWaadi.com", "description": "2023 Suzuki Hayabusa gets new colours and the 1,340 cc liquid-cooled DOHC, in-line four-cylinder engine has been updated to meet OBD2 norms", "url": "https://gaadiwaadi.com/2023-suzuki-hayabusa-launched-in-india-at-rs-16-41-lakh/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/04/2023-Suzuki-Hayabusa-New-Colours.jpg", "publishedAt": "2023-04-07T07:57:54Z", "content": "Suzuki Motorcycle India has today introduced new paint schemes for the latest Hayabusa and its powertrain has been updated to meet OBD2 regulations. The Japanese manufacturer revealed the third gener… [+2295 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Buy or sell: Anuj Gupta of IIFL Securities recommends 5 stocks to buy next week | Mint - Mint", "description": "Buy or sell stocks: Anuj Gupta of IIFL Securities has recommended 5 stocks to buy on Monday — Reliance, SBI, BPCL, Tata Motors and Sun Pharma", "url": "https://www.livemint.com/market/stock-market-news/buy-or-sell-anuj-gupta-of-iifl-securities-recommends-5-stocks-to-buy-next-week-11680853111591.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/07/600x338/Buy_or_sell_stock_market_news_1680853299410_1680853299707_1680853299707.jpg", "publishedAt": "2023-04-07T07:50:34Z", "content": "Buy or sell stocks: After surprising outcome from the Reserve Bank of India ((RBI) Monetary Policy Committee (MPC) meeting outcome to pause interest rates, Indian stock market rebounded strongly from… [+3000 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Anuj Mishra", "title": "2023 Yamaha R15 V4, R15S launched with minor updates - BikeWale", "description": "Although the updates are subtle, they add to the desirability of the motorcycles.", "url": "https://www.bikewale.com/news/2023-yamaha-r15-v4-r15s-launched-with-minor-updates/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/145771/yamaha-r15-right-side-view0.jpeg?isig=0&q=75&art=9", "publishedAt": "2023-04-07T07:38:15Z", "content": "India Yamaha Motor has updated its portfolio by launching the mildly updated versions of the R15 V4 and the R15S. Although the updates are subtle, they add to the desirability of the motorcycles. In … [+2316 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vidya Sreedhar", "title": "PSUs to outshine private banks in Q4; which stocks should investors bet on? - Economic Times", "description": "The brokerage expects banks under its coverage to report a strong 44% YoY growth in net profit in the last quarter of FY23, led by a 30% growth in pre-provision operating profit.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/psus-to-outshine-private-banks-in-q4-which-stocks-should-investors-bet-on/articleshow/99315445.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99315443,width-1070,height-580,imgsize-22146,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-07T07:16:00Z", "content": "Buoyant credit growth in the retail segment and recovery in the corporate segment, coupled with stable asset quality and credit costs, are seen helping the banking sector put up a good show in the Ma… [+3451 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Pallavi Singhal", "title": "India’s ONDC is one year old. Here's a status check - Moneycontrol", "description": "As the government's ambitious Open Network for Digital Commerce platform completes a year, Moneycontrol takes a look at how it has grown, its foundational policies, sectors that are performing well, the challenges it faces and what its future holds", "url": "https://www.moneycontrol.com/news/economy/policy/indias-ondc-is-one-year-old-heres-a-status-check-10377911.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/ONDC-featured.jpg", "publishedAt": "2023-04-07T07:14:16Z", "content": "Launched in April 2022, the Open Network for Digital Commerce (ONDC) project, aimed at democratising the digital ecosystem in an attempt to become a single point of access for all digital services, h… [+5683 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "‘Let that sink in’: Zerodha CEO Nikhil Kamath on India’s growing internet user base | Mint - Mint", "description": "Internet user base has seen an exponential growth over the past few years, thanks to Jio. The Mukesh Ambani-owned telecom service was launched in 2016.", "url": "https://www.livemint.com/technology/tech-news/let-that-sink-in-zerodha-ceo-nikhil-kamath-on-india-s-browning-internet-user-base-11680849887635.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/07/600x338/nikhil_kamath_1680850213202_1680850216151_1680850216151.jpg", "publishedAt": "2023-04-07T06:51:16Z", "content": "Zerodha co-founder and CEO Nikhil Kamath has recently shared a post expressing his views on the growing internet user base in India. In a tweet he notes how Indias market share in the global mobile i… [+1625 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Power Finance Corporation (PFC) dividend declared in FY23 beats PPF, EPF, bank FD returns | Mint - Mint", "description": "Dividend stock Power Finance Corporation's dividend yield of 8.35% in FY23 is higher than PPF, EPF and bank FD returns", "url": "https://www.livemint.com/market/stock-market-news/power-finance-corporation-pfc-dividend-declared-in-fy23-beats-ppf-epf-bank-fd-returns-11680849061479.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/07/600x338/Power_Finance_Corporation_PFC_dividend_declared_1680849280220_1680849280472_1680849280472.jpg", "publishedAt": "2023-04-07T06:47:04Z", "content": "Dividend paying stock: Investing in dividend stocks may turn out a better bet than risk-free small saving schemes like Public Provident Fund (PPF), Employees' Provident Fund (EPF) and bank fixed depo… [+2284 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "'Caution...layoffs to continue...' - MASSIVE JOB CUTS! Nearly 2.71 lakh employees got pink slips so far - Times Now", "description": "Layoffs 2023: US-based employers announced that 2,70,416 people were handed over pink slips. The top reason for job cuts so far this year is market and economic conditions. Meanwhile, hiring plans fell to 9,044, the lowest total for March since 2015, when 6,4…", "url": "https://www.timesnownews.com/business-economy/companies/caution-layoffs-to-continue-massive-job-cuts-nearly-2-71-lakh-employees-got-pink-slips-so-far-article-99314385", "urlToImage": "https://static.tnn.in/thumb/msid-99314385,updatedat-1680849467350,width-1280,height-720,resizemode-75/99314385.jpg", "publishedAt": "2023-04-07T06:37:47Z", "content": "The report revealed 89,703 job cuts in March, up 15 per cent from the 77,770 announced in February. It is up 319 per cent from 21,387 cuts announced in the same month in 2022. (File Photo)"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Unauthorised investment advisory services: Sebi bans 4 entities from securities markets for 6 months - Economic Times", "description": "The Securities and Exchange Board of India (SEBI) has banned four entities from the securities markets for six months after finding that they had provided unauthorized investment advisory services without SEBI's registration. Additionally, these entities must…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/unauthorised-investment-advisory-services-sebi-bans-4-entities-from-securities-markets-for-6-months/articleshow/99313983.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99313994,width-1070,height-580,imgsize-65128,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-07T05:57:00Z", "content": "Sebi has barred four entities from the securities markets for six months for providing unauthorised investment advisory services and directed them to refund investors' money collected through such se… [+1664 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Bosses Try To Lure Gen Z Workers With 'Early Finish Fridays' - NDTV", "description": "UK employers desperate to recruit and retain Gen Z workers are increasingly offering \"early finish Fridays\" in a bid to fill vacant roles amid an ongoing staff shortage crisis.", "url": "https://www.ndtv.com/world-news/uk-bosses-try-to-lure-gen-z-workers-with-early-finish-fridays-3928178", "urlToImage": "https://c.ndtvimg.com/2022-01/b369q1jg_office-generic-istock_625x300_11_January_22.jpg", "publishedAt": "2023-04-07T05:51:48Z", "content": "There were 1,426 job ads on the site citing \"early finish Friday\" this March.\r\nUK employers desperate to recruit and retain Gen Z workers are increasingly offering \"early finish Fridays\" in a bid to … [+3176 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reghu Balakrishnan", "title": "Singapore's Temasek buys majority stake in Manipal Hospitals for $2 billion - The Economic Times", "description": "Temasek Holdings has acquired a 59% stake in India's Manipal Health Enterprises for Rs 29,000 crore ($3.6bn), valuing the Indian hospital chain at the same amount, according to people with knowledge of the development. Temasek-owned Sheares Health initially h…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/temasek-buys-majority-stake-in-manipal-hospitals/articleshow/99313658.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99313666,width-1070,height-580,imgsize-87482,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-07T05:39:00Z", "content": "Singapore government owned fund Temasek Holdings has acquired India's leading hospital chain Manipal Health Enterprises by owning about 59% stake. Temasek-owned Sheares Health, which held 18% stake i… [+3669 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "India’s central bank abandons UPI rival project - TechCrunch", "description": "The Reserve Bank of India has halted plans for a high-profile project intended to rival the nation's dominant payment system, UPI.", "url": "https://techcrunch.com/2023/04/06/india-central-bank-abandons-upi-rival-project-nue/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/04/GettyImages-1236288700.jpg?resize=1200,800", "publishedAt": "2023-04-07T05:38:47Z", "content": "India’s central bank has halted its plans for a high-profile project intended to rival the nation’s dominant payment system, Unified Payments Interface. The project had attracted significant interest… [+2025 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Irina Slav", "title": "Oil Prices Set To Extend Gains For A Third Consecutive Week - OilPrice.com", "description": "Oil prices are on course for a third consecutive weekly climb after OPEC sent prices soaring this week, although demand concerns are growing.", "url": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Set-To-Extend-Gains-For-A-Third-Consecutive-Week.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2023-04-07_1a9kb4d7os.jpg", "publishedAt": "2023-04-07T05:32:55Z", "content": "Emerging markets are investing in…\r\nDespite recent scandals and scrutiny,…\r\nOil prices soared on Monday…\r\nBy Irina Slav - Apr 07, 2023, 12:32 AM CDTCrude oil prices are about to post a third weekly g… [+1958 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Business Desk", "title": "India, China to account for half of global economic growth this year: IMF - India Today", "description": "The IMF has said that the world economy is projected to grow at less than 3% in 2023 and China and India would account for half of the global economic growth this year.", "url": "https://www.indiatoday.in/business/story/imf-india-china-global-growth-economy-2356849-2023-04-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/imf_symbol-sixteen_nine.jpg?VersionId=EWFhcGm6AH1QmXA_ny8HevM1Ht2f20Qt", "publishedAt": "2023-04-07T05:18:35Z", "content": "By India Today Business Desk: India and China are expected to account for half of the global economic growth this year, International Monetary Fund (IMF) managing director Kristalina Georgieva said o… [+2072 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Gold and silver prices on April 7: Check rates in your city today - Hindustan Times", "description": "In India, gold prices are determined on several factors including global demand, interest rates, currency and government policies.", "url": "https://www.hindustantimes.com/business/gold-and-silver-prices-on-april-7-check-rates-in-your-city-today-101680837238720.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/07/1600x900/gold_1680837246657_1680837246863_1680837246863.png", "publishedAt": "2023-04-07T04:58:27Z", "content": "The gold rates witnessed a slight decrease by 35 from Thursday. According to the Goodreturns website, the price of 22 carat gold stood at 5,590 per gram. In India, gold prices are determined on sever… [+2145 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "HDFC Bank, Indian Hotels among 6 stock picks from Motilal Oswal's model portfolio - Promising Plays - Economic Times", "description": "The correction and breather in markets, especially broader markets, has thrown up interesting opportunities and made the risk-reward relatively more favourable, according to Motilal Oswal. The brokerage has made a series of changes to its mode portfolio. Here…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-indian-hotels-among-6-stock-picks-from-motilal-oswals-model-portfolio/promising-plays/slideshow/99312898.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99312898,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-07T04:49:00Z", "content": "07 Apr 2023, 10:19 AM IST\r\nThe correction and breather in markets, especially broader markets, has thrown up interesting opportunities and made the risk-reward relatively more favourable, according t… [+1663 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "ETMarkets Smart Talk: FY24 a good opportunity to invest and accumulate businesses that pass the Darwin tes - Economic Times", "description": "The headline indices have experienced a not-so-tepid correction in valuations, with the small and midcap indices valuations suffering the most.The correction in valuations presents a good opportunity to invest and accumulate businesses that pass the Darwin te…", "url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-smart-talk-fy24-a-good-opportunity-to-invest-and-accumulate-businesses-that-pass-the-darwin-test-says-jayesh-faria/articleshow/99312649.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99312724,width-1070,height-580,imgsize-686452,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-07T04:37:00Z", "content": "The correction in valuations presents a good opportunity to invest and accumulate businesses that pass the Darwin test - survived and thrived over time and have significant MOATs, says Jayesh Faria, … [+6430 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dogecoin Falls 9% After Twitter Drops Doge Meme From Home Button - NDTV", "description": "Dogecoin fell as much as 9% as some Twitter users began to see their home buttons on the social media platform revert back to its iconic blue-bird logo after a few days of being replaced by the dog meme associated with the cryptocurrency.", "url": "https://www.ndtv.com/world-news/dogecoin-falls-9-after-twitter-drops-doge-meme-from-home-button-3928003", "urlToImage": "https://c.ndtvimg.com/2022-01/2t2kfmk8_dogecoin_625x300_14_January_22.jpg", "publishedAt": "2023-04-07T04:08:53Z", "content": "Twitter owner Elon Musk has long been a supporter of Dogecoin.\r\nDogecoin fell as much as 9% as some Twitter users began to see their home buttons on the social media platform revert back to its iconi… [+710 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today News Desk", "title": "More Indians on Forbes 2023 billionaires list, 16 debut, oldest is 99-year-old - India Today", "description": "The 2023 Forbes billionaires list features 169 Indians, up from 166 last year. You might know who is India's wealthiest person, but do you know who is the oldest and the youngest Indian billionaires? Also, find out the three women who debuted on the list and …", "url": "https://www.indiatoday.in/india/story/forbes-india-billionaires-list-2356538-2023-04-07", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/gautam_adani_and_mukesh_ambani-sixteen_nine.jpg?VersionId=cNLvFWukW73cfSrFi9PNxe7qqMDUQwl8", "publishedAt": "2023-04-07T03:56:05Z", "content": "By India Today News Desk: Forbes on Tuesday released its annual world billionaires list for 2023, in which the number of Indians mentioned in the list has hit a record high. There are 169 Indians on … [+5791 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Kanishka Sarkar", "title": "Twitter Verified unfollows all accounts amid chaos over blue ticks - CNBCTV18", "description": "Twitter Verified has unfollowed all accounts as of April 7 while confusion over Twitter not revoking the legacy verified blue tick from most accounts that have not paid for subscribing 'Twitter Blue' service prevails.", "url": "https://www.cnbctv18.com/technology/twitter-verified-unfollows-all-accounts-amid-chaos-over-blue-ticks-16355561.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2023/04/twitter-verified.png", "publishedAt": "2023-04-07T03:44:00Z", "content": "Next Article\r\nReal money games that involve wagering on the outcome is a no-go area for Indian internet, says Rajeev Chandrasekhar"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Delhi Beer Lovers `Missing Favourite Brands`, No Refrigeration Facility At Vends - Zee News", "description": "Summers are approaching and beer lovers are on the lookout for chilled bottles of their favourite brands. But most liquor vends in the city seem to be turning them back empty-handed. Even as consumers in different parts of the city raised the issues at the ve…", "url": "https://zeenews.india.com/india/delhi-beer-lovers-missing-favourite-brands-no-refrigeration-facility-at-vends-2592211.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/04/07/1179928-beer.png", "publishedAt": "2023-04-07T03:40:21Z", "content": "New Delhi: Summers are approaching and beer lovers are on the lookout for chilled bottles of their favourite brands. But most liquor vends in the city seem to be turning them back empty-handed. Even … [+2958 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Avalon Technologies IPO: What GMP signals about the public issue? | Mint - Mint", "description": "Avalon Technologies IPO got fully subscribed on strong response by QIB investors", "url": "https://www.livemint.com/market/ipo/avalon-technologies-ipo-what-gmp-signals-about-the-public-issue-11680837808639.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/07/600x338/Avalon_Technologies_IPO_GMP_1680837954530_1680837978963_1680837978963.jpg", "publishedAt": "2023-04-07T03:30:14Z", "content": "Avalon Technologies IPO: Subscription for the initial public offering (IPO) of Avalon Technologies Limited ended yesterday and the IPO received strong response by QIB investors on last date of biddin… [+492 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Jaguar Land Rover posts Q4 free cash flow about $1 billion - Moneycontrol", "description": "Tata Motors, which acquired the British car maker in 2008, had set a target of 1 billion pounds of free cash flow for the fiscal year.", "url": "https://www.moneycontrol.com/news/world/international-results/jaguar-land-rover-posts-q4-free-cash-flow-about-1-billion-10376381.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Jaguar-Land-Rover-770x433.jpg", "publishedAt": "2023-04-07T03:02:59Z", "content": "Jaguar Land Rover expects free cash flow of over 800 million pounds (about $1 billion) for the fourth quarter, boosted by a 24% rise in wholesale volumes as chip and other supply constraints eased, t… [+1030 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Kia Sonet Facelift Spotted Testing For The First Time - All Changes - GaadiWaadi.com", "description": "Kia Sonet Facelift will more likely be revealed towards the end of this year before going on sale in markets like India in early 2024", "url": "https://gaadiwaadi.com/kia-sonet-facelift-spotted-testing-for-the-first-time-all-changes/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/04/Kia-Sonet-Facelift-Spotted-2024-2.jpg", "publishedAt": "2023-04-07T02:30:13Z", "content": "Kia India has the Sonet as one of its top-selling models in India. The compact SUV competes against Tata Nexon, Maruti Suzuki Brezza, Hyundai Venue, Mahindra XUV300, Nissan Magnite and Renault Kiger … [+1840 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Forex kitty back at $600bn, NRIs remit $107bn in FY23 - Indiatimes.com", "description": "India Business News: MUMBAI: The country's foreign exchange reserves have again crossed the $600-billion mark with the exchange rate stabilising and record remittance flow.", "url": "https://timesofindia.indiatimes.com/business/india-business/forex-kitty-back-at-600bn-nris-remit-107bn-in-fy23/articleshow/99309937.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99309956,width-1070,height-580,imgsize-858151,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-04-07T02:17:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Smriti Jain", "title": "New vs old income tax regime: Time to decide is now - watch quick guide - Times of India", "description": "India Business News: New tax regime vs old regime 2023-24: The time to decide on the new versus old income tax regime is now. Watch the video for your quick 10-minute comp", "url": "https://timesofindia.indiatimes.com/business/india-business/new-income-tax-regime-vs-old-tax-regime-explained-income-tax-slabs-2023-24-watch-video/articleshow/99309879.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99309883,width-1070,height-580,imgsize-45080,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-04-07T02:14:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Utkarsh Deshmukh", "title": "Maruti Suzuki Fronx: Mileage figures for petrol and turbo petrol engines revealed ahead of official launch - CarToq.com", "description": "The launch of Maruti Suzuki India Limited’s newest crossover, the Fronx, is just around the corner. However, even before its official debut, some important specifications of the car have been leaked online. The spec sheet of the new Fronx reveals that the car…", "url": "https://www.cartoq.com/maruti-suzuki-fronx-mileage-figures-for-petrol-and-turbo-petrol-engines-revealed-ahead-of-official-launch/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/04/maruti-fronx-mileage-fb.jpg", "publishedAt": "2023-04-07T02:05:43Z", "content": "The launch of Maruti Suzuki India Limited’s newest crossover, the Fronx, is just around the corner. However, even before its official debut, some important specifications of the car have been leaked … [+3150 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "ZeeBiz WebTeam", "title": "Good Friday holiday: NSE, BSE to remain shut today; heres what else is unavailable - Zee Business", "description": "Good Friday holiday, stock market holidays: Indian equity, bond and commodity markets will remain shut on April 7 for Good Friday. Trading on stock exchanges NSE and BSE will resume on Monday, April 10. Heres a list of 10 additional holidays after Good Friday…", "url": "https://www.zeebiz.com/markets/stocks/news-good-friday-holiday-os-nse-bse-open-closed-today-stock-market-2023-april-7-mcx-trading-holiday-229670", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2023/04/07/235728-good-friday-stock-market-is-nse-bse-closed-tomorrow.jpg", "publishedAt": "2023-04-07T02:04:33Z", "content": "Good Friday holiday, Stock market holidays: Indian stock, bond and commodity markets will remain shut on April 7 on account of Good Friday. Trading on stock exchanges BSE and NSE, commodity exchanges… [+3784 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Here are the top stocks ideas by KRChoksey for April 2023 - Moneycontrol", "description": "HDFC Bank, Asian Paints, CreditAccess Grameen, Rossari Biotech, Tata Consumer Products and Godrej Consumer Products are among the top ideas for April 2023.", "url": "https://www.moneycontrol.com/news/photos/business/stocks/here-are-the-top-stocks-ideas-by-krchoksey-for-april-2023-10366111.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/stocks_sensex_nifty_stock-1-770x433.jpg", "publishedAt": "2023-04-07T01:54:46Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "RBI allows banks to offer pre-approved credit on UPI - Indiatimes.com", "description": "India Business News: MUMBAI: In a move that will expand the consumer credit market in India, the RBI has permitted banks to transfer pre-sanctioned credit lines through th.", "url": "https://timesofindia.indiatimes.com/business/india-business/rbi-allows-banks-to-offer-pre-approved-credit-on-upi/articleshow/99309703.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99309757,width-1070,height-580,imgsize-1992370,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-04-07T01:54:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "Apple Stores to showcase a new retail experience to Indian customers, hoping to make the right ‘connections’ - The Indian Express", "description": "With Apple opening its first retail store in Mumbai later this month, followed by another store in Delhi, the world's most valuable tech company is digging deeper into the Indian market.", "url": "https://indianexpress.com/article/technology/apple-stores-to-showcase-a-new-retail-experience-to-indian-customers-hoping-to-make-the-right-connections-8543066/", "urlToImage": "https://images.indianexpress.com/2023/04/Apple-Store-Mumbai-India-.jpg", "publishedAt": "2023-04-07T01:22:36Z", "content": "As soon as you enter the flagship Apple Store at Dubai Mall, you get drawn into the vastness of the space. This is less of a retail store and more of a town square, a place where you hang out, gain k… [+6189 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Digbijay Mishra and Deborshi Chaki", "title": "Byju’s lenders seek $200 million prepayment over restructuring $1.2 billion loan - The Economic Times", "description": "Edtech company yet to agree to the clause; lenders also want fortnightly updates on firms cash position. Byjus holds $650 million in overseas accounts and about Rs 1,500 crore in liquid funds in India", "url": "https://economictimes.indiatimes.com/tech/startups/byjus-lenders-seek-200-million-prepayment-over-restructuring-1-2b-term-loan-b/articleshow/99303593.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99305120,width-1070,height-580,imgsize-1033533,overlay-ettech/photo.jpg", "publishedAt": "2023-04-07T00:41:00Z", "content": "Byjus lenders have sought up to $200 million (about Rs 1,600 crore) in prepayment along with a higher rate of interest from the Bengaluru-headquartered company as a precondition to restructure its $1… [+5402 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sagar Malviya", "title": "Godrej Consumer invests Rs 100 crore in startup fund - The Economic Times", "description": "Spring is helmed by founders Raja Ganapathy, Arun Iyer and Vineet Gupta. Its first fund of ₹150 crore continues to invest in companies at Series-A level and beyond. GCPL's move is similar to that of its rivals, including Wipro, Unilever and Nestle, which have…", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/godrej-consumer-invests-rs-100-crore-in-startup-fund/articleshow/99305916.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99306008,width-1070,height-580,imgsize-62154,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-06T19:15:10Z", "content": "Godrej Consumer Products (GCPL) will invest 100 crore to anchor Early Spring, an early-stage fund being set up by Spring Marketing Capital, a top executive said. The new fund, with a corpus of 300 cr… [+1904 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bhaskar Dutta", "title": "Central banks warming up to rupee: Deputy Governer - The Economic Times", "description": "The RBI took the steps to support the strengthening interest of the global trading community in rupee transactions. The measures were announced at a time when the rupee was witnessing enhanced volatility due to aggressive rate hikes in the US and risk-aversio…", "url": "https://economictimes.indiatimes.com/news/economy/policy/central-banks-warming-up-to-rupee-deputy-governer/articleshow/99305848.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99305859,width-1070,height-580,imgsize-17864,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-06T18:56:03Z", "content": "Steps taken by the Reserve Bank of India (RBI) since July 2022 to further internationalise the rupee have not yet resulted in large trading volumes but interest from global central banks has picked u… [+2482 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "NSE, BSE to move Adani Green to long term additional surveillance 1st stage - Business Standard", "description": "Leading bourses NSE and BSE on Thursday said Adani Green Energy will be moved to the first stage of the long term additional surveillance measure framework from April 10.", "url": "https://www.business-standard.com/markets/news/nse-bse-to-move-adani-green-to-long-term-additional-surveillance-1st-stage-123040601140_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-03/28/full/1680014395-2.jpg", "publishedAt": "2023-04-06T16:28:05Z", "content": "Leading bourses NSE and BSE on Thursday said Adani Green Energy will be moved to the first stage of the long term additional surveillance measure framework from April 10.\r\nOn March 28, both the excha… [+1179 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Madeeha Mujawar", "title": "Air India lists achievements 14 months after Tatas took over - CNBCTV18", "description": "Air India has concluded the first phase of its transformation plan under the Vihaan.AI mission that was launched last September. The airline has listed its achievements in the last seven months across the board and what it aims to achieve in the second phase …", "url": "https://www.cnbctv18.com/aviation/air-india-lists-achievements-in-14-months-after-tatas-took-over-16354061.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/11/Air-India-.jpg", "publishedAt": "2023-04-06T15:33:30Z", "content": "MiniAir India has concluded the first phase of its transformation plan under the Vihaan.AI mission that was launched last September. The airline has listed its achievements in the last seven months a… [+75 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kailash Babar", "title": "Birla Estates acquires 5.76 acres in Pune, plans 1.5-million-sq-ft residential development - Economic Times", "description": "The company plans to develop a premium residential project on the land parcel purchased from Sudarshan Chemical Industries Ltd (SCIL). It has a total development potential of over 1.5 million sq ft and an estimated revenue potential of around Rs. 2,500 crores.", "url": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/birla-estates-acquires-5-76-acres-in-pune-plans-1-5-million-sq-ft-residential-development/articleshow/99302784.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99302759,width-1070,height-580,imgsize-20428,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-06T15:01:00Z", "content": "Birla Estates, the real estate arm of the Aditya Birla Group housed under Century Textiles and Industries, has entered the Pune residential real estate market by acquiring 5.76 acres of land in Sanga… [+1585 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "RBI imposes penalty on Mahindra Financial Services, Indian Bank for non-compliance with norms | Mint - Mint", "description": "The RBI said the penalties are based on deficiencies in regulatory compliance and are not intended to pronounce upon the validity of any transaction or agreement entered into by them with customers", "url": "https://www.livemint.com/news/india/rbi-imposes-penalty-on-mahindra-mahindra-financial-services-indian-bank-11680791641831.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/06/600x338/2-0-523095796-DSC-0840-0_1680760314489_1680791657147_1680791657147.jpg", "publishedAt": "2023-04-06T14:35:22Z", "content": "The Reserve Bank of India has imposed a fine of 6.77 crore on Mahindra &amp; Mahindra Financial Services Ltd, Mumbai for not disclosing interest rates to borrowers at the time of sanctioning loans, a… [+1574 chars]"}, {"source": {"id": null, "name": "Dsij.in"}, "author": "Praveenkumar Yadav", "title": "Multibagger stock under Rs 100: This government enterprise emerged as the lowest bidder for a project worth Rs 378.16 crore from Mumbai Metro! - Dalal Street Investment Journal", "description": "The stock has gained over 100 per cent in the last one year.", "url": "https://www.dsij.in/dsijarticledetail/multibagger-stock-under-rs-100-this-government-enterprise-emerged-as-the-lowest-bidder-for-a-project-worth-rs-37816-crore-from-mumbai-metro-29673", "urlToImage": "https://www.dsij.in/Portals/0/EasyDNNnews/29673/image_351.jpg", "publishedAt": "2023-04-06T14:33:54Z", "content": "The stock has gained over 100 per cent in the last one year. \r\nOn April 06, 2023, Rail Vikas Nigam Limited informed in the exchange filing that it has emerged as the Lowest Bidder (L1) for the design… [+1227 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Inflation in India seen easing in March on softening food price rises - Economic Times", "description": "Food inflation, which accounts for nearly half of the overall consumer price basket, is expected to have moderated due to falling vegetable prices, offset in part by surging cereal prices.", "url": "https://economictimes.indiatimes.com/news/economy/indicators/inflation-in-india-seen-easing-in-march-on-softening-food-price-rises/articleshow/99301634.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99301674,width-1070,height-580,imgsize-66194,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-06T13:55:00Z", "content": "India's consumer inflation likely eased in March to 5.80% thanks to softer food price rises, dipping below the Reserve Bank of India's upper tolerance limit for the first time this year, a Reuters po… [+1678 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "Mukesh Ambani secures biggest loan in Indias corporate history at $5 billion, as banks line up to fund - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/business/mukesh-ambani-secures-biggest-loan-in-indias-corporate-history-at-5-billion-as-banks-line-up-to-fund-reliance", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2020-11/9da9f097-b436-4664-a3dd-6358f56e70a6/mukesh_ambani_fpj.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-04-06T12:53:00Z", "content": "In 2020, India's oil to telecom behemoth Reliance Industries led by Mukesh Ambani, announced that it had become net-debt free after raising Rs 1.68 lakh crore via rights issue and investments. Major … [+1486 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Sourabh Jain", "title": "Tata Motors overtakes Hyundai as India's second largest car maker in March - Business Insider India", "description": "Tata Motors sold more passenger vehicles in March than Hyundai, making it the second largest car maker during the month.", "url": "https://www.businessinsider.in/business/auto/news/tata-motors-overtakes-hyundai-as-indias-second-largest-car-maker-in-march/slidelist/99300135.cms", "urlToImage": "https://www.businessinsider.in/thumb/msid-99300135,width-900,height-1200,resizemode-4/business/auto/news/tata-motors-overtakes-hyundai-as-indias-second-largest-car-maker-in-march.jpg", "publishedAt": "2023-04-06T12:52:14Z", "content": "Two Tata cars emerged in the top ten in terms of sales volume in March the Nexon at 14,769 units, and the Punch at 10,894 units. Only one Hyundai car, the Creta, was in the top ten, with 14,026 units… [+22 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Abakkus Asset Management's Top Sectoral Bets: Real Estate & More | Editors' Roundtable | CNBC-TV18 - CNBC-TV18", "description": "Sunil Singhania, Founder, Abakkus Asset Management shares his top sectoral bets like real estate and more. Listen in.#sunilsinghania #abakkusassetmanagement ...", "url": "https://www.youtube.com/watch?v=zGYiIRar4_I", "urlToImage": "https://i.ytimg.com/vi/zGYiIRar4_I/maxresdefault.jpg", "publishedAt": "2023-04-06T12:40:05Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Market gains for 5th day in row as RBI pauses; Bajaj twins, Tata Motors top gainers | Mint - Mint", "description": "Broadly, the tone of the market was bullish with midcaps and small-caps outperforming on Thursday after RBI paused repo rate hike in an unexpected move. Sensex and Nifty 50 rallied for the fifth day in a row.", "url": "https://www.livemint.com/market/stock-market-news/market-gains-for-5th-day-in-row-as-rbi-pauses-bajaj-twins-tata-motors-top-gainers-11680780392303.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/06/600x338/2-0-807309723-bse1-0_1679570031621_1680781198456_1680781198456.jpg", "publishedAt": "2023-04-06T11:41:58Z", "content": "Markets applauded RBI on Thursday for pausing the rate hike cycle in an unexpected move. Sensex moved closer to the 60,000 mark and Nifty 50 crossed over 17,600 levels. This would be the fifth rally … [+4200 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sahil Kukreja", "title": "Kia Carens Luxury (O) launched at Rs 17 lakh: Here's what's new - Indiatimes.com", "description": "Cars News: Kia has introduced a brand new variant for the Carens in India in the form of Luxury (O), which sits between Luxury and Luxury Plus variants.", "url": "https://timesofindia.indiatimes.com/auto/cars/kia-carens-luxury-o-launched-at-rs-17-lakh-heres-whats-new/articleshow/99294565.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99295243,width-1070,height-580,imgsize-1045593,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-04-06T10:51:00Z", "content": "New Hyundai Verna: Taking the fight to Virtus, Slavia and City | TOI Auto"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Team GaadiWaadi", "title": "Maruti Suzuki April 2023 Discounts - Alto, Swift, Dzire, WagonR - GaadiWaadi.com", "description": "Maruti Suzuki is offering discounts of up to Rs. 59,000 on its select Arena models in April 2023 in the domestic market", "url": "https://gaadiwaadi.com/maruti-suzuki-april-2023-discounts-alto-swift-dzire-wagonr/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/04/maruti-suzuki-alto-k10.jpg", "publishedAt": "2023-04-06T10:43:24Z", "content": "Maruti Suzuki India Limited (MSIL) is well-known for offering discounts throughout the year. April 2023 is no different and the company is continuing with its streak of discount offers on its select … [+2331 chars]"}, {"source": {"id": null, "name": "CoinDesk"}, "author": "Amitoj Singh", "title": "India Targeting One Million CBDC Users in Three Months, Prioritizing Offline Transfers: Sources - CoinDesk", "description": "Around 100,000 users have participated in the country's central bank digital currency pilot since it kicked off in December.", "url": "https://www.coindesk.com/policy/2023/04/06/india-targeting-one-million-cbdc-users-in-three-months-prioritizing-offline-transfers-sources/", "urlToImage": "https://www.coindesk.com/resizer/ByD-D6RoIuA_WnSg45OdU1gOcDk=/1200x628/center/middle/cloudfront-us-east-1.images.arcpublishing.com/coindesk/EFOM6PSTJRAINH3JZRKSP5VGFM.jpg", "publishedAt": "2023-04-06T10:25:00Z", "content": "India's retail central bank digital currency (CBDC-R) architects are aiming to scale the user base of the digital rupee to one million users, and have prioritized solving the challenge of creating an… [+2567 chars]"}, {"source": {"id": null, "name": "Entrackr"}, "author": "Harsh Upadhyay", "title": "Curefoods raises Rs 300 Cr led by Binny Bansal's Three State Ventures - Entrackr", "description": "Cloud kitchen brand Curefoods has raised Rs 300 crore in an equity and debt round led by Binny Bansal’s fund Three State Ventures.", "url": "https://entrackr.com/2023/04/curefoods-raises-rs-300-cr-led-by-binny-bansals-three-state-capital/", "urlToImage": "https://entrackr.com/storage/2022/06/Curefoods.jpg", "publishedAt": "2023-04-06T07:09:36Z", "content": null}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Harley-Davidson launches its 2023 range in India - Team-BHP", "description": "Harley-Davidson has launched its 2023 model line-up in India. As reported earlier, the American bike maker has also introduced the 120th Anniversary editions of the Softail and Touring models. The new Sportster range, which includes the Nightster, Nightster S…", "url": "https://www.team-bhp.com/news/harley-davidson-launches-its-2023-range-india", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/HD 2.JPG", "publishedAt": "2023-04-06T07:02:59Z", "content": "Harley-Davidson has launched its 2023 model line-up in India. As reported earlier, the American bike maker has also introduced the 120th Anniversary editions of the Softail and Touring models.\r\nThe n… [+1229 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "Dunzo lays off 30% of its workforce while securing $75 million funding: Reports | Mint - Mint", "description": "The layoff plan is aimed at helping Dunzo turn a profit before its planned IPO.", "url": "https://www.livemint.com/news/india/dunzo-lays-off-30-of-its-workforce-while-securing-75-million-funding-reports-11680760637457.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/06/600x338/Dunzo-had-last-raised--240-million-in-January-_1680760752267_1680760752500_1680760752500.jpg", "publishedAt": "2023-04-06T06:04:23Z", "content": "Dunzo has announced that it will cut its workforce by 30%, resulting in almost 300 layoffs. The grocery delivery platform has also secured funding worth $75 million, with Google and Reliance Industri… [+2159 chars]"}, {"source": {"id": null, "name": "Autocarindia.com"}, "author": "Rishabh Bhaskar", "title": "KTM 390 Adventure, 250 Adventure with low seat height, lowered suspension coming soon - Autocar India", "description": "A KTM 390 Adventure with wire-spoke wheels is also expected soon.", "url": "https://www.autocarindia.com/bike-news/ktm-390-adventure-250-adventure-with-low-seat-height-lowered-suspension-coming-soon-427779", "urlToImage": "https://cdni.autocarindia.com/ExtraImages/20230406120329_KTM lowered 390_250_5_.jpg", "publishedAt": "2023-04-06T06:01:00Z", "content": "A KTM 390 Adventure with wire-spoke wheels is also expected soon. One of the biggest deterrents that some prospective customers of the KTM 390 Adventure and 250 Adventure face is the 855mm seat heigh… [+1979 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Cholamandalam Finance hits 52-week high on robust Q4 updates - Moneycontrol", "description": "The stock has clocked in around 12 percent gains within the past week.", "url": "https://www.moneycontrol.com/news/business/markets/cholamandalam-finance-hits-52-week-high-on-robust-q4-updates-10371341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/Cholamandalam-Investment-770x433.jpg", "publishedAt": "2023-04-06T05:28:07Z", "content": "Shares of Cholamandalam Finance and Investment Company edged up over 7 percent in early trade on April 6 and tested its highest level in 52-weeks after the company recorded strong loan growth in the … [+1880 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Vedanta trades ex-dividend today, stock slumps 6% - Moneycontrol", "description": "The total interim dividend announced by the company during the last fiscal year amounted to Rs 101.50.", "url": "https://www.moneycontrol.com/news/business/markets/vedanta-trades-ex-dividend-today-stock-slumps-6-10370951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/Vedanta_-770x433.jpg", "publishedAt": "2023-04-06T04:31:17Z", "content": "Shares of Vedanta slumped percent on April 6 as the stock traded ex-dividend today. At 9:45 am, shares of the mining major were trading 5.5 percent lower at Rs 270.65 on the NSE.\r\nIn an exchange fili… [+1048 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Nykaa share price dips 3% in early trade. Buy, hold or exit? | Mint - Mint", "description": "Nykaa share price today opened downside after sharp upside move in last two sessions", "url": "https://www.livemint.com/market/stock-market-news/nykaa-shares-down-2-75-in-early-trade-11680753515664.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/06/600x338/Nykaa_1679651625600_1680753523015_1680753523015.jpg", "publishedAt": "2023-04-06T04:20:37Z", "content": "Nykaa share price: Shares of FSN E-Commerce Ventures Ltd, which operates Nykaa, headed a slow start in early morning trade on Thursday. After gaining around 8 per cent on Wednesday, Nykaa share price… [+2079 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "After 24 years of service, Seshagiri Rao retires from JSW board | Mint - Mint", "description": "Seshagiri Rao possesses rich experience spanning over three decades in steel sector and in the areas of Corporate Finance and Banking.", "url": "https://www.livemint.com/news/india/seshagiri-rao-retires-from-jsw-board-after-more-than-25-years-of-service-11680751942186.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/06/600x338/JSW_1680752177924_1680752178214_1680752178214.jpg", "publishedAt": "2023-04-06T03:47:32Z", "content": "Seshagiri Rao, Joint Managing Director and Group CFO will step down from the board of JSW Group on superannuation after more than 25 years of service, JSW Steel informed the bourses in a regulatory f… [+2039 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Akash Podishetti", "title": "DMart Q4 Update: Revenue rises 20% YoY to Rs 10,337 cr; store count at 324 - The Economic Times", "description": "For the third quarter, Avenue Supermarts reported a 7% YoY rise in consolidated net profit at Rs 590 crore. Operating profit, calculated as earnings before interest, tax, depreciation and amortization (EBITDA), rose 11% year-on-year to Rs 965 crore during the…", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-q4-update-revenue-rises-20-yoy-to-rs-10337-cr-store-count-at-324/articleshow/99275107.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99275081,width-1070,height-580,imgsize-90472,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-05T15:12:00Z", "content": "Avenue Supermarts, which operates retail chain DMart, has reported Rs 10,337 crore standalone revenue for the fourth quarter ending March. This is an increase of 20%, compared with Rs 8,606 crore clo… [+1977 chars]"}]}