{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Coingape"}, "author": "Tanvi Singh", "title": "Breaking: Binance Buys The Dip, Adds 101,266 Bitcoin - CoinGape", "description": "Binance has brought around 101,266 bitcoins while the price of Bitcoin is hitting its low, this morning. The price of the world's largest cryptocurrency slumped down to its lowest price of the year. BTC down at $19k, more pain? On Saturday, the crypto market …", "url": "https://coingape.com/breaking-binance-buys-the-dip-adds-101266-bitcoin/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/04/18215226/Binance-3-e1650964025669.jpg", "publishedAt": "2022-06-19T11:58:19Z", "content": "Binance has brought around 101,266 bitcoins while the price of Bitcoin is hitting its low, this morning.\r\nThe price of the world’s largest cryptocurrency slumped down to its lowest price of the year.… [+1728 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "350cc Bikes May 2022 Sales - Bullet, Classic, Meteor, CB350 - GaadiWaadi.com", "description": "Royal Enfield Classic 350 posted a tally of 29,959 units against 9,239 units during the same period in 2021 with a YoY sales growth of 224.2%", "url": "https://gaadiwaadi.com/350cc-bikes-may-2022-sales-bullet-classic-meteor-cb350/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2021/09/2021-Royal-Enfield-Classic-350-Vs-Honda-Hness-Vs-RE-Meteor-350.jpg", "publishedAt": "2022-06-19T11:30:36Z", "content": "In the 350 cc middleweight motorcycle segment, Royal Enfield has long been the leader courtesy of the Classic 350. Last month was no different as the Classic 350 posted a cumulative domestic tally of… [+2264 chars]"}, {"source": {"id": null, "name": "VCCircle"}, "author": null, "title": "Softbank-backed Unacademy sacks 150 staff in second layoff drive - VCCircle", "description": "Edtech unicorn Unacademy has asked 150 employees to leave after a performance improvement plan.", "url": "https://www.vccircle.com/softbank-backed-unacademy-sacks-150-staff-in-second-layoff-drive", "urlToImage": "https://assets.vccircle.com/uploads/2021/11/educationpixabay.jpg", "publishedAt": "2022-06-19T11:18:55Z", "content": "Edtech unicorn Unacademy has asked 150 employees to leave after a performance improvement plan.\r\nThis comes after Unacademy, operated by Sorting Hat Technologies Pvt Ltd, laid off around 600 to 800 e… [+1897 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kalyan Parbat", "title": "Don’t allot 5G spectrum to system integrators, intermediaries: Telcos to DoT - Economic Times", "description": "Third parties intending to provide, install and operate captive private networks should be mandated to obtain airwaves through the same process as telcos—meaning via auctions—COAI said in a strongly-worded letter, dated June 18, to telecom secretary K Rajaram…", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/dont-allot-5g-spectrum-to-system-integrators-intermediaries-telcos-to-dot/articleshow/92317880.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92317868,width-1070,height-580,imgsize-17560,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-19T11:09:00Z", "content": "The fight for 5G spectrum between telcos and tech companies is getting bitter by the day.\r\nJust days after the Cabinet allowed direct spectrum allocation to enterprises for captive private networks, … [+5030 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Were Sorry, But We Can't Return Your Money Right Now: Crypto Market Talk - NDTV Profit", "description": "It was one of the most dramatic weeks in the short history of the cryptocurrency market, bookended by the type of announcements investors fear the most from a counterparty: Wer'e sorry, but we just cant return your money right now.", "url": "https://www.ndtv.com/business/were-sorry-but-we-cant-return-your-money-right-now-crypto-market-talk-3081101", "urlToImage": "https://c.ndtvimg.com/2022-06/tqg04308_bloomberg-image_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T10:56:04Z", "content": "Cryptos excruciating week has traders bracing for next crisis\r\nIt was one of the most dramatic weeks in the short history of the cryptocurrency market, bookended by the type of announcements investor… [+6610 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anirban Chowdhury", "title": "Air India to look at new airplanes under the Tatas, says Airbus CCO - Economic Times", "description": "The erstwhile govt-owned carrier is said to be considering an order for the European plane makers A350 widebodied planes. This would be its first aircraft order since 2006. It would also make it the first Indian airline to order the A350, which is fast gainin…", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-refurbishing-under-tatas-likely-to-place-order-for-airbus-a350-planes/articleshow/92317544.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92317565,width-1070,height-580,imgsize-82684,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-19T10:46:00Z", "content": "Air India is reorganising itself under the Tata group and will look at refurbishing its fleet with new aircraft, said a senior executive at Airbus on Sunday.\r\nThe erstwhile govt-owned carrier is said… [+1709 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Hyundai teases Stargazer as a Maruti Suzuki Ertiga rival, reflects premiumness - HT Auto", "description": "Hyundai Stargazer will challenge the Maruti Suzuki Ertiga and Toyota Innova Crysta as well.", "url": "https://auto.hindustantimes.com/auto/cars/hyundai-teases-stargazer-as-a-maruti-suzuki-ertiga-rival-reflects-premiumness-41655634004487.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/06/19/1600x900/Hyundai_Stargazer_1655634817114_1655634830356.jpg", "publishedAt": "2022-06-19T10:37:19Z", "content": "Hyundai has released its upcoming MPV Stargazer in its production form. The Maruti Suzuki Ertiga rivalling MPV is claimed to target the South East Asian market and comes as a spiritual successor to t… [+1886 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "RBI Cancels Licence of Millath Co-operative Bank On Inadequate Capital, Earning Prospects - News18", "description": "Every depositor will be entitled to receive deposit insurance claim amount of his/her deposits up to a monetary ceiling of Rs 5 lakh", "url": "https://www.news18.com/news/business/rbi-cancels-licence-of-millath-co-operative-bank-on-inadequate-capital-earning-prospects-5401237.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/rbi2-165466482316x9.jpg", "publishedAt": "2022-06-19T08:14:50Z", "content": "The Reserve Bank of India (RBI) has cancelled the licence of Millath Co-operative Bank Ltd as the bank does not have adequate capital and earning prospects, among other reasons. The bank has ceased t… [+2757 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Flight of FPIs continues; equities worth Rs 31,430 crore sold in June so far - Moneycontrol", "description": "Net outflow by Foreign Portfolio Investors (FPIs) from equities reached Rs 1.98 lakh crore so far in 2022, data with depositories showed.", "url": "https://www.moneycontrol.com/news/business/markets/flight-of-fpis-continues-equities-worth-rs-31430-crore-sold-in-june-so-far-8706841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/inr_rupee_indian-rupee-770x433.jpg", "publishedAt": "2022-06-19T07:46:28Z", "content": "Aggressive rate hike by the US Federal Reserve, coupled with elevated inflation and high valuation of equities continued to keep foreign investors at bay from the Indian stock market as they pulled o… [+3020 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Inflation notwithstanding, the top 1% is ordering Mercs and Lamborghinis - Economic Times", "description": "Merc expects record sales this year, while Volkswagen-owned Italian super-luxury car brand Lamborghini has almost sold out its entire 2022 allocation for India. BMW is eyeing double-digit growth and JLR, owned by the Tata Group, has reported record bookings f…", "url": "https://economictimes.indiatimes.com/industry/auto/cars-uvs/inflation-notwithstanding-the-top-1-is-ordering-mercs-and-lamborghinis/articleshow/92314612.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92314619,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-19T07:01:00Z", "content": "SynopsisMerc expects record sales this year, while Volkswagen-owned Italian super-luxury car brand Lamborghini has almost sold out its entire 2022 allocation for India. BMW is eyeing double-digit gro… [+88 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tanya Aneja", "title": "US bond yields, dollar & oil prices among key factors that may guide markets this week - Economic Times", "description": "The week saw US bond yields inverting, raising fears of a recession. The Fed also hiked the policy rate by 75 basis points and hinted at a similar rate hike in the next meeting.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-bond-yields-dollar-oil-prices-among-key-factors-that-may-guide-markets-this-week/articleshow/92314225.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92314330,width-1070,height-580,imgsize-41806,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-19T06:42:00Z", "content": "The BSE Sensex lost 2,943 points this past week, while the NSE Nifty50 closed at a sub-15,300 close in what was its worst weekly fall in two years, thanks to concerns over the US recession and tighte… [+4526 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Global trends, foreign fund movement, oil prices to guide markets this week: Analysts - Moneycontrol", "description": "Past week, the Sensex plunged 2,943.02 points or 5.42 per cent, while the Nifty declined 908.30 points or 5.61 per cent.", "url": "https://www.moneycontrol.com/news/business/markets/global-trends-foreign-fund-movement-oil-prices-to-guide-markets-this-week-analysts-8706461.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/fandosensexniftyderivative-2-770x433.jpg", "publishedAt": "2022-06-19T06:03:44Z", "content": "The equity markets focus is expected to shift to global trends in the absence of any major domestic event scheduled this week, while investors are likely to continue to keep a tab on foreign fund mov… [+1532 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Bonus issues: These 5 stocks will see corporate action this week - Economic Times", "description": "Shares of Baid Leasing will turn ex-bonus on Monday, and the record date for the same is Tuesday. The company had announced a bonus issue of 1:1 on May 4. The same company had announced a stock split from face value of Rs 10 to Rs 2 in April.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/bonus-issues-these-5-stocks-will-see-corporate-action-this-week/articleshow/92313587.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92313712,width-1070,height-580,imgsize-54368,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-19T05:56:00Z", "content": "A handful of listed companies have record dates for bonus issues this week. A record date is the date on which the company checks its records to identify the shareholders.\r\nShares of \r\n will turn ex-… [+856 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "Ola Electric CEO Bhavish Aggarwal shares preview of Futurefactory | Mint - Mint", "description": "In an earlier tweet, Ola Electric CEO Bhavish Aggarwal mentioned that the company had plans to invite its S1 customers to a factory visit on June 19 at the Ola Futurefactory in Tamil Nadu.", "url": "https://www.livemint.com/news/india/ola-electric-ceo-bhavish-aggarwal-shares-preview-of-futurefactory-11655617292424.html", "urlToImage": "https://images.livemint.com/img/2022/06/19/600x338/OLA-ELECTRIC-FIRE-2_1655617406666_1655617422060.JPG", "publishedAt": "2022-06-19T05:46:54Z", "content": "All customers who purchased the S1 electric scooter will be invited to visit Ola Electric's facility - Ola Futurefactory. According to Ola Electric CEO Bhavish Aggarwal, the guest list might reach 50… [+2242 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Losses Worth More Than Reliance's Valuation, Indian Stocks Will... - NDTV Profit", "description": "After plunging to over a year low, marking the worst week since the pandemic hit in May 2020, the bearish trend in Indian equities is far from over, and that slide will likely continue in the week ahead.", "url": "https://www.ndtv.com/business/after-losses-worth-more-than-reliances-valuation-indian-stocks-will-3080408", "urlToImage": "https://c.ndtvimg.com/2022-06/58b7pb6_image_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T05:35:40Z", "content": "Bearish global trend in equity far from over, likely to continue in the week ahead\r\nAfter plunging to over a year low, marking the worst week since the pandemic hit in May 2020, the bearish trend in … [+4687 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "TCS, Infosys Work From Home: How Will Hybrid Model Work? Things Employees Should Know - News18", "description": "TCS, Infosys and HCL have already announced plans for hybrid model of working; though IT firms are encouraging employees to join offices physically, the staff is largely working remotely", "url": "https://www.news18.com/news/business/tcs-infosys-work-from-home-how-will-hybrid-model-work-things-employees-should-know-5400601.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/wfh-165027662116x9.jpg", "publishedAt": "2022-06-19T05:03:00Z", "content": "Even as the coronavirus cases are increasing in the country, there is a renewed interest among employees in knowing their companies plans on work from home. Tata Consultancy Services, Infosys and HCL… [+3699 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pawan Nahar", "title": "Sustainable recovery unlikely; short these five stocks are current levels: Ravi Singh, ShareIndia - Economic Times", "description": "The increase in US rates also raises a major possibility that apart from the equity market, other markets like debt and bond markets may also see some FIIs outflow anytime soon in India, said Ravi Singh, Vice President & Head of Research, ShareIndia.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sustainable-recovery-unlikely-short-these-five-stocks-are-current-levels-ravi-singh-shareindia/articleshow/92312973.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92313006,width-1070,height-580,imgsize-114632,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-19T05:01:00Z", "content": "The BSE Sensex lost about 3,000 points to close at 51,360, whereas the Nifty50 index plunged close to 990 points to settle below the 15,300 mark during the week. Both indices are a little shy of ente… [+3225 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Cryptocurrency Prices Today June 19: Crypto market bleeds as bitcoin drops further, Ether biggest drag - Moneycontrol", "description": "Bitcoin hovered around Rs 16.12 lakh, with a dominance of 42.91 per cent. This was a 1.04 per cent decrease over the day, data from CoinMarketCap shows.", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/cryptocurrency-prices-today-june-19-crypto-market-bleeds-as-bitcoin-drops-further-ether-biggest-drag-8706141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Bitcoin-770x433.jpg", "publishedAt": "2022-06-19T04:18:36Z", "content": "Bitcoin hovered around Rs 16.12 lakh, with a dominance of 42.91 percent. This was a 1.04 percent decrease over the day, data from CoinMarketCap shows.\r\nEthereum was the biggest loser as it fell over … [+486 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Rohit", "title": "7 Interesting Details Of The New Hyundai Venue You Need To Know - CarDekho", "description": "The SUV gets cosmetic and feature upgrades but carries on with the same engines from the pre-facelift version  Hyundai has launched the facelifted Venue in India. With the mid-life update, the sub-compact SUV has gotten a bunch of changes over its previous it…", "url": "https://www.cardekho.com/india-car-news/7-interesting-details-of-the-new-hyundai-venue-you-need-to-know-29248.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29247/1655546805705/NThingsYouShouldKnow.jpg", "publishedAt": "2022-06-19T04:00:00Z", "content": "The SUV gets cosmetic and feature upgrades but carries on with the same engines from the pre-facelift version\r\nHyundai has launched the facelifted Venue in India. With the mid-life update, the sub-co… [+3346 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | These four stocks may double earnings over 3-4 years, says Anil Rego of Right Horizons - Moneycontrol", "description": "The renewable industry is expected to grow 4X in size by 2030 to 450-500 GW. We prefer solar on the renewables side and would like to wait for further valuation cool down in fossil fuel-based power companies.", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-these-four-stocks-may-double-earnings-over-3-4-years-says-anil-rego-of-right-horizons-8705801.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/AnilRego-770x433.jpg", "publishedAt": "2022-06-19T03:29:58Z", "content": "Whenever the Nifty price-to-earnings (P/E) ratio has gone below 20, it yielded higher returns in the following three years. The probability is higher this time around, thanks to sound policies nurtur… [+4190 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "4 new Maruti SUVs launching soon in India: 2022 Brezza to Jimny - CarToq.com", "description": "It is a big year for Maruti Suzuki. They have already launched some of their new vehicles and now it is time for them to start launching the new SUVs. SUVs have become an important part of the portfolio of an automobile manufacturers. This is because right no…", "url": "https://www.cartoq.com/4-new-maruti-suvs-launching-soon-india-2022/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/baleno-cross-featured.jpg", "publishedAt": "2022-06-19T03:16:16Z", "content": "It is a big year for Maruti Suzuki. They have already launched some of their new vehicles and now it is time for them to start launching the new SUVs. SUVs have become an important part of the portfo… [+2801 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Dhanya Skariachan", "title": "Why MNCs are quitting India - Deccan Herald", "description": "Eight years after Prime Minister Narendra Modi first urged multinational companies to “Make in India”, Asia’s third-largest economy is seeing many foreign firms give up on the country. A slew of big names including German retailer Metro AG, Swiss building-mat…", "url": "https://www.deccanherald.com/business/business-news/why-mncs-are-quitting-india-1119422.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/06/19/ford-india-2-1-1119422-1655607415.jpg", "publishedAt": "2022-06-19T02:56:55Z", "content": "Eight years after Prime Minister Narendra Modi first urged multinational companies to Make in India, Asias third-largest economy is seeing many foreign firms give up on the country.\r\nA slew of big na… [+10142 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Top CNG cars to buy in India with best mileage: Maruti, Tata & more - IN PICS - Zee News", "description": "With rising petrol and diesel prices in India, more and more buyers are looking for alternative and cheaper options to power vehicles, CNG being the most reliable one. Here's a list of top CNG cars in India with best mileage.", "url": "https://zeenews.india.com/photos/business/top-cng-cars-to-buy-in-india-with-maximum-mileage-maruti-suzuki-tata-more-in-pics-2475440", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/19/1055435-maruti-suzuki-cng.jpg", "publishedAt": "2022-06-19T02:52:23Z", "content": "Mileage: 26.49 km/kg\r\nThe only other car apart from Maruti Suzuki and Hyundai on the list is one from Tata Motors. Tata recently ventured into the CNG segment of cars with the launch of the Tiago CNG… [+184 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Tarun", "title": "Top 9 Cars Set For Launch Between July & September 2022 - CarDekho", "description": "The list includes new SUVs, a french hatchback and some EVs  Many important launches are scheduled for the third quarter of 2022. We have two new entrants set for the compact SUV segment from Toyota and Maruti, while Citroen is prepping up the C3 for an entry…", "url": "https://www.cardekho.com/india-car-news/top-9-cars-set-for-launch-between-july-september-2022-29249.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29248/1655608756467/GeneralNews.jpg", "publishedAt": "2022-06-19T02:49:00Z", "content": "Many important launches are scheduled for the third quarter of 2022. We have two new entrants set for the compact SUV segment from Toyota and Maruti, while Citroen is prepping up the C3 for an entry … [+4314 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Petrol, Diesel Prices Drop After Excise Duty Cut; Know Fuel Prices in Your City - News18", "description": "Petrol price now stands at Rs 96.72 a litre in Delhi and Rs 111.35 per litre in Mumbai; diesel at Rs 89.62 a litre in Delhi and Rs 97.28 a litre in Mumbai", "url": "https://www.news18.com/news/business/petrol-diesel-prices-drop-after-excise-duty-cut-know-fuel-prices-in-your-city-5399293.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/petrol-diesel-165354620316x9.jpg", "publishedAt": "2022-06-19T02:41:00Z", "content": "Despite international crude oil hovering above $110 per barrels, the petrol and diesel prices at local pumps continue to remain unchanged for the 29th day. The price of petrol stood at Rs 96.72 per l… [+2873 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here Is Apple's First Store In The US With A Staff Union - NDTV", "description": "A majority of employees at a US Apple store have voted to form a union, a first for the tech giant, which has so far tried to discourage unionising attempts.", "url": "https://www.ndtv.com/world-news/staff-at-this-apple-store-have-voted-to-form-their-first-union-in-the-us-3080207", "urlToImage": "https://c.ndtvimg.com/2022-06/3so0o0f8_apple_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T02:22:27Z", "content": "Of the 110 employees at the Towson, Maryland shop, 65 voted in favor and 33 against\r\nSan Francisco: A majority of employees at a US Apple store have voted to form a union, a first for the tech giant,… [+2846 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Harshit Kohli", "title": "India's Russian coal imports jump 6-fold in 20 days; Gets 30% discount | Report - Hindustan Times", "description": "India’s oil purchases from Russia spiked in recent weeks as traders offered heavy discounts. According to a Reuters report, traders have been giving a 30% discount on oil after the West shunned Moscow. The report said that Indian buyers lapping up huge quanti…", "url": "https://www.hindustantimes.com/videos/news/indias-russian-coal-imports-jump-6-fold-in-20-days-gets-30-discount-report-101655603410574.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/19/1600x900/HT_Normal_Thumbnail_-_AUG__2021_-_2022-06-19T004711.472_1655603471291_1655603479864.jpg", "publishedAt": "2022-06-19T01:52:17Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "Bitcoin, Ether bounce off lows after record-breaking rout - Moneycontrol", "description": "The largest digital token by market value tumbled as much as 15% to $17,599 on Saturday, marking a record-breaking 12th consecutive daily decline", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/bitcoin-ether-bounce-off-lows-after-record-breaking-rout-8705851.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Bitcoin-770x433.jpg", "publishedAt": "2022-06-19T01:33:13Z", "content": "Bitcoin plunged through several closely watched price levels to the lowest since late 2020 as evidence of deepening stress within the crypto industry keeps piling up against a backdrop of monetary ti… [+4798 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tesla, Elon Musk Welcome To India, But...: Heavy Industries Minister - NDTV Profit", "description": "Elon Musk and Tesla are welcome to India but the government will not compromise in any way on the policy of Aatmanirbhar Bharat or self-reliant India, Union minister Mahendra Nath Pandey said on Saturday.", "url": "https://www.ndtv.com/business/tesla-elon-musk-welcome-to-india-but-only-as-per-govt-policies-heavy-industries-minister-3079073", "urlToImage": "https://c.ndtvimg.com/2022-04/8uaqqujg_tesla_625x300_27_April_22.jpg", "publishedAt": "2022-06-19T01:17:00Z", "content": "Tesla, Elon Musk welcome to India but per policies: Heavy industries minister\r\nNew Delhi: Elon Musk and Tesla are welcome to India but the government will not compromise in any way on the policy of A… [+1385 chars]"}, {"source": {"id": null, "name": "ZyCrypto"}, "author": null, "title": "Billionaire Lee Cooperman Calls Crypto And NFTs “Crap”, Fails to See Markets Recovering Anytime Soon - ZyCrypto", "description": "American billionaire hedge fund manager Lee Cooperman does not see the ongoing bear market cycle subsiding - at least in the foreseeable", "url": "https://zycrypto.com/billionaire-lee-cooperman-calls-crypto-and-nfts-crap-fails-to-see-markets-recovering-anytime-soon/", "urlToImage": "https://zycrypto.com/wp-content/uploads/2022/06/Billionaire-Lee-Cooperman-Calls-Crypto-And-NFTs-Crap-Fails-to-See-Markets-Recovering-Anytime-Soon.jpg", "publishedAt": "2022-06-18T18:10:15Z", "content": "American billionaire hedge fund manager Lee Cooperman does not see the ongoing bear market cycle subsiding – at least in the foreseeable future – and blames the marketwide sell-off to among other rea… [+2324 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Maulik Vyas", "title": "Investors, strategic buyers eye assets of companies under liquidation - Economic Times", "description": "The trigger lies in the amendment made by the Insolvency & Bankruptcy Board of India (IBBI) in November 2020 that allows liquidators to transfer/sell or assign 'Not Readily Realisable Assets' (NRRA) of the company in liquidation to any person after consultati…", "url": "https://economictimes.indiatimes.com/industry/banking/finance/investors-strategic-buyers-eye-assets-of-companies-under-liquidation/articleshow/92308354.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92308351,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-18T18:06:00Z", "content": "SynopsisThe trigger lies in the amendment made by the Insolvency &amp; Bankruptcy Board of India (IBBI) in November 2020 that allows liquidators to transfer/sell or assign 'Not Readily Realisable Ass… [+188 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Indulekha Aravind", "title": "As edtech firms venture into offline classes, hiring war for star teachers is intensifying - Economic Times", "description": "(Unacademy did not respond to ET’s emailed queries on compensation.) It’s a figure that is emblematic of the peak the scramble for “star teachers” has reached. This is driven by venture capital-funded edtech unicorns expanding into the lucrative, offline comp…", "url": "https://economictimes.indiatimes.com/industry/services/education/as-edtech-firms-venture-into-offline-classes-hiring-war-for-star-teachers-is-intensifying/articleshow/92308080.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92308056,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-18T17:41:00Z", "content": "Synopsis(Unacademy did not respond to ET’s emailed queries on compensation.) It’s a figure that is emblematic of the peak the scramble for “star teachers” has reached. This is driven by venture capit… [+186 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shailesh Menon", "title": "As India grows its own 'exotic' fruits and vegetables, imports are plummeting - Economic Times", "description": "The import of produce such as durians, leeks and other alliaceous bulbs, capsicums, figs, mangosteen and strawberries has dropped 70-100% since 2018, as per APEDA data. Inbound shipment of asparagus, celery, lemons, mandarins, walnuts, plums, peaches, nectari…", "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/as-india-grows-its-own-exotic-fruits-and-vegetables-imports-are-plummeting/articleshow/92307290.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92307578,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-18T17:41:00Z", "content": "SynopsisThe import of produce such as durians, leeks and other alliaceous bulbs, capsicums, figs, mangosteen and strawberries has dropped 70-100% since 2018, as per APEDA data. Inbound shipment of as… [+123 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "New York Times", "title": "TikTok says its US traffic is going through Oracle servers, but it retains backups - Moneycontrol", "description": "The video app made its announcement before BuzzFeed News published an article detailing how TikTok employees felt it was difficult to successfully wall off its data from China.", "url": "https://www.moneycontrol.com/news/world/tiktok-says-its-us-traffic-is-going-through-oracle-servers-but-it-retains-backups-8705571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/tiktokchina-770x433.png", "publishedAt": "2022-06-18T15:53:01Z", "content": "TikTok, a Chinese-owned video app, said Friday that it was moving all of the data produced by its American users through servers controlled by Oracle, a Silicon Valley company, in a bid to convince t… [+2195 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "FMCG company Adani Wilmar cuts edible oil prices by ₹10 | Mint - Mint", "description": "Following the government's decision to drop import duties on edible oils, Adani Wilmar, one of India's top Fast Moving Consumer Goods (FMCG) food companies, lowered the price of its edible oils by  ₹10 on Saturday.", "url": "https://www.livemint.com/news/india/fmcg-company-adani-wilmar-cuts-edible-oil-prices-by-rs-10-11655557725461.html", "urlToImage": "https://images.livemint.com/img/2022/06/18/600x338/fmcg-kDvF--621x414@LiveMint_1655559053530.JPG", "publishedAt": "2022-06-18T13:34:13Z", "content": "Adani Wilmar, one of India's largest Fast Moving Consumer Goods (FMCG) food firms, reduced the price of its edible oils by 10 on Saturday, after the government's decision to lower import duties on th… [+2073 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Government employees barred from using VPNs: 7 things to know - Times of India", "description": "The VPN controvery continues to rage. In a fresh directive, the government has reportedly barred its employees from using third-party virtual private", "url": "https://timesofindia.indiatimes.com/gadgets-news/government-bans-vpn-for-employees-7-things-to-know/articleshow/92304779.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92304880,width-1070,height-580,imgsize-115522,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-18T13:04:00Z", "content": ""}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Tata Steel MD Narendran on bear market in steel sector - Economic Times", "description": "China wants to reduce its steel exports because it wants to reduce the carbon footprint for the steel industry in China. So, I see a far better balance in global trade over this decade than we have seen in the last decade and if China is not an aggressive exp…", "url": "https://economictimes.indiatimes.com/markets/expert-view/tata-steel-md-narendran-on-bear-market-in-steel-sector/articleshow/92303780.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92303752,width-1070,height-580,imgsize-77245,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-18T12:16:00Z", "content": "What is happening in China is because of the lockdowns. Steel consumption in China also topped a bit. Production was actually quite strong and hence you saw seven million tonnes of exports in May whi… [+4839 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "George Georgiev", "title": "3 Possible Reasons Why Ethereum (ETH) is Down 40% in 7 Days - CryptoPotato", "description": "Ethereum is down 40% in the past week. Here are three possible reasons why.", "url": "https://cryptopotato.com/3-possible-reasons-why-ethereum-eth-is-down-40-in-7-days/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2021/05/EthereumBears.jpg", "publishedAt": "2022-06-18T11:54:09Z", "content": "The cryptocurrency market took a beating over the past week. The total capitalization is down below $1 trillion for the first time since January 2021, losing a staggering $300 billion in seven days a… [+4754 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Citroen C5 Aircross facelift to be launched by September 2022 - Team-BHP", "description": "According to a media report, the Citroen C5 Aircross facelift could be launched in India by September 2022. The C5 Aircross facelift made its global debut in January, this year. As part of the update, the SUV gets a redesigned front fascia with new LED headla…", "url": "https://www.team-bhp.com/news/citroen-c5-aircross-facelift-be-launched-september-2022", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/citroenc5aircross2022.jpg", "publishedAt": "2022-06-18T11:27:21Z", "content": "According to a media report, the Citroen C5 Aircross facelift could be launched in India by September 2022.\r\nThe C5 Aircross facelift made its global debut in January, this year. As part of the updat… [+658 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "TVS Zeppelin Headlight Design Leaked Ahead Of Launch On July 6 - GaadiWaadi.com", "description": "The upcoming TVS Zeppelin is expected to launch early next month, and before that, its headlamp design has leaked online", "url": "https://gaadiwaadi.com/tvs-zeppelin-headlight-design-leaked-ahead-of-launch-on-july-6/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2019/07/TVS-Zepellin-Cruiser-3-e1585826620596.jpg", "publishedAt": "2022-06-18T11:01:19Z", "content": "TVS Motor Company will introduce a new motorcycle in the Indian market on July 6. This upcoming model is expected to be the production version of the Zeppelin concept, which was unveiled at the 2018 … [+1698 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "This banking stock hits 52-week-low, brokerage sees 89% potential upside | Mint - Mint", "description": "On the NSE, CSB Bank shares reached a 52-week low of  ₹178.50 on 17th June 2022 and a 52-week high of  ₹374.00 on 5th July 2021, indicating that the stock at the current level of  ₹180 is trading at a 51 per cent discount from its 52-week high and 1.96 per ce…", "url": "https://www.livemint.com/market/stock-market-news/this-banking-stock-hits-52-week-low-brokerage-sees-89-potential-upside-11655544714221.html", "urlToImage": "https://images.livemint.com/img/2022/06/18/600x338/KVP8IM6W_1600274980295_1600274984745_1655544745416.jpg", "publishedAt": "2022-06-18T09:36:16Z", "content": "CSB is a private sector lender with its headquarters in Thrissur, Kerala, and is the state's oldest private sector bank. Currently, the bank has 609 branches (three of which are service branches and … [+3511 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Dogecoin investor sues Billionaire Elon Musk for allegedly running a pyramid scheme | English News - WION", "description": "Billionaire Elon Musk has been sued for $258 billion by a crypto investor for allegedly running a 'Dogecoin Pyramid scheme'. A formal complaint was filed in ...", "url": "https://www.youtube.com/watch?v=goOCH9_5tc8", "urlToImage": "https://i.ytimg.com/vi/goOCH9_5tc8/maxresdefault.jpg", "publishedAt": "2022-06-18T09:00:32Z", "content": null}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "India-Bound 2022 Yamaha NMax 155 Gets Big Updates - GaadiWaadi.com", "description": "2022 Yamaha NMax 155 gets a new traction control system and a gas-charged rear suspension unit with preload adjustability", "url": "https://gaadiwaadi.com/india-bound-2022-yamaha-nmax-155-gets-big-updates/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/02/2022-Yamaha-Nmax-155-matte-red.jpg", "publishedAt": "2022-06-18T08:30:07Z", "content": "Yamaha Motor has launched the updated version of the NMax 155 in the Chinese market and it gets notable changes this time around. The most important of them is the traction control system. We have se… [+1915 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "Even amid pullout, FIIs have raised their stake in certain companies - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/even-amid-pullout-fiis-have-raised-their-stake-in-certain-companies-3244669", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/9290c189cb2b5731bf5973f212e4f58e_w_800_h_450.jpg", "publishedAt": "2022-06-18T07:46:45Z", "content": "New Delhi, June 18 (IANS) Foreign investors pulling out money from the Indian equity segment had made several headlines in the recent months.\r\nPulling out over $42 billion or Rs 3.26 lakh crore from … [+3642 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Sonny", "title": "Top 7 Hits And Misses From The Feature List Of The New Mahindra Scorpio N - CarDekho", "description": "The Scorpio N is a far more premium SUV that the outgoing version but it still misses out some comforts  The Mahindra Scorpio N will be revealed in its entirety on June 27. However, many of its details and specifications are already known to us, and that also…", "url": "https://www.cardekho.com/india-car-news/top-7-hits-and-misses-from-the-feature-list-of-the-new-mahindra-scorpio-n-29247.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29246/1655531160941/GeneralNews.jpg", "publishedAt": "2022-06-18T07:42:00Z", "content": "The Scorpio N is a far more premium SUV that the outgoing version but it still misses out some comforts\r\nThe Mahindra Scorpio N will be revealed in its entirety on June 27. However, many of its detai… [+6030 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sneha Kulkarni", "title": "Banks offering highest FD interest rates - Economic Times", "description": "The fixed deposit is one of the most popular investment alternatives (FD). Term deposits are another name for fixed deposits. This is because money is deposited with a bank for a set length of time or term. Before you open a savings account, there are a few t…", "url": "https://economictimes.indiatimes.com/wealth/invest/banks-offering-highest-fd-interest-rates/articleshow/92295366.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92295469,width-1070,height-580,imgsize-214815,overlay-etwealth/photo.jpg", "publishedAt": "2022-06-18T05:33:00Z", "content": "One of the most popular investment options is the fixed deposit (FD). Many investors prefer bank FDs to equities because the latter are thought to be safer. Fixed deposits are also known as term depo… [+5665 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sounak Mukhopadhyay", "title": "This airport has been ranked the best in India, South Asia; it is also one of world's top 50 | Mint - Mint", "description": "Not only the best in India and South Asia, this airport has been ranked 37th among world's top 50.", "url": "https://www.livemint.com/news/india/delhis-indira-gandhi-international-igi-airport-has-been-ranked-the-best-in-india-south-asia-11655528988420.html", "urlToImage": "https://images.livemint.com/img/2022/06/18/600x338/Airport_eric-masur-vVLTtOG12sA-unsplash_1655529545378_1655529591182.jpg", "publishedAt": "2022-06-18T05:22:00Z", "content": "The Skytrax World Airport Awards named Delhi's Indira Gandhi International (IGI) airport the finest in India and South Asia for the fourth year in a row, according to an official statement released o… [+1306 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Neil Nair", "title": "Yamaha MT-15 V2 price hiked by Rs 2,000 in India - BikeWale", "description": "The MT-15 V2 has witnessed impressive sales numbers since its launch", "url": "https://www.bikewale.com/news/yamaha-mt15-v2-price-hiked-by-rs-2000-in-india/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/124339/yamaha-mt-15-right-side-view0.jpeg?isig=0&q=75&art=2", "publishedAt": "2022-06-18T05:20:45Z", "content": "- MT-15 now priced from Rs 1.61 lakh\r\n- Hike of Rs 2,000\r\n- No changes to hardware or features\r\nYamaha Motor India has once again hiked the prices of all its two-wheelers including the MT-15 V2 that … [+867 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "How do you define a recession? Let us count the ways - Economic Times", "description": "A recession is often defined as two consecutive quarters where the economy shrinks instead of grows, but with plenty of caveats.", "url": "https://economictimes.indiatimes.com/news/economy/indicators/how-do-you-define-a-recession-let-us-count-the-ways/articleshow/92294531.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92294585,width-1070,height-580,imgsize-322478,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-18T04:35:00Z", "content": "Whether the United States, the world's largest economy, will slip into a recession is a growing concern for chief executives, the Federal Reserve, and the administration of President Joe Biden.\r\nBut … [+3224 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "RBI Not Behind the Curve in Hiking Interest Rates, Says Governor Shaktikanta Das - News18", "description": "The tolerance of a higher inflation during the pandemic was a necessity, otherwise, the damage to the economy and financial markets would have been enormous, said Shaktikanta Das.", "url": "https://www.news18.com/news/business/rbi-not-behind-the-curve-in-hiking-interest-rates-says-governor-shaktikanta-das-5394253.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/shaktikanta-das-4-165552529916x9.jpg", "publishedAt": "2022-06-18T04:09:47Z", "content": "RBI governor Shaktikanta Das has said that Indias central bank has not fallen behind the curve with regards to raising the interest rates. The RBI, he said, is in sync with the realities of growth an… [+2732 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | Exide Life CIO Shyamsunder Bhat sees substantial FII purchases next year with potential... - Moneycontrol", "description": "The pharma sector and the FMCG (consumer staples) sector would fare better in a recessionary environment, to an extent. However valuations in most of the FMCG companies, and in some of the pharma companies, may not offer much upside from present levels.", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-exide-life-cio-shyamsunder-bhat-sees-substantial-fii-purchases-next-year-with-potential-portfolio-re-allocations-8702811.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Shyamsunder-Bhat-of-Exide-Life-Insurance-770x433.jpg", "publishedAt": "2022-06-18T03:27:36Z", "content": "The Indian equity market has gone into a tailspin in the last few sessions amid mounting inflationary pressure and intensifying fears of recession in the US economy. But the Indian economy looks seat… [+10732 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "How do interest rates affect the real economy and you? - Economic Times", "description": "​Higher central bank key interest rates affect the cost of borrowing for banks, which then pass those costs onto businesses, consumers and even governments. That means higher borrowing costs, such as for buying a house. Higher borrowing costs eventually slow …", "url": "https://economictimes.indiatimes.com/news/how-to/how-do-interest-rates-affect-the-real-economy-and-you/articleshow/92292639.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92293221,width-1070,height-580,imgsize-81336,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-18T02:39:00Z", "content": "Faced with the highest inflation in four decades, central banks across the world are hiking interest rates in order to contain inflation.\r\nThe reversal in monetary policy will have a tangible impact … [+3242 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Nitin Bhasin", "title": "Explained | What does Adani's entry mean for cement industry structure? - Moneycontrol", "description": "Cement company valuations have bottomed out near the current levels over the past six-seven years but there is no visibility for the margins to improve in the near term", "url": "https://www.moneycontrol.com/news/business/markets/explained-what-does-adanis-entry-mean-for-cement-industry-structure-8702821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/cement_bag-1-770x433.jpg", "publishedAt": "2022-06-18T02:23:57Z", "content": "The Adani Groups entry has fundamentally altered the cement industry structure. After the global financial crisis, building material companies were saddled with high debt on balance sheets. Their sub… [+4814 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sophie Alexander, Malathi Nayak and Mark Bergen | Bloomberg", "title": "Google co-founder Sergey Brin seeks divorce, joins Gates and Bezos in split - Business Standard", "description": "Brin filed a petition for dissolution of his marriage to Nicole Shanahan this month citing  irreconcilable differences  according to court documents", "url": "https://www.business-standard.com/article/international/google-co-founder-sergey-brin-seeks-divorce-joins-gates-and-bezos-in-split-122061800173_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-06/18/full/1655514615-5066.jpg", "publishedAt": "2022-06-18T01:13:00Z", "content": "Sergey Brin, the Google co-founder and world’s sixth-richest person, filed for a divorce from his wife of three years, making him the third mega-billionaire to do so in as many years.\r\nBrin filed a p… [+4446 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "SpaceX fires several employees who critised CEO Elon Musk: Report - Hindustan Times", "description": "As the Twitter drama unfolded, another report emerged that Musk had paid $250,000 to a flight attendant to quash a potential sexual harassment lawsuit against him.", "url": "https://www.hindustantimes.com/business/spacex-fires-several-employees-who-critised-ceo-elon-musk-report-101655507600666.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/17/1600x900/elon_musk_reaction_on_sexual_harassment_claim_1653024564402_1655507729791.JPG", "publishedAt": "2022-06-17T23:16:19Z", "content": "SpaceX, the rocket ship company run by Tesla CEO Elon Musk, has fired several employees involved in an open letter that blasted the colorful billionaire for his behavior, according to media reports.\r… [+2314 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Meta is launching a digital clothing store where you can purchase outfits for your avatar - TechCrunch", "description": "Meta CEO Mark Zuckerberg announced today that the company is launching a digital designer clothing store called the \"Meta Avatars Store.\"", "url": "https://techcrunch.com/2022/06/17/meta-digital-clothing-store-avatar/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/06/meta-avatars-store.jpeg?w=533", "publishedAt": "2022-06-17T21:01:59Z", "content": "Meta CEO Mark Zuckerberg announced today that the company is launching a digital designer clothing store called the “Meta Avatars Store.” Zuckerberg made the announcement during an Instagram Live wit… [+1784 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold is doing 'spectacular job' but price drop to $1800 not ruled out, here's why - Kitco NEWS", "description": "", "url": "https://www.kitco.com/news/2022-06-17/Gold-is-doing-spectacular-job-but-price-drop-to-1-800-not-ruled-out-here-s-why.html", "urlToImage": "https://www.kitco.com/news/2022-06-17/images/shutterstock_2142679777-min.jpg", "publishedAt": "2022-06-17T18:38:00Z", "content": "(Kitco News) Gold surprised this week with its resilience and steadiness after an oversized 75-basis-point hike from the Federal Reserve and massive volatility across many markets. But analysts don't… [+4682 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jesse Pound", "title": "Look for more selling pressure next week as investors learn the hard way not to fight the Fed - CNBC", "description": "After a brutal week for markets, Fed Chair Jerome Powell will testify before Congress about the central bank's increasingly aggressive plan to fight inflation.", "url": "https://www.cnbc.com/2022/06/17/look-for-more-selling-pressure-next-week-as-investors-learn-the-hard-way-not-to-fight-the-fed.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106911403-1626357900954-powell.jpg?v=1626357925&w=1920&h=1080", "publishedAt": "2022-06-17T18:13:32Z", "content": "Federal Reserve Chairman Jerome Powell adjusts his tie as he arrives to testify before a Senate Banking, Housing and Urban Affairs Committee hearing on The Semiannual Monetary Policy Report to the Co… [+6841 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Tsvetana Paraskova", "title": "Russia's Gas Deliveries To Europe Plunge Further - OilPrice.com", "description": "Natural gas flows from Russia to Europe continued to dive on Friday, with buyers in Italy, Germany, Austria, and Slovakia receiving much lower volumes than usual", "url": "https://oilprice.com/Energy/Natural-Gas/Russias-Gas-Deliveries-To-Europe-Plunge-Further.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-06-17_mlxtgs42hw.jpg", "publishedAt": "2022-06-17T16:00:00Z", "content": "Russias invasion of Ukraine has…\r\nSome of the biggest international…\r\nEnergy companies in Wyoming and…\r\nBy Tsvetana Paraskova - Jun 17, 2022, 11:00 AM CDTNatural gas flows from Russia to Europe conti… [+2366 chars]"}, {"source": {"id": null, "name": "Finbold.com"}, "author": null, "title": "India's largest-ever crypto Ponzi scam wipes $12.8 billion from victims - Finbold - Finance in Bold", "description": "Expanding crypto market gives opportunity to scammers, with the largest crypto Ponzi scam in India costing its victims billions of dollars.", "url": "https://finbold.com/indias-largest-ever-crypto-ponzi-scam-wipes-12-8-billion-from-victims/", "urlToImage": "https://finbold.com/app/uploads/2022/06/Indias-largest-ever-crypto-Ponzi-scam-wipes-12.8-billion-from-victims.jpg", "publishedAt": "2022-06-17T15:34:52Z", "content": "As the cryptocurrency industry grows larger, malicious individuals and groups seek (and find) more opportunities to get away with other peoples digital assets, with the largest-ever crypto Ponzi scam… [+2071 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Sovereign Gold Bond Scheme 2022-23: You can earn discount in first tranche bidding, here's how | Mint - Mint", "description": "The discount of  ₹50 is available to those investors who are applying for the scheme online, and the payment against the application is made through digital mode.", "url": "https://www.livemint.com/news/india/sovereign-gold-bond-scheme-2022-23-you-can-earn-discount-in-first-tranche-bidding-here-s-how-11655473115015.html", "urlToImage": "https://images.livemint.com/img/2022/06/17/600x338/ASIA-GOLD-DEMAND-0_1654319391272_1655474390635.JPG", "publishedAt": "2022-06-17T14:02:12Z", "content": "The Sovereign Gold Bond Scheme 2022-23 series is one of the most awaited offering this fiscal. The government is set to launch the first tranche of the scheme from June 20 to June 24. While an issue … [+2451 chars]"}]}