{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Indian Oil Q1 Result | Net profit tanks 86% as input costs zoom - Moneycontrol", "description": "Revenue from operations came in at Rs 2,55,381.62 crore, rising 63.16 percent from Rs 1,56,519.19 crore in the year ago quarter.", "url": "https://www.moneycontrol.com/news/business/earnings/indian-oil-q1-net-profit-tank-86-as-input-costs-zoom-8915521.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/indian-oil-ioc-oil-crude-770x433.jpg", "publishedAt": "2022-07-29T12:05:03Z", "content": "Indian Oil Corporation (IOC) on July 29 reported a consolidated net profit of Rs 882.96 crore for the quarter ended June 2022 (Q1FY23). The numbers were 85.62 percent lower than Rs 6,140.63 crore pro… [+1192 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "I see clearest bull market in small-cap stocks: Shankar Sharma - Moneycontrol", "description": "As regards new-age stocks such as Zomato, Sharma termed them as “reverse compounders” who will keep halving one's investment after every interval.", "url": "https://www.moneycontrol.com/news/business/markets/i-see-clearest-bull-market-in-small-cap-stocks-shankar-sharma-8915481.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/Shankar_Sharma-770x433.jpg", "publishedAt": "2022-07-29T11:12:43Z", "content": "Veteran investor Shankar Sharma believes the worst is over for stock markets in India and said the real money-making opportunity is in the smallcap segment. Stocks from this space will soon make new … [+2787 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "HDFC Q1 Result | Net profit rises 22% to Rs 3,668.82 crore, AUM grows 17% - Moneycontrol", "description": "HDFC Q1 Result: The home loan lender reported loan growth of 16%, driven by individual loans that grew 19%t year-on-year on an AUM basis", "url": "https://www.moneycontrol.com/news/business/earnings/hdfc-q1-result-net-profit-rises-22-to-rs-3668-82-crore-aum-grows-17-8913761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/HDFC-Ltd6-770x433.jpg", "publishedAt": "2022-07-29T10:29:44Z", "content": "Housing Development Finance Corporation Ltd missed street estimates by a whisker, reporting a net profit of Rs 3,668.82 crore for the June quarter, an increase of 22 percent from the year-ago period,… [+2377 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Jayprashanth Mohanram", "title": "Ola Electric pauses scooter production citing annual maintenance - CarToq.com", "description": "Ola Electric is said to have paused production at its Future Factory in Krishnagiri, Tamilnadu, citing annual maintenance. Ola Electric’s spanking new Future Factory commenced production only 8 months ago. The electric vehicle maker is said to have ceased pro…", "url": "https://www.cartoq.com/ola-electric-pauses-scooter-production-citing-annual-maintenance/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/11/Ola-scooter-delivery-featured.jpg", "publishedAt": "2022-07-29T08:59:34Z", "content": "Ola Electric is said to have paused production at its Future Factory in Krishnagiri, Tamilnadu, citing annual maintenance. Ola Electric’s spanking new Future Factory commenced production only 8 month… [+2838 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Ashok Leyland Q1 result |Profit at Rs 68 crore, revenue up 145% - Moneycontrol", "description": "Ashok Leyland Q1 result: The domestic medium and heavy commercial vehicle volume grew at 189 percent and the company's market share expanded from 27 percent to 30 percent in the June quarter", "url": "https://www.moneycontrol.com/news/business/earnings/ashok-leyland-q1-result-profit-at-rs-68-crore-revenue-up-145-8914411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/07/Ashok_Leyland_Logo-770x433.jpg", "publishedAt": "2022-07-29T08:36:23Z", "content": "Commercial vehicle maker Ashok Leyland on July 29 reported a standalone profit of Rs 68 crore for the quarter ended June 2022, against a loss of Rs 282.3 crore in the corresponding period of the last… [+1609 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Swiggy now allows most of its employees to work from anywhere - India Today", "description": "Swiggy has announced new work from anywhere policy. The company took the decision to introduce a flexible work policy analysing the team needs and taking feedback from several managers and employees.", "url": "https://www.indiatoday.in/technology/news/story/swiggy-s-new-work-policy-will-force-you-to-apply-for-a-job-in-the-company-1981420-2022-07-29", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/swiggy-647x363.png?KJEg.sXLiIyvfkXAJqYOAxvtWpKEJQv_", "publishedAt": "2022-07-29T08:32:55Z", "content": "The last two years have been difficult for everyone because of the Covid pandemic. However, the only good thing about the pandemic was that people all around the world were allowed to work from home.… [+2141 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pawan Nahar", "title": "Tata Steel extends gains after stock split, rises another 9% - Economic Times", "description": "Investors who had the delivery of shares in their account as of June 28 were eligible for the equity dilution of the shares and the number of shares increased by 10 times, without changing the amount invested.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-extends-gains-after-stock-split-rises-another-9/articleshow/93205201.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93205292,width-1070,height-580,imgsize-22530,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T07:15:00Z", "content": "New Delhi: extended its gains on Friday as it rallied another 9 per cent after the stock of the country's largest steel producer turned ex-split on the bourses.\r\nTata Steel had fixed July 29 as the r… [+1236 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Priyanka Iyer", "title": "PhonePe acquires Indus OS, says amicable settlement reached with Affle Global - Moneycontrol", "description": "The closure of the deal comes after a long-winding legal wrangle between PhonePe and IndusOS shareholders Affle and Ventureast Fund on the valuation of IndusOS.", "url": "https://www.moneycontrol.com/news/business/announcements/phonepe-acquires-indus-os-says-amicable-settlement-reached-with-affle-global-8913411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/PhonePe-770x433.jpg", "publishedAt": "2022-07-29T06:45:26Z", "content": "Digital payments and financial services player PhonePe said on July 29 that it has completed the long pending acquisition of mobile platform OSLabs after reaching an amicable settlement with the comp… [+2635 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "HDFC, Cipla, Sun Pharma to report Q1 results today. Here's what to expect - Economic Times", "description": "Out of the 27 Nifty50 companies that have reported their quarterly numbers so far, 12 have reported results that beat Street expectations, seven fell short of meeting investor expectations. Two companies reported in-line results while the rest six came out wi…", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-cipla-sun-pharma-to-report-q1-results-today-heres-what-to-expect/articleshow/93204273.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93204329,width-1070,height-580,imgsize-56500,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T06:32:00Z", "content": "NEW DELHI: A total of three Nifty50 companies are scheduled to report their quarterly results today, namely , and .\r\nOut of the 27 Nifty50 companies that have reported their quarterly numbers so far,… [+2243 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Jayprashanth Mohanram", "title": "Ford EcoSport, Figo, Aspire & Freestyle Diesel cars recalled in India - CarToq.com", "description": "Ford India has just issued a recall for the diesel variants of EcoSport, Figo, Aspire and Freestyle. The recall is meant to check and replace emission control equipment on these cars. During the recall, Ford India’s dealerships across the country will fit new…", "url": "https://www.cartoq.com/ford-ecosport-figo-aspire-freestyle-diesel-cars-recalled-in-india/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/01/New-Ford-EcoSport-Titanium-AT_1.jpg", "publishedAt": "2022-07-29T06:19:43Z", "content": "Ford India has just issued a recall for the diesel variants of EcoSport, Figo, Aspire and Freestyle. The recall is meant to check and replace emission control equipment on these cars. During the reca… [+2542 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Tarun", "title": "Here Are The Top Upcoming Cars Of August 2022 - CarDekho", "description": "Some important launches and EV concept unveilings are scheduled for this month  Last month we saw many important launches and unveils, and August won’t be any different. This month, we’ll be getting the prices of two new SUVs. Maruti’s also ready to launch th…", "url": "https://www.cardekho.com/india-car-news/here-are-the-top-upcoming-cars-of-august-2022-29455.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29454/1659060108461/GeneralNews.jpg", "publishedAt": "2022-07-29T06:18:00Z", "content": "Last month we saw many important launches and unveils, and August wont be any different. This month, well be getting the prices of two new SUVs. Marutis also ready to launch the new generation of its… [+4231 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Production-spec Mahindra XUV400 electric SUV spied - Team-BHP", "description": "The all-electric version of the Mahindra XUV300 has been spotted in its close-to-production form. The electric SUV is expected to be called XUV400 and could be launched in early 2023. While the electric version looks similar to the XUV300, it will have a few …", "url": "https://www.team-bhp.com/news/production-spec-mahindra-xuv400-electric-suv-spied", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/77C012C815784C5DA61D4FDC0E4853CE.jpeg", "publishedAt": "2022-07-29T06:12:18Z", "content": "The all-electric version of the Mahindra XUV300 has been spotted in its close-to-production form. The electric SUV is expected to be called XUV400 and could be launched in early 2023.\r\nWhile the elec… [+796 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jack Ma Escapes Beijing's Crosshairs By Giving Up His Power - NDTV", "description": "Jack Ma is taking a weeks-long tour in Europe after largely disappearing from public view for almost two years, adding to signs that China's government is easing pressure on the entrepreneur.", "url": "https://www.ndtv.com/world-news/jack-ma-europe-tour-adds-to-signs-that-he-is-ceding-control-of-his-empire-3204502", "urlToImage": "https://c.ndtvimg.com/2022-07/v25jjd5o_jack-ma-bloomberg_625x300_29_July_22.jpg", "publishedAt": "2022-07-29T05:52:59Z", "content": "Jack Ma holds no management titles at Ant\r\nJack Ma is taking a weeks-long tour in Europe after largely disappearing from public view for almost two years, adding to signs that China's government is e… [+5858 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "Dr Reddy’s Labs net profit doubles in Q1: What should investors do? - Economic Times", "description": "Share of the pharma major fell about 4 per cent in the first one hour of the trade on Friday. Experts see concerns over the US business, as well as, pressure on operating performance as key drags. Despite near-term headwinds, most brokerage firms maintained t…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-labs-net-profit-doubles-in-q1-what-should-investors-do/articleshow/93203117.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93203116,width-1070,height-580,imgsize-106034,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T05:44:00Z", "content": "Dr Reddys Laboratories failed to cheer Dalal Street despite reporting over a 100 per cent rise in the net profit for the quarter ended June 2022.\r\nShare of the pharma major fell about 4 per cent in t… [+3137 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Kotak Institutional Equities now says sell-off in Zomato overdone, sees 73% upside - Moneycontrol", "description": "The domestic broker said the recent stock price decline triggered by expiry of the lock-in period for shares held by insiders was overdone.", "url": "https://www.moneycontrol.com/news/business/stocks/kotak-institutional-equities-now-says-sell-off-in-zomato-overdone-sees-73-upside-8912271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Zomato_shutterstock_1418119301-770x433.jpg", "publishedAt": "2022-07-29T05:35:44Z", "content": "After Jefferies said earlier this week that Zomato deserved much better valuation than what the market was ascribing, Kotak Institutional Equities upgraded the stock to buy from add with the target a… [+2386 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Petrol, Diesel Price Announced Today: Check Latest Petrol Price in Delhi, Mumbai, Other Cities - News18", "description": "Petrol Price Today, July 29: The price of petrol and diesel in Delhi today are Rs 96.72 per litre and Rs 89.62 per litre, respectively.", "url": "https://www.news18.com/news/business/petrol-diesel-price-announced-today-check-latest-petrol-price-in-delhi-mumbai-other-cities-5646073.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/petrol-price1-165742234616x9.jpg", "publishedAt": "2022-07-29T05:16:09Z", "content": "The petrol and diesel prices remain steady on July 29. The rates have remained unchanged ever since the Centre slashed the Excise Duty on petrol and diesel on May 21. While the petrol prices were red… [+2181 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Singer Badshah picks up his second Lamborghini Urus SUV - CarToq.com", "description": "Celebrity singer Badshah has picked up his second Lamborghini Urus. Lamborghini Delhi has shared the pictures of the delivery. This is the second Lamborghini Urus that Badshah has bought in India. Interestingly, Lamborghini has sold more than 200 units of the…", "url": "https://www.cartoq.com/singer-badshah-picks-up-his-second-lamborghini-urus-suv/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/07/badshah-lamborghini-urus-featured.jpg", "publishedAt": "2022-07-29T05:15:00Z", "content": "Celebrity singer Badshah has picked up his second Lamborghini Urus. Lamborghini Delhi has shared the pictures of the delivery. This is the second Lamborghini Urus that Badshah has bought in India. In… [+2360 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "US enters 'technical recession'. But why is Dalal Street rallying? - Economic Times", "description": "The US economy entering a 'technical recession' is not good news for India and the world. But analysts said one should not see too much into the GDP print, as other data points in the world's largest consumer economy still suggest resilience. If anything, the…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/us-enters-technical-recession-but-why-is-dalal-street-rallying/articleshow/93202204.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93202196,width-1070,height-580,imgsize-41432,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T05:05:00Z", "content": "NEW DELHI: The saying goes -- when the US sneezes, the world catches a cold. But even as the data showed the US economy shrank overnight, the domestic market rallied over a per cent, taking its gains… [+4114 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Radhakishan Damani buys more shares of this portfolio stock in Q1 | Mint - Mint", "description": "Radhakishan Damani has increased his shareholding marginally in United Breweries through his investment arm Derive Trading and Resorts", "url": "https://www.livemint.com/market/stock-market-news/radhakishan-damani-buys-more-shares-in-portfolio-stake-united-breweries-in-q1-11659065092779.html", "urlToImage": "https://images.livemint.com/img/2022/07/29/600x338/radhakishan_damani_1658331846352_1659065149365_1659065149365.jpg", "publishedAt": "2022-07-29T04:50:01Z", "content": "As per the recent shareholding pattern released, Indian veteran investor and billionaire Radhakishan Damani has increased his shareholding marginally in United Breweries Ltd (UBL) through his investm… [+2321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "India among countries clocking revenue records that help Apple score 'better than expected' Q3 results - The Indian Express", "description": "CFO Luca Maestri said Apple services had set “all time records in many countries around the world including the US, Mexico, Brazil, Korea and India.”", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-q3-results-india-revenue-records-8058038/", "urlToImage": "https://images.indianexpress.com/2022/07/Tim-Cook.jpeg", "publishedAt": "2022-07-29T04:15:03Z", "content": "Apple Thursday announced a better than expected $83.0 billion third quarter result, which CEO Tim Cook acknowledged was powered also by June quarter revenue records in developed and emerging markets … [+2305 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anupam Nagar", "title": "Corporate Radar: Clean Science to turn ex-dividend; HDFC, Sun Pharma Q1 results; Biocon, DRL AGMs & more - Economic Times", "description": "Shares of ABM Knowledgeware (Rs 1.25 per share), MRF (Rs 144 per share), Praj Industries (Rs 2.7 per share), Hawkins Cookers (Rs 60 per share) and TCI Express (Rs 2 per share) had announced final dividend. The stocks went ex-dividend on Wednesday.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/corporate-radar-clean-science-to-turn-ex-dividend-hdfc-sun-pharma-q1-results-biocon-drl-agms-more/articleshow/93200239.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93200232,width-1070,height-580,imgsize-17272,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T03:16:00Z", "content": "NEW DELHI: A host of board meetings and corporate actions are scheduled for Friday.\r\nShares of AMI Organics (Rs 3 per share), \r\n (Re 0.7 per share), Clean Science (Rs 3.25 per share), (Rs 4 per share… [+1633 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "Big Movers on D-St: What should investors do with Bajaj Finance, Bajaj Finserv and Bharat Dynamics? - The Economic Times", "description": "Stocks that were in focus include names like Bajaj Finance which rallied more than 10 per cent, Bajaj Finserv also closed with gains of more than 10 per cent post Q1 results, and Bharat Dynamics closed with gains of more than 7 per cent on Thursday.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-st-what-should-investors-do-with-bajaj-finance-bajaj-finserv-and-bharat-dynamics/articleshow/93200094.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93200103,width-1070,height-580,imgsize-18948,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T03:07:00Z", "content": "Indian market closed in the green on Thursday for the second day in a row. The S&amp;P BSE Sensex rallied more than 1000 points while the Nifty50 closed above 16,900 levels.\r\nSectorally, buying was s… [+2953 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in the news: HDFC, SBI Life, Vedanta, TVS Motors, GMR Infra and DRL - The Economic Times", "description": "HDFC, Sun Pharma, NTPC, HDFC Life, Indian Oil, DLF, Ashok Leyland, Cipla, Chola Finance, Torrent Pharma, Piramal Enterprises, Star Health and GMR Infra are among the companies that will announce their earnings for the quarter ended June 2022.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-hdfc-sbi-life-vedanta-tvs-motors-gmr-infra-and-drl/articleshow/93198920.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93198930,width-1070,height-580,imgsize-65606,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-29T02:03:00Z", "content": "Nifty futures on the Singapore Exchange traded 193.5 points, or 1.14 per cent higher at 17,140.5, signaling that Dalal Street was headed for a positive start on Friday. Here are a dozen stocks which … [+7115 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Trade setup for Friday: Nifty call put ratio, US GDP to SGX Nifty today — things to know before market's opening bell | Mint - Mint", "description": "Trade setup for Friday: US GDP contracted by 0.9% in the second quarter of this year after a first-quarter drop of 1.6%", "url": "https://www.livemint.com/market/stock-market-news/trade-setup-for-friday-nifty-call-put-ratio-us-gdp-data-to-sgx-nifty-today-things-to-know-before-market-s-opening-bell-today-11659055555631.html", "urlToImage": "https://images.livemint.com/img/2022/07/29/600x338/PTI01-28-2022-000035B-0_1645859283821_1659056119752_1659056119752.jpg", "publishedAt": "2022-07-29T01:06:25Z", "content": "Trade setup for Friday: Following mild hawkish stance of the US Fed on interest rate hike, Indian stock market rallied on second straight session on Thursday. NSE Nifty opened gap up and kept rising … [+7127 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Shares rally, U.S. Treasury yields fall as U.S. economy shrinks By Reuters - Investing.com", "description": "Shares rally, U.S. Treasury yields fall as U.S. economy shrinks", "url": "https://www.investing.com/news/economy/asia-shares-bonds-find-some-relief-in-fed-messaging-2855965", "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_2_800x533_L_1412601599.jpg", "publishedAt": "2022-07-29T01:06:00Z", "content": "By Sinéad Carew\r\nNEW YORK (Reuters) -Wall Street stocks rallied on Thursday, while Treasury yields fell for the third straight day as investors digested data showing a declining U.S. economy for a se… [+3886 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vidnyan Sawant", "title": "Hot Stocks | Over 16% return possible from L&T Infotech, GNFC, PI Industries in short term. Here's why - Moneycontrol", "description": "On daily time frame prices after consolidation, the Bollinger band has started to expand where prices on July 18 had closed above upper Bollinger band. This tells that the volatility of L&amp;T Infotech is rising on the upside.", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-over-16-return-possible-from-lt-infotech-gnfc-pi-industries-in-short-term-heres-why-8908281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/stocks_sensex_nifty_stockmarket-2-770x433.jpg", "publishedAt": "2022-07-29T00:54:11Z", "content": "The Nifty on the weekly timeframe is trading above the 8-week highs, reflecting the positive undertone in the index. Prices on the weekly time frame has crossed the prior swing high of 16,793 which n… [+4168 chars]"}, {"source": {"id": null, "name": "CRN"}, "author": "Mark Haranas", "title": "AWS Run Rate Hits Historic $79 Billion - CRN", "description": "AWS is on a $79 billion run rate for its cloud computing business as AWS sales grow with Amazon investments in data centers and adding technical employees.", "url": "https://www.crn.com/news/cloud/aws-run-rate-hits-historic-79-billion", "urlToImage": "https://www.crn.com/resources/0270-13e92f05fbd9-05a5cadb659f-1000/aws-sign-2.jpg", "publishedAt": "2022-07-28T23:10:00Z", "content": "Cloud News \r\nCRN breaks down the biggest highlights of AWS second quarter financial earnings results unveiled today.\r\nAmazon Web Services increased sales by 33 percent in its second quarter to $19.74… [+3633 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Dial 1800: Battle for UP (East) pushes 5G Auction to Day 4 - Economic Times", "description": "The government has netted ₹149,623 crore at the end of the 16th round on Thursday, with the incremental gains coming entirely from the price increase in UP (E).", "url": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/dial-1800-battle-for-up-east-pushes-5g-auction-to-day-4/articleshow/93197704.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93197737,width-1070,height-580,imgsize-27310,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-28T23:00:00Z", "content": "Bids for 5G airwaves inched up by 169 crore on Thursday even as a spirited battle for 1800 MHz in UP (East) and action in the mid band or C-band (3.3-3.67 GHz) and high band (26 GHz) spectrum across … [+2875 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold price can build on its 2% rally after Fed's 75 basis point move – SSGA's Milling-Stanley - Kitco NEWS", "description": "(Kitco News) - Financial markets, including gold, have breathed a collective sigh of relief after the Federal Reserve raised interest rates by 75 basis points. According to one market strategist, this could be an important turning point for the precious metal.", "url": "https://www.kitco.com/news/2022-07-28/Gold-price-can-build-on-its-2-rally-after-Fed-s-75-basis-point-move-SSGA-s-Milling-Stanley.html", "urlToImage": "https://www.kitco.com/news/2022-07-28/images/gold-blackbackground-650.jpg", "publishedAt": "2022-07-28T21:23:00Z", "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+3143 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Gaurav Laghate", "title": "Publicis Bags PepsiCo India's Media Mandate - Economic Times", "description": "​​One of the largest advertisers in the country, PepsiCo India's media billing is close to ₹600 crore annually. WPP Companies, which held the consolidated duties - media, creative and digital - for almost three decades, were not part of the process.", "url": "https://economictimes.indiatimes.com/news/india/publicis-bags-pepsico-indias-media-mandate/articleshow/93195621.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93195654,width-1070,height-580,imgsize-11770,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-28T18:15:00Z", "content": "Publicis Media, the media agency of French multinational advertising company Publicis Groupe, has won the media mandate of FMCG major PepsiCo India, following a multi-agency pitch process.\r\nOne of th… [+2429 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "PM Modi to unveil IIBX, India's global bullion exchange| 5 points - Hindustan Times", "description": "Based at GIFT City in Gujarat, the exchange will be inaugurated by prime minister Narendra Modi in his home state.", "url": "https://www.hindustantimes.com/business/iibx-all-you-need-to-know-about-india-s-first-international-bullion-exchange-101659022728900.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/28/1600x900/FILES-UKRAINE-RUSSIA-CONFLICT-GOLD-SANCTION-1_1659022889096_1659022889096_1659022906302_1659022906302.jpg", "publishedAt": "2022-07-28T15:44:20Z", "content": "Indias first international bullion exchange will be inaugurated on Friday, by prime minister Narendra Modi, in his home state of Gujarat. Called the India International Bullion Exchange (IIBX), the e… [+1959 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Atmadip Ray", "title": "Equitas Small Finance Bank reports eight-fold jump in net profit - The Economic Times", "description": "The bank's interest income rose 15% to Rs 940.4 crore, while other income grew 28% to Rs 133 crore.Operating profit for the quarter jumped 63% to Rs 268 crore.The lender's asset quality improved, with the gross non-performing assets ratio falling to 4.1% at t…", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/equitas-small-finance-bank-reports-eight-fold-jump-in-net-profit/articleshow/93193473.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93193455,width-1070,height-580,imgsize-754773,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T15:16:00Z", "content": "Equitas Small Finance Bank reported an eight-fold jump in net profit at Rs 97 crore for the June quarter, backed by both core and other income and improvement in asset quality.\r\nIt earned a net profi… [+522 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "US Federal reserve hikes interest rates by 0.75% | Economy | Latest World News | WION - WION", "description": "The United States Federal Reserve has once again hiked the interest rate by 0.75%, this as the country's inflation level has touched 40-year high. This is th...", "url": "https://www.youtube.com/watch?v=AF2br7dq0TM", "urlToImage": "https://i.ytimg.com/vi/AF2br7dq0TM/maxresdefault.jpg", "publishedAt": "2022-07-28T15:15:00Z", "content": null}, {"source": {"id": null, "name": "Business Standard"}, "author": "Viveat Susan Pinto", "title": "Vedanta sees QoQ fall in profit and revenue; stock ends in the green - Business Standard", "description": "Vedantas consolidated net debt stood at Rs 26799 crore in the June quarter against Rs 24414 crore for the quarter ended March 2022", "url": "https://www.business-standard.com/article/companies/vedanta-q1-net-profit-rises-4-6-yoy-revenue-up-36-to-rs-38-251-crore-122072801375_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/12/full/1618168593-3103.jpg", "publishedAt": "2022-07-28T15:12:00Z", "content": "Metals and mining major Vedanta reported a consolidated net profit of Rs 4,421 crore for the June 2022 quarter, up 4.66 per cent year-on-year (YoY). But this was lower than Street estimates, which ca… [+1789 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "RBI grants more time to payment aggregators to meet net worth condition for licence - Moneycontrol", "description": "The original deadline to submit applications was September 30, 2021. However, applications received from some PAs had to be returned as they had not complied with eligibility criteria, including the minimum net worth criterion of Rs 15 crore by March 31, 2021…", "url": "https://www.moneycontrol.com/news/business/failure-to-meet-net-worth-criteria-rbi-gives-more-time-to-payment-aggregators-to-apply-for-licence-8908791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/RBI-770x433.png", "publishedAt": "2022-07-28T14:51:19Z", "content": "The Reserve Bank of India (RBI) on July 28 allowed an additional window for payment aggregators (PAs) whose applications for authorisation were rejected over failure to meet the minimum net worth cri… [+3184 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "PNB Q1 net profit falls 70% to Rs 308 crore, asset quality improves - Business Standard", "description": "The gross NPAs declined to 112 of the gross advances by June 2022 from 1433 a year ago It was at 1178 as of March 2022", "url": "https://www.business-standard.com/article/companies/punjab-national-bank-q1-net-profit-falls-70-to-rs-308-cr-122072801298_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2020-03/14/full/1584134438-5254.jpg", "publishedAt": "2022-07-28T14:27:00Z", "content": "State-owned Punjab National Bank on Thursday reported a 70 per cent decline in standalone net profit to Rs 308.44 crore in the June quarter, mainly due to higher provisioning for bad loans and declin… [+1970 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Sangeeta Nair", "title": "FDI in India 2022: Karnataka, Maharashtra highest FDI states in India in FY 2021-22 - Jagran Josh", "description": "FDI in India 2022: The highest FDI in India was from two countries Singapore and USA in FY 2021-22, with Singapore accounting for 27.01 percent of the FDI equity inflows in India and US for 17.94 percent.", "url": "https://www.jagranjosh.com/current-affairs/fdi-in-india-2022-karnataka-maharashtra-highest-fdi-states-in-india-in-fy-2021-22-1659016829-1", "urlToImage": "https://img.jagranjosh.com/images/2022/July/2872022/fdi_in_india_2022.jpg", "publishedAt": "2022-07-28T14:04:00Z", "content": "FDI in India 2022: Karnataka and Maharashtra were the highest FDI states in India in Financial Year 2021-2022, as per recent statement from the union government. While Karnataka recieved 37.55 percen… [+2583 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Why did Bajaj twin shares skyrocket 10-11% in a single day? | Mint - Mint", "description": "The two NBFC giants witnessed robust buying after registering a healthy June 2022 quarter. In Q1FY23, where Bajaj Finserv posted double-digit growth in net profit, subsidiary Bajaj Finance garnered a whopping 159% growth in the bottom line.", "url": "https://www.livemint.com/market/stock-market-news/why-did-bajaj-twin-shares-skyrocket-10-11-in-a-single-day-11659015374792.html", "urlToImage": "https://images.livemint.com/img/2022/07/28/600x338/26de40aa-fb8b-11eb-9351-32be236c0b91_1630581868515_1659016058574_1659016058574.jpg", "publishedAt": "2022-07-28T13:49:12Z", "content": "Bajaj Finance and parent Bajaj Finserv were major contributors to the market's strong rally. Bullish stance led benchmark Sensex to over 56,850 and Nifty 50 to near 19,950 level. The two NBFC giants … [+4112 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Tech Desk", "title": "If You See Auto Rickshaws Like This Then Know It’s For Google Maps - News18", "description": "Google India’s partner Tech Mahindra has got a new innovative and cost effective solution– use auto rickshaws to capture mapping data for Google Street View rollout across India.", "url": "https://www.news18.com/news/tech/if-you-see-auto-rickshaws-like-this-then-know-its-for-google-maps-5643841.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/screenshot-2022-07-28-at-6.40.37-pm-16590141563x2.png", "publishedAt": "2022-07-28T13:29:00Z", "content": "After a long wait of 11 years, Google has finally re-launched Street View in India after following necessary policy requirements. In order to be compliant with government regulations, Google has part… [+2000 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sagar Malviya", "title": "Indians buying less despite more shopping trips; small packs seeing higher sales growth: Kantar report - Economic Times", "description": "Consumers made 142 trips to stores on average during the year ended April compared to 135 trips during 2020. However, they purchased 966 grams per trip versus 1033 grams two years ago. The overall fast moving consumer goods (FMCG) market declined 1% by volume…", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/indians-buying-less-despite-more-shopping-trips-small-packs-seeing-higher-sales-growth-kantar-report/articleshow/93189718.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93189657,width-1070,height-580,imgsize-88670,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-28T12:19:00Z", "content": "Indians are making more shopping trips to grocery stores but buying over 7% fewer quantities compared to pre-pandemic levels, even shifting to unbranded products in some segments as household budgets… [+3396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Why Facebook's Meta saw its first-ever fall in sales - The Indian Express", "description": "Meta CEO Mark Zuckerberg said a major reason was the current economic downturn that impacted digital ad sales, Meta’s core business.", "url": "https://indianexpress.com/article/explained/meta-quarterly-revenue-decline-facebook-instagram-metaverse-8056489/", "urlToImage": "https://images.indianexpress.com/2022/07/Zuckerberg_AP_1-1.jpg", "publishedAt": "2022-07-28T12:15:33Z", "content": "After a decade of registering consistent growth and gravity-defying ad sales, all while fighting increasing regulatory scrutiny, Facebook parent Meta has posted its first-ever decline in quarterly re… [+3583 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Midcap stocks with high upside potential: Stock Reports Plus - Economic Times", "description": "The screener applies different algorithms for all BSE and NSE stocks. For the purpose of the article, we have analyzed and taken NSE stocks into consideration. The data used in screening down the stocks has been gathered from Refinitiv’s Stock Report Plus.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-stocks-with-high-upside-potential-stock-reports-plus/articleshow/93189334.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93189470,width-1070,height-580/photo.jpg", "publishedAt": "2022-07-28T12:12:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "M&M Finance posts net profit of Rs 240 cr in Q1; total income rises 14% - Business Standard", "description": "Mahindra amp Mahindra Financial Services on Thursday reported a consolidated net profit of Rs 240 crore for June quarter aided by fall in expenses and higher income from business operations", "url": "https://www.business-standard.com/article/companies/m-m-finance-posts-net-profit-of-rs-240-cr-in-q1-total-income-rises-14-122072800857_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-02/02/full/1643810251-4048.png", "publishedAt": "2022-07-28T12:01:00Z", "content": "Mahindra &amp; Mahindra Financial Services on Thursday reported a consolidated net profit of Rs 240 crore for June quarter aided by fall in expenses and higher income from business operations.\r\nThe c… [+2173 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Meet Neha Narkhede, the 8th richest Indian woman according to Hurun | Mint - Mint", "description": "Co-founder and former chief technology officer of cloud company Confluent gets 8th place among top 10 Indian women list", "url": "https://www.livemint.com/news/meet-neha-narkhede-the-8th-richest-indian-woman-according-to-hurun-11659003536631.html", "urlToImage": "https://images.livemint.com/img/2022/07/28/600x338/0x0_1659008804562_1659008813096_1659008813096.jpg", "publishedAt": "2022-07-28T11:47:31Z", "content": "Co-founder and former chief technology officer of cloud company Confluent Neha Narkhede has bagged the 8th position among the top 10 richest Indian women, according to the latest list compiled by res… [+1843 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "TVS Motor Q1 Result | Auto firm back in black, posts net profit of Rs 306 crore - Moneycontrol", "description": "On a standalone basis, its profit came in at Rs 321 crore as against Rs 53 crore logged in the first quarter of FY22, registering a growth of over four-fold.", "url": "https://www.moneycontrol.com/news/business/earnings/tvs-motor-q1-earnings-net-profit-comes-in-at-rs-306-crore-against-loss-yoy-8907351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/TVS2-770x431.jpg", "publishedAt": "2022-07-28T11:06:27Z", "content": "TVS Motor Company on July 28 said its consolidated profit for the quarter ended June (Q1FY23) stood at Rs 305.37 crore against a loss of Rs 10.55 crore posted in the same quarter last year.\r\nIts reve… [+1505 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Capital Market", "title": "Jubilant FoodWorks to acquire 40% stake in Roadcast Tech Solutions - Business Standard", "description": "", "url": "https://www.business-standard.com/article/news-cm/jubilant-foodworks-to-acquire-40-stake-in-roadcast-tech-solutions-122072800978_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/default/1220728/full-122072800978.jpg", "publishedAt": "2022-07-28T10:58:00Z", "content": "Jubilant FoodWorks has entered into Share Subscription Agreement, Shareholders' Agreement and Share Purchase Agreement dated 28 July 2022 to acquire 40% stake (fully diluted basis) in Roadcast Tech S… [+1855 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Oil extends gains as risk appetite improves, U.S. inventories fall By Reuters - Investing.com", "description": "Oil mixed as U.S. gasoline demand rebounds but recessionary fears loom", "url": "https://www.investing.com/news/commodities-news/oil-prices-edge-up-on-low-inventories-high-gasoline-demand-in-us-2855964", "urlToImage": "https://i-invdn-com.investing.com/news/fuel_pump_800x533_L_1412063399.jpg", "publishedAt": "2022-07-28T10:55:00Z", "content": "By Stephanie Kelly\r\nNEW YORK (Reuters) -Oil prices were mixed on Thursday as concerns about a potential global recession that would knock energy demand offset lower U.S. crude inventories and a rebou… [+2881 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pawan Nahar", "title": "Should you buy, sell or hold IndusInd Bank after Q1 results? - The Economic Times", "description": "IndusInd Bank reported a 61 per cent jump in net profit at Rs 1,631.02 crore for the quarter ended June 2022, mainly due to a fall in bad loans. The private sector lender had posted a net profit of Rs 1,016.11 crore in the year-ago period.In the first quarter…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/should-you-buy-sell-or-hold-indusind-bank-after-q1-results/articleshow/93186859.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93186919,width-1070,height-580,imgsize-25062,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T10:50:00Z", "content": "Brokerage firms are mixed on after its June quarter earnings. The Group-promoted private lender posted its best Q1 performance in the last five fiscal years.\r\nIndusInd Bank reported a 61 per cent jum… [+2610 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Sensex, Nifty hit 3-month! Key factors behind today’s rally - The Economic Times", "description": "The BSE m-cap was trading Rs 3.38 lakh crore higher at Rs 263.09 lakh crore from Tuesday's Rs 259.71 lakh crore mark.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-hit-over-2-month-high-key-factors-behind-todays-rally/articleshow/93180432.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93180424,width-1070,height-580,imgsize-8840,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T10:23:36Z", "content": "Hopes that the US Federal Reserve Bank may go slow on interest rate hikes after delivering an in line-75 basis points rate increase overnight sent domestic stocks soaring.\r\nDollar weakness, offering … [+4105 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "Bharath Rajeswaran", "title": "SBI Cards Shares Rise On Q1 Beat, Surge In New Accounts - BQ Prime", "description": "Shares of SBI Cards jumped over 4.4%, the most in three weeks.", "url": "https://www.bqprime.com/markets/sbi-cards-shares-rise-on-q1-beat-surge-in-new-accounts", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2022-07%2F6408de50-e8b4-4749-9519-14051dff4689%2Frupixen_com_Q59HmzK38eQ_unsplash.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-07-28T09:54:48Z", "content": "Shares of SBI Cards and Payment Services Ltd. gained the most in over five weeks after net income for June quarter beat average analyst estimates amid surge in new accounts.\r\nQ1FY2022-23 (Consolidate… [+906 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Vijay Shekhar Sharma seeks to reset Paytm after IPO fiasco - Economic Times", "description": "Describing his approach as a rewind-and-reset, Sharma is on a mission to win back investors. And hell have his hands full: Paytms operating losses widened over the past year to about $350 million, competition is intensifying and investors have lambasted the l…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-shekhar-sharma-seeks-to-reset-paytm-after-ipo-fiasco/articleshow/93185018.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93185063,width-1070,height-580,imgsize-34658,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T09:53:00Z", "content": "Paytm was the poster boy for Indias tech startups, only to lose two-thirds of its value since its IPO and become a symbol of the industrys crash. Now its founder promises a sharpened focus on financi… [+5570 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nabeel A Khan, ET Auto", "title": "Exclusive: Honda Cars to discontinue production & sale of Jazz, WR-V, and 4th Gen City in India - ETAuto", "description": "The company will stop producing Jazz after October 2022 while the crossover WR-V will not be produced beyond March 2023. The carmaker will also stop the production and sale of the 4th Generation Honda City by December 2022 in the country. However,  the 5th ge…", "url": "https://auto.economictimes.indiatimes.com/news/passenger-vehicle/exclusive-honda-cars-to-stop-production-and-sale-of-jazz-wr-v-and-4th-gen-city-in-india/93184553", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93184553,imgsize-865550,width-1200,height-628,overlay-etauto/exclusive-honda-cars-to-discontinue-production-sale-of-jazz-wr-v-and-4th-gen-city-in-india.jpg", "publishedAt": "2022-07-28T09:35:00Z", "content": "Honda Jazz (top right), Honda WR-V (midlle left) and Honda 4th Gen City (bottom right)\r\nNew Delhi: The local unit of the Japanese carmaker Honda Cars India (HCIL) will discontinue the production and … [+4018 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Bank of Baroda hikes interest rates on fixed deposits: Check complete details | Mint - Mint", "description": "Interest rates on fixed deposits below  ₹2 crore have been increased by public sector lender Bank of Baroda (BOI).", "url": "https://www.livemint.com/money/personal-finance/bank-of-baroda-hikes-interest-rates-on-fixed-deposits-check-complete-details-11658998537966.html", "urlToImage": "https://images.livemint.com/img/2022/07/28/600x338/TTSMNW9Y_1598376878071_1598376881542_1658998625801_1658998625801.jpg", "publishedAt": "2022-07-28T09:02:43Z", "content": "Interest rates on fixed deposits below 2 crore have been increased by the public sector lender Bank of Baroda (BOI). The new rates are in effect as of today, July 28, 2022, according to the bank's of… [+1939 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Mohammad Haris", "title": "BSNL's Rs 1.64-Lakh-Crore Package: Know Why It Needed Govt Support, How It's Been Helped So Far - News18", "description": "BSNL's losses in 2019-20 stood at Rs 15,500 crore, which halved to Rs 7,441 crore in 2020-21", "url": "https://www.news18.com/news/business/bsnl-revival-package-know-why-it-needed-govt-support-how-its-been-helped-so-far-5640535.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/bsnl-165899751016x9.jpg", "publishedAt": "2022-07-28T08:44:27Z", "content": "Even as the government has approved the Rs 1.64-lakh-crore revival package for BSNL, the results in the improvement in the company are expected to be visible in the next two years. The package will b… [+3331 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "Amit Sharma", "title": "Bajaj-Triumph 1st Motorcycle & A new 125cc Bike Launch In 2023 - India Car News", "description": "Bajaj and Triumph are jointly working on a new range of affordable motorcycles for India as well as global markets. In fact, two differently styled motorcycles – Scrambler and Roadster – have already been spotted testing on foreign soil. However, the JV is ye…", "url": "https://www.indiacarnews.com/news/bajaj-triumph-1st-motorcycle-a-new-125cc-bike-launch-in-2023-53284/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2022/02/Bajaj-Triumph-Motorcycle-spied-1000x600.jpg", "publishedAt": "2022-07-28T08:37:30Z", "content": "Bajaj and Triumph are jointly working on a new range of affordable motorcycles for India as well as global markets. In fact, two differently styled motorcycles – Scrambler and Roadster – have already… [+2470 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Foreign funds flow turns positive in July after 10 months. Have outflows bottomed out? - Moneycontrol", "description": "FIIs pulled out over $29 billion in 10 months of sustained selling of Indian equities with June recording the peak at $6.4 billion. But in July, with the foreign investors turned net buyers. When read along with other signals, it indicates a bottom-out in sel…", "url": "https://www.moneycontrol.com/news/business/markets/foreign-funds-flow-turns-positive-in-july-after-10-months-have-outflows-bottomed-out-8905521.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/rupee_dollar-770x433.jpg", "publishedAt": "2022-07-28T08:27:00Z", "content": "The evolving dynamics of foreign institutions invested in Indian equities is sending out confusing signals.\r\nThe FIIs pulled out over $29 billion in the last 10 months of sustained selling of Indian … [+2310 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tanya Aneja", "title": "Zomato rebounds after brutal selloff! Should you buy or steer clear? - The Economic Times", "description": "The current valuation of $4.5 billion is still above the initial investment price of many pre-IPO investors, triggering a selloff. New investors should let the price settle in, there will still be lots of opportunities to invest in Zomato. Also, one should lo…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/zomato-rebounds-after-brutal-selloff-wheres-it-headed-now/articleshow/93182498.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93182506,width-1070,height-580,imgsize-16448,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T08:08:00Z", "content": "After facing a sharp drawdown in the initial part of the week, shares of bounced back sharply on Wednesday and were up in Thursday's early trade as well. Where is the stock headed in the near term an… [+2700 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Jubilant Foodworks Q1 result | Profit jumps 63% YoY to Rs 113 crore, revenue up 40% - Moneycontrol", "description": "Jubilant Foodworks Q1 result: Dine-in and takeaway channels combined witnessed strong sequential growth, while momentum continued in the delivery channel, the company said", "url": "https://www.moneycontrol.com/news/business/earnings/jubilant-foodworks-q1-result-profit-jumps-63-yoy-to-rs-113-crore-revenue-up-40-8905481.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/09/Dominos-Pizza-770x433.jpg", "publishedAt": "2022-07-28T07:18:50Z", "content": "Jubilant Foodworks, the master franchisee of Domino's Pizza in India, Bangladesh, Sri Lanka and Nepal, on July 28 reported a 63 percent year-on-year growth in consolidated profit at Rs 112.6 crore fo… [+1882 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ritesh Presswala", "title": "Multibaggers: These 17 stocks have given high returns in short and long term - Moneycontrol", "description": "A Moneycontrol analysis of BSE 500 stocks showed only 17 stocks have given exceptional returns in last 1-year, 3-year and 5-year periods. SRF, Tata Elxsi and Adani Power figure on the list.", "url": "https://www.moneycontrol.com/news/photos/business/stocks/multibaggers-these-17-stocks-have-given-high-returns-in-short-and-long-term-8897841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_1153099931-1-770x433.jpg", "publishedAt": "2022-07-28T05:15:53Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Tata Motors sold 9,300 electric cars in Q2, expects record year in EV sales - HT Auto", "description": "Tata Motors recently launched the Nexon EV Prime, the third version of its best-selling electric SUV brand. The Nexon EV helps Tata's electric cars to contribute seven per cent to its overall sales.", "url": "https://auto.hindustantimes.com/auto/electric-vehicles/tata-motors-bullish-on-ev-growth-sold-9-300-electric-cars-in-q2-41658980169219.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/07/28/1600x900/Tata_Nexon_EV_Max_1652754329174_1658980285608_1658980285608.png", "publishedAt": "2022-07-28T04:10:12Z", "content": "Tata Motors is aiming to consolidate its position as the leader of electric four-wheeler passenger vehicle segment in India. The carmaker ended the first quarter of the financial year with 9,300 EVs … [+1692 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Inflation, price rise could dent India's gold demand in July-Dec: WGC - Economic Times", "description": "India's annual inflation rate in June remained painfully above the 7% mark and beyond the central bank's tolerance band for the sixth month in a row, raising the prospects for more rate hikes by the central bank next month.", "url": "https://economictimes.indiatimes.com/news/economy/indicators/inflation-price-rise-could-dent-indias-gold-demand-in-july-dec-wgc/articleshow/93176060.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93176053,width-1070,height-580,imgsize-77342,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-28T03:37:00Z", "content": "MUMBAI: India's gold demand in the first half of 2022 jumped 42% from a year ago but consumption in the second half could be lower than last year as higher inflation erodes disposable income, the Wor… [+1651 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Tata Motors shares: Why brokerages are bullish post Q1 results despite widening loss | Mint - Mint", "description": "Tata Motors expects JLR performance to improve significantly starting Q2 FY23", "url": "https://www.livemint.com/market/stock-market-news/tata-motors-share-price-should-you-buy-sell-or-hold-post-q1-results-11658976261803.html", "urlToImage": "https://images.livemint.com/img/2022/07/28/600x338/tata_motors_shares_1658976528555_1658976528750_1658976528750.jpg", "publishedAt": "2022-07-28T03:07:41Z", "content": "Shares of Tata Motors plunged 2% to 434 apiece on the BSE in Thursday's opening deals after consolidated net loss widened to 4,951 crore for the June quarter, from 4,451 crore loss a year earlier, pr… [+2238 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Brokerages raise price targets on Asian Paints - Economic Times", "description": "Asian Paints' strong revenue delivery and market share gains are impressive; however, rich valuation at 57 times FY24 estimated earnings per share, especially in the context of Grasim's impending entry limits any upside,  said Axis Capital.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-bullish-on-asian-paints/articleshow/93173914.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93173915,width-1070,height-580,imgsize-942548,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-28T01:08:00Z", "content": "Brokerages have raised their price targets on Asian Paints as its June quarter earnings surprised positively but they also warned of near-term inflationary headwinds and rising competition.\r\nAsian Pa… [+736 chars]"}]}