{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "How the war in Ukraine has affected automotive supply chains - Moneycontrol", "description": "Existing supply chain issues are likely to exacerbate as the crisis in Ukraine continues", "url": "https://www.moneycontrol.com/news/automobile/how-the-war-in-ukraine-has-affected-automotive-supply-chains-8247241.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/07/India_Auto-cars-770x433.jpg", "publishedAt": "2022-03-18T06:15:44Z", "content": "The Russia-Ukraine conflict has, expectedly, worsened the existing logistical and supply chain issue that has already been plaguing the global automotive industry. Reports from all quarters are point… [+3908 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Tata Motors to soon buy Ford’s Sanand car factory - CarToq.com", "description": "According to ET Auto, Tata Motors and Ford India have submitted a proposal Gujarat Government for transfer of ownership of the Sanand manufacturing plant. The plant belongs to Ford India right now, it was used for manufacturing 2.4 lakh units of vehicles and …", "url": "https://www.cartoq.com/tata-motors-to-soon-buy-fords-sanand-car-factory/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/Fords-plant-taken-by-Tata-featured.jpg", "publishedAt": "2022-03-18T06:10:13Z", "content": "According to ET Auto, Tata Motors and Ford India have submitted a proposal Gujarat Government for transfer of ownership of the Sanand manufacturing plant. The plant belongs to Ford India right now, i… [+2919 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Goh Chiew Tong", "title": "Indian beauty company Nykaa looks to physical retail expansion to meet consumer demand for offline sales - CNBC", "description": "\"A lot of beauty is sold offline and Nykaa has become such a big brand that we cannot ignore our offline channel as well as offline consumers,\" she said.", "url": "https://www.cnbc.com/2022/03/18/indian-beauty-company-nykaa-looks-to-physical-retail-expansion.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107031845-1647496106748-gettyimages-1237476754-AFP_9VC6P4.jpeg?v=1647580159&w=1920&h=1080", "publishedAt": "2022-03-18T05:09:48Z", "content": "While Nykaastarted as an e-commerce platform, founder and CEO Falguni Nayar is a \"big believer\" in physical retail and said there is demand from consumers.\r\n\"The last two years have been very much im… [+2235 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Harry Dempsey", "title": "Russian oil exports to India surge as Europe shuns cargoes - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/5efc6338-3f01-4015-aedf-53a4a1944ca8", "urlToImage": null, "publishedAt": "2022-03-18T05:00:53Z", "content": "Expert insights, analysis and smart data help you cut through the noise to spot trends,\r\nrisks and opportunities.\r\nJoin over 300,000 Finance professionals who already subscribe to the FT."}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Is Stock Market Open Today? Check NSE, BSE, MCX Trading Timing on Holi 2022 - News18", "description": "Multi Commodity Exchange (MCX) will open during the second half of the session 5 pm to 11.30 pm, but BSE and NSE will close for the entire day.", "url": "https://www.news18.com/news/business/markets/is-stock-market-open-today-check-nse-bse-mcx-trading-timing-on-holi-2022-4886009.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/b1f5784d04674d5f99f36015b0f8980f-1-164757616416x9.jpg", "publishedAt": "2022-03-18T04:02:58Z", "content": "Stock Market Holiday: All trading activities across the nation will be closed today on the account of Holi festival, including action at stock markets. On Friday, March 18, all trading operations inc… [+2858 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "6 new Maruti Suzuki cars launching in the next 3 months - CarToq.com", "description": "Maruti Suzuki is bringing a slew of cars to the Indian market. The brand has already launched new cars like the new-gen Baleno, WagonR and Dzire CNG. Yet, the largest carmaker in the country is not done. Maruti Suzuki plans to bring in many more models in the…", "url": "https://www.cartoq.com/6-new-maruti-suzuki-cars-launching-in-the-next-3-months/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/upcoming-maruti-cars.jpg", "publishedAt": "2022-03-18T03:16:35Z", "content": "Maruti Suzuki is bringing a slew of cars to the Indian market. The brand has already launched new cars like the new-gen Baleno, WagonR and Dzire CNG. Yet, the largest carmaker in the country is not d… [+3052 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "EU Regulators Warn Crypto Unsuitable as Investment or Means of Payment for Most Retail Consumers – Regulation Bitcoin News - Bitcoin News", "description": "Several European regulators have issued a joint warning on crypto assets. “These assets are not suited for most retail consumers as an investment or as a means of payment or exchange,\" they stressed.", "url": "https://news.bitcoin.com/eu-regulators-warn-crypto-unsuitable-as-investment-or-means-of-payment-for-most-retail-consumers/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/03/eu.jpg", "publishedAt": "2022-03-18T03:03:20Z", "content": "Several European regulators have issued a joint warning on crypto assets. “These assets are not suited for most retail consumers as an investment or as a means of payment or exchange,” they stressed.… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ashutosh Shyam", "title": "Merger of Ashok Leyland group companies may create value - Economic Times", "description": "The merger of Ashok Leyland subsidiary Hinduja Leyland Finance (HLF) with NxtDigital, the media company of the Hinduja Group, is likely to create incremental value for the shareholders of Ashok Leyland. As a result, investor sentiment around the stock of Asho…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/merger-of-ashok-leyland-group-companies-may-create-value/articleshow/90302663.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90302676,width-1070,height-580,imgsize-190192,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-18T02:44:00Z", "content": "ET Intelligence Group: The merger of Ashok Leyland subsidiary Hinduja Leyland Finance (HLF) with NxtDigital, the media company of the Hinduja Group, is likely to create incremental value for the shar… [+1404 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rakesh Jhunjhunwala earns ₹861 crore from these two stocks in one day - Mint", "description": "Rakesh Jhunjhunwala holds 4,52,50,970 Titan Company shares and Titan share price ascended  ₹118.70 on Thursday. So, net rise in Rakesh Jhunjhunwala's net worth is around  ₹537 crore", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-net-worth-rises-rs-861-crore-from-these-two-stocks-in-one-day-11647570936239.html", "urlToImage": "https://images.livemint.com/img/2022/03/18/600x338/5244bf12-7a11-11ec-9eea-9c1e2652c262_1644643836353_1647571092359.jpg", "publishedAt": "2022-03-18T02:42:31Z", "content": "Rakesh Jhunjhunwala portfolio: Amid sharp upside movement on Thursday trade session, ace Indian investor Rakesh Jhunjhunwala's net worth grew around 861 crore after decent rise in his two portfolio s… [+1792 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Why Biden’s idea of digital dollar is good news for cryptocurrency investors in India - Moneycontrol", "description": "A month after India’s union Budget 2022 announced the arrival of a digital Rupee, US President Joe Biden signed an executive order in the US to lay out a national policy for digital assets and a digital dollar.", "url": "https://www.moneycontrol.com/news/business/personal-finance/why-bidens-idea-of-digital-dollar-is-good-news-for-cryptocurrency-investors-in-india-8243361.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/09/Cryptocurrency-Bitcoin-770x433.jpg", "publishedAt": "2022-03-18T01:36:05Z", "content": "On March 9, US President Joe Biden signed an executive order directing various government agencies to address the risks and harness the potential benefits of digital assets, including cryptocurrencie… [+5511 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "What are potential side-effects of a bad credit score? - Moneycontrol", "description": "A bad credit score can reduce your chances of getting a fresh credit line", "url": "https://www.moneycontrol.com/news/business/personal-finance/what-are-potential-side-effects-of-a-bad-credit-score-8244151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Debt-770x433.jpg", "publishedAt": "2022-03-18T01:32:18Z", "content": "Banks, non-banking finance companies (NBFCs) and micro-financiers analyse the credit scores of individuals to ascertain their creditworthiness and attitude towards repaying debt. Credit reports are v… [+3886 chars]"}, {"source": {"id": null, "name": "CryptoGlobe"}, "author": "Francisco Memoria", "title": "Bitcoin ($BTC) Is Likely Going to Keep ‘Outperforming Gold, Stock Market’, Says Bloomberg Analyst - CryptoGlobe", "description": "Bloomberg commodity strategist Mike McGlone has weighed in on Bitcoin’s performance as inflation surges, interest rates rise, and Ukraine deals with a large-scale invasion from Russia. In a tweet shared with his followers on social media, McGlone noted that t…", "url": "https://www.cryptoglobe.com/latest/2022/03/bitcoin-btc-is-likely-going-to-keep-outperforming-gold-stock-market-says-bloomberg-analyst/", "urlToImage": "https://cryptoglobe.s3.eu-west-2.amazonaws.com/2021/09/gold-and-red-bitcoin-on-table-768x576.jpg", "publishedAt": "2022-03-18T01:24:08Z", "content": "Bloomberg commodity strategist Mike McGlone has weighed in on Bitcoins performance as inflation surges, interest rates rise, and Ukraine deals with a large-scale invasion from Russia.\r\nIn a tweet sha… [+2312 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "2022 Toyota Glanza CNG variant launch confirmed - CarToq.com", "description": "Toyota Kirloskar Motor recently launched the 2022 version of Toyota Glanza which is based on the new age Maruti Baleno. With fuel prices likely to go up in the coming times, Toyota is now planning to introduce CNG in their vehicles. The first model to get a f…", "url": "https://www.cartoq.com/2022-toyota-glanza-cng-variant-launch-confirmed/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/glanza-featured.jpg", "publishedAt": "2022-03-18T01:18:45Z", "content": "Toyota Kirloskar Motor recently launched the 2022 version of Toyota Glanza which is based on the new age Maruti Baleno. With fuel prices likely to go up in the coming times, Toyota is now planning to… [+2982 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Mike Novogratz Expects Bitcoin to Hit $500K — Says BTC Is a Great Alternative in Economies With Poor Stewardship – Markets and Prices Bitcoin News - Bitcoin News", "description": "Galaxy Digital CEO Mike Novogratz says bitcoin is a great alternative and a lifeline to people in countries with poor stewardship of the economy. He expects the price of the cryptocurrency to hit $500K.", "url": "https://news.bitcoin.com/mike-novogratz-expects-bitcoin-to-hit-500k-btc-great-alternative-in-economies-with-poor-stewardship/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/03/novogratz.jpg", "publishedAt": "2022-03-18T00:37:05Z", "content": "Galaxy Digital CEO Mike Novogratz says bitcoin is a great alternative and a lifeline to people in countries with poor stewardship of the economy. He expects the price of the cryptocurrency to hit $50… [+3519 chars]"}, {"source": {"id": null, "name": "Ambcrypto.com"}, "author": "Manisha Mishra", "title": "122% gains for SHIB in store only if the uptrend extends up to... - AMBCrypto News", "description": "Shiba Inu’s price has remained lull for quite some time now. However, the last time this type of price action occurred was in September 2021, which was followed by an exponential move that more than doubled SHIB. The expectation of a volatile event From 29 Oc…", "url": "https://ambcrypto.com/a-122-gain-for-shib-awaits-only-if-the-uptrend-could-extend-up-to/", "urlToImage": "https://files.ambcrypto.com/wp-content/uploads/2022/03/17185453/pexels-photo-4588010-1000x600.jpeg", "publishedAt": "2022-03-18T00:30:39Z", "content": "Shiba Inu’s price has remained lull for quite some time now. However, the last time this type of price action occurred was in September 2021, which was followed by an exponential move that more than … [+2258 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "8 US Lawmakers Urge SEC to Stop Crippling Crypto, Stifling Innovation – Regulation Bitcoin News - Bitcoin News", "description": "Eight U.S. lawmakers have sent a letter to the chairman of the U.S. Securities and Exchange Commission (SEC) regarding how the agency collects information from crypto companies.", "url": "https://news.bitcoin.com/8-us-lawmakers-urge-sec-to-stop-crippling-crypto-stifling-innovation/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/03/letter-to-sec.jpg", "publishedAt": "2022-03-17T22:57:15Z", "content": "Eight U.S. lawmakers have sent a letter to the chairman of the U.S. Securities and Exchange Commission (SEC) regarding how the agency collects information from crypto companies. According to the cryp… [+3296 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft Data Centres To Heat Homes In Finland, Cutting Carbon Emissions - NDTV", "description": "Finnish utility Fortum said on Thursday it will use waste heat from two new Microsoft data centres to warm homes and businesses in and around the capital Helsinki, while also cutting carbon emissions.", "url": "https://www.ndtv.com/world-news/microsoft-data-centres-to-heat-homes-in-finland-cutting-carbon-emissions-2829518", "urlToImage": "https://c.ndtvimg.com/2021-05/kr18cd1g_microsoftafp_625x300_21_May_21.jpg", "publishedAt": "2022-03-17T21:19:11Z", "content": "Fortum said its investment for heat capture side from data centres was estimated at 200 million euros.\r\nOslo: Finnish utility Fortum said on Thursday it will use waste heat from two new Microsoft dat… [+1512 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Zhiyuan Sun", "title": "RBI seemingly wants to ban cryptocurrencies, but not for the reasons you might think - Cointelegraph", "description": "\"Digital assets threaten the financial sovereignty of a country and make it susceptible to strategic manipulation,\" writes the RBI report.", "url": "https://cointelegraph.com/news/rbi-seemingly-wants-to-ban-cryptocurrencies-but-not-for-the-reasons-you-might-think", "urlToImage": "https://images.cointelegraph.com/images/1200_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMDMvNDExOWFiMmEtYzMzNS00ODEzLWFlNGItZjI1ZWJmYWUxNGY0LmpwZw==.jpg", "publishedAt": "2022-03-17T20:30:36Z", "content": "On Thursday, the Reserve Bank of India, or RBI, the country's central bank, published a critical bulletin regarding the cryptocurrency industry. While the report praised the innovative distributed le… [+1953 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sarita C Singh", "title": "Solar PLI scheme may be split - Economic Times", "description": "The pilot round of the scheme with ₹4,500 crore budgetary allocation was proposed to promote the integration of the process and was awarded to three companies - Reliance New Energy, Shirdi Sai Electricals and Jindal India Solar - that committed module manufac…", "url": "https://economictimes.indiatimes.com/industry/renewables/solar-pli-scheme-may-be-split/articleshow/90299610.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90299713,width-1070,height-580,imgsize-56554,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-17T18:47:00Z", "content": "The 19,500 crore production-linked incentive (PLI) scheme for solar power equipment is likely to be split into two or three buckets to include various companies that are at different levels of indige… [+1243 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "PancakeSwap (CAKE) vs Hedera (HBAR) vs Seesaw Protocol (SSW) - Crypto Investments in March - Analytics Insight", "description": "Hedera (HBAR) and PancakeSwap (CAKE) are two coins that are not in the top 25 on the prominent cryptocurrency listing platform CoinMarketCap that may be worth looking into. In addition to these two initiatives, there is a new release that is causing quite a c…", "url": "https://www.analyticsinsight.net/pancakeswap-cake-vs-hedera-hbar-vs-seesaw-protocol-ssw-crypto-investments-in-march/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/03/PancakeSwap.jpeg", "publishedAt": "2022-03-17T18:33:11Z", "content": "PancakeSwap\r\nSeveral cryptocurrencies, ranging from Bitcoin (BTC) to Curve DAO Token (CRV), experienced both dips and rises throughout the week of March 5th-11th. The volatility of the cryptocurrency… [+3376 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "US dollar hits lowest in week as investors gauge Fed policy, euro firmer - Moneycontrol", "description": "The Fed's monetary policy turned hawkish with its quarter-percentage-point rate increase Wednesday and projection that the federal funds rate would reach a range of 1.75% to 2% by the end of 2022 and 2.8% next year, but the central bank did not deliver a toug…", "url": "https://www.moneycontrol.com/news/business/us-dollar-hits-lowest-in-week-as-investors-gauge-fed-policy-euro-firmer-8246321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Dollar-Bill_AP-770x433.jpg", "publishedAt": "2022-03-17T17:10:22Z", "content": "The United States dollar fell on Thursday and hit its lowest in a week as investors digested the Federal Reserve's monetary policy outlook a day after the U.S. central bank's expected interest rate h… [+2249 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Seshan Vijayraghvan", "title": "carandbike Awards 2022: Car Of The Year - Volkswagen Taigun - carandbike", "description": "The Volkswagen Taigun had to compete with some strong contenders like Mahindar XUV700, Citroen C5 Aircross, and Tata Punch, among others to win the 2022 CNB Car of the Year award.", "url": "https://www.carandbike.com/news/carandbike-awards-2022-car-of-the-year-volkswagen-taigun-2829319", "urlToImage": "https://c.ndtvimg.com/2022-03/00c1urdg_2022-carandbike-car-of-the-year-vw-taigun_625x300_17_March_22.jpeg", "publishedAt": "2022-03-17T17:09:09Z", "content": "The Volkswagen Taigun compact SUV has bagged the coveted Car of the Year award, at the 2022 carandbike Awards. The compact SUV had to compete with some strong contenders like Mahindar XUV700, Citroen… [+1496 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Bitgert Shall Reach $1B Marketcap In Next 30 Days - Analytics Insight", "description": "The biggest question most crypto investors are asking today is where Bitgert (BRISE) will be in the next 30 days. YES. Bitgert marketcap has the potential to reach a billion and even more in the next 30 days.", "url": "https://www.analyticsinsight.net/bitgert-shall-reach-1b-marketcap-in-next-30-days/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/03/Bitgert-Marketcap.jpeg", "publishedAt": "2022-03-17T16:46:56Z", "content": "Bitgert Marketcap\r\nThe biggest question most crypto investors are asking today is where Bitgert (BRISE) will be in the next 30 days. The past 30 days have been fantastic for this project since the pr… [+2527 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Varinder Singh", "title": "BAYC’s ApeCoin ($APE) Price Falls By 80% On First Day Of Trading - CoinGape", "description": "Bored Ape Yacht Club (BAYC) NFT collection's ApeCoin (APE) native token surged to $40 before falling back to $6.4 after its listing on crypto various crypto exchanges. Currently, the ApeCoin price is fluctuating between $10-$20. The fully diluted volume (FDV)…", "url": "https://coingape.com/bayc-apecoin-ape-price-falls-by-80-percent-first-day/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/03/17194826/unnamed-122.png", "publishedAt": "2022-03-17T16:30:37Z", "content": "Bored Ape Yacht Club (BAYC) NFT collection’s ApeCoin (APE) native token surged to $40 before falling back to $6.4 after its listing on crypto various crypto exchanges. Currently, the ApeCoin price is… [+2754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: What is Ukraine’s new law on cryptocurrencies? - The Indian Express", "description": "Ukraine's President Volodymyr Zelenskyy has signed a law to legalise cryptocurrencies. What is the law, and why has it been signed now? What are the global experiences in legalising cryptocurrencies?", "url": "https://indianexpress.com/article/explained/ukraine-cryptocurrency-law-regulation-explained-7824014/", "urlToImage": "https://images.indianexpress.com/2022/03/Ukraine-1-16.jpg", "publishedAt": "2022-03-17T16:22:44Z", "content": "Ukraine, which is at war with Russia, has decided to establish a legal framework through which cryptocurrencies can be operated in the country in a regulated ecosystem. The countrys parliament had in… [+4087 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "'BUY!': Amid market rout, Paytm finds unlikely support from its critic Ashneer Grover - Mint", "description": "Former BharatPe CEO and MD Ashneer Grover says “Paytm stock is a screaming BUY!”", "url": "https://www.livemint.com/news/india/amid-market-rout-paytm-finds-unlikely-support-from-its-critic-ashneer-grover-11647530611106.html", "urlToImage": "https://images.livemint.com/img/2022/03/17/600x338/e5835f0e-f465-11eb-8db7-efbdfae8b131_1628011353337_1647533044435.jpg", "publishedAt": "2022-03-17T16:05:17Z", "content": "The share of Vijay Shekhar Sharma-led Paytm is one of the most hotly-debated stocks these days. Amid the debate whether it's the right time to buy the Paytm share amid dip or one should hold or sell,… [+2485 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dia Rekhi", "title": "An 'India plus' is going to happen in every industry: Tata Sons Chairman N Chandrasekaran - Economic Times", "description": "An India plus is going to happen in every industry,  he said.  I don't want to say an alternative to China but an India plus. And the push will come. It will happen in materials, it is going to happen in chemicals, it is going to happen in electronics, semico…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/an-india-plus-is-going-to-happen-in-every-industry-tata-sons-chairman-n-chandrasekaran/articleshow/90297606.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90297974,width-1070,height-580,imgsize-143680,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-17T15:41:00Z", "content": "Tata Sons Chairman, N Chandrasekaran said that there is going to be an \"India plus\" that is going to happen in every industry while delivering his keynote speech on Thursday in Chennai at United Way … [+3230 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Oil surges 7% amid warnings of Russian supply shortages - Moneycontrol", "description": "Benchmark Brent crude futures gained $7.47, or 7.6%, to $105.49 a barrel by 1427 GMT. U.S. West Texas Intermediate (WTI) crude was up $6.85, or 7.2%, to $101.89 a barrel.", "url": "https://www.moneycontrol.com/news/world/oil-surges-7-amid-warnings-of-russian-supply-shortages-8245941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/crude-oil-770x433.jpg", "publishedAt": "2022-03-17T14:53:44Z", "content": "Oil prices climbed over 7% on Thursday after the International Energy Agency (IEA) said three million barrels per day (bpd) of Russian oil and products could be shut in from next month and despite th… [+1485 chars]"}, {"source": {"id": null, "name": "BloombergQuint"}, "author": "Nishant Sharma", "title": "Ola Electric, RIL Among Four Firms To Win Bids To Make Tesla-Style Gigafactories - BloombergQuint", "description": "The winning bidders will manufacture a total of 50 gigawatt hours of advanced chemistry cells.", "url": "https://www.bloombergquint.com/business/ola-electric-ril-among-four-firms-to-win-bids-to-make-tesla-style-gigafactories", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2021-11%2F1f8683b1-12a6-454b-a9bd-18e55d9793b9%2FCables_and_lithium_ion_battery_components_sit_on_the_production_line__Photographer_Krisztian_BocsiBl.jpg?rect=0%2C126%2C4000%2C2100&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-17T14:07:07Z", "content": "According to the production-linked incentive scheme for battery cells, the selected companies will have to set up their factories within two years. Incentives will be disbursed over a span of five ye… [+974 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "All-new Royal Enfield Bullet 350 caught testing before launch - CarToq.com", "description": "After reintroducing its highest-selling model, the Classic 350, with a new engine and several other changes, Royal Enfield is all set to give a major makeover to its next high-selling model, the Bullet 350. Recently, a test mule of a motorcycle resembling the…", "url": "https://www.cartoq.com/all-new-royal-enfield-bullet-350-caught-testing-before-launch/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/royal-enfield-bullet-350-spied-testing.jpg", "publishedAt": "2022-03-17T13:57:41Z", "content": "After reintroducing its highest-selling model, the Classic 350, with a new engine and several other changes, Royal Enfield is all set to give a major makeover to its next high-selling model, the Bull… [+2608 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Ola S1 Pro price to be hiked post current purchase window - HT Auto", "description": "Ola S1 Pro India price: The purchase window for Ola S1 Pro opens for everyone interested on Friday while those who have reserved a unit have an early bird access.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/ola-s1-pro-price-to-be-hiked-post-current-purchase-window-41647524494453.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/03/17/600x338/Ola_S1_Pro_HT_Auto_5_1636954948381_1647524745820.jpg", "publishedAt": "2022-03-17T13:46:54Z", "content": "Ola S1 Pro has managed to once again sell like hotcakes according to Ola Electric and CEO Bhavish Aggarwal took to Twitter to announce that price for the Ola S1 Pro would be hiked once the current pu… [+1468 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Oyo rejigs top brass amid delay in IPO - Moneycontrol", "description": "The timing is crucial as the company has been delaying its much awaited $1.2-billion initial public offer.", "url": "https://www.moneycontrol.com/news/business/startup/oyo-rejigs-top-brass-amid-delay-in-ipo-8245251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Oyo-1-770x433.jpg", "publishedAt": "2022-03-17T13:43:26Z", "content": "In a major rejig, Softbank-backed Oyo has elevated Ankit Gupta to be the chief executive officer of India, transitioning existing chief executive Rohit Kapoor to the position of company's global mark… [+2896 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Toyota Mirai | India’s first hydrogen fuel cell vehicle is here - Moneycontrol", "description": "The Toyota Mirai has just been launched as a pilot project.", "url": "https://www.moneycontrol.com/news/business/indias-first-hydrogen-fuel-cell-vehicle-is-here-8245151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/Mirai-1-652x435.jpeg", "publishedAt": "2022-03-17T13:21:17Z", "content": "Toyota has launched the Mirai, making it Indias first hydrogen fuel cell EV (FCEV). Union Minister of Road Transport and Highways Nitin Gadkari, who unveiled the sedan, also announced that Toyotas re… [+2390 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Audi A6 Avant e-tron Concept Unveiled With A Jaw-Dropping Design - GaadiWaadi.com", "description": "Audi A6 Avant e-tron Concept is based on the PPE (Premium Platform Electric) architecture jointly developed with Porsche", "url": "https://gaadiwaadi.com/audi-a6-avant-e-tron-concept-unveiled-with-a-jaw-dropping-design/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/03/Audi-A6-e-tron-Avant-Concept.jpg", "publishedAt": "2022-03-17T13:00:08Z", "content": "Audi has unveiled the A6 Avant e-tron concept and is not a one-off display design giving rise to a possible production electric estate in 2024. It is based on the A6 Sportback e-tron concept displaye… [+1900 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Netflix may soon charge you extra for sharing your account password - The Indian Express", "description": "Netflix is testing charging accounts extra money for adding sub-accounts that login from outside the household.", "url": "https://indianexpress.com/article/technology/tech-news-technology/netflix-may-soon-charge-you-extra-for-sharing-your-password-7823947/", "urlToImage": "https://images.indianexpress.com/2022/03/Netflix.jpg", "publishedAt": "2022-03-17T12:52:21Z", "content": "Netflix password sharing is very common, with multiple people sharing the same subscription not just across devices, but also across households. Netflix is adding features like separate user profiles… [+1962 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Hyundai Venue Facelift spotted on Indian roads: Launch in July - CarToq.com", "description": "Hyundai India launched its first sub-compact SUV, Venue back in 2019. So, it now needs a mid-cycle refresh to stay competitive in the Indian market. Fortunately, the Korean manufacturer is already working on a facelift version of the Venue. It is slated to la…", "url": "https://www.cartoq.com/hyundai-venue-facelift-spotted-on-indian-roads-launch-in-july/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/venue-facelift-spotted-in-india-featured.jpg", "publishedAt": "2022-03-17T12:05:37Z", "content": "Hyundai India launched its first sub-compact SUV, Venue back in 2019. So, it now needs a mid-cycle refresh to stay competitive in the Indian market. Fortunately, the Korean manufacturer is already wo… [+2924 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Mukesh Ambani becomes 'Richest Indian & Asian' Nykaa founder Falguni Nayar newest billionaire - Times of India", "description": "Publishing group Hurun India has released its 2022 Global Rich list. And it holds both new and old contenders from India. According to this list, among Indian billionaires, Ambani ranked first with a net worth of $103 billion, followed by Gautam Adani with a …", "url": "https://timesofindia.indiatimes.com/videos/toi-original/mukesh-ambani-becomes-richest-indian-asian-nykaa-founder-falguni-nayar-newest-billionaire/videoshow/90292190.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90292190,imgsize-55982.cms", "publishedAt": "2022-03-17T11:44:56Z", "content": "Mar 17, 2022, 05:14PM ISTSource: TOI.inPublishing group Hurun India has released its 2022 Global Rich list. And it holds both new and old contenders from India. According to this list, among Indian b… [+435 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Tata Housing starts sale of plots in 140-acre project near Bengaluru airport - Mint", "description": "The 140-acre site will house residential complexes, commercial institutions, parks, green spaces, clubhouses, and other amenities, according to the official statement.", "url": "https://www.livemint.com/companies/news/tata-housing-starts-sale-of-plots-in-140-acre-project-near-bengaluru-airport-11647514748494.html", "urlToImage": "https://images.livemint.com/img/2018/12/28/600x338/Companies_-_News_1545993790355.jpg", "publishedAt": "2022-03-17T11:30:13Z", "content": "BENGALURU :\r\nTATA Housing has started sale of pre-engineered plots under the name and style Swaram. These plots are located near Bengaluru airport , within the upcoming 140 acres megacity, an officia… [+3650 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikunj Dalmia", "title": "Rising rate cycle may crush overpriced largecaps & new age listings: Shankar Sharma - Economic Times", "description": "“While conventionally smallcaps gets crushed in a rising interest rate cycle, what will get crushed in the Indian market and what will underperform the markets will be the largecaps and the new age listings, not the smallcap stocks. Both the largecaps and new…", "url": "https://economictimes.indiatimes.com/markets/expert-view/rising-rate-cycle-may-crush-overpriced-largecaps-new-age-listings-shankar-sharma/articleshow/90291318.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90291283,width-1070,height-580,imgsize-99237,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T11:08:00Z", "content": "On individual companies in the smallcap space, the worst is over for a number of them. They have made their lows 15-20 days back, says Shankar Sharma, Co-founder, First Global.If we are moving toward… [+6835 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Meghna Chadha", "title": "Nifty bulls partying non-stop on Holi even after Powell turns bad cop - Economic Times", "description": "The 30-share pack Sensex rose 1,047 points or 1.84 per cent to end the truncated week at a one-week high of 57,864. Its broader peer NSE Nifty50 also jumped 312 points or 1.84 per cent to close at 17,287. Domestic stock markets will remain shut on Friday on a…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/bulls-ignore-fed-rate-hike-move-drive-sensex-another-1000-pts-up/articleshow/90290241.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90290233,width-1070,height-580,imgsize-55876,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T10:26:00Z", "content": "The domestic benchmark indices wrapped up a critical week with healthy gains that came on the heels of a global market rally even as the US Federal Reserve raised interest rates for the first time si… [+4412 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Provident Fund Contributions Above Rs 2.50 Lakh To Be Taxed: 10 Points - NDTV Profit", "description": "The Centre has planned to tax Employees Provident Fund (EPF) contributions exceeding Rs 2.50 lakh yearly. For government employees, the limit has been set at a higher end of Rs 5 lakh. Under the set of new Income Tax (I-T) Rules, PF accounts are likely to be …", "url": "https://www.ndtv.com/business/pf-contributions-above-rs-2-50-lakh-to-be-taxed-10-points-2828364", "urlToImage": "https://i.ndtvimg.com/i/2016-10/pf-rupee-provident-fund-650-400_650x400_51476091607.jpg", "publishedAt": "2022-03-17T10:22:38Z", "content": "<li>This comes at a time when retirement body EPFO has reduced interest rates to the lowest in more than 40 years for the ongoing financial year 2021-22 (FY 22).\r\n</li><li>The reduction marks the low… [+1609 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The Pune Techie Who Hears Regularly From Elon Musk - NDTV", "description": "Mr Pathole's follower count on Twitter has surged and he now has over one lakh followers but he says he is not doing it to create clout on social media.", "url": "https://www.ndtv.com/india-news/the-pune-techie-who-hears-regularly-from-elon-musk-2828096", "urlToImage": "https://c.ndtvimg.com/2022-03/hdfsoktg_pranay-pathole_625x300_17_March_22.jpg", "publishedAt": "2022-03-17T10:08:00Z", "content": "Mr Pathole's follower count on Twitter has surged and he now has over one lakh followers.\r\nNew Delhi: A 23-year-old Indian techie, who is in touch with the Twitter-savvy Tesla and SpaceX CEO Elon Mus… [+4055 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "JP Morgan cuts Indian shares to 'underweight', trims target for MSCI EM index - Moneycontrol", "description": "The brokerage, which previously had a \"neutral\" rating on Indian equities, cited a slew of factors, including a weaker rupee and its impact on growth, a spike in prices of commodities such as oil, potential portfolio outflows and the domestic monetary tighten…", "url": "https://www.moneycontrol.com/news/business/markets/jp-morgan-cuts-indian-shares-to-underweight-trims-target-for-msci-em-index-8244271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/05/JPMorgan-770x433.jpg", "publishedAt": "2022-03-17T10:06:33Z", "content": "J.P.Morgan downgraded Indian equities to \"underweight\" and cut its full-year forecast for the MSCI Emerging Markets index, as geopolitical tensions fuel inflation worries, roiling global financial ma… [+1233 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Tata Motors & MG Motor independently working on affordable electric vehicles: Prices to start from Rs. 8 lakh - CarToq.com", "description": "The sources of ET Now have revealed that Tata Motors and MG Motor are working on affordable electric vehicles for the Indian market. Currently, the most affordable electric vehicle that you can get in the Indian market is the Tata Tigor EV which starts from R…", "url": "https://www.cartoq.com/tata-motors-mg-motor-independently-working-on-affordable-electric-vehicles-prices-to-start-from-rs-8-lakh/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/upcoming-tata-and-mg-EVs-featured.jpg", "publishedAt": "2022-03-17T09:06:39Z", "content": "The sources of ET Now have revealed that Tata Motors and MG Motor are working on affordable electric vehicles for the Indian market. Currently, the most affordable electric vehicle that you can get i… [+2937 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Nykaa at Rs 900 or Rs 2,300? What Jefferies says on this new-age stock - Economic Times", "description": "Consumer stocks in India enjoy a significant premium given the growth runway and this should likely continue for Nykaa although the question remains on the fair valuation multiple, the brokerage said.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-at-rs-900-or-rs-2300-what-jefferies-says-on-this-new-age-stock/articleshow/90287824.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90287802,width-1070,height-580,imgsize-64054,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T08:34:00Z", "content": "NEW DELHI: Foreign brokerage Jefferies has initiated coverage on FSN E-Commerce Ventures (Nykaa) with a 'buy' rating and a base target of Rs 1,650, suggesting limited single-digit upside ahead for th… [+2365 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "US Federal Reserve Rate Hike: What it Means for Indian Stock Market, Investors and RBI - News18", "description": "The Federal Reserve has decided to raise the interest rates to control rising inflation. How it will impact stock markets in India, equity investors and RBI's policymaking", "url": "https://www.news18.com/news/business/markets/us-federal-reserve-rate-hike-what-it-means-for-indian-stock-market-investors-and-rbi-4883663.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/10/shutterstock_1049641082-1-163306274116x9.jpg", "publishedAt": "2022-03-17T08:05:14Z", "content": "To tame the worst inflation in the United States in the last few decades, the Federal Reserve has decided to raise the interest rate on Wednesday. The American central bank increased the key short-te… [+4298 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "2022 Renault Kwid hatchback: New TVC released - CarToq.com", "description": "Renault India recently launched the 2022 Kwid hatchback in India. Renault Kwid was first launched back in 2015 and ever since then it has been a popular choice among small family car buyers. Renault Kwid is actually one of the product that popularised Renault…", "url": "https://www.cartoq.com/2022-renault-kwid-hatchback-new-tvc-released/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/kwid-tvc-featured.jpg", "publishedAt": "2022-03-17T06:15:53Z", "content": "Renault India recently launched the 2022 Kwid hatchback in India. Renault Kwid was first launched back in 2015 and ever since then it has been a popular choice among small family car buyers. Renault … [+3038 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shubham Raj", "title": "Contra view? Team Prashant Jain dips into purse to buy relatively smaller banking stocks - Economic Times", "description": "The money manager bought 20-80 lakh shares of Union Bank Of India, The Federal Bank, Indian Bank, Equitas Small Finance Bank and Bank of Baroda during the month.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/contra-view-team-prashant-jain-dips-into-purse-to-buy-relatively-smaller-banking-stocks/articleshow/90284211.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90284235,width-1070,height-580,imgsize-667428,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T05:43:00Z", "content": "NEW DELHI: Team of fund managers led by Prashant Jain at HDFC Mutual Fund seems to have a different strategy as far as the banking and financial sector is concerned. \r\nWhile most of the Street, inclu… [+2008 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "SI Reporter", "title": "Future Group stocks hit 52-week lows as FRL clarifies on RIL takeover - Business Standard", "description": "Future Retail on Wednesday said that it was committed to taking all actions necessary to seek value \r\n\r\nadjustments and reversal of takeover of stores by the Reliance group.", "url": "https://www.business-standard.com/article/markets/future-group-stocks-hit-52-week-lows-as-frl-clarifies-on-ril-takeover-122031700281_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/18/full/1618743812-5072.jpg", "publishedAt": "2022-03-17T05:07:00Z", "content": "Shares of Kishore Biyani-led Future Group companies tanked up to 19 per cent, hitting respective 52-week lows on the BSE in Thursday’s intra-day trade after Future Retail (FRL) said on Wednesday that… [+3281 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Dave Lee", "title": "Mukesh Ambani corners Jeff Bezos in battle for retail stores in India - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/fd628dfe-1e20-45cf-ba6e-950a11ae9e4c", "urlToImage": null, "publishedAt": "2022-03-17T05:00:09Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"source": {"id": null, "name": "DailyFX"}, "author": "Daniel Dubrovsky", "title": "Gold Rallies Despite Fed Rate Hike as US Dollar Falls, Will Market Confidence Linger? - DailyFX", "description": "Gold prices climbed after the Federal Reserve hiked rates and the US Dollar weakened. A closely watched section of the yield curve remained lower despite market confidence in the central bank. Wher...", "url": "https://www.dailyfx.com/forex/fundamental/daily_briefing/daily_pieces/commodities/2022/03/17/Gold-Rallies-Despite-Fed-Rate-Hike-as-US-Dollar-Falls-Will-Market-Confidence-Linger.html", "urlToImage": "https://a.c-dn.net/b/2DEsVO/headline_GOLD_13.JPG", "publishedAt": "2022-03-17T05:00:00Z", "content": "Gold, XAU/USD, Federal Reserve, Yield Curve, Technical Analysis - Talking Points:\r\n<ul><li>Gold prices gained after the Fed hiked rates as the US Dollar fell</li><li>Markets seemed confident in the c… [+2793 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Preeti Motiani and Sneha Kulkarni", "title": "These NPS investors can exit from scheme after 5 years lock-in period only - Economic Times", "description": "As per the new regulation inserted in the NPS scheme, certain individuals can close their Tier-I NPS account after they have completed five years with the pension scheme from the date of opening of the account. Do note that this facility of a lower lock-in pe…", "url": "https://economictimes.indiatimes.com/wealth/invest/these-nps-investors-can-exit-from-scheme-after-5-years-lock-in-period-only/articleshow/90219947.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90219946,width-1070,height-580,imgsize-346937,overlay-etwealth/photo.jpg", "publishedAt": "2022-03-17T04:54:00Z", "content": "The Pension Fund Regulatory and Development Authority (PFRDA) has reduced the lock-in period for NPS investments from 10 years to 5 years for self-employed individuals and others not having employer-… [+4263 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "The global fight over semiconductors is about to get even worse - Economic Times", "description": "The dearth of semiconductors has brought some car manufacturing to a halt and delayed shipments of game consoles and smartphones, waking Washington and Brussels up to the fact that their continents are dependent on a handful of regions for the key parts.", "url": "https://economictimes.indiatimes.com/small-biz/trade/exports/insights/the-global-fight-over-chips-is-about-to-get-even-worse/articleshow/90282485.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90282469,width-1070,height-580,imgsize-120898,overlay-etrise/photo.jpg", "publishedAt": "2022-03-17T04:30:00Z", "content": "Magdeburg in former East Germany is famous for its towering gothic cathedral, and not a lot else. Its now about to play a key role in U.S. and European efforts to tilt the global balance of power.\r\nI… [+12189 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Godrej Properties rises 3% after reporting Rs 1,650 cr sales for Noida project - Moneycontrol", "description": "Godrej Properties has sold 855 homes worth Rs 1,650 crore within a year of the launch of Godrej Woods in March 2021", "url": "https://www.moneycontrol.com/news/business/stocks/godrej-properties-rises-3-after-reporting-rs-1650-cr-sales-for-noida-project-8242231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Pune-real-estate-770x433.jpg", "publishedAt": "2022-03-17T04:14:35Z", "content": "Godrej Properties share price rose 3 percent in early trade on March 17 after the company reported sales of Rs 1,650 crore for its Godrej Woods project in Noida.\r\n\"Godrej Properties has sold 855 home… [+799 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Petrol, Diesel Price Today: Fresh Fuel Rates Announced. Check Fuel Rates - News18", "description": "In Delhi, petrol costs Rs 95.41 a litre while the rate of diesel was Rs 86.67 per litre.", "url": "https://www.news18.com/news/business/petrol-diesel-price-today-fresh-fuel-rates-announced-check-fuel-rates-4882448.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-design-5-3-163596211116x9.jpg", "publishedAt": "2022-03-17T03:52:00Z", "content": "Petrol, Diesel Price Today: Petrol price today in India remained unchanged, while diesel price was also kept constant across the nation on the day. Petrol prices in cities such as New Delhi, Kolkata,… [+2952 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "₹10,000 monthly turns to ₹11.98 lakh in 5 years in this mutual fund SIP plan - Mint", "description": "Mutual fund calculator: If an investor had invested  ₹10,000 per month in this mutual fund SIP plan, its  ₹10,000 monthly investment would have grown up to  ₹1.25 lakh in one year", "url": "https://www.livemint.com/money/personal-finance/rs-10-000-monthly-turns-to-rs-11-98-lakh-in-5-years-in-this-mutual-fund-sip-plan-11647487789325.html", "urlToImage": "https://images.livemint.com/img/2022/03/17/600x338/Rupee_Reuters_1624616048749_1647487881452.jpg", "publishedAt": "2022-03-17T03:36:16Z", "content": "Mutual funds SIP (Systematic Investment Plan) is one of the investment tool that helps an investor overcome volatility of the equity markets without bothering about the right time to start. Its compo… [+2364 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in the news: Paytm, SBI, M&M, IOC, Adani Power and JSW Energy - Economic Times", "description": "Indian Oil Corporation (IOC) has bought as much as 3 million barrels of crude oil that Russia had offered at a steep discount to prevailing international rates, sources said.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-paytm-sbi-mm-ioc-adani-power-and-jsw-energy/articleshow/90280858.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90280885,width-1070,height-580,imgsize-209286,overlay-etmarkets/photo.jpg", "publishedAt": "2022-03-17T02:07:00Z", "content": "Nifty futures on the Singapore Exchange traded 287 points, or 1.69 per cent, higher at 17,294, signaling that Dalal Street was headed for a gap-up start on Thursday. Here are a few stocks which may b… [+2134 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Arindam Roy", "title": "Stocks to Watch: SAIL, JSW Energy, Oil India, SpiceJet, IndiGo - Mint", "description": "Indian indices on Wednesday made solid gains as positive global cues lifted market sentiments.", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-sail-jsw-energy-oil-india-spicejet-indigo-11647481755740.html", "urlToImage": "https://images.livemint.com/img/2022/03/17/600x338/20210121057L_1612784555095_1612784568783_1647481951116.jpg", "publishedAt": "2022-03-17T02:03:14Z", "content": "Here is the list of the top 10 stocks that are likely to be in focus on Thursday:JSW Energy: JSW Energy on Wednesday said that it has completed the streamlining and reorganisation of its renewable an… [+1283 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Buzzing Stocks | BEML, Gufic Biosciences, Satin Creditcare Network, others in news today - Moneycontrol", "description": "Stocks In the News: Check out the companies making headlines before the opening bell.", "url": "https://www.moneycontrol.com/news/photos/business/stocks/buzzing-stocks-beml-gufic-biosciences-satin-creditcare-network-others-in-news-today-8240881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/BUZZING-STOCKS-770x433.jpg", "publishedAt": "2022-03-17T01:23:51Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Digbijay Mishra, Sneha Shah", "title": "Trell’s cofounder Pulkit Agarwal sends a fiery note to investors - Economic Times", "description": "ET has reviewed Agarwal’s critical note sent to all investors following the paper’s queries last week to the Bengaluru company on the scope and direction of the EY audit into the firm's financials.", "url": "https://economictimes.indiatimes.com/tech/startups/trells-cofounder-pulkit-agarwal-sends-a-fiery-note-to-investors/articleshow/90276630.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276745,width-1070,height-580/photo.jpg", "publishedAt": "2022-03-17T00:30:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ratna Bhushan", "title": "Boat sets up M&A arm for acquisitions; to build a house of brands - Economic Times", "description": "Imagine Marketing, Boat’s parent company, which filed its draft red herring prospectus with market regulator Securities and Exchange Board of India in January this year to raise Rs 2,000 crore from the public markets, is awaiting approval from the regulator.", "url": "https://economictimes.indiatimes.com/tech/technology/boat-sets-up-ma-arm-for-acquisitions-to-build-a-house-of-brands/articleshow/90276354.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276362,width-1070,height-580/photo.jpg", "publishedAt": "2022-03-17T00:30:00Z", "content": "SynopsisImagine Marketing, Boat’s parent company, which filed its draft red herring prospectus with market regulator Securities and Exchange Board of India in January this year to raise Rs 2,000 cror… [+66 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Rahul Srinivas", "title": "The newest iPhone factory will not be in China - Digital Trends", "description": "Yet another iPhone factory is expected to churn out millions of iPhones. Except, this time around, it's not in China.", "url": "https://www.digitaltrends.com/mobile/iphone-factory-india-pegatron/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/iphone-12-4.jpg", "publishedAt": "2022-03-16T23:19:45Z", "content": "Thanks to the ever-increasing demand for its smartphones, Apple seems to be constantly on the lookout for new facilities to manufacture the iPhone. So far, most of this demand has been met by massive… [+2788 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ketan Thakkar", "title": "Compact SUVs overtake small cars as largest segment in FY22 - Economic Times", "description": "Compact SUVs are set to overtake premium small cars to become the top-selling segment in the Indian passenger car market this fiscal year ending March 31. More than one in every two passenger vehicles sold in the country now is a utility vehicle, driven by th…", "url": "https://economictimes.indiatimes.com/industry/auto/auto-news/compact-suvs-overtake-small-cars-as-largest-segment-in-fy22/articleshow/90276877.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90276876,width-1070,height-580,imgsize-597539,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-16T17:19:00Z", "content": "Sport utility vehicles have become the core of the Indian passenger vehicle market, dethroning hatchbacks, the long-standing leaders.\r\nCompact SUVs are set to overtake premium small cars to become th… [+3368 chars]"}, {"source": {"id": null, "name": "Search Engine Journal"}, "author": null, "title": "Google Sunsetting Universal Analytics In 2023 - Search Engine Journal", "description": "Google announces plans to sunset the previous generation of Google Analytics, known as Universal Analytics, in July 2023.", "url": "https://www.searchenginejournal.com/google-sunsetting-universal-analytics-in-2023/442168/", "urlToImage": "https://cdn.searchenginejournal.com/wp-content/uploads/2022/03/google-analytics-sunset-6231f750acba1-sej.png", "publishedAt": "2022-03-16T14:43:17Z", "content": "Google is getting ready to sunset Universal Analytics, which was the standard version of Google Analytics before GA4, in mid-2023.\r\nTo be exact – July 1, 2023 is the date Universal Analytics will sto… [+3161 chars]"}, {"source": {"id": null, "name": "Harvard Business Review"}, "author": null, "title": "5 Key Trends Leaders Need to Understand to Get Hybrid Right - HBR.org Daily", "description": "New research from Microsoft.", "url": "https://hbr.org/2022/03/5-key-trends-leaders-need-to-understand-to-get-hybrid-right", "urlToImage": "https://hbr.org/resources/images/article_assets/2022/03/Mar22_16_1349695563.jpg", "publishedAt": "2022-03-16T14:26:34Z", "content": "New research from Microsoft.\r\n\"&gt;\r\nAfter many false starts, organizations are finally making the shift into a true hybrid work model. Like every other turning point over the past two years, theres … [+7864 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sneha Shah and Digbijay Mishra", "title": "Exclusive: Tiger Global-backed unicorn Infra.Market faces tax probe - Economic Times", "description": "Income Tax authorities have raided offices of the company in several cities, including Noida, Hyderabad, Bengaluru, Pune and Mumbai.", "url": "https://economictimes.indiatimes.com/tech/startups/construction-materials-unicorn-infra-market-faces-tax-probe/articleshow/90272017.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90282792,width-1070,height-580,imgsize-1901430,overlay-ettech/photo.jpg", "publishedAt": "2022-03-16T12:38:00Z", "content": "Mumbai/Bengaluru: Business-to-business construction materials startup Infra.Market faces an investigation by tax authorities for allegedly not paying taxes, three people with direct knowledge of the … [+3082 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Maruti chairman says EVs won't give desired results for next 10-15 years in India; here's why - CNBCTV18", "description": "India should not ape the western EV model and focus on CNG and Hybrid vehicles too, according to the Maruti Suzuki Chairman.", "url": "https://www.cnbctv18.com/auto/maruti-chairman-says-evs-wont-give-desired-results-for-next-10-15-years-in-india-heres-why-12848122.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/05/2018_4img27_Apr_2018_PTI4_27_2018_000135B-1019x573.jpg", "publishedAt": "2022-03-16T11:36:00Z", "content": "MiniIndia should not ape the western EV model and focus on CNG and Hybrid vehicles too, according to the Maruti Suzuki Chairman."}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Vipul Das", "title": "Buy This Multibagger IT Stock For A Target Price of Rs. 5,550 Says Sharekhan - Goodreturns", "description": "Persistent Systems Ltd is a mid-cap information technology company with a market capitalization of Rs 33,856.28 crore. On the NSE, the stock has climbed from Rs 1826.55 on March 17, 2021 to Rs 4,430.00 on March 16, 2022, 3:30 pm IST, representing a multibagge…", "url": "https://www.goodreturns.in/personal-finance/investment/buy-this-multibagger-it-stock-for-a-target-price-of-rs-5-550-says-sharekhan-1243118.html", "urlToImage": "https://www.goodreturns.in/img/2021/05/stock5-1620716488.jpg", "publishedAt": "2022-03-16T11:07:16Z", "content": "Persistent Systems Ltd is a mid-cap information technology company with a market capitalization of Rs 33,856.28 crore. On the NSE, the stock has climbed from Rs 1826.55 on March 17, 2021 to Rs 4,430.… [+2843 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Gainers & Losers: Five stocks that moved the most on March 16 - Moneycontrol", "description": "All sectoral indices ended in the green, with IT, oil & gas, auto, bank, metal and realty indices rising 2-3 percent, while capital goods, FMCG, and power gained a percent each. BSE midcap and smallcap indices also added over 1 percent each", "url": "https://www.moneycontrol.com/news/photos/business/stocks/gainers-losers-five-stocks-that-moved-the-most-on-march-16-8240011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/stocks_market-stock_stock-2-770x433.jpg", "publishedAt": "2022-03-16T10:45:58Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Karunjit Singh", "title": "Explained: The fall in crude oil prices, and its impact in India - The Indian Express", "description": "The price of crude oil has fallen to just above $100 per barrel from $139, which was the highest level in 14 years. Why are crude prices cooling, and what impact will it have in India?", "url": "https://indianexpress.com/article/explained/crude-oil-prices-decrease-explained-7822399/", "urlToImage": "https://images.indianexpress.com/2022/03/Oil-6.jpg", "publishedAt": "2022-03-16T08:09:07Z", "content": "The price of crude oil fell below the $100 barrel mark on Tuesday, after a two-week period which saw the cost rise to $139 per barrel, its highest level in 14 years. Brent crude gained on Wednesday t… [+2678 chars]"}]}