{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "As Jet Airways Plans Take-Off, Security Clearance Comes From Centre - NDTV Profit", "description": "Union home ministry has granted security clearance to Jet Airways that is planning to relaunch commercial flight operations in the next few months", "url": "https://www.ndtv.com/business/jet-airways-gets-home-ministrys-clearance-2956836", "urlToImage": "https://c.ndtvimg.com/2022-05/u6n19geo_jet-airways-240_625x300_05_May_22.jpg", "publishedAt": "2022-05-08T16:26:00Z", "content": "Home Ministry has granted security clearance to Jet Airways\r\nUnion home ministry has granted security clearance to Jet Airways that is planning to relaunch commercial flight operations in the next fe… [+1389 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Toyota Innova with Green paint job and customised interior looks unique [Video] - CarToq.com", "description": "Toyota Innova is one of the most popular MPVs in India. It is popular among buyers for its reliability, comfortable ride and low cost of maintenance. Toyota replaced Innova with much more premium looking Innova Crysta but, several examples of type 1 Innovas a…", "url": "https://www.cartoq.com/toyota-innova-with-green-paint-job-and-customised-interior-o/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/innova-green-featured.jpg", "publishedAt": "2022-05-08T15:57:03Z", "content": "Toyota Innova is one of the most popular MPVs in India. It is popular among buyers for its reliability, comfortable ride and low cost of maintenance. Toyota replaced Innova with much more premium loo… [+2900 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Meme Token Carnage — DOGE, SHIB Prices Sink Lower, Dogecoin Down 82% Since Last Year – Market Updates Bitcoin News - Bitcoin News", "description": "While dogecoin had a phenomenal year in 2021, over the past 12 months, dogecoin lost 82.8% against the USD.", "url": "https://news.bitcoin.com/meme-token-carnage-doge-shib-prices-sink-lower-dogecoin-down-82-since-last-year/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/image-2022-05-08-092806.jpg", "publishedAt": "2022-05-08T14:45:07Z", "content": "Today’s top meme coins have lost 4.8% in value against the U.S. dollar, as the crypto market carnage has wreaked havoc across the entire digital currency economy. While dogecoin had a phenomenal year… [+3393 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Reliance expects gas prices to rise again in October - Moneycontrol", "description": "The conglomerate, controlled by billionaire Mukesh Ambani, expects the price cap for its KG-D6 gas sales to rise over the current $9.92 per million British thermal units, Sanjay Roy, senior vice-president for exploration and production, said in an investor ca…", "url": "https://www.moneycontrol.com/news/business/commodities/reliance-expects-gas-prices-to-rise-again-in-october-8472791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/natural-gas_gas-770x433.jpg", "publishedAt": "2022-05-08T14:40:00Z", "content": "Reliance Industries Ltd expects prices of natural gas in India to rise again in October as its gas exploration business reaps the rewards of a global surge in energy prices that have already pushed t… [+4621 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "LIC IPO subscribed 1.79 times on day 5 but QIBs portion yet to be fully booked - Moneycontrol", "description": "Policyholders have bid 5.04 times the allotted quota and retail investors 1.59 times, while employees bought shares 3.79 times the portion set aside for them, which are worth Rs 542 crore.", "url": "https://www.moneycontrol.com/news/business/ipo/lic-ipo-subscribed-1-79-times-on-day-5-but-qibs-portion-yet-to-be-fully-booked-8472771.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/LIC-IPO-1-770x433.jpg", "publishedAt": "2022-05-08T14:33:04Z", "content": "Life Insurance Corporation of India's (LIC) initial public offering received 1.79 times subscription till May 8, the fifth day of bidding, but the portion reserved for qualified institutional buyers … [+2225 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Bloomberg", "title": "Saudis cut oil prices for Asia from record highs amid China lockdowns - Deccan Herald", "description": "Saudi Arabia cut oil prices for buyers in Asia as coronavirus lockdowns in China weigh on demand, countering uncertainty around Russia’s supplies as the Ukraine war drags on.", "url": "https://www.deccanherald.com/international/saudis-cut-oil-prices-for-asia-from-record-highs-amid-china-lockdowns-1107502.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/08/oil-afp-1107502-1652017727.png", "publishedAt": "2022-05-08T12:52:39Z", "content": "Saudi Arabia cut oil prices for buyers in Asia as coronavirus lockdowns in China weigh on demand, countering uncertainty around Russias supplies as the Ukraine war drags on.\r\nSaudi Aramco is lowering… [+2353 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Google Ceo Sundar Pichai Reveals Which School He Attended In Chennai | Mint - Mint", "description": "Nearly 350 educational institutions had claimed Pichai to be his own after his appointment. But he clarified that only two of the mentioned names were correct", "url": "https://www.livemint.com/news/india/google-ceo-sundar-pichai-reveals-which-school-he-attended-in-chennai-11652012614990.html", "urlToImage": "https://images.livemint.com/img/2022/05/08/600x338/sundar_pichai_1652013447112_1652013447249.jpg", "publishedAt": "2022-05-08T12:38:23Z", "content": "After much speculations from all quarters, Google CEO Sundar Pichai has finally revealed the name of the school he went to in Chennai. \r\nIn an interaction at the Stanford Graduate School of Business,… [+1052 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pawan Nahar", "title": "Potential debutants lose their ground ahead of listing, Here's what you should expect - Economic Times", "description": "The latest selloff in the secondary markets has hit both the listing candidates hard as their premia in the unofficial have nosedived sharply, with one of them hinting at a discounted listing.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/potential-debutants-lose-their-ground-ahead-of-listing-heres-what-you-should-expect/articleshow/91418581.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91418553,width-1070,height-580,imgsize-605584,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-08T11:43:00Z", "content": "New Delhi: Listing bound companies - Campus Activewear and Rainbow Children's Medicare - are losing their ground in the grey market, their diminishing premia suggests.\r\nThe latest selloff in the seco… [+2835 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "Top 5 Things to Watch in Markets in the Week Ahead By Investing.com - Investing.com", "description": "Top 5 Things to Watch in Markets in the Week Ahead", "url": "https://www.investing.com/news/economy/top-5-things-to-watch-in-markets-in-the-week-ahead-2819949", "urlToImage": "https://i-invdn-com.investing.com/news/moved_LYNXNPEI3S0FS_L.jpg", "publishedAt": "2022-05-08T11:04:00Z", "content": "By Noreen Burke\r\nInvesting.com -- Equity markets were roiled last week after the Federal Reserve delivered a widely expected half percentage point rate hike and flagged similar moves at upcoming meet… [+4689 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Foreign funds' ownership in domestic equities falls to 19.5%, lowest since Mar 2019 - Moneycontrol", "description": "Foreign funds' ownership in the domestic equities was at 18.6 percent in December 2017, the lowest in five years, and the peak was in December 2021, when they owned 21.4 percent of domestic equities.", "url": "https://www.moneycontrol.com/news/business/markets/foreign-funds-ownership-in-domestic-equities-falls-to-19-5-lowest-since-mar-2019-8472191.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/inr_rupee_indian-rupee-770x433.jpg", "publishedAt": "2022-05-08T10:49:26Z", "content": "Foreign funds' ownership in domestic equities fell to pre-COVID lows and hit a multi-year low of 19.5 percent in March this year in NSE500 companies valued at $619 billion, shows an analysis. At 19.5… [+2688 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "How Reliance Refinery Is Making Millions From Ukraine War Windfall | Mint - Mint", "description": "The refiner, owned by Indian billionaire Mukesh Ambani, is buying discounted cargoes of crude after self-sanctions on Russian fuels by some European Union companies pushed up margins on some oil products to three-year highs", "url": "https://www.livemint.com/companies/news/how-billionaire-mukesh-ambani-s-refinery-is-making-millions-from-ukraine-war-windfall-11652005498737.html", "urlToImage": "https://images.livemint.com/img/2022/05/08/600x338/Mukesh_Ambani_1652005638832_1652005639093.JPG", "publishedAt": "2022-05-08T10:28:47Z", "content": "Russias invasion of Ukraine has opened arbitrage opportunities so enticing that Reliance Industries Ltd. deferred maintenance work at the worlds biggest oil refining complex to churn out more diesel … [+2149 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Dev Shah", "title": "Skoda Kushaq 1.0 TSI Style AT: Purchase process & initial review - Team-BHP", "description": "BHPian EmpyreanKnight recently shared this with other enthusiasts.Why a new car?: I read in an ownership review; The gentleman very accurately described the reason for buying his new car, Khudak – a north Indian slang for any unnecessary itch to do something.", "url": "https://www.team-bhp.com/news/skoda-kushaq-10-tsi-style-purchase-process-initial-review", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/10_27.jpg", "publishedAt": "2022-05-08T09:42:49Z", "content": "I worked at Skoda in my early years, so I always have a soft corner for the brand. Although I worked on the assembly line and was responsible for wheel balancing.\r\nBHPian EmpyreanKnight recently shar… [+18226 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "'this Will Be The Best Investment You'll Ever Make': Adar Poonawalla's Special Advice To Elon Musk | Mint - Mint", "description": "Adar Poonawalla told Musk that in case he doesn't buy Twitter then he must look at investing some of his capital in India", "url": "https://www.livemint.com/news/india/this-will-be-the-best-investment-you-ll-ever-make-adar-poonwalla-s-special-advice-to-elon-musk-11651995292267.html", "urlToImage": "https://images.livemint.com/img/2022/05/08/600x338/Elon_Musk-Tesla_1651998710036_1651998710335.JPG", "publishedAt": "2022-05-08T09:37:28Z", "content": "Serum Institute CEO Adar Poonawalla has given very special investment advice to Tesla head Elon Musk on Sunday.\r\nPoonawalla told Musk that in case he doesn't buy Twitter then he must look at investin… [+1371 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Elon Musk's 9-minute Flight Sparks Discussion on Carbon Footprint of the Super Rich - News18", "description": "Twitter bot 'Elon Jet' posted an update about Elon Musk's flight completing a 9-minute journey between San Jose and San Francisco.", "url": "https://www.news18.com/news/buzz/elon-musks-9-minute-flight-sparks-discussion-on-carbon-footprint-of-the-super-rich-5134225.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/elon-musk-4-165130806416x9.jpg", "publishedAt": "2022-05-08T09:29:56Z", "content": "Elon Musk, or Elon Musk’s flight rather, has come under the radar for taking off for a nine-minute journey. Jack Sweeney, who tracks Musk’s flight through the account ‘Elon Jet’, posted an update tha… [+2905 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Govt to invite financial bids for Shipping Corp of India sale by September - Moneycontrol", "description": "As part of the strategic-sale process, the government is hiving off Shipping House and the training institute in Pune and some other non-core assets of Shipping Corporation of India (SCI).", "url": "https://www.moneycontrol.com/news/business/govt-to-invite-financial-bids-for-shipping-corp-of-india-sale-by-september-8471821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/seacoast-shipping-services-770x433.jpg", "publishedAt": "2022-05-08T09:21:17Z", "content": "The government is likely to invite financial bids for Shipping Corporation of India by September, after the process of demerger of non-core assets is completed, an official said. As part of the strat… [+2877 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Mahindra XUV700 petrol vs Hyundai Creta 1.6 diesel in a drag race [Video] - CarToq.com", "description": "Mahindra launched the XUV700 SUV in the market last year and it immediately became popular among buyers. The Mahindra XUV700 competes with cars like Hyundai Creta, Ki Seltos, Tata Harrier, Tata Safari, MG Hector in the segment. There are several videos of Mah…", "url": "https://www.cartoq.com/mahindra-xuv700-petrol-vs-hyundai-creta-1-6-diesel/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/creta-vs-xuv700-featured.jpg", "publishedAt": "2022-05-08T09:11:56Z", "content": "Mahindra launched the XUV700 SUV in the market last year and it immediately became popular among buyers. The Mahindra XUV700 competes with cars like Hyundai Creta, Ki Seltos, Tata Harrier, Tata Safar… [+2886 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Future Enterprises to raise Rs 3,000 crore from insurance biz sale; aims to pare debt, avoid insolvency - Economic Times", "description": "On March 31, FEL defaulted on repayment of Rs 2,911.51 crore of loans to the consortium of banks and lenders. Later it also missed a 30-day review period as per the scheme of One Time Restructuring (OTR) for COVID-hit companies with its consortium of banks.", "url": "https://economictimes.indiatimes.com/industry/banking/finance/insure/future-enterprises-to-raise-rs-3000-cr-from-insurance-biz-sale-aims-to-pare-debt-avoid-insolvency/articleshow/91415753.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91415910,width-1070,height-580,imgsize-13774,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-08T08:40:00Z", "content": "Debt-ridden Future Group firm Future Enterprises Ltd expects to raise around Rs 3,000 crore from selling its stake in the insurance business to pare debt, which may save the company from facing the r… [+3408 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Elon Musk`s India dream shattered? Tesla team moves out of country amidst duty row with Indian Govt - Zee News", "description": "Indian electric vehicle market to grow in next 2 years, 3 crore EVs to be on road: Nitin Gadkari The move by Musk-led Tesla appears to be a retaliation as the Indian government has not accepted the demand by Musk to reduce import duties on Tesla vehicles.", "url": "https://zeenews.india.com/electric-vehicles/elon-musks-india-dream-shattered-tesla-team-moves-out-of-country-amidst-duty-row-with-indian-govt-2461405.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/08/1040192-tesla-india.jpg", "publishedAt": "2022-05-08T07:55:15Z", "content": "While Union Ministers kept offering Tesla CEO Elon Musk to come and manufacture electric cars in India, he seemed more interested in his Twitter acquisition rather than paying attention to what the I… [+2990 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Public Sector General Insurers May Get Capital Infusion Of ₹3,000-5,000 Crore | Mint - Mint", "description": "The capital infusion would help improve the financial health of the general insurance firms -- National Insurance Company Limited, Oriental Insurance Company Limited and United India Insurance Company", "url": "https://www.livemint.com/politics/policy/public-sector-general-insurers-may-get-capital-infusion-of-rs-3-000-5-000-crore-11651994855573.html", "urlToImage": "https://images.livemint.com/img/2022/05/08/600x338/642fff2a-1d55-11ec-8752-7a8d4023984b_1633408827147_1651995253811.jpg", "publishedAt": "2022-05-08T07:35:05Z", "content": "NEW DELHI :\r\nThe government may infuse 3,000-5,000 crore additional capital in the three public sector general insurance companies based on their performance and requirement during the year, sources … [+2482 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Honda City e:HEV Hybrid vs Skoda Slavia 1.5 TSI: Which is the better enthusiast car? - CarToq.com", "description": "At a time when the public interest is inclining more towards compact and midsize SUVs, VW Group and Honda are trying hard to not let that interest fizzle out from sedans completely. Since the beginning of 2022, the midsize sedan segment is revolutionized with…", "url": "https://www.cartoq.com/honda-city-ehev-hybrid-vs-skoda-slavia-1-5-tsi-which-is-the-better-enthusiast-car/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/city-hybrid-vs-slavia-15-comparison-fb.jpg", "publishedAt": "2022-05-08T07:15:18Z", "content": "At a time when the public interest is inclining more towards compact and midsize SUVs, VW Group and Honda are trying hard to not let that interest fizzle out from sedans completely. Since the beginni… [+3889 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": "Mihir R. Barve", "title": "Rapper Badshah Gets Home An Audi Q8 Luxury SUV Worth Rs. 1.38 Cr. - carandbike", "description": "Badshah is best known for his Hindi, Punjabi and Haryanvi songs, and his brand new Audi Q8 will join a Rolls Royce Wraith in his garage.", "url": "https://www.carandbike.com/news/rapper-badshah-gets-home-an-audi-q8-luxury-suv-worth-rs-1-38-cr-2956216", "urlToImage": "https://c.ndtvimg.com/2022-05/8d693u7s_audi-q8_625x300_08_May_22.jpg", "publishedAt": "2022-05-08T07:13:39Z", "content": "Indian rapper Badshah, famous for his Bollywood, Punjabi, and Haryanvi music throughout the country has brought home Audi's flagship SUV, the Audi Q8. The Audi Q8 joins Badshah's garage, which is alr… [+2130 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol", "description": "The volatility is expected to continue in the coming week as well, with sentiment in favour of bears as the market will keenly watch developments from Ukraine, inflation numbers from the US and China, India's CPI inflation, corporate earnings and IPO market a…", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-34-8470761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/01/Dalal-Street-AFP-770x433.jpg", "publishedAt": "2022-05-08T06:51:29Z", "content": "The surprised 40 bps increase in repo rate and 50 bps in cash reserve ratio by the Reserve Bank of India amid rising fear of aggressive rate hikes by the US Federal Reserve dampened the market sentim… [+13161 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Xi warms up China's economy, but virus narrows options - Economic Times", "description": "Lockdowns across dozens of cities -- from the manufacturing hubs of Shenzhen and Shanghai to the breadbasket of Jilin -- have wreaked havoc on supply chains over recent months, crushing small businesses and trapping consumers at home.", "url": "https://economictimes.indiatimes.com/news/international/world-news/xi-warms-up-chinas-economy-but-virus-narrows-options/articleshow/91414140.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91414221,width-1070,height-580,imgsize-62950,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-08T06:43:00Z", "content": "President Xi Jinping has offered state backing for tech, infrastructure and jobs to revive China's economy, but analysts warn growth will continue to wilt until Beijing drops its rigid virus controls… [+4157 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Fpis Pull Over ₹6,400 Crore From Indian Equity Market In First Week Of May. What Experts Have To Say | Mint - Mint", "description": "Foreign Portfolio Investors (FPIs) remained net sellers for seven months to April 2022, withdrawing a massive amount of over  ₹1.65 lakh crore from equities", "url": "https://www.livemint.com/market/stock-market-news/fpis-pull-over-rs-6-400-crore-from-indian-equity-market-in-first-week-of-may-what-experts-have-to-say-11651990776525.html", "urlToImage": "https://images.livemint.com/img/2022/05/08/600x338/FPIs_1651991580302_1651991580412.jpg", "publishedAt": "2022-05-08T06:37:48Z", "content": "Foreign investors have pulled over 6,400 crore from the Indian equity market in the first four trading sessions of the ongoing month when the Reserve Bank of India (RBI) and US Federal Reserve raised… [+3883 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "HUL expects more sequential inflation, challenging operating environment in near term - Economic Times", "description": "In order to overcome the challenge, the company is adopting a 'bridge pack strategy', under which it will introduce products packs priced between the existing highest and the lowest prices, according to company officials. While the company will continue to dr…", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/hul-expects-more-sequential-inflation-challenging-operating-environment-in-near-term/articleshow/91413726.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91413745,width-1070,height-580,imgsize-31500,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-08T06:16:00Z", "content": "FMCG major HUL expects the operating environment to remain challenging in the near term as inflation is likely to continue for the next few quarters. In order to overcome the challenge, the company i… [+3000 chars]"}, {"source": {"id": null, "name": "Motoroctane.com"}, "author": "Swaraj Acharekar", "title": "2022 Mahindra Scorpio first teaser now out! - MotorOctane", "description": "2022 Mahindra Scorpio teaser, features, pricing, specifications, dimensions, engine options, transmission options, gearbox, variants", "url": "https://motoroctane.com/news/237566-2022-mahindra-scorpio-first-teaser-now-out", "urlToImage": "https://motoroctane.com/wp-content/uploads/2022/05/2.png", "publishedAt": "2022-05-08T05:44:32Z", "content": "Another day, another article on the Scorpio, but hang around, we finally have some good news on the big daddy of SUVs. Mahindra has finally posted the first teaser of the Scorpio, calling it the ‘Big… [+3114 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Sonny", "title": "Top 5 Tata EV Concepts Waiting To Go Into Production - CarDekho", "description": "The Indian carmaker revealed many exciting EV concepts in recent years that we’d like to see out on the road  Carmakers use concept vehicles to showcase their latest technologies and upcoming models to the general audience. Even without any large automotive e…", "url": "https://www.cardekho.com/india-car-news/top-5-tata-ev-concepts-waiting-to-go-into-production-29039.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29038/1651983870957/ElectricCar.jpg", "publishedAt": "2022-05-08T03:54:00Z", "content": "Carmakers use concept vehicles to showcase their latest technologies and upcoming models to the general audience. Even without any large automotive events following the pandemic, brands are still unv… [+3270 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Campus Activewear to debut tomorrow: What could be the listing premium? - Moneycontrol", "description": "Campus' trading premium in the unlisted market (grey market) declined to Rs 60 per share on May 7, down from Rs 95 on May 4. The volatility and correction in secondary markets is one of key reasons for this fall in grey market premium.", "url": "https://www.moneycontrol.com/news/business/ipo/campus-activewear-to-debut-tomorrow-what-could-be-the-listing-premium-8470081.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Campus-770x433.jpg", "publishedAt": "2022-05-08T03:44:33Z", "content": "Campus Activewear, the largest sports and athleisure footwear brand in India, is likely to start the day on May 9, at least with 15 percent premium on the bourses despite market volatility, say exper… [+4034 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "How Twitter CEO Parag Agrawal's wife is linked with Elon Musk's Twitter takeover - Times Now", "description": "Since Musk’s takeover of Twitter, rumours are rife that the CEO of the microblogging site might change. The Tesla chief is likely to temporarily take up the position of chief executive at Twitter once the $44-billion takeover is complete, according to Reuters…", "url": "https://www.timesnownews.com/business-economy/companies/how-twitter-ceo-parag-agrawals-wife-is-linked-with-elon-musks-twitter-takeover-article-91411569", "urlToImage": "https://static.tnn.in/thumb/msid-91411569,imgsize-100,width-1280,height-720,resizemode-75/91411569.jpg", "publishedAt": "2022-05-08T03:42:27Z", "content": "Neetu Kapoor talks about Alia Bhatt, Ranbir Kapoor's intimate wedding, reveals they told her 'we don't want a circus'"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Tata Ace EV | Walkaround | Chota Haathi Goes Electric! | Motoroids - Motoroids", "description": "Exactly 17 years after the Ace was launched in India, Tata have revealed the electric version of their \"chota hathi\". The Ace EV comes with Tata's EVOGEN pow...", "url": "https://www.youtube.com/watch?v=7J7DQFnDbkc", "urlToImage": "https://i.ytimg.com/vi/7J7DQFnDbkc/maxresdefault.jpg", "publishedAt": "2022-05-08T03:30:17Z", "content": null}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "14 Upcoming SUVs of 2022: Mahindra Scorpio to Hyundai Creta Facelift - CarToq.com", "description": "SUVs are selling like hotcakes right now. Most of the manufacturers are selling some kind of SUV in our country. If they do not have a SUV in their portfolio then they are currently working on one. Here, are the SUVs of 2022 that will be launching soon. Marut…", "url": "https://www.cartoq.com/14-upcoming-suvs-of-2022-mahindra-scorpio-to-hyundai-creta-facelift/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/05/14-suvs-2022-fb.jpg", "publishedAt": "2022-05-08T03:15:50Z", "content": "SUVs are selling like hotcakes right now. Most of the manufacturers are selling some kind of SUV in our country. If they do not have a SUV in their portfolio then they are currently working on one. H… [+5654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: Why has the forex kitty dipped $44.73 billion in 8 months? - The Indian Express", "description": "Were capital outflows by foreign portfolio investors to blame? If the rupee slides further, will the RBI be forced to intervene?", "url": "https://indianexpress.com/article/explained/explained-india-foreign-exchange-dip-7905564/", "urlToImage": "https://images.indianexpress.com/2022/05/foreign-exchange-2-1-1200.jpg", "publishedAt": "2022-05-08T02:55:14Z", "content": "Eight months after hitting a record high of $642.45 billion in September 2021, Indias foreign exchange reserves have now fallen below the $600 billion mark amid capital outflows and strengthening dol… [+2877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Karunjit Singh", "title": "Director General, International Renewable Energy Agency: India working well on phasing out coal, need to focus on existing schemes - The Indian Express", "description": "'We have seen that it is the fourth country in the world, when we consider installing capacity of renewables. And we have seen out there that they are raising the ambition for (renewable energy capacity) from 450 to 500 gigawatts by 2030.'", "url": "https://indianexpress.com/article/business/commodities/director-general-international-renewable-energy-agency-india-working-well-on-phasing-out-coal-need-to-focus-on-existing-schemes-7906010/", "urlToImage": "https://images.indianexpress.com/2022/05/06-Camera2-4col.jpg", "publishedAt": "2022-05-08T02:53:47Z", "content": "India’s efforts to boost renewable energy capacity were practically making it possible to reduce the use of coal, Francesco La Camera, Director General of the International Renewable Energy Agency to… [+5780 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Cryptocurrency Prices Today May 8: Bitcoin down, Polkadot biggest loser as cryptos trade in red - Moneycontrol", "description": "Bitcoin's price is currently Rs 28.08 lakh, with a dominance of 41.60 percent. This was a 0.12 percent increase over the day", "url": "https://www.moneycontrol.com/news/business/cryptocurrency/cryptocurrency-prices-today-may-8-bitcoin-down-polkadot-biggest-loser-as-cryptos-trade-in-red-8467361.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Bitcoin-770x433.jpg", "publishedAt": "2022-05-08T02:42:05Z", "content": "Cryptocurrencies traded in the red early on May 8. The global crypto market cap stood at $1.60 trillion, a 3.36 percent decrease over the last day. The total crypto market volume over the last 24 hou… [+3071 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sai Ishwarbharath, Romita Majumdar", "title": "Indian IT firms strive to crack the exit code - Economic Times", "description": "Attrition has turned into the biggest challenge for the $200 bn software services industry, significantly pulling at margins as well as stock prices of IT leaders.", "url": "https://economictimes.indiatimes.com/tech/information-tech/indian-it-firms-strive-to-crack-the-exit-code/articleshow/91391840.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91391904,width-1070,height-580/photo.jpg", "publishedAt": "2022-05-08T00:30:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": null, "name": "CryptoPotato"}, "author": "Dimitar Dzhondzhorov", "title": "90% of Central Banks Explore Launching CBDCs (BIS Survey) - CryptoPotato", "description": "According to the study, 73 out of 81 central banks work towards rolling out their own CBDC.", "url": "https://cryptopotato.com/90-of-central-banks-explore-launching-cbdcs-bis-survey/", "urlToImage": "https://cryptopotato.com/wp-content/uploads/2020/10/bis_report_cover.jpg", "publishedAt": "2022-05-07T22:10:07Z", "content": "In its most recent research, the Bank of International Settlements (BIS) estimated that nine out of ten central banks explore how to release their own CBDC. Moreover, 50% of those financial instituti… [+2856 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Indulekha Aravind and Shantanu Nandan Sharma", "title": "Inflation nation: Tighten your belts. Current price rise cycle will likely be long and grim - Economic Times", "description": "On the back of soaring prices of cereals, vegetables, meat and fish, oils and fats, consumer food price inflation too jumped to a 16-month high of 7.7% in March, ringing alarm bells simultaneously in Delhis North Block and Mumbais Mint Street. Indias wholesal…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/inflation-nation-tighten-your-belts-current-price-rise-cycle-will-likely-be-long-and-grim/articleshow/91405135.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91405128,width-1070,height-580,imgsize-66194,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-07T17:31:00Z", "content": "Even the gods, it seems, are being singed by inflation, if the experience of devotees like Shekhar M Shetty is anything to go by. Faced with the rising prices of nearly everything, one of the expense… [+7890 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "These Four Private Banks Offer Inflation-beating Rate On Fds To Senior Citizens. Check List | Mint - Mint", "description": "Four private banks offer inflation-beating rates on fixed deposits. The latest Consumer Price Index (CPI) inflation rate is at 6.95% in March. These four banks offer a 7% interest rate to senior citizens on their FDs below  ₹2 crore.", "url": "https://www.livemint.com/money/personal-finance/these-four-private-banks-offer-inflation-beating-rate-on-fds-to-senior-citizens-check-list-11651943155983.html", "urlToImage": "https://images.livemint.com/img/2022/05/07/600x338/INDIA-ELECTION-CASH-0_1646626656351_1651943252771.JPG", "publishedAt": "2022-05-07T17:12:00Z", "content": "Central banks across the globe are battling raging inflation which has led to monetary policy tightening and rate hikes in key interest rates. While mounting inflation continues to scare economic gro… [+4768 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "Reuters", "title": "Nigerian airlines to halt operations over rising jet fuel costs - wknd.", "description": "Domestic flights have been disrupted since March as some started to cancel internal schedules", "url": "https://www.khaleejtimes.com/aviation/nigerian-airlines-to-halt-operations-over-rising-jet-fuel-costs", "urlToImage": "https://image.khaleejtimes.com?uuid=4773c100-3a2b-5c54-a82e-100f1bd1ba44&function=cropresize&type=preview&source=false&q=75&crop_w=0.99999&crop_h=0.8427&width=1200&height=675&x=1.0E-5&y=0.1161", "publishedAt": "2022-05-07T16:41:37Z", "content": "Domestic flights have been disrupted since March as some started to cancel internal schedules\r\nPublished: Sat 7 May 2022, 8:41 PM\r\nNigerian airlines will stop operations from Monday until further not… [+1252 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Toyota lines up Rs 4800 cr investment to locally produce EV components in Karnataka - Deccan Herald", "description": "Toyota group firms, including Toyota Kirloskar Motor, on Saturday said they will invest about Rs 4,800 crore in Karnataka for local production of powertrain parts and other components of electric vehicles. Toyota Kirloskar Motor (TKM) along with Toyota Kirlos…", "url": "https://www.deccanherald.com/business/business-news/toyota-lines-up-rs-4800-cr-investment-to-locally-produce-ev-components-in-karnataka-1107290.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/07/whatsapp-image-2022-05-07-at-90208-pm-1107290-1651938042.jpg", "publishedAt": "2022-05-07T15:40:42Z", "content": "Toyota group firms, including Toyota Kirloskar Motor, on Saturday said they will invest about Rs 4,800 crore in Karnataka for local production of powertrain parts and other components of electric veh… [+4462 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Did Trump ‘encourage’ Musk to buy Twitter? Tesla CEO breaks silence - Hindustan Times", "description": "There have been rumours that Trump's Twitter handle might be restored after Musk's Twitter buyout deal is complete, more than a year after it was banned. Twitter had alleged some of the former US president's tweets had incited riots at the capitol in Washingt…", "url": "https://www.hindustantimes.com/world-news/did-donald-trump-encourage-musk-to-buy-twitter-tesla-ceo-breaks-silence-101651935967152.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/07/1600x900/Elon_Musk_and_Donald_Trump_1651936248328_1651936248728.jpg", "publishedAt": "2022-05-07T15:33:05Z", "content": "Elon Musk has rejected a report by a US website which claimed that former US president Donald Trump quietly encouraged him to buy social media giant Twitter. \r\nThis is false. Ive had no communication… [+1395 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Abhijit Lele", "title": "Central Bank of India yet to take decision on closing 600 branches - Business Standard", "description": "The number of branches stood at 4,528 at the end of December 2021", "url": "https://www.business-standard.com/article/finance/central-bank-of-india-yet-to-take-decision-on-closing-600-branches-122050700922_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/05/full/1651768765-1433.jpg", "publishedAt": "2022-05-07T15:23:00Z", "content": "Central Bank of India, which is under the Prompt Corrective Action (PCA) regime since June 2017, said on Saturday it is yet to decide on the number of branches to be shut in the current financial yea… [+1471 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Mahindra could restructure its auto business into 3 units - Team-BHP", "description": "According to a media report, the Mahindra Group has started the process of restructuring its auto business into three separate units. The report suggests that Mahindra will undertake a demerger process with to separate its EV, tractor and passenger vehicle bu…", "url": "https://www.team-bhp.com/news/mahindra-could-restructure-its-auto-business-3-units", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/mahindra-logo-1024x623-1584868456.jpg", "publishedAt": "2022-05-07T15:12:06Z", "content": "According to a media report, the Mahindra Group has started the process of restructuring its auto business into three separate units.\r\nThe report suggests that Mahindra will undertake a demerger proc… [+460 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Glum Looking, Non-Smiling\": Jet Airways CEO's Foreign Airline Experience - NDTV", "description": "Newly appointed Jet Airways CEO Sanjiv Kapoor has shared a list of what European carriers should avoid in order to improve the services for their travellers.", "url": "https://www.ndtv.com/india-news/jet-airways-ceo-sanjiv-kapoor-shares-a-things-to-avoid-list-when-boarding-foreign-carrier-2954629", "urlToImage": "https://c.ndtvimg.com/2022-05/q0n4eid8_sanjiv-kapoor_625x300_07_May_22.jpg", "publishedAt": "2022-05-07T14:33:34Z", "content": "Jet Airways CEO Sanjiv Kapoor's list was based on his recent travel experience\r\nNew Delhi: Newly appointed Jet Airways CEO Sanjiv Kapoor has shared a list of what European carriers should avoid in or… [+1978 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Aneesh Phadnis", "title": "Tata Projects shortlisted for Noida International Airport construction - Business Standard", "description": "Tata Projects is executing critical road, rail, and metro projects in the country. It has also been selected for the construction of the new parliament building in Delhi", "url": "https://www.business-standard.com/article/companies/tata-projects-shortlisted-for-noida-international-airport-construction-122050700853_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/24/full/1640369696-1902.jpg", "publishedAt": "2022-05-07T13:53:00Z", "content": "Tata Projects has been shortlisted to construct the terminal, runway, and various other airside and landside facilities at the Noida International Airport in Jewar.\r\nThe infrastructure and constructi… [+3000 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Bitcoin, Ethereum Technical Analysis: ETH Remains Close to 6-Week Low to Start the Weekend – Market Updates Bitcoin News - Bitcoin News", "description": "Following a recent string of declines, ETH continued to hover close to a six-week low to start the weekend.", "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-eth-remains-close-to-6-week-low-to-start-the-weekend/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/05/shutterstock_1259514784.jpg", "publishedAt": "2022-05-07T13:52:16Z", "content": "Following a recent string of declines, ETH continued to hover close to a six-week low to start the weekend. BTC was also lower on Saturday, as the world’s largest cryptocurrency remained closer to a … [+2649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nirmala Sitharaman Flags Anonymity Factor As Risk In Blockchain Use - NDTV Profit", "description": "Finance Minister Nirmala Sitharaman on Saturday flagged anonymity as an \"inherent risk\" in blockchain technology and called for taking precaution", "url": "https://www.ndtv.com/business/nirmala-sitharaman-flags-anonymity-factor-as-risk-in-blockchain-use-2954822", "urlToImage": "https://c.ndtvimg.com/2022-01/37u3ei9o_nirmala-sitharaman_625x300_31_January_22.jpg", "publishedAt": "2022-05-07T13:09:28Z", "content": "Finance Minister Nirmala Sitharaman has flagged anonymity as an \"inherent risk\" in blockchain technology\r\nMumbai: Finance Minister Nirmala Sitharaman on Saturday flagged anonymity as an \"inherent ris… [+2098 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Beijing To Discard A Whopping 50 Million Computers As US-China Tech War Reaches Crazy Levels - EurAsian Times", "description": "The Chinese government has reportedly instructed its central agencies and state-backed enterprises to replace foreign-branded personal computers with domestic substitutes to eliminate crucial overseas technology from its most sensitive plants. The government …", "url": "https://eurasiantimes.com/beijing-to-discard-a-whopping-50m-computers-as-us-china-tech-wa/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2021/05/us-china.jpg", "publishedAt": "2022-05-07T11:47:56Z", "content": "The Chinese government has reportedly instructed its central agencies and state-backed enterprises to replace foreign-branded personal computers with domestic substitutes to eliminate crucial oversea… [+4576 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Tata Group Chairman N Chandrasekaran Buys Rs 98-Crore Duplex in Mumbai; Know More - News18", "description": "Located in South Mumbai near Jaslok Hospital, the new address of Tata Group chairman N Chandrasekaran is called 33 South, and is a 28-storey high rise.", "url": "https://www.news18.com/news/india/tata-group-chairman-n-chandrasekaran-buys-rs-98-crore-duplex-in-mumbai-know-more-5129707.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/chandrasekaran-165192367716x9.jpg", "publishedAt": "2022-05-07T11:41:00Z", "content": "Tata Group chairman N Chandrasekaran and his family have reportedly purchased a luxury duplex home in a posh Mumbai locality. According to reports, the Tata Group chief and his family have purchased … [+2747 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": null, "title": "Elon Musk's $44bn Twitter buyout challenged in shareholder lawsuit - DAWN.com", "description": "Checkout for the Latest and Top News from Pakistan and around the world", "url": "https://www.dawn.com/", "urlToImage": "http://www.dawn.com/_img/social-default.jpg", "publishedAt": "2022-05-07T10:37:01Z", "content": "Says he found the demand \"absolutely unacceptable\" and that's when things started going awry between his govt and the US.\r\nPublished07 May, 202210:37pm\r\nAssures will make efforts to bring the wheat p… [+1476 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bhaskar Dutta", "title": "What should you do right now if you own L&T Infotech shares? Analysts suggest caution - Economic Times", "description": "The long-awaited merger of the L&T Infotech and Mindtree creates a new heavyweight in the Indian IT space and analysts believe that the amalgamation of the IT subsidiaries of L&T holds tremendous value for shareholders over the medium term.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/what-should-you-do-right-now-if-you-own-lt-infotech-shares-analysts-suggest-caution/articleshow/91396258.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91396314,width-1070,height-580,imgsize-605584,overlay-etmarkets/photo.jpg", "publishedAt": "2022-05-07T08:54:00Z", "content": "NEW DELHI: The long-awaited merger of the L&amp;T Infotech and Mindtree creates a new heavyweight in the Indian IT space and analysts believe that the amalgamation of the IT subsidiaries of L&amp;T h… [+4093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "HDFC hikes home loan rates for all customers, to be effective from May 9 - The Indian Express", "description": "This comes days after the lender had increased its  benchmark lending rate by 5 basis points, leading to an increase in equated monthly instalments for existing borrowers.", "url": "https://indianexpress.com/article/business/hdfc-home-loan-rates-hike-may-9-7905358/", "urlToImage": "https://images.indianexpress.com/2021/08/Mortgage-lender-HDFC.jpg", "publishedAt": "2022-05-07T08:41:33Z", "content": "Three days after the Reserve Bank India (RBI) announced a 40 basis point hike in its repo rate, HDFC Saturday announced raising its Retail Prime Lending Rate (RPLR) by 30 basis points, leading to an … [+1383 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sahil Kukreja", "title": "First made in India electric bus showcased to Nitin Gadkari: Details explained - Times of India", "description": "News News: The EKA E9 is claimed to be the country's first completely ‘Made-In-India’ 9- metre pure electric, zero-emission bus.", "url": "https://timesofindia.indiatimes.com/auto/news/first-made-in-india-electric-bus-showcased-to-nitin-gadkari-details-explained/articleshow/91395095.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91395811,width-1070,height-580,imgsize-847907,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-07T08:34:00Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rakesh Jhunjhunwala Earns ₹70 Crore From Dividend Announced By These 3 Stocks | Mint - Mint", "description": "Rakesh Jhunjhunwala portfolio: As Big Bull and his wife Rekha Jhunjhunwala hold 4,48,50,970 Titan shares and Titan Company has announced  ₹7.50 dividend for each shares, rise in Rakesh Jhunjhunwala's net worth after this dividend announcement is around  ₹34 c…", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-earns-rs-70-crore-from-dividend-announced-by-these-3-dividend-paying-stocks-11651907503085.html", "urlToImage": "https://images.livemint.com/img/2022/05/07/600x338/Rakesh_Jhunjhunwala_Portfolio_Equirus_1627126348131_1651907626582.PNG", "publishedAt": "2022-05-07T07:18:51Z", "content": "Rakesh Jhunjhunwala portfolio: A stock market investor not just gain from the rise in one's portfolio stocks but from the dividends announced by the company as well. Recently, three Rakesh Jhunjhunwa… [+2391 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Multibagger Stock To Consider Bonus Shares Issue Next Week | Mint - Mint", "description": "Cosmo Films' board will meet on May 9, 2022 to consider the issuance of bonus shares", "url": "https://www.livemint.com/market/stock-market-news/multibagger-stock-cosmo-films-to-consider-bonus-shares-issue-next-week-11651904820919.html", "urlToImage": "https://images.livemint.com/img/2022/05/07/600x338/bonus_shares_1651905171076_1651905171233.jpg", "publishedAt": "2022-05-07T06:56:29Z", "content": "Cosmo Films recently announced that its board will meet next week on Monday, May 9, 2022 to consider the issuance of bonus equity shares of the company. The board will also consider the audited finan… [+1074 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Preeti Motiani", "title": "ICICI bank hikes interest rate on home loan: How much your EMI will go up - Economic Times", "description": "If you are an ICICI Bank home loan customer, here's how much your EMI will go up post this hike.", "url": "https://economictimes.indiatimes.com/wealth/borrow/icici-bank-hikes-interest-rate-on-home-loan-how-much-your-emi-will-go-up/articleshow/91391858.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91391882,width-1070,height-580,imgsize-492552,overlay-etwealth/photo.jpg", "publishedAt": "2022-05-07T05:10:00Z", "content": "After the Reserve Bank of India (RBI) hiked the repo rate in an off cycle meet by 40 basis points (100 basis points = 1%) on May 4, 2022, banks have started hiking the interest rates on home loans.\r\n… [+2158 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Vipul Das", "title": "PNB Revises Interest Rates On Fixed Deposits (W.e.f. 7th May 2022) - Goodreturns", "description": "Punjab National Bank (PNB), a public sector lender, has announced an interest rate rise on fixed deposits of less than Rs 2 crore. The statement has been issued today, May 7, 2022, and as a result of the modification, the bank is now giving a 3% interest rate…", "url": "https://www.goodreturns.in/personal-finance/investment/pnb-revises-interest-rates-on-fixed-deposits-w-e-f-7th-may-2022-1248516.html", "urlToImage": "https://www.goodreturns.in/img/2020/03/pnblogo-1585566055.jpeg", "publishedAt": "2022-05-07T04:41:58Z", "content": "Punjab National Bank (PNB), a public sector lender, has announced an interest rate rise on fixed deposits of less than Rs 2 crore. The statement has been issued today, May 7, 2022, and as a result of… [+2052 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "RBI Scrambles to Shield Rupee as Marginal Utility of Blaming Nehru Falls - The Wire", "description": "The way things are unfolding in the political economy, Modi may have to give Nehru some much-needed rest and  start looking within.", "url": "https://thewire.in/economy/rbi-scrambles-to-shield-rupee-as-marginal-utility-of-blaming-nehru-falls", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/07/16154815/2021-07-15T120950Z_1_LYNXMPEH6E0MQ_RTROPTP_4_INDIA-FINANCE-TECH-800x400.jpg", "publishedAt": "2022-05-07T04:39:48Z", "content": "A version of this article first appeared in The India Cable a subscribers-only newsletter published by The Wire and Galileo Ideas. You can subscribe to The India Cable by clicking here.\r\nRecently in … [+5470 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nishanth Vasudevan", "title": "A premium sports car: The smoking gun behind the shakeup at Axis Mutual Fund - Economic Times", "description": "The fund house, a joint venture between Axis Bank and the UK's Schroders, is investigating whether the executives concerned -Viresh Joshi and Deepak Agarwal - were involved in front-running, received kickbacks and executed trades that were detrimental to the …", "url": "https://economictimes.indiatimes.com/mf/mf-news/axis-mf-suspends-two-fund-managers-over-irregularities/articleshow/91389152.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91390669,width-1070,height-580,imgsize-17542,overlay-etwealthmutualfunds/photo.jpg", "publishedAt": "2022-05-07T03:51:00Z", "content": "Mumbai: Axis Mutual Fund, India's seventh-biggest asset manager by way of pooled cash under management, has suspended two equity fund managers amid an investigation into suspected irregularities.\r\nTh… [+3937 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Tata Nexon The Most Sold SUV In April 2022 With 94% Growth - GaadiWaadi.com", "description": "Tata Nexon posted 13,471 unit sales in April 2022 as against 6,938 units during the corresponding month in 2021 with a YoY growth of 94%", "url": "https://gaadiwaadi.com/tata-nexon-the-most-sold-suv-in-april-2022-with-94-growth/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/05/tata-nexon-11.jpg", "publishedAt": "2022-05-07T03:00:36Z", "content": "Tata Motors continued to sit third in the overall manufacturers’ sales standings in the months of April 2022 as 41,590 units were sold against 25,096 units during the same period in 2021 with an appr… [+1954 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Airtel broadband suffers major outage across India, millions of users affected - Moneycontrol", "description": "Airtel broadband went down for users in Delhi-NCR, Mumbai, Bengaluru, Hyderabad, Jaipur, and other cities.", "url": "https://www.moneycontrol.com/news/business/airtel-broadband-suffers-major-outage-across-india-millions-of-users-affected-8467401.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/Airtel-AFP-770x433.jpg", "publishedAt": "2022-05-07T02:32:19Z", "content": "Airtel broadband services on Friday night suffered a major outage as users were unable to access internet on both mobile and desktop, reported IANS. The outage affected millions of users across the c… [+699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Apple stops card payments in India - The Indian Express", "description": "Apple users have complained for the past two months, about not being able to pay for subscriptions for apps with their saved cards.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-stops-accepting-payments-with-indian-debit-credit-cards-7903825/", "urlToImage": "https://images.indianexpress.com/2022/05/iphone-12.jpg", "publishedAt": "2022-05-07T02:15:29Z", "content": "iPhone-maker Apple has stopped accepting credit and debit card payments for subscriptions and app purchases using Apple ID in India. This means that Apple device users with subscriptions running on t… [+3293 chars]"}]}