{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Starts Following PM Modi On Twitter, Users Ask If Tesla is Coming To India - NDTV", "description": "The news about Elon Musk's follower update was also posted on Twitter by \"Elon Alerts\", which monitors the Tesla chief's account activity.", "url": "https://www.ndtv.com/world-news/elon-musk-starts-following-pm-modi-users-ask-if-tesla-is-coming-to-india-3935290", "urlToImage": "https://c.ndtvimg.com/2023-04/u06k893g_elon-musk-with-pm-modi-1200_625x300_10_April_23.jpg", "publishedAt": "2023-04-10T10:13:00Z", "content": "Elon Musk with PM Modi at the Tesla headquarters in 2015.\r\nTwitter chief and billionaire Elon Musk has started following Prime Minister Narendra Modi. A screenshot of a list of 195 people he follows … [+1650 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Asmita Pant", "title": "Stock Market Live: Sensex, Nifty 50 off highs, Tata Motors, ONGC gain, Bajaj Finance, Tata Consumers lag - CNBCTV18", "description": "Share Market Highlights: Indian equity benchmarks BSE Sensex and NSE Nifty50 ended with minor gains, ending in the green for sixth session in a row, indices' longest gaining streak in four months. The market resumed trading after a three day break. IT and aut…", "url": "https://www.cnbctv18.com/market/share-market-live-updates-nifty-sensex-bse-nse-stock-market-today-titan-adani-tata-motors-16363301.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/10/SENSEX_NSE_nifty_BSE_Stock-market-1019x573.jpg", "publishedAt": "2023-04-10T09:02:29Z", "content": "Market At Close | Sensex and Nifty gain for sixth straight day to post longest gaining streak in 4 months\r\nFinancials underperform with Nifty Bank snapping seven-day gaining streak\r\nSensex closes 14 … [+1020 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "TCS Q4 preview: Muted revenue growth likely, deal momentum may continue; result on 12 April | Mint - Mint", "description": "During December 2022 quarter, TCS garnered a net profit of  ₹10,846 crore attributable to shareholders on a consolidated basis up by 11.02% YoY and 3.98% QoQ. Meanwhile, TCS consolidated revenue from operations came in at  ₹58,229 crore increasing by 19.11% Y…", "url": "https://www.livemint.com/companies/news/tcs-q4-preview-muted-revenue-growth-likely-deal-momentum-may-continue-key-factors-here-11681054994913.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/2-0-799673764-tcs-0_1680437459531_1681055131891_1681055131891.jpg", "publishedAt": "2023-04-10T08:57:24Z", "content": "Tech giant, Tata Consultancy Services (TCS) is also set to kick start the fourth quarterly earnings season for FY23 on April 12. Among the positives, TCS is likely to lead growth in Tier-1 and mainta… [+4889 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ashwin Mohan", "title": "Temasek’s entry valuation reflects long-term potential of Indian healthcare: Dr Ranjan Pai of Manipal... - Moneycontrol", "description": "Temasek has raised its stake and turned the controlling shareholder in Manipal Hospitals by shelling out Rs 16,000 crore in a mega transaction valuing the top pan-India hospital chain at Rs 40,000-42,000 crore", "url": "https://www.moneycontrol.com/news/business/temaseks-entry-valuation-reflective-of-long-term-potential-of-indian-healthcare-segment-says-dr-ranjan-pai-of-manipal-group-10388811.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/IMG-20230410-WA0003-1-770x433.jpg", "publishedAt": "2023-04-10T08:20:23Z", "content": "It's the largest deal ever by a private equity fund in the bustling Indian healthcare sector. Singapore's Temasek has taken a giant stride in the segment by upping its stake and becoming the controll… [+7220 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Adani Group rejects Financial Times report, says ‘race to…’ - Hindustan Times", "description": "Adani Group wrote a letter to Financial Times following the article's publication that contained what the conglomerate termed “fundamental misunderstandings.”", "url": "https://www.hindustantimes.com/business/adani-group-rejects-financial-times-report-says-race-to-101681114020600.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/10/1600x900/ADANI-INDIA--0_1681114334576_1681114343544_1681114343544.jpg", "publishedAt": "2023-04-10T08:16:18Z", "content": "The Adani Group on Monday outrightly refuted the recent 'Financial Times' report on foreign direct investment into the conglomerate and termed it to be a \"competitive race\" to tear down the conglomer… [+1789 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Haripriya Suresh", "title": "PhonePe’s Pincode app: How it stacks up in week 1 of use - Moneycontrol", "description": "Can Pincode — which had over 10,000 downloads on Google Play Store at the time of writing — match up to other apps? Let’s find out.", "url": "https://www.moneycontrol.com/news/business/phonepes-pincode-app-how-it-stacks-up-in-week-1-of-use-10388791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/Sameer-Nigam_Founder-CEO-launching-Pincode-1-770x433.jpg", "publishedAt": "2023-04-10T08:09:16Z", "content": "PhonePe, Indias largest UPI app by market size, ventured into the hyperlocal e-commerce app space with Pincode last week. Built on top of the Open Network for Digital Commerce network, it was the fir… [+6211 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Aparna Deb", "title": "MGL, ONGC, IGL Gain As Govt Revises Gas Pricing Mechanism; Key Points for Investors - News18", "description": "Shares of oil & gas companies were trading higher by up to 4 per cent on the BSE in Monday’s intra-day trade; Know why", "url": "https://www.news18.com/business/markets/mgl-ongc-igl-gain-as-govt-revises-gas-pricing-mechanism-key-points-for-investors-7510207.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/lpg-cng-oil-india-gas-price-168080184916x9.jpg", "publishedAt": "2023-04-10T08:06:05Z", "content": "Shares of oil &amp; gas companies were trading higher by up to 4 per cent on the BSE in Mondays intra-day trade after the Government of India accepted several key recommendations made by the Kirit Pa… [+3571 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Tata Nexon facelift teased ahead of its official debut - Team-BHP", "description": "Tata Motors has shared a short teaser of the upcoming Nexon facelift. The carmaker hasn't provided any details, though. The Nexon facelift has already been spotted testing. So we have a rough idea of what to expect in the updated model. The upcoming Nexon wil…", "url": "https://www.team-bhp.com/news/tata-nexon-facelift-teased-ahead-its-official-debut", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Nexon1_2.jpg", "publishedAt": "2023-04-10T08:04:27Z", "content": "Tata Motors has shared a short teaser of the upcoming Nexon facelift. The carmaker hasn't provided any details, though.\r\nThe Nexon facelift has already been spotted testing. So we have a rough idea o… [+801 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Ansh", "title": "These 10 Car Brands Were The Most Popular In March 2023 - CarDekho", "description": "Hyundai expands its gap over Tata to strengthen hold on second spot  As carmakers updated their lineup to meet the latest emission regulations that came into effect from April 2023, many saw their monthly sales rise in March. While most of firms witnessed a d…", "url": "https://www.cardekho.com/india-car-news/these-10-car-brands-were-the-most-popular-in-march-2023-30676.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/30675/1681114402785/GeneralNew.jpg", "publishedAt": "2023-04-10T07:40:00Z", "content": "Hyundai expands its gap over Tata to strengthen hold on second spot\r\nAs carmakers updated their lineup to meet the latest emission regulations that came into effect from April 2023, many saw their mo… [+3391 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Suchitra Mandal", "title": "India’s GDP growth may drop to 5.5% in FY24 on consumption headwinds, general elections: UBS Economist - Moneycontrol", "description": "Tanvee Gupta Jain expects the RBI to hold policy rates steady and possibly even cut by 50 basis points in the second half of FY24 due to recent global financial market volatility and banking turmoil", "url": "https://www.moneycontrol.com/news/business/markets/indias-gdp-growth-may-drop-to-5-5-in-fy24-on-consumption-headwinds-general-elections-ubs-economist-10382551.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/Tanvee20Gupta20Jain-770x433.jpg", "publishedAt": "2023-04-10T07:16:12Z", "content": "The Reserve Bank of India (RBI) is likely to go for a 50 basis-point rate cut in the second half of fiscal 2024 even as the GDP growth may drop to 5.5 percent during the fiscal, according to Tanvee G… [+4527 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Bajaj Auto takes over Triumph's India sales and marketing operations - The Economic Times", "description": "Indian two-wheeler manufacturer Bajaj Auto will handle all of the sales and marketing operations for Triumph Motorcycles in India. The deal, which was first announced in 2020, will see Bajaj Auto take over all 15 dealerships of the British brand. The move is …", "url": "https://economictimes.indiatimes.com/industry/auto/two-wheelers-three-wheelers/bajaj-takes-over-triumphs-indian-sales-and-marketing-operations/articleshow/99372885.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99373460,width-1070,height-580,imgsize-73558,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T07:07:41Z", "content": "Two-wheeler manufacturer Bajaj Auto is set to take over all of Triumph Motorcycles' sales and marketing operations in the country, according to a filing from the Indian manufacturer. First announced … [+1285 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Top Nifty50 stocks analysts suggest buying this week - The Economic Times", "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks - earnings, fundamentals, relative valuation, risk and price momentum to generate standardized scores.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-this-week/articleshow/99373125.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99373154,width-1070,height-580/photo.jpg", "publishedAt": "2023-04-10T06:53:53Z", "content": "SynopsisStock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks - earnings, fundamentals, relative valuation, risk and … [+46 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Rekha Jhunjhunwala earns ₹400 crore in 15 minutes from these 2 Tata group stocks | Mint - Mint", "description": "Rekha Jhunjhunwala portfolio: After strong Q4FY23 business update, these two Tata group stocks witnessed strong buying during early morning deals on Monday", "url": "https://www.livemint.com/market/stock-market-news/rekha-jhunjhunwala-earns-rs-400-cr-in-15-minutes-from-these-2-tata-group-stocks-11681108507878.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/10/600x338/Rekha_Jhunjhunwala_portfolio_1681108810567_1681108810900_1681108810900.jpg", "publishedAt": "2023-04-10T06:49:40Z", "content": "Rekha Jhunjhunwala portfolio stocks Titan Company and Tata Motors witnessed strong buying interest among stock market bulls in early morning deals on Monday. Within 15 minutes of opening bell today, … [+3049 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "TVS Plans New Launches & Refreshed Products This FY - Details - GaadiWaadi.com", "description": "In the current fiscal (April 2023 to March 2024), the homegrown manufacturer will introduce a number of new models and updated offerings", "url": "https://gaadiwaadi.com/tvs-plans-new-launches-refreshed-products-this-fy-details/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2023/03/TVS-Custom-Bike-Ronin-MotoSoul-2023-Goa.jpg", "publishedAt": "2023-04-10T06:19:28Z", "content": "On the back of impressive sales numbers in recent months, TVS Motor Company is planning to consolidate its product portfolio by bringing in new models. In the current fiscal (April 2023 to March 2024… [+1857 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Next-gen Hyundai Verna looks dreary in base EX trim - Team-BHP", "description": "Hyundai launched the next-gen Verna last month. For Rs 10.90 lakh (ex-showroom), you get the base EX variant, which is also the dullest trim of the lot. The entry-level variant of the Verna gets halogen headlamps and misses out on the most striking design fea…", "url": "https://www.team-bhp.com/news/next-gen-hyundai-verna-looks-dreary-base-ex-trim", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/hyundai-verna-right-front-three-quarter5.jpg", "publishedAt": "2023-04-10T06:07:26Z", "content": "Hyundai launched the next-gen Verna last month. For Rs 10.90 lakh (ex-showroom), you get the base EX variant, which is also the dullest trim of the lot.\r\nThe entry-level variant of the Verna gets hal… [+769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Covers Up \"W\" In Twitter Sign Outside Headquarters. He Says... - NDTV", "description": "After replacing Twitter's blue bird logo with the doge meme and briefly restoring it, CEO Elon Musk has now covered the \"W\" in the microblogging platform's name outside the company's headquarters in San Francisco, US.", "url": "https://www.ndtv.com/world-news/elon-musk-covers-up-w-in-twitter-s-sign-outside-san-francisco-headquarters-3934562", "urlToImage": "https://c.ndtvimg.com/2023-04/dc2d8ko_elon-musk-covers-up-w-in-twitter-sign-outside-san-francisco-headquarters-_625x300_10_April_23.jpg", "publishedAt": "2023-04-10T06:04:59Z", "content": "Elon Musk covered the \"W\" in Twitter's sign outside the company's San Francisco office.\r\nAfter replacing Twitter's blue bird logo with the doge meme and briefly restoring it, CEO Elon Musk has now co… [+2900 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mohit Bhalla", "title": "Reliance Retail, WH Smith, Gordon Brothers-led consortium among 49 that submit EoIs for Future Retail - Economic Times", "description": "The company owns large and small format stores under the Big Bazaar Brand. The company also has a 100% subsidiary which runs nearly 100 stores under the WH Smith brand. The shares of the subsidiary could be available for a buyer to purchase. The company also …", "url": "https://economictimes.indiatimes.com/industry/services/retail/reliance-retail-wh-smith-gordon-brothers-led-consortium-among-49-that-submit-eois-for-future-retail/articleshow/99371140.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99371115,width-1070,height-580,imgsize-28118,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T05:37:00Z", "content": "New Delhi: Reliance Retail, WH Smith, a Gordon Brothers-led international consortium, JC Flowers and Jindal Power are amongst 49 players that have submitted expressions of interest (EoIs) for Future … [+1685 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Viral Desk", "title": "AI-Generated Images Of 'Slumdog Millionaires' Are Going Viral, Amused Netizens Call It 'Real' - Times Now", "description": "An artist named Gokul Pillai used artificial intelligence to create images of wealthy people dressed in rags and living in slums. The images, which included popular figures such as Donald Trump, Elon Musk, and Mukesh Ambani, were shared on social media.", "url": "https://www.timesnownews.com/viral/ai-generated-images-of-slumdog-millionaires-viral-netizens-amused-article-99369399", "urlToImage": "https://static.tnn.in/thumb/msid-99369399,updatedat-1681105917073,width-1280,height-720,resizemode-75/99369399.jpg", "publishedAt": "2023-04-10T05:33:52Z", "content": "Bigg Boss 16 Fame Priyanka Chahar Choudhary Backs Out Of Rohit Shetty's Khatron Ke Khiladi 13, Leaving Makers Irked?"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sayantan Sarkar", "title": "ONGC, Oil India stand to gain from new gas price mechanism: Analysts - Moneycontrol", "description": "The formula for the new gas pricing mechanism will include a floor and ceiling at $4 and $6.5 respectively. The ceiling will be kept in force for the next two years.", "url": "https://www.moneycontrol.com/news/business/stocks/ongc-oil-india-stand-to-gain-from-new-gas-price-mechanism-analysts-10387531.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/natural-gas-770x433.png", "publishedAt": "2023-04-10T05:10:49Z", "content": "The domestic gas price mechanism unveiled by the government last week is likely to be beneficial for upstream companies such as Oil and Natural Gas Corporation Ltd (ONGC) and Oil India Ltd (OIL), acc… [+2203 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "IIT Delhi roommates launch cattle trading platform, revenue jumps to 565 cr | Mint - Mint", "description": "The company made a 90% of its revenue from cattle trading in FY22. The remaining 10% came from healthcare, artificial insemination, and marketplace commission.", "url": "https://www.livemint.com/news/india/iit-delhi-roommates-launch-cattle-trading-platform-revenue-jumps-to-565-cr-11681101577170.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/10/600x338/sfdgfd_1681102707805_1681102712755_1681102712755.PNG", "publishedAt": "2023-04-10T05:00:31Z", "content": "Two students from IIT Delhi have launched an online platform, 'Animall' for buying and selling cattle resulting in an impressive revenue increase. The platform's revenue was valued at 7.4 crore for F… [+1661 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vaibhavi Ranjan", "title": "JLR wholesale numbers for Jan-Mar drive Tata Motors shares to 7-month high - Moneycontrol", "description": "Global research and broking firm, Goldman Sachs upgraded the stock to &quot;buy&quot;, citing  improved volume outlook for the company's luxury arm JLR. The broking firm sees an upside potential of over 24 percent for Tata Motors.", "url": "https://www.moneycontrol.com/news/business/markets/jlr-sales-wholesale-numbers-drive-tata-motors-shares-to-7-month-high-in-jan-mar-10387231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/tata-motors-car-logo-770x433.jpg", "publishedAt": "2023-04-10T04:53:22Z", "content": "Shares of Tata Motors zoomed 8 percent in early trade on April 10 after the company recorded robust group global wholesales, including those of its luxury arm, Jaguar Land Rover (JLR), during the Jan… [+2878 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Market has more upside potential than downside risk right now: Sandip Sabharwal - Economic Times", "description": "It is very much possible on the large cap side on a percentage gain prospect because even now many of these analysts who used to be so positive on Tata Motors two-three years back with target price of 800-900, they are still at 450-500 target prices, so it is…", "url": "https://economictimes.indiatimes.com/markets/expert-view/market-has-more-upside-potential-than-downside-risk-right-now-sandip-sabharwal/articleshow/99369918.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99369900,width-1070,height-580,imgsize-54158,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-10T04:48:00Z", "content": "\"I would still think that not only in April but going forward over this new rally which has started, unless and until we get some shock which we cannot foresee at this point of time, the rally should… [+3778 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "1:2 stock split: Multibagger stock trades ex-split after 600% rally in 2 years. Share jumps | Mint - Mint", "description": "Multibagger stock: On stock split record date, the small-cap stock witnessed fresh buying and logged over 2.5% rise during early morning deals", "url": "https://www.livemint.com/market/stock-market-news/12-stock-split-multibagger-stock-trades-ex-split-after-600-rally-in-2-years-11681100571151.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/10/600x338/Multibagger_stocks_1681100816993_1681100817295_1681100817295.jpg", "publishedAt": "2023-04-10T04:39:51Z", "content": "Multibagger stock: Deep Industries is one of the multibagger stocks that Indian stock market has produced in recent years. The small-cap multibagger stock surged to the tune of over 600 per cent in l… [+1789 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Adani Green Energy shares hit 5% upper circuit after block deal - Moneycontrol", "description": "Around 13.70 lakh shares (0.10% equity) worth Rs 123.09 crore changed hands at an average of RS 899 per share, reported CNBC-TV18.", "url": "https://www.moneycontrol.com/news/business/earnings/adani-green-energy-shares-hit-5-upper-circuit-after-block-deal-10387571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/stocks_sensex_nifty_stockmarket-770x433.jpg", "publishedAt": "2023-04-10T04:39:22Z", "content": "Shares of Adani Green Energy Ltd on Monday hit the 5 percent upper circuit after a huge block deal where around 13.70 lakh shares changed hands, according to a CNBC TV report. However, the details of… [+1637 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "Swarajya Staff", "title": "First 'Indian' Production Line For Apple Products - Tata Group All Set To Take Over Wistron's Bengaluru Plant - Swarajya", "description": null, "url": "https://swarajyamag.com/economy/first-indian-production-line-for-apple-products-tata-group-all-set-to-take-over-wistrons-bengaluru-plan", "urlToImage": "https://gumlet.assettype.com/swarajya%2F2019-01%2F5ee04139-58b8-4601-a64f-1032f99c08b0%2FGettyImages_457376198.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-04-10T04:14:06Z", "content": "The Tata group is set to complete acquisition of Wistron's Bengaluru iPhone plant by April end. This will pave the way for India's first 'local' production line for Apple.\r\nNews reports say the India… [+1687 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kailash Babar", "title": "Godrej Properties FY23 pre-sales Rs 12,232 crore, up 56%; records best-ever performance - The Economic Times", "description": "Godrej Properties reported a growth of 56% in its bookings for FY 2022-23, totaling INR 12,232 crore ($1.6bn), 22% higher than its full-year guidance. Sales volumes grew by 19% sequentially and 40% YoY, reaching 15.21 million sq ft for the year. The developer…", "url": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/godrej-properties-fy23-pre-sales-rs-12232-crore-up-56-records-best-ever-performance/articleshow/99369022.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99369011,width-1070,height-580,imgsize-481070,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T04:00:00Z", "content": "Godrej Properties, the real estate development arm of Godrej Group, has recorded bookings worth Rs 4,051 crore for the quarter ended March taking its financial year 2022-23s bookings up 56% to Rs 12,… [+2497 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "Swastika Mukhopadhyay", "title": "Tata Motors Shares Gain After Analysts Expect Faster Debt Reduction - BQ Prime", "description": "Tata Motors' may reduce its debt faster helped by rising output, free cash flow and cash generation at its India unit and JLR.", "url": "https://www.bqprime.com/markets/tata-motors-to-see-faster-debt-reduction-as-output-ramp-up-cash-flow-aids", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2022-05%2F88a02b80-4ede-4708-b7cd-39c49143e85c%2FTata_Motors_logos_are_pictured_outside_their_flagship_showroom_in_Mumbai_May_28__2013__Picture_taken.JPG?rect=0%2C392%2C3000%2C1575&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-04-10T03:40:44Z", "content": "Shares of Tata Motors rose 7.17% to Rs 469.05 apiece as of 9:32 a.m., compared with 0.11% gain in the benchmark NSE Nifty 50. The stock gained as much as 7.96% intraday, the most since Jan. 27, 2023.… [+461 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Dividend stock: Over 225 year old company to consider 2nd interim dividend today | Mint - Mint", "description": "Dividend stock is going to consider and approve second interim dividend today after giving  ₹5.50 per share interim dividend in November 2022", "url": "https://www.livemint.com/market/stock-market-news/dividend-stock-over-225-year-old-company-to-consider-2nd-interim-dividend-today-11681097065965.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/10/600x338/Dividend_stock_2023_1681097569250_1681097569445_1681097569445.jpg", "publishedAt": "2023-04-10T03:40:15Z", "content": "Dividend stock in April 2023: More than 225 year old company is going to second interim dividend for the financial year 2022-23. The Murugappa group company has informed Indian bourses that board of … [+2021 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "Technical stock picks: DLF among 4 stocks that can rally up to 32% in near term - Money-making Ideas - Economic Times", "description": "So far in 2023, Nifty has fallen over 3% amid weak global cues. However, the Indian equity market witnessed some relief last week when the RBI, in a surprise move, decided to keep the repo rate unchanged at 6.50%. Amid this backdrop, a host of analysts have s…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/technical-stock-picks-dlf-among-4-stocks-that-can-rally-up-to-32-in-near-term/money-making-ideas/slideshow/99368462.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99368462,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-10T03:18:00Z", "content": "The price movement since November 2022 is characterised by equal highs and rising lows. This is a classic breakout of an ascending triangle pattern. If we put Bollinger Bands (20,2) on the price on w… [+461 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Vaibhavi Ranjan", "title": "Goldman downgrades Maruti Suzuki to 'neutral' on slowing demand for small cars - Moneycontrol", "description": "Goldman Sachs lowers the target price for the Maruti Suzuki stock by 20 percent to to Rs 8,800 after domestic sales declined in March to 139,952 units, down from 143,899 units a year ago", "url": "https://www.moneycontrol.com/news/business/markets/goldman-downgrades-maruti-suzuki-to-neutral-on-slowing-demand-for-small-cars-10386831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/5-maruti-suzuki-representative-image-770x433.jpg", "publishedAt": "2023-04-10T03:16:11Z", "content": "Global research and broking firm Goldman Sachs has downgraded auto major Maruti Suzuki India to 'neutral' from its earlier 'buy' rating. It has also slashed the price target for the stock by 20 perce… [+1605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "Big Movers on D-St: What should investors do with Cholamandalam Investment, Dr Reddy’s Laboratories and HC - The Economic Times", "description": "Post reversal, the stock has already rallied over 8%. Currently, the stock is comfortably trading above short-term averages, and it also formed a range breakout formation on the weekly charts which indicates the continuation of the uptrend in the future.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-st-what-should-investors-do-with-cholamandalam-investment-dr-reddys-laboratories-and-hcl-tech/articleshow/99367538.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99367522,width-1070,height-580,imgsize-624482,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-10T02:46:00Z", "content": "Indian markets closed in the green for the fifth consecutive day on Thursday. The S&amp;P BSE Sensex rose more than 100 points while Nifty50 closed just a shade below 17600 levels.Indian market remai… [+2911 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Dhuraivel Gunasekaran", "title": "14 mid-cap stocks held by mutual funds yet to unlock their potential. Do you own any? - Moneycontrol", "description": "Fund managers are holding these lethargic stocks in their portfolio believing that these businesses will play out well in the future", "url": "https://www.moneycontrol.com/news/photos/business/personal-finance/midcap-stocks-held-by-mutual-funds-10385881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/Feat-2-680x435.jpg", "publishedAt": "2023-04-10T02:21:14Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Hiral Thanawala", "title": "Lenders offer lower rates on new home loans: Should you refinance your loan? - Moneycontrol", "description": "One reason for the disparity in interest rates between new and old home loans is because banks have cut their margins to attract new borrowers.", "url": "https://www.moneycontrol.com/news/business/personal-finance/lenders-offer-lower-rates-on-new-home-loans-should-you-refinance-your-loan-10379871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/interest-rate_shutterstock_313523747-770x433.jpg", "publishedAt": "2023-04-10T02:20:15Z", "content": "Mayur Jaiswal, 42, a private sector employee, took a home loan of Rs 50 lakh at 6.75 percent for 15 years from a public sector bank in April 2022. The interest rate has now increased to 9.25 percent … [+6784 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vijay Kishore", "title": "Stocks to Watch: Tata Motors, Adani Green, ONGC, Titan, Muthoot Finance | Mint - Mint", "description": "India's factory output, inflation data along with major Q4 earnings of IT companies alongside global trends will dictate the market this week. Additionally, foreign funds flow, movement of the rupee, and crude oil prices performance will also have their share…", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-tata-motors-adani-green-ongc-titan-muthoot-finance-11681086592598.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/10/600x338/Bull_vs_bear_iStock_1658452654594_1681086680543_1681086680543.JPG", "publishedAt": "2023-04-10T01:54:42Z", "content": "Tata Motors: Tata Motors Ltd. has recorded an 8% increase in its global wholesale vehicle sales business in the March quarter of FY2023, even as the car business, globally, is witnessing a lackadaisi… [+5381 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ratna Bhushan", "title": "Reliance forming a new camp for pushing Campa Cola - Economic Times", "description": "Reliance had held discussions to acquire a majority stake in Kali Aerated Water Works before it bought Campa in August last year. Bovonto is one of the largest cola brands in the southern markets, and competes aggressively with multinational brands Coke and P…", "url": "https://economictimes.indiatimes.com/industry/cons-products/food/reliance-forming-a-new-camp-for-pushing-campa/articleshow/99366615.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99366739,width-1070,height-580,imgsize-1911787,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T01:47:00Z", "content": "New Delhi: Reliance Consumer Products (RCPL) is in advanced talks with leading Chennai-based Bovonto soft drinks maker Kali Aerated Water Works for a manufacturing and distribution partnership to mak… [+4150 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | Nilesh Shah suggests Kotak Mahindra AMC may consider raising investments in these 3 sectors - Moneycontrol", "description": "The China+1 strategy is an emerging theme to watch closely. As global buyers diversify their supply base and companies migrate out of China, India's manufacturing base is expanding.", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-nilesh-shah-suggests-kotak-mahindra-amc-may-consider-raising-investments-in-these-3-sectors-10385791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Nilesh-Shah-1-770x433.jpg", "publishedAt": "2023-04-10T01:13:06Z", "content": "Nilesh Shah, Managing Director at Kotak Mahindra Asset Management Company, mentions in an interview with Moneycontrol that there are various global and domestic events that could be potentially harmf… [+5389 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Swaraj Dhanjal and Arijit Barman", "title": "Brookfield investing $1 billion in Avaada - Economic Times", "description": "Canadian investor Brookfield has agreed to invest $1bn in Avaada Ventures to support green ammonia plans and scale up renewable energy, in what would be the largest investment by a clean energy company in one go. Vineet Mittal, founder of the Avaada group, si…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/brookfield-investing-1-billion-in-avaada/articleshow/99366143.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99366157,width-1070,height-580,imgsize-178020,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T00:52:00Z", "content": "Canadian investor Brookfield has agreed to invest $1 billion in Avaada Ventures in what will be its largest clean energy bet in the country. A formal agreement was signed recently between Brookfield … [+3331 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Faizan Haidar", "title": "Mumbai Apple store zone a no-go area for 22 'competing brands' - Economic Times", "description": "Apple has made it clear that 22 brands, including Amazon, Google and Twitter, should not have any presence near its first owned store in India at the Reliance Jio World Drive mall in Mumbai, according to CRE Matrix. The company has stipulated this clause in t…", "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/mumbai-apple-store-zone-a-no-go-area-for-22-competing-brands/articleshow/99366043.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99366091,width-1070,height-580,imgsize-196166,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-10T00:42:00Z", "content": "Apple has stipulated that about two dozen technology, electronics and ecommerce brands shouldn't have any kind of presence near its soon-to-be-inaugurated store at Reliance Jio World Drive mall in Mu… [+2945 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Suraksha P", "title": "Jio Platforms bags Rs 350 crore deal to run National Informatics Centre’s cloud services - The Economic Times", "description": "Reliance Industries subsidiary to deploy tech at Delhi, Pune, Bhubaneswar centres.", "url": "https://economictimes.indiatimes.com/tech/technology/jio-platforms-bags-rs-350-crore-deal-to-run-national-informatics-centres-cloud-services/articleshow/99362491.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99362499,width-1070,height-580,imgsize-683298,overlay-ettech/photo.jpg", "publishedAt": "2023-04-10T00:31:00Z", "content": "Jio Platforms has bagged a Rs 350-crore contract to manage and enhance the cloud services of the governments National Informatics Centre (NIC), sources told ET.The Reliance Industries Group firm has … [+3228 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Gold and silver prices on April 10: Check rates in your city today - Hindustan Times", "description": "In India, the prices of gold are based on factors including global demand, currency, interest rates and government policies", "url": "https://www.hindustantimes.com/business/gold-and-silver-prices-on-april-10-check-rates-in-your-city-today-101681084875870.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/10/1600x900/_de24d738-f5d1-11e7-95e6-04e0a17510b6_1681086367206_1681086367206.jpg", "publishedAt": "2023-04-10T00:27:59Z", "content": "Gold prices in India witnessed a marginal decline of 10 with 10 grams of 22 carat gold costing 55,790 compared to 55,800 on Sunday, according to figures by Goodreturns. Prices of one gram, eight gram… [+1613 chars]"}, {"source": {"id": null, "name": "Idc.com"}, "author": null, "title": "PC Pain Persists in Q1 2023 Due to Excess Inventory and Poor Demand, According to IDC Tracker - IDC", "description": "IDC examines consumer markets by devices, applications, networks, and services to provide complete solutions for succeeding in these expanding markets.", "url": "https://www.idc.com/getdoc.jsp?containerId=prUS50565723", "urlToImage": "https://cdn.idc.com/RESOURCES/PROJECTS/research/images/dynamic-imgs/4_1806/mobility-06-7a5a5ca5f87b44b792cf4e444f709271.jpg", "publishedAt": "2023-04-09T23:59:53Z", "content": "NEEDHAM, Mass., April 9, 2023 Weak demand, excess inventory, and a worsening macroeconomic climate were all contributing factors for the precipitous drop in shipments of traditional PCs during the fi… [+5512 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rajiv Ghosh", "title": "BMW has pipped Merc worldwide, but why repeating that in India is proving tough - Economic Times", "description": "In 2022, Mercedes sold 40% more vehicles than BMW in India. Expanding much beyond metros, attracting buyers to luxury cars, offering innovative finance and leasing schemes, and focusing on EVs, BMW is doing everything to get its crown back from Mercedes in In…", "url": "https://economictimes.indiatimes.com/prime/transportation/bmw-has-pipped-merc-worldwide-but-why-repeating-that-in-india-is-proving-tough/primearticleshow/99363037.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99363032,width-1070,height-580,imgsize-843474/photo.jpg", "publishedAt": "2023-04-09T22:30:00Z", "content": "SynopsisIn 2022, Mercedes sold 40% more vehicles than BMW in India. Expanding much beyond metros, attracting buyers to luxury cars, offering innovative finance and leasing schemes, and focusing on EV… [+161 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sobia Khan", "title": "The buildup looks good for Indian realty - The Economic Times", "description": "Several significant deals were finalised in the office and residential segments recently, including the Embassy Group's successful ₹1,469 crore funding for office assets from Bain Capital and Embassy REIT's purchase of assets worth ₹408 crore from Embassy Spo…", "url": "https://economictimes.indiatimes.com/news/india/the-buildup-looks-good-for-indian-realty/articleshow/99363237.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99363252,width-1070,height-580,imgsize-22390,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-09T19:23:10Z", "content": "Institutional investments in India's real estate sector remained robust at $1.7 billion in the first quarter of 2023, driven by the office sector and global funds, signalling a positive outlook for t… [+2472 chars]"}, {"source": {"id": null, "name": "Swarajya"}, "author": "Swarajya Staff", "title": "Apple Picks Up 1.16 Lakh Sq Ft Space In Bengaluru For Use As 'Global Capability Centre' - Swarajya", "description": null, "url": "https://swarajyamag.com/tech/apple-picks-up-116-lakh-sq-ft-space-in-bengaluru-for-use-as-global-capability-centre", "urlToImage": "https://gumlet.assettype.com/swarajya%2F2023-04%2F077a0f52-fd54-4bd7-bba0-1e0a34340ab6%2FSwarajya_images__2_.png?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-04-09T17:39:43Z", "content": "Apple has rented multiple floors of a commercial building in Bengaluru, Karnataka, for approximately Rs 2.43 crore per month.\r\nPrestige Estates Projects has built the property on Cubbon Road that wil… [+1399 chars]"}, {"source": {"id": null, "name": "Kalinga TV"}, "author": "Pratyay", "title": "Honda recalls 2022 Edition of Honda CB300R in India, Know why - Kalinga TV", "description": "Honda Motorcycle and Scooter India (HMSI) has recalled one of its bike sold through BigWing dealerships in India. HMSI has recalled around 2000 units of 2022 Edition of the Honda CB300R in India. The company will fix the motorcycles without charging", "url": "https://kalingatv.com/automobile/honda-recalls-2022-edition-of-honda-cb300r-in-india-heres-why/", "urlToImage": "https://kalingatv.com/wp-content/uploads/2022/01/2022-Honda-CB300R-launch.jpg", "publishedAt": "2023-04-09T17:10:54Z", "content": "Honda Motorcycle and Scooter India (HMSI) has recalled one of its bike sold through BigWing dealerships in India. HMSI has recalled around 2000 units of 2022 Edition of the Honda CB300R in India. The… [+1352 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Multibagger stock secures Robotic Process Automation project from US-based consulting company, scrip up 142% from 52-week-low | Mint - Mint", "description": "Edvenswa Enterprises Limited announced that its wholly owned subsidiary Edvenswa Tech Inc. in the United States has been awarded a new project in the strategic Robotic Process Automation (RPA) domain with a Big Four Consulting Firm.", "url": "https://www.livemint.com/market/stock-market-news/multibagger-stock-secures-robotic-process-automation-project-from-us-based-consulting-company-scrip-up-142-from-52weeklow-11681059865219.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/2-0-406364519-BSE-3C-0_1680669241864_1681059944935_1681059944935.jpg", "publishedAt": "2023-04-09T17:09:39Z", "content": "Edvenswa Enterprises Limited announced that its wholly owned subsidiary Edvenswa Tech Inc. in the United States has been awarded a new project in the strategic Robotic Process Automation (RPA) domain… [+3791 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Adani Power begins electricity supply from Godda plant to Bangladesh - Indiatimes.com", "description": "India Business News: Adani Power on Sunday said that it has begun supplying electricity from its plant in Godda in Jharkhand to Bangladesh. The electricity supplied from G", "url": "https://timesofindia.indiatimes.com/business/india-business/adani-power-begins-electricity-supply-from-godda-plant-to-bangladesh/articleshow/99360851.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99360862,width-1070,height-580,imgsize-29734,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-04-09T14:44:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": null, "name": "Zoom"}, "author": "ET Now Digital", "title": "India's gold imports down 30 to USD 32 billion due to high customs duty, global uncertainties - Times Now", "description": "India's gold imports fell by 30% over last year to USD 31.8 billion during April-February 2023, while silver imports rose by 66% over the same period", "url": "https://www.timesnownews.com/business-economy/economy/indias-gold-imports-down-30-to-usd-32-billion-due-to-high-customs-duty-global-uncertainties-article-99359660", "urlToImage": "https://static.tnn.in/thumb/msid-99359660,updatedat-1681046397159,width-1280,height-720,resizemode-75/99359660.jpg", "publishedAt": "2023-04-09T13:24:00Z", "content": "Horoscope Today, April 10, 2023: Aries will be at Peace Today, Capricorn to have a Challenging Day"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "NTPC coal output rises 65 pc to 23 million tonnes - The Economic Times", "description": "NTPC management lauded the role of the power ministry, coal ministry and state governments, among others, for their support to its coal mining in enhancing production and dispatching 21.9 million tonnes of good quality coal to NTPC power plants with a phenome…", "url": "https://economictimes.indiatimes.com/industry/energy/power/ntpc-coal-output-rises-65-pc-to-23-million-tonnes/articleshow/99358468.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99358484,width-1070,height-580,imgsize-56500,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-09T11:45:00Z", "content": "State-owned power giant NTPC on Sunday said its captive coal mines have registered 65 per cent year-on-year production growth to over 23 million tonnes in FY23. NTPC Ltd has recorded a coal productio… [+1380 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Aditya Nadkarni", "title": "Maruti Fronx : Our observations after a day of driving - Team-BHP", "description": "Driving the Maruti Fronx 1.0L Turbo-Petrol MT: 1.0L turbo-petrol Boosterjet engine makes 99 BHP @ 5,500 rpm and 148 Nm @ 2,000-4,500 rpm:  The Fronx is powered by a 1.", "url": "https://www.team-bhp.com/news/maruti-fronx-our-observations-after-day-driving", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2023-maruti-fronx-02.jpg", "publishedAt": "2023-04-09T11:31:43Z", "content": "Despite the turbo, the engine doesn't struggle at low revs and the car can keep up with the traffic without the driver having to shift down too often. This trait combined with a small footprint and l… [+6944 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Indian Overseas Bank (IOB) revises savings account rates going to be in force from 10 April | Mint - Mint", "description": "Indian Overseas Bank (IOB) on Sunday announced that it has revised the rates for savings accounts.", "url": "https://www.livemint.com/industry/banking/indian-overseas-bank-iob-revises-savings-account-rates-going-to-be-in-force-from-10-april-11681034505347.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/2-0-344675824-IOB-0_1680599635171_1681034547909_1681034547909.jpg", "publishedAt": "2023-04-09T10:09:25Z", "content": "After the RBI Governor Shaktikanta Das announced on Thursday, 6 April, that the repo rate will not change and would remain at 6.5 percent, Indian Overseas Bank (IOB) on Sunday announced that it has r… [+1832 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Indian Oil, SAIL, REC, ONGC, NALCO among top 10 PSU stocks paying high dividends | Mint - Mint", "description": "In the brokerage's lists, the metal and mining sector tops with four stocks, while 2 stocks each were in the oil & gas, finance, and power sectors.", "url": "https://www.livemint.com/market/stock-market-news/indian-oil-sail-rec-ongc-nalco-among-top-10-psu-stocks-paying-high-dividends-11681031645042.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/4f95343e-f0e4-11ea-a5e6-63d38b01b1f9_1599499755828_1599499861249_1681032198648_1681032198648.jpg", "publishedAt": "2023-04-09T09:24:06Z", "content": "The dividend yield is among the key factors to consider when investing in dividend-paying stocks. Reliance Broking explains that dividend yields are an indicator of the return that the investors are … [+1731 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Debangana Ghosh", "title": "Freshers cry foul as LTIMindtree delays joining, stokes fears of elimination - Moneycontrol", "description": "According to sources, about 600-700 freshers are impacted. In the face of global headwinds, other IT firms like Wipro and Tech Mahindra have also delayed on-boarding earlier", "url": "https://www.moneycontrol.com/news/business/freshers-cry-foul-as-ltimindtree-delays-onboarding-tries-to-cull-candidates-10384171.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/03/LTIMindtree-Building-770x433.png", "publishedAt": "2023-04-09T08:30:12Z", "content": "Campus hires of LTIMindtree who received offer letters in January 2022 are still waiting to be on-boarded, and the IT services firm has asked them to go through a new training programme to prove thei… [+3664 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Anuj Mishra", "title": "Your weekly dose of bike updates: 2023 Yamaha R15, Updated KTM 390 Adventure, and more! - BikeWale", "description": "While Yamaha’s new 2023 models grabbed a lot of attention on the internet, the hottest topic of discussion was the images of Harley-Davidson’s smallest India-bound motorcycle.", "url": "https://www.bikewale.com/news/your-weekly-dose-of-bike-updates-2023-yamaha-r15-updated-ktm-390-adventure-and-more/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/145831/ktm-390-adventure-collage0.jpeg?isig=0&q=75&art=9", "publishedAt": "2023-04-09T08:12:41Z", "content": "Multiple new two-wheeler launches along with some interesting image leaks made the last week quite eventful. While Yamahas new 2023 models grabbed a lot of attention on the internet, the hottest topi… [+2543 chars]"}, {"source": {"id": null, "name": "Zigwheels.com"}, "author": null, "title": "Toyota Innova HyCross Petrol CVT: What We Learnt Over 1,000km - ZigWheels", "description": "The base Innova Hycross is low on novelty, but knocks it out of the park when it comes to functionality and family car fundamentals!", "url": "https://www.zigwheels.com/news-features/general-news/toyota-innova-hycross-petrol-cvt-what-we-learnt-over-1000km/49377/", "urlToImage": "https://media.zigcdn.com/media/content/2023/Apr/cover_64326af4d1756.jpg", "publishedAt": "2023-04-09T07:36:43Z", "content": "Get latest updates on the automobile community\r\nWhen it comes to understanding the core values of a car, there is no replacement for time in the seat. And when your first experience with a car direct… [+4554 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "FPIs buy ₹3,747 cr equities in first week of FY24, last quarter results of FY23 to influence flows ahead | Mint - Mint", "description": "As per NSDL data, FPIs bought  ₹3,747 crore in the equities so far in April, while they were net sellers in other market-related instruments..FPIs sold  ₹1,667 crore in debt, meanwhile, outflows of  ₹400 crore and  ₹8 crore was recorded in debt-VRR and hybrid…", "url": "https://www.livemint.com/market/stock-market-news/fpis-buy-rs-3-747-cr-equities-in-first-week-of-fy24-last-quarter-results-of-fy23-to-influence-flows-ahead-11681025314598.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/FPI_1667932072777_1681025570401_1681025570401.jpg", "publishedAt": "2023-04-09T07:34:22Z", "content": "The start of FY24 seems chirpy for Indian equities with foreign portfolio investors (FPIs) becoming net buyers. FPIs have pumped in 3,747 crore in equity shares between April 3rd to April 6th. A host… [+2936 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Renu Baliyan", "title": "6 Good Quality Mid Cap, Large Cap Stocks Trading Near Their 52-Week Low Prices - Goodreturns", "description": "6 good quality large cap stocks are currently trading near their 52-week low prices. These stocks are Cipla, Infosys, Kotak Mahindra Bank, Wipro, Asian Paints, and Tata Power Company Ltd.", "url": "https://www.goodreturns.in/personal-finance/investment/6-good-quality-mid-cap-large-cap-stocks-trading-near-their-52-week-low-prices-1280472.html", "urlToImage": "https://www.goodreturns.in/img/1200x60x675/2017/06/financialhighlights-24-1498265965.jpg", "publishedAt": "2023-04-09T07:17:18Z", "content": "6 good quality large cap stocks are currently trading near their 52-week low prices. These stocks are Cipla, Infosys, Kotak Mahindra Bank, Wipro, Asian Paints, and Tata Power Company Ltd. Check detai… [+2678 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Cementing portfolio; 5 mid and small cap cement stocks which can deliver over 36 % returns, say analysts - Economic Times", "description": "While the focus of news stays ACC and Ambuja, it would be better to look at many other players, some of them in mid and small cap space.  Some of them have improved their performance in terms of operational efficiency. The list is based on upside estimated by…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/cementing-portfolio-5-mid-and-small-cap-cement-stocks-which-can-deliver-over-36-returns-say-analysts/articleshow/99354059.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99354219,width-1070,height-580/photo.jpg", "publishedAt": "2023-04-09T06:57:00Z", "content": "SynopsisWhile the focus of news stays ACC and Ambuja, it would be better to look at many other players, some of them in mid and small cap space. Some of them have improved their performance in terms … [+144 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "Amit Sharma", "title": "Hyundai’s Tata Punch-Rivalling SUV Launch Soon – New Details - India Car News", "description": "Hyundai has recently launched the new generation Verna mid-sized sedan in the country. The new model brings many first features and engine-gearbox combination, which will also be offered on future Hyundai cars. Hyundai will also launch a new sub-compact SUV, …", "url": "https://www.indiacarnews.com/news/hyundais-tata-punch-rivalling-suv-launch-soon-new-details-57428/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2022/12/Hyundai-Ai3-SUV-Spied-1000x600.jpg", "publishedAt": "2023-04-09T06:38:42Z", "content": "Hyundai has recently launched the new generation Verna mid-sized sedan in the country. The new model brings many first features and engine-gearbox combination, which will also be offered on future Hy… [+2456 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Maruti eyes doubling SUV sales this fiscal & take leadership position with 25 percent market share - Moneycontrol", "description": "In an interaction with PTI, Maruti Suzuki India Senior Executive Officer (Sales &amp; Marketing) Shashank Srivastava said the doubling of the market share in the SUV segment would also help the company in its bid to again surpass the 50 per cent market share …", "url": "https://www.moneycontrol.com/news/business/companies/maruti-eyes-doubling-suv-sales-this-fiscal-take-leadership-position-with-25-percent-market-share-10383481.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/9-maruti-suzuki-evX-SUV-auto-expo-2023-770x433.jpg", "publishedAt": "2023-04-09T05:55:21Z", "content": "The countrys largest car maker Maruti Suzuki India aims to more than double its SUV sales this year and take the leadership position in the fast-growing segment with a market share of over 25 per cen… [+4015 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "CEO Scam: Fraudsters now preying on start up employees for money | Mint - Mint", "description": "In a recent case of CEO fraud scam, Meesho's employee, Shikhar Saxena shared an instance where he received a scam message from a person posing as Meesho CEO, Vidit Aatrey, to make payment", "url": "https://www.livemint.com/news/india/ceo-scam-fraudsters-now-preying-on-start-up-employees-for-money-meesho-11681015893747.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/09/600x338/Meesho_CEO_fraud_1681018243916_1681018244114_1681018244114.jpg", "publishedAt": "2023-04-09T05:38:58Z", "content": "From sim cards to customer care servicing, there would hardly be any option left unexplored by scammers to trap people for money. However, with the evolution of digital platforms and growing accessib… [+2435 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Mcap of eight of top 10 valued firms climbs Rs 82,169 crore last week; HDFC twins sparkle - Moneycontrol", "description": "Of the top 10 valued firms, eight including Reliance Industries, Tata Consultancy Services (TCS), HDFC Bank, Hindustan Unilever Ltd, HDFC and ITC witnessed gains in their market valuation.", "url": "https://www.moneycontrol.com/news/business/stocks/mcap-of-eight-of-top-10-valued-firms-climbs-rs-82169-crore-last-week-hdfc-twins-sparkle-10383351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/bse_nse_stockmarket_nifty_sensex1-770x433.jpg", "publishedAt": "2023-04-09T04:59:12Z", "content": "Eight of the top 10 valued firms added Rs 82,169.3 crore in market valuation last week, with HDFC twins emerging as the biggest winners amid an overall positive trend in equities.\r\nLast week, equity … [+1585 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "ONGC Hikes Stake in Mangalore SEZ to 49% for Rs 40.3 Crore Consideration - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/ongc-hikes-stake-in-mangalore-sez-to-49-for-rs-403-crore-consideration-3591130", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/91d857f8bfcaee41b90d4c1d0259c39d_w_800_h_450.jpg", "publishedAt": "2023-04-09T04:19:22Z", "content": "By Malvika Gurung\r\nInvesting.com -- Indias largest \r\ncrude oil\r\n and \r\nnatural gas\r\n company ONGC (NS:\r\nONGC\r\n) has made a series of approvals at its latest board meeting held on Saturday, April 4, i… [+1018 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vidya Sreedhar", "title": "Q4 earnings, inflation data, Fed minutes among factors to drive D-Street this week - The Economic Times", "description": "While the overall trend for the market remains positive with a weak dollar and falling US bond yields, analysts do not see significant upside for the index in the coming week, as crucial events are lined up.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/q4-earnings-inflation-data-fed-minutes-among-factors-to-drive-d-street-this-week/articleshow/99351456.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99351459,width-1070,height-580,imgsize-146227,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-09T03:33:00Z", "content": "The last week was in favour of the bulls on Dalal Street as benchmark indices managed to cross crucial hurdles following the Reserve Bank of Indias decision to pause interest rate hikes. Nifty50 sett… [+4582 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "Indian Clicks", "title": "Indian Alphonso Mangoes Arrives In the US - Greatandhra", "description": "With the given epithet ‘The king of Mangoes,’ Alphonso has emerged from history only to get ‘cut and served’ to people awaiting to indulge in sense-delighting deliciousness.", "url": "https://www.greatandhra.com/articles/news/indian-alphonso-mangoes-arrives-in-the-us-128489", "urlToImage": "https://www.greatandhra.com/newphotos10/IndianClicks_Quicklly_Mangoes_GA_650x400_02032023_1_11680966138.jpg", "publishedAt": "2023-04-08T15:02:18Z", "content": "With the given epithet ‘The king of Mangoes,’ Alphonso has emerged from history only to get ‘cut and served’ to people awaiting to indulge in sense-delighting deliciousness.\r\nWhile there are numerous… [+1566 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "2 upcoming SME IPO in April 2023 | Mint - Mint", "description": "In the financial year 2022–23, 125 India's small and medium enterprises (SMEs) raised  ₹2,229 crore through an initial public offering (IPO), compared to 70 IPOs in 2021–22, which raised  ₹965 crore, representing a YoY jump of 130% in terms of fundraising.", "url": "https://www.livemint.com/market/ipo/2-upcoming-sme-ipo-in-april-2023-11680959888801.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/08/600x338/aether_industries_ipo_1654140329895_1680959925220_1680959925220.jpg", "publishedAt": "2023-04-08T13:21:49Z", "content": "In the financial year 202223, 125 India's small and medium enterprises (SMEs) raised 2,229 crore through an initial public offering (IPO), compared to 70 IPOs in 202122, which raised 965 crore, repre… [+3799 chars]"}]}