{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Many Indigo Flights Delayed After Mass Sick Leave By Crew: Report - NDTV", "description": "IndiGo airline's operations were affected across the country today with several of its flights facing delays due to the non-availability of crew members.", "url": "https://www.ndtv.com/india-news/many-indigo-flights-across-country-delayed-aviation-regulator-seeks-explanation-news-agency-ani-3123486", "urlToImage": "https://c.ndtvimg.com/2022-03/99rtpnd8_indigo_625x300_31_March_22.jpg", "publishedAt": "2022-07-03T12:30:00Z", "content": "The aviation regulator has sought an explanation from the airline over the massive delays.\r\nNew Delhi: IndiGo airline's operations were affected across the country with several of its flights facing … [+1904 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter CEO Parag Agrawal, Hands Full At Coffee Counter, Serves Staff - NDTV", "description": "Twitter's chief executive officer Parag Agrawal attended a number of business events in London last week. During that time, despite all the activity, Mr Agrawal even made time to serve coffee to the staff.", "url": "https://www.ndtv.com/india-news/twitter-ceo-parag-agrawal-serves-coffee-at-the-social-media-giant-s-london-office-3123627", "urlToImage": "https://c.ndtvimg.com/2022-07/mv2i05o_parag-agrawal-coffee_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T12:21:43Z", "content": "Parag Agrawal was seen taking coffee orders at Twitter's London office.\r\nTwitter's chief executive officer Parag Agrawal attended a number of business events in London last week. During that time, Mr… [+2043 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Cartoq Hindi", "title": "40 year-old Hindustan Ambassador gets resto-modded with modifications worth Rs. 8 lakh [Video] - CarToq.com", "description": "Hindustan Ambassador is a car that is close to the heart of many car lovers. It was the first car to be ever manufactured in India. It soon became a status symbol among rich families and also carried politicians and senior government officials for years. Amba…", "url": "https://www.cartoq.com/40-year-old-hindustan-ambassador-gets-resto-modded-with-modifications-worth-rs-8-lakh-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/hindustan-ambassador-restored.jpg", "publishedAt": "2022-07-03T12:09:47Z", "content": "Hindustan Ambassador is a car that is close to the heart of many car lovers. It was the first car to be ever manufactured in India. It soon became a status symbol among rich families and also carried… [+2927 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "India's only Tata Punch Dark Edition: This is IT [Video] - CarToq.com", "description": "Tata Motors is one of the most popular car maker in the country. They have a variety of products in their line up and Tata Punch is the entry level SUV sold by the manufacturer in India. Tata Punch was launched in the market last year and it quickly became po…", "url": "https://www.cartoq.com/indias-only-tata-punch-dark-edition/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/tata-punch-dark-edition-featured.jpg", "publishedAt": "2022-07-03T10:12:08Z", "content": "Tata Motors is one of the most popular car maker in the country. They have a variety of products in their line up and Tata Punch is the entry level SUV sold by the manufacturer in India. Tata Punch w… [+2773 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "HDFC-HDFC Bank merger gets a thumbs up from stock exchanges | Mint - Mint", "description": "Earlier on April 4, HDFC Bank announced that parent HDFC will merge with the bank to enable seamless delivery of home loans and leverage on the large base of over 68 million customers of HDFC Bank and inter alia improve the pace of credit growth in the econom…", "url": "https://www.livemint.com/companies/news/hdfchdfc-bank-merger-gets-a-thumbs-up-from-stock-exchanges-11656840849272.html", "urlToImage": "https://images.livemint.com/img/2022/07/03/600x338/HDFC_1656618642184_1656840939063.jpg", "publishedAt": "2022-07-03T09:36:43Z", "content": "HDFC Bank and parent HDFC inched closer to the merger process as stock exchanges give thumbs up to their amalgamation scheme. The companies received 'observation letters' from stock exchanges, BSE, a… [+2575 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "One can invest 50% now and remaining 50% if Nifty breaks below 15,200 in July: Rahul Sharma - Economic Times", "description": "Investors are advised to stay put and in fact, use volatility to accumulate quality businesses at good prices in this month. One can invest 50% at current levels and the remaining 50% can be invested if the Nifty corrects down to 15,200 in July. A breach of 1…", "url": "https://economictimes.indiatimes.com/markets/expert-view/one-can-invest-50-now-and-remaining-50-if-nifty-breaks-below-15200-in-july-rahul-sharma/articleshow/92632808.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92632839,width-1070,height-580,imgsize-30390,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-03T09:36:00Z", "content": "Breach of 15,800/15,930 resistance area can push the Nifty upwards of 16,200-16,500 zone. On the flip side support levels for Nifty are seen at 15,500 &amp; 15,200, says Rahul Sharma, Director &amp; … [+5527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "To Industrialist Harsh Goenka Post On Parents, Anand Mahindra's Reply - NDTV", "description": "Industrialist Anand Mahindra responds to a clip shared by Chairman of RPG Group Harsh Goenka on Twitter", "url": "https://www.ndtv.com/india-news/harsh-goenka-shares-clip-on-parent-kid-relationship-here-s-what-anand-mahindra-said-3122672", "urlToImage": "https://c.ndtvimg.com/2022-02/hfno0a4_anand-mahindra_625x300_09_February_22.jpg", "publishedAt": "2022-07-03T09:17:05Z", "content": "Over 2,000 people had responded to Anand Mahindra's response. (File photo)\r\nA child's relationship with their parent is the most significant one in their life. A strong parent-child bond lays the fou… [+4409 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Cartoq Hindi", "title": "Custom built Royal Enfield Classic 350 from Neev Motorcycles is called 'Divine' - CarToq.com", "description": "Royal Enfield motorcycles are quite popular among motorists in India and around the world. These retro looking modern motorcycles have a large fan base and over the years, Royal Enfield has improved the motorcycle in terms of build quality, refinement and eve…", "url": "https://www.cartoq.com/custom-built-royal-enfield-classic-350-from-neev-motorcycles/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/07/royal-enfield-divine-featured.jpg", "publishedAt": "2022-07-03T08:58:19Z", "content": "Royal Enfield motorcycles are quite popular among motorists in India and around the world. These retro looking modern motorcycles have a large fan base and over the years, Royal Enfield has improved … [+3100 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy next week - Moneycontrol", "description": "Participants should focus on identifying stock-specific opportunities but also keep a check on leveraged trades, Ajit Mishra of Religare Broking has said", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-10-key-factors-that-will-keep-traders-busy-next-week-37-8772091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/08/Sensex_Nifty_BSE_Stock-Market_traders-770x433.jpg", "publishedAt": "2022-07-03T06:39:09Z", "content": "The market managed to eke out moderate gains amid volatility and rangebound trade in the week ended July 1, continuing the uptrend for yet another week. Tepid global cues and caution ahead of June qu… [+7879 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Tata Nexon compact SUV XZ+ (HS) variant in a detailed walkaround video - CarToq.com", "description": "Tata Nexon is one of the popular sub-4 meter SUV in the segment. Tata updated the Nexon SUV couple of years ago and it now looks a lot more premium than before. In order to retain customer interest, Tata has been updating the Nexon with new features and colou…", "url": "https://www.cartoq.com/tata-nexon-compact-suv-xz-hs-variant-detailed-walkaround/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/nexon-hs-featured.jpg", "publishedAt": "2022-07-03T06:26:23Z", "content": "Tata Nexon is one of the popular sub-4 meter SUV in the segment. Tata updated the Nexon SUV couple of years ago and it now looks a lot more premium than before. In order to retain customer interest, … [+2913 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Over 22,000 techies lose jobs in US, more than 12,000 in Indian startups - Economic Times", "description": "Startups now say it is much more difficult to raise new funding in this gloomy environment.", "url": "https://economictimes.indiatimes.com/tech/startups/over-22000-techies-lose-jobs-in-us-more-than-12000-in-indian-startups/articleshow/92629826.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92629823,width-1070,height-580,imgsize-1473146,overlay-ettech/photo.jpg", "publishedAt": "2022-07-03T05:51:00Z", "content": "As the tech and startup sector gets hammered by economic meltdown, more that 22,000 workers in the sector have lost jobs in 2022, along with more than 12,000 in the Indian startup ecosystem.\r\nStartup… [+1713 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Windfall tax to recoup most of Rs 1 lakh cr revenue lost in excise cuts - Economic Times", "description": "For the remaining nine months of the current fiscal, the levy would get the government almost Rs 52,000 crore if the tax remains in place till March 31, 2023.On top of this, the new tax brought in on the export of petrol, diesel and ATF would bring in additio…", "url": "https://economictimes.indiatimes.com/news/economy/finance/windfall-tax-to-recoup-most-of-rs-1-lakh-cr-revenue-lost-in-excise-cuts/articleshow/92629748.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92629791,width-1070,height-580,imgsize-38874,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-03T05:44:00Z", "content": "The windfall tax on oil produced within India and fuel exported overseas will make up for more than three-fourths of the revenue that the government lost when it cut excise duty on petrol and diesel … [+5810 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "M-cap of 3 of top-10 valued firms eroded by ₹73630 cr; RIL biggest loser - Mint", "description": "The market valuation of Reliance Industries Ltd (RIL) declined by  ₹62,100.95 crore to reach  ₹16,29,684.50 crore.The market capitalisation (m-cap) of State Bank of India (SBI) climbed  ₹11,200.38 crore to  ₹4,16,690.11 crore", "url": "https://www.livemint.com/news/india/mcap-of-3-of-top-10-valued-firms-eroded-by-rs-73-630-cr-ril-biggest-loser-11656825997747.html", "urlToImage": "https://images.livemint.com/img/2022/07/03/600x338/MARKETS-INDIA-STOCKS-0_1656826190587_1656826209127.JPG", "publishedAt": "2022-07-03T05:31:54Z", "content": "The combined market valuation of three of the 10 most valued domestic firms eroded by 73,630.56 crore last week, with Reliance Industries Limited taking the biggest hit. While HUL and ICICI Bank were… [+1533 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Mahindra compares Scorpio N features to Fortuner features - CarToq.com", "description": "Mahindra is promoting the all-new Scorpio-N as the ‘big daddy’ among all the SUVs. The Scorpio-N has all the similarly-priced compact and midsize SUVs in its crosshairs, but with the ‘big daddy’ claim, Mahindra is also eyeing pricier midsize and full-size SUV…", "url": "https://www.cartoq.com/mahindra-compares-scorpio-n-features-to-fortuner-features/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/new-mahindra-scorpio-vs-toyota-fortuner.jpg", "publishedAt": "2022-07-03T05:06:26Z", "content": "Mahindra is promoting the all-new Scorpio-N as the big daddy among all the SUVs. The Scorpio-N has all the similarly-priced compact and midsize SUVs in its crosshairs, but with the big daddy claim, M… [+3047 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online and Agencies", "title": "Now, Ola Electric’s head of charging network quits; 32nd resignation in last two years - Economic Times", "description": "The high-profile exits come at a time when Ola is reportedly planning its IPO this year at a lower valuation than planned earlier as several startups' IPOs have proved to be a nightmare for the investors. Ride-hailing platform Ola recently shut down its used …", "url": "https://economictimes.indiatimes.com/industry/renewables/now-ola-electrics-head-of-charging-network-quits-32nd-resignation-in-last-two-years/articleshow/92628834.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92628847,width-1070,height-580,imgsize-359506,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-03T04:41:00Z", "content": "Another top executive at Ola Electric has resigned from his position - the 32nd resignation from the firm in the last two years. According to ETAuto, Yashwant Kumar, Senior Director and Business Head… [+1635 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "ITC among Siddhartha Khemka’s top picks for next 12-18 months - Economic Times", "description": "“The best way to participate in the market is to accumulate at every fall and on larger falls and specifically days when markets are down by 3-4%. We saw that in the previous week where markets were down 5.6% in one week and the next week it recovered almost …", "url": "https://economictimes.indiatimes.com/markets/expert-view/itc-among-siddhartha-khemkas-top-picks-for-next-12-18-months/articleshow/92622210.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92622220,width-1070,height-580,imgsize-22936,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-03T04:30:00Z", "content": "There is still risk to earnings not only from the policies, but also from the impact of inflation as well as the demand, which can remain slower or lower compared to expectations. Monsoon was one big… [+7116 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Rohit", "title": "Toyota To Offer The Urban Cruiser Hyryder In 11 Colour Options - CarDekho", "description": "It will offer the maximum paint options for a Toyota model in India      Toyota to offer the SUV in seven monotone colours and four dual-tone options.    Monotone shades are white, grey, brown, red, blue, silver and black.    Dual-tone options will be red, wh…", "url": "https://www.cardekho.com/india-car-news/toyota-to-offer-the-urban-cruiser-hyryder-in-11-colour-options-29320.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29319/1656823778181/GeneralNews.jpg", "publishedAt": "2022-07-03T04:23:00Z", "content": "It will offer the maximum paint options for a Toyota model in India\r\n<ul><li>Toyota to offer the SUV in seven monotone colours and four dual-tone options.\r\n</li><li>Monotone shades are white, grey, b… [+1923 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Meta Ending Crypto Project Novi After Mark Zuckerberg Unveiled Metaverse Digital Wallet – Featured Bitcoin News - Bitcoin News", "description": "Meta, formerly Facebook, has announced the ending of its crypto project Novi. Users are advised to withdraw funds as soon as possible.", "url": "https://news.bitcoin.com/meta-ending-crypto-project-novi-after-mark-zuckerberg-unveiled-metaverse-digital-wallet/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/07/meta-ending-novi.jpg", "publishedAt": "2022-07-03T03:01:53Z", "content": "Meta Platforms, formerly Facebook, has announced the end of its crypto project Novi. Users are advised to withdraw funds as soon as possible. The announcement followed the introduction of a digital w… [+3012 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Transport Minister Nitin Gadkari not happy with safety “double standards” of major automakers in India - CarToq.com", "description": "Amidst the Union Government’s call for safer cars and making 6 airbags and Bharat NCAP safety rating tests mandatory for new cars, a few manufacturers voiced their opinions. Nitin Gadkari, Minister of Road Transport and Highways, called out the double standar…", "url": "https://www.cartoq.com/transport-minister-nitin-gadkari-not-happy-with-safety-double-standards-of-major-automakers-in-india/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/08/Nitin-Gadkari-ethanol-featured.jpg", "publishedAt": "2022-07-03T02:16:12Z", "content": "Amidst the Union Government’s call for safer cars and making 6 airbags and Bharat NCAP safety rating tests mandatory for new cars, a few manufacturers voiced their opinions. Nitin Gadkari, Minister o… [+2655 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | Sonam Srivastava of Wright Research sees slowdown in IT, infra, but bets on auto, FMCG - Moneycontrol", "description": "The mood in the market has improved in the last couple of weeks, but this could be a short-term rebound. We did see a slight easing in European inflation. While the recession in the west is more of a reality, many expect the pain to be over sooner. Neverthele…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-sonam-srivastava-of-wright-research-sees-slowdown-in-it-infra-but-bets-on-auto-fmcg-8771691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/Sonam_Srivastava1280-770x433.jpg", "publishedAt": "2022-07-03T02:15:36Z", "content": "Sonam Srivastava, founder of Wright Research, expects some early signs of a slowdown in the quarterly earnings from next week with margin pressure intensifying in IT and infrastructure. She, however,… [+5208 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Nikhil Puthran", "title": "2022 Maruti Suzuki Brezza launched – Why should you buy? - CarWale", "description": "Read below to learn more about why you should buy the new Maruti Suzuki Brezza", "url": "https://www.carwale.com/news/2022-maruti-suzuki-brezza-launched-why-should-you-buy/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/125455/maruti-suzuki-brezza-left-side-view0.jpeg?isig=0&art=1&q=75", "publishedAt": "2022-07-03T02:00:07Z", "content": "Maruti Suzuki has launched the 2022 Brezza in four variant options LXi, VXi, ZXi, and ZXi+. The updated compact SUV is available in six monotone and three dual-tone colour options. The monotone colou… [+2175 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Q1 results to US job data: Top 5 triggers that may dictate market next week | Mint - Mint", "description": "Stock market next week: Q1FY23 earnings will start trickling next week, and everyone will be watching for any downgrades or negative commentary", "url": "https://www.livemint.com/market/stock-market-news/q1-results-to-us-job-inflation-top-5-triggers-that-may-dictate-stock-market-next-week-11656750688214.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/PTI14-11-2020_000103B_1605496217265_1605496235680_1656750813328.jpg", "publishedAt": "2022-07-03T01:55:28Z", "content": "Stock market next week: In the week gone by, the Nifty consolidated within a narrow range till the expiry day. However, post-expiry a sharp cut in the heavyweight Reliance Industries resulted in a di… [+3541 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "IT audit firm linked to ex-Mumbai CP didn't red-flag NSE server breach: CBI - The Indian Express", "description": "The CBI’s investigation over the course of the last four years long had led to the arrest of former NSE managing director Chitra Ramkrishna and its former group operating officer Anand Subramanian.", "url": "https://indianexpress.com/article/cities/mumbai/it-audit-firm-linked-to-ex-mumbai-cp-didnt-red-flag-nse-server-breach-cbi-8005825/", "urlToImage": "https://images.indianexpress.com/2022/07/CP-3col.jpg", "publishedAt": "2022-07-03T01:28:32Z", "content": "The CBI, which registered a case in 2018 in the NSE co-location scam, is probing how an audit company incorporated in 2001 by Sanjay Pandey, who last week retired as Commissioner of Police, Mumbai, d… [+4094 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "These 49 small-cap stocks clock 10-57% gain as market continues to consolidate - Moneycontrol", "description": "In the month of June, Sensex lost 4.5 percent and Nifty50 shed 4.8 percent. While FIIs sold equities worth Rs 58,112.37 crore, DIIs bought equities worth Rs 46,599.23 crore during the month", "url": "https://www.moneycontrol.com/news/business/markets/these-49-small-cap-stocks-rise-10-57-as-market-stays-into-consolidation-mode-8769571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/stocks_market-stock_stock-770x433.jpg", "publishedAt": "2022-07-03T01:14:00Z", "content": "The Indian benchmark indices made marginal gains in a highly volatile week ended on July 1. Investors, however, remained a worried lot with the rupee plunging to historic lows, foreign investors cont… [+4623 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "US jobs report shows resilient labour demand, policymakers brainstorm in Asia, Europe - Moneycontrol", "description": "The European Central Bank will release minutes of its June deliberations, Brazil’s double-digit inflation may have ticked up again, and Canada also publishes jobs data. Monetary officials in Australia, Israel, Peru and Poland are among those forecast to keep …", "url": "https://www.moneycontrol.com/news/business/economy/us-jobs-report-shows-resilient-labour-demand-policymakers-brainstorm-in-asia-europe-8771731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/388867874-1-653x435.jpg", "publishedAt": "2022-07-03T01:09:08Z", "content": "Employers in the US probably added workers at a more moderate yet still healthy pace last month as the jobless rate held near its lowest level in decades, suggesting resilient labour demand even as t… [+5892 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Chloe Cornish", "title": "Special treatment for Tesla not in India's 'interest', Ola says - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/aaf5bb36-6e74-49e8-bba4-4d164e8353c8", "urlToImage": null, "publishedAt": "2022-07-03T00:16:14Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"source": {"id": null, "name": "Greatandhra.com"}, "author": "IANS", "title": "After terrible first half, 2022 may bring more bad news for US markets.. - Greatandhra", "description": "US markets are beginning to fear that they are not even halfway through the bad news the year 2022 has in store, media reports said.", "url": "https://www.greatandhra.com/articles/special-articles/after-terrible-first-half-2022-may-bring-more-bad-news-for-us-markets-122113", "urlToImage": "https://www.greatandhra.com/newphotos10/usmarkets1656795646.jpg", "publishedAt": "2022-07-02T21:00:46Z", "content": "US markets are beginning to fear that they are not even halfway through the bad news the year 2022 has in store, media reports said.\r\nThe first six months were full of surprises: Inflation, the bigge… [+1426 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "This large cap pharma stock corrected 17% from 52-week-low ahead of bonus issue | Mint - Mint", "description": "A large cap firm with a market valuation of  ₹49,361 crore that is involved in the pharmaceutical industry is Torrent Pharmaceuticals Ltd.", "url": "https://www.livemint.com/market/stock-market-news/this-large-cap-pharma-stock-corrected-17-from-52-week-low-ahead-of-bonus-issue-11656781294758.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/2021-06-29T041241Z_1_LYNXNPEH5S05Q_RTROPTP_3_MARKETS-INDIA-STOCKS_1628855080542_1656781320096.JPG", "publishedAt": "2022-07-02T17:05:15Z", "content": "A large cap firm with a market valuation of 49,361 crore that is involved in the pharmaceutical industry is Torrent Pharmaceuticals Ltd. One of the top pharmaceutical firms in the nation is Torrent P… [+2379 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Cancelled flights, higher fares: Travelling for July 4th turns into a herculean task | Mint - Mint", "description": "Nearly 8,000 flights within, into or out of the US were delayed on Friday and 587 were canceled. Another 2,100 were delayed and 523 canceled, as of around 11:20 a.m. in New York on Saturday", "url": "https://www.livemint.com/news/world/cancelled-flights-higher-fares-travelling-for-july-4th-turns-into-a-herculean-task-11656779611459.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/US-AVIATION-TRAVEL-CONSUMER-LABOR-4_1656779840688_1656779882526.jpg", "publishedAt": "2022-07-02T16:40:39Z", "content": "People across the US are expected to fly in the highest numbers since the start of the Covid-19 pandemic for the July 4 holiday weekend, stressing a beleaguered transportation system experiencing ten… [+6517 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Hindustan Zinc mined metal production rises 14% in April-June - Moneycontrol", "description": "The rise in mined metal production was due to higher ore production largely at Sindesar Khurd, Rampura Agucha and Kayad mines supported by better mill recovery.", "url": "https://www.moneycontrol.com/news/business/hindustan-zinc-mined-metal-production-rises-14-in-april-june-8771661.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/HINDUSTAN-ZINC-770x433.jpg", "publishedAt": "2022-07-02T16:40:36Z", "content": "Vedanta group firm Hindustan Zinc on Saturday reported a 14 per cent increase in mined metal production to 2,52,000 tonnes for the first quarter of 2022-23.\r\nThe rise in mined metal production was du… [+906 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Avenue Supermarts' Q1FY23 revenue nearly doubles to Rs 9,806 crore - Moneycontrol", "description": "Avenue Supermarts informed the stock exchanges that the total number of D-Mart stores stood at 294 at the end of first quarter of the current fiscal.", "url": "https://www.moneycontrol.com/news/business/earnings/avenue-supermarts-q1fy23-revenue-nearly-doubles-to-rs-9806-crore-8771541.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/shutterstock_1350270773-719x435.jpg", "publishedAt": "2022-07-02T15:38:32Z", "content": "D-Mart-owner and operator Avenue Supermarts on July 2 reported a standalone revenue of Rs 9,806 crore in the first quarter of the financial year 2022-23 (Q1FY23), which is almost double as compared t… [+1185 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "EatFit announces collaboration with with Hrithik Roshan-owned wellness and fitness service HRX | Mint - Mint", "description": "The collaboration will introduce its premium functional food menu, which is a combination of its food philosophy and HRX's function utility that will provide healthy food options, to users", "url": "https://www.livemint.com/companies/news/eatfit-announces-collaboration-with-with-hrithik-roshan-owned-wellness-and-fitness-service-hrx-11656775517135.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/7aace9b2-f125-11ec-91b5-54ec88d6cb87_1656775619532_1656775654546.png", "publishedAt": "2022-07-02T15:29:16Z", "content": "EatFit, a health food app has announced its collaboration with Hrithik Roshan-owned wellness and fitness service HRX, to introduce its premium functional food menu to users. The menu is a combination… [+1498 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Jayprashanth Mohanram", "title": "Why are EVs catching fire in India: Probe panel blames 'lack of basic safety systems' - CarToq.com", "description": "Over the past few months, there have been multiple instances of electric vehicles catching fire. From a Tata Nexon Electric SUV that went up in flames last week to Okinawa and Ola electric scooters catching fire, electric vehicle fires have now become a weekl…", "url": "https://www.cartoq.com/why-are-electric-vehicles-catching-fire-in-india-probe-panel-blames-lack-of-basic-safety-systems/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/03/ola-scooter-fire-pune-india.jpg", "publishedAt": "2022-07-02T13:57:55Z", "content": "Over the past few months, there have been multiple instances of electric vehicles catching fire. From aTata Nexon Electric SUV that went up in flames last week to Okinawa and Ola electric scooters ca… [+3347 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Two-wheeler sales witness moderate growth in June - Moneycontrol", "description": "Industry players anticipate sustained growth over the next few quarters due to favourable monsoon and improvement in their supply chain.", "url": "https://www.moneycontrol.com/news/automobile/two-wheeler-sales-witness-moderate-growth-in-june-8771231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/TVS-Zest-Resized-770x433.jpg", "publishedAt": "2022-07-02T13:52:08Z", "content": "Even as the chip supply constraints started to ease off for automakers, sales in the two-wheeler segment of India's automotive industry remained muted in June, both over the last year and on a sequen… [+3189 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Rakesh Jhunjhunwala's wealth dips over ₹8,300 cr in first quarter of FY23. Here's how stocks performed | Mint - Mint", "description": "As per Trendlyne data, Jhunjhunwala's portfolio wealth dipped by at least 24.67% to  ₹25,425.88 crore in the June 2022 quarter compared to the previous quarter.", "url": "https://www.livemint.com/market/stock-market-news/rakesh-jhunjhunwala-s-wealth-dips-over-rs-8-300-cr-in-first-quarter-of-fy23-here-s-how-stocks-performed-11656768992952.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/5244bf12-7a11-11ec-9eea-9c1e2652c262_1644643836353_1656769213195.jpg", "publishedAt": "2022-07-02T13:46:16Z", "content": "Rakesh Jhunjhunwala is one of the largest investors and preachers of the stock market. His investment is diverse including major segments like auto, banking, pharma, financials, gaming, metal, and ho… [+3251 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Musk breaks silence on Twitter, posts a picture with the pope By Reuters - Investing.com", "description": "Musk breaks silence on Twitter, posts a picture with the pope", "url": "https://www.investing.com/news/stock-market-news/musk-breaks-silence-on-twitter-posts-a-picture-with-the-pope-2843353", "urlToImage": "https://i-invdn-com.investing.com/news/LYNXMPEB120UN_L.jpg", "publishedAt": "2022-07-02T13:15:00Z", "content": "(Reuters) - Elon Musk on Friday night broke his nine-day silence on Twitter (NYSE:TWTR), the social media platform he is trying to buy for $44 billion, posting a picture of him meeting Pope Francis o… [+639 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Toyota Fortuner Prices Increased By Rs. 1.14 Lakh, Effective From July 1 - GaadiWaadi.com", "description": "Toyota Fortuner prices have gone up by Rs. 1.14 lakh in India as all the variants of the full-sized SUV have been impacted", "url": "https://gaadiwaadi.com/toyota-fortuner-prices-increased-by-rs-1-14-lakh-effective-from-july-1/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/05/toyota-fortuner-GRsport-5.jpg", "publishedAt": "2022-07-02T11:36:57Z", "content": "Toyota Kirloskar Motor (TKM) has increased the prices of its full-sized Fortuner SUV by Rs. 1.14 lakh in the domestic market and is effective from July 1, 2022. The Japanese auto major introduced the… [+1883 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Abhijit Lele", "title": "Canara Bank crosses Rs 1 trn mark for outstanding gold loan book in June - Business Standard", "description": "Canara Bank is pushing this business in Eastern region and two metropolitan areas  Mumbai and Pune", "url": "https://www.business-standard.com/article/finance/canara-bank-crosses-rs-1-trn-mark-for-outstanding-gold-loan-book-in-june-122070200638_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2018-02/28/full/1519839250-9455.jpg", "publishedAt": "2022-07-02T11:17:00Z", "content": "After the State Bank of India, now another large public sector Canara Bank has crossed Rs one trillion mark for outstanding gold loan book in June 2022. The Bengaluru-based lender is looking to expan… [+1823 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "FPIs begin July as net sellers, remove ₹811 cr from Indian market on first day | Mint - Mint", "description": "From the total, on July 1, FPIs outflow stood at  ₹261 crore in the equity market, while the selloff was at  ₹372 crore in Debt-VRR market. Meanwhile, the debt market also recorded an outflow of  ₹186 crore.", "url": "https://www.livemint.com/market/stock-market-news/fpis-begin-july-as-net-sellers-remove-rs-811-cr-from-indian-market-on-first-day-11656755883577.html", "urlToImage": "https://images.livemint.com/img/2022/07/02/600x338/Market_1656758671902.jpg", "publishedAt": "2022-07-02T10:48:25Z", "content": "Foreign Portfolio Investors (FPI) commenced July as net sellers as they pulled out somewhat 811 crore cumulatively from the Indian market on the first day of the month. FPIs have held a selling bias … [+2571 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "New Bike Launches July 2022 - Ronin, Katana, Nightster, V4SP, G310RR - GaadiWaadi.com", "description": "TVS Ronin 225 cruiser will be launched on July 6, 2022 and is expected to be powered by a new 223 cc engine capable of 20 bhp max power", "url": "https://gaadiwaadi.com/new-bike-launches-july-2022-ronin-katana-nightster-v4sp-g310rr/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2019/10/TVS-Zeppelin-concept-e1570866507209.jpg", "publishedAt": "2022-07-02T10:15:44Z", "content": "Following a busy month last time out, the two-wheeler industry is gearing up to welcome a host of new products in July 2022. They are spread across different segments and arguably the most significan… [+2614 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "Credit Card Users: This New Rule on Billing Cycle Will Help to Manage Finances Better - News18", "description": "Several rules of credit card changes from July 1, 2022. Know what is credit card billing cycle and how a modification in billing cycle may help you to manage your finances better than before", "url": "https://www.news18.com/news/business/savings-and-investments/credit-card-users-this-new-rule-on-billing-cycle-will-help-you-to-manage-finances-better-5479813.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/creditcard-165675001116x9.jpg", "publishedAt": "2022-07-02T08:29:00Z", "content": "If you use a credit card, you must be familiar with the term called billing cycle. As the name suggests, billing cycle refers to the period for which your credit card bill is generated. Understanding… [+3266 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol PF Team", "title": "Six important money matters that call for your attention this July - Moneycontrol", "description": "Cryptocurrency transfers, freebies to social media influencers, I-T returns, mutual fund investments… there’s a lot happening in July. Here are the operational and regulatory changes you need to watch out for.", "url": "https://www.moneycontrol.com/news/business/personal-finance/six-important-money-matters-that-need-your-attention-this-july-8764001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Event-calendar-770x433.jpg", "publishedAt": "2022-07-02T08:24:00Z", "content": "Whether youre an investor in a mutual fund or a cryptomaniac or an income-tax payer, there are a number of important money changes that will affect your money box in July. Read on to find out what th… [+5672 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "As India seeks to curb accidents, Maruti's RC Bhargava faces a dilemma - Economic Times", "description": "The Maruti Suzuki Chairman said in a recent interview to The Times of India that the car maker will not hesitate to  discontinue  small cars if they become unviable due to the government's policy interventions such as the proposal to mandate six airbags from …", "url": "https://economictimes.indiatimes.com/industry/auto/auto-news/as-india-seeks-to-curb-accidents-marutis-rc-bhargava-faces-a-dilemma/articleshow/92615479.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92615465,width-1070,height-580,imgsize-983429,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-02T08:16:00Z", "content": "As Nitin Gadkari raises the stakes for car companies on road safety norms, veteran auto honcho and survivor of many battles, R C Bhargava, faces a dilemma: will the hatchback customer who has just up… [+4997 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bankruptcy Protection News: Crypto Hedge Fund Three Arrows Files For One - NDTV Profit", "description": "Crypto hedge fund Three Arrows Capital (3AC) is seeking protection from creditors in the United States under Chapter 15 of the US Bankruptcy Code", "url": "https://www.ndtv.com/business/crypto-hedge-fund-three-arrows-files-for-bankruptcy-protection-3120815", "urlToImage": "https://c.ndtvimg.com/2022-07/9o0stmo8_reuters-image_625x300_02_July_22.jpg", "publishedAt": "2022-07-02T07:44:10Z", "content": "Crypto hedge fund Three Arrows files for Chapter 15 bankruptcy\r\nCrypto hedge fund Three Arrows Capital (3AC) is seeking protection from creditors in the United States under Chapter 15 of the US Bankr… [+711 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sneha Kulkarni", "title": "What is the latest Sukanya Samriddhi Yojana interest rate? - Economic Times", "description": "Sukanya Samriddhi Yojana, also known as SSY, is a welfare initiative for girls with the goal of improving their lives with financial assistance. A girl kid aged 10 or younger can receive financial security from parents or legal guardians by investing SSY.", "url": "https://economictimes.indiatimes.com/wealth/invest/what-is-the-latest-sukanya-samriddhi-yojana-interest-rate/articleshow/92612936.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92612971,width-1070,height-580,imgsize-489311,overlay-etwealth/photo.jpg", "publishedAt": "2022-07-02T05:59:00Z", "content": "Sukanya Samriddhi Yojana, or SSY, is a welfare program for girls aimed at betterment for girls. Investing in SSY allows parents or legal guardians to provide financial protection for a girl child age… [+2027 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Mark Zuckerberg to Facebook employees: Get ready for intense performance appraisal, or else leave - India Today", "description": "Zuckerberg also said during a weekly employee Q&A that it is \"turning up the heat\" on performance management to fire staffers who are unable to meet their targets.", "url": "https://www.indiatoday.in/technology/news/story/mark-zuckerberg-to-facebook-employees-get-ready-for-intense-performance-appraisal-or-else-leave-1969359-2022-07-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202207/RTS2SJBD-647x363.png?SePZ1UDNfdJJqEXWSOfDlfh7DqpmgfI3", "publishedAt": "2022-07-02T05:49:01Z", "content": "Meta has warned its employees to brace themselves for serious times ahead. Meta is aggressively cutting down on hiring. The company CEO Mark Zuckerberg revealed that the company has cut plans to hire… [+1674 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Flights cancelled in France & Germany as travel disruptions in Europe continue | English News - WION", "description": "Travel disruptions continue in Europe with flights being cancelled in France & Germany. Airline workers are protesting over pay and layoffs.#Flights #Europe ...", "url": "https://www.youtube.com/watch?v=KLF1WT6VCrI", "urlToImage": "https://i.ytimg.com/vi/KLF1WT6VCrI/maxresdefault.jpg", "publishedAt": "2022-07-02T05:45:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Ola Electric slips to 4th spot as EV registrations fall amid fire fears - Economic Times", "description": "We calibrated our business priority for the month to focus on bettering our customer service and brought our TAT (turnaround time) to within 48 hours. Come July, we are confident that supply chain issues will start fading out and our strong order book will be…", "url": "https://economictimes.indiatimes.com/industry/renewables/ola-electric-slips-to-4th-spot-as-ev-registrations-fall-amid-fire-fears/articleshow/92612662.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92612827,width-1070,height-580,imgsize-7264,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-02T05:42:00Z", "content": "Ola Electric's registrations fell further in June as customers put off purchasing electric two-wheelers in the wake of several fires, dropping Ola to fourth place overall.\r\nAccording to VAHAN data, O… [+2321 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Richest billionaires lose $1.4 trillion in worst half ever - Economic Times", "description": "Its a sharp departure from the previous two years, when the fortunes of the ultra-rich swelled as governments and central banks unleashed unprecedented stimulus measures in the wake of the Covid-19 pandemic, juicing the value of everything from tech companies…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/richest-billionaires-lose-1-4-trillion-in-worst-half-ever/articleshow/92611334.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92611289,width-1070,height-580,imgsize-45774,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-02T04:32:00Z", "content": "Elon Musks fortune plunged almost $62 billion. Jeff Bezos saw his wealth tumble by about $63 billion. Mark Zuckerbergs net worth was slashed by more than half.\r\nAll told, the worlds 500 richest peopl… [+3491 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikhil Agarwal", "title": "Why do smallcaps falter before reaching full bloom? Saurabh Mukherjea gives 4 reasons - Economic Times", "description": "“However, this trend changes completely once these stocks enter the index. Quite contrary to their performance pre-entry, new entrants into the BSE500 on an average underperform the BSE500 by 11% p.a. over three years post the entry,” says Mukherjea, whose fi…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/why-do-smallcaps-falter-before-reaching-full-bloom-saurabh-mukherjea-gives-4-reasons/articleshow/92610702.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92610738,width-1070,height-580,imgsize-57857,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-02T03:50:00Z", "content": "For a smallcap investor, its a dream to see his hidden gem gradually turn into a much sought-after largecap stock and deliver multibagger returns in between. Citing market data, celebrated fund manag… [+2801 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Swati Bharadwaj", "title": "Hyderabad emerges as second most expensive housing market in H1 of 2022 - Times of India", "description": "Hyderabad has emerged as the second most expensive housing market in the country after Mumbai among the top eight cities for the first half of 2022,", "url": "https://timesofindia.indiatimes.com/city/hyderabad/hyderabad-emerges-as-second-most-expensive-housing-market-in-h1-of-2022/articleshow/92609277.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92609321,width-1070,height-580,imgsize-56332,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-07-02T02:18:00Z", "content": ""}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Wonderla Holidays to set up amusement park in Bhubaneswar, investment of Rs 115 crore - The New Indian Express", "description": "The proposed park will be a compact one compared to others owned by the company and is expected to be operational within two years.", "url": "https://www.newindianexpress.com/cities/bhubaneswar/2022/jul/02/wonderla-holidays-to-set-up-amusement-park-in-bhubaneswar-investment-of-rs-115-crore-2472020.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/7/2/w600X390/Wonderla_Holidays.jpg", "publishedAt": "2022-07-02T00:56:00Z", "content": "BHUBANESWAR: Bengaluru-based Wonderla Holidays Limited will set up an amusement park on the outskirts of Bhubaneswar. The property will be developed as one of the biggest parks in the country on a 50… [+1633 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Arup Roychoudhury & Shrimi Choudhary", "title": "Capex is the route to economic revival, says FM Nirmala Sitharaman - Business Standard", "description": "In an exclusive interview with BS Sitharaman says spend on capital assets may work better than sectorspecific fiscal steps", "url": "https://www.business-standard.com/article/economy-policy/capex-is-the-route-to-economic-revival-says-fm-nirmala-sitharaman-122070200024_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-07/02/full/1656702236-5377.jpg", "publishedAt": "2022-07-02T00:30:00Z", "content": "The government would depend on its public capital expenditure programme to revive demand in the economy and might not go for sector-specific fiscal measures, Finance Minister Nirmala Sitharaman told … [+4466 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WION Fineprint | US regulator asks Google and Apple stores to remove Tiktok app - WION", "description": "A leader of the U.S. Federal Communications Commission said he has asked Apple and Google to remove TikTok from their app stores over China-related data secu...", "url": "https://www.youtube.com/watch?v=vFdiZ18s28k", "urlToImage": "https://i.ytimg.com/vi/vFdiZ18s28k/maxresdefault.jpg", "publishedAt": "2022-07-01T19:12:58Z", "content": null}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Sentiment shows gold's fair value is around $1800… for now - Kitco NEWS", "description": "(Kitco News) - (Kitco News) - Gold prices could fall below $1,800 an ounce as sentiment in the marketplace continues to have a slightly bearish tilt; however, market analysts are not expecting any major route in gold as the precious metal continues to stand i…", "url": "https://www.kitco.com/news/2022-07-01/Sentiment-shows-gold-s-fair-value-is-around-1-800-for-now.html", "urlToImage": "https://www.kitco.com/news/2022-07-01/images/shutterstock_1022313718.jpg", "publishedAt": "2022-07-01T18:36:00Z", "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+3923 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gravitas: Indian cement maker buys Russian coal with Yuan - WION", "description": "An Indian cement company imported Russian coal by paying for it in Yuan. Reports say more buyers could turn to the Chinese currency. Palki Sharma tells you w...", "url": "https://www.youtube.com/watch?v=zne4V0Qx_Vg", "urlToImage": "https://i.ytimg.com/vi/zne4V0Qx_Vg/maxresdefault.jpg", "publishedAt": "2022-07-01T18:23:37Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Swati Luthra", "title": "‘Amazon to source 5,000 EVs from Tata for its fleet’ | Mint - Mint", "description": "We use speciality designed paper tapes instead of the brown plastic ones. We are using machine learning to determine whether a shipment can go without packaging: Abhinav Singh", "url": "https://www.livemint.com/news/india/amazon-to-source-5-000-evs-from-tata-for-its-fleet-11656698609744.html", "urlToImage": "https://images.livemint.com/img/2022/07/01/600x338/X404XGKK_1656698656398_1656698662095.jpg", "publishedAt": "2022-07-01T18:05:21Z", "content": "NEW DELHI : Amazon India has been moving towards climate-friendly and sustainable practices for a while, even before the recent ban on single-use plastic. This includes building a large electric vehi… [+2034 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anirban Chowdhury", "title": "Air India threatens to end contract with ground handling unit - Economic Times", "description": "The erstwhile state-run airline was acquired by the aviation-to-automobile conglomerate Tata Sons last year. Before the government sold it, it hived off its business units such as ground handling. The entity is named Air India Air Transport Services Ltd (AIAS…", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-threatens-to-end-contract-with-ground-handling-unit/articleshow/92605207.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92605219,width-1070,height-580,imgsize-907201,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-01T17:50:00Z", "content": "Air India has threatened to end its contract with its earlier ground handling unit due to the latters alleged deteriorating service standards which are delaying more of the carriers flights every mon… [+2446 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sebi fines Rs 36 lakh on PGIM AMC, CEO Ajit Menon, 3 others - Economic Times", "description": "In its order, Sebi noted that five entities did not adhere to the provisions of the mutual fund regulations while executing ISTs between open and close-ended schemes of PGIM MF. While executing ISTs, certain low-quality securities were transferred from close-…", "url": "https://economictimes.indiatimes.com/mf/mf-news/sebi-fines-rs-36-lakh-on-pgim-amc-ceo-ajit-menon-3-others/articleshow/92602912.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92603000,width-1070,height-580,imgsize-24434,overlay-etwealthmutualfunds/photo.jpg", "publishedAt": "2022-07-01T14:52:00Z", "content": "Capital markets regulator Sebi has imposed a penalty totalling Rs 36 lakh on five entities -- including PGIM Asset Management Company and its chief executive officer Ajit Menon -- for flouting mutual… [+2023 chars]"}, {"source": {"id": null, "name": "Mercomindia.com"}, "author": "Gourav Mishra", "title": "Websol Energy to Set Up a 1.8 GW Solar Cell and Module Manufacturing Plant - Mercom India", "description": "Websol Energy System has approved the issue of 23,80,000 equity shares of ₹10 (~$0.126) each at an issue price of ₹105 (~$1.329).", "url": "https://mercomindia.com/websol-energy-set-up-solar-cell-module-manufacturing/", "urlToImage": "https://mercomindia.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/07/Websol-Energy-to-Set-Up-a-1.8-GW-Solar-Cell-and-Module-Manufacturing-Plant.png", "publishedAt": "2022-07-01T14:26:34Z", "content": "Kolkata-based solar cells and modules manufacturer Websol Energy System has approved the issue of 23,80,000 equity shares of 10 (~$0.126) each at an issue price of 105 (~$1.329).\r\nThe shares will be … [+2001 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sharmistha Mukherjee", "title": "Tribunal permits Hero MotoCorp to sell EVs under 'Hero' trademark - Economic Times", "description": "The tribunal – comprising former Chief Justice of India Dipak Misra and retired judges Indu Malhotra and Indermeet Kaur – observed that Hero MotoCorp had publicly asserted its manifest intention to use the name ‘Hero for its business of electric vehicles sinc…", "url": "https://economictimes.indiatimes.com/industry/renewables/tribunal-permits-hero-motocorp-to-sell-evs-under-hero-trademark/articleshow/92581141.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92581150,width-1070,height-580,imgsize-40044,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-30T17:24:00Z", "content": "An arbitration tribunal, appointed by the Delhi High Court, on Thursday permitted Pawan Munjal-led to manufacture and sell electric vehicles under the trademark Hero.\r\nPeople in the know of the devel… [+3387 chars]"}]}