{"status": "ok", "totalResults": 55, "articles": [{"source": {"id": null, "name": "Carandbike.com"}, "author": null, "title": "2022 Hyundai Tucson Level 2 ADAS Features Explained - carandbike", "description": "Unlike our usual reviews, this time we were in the passenger seat of the 2022 Hyundai Tucson and not testing out the car's ADAS features but instead experienced it to gain some perspective as a co-passenger.", "url": "https://www.carandbike.com/news/2022-hyundai-tucson-level-2-adas-features-explained-3200552", "urlToImage": null, "publishedAt": "2022-07-18T04:43:33Z", "content": "The 2022 Hyundai Tucson has finally arrived in India! With prices to be announced on August 4 and get behind the wheel soon after. Hyundai invited us to the testing facility of ICAT in Manesar to exp… [+5229 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "Amit Sharma", "title": "New Maruti Alto 2022 Spied Undisguised- Launch This Diwali - India Car News", "description": "First launched in 2000, the Maruti Suzuki Alto has been one of the best-selling models in the country. The car has been the first choice for the first-time car buyers for a very long time. As buyers preference shifting towards SUVs, the Alto’s sales have decl…", "url": "https://www.indiacarnews.com/news/new-maruti-alto-2022-spied-undisguised-launch-this-diwali-53064/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2022/07/Maruti-Alto-2022-Spied-Undisguised-1000x600.jpg", "publishedAt": "2022-07-18T04:03:41Z", "content": "First launched in 2000, the Maruti Suzuki Alto has been one of the best-selling models in the country. The car has been the first choice for the first-time car buyers for a very long time. As buyers … [+2581 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Asia shares bounce, euro on edge for ECB and gas test By Reuters - Investing.com", "description": "Asia shares bounce, euro on edge for ECB and gas test", "url": "https://www.investing.com/news/economy/asia-tries-to-bounce-tense-week-ahead-for-eu-2848203", "urlToImage": "https://i-invdn-com.investing.com/news/indicatornews_6_800x533_L_1412601562.jpg", "publishedAt": "2022-07-18T03:26:00Z", "content": "By Wayne Cole\r\nSYDNEY (Reuters) - Asian shares inched higher on Monday following a much-needed bounce on Wall Street, but nerves are stretched ahead of a near-certain interest rate hike in Europe and… [+3959 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Surendhar M", "title": "Top 10 Scooters June 2022 - Activa, Jupiter, Access, Ntorq, Avenis, Dio - GaadiWaadi.com", "description": "Honda Activa was the most sold scooter in the country in the month of June 2022 as 1,84,305 units were sold with a YoY growth of 94.5%", "url": "https://gaadiwaadi.com/top-10-scooters-june-2022-activa-jupiter-access-ntorq-avenis-dio/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2020/10/TVS-NTorq-Marvel-Super-Squad-Edition-Launched-Iron-Man-To-Captain-America-1.jpg", "publishedAt": "2022-07-18T02:00:13Z", "content": "Last month, many scooters recorded impressive YoY growth within the top ten sales table. The Honda Activa sat on top of the standings with a total of 1,84,305 units as against 94,724 units in June 20… [+2430 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in the news: HDFC Bank, Voda Idea, JSPL, Federal Bank, LLTS and Vedanta - Economic Times", "description": "Bank of Maharashtra, Alok Industries, Heidelberg Cement, Ganesh Housing, Bhansali Engineering and Nelco are among the company that will announce their quarterly earning for the quarter ended June 2022.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-hdfc-bank-voda-idea-jspl-federal-bank-llts-and-vedanta/articleshow/92943838.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92943844,width-1070,height-580,imgsize-106122,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-18T01:54:00Z", "content": "Nifty futures on the Singapore Exchange traded 165.5 points, or 1.03 per cent higher at 16,205.5, signaling that Dalal Street was headed for a positive start on Monday. Here are a dozen stocks which … [+6392 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "A Goldman legend, crypto star and top banker warn of next big risk - Moneycontrol", "description": "The secret sauce for US growth has been that we’ve had strong population growth and strong gains in the labor force. I’m concerned about that right now.", "url": "https://www.moneycontrol.com/news/world/a-goldman-legend-crypto-star-and-top-banker-warn-of-next-big-risk-8841411.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/Crypto_Bitcoin-770x433.jpg", "publishedAt": "2022-07-18T01:08:27Z", "content": "In a year in which Russias invasion of Ukraine is sending shock waves through global politics and markets, inflation is soaring worldwide and supply chains areunraveling, the largest investors are as… [+13893 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saikat Das", "title": "Companies with overseas liabilities rush to cover currency risk - Economic Times", "description": "With the rupee breaching the psychological ₹80 versus the US dollar for the first time and the spot market USD-INR gauge heading towards that mark, companies that have significant overseas liabilities fear margin pressure will impact their nascent revival aft…", "url": "https://economictimes.indiatimes.com/industry/banking/finance/companies-with-overseas-liabilities-rush-to-cover-currency-risk/articleshow/92943366.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92943422,width-1070,height-580,imgsize-77196,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-18T01:01:00Z", "content": "Importers and overseas borrowers are rushing to cover their currency risk after the rupee fell to Rs 80 against the US dollar in both over-the-counter and derivatives markets on Thursday, leading to … [+3573 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Commodity prices' fall can help India escape global inflation trap - The Indian Express", "description": "RBI Governor Shaktikanta Das had recently said that inflation was likely to “ease gradually in the second half of 2022-23, precluding the chances of a hard landing in India”.", "url": "https://indianexpress.com/article/business/commodities/commodity-prices-fall-can-help-india-escape-global-inflation-trap-8035502/", "urlToImage": "https://images.indianexpress.com/2022/07/inflation-reuters-1-1.jpeg", "publishedAt": "2022-07-18T00:38:41Z", "content": "The Reserve Bank of India (RBI) has said that the Indian economy can escape the global inflation trap if the moderation in commodity prices witnessed in recent weeks endures, alongside an easing of s… [+4013 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pranav Balakrishnan", "title": "How Blinkit is integrating with Zomato’s Hyperpure after its long-awaited acquisition - Economic Times", "description": "Blinkit is expected to shut most of its own backend fulfilment warehouses and merge them with Zomatos business-to-business restaurant supply business Hyperpure, two people aware of the matter told ET.", "url": "https://economictimes.indiatimes.com/tech/startups/how-blinkit-is-integrating-with-zomatos-hyperpure-after-closing-its-long-awaited-acquisition/articleshow/92939708.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92939784,width-1070,height-580,imgsize-1858667,overlay-ettech/photo.jpg", "publishedAt": "2022-07-18T00:30:00Z", "content": "Blinkit is shutting down warehouses again, this time to integrate its operations with food delivery major , which is in the process of acquiring the Gurgaon-based quick commerce startup.\r\nBlinkit is … [+5282 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tarun Shukla", "title": "Air India has got immense lift force from Tatas. But the weight of Maharaja’s legacy will be a drag. - Economic Times", "description": "Air Indias management is trying to do what the government couldnt. While it has clinched a few better deals by leveraging Tatas scale, several important initiatives including an improvement in crew utilisation are pending. Tatas are focusing on slowly transfo…", "url": "https://economictimes.indiatimes.com/prime/transportation/air-india-has-got-immense-lift-force-from-tatas-but-the-weight-of-maharajas-legacy-will-be-a-drag-/primearticleshow/92942961.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92943008,width-1070,height-580,imgsize-15856/photo.jpg", "publishedAt": "2022-07-18T00:17:00Z", "content": "SynopsisAir India’s management is trying to do what the government couldn’t. While it has clinched a few better deals by leveraging Tatas’ scale, several important initiatives including an improvemen… [+185 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Writankar Mukherjee and Sagar Malviya", "title": "Crorepati club swells at HUL, ITC and United Spirits - Economic Times", "description": "According to their latest annual reports, HUL and ITC saw 33% and 44% increase in the number of eight-figure salary earners in FY22, respectively, while United Spirits reported a massive 113% surge. At ITC, 220 employees earned more than a crore last year. Th…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/crorepati-club-swells-at-hul-itc-united-spirits/articleshow/92941394.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92941416,width-1070,height-580,imgsize-374422,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T19:17:00Z", "content": "Kolkata | Mumbai: (HUL), and (USL) - three of the biggest companies in their segments - have together added more than 130 executives to the club of those earning more than 1 crore a year last fiscal.… [+2339 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "CarToq Desk", "title": "Renault offers big discounts on Kiger, Triber and Kwid in July - CarToq.com", "description": "The Indian subsidiary of the French carmaker Groupe Renault – Renault India is currently offering some pretty sweet discounts on its entire model range in the country. Massive discounts of up to Rs 94,000 are being offered by Renault India on its hatchback Kw…", "url": "https://www.cartoq.com/renault-offers-big-discounts-on-kiger-triber-and-kwid-in-july/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2021/06/Renault-Triber-featured.jpg", "publishedAt": "2022-07-17T16:43:29Z", "content": "The Indian subsidiary of the French carmaker Groupe Renault Renault India is currently offering some pretty sweet discounts on its entire model range in the country. Massive discounts of up to Rs 94,… [+2923 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Desirazu Venkat", "title": "Jeep small electric SUV spied during commercial shoot - CarWale", "description": "This will be Jeep's new entry-level vehicle", "url": "https://www.carwale.com/news/jeep-small-electric-suv-spied-during-commercial-shoot/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/126409/jeep-compact-suv-rear-view1.jpeg?isig=0&art=1&q=75", "publishedAt": "2022-07-17T15:45:00Z", "content": "-Smallest electric SUV in the Jeep range\r\n-Will also spawn models from Alfa Romeo and Fiat\r\nSmall SUV\r\nJeep had showcased its small SUV concept earlier this year and now the vehicle has been spotted … [+1123 chars]"}, {"source": {"id": null, "name": "Carandbike.com"}, "author": null, "title": "Bajaj Pulsar N160 Review - carandbike", "description": "The new Bajaj Pulsar N160 offers segment-first dual-channel ABS. But does it have the goods to take the fight to the best in the segment?", "url": "https://www.carandbike.com/reviews/bajaj-pulsar-n160-review-3200550", "urlToImage": null, "publishedAt": "2022-07-17T12:45:15Z", "content": "The all-new Bajaj Pulsar N160 is a motorcycle which Bajaj Auto says will become the entry point into the premium sports segment, although it's still a premium commuter in the 160 cc segment. The Puls… [+5022 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Remittances from Gulf countries dropped sharply in FY21 due to Covid-19 - Economic Times", "description": "The decline in remittances from the Gulf countries during 2020-21 reflects a slower pace of migration and a larger presence of Indian diaspora in informal sectors which was hit the most during the pandemic period. As a result, the proportion of small size tra…", "url": "https://economictimes.indiatimes.com/nri/invest/remittances-from-gulf-countries-dropped-sharply-in-fy21-due-to-covid-19/articleshow/92937846.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92937906,width-1070,height-580,imgsize-35640,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T12:40:00Z", "content": "Mumbai: The share of inward remittances from Gulf nations dipped sharply during 2020-21 on account of the economic stress created by the COVID-19 pandemic, said an RBI article. On the other hand, adv… [+3838 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "India’s diesel, gasoline sales taper off adding to oil’s gloom - Moneycontrol", "description": "The three biggest retailers sold 1.28 million tons of gasoline during July 1-15, down about 8% from the corresponding period in June, according to refinery officials with knowledge of the matter.", "url": "https://www.moneycontrol.com/news/business/indias-diesel-gasoline-sales-taper-off-adding-to-oils-gloom-8840341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/petroldieselpetrol-pumpfuel-station-770x433.jpg", "publishedAt": "2022-07-17T12:35:23Z", "content": "Indias gasoline and diesel sales during the first half of July dropped from last month as seasonal rains curtailed demand in the worlds third-biggest energy consumer, that could help keep a lid on oi… [+1666 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Muted impact of Fed's Taper 2 on India due to strong external position: RBI article - Economic Times", "description": "The article published in the Reserve Bank of India's (RBI) monthly bulletin for July compared the impact of the two taper announcements (May 22, 2013 and November 3, 2021) by the US Federal Reserve (Fed) on Indian financial markets.", "url": "https://economictimes.indiatimes.com/news/economy/policy/muted-impact-of-feds-taper-2-on-india-due-to-strong-external-position-rbi-article/articleshow/92937526.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92937534,width-1070,height-580,imgsize-67334,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T12:19:00Z", "content": "The impact of US Federal Reserve's announcement in November last year to taper its asset purchases was \"moderate\" on Indian financial markets largely due to the country's strong external position in … [+5516 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Mahindra Scorpio N petrol vs XUV700 diesel: Who will win in a drag race? [Video] - CarToq.com", "description": "Mahindra launched the XUV700 last year and it became a runaway hit from the manufacturer. The SUV currently has waiting period of over an year and last month, Mahindra launched another anticipated product Scorpio N in the market. This is also expected to be a…", "url": "https://www.cartoq.com/mahindra-scorpio-n-petrol-vs-xuv700-diesel-drag-race/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/07/xuv700-vs-scorpio-n-featured.jpg", "publishedAt": "2022-07-17T12:13:17Z", "content": "Mahindra launched the XUV700 last year and it became a runaway hit from the manufacturer. The SUV currently has waiting period of over an year and last month, Mahindra launched another anticipated pr… [+2720 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Security clearance to Air India CEO designate Wilson after background check: officials - Economic Times", "description": "Singapore Airlines is a joint venture partner of Tata Group in full service carrier Vistara. As the security clearance is taking time, Wilson is yet to formally take over the charge of the Air India, industry sources said. A query sent to Air India on Wilson'…", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/security-clearance-to-air-india-ceo-designate-wilson-after-background-check-officials/articleshow/92936884.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92936933,width-1070,height-580,imgsize-2712,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T11:37:00Z", "content": "The Union Home Ministry is examining the application to give security clearance to Air India Chief Executive Officer designate Campbell Wilson and the nod will be given once the thorough background c… [+2551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Anand Mahindra Shares \"Simple Yet Creative\" Staircase Design, Internet Calls It \"Brilliant\" - NDTV", "description": "Anand Mahindra is an avid social media user and he frequently shares fascinating posts that pique the interest of internet users. This time too, he has caught netizens' attention by sharing a video that shows a \"simple yet creative\" staircase.", "url": "https://www.ndtv.com/offbeat/watch-anand-mahindra-shares-simple-yet-creative-staircase-design-internet-calls-it-brilliant-3166336", "urlToImage": "https://c.ndtvimg.com/2022-02/hfno0a4_anand-mahindra_625x300_09_February_22.jpg", "publishedAt": "2022-07-17T11:36:18Z", "content": "The video has racked up over one million views and more than 50,000 likes\r\nAnand Mahindra, the chairman of Mahindra Group, is an avid social media user and he frequently shares fascinating posts that… [+2385 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Ather 450X Gen-3 to be revealed on July 19 - Team-BHP", "description": "Ather Energy has announced that the all-new Gen-3 450X electric scooter will be revealed on July 19, 2022. The Gen-3 model is likely to replace the current 450X. It is also expected to get a larger battery pack, up from the existing 2.6 kWh unit.", "url": "https://www.team-bhp.com/news/ather-450x-gen-3-be-revealed-july-19", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/FXxj8-gUUAAg1D-.jpg", "publishedAt": "2022-07-17T10:30:31Z", "content": "Ather Energy has announced that the all-new Gen-3 450X electric scooter will be revealed on July 19, 2022.\r\nThe Gen-3 model is likely to replace the current 450X. It is also expected to get a larger … [+576 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "These private sector banks promise over 6% interest rates on 1 year FDs | Mint - Mint", "description": "Owing to the RBI's increase in the repo rate to 4.90 percent during the MPC meeting in June, interest rates on fixed deposits are on the rise.", "url": "https://www.livemint.com/money/personal-finance/these-private-sector-banks-promise-over-6-interest-rates-on-1-year-fds-11658052110971.html", "urlToImage": "https://images.livemint.com/img/2022/07/17/600x338/mone2_1658052148034_1658052148034.JPG", "publishedAt": "2022-07-17T10:06:02Z", "content": "Owing to the RBI's increase in the repo rate to 4.90 per cent during the MPC meeting in June, interest rates on fixed deposits are on the rise. Fixed deposits are presently the most sought-after inve… [+3793 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Staff", "title": "Will Indian Rupee replace Sri Lankan Rupee? - Firstpost", "description": "The subsititution has the potential to attract foreign investors who may show greater willingness to be paid in INR rather than the domestic currency LKR, which might be subject to losses on foreign exchange markets", "url": "https://www.firstpost.com/business/will-indian-rupee-replace-sri-lankan-rupee-10921311.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/07/000_HW9X8-1.jpg", "publishedAt": "2022-07-17T09:12:00Z", "content": "The subsititution has the potential to attract foreign investors who may show greater willingness to be paid in INR rather than the domestic currency LKR, which might be subject to losses on foreign … [+4152 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Motilal Oswal is bullish on this Rakesh Jhunjhunwala stock for 31% upside | Mint - Mint", "description": "On the NSE, the shares of Federal Bank (FB) closed at  ₹98.65 level on Friday, up by 1.49% from its previous close of  ₹97.20.", "url": "https://www.livemint.com/market/stock-market-news/motilal-oswal-is-bullish-on-this-rakesh-jhunjhunwala-stock-for-31-upside-11658047988841.html", "urlToImage": "https://images.livemint.com/img/2022/07/17/600x338/65e54c1a-f539-11eb-8db7-efbdfae8b131_1634109196495_1658048050749_1658048050749.jpg", "publishedAt": "2022-07-17T08:59:32Z", "content": "On the NSE, the shares of Federal Bank (FB) closed at 98.65 level on Friday, up by 1.49% from its previous close of 97.20. In the last 1 year, the stock has surged 14.71% and on a YTD basis, the stoc… [+4413 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Viveat Susan Pinto", "title": "Vedanta seeks shareholder nod for related-party deals worth Rs 8,661 cr - Business Standard", "description": "Three resolutions have been listed on the agenda of the companys annual general meeting AGM to be held on August 10 involving subsidiaries", "url": "https://www.business-standard.com/article/companies/vedanta-seeks-shareholder-nod-for-related-party-deals-worth-rs-8-661-cr-122071700414_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-04/12/full/1618168593-3103.jpg", "publishedAt": "2022-07-17T08:49:00Z", "content": "Metals and mining major Vedanta is seeking shareholder approval for related-party transactions worth Rs 8,661 crore for the ongoing financial year (FY23).\r\nThree resolutions have been listed on the a… [+2365 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Rohit", "title": "2022 Hyundai Venue SX Variant Analysis: Pick This Or The Top-spec Variant? - CarDekho", "description": "It is the best-equipped trim with the 1.2-litre petrol variant of the sub-4m SUV  The Hyundai Venue’s SX trim is the fully loaded variant with the 1.2-litre petrol engine and the second-to-top variant with the 1.5-litre diesel unit. However, you won’t get it …", "url": "https://www.cardekho.com/india-car-news/2022-hyundai-venue-sx-variant-analysis-pick-this-or-the-topspec-variant-29398.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/29397/1657913524529/VariantsExplained.jpg", "publishedAt": "2022-07-17T08:34:00Z", "content": "It is the best-equipped trim with the 1.2-litre petrol variant of the sub-4m SUV\r\nThe Hyundai Venues SX trim is the fully loaded variant with the 1.2-litre petrol engine and the second-to-top variant… [+4564 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Vedanta to bring into operation two coal blocks in this financial year - Moneycontrol", "description": "In this fiscal year, Vedanta plans to operationalize two coal blocks in Odisha, and is developing a strategy to expedite the operationalization of a third coal mine there.", "url": "https://www.moneycontrol.com/news/business/vedanta-to-bring-into-operation-two-coal-blocks-in-this-financial-year-8839191.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/3-india-coal-770x433.jpg", "publishedAt": "2022-07-17T07:10:02Z", "content": "Billionaire Anil Agarwal-led Vedanta expects to bring into operation two coal blocks in Odisha in this fiscal and is working out a plan to fast-track the operationalisation of another coal mine in th… [+2769 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Indian car buyers are lapping up SUVs, high-tech features like never before - Economic Times", "description": "Such is the craze for SUVs at present that waiting periods for some of the most popular models are stretching to over two years, and fresh orders are still flowing in. Car buyers are now willing to spend more on their personal mode of travel and are preferrin…", "url": "https://economictimes.indiatimes.com/industry/auto/auto-news/indian-car-buyers-are-lapping-up-suvs-high-tech-features-like-never-before/articleshow/92932651.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92932695,width-1070,height-580,imgsize-1286105,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T06:39:00Z", "content": "India's romance with SUVs is intensifying ever so fast and automakers are fuelling the affair even further, having launched 36 such models in the last five years.\r\nSuch is the craze for SUVs at prese… [+4354 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Jayprashanth Mohanram", "title": "Bhavish Aggarwal reveals launch date of MoveOS 3 update for Ola S1 Pro electric scooter - CarToq.com", "description": "Ola Electric’s CEO Bhavish Aggarwal has just revealed the MoveOS 3 firmware update for the S1 and S1 Pro electric scooters is being put together by the automaker’s software developers, and that the launch of Move OS3 will happen on 24th October, 2022, which a…", "url": "https://www.cartoq.com/bhavish-aggarwal-reveals-launch-date-of-moveos-3-update-for-ola-s1-pro-electric-scooter/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/ola-s1-pro-featured.jpg", "publishedAt": "2022-07-17T06:23:00Z", "content": "Ola Electric’s CEO Bhavish Aggarwal has just revealed the MoveOS 3 firmware update for the S1 and S1 Pro electric scooters is being put together by the automaker’s software developers, and that the l… [+2847 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Nifty set for firm start this week. Key factors to watch out in Indian markets | Mint - Mint", "description": "On the earnings front, market will react to HDFC Bank's numbers on Monday, while Ambuja Cement, HUL, IndusInd Bank, HDFC Life and Wipro will be the other prominent names for Q1 earnings this week", "url": "https://www.livemint.com/news/india/nifty-set-for-firm-start-this-week-key-factors-to-watch-out-in-indian-markets-11658033502512.html", "urlToImage": "https://images.livemint.com/img/2022/07/17/600x338/Nifty_Stocks_1658037831529_1658037831806_1658037831806.JPG", "publishedAt": "2022-07-17T06:07:28Z", "content": "Indian stock markets last week fell on a a weekly basis on fears of aggressive rate hikes by central banks globally. The Nifty50 index and Sensex benchmarks were down more than 1% for the week, endin… [+3141 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "HDFC Bank to consider IPOs for HDFC Sec, HDB Financial Services after merger | Mint - Mint", "description": "HDFC Bank will only consider IPOs of HDFC Securities, HDB Financial Services after merger with HDFC.", "url": "https://www.livemint.com/news/india/hdfc-bank-to-consider-ipos-for-hdfc-sec-hdb-financial-services-after-merger-11658035060827.html", "urlToImage": "https://images.livemint.com/img/2022/07/17/600x338/HDFC-M-A-HDFC-BANK-3_1652847001170_1658037263753_1658037263753.JPG", "publishedAt": "2022-07-17T05:54:43Z", "content": "HDFC Bank will only consider a public listing of its brokerage and non-bank finance company subsidiaries after the completion of its merger with parent HDFC Ltd, CEO and managing director Sashidhar J… [+3593 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "FPIs remain in selling mode; take out Rs 7,400 cr from equities in July so far - Economic Times", "description": "While foreign portfolio investors (FPIs) have slowed down their pace of selling, this does not indicate a change in trend as there has not been any significant improvement in the underlying drivers, said Himanshu Srivastava, Associate Director - Manager Resea…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-remain-in-selling-mode-take-out-rs-7400-cr-from-equities-in-july-so-far/articleshow/92932028.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92932053,width-1070,height-580,imgsize-26600,overlay-etmarkets/photo.jpg", "publishedAt": "2022-07-17T05:48:00Z", "content": "Foreign investors continue to be cautious about the Indian equity market and have pulled out over Rs 7,400 crore this month so far amid sustained strengthening of the dollar and increasing concerns o… [+3414 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "TCS, HCL, Infosys: Know What IT Companies Say On Work From Home - News18", "description": "Employees are also preferring work from home as they say it helps them better manage work-life balance and saves money", "url": "https://www.news18.com/news/business/tcs-hcl-infosys-know-what-it-companies-say-on-work-from-home-5572351.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/wfh-165027662116x9.jpg", "publishedAt": "2022-07-17T05:13:35Z", "content": "As the World Health Organization (WHO) recently said the coronavirus pandemic is changing but it is not over and warned that the cases are rising in 110 nations, companies are being cautious in openi… [+3137 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Mcap of 6 of top-10 firms lose ₹1.68 lakh crore dragged down by TCS amid overall weak market trend | Mint - Mint", "description": "TCS took the biggest hit as its market valuation tumbled  ₹99,270.07 crore to reach  ₹10,95,355.32 crore, even as shares of TCS dropped last week after the company's June quarter earnings failed to meet market expectations", "url": "https://www.livemint.com/news/india/mcap-of-6-of-top-10-firms-lose-rs-1-68-lakh-crore-dragged-down-by-tcs-amid-overall-weak-market-trend-11658032567035.html", "urlToImage": "https://images.livemint.com/img/2022/07/17/600x338/TCS_1658033663528_1658033663652_1658033663652.jpg", "publishedAt": "2022-07-17T05:08:36Z", "content": "The combined market capitalisation six of the 10 most valued firms suffered a combined erosion of 1,68,260.37 crore from valuation last week, primarily dragged down by IT major TCS on the back of ove… [+2118 chars]"}, {"source": {"id": null, "name": "Bikewale.com"}, "author": "Anuj Mishra", "title": "Your weekly dose of bike updates: BMW G310 RR, Hero Xpulse 200 4V, and more! - BikeWale", "description": "The last week witnessed a bunch of new developments in the Indian two-wheeler industry, especially in terms of new launches.", "url": "https://www.bikewale.com/news/your-weekly-dose-of-bike-updates-bmw-g310-rr-hero-xpulse-200-4v-and-more/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/126371/bmw-g310-rr-right-side-view1.jpeg?isig=0&q=75&art=2", "publishedAt": "2022-07-17T05:02:53Z", "content": "The last week witnessed a bunch of new developments in the Indian two-wheeler industry, especially in terms of new launches. And the brand which went the most aggressive with revising its product por… [+2261 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "There Are Indications That Inflation May Be Peaking: RBI July 2022 Bulletin - News18", "description": "RBI says inflation may fall back into the tolerance band (under 6 per cent) by the fourth quarter of 2022-23", "url": "https://www.news18.com/news/business/there-are-indications-that-inflation-may-be-peaking-rbi-july-2022-bulletin-5571775.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/inflation-2-165519338116x9.jpg", "publishedAt": "2022-07-17T04:06:32Z", "content": "The Reserve Bank of India (RBI) has said there are indications that inflation may be peaking and that it may fall back into the tolerance band (under 6 per cent) by the fourth quarter of 2022-23. It … [+2998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "As start-ups complain, Govt looks to ease data localisation norms - The Indian Express", "description": "Under the draft Bill, entities dealing with users’ personal data are mandated to store a copy of such data within India and the export of undefined “critical” personal data is prohibited.", "url": "https://indianexpress.com/article/business/startups/as-start-ups-complain-govt-looks-to-ease-data-localisation-norms-8034036/", "urlToImage": "https://images.indianexpress.com/2022/07/data-4.jpg", "publishedAt": "2022-07-17T03:57:32Z", "content": "Following complaints by many Indian start-ups that data localisation requirements in the current draft of the personal data protection Bill are too compliance intensive and could hamper ease of doing… [+4001 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Dalal Street Week Ahead | 10 key factors that will keep traders busy - Moneycontrol", "description": "Watch out for earnings, meetings of central banks, and oil prices, among other things", "url": "https://www.moneycontrol.com/news/business/markets/dalal-street-this-week-10-key-factors-that-will-keep-traders-busy-8838081.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/market1-4-770x433.jpg", "publishedAt": "2022-07-17T03:50:16Z", "content": "Indian equity benchmark indices lost 1 percent each during the week ended 15 July amid weak global cues, lower GDP data and rising inflation. Besides, falling Indian rupee and continued selling by th… [+6055 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Sent 'Warning Text' To Twitter CEO Parag Agrawal: Report - NDTV", "description": "Elon Musk announced the termination of the Twitter purchase deal in a letter sent by his team to Twitter earlier this month.", "url": "https://www.ndtv.com/world-news/elon-musk-sent-text-to-twitter-ceo-parag-agrawal-report-3165238", "urlToImage": "https://c.ndtvimg.com/2022-07/bvmvvus8_elon-musk_625x300_09_July_22.jpg", "publishedAt": "2022-07-17T03:31:30Z", "content": "Twitter sued Musk after he decided to back out of the $44 billion takeover deal. (File)\r\nWashington: The dispute between Tesla CEO Elon Musk and Twitter is taking many twists and turns.\r\nAs per new r… [+2686 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Set On Course To Become World's Fastest-Growing Economy, Says RBI - NDTV Profit", "description": "In a global landscape marred by fears of recession and war, the Indian economy shows resilience, said the RBI.", "url": "https://www.ndtv.com/business/india-set-on-course-to-become-worlds-fastest-growing-economy-says-rbi-3165278", "urlToImage": "https://c.ndtvimg.com/2022-07/0fpa2n4_image_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T02:37:43Z", "content": "India on course to become world's fastest-growing economy, says RBI\r\nIndia's economy has remained resilient in the face of global headwinds and with inflation coming off its recent peak is expected t… [+1772 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rica Bhattacharyya", "title": "In fight for CXOs, companies' weapon of choice - golden handcuffs - Economic Times", "description": "In the last one year, these established companies have lost their top leaders to new-age firms and companies in high-growth sectors such as technology, healthcare, and others. Now, they are looking at engaging their CEO and CXO talent in more sweetened, but b…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/in-fight-for-cxos-companies-weapon-of-choice-golden-handcuffs/articleshow/92929486.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92929552,width-1070,height-580/photo.jpg", "publishedAt": "2022-07-17T02:34:00Z", "content": "SynopsisIn the last one year, these established companies have lost their top leaders to new-age firms and companies in high-growth sectors such as technology, healthcare, and others. Now, they are l… [+85 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | US Fed may raise interest rates by another 75-100 bps in July, says Abhijit Bhave of Fisdom... - Moneycontrol", "description": "An unlikely situation of a deep recession in the US, escalating geopolitical crisis among Russia and Ukraine wherein other European nations may be pulled into a war-like situation and any unexpected sudden spike in the pandemic situation may affect the equity…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-fed-may-raise-interest-rates-by-another-75-100-bps-july-that-might-increase-unemployment-and-harm-us-growth-says-abhijit-bhave-of-fisdom-private-wealth-8838391.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Abhijit_Bhave1280-770x433.jpg", "publishedAt": "2022-07-17T02:32:32Z", "content": "Abhijit Bhave of Fisdom Private Wealth believes that the US Federal Reserve may raise rates by another 75-100 basis points in July to tame the rising inflation. This may increase the unemployment and… [+6207 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Heathrow goes from Europe’s gateway to UK’s travel nightmare - Economic Times", "description": "How things change. Today, Heathrow is locked in yet another dispute with airlines after insisting they halt ticket sales during the lucrative school holiday season, a move that could cost as much as $500 million in lost revenue. The airport has been strugglin…", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/heathrow-goes-from-europes-gateway-to-uks-travel-nightmare/articleshow/92929311.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92929621,width-1070,height-580,imgsize-179532,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-17T02:16:00Z", "content": "Less than a decade ago, Londons Heathrow was the undisputed hub airport for Europe, with thousands of daily passengers and an ambitious expansion plan that included a brand new runway. Terminal 5 was… [+5753 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "IndiGo not following standard maintenance procedures, Technicians tells Airbus | Mint - Mint", "description": "IndiGo’s technicians wrote a letter to aircraft manufacturer Airbus complaining that their employer was not following standard maintenance procedures leading to risking passengers’ safety.", "url": "https://www.livemint.com/news/india/indigo-not-following-standard-maintenance-procedures-technicians-tells-airbus-11658015277388.html", "urlToImage": "https://images.livemint.com/img/2022/07/16/600x338/IndiGo_flight_1657864386016_1658015326098_1658015326098.jpg", "publishedAt": "2022-07-17T00:23:25Z", "content": "IndiGos technicians wrote a letter to aircraft manufacturer Airbus complaining that their employer was not following standard maintenance procedures leading to risking passengers safety. A letter was… [+3194 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Dollar index to US PMI data: 5 factors that may dictate gold price this week | Mint - Mint", "description": "Gold price outlook: The Indian rupee movement would be on market participants’ radar as the INR hit its new nadir in the week gone by", "url": "https://www.livemint.com/market/commodities/dollar-index-to-us-pmi-data-5-factors-that-may-dictate-gold-price-this-week-11657962941479.html", "urlToImage": "https://images.livemint.com/img/2022/07/16/600x338/Gold_price_today_MINT_1657963354381_1657963362613_1657963362613.jpg", "publishedAt": "2022-07-17T00:10:52Z", "content": "Gold price ended in negative zone for fifth successive week losing 1.32 per cent in the week gone by. As dollar index climbed to 20-year high last week, spot gold price nosedived to its one year lows… [+3177 chars]"}, {"source": {"id": null, "name": "OilPrice.com"}, "author": "Alex Kimani", "title": "Energy Markets Will Determine The Fate Of The Euro - OilPrice.com", "description": "The euro recently reached parity with the U.S. dollar for the first time in 20 years, and if the  European Union can't get its energy crisis under control, it could fall further", "url": "https://oilprice.com/Energy/Energy-General/Energy-Markets-Will-Determine-The-Fate-Of-The-Euro.html", "urlToImage": "https://d32r1sh890xpii.cloudfront.net/article/718x300/2022-07-15_a4gnqovfzt.jpg", "publishedAt": "2022-07-16T21:00:00Z", "content": "Europe has overtaken Asia as…\r\nThe number of total active…\r\nWhile much of the west…\r\nBy Alex Kimani - Jul 16, 2022, 4:00 PM CDTA few days ago, a rare event in the forex markets took place: for the fi… [+5799 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "John Reed", "title": "India escalates crackdown on Chinese phone makers - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/c335c72e-2633-49a4-b8c8-4205d20014da", "urlToImage": null, "publishedAt": "2022-07-16T19:00:13Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Suraksha P", "title": "Accidental healthcare entrepreneur transforming childbirth experience: Janhavi Nilekani - Economic Times", "description": "Nilekani, the eldest child of Infosys co-founder Nandan Nilekani, is also the chairperson of the Aastrika Foundation, a Nilekani Philanthropies Initiative that was founded in 2019, with an aim to strengthen health systems through capacity building of healthca…", "url": "https://economictimes.indiatimes.com/news/accidental-healthcare-entrepreneur-transforming-childbirth-experience-janhavi-nilekani/articleshow/92926736.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92928978,width-1070,height-580,imgsize-65912,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-16T18:54:00Z", "content": "Janhavi Nilekani calls herself an accidental healthcare entrepreneur. The 34-year-old daughter of billionaire tech pioneer Nandan Nilekani and philanthropist Rohini Nilekani wants to transform childb… [+2889 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shantanu Nandan Sharma", "title": "Medicine Sans Frontiers: India is gearing up to grab a larger pie of $80-bn medical tourism market - Economic Times", "description": "What is unusual though is that this time, the Government of India (GoI) has picked a niche: it is now focusing more on medical tourism, a segment valued at $60-80 billion globally.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/medicine-sans-frontiers-india-is-gearing-up-to-grab-a-larger-pie-of-80-bn-medical-tourism-market/articleshow/92924586.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92924620,width-1070,height-580,imgsize-71812,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-16T17:30:00Z", "content": "Global tourism is taking flight again. With the pandemic waning, reports about airport chaos have surfaced in the US and Europe, confirming an abrupt rise in international air travel even as hard dat… [+9147 chars]"}, {"source": {"id": null, "name": "The Daily Hodl"}, "author": "Daily Hodl Staff", "title": "Ethereum Developers Say ETH’s Massive Upgrade Is ‘Coming Together’ – Here’s the Timeline - The Daily Hodl", "description": "Ethereum (ETH) developers are putting forward a tentative timeline for the smart contract platform to merge to its proof-of-stake system.", "url": "https://dailyhodl.com/2022/07/16/ethereum-developers-say-eths-massive-upgrade-is-coming-together-heres-the-timeline/", "urlToImage": "https://dailyhodl.com/wp-content/uploads/2022/07/eth-massive-upgrade.jpg", "publishedAt": "2022-07-16T16:55:52Z", "content": "Ethereum (ETH) developers are putting forward a tentative timeline for the smart contract platform to merge to its proof-of-stake system.\r\nEthereum core developer Tim Beiko says the ETH Merge is curr… [+1379 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Maruti Grand Vitara to get biggest panoramic sunroof in its class - Team-BHP", "description": "Maruti Suzuki is gearing up to take the wraps off the Grand Vitara next week. In a recent teaser video, the carmaker has claimed that the SUV will get the largest panoramic sunroof in the segment. The Maruti Suzuki Grand Vitara shares its underpinnings with t…", "url": "https://www.team-bhp.com/news/maruti-grand-vitara-get-biggest-panoramic-sunroof-its-class", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Panosunroof.jpg", "publishedAt": "2022-07-16T10:29:06Z", "content": "Maruti Suzuki is gearing up to take the wraps off the Grand Vitara next week. In a recent teaser video, the carmaker has claimed that the SUV will get the largest panoramic sunroof in the segment.\r\nT… [+679 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Nidhish Shanker", "title": "Coinbase Could Be The Next Big Insolvency, Expert Warns - CoinGape", "description": "Coinbase will temporarily suspend its affiliate marketing program, citing market conditions and negative outlook of crypto industry.", "url": "https://coingape.com/coinbase-could-be-the-next-big-insolvency-expert-warns/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/07/16133758/Coinbase.jpg", "publishedAt": "2022-07-16T10:27:35Z", "content": "Business Insider reported that Coinbase is temporarily shutting down its affiliate-marketing program in the US. According to an email sent to three creators, the crypto exchange will suspend its prog… [+1829 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anand Mahindra Shares Photo Of \"Latest Technology\" To Dry Clothes, Internet In Splits - NDTV", "description": "Industrialist Anand Mahindra's recent post is attracting eyeballs of social media users, which shows the \"latest technology\" used to dry clothes.", "url": "https://www.ndtv.com/offbeat/anand-mahindra-shares-photo-of-latest-technology-to-dry-clothes-internet-in-splits-3163692", "urlToImage": "https://c.ndtvimg.com/2022-02/hfno0a4_anand-mahindra_625x300_09_February_22.jpg", "publishedAt": "2022-07-16T09:36:45Z", "content": "Anand Mahindra is an active social media user and frequently share fascinating posts.\r\nIndustrialist Anand Mahindra is an active social media user and frequently share fascinating posts that pique th… [+1636 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Dividend paying stocks: These 5 shares to trade ex-dividend next week | Mint - Mint", "description": "Federal Bank, HCL Tech, Hindustan Zinc are some of the dividend paying stocks that will trade ex-dividend next week", "url": "https://www.livemint.com/market/stock-market-news/dividend-paying-stocks-these-5-shares-to-trade-ex-dividend-next-week-11657958471364.html", "urlToImage": "https://images.livemint.com/img/2022/07/16/600x338/LSpic_1653239145371_1657958681890_1657958681890.jpg", "publishedAt": "2022-07-16T08:08:16Z", "content": "Dividend paying stocks: A stock market investor doesn't earn only due to rise in its portfolio stocks but there some other means of income as well. Dividend payment being announced by the listed comp… [+3812 chars]"}, {"source": {"id": null, "name": "Inc."}, "author": "Kelly Main", "title": "Google's CEO Has a Brilliantly Simple Plan To Recession-Proof His Staff. Any Business Can Use It - Inc.", "description": "Alphabet's Sundar Pichai demonstrates how you can cut costs without cutting employees.", "url": "https://www.inc.com/kelly-main/google-sundar-pichai-entrepreneurial-employees.html", "urlToImage": "https://img-cdn.inc.com/image/upload/w_1024,h_576,c_fill/images/panoramic/GettyImages-1147600063_507931_bsu0hg.jpg", "publishedAt": "2022-07-16T07:07:05Z", "content": "In a recent staff-wide email, Alphabet and Google CEO Sundar Pichai referenced the potential for a recession and how it could affect the company. \"We need to be more entrepreneurial working with grea… [+3635 chars]"}]}