{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gravitas: OPEC+ agrees to increase oil output to cool prices - WION", "description": "OPEC+ led by Saudi Arabia and Russia bucked market expectations to increase oil output by 50%. Can the gulf states make up for Russia's oil deficit? How is o...", "url": "https://www.youtube.com/watch?v=qWtUhaVQwAE", "urlToImage": "https://i.ytimg.com/vi/qWtUhaVQwAE/maxresdefault.jpg", "publishedAt": "2022-06-02T18:34:04Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Piyush Shukla", "title": "Exclusive | Centre approves appointment of A Manimekhalai as Union Bank MD, CEO: Source - Moneycontrol", "description": "Manimekhalai is the first woman MD and CEO of Union Bank of India and replaces Rajkiran Rai. G who held the position of Union Bank chief since 2017.", "url": "https://www.moneycontrol.com/news/business/companies/exclusive-centre-approves-appointment-of-a-manimekhalai-as-union-bank-md-ceo-source-8634311.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/04/Union_bank_India-770x433.jpg", "publishedAt": "2022-06-02T17:03:55Z", "content": "The Appointments Committee of the Cabinet (ACC) on June 2 approved the proposal of the Union Finance Ministry to appoint A. Manimekhalai, executive director at Canara Bank as Managing Director &amp; … [+2047 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold, silver push higher as greenback slumps - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2022-06-02/Gold-silver-push-higher-as-greenback-slumps.html", "urlToImage": "https://www.kitco.com/news/2022-06-02/images/goldchart_0602_pm.png", "publishedAt": "2022-06-02T16:35:00Z", "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+3650 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Yes Bank To Buyback Overseas Bonds Worth $200 Million. Details Here | Mint - Mint", "description": "The bank's board of directors met on June 2nd to consider certain rights available to Yes Bank under the terms and conditions of the medium-term note program set up for an amount of $1 billion.", "url": "https://www.livemint.com/companies/news/yes-bank-to-buyback-overseas-bonds-worth-200-million-details-here-11654186732761.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/Yes_Bank_1644826709232_1654186858031.JPG", "publishedAt": "2022-06-02T16:22:37Z", "content": "Yes Bank on Thursday received approval for the buyback of notes issued under the lender's Medium Term Note Programme to the tune of $200 million. The capital raising committee has approved the plan a… [+1049 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Friday: Top 15 things to know before Opening Bell - Moneycontrol", "description": "Based on the open interest future percentage, a long build-up was seen in 72 stocks including Abbott India, Federal Bank, Intellect Design Arena, Polycab India, and United Breweries", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-friday-top-15-things-to-know-before-opening-bell-163-8634141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/stocks_sensex_nifty_stockmarket1-770x433.jpg", "publishedAt": "2022-06-02T15:55:07Z", "content": "The market snapped two-day weakness and recouped some of those losses on June 2 despite a downtrend in Asian counterparts, supported by technology, metal, select pharma stocks and index heavyweight R… [+8596 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "May Exports Up 15.46% To $37.29 Billion; Trade Deficit Widens To $23.33 Billion | Mint - Mint", "description": "India's merchandise exports garnered a rise of 15.46% to $37.29 billion in May 2022 on the back of strong performance in segments such as petroleum products, electronic goods and chemicals.", "url": "https://www.livemint.com/news/india/may-exports-up-15-46-to-37-29-billion-trade-deficit-widens-to-23-33-billion-11654180835840.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/FILES-CHINA-ECONOMY-TRADE-FIGURES-IMPORT-EXPORT-0_1642428980865_1654180983448.jpg", "publishedAt": "2022-06-02T14:44:55Z", "content": "India recorded the highest-ever merchandise export of $37.3 billion in May this year, rising by a whopping 15.46%. The performance was driven by healthy performance in segments such as petroleum prod… [+1592 chars]"}, {"source": {"id": null, "name": "Coingape"}, "author": "Adrian", "title": "Luna2 drops 66% In 5 days: market players call out Dokwon - CoinGape", "description": "Twitter user Sassalox has taken to Twitter to ask Terra's founder Do Kwon, if it is time for LUNA3 following the Plunge of LUNA2, which has gone down 66% in just 5 days after its launch. Investors rush for exits after securing airdrop According to CoinMarketC…", "url": "https://coingape.com/luna2-drops-66-in-5-days-market-players-call-out-dokwon/", "urlToImage": "https://cdn.coingape.com/wp-content/uploads/2022/05/30234237/LUNA-2.0-coingape.jpg", "publishedAt": "2022-06-02T14:00:05Z", "content": "Twitter user Sassalox has taken to Twitter to ask Terra’s founder Do Kwon, if it is time for LUNA3 following the Plunge of LUNA2, which has gone down 66% in just 5 days after its launch.\r\nInvestors r… [+1851 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Shantonil Nag", "title": "Upcoming Maruti’s Creta-rival YFG spotted testing - CarToq.com", "description": "With the discontinuation of the S-Cross from Maruti Suzuki India’s lineup, the anticipation for the upcoming midsize SUV from India’s largest carmaker has grown even more. The SUV has been spied under trial runs in and around Gurgaon, where the carmaker’s lar…", "url": "https://www.cartoq.com/upcoming-marutis-creta-rival-yfg-spotted-testing/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/2022-maruti-suzuki-yfg-india-4.jpg", "publishedAt": "2022-06-02T13:55:46Z", "content": "With the discontinuation of the S-Cross from Maruti Suzuki Indias lineup, the anticipation for the upcoming midsize SUV from Indias largest carmaker has grown even more. The SUV has been spied under … [+2678 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "2 maharatna dividend stocks to buy as suggested by HDFC Securities | Mint - Mint", "description": "The brokerage firm HDFC Securities has recommended buying the shares of GAIL (India) and ONGC the two maharatna companies of India.", "url": "https://www.livemint.com/market/stock-market-news/2-maharatna-dividend-stocks-to-buy-as-suggested-by-hdfc-securities-11654176094521.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/INDIA-IPO-SCRUTINY_1648966903929_1654176145431.JPG", "publishedAt": "2022-06-02T13:26:00Z", "content": "The brokerage firm HDFC Securities has recommended buying the shares of GAIL (India) and ONGC the two maharatna companies of India. The brokerage has set a target price of 220 for Oil &amp; Natural G… [+4737 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "UltraTech Cement to invest ₹12,886 cr towards capacity expansion by FY25 | Mint - Mint", "description": "The investment, which will cater to the ‘future growth’ of the company, will be funded through a mix of debt and internal accruals, UltraTech said", "url": "https://www.livemint.com/companies/news/ultratech-cement-to-invest-rs-12-886-cr-towards-capacity-expansion-by-fy25-11654174355526.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/UltraTech_Cement_1654174938690_1654174938831.jpg", "publishedAt": "2022-06-02T13:03:13Z", "content": "Leading cement manufacturer UltraTech Cement Ltd on Thursday said its board had approved an investment of 12,886 crore to add 22.6 MTPA (Million Tonnes Per Annum) capacity in its total production, wi… [+2516 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "Dividend stocks to watch: These 11 stocks shall turn ex-dividend next week | Mint - Mint", "description": "Shareholders of Faze Three, Aurobindo Pharma, INEOS Styrolution India, Pearl Global Industries, India Motor Parts and Accessories, Kansai Nerolac Paints, Welspun Corp, Craftsman Automation, Elecon Engineering Company, Asian Paints and Shree Digvijay Cement Co…", "url": "https://www.livemint.com/market/stock-market-news/dividend-stocks-to-watch-these-11-stocks-shall-turn-ex-dividend-next-week-11654173103142.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/stock-kpeE--621x414@LiveMint_1654173121280.jpg", "publishedAt": "2022-06-02T12:40:07Z", "content": "The following 11 stocks will go ex-dividend next week, implying that these stocks will trade without the price of the upcoming dividend or declared dividend amount for the current financial year on t… [+8121 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Siddharth Upasani", "title": "CBDCs could 'kill' case for private cryptocurrencies, says RBI Deputy Governor - Moneycontrol", "description": "The Indian central bank's latest salvo against private cryptocurrencies comes ahead of the release of the government's consultation paper on crypto.", "url": "https://www.moneycontrol.com/news/business/economy/cbdcs-could-kill-case-for-private-cryptocurrencies-says-rbi-deputy-governor-8632181.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/RBI-770x433.png", "publishedAt": "2022-06-02T12:10:27Z", "content": "Central Bank Digital Currencies (CBDC) could 'kill' the reasons for the existence of private cryptocurrencies, Reserve Bank of India (RBI) Deputy Governor T Rabi Sankar has said.\r\n\"We (RBI) believe t… [+2590 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Paarth Khatri", "title": "Tata Motors beats Hyundai to become India’s 2nd leading car market behind Maruti Suzuki - CarToq.com", "description": "Dispatch numbers for the month of May have been released by the automobile manufacturers. The date reveals that homegrown manufacturer, Tata Motors dispatched more number of vehicles than Hyundai. So, they were able to take the second spot from Hyundai and no…", "url": "https://www.cartoq.com/tata-motors-beats-hyundai-to-become-indias-2nd-leading-car-market-behind-maruti-suzuki/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/06/tata-beats-hyudai-in-may-featured.jpg", "publishedAt": "2022-06-02T12:08:41Z", "content": "Dispatch numbers for the month of May have been released by the automobile manufacturers. The date reveals that homegrown manufacturer, Tata Motors dispatched more number of vehicles than Hyundai. So… [+3018 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Swiggy Rolls Out Three New Benefits For Swiggy One Subscribers. Details Here | Mint - Mint", "description": "Under the program, users will be able to enjoy benefits like unlimited free deliveries on food delivery from ALL restaurants as far as 10 kms, and for orders starting at  ₹149 only.", "url": "https://www.livemint.com/companies/news/swiggy-rolls-out-three-new-benefits-for-swiggy-one-subscribers-details-here-11654170667955.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/swiggy-k8WH--621x414@LiveMint_1654170854420.jpg", "publishedAt": "2022-06-02T11:56:42Z", "content": "Swiggy on Thursday rolled out three new benefits to its users subscribing to Swiggy One membership programme. Under the program, users will be able to enjoy benefits like unlimited free deliveries on… [+2061 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Booze in 10 Minutes? Move Over Groceries, Kolkata to Have Liquor Delivered in a Flash - News18", "description": "The brand, Booozie, has claimed itself as India’s first 10-minute liquor delivery platform.", "url": "https://www.news18.com/news/buzz/booze-in-10-minutes-move-over-groceries-kolkata-to-have-liquor-delivered-in-a-flash-5298817.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/alcohol-165417018816x9.jpg", "publishedAt": "2022-06-02T11:50:09Z", "content": "There are several companies that offer online liquor delivery services. However, this new Hyderabad-based startup has brought in some good news for alcohol lovers in Kolkata. Booozie, the flagship br… [+2098 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Now", "title": "Sandip Sabharwal on why you should be cautious in IT, play reopening theme - Economic Times", "description": "“Most of the Indian technology companies are business to business companies.  B2B companies feel this after a lag of three to six months. It is a no-brainer that if interest rates are going to go up as sharply as they are predicted in the US, combined with mo…", "url": "https://economictimes.indiatimes.com/markets/expert-view/sandip-sabharwal-on-why-you-should-be-cautious-in-it-play-reopening-theme/articleshow/91964585.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91964531,width-1070,height-580,imgsize-54158,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-02T11:49:00Z", "content": "Investors should stay away from paints sector at least for the next one year. Maybe they will get better entry opportunities but given the valuations and earning growth outlook, I do not see any retu… [+4520 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "MG Astor SUV prices hiked by up to ₹40,000 on select variants - HT Auto", "description": "MG Motor had launched the Astor SUV, which offers segment-first ADAS features, at a starting price of ₹9.78 lakh (ex-showroom) back in October last year.", "url": "https://auto.hindustantimes.com/auto/cars/mg-astor-suv-prices-hiked-by-up-to-rs-40-000-on-select-variants-41654164409872.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/06/02/600x338/MG_Astor_1633435179386_1654164510737.jpeg", "publishedAt": "2022-06-02T10:36:37Z", "content": "MG Motor has hiked the price of its flagship compact SUV Astor within a year of its launch. The Astor SUV, which boasts about being the first SUV in its segment to offer Artificial Intelligence and A… [+2186 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Aparna Deb", "title": "Adani Wilmar Shares Surge 5% After 3 Sessions; What is Fueling the Stock Rally? - News18", "description": "Adani Wilmar share prices on BSE and NSE rose nearly five per cent on Thursday after trading in the red zone for the past three days. Why is the stock rising?", "url": "https://www.news18.com/news/business/markets/adani-wilmar-shares-surge-5-after-3-sessions-what-is-fueling-the-stock-rally-5297719.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/adani-165148901016x9.jpg", "publishedAt": "2022-06-02T10:12:20Z", "content": "Adani Wilmar share prices on BSE and NSE rose nearly five per cent on Thursday after trading in the red zone for the past three days. A lot of buying was seen after an Edellwiess report said that AMF… [+2983 chars]"}, {"source": {"id": null, "name": "GaadiWaadi.com"}, "author": "Kshitij Rawat", "title": "Upcoming Mahindra Scorpio-N Could Set New Records For Waiting Period - GaadiWaadi.com", "description": "The upcoming Mahindra Scorpio-N will launch later this month, and like Thar and XUV700, we expect it to have a long official waiting period", "url": "https://gaadiwaadi.com/upcoming-mahindra-scorpio-n-could-set-new-records-for-waiting-period/", "urlToImage": "https://gaadiwaadi.com/wp-content/uploads/2022/05/2022-mahindra-scorpio-n-3.jpg", "publishedAt": "2022-06-02T10:00:09Z", "content": "The next-generation Mahindra Scorpio – christened Scorpio-N – is scheduled to launch in India on June 27. The new SUV will be a lot more upmarket than the current-gen model, and it has already manage… [+2149 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Hyundai Venue facelift leaks on official website - Team-BHP", "description": "Hyundai is gearing up to launch the Venue facelift later this month. The car has already been listed on the brand’s official website. While the page contains a teaser video and digital renderings of the updated Venue, the thumbnail used is of the actual car. …", "url": "https://www.team-bhp.com/news/hyundai-venue-facelift-leaks-official-website", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Screenshot 2022-06-02 at 12.49.18 PM.png", "publishedAt": "2022-06-02T09:38:58Z", "content": "Hyundai is gearing up to launch the Venue facelift later this month. The car has already been listed on the brands official website. While the page contains a teaser video and digital renderings of t… [+1022 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vipul Das", "title": "2 bonus shares and 1 stock split to watch next week | Mint - Mint", "description": "The shareholders of Varun Beverages and NINtec SYSTEMS should watch the stocks next week as both scripts are going to turn ex-bonus while G G Engineering shareholders should be aware of a stock split that will take place next week.", "url": "https://www.livemint.com/market/stock-market-news/2-bonus-shares-and-1-stock-split-to-watch-next-week-11654159831856.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/ANI-20210908067-0_1631267094546_1654159852234.jpg", "publishedAt": "2022-06-02T08:54:20Z", "content": "The shareholders of Varun Beverages and NINtec SYSTEMS should watch the stocks next week as both scripts are going to turn ex-bonus while G G Engineering shareholders should be aware of a stock split… [+2857 chars]"}, {"source": {"id": null, "name": "Ambcrypto.com"}, "author": "Anjali Sriniwasan", "title": "ChangeNOW all set to support LUNA 2.0 and LUNC - AMBCrypto News", "description": "Instant crypto exchange service ChangeNOW allows for swapping LUNA – the coin of the new Terra 2.0 blockchain, as well as LUNC, the old mainnet’s token. As UST and the original version of LUNA crashed this May, the crypto industry was looking forward to a sol…", "url": "https://ambcrypto.com/changenow-all-set-to-support-luna-2-0-and-lunc/", "urlToImage": "https://files.ambcrypto.com/wp-content/uploads/2022/06/02134702/mike-petrucci-uIf6H1or1nE-unsplash-1000x600.jpg", "publishedAt": "2022-06-02T08:46:33Z", "content": "Instant crypto exchange service ChangeNOW allows for swapping LUNA the coin of the new Terra 2.0 blockchain, as well as LUNC, the old mainnets token.\r\nAs UST and the original version of LUNA crashed … [+2779 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "How are mutual funds reacting to the gigantic merger of HDFC-HDFC Bank? - Economic Times", "description": "The HDFC merger would boost the profitability of the merged entity. Overall, the transformational merger of these two companies is expected to leverage each other’s competitive strengths. After the merger announcement, share price of HDFC Bank rose 10% and th…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/how-are-mutual-funds-reacting-to-the-gigantic-merger-of-hdfc-hdfc-bank/articleshow/91959519.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91959713,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-02T08:26:00Z", "content": "SynopsisThe HDFC merger would boost the profitability of the merged entity. Overall, the transformational merger of these two companies is expected to leverage each other’s competitive strengths. Aft… [+140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "Sheryl Sandberg stepping down from Facebook parent company Meta - The Indian Express", "description": "In a Facebook post Wednesday, Mark Zuckerberg praised Sandberg, saying it was “unusual for a business partnership like ours to last so long.”", "url": "https://indianexpress.com/article/technology/sheryl-sandberg-quits-facebook-meta-7948363/", "urlToImage": "https://images.indianexpress.com/2022/06/Sheryl-Sandberg.jpg", "publishedAt": "2022-06-02T07:28:41Z", "content": "When Mark Zuckerberg, the founder of Facebook, recruited a Google executive named Sheryl Sandberg to his social network in 2008, he said he had hired her because she has just about the most relevant … [+1897 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Why ExpressVPN has removed its servers from India, and what happens to users now - The Indian Express", "description": "ExpressVPN has removed its servers from India over the country's new cybersecurity rules. What has the company said? What do the new rules entail? What happens to Indian users of ExpressVPN now?", "url": "https://indianexpress.com/article/explained/expressvpn-services-india-new-vpn-rules-explained-7948845/", "urlToImage": "https://images.indianexpress.com/2022/06/VPN.jpg", "publishedAt": "2022-06-02T07:24:49Z", "content": "ExpressVPN has removed its servers from India, becoming the first major virtual private network (VPN) provider to do so in the aftermath of the recent cybersecurity rules introduced by the countrys c… [+2635 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Puneet Wadhwa", "title": "Life Insurance Corporation: This elephant cant dance, says Emkay Global - Business Standard", "description": "Emkay Global Financial Services a leading domestic brokerage has initiated coverage on the stock with a hold rating with a target price of Rs 875", "url": "https://www.business-standard.com/article/markets/life-insurance-corporation-this-elephant-can-t-dance-says-emkay-global-122060200462_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/09/full/1652089718-1674.jpg", "publishedAt": "2022-06-02T07:16:00Z", "content": "Life Insurance Corporation (LIC) stock made a tepid listing at the bourses in May. Since then, the stock of India's biggest life insurer has been unable to come up to the IPO price of Rs 949. Emkay G… [+4325 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prachi Ahluwalia", "title": "Kia EV6 launched in India at Rs 59.95 lakh: Price, features and specifications - Times of India", "description": "Cars News: Kia India has finally launched its much-anticipated EV6 electric crossover in India at a starting price of Rs 59.95 lakh (ex-showroom). The top-spec G", "url": "https://timesofindia.indiatimes.com/auto/cars/kia-ev6-launched-in-india-at-rs-59-95-lakh-price-features-and-specifications/articleshow/91958026.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91957965,width-1070,height-580,imgsize-59992,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-02T07:12:00Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Auto earnings vroom to March quarter rebound despite speedbumps from chip carnage, input inflation - Moneycontrol", "description": "Analysts expect margin pressure to continue", "url": "https://www.moneycontrol.com/news/business/stocks/auto-earnings-vroom-to-march-quarter-rebound-despite-speedbumps-from-chip-carnage-input-inflation-8627071.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Auto_shutterstock_1750742807-770x433.jpg", "publishedAt": "2022-06-02T06:23:01Z", "content": "Net sales and net profit of top nine auto companies rose seven and 32 percent year on year respectively in the March quarter despite a rise in commodity prices, shortage of chips, and muted demand in… [+2421 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Credit Suisse initiates coverage on Delhivery with 'outperform'; CLSA bullish on Lemon Tree - Economic Times", "description": "On JSW Steel, this brokerage believes that the stock trades at an expensive valuation despite the recent correction. It values the scrip at 6.5 times FY24 Ebitda to arrive at a target of Rs 425. The brokerage has lowered its FY23 and FY24 Ebitda estimates to …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/credit-suisse-initiates-coverage-on-delhivery-with-outperform-clsa-bullish-on-lemon-tree/articleshow/91956277.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91956266,width-1070,height-580,imgsize-163702,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-02T05:56:00Z", "content": "Credit Suisse (CS) has initiated coverage on Delhivery with an 'outperform' rating due to favourable industry structure and structural growth in e-commerce volumes. The same brokerage has maintained … [+2341 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kshitij Anand", "title": "Chart Check: This heavy electrical equipment maker hits fresh 52-week high; rallies over 40% in a year - Economic Times", "description": "ABB India has rallied nearly 11 per cent in a week, and more than 17 per cent in a month, Trendlyne data showed.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/chart-check-this-heavy-electrical-equipment-maker-hits-fresh-52-week-high-rallies-over-40-in-a-year/articleshow/91955696.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91955808,width-1070,height-580,imgsize-126472,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-02T05:50:00Z", "content": "ABB India Ltd, part of capital goods industry, rose over 40 per cent in a year compared to over 6 per cent rise seen in Nifty50 in the same period, and the rally is not over yet.\r\nThe heavy electrica… [+1949 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Auto Desk", "title": "Ather Energy records highest-ever sales in May 2022 - HT Auto", "description": "Ather Energy has managed to record its highest-ever monthly sales of 3,787 units in the month of May'22.", "url": "https://auto.hindustantimes.com/auto/two-wheelers/ather-energy-records-highest-ever-sales-in-may-2022-41654144595859.html", "urlToImage": "https://images.hindustantimes.com/auto/img/2022/06/02/600x338/Ather_450X_2_1640926183300_1654146615201.jpg", "publishedAt": "2022-06-02T05:33:04Z", "content": "Ather Energy has recently announced that it has managed to record its highest-ever monthly sales of 3,787 units in the month of May'22. The company has managed to grow at a steady pace in the market.… [+1499 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Tesla joins list of companies mandating offline work | Elon Musk | World Business Watch | WION - WION", "description": "Elon Musk, the Tesla chief executive has asked employees to return to office or leave the company, according to a memo sent to staff that has been circulatin...", "url": "https://www.youtube.com/watch?v=gY8nliaWQAU", "urlToImage": "https://i.ytimg.com/vi/gY8nliaWQAU/maxresdefault.jpg", "publishedAt": "2022-06-02T05:32:54Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sneha Kulkarni", "title": "Indian Bank hikes FD interest rates: Check latest rates - Economic Times", "description": "Indian Bank has hiked interest rates on fixed deposits for an amount below Rs 2 crore with effect from June 1, 2022.", "url": "https://economictimes.indiatimes.com/wealth/save/indian-bank-hikes-fd-interest-rates-check-latest-rates/articleshow/91955358.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91956347,width-1070,height-580,imgsize-230481,overlay-etwealth/photo.jpg", "publishedAt": "2022-06-02T05:20:00Z", "content": "has hiked interest rates on fixed deposits for an amount below Rs 2 crore with effect from June 1, 2022.\r\nThe bank has increased the interest rates on select tenors. The interest rate from 30 days to… [+1692 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Aayush Khanna/Investing.com - Investing.com", "title": "Hero MotoCorp Breaks Above Long Term Trendline; Look at this Trend Change! - Investing.com India", "description": "Hero MotoCorp Breaks Above Long Term Trendline; Look at this Trend Change!", "url": "https://in.investing.com/analysis/hero-motocorp-breaks-above-long-term-trendline-look-at-this-trend-change-200523234", "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investingcom_analysis_og.jpg", "publishedAt": "2022-06-02T04:34:03Z", "content": "Auto sales numbers from various manufacturers for May 2022 were out on Wednesday. The countrys largest two-wheeler maker, Hero MotoCorp (NS:\r\nHROM\r\n) reported a total sales of 4,86,704 units in the p… [+2474 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CONTRIBUTORS", "title": "View: There is more to India's inflation problem than meets the eye - Economic Times", "description": "CPI inflation is expected to touch 6.3% average this fiscal from 5.5% in the last. Given this, the Reserve Bank of India is expected to raise the policy repo rate by another 75-100 basis points (bps), taking the cumulative rate hike for the year to 115-140 bp…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/view-there-is-more-to-indias-inflation-problem-than-meets-the-eye/articleshow/91954037.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91954093,width-1070,height-580,imgsize-94272,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-02T04:17:00Z", "content": "A and broad-based increase in prices is the biggest headwind consumers are facing today. The other worry is a concomitant increase in interest rates. \r\nConsumer price index (CPI) inflation is expecte… [+5305 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Delhivery CEO navigates market meltdown in ‘nerve-wracking’ IPO - Economic Times", "description": "“Technology stocks had corrected more than 20% in the period between filing our initial draft documents to our IPO so we modified our pricing,” Barua said. “We decided wed rather have modestly-priced shares which rise rather than tumble on listing.”", "url": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-ceo-navigates-market-meltdown-in-nerve-wracking-ipo/articleshow/91954041.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91954005,width-1070,height-580,imgsize-67760,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-02T04:12:00Z", "content": "Sahil Barua, chief executive officer of logistics startup Delhivery Ltd., minces no words about the process of going public in whats shaping up to be an historic meltdown in the technology industry.\r… [+3992 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Hiral Thanawala", "title": "As private sector bank rates on three year FDs for senior citizens go as high as 7.1%, is it time to... - Moneycontrol", "description": "FDs offer liquidity and ensure interest income periodically", "url": "https://www.moneycontrol.com/news/photosbusiness/personal-finance/how-rbis-rate-hike-has-pushed-private-bank-interests-on-three-year-fds-for-senior-citizens-to-as-high-as-7-1-8624861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/inr_rupee_indian-rupee-770x433.jpg", "publishedAt": "2022-06-02T04:07:21Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Five firms together log Rs 12K cr in Q4 losses. Analysts positive on three of them - Economic Times", "description": "Net-net analysts have positive views on Sun Pharma, Tata Motors and InterGlobe Aviation, neutral to negative views on Vodafone Idea and no view on New India Assurance Company.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/five-firms-together-log-rs-12k-cr-in-q4-losses-analysts-ve-on-3-of-them/articleshow/91953002.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91953609,width-1070,height-580,imgsize-55576,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-02T03:47:00Z", "content": "NEW DELHI: Five BSE500 companies, namely , , , and , reported a combined loss of over Rs 12,000 crore in March quarter.\r\nAmong them, \r\n's numbers were a surprise loss due to one-off provision while I… [+4591 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Aether Industries Ipo: What Gmp Signals Ahead Of Shares Listing | Mint - Mint", "description": "Aether Industries IPO's price range was at  ₹610-642 per share", "url": "https://www.livemint.com/market/ipo/aether-industries-ipo-what-gmp-grey-market-premium-signals-ahead-of-shares-listing-11654140245587.html", "urlToImage": "https://images.livemint.com/img/2022/06/02/600x338/aether_industries_ipo_1654140329895_1654140330047.jpg", "publishedAt": "2022-06-02T03:36:40Z", "content": "Speciality chemicals company Aether Industries' three day initial public offer (IPO) was subscribed 6.26 times on the final day of its subscription, helped by a strong interest from institutional buy… [+1705 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Bata India's promoter sells company shares worth Rs 613 crore - Moneycontrol", "description": "The shares were picked by a clutch of domestic mutual funds (MFs), foreign investors and an insurance company.", "url": "https://www.moneycontrol.com/news/business/bata-indias-promoter-sells-company-shares-worth-rs-613-crore-8624721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/04/Bata_india_kolkata-770x428.jpg", "publishedAt": "2022-06-02T03:00:01Z", "content": "BATA B V, the promoter of Bata India, on Wednesday divested 2.56 per cent stake of the footwear company for nearly Rs 613 crore through open market transactions.\r\nThe shares were picked by a clutch o… [+937 chars]"}, {"source": {"id": null, "name": "Zee Business"}, "author": "Ravi Kant Kumar", "title": "Stocks to buy today: List of 20 stocks for intraday, short-term, positional and long-term investments on June 2 - Zee Business", "description": "Even as domestic equity benchmarks Nifty50 and Sensex closed negative for the second consecutive session on Wednesday, the cues from Asian and global markets were negative on Thursday.", "url": "https://www.zeebiz.com/market-news/news-stocks-to-buy-today-list-of-20-stocks-for-intraday-short-term-positional-and-long-term-investments-on-june-2-186136", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2022/06/02/184590-pixabya-stocks.jpg", "publishedAt": "2022-06-02T02:51:39Z", "content": "Even as domestic equity benchmarks Nifty50 and Sensex closed negative for the second consecutive session on Wednesday, the cues from Asian and global markets were negative on Thursday. Indicating yet… [+2389 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "RBI to go fast with rate hikes this year, slow the next: Poll - Moneycontrol", "description": "Following a surprise rate rise on May 4, several members of the Monetary Policy Committee called for more in upcoming meetings this year to control sticky price pressures, which hit an eight-year high last month.", "url": "https://www.moneycontrol.com/news/business/economy/rbi-to-go-fast-with-rate-hikes-this-year-slow-the-next-poll-8624651.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/RBI-770x433.png", "publishedAt": "2022-06-02T02:23:30Z", "content": "The Reserve Bank of India will concentrate interest rate hikes over the coming months in a relatively short tightening cycle, according to a Reuters poll of economists who expect the repo rate to rea… [+3139 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Petrol, Diesel Prices Drop in Delhi, Mumbai Post Excise Duty Cut: Check Fuel Rates Today - News18", "description": "Petrol Prices on Thursday: In Mumbai, one litre of petrol costs Rs 111.35 while diesel is retailing at Rs 97.28 per litre.", "url": "https://www.news18.com/news/business/petrol-diesel-prices-drop-in-delhi-mumbai-post-excise-duty-cut-check-fuel-rates-today-5292949.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-2022-05-21t221445.374-165315164116x9.jpg", "publishedAt": "2022-06-02T02:08:25Z", "content": "Petrol, Diesel Prices on Thursday: The prices of petrol and diesel remained unchanged for the 13th consecutive day. Petrol price in Delhi today stands at Rs 96.72 a litre as against Rs 105.41 a litre… [+2881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Streamlining ops: Air India offers VRS, 3K staff eligible - The Indian Express", "description": "Additionally, for some cabin crew, clerical and unskilled staffers, the VRS eligibility age has been relaxed from 55 years to 40 years.", "url": "https://indianexpress.com/article/business/aviation/streamlining-ops-air-india-vrs-3k-staff-eligible-7948215/", "urlToImage": "https://images.indianexpress.com/2022/06/air-india-express-photo-1200-1-1.jpg", "publishedAt": "2022-06-02T01:04:51Z", "content": "In an attempt to bring in efficiency in its functioning, Tata Group-owned Air India has announced a voluntary retirement scheme (VRS) for permanent employees, who have completed 55 years of age or 20… [+2796 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anuradha Shukla", "title": "Centre may invite fresh bids for CEL after charges of rigging - Economic Times", "description": "The Centre had approved the sale of CEL in November last year to Nandal Leasing and Finance Ltd for ₹210 crore. The transaction was scheduled to be completed by March.", "url": "https://economictimes.indiatimes.com/news/economy/finance/centre-may-invite-fresh-bids-for-cel-after-charges-of-rigging/articleshow/91950761.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91950767,width-1070,height-580,imgsize-20444,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-01T23:19:00Z", "content": "The Centre is in favour of inviting fresh bids for the divestment of state-owned Central Electronics Ltd (CEL) following discussions with the law ministry, said people with knowledge of the matter. A… [+2999 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Swaraj Singh Dhanjal", "title": "LIC confident about cleaning up bad debt investments: MD | Mint - Mint", "description": "Value of LIC’s loss-making investments has to reflect in its income statement by 31 Jan 2023", "url": "https://www.livemint.com/companies/news/lic-confident-about-cleaning-up-bad-debt-investments-md-11654111454238.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/lic_1654111671375_1654111684762.jpg", "publishedAt": "2022-06-01T19:34:27Z", "content": "MUMBAI : Ahead of its initial public offering Life Insurance Corp. (LIC) of India had said that it had mark-to-market losses of 6,028 crore on its books relating to debt investments in certain pensio… [+2690 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Jitendra Salvi", "title": "Pansari Develop Standalone March 2022 Net Sales at Rs 8.62 crore, up 44.7% Y-o-Y - Moneycontrol", "description": "", "url": "https://www.moneycontrol.com/news/business/earnings/pansari-develop-standalone-march-2022-net-sales-at-rs-8-62-crore-up-44-7-y-o-y-8624011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/04/shutterstock_310523045-462x435.jpg", "publishedAt": "2022-06-01T17:50:10Z", "content": "Reported Standalone quarterly numbers for Pansari Developers are:Net Sales at Rs 8.62 crore in March 2022 up 44.7% from Rs. 5.96 crore in March 2021.\r\nQuarterly Net Profit at Rs. 0.31 crore in March … [+386 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Hero MotoCorp postpones EV launch plan due to supply constraints - Moneycontrol", "description": "The company has decided to unveil its first EV product around the upcoming festive period instead of July as earlier announced.", "url": "https://www.moneycontrol.com/news/automobile/hero-motocorp-postpones-ev-launch-plan-due-to-supply-constraints-8623141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/07/Hero-MotoCorp-rep-img-770x433.jpg", "publishedAt": "2022-06-01T16:38:40Z", "content": "Hero Motocorp on June 1 said that it has deferred the upcoming launch of its first electric two-wheeler, as the ongoing geopolitical tensions have led to supply constraints.\r\nThe automobile major had… [+2147 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Decoding GDP data for 2021-22: takeaways, headwinds & the silver lining for indian economy - ThePrint", "description": "The GDP data for 2021-22 released Tuesday showed that India is still the fastest growing economy in the world with the GDP growing at 8.7%. but going forward...", "url": "https://www.youtube.com/watch?v=I6J6dABVzL4", "urlToImage": "https://i.ytimg.com/vi/I6J6dABVzL4/hqdefault.jpg", "publishedAt": "2022-06-01T15:52:29Z", "content": null}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "Vishwanath Nair", "title": "Yes Bank Close To Signing Deal With JC Flowers To Sell Pool Of Stressed Assets — Exclusive - BQ Prime", "description": "Yes Bank likely to sign Rs 48,000 crore stressed assets deal with JC Flowers.", "url": "https://www.bqprime.com/business/yes-bank-close-to-signing-deal-with-jc-flowers-to-sell-pool-of-stressed-assets-exclusive", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2020-03%2F00922002-369b-4655-8de7-1cee67ca8d84%2Fyes.jpg?rect=0%2C0%2C1280%2C672&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-01T14:09:22Z", "content": "Private lender Yes Bank Ltd. is nearing a deal to sell a pool of Rs 48,000 crore in stressed assets to the U.S.-based JC Flowers &amp; Co., according to a person directly in the know. \r\nThe bank will… [+2360 chars]"}, {"source": {"id": null, "name": "Carwale.com"}, "author": "Aditya Nadkarni", "title": "Kia India records a sale of 18,718 units in May 2022 - CarWale", "description": "Kia India has crossed the 4.5 lakh unit domestic sales milestone. Sonet alone has accounted for a sale of 1.50 lakh units.", "url": "https://www.carwale.com/news/kia-india-records-a-sale-of-18718-units-in-may-2022/", "urlToImage": "https://imgd.aeplcdn.com/642x336/n/cw/ec/123263/right-front-three-quarter0.jpeg?isig=0&art=1&q=75", "publishedAt": "2022-06-01T13:54:45Z", "content": "- Kia India has crossed the 4.5 lakh unit domestic sales milestone\r\n- Sonet alone has accounted for a sale of 1.50 lakh units\r\nKia India has registered a sale of 18,718 units in May 2022. The Sonet h… [+1329 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "Sesa Sen", "title": "Smaller Staples To Soap Makers Exit As Rural Slump, Input Costs Hurt: NielsenIQ - BQ Prime", "description": "There has been a 5.3% increase in the exit of small manufacturers, according to NielsenIQ data", "url": "https://www.bqprime.com/business/smaller-staples-to-soap-makers-exit-as-rural-slump-input-costs-hurt-nielseniq", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2022-05%2Faeb76000-df70-4946-a178-673e4c6fd4b7%2Frohan_verma_Ftejqt7xHDw_unsplash.jpg?rect=0%2C143%2C1844%2C968&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-01T13:00:18Z", "content": "The north and south parts of India saw a steeper volume contraction of 5.4% and 5%, respectively. Volumes fell 2% in the west and 3% in the east.\r\nPrice hikes caused a slowdown in the hinterland.\r\nRu… [+842 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "Day Trading Guide: Grasim Industries among 4 stocks that analysts recommend for Thursday - Stock Ideas - Economic Times", "description": "The Nifty50 opened slightly gapped up, but in the second half, it gave up all gains and at the end we saw some nice recovery and closed near 16,522 mark. 16,400 puts and 16,700 calls have seen a fair amount of option writing. Nifty current week trading range …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/day-trading-guide-grasim-industries-among-4-stocks-that-analysts-recommend-for-thursday/stock-ideas/slideshow/91944549.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91944549,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2022-06-01T12:58:00Z", "content": "Buy at Rs 316.45Stop Loss: Rs 299Target: Rs 350The stock has given a falling trendline breakout on the daily chart. Besides, the stock has moved above its recent consolidation on the daily timeframe.… [+425 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India's petrol and diesel sales soar in May on summer travel - Economic Times", "description": "Petrol sales by state-owned fuel retailers, which control roughly 90 per cent of the market, at 2.8 million tonnes in May was 55.7 per cent higher than the same period last year. Diesel, the most-used fuel in the country, saw sales jumping 39.4 per cent year-…", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/indias-petrol-and-diesel-sales-soar-in-may-on-summer-travel/articleshow/91939966.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91940094,width-1070,height-580,imgsize-104462,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-01T10:00:00Z", "content": "India's petrol and diesel sales soared in May on the back of a surge in summer travel to escape from the heat and vacation during annual breaks at educational institutions, preliminary industry data … [+2235 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "In ‘golden age’ of margins, Indian private refiners profit - Al Jazeera English", "description": "Indian private refiners like Reliance, Nayara have been among the biggest buyers this year of discounted Russian crude.", "url": "https://www.aljazeera.com/economy/2022/6/1/in-golden-age-of-refining-margins-indian-pvt-refiners-profit", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/05/AP22150334162761.jpg?resize=1200%2C630", "publishedAt": "2022-06-01T09:39:59Z", "content": "A split is emerging in Indias refining sector as private refiners tap cheap Russian crude and boost profits from exports just as domestically focused state refiners get squeezed by high oil costs and… [+4441 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Record green energy output helps India ease coal shortage in May - Economic Times", "description": "The share of renewable energy sources in power output rose to 14.1% in May from 10.2% in April. Coal made room for it, dropping to 72.4% of Indian generation from 76.8%. However, coal's share was still higher than its 70.9% of May 2021.", "url": "https://economictimes.indiatimes.com/industry/renewables/record-green-energy-output-helps-india-ease-coal-shortage-in-may/articleshow/91937902.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91937991,width-1070,height-580,imgsize-135444,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-01T08:34:00Z", "content": "Record green energy output reduced Indian dependence on coal in May, despite 23.5% growth in power demand, contributing to a rise in utilities' coal inventories, a Reuters analysis of government data… [+2552 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Surat airport is gearing up for a makeover. Here are the details - Economic Times", "description": "Surat, Gujarat's financial capital and India's diamond and textile commercial centre, attracts a significant number of air travellers. Airports Authority of India (AAI) is working intensively to develop the airport holistically at a cost of Rs 353 Crores, in …", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/surat-airport-is-gearing-up-for-a-makeover-here-are-the-details/articleshow/91937275.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91937273,width-1070,height-580,imgsize-79734,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-01T08:09:00Z", "content": "The airport in India's diamond hub, Surat, is all set for a makeover with the Airport Authority of India developing it at a cost of Rs 353 crore.\r\nSurat Airport serves a vast number of businesses aro… [+972 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Indian fintech Slice tops $1.5 billion valuation in new funding to scale UPI payments - TechCrunch", "description": "Slice, a fintech startup that is bringing credit card features to millions of Indians, has raised $50 million in a new financing round led by Tiger Global.", "url": "https://techcrunch.com/2022/06/01/indian-fintech-slice-tops-1-5-billion-valuation-in-new-funding-to-scale-upi-payments/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/06/rajan-slice.jpg?w=599", "publishedAt": "2022-06-01T07:33:51Z", "content": "Slice, a fintech startup that is bringing credit card features to millions of Indians, has raised $50 million in a new financing round as it looks to scale its recently launched UPI payments product … [+3201 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Anubhav Sahu", "title": "Aarti Industries: Multi-year contract opportunity intact - Moneycontrol", "description": "The third multi-year contract and the NCB (Nitro Chloro Benzene) capacity expansion project for Aarti Industries are expected to get completed in FY23", "url": "https://www.moneycontrol.com/news/business/moneycontrol-research/aarti-industries-multi-year-contract-opportunity-intact-8618761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/shutterstock_79142404-770x433.jpg", "publishedAt": "2022-06-01T07:03:01Z", "content": "Moneycontrol Pro Panorama | Boom time for real estate, but is a bubble building?\r\n Jun 1, 2022 / 05:38 PM IST\r\nIn todays edition of Moneycontrol Pro Panorama: Coal Indias halo, IRCTC ready to go full… [+81 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "eMudhra shares rally 9% on debut but remains volatile. What should you do with the stock? - Moneycontrol", "description": "Allotted investors can choose holding this company for long-term perspective despite short-term volatility which can't be ruled out while non-allotted investors may also look to accumulate, Prashanth Tapse of Mehta Equities said.", "url": "https://www.moneycontrol.com/news/business/ipo/emudhra-shares-rally-9-on-debut-but-remains-volatile-what-should-you-do-with-the-stock-8618801.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/sensex_nifty_sensex_market-5-770x430-770x431.jpg", "publishedAt": "2022-06-01T06:58:14Z", "content": "Leading licenced Certifying Authority eMudhra is a long-term investment, given its unique business model, the market leadership position in the Indian Digital Trust Services space, better brand recog… [+3435 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shariq Khan", "title": "From Tirupur to Panipat, soaring cotton prices are searing India’s textile exporters and mills - Economic Times", "description": "High cotton prices are plaguing textile firms, and many mills are being forced to shut operations. This situation could have been avoided with some corrective measures.", "url": "https://economictimes.indiatimes.com/small-biz/sme-sector/from-tirupur-to-panipat-soaring-cotton-prices-are-searing-indias-textile-exporters-and-mills/articleshow/91932307.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91932344,width-1070,height-580/photo.jpg", "publishedAt": "2022-06-01T05:04:00Z", "content": "To read full story, subscribe to ET Prime\r\nGet Unlimited Access to The Economic Times\r\n 34 per week\r\nBilled annually at \r\n 2499\r\n 1749\r\nContinueAlready a Member? Sign In now\r\nSuper Saver Sale - Flat … [+45 chars]"}, {"source": {"id": null, "name": "Goodreturns.in"}, "author": "Sunil Fernandes", "title": "12 High Quality Stocks That Are Near 52-week Lows, Should You Buy? - Goodreturns", "description": "Markets have recovered a tad bit, over the last 1-week, but, still remain substantially lower than 52-week highs. In the process, there are several stocks that are trading near 52-week lows. Take a look at some such stocks.", "url": "https://www.goodreturns.in/personal-finance/investment/12-high-quality-stocks-that-are-near-52-week-lows-should-you-buy-1251093.html", "urlToImage": "https://www.goodreturns.in/img/2015/10/29-1446100985-stockmarketsfalling4.jpg", "publishedAt": "2022-06-01T03:31:58Z", "content": "<table><tr><th>Name of company</th><th>52-week low</th><th>Current market price</th></tr><tr><td>Lux Industries</td><td>1972</td><td>2006.25</td></tr><tr><td>Just Dial</td><td>644.55</td><td>661</td>… [+2758 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol PF Team", "title": "Eight important money matters that need your attention this June - Moneycontrol", "description": "From higher home loan interest rates and third-party motor premiums to charges introduced for EMI purchases using credit cards and Aadhaar-enabled payments, many operational changes start in June", "url": "https://www.moneycontrol.com/news/business/personal-finance/eight-important-money-matters-that-need-your-attention-this-june-8615581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Event-calendar-770x433.jpg", "publishedAt": "2022-06-01T02:55:07Z", "content": "Interest rates on home and auto loans will rise after the Reserve Bank of India (RBI) increased the repo rate in May. Some banks had announced rate hikes immediately after the RBIs decision, while se… [+4245 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "BREAKING: LPG cylinder prices June 1, 2022: Cooking gas prices slashed, check out how much you need to pay... - Zee News", "description": "Bringing the much needed relief, the Oil Marketing companies on Wednesday, 1 June 2022, announced to reduce the prices of the 19 kg commercial cylinder. From today, the 19 kg commercial cylinder will be cheaper by Rs 135 cheaper.", "url": "https://zeenews.india.com/economy/breaking-lpg-cylinder-prices-june-1-2022-cooking-gas-prices-slashed-check-out-how-much-you-need-to-pay-for-a-cylinder-2469246.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/01/1048778-lpgas.jpg", "publishedAt": "2022-06-01T01:48:56Z", "content": "New Delhi: Bringing the much needed relief, the Oil Marketing companies on Wednesday, 1 June 2022, announced to reduce the prices of the 19 kg commercial cylinder.\r\nFrom today, the 19 kg commercial c… [+1283 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Stocks to Watch Today | Bharat Dynamics, Bata India, Rail Vikas Nigam and others in news today - Moneycontrol", "description": "Stocks to Watch: Check out the companies making headlines before the opening bell.", "url": "https://www.moneycontrol.com/news/photosbusiness/stocks/stocks-to-watch-today-bharat-dynamics-bata-india-rail-vikas-nigam-and-others-in-news-today-8615571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/BUZZING-STOCKS-770x433.jpg", "publishedAt": "2022-06-01T01:31:49Z", "content": null}]}