{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "30 Years of Hum Aapke Hain Koun: A black ticket seller bought 2 flats by selling Salman Khan-Madhuri Dixit starrer’s tickets in black; Current booking window at Liberty cinema didn’t open for a year as all shows were SOLD OUT in advance - Bollywood Hungama", "description": "30 Years of Hum Aapke Hain Koun: A black ticket seller bought 2 flats by selling Salman Khan-Madhuri Dixit starrer’s tickets in black; Current booking window at Liberty cinema didn’t open for a year as all shows were SOLD OUT in advance Bollywood News: Latest…", "url": "https://www.bollywoodhungama.com/news/features/30-years-hum-aapke-hain-koun-black-ticket-seller-bought-2-flats-selling-salman-khan-madhuri-dixit-starrers-tickets-black-current-booking-window-liberty-cinema-didnt-o/", "urlToImage": "https://stat4.bollywoodhungama.in/wp-content/uploads/2024/08/30-Years-of-Hum-Aapke-Hain-Koun.jpg", "publishedAt": "2024-08-05T05:23:46Z", "content": "One of the greatest films of Indian cinema, Hum Aapke Hain Koun (1994), was released on this very day 30 years ago. Its common knowledge that the film was called a wedding video during the pre-releas… [+2919 chars]"}, {"source": {"id": null, "name": "Bollywood Life"}, "author": "Pooja Darade", "title": "Khatron Ke Khiladi 14: Shilpa Shinde gets eliminated; netizens slam her performance, 'Even her comedy was cri - Bollywood Life", "description": "Shilpa Shinde gets eliminated from Khatron Ke Khiladi 14. Netizens slammed the actress, saying they were not pleased with her task performance.", "url": "https://www.bollywoodlife.com/tv/khatron-ke-khiladi-14-shilpa-shinde-gets-eliminated-netizens-slam-her-performance-even-her-comedy-was-cringe-entertainment-news-2954941/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/2024/08/khatronkekhiladi14-shilpashinde.jpg", "publishedAt": "2024-08-04T18:04:20Z", "content": "A new episode of Khatron Ke Khiladi 14 was released today, and it packed in a lot of drama. Hosted by Rohit Shetty, the stunt-based reality show was filmed in Romania. The contestants this year inclu… [+5072 chars]"}]}