{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "UP Investors Summit 2022 LIVE Updates: Pact Made on Investments Worth Over Rs 80,000 Cr, World is Looking a - News18", "description": "UP Investors Summit 2022 LIVE Updates: A statement from the UP government said the investment in the ceremony will fund at least 805 projects in the micro, small, and medium enterprise sector", "url": "https://www.news18.com/news/india/pm-modi-in-up-live-updates-pm-to-lay-foundation-stone-of-over-1400-projects-top-businessmen-including-adani-anant-ambani-in-attendance-livenews-5301487.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/1024-x-576-20-165424115116x9.jpg", "publishedAt": "2022-06-03T08:28:07Z", "content": "Adani, Kumar Mangalam Birla and other leading industrialists are attending the mega summit organised by the Uttar Pradesh government.The Prime Minister’s Office (PMO) said the projects encompass dive… [+2499 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Country's First Liquid Mirror Telescope Comes Up in Uttarakhand - News18", "description": "The Indian Liquid Mirror Telescope (ILMT) will help in surveying the sky, making it possible to observe several galaxies and other astronomical sources just by staring at the strip of sky that passes overhead.", "url": "https://www.news18.com/news/buzz/countrys-first-liquid-mirror-telescope-comes-up-in-uttarakhand-5303353.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/telescope-165424378616x9.png", "publishedAt": "2022-06-03T08:15:05Z", "content": "The first liquid mirror telescope in the country and the largest in Asia commissioned atop Devasthal, a hill in Uttarakhand will now keep a watch on the overhead sky to identify transient or variable… [+2529 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Tamil Nadu To Isolate International Travelers With Monkeypox Symptoms - India.com", "description": "The Tamil Nadu health department has written to directors of all the international airports in the state to isolate overseas travelers with monkeypox symptoms.", "url": "https://www.india.com/tamil-nadu/tamil-nadu-to-isolate-international-travelers-with-monkeypox-symptoms-5430762/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/05/6d0bc6e2-f4d0-456f-a446-c3b3e1ee1d16.jpg", "publishedAt": "2022-06-03T08:08:25Z", "content": "Chennai: The Tamil Nadu health department has written to directors of all the international airports in the state to isolate overseas travelers with monkeypox symptoms. In a letter to the directors o… [+1154 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tesla Needs To Cut Staff By 10%, \"Pause All Hiring Worldwide\": Elon Musk - NDTV Profit", "description": "Tesla chief executive Elon Musk said he had a \"super bad feeling\" about the economy and that the electric carmaker needed to cut staff by around 10%, according to an internal email seen by Reuters.", "url": "https://www.ndtv.com/business/tesla-needs-to-cut-staff-by-10-pause-all-hiring-worldwide-elon-musk-3034749", "urlToImage": "https://c.ndtvimg.com/2022-05/dte8tg0g_elon-musk-reuters_625x300_18_May_22.jpg", "publishedAt": "2022-06-03T07:35:35Z", "content": "Elon Musk earlier this week asked Tesla employees to return to the office or leave the company.\r\nSan Francisco: Tesla chief executive Elon Musk said he had a \"super bad feeling\" about the economy and… [+648 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Mukesh Ambani surpasses Gautam Adani to regain Asia's richest spot as RIL shares near record high | Mint - Mint", "description": "Mukesh Ambani-led Reliance Industries shares climbed to a one-month high on Friday, trading near its record high level", "url": "https://www.livemint.com/news/mukesh-ambani-surpasses-gautam-adani-to-regain-asia-s-india-s-richest-man-as-ril-shares-near-record-high-11654239130423.html", "urlToImage": "https://images.livemint.com/img/2022/06/03/600x338/Mukesh_Ambani_1654239300426_1654239300618.jpg", "publishedAt": "2022-06-03T07:03:09Z", "content": "Mukesh Ambani has surpassed Gautam Adani to regain the spot of Asia's and India's richest man as Reliance Industries (RIL) shares continued to surge to trade near record high levels in Friday's tradi… [+2062 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santanu Chowdhury", "title": "WBBSE Madhyamik results 2022 declared, records all-time high pass percentage - The Indian Express", "description": "Arnab Ghorai from Ramharipur Ramkrishna Mission Ashrama in Bankura district and Rounak Mondal from Burdwan CMS School High School in East Burdwan district jointly topped the exam after getting 99 per cent (693 out of 700) marks.", "url": "https://indianexpress.com/article/education/wbbse-class-10-madhyamik-results-2022-declared-boys-outperform-girls-pass-percentage-toppers-wbresults-nic-in-7950281/", "urlToImage": "https://images.indianexpress.com/2022/06/WBBSE-Madhyamik-Result-2022-3.jpg", "publishedAt": "2022-06-03T07:01:04Z", "content": "The West Bengal Board of Secondary Education (WBBSE) on Friday announced the results of the Madhyamik (class 10) examinations which were held between March 7 to March 16. The pass percentage this yea… [+1681 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Subhrojit Mallick", "title": "Xiaomi India names Alvin Tse as India head, Anuj Sharma as CMO in big rejig - Economic Times", "description": "Stanford educated, a British national, Alvin Tse was in charge of the company's Indonesia business as the general manager. He is one of the founding members of the now independent Xiaomi sub-brand Poco.", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/xiaomi-india-names-alvin-tse-as-india-head-anuj-sharma-as-cmo-in-big-rejig/articleshow/91979567.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91979593,width-1070,height-580,imgsize-75072,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-03T06:59:00Z", "content": "Xiaomi India Friday said it has appointed Alvin Tse, who will join the company as general manager, replacing Manu Kumar Jain's leadership role in the company. The organisational rejig will have Anuj … [+2469 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Tech Desk", "title": "Garena Free Fire [All Working] redeem codes for 3rd June, 2022 - Times Now", "description": "Garena Free Fire Codes: We bring you the Garena Free Fire redeem codes for the 3rd of June 2022, which get you exclusive in-game items and more check details by using these daily free redeem codes. Keep in mind, that the FF Redeem Code has a claim limit. If i…", "url": "https://www.timesnownews.com/technology-science/garena-free-fire-all-working-redeem-codes-for-3rd-june-2022-article-91979005", "urlToImage": "https://static.tnn.in/thumb/msid-91979005,imgsize-100,width-1280,height-720,resizemode-75/91979005.jpg", "publishedAt": "2022-06-03T06:34:31Z", "content": "Viral video: Woman teaching son how to jump into pool hilariously falls into it, makes gigantic splash"}, {"source": {"id": null, "name": "Bollywood Life"}, "author": "Shivani Pawaskar", "title": "Samrat Prithviraj movie review: From EPIC to FLOP – Akshay Kumar, Manushi Chhillar starrer gets mixed response from masses - Bollywood Life", "description": "Samrat Prithviraj movie review: Akshay Kumar's acting chops and Chandraprakash Dwivedi's direction has got a mixed response. Check out fan reactions of Samrat Prithviraj here:", "url": "https://www.bollywoodlife.com/reviews/samrat-prithviraj-movie-review-from-epic-to-flop-akshay-kumar-manushi-chhillar-starrer-gets-mixed-response-from-masses-view-reactions-entertainment-news-bollywood-gossip-2091214/", "urlToImage": "https://st1.bollywoodlife.com/wp-content/uploads/2022/06/Samrat-Prithviraj-movie-review-600x315.png", "publishedAt": "2022-06-03T06:26:04Z", "content": "Akshay Kumar, Manushi Chhillarstarrer Samrat Prithviraj is out in the theatres. And fans have reached the cinema halls to watch the Chandraprakash Dwivedi directorial. Samrat Prithviraj is a historic… [+5401 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Future COVID-19 booster shots will likely need fresh formulations as new coronavirus variants of concern continue to emerge - ThePrint", "description": "Washington, Jun 3 (The Conversation) Being up to date on COVID-19 vaccines means having had three or four doses of the same shot at this point. Current boosters are the same formulations as the first authorised shots, based on the original strain of the coron…", "url": "https://theprint.in/world/future-covid-19-booster-shots-will-likely-need-fresh-formulations-as-new-coronavirus-variants-of-concern-continue-to-emerge/981723/", "urlToImage": null, "publishedAt": "2022-06-03T06:00:45Z", "content": "Washington, Jun 3 (The Conversation) Being up to date on COVID-19 vaccines means having had three or four doses of the same shot at this point. Current boosters are the same formulations as the first… [+7030 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "India to bilaterally engage Taliban-ruled Kabul for development and security - Hindustan Times", "description": "The decision to send an official delegation to Taliban ruled Kabul shows the pragmatism of the Modi government after the unchallenged Sunni-Pashtun force refused to play second fiddle to the Pakistani deep state. | Latest News India", "url": "https://www.hindustantimes.com/india-news/india-to-bilaterally-engage-taliban-ruled-kabul-for-development-and-security-101654235197280.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/03/1600x900/india_in_taliban_ruled_afghanistan_1654235472578_1654240160440.png", "publishedAt": "2022-06-03T05:55:04Z", "content": "By sending an official delegation to Taliban-ruled Afghanistan on Thursday, the Narendra Modi government has decided to bilaterally engage the Islamic Emirate for continued humanitarian assistance an… [+4509 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Minor gang-raped in Mercedes in Hyderabad, MLA's son under radar - India Today", "description": "A minor girl was allegedly gang-raped in a car in Hyderabad on Saturday. Police sources said that an MLA's son was involved in the incident.", "url": "https://www.indiatoday.in/crime/story/minor-gang-raped-mercedes-hyderabad-mla-son-under-radar-1957824-2022-06-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/rape_0-647x363.png?zxtJSMv8Y0dS99KEb5k5afdEpQatFjcP", "publishedAt": "2022-06-03T05:51:25Z", "content": "A minor girl was allegedly gang-raped in a Mercedes car by juveniles in Hyderabad. An MLA's son was allegedly involved in the incident, said police sources, adding that all the five accused in the ca… [+2045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sidhu Moose Wala Killing: Bhagwant Mann Visits Family In Singer's Village - NDTV", "description": "Sidhu Moose Wala was shot dead by some unidentified assailants in Punjab's Mansa district last week, a day after the state government curtailed his security cover.", "url": "https://www.ndtv.com/india-news/sidhu-moose-wala-murder-bhagwant-mann-punjab-chief-minister-at-singers-home-to-meet-family-3034381", "urlToImage": "https://c.ndtvimg.com/2022-06/7o7kvbgo_bhagwant-mann-visits-sidhu-moose-walas-family_650x400_03_June_22.jpg", "publishedAt": "2022-06-03T05:51:00Z", "content": "Bhagwant Mann reached Moosa village to express his condolences to Sidhu Moose Wala's family.\r\nChandigarh: Punjab Chief Minister Bhagwant Mann on Friday visited the parents of Sidhu Moose Wala, days a… [+1612 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "‘Yes, I got Sidhu Moosewala killed’, gangster Lawrence Bishnoi to Delhi Police: Report - The Tribune India", "description": "Alleged gangster Lawrence Bishnoi, who is in remand of the Delhi Police, has reportedly confessed to have ordered the killing of Punjabi singer Shubhdeep Singh Sidhu alias Sidhu Moosewala.", "url": "https://www.tribuneindia.com/news/punjab/yes-i-got-sidhu-moosewala-killed-gangster-lawrence-bishnoi-to-delhi-police-400644", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_809432424.jpg", "publishedAt": "2022-06-03T05:50:00Z", "content": "Tribune News Service\r\nAjay Banarjee\r\nNew Delhi, June 3\r\nAlleged gangster Lawrence Bishnoi, who is in remand of the Delhi Police, has reportedly confessed to have ordered the killing of Punjabi singer… [+1598 chars]"}, {"source": {"id": null, "name": "91mobiles"}, "author": null, "title": "Marvel’s Spider-Man Remastered, Spider-Man: Miles Morales coming to PC soon - 91mobiles", "description": "Sony has announced that the PlayStation-exclusive Marvel’s Spider-Man Remastered and Spider-Man: Miles Morales will be coming to PC.", "url": "https://www.91mobiles.com/hub/marvel-spider-man-miles-morales-remastered-pc-launch-soon/", "urlToImage": "https://www.91-cdn.com/hub/wp-content/uploads/2022/06/sm.jpg", "publishedAt": "2022-06-03T05:46:10Z", "content": "In PlayStation blog, Sony has announced that Spider-Man Remastered will launch on PC on August 12 and Spider-Man: Miles Morales will launch later this year. Spider-Man Remastered will feature the bas… [+992 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sumi Sukanya Dutta", "title": "Explainer: Is West Nile Fever that killed a Kerala man this week going undetected in other parts of the... - Moneycontrol", "description": "The World Health Organization says that up to 80 percent of the people infected with the West Nile virus do not show any symptoms, but the pathogen can cause a fatal neurological disease in some of those infected.", "url": "https://www.moneycontrol.com/news/trends/health-trends/explainer-is-west-nile-fever-that-killed-a-kerala-man-this-week-going-undetected-in-other-parts-of-the-country-8635611.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/istock_469932592.80568073823.original-594x435.jpg", "publishedAt": "2022-06-03T05:10:38Z", "content": "Earlier this week, a 47-year old man in Thrissur district in Kerala died of West Nile Fever, sending the state health department on a high alert.  This is the second reported death from the zoonotic … [+4072 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "After Sonia Gandhi, Priyanka Gandhi now tests Covid positive - Hindustan Times", "description": "Priyanka Gandhi reached Lucknow on Wednesday for a two-day party meeting aiming at the revival of the party in Uttar Pradesh. After Sonia Gandhi tested positive for Covid on Thursday, Priyanka left for Delhi ahead of schedule.  | Latest News India", "url": "https://www.hindustantimes.com/india-news/after-sonia-gandhi-priyanka-gandhi-now-tests-covid-positive-101654232373831.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/03/1600x900/ANI-20220601255-0_1654232372040_1654232382241.jpg", "publishedAt": "2022-06-03T05:01:07Z", "content": "A day after Congress interim president Sonia Gandhi tested Covid positive, Priyanka Gandhi on Friday tweeted she too has tested positive with mild symptoms. \"Following all the protocols, I have quara… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Kerala Thrikkakara bypoll results Live Updates: Congress's Uma Thomas poised to win election - The Indian Express", "description": "The Thrikkakara by-election was held in the wake of the death of Congress legislator P T Thomas. Congress has fielded his wife Uma Thomas. The Left candidate is cardiologist Dr Jo Joseph of the CPI(M). The BJP is also in the fray with its seasoned leader A N …", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-thrikkakara-assembly-bypoll-election-results-live-updates-7950165/", "urlToImage": "https://images.indianexpress.com/2022/06/kerala-by-election.jpg", "publishedAt": "2022-06-03T04:32:13Z", "content": "Congress is poised to retain the Assembly seat of Thrikkakara, where counting of votes for the March 31 bypoll is progressing.As counting of votes completed 10 rounds, Congress’s candidate Uma Thomas… [+2032 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Market Live Updates: Indices trade strong, Sensex up more than 1 percent, Nifty above 16,750, Cement... - Moneycontrol", "description": "Stock Market Live Updates: Trends on SGX Nifty indicate a gap-up opening for the broader index in India. The Nifty futures were trading around 16,806 levels on the Singaporean exchange.", "url": "https://www.moneycontrol.com/news/business/markets/market-live-updates-sgx-nifty-indicates-a-gap-up-opening-for-indian-indices-4-8634871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/BSE_Sensex-e1542611342127-770x433.jpg", "publishedAt": "2022-06-03T04:19:12Z", "content": "June 03, 2022 / 08:59 AM IST\r\nMohit Nigam, Head - PMS, Hem SecuritiesMarkets are looking to give a strong positive opening with gains of over a percent in Nifty50 as indicated by the SGX. Among the A… [+1058 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Four Macs we expect to see at Apple's WWDC 2022 (and one Mac not to expect) - The Indian Express", "description": "Apple's Worldwide Developers Conference (WWDC) opens on June 6, and while the event focuses on software, there are expectations around Macs as well. A look at four Macs that might make an appearance at WWDC 2022.", "url": "https://indianexpress.com/article/technology/laptops/apple-mac-hardware-wwdc-2022-predictions-7949242/", "urlToImage": "https://images.indianexpress.com/2022/06/AppleMacBookAir_2020.jpg", "publishedAt": "2022-06-03T03:22:23Z", "content": "On Monday, June 6, Apple will look at the upcoming changes to its iOS and macOS operating systems, along with other key software announcements. Apples Worldwide Developers Conference (WWDC) is a deve… [+5093 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Johnny Depp wins defamation case against Amber Heard: Key takeaways from trial | Latest English News - WION", "description": "Johnny Depp won a defamation suit against his former wife Amber Heard after a jury found that she had lied in saying that Depp had abused her over the course...", "url": "https://www.youtube.com/watch?v=FlF-ElTZeFU", "urlToImage": "https://i.ytimg.com/vi/FlF-ElTZeFU/maxresdefault.jpg", "publishedAt": "2022-06-03T02:57:18Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Explained: Supreme Court order on Puri Heritage Corridor today, what is the case? - The Indian Express", "description": "The Supreme Court will pronounce orders today on petitions against construction around the Jagannath temple, a case being heard in Orissa HC. What is this construction, and why has it been challenged?", "url": "https://indianexpress.com/article/explained/explained-puri-heritage-corridor-case-jagannath-temple-odisha-7949919/", "urlToImage": "https://images.indianexpress.com/2022/06/Puri-Heritage-Corridor-main.jpg", "publishedAt": "2022-06-03T02:52:44Z", "content": "On Thursday, the Supreme Court reserved its orders on petitions against excavation and construction work by the Odisha government along the Puri Jagannath temple as part of the Puri Heritage Corridor… [+6511 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Vikram first reviews are out. Fans rave about Kamal Haasan, Vijay Sethupathi and Fahadh Faasil film - India Today", "description": "Director Lokesh Kanagaraj's Vikram has hit the screens today, June 3. Fans who watched the 4 am shows, have been raving about Kamal Haasan, Vijay Sethupathi and Fahadh Faasil's performances.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-first-reviews-are-out-fans-rave-about-kamal-haasan-vijay-sethupathi-and-fahadh-faasil-film-1957758-2022-06-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Kamal_haasan_vijay_sethupathi_-647x363.jpeg?bxQo4V_XWiNjsO09oXtbu_kJg3K.erKf", "publishedAt": "2022-06-03T02:38:47Z", "content": "Kamal Haasan, Vijay Sethupathi and Fahadh Faasil's Vikram hit the theatres on June 3. Thousands of fans thronged to the theatres to watch the early morning (4 am) shows across Tamil Nadu. Going by th… [+2574 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Attacks on religious minorities in India occurred throughout 2021: US State Department - The Indian Express", "description": "India previously rejected the US religious freedom report, saying it sees no locus standi for a foreign government to pronounce on the state of its citizens' constitutionally protected rights.", "url": "https://indianexpress.com/article/world/attacks-on-religious-minorities-in-india-2021-us-7949751/", "urlToImage": "https://images.indianexpress.com/2022/06/Antony.jpg", "publishedAt": "2022-06-03T02:18:19Z", "content": "The US State Department in its annual report to the Congress on international religious freedom has alleged that in India in 2021 attack on members of the minority communities, including killings, as… [+3195 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Salman Khan is shocked as Riteish Deshmukh calls Maniesh Paul ‘best host’. Watch - Hindustan Times", "description": "Salman Khan and Riteish Deshmukh will co-host IIFA Awards 2022. Maniesh Paul, Aparshakti Khurana, and Farah Khan will also be taking on hosting duties.", "url": "https://www.hindustantimes.com/entertainment/bollywood/salman-khan-appears-shocked-as-riteish-deshmukh-hails-maniesh-paul-as-best-host-instead-of-him-watch-101654219848013.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/03/1600x900/iifa_1654222304944_1654222316506.jpg", "publishedAt": "2022-06-03T02:12:11Z", "content": "Salman Khan, Riteish Deshmukh, and several other celebrities have arrived in Abu Dhabi for the International Indian Film Academy Awards. Salman and Riteish will co-host the award show, while Maniesh … [+1824 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"How Much More Carnage...\": Biden Appeals For Tougher Gun Laws - NDTV", "description": "US President Joe Biden on Thursday urged lawmakers to ban privately owned assault weapons and high capacity magazines in order to curb the mass shootings plaguing the country.", "url": "https://www.ndtv.com/world-news/joe-biden-urges-ban-on-assault-weapons-in-speech-on-gun-violence-after-mass-shootings-3034132", "urlToImage": "https://c.ndtvimg.com/2022-03/utvlj49k_-joe-biden-state-of-union_625x300_02_March_22.jpg", "publishedAt": "2022-06-03T01:29:00Z", "content": "Joe Biden also called Republican senators' refusal to enact gun laws 'unconscionable'.\r\nWashington: US President Joe Biden pleaded with lawmakers Thursday to take action on gun violence plaguing the … [+4440 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sohini Das", "title": "Covid being endemic is as mystical and mythical as herd immunity: N K Arora - Business Standard", "description": "Vaccine equity not possible if we include imported mRNA vaccines in our programme said Arora", "url": "https://www.business-standard.com/article/current-affairs/covid-being-endemic-is-as-mystical-and-mythical-as-herd-immunity-n-k-arora-122060201469_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-06/02/full/1654192487-4448.jpg", "publishedAt": "2022-06-03T00:40:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "ESPN India"}, "author": null, "title": "Spain vs. Portugal - Football Match Report - June 3, 2022 - ESPN India", "description": "Get a report of the Spain vs. Portugal 2022-23 UEFA Nations League, Group Stage football match.", "url": "https://www.espn.in/football/report/_/gameId/624159", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0602%2Fr1020655_1296x729_16%2D9.jpg", "publishedAt": "2022-06-03T00:23:49Z", "content": "Spain and Portugal played out a fourth consecutive draw between the two teams on Thursday. David S. Bustamante/Soccrates/Getty Images\r\nPortugal striker Ricardo Horta grabbed a late equaliser to earn … [+2866 chars]"}, {"source": {"id": null, "name": "Chessbase.com"}, "author": "Carlos Alberto Colodro", "title": "Norway Chess: Carlsen and MVL score, Anand still leads - ChessBase", "description": "Vishy Anand is still the sole leader at the Norway Chess tournament in Stavanger. The Indian beat Wang Hao in Armageddon, while his closest chaser, Wesley So, also won in the sudden-death decider against Anish Giri. Magnus Carlsen and Maxime Vachier-Lagrave w…", "url": "https://en.chessbase.com/post/norway-chess-2022-r3", "urlToImage": "https://en.chessbase.com/thumb/103467_l200", "publishedAt": "2022-06-02T23:44:15Z", "content": "<ul><li>Still no ChessBase Account?learn more &gt;8 million games online! Updated weekly, our definitive database has all the latest games. \r\nWith Live Book and Lets Check!</li><li>Still no ChessBase… [+6926 chars]"}, {"source": {"id": null, "name": "ATP Tour"}, "author": "ATP Tour", "title": "SF Preview: Rafael Nadal Seeking More History Against No. 1-Chasing Alexander Zverev - ATP Tour", "description": "SF Preview: Nadal Seeking More History Against No. 1-Chasing Zverev", "url": "https://www.atptour.com/en/news/nadal-zverev-ruud-cilic-roland-garros-2022-sf-preview", "urlToImage": "https://www.atptour.com/-/media/images/news/2022/06/02/18/04/nadal-zverev-roland-garros-2022-sf-preview-graphic.jpg", "publishedAt": "2022-06-02T22:16:04Z", "content": "Friday is men's semi-finals day at Roland Garros, with Rafael Nadal and Alexander Zverev set to open play on Court Philippe Chatrier ahead of a clash between Casper Ruud and Marin Cilic.\r\nPlaying on … [+7842 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Science Desk", "title": "NASA selects Axiom Space and Collins Aerospace to build next-generation spacesuits for Artemis moon program an - Times Now", "description": "NASA has picked  two companies for making the next-generation spacesuits for its Artemis moon program and other space missions. The next-generation spacesuits will be made by Axiom Space and Collins Aerospace.", "url": "https://www.timesnownews.com/technology-science/nasa-selects-axiom-space-and-collins-aerospace-to-build-next-generation-spacesuits-for-artemis-moon-program-and-other-iss-mission-article-91971764", "urlToImage": "https://static.tnn.in/thumb/msid-91971764,imgsize-100,width-1280,height-720,resizemode-75/91971764.jpg", "publishedAt": "2022-06-02T20:40:13Z", "content": "ENG vs NZ, 1st Test, Day 1: Perpetual batting crisis disturbs Englands blank canvas on first day of summer"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "17 Wickets Fall On Day 1 | Highlights | England v New Zealand - Day 1 | 1st LV= Insurance Test 2022 - England & Wales Cricket Board", "description": "Go to ecb.co.uk to join We Are England Cricket Supporters for free and get priority access to tickets and much more!Watch match highlights from Day 1 the 1st...", "url": "https://www.youtube.com/watch?v=8UufgBU0Sms", "urlToImage": "https://i.ytimg.com/vi/8UufgBU0Sms/hqdefault.jpg", "publishedAt": "2022-06-02T19:36:49Z", "content": null}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "SHABIR IBN YUSUF", "title": "Bank manager, labourer shot dead by terrorists in Kulgam, Chadoora - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/todays-paper/front-page/bank-manager-labourer-shot-dead-by-terrorists-in-kulgam-chadoora", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-06%2F6ef258ed-7f7b-4c45-8e24-71f225eaa73b%2Fbankemployeefromrajasthanshotdeadinsouthkashmirsku__8_.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-02T19:30:00Z", "content": "Srinagar: A bank manager from Rajasthan, posted at the Ellaquai Dehati Bank in the Valley, was shot dead by terrorists in south Kashmirs Kulgam on Thursday morning, while a non-local labourer was sho… [+636 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "NASA to study two 'Super-Earths' 50 light years away - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "WASHINGTON, June 2: NASA has said that it will be studying two hot exoplanets classified as super-Earths that is situated 50 light years away and among them is planet ’55 Cancri e’, which is sort of like Earth but closer to star. According to NASA, among the …", "url": "https://www.dailyexcelsior.com/nasa-to-study-two-super-earths-50-light-years-away/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/06/download-2-1.jpg", "publishedAt": "2022-06-02T18:52:16Z", "content": "WASHINGTON, June 2: NASA has said that it will be studying two hot exoplanets classified as super-Earths that is situated 50 light years away and among them is planet ’55 Cancri e’, which is sort of … [+2147 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Pew pew! Perseverance rover on Mars picks its own prize rocks to shoot with laser - Space.com", "description": "The mighty machine is searching out each sample's elemental composition in the ongoing search for ancient life.", "url": "https://www.space.com/perseverance-rover-mars-autonomous-laser-targets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/abrjxh72WUo4ehNhxeL4LD-1200-80.jpeg", "publishedAt": "2022-06-02T17:00:01Z", "content": "NASA is hailing the Perseverance rover's improved ability to pick its own targets as a way of speeding up science on Mars.\r\nWithout explicit direction from Earth, the Perseverance rover zapped two ro… [+2531 chars]"}]}