{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Rahat Fateh Ali Khan released after detention by police in criminal defamation case: Report | Today News - Mint", "description": "Famous Pakistani singer Rahat Fateh Ali Khan was released on bail after he was detained by local police in Dubai following a complaint on criminal defamation case", "url": "https://www.livemint.com/news/world/rahat-fateh-ali-khan-released-after-detention-by-police-in-criminal-defamation-case-report-11721702871526.html", "urlToImage": "https://images.livemint.com/img/2024/07/23/1600x900/GTGCLwOXcAAfolu_1721654629971_1721702878918.png", "publishedAt": "2024-07-23T02:57:48Z", "content": "Famous Pakistani singer Rahat Fateh Ali Khan was reportedly released on bail following his detention by the local police in Dubai in a criminal defamation case. The singer was detained by the local p… [+1691 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Shiv Sena leader demands action against Bigg Boss OTT 3, Armaan Malik for promoting ‘vulgarity’: He crossed all limits - Hindustan Times", "description": "Shiv Sena MLA Dr Manisha Kayande slammed Bigg Boss OTT 3 for spreading ‘vulgarity’. She approached Mumbai police for initiating stern action against the show. | Web Series", "url": "https://www.hindustantimes.com/entertainment/web-series/shiv-sena-leader-action-bigg-boss-ott-3-armaan-malik-promoting-vulgarity-101721659938994.html", "urlToImage": "https://images.hindustantimes.com/img/2024/07/22/1600x900/armaan_malik_1721662260197_1721662282662.jpg", "publishedAt": "2024-07-22T15:39:47Z", "content": "Bigg Boss OTT 3 is known for its fair share of controversies, rivalries, heartbreaks and surprises. Armaan Malik has been the most talked about contestant in the reality show because of his open admi… [+1988 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Simantik Dowerah, Simantik Dowerah", "title": "World Brain Day: Importance of raising awareness and early detection of brain tumours - Firstpost", "description": "It is important to do secondary research on brain tumours regarding types, symptoms, treatment options, causes and risks for their early detection and effective management", "url": "https://www.firstpost.com/health/world-brain-day-importance-of-raising-awareness-and-early-detection-of-brain-tumours-13795680.html", "urlToImage": "https://images.firstpost.com/uploads/2024/03/Brain-2024-03-e0ab73b821e7e97feab4c24d4ba8c16c.jpg?im=FitAndFill=(1200,675)", "publishedAt": "2024-07-22T13:11:10Z", "content": "Every year on July 22, is observed as World Brain Day, a crucial reminder of the incredible organ that orchestrates our every thought, action, and emotion. This year, lets focus on a particularly con… [+4526 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kusumika Das", "title": "Abhishek Bachchan Spotted For The First Time After Liking Divorce Post Amid Separation Rumours With Aishwarya - Times Now", "description": "Abhishek Bachchan and Aishwarya Rai's divorce speculations have been making the rounds on social media for quite a while now. Abhishek who liked a social media post on divorce a few days back, made his first public appearance. Watch the video below:", "url": "https://www.timesnownews.com/entertainment-news/bollywood/abhishek-bachchan-spotted-for-the-first-time-after-liking-divorce-post-amid-separation-rumours-with-aishwarya-rai-article-111927479", "urlToImage": "https://static.tnn.in/thumb/msid-111928914,thumbsize-40794,width-1280,height-720,resizemode-75/111928914.jpg?quality=100", "publishedAt": "2024-07-22T10:56:06Z", "content": "Cookie duration: 396 (days).Data collected and processed: Probabilistic identifiers, Device characteristics, Authentication-derived identifiers, Privacy choices, Precise location data, Users profiles… [+182 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Mishra3", "title": "Explore the Cosmos: A summer road trip with Nasa's Chandra and Webb - The Times of India", "description": "The tour begins with Rho Ophiuchi, about 390 light-years away. This nearby star-forming region features a mix of gas and stars. Chandra's X-rays, shown in purple, highlight young stars, while Webb's infrared data in various colors reveal intricate gas and dus…", "url": "https://timesofindia.indiatimes.com/science/explore-the-cosmos-a-summer-road-trip-with-nasas-chandra-and-webb/photostory/111921417.cms", "urlToImage": "https://static.toiimg.com/photo/111921558.cms", "publishedAt": "2024-07-22T09:25:22Z", "content": "Your Privacy\r\nWhen you visit our website, we store cookies on your browser to collect information. The information collected might relate to you, your preferences or your device, and is mostly used t… [+2093 chars]"}]}