{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Hoarse voice among top COVID symptoms; know more about this - Times of India", "description": "Yes, the coronavirus can affect your voice. The vocal folds have angiotensin-converting enzyme 2 (ACE2) receptors which facilitate the entry of the coronavirus into the body. This is the reason why many people undergo voice change following a COVID infection.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-hoarse-voice-among-top-covid-symptoms-know-more-about-this/photostory/96276497.cms", "urlToImage": "https://static.toiimg.com/photo/96276646.cms", "publishedAt": "2022-12-16T12:30:00Z", "content": "As per the latest data from the ZOE Health Study the top 10 symptoms of COVID are sore throat, runny nose, blocked nose, sneezing, cough without phlegm, cough with phlegm, headache, hoarse voice, mus… [+312 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "SpaceX rocket launches world's first global water survey mission - The Tribune India", "description": "A SpaceX rocket blasted off early on Friday carrying a US-French satellite designed to conduct the first global survey of Earth's surface waters, a mission expected to shed new light on the mechanics and consequences of climate change.", "url": "https://www.tribuneindia.com/news/science-technology/spacex-rocket-launches-worlds-first-global-water-survey-mission-461640", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_103287674.jpg", "publishedAt": "2022-12-16T12:15:00Z", "content": "Reuters\r\nLos Angeles, Calif., December 16\r\nA SpaceX rocket blasted off early on Friday carrying a US-French satellite designed to conduct the first global survey of Earth's surface waters, a mission … [+3211 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bihar hooch tragedy: CM Nitish Kumar says no compensation to kin of those who died - The Indian Express", "description": "In the Bihar Assembly, Kumar continued his tirade against alcohol consumption in the state. “We have been appealing — if you drink, you will die,” Kumar said. “Those who talk in favour of drinking will not bring any good to you.”", "url": "https://indianexpress.com/article/cities/patna/bihar-hooch-tragedy-nitish-kumar-compensation-victims-8325773/", "urlToImage": "https://images.indianexpress.com/2022/12/Nitish-kumar-1-2-1.jpeg", "publishedAt": "2022-12-16T11:56:36Z", "content": "Days after dozens of people were killed due to the consumption of spurious liquor in Bihars Saran district, Chief Minister Nitish Kumar Friday said “no compensation would be given” to the relatives o… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IND vs BAN 1st Test Day 3 highlights: Stumps day 3, BAN need 471 runs to win - The Indian Express", "description": "India vs Bangladesh highlights: At stumps day three, Bangladesh need 471 runs to win with 10 wickets in hand.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-bangladesh-1st-test-day-3-live-score-updates-8327127/", "urlToImage": "https://images.indianexpress.com/2022/12/Pujara-and-Gill-partnership.jpg", "publishedAt": "2022-12-16T11:54:08Z", "content": "Kuldeep shines on comeback with all-round effort, as India take control of first Test against Bangladesh\r\n India's Kuldeep Yadav plays a shot during the second day of the first test cricket match bet… [+1362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA's Juno to explore most volcanic place in the solar system - The Indian Express", "description": "NASA's Juno spacecraft is all set to look at Jupiter's moon Io, which has volcanoes that spew lava dozens of kilometres in the air and lakes of molten silicon lava.", "url": "https://indianexpress.com/article/technology/science/nasa-juno-jupiter-io-8328538/", "urlToImage": "https://images.indianexpress.com/2022/12/Jupiter-moon-Io-Juno-2-221216.jpg", "publishedAt": "2022-12-16T11:50:16Z", "content": "While in the second year of its exploration of Jupiters inner moons, NASAs Juno spacecraft has sent back a treasure of details about the Jovian moons Ganymede and Europa. Now, the mission is poised t… [+1518 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"New Low, Even For Pak\": India Slams Bilawal Bhutto's Comments Against PM - NDTV", "description": "India today blasted Pakistan Foreign Minister Bilawal Bhutto over his offensive personal attack on Prime Minister Narendra Modi, calling it a \"new low even for Pakistan\".", "url": "https://www.ndtv.com/india-news/union-ministers-slam-pakistan-foreign-minister-bilawal-bhuttos-comments-against-pm-narendra-modi-3612542", "urlToImage": "https://c.ndtvimg.com/2022-12/61thhbv8_bilawal-bhutto-un-december-2022-650_625x300_16_December_22.jpg", "publishedAt": "2022-12-16T11:35:00Z", "content": "New Delhi: India today blasted Pakistan Foreign Minister Bilawal Bhutto over his offensive personal attack on Prime Minister Narendra Modi, calling it a \"new low even for Pakistan\".\r\nIn a firm and un… [+4042 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Tells Putin Dialogue, Diplomacy Only Way Forward On Ukraine War - NDTV", "description": "Prime Minister Narendra Modi today called upon Russian President Vladimir Putin, and reiterated his call for dialogue and diplomacy as \"the only way forward\" in the ongoing conflict in Ukraine, the government said.", "url": "https://www.ndtv.com/india-news/pm-modi-tells-putin-dialogue-diplomacy-only-way-forward-on-ukraine-war-3612527", "urlToImage": "https://c.ndtvimg.com/2021-12/45d85t0o_putin-modi-india-afp_625x300_06_December_21.jpg", "publishedAt": "2022-12-16T11:34:00Z", "content": "The leaders agreed to remain in regular touch with each other.\r\nNew Delhi: Prime Minister Narendra Modi today called upon Russian President Vladimir Putin, and reiterated his call for dialogue and di… [+3606 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ask Your Minister This: Minister S Jaishankar's Response To Pak Journalist - NDTV", "description": "External Affairs Minister S Jaishankar told the UN Security Council that the \"contemporary epicentre of terrorism\" remains very much active as he lamented that evidence-backed proposals to blacklist terrorists are put on hold without adequate reason.", "url": "https://www.ndtv.com/india-news/epicentre-of-terrorism-active-s-jaishankars-veiled-dig-at-china-pak-3610623", "urlToImage": "https://c.ndtvimg.com/2022-12/de11id0g_s-jaishankar-un-ani-december-2022-650_650x400_16_December_22.jpg", "publishedAt": "2022-12-16T11:13:00Z", "content": "S Jaishankar said, \"The threat of terrorism has actually become even more serious.\"\r\nUnited Nations: The world sees Pakistan as the \"epicentre\" of terrorism, External Affairs Minister S Jaishankar sa… [+3615 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Bishwajeet", "title": "Newly discovered twin Kepler planets could be unique water worlds - India Today", "description": "The planets, which are about one and a half times the size of the Earth, were discovered along with its host star by Nasa’s Kepler Space Telescope.", "url": "https://www.indiatoday.in/science/story/newly-discovered-twin-planets-could-be-unique-water-worlds-kepler-138-2309993-2022-12-16", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/kepler-sixteen_nine_0.jpg?VersionId=9tiKx52kP_16l5.7Nucrl8UPpYOCirS_", "publishedAt": "2022-12-16T09:59:43Z", "content": "By Bishwajeet: Astronomers have discovered that two exoplanets orbiting a red dwarf star that are unique in their composition. These two exoplanets are unlike any other discovered outside the Solar S… [+2622 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": "Odisha Diary bureau", "title": "Mysterious Circles of Radio Emission Detected in Space May Come From Supernova Explosions or Massive Black Holes - Odisha Diary", "description": "A new research offers plausible explanations for mysterious hazy circles of radio emission deep in celestial space called Odd Radio Circles (ORCs) detected recently using some of the most sensitive international radio telescopes.Astronomers recently", "url": "https://orissadiary.com/mysterious-circles-of-radio-emission-detected-in-space-may-come-from-supernova-explosions-or-massive-black-holes/", "urlToImage": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2022/12/image001DY21.png?fit=568%2C343&ssl=1", "publishedAt": "2022-12-16T09:56:40Z", "content": "A new research offers plausible explanations for mysterious hazy circles of radio emission deep in celestial space called Odd Radio Circles (ORCs) detected recently using some of the most sensitive i… [+3981 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Smriti Irani's 'Miss India' Video Spawns Trinamool-BJP Twitter Clash - NDTV", "description": "Smriti Irani's swimsuit video has been cited by many as one of the demonstrations of the double standards of those criticising Deepika Padukone's bikini in the movie 'Pathaan'.", "url": "https://www.ndtv.com/india-news/smriti-iranis-miss-india-video-spawns-trinamool-bjp-twitter-clash-3612346", "urlToImage": "https://c.ndtvimg.com/2019-01/6s4s2488_smriti-irani-pti_625x300_06_January_19.jpg", "publishedAt": "2022-12-16T09:43:33Z", "content": "Smriti Irani is the Union Minister for Women and Child Development.\r\nNew Delhi: A video of Union Minister Smriti Irani from the 1998 edition of the Miss India beauty pageant found its way into an onl… [+2759 chars]"}, {"source": {"id": null, "name": "123telugu.com"}, "author": null, "title": "Star director to become father soon - 123telugu", "description": "Telugu cinema news, Telugu Movies Updates, Latest Movie reviews in Telugu, Telugu cinema reviews, telugu movie reviews, Tollywood, Box office collections, Telugu Movie show times, Theater List, telugu cinema tickets", "url": "https://www.123telugu.com/mnews/star-director-to-become-father-soon.html", "urlToImage": "https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif", "publishedAt": "2022-12-16T09:30:00Z", "content": "South star director Atlee has become a very good commercial director with continuous hits. He gave big blockbusters to Thalapathy Vijay in the form of Mersal, Theri, and Bigil, which received a good … [+849 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "CricTracker Staff", "title": "BBL 2022: Match 5, THU vs STR Match Prediction – Who will win today’s BBL match between Sydney Thunder and Adelaide Strikers? - CricTracker", "description": "Sydney Thunder are set to take on Adelaide Strikers in Match 5 of the Big Bash League 2022 at the Sydney Showground Stadium. Both these teams have started their campaign with a victory and will have a", "url": "https://www.crictracker.com/cricket-match-predictions/bbl-2022-match-5-thu-vs-str-match-prediction-who-will-win-todays-bbl-match-between-sydney-thunder-and-adelaide-strikers-9842/", "urlToImage": "https://media.crictracker.com/media/featureimage/Rashid-Khan-and-Ryan-Gibson.jpg", "publishedAt": "2022-12-16T09:00:00Z", "content": "Sydney Thunder are set to take on Adelaide Strikers in Match 5 of theBig Bash League 2022 at the Sydney Showground Stadium. Both these teams have started their campaign with a victory and will have a… [+2558 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Tech Desk", "title": "iPhone 14's Emergency SOS via Satellite Feature Helps Rescue 2 People After Car Crash - News18", "description": "The two survivors were able to use the Emergency SOS feature to send out a distress signal, alerting authorities to their location and enabling a rescue team to reach them.", "url": "https://www.news18.com/news/tech/iphone-14s-emergency-sos-via-satellite-feature-helps-rescue-2-people-after-car-crash-6629629.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/apple-emergency-sos-via-sateliite-167118109616x9.jpg", "publishedAt": "2022-12-16T08:59:10Z", "content": "iPhone 14 series Emergency SOS via satellite and Crash Detection feature saved two people by helping them get rescued after a serious car crash in California.\r\nThe accident occurred on the Angeles Fo… [+1265 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Zika virus, dengue, chikungunya: How to tell the difference between symptoms - Hindustan Times", "description": "Be it zika virus, dengue or chikungunya, early diagnosis of these diseases can prevent one from complications and it is important to know the difference between symptoms of each of these illnesses. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/zika-virus-dengue-chikungunya-how-to-tell-the-difference-between-symptoms-101671180567158.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/16/1600x900/Zika_dengue_chikungunya_1671180641808_1671180652228_1671180652228.jpg", "publishedAt": "2022-12-16T08:57:22Z", "content": "A 5-year-old girl from Karnataka was recently diagnosed with zika virus, a viral infection spread by Aedes mosquitoes, that is usually known to cause dengue. Vector-borne diseases are on rise perhaps… [+5038 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hemani Bhandari", "title": "Delhi teacher throws Class 5 girl from window of classroom, detained: Cop - Hindustan Times", "description": "Police said preliminary inquiries indicated that a teacher, Geeta Deshwal, allegedly hit the girl with a pair of scissors and then threw her down the classroom located on the first floor. | Latest News Delhi", "url": "https://www.hindustantimes.com/cities/delhi-news/teacher-throws-class-5-girl-from-first-floor-window-of-classroom-detained-cop-101671181040655.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/16/1600x900/delhi_teacher_throw_student_first_floor_window_1671183258557_1671183258683_1671183258683.jpg", "publishedAt": "2022-12-16T08:57:20Z", "content": "A class 5 student in Delhi was admitted to hospital on Friday after she was thrown out of the first-floor window of her classroom at school by a teacher, police said. The teacher has been detained an… [+843 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": "Adersh Unni Krishnan", "title": "New Leaks for Samsung Galaxy S23 Smartphone, do checkout: - Techstory", "description": "New leaks tipped online for the upcoming Samsung Galaxy S23 smartphone - Here is everything we know:", "url": "https://techstory.in/new-leaks-for-samsung-galaxy-s23-smartphone-do-checkout/", "urlToImage": "https://techstory.in/wp-content/uploads/2022/12/technology-companies-are-laying-off-11.png", "publishedAt": "2022-12-16T08:57:15Z", "content": "New Leaks for Samsung Galaxy S23 Smartphone\r\nIf you’ve been following the leaks, you’ve seen a lot of information about the new flagship, the Samsung Galaxy S23 smartphone. This smartphone from the K… [+2544 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Benches Till January 1\": Chief Justice, Day After Centre's Vacation Jab - NDTV", "description": "Chief Justice of India DY Chandrachud on Friday said no Supreme Court bench will be available from December 17 till January 1 during the ensuing winter vacations.", "url": "https://www.ndtv.com/india-news/no-supreme-court-benches-to-be-available-during-2022-winter-vacation-chief-justice-of-india-dy-chandrachud-3611906", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-12-16T08:07:00Z", "content": "No Supreme Court bench will be available from December 17 till January 1 during winter break\r\nNew Delhi: Chief Justice of India DY Chandrachud on Friday said no Supreme Court bench will be available … [+3953 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Aquarium Bursts Open, Has Million Litres Of Water And 1,500 Fish - NDTV", "description": "The German capital's traffic information agency VIZ said there was an extremely large volume of water on the street outside.", "url": "https://www.ndtv.com/feature/video-massive-aquarium-bursts-open-52-feet-high-1-500-fish-3611984", "urlToImage": "https://c.ndtvimg.com/2022-12/f6pllof_berlinn-aquarium-burst-650_625x300_16_December_22.jpg", "publishedAt": "2022-12-16T08:03:45Z", "content": "The guests staying at the hotel posted pictures of the damage.\r\nA 14-metre (46-feet) high aquarium burst in a leisure complex in Berlin early on Friday. More than 100 firefighters were called in to d… [+2072 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "Russia launches another major missile attack on Ukraine - Hindustan Times", "description": "Ukrainian authorities on social media reported explosions in the capital, Kyiv, southern Kryvyi Rih and northeastern Kharkiv as authorities sounded air raid alarms across the country warning of a new devastating barrage of the Russian strikes that have occurr…", "url": "https://www.hindustantimes.com/world-news/russia-ukraine-war-russia-launches-another-major-missile-attack-on-ukraine-101671176665779.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/16/1600x900/Russia-Ukraine-War-0_1671176950178_1671176950178_1671176985852_1671176985852.jpg", "publishedAt": "2022-12-16T07:51:44Z", "content": "Ukrainian authorities reported explosions in at least three cities Friday, saying Russia has launched a major missile attack on energy facilities and infrastructure.\r\nLocal authorities on social medi… [+1998 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Rajya Sabha Adjournment: Chaos As Opposition Trooped Into Well Demanding Discussion on India-China - ABP Live", "description": "The MPs marched into the well of the House after their request to discuss the India-China border dispute was denied by the Chair.", "url": "https://news.abplive.com/news/india/rajya-sabha-adjournment-chaos-as-opposition-trooped-into-well-demanding-discussion-on-india-china-1569976", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/16/211257ae386faaa5e8d3eab34e6312621671175994210594_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-16T07:50:56Z", "content": "Rajya Sabha was adjourned till 12 noon on Friday after the Opposition’s demand to discuss the India-China border dispute was rejected by the Chair. Rajya Sabha Deputy Chairman Harivansh repeatedly ur… [+1906 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Diksha Tripathy", "title": "Key reforms to spur India reach top spot in global economy in coming decades: Tata's N Chandrasekaran - Economic Times", "description": "He said India's economy is one of the fastest growing major economies and has the potential to gain a top spot in the global economy by 2047- a year which marks the 100 years of India's independence. India's economy jumped to fifth position from the 10th spot…", "url": "https://economictimes.indiatimes.com/news/elections/lok-sabha/india/key-reforms-to-spur-india-reach-top-spot-in-global-economy-in-coming-decades-tatas-n-chandrasekaran/articleshow/96271192.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96271124,width-1070,height-580,imgsize-6848,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-16T07:29:00Z", "content": "Tata chairman Natarajan Chandrasekaran on Friday called Indian economy a bright spot in the global economy which otherwise is facing recessionary impulses, multidecade high inflation and squeezing ho… [+2999 chars]"}, {"source": {"id": null, "name": "Cricbuzz"}, "author": null, "title": "Bangladesh vs India, 1st Test, India tour of Bangladesh, 2022 - Cricbuzz", "description": "Follow Bangladesh vs India, 1st Test, Dec 14, India tour of Bangladesh, 2022 with live Cricket score, ball by ball commentary updates on Cricbuzz", "url": "https://www.cricbuzz.com/live-cricket-scores/56969/ban-vs-ind-1st-test-india-tour-of-bangladesh-2022", "urlToImage": null, "publishedAt": "2022-12-16T07:03:27Z", "content": "Shubman Gill: I personally thought it (maiden Test century) was long time coming for me. Today it was all about getting the difficult situation out of the way. There weren't any different thoughts (w… [+3695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hippo Swallows 2-Year-Old In Uganda, Then Spits Him Out - NDTV", "description": "The toddler was playing near his home on the shores of a lake in Katwe Kabatoro town when the hungry hippo grabbed him with its huge jaws.", "url": "https://www.ndtv.com/offbeat/hippo-swallows-2-year-old-in-uganda-then-spits-him-out-3611863", "urlToImage": "https://c.ndtvimg.com/2022-12/sjndmd2_hippo-_625x300_16_December_22.jpg", "publishedAt": "2022-12-16T06:57:31Z", "content": "The hippo spit the toddler back out after an onlooker pelted stones at the animal.\r\nIn a miracle, a two-year-old boy survived after being gulped down by a rogue hippopotamus in Uganda. The hippo spit… [+2102 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Varun Yadav", "title": "Samsung budget-friendly smartphone `Galaxy M04` sale begins today on Amazon; Check price, RAM, battery, mor... - Zee News", "description": "The sale for Samsung’s budget smartphone has started on December 16 at 12 Pm on Amazon. The budget-friendly smartphone is available at the cost of Rs 9,499 along with several exchange offers. Samsung M04 sports a 5000 mAh battery, MediaTek Helio P35 and up to…", "url": "https://zeenews.india.com/technology/samsung-budget-friendly-smartphone-galaxy-m04-sale-begins-today-on-amazon-check-price-ram-battery-more-2549327.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/16/1129995-storage-desktop-v1.jpg", "publishedAt": "2022-12-16T06:56:45Z", "content": "New Delhi: The sale for Samsungs budget smartphone has started on December 16 at 12 Pm on Amazon. The budget-friendly smartphone is available at the cost of Rs 9,499 along with several exchange offer… [+1405 chars]"}, {"source": {"id": null, "name": "Koimoi"}, "author": "Shalmesh More", "title": "Avatar 2 Box Office Day 1 Morning Occupancy: Takes A Good Start All Across The Country With South Showing Outstanding Response! - Koimoi", "description": "Considering the sequel factor and goodwill of the first part, excitement is at its peak for Avatar 2. Here's its day 1 morning occupancy report!", "url": "https://www.koimoi.com/box-office/avatar-2-box-office-day-1-morning-occupancy-takes-a-good-start-all-across-the-country-with-south-showing-outstanding-response/", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2022/12/avatar-2-box-office-day-1-morning-occupancy-001.jpg", "publishedAt": "2022-12-16T06:55:47Z", "content": "Avatar 2 Box Office Day 1 Morning Occupancy(Photo Credit Still From Avatar: The Way Of Water)\r\nAvatar 2 has released all across the country and the response has been really good so far at the box off… [+1809 chars]"}, {"source": {"id": null, "name": "wknd."}, "author": "A Staff Reporter", "title": "Indian rupee slightly weakens against UAE dirham - Khaleej Times", "description": "A weak greenback supported the South Asian currency and restricted the decline, forex traders said", "url": "https://www.khaleejtimes.com/business/markets/indian-rupee-slightly-weakens-against-uae-dirham", "urlToImage": "https://image.khaleejtimes.com?uuid=2030a172-711c-4fd5-82b3-46fd195fafda&function=cropresize&type=preview&source=false&q=75&crop_w=0.99999&crop_h=0.88583&x=0&y=0&width=1200&height=675", "publishedAt": "2022-12-16T06:07:04Z", "content": "A weak greenback supported the South Asian currency and restricted the decline, forex traders said\r\nThe Indian rupee depreciated four paise to 82.80 against the US dollar (22.56 versus the UAE dirham… [+1120 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Vijay Diwas: Why is December 16 celebrated as Victory Day? - The Indian Express", "description": "Vijay Diwas: The Indo-Pak War of 1971, which was short and intense, was fought on both the Eastern and Western fronts over 13 days. A look at what led to it, and how India played its part in the liberation of Bangladesh.", "url": "https://indianexpress.com/article/explained/vijay-diwas-1971-indo-pak-war-bangladesh-liberation-explained-8327519/", "urlToImage": "https://images.indianexpress.com/2022/12/1971-War-1.jpg", "publishedAt": "2022-12-16T06:04:09Z", "content": "Vijay Diwas or Victory Day is commemorated on December 16, marking the end of the 1971 Indo-Pak War and the liberation of Bangladesh. India declared victory on this day 51 years ago after Pakistan si… [+5573 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "You may have to pay upto ₹30,000 extra on Honda cars from January 2023 | Mint - Mint", "description": "Honda joins the likes of market leader Maruti Suzuki, Hyundai, Tata Motors, Mercedes-Benz, Audi, Renault, Kia India and MG Motor, who have already made year-end announcements to hike prices from January", "url": "https://www.livemint.com/auto-news/you-may-have-to-pay-upto-rs-30-000-extra-on-honda-cars-from-january-2023-11671168955719.html", "urlToImage": "https://images.livemint.com/img/2022/12/16/600x338/honda_1671169629096_1671169629315_1671169629315.JPG", "publishedAt": "2022-12-16T05:49:05Z", "content": "Japanese car maker Honda said it is planning to increase prices of its entire model range from January 2023. According to news agency PTI, the company may increase price of its vehicles by up to 30,0… [+2082 chars]"}, {"source": {"id": null, "name": "ESPN India"}, "author": "Tim Vickery", "title": "World Cup: How will Messi, Argentina break down France? - ESPN India", "description": "Under manager Lionel Scaloni, Argentina's strength comes from their adaptibility. But what about against a star-studded France side?", "url": "https://www.espn.in/football/argentina-arg/story/4832747/world-cup-mbappe-france-provide-no-perfect-plan-for-messi-argentina", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F1216%2Fr1107140_1296x729_16%2D9.jpg", "publishedAt": "2022-12-16T05:21:10Z", "content": "Military minds are fond of saving that \"no plan ever survives first contact with the enemy.\" Substitute \"opposition\" for \"enemy\" and we have a fair approximation of a situation that Argentina manager… [+5042 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sumi Sukanya Dutta", "title": "Stem cell therapy not recommended for autistic kids: NMC - Moneycontrol", "description": "For the first time, the regulator for doctors in India has recognised the problem of predatory marketing of stem cell therapies to treat autism. The indiscriminate promotion has led to the creation of false hopes, unrealistic expectations, and exploitation of…", "url": "https://www.moneycontrol.com/news/trends/stem-cell-therapy-not-recommended-for-autistic-kids-nmc-9715011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/best-kids-books-2022-eshe-770x433.jpg", "publishedAt": "2022-12-16T05:04:23Z", "content": "Indias regulator for medical professionals has declared that using unproven stem cell therapy to treat autistic children will be treated as professional misconduct indicating that it makes doctors li… [+6649 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Kareena Kapoor, Saif Ali Khan host Star Wars-themed pre b'day bash for Taimur - Hindustan Times", "description": "Kareena Kapoor and Saif Ali Khan hosted Star Wars themed pre-birthday party for their elder son Taimur Ali Khan. Kareena shared pictures from the bash on Instagram handle. | Bollywood", "url": "https://www.hindustantimes.com/entertainment/bollywood/kareena-kapoor-saif-ali-khan-host-star-wars-themed-pre-birthday-bash-for-taimur-ali-khan-see-pics-101671161742838.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/16/1600x900/TaimurAliKhanprebirthdaybashSaifAliKhanKareenaJeh_1671162570589_1671162570786_1671162570786.jpg", "publishedAt": "2022-12-16T04:41:17Z", "content": "Actors Kareena Kapoor and Saif Ali Khan hosted a Star Wars themed pre-birthday bash for their elder son Taimur Ali Khan. Taimur will turn 6 on December 20, 2022. Kareena took to Instagram and shared … [+2387 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shubhangi Palve", "title": "INS Mormugao’s commissioning adds pace to Indian Navy’s 15-year-long fleet expansion programme - Economic Times", "description": "As INS Mormugao officially joins the Indian Navys fleet on December 18, it completes another chapter of the Indian forces long-term perspective plan – The Maritime Capability Perspective Plan. The Indian Navy currently has around 130 vessels and it plans to h…", "url": "https://economictimes.indiatimes.com/prime/economy-and-policy/ins-mormugaos-commissioning-adds-pace-to-indian-navys-15-year-long-fleet-expansion-programme/primearticleshow/96261282.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96261277,width-1070,height-580,imgsize-67598/photo.jpg", "publishedAt": "2022-12-15T22:30:00Z", "content": "Offer Exclusively For You\r\nGet Flat 30% Off\r\nON ET PRIME MEMBERSHIP\r\nAvail Offer\r\nOffer Exclusively For You\r\nGet 1 Year Free\r\nWith 1 and 2-Year ET prime membership\r\nAvail Offer\r\nOffer Exclusively For… [+312 chars]"}, {"source": {"id": null, "name": "Indiaforums.com"}, "author": "Team India Forums", "title": "BB 16: Salman Khan slams Sajid for Abdu's treatment in the prank; Ranveer to appear as well - India Forums", "description": "Salman Khan also slammed the overall treatment on Rozik and how it wasn't nice what they did.", "url": "https://www.indiaforums.com/article/bb-16-salman-khan-slams-sajid-for-abdus-treatment-in-the-prank-ranveer-to-appear-as-well_192666", "urlToImage": "https://img.indiaforums.com/article/1200x675/19/2666-bb-16-salman-khan-slams-sajid-for-abdus-treatment-in-the-prank-ranveer-to-appear-as-well.jpg?c=9hQB1A", "publishedAt": "2022-12-15T19:15:00Z", "content": "It is one of those rare weeks one might say where the focus and slamming from Salman Khan will not be centred around Tina Datta or Shalin Bhanot.\r\nThis time and for the past few days, the talking poi… [+904 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Ketorganix Keto ACV Gummies Reviews: Is Keto Organix ACV Gummy Brand Scam or Legit? - The Tribune India", "description": "A scientific breakthrough has proven that you can shed weight using certain natural ingredients. Conventional weight loss solutions like extreme exercising and dieting are impractical in the modern world. Most people are busy and have little time to count cal…", "url": "https://www.tribuneindia.com/news/brand-connect/ketorganix-keto-acv-gummies-reviews-is-keto-organix-acv-gummy-brand-scam-or-legit-461323", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1830747040.jpg", "publishedAt": "2022-12-15T14:02:00Z", "content": "A scientific breakthrough has proven that you can shed weight using certain natural ingredients. Conventional weight loss solutions like extreme exercising and dieting are impractical in the modern w… [+6780 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Closing Bell: Nifty ends around 18,400, Sensex tanks 879 points; all sectors in the red - Moneycontrol", "description": "All the sectoral indices ended in the red.", "url": "https://www.moneycontrol.com/news/business/markets/share-market-live-updates-stock-market-today-december-15-latest-news-bse-nse-sensex-nifty-covid-coronavirus-kamat-hotels-wipro-dunseri-tea-sbi-jb-pharma-shriram-properties-dilip-buildcon-cineline-9707601.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/Nifty_sensex-1-770x433.jpg", "publishedAt": "2022-12-15T10:28:43Z", "content": "December 15, 2022 / 03:30 PM IST\r\nMarket Close: Benchmark indices ended lower on December 15 with Nifty around 18400.\r\nAt Close, the Sensex was down 878.88 points or 1.40% at 61,799.03, and the Nifty… [+428 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Mallika Soni", "title": "Thailand princess, next in line to throne, ‘suffers heart attack while running’ - Hindustan Times", "description": "Bajrakitiyabha Heart Attack: The princess was reportedly out running with her dogs in the Khao Yai national park when she collapsed. | World News", "url": "https://www.hindustantimes.com/world-news/thailand-bajrakitiyabha-heart-attack-thailand-princess-next-in-line-to-throne-suffers-heart-attack-while-running-101671093581083.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/15/1600x900/0_Thailands-King-Maha-Vajiralongkorn-And-Queen-Sut_1671093751835_1671093752053_1671093752053.jpg", "publishedAt": "2022-12-15T08:45:46Z", "content": "Princess Bajrakitiyabha of Thailand, next in line to the throne is reportedly unlikely to recover after suffering a heart attack. King Vajiralongkorn is believed to have flown by helicopter to be wit… [+1566 chars]"}]}