{"status": "ok", "totalResults": 36, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Sexual harassment charge won't stand if woman wore sexually provocative dresses: Kerala court - The Indian Express", "description": "Writer and social activist Civic Chandran, who had furnished some photographs of the complainant with his bail plea, was granted anticipatory bail on August 12.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-court-sexual-harassment-women-provocative-dress-8094842/", "urlToImage": "https://images.indianexpress.com/2022/08/civic-1.jpg", "publishedAt": "2022-08-17T20:03:18Z", "content": "Granting anticipatory bail to writer and social activist Civic Chandran in a sexual harassment case, the Kozhikode sessions court in Kerala has observed that the charge under Section 354 (A) (sexual … [+3355 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Huge Explosion At Kabul Mosque, Many Casualties Feared - NDTV", "description": "A huge explosion struck a mosque in Kabul during evening prayers on Wednesday, witnesses and police said, with many feared dead or injured.", "url": "https://www.ndtv.com/world-news/huge-explosion-at-kabul-mosque-many-casualties-feared-3263786", "urlToImage": "https://i.ndtvimg.com/i/2017-08/explosion-generic-istock_650x400_81503299504.jpg", "publishedAt": "2022-08-17T19:06:00Z", "content": "The Imam of the mosque was among those killed and the count could still rise. (Representational)\r\nKabul: A huge explosion struck a mosque in Kabul during evening prayers on Wednesday, witnesses and p… [+1205 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "Tushar Kaushik", "title": "Swine flu cases back in TS after gap of three years - Deccan Chronicle", "description": "H1N1 symptoms are headache, cough, cold, stomach pain and diarrhoea, and patients test negative for Covid, bacterial pneumonia", "url": "https://www.deccanchronicle.com/nation/current-affairs/180822/swine-flu-cases-back-in-ts-after-gap-of-three-years.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-p5nckde61qbptirvfssmnidtv1-20220818003119.Medi.jpeg", "publishedAt": "2022-08-17T19:05:00Z", "content": "HYDERABAD: Cases of swine flu or H1N1 have been detected in Telangana after a gap of three years, and are slowly rising, according to officials. The cases usually spread during monsoon, and hospitals… [+1891 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Timi Cantisano", "title": "Samsung quietly changed trade-in values for its Galaxy Z Flip 4 promotion - XDA Developers", "description": "Samsung has quietly changed some of its trade-in pricing for the Galaxy Z Flip 4, potentially giving you less for your trade-in.", "url": "https://www.xda-developers.com/samsung-galaxy-z-flip-4-trade-in-values-change/", "urlToImage": "https://www.xda-developers.com/files/2022/08/Samsung-Galaxy-Z-Flip-4-Lifestyle-Shot_24_306168.jpg", "publishedAt": "2022-08-17T18:40:00Z", "content": "Over the past few years, Samsung has been aggressive when it comes to new smartphone launches, offering trade-in promotions, credits, and other incentives to lure in new and old customers. With the r… [+2418 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Black hole collisions could help us measure how fast the universe is expanding: Astronomers propose 'spectral siren' method to understand evolution of the universe - Science Daily", "description": "Astrophysicists have laid out a method for how to use pairs of colliding black holes to measure how fast our universe is expanding -- and thus help illuminate how the universe evolved, what it is made out of, and where it's going.", "url": "https://www.sciencedaily.com/releases/2022/08/220817104049.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-08-17T18:14:28Z", "content": "A black hole is usually where information goes to disappear -- but scientists may have found a trick to use its last moments to tell us about the history of the universe. In a new study, two Universi… [+4893 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Apple Targets September 7 For iPhone 14 Launch In Flurry Of Devices - NDTV", "description": "Apple Inc. is aiming to hold a launch event on Sept. 7 to unveil the iPhone 14 line, according to people with knowledge of the matter, rolling out the latest version of a product that generates more than half its sales.", "url": "https://www.ndtv.com/world-news/apple-targets-september-7-for-iphone-14-launch-in-flurry-of-devices-3263815", "urlToImage": "https://c.ndtvimg.com/2020-10/s59joum8_apple-generic-reuters-650_625x300_30_October_20.jpg", "publishedAt": "2022-08-17T17:37:52Z", "content": "Apple is updating its flagship product at a precarious time for the industry.\r\nApple Inc. is aiming to hold a launch event on Sept. 7 to unveil the iPhone 14 line, according to people with knowledge … [+4369 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "101Reporters", "title": "4th Phase: CUET-UG cancelled at 13 centres due to technical glitches, over 8600 candidates affected - Moneycontrol", "description": "&quot;Due to some unavoidable technical reasons, examination scheduled for today was cancelled in 13 centres in Shift 1 and Shift 2. A total of 8,693 candidates were affected out of 1.45 lakh candidates. All the affected candidates will get a chance for a ret…", "url": "https://www.moneycontrol.com/news/business/4th-phase-cuet-ug-cancelled-at-13-centres-due-to-technical-glitches-over-8600-candidates-affected-9047231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Exam-1-770x433.jpg", "publishedAt": "2022-08-17T17:32:25Z", "content": "Technical glitches continued to mar the fourth phase of the Central University Entrance Test (CUET)-UG on Wednesday forcing the National Testing Agency (NTA) to cancel the exam at 13 centres affectin… [+3307 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Delhi kept in dark: Manish Sisodia accuses Centre of 'conspiring' to settle Rohingyas - India Today", "description": "Delhi Deputy Chief Minister Manish Sisodia alleged the Centre made a U-turn on providing flats to Rohingya refugees and then blamed it on the city government.", "url": "https://www.indiatoday.in/india/story/delhi-manish-sisodia-allegations-centre-rohingya-refugees-housing-row-1989223-2022-08-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/PTI08_06_2022_000117A_2-647x363.jpeg?VLUqrnhLbeWCqmx2LN26Oc95Qv2eBW6P", "publishedAt": "2022-08-17T17:15:32Z", "content": "Deputy Chief Minister Manish Sisodia on Wednesday claimed the Central government has prepared a blueprint to permanently settle Rohingyas in EWS flats in Bakkarwala, Delhi. Manish Sisodia accused the… [+4529 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA rolls out Artemis Moon Rocket Space Launch System ahead of its launch - DNAIndiaNews", "description": "NASA engineers have completed final tests of the Space Launch System (SLS), clearing the way for the mega moon rocket to roll out to the launch pad today ins...", "url": "https://www.youtube.com/watch?v=wiGSk_2RM0A", "urlToImage": "https://i.ytimg.com/vi/wiGSk_2RM0A/maxresdefault.jpg", "publishedAt": "2022-08-17T17:13:38Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I'm Still Numb,\" Says Bilkis Bano On Release Of Convicts: Full Statement - NDTV", "description": "Bilkis Bano said she was \"bereft of words\" and \"numb\" after 11 men who raped her during the 2002 Gujarat riots, were set free. \"I trusted the highest courts. I trusted the system, and I was learning slowly to live with my trauma,\" she said.", "url": "https://www.ndtv.com/india-news/bilkis-bano-on-release-of-convicts-full-statement-im-still-numb-3263519", "urlToImage": "https://c.ndtvimg.com/2022-08/6v3e9to4_bilkis-bano-afp-650_625x300_17_August_22.jpg", "publishedAt": "2022-08-17T16:57:00Z", "content": "7 members of Bilkis Bano's family, including her daughter, were murdered. She was then raped.(FILE)\r\nNew Delhi: Bilkis Bano said she was \"bereft of words\" and \"numb\" after 11 men who raped her during… [+521 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Thursday: Top 15 things to know before Opening Bell - Moneycontrol", "description": "Based on the open interest future percentage, a short-covering was seen in 73 stocks including JK Cement, ICICI Lombard General Insurance, Muthoot Finance, Eicher Motors, and Coforge", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-thursday-top-15-things-to-know-before-opening-bell-192-9046421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/08/sensex_nifty1-1-770x433.jpg", "publishedAt": "2022-08-17T16:49:58Z", "content": "The consistent buying by FIIs, positive Asian cues and fall in oil prices helped the market reach a nearly four-and-a-half-month high on August 17. Technology, banking and financial services, FMCG, a… [+8987 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "DoT gets Rs 17,876 crore from telecom operators as upfront payment for 5G spectrum - Moneycontrol", "description": "While all telecom operators have opted to make payments in 20 annual instalments, Bharti Airtel has paid Rs 8,312.4 crore equivalent to four annual instalments.", "url": "https://www.moneycontrol.com/news/business/dot-gets-rs-17876-cr-from-telecom-operators-as-upfront-payment-for-5g-spectrum-9047091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/reliance_jio_telecom_720-770x433.jpg", "publishedAt": "2022-08-17T16:36:10Z", "content": "The Department of Telecom has received upfront payment of around Rs 17,876 crore from Bharti Airtel, Reliance Jio, Adani Data Networks and Vodafone Idea for spectrum they won in a recent auction, acc… [+982 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Aamir Khan`s Laal Singh Chaddha sinks at Box Office, earns THIS much on Day 6! - Zee News", "description": "This year has been quite harsh on most of the big budget Bollywood movies, with most of them not performing well at the box office. During this period, many had pinned their hopes on the return of Mr. Perfectionist Aamir Khan to the big screens after a long g…", "url": "https://zeenews.india.com/bollywood/aamir-khan-s-laal-singh-chaddha-sinks-at-box-office-earns-this-much-on-day-6-2498340.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/17/1078904-untitled-design-2022-08-17t213552.707.jpg", "publishedAt": "2022-08-17T16:06:58Z", "content": "This year has been quite harsh on most of the big budget Bollywood movies, with most of them not performing well at the box office. During this period, many had pinned their hopes on the return of \"M… [+1104 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sanjjeev K Samyal", "title": "'Mera naam hi one-day cricket se bana hai. It's all nonsense': Rohit Sharma - Hindustan Times", "description": "Ben Stokes’ decision to quit the format to manage workload only heated up the debate about the future of the one-day game.", "url": "https://www.hindustantimes.com/cricket/mera-naam-hi-one-day-cricket-se-bana-hai-it-s-all-nonsense-rohit-sharma-dismisses-talk-of-odis-losing-their-appeal-101660751610262.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/rohit-pull-odi-getty_1657626371216_1660752055360_1660752055360.jpg", "publishedAt": "2022-08-17T16:03:27Z", "content": "With the Twenty20 leagues mushrooming all over the world offering attractive sums of money to the players, one-day cricket has been put on a weak wicket. The challenge for the 50-over format is to st… [+4951 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Manoj Gupta", "title": "Can India Broker Ceasefire Between Russia and Ukraine? Is NSA Doval in Moscow as Peacemaker? Exclusive Deta - News18", "description": "European powers such as France and Germany, as well as the United States, are counting on New Delhi to coax Moscow into a ceasefire, sources say, indicating that India has allowed itself to be drawn into the role of a facilitator", "url": "https://www.news18.com/news/india/can-india-broker-ceasefire-between-russia-and-ukraine-exclusive-details-of-nsa-dovals-moscow-visit-5770597.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-17t204758.939-166074953416x9.jpg", "publishedAt": "2022-08-17T16:03:00Z", "content": "National Security Adviser Ajit Doval, who is now in Moscow, is expected to try and persuade Russia to accept a détente in its attritional war with Ukraine, top sources familiar with the development t… [+2371 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Monkeypox cases jumped 20% last week to 35,000 across 92 countries: WHO - Hindustan Times", "description": "WHO director-general Tedros Adhanom Ghebreyesus said vaccines may also play an important part in controlling the monkeypox outbreak, and in many countries, there is high demand for vaccines from the affected communities. | World News", "url": "https://www.hindustantimes.com/world-news/monkeypox-cases-jumped-20-in-last-week-to-35-000-across-92-countries-who-101660749372055.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/PERU-HEALTH-VIRUS-MONKEYPOX-6_1660751014187_1660751014187_1660751028900_1660751028900.jpg", "publishedAt": "2022-08-17T15:46:34Z", "content": "More than 35,000 cases of monkeypox have now been reported from 92 countries and territories, with almost 7,500 cases being registered last week - a 20 per cent increase, said World Health Organizati… [+1126 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Sun's 'Cannibal Coronal Mass Ejections’ to trigger geomagnetic storms on August 18 - Moneycontrol", "description": "According to NASA, Coronal Mass Ejections (CMEs) can carry the mass of over 250 elephants and has the energy of 75 trillion lightning strikes.", "url": "https://www.moneycontrol.com/news/trends/suns-cannibal-coronal-mass-ejections-to-trigger-geomagnetic-storms-on-august-18-9046851.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/08/Collage-Maker-17-Aug-2022-09.06-PM-770x435.jpg", "publishedAt": "2022-08-17T15:42:12Z", "content": "Earthlings better brace for geostorms on August 18 as a phenomenon called  Cannibal Coronal Mass Ejections caused by the Sun is likely to result in power grid fluctuations, impact satellite operation… [+2500 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dubbed as 'the Best', Apple iPhone 14 Pro Max specifications leaked - HT Tech", "description": "Apple iPhone 14 Pro Max will be the best and most expensive model of the four models. Here’s what we know so far.", "url": "https://tech.hindustantimes.com/mobile/news/dubbed-as-the-best-apple-iphone-14-pro-max-specifications-leaked-71660750469574.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/17/1600x900/iPhone_13_Pro_Max_(2)_1633406699232_(1)_1652617213091_1660750666283_1660750666283.jpg", "publishedAt": "2022-08-17T15:41:19Z", "content": "The iPhone 14 is just a few weeks away and the rumors and leaks have already been taking over the internet. Out of the four rumored models - iPhone 14, iPhone 14 Max, iPhone 14 Pro and iPhone 14 Pro … [+1500 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Shanker Arnimesh", "title": "Shivraj Singh Chouhan to Yediyurappa, here’s the message from BJP parliamentary board reshuffle - ThePrint", "description": "11-member BJP parliamentary board saw 2 big names being dropped Wednesday, with 6 inductions, including veteran BJP leader B.S. Yediyurappa and Union Minister Sarbananda Sonowal.", "url": "https://theprint.in/politics/shivraj-singh-chouhan-to-yediyurappa-heres-the-message-from-bjp-parliamentary-board-reshuffle/1086839/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/08/ShahNadda.jpg", "publishedAt": "2022-08-17T15:22:10Z", "content": "New Delhi: The BJPs reconstitution of its high-profile parliamentary board Wednesday is an exercise in diversity and aimed at sending a message to the public and party workers, according to senior pa… [+7012 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shehnaaz Gill begs to not be called Punjab Ki Katrina Kaif anymore: 'Galti ho gayi, mujhe maaf kar de' - The Indian Express", "description": "Shehnaaz Gill acquired the moniker Punjab Ki Katrina Kaif during her stint on Bigg Boss 13.", "url": "https://indianexpress.com/article/entertainment/bollywood/shehnaaz-gill-punjab-ki-katrina-kaif-8095981/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-73-1.jpg", "publishedAt": "2022-08-17T15:17:14Z", "content": "Actor-singer Shehnaaz Gill, who acquired the moniker Punjab Ki Katrina Kaif on Bigg Boss 13, said that the title was a ‘mistake’ and that she would just like to be known as Shehnaaz Gill.Recently dur… [+1245 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "New York Times", "title": "Why a century-old vaccine offers new hope against pathogens - Moneycontrol", "description": "The Bacillus-Calmette-Guerin vaccine has long been known to have broad effects on the immune system, and is still given to infants in the developing world and in countries where TB is prevalent.", "url": "https://www.moneycontrol.com/news/trends/health-trends/why-a-century-old-vaccine-offers-new-hope-against-pathogens-9046841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Vaccine-770x433.jpg", "publishedAt": "2022-08-17T14:58:24Z", "content": "In the early days of the COVID-19 pandemic, when prevention seemed light years away, several scientists launched trials to see whether a tuberculosis vaccine developed in the early 1900s might protec… [+6948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Panch pran vs panch kaam: Kejriwal takes off gloves, pitches himself directly as Modi challenger - The Indian Express", "description": "Arvind Kejriwal's prans: Free quality education; free quality healthcare; jobs for all; equal rights, security and respect for women; right price for farmer produce", "url": "https://indianexpress.com/article/political-pulse/kejriwal-takes-off-gloves-pitches-himself-directly-as-modi-challenger-8096054/", "urlToImage": "https://images.indianexpress.com/2022/08/kejriwal-1-3.jpg", "publishedAt": "2022-08-17T14:52:18Z", "content": "If the idea was to leave no room for any ambiguity about his overarching political ambition for the 2024 general elections, the Delhi Chief Minister and Aam Aadmi Party (AAP) national convener, Arvin… [+4159 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "On criminal cases against Bihar's new law minister, Nitish says 'I don’t know' - Hindustan Times", "description": "BJP leaders, including party's Rajya Sabha MP Sushil Kumar Modi and former Union minister Ravi Shankar Prasad, have slammed Bihar CM Nitish Kumar for inducting Kartikeya Singh as the new law minister and have also called for his removal from the state cabinet…", "url": "https://www.hindustantimes.com/india-news/on-criminal-cases-against-bihar-s-new-law-minister-nitish-kumar-says-i-don-t-know-101660738087396.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/bihar_nitish_kumar_kartikeya_singh_criminal_case_1660745594975_1660745595921_1660745595921.jpg", "publishedAt": "2022-08-17T14:29:26Z", "content": "Bihar chief minister Nitish Kumar said on Wednesday he had no idea about the state's new law minister Kartikeya Singh being involved in criminal cases. Kumar's statement came amid BJPs allegations of… [+3174 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"Got Most 100s After Virat And Rohit\": Robin Uthappa Names A \"Stalwart\" In ODIs - NDTV Sports", "description": "Robin Uthappa identified Shikhar Dhawan as one of India's stalwarts in the 50-over format, and explained why he does not see Shubman Gill opening the batting in the series against Zimbabwe.", "url": "https://sports.ndtv.com/zimbabwe-vs-india-2022/got-most-100s-after-virat-and-rohit-robin-uthappa-names-a-stalwart-in-odis-3263110", "urlToImage": "https://c.ndtvimg.com/2022-07/sqb9t7ao_rohit-sharma-shikhar-dhawan-afp_625x300_17_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-08-17T14:20:54Z", "content": "Team India will be squaring off against Zimbabwe in a three-match ODI series, beginning Thursday in Harare. The likes of Sanju Samson, Deepak Hooda, and Ishan Kishan will have a chance to prove thems… [+3490 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Huge asteroid, clocked at an amazing 64800kmph, sets up close encounter with Earth on August 22 - HT Tech", "description": "NASA has warned that Asteroid 2020 QW3 has been observed heading for Earth at staggering speed. It will miss Earth by just a few million miles.", "url": "https://tech.hindustantimes.com/tech/news/huge-asteroid-clocked-at-an-amazing-64800kmph-sets-up-close-encounter-with-earth-on-august-22-71660744550305.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/17/1600x900/asteroid-6025507_1920_1648098187847_1660744600734_1660744600734.jpg", "publishedAt": "2022-08-17T13:58:08Z", "content": "A 92 feet wide asteroid named Asteroid 2020 QW3, nearly the size of an aeroplane, will just miss Earth on August 22. The close encounter between the Earth and the asteroid will happen at 06:41am, acc… [+1727 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Obviously of India's interest: Jaishankar on Chinese vessel docked at Lanka port - Hindustan Times", "description": "EAM S Jaishankar said any development in India's neighbourhood that would have a bearing on its security will be monitored by the country.  | Latest News India", "url": "https://www.hindustantimes.com/india-news/obviously-of-interest-to-india-jaishankar-on-chinese-vessel-docked-at-lankan-port-101660742423415.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/AP08-17-2022-000106B-0_1660744268828_1660744268828_1660744307638_1660744307638.jpg", "publishedAt": "2022-08-17T13:53:26Z", "content": "External affairs minister S Jaishankar on Wednesday said any development in India's neighbourhood that would have a bearing on its security will be monitored by the country as a high-tech Chinese res… [+1747 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Jenny Blair, MD", "title": "Existing Monkeypox Guidelines Are Almost All of Low Quality - Medscape", "description": "After a seven-language search of mainstream and gray medical literature, researchers found 14 guidelines, most without detail or plans for an update.", "url": "https://www.medscape.com/viewarticle/979313", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220817_Monkeypox_treatment_800x450.jpg", "publishedAt": "2022-08-17T13:50:36Z", "content": "Evidence-based guidance is scant for clinicians treating patients who have monkeypox, and much of what is available is of low quality, according to a new systematic review.\r\nAn international research… [+5669 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Blackstone to likely sell Sona BLW shares worth Rs 4,000 crore in block deal tomorrow - Moneycontrol", "description": "Blackstone, which holds 34.12 percent stake in the Indian auto ancillaries company, will likely sell a 13.6 percent stake", "url": "https://www.moneycontrol.com/news/business/companies/blackstone-to-likely-sell-sona-blw-shares-worth-rs-4000-crore-in-block-deal-tomorrow-9046211.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/04/RTSDKHE-770x433.jpg", "publishedAt": "2022-08-17T12:46:41Z", "content": "Private equity firm Blackstone via its affiliate - Singapore VII Topco III PTE - may exit part of its stake in Sona BLW Precision Forgings Ltd via block deal on August 18. It is likely to raise Rs 4,… [+1793 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Rohit KVN", "title": "Vivo V25 Pro 5G: First impression - Deccan Herald", "description": "Popular handset-maker Vivo on Wednesday (August 17) unveiled the V25 Pro 5G series smartphone in India. The new Vivo V25 Pro 5G comes in two configurations-- 8GB RAM + 128GB and 12GB RAM + 256GB storage-- for Rs 35,999 and Rs 39,999, respectively. It will be …", "url": "https://www.deccanherald.com/business/technology/vivo-v25-pro-5g-first-impression-1136931.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/17/v25p5g-cov-sho-sel-1-1136931-1660740200.jpg", "publishedAt": "2022-08-17T12:43:20Z", "content": "Popular handset-maker Vivo on Wednesday (August 17) unveiled the V25 Pro 5G series smartphone in India.\r\nThe new Vivo V25 Pro 5G comes in two configurations-- 8GB RAM + 128GB and 12GB RAM + 256GB sto… [+3972 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Koffee With Karan 7: What Vicky Kaushal Told The Pandit At His Wedding To Katrina Kaif - NDTV", "description": "Vicky Kaushal and Sidharth Malhotra will feature in the upcoming episode of Koffee With Karan 7", "url": "https://www.ndtv.com/entertainment/koffee-with-karan-7-what-vicky-kaushal-told-the-pandit-at-his-wedding-to-katrina-kaif-3262575", "urlToImage": "https://c.ndtvimg.com/2022-08/96c4irlg_vicky-kaushal_625x300_17_August_22.jpg", "publishedAt": "2022-08-17T12:16:23Z", "content": "A picture from Vicky Kaushal and Katrina Kaif's wedding album. (courtesy: vickykaushal09)\r\nVicky Kaushal, who got married to Katrina Kaif last year in December, has revealed some insights into his we… [+1559 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akasa Air, India's Youngest Airline, To Add One Aircraft Every Two Weeks - NDTV Profit", "description": "New entrant Akasa Air is financially strong enough to place an aircraft order in the 18 next months that will be significantly larger than its first, its founder and CEO Vinay Dube said on Wednesday.", "url": "https://www.ndtv.com/business/akasa-air-strong-enough-to-place-significantly-larger-aircraft-order-in-next-18-months-ceo-dube-3262172", "urlToImage": "https://c.ndtvimg.com/2022-07/d12u40j8_akasa-air-generic-650_625x300_22_July_22.jpg", "publishedAt": "2022-08-17T10:46:52Z", "content": "Akasa Air strong to place significantly larger aircraft order in next 18 months: CEO\r\nNew Delhi: New entrant Akasa Air is financially strong enough to place an aircraft order in the 18 next months th… [+2375 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Vijay Deverakonda’s mother performs pooja at home with Ananya Panday. See pics - Hindustan Times", "description": "Vijay Deverakonda took to Twitter to share pictures with his mom and Ananya Panday after a pooja at his Hyderabad home. Ananya also thanked his mother in a sweet note on Instagram.  | Bollywood", "url": "https://www.hindustantimes.com/entertainment/bollywood/vijay-deverakonda-s-mother-performs-pooja-at-home-with-ananya-panday-see-pics-101660726210969.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/Vijay_Deverakonda_mother_performs_pooja_Ananya_Panday_1660726302434_1660726335079_1660726335079.jpg", "publishedAt": "2022-08-17T09:11:54Z", "content": "Vijay Deverakonda and Ananya Panday have been on a pan-India promotional tour for their upcoming film Liger. Vijays mother, Madhavi Deverakonda, on Wednesday performed a pooja at their Hyderabad home… [+2106 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "ESPNcricinfo staff", "title": "Full members to play more international cricket in ICC's new FTP cycle - ESPNcricinfo", "description": "The 12 Full Members will play a total of 777 international matches between 2023 and 2027, compared to 694 in the current FTP cycle", "url": "https://www.espncricinfo.com/story/icc-mens-ftp-india-and-australia-to-play-five-test-series-in-both-2023-25-and-2025-27-cycles-1329462", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/313900/313946.6.jpg", "publishedAt": "2022-08-17T08:28:17Z", "content": "Australia will host India for five Tests in the 2023-25 cycle, and then travel to India for five Tests in the 2025-27 cycle  •  Patrick Hamilton/AFP/Getty Images"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Debabrata Mohanty", "title": "Odisha floods: Over 250,000 people across 10 districts affected - Hindustan Times", "description": "Eighteen teams of Odisha Disaster Rapid Action Force, National Disaster Response Force and 44 of fire personnel have been deployed for rescue operations", "url": "https://www.hindustantimes.com/cities/others/odisha-floods-over-250000-people-across-10-districts-affected-101660711778730.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/17/1600x900/2f80c5a0-1de7-11ed-8c4d-fc6273086eb8_1660711767100.jpg", "publishedAt": "2022-08-17T04:49:38Z", "content": "Floods have affected over 250,000 people in at least 1,400 villages across Odishas 10 districts as heavy rainfall in the upper and lower catchment areas of the Mahanadi swelled the river and led to b… [+1484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Saudi woman sentenced to 34 years in prison for following, retweeting dissidents on Twitter - The Indian Express", "description": "The ruling is reportedly one of the longest prison sentences given to a Saudi woman's rights defender.", "url": "https://indianexpress.com/article/world/saudi-woman-34-years-prison-for-following-retweeting-dissidents-twitter-8094453/", "urlToImage": "https://images.indianexpress.com/2022/08/shehab.jpg", "publishedAt": "2022-08-17T03:39:04Z", "content": "A 34-year-old Saudi woman, arrested last year, has been sentenced to 34 years in prison for reportedly following and retweeting dissidents and activists on Twitter, prompting human rights organisatio… [+3672 chars]"}, {"source": {"id": null, "name": "Newindian.in"}, "author": "Alok Singh", "title": "EXCLUSIVE AUDIO TAPES: FIFA Bans India, Did Praful Patel Plot This In Advance? - The New Indian", "description": "Amidst a row over the letter \"arranged\" by former Indian football chief and NCP leader Praful Patel on the FIFA ban, two purported audio tapes created havoc in political as well as administrative circles on Tuesday", "url": "https://newindian.in/exclusive-audio-tapes-fifa-bans-india-did-praful-patel-plot-this-in-advance/", "urlToImage": "https://newindian.in/wp-content/uploads/2022/08/FEATURE_Praful-Patel.jpg", "publishedAt": "2022-08-17T02:06:32Z", "content": "NEW DELHI: Amidst a row over worlds ace body for football management, FIFA, announcing a ban for the All India football federation (AIFF), two purported audio tapes have created havoc in political as… [+6652 chars]"}]}