{"status": "ok", "totalResults": 34, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Modi Nepal Visit Live: Opportunity to strengthen ties, says MEA as Modi, Deuba hold bilateral talks in Lumbini - The Indian Express", "description": "PM Modi Nepal Visit Latest Updates:  \"Happy to be among the wonderful people of Nepal on the special occasion of Buddha Purnima. Looking forward to the programmes in Lumbini,\" PM Modi tweeted.", "url": "https://indianexpress.com/article/india/pm-narendra-modi-nepal-visit-live-updates-buddhist-centre-deuba-7919233/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-deuba-bilateral.jpg", "publishedAt": "2022-05-16T08:21:35Z", "content": "The site for Indias Buddhist cultural centre. (Express photo by Yubaraj Ghimire)\r\nThe construction of the India International Centre for Buddhist Culture &amp; Heritage to be undertaken by the Intern… [+1082 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Skin lesions, hearing loss: Four strange Covid-19 symptoms you might not have heard about - Economic Times", "description": "With the rise of new variants, the symptoms of Covid have also evolved.", "url": "https://economictimes.indiatimes.com/magazines/panache/skin-lesions-hearing-loss-four-strange-covid-19-symptoms-you-might-not-have-heard-about/articleshow/91592417.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91592636,width-1070,height-580,imgsize-57276,overlay-etpanache/photo.jpg", "publishedAt": "2022-05-16T08:21:00Z", "content": "Well over two years into the pandemic, hundreds of thousands of Covid cases continue to be recorded around the world every day. \r\nWith the rise of new variants, the symptoms of Covid have also evolve… [+5363 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "High Cholesterol: What is It And Some Warning Signs - News18", "description": "When LDL in your blood increases due to the consumption of high fat foods, the condition is known as high cholesterol.", "url": "https://www.news18.com/news/lifestyle/high-cholesterol-what-is-it-and-some-warning-signs-5170795.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/heart-health-164302928316x9.jpg", "publishedAt": "2022-05-16T08:04:27Z", "content": "Cholesterol is a fatlike substance produced by the liver. It helps in the formation of cell membranes, hormones, and Vitamin D. As cholesterol is insoluble in water, it cannot travel on its own in th… [+1826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: Running bulldozers not a solution… no need to do ‘dadagiri’, says CM after meet on anti-encroachment drives - The Indian Express", "description": "Delhi Temperature Today, Weather Forecast, Delhi Coronavirus Update, Delhi Crime News Updates, Petrol, Diesel price in Delhi, Demolition drive Updates, Delhi Water Crisis: Two days after 27 people died inside a four-storey commercial building near the metro s…", "url": "https://indianexpress.com/article/cities/delhi/delhi-mundka-fire-news-live-updates-death-toll-injured-7916562/", "urlToImage": "https://images.indianexpress.com/2022/05/Kejriwal-3.jpg", "publishedAt": "2022-05-16T07:38:12Z", "content": "Firefighters try to douse a fire which broke out in a building at Mundka, in West Delhi, Friday, May 13, 2022.\r\nDelhi Chief Minister Arvind Kejriwal has announced a compensation of Rs 10 lakh each fo… [+2052 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Pranob Mehrotra", "title": "WhatsApp might soon add support for rich link previews in status updates - XDA Developers", "description": "WhatsApp is reportedly working on a new feature that will automatically generate rich link previews in status updates. Read on to learn more.", "url": "https://www.xda-developers.com/whatsapp-status-rich-link-previews/", "urlToImage": "https://www.xda-developers.com/files/2021/04/whatsapp-892926_1280.jpg", "publishedAt": "2022-05-16T07:27:00Z", "content": "WhatsApp is reportedly working on a new feature that will automatically convert URLs shared as a status into rich link previews. WABetaInfo has spotted the in-development feature in the latest WhatsA… [+1593 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reported By Rica Roy", "title": "HS Prannoy Tells NDTV How A WhatsApp Group Helped In India's Historic Thomas Cup Win - NDTV Sports", "description": "India had scripted history on Sunday after the men's team won the Thomas Cup for the very first time", "url": "https://sports.ndtv.com/badminton/hs-prannoy-tells-ndtv-how-a-whatsapp-group-helped-in-indias-historic-thomas-cup-win-2979517", "urlToImage": "https://c.ndtvimg.com/2022-05/vid2idqo_hs-prannoy-_625x300_16_May_22.jpg", "publishedAt": "2022-05-16T07:21:31Z", "content": "India made history on Sunday by winning the Thomas Cup for the first time with a stunning 3-0 win over defending champions Indonesia in the final. India, competing in their debut final of the men's t… [+2775 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Pritam Saha", "title": "National Dengue Day: What to eat and what to avoid, check diet plan to follow for faster recovery - Zee News", "description": "Why does it occur? Dengue fever is caused by the female Aedes mosquito-borne virus. They lay their eggs inside the water pot and fertilizes along the wet walls. And in 2 to 7 days, dryworms come out of them.", "url": "https://zeenews.india.com/india/national-dengue-day-what-to-eat-and-what-to-avoid-diet-plan-to-follow-for-faster-recovery-2464013.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/16/1043067-webp.net-resizeimage-52.jpg", "publishedAt": "2022-05-16T07:18:49Z", "content": "Dengue is a viral infection. Which is transmitted to humans through a type of mosquito bite. Only the female Aedes aegypti mosquitoes can spread the dengue virus and in fact, these mosquitoes can tra… [+12741 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Assam Floods and Landslides: At Least Three People Dead, Several Missing; Very Heavy Rains to Continue All Week | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Estimates suggest 57,000 individuals, 222 villages in Assam have been impacted by heavy rains, with around 10321.44 hectares of cultivated land being submerged under floodwaters. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/news/news/2022-05-16-at-least-three-people-dead-several-missing-in-assam-floods-and", "urlToImage": "https://s.w-x.co/in-assamfloods_9_0.jpg", "publishedAt": "2022-05-16T06:46:57Z", "content": "Assam faces the annual calamity of floods during the monsoon months, when incessant rains batter the northeastern state. But the yearly event seems to have arrived early this year, with Assam already… [+3996 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gyanvapi Mosque Complex Filming Ends, Lawyer Claims Shivling Found In Pond - NDTV", "description": "The mosque is located close to the iconic Kashi Vishwanath temple and the local court is hearing a plea by a group of women seeking permission for daily prayers before the idols on its outer walls.", "url": "https://www.ndtv.com/india-news/gyanvapi-mosque-in-varanasi-survey-completed-day-before-court-hearing-2979607", "urlToImage": "https://c.ndtvimg.com/2022-05/jefcejic_gyanvapi-mosque-varanasi-gyanvapi-masjid-varanasi-pti_625x300_14_May_22.jpg", "publishedAt": "2022-05-16T06:18:00Z", "content": "The last day of filming began this morning amid tight security.\r\nVaranasi, Uttar Pradesh: The court-mandated three-day videography survey of the Gyanvapi Masjid complex in Uttar Pradesh's Varanasi ha… [+3025 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Char Dham Yatra: 39 Pilgrims Have Died So Far, Govt Says. News18 Explains Why the Journey is Risky & What t - News18", "description": "The risks involved in the Yatra would perhaps be the same as any mountainous journey - Low humidity, high UV radiation, low air pressure, and low oxygen levels", "url": "https://www.news18.com/news/india/char-dham-yatra-39-pilgrims-have-died-so-far-govt-says-news18-explains-why-the-journey-is-risky-5181451.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-2022-05-16t112853.143-165268098716x9.jpg", "publishedAt": "2022-05-16T06:03:48Z", "content": "Thirty-nine pilgrims have died on the Char Dham Yatra route so far, officials said on Monday. The pilgrimage journey in Uttarakhand had resumed earlier and has seen a huge influx of people.\r\nDG Healt… [+4084 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Garena Free Fire MAX redeem codes for today, May 16: Check how to get free rewards - Zee News", "description": "Here are the May 16 free codes FBNJ-I87Y-6TGH FTRF-VBHJ-FI87 FSER-5T6Y-7U8I FBHJ-UYTR-FICV XM5L-93V3-8NGX 732O-IF59-VMZ1 NV94-4T60-B9GK FFA0-ES11-YL2D FFX6-0C2I-IVYU FJKI-8U7Y-6TRF FIH8-FS76-F5TR FBJK-I9Z7-F65R FFXV-GG8N-U4YB FFE4-E0DI-KX2D FF22-NYW9-4A00 Pla…", "url": "https://zeenews.india.com/technology/garena-free-fire-max-redeem-codes-for-today-may-16-check-how-to-get-free-rewards-2463987.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/05/16/1043034-garenafreefiremax.gif", "publishedAt": "2022-05-16T06:01:41Z", "content": "The codes for May 16 (Monday) are out and can be used by the players to claim Garena Free Fire Max game for free. However, one thing that needs to be noted is that these codes would get expired withi… [+1531 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone tips: Add your driver's license to iPhone or Apple Watch- Here's how - HT Tech", "description": "Show your driver's license using your iPhone or Apple Watch. Here is how you can add the same.", "url": "https://tech.hindustantimes.com/how-to/iphone-tips-add-your-driver-s-license-to-iphone-or-apple-watch-here-s-how-71652678695464.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/16/1600x900/1_1646716627796_1652678881322.jpg", "publishedAt": "2022-05-16T05:38:04Z", "content": "Having your own vehicle can help you reach places you want without getting late. If you are travelling with your own vehicle you also need to carry your driving license. Keeping an original driving l… [+2818 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Owaisi, Even A Dog Won't Pee On Aurangzeb's Identity\": Devendra Fadnavis - NDTV", "description": "Maharashtra Leader of Opposition Devendra Fadnavis yesterday compared the Maha Vikas Aghadi (MVA) government to a Babri-like structure and said he would not rest till he brings it down.", "url": "https://www.ndtv.com/india-news/saffron-will-rule-devendra-fadnavis-aurangzeb-jab-at-asaduddin-owaisi-2979328", "urlToImage": "https://c.ndtvimg.com/2022-05/ro6thkvo_devendra-fadnavis_625x300_16_May_22.jpg", "publishedAt": "2022-05-16T05:23:00Z", "content": "Former CM Devendra Fadnavis also targeted the Uddhav Thackeray-led government. PTI\r\nMumbai: Maharashtra Leader of Opposition Devendra Fadnavis yesterday compared the Maha Vikas Aghadi (MVA) governmen… [+1869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Scientists propose ‘invisible barriers’ in space to explain ‘planes of satellite galaxies’ - The Indian Express", "description": "These invisible barriers or invisible walls could help explain how smaller satellite galaxies orbiting larger ones are often arranged into flat disks.", "url": "https://indianexpress.com/article/technology/science/scientists-propose-invisible-barriers-in-space-to-explain-planes-of-satellite-galaxies-7919360/", "urlToImage": "https://images.indianexpress.com/2022/05/Invisible-barriers-space-milky-way-other-galaxies.jpg", "publishedAt": "2022-05-16T04:59:40Z", "content": "There are many things in space that humanity is yet to fully understand and one of these is are planes of satellite galaxies around the Milky Way and surrounding galaxies. But researchers at the Univ… [+2017 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "BTS wins three awards at 2022 Billboard Music Awards - Arirang News", "description": "BTS, 빌보드 뮤직어워즈 3관왕 기염…6년 연속 수상BTS has picked up three trophies at the 2022 Billboard Music Awards.The group has now won at least one Billboard Music Awards f...", "url": "https://www.youtube.com/watch?v=UlmTzl8DqS0", "urlToImage": "https://i.ytimg.com/vi/UlmTzl8DqS0/maxresdefault.jpg", "publishedAt": "2022-05-16T04:49:07Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "LIC Listing: LIC Risks Listing Lower On Stock Exchanges Tomorrow: 10 Points - NDTV Profit", "description": "The Life Insurance Corporation's (LIC) record Rs 21,000 crore initial public offering (IPO) received tremendous demand; however, the insurance behemoth risks listing its shares at a lower price on stocks exchanges on Tuesday.", "url": "https://www.ndtv.com/business/lic-listing-lic-risks-listing-lower-on-stock-exchanges-tomorrow-5-points-2979444", "urlToImage": "https://c.ndtvimg.com/2021-09/ii6e5d6_life-insurance-corporation-reuters_625x300_15_September_21.jpg", "publishedAt": "2022-05-16T04:27:20Z", "content": "<li>LIC has priced its public offer, India's largest-ever, at the top of the indicated range (Rs 902-949), at Rs 949, based on the allotment news. But the premium for LIC shares in the grey market ha… [+2408 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Anulekha Ray", "title": "SBI Hikes MCLR Again, Twice In A Month; How Will It Impact Home, Auto Loan EMIs? - News18", "description": "SBI MCLR Hike: You have to shell more for equated monthly instalment (EMI) for home loans and personal loans. Know How it SBI's latest jump in MCLR will impact your", "url": "https://www.news18.com/news/business/savings-and-investments/sbi-hikes-mclr-from-again-second-rate-increase-in-a-month-home-loans-to-get-costlier-5181145.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/sbi2-165087338916x9.jpg", "publishedAt": "2022-05-16T04:27:00Z", "content": "State Bank of India or SBI has increased its marginal cost of lending rate (MCLR) by 10 basis points across tenures. The new rates will be effective from Sunday, May 15. This is the second rate hike … [+2590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut explains what ‘Bollywood bimbo’ means, mocks Ananya Panday’s ‘talent’ of touching her nose with tongue. Watch - The Indian Express", "description": "Kangana Ranaut poked fun at Ananya Panday's 'talent' on The Kapil Sharma Show. She even mocked her by mimicking her voice.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-mocks-ananya-panday-bolly-bimbo-the-kapil-sharma-show-watch-7919257/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-ranaut-ananya-panday-1200.jpg", "publishedAt": "2022-05-16T04:15:09Z", "content": "Kangana Ranaut’s unfiltered appearance on a recent episode of The Kapil Sharma Show was full of her confessions about Bollywood, including taking a jibe at many stars. And one such was Ananya Panday.… [+1418 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Vicky Kaushal's Birthday, Brother Sunny Shares An Unseen Pic From Vicky-Katrina's Wedding Album - NDTV", "description": "Vicky Kaushal's father Sham Kaushal has also dropped an adorable post wishing his puttar", "url": "https://www.ndtv.com/entertainment/on-vicky-kaushals-birthday-brother-sunny-shares-an-unseen-pic-from-vicky-katrinas-wedding-album-2979408", "urlToImage": "https://c.ndtvimg.com/2022-05/v0cdfqog_vicky-kaushal_625x300_16_May_22.jpg", "publishedAt": "2022-05-16T04:13:34Z", "content": "Sunny poses with brother Vicky. (courtesy: sunsunnykhez)\r\nVicky Kaushal has turned a year older today (May 16), and his younger brother Sunny Kaushal has dropped an adorable yet funny picture to wish… [+1653 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"Storm In A Teacup\": CSK Coach Stephen Fleming On Ambati Rayudu's Deleted \"My Last IPL\" Tweet - NDTV Sports", "description": "Ambati Rayudu had announced on Twitter about IPL 2022 being his last season in the tournament, but he deleted the tweet soon after.", "url": "https://sports.ndtv.com/ipl-2022/storm-in-a-teacup-csk-coach-on-ambati-rayudu-incident-2979331", "urlToImage": "https://c.ndtvimg.com/2020-09/m381nep4_csk-coach-stephen-fleming-bcciipl_625x300_26_September_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-16T04:08:20Z", "content": "Chennai Super Kings batter Ambati Rayudu caused quite a stir on Saturday as he first tweeted that the ongoing Indian Premier League (IPL) 2022 season would be his last in the tournament. However, an … [+1855 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Local man tried to save Australian cricketer Andrew Symonds after car accident - Times of India", "description": "Cricket News: Former Australia cricketer Andrew Symonds died at 46 following the single-car accident late on Saturday near Townsville in Queensland state. Local res", "url": "https://timesofindia.indiatimes.com/sports/cricket/news/local-man-tried-to-save-australian-cricketer-andrew-symonds-after-car-accident/articleshow/91586150.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91586188,width-1070,height-580,imgsize-65362,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-16T03:16:00Z", "content": "Andrew Symonds: Australian all-round great loved by teammatesAndrew Symonds, who died on Saturday night in a car crash aged 46, was instantly recognisable on the cricket field with a mop of dreadlock… [+77 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online and Agencies", "title": "Jet fuel prices hiked by 5% to new record high in Delhi - Economic Times", "description": "Fuel rates have been increased in India because energy prices globally have risen on the back of supply concerns following Russia's invasion of Ukraine and demand returning after being hit by the pandemic. India is 85 per cent dependent on imports to meet its…", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/jet-fuel-prices-hiked-by-5-to-new-record-high/articleshow/91585809.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91585970,width-1070,height-580,imgsize-37686,overlay-economictimes/photo.jpg", "publishedAt": "2022-05-16T03:04:00Z", "content": "Aviation turbine fuel (ATF) prices were hiked by 5 percent, taking it to Rs.1.23 lakh per kilolitre in the national capital, according to state owned fuel retailers, . \r\nIn the nine hikes beginning J… [+1284 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "A lowdown as Congress mega conclave ends - October march among big announcements - Hindustan Times", "description": "Congress Chintan Shivir: The three-day mega conclave was held with an eye on the 2024 Lok Sabha elections.  | Latest News India", "url": "https://www.hindustantimes.com/india-news/congress-chintan-shivir-bharat-jodo-yatra-among-highlights-a-lowdown-101652669660824.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/16/1600x900/c8f0d0ec-d47a-11ec-b554-e941ca2800e7_1652638648781_1652669725087.jpg", "publishedAt": "2022-05-16T03:00:30Z", "content": "A taskforce to drive internal reforms was announced by Sonia Gandhi on Sunday as the Congress held the last day of its 3-day Chintan Shivir with an eye on the 2024 Lok Sabha elections. Among the high… [+4148 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "US witnesses 2 shootings in 48 hours, concerns over gun violence again: 5 points - Hindustan Times", "description": "UN chief Antonio Guterres condemned the shooting at a grocery store in a predominately Black neighbourhood in New York State, his spokesman said Sunday. | World News", "url": "https://www.hindustantimes.com/world-news/us-witnesses-2-shootings-in-48-hours-concerns-over-gun-violence-again-5-points-101652665885978.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/16/1600x900/California-Church-Shooting-9_1652668671368_1652668715188.jpg", "publishedAt": "2022-05-16T02:41:39Z", "content": "The United States witnessed two mass shootings within 48 hours, one of which was confirmed as racially motivated. In the Buffalo supermarket shooting, the gunman, identified as a white 18-year-old ma… [+1821 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "Watch: Ashwin's attempted sacrifice backfires, replays spell doom for Neesham - Hindustan Times", "description": "The incident took place in the 18th over of the RR innings bowled by Ravi Bishnoi, as the duo tried to steal a quick single.", "url": "https://www.hindustantimes.com/cricket/watch-r-ashwin-attempted-sacrifice-backfires-replays-result-in-run-out-of-jimmy-neesham-in-lsg-vs-rr-ipl-2022-match-101652631070980.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/15/1600x900/ash_1652633219165_1652633243358.jpg", "publishedAt": "2022-05-16T01:53:49Z", "content": "Rajasthan Royals (RR) spinner R Ashwin was involved in a unique run-out situation during the Indian Premier League (IPL) clash against Lucknow Super Giants, which the former won by 24 runs. In a bid … [+2570 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Gloria Methri", "title": "SpaceX launches two Falcon 9 rockets with 53 Starlink satellites each in a single day - Republic World", "description": "SpaceX on May 14, launched a rocket carrying 53 satellites for the Starlink internet constellation from California, its second such effort in less than 24 hours", "url": "https://www.republicworld.com/science/space/spacex-launches-two-falcon-9-rockets-with-53-starlink-satellites-each-in-a-single-day-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/1rdteaydnjymhibr_1652663883.jpeg", "publishedAt": "2022-05-16T01:33:00Z", "content": "SpaceX on Saturday, May 14, launched a rocket carrying 53 satellites for the Starlink internet constellation from California, its second such effort in less than 24 hours. \r\nThe two-stage Falcon 9 ro… [+2274 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 5 Injured In US Church Shooting, Second In 2 Days - NDTV", "description": "One person was dead and four people were \"critically\" injured in a shooting at a church near Los Angeles, law enforcement said Sunday, just one day after a gunman killed 10 people at a grocery store in New York state.", "url": "https://www.ndtv.com/world-news/us-church-shooting-us-shooting-news-1-killed-5-injured-in-us-church-shooting-second-in-2-days-2979258", "urlToImage": "https://c.ndtvimg.com/2022-05/40scnhv_us-church-shooting-afp-650_625x300_16_May_22.jpg", "publishedAt": "2022-05-16T01:15:59Z", "content": "US Church Shooting: Another person sustained \"minor\" injuries, the department said.\r\nLos Angeles: One person was dead and four people were \"critically\" injured in a shooting at a church near Los Ange… [+1580 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Mercury breaches 49 degree mark in North India; heavy rainfall predicted in Kerala - Times of India", "description": "India News: NEW DELHI: An intense heatwave scorched parts of north India on Sunday with places in Delhi and Uttar Pradesh recording 49 degrees Celsius and above w.", "url": "https://timesofindia.indiatimes.com/india/mercury-breaches-49-degree-mark-in-north-india-heavy-rainfall-predicted-in-kerala/articleshow/91581768.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91581761,width-1070,height-580,imgsize-86548,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-15T17:47:00Z", "content": "Mercury breaches 49 degree mark in North India; heavy rainfall predicted in Kerala"}, {"source": {"id": null, "name": "The Statesman"}, "author": "SNS", "title": "Plants are growing in moon soil - The Statesman", "description": "“We first asked the question of whether plants can grow in the regolith. And second, how might that one day help humans have an extended stay on the Moon.”", "url": "https://www.thestatesman.com/features/plants-growing-moon-soil-1503072392.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/09/Why-the-Moon’s-wobble-matters.jpg", "publishedAt": "2022-05-15T15:29:54Z", "content": "Decades after humans last visited the moon in the Appolo mission the lunar soil sample was collected, and we now know that it’s possible to cultivate the soil there. This is the first time plants hav… [+1320 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN National Desk", "title": "Arvind Kejriwal announces alliance with Kerala's Twenty20 Party; promises free power if elected to power - Times Now", "description": "Arvind Kejriwal said now, there will be four political alliances in Kerala - LDF, UDF, NDA \"and the name of our alliance will be People's Welfare Alliance\". In the last assembly elections held in 2021, the Left-led alliance returned to power for the second co…", "url": "https://www.timesnownews.com/india/arvind-kejriwal-announces-alliance-with-keralas-twenty20-party-promises-free-power-if-elected-to-power-article-91579972", "urlToImage": "https://static.tnn.in/thumb/msid-91579972,imgsize-100,width-1280,height-720,resizemode-75/91579972.jpg", "publishedAt": "2022-05-15T14:27:35Z", "content": "Don't understand tie-up of 10, 20 parties to defeat anyone, will only form alliance with 130 crore Indians: Kejriwal"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "2 Sikhs shot dead in Peshawar, terror group ISKP claims attack - India Today", "description": "Islamic State Wilayah Khorasan (ISKP) has claimed responsibility for the deaths of two Sikh businessmen in Pakistan. They were shot dead in broad daylight on Sunday.", "url": "https://www.indiatoday.in/world/story/sikh-businessmen-shot-dead-pakistan-islamic-states-claims-responsibility-1949792-2022-05-15", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202205/pjimage__94__0-647x363.jpeg?xBxK8nGykfm5kuxLfISITmSksphk84mC", "publishedAt": "2022-05-15T14:23:40Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Explained: Why Finland wants to join NATO; why is Putin against it? - Hindustan Times", "description": "Russia and Finland share a 1,300-km border. If Finland joins, it would double the length of the alliance’s border with Russia. | World News", "url": "https://www.hindustantimes.com/world-news/explained-why-finland-wants-to-join-nato-why-is-putin-against-it-101652617082634.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/15/1600x900/Finland-NATO-5_1652617361736_1652617381250.jpg", "publishedAt": "2022-05-15T12:25:36Z", "content": "Finland President Sauli Niinisto confirmed on Sunday that his country will apply for membership of the Intergovernmental organisation (NATO) military alliance, in a historic policy shift prompted by … [+2637 chars]"}, {"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "Box Office: Ranveer Singh starrer Jayeshbhai Jordaar earns Rs. 4 cr; Doctor Strange in the Multiverse of Madness is fair, KGF: Chapter 2 [Hindi] grows - Bollywood Hungama", "description": "Box Office: Ranveer Singh starrer Jayeshbhai Jordaar earns Rs. 4 cr; Doctor Strange in the Multiverse of Madness is fair, KGF: Chapter 2 [Hindi] grows. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb…", "url": "https://www.bollywoodhungama.com/news/box-office-special-features/box-office-ranveer-singh-starrer-jayeshbhai-jordaar-earns-rs-4-cr-doctor-strange-multiverse-madness-fair-kgf-chapter-2-hindi-grows/", "urlToImage": "https://stat2.bollywoodhungama.in/wp-content/uploads/2022/05/Box-Office-Ranveer-Singh-starrer-Jayeshbhai-Jordaar-earns-Rs.-4-cr-Doctor-Strange-in-the-Multiverse-of-Madness-is-fair-KGF-Chapter-2-Hindi-grows-2.jpg", "publishedAt": "2022-05-15T08:04:15Z", "content": "Doctor Strange in the Multiverse of Madness also had a similar growth only as after collecting Rs..3.25 crores* on Friday, it brought in Rs. 4 crores* more on Saturday. The difference here though is … [+1011 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Sri Lanka's new PM extends support to protesters demanding President Rajapaksa's resignation - Times of India", "description": "South Asia News: Sri Lanka's new PM Ranil Wickremesinghe said he had appointed a panel to look after the interests of the 'Gota Go Home' village protesters who have be", "url": "https://timesofindia.indiatimes.com/world/south-asia/sri-lankas-new-pm-extends-support-to-protesters-demanding-president-rajapaksas-resignation/articleshow/91574716.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91574777,width-1070,height-580,imgsize-37246,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-15T07:41:00Z", "content": "Sri Lanka's new PM extends support to protesters demanding President Rajapaksa's resignation"}]}