{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "MedPage Today"}, "author": "Judy George", "title": "Stroke Risk Rises for Young People Who Drink Frequently - Medpage Today", "description": "Cumulative effect seen with 2 or more years of moderate-to-heavy drinking", "url": "https://www.medpagetoday.com/neurology/strokes/101546", "urlToImage": "https://assets.medpagetoday.net/media/images/101xxx/101546.jpg", "publishedAt": "2022-11-02T20:03:13Z", "content": "People in their 20s and 30s who were moderate-to-heavy drinkers were more likely to have a stroke in early adulthood compared with those who consumed low amounts of alcohol each week, Korean national… [+3619 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Sepsis and COVID-19 patients most at risk predicted with genetic model - EurekAlert", "description": "A new model for understanding which patients with sepsis, Covid-19 and influenza have immune dysfunction and are more likely to suffer poor outcomes has been developed by researchers at the Wellcome Sanger Institute, the University of Oxford, Queen Mary Unive…", "url": "https://www.eurekalert.org/news-releases/969645", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-02T18:39:05Z", "content": "A new model for understanding which patients with sepsis, Covid-19 and influenza have immune dysfunction and are more likely to suffer poor outcomes has been developed by researchers at the Wellcome … [+7268 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Preventing COVID-19 neurological complications - Nature.com", "description": "Nature Reviews Neurology - Preventing COVID-19 neurological complications", "url": "https://www.nature.com/articles/s41582-022-00744-4", "urlToImage": null, "publishedAt": "2022-11-02T18:30:40Z", "content": "Neurological complications are reported in approximately 4% of people with severe COVID-19. New data reveal that treatment with dexamethasone or remdesivir during acute COVID-19 is associated with a … [+495 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "The ugly truth about the vaccine that didn’t work | Mint - Mint", "description": "The Kyasanur Forest Disease is deadly. But the regulator slept as the jab to protect against it lost potency.The KFD vaccine is widely seen as the top-line defence against the Kyasanur Forest Disease. It is a deadly disease that stalks forest and agricultural…", "url": "https://www.livemint.com/science/health/the-ugly-truth-about-the-vaccine-that-didn-t-work-11667411442891.html", "urlToImage": "https://images.livemint.com/img/2022/11/02/600x338/LSpic_1667412196978_1667412203921_1667412203921.jpg", "publishedAt": "2022-11-02T18:20:13Z", "content": "BENGALURU : On 10 October 2022, Karnatakas department of health and family welfare sent an odd circular to all of its district health officers. The circular, written in Kannada, spoke about the stock… [+28359 chars]"}, {"source": {"id": null, "name": "Oncnursingnews.com"}, "author": "Lindsay Fischer", "title": "Aggressive HER2-Targeted Therapy May Have a Role Following Disease Progression in Patients With Breast Cancer and Brain Metastases - www.oncnursingnews.com/", "description": "Patients with HER2-positive breast cancer and brain metastases experienced a median progression-free survival of 8 months and a median overall survival of 14 months with HER2-targeted therapy.", "url": "https://www.oncnursingnews.com/view/aggressive-her2-targeted-therapy-may-have-a-role-following-disease-progression-in-patients-with-breast-cancer-and-brain-metastases", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/oncnurse/5f39dc0f5e51997ce6c174e9314afce124ccebe6-4528x2491.jpg?fit=crop&auto=format", "publishedAt": "2022-11-02T18:06:50Z", "content": "Real-world evidence demonstrated that patients with HER2-positive breast cancer that has metastasized to the brain and who experienced disease progression following HER2-directed therapy may still de… [+6615 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "ProstateP4 Reviews - Quality Prostate Health Support or Cheap Pills? - The Tribune India", "description": "A prostate problem can be rather embarrassing. Many men experience prostate issues as they age, and prostate illnesses can affect even young men. The consequences of this situation are evident. Urination frequency is the most noticeable indication of prostate…", "url": "https://www.tribuneindia.com/news/brand-connect/prostatep4-reviews-quality-prostate-health-support-or-cheap-pills-446922", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_65588368.jpg", "publishedAt": "2022-11-02T16:59:00Z", "content": "A prostate problem can be rather embarrassing. Many men experience prostate issues as they age, and prostate illnesses can affect even young men. The consequences of this situation are evident. Urina… [+8925 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Kavita Bajeli-Datt", "title": "Monkeypox remains global health emergency: WHO - The New Indian Express", "description": "Dr Pargya Yadav said Covid had taught us to be vigilant during an outbreak till we are sure about the endgame of the disease.", "url": "https://www.newindianexpress.com/nation/2022/nov/02/monkeypox-remains-global-health-emergency-who-2514251.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/8/4/w600X390/Monkeypox_AP22209777470673_.jpg", "publishedAt": "2022-11-02T16:57:00Z", "content": "NEW DELHI: The World Health Organisation (WHO) has said that monkeypox, the zoonotic viral disease, which has been reported in over 100 countries, including India, is still a global health emergency … [+6524 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "Morning Exercise Has No Benefits To Control Blood Sugar: Study | Science & Tech - Ommcom News", "description": "New Delhi: Morning physical activity offers no advantages in reducing insulin resistance while afternoon or evening physical activity has now been associated with better blood sugar control to avoid diabetes risk in people, according to a significant", "url": "https://ommcomnews.com/science-tech/morning-exercise-has-no-benefits-to-control-blood-sugar-study", "urlToImage": "https://ommcomnews.com/wp-content/uploads/2022/11/fcca568c0ee7f1c8c1906f6b4ba7f27c-e1667407395408.jpg", "publishedAt": "2022-11-02T16:44:33Z", "content": "New Delhi: Morning physical activity offers no advantages in reducing insulin resistance while afternoon or evening physical activity has now been associated with better blood sugar control to avoid … [+2361 chars]"}, {"source": {"id": null, "name": "Readersdigest.co.uk"}, "author": "Reader's Digest Editors", "title": "Everything you need to know about bowel disorders - Reader's Digest", "description": "Maintaining a healthy bowel is crucial to your body&#39;s health. Here are the facts about bowel disorders and what to do when things go wrong", "url": "https://www.readersdigest.co.uk/health/health-conditions/everything-you-need-to-know-about-bowel-disorders", "urlToImage": "https://www.readersdigest.co.uk/media/_system/images/pages/scale600x600/925_1.webp?v=1667402452", "publishedAt": "2022-11-02T15:57:29Z", "content": "Maintaining a healthy bowel is crucial to your body's health. Here are the facts about bowel disorders and what to do when things go wrong\r\nKeeping your bowel healthy is really important for your ove… [+8630 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Nibbling synapses: Glial cells eating of synapses may enhance learning and memory - Science Daily", "description": "As our brains develop, cells within it 'eat' neuronal elements to clear out debris, pathogens and help improve efficiency. A recent study showed that motor learning in mice helped enhance the engulfing of synapses by Bergmann glial cells. The discovery could …", "url": "https://www.sciencedaily.com/releases/2022/11/221102110535.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-02T15:45:07Z", "content": "As our brains develop, cells within it 'eat' neuronal elements to clear out debris, pathogens and help improve efficiency. A recent study showed that motor learning in mice helped enhance the engulfi… [+3092 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Nanobots made from DNA could fight cancer by delivering drugs directly to tumours - ANI News", "description": "A team of Canadian researchers from Universite de Montreal has designed and validated a new class of drug transporters made of DNA that are 20,000 times smaller than a human hair and that could improve how cancers and other diseases are treated", "url": "https://www.aninews.in/news/health/nanobots-made-from-dna-could-fight-cancer-by-delivering-drugs-directly-to-tumours20221102205506", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221102134401.jpg", "publishedAt": "2022-11-02T15:25:00Z", "content": "Washington [US], November 2 (ANI): Chemists specializing in nanotechnology draw inspiration from nature to create molecular transporters that optimize the release of therapeutic drugs.Reported in a n… [+4497 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Theresa R. Cerulli, MD, Andrew Cutler, MD, Alice Mao, MD, Birgit H. Amann, MD, Michael Feld, MD", "title": "Clinical Burden of ADHD and Impact on Quality of Life - MD Magazine", "description": "Panelists share clinical burden of ADHD and how it impacts pediatric, adolescent and adult populations.", "url": "https://www.hcplive.com/view/clinical-burden-of-adhd-and-impact-on-quality-of-life", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/091a5269ac3824b8ad2746c27546ef76507618dc-1920x1080.png?fit=crop&auto=format", "publishedAt": "2022-11-02T15:03:11Z", "content": "Theresa R. Cerulli, MD: The questions that come to mind is, what is the clinical burden of ADHD [attention-deficit/hyperactivity disorder] overall in young children, adolescents, and adults? How is i… [+8575 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Helen Albert", "title": "Extra Surveillance for Women at Risk of Ovarian Cancer Can Be Effective in Short Term - Inside Precision Medicine", "description": "Short-term surveillance can help improve outcomes and treatment costs before preventive surgery in women at high-risk for ovarian cancer.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/ovarian-cancer/extra-surveillance-for-women-at-risk-of-ovarian-cancer-can-be-effective-in-short-term/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2019/01/1322.jpeg", "publishedAt": "2022-11-02T14:42:47Z", "content": "Women who are carriers of one of the BRCA1/2 cancer risk alleles are advised to have preventive surgery to stop ovarian cancer, but a new U.K. study reveals that extra surveillance can be effective i… [+2193 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Isabella Backman", "title": "Researchers probe why vaccine responses differ from person to person - Medical Xpress", "description": "COVID-19 vaccines boast efficacy rates against severe disease and hospitalization as high as 95%. But even among young, healthy adults, this doesn't mean individuals who received the groundbreaking jab acquired equal protection. Why people respond differently…", "url": "https://medicalxpress.com/news/2022-11-probe-vaccine-responses-differ-person.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/vaccine-9.jpg", "publishedAt": "2022-11-02T14:40:29Z", "content": "COVID-19 vaccines boast efficacy rates against severe disease and hospitalization as high as 95%. But even among young, healthy adults, this doesn't mean individuals who received the groundbreaking j… [+8790 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "COVID-19 can trigger similar inflammation in brain as Parkinson’s disease: study - Global Times", "description": "The COVID-19 virus can activate the same inflammatory response in the brain as Parkinson's disease, inducing a potential future risk for neurodegenerative conditions, according to a new research led by the University of Queensland (UQ).", "url": "https://www.globaltimes.cn/page/202211/1278582.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-10-11/48f85145-e07e-4d0f-ad24-af6e697fa53d.jpeg", "publishedAt": "2022-11-02T14:12:00Z", "content": "The COVID-19 virus can activate the same inflammatory response in the brain as Parkinson's disease, inducing a potential future risk for neurodegenerative conditions, according to a new research led … [+1720 chars]"}, {"source": {"id": null, "name": "Neurologyadvisor.com"}, "author": "Emily Estrada", "title": "Off-Label TAVI Associates With Higher Risk for Poor Outcomes - Neurology Advisor", "description": "A study was conducted to evaluate outcomes in patients that receive transcatheter aortic valve implantation for off-label indications.", "url": "https://www.neurologyadvisor.com/topics/stroke/off-label-tavi-associates-with-higher-risk-for-poor-outcomes/", "urlToImage": null, "publishedAt": "2022-11-02T14:11:00Z", "content": "Transcatheter aortic valve implantation (TAVI) for off-label indications is associated with increased risk for mortality, stroke, and bleeding compared with guideline-directed (GD)-TAVI. These findin… [+2105 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Covid-19 disrupts normal mix of gut bacteria, increases risk for other infection: Study - The Tribune India", "description": "Infection with the SARS-CoV-2 virus, can reduce the number of bacterial species in a patient&rsquo;s gut, with the lesser diversity creating space for dangerous microbes to thrive, a new study has found.", "url": "https://www.tribuneindia.com/news/health/covid-19-disrupts-normal-mix-of-gut-bacteria-increases-risk-for-other-infection-study-446899", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1749063852.jpg", "publishedAt": "2022-11-02T13:38:00Z", "content": "PTI\r\nWashington, November 2\r\nInfection with the SARS-CoV-2 virus, can reduce the number of bacterial species in a patient’s gut, with the lesser diversity creating space for dangerous microbes to thr… [+3849 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Dengue Fever Symptoms: Five Effective Home Remedies For Dengue Viral Fever That Are A Must Try - ABP Live", "description": "Dengue fever is spread by female Aedes mosquitos, which carry the dengue virus. Dengue mosquitos bite during the day and can be found anywhere.", "url": "https://news.abplive.com/health/dengue-fever-symptoms-five-effective-home-remedies-for-dengue-viral-fever-that-are-a-must-try-1561126", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/02/8a27edbab48ae3da2f1d3abe455db0761667391472393557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-02T13:22:51Z", "content": "New Delhi: The rapid rise in Dengue cases has taken a toll on citizens, with the number increasing with each passing day. Dengue fever is spread by female Aedes mosquitoes, which carry the dengue vir… [+2986 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists test ‘smart’ red blood cells to deliver antibiotics that target specific bacteria - ThePrint", "description": "Washington [US], November 2 (ANI): Physicists have identified a natural delivery system which can safely carry potent antibiotics throughout the body to selectively attack and kill bacteria by using red blood cells as a vehicle. The platform, described in a n…", "url": "https://theprint.in/health/scientists-test-smart-red-blood-cells-to-deliver-antibiotics-that-target-specific-bacteria/1193595/", "urlToImage": null, "publishedAt": "2022-11-02T13:17:40Z", "content": "Washington [US], November 2 (ANI): Physicists have identified a natural delivery system which can safely carry potent antibiotics throughout the body to selectively attack and kill bacteria by using … [+2652 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "doctor.ndtv.com", "title": "Mental Health: How Important Is A Proper Diet For A Good Mental Health? - NDTV Doctor", "description": "Consuming nutritious food encourages the growth of \"good\" bacteria, which in turn has a positive impact on the synthesis of neurotransmitters.", "url": "https://doctor.ndtv.com/emotions/mental-health-how-important-is-a-proper-diet-for-a-good-mental-health-3481776", "urlToImage": "https://c.ndtvimg.com/2021-06/0ppk115_healthy-diet_625x300_22_June_21.jpg", "publishedAt": "2022-11-02T12:36:47Z", "content": "Your sense of well-being and mood can be enhanced by eating a nutritious diet that is well-balanced and rich in veggies. We often consider the brain to be separate from the rest of the body, yet over… [+4088 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Here’s why strong perfumes give you a headache - EastMojo", "description": "Humans can smell over 1 trillion odours. But no two people will react in quite the same way to the same smell. While there are some smells almost everyone", "url": "http://www.eastmojo.com/news/2022/11/02/three-reasons-strong-perfumes-give-you-a-headache/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/10/Untitled-design-27-2.png?fit=1200%2C675&ssl=1", "publishedAt": "2022-11-02T12:30:00Z", "content": "Humans can smell over 1 trillion odours. But no two people will react in quite the same way to the same smell. While there are some smells almost everyone agrees are unpleasant (such as paint thinner… [+6203 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "Yoga and Pranayama can be beneficial for Alzheimer`s patients. Here`s how - Zee News", "description": "Alzheimers disease is the most common cause of dementia that affects about 5-6% of people in the age group of 65-70 years in India. Research reveals that as the population of India ages, the number of people with dementia and Alzheimer`s disease is set to go …", "url": "https://zeenews.india.com/health/yoga-and-pranayama-can-be-beneficial-for-alzheimers-patients-heres-how-2530128", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/02/1111617-untitled-design-2022-11-02t175352.982.png", "publishedAt": "2022-11-02T12:25:27Z", "content": "New Delhi: Alzheimers disease is the most common cause of dementia that affects about 5-6% of people in the age group of 65-70 years in India. Research reveals that as the population of India ages, t… [+4876 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The use of wearable health devices by cardiovascular disorder patients and those at an increased risk of cardiovascular disorders in the US - News-Medical.Net", "description": "Researchers evaluated the usage of WHDs (wearable health devices) by cardiovascular (CVS) disorder patients and those at an increased risk of CVS disorders in the United States (US).", "url": "https://www.news-medical.net/news/20221102/The-use-of-wearable-health-devices-by-cardiovascular-disorder-patients-and-those-at-an-increased-risk-of-cardiovascular-disorders-in-the-US.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729799_16673908790472793.jpg", "publishedAt": "2022-11-02T12:14:00Z", "content": "In a recent study soon to be presented at the American Heart Association (AHA) Scientific Sessions 2022*, researchers evaluated the usage of WHDs (wearable health devices) by cardiovascular (CVS) dis… [+5515 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Is Nano vitamin D better than conventional Vitamin D when bioavailability and absorption are concerned? - Medical Dialogues", "description": "It has long been understood that vitamin D, which is synthesized under the skin when exposed to sunlight, is essential for bone health. It is well established that the association between vitamin", "url": "https://medicaldialogues.in/orthopaedics/perspective/is-nano-vitamin-d-better-than-conventional-vitamin-d-when-bioavailability-and-absorption-are-concerned-101625", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/02/189775-nano-vitamin-d.jpg", "publishedAt": "2022-11-02T11:35:03Z", "content": "It has long been understood that vitamin D, which is synthesized under the skin when exposed to sunlight, is essential for bone health. It is well established that the association between vitamin D d… [+5186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can even mild Covid cause blood clots, cardiovascular issues? - The Indian Express", "description": "According to the study, patients hospitalised with Covid were 21 times more likely to experience heart failure, and 17 times more likely to suffer a stroke", "url": "https://indianexpress.com/article/lifestyle/health/mild-covid-blood-clots-cardiovascular-disease-risk-8233567/", "urlToImage": "https://images.indianexpress.com/2022/10/covid-19-issues.jpg", "publishedAt": "2022-11-02T11:30:43Z", "content": "Emerging evidence suggests that venous thromboembolism or blood clots — that begin in patients’ veins and spread to the heart, lungs, and other regions of the body — are more likely to be experienced… [+3367 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Chronic Daily Headaches: Types, Causes, Symptoms, and Tips for Prevention - The Quint FIT", "description": "Headaches are normal if they occur once in a while but frequent headaches can be a sign of underlying chronic diseases. Thus here are few causes, types, signs and symptoms of headaches.", "url": "https://www.thequint.com/fit/chronic-daily-headaches-types-causes-symptoms-and-tips-for-prevention", "urlToImage": "https://images.thequint.com/thequint%2F2022-07%2F4408b5be-138a-4246-9003-326b46add1bb%2Fhave_to_keep_away_from_focusing_on_the_pain_picture_id949054828.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-11-02T11:28:54Z", "content": "Headaches are a common issue in one's life and it is normal to experience headaches once in a while. But if you begin to experience severe headaches on a regular basis, or even daily- that might be a… [+613 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "What is Postmenopausal Osteoporosis? Know about your bone health - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/lifestyle/what-is-postmenopausal-osteoporosis-know-about-your-bone-health", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-11/8c2311a1-9f5e-42a0-be2f-1fee199cbd09/osteoporosis_bone_health1.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-11-02T11:21:56Z", "content": "Did you know? Osteoporosis is a common occurrence in postmenopausal women. It is a condition that weakens bones and increases the risk of fractures. It refers to a decrease in bone mass and strength.… [+1087 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Ways to boost children's immunity during winter season - Hindustan Times", "description": "Growing children are highly exposed to viral and bacterial infections in schools as well as playgrounds hence, need foods which help in building immune cells and repair body tissues to fight off these infections. Here's how parents can boost children's immuni…", "url": "https://www.hindustantimes.com/lifestyle/health/ways-to-boost-children-s-immunity-during-winter-season-101667385080258.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/02/1600x900/pexels-aleks-6706575_1667385474033_1667385503984_1667385503984.jpg", "publishedAt": "2022-11-02T11:02:08Z", "content": "While we all love winters, theres no denying that it brings many health issues in children. With the winter season approaching and our continued battle with Covid-19, a high surge in infections is pr… [+7548 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Poor quality sleep may put you at high glaucoma risk - ETHealthWorld", "description": "The findings underscore the need for sleep therapy in people at high risk of the disease as well as eye checks among those with chronic sleep disorders to check for early signs of glaucoma.", "url": "https://health.economictimes.indiatimes.com/news/industry/poor-quality-sleep-may-put-you-at-high-glaucoma-risk/95254361", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95254361,imgsize-19700,width-1200,height-628,overlay-ethealthworld/poor-quality-sleep-may-put-you-at-high-glaucoma-risk.jpg", "publishedAt": "2022-11-02T11:00:00Z", "content": "New Delhi: Poor quality sleep, including too much or too little shut eye, daytime sleepiness, and snoring, may be linked to a heightened risk of developing irreversible sight loss (glaucoma), UK-base… [+2312 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Periodontitis - A modifiable risk factor for Atrial Fibrillation, finds study - Medical Dialogues", "description": "A recent investigation found that there is a histological association between periodontitis and atrial fibrosis, and it is a modifiable risk factor for atrial fibrillation. The study was published...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/periodontitis-a-modifiable-risk-factor-for-atrial-fibrillation-finds-study-101604", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/05/149532-1600x960123662-periodontitis.jpg", "publishedAt": "2022-11-02T10:30:31Z", "content": "A recent investigation found that there is a histological association between periodontitis and atrial fibrosis, and it is a modifiable risk factor for atrial fibrillation. The study was published in… [+1989 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Association of hormone therapy with depression during menopause - EurekAlert", "description": "About The Study: The findings of this study of women in Denmark followed up from age 45 suggest that systemically administered (oral or transdermal) hormonal therapy before and during menopause is associated with higher risk of depression, especially in the y…", "url": "https://www.eurekalert.org/news-releases/969611", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-02T10:09:37Z", "content": "About The Study: The findings of this study of women in Denmark followed up from age 45 suggest that systemically administered (oral or transdermal) hormonal therapy before and during menopause is as… [+1265 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Red Boost Reviews SCAM EXPOSED You Must Need To KNow - Deccan Herald", "description": "Red Boost Review: Is this Supplement Really Work Men’s Appetitive Behavior Performance? Check this Critical Review Red Boost's target market is men who have unproductiveness or other steamy performance issues. Many men can find relief from ED symptoms by boos…", "url": "https://www.deccanherald.com/brandspot/pr-spot/red-boost-reviews-scam-exposed-you-must-need-to-know-1158724.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1158724-1667381362.png", "publishedAt": "2022-11-02T09:29:22Z", "content": "Red Boost Review: Is this Supplement Really Work Mens Appetitive Behavior Performance? Check this Critical Review\r\nRed Boost's target market is men who have unproductiveness or other steamy performan… [+12673 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Building Bone Health With A Healthy Diet and Exercises - News18", "description": "Building strong and healthy bones during childhood and adolescence with a healthy balanced diet, can help prevent bone ailments in adulthood", "url": "https://www.news18.com/news/lifestyle/building-bone-health-with-a-healthy-diet-and-exercises-6292297.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/arthritis-166252357216x9.jpg", "publishedAt": "2022-11-02T09:12:00Z", "content": "Bones are an integral part of our body in the body. They provide structure, protect organs, and store calcium. Building strong and healthy bones during childhood and adolescence with a healthy balanc… [+2874 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How does imprinted SARS-CoV-2 humoral immunity drive convergent Omicron evolution? - News-Medical.Net", "description": "Researchers examined how imprinted SARS-CoV-2 humoral immunity drives convergent evolution in continuously emerging Omicron subvariants.", "url": "https://www.news-medical.net/news/20221102/How-does-imprinted-SARS-CoV-2-humoral-immunity-drive-convergent-Omicron-evolution.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729772_1667379028396344.jpg", "publishedAt": "2022-11-02T08:57:00Z", "content": "In a recent study posted to the bioRxiv* server, researchers examined how imprinted severe acute respiratory syndrome coronavirus-2 (SARS-CoV-2) humoral immunity drives convergent evolution in contin… [+5534 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists trace the brain circuits that cause vomiting after consuming infected food - Tech Explorist", "description": "Scientists mapped out the detailed neural pathway of the defensive responses from the gut to brain in mice.", "url": "https://www.techexplorist.com/scientists-trace-brain-circuits-cause-vomiting-consuming-infected-food/54603/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/vomiting.jpg", "publishedAt": "2022-11-02T08:01:32Z", "content": "If you’re throwing up, it usually means your body is trying to get rid of a toxin. Often, it is a sign of a stomach infection.\r\nThe urge to vomit after eating contaminated food is the body’s natural … [+3874 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "High Blood Pressure: Long-term BP affects kidneys; check kidney disease symptoms and how to keep BP in chec... - Zee News", "description": "Reduce High Blood Sugar: 5 vegetables good for diabetes patients - consume regularly Symptoms of Kidney Disease According to Webmd, the following are the symptoms of kidney disease: - High/worsening blood pressure - Decrease in the amount of urine or difficul…", "url": "https://zeenews.india.com/health/high-blood-pressure-long-term-bp-affects-kidneys-check-kidney-disease-symptoms-and-how-to-keep-bp-in-check-2529966", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/02/1111455-blood-pessure-pixabay-bp.jpg", "publishedAt": "2022-11-02T07:59:21Z", "content": "High Blood Pressure or Hypertension is one of the leading causes of kidney diseases and eventually kidney failure, which is end-stage renal disease. Every human being normally has two kidneys and the… [+2099 chars]"}, {"source": {"id": null, "name": "Nippon.com"}, "author": null, "title": "Japan Team Develops Way to Efficiently Activate Anticancer Immunity - Nippon.com", "description": "Osaka, Nov. 2 (Jiji Press)--A Japanese research team has announced the development of a vaccine ingredient cap…", "url": "https://www.nippon.com/en/news/yjj2022110200146/", "urlToImage": "https://www.nippon.com/en/ncommon/contents/news/2062551/2062551.jpg", "publishedAt": "2022-11-02T07:13:24Z", "content": "Osaka, Nov. 2 (Jiji Press)--A Japanese research team has announced the development of a vaccine ingredient capable of effectively activating anticancer immune cells, even with a small amount of cance… [+991 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Tirtho Banerjee", "title": "Having cough, fever or sore throat? Here’s how you can find out if it’s flu, RSV or Covid - India Today", "description": "Since their symptoms are similar, it is important that we understand the subtle difference between influenza, Respiratory Syncytial Virus (RSV), and Covid-19.", "url": "https://www.indiatoday.in/health/story/cough-fever-sore-throat-flu-season-rsv-covid-symptoms-treatment-medicine-2292331-2022-11-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/mask_1-sixteen_nine.jpg?VersionId=e1Zx.DFIopGk6Rv0gpvBiNKkkTXR6HSS", "publishedAt": "2022-11-02T07:13:07Z", "content": "By Tirtho Banerjee: Are you suffering from bouts of cough, runny nose, fever, sore throat, or headache? Winter is round the corner and most of us do experience these during this season. But how do yo… [+3699 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Olive Oil Or Desi Ghee? Nutritionist Pooja Malhotra Tells Which Is Healthier - NDTV", "description": "Desi ghee has a high smoking point. This, according to the nutritionist, makes desi ghee a good choice for high-temperature Indian cooking.", "url": "https://www.ndtv.com/health/olive-oil-or-desi-ghee-nutritionist-pooja-malhotra-tells-which-is-healthier-3478985", "urlToImage": "https://c.ndtvimg.com/2022-09/go9mb0a8_ghee_625x300_22_September_22.jpg", "publishedAt": "2022-11-02T07:13:00Z", "content": "Ghee has a high smoking point which makes it ideal for Indian cooking\r\nFrom salad dressing and baking to frying some delicious chicken and vegetables, cooking oil and ghee are used for a range of pur… [+2150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "How Covid-19 damages lungs: The virus attacks mitochondria, continuing an ancient battle that began in the primordial soup - The Indian Express", "description": "SARS-CoV-2 is the third novel coronavirus to cause human outbreaks in the 21st century, following SARS-CoV in 2003 and MERS-CoV in 2012. We need to better understand how coronaviruses cause lung injury to prepare for the next pandemic", "url": "https://indianexpress.com/article/lifestyle/health/how-covid-19-damages-lungs-mitochondria-virus-8241993/", "urlToImage": "https://images.indianexpress.com/2022/11/lungs_1200_getty-1.jpg", "publishedAt": "2022-11-02T06:30:30Z", "content": "Viruses and bacteria have a very long history. Because viruses can’t reproduce without a host, they’ve been attacking bacteria for millions of years. Some of those bacteria eventually became mitochon… [+8036 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Things To Keep In Mind While Resuming Work After Heart Stroke - News18", "description": "While it may not be possible almost immediately to start work after suffering a heart stroke, proper rest and treatment will allow you to resume life as usual.", "url": "https://www.news18.com/news/lifestyle/things-to-keep-in-mind-while-resuming-work-after-heart-stroke-6286513.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/untitled-design-17-15-166668543416x9.png", "publishedAt": "2022-11-02T06:04:38Z", "content": "A heart stroke causes a significant burden of cardiovascular complications. It may occur in people regardless of age or gender and causes a series of cardiac changes ranging from acute myocardial inj… [+2064 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US in flu season earlier, more severe: CDC - ETHealthWorld", "description": "There have already been at least 880,000 cases of influenza illness, 6,900 hospitalisations and 360 flu-related deaths nationally, including one child, according to estimates released on Friday by the Centers for Disease Control and Prevention (CDC), the news…", "url": "https://health.economictimes.indiatimes.com/news/industry/us-in-flu-season-earlier-more-severe-cdc/95245742", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95245742,imgsize-59752,width-1200,height-628,overlay-ethealthworld/us-in-flu-season-earlier-more-severe-cdc.jpg", "publishedAt": "2022-11-02T05:45:00Z", "content": "New York: Influenza is hitting the US unusually early and hard, resulting in the most hospitalisations at this point in the season in more than a decade and underscoring the potential for a perilous … [+900 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "High cholesterol: Which fruit can reduce my blood cholesterol level overnight? - Zee News", "description": "Cholesterol control: Eat THESE dry fruits to reduce bad cholesterol in your body 4. Oranges Citrus fruits like oranges too are rich in fibre content which promotes a healthy heart and good cholesterol. 5.", "url": "https://zeenews.india.com/health/high-cholesterol-which-fruit-can-reduce-my-blood-cholesterol-level-overnight-2529873", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/02/1111363-apples.jpg", "publishedAt": "2022-11-02T04:59:07Z", "content": "Most of the cholesterol in your body is produced by your liver, and the remainder of it comes from the food you eat. The bad and dangerous form of cholesterol is called low-density lipoprotein (LDL).… [+1895 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Jack Dunhill", "title": "Recreational Drugs Including Cannabis Increase Risk Of Irregular Heartbeat - IFLScience", "description": "Surprisingly, cannabis use increased the risk of atrial fibrillation by 35 percent.", "url": "https://www.iflscience.com/recreational-drugs-including-cannabis-increase-risk-of-irregular-heartbeat-66023", "urlToImage": "https://assets.iflscience.com/assets/articleNo/66023/aImg/63104/cannabis-meta.jpg", "publishedAt": "2022-11-02T03:56:00Z", "content": "Cannabis, methamphetamine, cocaine, and opiate use are associated with a significant increase in atrial fibrillation (an irregular heartbeat), according to a new observational study by the American H… [+2356 chars]"}, {"source": {"id": null, "name": "Jmig.org"}, "author": null, "title": "Preoperative Hematocrit Level and Associated Risk of Transfusion Based on Fibroid Burden and Surgical Route - Journal of Minimally Invasive Gynecology", "description": "To determine the association between preoperative hematocrit and risk of blood transfusion\nfor laparotomic and laparoscopic myomectomy based on fibroid burden and surgical route.", "url": "https://www.jmig.org/article/S1553-4650(22)00972-4/fulltext", "urlToImage": "https://www.jmig.org/cms/asset/50984cd9-b1d6-4c56-b8ba-fda9fedbb982/gr2.jpg", "publishedAt": "2022-11-02T01:25:36Z", "content": "Footnotes\r\nConflict of interest: The authors report no conflict of interest.\r\nSource of funding: none\r\nPrior presentation or publications: To be presented at AAGL 2022: 51st Global Congress on MIGS; … [+158 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "WSO Angels Award for Lalita Neurology dept - The New Indian Express", "description": "Dr Vijaya also presented two research scientific papers during the conference.", "url": "https://www.newindianexpress.com/cities/vijayawada/2022/nov/02/wso-angels-award-for-lalita-neurology-dept-2514072.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/2/2/w600X390/stethoscopeMBBS.jpg", "publishedAt": "2022-11-02T01:20:00Z", "content": "Disclaimer : We respect your thoughts and views! But we need to be judicious while moderating your comments. All the comments will be moderated by the newindianexpress.com editorial. Abstain from pos… [+631 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "NIH, National Heart, Lung and Blood Institute (NHLBI)", "title": "Study Shows Blood Pressure Levels Rose During Pandemic - Newswise", "description": "Adults with hypertension saw a small, but consequential, rise in their blood pressure levels during the first eight months of the COVID-19 pandemic, while the n", "url": "https://www.newswise.com/coronavirus/study-shows-blood-pressure-levels-rose-during-pandemic", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-11-01T23:35:00Z", "content": "Newswise — Adults with hypertension saw a small, but consequential, rise in their blood pressure levels during the first eight months of the COVID-19 pandemic, while the number of times they had thei… [+5837 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "WebWire", "title": "Tea Burn Supplement Turns Ordinary Tea into The Best Detox Tea for Weight Loss - Benzinga", "description": "Tea Burn has been launched for easy weight loss and it has reached popularity as many consumers succeeded in losing weight after consuming the tea. It is processed and manufactured in an FDA approved facility in the", "url": "https://www.benzinga.com/pressreleases/22/11/w29515119/tea-burn-supplement-turns-ordinary-tea-into-the-best-detox-tea-for-weight-loss", "urlToImage": null, "publishedAt": "2022-11-01T23:20:42Z", "content": "Tea Burn has been launched for easy weight loss and it has reached popularity as many consumers succeeded in losing weight after consuming the tea. It is processed and manufactured in an FDA approved… [+2291 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "High levels of Vegetable Omega-3 may improve Prognosis in Patients With HF - Medical Dialogues", "description": "Researchers have found in a new study that high levels of Vegetable Omega-3 may improve Prognosis in Patients With heart failure. Further the study found that Heart failure patients with bottom", "url": "https://medicaldialogues.in/cardiology-ctvs/news/high-levels-of-vegetable-omega-3-may-improve-prognosis-in-patients-with-hf-101590", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/29/186585-acute-heart-failure.jpg", "publishedAt": "2022-11-01T22:15:00Z", "content": "Researchers have found in a new study that high levels of Vegetable Omega-3 may improve Prognosis in Patients With heart failure. Further the study found that Heart failure patients with bottom 25% a… [+2032 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Kate Barnes", "title": "Extreme risk protection orders assist in preventing mass shooting events, study shows - Medical Xpress", "description": "Extreme risk protection orders, also known as red flag laws, can help prevent firearm injury events, including multiple victim/mass shootings, by addressing the threat prior to an event occurring, according to new research led by the University of Michigan.", "url": "https://medicalxpress.com/news/2022-11-extreme-mass-events.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/gun-violence-2.jpg", "publishedAt": "2022-11-01T20:38:03Z", "content": "Extreme risk protection orders, also known as red flag laws, can help prevent firearm injury events, including multiple victim/mass shootings, by addressing the threat prior to an event occurring, ac… [+3585 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Starting cancer treatment? You should discuss fertility first - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Melbourne, Oct 31: Not all Australians with cancer are getting the fertility care they need. In 2022, it is predicted more than 8,200 Australians under 40 – in their reproductive years – will be diagnosed with cancer. This is more than double the rate in the …", "url": "https://www.dailyexcelsior.com/starting-cancer-treatment-you-should-discuss-fertility-first/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/10/download-3-28.jpg", "publishedAt": "2022-11-01T19:15:19Z", "content": "Melbourne, Oct 31: Not all Australians with cancer are getting the fertility care they need.In 2022, it is predicted more than 8,200 Australians under 40 in their reproductive years will be diagnosed… [+5423 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Dr Umesh Srikantha", "title": "What leads to herniated discs and treatment for a herniated disc? - The Hans India", "description": "Slip discs can happen with age because with age discs tend to lose some of their protective water...", "url": "https://www.thehansindia.com/life-style/health/what-leads-to-herniated-discs-and-treatment-for-a-herniated-disc-767567", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/11/01/1318752-disc.jpg", "publishedAt": "2022-11-01T18:48:34Z", "content": "Slip discs can happen with age because with age discs tend to lose some of their protective water content due to which they can slip more easily out of place. This is more common in men than women. C… [+4496 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Pandora Dewan", "title": "People Are Using a Diabetes Drug for Weight Loss and It Seems to Be Working - Newsweek", "description": "Elon Musk has touted Wegovy as a solution to weight loss, and its sister drug, Ozempic, has become a viral sensation on TikTok.", "url": "https://www.newsweek.com/newsweek-com-people-using-diabetes-drug-weight-loss-working-1756078", "urlToImage": "https://d.newsweek.com/en/full/2142459/woman-weighing-scales.jpg", "publishedAt": "2022-11-01T16:50:43Z", "content": "A prescription drug for Type 2 diabetes has become a viral sensation on TikTok. Ozempic is an injectable medication that is used to manage blood sugar levels in diabetic adults and, as a side effect,… [+4605 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Julia Bonavitacola", "title": "Diabetic Kidney Disease Progression Associated With Changes in Muscle, Fat Amounts - AJMC.com Managed Markets Network", "description": "Patients with type 2 diabetes with a high to very high prognostic risk of diabetic kidney disease were more likely to have a reduced rectus femoris cross-sectional area, a measure of muscle mass in the lower body, and an increased visceral fat area.", "url": "https://www.ajmc.com/view/diabetic-kidney-disease-progression-associated-with-changes-in-muscle-fat-amounts", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c2f76033e7d2f7d987f013cdd83dc65df48a70a3-3724x2094.jpg?fit=crop&auto=format", "publishedAt": "2022-11-01T14:59:07Z", "content": "A study published in Frontiers in Endocrinology found that diabetic kidney disease (DKD) progression in patients with type 2 diabetes (T2D) was associated with reduced rectus femoris cross-sectional … [+3937 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Sickness, death surpass official count in DRC monkeypox outbreak - Al Jazeera English", "description": "In the Democratic Republic of the Congo’s monkeypox outbreak, sickness and death go undetected.", "url": "https://www.aljazeera.com/gallery/2022/11/1/photos-dr-congo-monkeypox", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/10/2022-10-31T060142Z_121861697_RC2PTW9AVZGA_RTRMADP_3_HEALTH-MONKEYPOX-AFRICA.jpg?resize=1920%2C1440", "publishedAt": "2022-11-01T13:27:19Z", "content": "Yalolia, Democratic Republic of the Congo At a village clinic in central Democratic Republic of the Congo, separated from the world by a tangle of waterways and forests, six-year-old Angelika Lifafu … [+2349 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Expert Advice On Male fertility: How To Maintain Sexual Wellness For Men In Their 30s - News18", "description": "It is advisable to consult a professional if you are facing any of these issues.", "url": "https://www.news18.com/news/lifestyle/expert-advice-on-male-fertility-how-to-maintain-sexual-wellness-for-men-in-their-30s-6259273.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/untitled-design-38-3-166730764816x9.png", "publishedAt": "2022-11-01T13:02:19Z", "content": "The most fertile age for men is known to be their 20s. This is when they have a high libido and a faster metabolism. Men experience sexual problems with age. These issues in men begin in their 30s. T… [+2534 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "World-first human brain cell map shows gene activity changes - Medical Xpress", "description": "Australian scientists have developed a world-first map showing gene activity changes in diverse human brain cell types from pre-birth to adulthood. By having this map of normal brain cell development, researchers will now be able to identify altered states mo…", "url": "https://medicalxpress.com/news/2022-11-world-first-human-brain-cell-gene.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/world-first-human-brai-1.jpg", "publishedAt": "2022-11-01T13:02:03Z", "content": "Australian scientists have developed a world-first map showing gene activity changes in diverse human brain cell types from pre-birth to adulthood. By having this map of normal brain cell development… [+4720 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "Antibody treatment tested as a new tool against malaria: Research - Hindustan Times", "description": "Malaria killed more than 620,000 people in 2020 and sickened 241 million, mainly children under 5 in Africa. The World Health Organization is rolling out the first authorized malaria vaccine for children, but it is about 30% effective and requires four doses.…", "url": "https://www.hindustantimes.com/lifestyle/health/antibody-treatment-tested-as-a-new-tool-against-malaria-research-101667297894180.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/01/1600x900/4bf2cb16-d4db-11ec-ae80-64fe22456763_1652682434816_1667301512392_1667301512392.jpg", "publishedAt": "2022-11-01T11:23:28Z", "content": "Research in Africa found a one-time dose of an experimental drug protected adults against malaria for at least six months, the latest approach in the fight against the mosquito-borne disease. Malaria… [+2810 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "ProDentim Probiotics Healthy Teeth Ingredients and Side Effects Report Exposes - The Tribune India", "description": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim supplement does more than provide a probiotic candy. It also trac…", "url": "https://www.tribuneindia.com/news/brand-connect/prodentim-probiotics-healthy-teeth-ingredients-and-side-effects-report-exposes-446553", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_974704669.jpg", "publishedAt": "2022-11-01T09:54:00Z", "content": "After reading many research studies on how each ProDentim ingredient might impact oral hygiene, I only used the supplement. Many people have written reviews about organic supplements. ProDentim suppl… [+14746 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What makes some humans mosquito magnets? - News-Medical.Net", "description": "Researchers explored the reasons for the greater attractiveness of some individuals to mosquitoes.", "url": "https://www.news-medical.net/news/20221101/What-makes-some-humans-mosquito-magnets.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_729627_16672943017487001.jpg", "publishedAt": "2022-11-01T09:24:00Z", "content": "In a recent review published in Cell Press, researchers explored the reasons for the greater attractiveness of some individuals to mosquitoes.\r\nStudy: Why are some people more attractive to mosquitoe… [+5219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Does eating 46 almonds a day boost gut health? Well, in India 20 should be good enough, says expert - The Indian Express", "description": "No matter what studies say, the question of how many almonds one should have is subjective as the quantity may vary due to the environment, climate conditions, individual exercise routine and ongoing dietary intake. Raw almonds are known to produce heat, espe…", "url": "https://indianexpress.com/article/lifestyle/health-specials/eating-almonds-health-special-experts-8242397/", "urlToImage": "https://images.indianexpress.com/2022/11/getty_almonds_1200.jpg", "publishedAt": "2022-11-01T08:01:05Z", "content": "We know that almonds are nutrient-rich and a healthy substitute for snacking. Now a new study finds that eating 56 grams of almonds daily the equivalent of approximately 46 almonds can improve gut he… [+5232 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Clinical Genomics: Career Opportunities and Skill-sets - BSI bureau", "description": "We are in the Genomics era, cherished by Nobel winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier at 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022  for paleogenomics. The 13 years of Human Genome Sequencing project gave h…", "url": "https://www.biospectrumindia.com/views/17/22172/clinical-genomics-career-opportunities-and-skill-sets.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/6-22172.png", "publishedAt": "2022-11-01T06:46:40Z", "content": "We are in the Genomics era, cherished by Nobel Prize winners like Dr Jennifer A. Doudna and Dr Emmanuelle Charpentier in 2020 for Genome editing CRISPR technology and Dr Svante Paabo in 2022 for pale… [+2434 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Sylvia Thompson", "title": "'There is an epidemic of short-sightedness' – The Irish Times - The Irish Times", "description": "The Covid-19 pandemic forced innovation for eye care in Ireland, consultant ophthalmologist Dr Emma Duigan says", "url": "https://www.irishtimes.com/health/your-wellness/2022/11/01/there-is-an-epidemic-of-short-sightedness/", "urlToImage": "https://www.irishtimes.com/resizer/fhWVj7r2PiMnMpeaZhu6mSZ9ZXY=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/55E4JOLF7BHQTHNBFWSOJUGUHY.jpg", "publishedAt": "2022-11-01T05:27:42Z", "content": "There is an epidemic of short-sightedness across the developed world, according to Dr Emma Duignan, consultant ophthalmologist at the Royal Victoria Eye and Ear Hospital in Dublin.\r\nIt is estimated t… [+5431 chars]"}]}