{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amla Health Benefits: Healthy Liver To Hair Growth, 4 Notable Benefits Of Indian Gooseberry - NDTV", "description": "\"The Indian gooseberry is just the magic pill you need to boost your overall health.\" says nutritionist Lovneet Batra", "url": "https://www.ndtv.com/health/amla-health-benefit-healthy-liver-to-hair-growth-4-notable-benefits-of-indian-gooseberry-3570275", "urlToImage": "https://c.ndtvimg.com/2022-03/2vsju8l8_amla_625x300_23_March_22.jpg", "publishedAt": "2022-12-02T08:26:01Z", "content": "Amla provides us with numerous benefits such as better digestion, diabetes control, hair growth and more\r\nAmla berries include antioxidants and vitamins that have a number of health advantages. Amla … [+2118 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cut Down On Your Salt Intake For A Healthy Heart, Here's Why - NDTV", "description": "Consuming too much salt can have a negative impact on your heart. Here are some tips that can help lower your intake of salt.", "url": "https://www.ndtv.com/health/heart-health-heres-how-salt-intake-affects-your-heart-health-3570235", "urlToImage": "https://c.ndtvimg.com/2022-09/kn1pbb9_salt_625x300_19_September_22.jpg", "publishedAt": "2022-12-02T07:39:56Z", "content": "Heart Health: High sodium (salt) intake can cause high blood pressure\r\nSodium is an essential part of everyone's diet. It aids in maintaining the right balance of fluid levels in your body and contri… [+4095 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Why a low-carb diet may not always prevent Type 2 diabetes - The Indian Express", "description": "Type 2 diabetics should develop healthy eating habits rather than focussing on a single macro nutrient. Reducing carbohydrates certainly helps them achieve better sugar control with less medicines, but eliminating them does not give consistent results, nor do…", "url": "https://indianexpress.com/article/lifestyle/health-specials/low-carb-diet-type-2-diabetes-8301935/", "urlToImage": "https://images.indianexpress.com/2022/12/low-carb-diet-1.jpg", "publishedAt": "2022-12-02T07:14:53Z", "content": "A new study has shown that it is not a low-carbohydrate diet but the type and mix of non-carbohydrates that a person eats that affects the risk of developing Type-2 diabetes. In fact, a low carb diet… [+3533 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "PTI", "title": "Experimental Alzheimer’s drug shows promise - but there are many hurdles still to overcome - ThePrint", "description": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimer’s patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic clumps of amyloid protein associated with the mind-robbing…", "url": "https://theprint.in/world/experimental-alzheimers-drug-shows-promise-but-there-are-many-hurdles-still-to-overcome/1245265/", "urlToImage": null, "publishedAt": "2022-12-02T06:02:04Z", "content": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimers patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic… [+5015 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Clinico-Epidemiological Profile of Allergic Contact Dermatitis and Its Correlation With Patch Testing in a Tertiary Care Center in Eastern India - Cureus", "description": "Background: Allergic contact dermatitis (ACD) is one of the most common skin disorders seen among patients attending dermatology clinics in India. Patch testing is the gold standard for diagnosing ACD. The clinical-epidemiological pattern of ACD and the aller…", "url": "https://www.cureus.com/articles/122473-clinico-epidemiological-profile-of-allergic-contact-dermatitis-and-its-correlation-with-patch-testing-in-a-tertiary-care-center-in-eastern-india", "urlToImage": "https://assets.cureus.com/uploads/figure/file/489909/article_river_9c59346059c311ed9b71d1b4012007f8-Figure1.png", "publishedAt": "2022-12-02T06:00:54Z", "content": "Background: Allergic contact dermatitis (ACD) is one of the most common skin disorders seen among patients attending dermatology clinics in India. Patch testing is the gold standard for diagnosing AC… [+26020 chars]"}, {"source": {"id": null, "name": "SocialNews.XYZ"}, "author": "Gopi", "title": "2-dose vaccine offers long-term protection against severe Covid in kids - Social News XYZ", "description": "New York, Dec 2 (SocialNews.XYZ) A two-dose experimental vaccine can provide protection against severe Covid even one year even after the jabs, researchers report. The results may reduce the need for frequent boosters and protect... - Social News XYZ", "url": "https://www.socialnews.xyz/2022/12/02/2-dose-vaccine-offers-long-term-protection-against-severe-covid-in-kids/", "urlToImage": "https://i0.wp.com/www.socialnews.xyz/wp-content/uploads/2022/07/15/b5c47a57254fcdc041bdbad302cee48a.jpg?fit=900%2C600&quality=80&zoom=1&ssl=1", "publishedAt": "2022-12-02T05:31:34Z", "content": "Home » General » Health » 2-dose vaccine offers long-term protection against severe Covid in kids\r\nNew York, Dec 2 (SocialNews.XYZ) A two-dose experimental vaccine can provide protection against seve… [+2177 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/ians/", "title": "Alcoholic Beverages Increase Cancer Risk, Says New Study - India.com", "description": "Alcoholic Beverages Increase Cancer Risk, Says New Study", "url": "https://www.india.com/health/alcoholic-beverages-increase-cancer-risk-says-new-study-health-lifestyle-news-5776294/", "urlToImage": "https://www.india.com/wp-content/uploads/2022/01/Four-friends-toast-before-consuming-alcoholic-drinks..jpg", "publishedAt": "2022-12-02T04:47:00Z", "content": "All types of alcoholic beverages, including wine, increase cancer risk but people have low awareness about it and some even perceive alcohol as having health benefits, a new study has revealed.\r\nAlco… [+2165 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Padmashree Pande", "title": "When You Struggle To Breathe Every Day: Life With Allergic Rhinitis - The Quint FIT", "description": "Imagine living your life on a timer, to have every minute of your routine mapped down to one task alone – cleaning your nose. As ‘ugh’ as it sounds, welcome to my life. No matter what the weather is, my nose is perennially blocked.", "url": "https://www.thequint.com/fit/when-you-struggle-to-breathe-every-day-life-with-allergic-rhinitis-2", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2F05891a6f-2a8a-4ce7-97f0-b714fd2e26c8%2F5.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-02T04:32:16Z", "content": "In 2020 February, I was on vacation with my cousins in Dubai, UAE. On this particular day on our trip, I remember, we were going to board a ferry to take us to the old city.\r\nBut, from our house in t… [+644 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "5 lifestyle tips to take note of if you are at risk for diabetes - The Indian Express", "description": "\"Ask a trainer to help you focus on your midsection for belly fat, as a large waist circumference is known to put a person at an increased risk of diabetes,\" said Dr Vivek Srivastav", "url": "https://indianexpress.com/article/lifestyle/health/5-lifestyle-tips-risk-of-diabetes-weight-physical-activity-sugar-8298388/", "urlToImage": "https://images.indianexpress.com/2022/11/diabetes_getty_1200.jpg", "publishedAt": "2022-12-02T04:30:36Z", "content": "Diabetes is a lifestyle disease charactised by high blood sugar levels that was once common among the elderly. “However, the incidence of diabetes is increasing in the younger age groups too, making … [+3358 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "New genetic mutation behind childhood glaucoma identified - Hindustan Times", "description": "This increase in pressure not only damages the optic nerve but can also affect other structures in a child's eye like the cornea. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/new-genetic-mutation-behind-childhood-glaucoma-identified-101669954231265.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/eye_1_1644416939593_1669954327425_1669954327425.jpg", "publishedAt": "2022-12-02T04:13:42Z", "content": "An international team of researchers led by Mass Eye and Ear, a member of Mass General Brigham and Boston Children's Hospital, has discovered a new genetic mutation that could be the root cause of se… [+6444 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Measles outbreak: Panic in Malappuram as fresh cases soar - Mathrubhumi English", "description": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, the total number of infected persons touched 239 in Malappuram…", "url": "https://english.mathrubhumi.com/news/kerala/measles-outbreak-panic-in-malappuram-as-fresh-cases-soar-1.8097946", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.8097947:1669952088/vaccination%20(1).jpg?$p=a362ddd&f=16x9&w=1080&q=0.8", "publishedAt": "2022-12-02T03:38:06Z", "content": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, th… [+874 chars]"}, {"source": {"id": null, "name": "Fresherslive.com"}, "author": "J Nandhini", "title": "Only a Person with a Hawk Eyes Can Spot the Telephone in this Optical Illusion - News - News", "description": "Only A Person With A Hawk Eyes Can Spot The Telephone In This Optical Illusion? The Internet seems to have an insatiable hunger for them, and new optical illusions attract children to adults every day and boost their eagerness to play it. Recently there was a…", "url": "https://latestnews.fresherslive.com/articles/only-a-person-with-a-hawk-eyes-can-spot-the-telephone-in-this-optical-illusion-1112086", "urlToImage": "https://img.fresherslive.com/latestnews/images/articles/origin/2022/12/01/only-a-person-with-a-hawk-eyes-can-spot-the-telephone-in-this-optical-illusion-6388780b443dd-1669888011.jpg", "publishedAt": "2022-12-02T03:27:17Z", "content": "What Is Optical Illusion?\r\nOptical illusion, also known as Visual Illusion, is a kind of illusion caused by the visual system within visual perception. They are characterized by visual perception, wh… [+2250 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "IANS", "title": "'Early Flu Season, Covid, RSV Causes For Concern In Europe' - ABP Live", "description": "Early Flu season, Respiratory Syncytial Virus (RSV) and Covid-19 cause concern in Europe.", "url": "https://news.abplive.com/news/world/early-flu-season-covid-rsv-causes-for-concern-in-europe-1566967", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/02/cc7f8f9d99be3be31825daedbc197b78166994895705819_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-02T02:53:58Z", "content": "Copenhagen: European health leaders have voiced their concern over a potential surge in respiratory virus infections across the region this winter, and called for better protection of the population,… [+2692 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Tips to keep your bones healthy - Hindustan Times", "description": "Most people reach their peak bone mass around 30 years of age. Here are suggestions by doctors on what to do and what not to do for better bone health and some tips to maintain a healthy bone mass which helps prevent osteoporosis, a condition in which bone be…", "url": "https://www.hindustantimes.com/lifestyle/health/tips-to-keep-your-bones-healthy-101669945699549.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/anne-nygard-Ap2bCOZrAmc-unsplash_1669946048527_1669946071483_1669946071483.jpg", "publishedAt": "2022-12-02T02:05:06Z", "content": "Bone is the most important part of the body and it is the biggest organ system as it covers all the vital organs like the rib cage, spinal cord, peripheral skeleton, etc. Bone mass in the skeletal sy… [+5064 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Intravenous drug users vulnerable to AIDS - The Tribune India", "description": "The increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence rate in Himachal is relatively low as compared to the national rate.", "url": "https://www.tribuneindia.com/news/himachal/intravenous-drug-users-vulnerable-to-aids-456756", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1178236348.jpg", "publishedAt": "2022-12-02T01:56:00Z", "content": "Tribune News Service\r\nShimla, December 1\r\nThe increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence ra… [+1282 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Nanotech strategy shows promise to treat autoimmune disease - ThePrint", "description": "California [US], December 2 (ANI): Scripps Research scientists have reported success in preliminary tests of a new nanotech-based strategy for treating autoimmune diseases. The researchers created cell-like “nanoparticles” that target only the immune cells ca…", "url": "https://theprint.in/health/nanotech-strategy-shows-promise-to-treat-autoimmune-disease/1245057/", "urlToImage": null, "publishedAt": "2022-12-02T01:13:49Z", "content": "California [US], December 2 (ANI): Scripps Research scientists have reported success in preliminary tests of a new nanotech-based strategy for treating autoimmune diseases.\r\nThe researchers created c… [+4363 chars]"}, {"source": {"id": null, "name": "CBS News 8"}, "author": "Ariana Cohen", "title": "San Diego scientists could find new cure for Alzheimer's Disease - CBS News 8", "description": "Researchers are discovering that targeting deteriorating neurons could effectively treat or even prevent Alzheimer's disease.", "url": "https://www.cbs8.com/article/news/local/scientists-new-findings-could-lead-to-cure-for-alzheimers-disease/509-b08d9fac-a077-4a20-85fc-6b61ea176a9a", "urlToImage": "https://media.cbs8.com/assets/KFMB/images/776a8c43-b03a-4535-b203-585a3de0a8da/776a8c43-b03a-4535-b203-585a3de0a8da_1140x641.jpg", "publishedAt": "2022-12-02T00:41:00Z", "content": "SAN DIEGO Joseph Herdy is a UCSD graduate working at the Gage Laboratory of Genetics at the Salk Institute in La Jolla. Herdy and other Salk scientists took skin cells from people with Alzheimer's di… [+1476 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Two experimental mRNA vaccines highly effective in reducing malaria infection and transmission - News-Medical.Net", "description": "Malaria is found in more than 90 countries around the world, causing 241 million cases and an estimated 627,000 deaths every year.", "url": "https://www.news-medical.net/news/20221201/Two-experimental-mRNA-vaccines-highly-effective-in-reducing-malaria-infection-and-transmission.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Malaria_3-620x480.jpg", "publishedAt": "2022-12-01T23:51:00Z", "content": "Malaria is found in more than 90 countries around the world, causing 241 million cases and an estimated 627,000 deaths every year. Vaccines are one intervention that could help eliminate this deadly … [+4163 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Liquid treatment could help relieve carpal tunnel pain, researchers find - CBS Boston", "description": "Millions of Americans suffer from carpal tunnel syndrome but a new procedure could help relieve the pain.", "url": "https://www.youtube.com/watch?v=N0O_NxHxqLE", "urlToImage": "https://i.ytimg.com/vi/N0O_NxHxqLE/hqdefault.jpg", "publishedAt": "2022-12-01T22:32:37Z", "content": null}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Don Rauf", "title": "Monkeypox Is Renamed 'Mpox' to Reduce Stigma - Everyday Health", "description": "Monkeypox will now be officially referred to a “mpox,” according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while “monkeypox” is phased out.", "url": "https://www.everydayhealth.com/infectious-diseases/monkeypox-is-renamed-mpox-to-reduce-stigma/", "urlToImage": "https://images.everydayhealth.com/images/monkeypox-is-renamed-mpox-to-reduce-stigma-1440x810.jpg?sfvrsn=be59a73_1", "publishedAt": "2022-12-01T22:03:02Z", "content": "Monkeypox will now be officially referred to as mpox, according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while monkeypo… [+2767 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New method can measure overall fitness accurately on wearable devices - News-Medical.Net", "description": "Cambridge researchers have developed a method for measuring overall fitness accurately on wearable devices – and more robustly than current consumer smartwatches and fitness monitors – without the wearer needing to exercise.", "url": "https://www.news-medical.net/news/20221201/New-method-can-measure-overall-fitness-accurately-on-wearable-devices.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/87802400-620x480.jpg", "publishedAt": "2022-12-01T21:37:00Z", "content": "Cambridge researchers have developed a method for measuring overall fitness accurately on wearable devices – and more robustly than current consumer smartwatches and fitness monitors – without the we… [+7008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Measles outbreak: 21-month-old boy dies in Thane - The Indian Express", "description": "Thane Municipal Corporation (TMC) commissioner Abhijit Bangar said the child was detected with measles during a door-to-door survey last week. While he had been showing symtoms of measles since November 17, his parents were hesitant to admit him to the hospit…", "url": "https://indianexpress.com/article/cities/mumbai/measles-outbreak-21-month-old-boy-dies-in-thane-8301282/", "urlToImage": "https://images.indianexpress.com/2022/12/A-vaccination-camp-in-Govandi-on-Thursday.-Amit-Chakravarty.jpg", "publishedAt": "2022-12-01T21:30:00Z", "content": "A 21-month-old boy died while undergoing treatment for measles in Thane on November 27, taking the toll to 18 in Maharashtra. The child, Arhan Khan, was admitted to Chhatrapati Shivaji Maharaj Hospit… [+1148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "ICMR-NARI study to help ensure more equity in access to HIV viral load test - The Indian Express", "description": "The HIV Viral Load test is an important marker to monitor the prognosis of HIV positive patients undergoing antiretroviral treatment (ART).", "url": "https://indianexpress.com/article/lifestyle/health/icmr-nari-study-to-help-ensure-more-equity-in-access-to-hiv-viral-load-test-8301324/", "urlToImage": "https://images.indianexpress.com/2022/12/Students-during-the-‘open-day-at-the-National-Aids-Research-Institute-on-the-occasion-of-World-Aids-Day-in-Pune-on-Thursday.-Rajesh-Stephan.jpg", "publishedAt": "2022-12-01T18:54:29Z", "content": "The Indian Council of Medical Research – National AIDS Research Institute (ICMR-NARI) in Pune is conducting a research study in association with the National AIDS Control Organisation (NACO) to ensur… [+3214 chars]"}, {"source": {"id": null, "name": "Sicklecellanemianews.com"}, "author": "Steve Bryson, PhD, Steve Bryson, PhD", "title": "Reducing Dietary Iron Found to Ease Signs of SCD in Mouse Study |... - Sickle Cell Anemia News", "description": "Reducing dietary iron was found to ease blood vessel blockages and lessen organ damage in a mouse model of sickle cell disease (SCD).", "url": "https://sicklecellanemianews.com/news/reducing-dietary-iron-eases-scd-signs-mouse-model-shows/", "urlToImage": "https://sicklecellanemianews.com/wp-content/uploads/2022/11/MiceGroup.png", "publishedAt": "2022-12-01T16:46:01Z", "content": "Reduced dietary iron eased blood vessel blockages and lessened organ damage in a mouse model of sickle cell disease (SCD), a new U.S.-based study reported.\r\nLow iron also reduced gut inflammation in … [+4480 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "5,580 AIDS patients currently registered in Uttarakhand: Health Min - The Siasat Daily", "description": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursday. He was speaking at an awareness rally at the Gandhi Park…", "url": "https://www.siasat.com/5580-aids-patients-currently-registered-in-uttarakhand-health-min-2470173/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/12/Dhan.jpg", "publishedAt": "2022-12-01T16:10:00Z", "content": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursd… [+863 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Alpilean Reviews 2022: Is It A Legit Weight Loss Pill? [Medical Facts and Proof] - DNA India", "description": "Alpilean is a unique combination of the best herbs and organic ingredients", "url": "https://www.dnaindia.com/india/report-alpilean-reviews-2022-is-it-a-legit-weight-loss-pill-medical-facts-and-proof-3007137", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/12/01/2557988-screenshot2022-12-01-10-13-02-494-editcom.microsoft.office.word.jpg", "publishedAt": "2022-12-01T16:08:08Z", "content": "Hey guys! What's up? Thank You for coming to this article about alpileanreviews. Let me ask you a simple question. Do you need to remove excess weight? And nothing is helping you out. Then the alpile… [+17340 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Scientists link rare genetic phenomenon to neuron function, schizophrenia - TheNewsMill", "description": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia\">schizophrenia, elucidating their contribution to the development of this …", "url": "https://thenewsmill.com/2022/12/scientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=54847&object_id=54847&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2022%252F12%252Fscientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia.jpg", "publishedAt": "2022-12-01T15:31:46Z", "content": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia”&gt;schizophre… [+3903 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "5 amazing winter spices to fight cold and flu; how to add them to your diet - Hindustan Times", "description": "Here are some kitchen spices that one can consider adding to meals and drinks for boosting immunity and enhancing flavour. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/5-amazing-winter-spices-to-fight-cold-and-flu-how-to-add-them-to-your-diet-101669905201720.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/01/1600x900/winter_spices_1669905516660_1669905531135_1669905531135.jpg", "publishedAt": "2022-12-01T14:46:15Z", "content": "Come winters and a host of illnesses from cold, cough, sore throat, respiratory trouble to aches and pains can stop you from enjoying the weather and feeling your best. Immunity may need an extra boo… [+3337 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Risk factor assessment for the development of severe SARS-CoV-2 breakthrough infections - News-Medical.Net", "description": "researchers evaluated the severity of breakthrough SARS-CoV-2 (severe acute respiratory syndrome coronavirus 2) infections and the risk factors associated with severity among individuals vaccinated for coronavirus disease 2019 (COVID-19) in Sousse, Tunisia.", "url": "https://www.news-medical.net/news/20221201/Risk-factor-assessment-for-the-development-of-severe-SARS-CoV-2-breakthrough-infections.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_732565_16699052241141042.jpg", "publishedAt": "2022-12-01T14:40:00Z", "content": "In a recent study published in BMC Scientific Diseases, researchers evaluated the severity of breakthrough SARS-CoV-2 (severe acute respiratory syndrome coronavirus 2) infections and the risk factors… [+5852 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Frailty tied to prediabetes progression to diabetes and risk of CVD and mortality - Medical Dialogues", "description": "China: A recent study has reported an association of frailty with the progression of prediabetes to diabetes and increased risks of cardiovascular disease (CVD) and all-cause mortality in patients...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/frailty-tied-to-prediabetes-progression-to-diabetes-and-risk-of-cvd-and-mortality-102986", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/09/190327-frailty.jpg", "publishedAt": "2022-12-01T14:00:22Z", "content": "China: A recent study has reported an association of frailty with the progression of prediabetes to diabetes and increased risks of cardiovascular disease (CVD) and all-cause mortality in patients wi… [+2853 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Effect of air pollution on the human immune system - Nature.com", "description": "Inhaled particulates from environmental pollutants accumulate in macrophages in lung-associated lymph nodes over years, compromising immune surveillance via direct effects on immune cell function and lymphoid architecture. These findings reveal the importance…", "url": "https://www.nature.com/articles/s41591-022-02093-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41591-022-02093-7/MediaObjects/41591_2022_2093_Fig1_HTML.png", "publishedAt": "2022-12-01T13:49:37Z", "content": "Our study shows that pollutants in our environment have a direct and detrimental effect on the human immune system, and specifically the immune organs that are associated with the respiratory tract. … [+1494 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers explore failed SARS-CoV-2 screening at hospital entrances - News-Medical.Net", "description": "Researchers evaluated the failure rates of COVID-19 screening at hospital entrances for visitors, health professionals, and patients at the Yale New Haven Hospital in the US.", "url": "https://www.news-medical.net/news/20221201/Researchers-explore-failed-SARS-CoV-2-screening-at-hospital-entrances.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_732545_16699002779097195.jpg", "publishedAt": "2022-12-01T13:23:00Z", "content": "In a recent study published in JAMA Internal Medicine, researchers evaluated the failure rates of coronavirus disease 2019 (COVID-19) screening at hospital entrances for visitors, health professional… [+6255 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Pills to Increase Sex Drive Female 2023 -Start Your Orgasms Today - Deccan Herald", "description": "The female orgasm is a powerful and unique experience. Unfortunately, not enough of us have the quantity and quality of orgasms we deserve. In fact, did you know that only 65% of heterosexual women orgasm during intercourse?1 There are many reasons for this d…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-pills-to-increase-sex-drive-female-2023-start-your-orgasms-today-1167468.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1167468-1669900168.png", "publishedAt": "2022-12-01T13:09:28Z", "content": "The female orgasm is a powerful and unique experience. Unfortunately, not enough of us have the quantity and quality of orgasms we deserve. In fact, did you know that only 65% of heterosexual women o… [+26640 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "New biomaterial could advance spinal cord injury treatment: Study - The Tribune India", "description": "A newly developed material which could promote new tissue growth and generation could advance the treatment of spinal cord injury, according to a new study.", "url": "https://www.tribuneindia.com/news/health/new-biomaterial-could-advance-spinal-cord-injury-treatment-study-456670", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_410341328.jpg", "publishedAt": "2022-12-01T12:50:00Z", "content": "PTI\r\nLondon, December 1\r\nA newly developed material which could promote new tissue growth and generation could advance the treatment of spinal cord injury, according to a new study.\r\nResearchers used… [+5870 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Alert 2022 - Revive Daily Deep Sleep Support LEGIT or SCAM? What Customer Saying - The Tribune India", "description": "Revive Daily is an exclusive formula that claims to have many health benefits for your body, including weight loss, better sleep, skin health, and more.", "url": "https://www.tribuneindia.com/news/brand-connect/alert-2022-revive-daily-deep-sleep-support-legit-or-scam-what-customer-saying-456669", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_719711458.jpg", "publishedAt": "2022-12-01T12:46:00Z", "content": "Revive Daily is an exclusive formula that claims to have many health benefits for your body, including weight loss, better sleep, skin health, and more.\r\nAccording to the formula's creator, Revive Da… [+14620 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "Dual Stigma Hinders Healthcare Access for LGBTQA+ Community - NewsClick", "description": "HIV/AIDS in India is an epidemic and as per NACO there are around 2.14 million people living with HIV/AIDS.", "url": "https://www.newsclick.in/dual-stigma-hinders-healthcare-access-lgbtqa-community", "urlToImage": "https://www.newsclick.in/sites/default/files/2022-12/Dual%20Stigma%20Hinders%20Healthcare%20Access%20for%20LGBTQA%2B%20Community.jpg", "publishedAt": "2022-12-01T12:44:47Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US CDC plans wastewater testing for polio - ETHealthWorld", "description": "The findings from wastewater testing will help jurisdictions prioritise vaccination efforts in identified communities of concern, said the CDC.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/us-cdc-plans-wastewater-testing-for-polio/95915297", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95915297,imgsize-8820,width-1200,height-628,overlay-ethealthworld/us-cdc-plans-wastewater-testing-for-polio.jpg", "publishedAt": "2022-12-01T12:22:00Z", "content": "Washington: The US Centers for Disease Control and Prevention (CDC) announced that it will expand wastewater testing for poliovirus in select areas across the country.Michigan and Philadelphia are am… [+793 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Warehouse Update - Let's Keto Gummies Australia Untold Truth You Must Know It - The Tribune India", "description": "Their use is a significant revolution because Let's Keto Gummies have the highest components and composition. Our health can be negatively affected by many factors.&nbsp;Many weight-related issues and circumstances can arise after a lockdown period.", "url": "https://www.tribuneindia.com/news/brand-connect/warehouse-update-lets-keto-gummies-australia-untold-truth-you-must-know-it-456643", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_324746282.jpg", "publishedAt": "2022-12-01T11:45:00Z", "content": "Their use is a significant revolution because Let's Keto Gummies have the highest components and composition. Our health can be negatively affected by many factors. Many weight-related issues and cir… [+13600 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Excess oxygen during surgery linked to higher risk of organ damage: Study - Devdiscourse", "description": "A large US study has found that giving patients excess levels of oxygen during surgery is associated with a higher risk of subsequent kidney, heart, and lung injury.", "url": "https://www.devdiscourse.com/article/health/2271499-excess-oxygen-during-surgery-linked-to-higher-risk-of-organ-damage-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_12_2022_10_53_15_6440632.jpg?width=920&format=jpeg", "publishedAt": "2022-12-01T10:53:27Z", "content": "A large US study has found that giving patients excess levels of oxygen during surgery is associated with a higher risk of subsequent kidney, heart, and lung injury. The findings of the study were pu… [+4552 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Swati Luthra", "title": "Air pollution major cause of lung cancer in India, say health experts | Mint - Mint", "description": "High risk patients are eligible for lung cancer screening and it is found to be lifesaving. Despite the continuous efforts, uptake for lung cancer screening is very low which emphasises the need of public awareness", "url": "https://www.livemint.com/news/india/air-pollution-major-cause-of-lung-cancer-in-india-say-health-experts-11669890766550.html", "urlToImage": "https://images.livemint.com/img/2022/12/01/600x338/3fda86fa-7163-11ed-8875-1f8e191d7421_1669890757003.jpg", "publishedAt": "2022-12-01T10:32:46Z", "content": "NEW DELHI: Air pollution is a major health hazard affecting billions of people around the world, particularly developing countries like India. According to the conference organized by Associated Cham… [+3340 chars]"}, {"source": {"id": null, "name": "Inshorts.com"}, "author": null, "title": "BMC body to launch site for online treatment of HIV on World AIDS day - Inshorts", "description": "Mumbai District AIDS Control Society, an autonomous body established by the BMC, will launch a website named 'E-Nirantar' to render online services about HIV/AIDS to mark World AIDS Day. \"People can book appointments for HIV testing and [those who have been d…", "url": "https://inshorts.com/en/news/bmc-body-to-launch-site-for-online-treatment-of-hiv-on-world-aids-day-1669889770238", "urlToImage": "https://static.inshorts.com/inshorts/images/v1/variants/jpg/m/2022/12_dec/1_thu/img_1669885835073_728.jpg?", "publishedAt": "2022-12-01T10:28:35Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "New Covid variant drives virus surge in France - ETHealthWorld", "description": "BA.5, the subvariant of the original Omicron subvariant that has been prevalent in France, has already been replaced, swept away by the BQ.1.1 subvariant, which is the baby of BA.5 said Brigitte Autran, president of the Committee for Monitoring and Anticipati…", "url": "https://health.economictimes.indiatimes.com/news/industry/new-covid-variant-drives-virus-surge-in-france/95911427", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95911427,imgsize-34806,width-1200,height-628,overlay-ethealthworld/new-covid-variant-drives-virus-surge-in-france.jpg", "publishedAt": "2022-12-01T10:25:00Z", "content": "Paris: The BQ.1.1 subvariant of Covid-19 is currently taking precedence over the BA.5 strain in France, a top health expert told the local media.Brigitte Autran, president of the Committee for Monito… [+1173 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Risk of type 2 diabetes and KCNJ11 gene polymorphisms: a nested case–control study and meta-analysis | Scientific Reports - Nature.com", "description": "Scientific Reports - Risk of type 2 diabetes and KCNJ11 gene polymorphisms: a nested case–control study and meta-analysis", "url": "https://www.nature.com/articles/s41598-022-24931-x", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-24931-x/MediaObjects/41598_2022_24931_Fig1_HTML.png", "publishedAt": "2022-12-01T10:16:10Z", "content": "<li>Moazzam-Jazi, M., Najd Hassan Bonab, L., Zahedi, A. S. &amp; Daneshpour, M. S. High genetic burden of type 2 diabetes can promote the high prevalence of disease: a longitudinal cohort study in Ir… [+25819 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Where can i get phentermine to lose weight [Urgent Update] - Deccan Herald", "description": "Are you searching for alternatives to Phentermine available on the market? There are many generic Adipex brands on the market that provide similar weight loss results but without the pitfalls of medication. pill. What is the most effective alternative to Phen…", "url": "https://www.deccanherald.com/brandspot/pr-spot/where-can-i-get-phentermine-to-lose-weight-urgent-update-1167418.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1167418-1669889046.png", "publishedAt": "2022-12-01T10:04:06Z", "content": "Are you searching for alternatives to Phentermine available on the market? There are many generic Adipex brands on the market that provide similar weight loss results but without the pitfalls of medi… [+34389 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "It Ain't Over Till It's Over…but It's Never Over — Emerging and Reemerging Infectious Diseases | NEJM - nejm.org", "description": "Perspective from The New England Journal of Medicine — It Ain’t Over Till It’s Over…but It’s Never Over — Emerging and Reemerging Infectious Diseases", "url": "https://www.nejm.org/doi/full/10.1056/NEJMp2213814", "urlToImage": "https://www.nejm.org/na101/home/literatum/publisher/mms/journals/content/nejm/2022/nejm_2022.387.issue-22/nejmp2213814/20221128/images/img_medium/nejmp2213814_f1.jpeg", "publishedAt": "2022-12-01T09:48:08Z", "content": "As I prepare to step down from my dual positions at the National Institute of Allergy and Infectious Diseases (NIAID), where I have been a physician-scientist for 54 years and the director for 38 yea… [+8059 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "New method of contraceptive: How sperm-blocking vaginal gel can be alternative to IUDs - DNA India", "description": "IUDs are effective but have some side effects, such as mood swings, decreased sex drive, sore breasts, nausea, and headaches.", "url": "https://www.dnaindia.com/health/report-new-method-of-contraceptive-how-sperm-blocking-vaginal-gel-can-be-alternative-to-iuds-3007129", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/12/01/2557870-contraceptive.jpg", "publishedAt": "2022-12-01T07:23:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Dec 01, 2022, 12:57 PM ISTA vaginal gel has been used as an alternative to hormonal contraceptives to prevent sperm injected into … [+1391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Arrowroot: This gluten-free vegetable is diabetes-friendly, promotes weight loss, and relieves constipation - The Indian Express", "description": "Dr Siddhant Bhargava, fitness and nutritional scientist, co-founder, Food Darzee said that arrowroot powder has a significantly high amount of protein and several minerals", "url": "https://indianexpress.com/article/lifestyle/health/arrowroot-gluten-free-vegetable-powder-constipation-diabetes-weight-loss-benefits-8285279/", "urlToImage": "https://images.indianexpress.com/2022/11/arrowroot_200_getty.jpg", "publishedAt": "2022-12-01T07:00:08Z", "content": "There are many vegetables that are known to boost health and strengthen the body’s immunity. And every now and then we get introduced to more such power-packed and sometimes, lesser-known, vegetables… [+3546 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Is walking or running backward good for burning calories, knee pain? - The Indian Express", "description": "Pregnant women, elderly population, stroke patients, or those who have poor balance and coordination must get the approval of their physician before starting, said Varun Rattan, Co-founder of The Body Science Academy", "url": "https://indianexpress.com/article/lifestyle/health/reverse-walking-running-backwards-benefits-knee-legs-cardio-heart-rate-mind-8296294/", "urlToImage": "https://images.indianexpress.com/2022/11/walking_200_getty.jpg", "publishedAt": "2022-12-01T06:00:26Z", "content": "We have to ask you a simple question: Have you ever walked backward, or thought about the benefits it may have? Whether you have or not, turns out, what looks like a simple act has numerous health be… [+3274 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "All You Need To Know About Measles And Things To Keep In Mind - News18", "description": "To prevent Measles from becoming a big problem it is essential to thoroughly understand the disease.", "url": "https://www.news18.com/news/lifestyle/all-you-need-to-know-about-measles-and-things-to-keep-in-mind-6506503.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/untitled-design-33-8-166987390616x9.png", "publishedAt": "2022-12-01T05:52:02Z", "content": "Measles, also known as rubeola is a contagious airborne disease that is caused by a virus. Some of its initial symptoms are high fever, which can spike up to 104 degrees, cough, runny nose, and red o… [+1550 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "25 703 People Living with HIV in Assam ASACS - The Week", "description": "(This story has not been edited by THE WEEK and is auto-generated from a PTI", "url": "https://www.theweek.in/wire-updates/national/2022/12/01/ces2-as-aids-hiv.html", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-12-01T05:45:15Z", "content": "Guwahati, Dec 1 (PTI) Assam has an estimated 25,073 People Living with HIV (PLHIV), according to Assam State AIDS Control Society (ASACS).Of the 25,073 PLHIV, 45 per cent are female and three per cen… [+1831 chars]"}, {"source": {"id": null, "name": "Lww.com"}, "author": null, "title": "Can Controlling Vascular Risk Factors Improve Disease... : Neurology Today - LWW Journals", "description": "An abstract is unavailable.", "url": "https://journals.lww.com/neurotodayonline/fulltext/2022/12010/can_controlling_vascular_risk_factors_improve.4.aspx", "urlToImage": "https://images.journals.lww.com/neurotodayonline/SocialThumb.00132985-202212010-00004.figure1.jpeg", "publishedAt": "2022-12-01T05:02:13Z", "content": "Article In Brief\r\nThree genetic variants associated with monogenic cerebral small vessel disease and stroke occurred more frequently in the general population than expected, but researchers say lifes… [+9325 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "27-year-old man dies of suspected dengue - The Tribune India", "description": "A 27-year-old man reportedly died of dengue at the DMC, Ludhiana, on Tuesday evening. This is the third dengue death from the district. Earlier, one confirmed and another suspected dengue deaths were reported from the district.", "url": "https://www.tribuneindia.com/news/jalandhar/27-year-old-man-dies-of-suspected-dengue-456583", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_407308999.JPG", "publishedAt": "2022-12-01T05:01:00Z", "content": "Tribune News Service\r\nJalandhar, November 30\r\nA 27-year-old man reportedly died of dengue at the DMC, Ludhiana, on Tuesday evening. This is the third dengue death from the district. Earlier, one conf… [+2647 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Why expecting mums' should go for prenatal classes - Mint Lounge", "description": "A new study claims it offers tremendous benefits to their mental health, cutting depression by half", "url": "https://lifestyle.livemint.com/health/wellness/why-expecting-mums-should-go-for-prenatal-classes-111669857283281.html", "urlToImage": "https://images.livemint.com/img/2022/12/01/1140x641/Pregnancy_1669857816677_1669857831654_1669857831654.jpg", "publishedAt": "2022-12-01T02:39:07Z", "content": "A new UC San Francisco study says that a low-cost prenatal intervention improves mothers' mental health up to eight years later.  According to the study, which was one of the first to look at outcome… [+4715 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health Tips Tuesday: importance of lung cancer screenings - Western Mass News", "description": "Lung cancer is the leading cause of cancer deaths in United States, according to the American Cancer Society, but is there a way to detect it early?   For mo...", "url": "https://www.youtube.com/watch?v=2KqdACfTOQs", "urlToImage": "https://i.ytimg.com/vi/2KqdACfTOQs/maxresdefault.jpg", "publishedAt": "2022-12-01T01:46:32Z", "content": null}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Controversial Alzheimer's drug approval sparks surprising impact in US - Devdiscourse", "description": "When the U.S. Food and Drug Administration gave controversial accelerated approval to the first Alzheimer's drug in nearly 20 years, it had a surprising impact on attitudes about research into the disease. A survey by University of California, Irvine neurosci…", "url": "https://www.devdiscourse.com/article/health/2271058-controversial-alzheimers-drug-approval-sparks-surprising-impact-in-us", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_12_2022_00_42_37_9137585.jpeg?width=920&format=jpeg", "publishedAt": "2022-12-01T00:42:56Z", "content": "When the Food and Medicine Administration granted fast approval to the first Alzheimer's drug in nearly 20 years, it had an unexpected impact on attitudes toward Alzheimer's research. According to a … [+3675 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Business Wire", "title": "ViiV Healthcare Unveils a New Global Study Revealing Three Quarters of People Believe There Are Still Negative Perceptions When It Comes to People Living With HIV - Yahoo Finance", "description": "LONDON, December 01, 2022--ViiV Healthcare, the global specialist HIV company majority owned by GSK, with Pfizer and Shionogi as shareholders, today...", "url": "https://finance.yahoo.com/news/viiv-healthcare-unveils-global-study-000100542.html", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2022-12-01T00:07:07Z", "content": "On World AIDS Day 2022, ViiV Healthcare releases data from a survey investigating outdated attitudes towards HIV as part of the HIV in View campaign\r\nLONDON, December 01, 2022--(BUSINESS WIRE)--ViiV … [+8001 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers modulate the activity of potential therapeutic target for triple-negative breast cancer - News-Medical.Net", "description": "Less than 20% of diagnosed breast cancers are designated \"triple-negative,\" lacking three types of receptors often found in other breast cancer types.", "url": "https://www.news-medical.net/news/20221130/Researchers-modulate-the-activity-of-potential-therapeutic-target-for-triple-negative-breast-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2022-12-01T00:04:00Z", "content": "Less than 20% of diagnosed breast cancers are designated \"triple-negative,\" lacking three types of receptors often found in other breast cancer types. But TNBCs have a higher risk of recurrence, meta… [+4792 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "New single-dose drug 95 per cent effective against sleeping sickness in adults: Lancet study - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "GENEVA, Nov 30: A new, single-dose oral treatment for sleeping sickness is 95 per cent effective in adults and adolescents, regardless of disease stage, and could be a key factor in eliminating disease transmission by 2030, according to a study published in T…", "url": "https://www.dailyexcelsior.com/new-single-dose-drug-95-per-cent-effective-against-sleeping-sickness-in-adults-lancet-study/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/11/download-8-29.jpg", "publishedAt": "2022-11-30T19:00:07Z", "content": "GENEVA, Nov 30: A new, single-dose oral treatment for sleeping sickness is 95 per cent effective in adults and adolescents, regardless of disease stage, and could be a key factor in eliminating disea… [+5298 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "IANS", "title": "Surgical Masks Not Inferior To N95 Masks In Protection Against Covid-19: Study - ABP Live", "description": "Surgical masks are not inferior to N95 masks for stopping the spread of Covid-19 among health-care providers at hospitals, according to researchers.", "url": "https://news.abplive.com/science/surgical-masks-not-inferior-to-n95-masks-in-protection-against-covid-19-study-1566703", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/11/30/e7a3dd740d5beb2207aa82db29a9adb71669831689103324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-11-30T18:08:40Z", "content": "Toronto, Nov 30 (IANS) Surgical masks are not inferior to N95 masks for stopping the spread of Covid-19 among health-care providers at hospitals, according to researchers.\r\nAccording to a study led b… [+1929 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Toby Amidor, M.S., RD, C.D.N., F.A.N.D.", "title": "Should You Check Your Blood Sugar Even If You Don't Have Diabetes? What Dietitians Have to Say - EatingWell", "description": "People without diabetes have been checking their blood sugar, and dietitian experts weigh in about whether it's a good idea.", "url": "https://www.eatingwell.com/article/8015310/check-your-blood-sugar-if-dont-have-diabetes/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B1060%2C519%5D&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2022%2F11%2F29%2Fshould-you-check-blood-sugar-even-if-you-dont-have-diabetes.jpg", "publishedAt": "2022-11-30T18:04:37Z", "content": "One of the latest trends in 2022 is folks checking their blood sugar. Typically, people with diabetes tend to check their blood sugar regularly, but this new trend has people who don't have diabetes … [+8239 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Lou Schuler", "title": "Move Faster, Live Longer? A Little More Effort Goes a Long Way - WebMD", "description": "Boosting the intensity of your workouts even a little may significantly reduce your risk of heart disease and add years to your life.", "url": "https://www.webmd.com/fitness-exercise/news/20221130/a-little-more-effort-goes-a-long-way", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/articles/health_tools/a_to_z_minimum_healthy_slideshow/1800ss_thinkstock_rf_woman_resting_during_exercise.jpg", "publishedAt": "2022-11-30T18:03:17Z", "content": "It would be a mistake to say volume doesn't matter, Dempsey cautions. \r\nA 2022 study in the journal The Lancet found that the risk of dying during a given period decreases with each increase in daily… [+867 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Why there are frequent heart attacks in winter - Mint", "description": "Why so many heart attacks in winter", "url": "https://www.livemint.com/web-stories/why-there-are-frequent-heart-attacks-in-winter-11669818604736.html", "urlToImage": null, "publishedAt": "2022-11-30T12:05:00Z", "content": "HEART ATTACKS\r\nWHY ARE HEART ATTACKS FREQUENT IN WINTER\r\nPublished By Livemint \r\n | 30 Nov, 2022\r\nLet's look at reasons why heart attacks are more common in winter\r\nDuring winters, heart needs to pum… [+596 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study: Retinal cells have potential to protect from diabetic retinopathy - ETHealthWorld", "description": "The investigators cultured human retinal endothelial cells in either normal glucose or high glucose-containing media. Unexpectedly, they found that prolonged exposure to high glucose was beneficial, not detrimental. After one day, the health of the cells decl…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-retinal-cells-have-potential-to-protect-from-diabetic-retinopathy/95881759", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95881759,imgsize-4434,width-1200,height-628,overlay-ethealthworld/study-retinal-cells-have-potential-to-protect-from-diabetic-retinopathy.jpg", "publishedAt": "2022-11-30T10:45:00Z", "content": "Philadelphia (US): Diabetic retinopathy (DR), a primary cause of blindness in working-age people, affects about one-third of diabetic patients. DR usually develops after a long period of diabetes mel… [+3695 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Machine Learning Improves Detection of Ovarian Lesions - Technology Networks", "description": "A machine learning model has been developed that can identify whether an ovarian lesion is cancerous or benign.", "url": "https://www.technologynetworks.com/cancer-research/news/machine-learning-improves-detection-of-ovarian-lesions-367999", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367999/machine-learning-improves-detection-of-ovarian-lesions-367999-640x360.jpg?cb=20221130", "publishedAt": "2022-11-30T09:58:38Z", "content": "Although ovarian cancer is the deadliest type of cancer for women, only about 20% of cases are found at an early stage, as there are no real screening tests for them and few symptoms to prompt them. … [+2967 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Study Links Hair Straighteners To Uterine Cancer: Are Chemical Relaxers Safe? - NDTV", "description": "Several women in the US have gone to court questioning the safety of hair straightening products. In their petitions, the women allege that the use of chemic...", "url": "https://www.youtube.com/watch?v=Sl8a3NZSVxs", "urlToImage": "https://i.ytimg.com/vi/Sl8a3NZSVxs/maxresdefault.jpg", "publishedAt": "2022-11-29T12:43:13Z", "content": null}]}