{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Low-dose CT screening improves survival rate of lung cancer patients - News-Medical.Net", "description": "Diagnosing early-stage lung cancer with low-dose computed tomography (CT) screening drastically improves the survival rate of cancer patients over a 20-year period, according to a large-scale international study being presented by Mount Sinai researchers at t…", "url": "https://www.news-medical.net/news/20221122/Low-dose-CT-screening-improves-survival-rate-of-lung-cancer-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-11-22T14:31:00Z", "content": "Diagnosing early-stage lung cancer with low-dose computed tomography (CT) screening drastically improves the survival rate of cancer patients over a 20-year period, according to a large-scale interna… [+4082 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Predictive value of 'good' cholesterol level varies by race, US study finds - ETHealthWorld", "description": "In contradiction to what has generally been assumed, low HDL levels did not confer any higher risk of heart disease in Black people, researchers said. Among white people, however, those with HDL levels below 40 milligrams per deciliter had a 22% higher risk f…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/predictive-value-of-good-cholesterol-level-varies-by-race-us-study-finds/95693426", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95693426,imgsize-1393702,width-1200,height-628,overlay-ethealthworld/predictive-value-of-good-cholesterol-level-varies-by-race-us-study-finds.jpg", "publishedAt": "2022-11-22T14:25:00Z", "content": "New Delhi: The widely-held concept that levels of \"good\" cholesterol in the blood can indicate heart disease risk is not equally true for Blacks and whites, and the measure itself may be of less valu… [+2696 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Diastolic blood pressure found to be associated with neuroticism - News-Medical.Net", "description": "Diastolic blood pressure-;the lower of the two numbers in a blood pressure reading-;is highly likely to cause neurotic personality trait, finds research published in the open access journal General Psychiatry.", "url": "https://www.news-medical.net/news/20221122/Diastolic-blood-pressure-found-to-be-associated-with-neuroticism.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Blood_pressure_-_kurhan_190c9e39c9604c7a8ce4b5999522f80a-620x480.jpg", "publishedAt": "2022-11-22T14:24:00Z", "content": "Diastolic blood pressure-;the lower of the two numbers in a blood pressure reading-;is highly likely to cause neurotic personality trait, finds research published in the open access journal General P… [+3257 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study shows superbugs in the environment rarely transfer over to humans - ETHealthWorld", "description": "These bacteria are now highly resistant to antibiotics, with some strains even resistant to carbapenems, one of the so-called \"last resort\" class of antibiotics which is only used when no other antibiotic treatment works.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-shows-superbugs-in-the-environment-rarely-transfer-over-to-humans/95691936", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95691936,imgsize-5058,width-1200,height-628,overlay-ethealthworld/study-shows-superbugs-in-the-environment-rarely-transfer-over-to-humans.jpg", "publishedAt": "2022-11-22T13:12:00Z", "content": "Washington (US): An international team of scientists investigating transmission of a deadly drug-resistant bacteria that rivals MRSA, has found that whilst the bugs are found in livestock, pets and t… [+4612 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Lauren Martin", "title": "Prediabetes and high cholesterol diet: Foods to eat, sample diet plan, - Medical News Today", "description": "Nutrition is very important for people with prediabetes and high cholesterol. Dietitians frequently recommend the Mediterannean and DASH diets, but advice varies from person to person. Learn more.", "url": "https://www.medicalnewstoday.com/articles/diet-for-prediabetes-and-high-cholesterol", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/10/prediabetes_cholesterol_GettyImages1335878891_Thumb.jpg", "publishedAt": "2022-11-22T13:09:28Z", "content": "A nutritious, balanced diet is important for people with prediabetes and high cholesterol. Although individual recommendations vary, dietitians frequently recommend the Mediterranean and DASH diets.\r… [+8080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some low-carb, high-fibre foods that are ideal for weight loss - The Indian Express", "description": "According to nutritionist Divya Sobti, coconut is low in carbs and high in fibre and fat, so it may help stabilise your blood sugar", "url": "https://indianexpress.com/article/lifestyle/health/low-carb-high-fibre-foods-weight-loss-diet-snacks-fruits-8156484/", "urlToImage": "https://images.indianexpress.com/2021/03/pixabay_fruit-healthy-eating_incopy.jpg", "publishedAt": "2022-11-22T12:50:56Z", "content": "There’s no denying the benefits of consuming a fibre-rich diet. From aiding weight loss to keeping one fuller for longer, fibre also helps control blood sugar levels. But many of the high-fibre foods… [+2854 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Phentermine Over the Counter Alternatives, 5 Best Adipex OTC to Buy Online and In Store Near Me - Deccan Herald", "description": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase. Whether you opt for a Phentermine over-the-counter online or in store brand we have 5 of the most effective natural substitutes reviewed …", "url": "https://www.deccanherald.com/brandspot/pr-spot/phentermine-over-the-counter-alternatives-5-best-adipex-otc-to-buy-online-and-in-store-near-me-1164734.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164734-1669119785.png", "publishedAt": "2022-11-22T12:23:05Z", "content": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase.\r\nWhether you opt for a Phentermine over-the-counter online or in store brand … [+27530 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Bacterial infections second leading cause of death worldwide: study - Global Times", "description": "Bacterial infections are the second leading cause of death worldwide, accounting for one in eight of all deaths in 2019, the first global estimate of their lethality revealed on Tuesday.", "url": "https://www.globaltimes.cn/page/202211/1280170.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-12-09/ac76206f-f3fc-4670-a566-c25bcb368c88.jpeg", "publishedAt": "2022-11-22T12:17:00Z", "content": "Chen Borui checks the culture of bacteria strains in a laboratory at Fuzhou Dermatosis Prevention Hospital in Fuzhou, southeast China's Fujian Province, Dec. 8, 2021. Having been studying and working… [+2049 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Monkeypox - Latest Data Reveals How the Virus Has Affected Women and Non-Binary People - AllAfrica - Top Africa News", "description": "Analysis - Since May 2022, a global outbreak of human monkeypox infections has been reported in over 78,000 people. So far, infections have overwhelmingly occurred in sexually active men who have sex with men.", "url": "https://allafrica.com/stories/202211220431.html", "urlToImage": "https://cdn07.allafrica.com/download/pic/main/main/csiid/00431932:4525ab3074ad385b2ec8beb9263fd0ea:arc614x376:w1200.jpg", "publishedAt": "2022-11-22T11:54:31Z", "content": "Since May 2022, a global outbreak of human monkeypox infections has been reported in over 78,000 people. So far, infections have overwhelmingly occurred in sexually active men who have sex with men.\r… [+5067 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Measles: How it spreads, symptoms, prevention, treatment tips, vaccines - Hindustan Times", "description": "When a person is infected with Measles virus, the infection can last up to ten days, during which the individual can contract various diseases like ear infections, diarrhea and Pneumonia, apart from fever and rashes. Here's how it spreads, symptoms, preventio…", "url": "https://www.hindustantimes.com/lifestyle/health/measles-how-it-spreads-symptoms-prevention-treatment-tips-vaccines-101669115798500.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/22/1600x900/disease-ga0419e44b_1920_1669116403161_1669116450678_1669116450678.jpg", "publishedAt": "2022-11-22T11:48:41Z", "content": "A few days ago Mumbai reported an outbreak of Measles, a highly contagious viral infection which happened a year before the countrys target to eliminate the disease by December 2023. This is a cause … [+4164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Carbs For Diabetics: 5 Whole Grains People With Diabetes Can Add To Their Diet - NDTV", "description": "Diabetes diet: These are some of the whole grains that can provide carbs and control blood sugar levels at the same time.", "url": "https://www.ndtv.com/health/carbs-for-diabetics-5-whole-grains-people-with-diabetes-can-add-to-their-diet-3543448", "urlToImage": "https://i.ndtvimg.com/i/2017-11/whole-grains_650x400_61509947059.jpg", "publishedAt": "2022-11-22T11:28:06Z", "content": "People with diabetes are usually advised to avoid carbs\r\nIt's true that you need to be very careful about your food choices if you are a diabetic. And sometimes, there seems to be a lot of confusion … [+2261 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Improve brain power: These omega-3-rich foods can boost brain function and memory - Zee News", "description": "Given that the brain consumes about 20% of the bodys calories, it requires a lot of healthy nourishment to keep cognitive alertness throughout the day. Certain nutrients are also necessary for the health of the brain.", "url": "https://zeenews.india.com/health/improve-brain-power-these-omega-3-rich-foods-can-boost-brain-function-and-memory-2538815", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/22/1120470-brain-food.png", "publishedAt": "2022-11-22T11:09:58Z", "content": "Improve brain power: Given that the brain consumes about 20% of the body's calories, it requires a lot of healthy nourishment to keep cognitive alertness throughout the day. Certain nutrients are als… [+2188 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Mutation Associated With Autism Can Overstimulate Brain Cells - Technology Networks", "description": "Scientists studying the fundamental brain mechanisms observed in autism have found that a mutation known to be associated with autism causes overstimulation of brain cells far greater than that seen in neuronal cells without the mutation.", "url": "https://www.technologynetworks.com/neuroscience/news/mutation-associated-with-autism-can-overstimulate-brain-cells-367798", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367798/mutation-associated-with-autism-can-overstimulate-brain-cells-367798-640x360.jpg?cb=20221122", "publishedAt": "2022-11-22T10:48:38Z", "content": "Scientists looking to understand the fundamental brain mechanisms of autism spectrum disorder have found that a gene mutation known to be associated with the disorder causes an overstimulation of bra… [+4394 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Devrupa Rakshit", "title": "Why We Might Feel Lonelier as We Age - The Swaddle", "description": "\"[The] loneliness results from a discrepancy between expected and actual social relationships,” a researcher explained.", "url": "https://theswaddle.com/why-people-might-feel-lonelier-as-they-age/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/11/Loneliness-Editorial.jpg", "publishedAt": "2022-11-22T10:48:37Z", "content": "As teenagers and young adults, people often tend to determine their self-worthby the number of friends in their circle. As they begin to grow older, though, many start preferring fewer, but closer fr… [+4921 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Pain relievers may worsen arthritis inflammation, study finds - Devdiscourse", "description": "Read more about Pain relievers may worsen arthritis inflammation, study finds on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2260998-pain-relievers-may-worsen-arthritis-inflammation-study-finds", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_06_2022_16_22_58_38393.jpg?width=920&format=jpeg", "publishedAt": "2022-11-22T10:47:08Z", "content": "Taking certain anti-inflammatory pain relievers for osteoarthritis may worsen inflammation in the knee joint over time, according to a study.\r\nOsteoarthritis is the most common form of arthritis, aff… [+3726 chars]"}, {"source": {"id": null, "name": "Breastcancernow.org"}, "author": null, "title": "Scientists discover how some DCIS tumours can become invasive - Breast Cancer Now", "description": "Scientists, based at the Queen Mary University of London, have discovered a new mechanism that signals which Ductal Carcinoma in Situ (DCIS) tumours may progress to invasive breast cancer. This might help avoid unnecessary treatment for some women with DCIS i…", "url": "https://breastcancernow.org/about-us/news-personal-stories/scientists-discover-how-some-dcis-tumours-can-become-invasive", "urlToImage": "https://breastcancernow.org/file/tissuebank2022bcn31852jpg", "publishedAt": "2022-11-22T10:42:40Z", "content": "Scientists, based at the Queen Mary University of London, have discovered a new mechanism that signals which Ductal Carcinoma in Situ (DCIS) tumours may progress to invasive breast cancer. This might… [+3527 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "WHO to identify viruses that could cause future pandemics. Disease X is on priority list - India Today", "description": "The current list of priority pathogens that will be revised by WHO, incudes Covid-19, Ebola virus disease and Marburg virus disease, Lassa fever, MERS and SARS, Zika and Disease X.", "url": "https://www.indiatoday.in/health/story/who-to-identify-viruses-that-could-cause-future-pandemics-disease-x-is-on-priority-list-2300349-2022-11-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202211/untitled_design_-_2022-11-22t155620.118-sixteen_nine.png?VersionId=YU8X7syx867dS1QI6Hfg.1eUD4m38Ceq", "publishedAt": "2022-11-22T10:40:17Z", "content": "By Daphne Clarance: The World Health Organisation (WHO) said that it is updating a list of priority pathogens that could cause outbreaks or pandemics in the future. These pathogens have been kept und… [+2021 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Red Boost Tonic Reviews - Dosage, Consumer Reports, Benefits & Side Effects - Deccan Herald", "description": "What is Red Boost Tonic? Red Boost is a blood flow support formulation that efficiently enhances male sexual performance.  The manufacturer claims that the formula targets the root cause of sexual health problems and restores sexual stamina.  Red Boost is pro…", "url": "https://www.deccanherald.com/brandspot/pr-spot/red-boost-tonic-reviews-dosage-consumer-reports-benefits-side-effects-1164699.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164699-1669112087.png", "publishedAt": "2022-11-22T10:14:47Z", "content": "What is Red Boost Tonic?\r\nRed Boost is a blood flow support formulation that efficiently enhances male sexual performance. \r\nThe manufacturer claims that the formula targets the root cause of sexual … [+8314 chars]"}, {"source": {"id": null, "name": "Endocrinologynetwork.com"}, "author": null, "title": "European Study Links Antibiotic Exposure to Increased Risk of Type 2 Diabetes Later in Life - Endocrinology Network", "description": "An analysis of data from a pair of studies examining cardiovascular risk in individuals from countries in Europe provides insight into an apparent increase in the likelihood of developing type 2 diabetes among people with a history of exposure to antibiotics.", "url": "https://www.endocrinologynetwork.com/view/european-study-links-antibiotic-expsure-to-increased-risk-of-type-2-diabetes-later-in-life", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/endocrinology/6bcc6962daca3c5f30c0271cfc3a1590431f7870-5230x4000.jpg?fit=crop&auto=format", "publishedAt": "2022-11-22T10:06:59Z", "content": "Each course of antibiotics during young adulthood was associated with a 2-4% increase in risk of developing type 2 diabetes, according to the results of a new analysis.\r\nUsing data from the Cardiovas… [+3796 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Two-thirds of first-wave patients developed long Covid: Spain study - The New Indian Express", "description": "The most common persistent symptoms among both hospitalised and nonhospitalised patients were fatigue, pain, and memory loss.", "url": "https://www.newindianexpress.com/lifestyle/health/2022/nov/22/two-thirds-of-first-wave-patients-developed-long-covid-spain-study-2520955.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/11/11/w600X390/CHINACOVID.jpg", "publishedAt": "2022-11-22T09:51:00Z", "content": "LONDON: Over two-thirds of non-hospitalised patients infected with the SARS-CoV-2 virus in the first wave of the pandemic developed long COVID, according to a study conducted in Spain.\r\nThe results, … [+5916 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Japan to develop first blood biomarker-based diagnostic workflow for dementia - BSA bureau", "description": "Shimadzu, Eisai, Oita University, and Usuki City Medical Association commence joint research", "url": "https://www.biospectrumasia.com/news/105/21475/japan-to-develop-first-blood-biomarker-based-diagnostic-workflow-for-dementia-.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/12-21475.jpeg", "publishedAt": "2022-11-22T09:07:41Z", "content": "For building an ecosystem that improves the early detection of Alzheimer's disease \r\nShimadzu Corporation, Eisai Co., Oita University, and Usuki City Medical Association have announced the commenceme… [+1897 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Figur Diet", "title": "Figur Diet Review 2022: (Shocking Truth!) All that you have to know about Figur Diet Exposed. - openPR", "description": "When people think about losing weight they frequently picture a stringent diet that requires hours of exercise and calorie restricted meals You can make use of the Figur Diet supplement Losing weight is one of the most challenging things you ...", "url": "https://www.openpr.com/news/2815769/figur-diet-review-2022-shocking-truth-all-that-you-have", "urlToImage": "https://cdn.openpr.com/V/b/Vb22381564_g.jpg", "publishedAt": "2022-11-22T08:44:00Z", "content": "Figur Diet\r\nWhen people think about losing weight, they frequently picture a stringent diet that requires hours of exercise and calorie-restricted meals. You can make use of the Figur Diet supplement… [+14593 chars]"}, {"source": {"id": null, "name": "MensXP.com"}, "author": "Saurabh Dixit", "title": "Heat Boils 101: Here’s Why They Occur And How To Deal With Them - msnNOW", "description": "Getting a boil is like getting work calls on weekends; they’re stressful to deal with, are a pain, and can ruin your day. While this is a natural part of life that occurs from time to time, handling it can be pretty frustrating. And contrary to their name, th…", "url": "https://www.mensxp.com/grooming/skin-care/122717-how-to-deal-with-heat-boils.html", "urlToImage": "https://img.mensxp.com/media/content/2022/Nov/image1_637c8ba8d2121.jpeg", "publishedAt": "2022-11-22T08:38:16Z", "content": "Getting a boil is like getting work calls on weekends; theyre stressful to deal with, are a pain, and can ruin your day. While this is a natural part of life that occurs from time to time, handling i… [+8032 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Edinburgh: An excess of salty food seasons the body with stress - India Education Diary", "description": "Scientists found in studies of mice that a high-salt diet increased the levels of a stress hormone by 75 per cent.Experts hope the findings will encourage a review of public health policy around salt consumption, with a view to manufacturers reducing", "url": "https://indiaeducationdiary.in/university-of-edinburgh-an-excess-of-salty-food-seasons-the-body-with-stress/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/University_of_Edinburgh_ceremonial_roundel.svg_.png?fit=1017%2C1024&ssl=1", "publishedAt": "2022-11-22T08:19:31Z", "content": "Scientists found in studies of mice that a high-salt diet increased the levels of a stress hormone by 75 per cent.\r\nExperts hope the findings will encourage a review of public health policy around sa… [+1687 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers create adrenal gland organoids using stem cells - ThePrint", "description": "Washington [US], November 22 (ANI): A team coaxed stem cells to take on the characteristics and functions of a human adrenal gland, progress that could lead to new therapies for adrenal insufficiencies and a deeper understanding of the genetics of such disord…", "url": "https://theprint.in/health/researchers-create-adrenal-gland-organoids-using-stem-cells/1229591/", "urlToImage": null, "publishedAt": "2022-11-22T08:13:52Z", "content": "Washington [US], November 22 (ANI): A team coaxed stem cells to take on the characteristics and functions of a human adrenal gland, progress that could lead to new therapies for adrenal insufficienci… [+5017 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Why cervical cancer is rising among young women - Mint Lounge", "description": "Despite the fact that HPV screening has made cervical cancer preventable, the number of women in their early 30s getting diagnosed with it is still rising", "url": "https://lifestyle.livemint.com/health/wellness/why-cervical-cancer-is-rising-among-young-women-111669097104660.html", "urlToImage": "https://images.livemint.com/img/2022/11/22/1140x641/Cancer_1669098362006_1669098391727_1669098391727.jpg", "publishedAt": "2022-11-22T07:10:37Z", "content": "The frequency of cervical cancer among women in their early 30s has dramatically increased recently, according to recent research.\r\nThe findings were published in the Journal of the American Medical … [+4802 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Foods that will help Lower Cholesterol Levels - The Quint FIT", "description": "Here is a list of foods that are rich in monounsaturated fats and fiber that will help reduce LDL and increase good cholesterol instead.", "url": "https://www.thequint.com/fit/foods-that-will-help-lower-cholesterol-levels", "urlToImage": "https://images.thequint.com/thequint%2F2022-11%2F975e67d8-d2f2-4ff1-8f43-1627476ad16b%2Fcholesterol_workplace_of_a_doctor_stethoscope_on_wooden_desk_background_jpg_s_1024x1024_w_is_k_20_c_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-11-22T06:33:09Z", "content": "High cholesterol is a problem that arises when there is a high amount of fat in the blood which is caused due to lack of exercise, obesity, eating fatty food, and drinking alcohol. Thus, dietary and … [+768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Diksha Dayal", "title": "A vitamin-packed superfood: How a tomato keeps your weight, blood pressure, diabetes and heart health under control - The Indian Express", "description": "The nutritional load of tomatoes varies according to cooking method and type. So while tomato soup, juices and purees can help you manage weight, raw tomatoes can help you with dehydration and spaghetti sauces protect the heart. Cherry tomatoes have higher be…", "url": "https://indianexpress.com/article/lifestyle/health-specials/vitamin-packed-superfood-tomato-weight-blood-pressure-diabetes-heart-health-under-control-8282322/", "urlToImage": "https://images.indianexpress.com/2022/11/tomatoes-759.jpg", "publishedAt": "2022-11-22T06:20:54Z", "content": "We often wonder why the Mediterranean diet is considered the healthiest. But the simple answer lies in the fact that it contains a bulk of tomatoes. These are considered a rich source of Vitamin K an… [+7265 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "IANS", "title": "Dengue Outbreak in Uttar Pradesh: Lucknow Reports 47 Cases in Single Day - LatestLY", "description": "Even as the mercury begins to dip and winter sets in, there has been no let-up in dengue cases, with Lucknow registering 47 cases in just a day. Majority of the new dengue cases were reported from congested residential and commercial localities like Aishbagh …", "url": "https://www.latestly.com/india/news/dengue-outbreak-in-uttar-pradesh-lucknow-reports-47-cases-in-single-day-4490321.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/11/69-8-784x441.jpg", "publishedAt": "2022-11-22T05:11:56Z", "content": "Lucknow, November 21: Even as the mercury begins to dip and winter sets in, there has been no let-up in dengue cases, with Lucknow registering 47 cases in just a day. Majority of the new dengue cases… [+1661 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Odishatv Bureau", "title": "Eat these four foods to feel stress-free instantly - OTV News", "description": "Stress has now become a common conversation point in workplaces especially when confronted with meeting deadlines, dealing with financial problems, health issues, and making study and career decisions.", "url": "https://odishatv.in/health/news-eat-these-four-foods-to-feel-stress-free-instantly-190766", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1669040129.webp", "publishedAt": "2022-11-22T04:52:33Z", "content": "It is normal to experience tension, anxiety, grief, and worry. And food can be your best friend while coping with it. When you're feeling stressed, the body demands certain vitamins and minerals, inc… [+1657 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Connection between gut and stroke-induced cognitive impairment: Research - Hindustan Times", "description": "Two-thirds of stroke patients will develop cognitive impairment, while one-third of all stroke patients will go on to develop dementia, according to recent research, so there is a critical need for more effective stroke therapies that preserve cognitive funct…", "url": "https://www.hindustantimes.com/lifestyle/health/connection-between-gut-and-stroke-induced-cognitive-impairment-research-101669090354820.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/22/1600x900/intelligence-g5b7c9b1ab_1920_1667638104502_1669090429688_1669090429688.jpg", "publishedAt": "2022-11-22T04:16:19Z", "content": "A major contributor to dementia, substantial long-term impairment, and mortality is stroke. The American Heart Association revealed that stroke patients are more likely to experience depression, whic… [+4521 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Shruti Saini", "title": "Do your teeth hurt during winter? Follow these 7 expert tips to prevent it - Health shots", "description": "Do you experience tooth pain during winter? If so, keep in mind these 7 tips to deal with the pain and keep your oral health in check.", "url": "https://www.healthshots.com/preventive-care/self-care/7-tips-for-dental-care-and-to-treat-tooth-pain-during-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/21190538/dental-care.jpg", "publishedAt": "2022-11-22T03:29:53Z", "content": "The cold weather not also dries out your skin, but it can also increase your risk for dental problems. Many people tend to get worried about increased teeth’ sensitivity before winter sets in. Rememb… [+3089 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "IIT-Delhi researcher reveals significant brain abnormalities in long Covid patients - Daijiworld.com", "description": "New Delhi, Nov 22 (IANS): Sapna S. Mishra, a PhD candidate at the Indian Institute of Technology in Delhi, and a team of researchers have used a special type of MRI to uncover brain changes in patients up to six months after they recovered from Covid-19.\r\nMRI…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1021936", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-11-22T02:58:35Z", "content": "New Delhi, Nov 22 (IANS): Sapna S. Mishra, a PhD candidate at the Indian Institute of Technology in Delhi, and a team of researchers have used a special type of MRI to uncover brain changes in patien… [+2594 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Gold Coast Keto Gummies Maggie Beer Australia Shocking Shark Tank Exposed Chemist Warehouse 2022 - The Tribune India", "description": "&nbsp;Gold Coast Keto Gummies Maggie Beer are extremely popular. If you have weight gain issues and have tried so many diets unsuccessfully, you should give these wonderful fat burners a trial as they offer ultimate weight-loss results. OFFICIAL WEBSITE-&rdqu…", "url": "https://www.tribuneindia.com/news/brand-connect/gold-coast-keto-gummies-maggie-beer-australia-shocking-shark-tank-exposed-chemist-warehouse-2022-453473", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1644748702.jpg", "publishedAt": "2022-11-22T02:40:00Z", "content": "Gold Coast Keto Gummies Maggie Beer are extremely popular. If you have weight gain issues and have tried so many diets unsuccessfully, you should give these wonderful fat burners a trial as they offe… [+8519 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reports higher number of child abuse cases in areas selling alcohol - Devdiscourse", "description": "The number of stores selling alcohol in a neighborhood is linked to cases of child abuse and neglect in the same area, a new study suggests.", "url": "https://www.devdiscourse.com/article/science-environment/2260435-study-reports-higher-number-of-child-abuse-cases-in-areas-selling-alcohol", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_11_2022_02_29_06_4465024.jpg?width=920&format=jpeg", "publishedAt": "2022-11-22T02:29:17Z", "content": "According to a Sacramento, California, research there were 10.5 per cent more children placed in foster care and 13.5 per cent more substantiated occurrences of child abuse and neglect in a census tr… [+3899 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "The Cause of Alzheimer's Could Be Coming From Inside Your Mouth - ScienceAlert", "description": "In recent years, a growing number of scientific studies have backed an alarming hypothesis: Alzheimer's disease isn't just a disease, it's an infection.", "url": "https://www.sciencealert.com/the-cause-of-alzheimers-could-be-coming-from-inside-your-mouth", "urlToImage": "https://www.sciencealert.com/images/2022/11/FingerPointsAtMouthXray.jpg", "publishedAt": "2022-11-22T01:37:34Z", "content": "In recent years, a growing number of scientific studies have backed an alarming hypothesis: Alzheimer's disease isn't just a disease, it's an infection.\r\nWhile the exact mechanisms of this infection … [+3733 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Doctors and survivors discuss importance of early lung cancer detection | 2 Your Well-Being (Part 1) - WFMY News 2", "description": "Dr. Mohamed said everyone is at risk for lung cancer. Lung cancer has largely been connected to smokers, but Dr. Mohamed said more non-smokers are presenting...", "url": "https://www.youtube.com/watch?v=0CW7yRlwGCI", "urlToImage": "https://i.ytimg.com/vi/0CW7yRlwGCI/hqdefault.jpg", "publishedAt": "2022-11-21T23:54:28Z", "content": null}, {"source": {"id": null, "name": "Onbetterliving.com"}, "author": null, "title": "7 Signs Your Digestion Could Be Better - Better Living", "description": "If you’re experiencing digestive discomfort after eating, you may have trouble breaking down your foods. Here’s the signs of an unhealthy gut and how to fix it.", "url": "https://onbetterliving.com/improve-digestion/", "urlToImage": "https://onbetterliving.com/wp-content/uploads/2021/11/Flora-Enzyme-Blends-4.jpg", "publishedAt": "2022-11-21T22:23:57Z", "content": "Better Living uses affiliate links. If you make a purchase through them, we may receive a small commission (for which we are deeply grateful) at no cost to you.Healthy digestion is more than getting … [+15066 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Desirée O", "title": "Intermittent Fasting Can Lead To Disordered Eating, Study Finds - Eat This, Not That", "description": "A recently published study found that intermittent fasting was associated with disordered eating behaviors.", "url": "https://www.eatthis.com/intermittent-fasting-dangerous-effects-study/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/11/woman-holding-up-hand-clock-showing-intermittent-fasting-concept-cereal-bowl.jpg?quality=82&strip=all", "publishedAt": "2022-11-21T22:19:05Z", "content": "There is a fair share of benefits to intermittent fasting (IF)a diet where you eat only within a limited window of time (generally 8 hours) and fast for the remaining hours of the day. IF has become … [+3209 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Is it RSV, flu, or Covid? How to tell the difference - KPIX CBS SF Bay Area", "description": "Medical experts continue to warn of a possible 'Tripledemic' this winter, with Covid-19, flu and RSV cases all on the rise. But if you're not feeling well, h...", "url": "https://www.youtube.com/watch?v=bDebuRYZV88", "urlToImage": "https://i.ytimg.com/vi/bDebuRYZV88/maxresdefault.jpg", "publishedAt": "2022-11-21T21:33:20Z", "content": null}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Tremor, restless legs syndrome, schizophrenia among risk factors linked to PD - Healio", "description": "An increased risk for Parkinson&rsquo;s disease was associated with a range of factors, comorbidities and prodromal features, some of which may appear 5 to 10 years prior to diagnosis, according to a study in JAMA Neurology.&ldquo;Prodromal features of Parkin…", "url": "https://www.healio.com/news/neurology/20221121/tremor-restless-legs-syndrome-schizophrenia-among-risk-factors-linked-to-pd", "urlToImage": "https://www.healio.com/~/media/temporary/schizophrenia.jpg", "publishedAt": "2022-11-21T20:11:47Z", "content": "Source/Disclosures\r\n Disclosures: \r\nSchrag reports receiving a salary from the National Institute for Health and Care Research Biomedical Research Council during the conduct of the study; grants from… [+3517 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Measles rubella: Ludhiana health dept to carry out survey to trace unvaccinated kids - Hindustan Times", "description": "In a bid to ramp up measles rubella inoculation in the district, the health department will conduct a survey to trace unvaccinated children under the age of five; the unvaccinated children will be inoculated within the month", "url": "https://www.hindustantimes.com/cities/chandigarh-news/measles-rubella-ludhiana-health-dept-to-carry-out-survey-to-trace-unvaccinated-kids-101669057254168.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/21/1600x900/8f793a4a-69ce-11ed-a893-f7cb495c1b3d_1669057253024.jpg", "publishedAt": "2022-11-21T19:00:53Z", "content": "In a bid to ramp up measles rubella inoculation in the district, the health department will conduct a survey to trace unvaccinated children under the age of five. The unvaccinated children will be in… [+703 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Helen Leask", "title": "New Trials in Breast Cancer: Could Your Patient Benefit? - Medscape", "description": "Could one of your patients benefit from being enrolled into one of the clinical trials now enrolling patients with breast cancer?", "url": "https://www.medscape.com/viewarticle/984390", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_211216_breast_cancer_tumor_800x450.jpg", "publishedAt": "2022-11-21T17:51:06Z", "content": "Several clinical trials in breast cancer have started in recent months. Maybe one of your patients could benefit from taking part.\r\nHER2/neu-positive breast cancer with high risk of recurrence follow… [+7575 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Tumour matrix profiling can predict some lung cancers’ progression - ThePrint", "description": "Sydney [Australia], November 21 (ANI): A common type of lung cancer has molecular profiles of its surrounding matrix that have been uncovered by researchers at the Garvan Institute of Medical Research. These profiles may help identify which patients are most …", "url": "https://theprint.in/health/tumour-matrix-profiling-can-predict-some-lung-cancers-progression/1228801/", "urlToImage": null, "publishedAt": "2022-11-21T17:14:48Z", "content": "Sydney [Australia], November 21 (ANI): A common type of lung cancer has molecular profiles of its surrounding matrix that have been uncovered by researchers at the Garvan Institute of Medical Researc… [+3573 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Almonds can help cut calories, finds study - ANI News", "description": "Weight loss is never an easy nut to crack, but a handful of almonds could keep extra kilos at bay, reveals a new research from the University of South Australia.", "url": "https://www.aninews.in/news/lifestyle/fitness/almonds-can-help-cut-calories-finds-study20221121213856", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221121160836.jpg", "publishedAt": "2022-11-21T16:08:00Z", "content": "Sydney [Australia], November 21 (ANI): While losing weight can be a thankless job, a new research by the University of South Australia suggests that a handful of almonds can help keep additional poun… [+2687 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Relationship Between the Periodontal Status of Pregnant Women and the Incidence and Severity of Pre-term and/or Low Birth Weight Deliveries: A Retrospective Observational Case-Control Study - Cureus", "description": "Background: Literature worldwide has linked periodontitis to preterm births and/or low-birth-weight infants. However, to our knowledge, research on this topic is scarce in India. The United Nations Children's Fund (UNICEF) reports that South Asian nations, pa…", "url": "https://www.cureus.com/articles/120953-relationship-between-the-periodontal-status-of-pregnant-women-and-the-incidence-and-severity-of-pre-term-andor-low-birth-weight-deliveries-a-retrospective-observational-case-control-study", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_3.png", "publishedAt": "2022-11-21T16:05:57Z", "content": "Background: Literature worldwide has linked periodontitis to preterm births and/or low-birth-weight infants. However, to our knowledge, research on this topic is scarce in India. The United Nations C… [+35750 chars]"}, {"source": {"id": null, "name": "Infectiousdiseaseadvisor.com"}, "author": "melissaalvarez", "title": "Study Results Support COVID-19 Vaccination in Pregnant Women With Rheumatic Disease - Infectious Disease Advisor", "description": "Researchers described the obstetric outcomes, based on COVID-19 vaccination status, in pregnant women with rheumatic and musculoskeletal diseases.", "url": "https://www.infectiousdiseaseadvisor.com/home/topics/covid19/study-results-support-covid-19-vaccination-in-pregnant-women-with-rmd/", "urlToImage": null, "publishedAt": "2022-11-21T16:04:00Z", "content": "Vaccination against COVID-19 is recommended in patients with rheumatic and musculoskeletal diseases (RMDs) who are pregnant or considering pregnancy, according to research results presented at the Am… [+2531 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Lead exposure tied to increased risk of CVD mortality: JAHA - Medical Dialogues", "description": "USA: Research published in the JAHA (Journal of the American Heart Association) has again underlined cardiovascular risks linked with environmental exposure to heavy metals (lead) and the lack of...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/lead-exposure-tied-to-increased-risk-of-cvd-mortality-jaha-102681", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191564-lead-exposure.jpg", "publishedAt": "2022-11-21T14:30:57Z", "content": "USA: Research published in the JAHA (Journal of the American Heart Association) has again underlined cardiovascular risks linked with environmental exposure to heavy metals (lead) and the lack of tre… [+2891 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Systemic Fluid removal improves ECMO outcomes and reduces acute kidney injury in children - Medical Dialogues", "description": "USA: There is a reduced incidence of Acute Kidney Injury (AKI) in pediatric patients associated with the application of a fluid management algorithm supported with extracorporeal membrane...", "url": "https://medicaldialogues.in/nephrology/news/systemic-fluid-removal-improves-ecmo-outcomes-and-reduces-acute-kidney-injury-in-children-102686", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191524-untitled-design-97.jpg", "publishedAt": "2022-11-21T14:30:37Z", "content": "USA: There is a reduced incidence of Acute Kidney Injury (AKI) in pediatric patients associated with the application of a fluid management algorithm supported with extracorporeal membrane oxygenation… [+3639 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Do herbal supplements of Ginkgo biloba impact course of tinnitus? - Medical Dialogues", "description": "Ginkgo biloba herbal extracts may be less effective than a placebo or may have no impact at all as a hearing aid, says an article published in Cochrane Database of Systematic Reviews.People who...", "url": "https://medicaldialogues.in/ent/news/do-herbal-supplements-of-ginkgo-biloba-impact-course-of-tinnitus-102679", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/20/150484-ginkgo-biloba.jpg", "publishedAt": "2022-11-21T14:30:35Z", "content": "Ginkgo biloba herbal extracts may be less effective than a placebo or may have no impact at all as a hearing aid, says an article published in Cochrane Database of Systematic Reviews.\r\nPeople who exp… [+2319 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Rare case of developing pleural, pericardial effusion and anasarca with low-dose oral minoxidil: A... - Medical Dialogues", "description": "South Africa: A recent case report published in JAAD Case Reports, reports the case of an African woman with frontal fibrosing alopecia (FFA) in whom pleural, pericardial effusion and anasarca...", "url": "https://medicaldialogues.in/dermatology/cases/rare-case-of-developing-pleural-pericardial-effusion-and-anasarca-with-low-dose-oral-minoxidil-a-report-102553", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/18/191388-swelling-in-lower-extremity.jpg", "publishedAt": "2022-11-21T14:30:08Z", "content": "South Africa: A recent case report published in JAAD Case Reports, reports the case of an African woman with frontal fibrosing alopecia (FFA) in whom pleural, pericardial effusion and anasarca develo… [+2768 chars]"}, {"source": {"id": null, "name": "Edtimes.in"}, "author": "Brand Voice", "title": "Dr. Prashanth Arun – Consultant Physician & Diabetologist sheds light on myths and facts about Diabetes - ED Times", "description": "Dr. Prashanth Arun is a young and dynamic consultant physician and Diabetologist at MV Hospital for diabetes in Chennai Tamil Nadu. He is widely known to create content on medical topics on various social media platforms. He is very friendly to his patients a…", "url": "https://edtimes.in/dr-prashanth-arun-consultant-physician-diabetologist-sheds-light-on-myths-and-facts-about-diabetes/", "urlToImage": "https://edtimes.in/wp-content/uploads/2022/11/EDTIMEs-2-640x427.jpeg", "publishedAt": "2022-11-21T12:29:27Z", "content": "Dr. Prashanth Arun is a young and dynamic consultant physician and Diabetologist at MV Hospital for diabetes in Chennai Tamil Nadu. He is widely known to create content on medical topics on various s… [+4950 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Fat Burning GNC Appetite Suppressants Of [#BE Informed] 2022 - Deccan Herald", "description": "The Centers for Disease Control and Prevention (CDC) report that adult obesity rates in all states are higher than 20%. Nearly 100 million adults are affected by the prevalence of this ever-growing epidemic, and obesity-related diseases like heart disease, ty…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-fat-burning-gnc-appetite-suppressants-of-be-informed-2022-1164411.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164411-1669031693.png", "publishedAt": "2022-11-21T11:54:53Z", "content": "The Centers for Disease Control and Prevention (CDC) report that adult obesity rates in all states are higher than 20%. Nearly 100 million adults are affected by the prevalence of this ever-growing e… [+17073 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Youtheory Fat Burner [#Exposed] A Detailed Overview - Deccan Herald", "description": "From childhood, we know that exercising and maintaining a balanced diet is essential for our well-being. However, the meaning of it changes when we grow up. We want to get the shape of our dreams to make our place in society.  Even though there's no ideal bod…", "url": "https://www.deccanherald.com/brandspot/pr-spot/youtheory-fat-burner-exposed-a-detailed-overview-1164389.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164389-1669027645.png", "publishedAt": "2022-11-21T10:46:31Z", "content": "From childhood, we know that exercising and maintaining a balanced diet is essential for our well-being. However, the meaning of it changes when we grow up. We want to get the shape of our dreams to … [+15993 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Sneha Santuka", "title": "Why Exercise Is Important, & How It Can Change Your Life? - Sportskeeda", "description": "If you think that exercise will help you live longer, you're right, but did you know that exercise can also help you live better?", "url": "https://www.sportskeeda.com/health-and-fitness/why-exercise-is-important-how-it-can-change-your-life", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/11/558eb-16689613702142-1920.jpg", "publishedAt": "2022-11-21T10:30:00Z", "content": "If you think that exercise will help you live longer, you're right, but did you know that exercise can also help you live better?\r\nWe have all heard it many times: \"You should exercise more, you will… [+4890 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Breakthrough rapid phobia treatment for children helps to reduce impact on NHS and improve quality of life - Medical Xpress", "description": "A new rapid phobia treatment for children and young people could help to reduce the impact on NHS and improve quality of life, a new study has found.", "url": "https://medicalxpress.com/news/2022-11-breakthrough-rapid-phobia-treatment-children.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/7-children.jpg", "publishedAt": "2022-11-21T09:06:53Z", "content": "A new rapid phobia treatment for children and young people could help to reduce the impact on NHS and improve quality of life, a new study has found.\r\nResearch led by the Universities of Sheffield an… [+4111 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "COVID can alter our genetic makeup & worsen diabetes - Ahmedabad Mirror", "description": "COVID can alter our genetic makeup & worsen diabetes", "url": "https://www.ahmedabadmirror.com/covid-can-alter-our-genetic-makeup--worsen-diabetes/81847700.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1669019169238.jpg-org", "publishedAt": "2022-11-21T08:43:01Z", "content": "It can also cause cognitive dysfunctions, push complications such as cardiomyopathy and muscle flaws\r\n#NEWYORKCOVID-19 can alter a person’s genetic makeup which can enhance the proliferation of disea… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Simple tips to take care of the nutritional needs of preterm babies - The Indian Express", "description": "Preterm birth is a nutritional emergency; these babies have high nutritional demand. But, despite medical advances in NICU care, it is quite challenging to achieve weight gain in these babies, said a doctor", "url": "https://indianexpress.com/article/lifestyle/health/nutritional-needs-preterm-babies-health-feeding-breast-milk-nicu-8275346/", "urlToImage": "https://images.indianexpress.com/2022/11/GettyImages-newborn-baby-1200.jpg", "publishedAt": "2022-11-21T07:50:16Z", "content": "Preterm babies, more than full-term babies, need a lot of care and attention. Doctors often advise mothers to breastfeed their babies for their complete nutrition up to 6 months of age, with bodies l… [+3520 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Sarah Murray", "title": "Tighter controls on antibiotics promise to curb drug-resistance - Financial Times", "description": "Medicines are often given for viral infections such as flu, for which they are useless, but can cause side effects", "url": "https://www.ft.com/content/523fde0d-79e2-4622-9c6d-4f5ff44432af", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F63c464ad-c6d7-4544-8f3c-e75dd1deddf7.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2022-11-21T04:01:08Z", "content": "Tackling antibiotic resistance calls for high-level political commitment and more investment in drug research. But, as health experts and hospital systems are finding, there is a simpler but equally … [+5481 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Research suggests dietary change starves cancer cell - Times of India", "description": "A new study from the University of Michigan Rogel Cancer Center has found that a dietary change could be a key to enhancing colon cancer treatment. Cancer cells need nutrients to survive and grow. One of the most important nutrient-sensing molecules in a cell…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/research-suggests-dietary-change-starves-cancer-cell/videoshow/95648804.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/95648804/size-42074/95648804.jpg", "publishedAt": "2022-11-21T02:54:04Z", "content": "A new study from the University of Michigan Rogel Cancer Center\r\n has found that a dietary change could be a key to enhancing colon cancer\r\n treatment. Cancer cells need nutrients to survive and grow… [+1936 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Honey improves key measures of health, including blood sugar and cholesterol levels - News-Medical.Net", "description": "Researchers look to better understand the impact of honey on mitigating certain cardiometabolic risk factors.", "url": "https://www.news-medical.net/news/20221120/Honey-improves-key-measures-of-health-including-blood-sugar-and-cholesterol-levels.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731616_1668995351482638.jpg", "publishedAt": "2022-11-21T02:02:00Z", "content": "In a recent Nutrition Reviewsjournal study, researchers from the University of Toronto performed a systematic review and meta-analysis of previous controlled trials to better understand the impact of… [+4821 chars]"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Electrically stimulating the brain helps stop binge eating - Freethink", "description": "Two people with binge eating disorder reported that deep brain stimulation helped them control their eating and lose weight in a small study.", "url": "https://www.freethink.com/health/binge-eating-disorder", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/11/binge-eating-disorder-thumb.jpg?resize=1200,630", "publishedAt": "2022-11-20T23:00:00Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Knowing signs of diabetes, prediabetes - ABC 7 Chicago", "description": "What is diabetes? It is important to be aware of prediabetic symptoms and the signs of Type 1 and Type 2 diabetes. https://abc7chicago.com/diabetes-symptoms-...", "url": "https://www.youtube.com/watch?v=sgni7sh2w0k", "urlToImage": "https://i.ytimg.com/vi/sgni7sh2w0k/maxresdefault.jpg", "publishedAt": "2022-11-20T15:19:23Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals mechanism by which malignant cells shut down anti-cancer immune responses - News-Medical.Net", "description": "A Ludwig Cancer Research study has revealed a single protein expressed at high levels by cancer cells across a broad range of malignancies that erects a multifaceted barrier to anti-cancer immune responses in mouse models of cancer and so shields tumors from …", "url": "https://www.news-medical.net/news/20221120/Study-reveals-mechanism-by-which-malignant-cells-shut-down-anti-cancer-immune-responses.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-11-20T15:18:00Z", "content": "A Ludwig Cancer Research study has revealed a single protein expressed at high levels by cancer cells across a broad range of malignancies that erects a multifaceted barrier to anti-cancer immune res… [+4612 chars]"}]}