{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Scientists inch closer to developing antiviral to fight mpox, Covid - Morung Express", "description": "London, May 1 (IANS) Scientists will soon be able to develop antivirals to manage mpox, formerly known as monkeypox as well as Covid.", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/05/74365504_1682942584_6a2d2afbf3f19882df89835fb59ecfc9.jpg", "publishedAt": "2023-05-01T12:03:21Z", "content": "London, May 1 (IANS) Scientists will soon be able to develop antivirals to manage mpox, formerly known as monkeypox as well as Covid.\r\nSince May 2022, mpox has spread into more than 100 countries and… [+2432 chars]"}, {"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "Geomagnetic pearl oscillations increase in the recovery phase of geomagnetic storms - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/geomagnetic-pearl-oscillations-increase-recovery-phase-geomagnetic-storms", "urlToImage": null, "publishedAt": "2023-05-01T11:50:56Z", "content": "Researchers have traced a very significant increase in special continuous oscillations with pearl-type structures called Geomagnetic Pc1 pearl oscillations on the surface of the Earth in the recovery… [+3471 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Dengue virus has evolved to become more severe, reveals study, urges for vaccine development | Mint - Mint", "description": "The researchers from IISc studied the changes in the four serotypes of the dengue virus and observed how they have changed from their ancestral sequence", "url": "https://www.livemint.com/science/health/dengue-virus-has-evolved-to-become-more-severe-reveals-study-urges-for-vaccine-development-11682935170774.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/05/01/600x338/AFP_9BV3D3_1627901674406_1682940762318.jpg", "publishedAt": "2023-05-01T11:44:06Z", "content": "India reports thousands of dengue cases every year and many people lose their life due to the virus. A new multi-dimensional study by the team of the Indian Institute of Science (IISc) has revealed s… [+2480 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Want To Eat Healthier? Keep These Smart Diet Tips In Mind - NDTV", "description": "In this article, we share some common and doable tips to help you make your diet a little healthier.", "url": "https://www.ndtv.com/health/want-to-eat-healthier-keep-these-smart-diet-tips-in-mind-3995146", "urlToImage": "https://c.ndtvimg.com/2023-03/9u56jnr8_healthy-food_625x300_30_March_23.jpg", "publishedAt": "2023-05-01T11:26:20Z", "content": "Following a healthy diet ensures your body gets the nutrients it needs\r\nA good diet has various advantages, such as strengthening bones, defending the heart, preventing disease, and improving mood. A… [+3226 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study: Slowing down in old age? It can be symptom of dementia - ThePrint", "description": "Washington [US], May 1 (ANI): It is widely acknowledged that as we age, we lose muscle power and slow down, making ordinary movements like getting up, walking, and sitting more difficult. However, new Edith Cowan University (ECU) research suggests that this c…", "url": "https://theprint.in/health/study-slowing-down-in-old-age-it-can-be-symptom-of-dementia/1549314/", "urlToImage": null, "publishedAt": "2023-05-01T11:17:52Z", "content": "Washington [US], May 1 (ANI): It is widely acknowledged that as we age, we lose muscle power and slow down, making ordinary movements like getting up, walking, and sitting more difficult.\r\nHowever, n… [+3994 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss Tips: Are There Any Downsides To Eating Chia Seeds? - NDTV", "description": "Chia seeds are a rich source of nutrients but it is essential to consume them in moderation and avoid facing its potential side effects. Read on to understand more.", "url": "https://www.ndtv.com/health/weight-loss-tips-are-there-any-downsides-to-eating-chia-seeds-3995067", "urlToImage": "https://c.ndtvimg.com/2022-11/1sed1is8_beauty-benefits-of-chia-seeds_625x300_18_November_22.jpg", "publishedAt": "2023-05-01T10:59:41Z", "content": "Chia seeds are abundant in nutrients but may cause health issues if not consumed correctly\r\nChia seeds are a popular superfood, known for their high nutritional value and health benefits. Chia seeds … [+3176 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Air pollution exposure linked with higher risk of irregular heartbeat: Study - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/air-pollution-exposure-linked-with-higher-risk-of-irregular-heartbeat-study/561620.html", "urlToImage": "", "publishedAt": "2023-05-01T10:43:58Z", "content": "New Delhi, May 1 (PTI) Long-term exposure to air pollution is associated with an increased risk of arrythmia or irregular heartbeat, according to a large study of 322 Chinese cities.\r\n The common arr… [+357 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Nivedita", "title": "Exercise tips: The right way to breathe when lifting weights in fitness routine - Moneycontrol", "description": "Exercise tips: Whether you are focused on hitting the perfect deadlift or bench pressing higher than you ever have, using your breath effectively is critical when it comes to an injury-free fitness routine.", "url": "https://www.moneycontrol.com/news/health-and-fitness/exercise-tips-the-right-way-to-breathe-when-lifting-weights-in-fitness-routine-10506061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/How-to-breathe-right-while-lifting-weights-in-gym-770x433.jpg", "publishedAt": "2023-05-01T10:34:44Z", "content": "Are you obsessed with the physiques of actors such as Hrithik Roshan, Tiger Shroff and others and push yourself to the brink to reach your fitness goals while exercisingin the gym? Remember, if you f… [+4014 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "4 reasons why slim people are at risk of fatty liver disease - Times of India", "description": "Fatty liver disease is not just restricted to people with obesity. Here's why slim people can also be at its risk.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/4-reasons-why-slim-people-are-at-risk-of-fatty-liver-disease/photostory/99908031.cms", "urlToImage": "https://static.toiimg.com/photo/99908394.cms", "publishedAt": "2023-05-01T10:30:00Z", "content": "The second cause could be a lack of large muscle mass. So if a person has bulky muscles, large muscles, especially on the trunk, what are called core muscles, then those people are usually protected … [+320 chars]"}, {"source": {"id": null, "name": "Clevelandclinic.org"}, "author": "kaputk", "title": "Can Hot Flashes Cause Nausea? - Health Essentials", "description": "It’s possible to feel nauseated in connection with a hot flash, but it’s not common. Here’s what to know about hot flashes and nausea, including when to connect with your healthcare provider for a deeper dive into what’s going on.", "url": "https://health.clevelandclinic.org/hot-flashes-and-nausea/", "urlToImage": "https://health.clevelandclinic.org/wp-content/uploads/sites/3/2023/04/hot-Flash-nausea-1414957551-770x533-1.jpg", "publishedAt": "2023-05-01T10:30:00Z", "content": "When youre on the road to menopause, hot flashes may be a common occurrence even multiple times per day. Theyre not pleasant, thats for sure. But can they actually make you feel sick?\r\nCleveland Clin… [+3817 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "World Asthma Day 2023: From exercise to season change, know 5 common asthma trigger for children - Health shots", "description": "Children with asthma may have recurring episodes of wheezing, coughing, and difficulty in breathing. They can be triggered by a variety of factors. So on World Asthma Day 2023, let's find the common triggers for asthma in children.", "url": "https://www.healthshots.com/preventive-care/family-care/world-asthma-day-2023-5-common-asthma-triggers-for-children/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/05/01154143/asthma-1.jpg", "publishedAt": "2023-05-01T10:15:30Z", "content": "Asthma affects not just adults, but also children. In fact, according to World Health Organization, it is the most common chronic disease among kids. Going by WHO statistics, it affected an estimated… [+3726 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Now, a 'hereditary cancer clinic' at Mumbai's Ambani hospital - Daijiworld.com", "description": "Mumbai, May 1 (IANS): The Kokilaben Dhirubhai Ambani Hospital (KDAH) has launched a pioneering 'Hereditary Cancer Clinic' to provide personalised cancer care to patients with the latest precision oncology care, an official said here on Monday.\r\nThis will enab…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1075470", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/sharmila_010523_Mumbai.jpg", "publishedAt": "2023-05-01T10:00:23Z", "content": "Mumbai, May 1 (IANS): The Kokilaben Dhirubhai Ambani Hospital (KDAH) has launched a pioneering 'Hereditary Cancer Clinic' to provide personalised cancer care to patients with the latest precision onc… [+1786 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Riya Ashok Madayi", "title": "Tips and Tricks to Manage Acid Reflux During Pregnancy - News18", "description": "Pregnancy typically comes with both small and large problems. You can make a variety of lifestyle changes to reduce the frequency and severity of acid reflux episodes. Follow these tips:", "url": "https://www.news18.com/lifestyle/health-and-fitness-tips-and-tricks-to-manage-acid-reflux-during-pregnancy-7690027.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/image-2-168293452216x9.jpg", "publishedAt": "2023-05-01T09:49:50Z", "content": "Let me start with a story. There was a wonderful young woman, who got pregnant and through the nine months of the pregnancy, she had no issues at all. Did not have any sleepless nights, no digestion … [+2331 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "Cambodia reported 1,400 HIV cases last yr: Report - Punjab News Express", "description": "<p><strong>PHNOM PENH</strong>: Cambodia reported 1,400 new HIV cases last year, according to a National AIDS Authority's report on Monday.</p>", "url": "https://www.punjabnewsexpress.com/news/news/cambodia-reported-1400-hiv-cases-last-yr-report-207531", "urlToImage": "https://www.punjabnewsexpress.com/images/article/article207531.jpg", "publishedAt": "2023-05-01T09:48:46Z", "content": "PHNOM PENH: Cambodia reported 1, 400 new HIV cases last year, according to a National AIDS Authority's report on Monday.\r\n\"About four people become infected with HIV every day, \" the report said.\r\nIt… [+858 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Researchers discover the relation between heart damage and cancer drugs - mid-day.com", "description": "Professor Sir Nilesh Samani, Medical Director at the British Heart Foundation, said: “While there have been advances in treating cancer, one of the consequences has been a risk of heart damage from these drugs\"", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/researchers-discover-the-relation-between-heart-damage-and-cancer-drugs-23283897", "urlToImage": "https://images.mid-day.com/images/images/2023/may/cardic-arrest-istock_d.jpg", "publishedAt": "2023-05-01T09:44:00Z", "content": "Professor Sir Nilesh Samani, Medical Director at the British Heart Foundation, said: While there have been advances in treating cancer, one of the consequences has been a risk of heart damage from th… [+3666 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "One in 10 patients with autoimmune rheumatic disease flared after COVID-19 vaccination - Healio", "description": "Nearly 10% of patients with autoimmune rheumatic disease experience flares following COVID-19 vaccination, according to data published in Rheumatology.", "url": "https://www.healio.com/news/rheumatology/20230428/one-in-10-patients-with-autoimmune-rheumatic-disease-flared-after-covid19-vaccination", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/infectious-disease/c/covidvaccine.jpeg", "publishedAt": "2023-05-01T09:35:31Z", "content": "Key takeaways:\r\n<ul><li>Patients with comorbidities and mental health disorders were more likely to experience flare after vaccination.</li><li>As many as one in three patients are at risk for flares… [+3983 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Healthshots", "title": "5 reasons to use fenugreek or methi seeds for hair - Health shots", "description": "Protecting our tresses is a tough business nowadays, right? Not really, if you're using fenugreek seeds for your hair. Here are 5 benefits of using it.", "url": "https://www.healthshots.com/web-stories/methi-seeds-for-hair-here-are-5-benefits-of-it/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/05/01143621/HAIR-2.jpg", "publishedAt": "2023-05-01T09:30:39Z", "content": "Protecting our hair is a tough business nowadays, right? If using home remedies is something you trust, don't miss out on fenugreek seeds for your hair. Here are 5 benefits of using it.\r\nImage Credit… [+1129 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Riya Ashok Madayi", "title": "Gastroparesis: Causes, Symptoms, Dietary and Lifestyle Tips - News18", "description": "Gastroenterologist and hepatologist Dr. Rakesh Sringeri offers a few ways to care for gastroparesis at the Gastroenterology Department of the Kauvery Hospital in Electronic City, Bengaluru", "url": "https://www.news18.com/lifestyle/health-and-fitness-gastroparesis-causes-symptoms-dietary-and-lifestyle-tips-7689787.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/image-1-168293251916x9.jpg", "publishedAt": "2023-05-01T09:16:04Z", "content": "Gastroparesis is a condition or a syndrome when the stomach emptying time is prolonged without any structural obstruction. Symptoms consist of nausea, vomiting, heartburn, bloating, abdominal pain an… [+2542 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Suramya Sunilraj", "title": "IIT Madras Researchers Develop Machine Learning Tool To Detect Brain And Spinal Cord Tumours - News18", "description": "GBMDriver, a freely accessible web server, was developed to identify mutations in Glioblastoma, a tumour in the brain and spinal cord, and other types of Cancer", "url": "https://www.news18.com/education-career/iit-madras-researchers-develop-machine-learning-tool-to-detect-brain-and-spinal-cord-tumours-7689799.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/05/iit-madras--168293198216x9.jpeg", "publishedAt": "2023-05-01T09:08:56Z", "content": "Researchers at the Indian Institute of Technology Madras recently developed the GBMDriver (GlioBlastoma Mutiforme Drivers), a machine learning-based computational tool for enhanced identification of … [+2224 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "9 keto snacks to help combat sugar cravings - Recipes", "description": "Are you on a keto diet and craving sugar? If yes, tap next to learn about 9 easy and healthy keto snacks that can help combat sugar cravings.", "url": "https://recipes.timesofindia.com/web-stories/9-keto-snacks-to-help-combat-sugar-cravings/photostory/99906267.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-99906300,imgsize-100374,width-900,height-1200,resizemode-6/99906300.jpg", "publishedAt": "2023-05-01T08:45:33Z", "content": "Keto nuts include hazelnuts, macadamias, pecans, walnuts, and Brazil nuts. They are rich in natural sugar, and healthy fat, protein, and fibre."}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "Daily Pioneer", "title": "HPV vax to be introduced in universal immunisation programme soon: Ministry - Daily Pioneer", "description": "From next month, the indigenously developed cervical cancer human papillomavirus (HPV) vaccine is likely to be introduced in the Universal Immunisation Programme (UIP) as a two-dose regimen for adolescent girls aged 9-14 years.\n\nSources in the Union Health Mi…", "url": "https://www.dailypioneer.com/2023/india/hpv-vax-to-be-introduced-in-universal-immunisation-programme-soon--ministry.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2023-05-01T08:34:30Z", "content": "From next month, the indigenously developed cervical cancer human papillomavirus (HPV) vaccine is likely to be introduced in the Universal Immunisation Programme (UIP) as a two-dose regimen for adole… [+1912 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID cases linked to Arcturus on rise; THESE are the two symptoms everyone needs to be careful about - Times of India", "description": "​The sub variant of the recombinant variant of the Omicron is currently one of the 600 sub variants of the Omicron which is in circulation since early 2022. ​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-cases-linked-to-arcturus-on-rise-these-are-the-two-symptoms-everyone-needs-to-be-careful-about/photostory/99905396.cms", "urlToImage": "https://static.toiimg.com/photo/99905405.cms", "publishedAt": "2023-05-01T08:30:00Z", "content": "Adults, the majority of whom have been vaccinated against COVID at least once, are showing the classic signs of COVID which were seen in the last waves of infection.\r\nBody ache, fever, extreme muscle… [+554 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Shireen Jamooji", "title": "Why Do We Have Food Cravings? 5 Common Cravings Explained - Slurrp", "description": "Food cravings are those sudden urges that make us drool over specific foods and drinks, even when we're not hungry. Some people crave sweets, others crave salty snacks, and some even crave spicy foods. So, what's behind these irresistible urges?", "url": "https://www.slurrp.com/article/why-do-we-have-food-cravings-5-most-common-cravings-explained-1682929283046", "urlToImage": "https://images.slurrp.com/prodarticles/dugd3zjvye6.webp", "publishedAt": "2023-05-01T08:25:21Z", "content": "Why Do We Have Food Cravings\r\nAnother factor is our emotions. Stress, boredom, and anxiety can all trigger food cravings, as our brains seek out comfort and pleasure. In fact, many people turn to foo… [+2100 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Rhea Varghese", "title": "Do You Feel Tired All The Time? Nutritionist Points Out These 5 Reasons For Extreme Fatigue |Healthbeat - Times Now", "description": "Do you feel tired throughout the day even though you had an adequate amount of sleep? Nutritionist Lovneet Batra shares 5 reasons for extreme fatigue.", "url": "https://www.timesnownews.com/lifestyle/do-you-feel-tired-all-the-time-nutritionist-points-out-these-5-reasons-for-extreme-fatigue-healthbeat-article-99904779", "urlToImage": "https://static.tnn.in/thumb/msid-99904779,updatedat-1682929368494,width-1280,height-720,resizemode-75/99904779.jpg", "publishedAt": "2023-05-01T08:22:48Z", "content": "Realme 5th Anniversary Sale brings massive discounts on smartphones, laptops, AIOT products, and more: Details"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "7 Reasons Why 'Cheat Days' Might Be More Harmful Than Healthy - Slurrp", "description": "7 Reasons Why 'Cheat Days' Might Be More Harmful Than Healthy7 Reasons Why 'Cheat Days' Might Be More Harmful Than Healthy7 Reasons Why 'Cheat", "url": "https://www.slurrp.com/web-stories/7-reasons-why-cheat-days-might-be-more-harmful-than-healthy/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/05/01133953/cropped-shutterstock_1611815026.jpg", "publishedAt": "2023-05-01T08:15:20Z", "content": "When you're on a diet, it's tempting to have the occasional indulgence. But sometimes the idea of a cheat day could be doing more harm than good.Here are some reasons why a sustainable and healthy di… [+49 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "High Fitness Levels May Reduce Death Risk From Cardiovascular Disease In Men: Study - Zee News", "description": "Air Pollution Associated With Increased Risk Of Irregular Heartbeat: Study Blood pressure was classified as normal or high, and fitness was classified as low, medium, or high. The average age at baseline was 53 years. Participants were followed up until 2018.…", "url": "https://zeenews.india.com/health/high-fitness-levels-may-reduce-death-risk-from-cardiovascular-disease-in-men-study-2601338", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/01/1192744-men-exercise.jpg", "publishedAt": "2023-05-01T08:11:29Z", "content": "Being healthy may reduce the chance of dying from cardiovascular disease in men with high blood pressure. This finding is the result of a 29-year investigation. The study's findings were published to… [+3444 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "Mesua Ferrea: Precautions, Side Effects And Benefits Of Nagkesar - TheHealthSite", "description": "Today we will define Mesua ferrea and discuss its benefits applications and adverse effects. TheHealthSite.com", "url": "https://www.thehealthsite.com/ayurveda/herbs/mesua-ferrea-precautions-side-effects-and-benefits-of-nagkesar-974130/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2020/08/Nagkeshar-Front.jpg", "publishedAt": "2023-05-01T08:01:00Z", "content": "Today, we will define Mesua ferrea and discuss its benefits, applications, and adverse effects.\r\nAyurveda has shown us the path to a healthy existence for thousands of years. Similarly, there are man… [+3122 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Reducing COVID-19 burden: could Bacille Calmette-Guérin (BCG) vaccines confer protection? - News-Medical.Net", "description": "Researchers investigated whether BCG vaccines could lower COVID-19 burden.", "url": "https://www.news-medical.net/news/20230501/Reducing-COVID-19-burden-could-Bacille-Calmette-Guerin-(BCG)-vaccines-confer-protection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_746773_16829263820658573.jpg", "publishedAt": "2023-05-01T07:36:00Z", "content": "In a recent study in The New England Journal of Medicine, researchers performed a randomized controlled trial (RCT) to investigate whether Bacille Calmette-Guérin (BCG) vaccines could lower coronavir… [+6743 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers find impact of environment on neurocognitive outcomes - ETHealthWorld", "description": "Those who lived in economically depressed areas had poorer baseline and long-term cognitive outcomes. The findings suggest that policies and resources that provide support at the neighbourhood level may help protect high-risk paediatric brain tumour patients …", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-find-impact-of-environment-on-neurocognitive-outcomes/99904135", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99904135,imgsize-51836,width-1200,height=765,overlay-ethealth/industry/researchers-find-impact-of-environment-on-neurocognitive-outcomes.jpg", "publishedAt": "2023-05-01T07:14:20Z", "content": "New York : Scientists at St. Jude Children's ResearchHospital researched the effect of their environment to acquire a better grasp of the disparities between juvenile cancer patients when it comes to… [+5832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Uddipta Banerjee", "title": "Can you overcome sugar addiction in a month? - The Indian Express", "description": "Can you overcome sugar addiction in a month?", "url": "https://indianexpress.com/web-stories/wellness/can-you-overcome-sugar-addiction-in-a-month/", "urlToImage": "https://images.indianexpress.com/2023/04/Untitled-design-2023-04-27T143801.605.jpg", "publishedAt": "2023-05-01T07:00:33Z", "content": "Sugar, in all its forms, continues to be a hot topic for debate, especially regarding ones health and overall well-being.\r\nDr Sudhir Kumar, a Hyderabad-based neurologist, recently tweeted that all it… [+869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saumya Rastogi", "title": "‘Every joint, muscle, nerve started aching’: People share their struggles living with fibromyalgia - The Indian Express", "description": "Fibromyalga is a contested diagnosis and many health professionals believe it does not exist as a true disease, and that it is in the patient's minds, making it psychological or psycho-somatic in nature, said Saumya Pahwa, a consultant clinical psychologist", "url": "https://indianexpress.com/article/lifestyle/health/fibromyalgia-causes-symptoms-diagnosis-treatment-8559731/", "urlToImage": "https://images.indianexpress.com/2023/04/fibromyalgia-2.jpg", "publishedAt": "2023-05-01T07:00:15Z", "content": "In 2018, Hina Arora, a software engineer, experienced widespread pain in her neck and shoulders, which gradually spread throughout her body. The excruciating pain affected her daily activities, and w… [+5648 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Managing Genital Herpes with Acyclovir- An Indian Experience - Medical Dialogues", "description": "Genital herpes, caused  by Herpes Simplex Virus (HSV) infection, is one of the most common sexually  transmitted diseases (STDs) in the world, affecting around 400 million people.  There are two...", "url": "https://medicaldialogues.in/dermatology/perspective/managing-genital-herpes-with-acyclovir-an-indian-experience-110778", "urlToImage": "https://medicaldialogues.in/h-upload/2023/05/01/208613-whatsapp-image-2023-05-01-at-124750-pm.jpg", "publishedAt": "2023-05-01T06:42:22Z", "content": "Genital herpes, caused by Herpes Simplex Virus (HSV) infection, is one of the most common sexually transmitted diseases (STDs) in the world, affecting around 400 million people. There are two kinds o… [+10101 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers develop screening technique for Type 1 diabetes treatment - ETHealthWorld", "description": "According to the study in Nature Biomedical Engineering, using one of the alginate formulations to encapsulate human insulin-secreting islet cells provided long-term blood sugar level control in diabetic mice. Catheters coated with two other high-performing m…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/researchers-develop-screening-technique-for-type-1-diabetes-treatment/99902669", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99902669,imgsize-8260,width-1200,height=765,overlay-ethealth/diagnostics/researchers-develop-screening-technique-for-type-1-diabetes-treatment.jpg", "publishedAt": "2023-05-01T06:40:00Z", "content": "Houston: Getting a host immune system to accept the presence of implanted insulin-secreting cells could change the lives of the more than 700 million people who have Type 1 diabetes worldwide.Omid Ve… [+6458 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Purvi Kalra", "title": "Prolonged diaper usage has harmful side effects on your infant, here’s why - Health shots", "description": "Your toddler’s health is in your hand, and diapers are an integral part of their lives. You must change their nappies frequently to avoid the side effects of dirty diapers for babies.", "url": "https://www.healthshots.com/preventive-care/family-care/save-your-child-from-these-side-effects-of-dirty-diapers-for-babies/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/05/01110953/diapers.jpg", "publishedAt": "2023-05-01T06:30:03Z", "content": "There is no denying the fact that diapers have made the lives of parents extremely convenient. Many parents find it convenient to use absorbent diapers instead of cotton nappies. Since the urine gets… [+3444 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "10 Superfoods To Lower Bad Cholesterol Levels - TheHealthSite", "description": "Are you suffering from high cholesterol levels? Worry not, we have listed 10 superfoods that you must add to your diet to keep bad LDL under control.", "url": "https://www.thehealthsite.com/webstories/fitness/10-superfoods-to-lower-bad-cholesterol-levels-974098/", "urlToImage": "https://www.thehealthsite.com/wp-content/uploads/2023/05/Cholesterol.jpg", "publishedAt": "2023-05-01T06:00:51Z", "content": "A great source of vitamins, whole grains such as oats, and other grains can reduce LDL and reduce the risk of heart diseases.\r\nSource: Thehealthsite"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Students use AI technology to find new brain tumor therapy targets — with a goal of fighting disease faster - Fox News", "description": "Two high-school students partnered with Insilico Medicine, a Hong Kong-based medical tech company, to identify new target genes linked to glioblastoma and aging. Fox News Digital spoke to them.", "url": "https://www.foxnews.com/health/students-use-ai-technology-find-brain-tumor-therapy-targets-goal-fighting-disease-faster", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/Andrea-and-Zach-1.jpeg", "publishedAt": "2023-05-01T06:00:00Z", "content": "Glioblastoma is one of the deadliest types of brain cancer\r\n, with the average patient living only eight months after diagnosis, according to the National Brain Tumor Society, a nonprofit. \r\nTwo ambi… [+7520 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Agnihotri", "title": "How hyaluronic acid can improve skin texture and tone? Expert shares insights - Hindustan Times", "description": "Check out how hyaluronic acid, a powerful skincare ingredient, can improve skin texture and tone, leaving you with a more youthful, radiant complexion. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-hyaluronic-acid-can-improve-skin-texture-and-tone-expert-shares-insights-101682918917914.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/01/1600x900/cosmetics_1682919488870_1682919512337.jpg", "publishedAt": "2023-05-01T05:43:43Z", "content": "Dealing with acne conditions, sunspots, scarring, wrinkles, and discolouration on your skin can be incredibly frustrating. When skin issues feel out of our control, it can be difficult to pinpoint ex… [+2911 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "10 life threatening diseases regular eye tests can detect - Times of India", "description": "​Very often doctors recommend us to get the eyes checked at regular intervals. However, we don't go for an eye check up until we have issues with the vision. Our understanding about the eyes is only limited to its focal power and vision. ​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/10-life-threatening-diseases-regular-eye-tests-can-detect/photostory/99867785.cms", "urlToImage": "https://static.toiimg.com/photo/99867955.cms", "publishedAt": "2023-05-01T05:30:00Z", "content": "Sounds strange, right?\r\nUnexplained bleeding in the eye can be a sign of high blood pressure. This is called subconjunctival hemorrhage, in which a small blood vessel closer to the surface of the eye… [+314 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Does oral sex lead to throat cancer? Doctors makes shocking claim, know reason behind ‘epidemic’ - DNA India", "description": "According to a recent study based in UK and US, oral sex has emerged as the leading cause behind a certain type of throat cancer, which affects the tonsils and back of the throat.", "url": "https://www.dnaindia.com/health/report-does-oral-sex-lead-to-throat-cancer-doctors-makes-shocking-claim-reason-behind-epidemic-hpv-oropharyngeal-3039632", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/05/01/2587641-throat-cncer.png", "publishedAt": "2023-05-01T05:21:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: May 01, 2023, 10:56 AM ISTIn a shocking study based in the United States and the United Kingdom, oral sex has emerged as the lead… [+1873 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "Congested Nose Home Remedies: 10 Ways To Get Instant Relief from Stuffy Nose - TheHealthSite", "description": "Try these 10 easy home remedies to deal with a congested and stuffy nose. TheHealthSite.com", "url": "https://www.thehealthsite.com/home-remedies/congested-nose-home-remedies-10-ways-to-get-instant-relief-from-stuffy-nose-974083/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/Stuffy-Nose.jpg", "publishedAt": "2023-05-01T03:55:00Z", "content": "Congested Nose Remedies: 10 Ways To Get Instant Relief from Stuffy Nose\r\nTry these 10 easy home remedies to deal with a congested and stuffy nose.\r\nAre you suffering from nasal congestion? Worry not,… [+4536 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Fresh or dried: The best form to have figs, especially for diabetics, is… - The Indian Express", "description": "The presence of antioxidants and nourishing vitamins like vitamin A and vitamin C makes figs an excellent addition to your healthy diet, said Garima Goyal, a registered diatitian", "url": "https://indianexpress.com/article/lifestyle/health/fresh-dried-figs-anjeer-health-benefits-better-8583675/", "urlToImage": "https://images.indianexpress.com/2023/04/fresh-dried-figs_200_getty.jpg", "publishedAt": "2023-05-01T02:50:31Z", "content": "From being a tasty treat to a healthy midday snack, fig — which comes packed with numerous benefits — ticks all the checkboxes, making it a great addition to one’s diet. But have you ever wondered wh… [+2896 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Sangati Jogwar", "title": "Lower cancer risk with these lifestyle tips - OTV News", "description": "Cancer is one of the deadliest diseases and its risk can be lowered by adopting a few lifestyle changes.", "url": "https://odishatv.in/news/health/lower-cancer-risk-with-these-lifestyle-tips-202998", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/Cancer_1682780347.webp", "publishedAt": "2023-05-01T01:38:44Z", "content": "Cancer continues to be one of the deadliest diseases humankind is struggling with. Early diagnosis does save a life. But even then there is always a chance that the cancer may bounce back.\r\nApart fro… [+1974 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "Statesman News Service", "title": "South of city more prone to dengue than north: Study - The Statesman", "description": "The civic authorities have filed cases against 26 house owners who refused to comply in the municipal magistrate’s court. The court can slap a fine of anything between Rs 1,000 and Rs 1 lakh.", "url": "https://www.thestatesman.com/bengal/south-of-city-more-prone-to-dengue-than-north-study-1503177025.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/11/dengue.jpg", "publishedAt": "2023-05-01T00:51:00Z", "content": "A study conducted by the Kolkata Municipal Corporation revealed that 80 per cent of the dengue cases in the city take place in south Kolkata while 20 per cent take place in north Kolkata. \r\nThis is b… [+2078 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Swati Chaturvedi", "title": "Know The Importance Of Flossing And Different Methods Of Flossing - News18", "description": "The importance of flossing should not be underestimated, as it can prevent tooth decay, gum disease, and bad breath", "url": "https://www.news18.com/lifestyle/know-the-importance-of-flossing-and-different-methods-of-flossing-7684693.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/shutterstock_2290828793-168287656616x9.jpg", "publishedAt": "2023-04-30T23:34:22Z", "content": "Flossing is an essential part of maintaining good oral hygiene. It is a simple yet effective way to remove plaque and debris from between your teeth, where your toothbrush cant reach. The importance … [+2130 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "Avoid the Consumption of Antibiotics without Doctor Consultation - Rising Kashmir", "description": null, "url": "http://risingkashmir.com/avoid-the-consumption-of-antibiotics-without-doctor-consultation", "urlToImage": "http://admin.risingkashmir.com/Source/News/56d3b020-86c5-43e9-87a7-124ab9da38bb.png", "publishedAt": "2023-04-30T21:09:06Z", "content": "Dr. SHEKHAR BISWAS\r\nThe use of antibiotics in India and globally has increased immensely in the recent times. With the prolonged use of antibiotics, many people have become anti-antibiotic that even … [+4331 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Dogs brain-wave readings during sleep linked with indicators of cognitive deterioration - ThePrint", "description": "Washington [US], May 1 (ANI): Dogs with dementia experience the same sleep interruptions as people with dementia. North Carolina State University researchers used electroencephalography, or EEGs, on senior dogs to see if brain-wave readings during sleep linke…", "url": "https://theprint.in/science/dogs-brain-wave-readings-during-sleep-linked-with-indicators-of-cognitive-deterioration/1548255/", "urlToImage": null, "publishedAt": "2023-04-30T19:13:17Z", "content": "Washington [US], May 1 (ANI): Dogs with dementia experience the same sleep interruptions as people with dementia. North Carolina State University researchers used electroencephalography, or EEGs, on … [+2930 chars]"}, {"source": {"id": null, "name": "Brighterkashmir.com"}, "author": null, "title": "Polycystic Ovarian Syndrome - Requires Control Rather than Cure - Brighter Kashmir", "description": "Polycystic Ovarian Syndrome - Requires Control Rather than Cure", "url": "http://brighterkashmir.com/polycystic-ovarian-syndrome---requires-control-rather-than-cure--", "urlToImage": "http://secure.brighterkashmir.com//images/news/c58f6c96-dea1-4064-a22d-d1e9a57106d1.jpg", "publishedAt": "2023-04-30T18:57:45Z", "content": "Today we are living in a period of modernization. The effect of modernization and technological advancement reflects in everyday life. Our lifestyle also has changed a lot. Food intake is becoming mo… [+6802 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Zoya Zaidi", "title": "Plant-based proteins to include in the diet - NewsBytes", "description": "Proteins are vital for muscles and tissues. It's difficult to attain from plant-based diets unlike meat products; hence, protein content is essential for those following a vegetarian diet.", "url": "https://www.newsbytesapp.com/visualstories/lifestyle/plant-based-proteins-to-include-in-the-diet", "urlToImage": "https://i.cdn.newsbytesapp.com/web/story168268418097365.jpg?tr=w-360", "publishedAt": "2023-04-30T17:50:42Z", "content": "Plant based proteinsto include in diet"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruchika M", "title": "Ganglion Cysts: Causes, Symptoms, and Treatment Options - Sportskeeda", "description": "Ganglion cysts are a common condition that affects many people. These are small, fluid-filled lumps that form under the skin, typically on the hands or wrists.", "url": "https://www.sportskeeda.com/health-and-fitness/ganglion-cysts-causes-symptoms-treatment-options", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/04/3c085-16828730166718-1920.jpg", "publishedAt": "2023-04-30T17:18:00Z", "content": "Ganglion cysts are a common condition that affects many people. These are small, fluid-filled lumps that form under the skin, typically on the hands or wrists.\r\nIn this article, we will discuss the c… [+2765 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Janvi Kapur", "title": "Neurodevelopmental disorders: Brief guide to a complex world - Sportskeeda", "description": "The term neurodevelopmental disorders refers to a group of conditions that affect neurological development and the way the brain works, impairing social, cognitive and emotional functioning.", "url": "https://www.sportskeeda.com/health-and-fitness/neurodevelopmental-disorders-brief-guide-complex-world", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/04/9f8b9-16828702206693-1920.jpg", "publishedAt": "2023-04-30T16:58:00Z", "content": "The term neurodevelopmental disorders refers to a group of conditions that affect neurological development and the way the brain works, impairing social, cognitive and emotional functioning. Attentio… [+5946 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Social media may cause eating disorders in female athletes, says research - ANI News", "description": "Experts feel that social media may cause eating disorders in female athletes who believe they must acquire the \"ideal\" figure.", "url": "https://www.aninews.in/news/health/social-media-may-cause-eating-disorders-in-female-athletes-says-research20230430211956", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230430154931.jpg", "publishedAt": "2023-04-30T15:57:33Z", "content": "Washington [US], April 30 (ANI): Experts feel that social media may cause eating disorders in female athletes who believe they must acquire the \"ideal\" figure.Dr. Kathryn Vidlock and Catherine Ligget… [+3979 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Ahana Chaudhury", "title": "Here are 10 lifestyle changes to manage mania and depression symptoms - Asianet Newsable ", "description": "Bipolar illness symptoms of mania and sadness can be controlled by making the necessary lifestyle adjustments.", "url": "https://newsable.asianetnews.com/entertainment/here-are-10-lifestyle-changes-to-manage-mania-and-depression-symptoms-adc-rtxpat", "urlToImage": "https://static-ai.asianetnews.com/images/01gz9bz9kn1qgf44xf4bej8yyb/gettyimages-1328336363_1200x630xt.jpg", "publishedAt": "2023-04-30T15:20:53Z", "content": "Bipolar illness symptoms of mania and sadness can be controlled by making the necessary lifestyle adjustments.Living with bipolar disorder can be tricky since a person with it has sharp mood swings. … [+2345 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Pallavi Mehra", "title": "Eye Health: 7 Tips To Manage Strain From Excessive Screen Time - Zee News", "description": "7 Eye Care Tips To Manage Eye Strain From Excessive Screen Time Take Frequent Breaks Taking regular breaks from staring at a computer screen can help to reduce eye strain. The 20-20-20 rule is a helpful technique to follow - every 20 minutes, take a 20-second…", "url": "https://zeenews.india.com/health/eye-health-7-eye-care-tips-to-manage-eye-strain-from-excessive-screen-time-2601092", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/04/30/1192479-eye-strain.jpg", "publishedAt": "2023-04-30T12:47:12Z", "content": "A lifestyle with no work-life balance and long working hours can not only give us a mental breakdown but can also affect our health badly. With never-ending working hours, one is at least spending 9-… [+2594 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "World Immunization Week: Vaccines for children & impact of Covid-19 pandemic on vaccination program - Citizen TV Kenya", "description": "World Immunization Week: Accelerating rapid progress in Kenya to get back on track to ensure more people, particularly children, are protected from preventab...", "url": "https://www.youtube.com/watch?v=infpCtMw6SA", "urlToImage": "https://i.ytimg.com/vi/infpCtMw6SA/maxresdefault.jpg", "publishedAt": "2023-04-30T11:47:48Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals genetic tests shows how genes linked to heart disease - ETHealthWorld", "description": "Variants associated with cardiovascular disease risk are often found \"incidentally\" when people undergo genetic testing for non-cardiac reasons, including screening or diagnosis of other diseases. These unexpected genetic variants may also be discovered with …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-reveals-genetic-tests-shows-how-genes-linked-to-heart-disease/99887308", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99887308,imgsize-206712,width-1200,height=765,overlay-ethealth/diagnostics/study-reveals-genetic-tests-shows-how-genes-linked-to-heart-disease.jpg", "publishedAt": "2023-04-30T10:47:14Z", "content": "Illinois: People may learn they have a gene mutation linked to some types of cardiovascular disease (CVD) as the usage of genetic testing rises. In order to better inform people and medical professio… [+3546 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Garg", "title": "Weight Loss Diet: 10 Indian Foods to Shed Those Extra Kilos - India.com", "description": "<b>Weight Loss Diet: You may maintain your health and speed up fat loss by eating these Indian meals for weight loss.</b>", "url": "https://www.india.com/webstories/lifestyle/weight-loss-diet-10-indian-foods-to-shed-those-extra-kilos-6023655/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/04/Coconut-oil.jpeg", "publishedAt": "2023-04-30T10:46:23Z", "content": "You can prevent several common ailments in addition to helping yourself lose weight by incorporating turmeric into your diet regularly.\r\nImly increases the release of serotonin hormone in the brain, … [+881 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "We asked ChatGPT to predict the diabetes burden on India by 2050… - Times of India", "description": "​India is the diabetes capital of the world with 77 million of its population dealing with this disease. This population size is expected to grow up to 123 million by 2040 a Lancet study has predicted.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/we-asked-chatgpt-to-predict-the-diabetes-burden-on-india-by-2050/photostory/99866328.cms", "urlToImage": "https://static.toiimg.com/photo/99866434.cms", "publishedAt": "2023-04-30T10:30:00Z", "content": "The AI generated content, however does not speak about an alarming and a serious concern which is lurking somewhere in vicinity but is still not visible to many. Yes, we are talking about prediabetes… [+789 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "IANS", "title": "Patients face long-term financial impact after Covid-19: Study - Telangana Today", "description": "The study analysed data from over 1,32,000 individuals, providing only a limited snapshot of their financial health six months before or after experiencing a Covid illness.", "url": "https://telanganatoday.com/patients-face-long-term-financial-impact-after-covid-19-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/04/Covid-4.jpg", "publishedAt": "2023-04-30T09:35:50Z", "content": null}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Mirchi", "title": "Ovulation Bleeding: What is that every women has to know - Mirchi Plus", "description": "Ovulation Bleeding: What Is That Every Women Has To Know by Dr Surabhi Siddhartha, Consultant Obstetrician & Gynaecologist, Motherhood Hospital, Kharghar", "url": "https://mirchi.in/stories/lifestyle/ovulation-bleeding-what-is-that-every-women-has-to-know/99884838", "urlToImage": "https://static.mirchi.in/thumb/imgsize-13046,msid-99884838,width-800,height-450,resizemode-1/99884838.jpg", "publishedAt": "2023-04-30T08:05:16Z", "content": "Ovulation\r\nbleeding\r\n means vaginal bleeding during or immediately before or after ovulation, which happens during the middle of a menstrual cycle. Are you aware? A shift in estrogen levels can lead … [+2469 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Study finds one-hour endoscopic procedure may eliminate need for insulin in type 2 diabetics - News9 LIVE", "description": "An hour-long endoscopic treatment that modifies the lining of the first portion of the small intestine using regulated electrical pulses may allow patients with Type 2 diabetes to quit using insulin while still maintaining glycemic control", "url": "https://www.news9live.com/health/health-conditions/study-finds-one-hour-endoscopic-procedure-may-eliminate-need-for-insulin-in-type-2-diabetics-au2180-2122256", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/02/Diabetes.jpg", "publishedAt": "2023-04-30T06:23:16Z", "content": "An hour-long endoscopic treatment that modifies the lining of the first portion of the small intestine using regulated electrical pulses may allow patients with Type 2 diabetes to quit using insulin … [+2017 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Vitamin B12: Deficiency of 2-3 micrograms of this vitamin can damage major organs of the body; know more - Times of India", "description": "​One of the essential nutrients, vitamin B12 is required by the body to perform several important functions ranging from formation of red blood cells to DNA synthesis.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vitamin-b12-deficiency-of-2-3-micrograms-of-this-vitamin-can-damage-major-organs-of-the-body-know-more/photostory/99866189.cms", "urlToImage": "https://static.toiimg.com/photo/99866221.cms", "publishedAt": "2023-04-30T05:30:00Z", "content": "People who consume vegetarian foods are more likely to be deficient in vitamin B12 as this vitamin is mostly found in meat based foods.\r\nOlder people tend to be easily deficient in vitamin B12 as the… [+320 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Child dies of Marburg virus disease in Tanzania, takes death toll to 6 - Daijiworld.com", "description": "Dar Es Salaam, Apr 30 (IANS): Tanzanian health authorities have said that an 18-month-old child has died of Marburg virus disease (MVD) in the northwestern region of Kagera.\r\nThe death of the child brought to six the number of patients killed by the disease s…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1075103", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-04-30T04:30:15Z", "content": "Dar Es Salaam, Apr 30 (IANS): Tanzanian health authorities have said that an 18-month-old child has died of Marburg virus disease (MVD) in the northwestern region of Kagera.\r\nThe death of the child b… [+1319 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Immunodeficiency Awareness Month: How Are These Diseases Cured? Know Medicines And Vaccines Available - ABP Live", "description": "Immunodeficiency Awareness Month: The kind of problem and the underlying cause of an immunodeficiency disease determines the therapy for the disorder. Experts tell ABP Live about the therapies.", "url": "https://news.abplive.com/science/world-immunodeficiency-week-2023-how-are-these-diseases-cured-know-treatments-medicines-vaccines-bone-marrow-transplant-available-1598867", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/04/29/cae0cacbf2380002d98062a29ef3d7d61682780125922324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-04-30T03:01:00Z", "content": "Immunodeficiency Disease Awareness Month: Immunodeficiency diseases occur as a result of a failure or absence of different elements of the immune system, which include lymphocytes; phagocytes, which … [+9216 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Fat-shamed for PCOS, this 29-year-old lost weight with Zumba along with meds and diet. She now wants to become a fitness counsellor - The Indian Express", "description": "'It is important for the patient to understand why her body metabolism or insulin resistance is different and why she is unable to lose weight,' Dr Nina Mansukhani, senior consulting gynaecologist, Jehangir Hospital", "url": "https://indianexpress.com/article/health-wellness/fat-shamed-pcos-29-year-old-zumba-counsellor-8583073/", "urlToImage": "https://images.indianexpress.com/2023/04/26ah01-Roshni-Aidasani-survivor-17_1200.jpg", "publishedAt": "2023-04-30T01:00:39Z", "content": "Roshni Aidasani is the best personal trainer one could have. At 29, the Zumba instructor and model from Pune may be pursuing a training course to become a life coach but her own struggles with weight… [+6486 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Amina Sayedah", "title": "Nuts for health: Top 5 benefits of adding nuts to your diet - Sportskeeda", "description": "Nuts are tasty and nutritious foods that are packed with beneficial nutrients, including healthy fats, protein, fiber, vitamins and minerals.", "url": "https://www.sportskeeda.com/health-and-fitness/nuts-health-top-five-benefits-adding-nuts-diet", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/04/2c0cc-16827778871076-1920.jpg", "publishedAt": "2023-04-29T14:44:00Z", "content": "Nuts are tasty and nutritious foods that are packed with beneficial nutrients, including healthy fats, protein, fiber, vitamins and minerals. These small powerhouses offer numerous benefits and can b… [+2966 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Live Hindustan", "title": "5 Foods To Prevent Anaemia - Hindustan Times", "description": "Anaemia is caused by iron deficiency when haemoglobin levels are low. Here are some foods you must add to your diet to prevent anaemia", "url": "https://www.hindustantimes.com/web-stories/5-foods-to-prevent-anaemia-_NUBJl61ajRDCI2Cugkp", "urlToImage": null, "publishedAt": "2023-04-29T12:17:38Z", "content": "Non-veg foods like eggs, lamb, oyster, fish, chicken, etc are packed with protein and iron that help treat anaemia. They also help in easy absorption of vital nutrients"}]}