{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Govt to provide cervical cancer vaccine to girls in schools - Mint", "description": "The Human Papillomavirus (HPV) CERVAVAC vaccine, for the prevention of cervical cancer, is expected to arrive in India by April next year", "url": "https://www.livemint.com/news/india/govt-to-provide-cervical-cancer-vaccine-to-girls-in-schools-11671680807373.html", "urlToImage": "https://images.livemint.com/img/2022/12/22/600x338/CBSE_exam_1640582031167_1671681402197_1671681402197.jpg", "publishedAt": "2022-12-22T04:19:47Z", "content": "The government will provide cervical cancer vaccines for girls aged between 9 and 14 years through schools. According to a report by Hindustan Times, the Centre has informed the state and Union Terri… [+2355 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Diabetes symptoms may vary from men to women, telltale signs to watch out for - Times Now", "description": "Diabetes, especially the type 2 variation affects women differently than men. Health experts believe that type 2 diabetes is more common among men, but women get more serious complications and a greater risk of death. Read on to know the signs of diabetes tha…", "url": "https://www.timesnownews.com/health/diabetes-symptoms-may-vary-from-men-to-women-telltale-signs-to-watch-out-for-article-96414931", "urlToImage": "https://static.tnn.in/thumb/msid-96414931,imgsize-100,updatedat-1671682622047,width-1280,height-720,resizemode-75/96414931.jpg", "publishedAt": "2022-12-22T04:17:02Z", "content": "Start with veggies, end in sugar: How the right order of meals can prevent blood sugar spikes in diabetes patients"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Smoking raises risk of midlife memory loss, confusion - Hindustan Times", "description": "It's also one more piece of evidence that quitting smoking is good not just for respiratory and cardiovascular reasons - but to preserve neurological health, said Rajczyk, a PhD student in Ohio State's College of Public Health, and senior author Jeffrey Wing,…", "url": "https://www.hindustantimes.com/lifestyle/health/smoking-raises-risk-of-midlife-memory-loss-confusion-101671682033919.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/22/1600x900/reza-mehrad-wQv94mB3TcY-unsplash_1667023284755_1671682104562_1671682104562.jpg", "publishedAt": "2022-12-22T04:11:09Z", "content": "According to a new study, middle-aged smokers are considerably more likely than nonsmokers to experience memory loss and confusion, and the chance of cognitive decline is lower for those who have qui… [+3198 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Loss of smell most prevalent symptom of long Covid : Study - EastMojo", "description": "London: Smell loss is one of the most prevalent symptoms of long Covid, according to a new study. According to the research, it reveals that almost a", "url": "http://www.eastmojo.com/coronavirus-updates/2022/12/22/loss-of-smell-most-prevalent-symptom-of-long-covid-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/05/coronavirus-4959669_1280.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2022-12-22T02:50:00Z", "content": "London: Smell loss is one of the most prevalent symptoms of long Covid, according to a new study. According to the research, it reveals that almost a third of long Covid patients suffer persistent sm… [+3815 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "24-week regimen of bedaquiline, pretomanid, linezolid, and moxifloxacin bests standard-care treatment for ... - Medical Dialogues", "description": "Standard-care treatment was similarly efficacious when patients could receive it without adverse effects, according to findings from a two-stage, phase 2–3 clinical trial. Delhi: A 24-week", "url": "https://medicaldialogues.in/pulmonology/news/24-week-regimen-of-bedaquiline-pretomanid-linezolid-and-moxifloxacin-bests-standard-care-treatment-for-rifampin-resistant-tuberculosis-104379", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/20/188629-tuberculosis.jpg", "publishedAt": "2022-12-22T02:30:00Z", "content": "Standard-care treatment was similarly efficacious when patients could receive it without adverse effects, according to findings from a two-stage, phase 23 clinical trial. Delhi: A 24-week all-oral re… [+3684 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Turncoat T cells: When exhausted, cancer-figh - EurekAlert", "description": "When T cells, the immune system’s chief cancer-killing agents, are working overtime to battle a tumor, they can enter a state of exhaustion where they no longer function properly. In a new Nature Immunology study, University of Pittsburgh and UPMC Hillman Can…", "url": "https://www.eurekalert.org/news-releases/974750", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/ca3f4803-dc65-43d4-a94b-af63f60129e4/Rendition/thumbnail/Content/Public", "publishedAt": "2022-12-22T02:03:06Z", "content": "image: Greg Delgoffe, Ph.D., associate professor of immunology at Pitts School of Medicine and director of the Tumor Microenvironment Center at UPMC Hillman Cancer Centerview more \r\nCredit: UPMC\r\nPIT… [+9490 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "T-cell immunity remains effective against SARS-CoV-2 Omicron subvariants - News-Medical.Net", "description": "Omicron subvariants effectively escape B-cell immune responses by modifying neutralizing antibody epitopes.", "url": "https://www.news-medical.net/news/20221221/T-cell-immunity-remains-effective-against-SARS-CoV-2-Omicron-subvariants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_734359_16716698608139759.jpg", "publishedAt": "2022-12-22T00:57:00Z", "content": "In a recent study posted to the bioRxiv*preprint server, researchers report that sublineages of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) Omicron variant effectively escape B-c… [+6778 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Brain flexibility may hasten hearing improvements from cochlear implants - Science Daily", "description": "Kickstarting the brain's natural ability to adjust to new circumstances, or neuroplasticity, improves how effectively a cochlear implant can restore hearing loss, a new study in deaf rats shows. The investigation, researchers say, may help explain the extreme…", "url": "https://www.sciencedaily.com/releases/2022/12/221221121233.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-22T00:34:47Z", "content": "Kickstarting the brain's natural ability to adjust to new circumstances, or neuroplasticity, improves how effectively a cochlear implant can restore hearing loss, a new study in deaf rats shows. The … [+4332 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Infant gene therapy is a breakthrough for Artemis-SCID patients: First 10 patients with deadly immune deficiency are doing 'amazing' - Science Daily", "description": "Ten young children born without functioning immune systems and lacking the ability to fight infections are on track for healthier lives thanks to a new gene therapy treatment.", "url": "https://www.sciencedaily.com/releases/2022/12/221221172126.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-22T00:34:40Z", "content": "Ten young children born without functioning immune systems and lacking the ability to fight infections are on track for healthier lives thanks to a new gene therapy treatment pioneered at UC San Fran… [+5247 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Oxford", "title": "New drug offers hope for people with hand osteoarthritis - Newswise", "description": "Tonia Vincent, Professor of Musculoskeletal Biology & Honorary Rheumatologist at Oxford’s Nuffield Department of Orthopaedics, Rheumatology and Musculoskeleta", "url": "https://www.newswise.com/articles/new-drug-offers-hope-for-people-with-hand-osteoarthritis", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-12-21T20:55:00Z", "content": "Newswise — Tonia Vincent, Professor of Musculoskeletal Biology &amp; Honorary Rheumatologist at Oxford’s Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences (NDORMS), said:… [+2170 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Spatial lung cell atlas offers insights into disease and immune function - Science Daily", "description": "Researchers have genetically profiled nearly 200,000 cells from lungs, mapping their precise locations in tissue to discover an unexpected new immune niche in our airways", "url": "https://www.sciencedaily.com/releases/2022/12/221221121223.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-21T19:16:29Z", "content": "The most comprehensive lung cell atlas to date, from the Wellcome Sanger Institute and collaborators, has revealed 11 new lung cell types and offers detailed insight into an immune process involved i… [+5521 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "AI-derived digital marker to measure characteristics of heart disease in patients : Study - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "WASHINGTON, Dec 21:Scientists have constructed an in silico, or computer-derived, marker for coronary artery disease (CAD) to better measure clinically important characterizations of the disease, a new study has found. Using machine learning and clinical data…", "url": "https://www.dailyexcelsior.com/ai-derived-digital-marker-to-measure-characteristics-of-heart-disease-in-patients-study/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/12/download-9-13.jpg", "publishedAt": "2022-12-21T18:34:08Z", "content": "WASHINGTON, Dec 21:Scientists have constructed an in silico, or computer-derived, marker for coronary artery disease (CAD) to better measure clinically important characterizations of the disease, a n… [+3761 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Be Informed - Trisha Yearwood Weight Loss Gummies Reviews SCAM FEEDBACK ALERT 2023! - The Tribune India", "description": "Obesity is one of the leading causes that increase the signs &amp; symptoms of heart disease, low lipid, type 2 diabetes, hypertension, respiratory problems, and depression.", "url": "https://www.tribuneindia.com/news/brand-connect/be-informed-trisha-yearwood-weight-loss-gummies-reviews-scam-feedback-alert-2023-463250", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1009010642.jpg", "publishedAt": "2022-12-21T18:13:00Z", "content": "Obesity is one of the leading causes that increase the signs &amp; symptoms of heart disease, low lipid, type 2 diabetes, hypertension, respiratory problems, and depression.\r\nWorldwide, it is a preva… [+8484 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "KetoFitastic Keto ACV Gummies Review - Is Keto Fitastic ACV Keto Gummy Brand Scam or Legit? - The Tribune India", "description": "Obesity has become a major problem in today's society, and it has significant long-term repercussions for people's health. It is associated with a wide range of serious health concerns that can put individuals at an increased risk of developing diseases such …", "url": "https://www.tribuneindia.com/news/brand-connect/ketofitastic-keto-acv-gummies-review-is-keto-fitastic-acv-keto-gummy-brand-scam-or-legit-463248", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1959066256.jpg", "publishedAt": "2022-12-21T18:05:00Z", "content": "Obesity has become a major problem in today's society, and it has significant long-term repercussions for people's health. It is associated with a wide range of serious health concerns that can put i… [+6332 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Promising antimalarial drug proves ineffective at saving children's lives - ANI News", "description": "The study, which took place under real-world conditions in three African countries, concludes that the use of RAS is unlikely to reduce malaria deaths unless underlying health system weaknesses are addressed.", "url": "https://www.aninews.in/news/health/promising-antimalarial-drug-proves-ineffective-at-saving-childrens-lives20221221224918", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221221122551.jpg", "publishedAt": "2022-12-21T17:19:00Z", "content": "Washington [US], December 21 (ANI): A large-scale study by the Swiss Tropical and Public Health Institute (Swiss TPH) and partners has found that rectal artesunate (RAS) has no beneficial effect on t… [+4005 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Researchers Find a Protective Probiotic for Amyotrophic Lateral Sclerosis - LatestLY", "description": "Get latest articles and stories on Health at LatestLY.  A probiotic bacterium called Lacticaseibacillus rhamnosus HA-114 prevents neurodegeneration in the C. elegans worm, an animal model used to study amyotrophic lateral sclerosis (ALS).", "url": "https://www.latestly.com/agency-news/health-news-researchers-find-a-protective-probiotic-for-amyotrophic-lateral-sclerosis-4617690.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/12/ANI-20221221123034-588x441.jpg", "publishedAt": "2022-12-21T17:08:18Z", "content": "Washington [US], December 21 (ANI): A probiotic bacterium called Lacticaseibacillus rhamnosus HA-114 prevents neurodegeneration in the C. elegans worm, an animal model used to study amyotrophic later… [+3606 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Injectable HIV treatment offers hope to Ugandan patients - Devdiscourse", "description": "The treatment, developed by British drugmaker GlaxoSmithKline, is the first non-pill option against HIV, and studies have shown similar efficacy as daily oral pills.  \"These drugs, you have to take them every day, and if you are taking them at exactly 9 a.m.,…", "url": "https://www.devdiscourse.com/article/health/2294927-injectable-hiv-treatment-offers-hope-to-ugandan-patients", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_19_01_57_1514112.jpg?width=920&format=jpeg", "publishedAt": "2022-12-21T16:51:12Z", "content": "Ever since Gerald Muwonge tested positive for HIV eight years ago, keeping his viral load in check has meant carrying around vials of pills for his daily treatment regimen while dodging the stigma th… [+2374 chars]"}, {"source": {"id": null, "name": "Marketscreener.com"}, "author": "MarketScreener", "title": "Bird flu situation is worsening in France, ministry says - Marketscreener.com", "description": "The spread of bird flu has accelerated in the past weeks in France, the European Union's second largest poultry producer, the farm ministry said on Wednesday, raising concern of further shortages....", "url": "https://www.marketscreener.com/news/latest/Bird-flu-situation-is-worsening-in-France-ministry-says--42598202/", "urlToImage": "https://img.zonebourse.com/reuters/2022-09/2022-09-07T142834Z_2_LYNXMPEI860RN_RTROPTP_3_FRANCE-BIRDFLU.JPG", "publishedAt": "2022-12-21T16:37:09Z", "content": "France had already detected a rise in bird flu outbreaks over the summer after seeing its worst wave of the disease last season that lead to the culling of about 20 million chickens, ducks and turkey… [+1602 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study: Infection during pregnancy linked to neurodevelopmental changes in babies - ThePrint", "description": "Washington [US], December 21 (ANI): Antidepressant use during pregnancy may combine with inflammation to heighten the risk of lifelong neurodevelopmental changes in babies’ brains, such as those linked to autism, new research from the University of Virginia S…", "url": "https://theprint.in/health/study-infection-during-pregnancy-linked-to-neurodevelopmental-changes-in-babies/1275618/", "urlToImage": null, "publishedAt": "2022-12-21T16:13:19Z", "content": "Washington [US], December 21 (ANI): Antidepressant use during pregnancy may combine with inflammation to heighten the risk of lifelong neurodevelopmental changes in babies’ brains, such as those link… [+4567 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Artificial DNA kills cancer: Hairpin-shaped DNA binds with microRNA in cancer cells to trigger an immune response - Science Daily", "description": "Researchers have used artificial DNA to target and kill cancer cells in a completely new way. The method was effective in lab tests against human cervical cancer- and breast cancer-derived cells, and against malignant melanoma cells from mice. The team create…", "url": "https://www.sciencedaily.com/releases/2022/12/221221090609.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-12-21T15:41:04Z", "content": "Researchers at the University of Tokyo have used artificial DNA to target and kill cancer cells in a completely new way. The method was effective in lab tests against human cervical cancer- and breas… [+4153 chars]"}, {"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "How do RSV symptoms differ from flu, COVID-19 and other respiratory viruses? - Gavi, the Vaccine Alliance", "description": "Symptoms of respiratory syncytial virus (RSV) are similar to those of other common respiratory viruses, but young children are more susceptible to severe illness. Here’s when to consult a doctor.", "url": "https://www.gavi.org/vaccineswork/how-do-rsv-symptoms-differ-flu-covid-19-and-other-respiratory-viruses", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2022/Header/pexels-tima-miroshnichenko-8376168_h1.jpg", "publishedAt": "2022-12-21T15:35:03Z", "content": "Respiratory Syncytial Virus, or RSV, is a normal childhood illness, but it is currently generating concern in many countries because it appears to be behaving abnormally. Usually, cases start to incr… [+4758 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Miriam E. Tucker", "title": "Debate: Lifestyle or Surgery for Type 2 Diabetes Remission? - Medscape", "description": "What is the evidence supporting intensive lifestyle modification vs bariatric surgery for type 2 diabetes remission? Experts discussed this at the recent International Diabetes Federation meeting.", "url": "https://www.medscape.com/viewarticle/985937", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_221221_debate_yelling_800x450.jpg", "publishedAt": "2022-12-21T15:22:16Z", "content": "The concept of type 2 diabetes \"remission\" was recently defined by professional societies and was discussed as a worthy goal of treatment, but there is no consensus yet on how best to achieve it.\r\nAt… [+6900 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr Ranjana Becon", "title": "Pregnancy: Taking Care Of You And Your Baby In Your Third Trimester - NDTV Doctor", "description": "It is very important to take good care of the mother and the child throughout the pregnancy. Keep these points in mind to do the same.", "url": "https://doctor.ndtv.com/pregnancy/pregnancy-taking-care-of-you-and-your-baby-in-your-third-trimester-3627011", "urlToImage": "https://c.ndtvimg.com/2022-02/63lahgkg_pregnancy_625x300_17_February_22.jpg", "publishedAt": "2022-12-21T14:55:53Z", "content": "Pregnancy can be a beautiful yet difficult and confusing time to go through, especially for new expecting mothers. With so many suggestions, tips, and nuskhas from family, friends, neighbors, and str… [+4003 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Warning signs of sudden cardiac arrest provide opportunity for prevention - ANI News", "description": "Sudden cardiac arrest causes one in five deaths in industrialised countries.2 Most sudden cardiac arrests occur in the community in people not known to be at risk. A cardiac arrhythmia, called ventricular fibrillation, causes the heart to stop pumping and blo…", "url": "https://www.aninews.in/news/health/warning-signs-of-sudden-cardiac-arrest-provide-opportunity-for-prevention20221221202430", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221221141733.jpeg", "publishedAt": "2022-12-21T14:54:00Z", "content": "Washington [US], December 21 (ANI): \"Contrary to the general assumption, a sudden cardiac arrest does not strike entirely unheralded, as ESCAPE-NET data have shown that patients attend primary care m… [+3175 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "PET/CT imaging reveals risk of major adverse cardiovascular events in pneumonia patients: Study - Medical Dialogues", "description": "Canada: FDG-PET/CT scans have revealed that vascular inflammation may trigger high rates of adverse events and heart attacks in pneumonia patients, says a study published in JACC: Cardiovascular...", "url": "https://medicaldialogues.in/radiology/news/petct-imaging-reveals-risk-of-major-adverse-cardiovascular-events-in-pneumonia-patients-study-104370", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/21/194384-cv-events.jpg", "publishedAt": "2022-12-21T14:30:19Z", "content": "Canada: FDG-PET/CT scans have revealed that vascular inflammation may trigger high rates of adverse events and heart attacks in pneumonia patients, says a study published in JACC: Cardiovascular Imag… [+2709 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Drinking 2 cups of coffee daily may double risk of heart death in people with hypertension - ANI News", "description": "Drinking two or more cups of coffee a day may double the risk of death from cardiovascular disease among people with severe high blood pressure (160/100 mm Hg or higher) but not people with high blood pressure not considered severe, according to research publ…", "url": "https://www.aninews.in/news/health/drinking-2-cups-of-coffee-daily-may-double-risk-of-heart-death-in-people-with-hypertension20221221194943", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221221141933.jpg", "publishedAt": "2022-12-21T14:19:00Z", "content": "Washington [US], December 21 (ANI): According to research published today in the Journal of the American Heart Association, open access, peer-reviewed journal of the American Heart Association, drink… [+5416 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Kerstin Gackle", "title": "Obesity researchers discover new gene mutation in children - Medical Xpress", "description": "A research team at Leipzig University's Faculty of Medicine has discovered a new mechanism that is associated with severe obesity in children. This genetic rearrangement leads to an unusual expression of a gene involved in hunger control and is not detected b…", "url": "https://medicalxpress.com/news/2022-12-obesity-gene-mutation-children.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/obesity-researchers-di-1.jpg", "publishedAt": "2022-12-21T14:03:04Z", "content": "Clinical characteristics of the index patient and her family. a,b, Course of BMI (a) and height (b) of the patient (red dots) from birth to adolescence in relation to 3rd (P3), 50th (P50) and 97th (P… [+4534 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Importance of Preconception Nutrition During pregnancy - News18", "description": "For a smooth and healthy pregnancy, experts suggest proper planning in tune with your body's health and needs", "url": "https://www.news18.com/news/lifestyle/importance-of-preconception-nutrition-during-pregnancy-6667075.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-58-165994442416x9.png", "publishedAt": "2022-12-21T13:36:51Z", "content": "Pregnancy comes with many ups and downs. It is one point in time when bodies are at their most sensitive. During pregnancy, a womans body is under immense stress as it creates a new life. It is for t… [+1893 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumedha Tripathi", "title": "Feeling Blue After Childbirth? Know About Postpartum Depression & How You Can Get Better - Indiatimes.com", "description": "There is probably nothing more life-changing than birthing a child. Becoming a mother post the nine-month process of carrying the baby and bringing a whole new human being to life is phenomenal, to say the least. While giving birth to one's own baby may be th…", "url": "https://www.indiatimes.com/lifestyle/mental-health/postpartum-depression-and-how-you-can-treat-it-588149.html", "urlToImage": "https://im.indiatimes.in/content/2022/Dec/postpartum-depression_63a2a0658d559.jpg", "publishedAt": "2022-12-21T13:16:13Z", "content": "There is probably nothing more life-changing than birthing a child. Becoming a mother post the nine-month process of carrying the baby and bringing a whole new human being to life is phenomenal, to s… [+6750 chars]"}, {"source": {"id": null, "name": "Orissadiary.com"}, "author": "OdAdmin", "title": "FUJIFILM India spreads awareness about Early Detection of Breast Cancer in Bhubaneshwar - Odisha Diary", "description": "FUJIFILM India Pvt Ltd, a pioneer in diagnostic imaging and information systems for healthcare facilities is hosting an event to raise awareness about the early detection of breast cancer in Bhubaneshwar, Odisha.As part of the event, Fujifilm will be", "url": "https://orissadiary.com/fujifilm-india-spreads-awareness-about-early-detection-of-breast-cancer-in-bhubaneshwar/", "urlToImage": "https://i0.wp.com/orissadiary.com/wp-content/uploads/2022/12/quP661Et_400x400.jpg?fit=400%2C400&ssl=1", "publishedAt": "2022-12-21T12:23:04Z", "content": "FUJIFILM India Pvt Ltd, a pioneer in diagnostic imaging and information systems for healthcare facilities is hosting an event to raise awareness about the early detection of breast cancer in Bhubanes… [+2368 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Buying Anabolic Steroids Online [2023] How to Buy, Supply - Deccan Herald", "description": "What are They? Ever wondered how these heavy weight lifters became that size? While some might have gained their muscles by following an intense program of weight-lifting and diet while others could have gained their size through the use of steroids in a way …", "url": "https://www.deccanherald.com/brandspot/pr-spot/buying-anabolic-steroids-online-2023-how-to-buy-supply-1173789.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1173789-1671625012.png", "publishedAt": "2022-12-21T12:16:52Z", "content": "What are They?\r\nEver wondered how these heavy weight lifters became that size? While some might have gained their muscles by following an intense program of weight-lifting and diet while others could… [+26295 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Scientists find hearing loss link in autism spectrum study - Devdiscourse", "description": "Read more about Scientists find hearing loss link in autism spectrum study on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2294460-scientists-find-hearing-loss-link-in-autism-spectrum-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/27_02_2020_05_21_18_4948826.JPG?width=920&format=jpeg", "publishedAt": "2022-12-21T11:49:41Z", "content": "Scientists have discovered hearing impairment in a preclinical model of autism spectrum disorder (ASD), according to a new study.\r\nThe researchers observed mild hearing loss and defects in auditory n… [+4520 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "What is sticky cholesterol and what does it do to your heart? Can statins help? - The Indian Express", "description": "‘It is lipoprotein (a) and is formed in the liver with protein and fat molecules attached to it. It carries cholesterol through the blood and works through LDL. That’s why it’s a risk marker for CVD,’ says Dr Balbir Singh, Chairman, Cardiac Sciences, Cardiolo…", "url": "https://indianexpress.com/article/lifestyle/health-specials/what-is-sticky-cholesterol-and-how-does-it-impact-your-heart-health-8336793/", "urlToImage": "https://images.indianexpress.com/2022/12/GettyImages-heart-health-cardiovascular-health-1200.jpg", "publishedAt": "2022-12-21T10:30:03Z", "content": "If you are struggling with your hypertension, then a particular type of cholesterol Lipoprotein (a) or Lp(a) for short may be to blame and can raise your risk of cardiovascular disease (CVD), accordi… [+3832 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "What is SAD? A mental disorder triggered by winter - India Today", "description": "A type of depression, SAD is triggered during the fall or winter season. The symptoms include feeling drained, craving carbohydrates, problems with sleep and a sense of worthlessness.", "url": "https://www.indiatoday.in/health/story/what-is-sad-a-mental-disorder-triggered-by-winter-2311830-2022-12-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/untitled_design_42-sixteen_nine.png?VersionId=ETTtSrziyJ79wgDmTuleEC.LHAq8xTHH", "publishedAt": "2022-12-21T09:52:22Z", "content": "By Daphne Clarance: There are several behaviours as well as mental changes that are impacted by winter. Limited sun exposure, dim light, and gloomy weather could trigger the production of neurotransm… [+2745 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study reveals how virtual reality games, eye tracking detect ADHD - Times of India", "description": "Researchers have demonstrated that changes in eye movements can be used to detect Attention-deficit/hyperactivity disorder (ADHD), potentially giving a method for more accurate diagnosis of attention problems. They did this using virtual reality games, eye tr…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/study-reveals-how-virtual-reality-games-eye-tracking-detect-adhd/videoshow/96395559.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/96395559/size-53238/96395559.jpg", "publishedAt": "2022-12-21T09:20:39Z", "content": "Researchers have demonstrated that changes in eye movements can be used to detect Attention-deficit/hyperactivity disorder (ADHD), potentially giving a method for more accurate diagnosis of attention… [+470 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "Fool-Proof Digestive Hacks For Festive Season Indulgences - Slurrp", "description": "There is no need to stop yourself from having that extra helping of cake or eating one too many canapes, if you’ve included these simple, homemade concoctions to keep your digestion in check.", "url": "https://www.slurrp.com/web-stories/fool-proof-digestive-hacks-for-festive-season-indulgences/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2022/12/21141838/cropped-lisa-hobbs-mRaNok_Ld6s-unsplash-scaled-1.jpg", "publishedAt": "2022-12-21T09:05:40Z", "content": "If you feel like you have eaten too much of something that doesnt sit well with your body, or you suffer from a bout of loose motions, combine equal amounts of fresh lemon juice and water and consume… [+204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heart Health: These Expert Tips Will Help You Understand Your Cholesterol Test Results - NDTV", "description": "According to Dr. Vishakha Shivdasani, a high total cholesterol number doesn't indicate that the person may suffer or is suffering from a heart disease", "url": "https://www.ndtv.com/health/heart-health-these-expert-tips-will-help-understand-your-cholesterol-test-results-3623250", "urlToImage": "https://c.ndtvimg.com/2022-11/hid4sq4g_cholesterol_625x300_15_November_22.jpg", "publishedAt": "2022-12-21T09:02:38Z", "content": "Heart health: Uncontrolled cholesterol can put you at a higher risk of heart diseases\r\nHigh levels of cholesterol in the body is one of the major health concerns. It is associated with various heart-… [+2522 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: 5 Tips To Keep Blood Sugar Levels In Check This Winter - NDTV", "description": "Diabetes: The winter season can make it hard for you to control blood sugar levels. Here are a few tips that can help you manage diabetes effectively.", "url": "https://www.ndtv.com/health/diabetes-5-tips-to-keep-blood-sugar-levels-in-check-this-winter-3623528", "urlToImage": "https://c.ndtvimg.com/2022-10/kl0n094o_fruits-to-avoid-in-diabetes_625x300_19_October_22.jpg", "publishedAt": "2022-12-21T07:51:53Z", "content": "Diabetes diet: You can keep your blood sugar levels in check by following healthy lifestyle choices\r\nYour blood sugar levels may fluctuate constantly if you have diabetes. This can harm your health o… [+3815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Doctor Shares Shocking Discovery After Woman's Shoe Size Increased - NDTV", "description": "In a series of tweets, Dr Kumar shared that woman's husband was his patient initially, he complained of back pain.", "url": "https://www.ndtv.com/feature/doctor-shares-shocking-discovery-after-womans-shoe-size-increased-3625276", "urlToImage": "https://c.ndtvimg.com/2022-12/q7o14q9g_the-doctor-imagined-a-possibility-of-a-brain-disease-representational-image-unsplash_625x300_21_December_22.jpg", "publishedAt": "2022-12-21T06:26:23Z", "content": "The doctor imagined a possibility of a brain disease. (Representational Image: Unsplash)\r\nA doctor from Hyderabad's Apollo Hospital recently narrated how he detected a benign tumour in a woman. Dr Su… [+2751 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Huge multi-omic data analysis deciphers colorectal cancer genetics - News-Medical.Net", "description": "An analysis of more than 100,000 colorectal cancer cases and 154,000 healthy controls published in Nature Genetics uncovered hundreds of signals that may serve as new treatment and prevention targets.", "url": "https://www.news-medical.net/news/20221221/Huge-multi-omic-data-analysis-deciphers-colorectal-cancer-genetics.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-12-21T05:21:00Z", "content": "An analysis of more than 100,000 colorectal cancer cases and 154,000 healthy controls published in Nature Genetics uncovered hundreds of signals that may serve as new treatment and prevention targets… [+3726 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Dr Sher Bahadur Pun, Dr Sher Bahadur Pun", "title": "Covid-19: No longer a pandemic? - Asia News NetworkAsia News Network - asianews.network", "description": "There is still a lack of scientific consensus on the criterion that determines whether a pandemic is over.", "url": "https://asianews.network/covid-19-no-longer-a-pandemic/", "urlToImage": "https://asianews.network/wp-content/uploads/2022/12/thumb-4.jpeg", "publishedAt": "2022-12-21T04:57:51Z", "content": "December 21, 2022\r\nKATHMANDU – The Dictionary of Epidemiology defines a pandemic as an epidemic occurring worldwide or over a wide area, crossing international boundaries and usually affecting a larg… [+5644 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Japanese researchers design antibiotics analogs that target multiple-drug-resistant bacteria - Medical Dialogues", "description": "Antibiotics are vital drugs in the treatment  of a number of bacterial diseases. However, due to continuing overuse and  misuse, the number of bacteria strains that are resistant to multiple ...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/japanese-researchers-design-antibiotics-analogs-that-target-multiple-drug-resistant-bacteria-104345", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/21/194402-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-37.jpg", "publishedAt": "2022-12-21T03:45:14Z", "content": "Antibiotics are vital drugs in the treatment of a number of bacterial diseases. However, due to continuing overuse and misuse, the number of bacteria strains that are resistant to multiple antibiotic… [+3027 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Why diabetics need to watch out for micronutrients - The Indian Express", "description": "Deficiencies of certain minerals such as potassium, magnesium, and possibly zinc and chromium may predispose one to carbohydrate intolerance, says  Dr Anoop Misra, Chairman, Fortis CDOC Hospital for Diabetes and Allied Sciences", "url": "https://indianexpress.com/article/lifestyle/health-specials/diabetics-watch-out-micronutrients-importance-8335697/", "urlToImage": "https://images.indianexpress.com/2022/12/diabetics__HS_.jpg", "publishedAt": "2022-12-21T03:30:23Z", "content": "The son of a 78-year-old patient with multiple diseases, including diabetes, asked me: What are the nutrients that my father needs? I told him that at his age and with multiple diseases, both nutrien… [+4516 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "CDC says U.S. is experiencing highest number of flu hospitalizations in a decade - KPIX CBS SF Bay Area", "description": "Dr. Shashank Ravi, clinical assistant professor of emergency medicine at Stanford Health Care, explains the difference between the symptoms of flu, Covid and...", "url": "https://www.youtube.com/watch?v=Rreb5nDDNEc", "urlToImage": "https://i.ytimg.com/vi/Rreb5nDDNEc/maxresdefault.jpg", "publishedAt": "2022-12-21T02:15:58Z", "content": null}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Hypertension: Garlic is winter superfood to manage high blood pressure, forget BP issues if you eat THESE - DNA India", "description": "High blood pressure can be controlled with a nutritious diet and an active lifestyle.", "url": "https://www.dnaindia.com/health/report-hypertension-garlic-is-winter-superfood-to-manage-high-blood-pressure-forget-bp-issues-if-you-eat-these-food-3011997", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/12/21/2561833-untitled-design-17.jpg", "publishedAt": "2022-12-21T01:40:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Dec 21, 2022, 07:58 AM ISTAs winter is coming, the outbreak of various diseases is also increasing. One of these conditions is hy… [+2958 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover new biomarker method to diagnose severe heart complications from cancer treatment - ANI News", "description": "Researchers at Michigan Medicine have developed a new biomarker-based technique to screen for a rare and fatal consequence caused by monoclonal antibodies, which are used to treat a variety of tumours.", "url": "https://www.aninews.in/news/science/researchers-discover-new-biomarker-method-to-diagnose-severe-heart-complications-from-cancer-treatment20221221053419", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221220234807.jpg", "publishedAt": "2022-12-21T00:04:00Z", "content": "Michigan [US], December 21 (ANI): Researchers at Michigan Medicine have developed a new biomarker-based technique to screen for a rare and fatal consequence caused by monoclonal antibodies, which are… [+3210 chars]"}, {"source": {"id": null, "name": "Monash.edu"}, "author": "Jonathan Shaw", "title": "Increase in diabetes numbers hides a ray of hope - Monash Lens", "description": "<p>The rate of diabetes is increasing globally. We’re told it’s a <a href=\"https://pubmed.ncbi.nlm.nih.gov/23185035/\" target=\"_blank\">tsunami</a>. An <a href=\"https://www.smh.com.au/national/nsw/the-diabetes-epidemic-up-to-half-a-million-australians-have-this…", "url": "https://lens.monash.edu/@medicine-health/2022/12/21/1385244/increase-in-diabetes-numbers-hides-a-ray-of-hope", "urlToImage": "https://res.cloudinary.com/cognitives-s3/image/upload/c_fill,dpr_auto,f_auto,fl_lossy,h_800,q_auto,w_1200/v1/cog-live/n/1271/2022/Nov/03/6E8Hr2XkbN72buHutCQU.jpg", "publishedAt": "2022-12-21T00:02:33Z", "content": "The rate of diabetes is increasing globally. Were told its a tsunami. An epidemic. But thats only half the story. The real picture has some rays of hope among the dark clouds.\r\nDiabetes is a long-ter… [+4510 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Screening of osteoporosis lags other diseases - EurekAlert", "description": "A new perspective article published in the Lancet Diabetes & Endocrinology has highlighted that screening and treatment of osteoporosis lags behind other diseases, resulting in significant morbidity, mortality, and economic costs.", "url": "https://www.eurekalert.org/news-releases/975034", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-12-20T23:59:47Z", "content": "Over the past 30 years, there has been tremendous progress in the ability to diagnose osteoporosis, a disease that was once considered an inevitable consequence of aging that weakens bones and can re… [+5189 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Patrick Waechter", "title": "Mpox Seemed To Have Pandemic Potential. Here’s Why That Didn’t Happen. - BuzzFeed News", "description": "Mpox case numbers are low and trending lower. Here’s how science saved the day and where the White House and CDC are currently focusing their efforts to fight the outbreak.", "url": "https://www.buzzfeednews.com/article/patrickwaechter/why-mpox-cases-dropped", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2022-12/20/0/campaign_images/8e086e8058a9/mpox-seemed-to-have-pandemic-potential-heres-why--3-5386-1671497630-6_dblbig.jpg", "publishedAt": "2022-12-20T18:29:36Z", "content": "Controlling the mpox outbreak has been all about community coordination and having leaders who empower experts to make science-based decisions. In addition, a collective of individuals and organizati… [+6154 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover Myelin determines energy management of inhibitory brain cells - ANI News", "description": "Researchers have shown that inhibitory brain cells in our brain manage energy differently from excitatory cells.", "url": "https://www.aninews.in/news/health/researchers-discover-myelin-determines-energy-management-of-inhibitory-brain-cells20221220224844", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221220171111.jpg", "publishedAt": "2022-12-20T17:18:00Z", "content": "Amsterdam [Netherlands], December 20 (ANI): The management of energy by inhibitory and excitatory brain cells in human brains differs, according to research from the Netherlands Institute for Neurosc… [+3524 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals underlying genetic cause for MIS-C complication after COVID-19 infection - News-Medical.Net", "description": "New research findings have revealed an underlying genetic cause for why some children who have had COVID-19 infection develop Multisystem Inflammatory Syndrome in Children (MIS-C), a rare but potentially life-threatening disease.", "url": "https://www.news-medical.net/news/20221220/Study-reveals-underlying-genetic-cause-for-MIS-C-complication-after-COVID-19-infection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-12-20T17:06:00Z", "content": "New research findings have revealed an underlying genetic cause for why some children who have had COVID-19 infection develop Multisystem Inflammatory Syndrome in Children (MIS-C), a rare but potenti… [+3856 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Ashley Gallagher, Assistant Editor", "title": "High Blood Pressure Medication Shows Potential in Preventing Damage from AKI - Pharmacy Times", "description": "Investigators hope findings of study in mice help improve treatment for individuals with acute kidney injury.", "url": "https://www.pharmacytimes.com/view/high-blood-pressure-medication-shows-potential-in-preventing-damage-from-aki", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/61661393d4d237f125b57f9dc23581acb9ff0dec-6000x5000.jpg?fit=crop&auto=format", "publishedAt": "2022-12-20T15:03:39Z", "content": "Investigators found that medication used to treat angina and high blood pressure (HBP) prevented long-term damage to the cardiovascular system and kidneys caused by acute kidney injury (AKI), accordi… [+3078 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Music therapy reduces pain and anxiety among patients with cancer and sickle cell disease - Medical Dialogues", "description": "Researchers at University Hospitals (UH) Connor Whole Health have found in a new study that patients with cancer and patients with sickle cell disease (SCD) treated at an academic cancer center...", "url": "https://medicaldialogues.in/oncology/news/music-therapy-reduces-pain-and-anxiety-among-patients-with-cancer-and-sickle-cell-disease-104311", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/20/194229-untitled-design-2022-12-20t104042996.jpg", "publishedAt": "2022-12-20T14:30:53Z", "content": "Researchers at University Hospitals (UH) Connor Whole Health have found in a new study that patients with cancer and patients with sickle cell disease (SCD) treated at an academic cancer center repor… [+6459 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Could Monkeypox Virus Turn Out to be as Big a Pandemic as Covid-19? Deets Inside - News18", "description": "Whether or not the Monkeypox virus will pose another threat like the pandemic needs further research and observation.", "url": "https://www.news18.com/news/lifestyle/could-monkeypox-virus-turn-out-to-be-as-big-a-pandemic-as-covid-19-deets-inside-6659893.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-1-181-167154440416x9.jpg", "publishedAt": "2022-12-20T13:53:58Z", "content": "After the disastrous Covid-19 pandemic that shook the world, last year on May 12 in 2021, the first case of another deadly virus known as the Monkeypox virus brought the beautiful city of London to i… [+2334 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "UK researchers call for nasal spray vaccine to fortify protection against COVID infection - ETHealthWorld", "description": "These new findings, published in the journal eBioMedicine, may explain why people who have recovered from COVID are at risk of reinfection - especially with Omicron and its sub variants. The study also found that vaccination is very effective in creating and …", "url": "https://health.economictimes.indiatimes.com/news/pharma/uk-researchers-call-for-nasal-spray-vaccine-to-fortify-protection-against-covid-infection/96375997", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96375997,imgsize-69752,width-1200,height-628,overlay-ethealthworld/uk-researchers-call-for-nasal-spray-vaccine-to-fortify-protection-against-covid-infection.jpg", "publishedAt": "2022-12-20T13:43:00Z", "content": "London: Antibodies produced in the nose decline nine months after COVID-19 infection, while antibodies found in the blood last at least a year, a new study has found. Antibodies in the nasal fluid, k… [+3118 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "IAP updates rules on child immunisation post-COVID-19 pandemic - ETHealthWorld", "description": "In view of the dramatic drop in regular immunisation drives and the unpredictable outbreak of measles and rubella cases, IAP released new guidelines for regular vaccination drives. In addition, IAP also released a manual for standardising treatment for 150 co…", "url": "https://health.economictimes.indiatimes.com/news/industry/iap-updates-rules-on-child-immunisation-post-covid-19-pandemic/96375865", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96375865,imgsize-68650,width-1200,height-628,overlay-ethealthworld/iap-updates-rules-on-child-immunisation-post-covid-19-pandemic.jpg", "publishedAt": "2022-12-20T13:43:00Z", "content": "Mumbai: Indian Academy of Paediatrics (IAP) has come up with an updated set of rules on child immunisation for the first time after the COVID pandemic. COVID-19 saw the COVID vaccination drive in a r… [+3269 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Immune Cell Hacking May Have Potential Benefit In Cancer Treatment - Nation World News", "description": "Las T cells designed under the banner of bioengineering They may not only recognize cancer cells, but also be more potent and safer in their antitumor action,", "url": "https://nationworldnews.com/immune-cell-hacking-may-have-potential-benefit-in-cancer-treatment/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/12/Immune-cell-hacking-may-have-potential-benefit-in-cancer-treatment.jpg", "publishedAt": "2022-12-20T13:09:23Z", "content": "Las T cells designed under the banner of bioengineering They may not only recognize cancer cells, but also be more potent and safer in their antitumor action, according to researchers of two studies … [+4135 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "TB in uterus may cause infertility among women, expert says turns severe if not treated on time - News9 LIVE", "description": "Experts say when a woman contracts TB bacteria can infect the walls and tubes of the uterus", "url": "https://www.news9live.com/health/health-conditions/tb-in-uterus-may-cause-infertility-among-women-expert-says-turns-severe-if-not-treated-on-time-215263", "urlToImage": "https://media.news9live.com/h-upload/2022/12/20/594422-treatment-4099432640.jpg", "publishedAt": "2022-12-20T12:51:59Z", "content": "There has been no significant decline in the incidence of tuberculosis (TB) across the world in recent years. People generally think that TB infects the lungs only. That, however, is not the case. Th… [+2069 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Study Reveals How Cells Help To Treat Resistance In Prostate Cancer - ABP Live", "description": "These cells are castration-resistant, which explains why prostate tumours can resist hormone-related treatments since they can develop even in the absence of testosterone.", "url": "https://news.abplive.com/lifestyle/study-reveals-how-cells-help-to-treat-resistance-in-prostate-cancer-1570768", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/20/23cd7bab711daaaab5ede1122d41c5451671535809365556_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-20T11:36:05Z", "content": "Throughout the whole course of the disease, from the early stages to the point of androgen independence, where the tumour no longer responds to hormone restriction therapy, researchers have detailed … [+5371 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "Dr Pranav Kabra explains why silent heart attacks, frequent among actors and bodybuilders - Punjab News Express", "description": "<p><strong>MUMBAI:</strong>&nbsp;Even as more and more actors and male models suffer heart attacks in the country, apparently there seems to be an increased propensity for heart disease in the media and glamour industry.</p>", "url": "https://www.punjabnewsexpress.com/news/news/dr-pranav-kabra-explains-why-silent-heart-attacks-frequent-among-actors-and-bodybuilders-192751", "urlToImage": "https://www.punjabnewsexpress.com/images/article/article192751.jpg", "publishedAt": "2022-12-20T10:09:40Z", "content": "MUMBAI: Even as more and more actors and male models suffer heart attacks in the country, apparently there seems to be an increased propensity for heart disease in the media and glamour industry.\r\n\"S… [+3777 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "From LDL Cholesterol Reduction to new mRNA Vaccines: Top 5 medical breakthroughs of 2022 - CNBCTV18", "description": "With medical technology developing incredibly fast, we are witnessing significant advancements in mRNA technology, cancer research, medical smart devices and more", "url": "https://www.cnbctv18.com/healthcare/from-ldl-cholesterol-reduction-to-new-mrna-vaccines-top-5-medical-breakthroughs-of-2022-15413101.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/05/sinopharm-1019x573.jpg", "publishedAt": "2022-12-20T10:03:52Z", "content": "Previous Article\r\nChina relaxing COVID norms raises concerns about 'deaths in millions' and new virus mutations"}, {"source": {"id": null, "name": "Vibesofindia.com"}, "author": "Team VoI", "title": "Measles On The Rise, Centre Pushes For More Surveillance - Vibes of India", "description": "At least 40 children in India have died this year due to measles and around 10,000 kids were affected by the disease, junior health minister Bharati Pravin Pawar informed the Parliament recently in reply to a question. Maharashtra, Pawar said, has witnessed m…", "url": "https://www.vibesofindia.com/measles-on-the-rise-centre-pushes-for-more-surveillance/", "urlToImage": "https://www.vibesofindia.com/wp-content/uploads/2022/12/WhatsApp-Image-2022-12-20-at-13.12.50.jpg", "publishedAt": "2022-12-20T07:53:33Z", "content": "At least 40 children in India have died this year due to measles and around 10,000 kids were affected by the disease, junior health minister Bharati Pravin Pawar informed the Parliament recently in r… [+1641 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "FDA approval to targeted imaging agent pafolacianine for use in lung cancer surgery - Medical Dialogues", "description": "More than 130,000 Americans die of lung cancer  each year, making lung cancer the leading cause of cancer mortality in the  country. Lung cancer mortality is high largely because it tends to be...", "url": "https://medicaldialogues.in/mdtv/oncology/videos/fda-approval-to-targeted-imaging-agent-pafolacianine-for-use-in-lung-cancer-surgery-104295", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/19/194204-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-27.jpg", "publishedAt": "2022-12-20T07:51:39Z", "content": "More than 130,000 Americans die of lung cancer each year, making lung cancer the leading cause of cancer mortality in the country. Lung cancer mortality is high largely because it tends to be diagnos… [+3649 chars]"}, {"source": {"id": null, "name": "Pkbnews.in"}, "author": "pkbnews", "title": "Viral hepatitis A damages the liver, learn how to prevent it - PKBnews.in", "description": "Hepatitis A is a viral infection that can cause significant liver damage. Symptoms of jaundice are also seen in this disease. In this case, timely treatment is required. This way keep the liver health", "url": "https://pkbnews.in/viral-hepatitis-a-damages-the-liver-learn-how-to-prevent-it/", "urlToImage": "https://images.tv9hindi.com/wp-content/uploads/2022/12/liver.jpg", "publishedAt": "2022-12-20T07:40:58Z", "content": "Many diseases are increasing due to bad lifestyle and wrong food habits. The people are also suffering a lot. In the past few months, measles, Dengue and even viral Hepatitis A (HAV) such as infectio… [+2146 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Childhood leukaemia likely driven by common infections such as flu - The Telegraph", "description": "Babies develop risk of cancer in womb, but will not go on to develop it without second ‘hit’ from an infection, scientists believe", "url": "https://www.telegraph.co.uk/news/2022/12/20/childhood-leukaemia-likely-driven-common-infections-flu/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/12/19/TELEMMGLPICT000320197201_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay", "publishedAt": "2022-12-20T06:00:00Z", "content": "Childhood leukaemia is driven by common childhood infections meeting pre-cancerous cells in the blood, scientists believe.  \r\nExperts at the Institute of Cancer Research (ICR) in London have found ba… [+3926 chars]"}]}