{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "Diabetes Drug Tied to Lower Dementia Risk - Medscape", "description": "New research supports the potential cognitive benefit of pioglitazone, particularly in the setting of high ischemic burden, suggesting a possible personalized avenue to treatment.", "url": "https://www.medscape.com/viewarticle/988388", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230216_dementia_brain_800x450.jpg", "publishedAt": "2023-02-16T18:30:54Z", "content": "Treatment with the thiazolidinedione pioglitazone may offer the greatest protection against dementia for older adults with newly diagnosed type 2 diabetes mellitus (T2DM) who have a history of stroke… [+5320 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Teena Thacker", "title": "Risk of death due to Covid 90% lower in people already hit: Lancet medical journal - Economic Times", "description": "An analysis of five studies reporting on severe disease (hospitalisation and death) found that protection remained high for 10 months - up to 90% for the ancestral coronavirus variants including Alpha and Delta, and 88% for Omicron BA.1.", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/risk-of-death-due-to-covid-90-lower-in-people-already-hit-lancet-medical-journal/articleshow/97990948.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97990981,width-1070,height-580,imgsize-55042,overlay-economictimes/photo.jpg", "publishedAt": "2023-02-16T18:16:00Z", "content": "The risk of hospitalisation or death from Covid-19 is as much as 90% lower at least for 10 months for those who have previously been infected, compared with those who have been uninfected, according … [+2168 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "Tom Polansek (Reuters)", "title": "Bird flu spreads to new countries, threatens non-stop \"war\" on poultry - The Jakarta Post - The Jakarta Post", "description": "Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that transmit the virus to poultry, according to veterinarians and disease experts, who warn it is now a year-round problem.", "url": "https://www.thejakartapost.com/paper/2023/02/17/bird-flu-spreads-to-new-countries-threatens-non-stop-war-on-poultry.html", "urlToImage": "", "publishedAt": "2023-02-16T18:07:34Z", "content": "Avian flu has reached new corners of the globe and become endemic for the first time in some wild birds that transmit the virus to poultry, according to veterinarians and disease experts, who warn it… [+718 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Mylab Discovery Solutions and Thermo Fisher Scientific ink partnership to launch RT- PCR kits for infecti - Indiatimes.com", "description": "India Business News: PUNE: Thermo Fisher Scientific, the world leader in serving science, and Mylab, India’s leading biotech company, today announced a partnership to desi.", "url": "https://timesofindia.indiatimes.com/business/india-business/mylab-discovery-solutions-and-thermo-fisher-scientific-ink-partnership-to-launch-rt-pcr-kits-for-infectious-diseases-in-india/articleshow/97990655.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-02-16T17:52:00Z", "content": "FD Calculator\r\nWhen investing in a fixed deposit, the amount you deposit earns interest as per the prevailing...\r\nCalculate Now"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "Organ damage persists in almost 60 pc of long Covid patients a year after initial diagnosis: Study - The Siasat Daily", "description": "Scientists have found that organ damage persisted in 59 per cent of long Covid patients a year after initial symptoms, even in those", "url": "https://www.siasat.com/organ-damage-persists-in-almost-60-pc-of-long-covid-patients-a-year-after-initial-diagnosis-study-2528547/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/02/Covid-19-Virus.jpg", "publishedAt": "2023-02-16T16:53:00Z", "content": "London: Scientists have found that organ damage persisted in 59 per cent of long Covid patients a year after initial symptoms, even in those not severely affected when first diagnosed with the virus,… [+2905 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "HIV prevention model in Zambian prisons may be extended to other criminal justice facilities - News-Medical.Net", "description": "A recent study performed in Zambia by University of Maryland School of Medicine's Institute of Human Virology researchers found that high uptake of HIV preventative medicine, known as pre-exposure prophylaxis (PrEP), is possible in prison populations with ade…", "url": "https://www.news-medical.net/news/20230216/HIV-prevention-model-in-Zambian-prisons-may-be-extended-to-other-criminal-justice-facilities.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/HIV-620x480.jpg", "publishedAt": "2023-02-16T16:11:00Z", "content": "A recent study performed in Zambia by University of Maryland School of Medicine's (UMSOM) Institute of Human Virology researchers found that high uptake of HIV preventative medicine, known as pre-exp… [+6070 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Tired of sore throat? Try these home remedies to get relief from the burning sensation - India TV News", "description": "A sore throat can make some situations uncomfortable. Here are some easy-to-do home remedies to treat the irritating burning sensation.", "url": "https://www.indiatvnews.com/health/tired-of-sore-throat-try-these-home-remedies-to-get-relief-from-the-burning-sensation-health-tips-2023-02-16-847833", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/02/asdssasasaaaaasaas-1676560629.jpg", "publishedAt": "2023-02-16T15:24:21Z", "content": "A sore throat refers to throat pain, itchiness, or irritation. Throat pain is the primary symptom. The pain may get worse when you try to swallow, making it difficult to consume foods and liquids. Ev… [+2424 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Scientists reengineer cancer drugs to be more versatile - ANI News", "description": "Rice University scientists have enlisted widely used cancer therapy systems to control gene expression in mammalian cells, a feat of synthetic biology that could change how diseases are treated.", "url": "https://www.aninews.in/news/health/scientists-reengineer-cancer-drugs-to-be-more-versatile20230216203915", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230216150510.jpg", "publishedAt": "2023-02-16T15:09:47Z", "content": "Houston [US], February 16 (ANI): Rice University scientists have enlisted widely used cancer therapy systems to control gene expression in mammalian cells, a feat of synthetic biology that could chan… [+4451 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "AI analyzes cell movement under the microscope - Phys.org", "description": "The enormous amount of data obtained by filming biological processes using a microscope has previously been an obstacle for analyses. Using artificial intelligence (AI), researchers at the University of Gothenburg can now follow cell movement across time and …", "url": "https://phys.org/news/2023-02-ai-cell-movement-microscope.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ai-analyzes-cell-movem.jpg", "publishedAt": "2023-02-16T15:05:27Z", "content": "MAGIK reliably links trajectories in various experimental scenarios. a, Confocal microscopy of green fluorescent protein (GFP)-transfected GOWT1 mouse stem cells. MAGIK achieves an F1 score of 99.8% … [+4562 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Triglyceride-glucose index and triglyceride to high-density lipoprotein cholesterol ratio as potential cardiovascular disease risk factors: an analysis of UK biobank data - Cardiovascular Diabetology - Cardiovascular Diabetology", "description": "Background The triglyceride-glucose (TyG) index and triglyceride to high-density lipoprotein cholesterol (TG/HDL-C) ratio, two simple surrogate indicators of insulin resistance, have been demonstrated to predict cardiovascular disease (CVD). However, very few…", "url": "https://cardiab.biomedcentral.com/articles/10.1186/s12933-023-01762-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12933.jpg", "publishedAt": "2023-02-16T14:51:49Z", "content": null}, {"source": {"id": null, "name": "Indiashorts.com"}, "author": "Aditya Bhagchandani", "title": "Check out 3 common sources of Vitamin D - India Shorts", "description": "The fat-soluble  vitamin D, also referred to as the \"sunshine vitamin,\" is crucial for good health. It aids in the absorption of calcium and the maintenance of adequate serum concentrations of phosphate and magnesium, three nutrients vital for the he", "url": "https://indiashorts.com/check-out-3-common-sources-of-vitamin-d/107159/", "urlToImage": "https://indiashorts.com/wp-content/uploads/2023/02/Add-a-heading-2023-02-16T201957.178.jpg", "publishedAt": "2023-02-16T14:50:56Z", "content": "The fat-soluble  vitamin D, also referred to as the “sunshine vitamin,” is crucial for good health. It aids in the absorption of calcium and the maintenance of adequate serum concentrations of phosph… [+2343 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Hannah Mcdonald", "title": "A FIFTH of Brits have still never had Covid, officials estimate - Daily Mail", "description": "Nearly a fifth of people in England have still never caught Covid, ONS officials say. It means around 10.3million have dodged the virus since the pandemic began three years ago, in theory.", "url": "https://www.dailymail.co.uk/health/article-11758157/A-FIFTH-Brits-never-Covid-officials-estimate.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/16/13/67757305-0-image-a-9_1676554989689.jpg", "publishedAt": "2023-02-16T14:40:31Z", "content": "Nearly a fifth of people in England have still never caught Covid, top statisticians believe.\r\nIt means around 10.3million have managed to dodge the virus since the pandemic began three years ago, in… [+4814 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Rapid influenza tests may reduce antibiotic prescriptions, improve patient outcomes - Medical Dialogues", "description": "Rapid influenza diagnostic tests (RIDTs) may reduce antibiotic prescriptions, improve patient outcomes suggests  a new study published in the Clinical Infectious DiseasesThe potential benefits of...", "url": "https://medicaldialogues.in/medicine/news/rapid-influenza-tests-may-reduce-antibiotic-prescriptions-improve-patient-outcomes-107209", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/16/201835-nasopharyngealswab.jpg", "publishedAt": "2023-02-16T14:30:18Z", "content": "Rapid influenza diagnostic tests (RIDTs) may reduce antibiotic prescriptions, improve patient outcomes suggests a new study published in the Clinical Infectious DiseasesThe potential benefits of usin… [+2222 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "CBD shows promise for reducing smoking - ANI News", "description": "Cannabidiol, a non-psychoactive component of cannabis, slows nicotine metabolism, according to a recent research, which means it could assist tobacco users to control their desire for the next cigarette.", "url": "https://www.aninews.in/news/health/cbd-shows-promise-for-reducing-smoking20230216194352", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230216140514.jpg", "publishedAt": "2023-02-16T14:13:00Z", "content": "Washington [US], February 16 (ANI): Cannabidiol, a non-psychoactive component of cannabis, slows nicotine metabolism, according to recent research, which means it could assist tobacco users to contro… [+2343 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Stevia-based sweeteners environmentally friendly alternatives to sugar - Medical Dialogues", "description": "UK: A recent study published in The International Journal of Life Cycle Assessment has highlighted that stevia-based sweeteners reduce environmental impact when replacing sugar's sweetness. The...", "url": "https://medicaldialogues.in/medicine/news/stevia-based-sweeteners-environmentally-friendly-alternatives-to-sugar-107185", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/16/201879-sugar.jpg", "publishedAt": "2023-02-16T14:00:55Z", "content": "UK: A recent study published in The International Journal of Life Cycle Assessment has highlighted that stevia-based sweeteners reduce environmental impact when replacing sugar's sweetness. \r\nThe stu… [+2530 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Irregular sleep patterns tied to increased risk of atherosclerosis in older adults: JAHA - Medical Dialogues", "description": "USA: Among adults older than 45, sleep irregularity, specifically irregularity in sleep duration, is linked with several measures of subclinical atherosclerosis, says a recent study in the Journal...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/irregular-sleep-patterns-tied-to-increased-risk-of-atherosclerosis-in-older-adults-jaha-107183", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/16/201885-irregular-sleeping.jpg", "publishedAt": "2023-02-16T14:00:14Z", "content": "USA: Among adults older than 45, sleep irregularity, specifically irregularity in sleep duration, is linked with several measures of subclinical atherosclerosis, says a recent study in the Journal of… [+5746 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Relaxation of COVID-19 restrictions coincided with increase in asthma exacerbations - Healio", "description": "Adults with asthma experienced more exacerbations and acute respiratory infections after COVID-19 restrictions were relaxed, according to study results published in Thorax.&ldquo;The findings highlight the potential importance of public health measures like m…", "url": "https://www.healio.com/news/pulmonology/20230216/relaxation-of-covid19-restrictions-coincided-with-increase-in-asthma-exacerbations", "urlToImage": "https://www.healio.com/~/media/slack-news/pulmonology/misc/infographics/2023/pulm0223tydeman_graphic_01.jpg", "publishedAt": "2023-02-16T13:38:44Z", "content": "Adults with asthma experienced more exacerbations and acute respiratory infections after COVID-19 restrictions were relaxed, according to study results published in Thorax.\r\n“The findings highlight t… [+3809 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Can highly-transmissible Marburg disease spread from infected humans? | Mint - Mint", "description": "While the Marburg virus can be transmitted from human to human, it is not as easily transmissible as some other viruses like flu or coronavirus", "url": "https://www.livemint.com/news/world/can-highly-transmissible-marburg-disease-spread-from-infected-humans-11676550991307.html", "urlToImage": "https://images.livemint.com/img/2023/02/16/600x338/Marburg_1676553636413_1676553636561_1676553636561.jpg", "publishedAt": "2023-02-16T13:25:48Z", "content": "The outbreak of deadly Marburg disease, spread by Ebola-like Marburg virus, has been confirmed by Cameroon earlier this week. So far, 9 deaths and 16 suspected cases have been reported from the regio… [+2326 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Growth Plus Reports", "title": "(2022 - 2030) Diet Pills Market Size | Novo Nordisk A/S, Gelesis, Zoller Laboratories, GlaxoSmithKline plc, Ch - openPR", "description": "A recent market research report added to repository of Growth Plus Reports is an in depth analysis of global Diet Pills Market On the basis of historic growth analysis and current scenario of Diet Pills Market place the report intends ...", "url": "https://www.openpr.com/news/2934079/2022-2030-diet-pills-market-size-novo-nordisk-a-s-gelesis", "urlToImage": null, "publishedAt": "2023-02-16T13:01:00Z", "content": "A recent market research report added to repository of Growth Plus Reports is an in-depth analysis of global Diet Pills Market . On the basis of historic growth analysis and current scenario of Diet … [+4469 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Need for increased resource allocation and research to tackle India's paediatric cancer burden - ETHealthWorld", "description": "ETHealthworld spoke with experts who expressed their concerns about the stigma associated with childhood cancer as well as strategies adopted to reduce the disease's burden. India accounts for 20 per cent of the world’s childhood cancer burden, as per the Wor…", "url": "https://health.economictimes.indiatimes.com/news/industry/need-for-increased-resource-allocation-and-research-to-tackle-indias-paediatric-cancer-burden/97979739", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97979739,imgsize-1350398,width-1200,height-628,overlay-ethealthworld/need-for-increased-resource-allocation-and-research-to-tackle-india-s-paediatric-cancer-burden.jpg", "publishedAt": "2023-02-16T12:41:00Z", "content": "New Delhi: Cancer among children remains a major cause of concern globally. Despite staggering figures at the national level, India lacks a countrywide policy on paediatric cancer. Recently, the Nati… [+11515 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Surprising Health Benefits Of Dragon Fruit That You Had No Idea About - News18", "description": "Dragon fruit helps reduce the risk of diabetes and cancer. This superfood also benefits pre-diabetic patients.", "url": "https://www.news18.com/news/lifestyle/surprising-health-benefits-of-dragon-fruit-that-you-had-no-idea-about-7099471.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-1-407-167655008916x9.jpg", "publishedAt": "2023-02-16T12:21:55Z", "content": "Diabetes is a chronic disease, increasing rapidly all over the world. It occurs when the pancreas does not produce enough insulin, resulting in too much sugar in the blood. This, then, leads to an in… [+2020 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Do Eggs Really Increase Blood Cholesterol Levels? Know The Details - News18", "description": "A lot of people believe that eggs lead to high levels of bad cholesterol and hence avoid it", "url": "https://www.news18.com/news/lifestyle/do-eggs-really-increase-blood-cholesterol-levels-know-the-details-7098973.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-1-403-167654825416x9.jpg", "publishedAt": "2023-02-16T11:51:26Z", "content": "Eggs are a popular nutritious food in Indian kitchens. From sunny side up to bread omelette and anda bhurji, they are prepared in several different ways. Moreover, fitness enthusiasts love eggs as a … [+1990 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Rishika Verma", "title": "'Free Sugar' Intake Linked With Cardiovascular Disease; Study - Medical Dialogues", "description": "'Free Sugar' Intake Linked With Cardiovascular Disease; Study", "url": "https://medicaldialogues.in/photo-stories/free-sugar-intake-linked-with-cardiovascular-disease-study-261", "urlToImage": "https://medicaldialogues.in/h-upload/2023/02/16/201929-amp-stories-cover-9.jpg", "publishedAt": "2023-02-16T11:46:04Z", "content": "'FREE SUGAR' INTAKE LINKED WITH CARDIOVASCULAR DISEASE; STUDY"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Oral bacteria can increase risk of heart disease: Research - Zee News", "description": "Exclusive: Sensitive Teeth Creating Problems? Causes, Treatment, and Prevention Once the authors adjusted the results for known cardiovascular risk factors, they found that antibodies against F.", "url": "https://zeenews.india.com/health/oral-bacteria-can-increase-risk-of-heart-disease-research-2574081", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/02/16/1155124-heart-beat-pixabay.jpg", "publishedAt": "2023-02-16T11:36:18Z", "content": "A study published today in eLife suggests that infection with a bacterium that causes gum disease and foul breath may raise the risk of heart disease. The study advises that physicians check for othe… [+3069 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Central Drugs Laboratory in Kasauli releases vaccine for cervical cancer - Medical Dialogues", "description": "New Delhi: Three batches of approximately 80, 000 doses of HPV vaccine have been released by the Central Drugs Laboratory (CDL) in Kasauli, Himachal Pradesh, sources said to ANI.This is the first...", "url": "https://medicaldialogues.in/news/industry/pharma/central-drugs-laboratory-in-kasauli-releases-vaccine-for-cervical-cancer-107177", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/02/195780-vaccine-new-1.jpg", "publishedAt": "2023-02-16T10:43:03Z", "content": null}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Editor", "title": "Pune Doctor Saves Vision Of Yemeni Woman With Rare TB In Eyes - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/pune-doctor-saves-vision-of-yemeni-woman-with-rare-tb-in-eyes/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2020/12/Doctor.jpg", "publishedAt": "2023-02-16T10:32:19Z", "content": "Pune, 16th February 2023: Pune: You may be aware that tuberculosis (TB) affects the lungs. But, in an unusual case, a 21-year-old Yemeni woman was successfully treated for TB in the eyes (ocular TB).… [+3811 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "LIBA Capsules For Weight Loss “CAUTION” Read Before Buying - Deccan Herald", "description": "Liba Weight Loss Capsule Reviews Does it aid in finish your Weight Loss Goals or Fake hype? Take a look at this critical Review!", "url": "https://www.deccanherald.com/brandspot/pr-spot/liba-capsules-for-weight-loss-caution-read-before-buying-1191803.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1191803-1676542458.png", "publishedAt": "2023-02-16T10:14:18Z", "content": "Liba Weight Loss Capsule Reviews Does it aid in finish your Weight Loss Goals or Fake hype? Take a look at this critical Review!\r\nPhysical and mental health risks associated with being overweight is … [+32671 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Fatty Liver Disease? Alternate-day Fasting can Help, Research Claims - Zee News", "description": "University of Illinois Chicago nutrition researchers evaluated 80 persons with nonalcoholic fatty liver disease and discovered that those who followed an alternate-day fasting diet and exercised were able to improve their health.", "url": "https://zeenews.india.com/health/fatty-liver-disease-alternate-day-fasting-can-help-research-claims-2574029", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/02/16/1155070-fastimg-plate-pixabay.jpg", "publishedAt": "2023-02-16T10:08:09Z", "content": "Chicago: University of Illinois Chicago nutrition researchers evaluated 80 persons with nonalcoholic fatty liver disease and discovered that those who followed an alternate-day fasting diet and exerc… [+3466 chars]"}, {"source": {"id": null, "name": "Medical Device Network"}, "author": "GlobalData", "title": "Treating congenital heart disease - Medical Device Network", "description": "The outlook for congenital heart disease patients varies greatly due to the range of malformations and severities.", "url": "http://www.medicaldevice-network.com/comment/congenital-heart-disease/", "urlToImage": "https://www.medicaldevice-network.com/wp-content/uploads/sites/23/2023/02/featured-image-4.jpg", "publishedAt": "2023-02-16T10:03:31Z", "content": "Congenital heart disease (CHD) is caused by malformations in the heart of a newborn infant. If left untreated, it can pose a mortal risk. CHD occurs in 1% of births worldwide, with higher incidence a… [+2246 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Université de Montréal achieves a big step towards understanding autism - India Education Diary", "description": "In Fragile X syndrome (FXS), the most common cause of autism, sensory signals from the outside world are integrated differently, causing them to be underrepresented by cortical pyramidal neurons in the brain.That's the conclusion of a new study by a", "url": "https://indiaeducationdiary.in/universite-de-montreal-achieves-a-big-step-towards-understanding-autism/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/download-14.jpg?fit=300%2C168&ssl=1", "publishedAt": "2023-02-16T09:32:16Z", "content": "In Fragile X syndrome (FXS), the most common cause of autism, sensory signals from the outside world are integrated differently, causing them to be underrepresented by cortical pyramidal neurons in t… [+3633 chars]"}, {"source": {"id": null, "name": "Assamtribune.com"}, "author": "IANS", "title": "Neck pain from yoga? - The Assam Tribune", "description": "New Delhi, Feb 16: Misalignment and lack of awareness during practice or even everyday activities can lead to neck pain, which is very frequent. These include routine daily motions that require...", "url": "https://assamtribune.com/health-and-fitness/neck-pain-from-yoga-1462872", "urlToImage": "https://assamtribune.com/images/logo.png", "publishedAt": "2023-02-16T09:26:49Z", "content": "New Delhi, Feb 16: Misalignment and lack of awareness during practice or even everyday activities can lead to neck pain, which is very frequent. These include routine daily motions that require repet… [+4295 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "Is it sadness or depression? Here’s how to tell the difference - Health shots", "description": "Low mood, sadness, or depression are mental health conditions that are often confusing for people to understand. Here's how to differentiate between them.", "url": "https://www.healthshots.com/mind/mental-health/difference-between-sadness-or-depression/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/02/16125317/sad.jpg", "publishedAt": "2023-02-16T09:15:07Z", "content": "Covid-19 has altered people’s lives in unimaginable ways. Stress brought on by such a hectic environment, has the capacity to negatively affect our mood and state of mind. It may be common to feel do… [+4376 chars]"}, {"source": {"id": null, "name": "GQ India"}, "author": "Saumyaa Vohra", "title": "Foods to eat to prevent hair loss: 3 things to eat for healthier and fuller hair - GQ India", "description": "There are very many things you can do to promote hair growth; but there’s no replacement for eating the right foods to prevent hair loss. Here's what they are...", "url": "https://www.gqindia.com/look-good/content/foods-to-eat-to-prevent-hair-loss-3-things-to-eat-for-healthier-and-fuller-hair", "urlToImage": "https://assets.gqindia.com/photos/63ec8a2e8cf1216ecd02f83c/16:9/w_1280,c_limit/The-3-Things-You-Can-Eat-To-Prevent-Hair-Loss.jpg", "publishedAt": "2023-02-16T08:57:03Z", "content": "There are very many things you can do to promote hair growth, but theres no replacement for eating the right foods to prevent hair loss. Of course, you can take a host of measures to curb your hair l… [+2172 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Alberta researcher nears to discover how a brain molecule could halt MS - India Education Diary", "description": "A University of Alberta researcher is one step closer to demonstrating the potential of a brain molecule called fractalkine to halt and even reverse the effects of multiple sclerosis and other neurodegenerative diseases. Multiple sclerosis is an auto", "url": "https://indiaeducationdiary.in/university-of-alberta-researcher-nears-to-discover-how-a-brain-molecule-could-halt-ms/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Alberta.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2023-02-16T07:28:43Z", "content": "A University of Alberta researcher is one step closer to demonstrating the potential of a brain molecule called fractalkine to halt and even reverse the effects of multiple sclerosis and other neurod… [+2010 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Chest CT scans reveal lung abnormalities in patients 2 years after Covid: Study - The Week", "description": "Chest CT scans revealed persistent lung abnormalities in patients two years after COVID-19, according to a new study. Globally, more than 600 million people have recovered from COVID-19, but concerns remain that some organs", "url": "https://www.theweek.in/news/health/2023/02/16/chest-ct-scans-reveal-lung-abnormalities-in-patients-2-years-aft.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/sci-tech/2018/january/ct-scan-medical-technology-reu.jpg", "publishedAt": "2023-02-16T06:54:00Z", "content": "Chest CT scans revealed persistent lung abnormalities in patients two years after COVID-19, according to a new study.\r\nGlobally, more than 600 million people have recovered from COVID-19, but concern… [+3645 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "Rapid Screening Test Predicts Effectiveness Of Steroid Injections For Neck Pain - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-The unpleasant injections are a typical treatment for neck discomfort. Still, they can cost hundreds of dollars each, involve dangers, and only assist a small percentage of patients, ac…", "url": "http://bwhealthcareworld.businessworld.in/article/Rapid-Screening-Test-Predicts-Effectiveness-Of-Steroid-Injections-For-Neck-Pain/16-02-2023-465847", "urlToImage": "http://static.businessworld.in/article/article_large_image/1675246780_aoN0rC_stethoscope_6497490_960_720.jpg", "publishedAt": "2023-02-16T06:53:09Z", "content": "The unpleasant injections are a typical treatment for neck discomfort. Still, they can cost hundreds of dollars each, involve dangers, and only assist a small percentage of patients, according to res… [+4821 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Keto Clean Plus Gummies Canada {SCAM REVEALED 2023} Ingredients, Keto Clean Plus Reviews | Keto Clean Gummies Amazon & Ebay Price? - mid-day.com", "description": "Keto Clean Gummies: The Hot Selling Weight Loss Formula in the market. Get Results in 30 Days!", "url": "https://www.mid-day.com/brand-media/article/keto-clean-plus-gummies-canada-scam-revealed-2023-ingredients-keto-clean-plus-23270700", "urlToImage": "https://images.mid-day.com/images/images/2023/feb/Keto-Clean-for1_d.jpg", "publishedAt": "2023-02-16T06:11:00Z", "content": "Keto Clean Gummies: The Hot Selling Weight Loss Formula in the market. Get Results in 30 Days!\r\nObesity is the world's most serious health problem, and the treatment for it has only gotten worse sinc… [+10087 chars]"}, {"source": {"id": null, "name": "MobiHealthNews"}, "author": null, "title": "Mylab leverages Qure.ai's tech to enhance TB screening - Mobihealth News", "description": "Qure.ai's qXR software will enable Mylab's upcoming x-ray device to quickly detect TB.", "url": "https://www.mobihealthnews.com/news/asia/mylab-leverages-qureais-tech-enhance-tb-screening", "urlToImage": "https://www.mobihealthnews.com/sites/default/files/qxr-3.jpg", "publishedAt": "2023-02-16T04:34:27Z", "content": "Indian biotech company Mylab Discovery Solutions is integrating Qure.ai's AI technology into its upcoming x-ray device for screening tuberculosis.\r\nAccording to a press statement, MyBeam is a compact… [+1642 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Can loneliness increase your risk of diabetes? - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/wellness/can-loneliness-increase-your-risk-of-diabetes-111676473888330.html", "urlToImage": "https://images.livemint.com/img/2023/02/16/1140x641/Diabetes_1676508027311_1676508050135_1676508050135.jpg", "publishedAt": "2023-02-16T03:29:50Z", "content": "Loneliness and social isolation are likely to increase the risk of diabetes, researchers have found. A new study published in the British Medical Journal in early February explored the associations o… [+4430 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Top 5 Health Benefits Of Vitamin A - News18", "description": "Here’s your guide to the several health benefits of the vitamin, and how you can integrate it into your meals.", "url": "https://www.news18.com/news/lifestyle/top-5-health-benefits-of-vitamin-a-7091665.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/shutterstock_411910243-167613005316x9.jpg", "publishedAt": "2023-02-16T03:11:03Z", "content": "Vitamin A is critical for the proper functioning of various systems in the body, including vision, immune function, reproduction, and cellular communication. This fat-soluble nutrient is found in sev… [+2756 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Brain food important for your kid’s memory and sharpness - Hindustan Times", "description": "A nutritious, well-balanced diet is essential for your child's general health, including brain function. Adding these products listed here into your child's diet can offer the nutrients their brain requires for memory and sharpness or to grow and operate opti…", "url": "https://www.hindustantimes.com/lifestyle/health/brain-food-important-for-your-kid-s-memory-and-sharpness-101676515001921.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/02/16/1600x900/pexels-alex-green-5692215_1676515173023_1676515205801_1676515205801.jpg", "publishedAt": "2023-02-16T02:47:55Z", "content": "We all want our children to be active and healthy where nutrition is critical for the brain development of youngsters, as well as for focus and learning while certain meals, such as eggs, fatty fish,… [+3088 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 is associated with higher diabetes and hypertension risk - News-Medical.Net", "description": "In a recent study published in the journal JAMA Network Open, researchers determined new-onset diabetes, hypertension, and hyperlipidemia, all cardiometabolic disorders in adult coronavirus disease 2019 (COVID-19) patients under treatment in California, Unite…", "url": "https://www.news-medical.net/news/20230215/COVID-19-is-associated-with-higher-diabetes-and-hypertension-risk.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_739042_16765149819093884.jpg", "publishedAt": "2023-02-16T02:37:30Z", "content": "In a recent study published in the journal JAMA Network Open, researchers determined new-onset diabetes, hypertension, and hyperlipidemia, all cardiometabolic disorders in adult coronavirus disease 2… [+3845 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Nibedita Roy", "title": "6 Cholesterol lowering drinks you need to try today - Recipes", "description": "", "url": "https://recipes.timesofindia.com/web-stories/6-cholesterol-lowering-drinks-you-need-to-try-today/photostory/97927082.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97927525,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-02-16T02:37:30Z", "content": "This age-old remedy helps in lowering cholesterol levels easily, this is due to the presence of strong antioxidants, anti-inflammatory properties and coenzyme Q10, which helps in reducing high blood … [+139 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Rishabh Raj", "title": "World Cholangiocarcinoma Day: Symptoms, risk factors, and treatment - NewsBytes", "description": "World Cholangiocarcinoma Day is observed on the third Thursday of February every year", "url": "https://www.newsbytesapp.com/news/lifestyle/world-cholangiocarcinoma-day-know-what-it-is-and-other-details/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l32020230215165206.jpeg", "publishedAt": "2023-02-16T02:20:04Z", "content": "World Cholangiocarcinoma Day: Symptoms, risk factors, and treatment\r\nWorld Cholangiocarcinoma Day is observed on the third Thursday of February every year. \r\n The goal of observing this day is to bri… [+2291 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "More South American nations report bird flu cases; Brazil remains free - Devdiscourse", "description": "The confirmation of more bird flu cases in South America raised alarm bells in Brazil, which remains free of contagion even after its close neighbors Argentina and Uruguay confirmed cases there on Wednesday.  In a press conference to discuss the global sanita…", "url": "https://www.devdiscourse.com/article/headlines/2356135-more-south-american-nations-report-bird-flu-cases-brazil-remains-free", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/31_03_2019_23_34_38_8092661.jpg?width=920&format=jpeg", "publishedAt": "2023-02-15T20:32:30Z", "content": "The confirmation of more bird flu cases in South America raised alarm bells in Brazil, which remains free of contagion even after its close neighbors Argentina and Uruguay confirmed cases there on We… [+2458 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Protein degradation approach can be used to hit an ‘undruggable’ target against cancer - News-Medical.Net", "description": "The protein STAT5 has long been an appealing target against cancer, but after decades of research it was consigned to the \"undruggable\" category.", "url": "https://www.news-medical.net/news/20230215/Protein-degradation-approach-can-be-used-to-hit-an-e28098undruggablee28099-target-against-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_3f4ba59f12944a08a08f3d596bed291c-620x480.jpg", "publishedAt": "2023-02-15T19:53:00Z", "content": "The protein STAT5 has long been an appealing target against cancer, but after decades of research it was consigned to the \"undruggable\" category. Now, University of Michigan Rogel Cancer Center resea… [+3135 chars]"}, {"source": {"id": null, "name": "Lww.com"}, "author": null, "title": "Management of Acute Exacerbations of Chronic Obstructive... : Critical Care Medicine - LWW Journals", "description": "lyzed trends in the use of ventilatory support, corticosteroid therapy, antibiotic therapy, and patient survival.\r\r\nSetting: \r\r\nICUs at 32 French sites.\r\r\nPatients: \r\r\nOne thousand eight hundred sixteen patients in the database had a diagnosis of AECOPD.\r\r\nIn…", "url": "https://journals.lww.com/ccmjournal/fulltext/9900/management_of_acute_exacerbations_of_chronic.96.aspx", "urlToImage": "https://images.journals.lww.com/ccmjournal/SocialThumb.00003246-990000000-00096.F1.jpeg", "publishedAt": "2023-02-15T19:43:51Z", "content": "1 Medical Intensive Care Unit, Grenoble Alpes University Hospital, Grenoble, France.\r\n2 HP2 Laboratory, INSERM 1300, Grenoble Alpes University, Grenoble, France.\r\n3 Department of Biostatistics, Outco… [+3024 chars]"}, {"source": {"id": null, "name": "Grid.news"}, "author": "Jonathan Lambert", "title": "Malaria mosquitoes are spreading into new territory as climate warms - Grid", "description": "A new study shows how the health threats of a warming climate are already here.", "url": "https://www.grid.news/story/climate/2023/02/16/malaria-mosquitoes-are-moving-quickly-into-new-territory-as-climate-warms/", "urlToImage": "https://www.grid.news/resizer/a3qKSIvma_RkwiusvY63S_Nc29k=/1200x630/filters:format(jpg):quality(100)/cloudfront-us-east-1.images.arcpublishing.com/thesummit/RJU4R4RPRBF3VH7TN7BCQFQY7Q.jpg", "publishedAt": "2023-02-15T19:08:02Z", "content": "Mosquitoes that can transmit malaria have moved southward in Africa by more than 310 miles, on average, since the late 19th century, a rapid expansion of their range that is consistent with predictio… [+5010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Brain cells are biologically more ‘aged’ in people with cocaine addiction: Study - The Indian Express", "description": "The evidence suggested that these cells age faster in people with cocaine use disorder than in those without substance use disorders, the study said.", "url": "https://indianexpress.com/article/lifestyle/health/brain-cells-are-biologically-more-aged-in-people-with-cocaine-addiction-study-8446107/", "urlToImage": "https://images.indianexpress.com/2023/02/brain-cells.jpg", "publishedAt": "2023-02-15T15:00:35Z", "content": "Researchers have found evidence in humans that cells in Brodmann Area 9 in the brain, considered important for self-awareness and inhibitory control, appear biologically ‘older’ in people with cocain… [+4381 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "Memory Loss or Something More? Early Signs of Dementia - Sportskeeda", "description": "The early signs of dementia are something more than just normal memory loss.", "url": "https://www.sportskeeda.com/health-and-fitness/memory-loss-something-more-early-signs-dementia", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/02/283e5-16764713706044-1920.jpg", "publishedAt": "2023-02-15T14:52:00Z", "content": "The early signs of dementia are something more than just normal memory loss. Dementia is a progressive condition that exacerbates over time and can eventually interfere with a persons ability to perf… [+5192 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "High-salt diet leads to liver fibrosis with enterococcus pathway - Medical Dialogues", "description": "The results of a study published in the Microbiology Spectrum Journal found that high-salt diets (HSD) exacerbated liver injury and fibrosis compared to a normal diet (ND) via enterococcus induced...", "url": "https://medicaldialogues.in/gastroenterology/news/high-salt-diet-leads-to-liver-fibrosis-with-enterococcus-pathway-107139", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/14/198272-salt-2.jpg", "publishedAt": "2023-02-15T14:33:21Z", "content": "The results of a study published in the Microbiology Spectrum Journal found that high-salt diets (HSD) exacerbated liver injury and fibrosis compared to a normal diet (ND) via enterococcus induced ma… [+1936 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Natural and surgical menopause closely associated with kidney stone development - Medical Dialogues", "description": "A recent study published in the Annals of Epidemiology suggest that natural and surgical menopause are associated with kidney stone disease (KSD) in Asian population. However, postmenopausal...", "url": "https://medicaldialogues.in/urology/news/natural-and-surgical-menopause-closely-associated-with-kidney-stone-development-107081", "urlToImage": "https://medicaldialogues.in/h-upload/2020/02/18/124407-kidney-stone.jpg", "publishedAt": "2023-02-15T14:30:06Z", "content": "A recent study published in the Annals of Epidemiology suggest that natural and surgical menopause are associated with kidney stone disease (KSD) in Asian population. However, postmenopausal hormone … [+2048 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Pratiksha Trust signs MoU with IISc & Centre for Brain Research to accelerate breakthrough discoveries - Economic Times", "description": "The Pratiksha Trust has agreed to provide support to the CBR in perpetuity, with an initial outlay of about Rs 450 crore over the next 10 years, for research, innovation and translation. The Trust will also be supporting several ambitious, high-risk-high-rewa…", "url": "https://economictimes.indiatimes.com/news/science/pratiksha-trust-signs-mou-with-iisc-centre-for-brain-research-to-accelerate-breakthrough-discoveries/articleshow/97952220.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97952208,width-1070,height-580,imgsize-1593948,overlay-economictimes/photo.jpg", "publishedAt": "2023-02-15T12:39:00Z", "content": "Pratiksha Trust, led by Infosys co-founder Kris Gopalalakrishnan &amp; Sudha Gopalakrishnan couple, on Wednesday signed an MoU with the Indian Institute of Science (IISc) and the Centre for Brain Res… [+2956 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "6 Incredible health benefits of papaya seeds - Northeast Now", "description": "Papaya seeds contain vitamins and minerals including zinc, phosphorus, calcium, magnesium, iron, and calcium.", "url": "http://nenow.in/health/6-incredible-health-benefits-of-papaya-seeds.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/02/papaya-seeds.jpg", "publishedAt": "2023-02-15T12:37:41Z", "content": "Papaya is widely known for its nutritional value and health benefits that it contains but very few people are aware of the immensely beneficial papaya seeds that are usually thrown away. \r\nThe papaya… [+1562 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Cancer symptom: The condition in the mouth that can last for weeks; signs to note - Indiatimes.com", "description": "We often overlook our oral health. However, according to the World Health Organization (WHO), it is a key indicator of overall health, well-being and quality of life. Oral diseases are among the most common noncommunicable illnesses worldwide, affecting an es…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/cancer-symptom-the-condition-in-the-mouth-that-can-last-for-weeks-signs-to-note/photostory/97949507.cms", "urlToImage": "https://static.toiimg.com/photo/97949519.cms", "publishedAt": "2023-02-15T12:30:00Z", "content": "Leukoplakia refers to the thick, white patches that appear in the mouth. It can affect different areas in the mouth such as the gums, the insides of your cheeks, the bottom of your mouth and, sometim… [+691 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Modafinil vs Adderall - Strattera vs Adderall (Adderall Alternatives) - Deccan Herald", "description": "Are you in search of Adderall alternatives that can boost your cognitive performance without negative and harmful effects? There's an abundance of people who are on this search. There are approximately 2.5 million people are using Adderall in the United State…", "url": "https://www.deccanherald.com/brandspot/pr-spot/modafinil-vs-adderall-strattera-vs-adderall-adderall-alternatives-1191499.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1191499-1676463897.png", "publishedAt": "2023-02-15T12:24:57Z", "content": "Are you in search of Adderall alternatives that can boost your cognitive performance without negative and harmful effects? There's an abundance of people who are on this search. There are approximate… [+33590 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Scientists Design a Smart Necklace to Help You Quit Smoking | Weather.com - The Weather Channel", "description": "The necklace, called SmokeMon, tracks smoking by capturing heat signatures from thermal sensors.", "url": "https://weather.com/en-IN/india/health/news/2023-02-15-scientists-design-a-smart-necklace-to-help-you-quit-smoking", "urlToImage": "https://s.w-x.co/in-smoke_9.jpg", "publishedAt": "2023-02-15T12:14:26Z", "content": "A necklace that could help you stop smoking is now on the horizon. Northwestern Medicine researchers have developed a smart neck-worn device resembling a lapis blue pendant that detects a user's smok… [+1732 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Health Tips: 6 SIMPLE Lifestyle Changes to Keep Cancer at Bay - India.com", "description": "Health Tips to Prevent Cancer: Even though there is no definite way to prevent cancer, there are certain easy-to-do lifestyle changes to incorporate in life to reduce the risk of cancer", "url": "https://www.india.com/health/health-tips-6-simple-lifestyle-changes-to-keep-cancer-at-bay-5898935/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/02/Cancer-Treatment.jpg", "publishedAt": "2023-02-15T10:51:13Z", "content": "Health Tips to Prevent Cancer: Even though there is no definite way to prevent cancer, there are certain easy-to-do lifestyle changes to incorporate in life to reduce the risk of cancer\r\nHealth Tips:… [+2172 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How a pioneering diabetes drug offers hope for preventing autoimmune disorders - Nature.com", "description": "The approval of an antibody therapy that pauses the progression of type 1 diabetes is a first in the field, and some say a model for other drug developers.", "url": "https://www.nature.com/articles/d41586-023-00400-x", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00400-x/d41586-023-00400-x_24020656.jpg", "publishedAt": "2023-02-15T10:11:08Z", "content": "Her sisters life-threatening experience with diabetes was a wake-up call for Mikayla Olsten.\r\nIn 2016, when Olsten was 14 years old, her youngest sibling Mia landed in intensive care with failing kid… [+15959 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Targeting microbiome can improve child undernutrition: Research - ETHealthWorld", "description": "The gut microbiome is a collective term for the trillions of different microbes living within the human gut, which are essential for developmental processes in early life, such as building immunity, hormone production and metabolism of certain nutrients.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/targeting-microbiome-can-improve-child-undernutrition-research/97941749", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97941749,imgsize-31180,width-1200,height-628,overlay-ethealthworld/targeting-microbiome-can-improve-child-undernutrition-research.jpg", "publishedAt": "2023-02-15T08:35:00Z", "content": "Washington: Research led by the Queen Mary University of London suggests that nutritional interventions used to tackle child undernutrition in lower and middle-income countries should target gut micr… [+3312 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "AI With Infrared Imaging Enables Precise Colon Cancer Diagnostics - Technology Networks", "description": "Researchers are using artificial intelligence in combination with infrared imaging to optimally tailor colon cancer therapy to individual patients.", "url": "https://www.technologynetworks.com/diagnostics/news/ai-with-infrared-imaging-enables-precise-colon-cancer-diagnostics-370211", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/370211/ai-with-infrared-imaging-enables-precise-colon-cancer-diagnostics-370211-640x360.jpg?cb=20230215", "publishedAt": "2023-02-15T08:32:46Z", "content": "The immense progress in the field of therapy options over the past years has significantly improved the chances of cure for patients with colon cancer. However, these new approaches, such as immunoth… [+4402 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Tanvi Mayur Patel", "title": "What have hormones got to do with diabetes? Everything! - Health shots", "description": "Do diabetes and hormone imbalance have a link? Apparently, yes, at every age and stage of life. A doctor tells you all about it.", "url": "https://www.healthshots.com/preventive-care/self-care/what-have-hormones-got-to-do-with-diabetes-everything/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/02/15132336/Diabetes-9.jpg", "publishedAt": "2023-02-15T08:02:29Z", "content": "Not many people know that diabetes is also called a disease of the endocrine system. The endocrine system consists of eight glands, each of which produces a different hormone. These hormones catalyse… [+4775 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Economic impact of TB does not end with completion of treatment: Study - BSI bureau", "description": "Economic impact of TB does not end with completion of TB treatment: Study", "url": "https://www.biospectrumindia.com/news/98/22636/economic-impact-of-tb-does-not-end-with-completion-of-treatment-study.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/tb-22636.png", "publishedAt": "2023-02-15T06:18:24Z", "content": "India has a long way to reach Zero Catastrophic Costs goal for TB patients: Suggests study by The George Institute for Global Health\r\nA recent study led by Dr Susmita Chatterjee from The George Insti… [+1838 chars]"}, {"source": {"id": null, "name": "Bharattimes.co.in"}, "author": null, "title": "Exclusive: Dental Hygiene Tips – Should you Brush After or Before Breakfast, What's the Verdict? - English Bharat Times", "description": "", "url": "https://eng.bharattimes.co.in/exclusive-dental-hygiene-tips-should-you-brush-after-or-before-breakfast-whats-the-verdict/", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/02/15/1154286-brush-teeth-pixabay.jpg", "publishedAt": "2023-02-15T06:03:14Z", "content": "Dental hygiene is very important and something as simple as brushing your teeth can go a long way in keeping your teeth healthy. Dr Nirali Patel, Smile Design Specialist and Oral Implantologist FICOI… [+4159 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How You Can Slow Down The Effects Of Ageing - News18", "description": "Inculcating these lifestyle tips and tricks into your daily routine and do you a world of good, read on to know more-", "url": "https://www.news18.com/news/lifestyle/how-you-can-slow-down-the-effects-of-ageing-7078195.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/untitled-design-2023-02-14t211250.102-167638940216x9.png", "publishedAt": "2023-02-15T04:00:40Z", "content": "The natural process of ageing starts from the moment we are born and cannot be stopped. This doesnt mean that ageing cant be slowed down. People who live a healthier lifestyle tend to age slower than… [+3136 chars]"}]}