{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "WHO Warns of Surge in Chronic Disease by 2030 If People Don't Start Exercising - Gizmodo", "description": "Most countries aren't doing enough to help people stay active, such as building safer walkable roads, the WHO report finds.", "url": "https://gizmodo.com/who-warns-of-surge-in-chronic-disease-by-2030-if-people-1849673225", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/5b9ce39b506b070071ed64bc7bb879d2.jpg", "publishedAt": "2022-10-18T22:01:00Z", "content": "A new report from the World Health Organization finds that our collective lack of exercise will exact a heavy toll in the years to come if nothing changes. The report estimates that there will be nea… [+3874 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "After lifetime of blindness, newly sighted can immediately identify human locomotion - Medical Xpress", "description": "Humans are highly sensitive to the bodily movement of other people. Our ability to comprehend body language is crucial to our social thriving, providing information on emotion and behavioral predictions through subtle cues.", "url": "https://medicalxpress.com/news/2022-10-lifetime-newly-sighted-immediately-human.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/after-lifetime-of-blin.jpg", "publishedAt": "2022-10-18T21:20:04Z", "content": "Humans are highly sensitive to the bodily movement of other people. Our ability to comprehend body language is crucial to our social thriving, providing information on emotion and behavioral predicti… [+5928 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Your Mind Wanders Because Your Brain Whispers - Neuroscience News", "description": "Daydreaming activates the hippocampus, inducing electrical impulses that help us to encode memories.", "url": "https://neurosciencenews.com/daydreaming-memory-hippocampus-21669/", "urlToImage": "https://neurosciencenews.com/files/2022/10/brain-whisper-neurosices-public.jpg", "publishedAt": "2022-10-18T20:48:00Z", "content": "Summary: Daydreaming activates the hippocampus, inducing electrical impulses that help us to encode memories.\r\nSource: University of Oslo\r\nYou are sitting in a meeting at work and your mind starts to… [+5991 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Groups highlight importance of physical activity on World Pediatric Bone and Joint Day - Healio", "description": "It is crucial that patients with juvenile arthritis stay active throughout their childhood for a better chance at building stronger bones, according to DMOS Orthopaedic Centers.", "url": "https://www.healio.com/news/rheumatology/20221018/groups-highlight-importance-of-physical-activity-on-world-pediatric-bone-and-joint-day", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/rheumatology/a/arthritischild_83964405.jpeg", "publishedAt": "2022-10-18T20:37:48Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nIt is crucial that patients with juvenil… [+2167 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Leah Goggins", "title": "Researchers Figured Out Why Some Folks Feel Worse After Eating Fiber—Here's Why That's Important - EatingWell", "description": "The new research points to exciting things on the horizon for folks with IBD.", "url": "https://www.eatingwell.com/article/8007538/research-eating-fiber-ibd-symptoms/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=1244&h=622&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2020%2F03%2F27%2Fgarlic-parmesan-asparagus.jpg", "publishedAt": "2022-10-18T19:18:05Z", "content": "There are plenty of reasons why dietary fiber has such a good reputation. It can help you feel more satisfied after a snack or meal, support your healthy gut bacteria and even help keep you regular. … [+2644 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Dr Sudheer Reddy", "title": "Reverse Diabetes with a combination of homeopathy and nutrition - The Hans India", "description": "Diabetes has become the most common disorder of the decade, with 40% of the world’s population...", "url": "https://www.thehansindia.com/life-style/health/reverse-diabetes-with-a-combination-of-homeopathy-and-nutrition-765930", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/10/18/1316924-ho.jpg", "publishedAt": "2022-10-18T19:06:43Z", "content": "Diabetes has become the most common disorder of the decade, with 40% of the world's population suffering from Diabetes diagnosed or undiagnosed, along with other metabolic disorders put together. Ind… [+4117 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "3 Reasons To Consume Apple Cider Vinegar Empty Stomach - Slurrp", "description": "Do you drink apple cider vinegar in the morning?", "url": "https://www.slurrp.com/article/3-reasons-to-consume-apple-cider-vinegar-empty-stomach-1666117669316", "urlToImage": "https://images.slurrp.com/prodarticles/3md2nlchhpr.webp", "publishedAt": "2022-10-18T18:44:55Z", "content": "apple cider vinegar/ unsplash.com\r\nAids Weight Loss\r\nStudies on humans have found that vinegar can make people feel more satisfied. This may result in consuming fewer calories and shedding pounds. Fo… [+854 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "Monkeypox Scare: Virus detected in testes of non-human primate survivors - India TV News", "description": "Monkeypox Scare: As the virus can be transmitted through direct contact with bodily fluids and skin lesions, understanding the biology of monkeypox infection of the testes and virus shedding in semen has substantial public health implications.", "url": "https://www.indiatvnews.com/health/monkeypox-scare-virus-detected-in-testes-of-non-human-primate-survivors-2022-10-18-817261", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/10/monkeypox-7-1666116905.jpg", "publishedAt": "2022-10-18T18:23:58Z", "content": "Monkeypox Scare: A team of researchers has detected the monkeypox virus in the testes of macaques during the infection's acute phase. The study, published in the journal Nature Microbiology, indicate… [+2076 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Supercharging Brain Stimulation by Repurposing an Antibiotic - Neuroscience News", "description": "D-Cycloserine, an antibiotic used for the treatment of tuberculosis, increases the effectiveness of transcranial magnetic stimulation for those with major depressive disorder.", "url": "https://neurosciencenews.com/depression-tms-antibiotic-21667/", "urlToImage": "https://neurosciencenews.com/files/2022/10/antibiotics-brain-stimulation-neurosicence-public.jpg", "publishedAt": "2022-10-18T18:23:21Z", "content": "Summary: D-Cycloserine, an antibiotic used for the treatment of tuberculosis, increases the effectiveness of transcranial magnetic stimulation for those with major depressive disorder.\r\nSource: Unive… [+6232 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Diabetes drug that causes weight loss: But should people without diabetes use it? - WCNC", "description": "Dr. Payal Kohli, the Verify medical expert, responds to WCNC Charlotte Verify Reporter Meghan Bragg's questions about a diabetes drug that's found massive of...", "url": "https://www.youtube.com/watch?v=2lo1Y9Us9ms", "urlToImage": "https://i.ytimg.com/vi/2lo1Y9Us9ms/maxresdefault.jpg", "publishedAt": "2022-10-18T17:15:03Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Debosmita Ghosh", "title": "Is it safe to follow a low-sodium diet? Know the pros and cons of the diet - Times Now", "description": "While it might be good for some to follow this diet, it might not be the best option for others. Low-sodium diets are usually recommended for people who have high blood pressure or chronic kidney disease or similar health conditions.", "url": "https://www.timesnownews.com/health/is-it-safe-to-follow-a-low-sodium-diet-know-the-pros-and-cons-of-the-diet-article-94950310", "urlToImage": "https://static.tnn.in/thumb/msid-94950310,imgsize-100,width-1280,height-720,resizemode-75/94950310.jpg", "publishedAt": "2022-10-18T17:09:03Z", "content": "Consuming sodium in limited amounts is not bad for your health, however, when you eat high amounts, it can turn out to be bad for your health."}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research: Tests for carbon monoxide poisoning shouldn't be used - ANI News", "description": "Berlin [Germany], October 18 (ANI): According to a systematic review and meta-analysis published today (Tuesday) at the European Emergency Medicine Congress, pulse oximetry is an unreliable approach for identifying persons who are suffering from carbon monoxi…", "url": "https://www.aninews.in/news/science/research-tests-for-carbon-monoxide-poisoning-shouldnt-be-used20221018223824", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221018170738.jpg", "publishedAt": "2022-10-18T17:08:00Z", "content": "Berlin [Germany], October 18 (ANI): According to a systematic review and meta-analysis published today (Tuesday) at the European Emergency Medicine Congress, pulse oximetry is an unreliable approach … [+3997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Hair straighteners may pose a small risk for uterine cancer, study finds - The Indian Express", "description": "The study did not establish a cause-and-effect relationship between hair straighteners and cancer of the uterus, a form of reproductive cancer that has been increasing in incidence among women in recent years, especially among Black women", "url": "https://indianexpress.com/article/lifestyle/health/hair-straighteners-may-pose-small-risk-uterine-cancer-study-finds-8215053/", "urlToImage": "https://images.indianexpress.com/2022/10/hair-straightener.jpg", "publishedAt": "2022-10-18T17:00:30Z", "content": "Women who use chemical hair straighteners frequently could have a higher risk of developing uterine cancer than women who have never used the products, according to new findings from a national study… [+2284 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "More than 600 Indian scientists, experts sign declaration to fully fund polio eradication strategy - The Indian Express", "description": "The declaration was signed by more than 3,000 scientists, physicians and public health experts around the world to endorse the 2022-2026 strategy.", "url": "https://indianexpress.com/article/cities/pune/polio-eradication-strategy-fund-declaration-indian-scientists-experts-8216880/", "urlToImage": "https://images.indianexpress.com/2022/10/Untitled-design-89.jpg", "publishedAt": "2022-10-18T16:28:22Z", "content": "No place is safe until polio has been eradicated everywhere and more than 600 scientists and experts from the country signed the Global Polio Eradication Initiatives declaration that was released Tue… [+3114 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers discover new approach into lithium’s effectiveness for bipolar disorder - ThePrint", "description": "Philadelphia [US], October 18 (ANI): Bipolar disorder, a neuropsychiatric illness characterised by manic and depressed episodes, affects around 1 per cent of the population and is heavily impacted by heredity. Approximately half of patients respond extremely …", "url": "https://theprint.in/health/researchers-discover-new-approach-into-lithiums-effectiveness-for-bipolar-disorder/1173572/", "urlToImage": null, "publishedAt": "2022-10-18T16:13:42Z", "content": "Philadelphia [US], October 18 (ANI): Bipolar disorder, a neuropsychiatric illness characterised by manic and depressed episodes, affects around 1 per cent of the population and is heavily impacted by… [+2970 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Psoriasis not an independent risk factor for heart attack among patients of end-stage illness, says reaseac... - Zee News", "description": "The study published in The American Journal of the Medical Sciences reveals that psoriasis does not affect heart attack risks in patients with deadly cancer illnesses. There are a lot of things that contribute to MI and our target population has a lot of them…", "url": "https://zeenews.india.com/health/psoriasis-not-an-independent-risk-factor-for-heart-attack-among-patients-of-end-stage-illness-says-reaseach-2523827", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/18/1105230-psoriasis.jpg", "publishedAt": "2022-10-18T15:20:00Z", "content": "The study published in The American Journal of the Medical Sciences reveals that psoriasis does not affect heart attack risks in patients with deadly cancer illnesses. \"There are a lot of things that… [+4874 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Jeanna D. Smiley", "title": "Nicotine and estrogen: Why it's harder for women to quit smoking - Medical News Today", "description": "New research indicates that the amount of nicotine found in a single cigarette could be enough to block estrogen production in the female brain.", "url": "https://www.medicalnewstoday.com/articles/quitting-smoking-why-nicotines-estrogen-blocking-effect-makes-it-more-difficult", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/10/women-smoke-studio-quitting-thumb.jpg", "publishedAt": "2022-10-18T15:18:04Z", "content": "<ul><li>Tobacco consumption, especially cigarette smoking, is the leading cause of preventable disease\r\n mortality in the United States.</li><li>Research shows that women tend to have a harder time q… [+6518 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Adalimumab use in RA not linked to increased MACE and VTE compared to JAK inhibitors - Medical Dialogues", "description": "Researchers have found in a new study that  risks for major adverse cardiac events and  venous...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/adalimumab-use-in-ra-not-linked-to-increased-mace-and-vte-compared-to-jak-inhibitors-100776", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/13/187887-download-49.jpg", "publishedAt": "2022-10-18T15:00:26Z", "content": "Researchers have found in a new study that risks for major adverse cardiac events and venous thromboembolism in patients with rheumatoid arthritis did not significantly differ between those receiving… [+1878 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by India TV Lifestyle Desk", "title": "DYK diabetes can affect our memory? Know these lifestyle tips to manage it - India TV News", "description": "studies have found that diabetes can cause dementia. Though it is not always the case, being aware of the connection between diabetes and memory loss can help everyone understand how to treat and prevent these disorders.", "url": "https://www.indiatvnews.com/health/dyk-diabetes-can-affect-our-memory-know-these-lifestyle-tips-to-manage-it-2022-10-18-817213", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/10/dfsied-1666104421.jpg", "publishedAt": "2022-10-18T14:51:44Z", "content": "Illnesses like type 2 diabetes and cognitive impairment are very common. In recent years, studies have found that diabetes can cause dementia. Though it is not always the case, being aware of the con… [+2440 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "A new strategy delivering immunotherapy medicines to treat cancer underway - Zee News", "description": "The study was led by researchers from the University of Rhode Island and Yale University and the findings were published in the journal Frontiers in Oncology.", "url": "https://zeenews.india.com/health/a-new-strategy-delivering-immunotherapy-medicines-to-treat-cancer-underway-2523806", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/18/1105215-cancer-1.jpg", "publishedAt": "2022-10-18T14:40:54Z", "content": "The study was led by researchers from the University of Rhode Island and Yale University and the findings were published in the journal Frontiers in Oncology. The approach involves tethering an immun… [+6559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Oops! You may have been cooking veggies the wrong way - The Indian Express", "description": "\"High vegetable intake has been linked to a decreased risk of hypertension, heart attacks, strokes, cataracts, macular degeneration, cognitive decline, and malignancies of the digestive system,\" said Neha Pathania, Senior Dietician, Paras Hospitals", "url": "https://indianexpress.com/article/lifestyle/food-wine/are-you-cooking-your-veggies-the-right-8064245/", "urlToImage": "https://images.indianexpress.com/2022/08/tips.jpg", "publishedAt": "2022-10-18T14:30:34Z", "content": "It is extremely important to eat a variety of vegetables, that comes loaded with numerous nutrients, to ensure good health. “High vegetable intake has been linked to a decreased risk of hypertension,… [+3259 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Exipure Reviews: Is Exipure Weight Loss Supplement Worth the Money? - Hindustan Times", "description": "Exipure is the only product in its category that includes a combination of eight exotic herbs and nutrients intended particularly to target poor brown adipose tissue for weight reduction", "url": "https://www.hindustantimes.com/brand-stories/exipure-reviews-is-exipure-weight-loss-supplement-worth-the-money-101666102119740.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/18/1600x900/IMG_7788_1666102761747_1666102768199_1666102768199.jpg", "publishedAt": "2022-10-18T14:23:01Z", "content": "Obesity has been increasing for many years. With lack of exercise, poor eating habits from junk food, and unpredictable work hours all contributing to this trend, it seems certain that similar instan… [+10850 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Dual or single SGLT inhibition, which is more beneficial for type 2 diabetes? Study sheds light - Medical Dialogues", "description": "In type 2 diabetes patients, the study did not indicate different clinical impacts of dual and...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/dual-or-single-sglt-inhibition-which-is-more-beneficial-for-type-2-diabetes-study-sheds-light-100704", "urlToImage": "https://medicaldialogues.in/h-upload/2021/05/15/153437-sglt2-inhibitors.jpg", "publishedAt": "2022-10-18T14:00:20Z", "content": "In type 2 diabetes patients, the study did not indicate different clinical impacts of dual and single SGLT inhibition.Germany: Inhibition of sodium-glucose cotransporters (SGLTs) improves cardiovascu… [+3565 chars]"}, {"source": {"id": null, "name": "Thecardiologyadvisor.com"}, "author": "Emily Estrada", "title": "Patient-Defined Goals Support Tailored Approaches to Claudication Treatment Selection - The Cardiology Advisor", "description": "Researchers assessed patient-reported treatment goals in patients with claudication and the relationships between patient characteristics and clinical outcomes.", "url": "https://www.thecardiologyadvisor.com/home/topics/vascular-medicine/patient-defined-goals-support-tailored-approaches-to-claudication-treatment-selection/", "urlToImage": null, "publishedAt": "2022-10-18T13:54:00Z", "content": "Patients with peripheral artery disease (PAD) and claudication define their symptoms and treatment goals via improvements in walking distance, duration, or speed, as well as in a variety of activitie… [+3789 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Boston University claims to have produced new Covid strain with 80 per cent kill rate. Details here - Economic Times", "description": "Boston University's scientists produced a new COVID strain that is highly potent and has an 80 per cent probability of killing an infected mammal.", "url": "https://economictimes.indiatimes.com/news/international/us/boston-university-claims-to-have-produced-new-covid-strain-with-80-per-cent-kill-rate-details-here/articleshow/94946211.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94946290,width-1070,height-580,imgsize-15960,overlay-economictimes/photo.jpg", "publishedAt": "2022-10-18T13:00:00Z", "content": "The tests were carried out on mice, and unlike the old standard Omicron strain, the mice just suffered mild symptoms when exposed to the virus. This new strain of COVID-19 is a hybrid variety created… [+1420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Why should healthy teens wear masks this Diwali? Because pollutants can cause irregular heart beats - The Indian Express", "description": "A recent study published by the American Heart Association says air pollution may cause  teens’ hearts to skip a beat within two hours after  exposure to air pollution. 'Toxic chemicals are carried into the lungs and thereon into the bloodstream, which can ca…", "url": "https://indianexpress.com/article/lifestyle/health-specials/diwali-masks-teens-pollutants-irregular-heart-beats-8216563/", "urlToImage": "https://images.indianexpress.com/2022/10/diwali-masks.jpg", "publishedAt": "2022-10-18T12:58:02Z", "content": "Air pollution or breathing in particulate matter triggers an irregular heart rhythm among adolescents within two hours of exposure. And we know how reducing the risk of irregular heart rhythms known … [+5638 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Java Burn Customers Reviews (CAREFUL! 2022) - Deccan Herald", "description": "Java Burn Customers Review: A new weight loss supplement that helps to enhance the overall functioning of the body", "url": "https://www.deccanherald.com/brandspot/pr-spot/java-burn-customers-reviews-careful-2022-1154700.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154700-1666095117.png", "publishedAt": "2022-10-18T12:11:57Z", "content": "Java Burn Customers Review: A new weight loss supplement that helps to enhance the overall functioning of the body\r\nThere are numerous weight loss options, but many of us do not pay attention to them… [+17527 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Low-dose aspirin does not reduce breast cancer risk - Healio", "description": "GENEVA &mdash; Women who used low-dose aspirin did not exhibit reduced risk for breast cancer, according to study results presented at World Cancer Congress.The results aligned with the hypothesis of investigators, who observed a similar finding in a prior st…", "url": "https://www.healio.com/news/hematology-oncology/20221018/lowdose-aspirin-does-not-reduce-breast-cancer-risk", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/cardiology/a/aspirin.jpg", "publishedAt": "2022-10-18T12:03:13Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nGENEVA — Women who used low-dose aspirin… [+2688 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Kajal Rajput", "title": "Accelerating action for Cervical Cancer Mukt Bharat: Gynaecologists body demands HPV vaccine be added to... - Medical Dialogues", "description": "Even though cervical cancer is entirely preventable with the HPV vaccine and regular screening, it...", "url": "https://medicaldialogues.in/news/health/accelerating-action-for-cervical-cancer-mukt-bharat-gynaecologists-body-demands-hpv-vaccine-be-added-to-national-program-100839", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/18/188298-untitled-design-3.jpg", "publishedAt": "2022-10-18T12:00:30Z", "content": "New Delhi: In a bid to reduce the burden of cervical cancer major death-causing disease among women, which continues to kill more than 77,000 women in India annually. The Federation of Obstetric and … [+5580 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Long live, liver: Transplanted subset of the organ can have an age of over 100 years - Times Now", "description": "The researchers said they studied these livers to identify characteristics to determine why these organs are so resilient, paving the way for considering the potential expanded use of older liver donors.", "url": "https://www.timesnownews.com/health/long-live-liver-transplanted-subset-of-the-organ-can-have-an-age-of-over-100-years-article-94942990", "urlToImage": "https://static.tnn.in/thumb/msid-94942990,imgsize-100,width-1280,height-720,resizemode-75/94942990.jpg", "publishedAt": "2022-10-18T11:20:49Z", "content": "Of 253,406 livers transplanted between 1990-2022, 25 livers met the criteria of being centurion livers --those with a cumulative age over 100 years."}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "New study identifies gene that accelerates colon cancer - mid-day.com", "description": "The researchers have discovered that the environment around a colon cancer tumour can programme what is known as a \"super enhancer,\" regulates the gene PDZK1IP1, which was previously not identified as a cancer gene", "url": "http://www.mid-day.com/lifestyle/health-and-fitness/article/new-study-identifies-gene-that-accelerates-colon-cancer-23251045", "urlToImage": "https://images.mid-day.com/images/images/2022/oct/cancer-istock_d.jpg", "publishedAt": "2022-10-18T11:17:00Z", "content": "The researchers have discovered that the environment around a colon cancer tumour can programme what is known as a \"super enhancer,\" regulates the gene PDZK1IP1, which was previously not identified a… [+2239 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Jaime Rosenberg", "title": "Patients With Asthma, Other Allergic Diseases May Have Higher Prevalence of EoE - AJMC.com Managed Markets Network", "description": "While the prevalence of eosinophilic esophagitis (EoE) is estimated to be 0.5% in the general population, a recent study found that the prevalence was as high as 16.5% in patients with allergic disease.", "url": "https://www.ajmc.com/view/patients-with-asthma-other-allergic-diseases-may-have-higher-prevalence-of-eoe", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/b0c32b5f101917559c58f7431251cf8755689322-1200x1302.jpg?fit=crop&auto=format", "publishedAt": "2022-10-18T11:16:59Z", "content": "Patients with allergic disease may be more likely than the general population to have eosinophilic esophagitis (EoE), researchers have found.\r\nIn their study of adults with allergic rhinitis, asthma,… [+3202 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Air pollution from factories, vehicles risks higher mortality in lung disease patients: Study | Mint - Mint", "description": "The study has linked the chemical composition of fine particulate air pollution to worsened fibrotic interstitial lung disease (fILD) outcomes", "url": "https://www.livemint.com/news/air-pollution-factories-vehicles-higher-mortality-lung-disease-patients-study-11666089195798.html", "urlToImage": "https://images.livemint.com/img/2022/10/18/600x338/Pollution-10_1666089434716_1666089434716_1666089448596_1666089448596.jpg", "publishedAt": "2022-10-18T10:38:44Z", "content": "People who have lung diseases and are living in areas with increased levels of air pollution from industries and vehicles are at a higher mortality risk, a study has said. The study was published in … [+2078 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "Waking Up Tired? Follow These Simple Tips - Pragativadi", "description": "New Delhi: Most people wake up tired now and then, and waking up tired occasionally is not usually a cause for concern. Even small changes to your routines can boost your mood and energy. Little tweaks can help you get the shut-eye you need, too. Whe", "url": "https://pragativadi.com/waking-up-tired-follow-these-simple-tips/", "urlToImage": "https://pragativadi.com/core/uploads/2022/08/Untitled-design-2022-08-31T164820.974.png", "publishedAt": "2022-10-18T10:20:40Z", "content": "New Delhi: Most people wake up tired now and then, and waking up tired occasionally is not usually a cause for concern. Even small changes to your routines can boost your mood and energy. Little twea… [+1653 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Papaya Leaves to Pomegranate, 5 Foods That Can Help You Recover From Dengue Fever - News18", "description": "A very important component of the recovery process is the diet.", "url": "https://www.news18.com/news/lifestyle/papaya-leaves-to-pomegranate-5-foods-that-can-help-you-recover-from-dengue-fever-6190525.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/dengue-ians-1-1-1-166608784816x9.jpg", "publishedAt": "2022-10-18T10:08:20Z", "content": "The dengue fever, which often strikes us during this season, causes platelets to deplete rapidly, leading to problems such as high fever, headache, vomiting, and muscle and joint pain. People also ob… [+1850 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Increased use of dairy and milk diet linked to higher risk of stroke and angina mortality: Study - Medical Dialogues", "description": "NORWAY: According to research published in the European Journal of Preventive Cardiology,...", "url": "https://medicaldialogues.in/diet-nutrition/news/increased-use-of-dairy-and-milk-diet-linked-to-higher-risk-of-stroke-and-angina-mortality-study-100832", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/17/185765-dairy-products.jpg", "publishedAt": "2022-10-18T10:00:19Z", "content": "NORWAY: According to research published in the European Journal of Preventive Cardiology, individuals with stable angina who consumed more milk and other dairy products had a higher risk of stroke an… [+3011 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Get to know avian flu, the disease afflicting TikTok's most famous emu, Emmanuel - Economic Times", "description": "This disease is caused by the influenza A virus.", "url": "https://economictimes.indiatimes.com/magazines/panache/decoding-avian-flu-the-disease-afflicting-tiktoks-most-famous-emu-emmanuel/articleshow/94939476.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94940064,width-1070,height-580,imgsize-60134,overlay-etpanache/photo.jpg", "publishedAt": "2022-10-18T09:13:00Z", "content": "Marta Hernández-Jover, Professor in Veterinary Epidemiology and Public Health, Charles Sturt University, Bathurst, New South Wales: TikTok celebrity Emmanuel - an emu who gained a vast online followi… [+4806 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra, Times Now Digital", "title": "Foods that are top enemies of cholesterol - Times Now", "description": "Foods that are top enemies of cholesterol", "url": "https://www.timesnownews.com/web-stories/health/foods-that-are-top-enemies-of-cholesterol/photostory/94938078.cms", "urlToImage": "https://static.zoomnews.com/thumb/msid-94938243,width-900,height-1200,resizemode-6.cms", "publishedAt": "2022-10-18T08:18:59Z", "content": "Vegetable oils like canola, sunflower, safflower, and others in place of butter, lard, or shortening when cooking or at the table help lower LDL"}, {"source": {"id": null, "name": "Contemporarypediatrics.com"}, "author": "Tina Q Tan, MD, FAAP, FIDSA, FPIDS", "title": "What is the latest news in COVID-19 vaccines? - Contemporary Pediatrics", "description": "As COVID-19 continues to spread, vaccinations remain available to protect children from severe disease, hospitalization, and death.", "url": "https://www.contemporarypediatrics.com/view/what-is-the-latest-news-in-covid-19-vaccines", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contpeds/39d52789ae8944dabc7ef7e2ee775f24bdf629ee-5800x3500.jpg?fit=crop&auto=format", "publishedAt": "2022-10-18T08:11:05Z", "content": "Vaccines against the SARS-CoV-2 virus are the best tools for providing protection against serious disease, hospitalization, and death resulting from COVID-19 infection. COVID-19 vaccines now are appr… [+3119 chars]"}, {"source": {"id": null, "name": "Indulgexpress.com"}, "author": "IANS", "title": "Here are some common misconceptions and proven facts about arthritis - indulgexpress", "description": "Although this ailment is relatively widespread, several myths continue to keep people from getting the care they require to reduce their symptoms and improve their quality of life", "url": "https://www.indulgexpress.com/sex-health/wellness/2022/oct/18/here-are-some-common-misconceptions-and-proven-facts-about-arthritis-44701.html", "urlToImage": "https://images.indulgexpress.com/uploads/user/imagelibrary/2022/10/15/original/Therearemorethan100differentformsofarthritis.jpg", "publishedAt": "2022-10-18T08:00:00Z", "content": "Arthritis is one of the most common health issues in the country. It is commonly known that arthritis can cause one or more joints to ache, swell, and become inflamed. It is a general phrase used to … [+3032 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Why drinking too much coffee can cause PCOS - The Indian Express", "description": "Caffeine impacts reproductive health by affecting endogenous hormone levels through change in ovarian function or alterations in hormone metabolism, says Dr Surabhi Siddhartha, Consultant Obstetrician and Gynaecologist, Motherhood Hospital, Kharghar", "url": "https://indianexpress.com/article/lifestyle/health-specials/drinking-coffee-pcos-8215313/", "urlToImage": "https://images.indianexpress.com/2022/10/coffee1200_getty.jpg", "publishedAt": "2022-10-18T08:00:00Z", "content": "Coffee has become one of the most common beverages worldwide. Although coffee contains disease-fighting antioxidants and anti-inflammatory substances and helps to elevate mood, its excessive intake c… [+2862 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Molecule in brain can boost body's ability to fight Alzheimer's - Hindustan Times", "description": "UVA's important new findings could one day let doctors augment the activity of microglia to treat or protect patients from Alzheimer's, MS and other neurodegenerative diseases, the researchers report. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/molecule-in-brain-that-boost-body-s-ability-to-fight-alzheimer-s-multiple-sclerosis-study-101666078210630.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/18/1600x900/alzheimers_disease_thumb_1666078397212_1666078397393_1666078397393.jpg", "publishedAt": "2022-10-18T07:36:14Z", "content": "Researchers at UVA Health have identified a brain chemical that coordinates the immune system's reactions to multiple sclerosis (MS) and Alzheimer's disease, potentially enabling medical professional… [+5100 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Alice Mary Topno", "title": "Pros And Cons Of Using Lemon On Skin - HerZindagi English", "description": "Take a look at some of the main dos and don’ts of using lemon on your skin.", "url": "https://www.herzindagi.com/beauty/pros-and-cons-of-using-lemon-on-the-skin-article-211186", "urlToImage": "https://images.herzindagi.info/image/2022/Oct/cons-of-lemon-on-skin.jpg", "publishedAt": "2022-10-18T06:54:42Z", "content": "Lemon is a powerful ingredient when it comes to skincare as it is rich in vitamin C. Lemons are known for their detoxifying properties due to their abundance in vitamin C and citric acid. The powerfu… [+3860 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Potential new approach to treat Long COVID conditions found - EastMojo", "description": "Washington: Scientists have discovered a new approach for delivering treatments to patients suffering from serious, long-term COVID symptoms. The team at", "url": "http://www.eastmojo.com/health/2022/10/18/potential-new-approach-to-treat-long-covid-conditions-found/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-7.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-10-18T05:10:00Z", "content": "Washington: Scientists have discovered a new approach for delivering treatments to patients suffering from serious, long-term COVID symptoms.\r\nThe team at University of Miami, US, conducted experimen… [+2749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bronchiolitis: Superfoods To Help Manage Bronchiolitis In Children - NDTV", "description": "Lung Infection In Children: In this article, we list superfoods that can help in the management of bronchiolitis in children.", "url": "https://www.ndtv.com/health/bronchiolitis-superfoods-to-help-manage-bronchiolitis-in-children-3440469", "urlToImage": "https://c.ndtvimg.com/2022-02/nbba9h7g_beetroot-amla-juice_625x300_17_February_22.jpg", "publishedAt": "2022-10-18T05:00:33Z", "content": "Bronchiolitis: Beetroots improve lung function and maximise oxygen intake\r\nAs winter is approaching, your kid might be prone to contracting Bronchiolitis. Young children and newborns frequently contr… [+3526 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Nanotechnology, messenger RNA combined in possible new 'universal' COVID-19 treatment - EurekAlert", "description": "A study led by an Oregon State University pharmaceutical sciences researcher has produced a proof of principle for a new “universal” means of treating COVID-19.", "url": "https://www.eurekalert.org/news-releases/968039", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/0402440f-ea88-47bd-bdb1-e17488c21834/Rendition/thumbnail/Content/Public", "publishedAt": "2022-10-18T04:21:55Z", "content": "image: Depiction of mRNA therapyview more \r\nCredit: OSU College of Pharmacy\r\nPORTLAND, Ore. – A study led by an Oregon State University pharmaceutical sciences researcher has produced a proof of prin… [+4262 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "1.4 mn Canadian adults report prolonged Covid-19 symptoms - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/14-mn-canadian-adults-report-prolonged-covid19-symptoms-3380863", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/fb18303fe546b18b10dde09f570f56ce_w_800_h_450.jpg", "publishedAt": "2022-10-18T04:09:36Z", "content": "Ottawa, Oct 18 (IANS) Nearly 1.4 million Canadian adults indicated they had symptoms at least three months after a positive Covid-19 test or suspected infection, Statistics Canada said.\r\nOf those who… [+985 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Treatment For Depression Changes The Very Structure of The Brain, Scientists Find - ScienceAlert", "description": "Decades of reinforcing neural connections can make the adult brain stubbornly resistant to rapid changes.", "url": "https://www.sciencealert.com/treatment-for-depression-changes-the-very-structure-of-the-brain-scientists-find", "urlToImage": "https://www.sciencealert.com/images/2022/10/WomanSilhouettedBySunlight.jpg", "publishedAt": "2022-10-18T04:06:09Z", "content": "Decades of reinforcing neural connections can make the adult brain stubbornly resistant to rapid changes. Should our brain's structure trap us in cycles of dark moods and thoughts, disorders like chr… [+5295 chars]"}, {"source": {"id": null, "name": "Babushahi.com"}, "author": null, "title": "Babushahi.com - Babushahi.com", "description": "", "url": "https://www.babushahi.com/view-news.php?id=153816", "urlToImage": "https://www.babushahi.com/upload/image/ANI-20221018012248.jpg", "publishedAt": "2022-10-18T02:37:00Z", "content": "ANI | Updated: Oct 18, 2022 06:52 IST\r\nWashington [US], October 18 (ANI): During an instructor's presentation, students often prefer to take camera-phone photos of slides but it raises the question t… [+4692 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Ageing support: Soy peptide supplementation may benefit motor, memory function in the elderly - Japanese RCT - NutraIngredients-Asia", "description": "Soy peptide supplementation may help to improve both motor and memory function in community-dwelling older adults, alongside an exercise regimen, a Japanese study has found.", "url": "https://www.nutraingredients-asia.com/Article/2022/10/18/ageing-support-soy-peptide-supplementation-may-benefit-motor-memory-function-in-the-elderly-japanese-rct", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/research/ageing-support-soy-peptide-supplementation-may-benefit-motor-memory-function-in-the-elderly-japanese-rct/15853283-1-eng-GB/Ageing-support-Soy-peptide-supplementation-may-benefit-motor-memory-function-in-the-elderly-Japanese-RCT.jpg", "publishedAt": "2022-10-18T01:39:00Z", "content": "At 29%, Japans population has the highest percentage of people aged above 65 globally. The countrys Ministry of Health, Labour, and Welfare estimate that the rate of ageing is expected to increase un… [+1527 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Metabolism, not genes, may offer more insight into risk of some diseases - Science Daily", "description": "In an analysis of the metabolic profiles of healthy American babies, researchers found surprising differences among ethnic groups which may help make screening for inherited metabolic disorders, cystic fibrosis, or hypothyroidism much more accurate than tradi…", "url": "https://www.sciencedaily.com/releases/2022/10/221017161110.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-17T20:50:45Z", "content": "Our ancestry can be detected not only in our genes, but also in our metabolism, a new Yale-led study has found.In an analysis of the metabolic profiles of healthy American babies, researchers found s… [+3164 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Tim Smith", "title": "Pri-Med Midwest Highlights: Infectious Diseases, Colorectal Cancer, Adult Plaque Psoriasis - MD Magazine", "description": "A highlighted description of some key takeaways from presentations at Pri-Med Midwest 2022, including such topics as infectious disease, monkeypox, colorectal cancer, psoriasis, and COVID-19.", "url": "https://www.hcplive.com/view/pri-med-midwest-highlights-infectious-diseases-colorectal-cancer-adult-plaque-psoriasis", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/766fd62b4043a123e0ebe7f810d76b5de1ebd4ac-530x530.png?fit=crop&auto=format", "publishedAt": "2022-10-17T20:02:25Z", "content": "At Pri-Med Midwest 2022, several clinicians gave presentations on key points they wished to emphasize regarding research into topics of interest in the world of medical science.\r\nSome of the highligh… [+3100 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Jessica Norris", "title": "Skin and brain cancers: New discovery may help improve treatment - Medical News Today", "description": "", "url": "https://www.medicalnewstoday.com/articles/skin-and-brain-cancers-new-discovery-may-help-improve-treatment", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/10/researcher-drug-resistant-tumors-thumb.jpg", "publishedAt": "2022-10-17T16:05:42Z", "content": "<ul><li>Cancer encompasses a wide variety of types. Treatment options vary, and some forms of cancer can be fatal. </li><li>Understanding the underlying mechanisms of cancer growth can be vital to de… [+5843 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study finds unexpected protective properties of pain - ETHealthWorld", "description": "In a set of experiments, the researchers observed that mice lacking pain neurons produced less protective mucus and experienced changes in their intestinal microbial composition- an imbalance in beneficial and harmful microbes known as dysbiosis.", "url": "https://health.economictimes.indiatimes.com/news/industry/study-finds-unexpected-protective-properties-of-pain/94922452", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94922452,imgsize-26626,width-1200,height-628,overlay-ethealthworld/study-finds-unexpected-protective-properties-of-pain.jpg", "publishedAt": "2022-10-17T14:10:00Z", "content": "Washington: The classic view of pain is that it protects by detecting and signalling the presence of harmful agents, but new research shows pain can shield the gut more directly.A new study led by re… [+5709 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Dual LAMA/LABA or triple therapy may raise CV risk among COPD patients - Medical Dialogues", "description": "CHINA: According to a research reported in The European Respiratory Journal, dual LAMA/LABA or...", "url": "https://medicaldialogues.in/pulmonology/news/dual-lamalaba-or-triple-therapy-may-raise-cv-risk-among-copd-patients-100530", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/03/125125-copd.jpg", "publishedAt": "2022-10-17T14:00:41Z", "content": "CHINA: According to a research reported in The European Respiratory Journal, dual LAMA/LABA or triple therapy elevates cardiovascular risk in COPD patients compared to ICS/LABA. \r\nA series of long-te… [+2491 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "New Omicron Sub-Variant Largely Evades Neutralising Antibodies: Lancet Study - NewsClick", "description": "The findings by researchers at Karolinska Institutet, Sweden, suggest a risk of increased SARS-CoV-2 infections this winter unless updated bivalent vaccines help to boost immunity.", "url": "https://www.newsclick.in/new-omicron-sub-Variant-largely-evades-neutralising-antibodies-lancet-study", "urlToImage": "https://www.newsclick.in/sites/default/files/2021-12/corona28.jpg", "publishedAt": "2022-10-17T12:51:32Z", "content": "London: The BA.2.75.2 variant of Omicron largely evades neutralising antibodies in the blood and is resistant to several COVID-19 antibody therapies, according to a study published in The Lancet Infe… [+2284 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Kerassentials For Toenail Fungus [Medically Investigation] - Deccan Herald", "description": "kerassentials for toenail fungus: amazing supplement to guard against all kinds of foot issues", "url": "https://www.deccanherald.com/brandspot/pr-spot/kerassentials-for-toenail-fungus-medically-investigation-1154409.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154409-1666010458.png", "publishedAt": "2022-10-17T12:40:58Z", "content": "kerassentials for toenail fungus: amazing supplement to guard against all kinds of foot issues\r\nHaving a fungal infection in your foot may be an issue you deal with, and it may be quite upsetting. An… [+18424 chars]"}, {"source": {"id": null, "name": "Ptcnews.tv"}, "author": null, "title": "Need to revise Covid vaccination strategy in India, states IJPM - PTC News", "description": "The latest peer-reviewed journal based on published studies in the Indian Journal of Preventive Medicine (IJPM) suggests that a revised Covid-19 vaccine policy is the need of the hour to safeguard the science", "url": "https://www.ptcnews.tv/need-to-revise-covid-vaccination-strategy-in-india-states-ijpm-2", "urlToImage": "https://ptcnews-wp.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/10/Covid-19-vaccine-policy-is-need-of-hour-to-safeguard-science-1.jpg", "publishedAt": "2022-10-17T12:14:14Z", "content": "New Delhi, October 17: The latest peer-reviewed journal based on published studies in the Indian Journal of Preventive Medicine (IJPM) suggests that a revised Covid-19 vaccine policy is the need of t… [+4536 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Glucofort Tablets [Medically Investigation] - Deccan Herald", "description": "Blood sugar levels can worsen if not treated at the appropriate time. If we don't take good care of our health, various other bodily problems develop and interfere with how well our bodies work. Unhealthy lifestyle choices and frequent consumption of junk foo…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucofort-tablets-medically-investigation-1154399.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/ghnmghmgnb%20cb-1154399-1666008733.png", "publishedAt": "2022-10-17T11:47:22Z", "content": "Blood sugar levels can worsen if not treated at the appropriate time. If we don't take good care of our health, various other bodily problems develop and interfere with how well our bodies work. Unhe… [+17157 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[HOAX EXPOSED] Ultimate Keto Gummies Reviews CONSUMER FEEDBACK Shark Tank SCAM - Deccan Herald", "description": "Introduction-", "url": "https://www.deccanherald.com/brandspot/pr-spot/hoax-exposed-ultimate-keto-gummies-reviews-consumer-feedback-shark-tank-scam-1154373.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fgngfnf-1154373-1666004781.jpg", "publishedAt": "2022-10-17T10:48:40Z", "content": "Introduction-When it comes to trusting a supplement that promises to burn all your extra fats without harming your body, counting the genuine product is very important. Various products claim the sam… [+16352 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Worried about weight gain? Middle-aged women must blame long-term exposure to air pollution - The Economic Times", "description": "A new study found that air pollution can increase the weight, body fat & BMI in women.", "url": "https://economictimes.indiatimes.com/magazines/panache/worried-about-weight-gain-middle-aged-women-must-blame-long-term-exposure-to-air-pollution/articleshow/94913145.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94916856,width-1070,height-580,imgsize-36634,overlay-etpanache/photo.jpg", "publishedAt": "2022-10-17T10:30:00Z", "content": "Did you know India is the second-most polluted country in the world?\r\nMore than 63 per cent of India's 1.3 billion population is living in areas that exceed the World Health Organization's recommende… [+3010 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Some screen time better than none when children recover from concussions: Study - Hindustan Times", "description": "More than 700 children aged 8 to 16 who self-reported their screen use during the first 7 to 10 days after an injury were studied to see if there were any associations with the symptoms that children and their caregivers reported throughout the subsequent six…", "url": "https://www.hindustantimes.com/lifestyle/health/some-screen-time-better-than-none-when-children-recover-from-concussions-study-101666000987980.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/17/1600x900/c_1_1666001089968_1666001090197_1666001090197.jpg", "publishedAt": "2022-10-17T10:08:11Z", "content": "Too much screen time can slow children's recovery from concussions, but new research from UBC and the University of Calgary suggests that banning screen time is not the answer.\r\nMore than 700 childre… [+3854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "These signs indicate that lack of sleep is affecting your immunity - The Indian Express", "description": "\"Sleep and the circadian system exert a strong regulatory influence on immune functions\"", "url": "https://indianexpress.com/article/lifestyle/health/lack-of-sleep-harms-immunity-immune-function-sleep-deprivation-illnesses-8208601/", "urlToImage": "https://images.indianexpress.com/2022/10/immunity_1200_getty.jpg", "publishedAt": "2022-10-17T07:50:02Z", "content": "Various experts and studies have repeatedly noted that sleep deprivation makes an individual more prone to diseases such as diabetes, heart disorders, hypertension, and eye-related disorders, among o… [+4770 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[BEWARE SCAM] ViaKeto Gummies Ireland United Kingdom Dragons Den Don't Buy Before Read Official Reviews! - Deccan Herald", "description": "ViaKeto Gummies UK, Ireland Review Weight Loss There are many ways to lose weight, including exercise, healthy eating habits and weight loss supplements. However, most people fail because they don't know how to lose weight and keep it off. Luckily, there are …", "url": "https://www.deccanherald.com/brandspot/pr-spot/beware-scam-viaketo-gummies-ireland-united-kingdom-dragons-den-dont-buy-before-read-official-reviews-1154300.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/ghmvhjbmvbm%20vhbn-1154300-1665992345.png", "publishedAt": "2022-10-17T07:39:05Z", "content": "ViaKeto Gummies UK, Ireland Review Weight LossThere are many ways to lose weight, including exercise, healthy eating habits and weight loss supplements. However, most people fail because they don't k… [+9024 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "How do Increase Testosterone Levels Quickly? Do Test Boosters Work? - Deccan Herald", "description": "Our way of living is a contributing factor to health issues. People today deal with a variety of health issues because they are living in the 20th century. Male erotic health issues like early ejaculation, erectile dysfunction, and poor libido are common toda…", "url": "https://www.deccanherald.com/brandspot/pr-spot/how-do-increase-testosterone-levels-quickly-do-test-boosters-work-1154283.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1154283-1665990369.png", "publishedAt": "2022-10-17T07:06:09Z", "content": "Our way of living is a contributing factor to health issues. People today deal with a variety of health issues because they are living in the 20th century. Male erotic health issues like early ejacul… [+17003 chars]"}]}