{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World AIDS Vaccine Day 2023: Know The Significance Of This Day - NDTV", "description": "World AIDS Vaccine Day Significance: This day honours professionals who are working together in development of vaccine against AIDS.", "url": "https://www.ndtv.com/health/world-aids-vaccine-day-2023-know-the-significance-of-this-day-4044361", "urlToImage": "https://i.ndtvimg.com/i/2016-04/injection_650x400_51459999714.jpg", "publishedAt": "2023-05-18T06:01:00Z", "content": "World AIDS Vaccine Day is observed on May 18 every year\r\nWorld AIDS Vaccine Day is observed on May 18 every year to educate people and communities about the importance and need for HIV vaccine in pre… [+1944 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "8 safe sex tips to prevent sexually transmitted infections - Health shots", "description": "If you are sexually active and wondering how to prevent sexually transmitted infections (STI), follow these 9 tips to protect yourself.", "url": "https://www.healthshots.com/how-to/9-tips-to-prevent-sexually-transmitted-infections/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/05/18093015/safe-sex.jpg", "publishedAt": "2023-05-18T05:00:37Z", "content": "In recent years, there has been a worrying increase in sexually transmitted infections (STIs) among the younger generation, especially the female population. A World Health Organization (WHO) report … [+4559 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Cellular mechanisms behind memory maturation as children age studied - Daily Excelsior", "description": "NEW DELHI, May 17: Researchers have uncovered the molecular mechanisms in young children’s brains underlying the change from general “gist”-like memories to specific episodic memories tied to a context as they age, through a study conducted in mice. They said…", "url": "https://www.dailyexcelsior.com/cellular-mechanisms-behind-memory-maturation-as-children-age-studied-2/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/05/brain.jpg", "publishedAt": "2023-05-18T03:07:36Z", "content": "NEW DELHI, May 17: Researchers have uncovered the molecular mechanisms in young children’s brains underlying the change from general “gist”-like memories to specific episodic memories tied to a conte… [+2734 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "Benefits of morning walk: Burn calories, boost your immunity, beat heart attacks - Moneycontrol", "description": "Health benefits of morning walk: A regular walking routine every morning keeps your heart rate and blood pressure in check, improving the overall cardiovascular health. And unlike other rigorous exercise routines, morning walks are easy to start, don't need a…", "url": "https://www.moneycontrol.com/news/health-and-fitness/benefits-of-morning-walk-burn-calories-boost-your-immunity-beat-heart-attacks-10609721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Health-benefits-of-walking-770x433.jpg", "publishedAt": "2023-05-18T02:57:48Z", "content": "Wake up and walk! Morning strolls do not just bring joy to your heart but also offer a series of health benefits including better immunity, higher energy levels, stronger bones and muscles, and of co… [+3008 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "Protein rich food for weight loss: The dos and don'ts of protein intake, best sources, how much is too... - Moneycontrol", "description": "Protein-rich diet for weight loss: Most people, including fitness enthusiasts, are often confused about how to consume protein in the right way to achieve their health, fitness, and weight goals.", "url": "https://www.moneycontrol.com/news/health-and-fitness/protein-rich-food-for-weight-loss-the-dos-and-donts-of-protein-intake-best-sources-how-much-you-need-and-more-10610111.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Protein-intake-for-weight-loss-770x433.jpg", "publishedAt": "2023-05-18T02:42:49Z", "content": "A protein-rich diet has many proven benefits, but there is still a lot of confusion around the vital nutrient, and how it can best be used to achieve your health, fitness, and weight lossgoals. Prope… [+3656 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rajeshwaari Kalla", "title": "Contact lenses and eye problems: Simple tips to protect yourself from eye infections - Moneycontrol", "description": "Contact lens complications: From redness to infections, contact lenses come with a long list of dangerous complications if not handled properly. Safeguard your eyes with expert tips and never compromise your vision for fashion.", "url": "https://www.moneycontrol.com/news/health-and-fitness/contact-lenses-and-eye-problems-follow-these-simple-tips-to-protect-yourself-from-eye-infections-and-germs-10608951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/05/Contact-lenses-and-eye-care-770x433.jpg", "publishedAt": "2023-05-18T02:32:07Z", "content": "Contact lenses and eye care: Who does not love the swoon-worthy makeover of Mia Thermopolis (played by Anne Hathaway) in the Princess Diaries? No one failed to notice the momentous change - from glas… [+3592 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "5 Reasons Why You MUST Start Eating Litchi in Summer - India.com", "description": "Litchi Benefits: Litchi has anti-inflammatory chemicals that benefit the digestive system. It also has a lot of fiber, which promotes good digestion and prevents constipation. Here our some other reasons why you must eat litchi -", "url": "https://www.india.com/lifestyle/litchi-benefits-litchi-khane-ke-fayede-5-reasons-why-you-must-start-eating-this-fruit-in-summer-weight-loss-6055904/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/05/Litchi-benefits.jpg", "publishedAt": "2023-05-18T02:30:59Z", "content": "Litchi Benefits: Litchi has anti-inflammatory chemicals that benefit the digestive system. It also has a lot of fiber, which promotes good digestion and prevents constipation. Here our some other rea… [+2746 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Cancer Cells Use New Fuel in Absence of Sugar: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY.  A new nutrition source for pancreatic cancer cells has been discovered by researchers at the University of Michigan Rogel Cancer Centre. Uridine is a substance that provides insight into both biological…", "url": "https://www.latestly.com/agency-news/science-news-cancer-cells-use-new-fuel-in-absence-of-sugar-study-5135319.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/05/ANI-20230517231901-588x441.jpg", "publishedAt": "2023-05-18T02:28:26Z", "content": "Washington [US], May 18 (ANI): A new nutrition source for pancreatic cancer cells has been discovered by researchers at the University of Michigan Rogel Cancer Centre. Uridine is a substance that pro… [+3602 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Policy overhaul needed: Food industry's impact on global brain health - News-Medical.Net", "description": "The dominance of the corporate-industrial food industry undermines brain capital and sustainable human development on a global scale. Understanding this impact is crucial for the future of public health and well-being.", "url": "https://www.news-medical.net/news/20230517/Policy-overhaul-needed-Food-industrys-impact-on-global-brain-health.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_748523_168437387472465.jpg", "publishedAt": "2023-05-18T02:27:00Z", "content": "In a recent study published by the Baker Institute, researchers propose several policy solutions that can effectively target different aspects of the food industry that contribute to the development … [+5204 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how common virus can cause multiple sclerosis - ThePrint", "description": "Solna [Sweden], May 18 (ANI): The Epstein-Barr virus may cause multiple sclerosis or worsen the condition, according to new research from Sweden’s Karolinska Institute. Some people have antibodies against the virus that mistakenly targets a protein in the bra…", "url": "https://theprint.in/health/study-reveals-how-common-virus-can-cause-multiple-sclerosis/1580349/", "urlToImage": null, "publishedAt": "2023-05-18T02:17:40Z", "content": "Solna [Sweden], May 18 (ANI): The Epstein-Barr virus may cause multiple sclerosis or worsen the condition, according to new research from Sweden’s Karolinska Institute. Some people have antibodies ag… [+4055 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Press Release: ECOG-ACRIN announces the recipients of its 2023 scientific leadership and mentorship awards - EurekAlert", "description": "The ECOG-ACRIN Cancer Research Group (ECOG-ACRIN) announces Patrick M. Forde, MBBCh, Arlene A. Forastiere, MD, and Julia D. Ransohoff, MD, as the recipients of the organization’s annual scientific leadership and mentorship awards. Through its Mentoring Progra…", "url": "https://www.eurekalert.org/news-releases/989650", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/d4e453a6-bb64-479b-a099-0d61c183f8f2/Rendition/thumbnail/Content/Public", "publishedAt": "2023-05-18T02:01:34Z", "content": "image: Patrick M. Forde, MBBCh, recipient of ECOG-ACRIN's 2023 Young Investigator Awardview more \r\nCredit: Johns Hopkins University\r\nThe ECOG-ACRIN Cancer Research Group (ECOG-ACRIN) announces the fo… [+3801 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers identify potential new strategy to prevent side effects from immunotherapy - EurekAlert", "description": "A study led by researchers at the UCLA Jonsson Comprehensive Cancer Center suggests that IL-21, a soluble molecule involved in activating the immune system, can be a potential therapeutic target to help reduce endocrine autoimmune side effects caused by check…", "url": "https://www.eurekalert.org/news-releases/989658", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-05-18T02:01:34Z", "content": "FINDINGS\r\nA study led by researchers at the UCLA Jonsson Comprehensive Cancer Center suggests that IL-21, a soluble molecule involved in activating the immune system, can be a potential therapeutic t… [+3668 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Here's what happens to your body if you eat pizza every week - Indiatimes.com", "description": "Do you crave pizza every now and then? You may want to rethink before ordering your next pizza.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/heres-what-happens-to-your-body-if-you-eat-pizza-every-week/photostory/100252263.cms", "urlToImage": "https://static.toiimg.com/photo/100252314.cms", "publishedAt": "2023-05-18T01:30:00Z", "content": "Pizza is one of the most popular foods, albeit junk foods. It’s delicious, loaded with cheese, and you can customize the toppings based on your mood and taste. \r\nIt's also available quickly and is ea… [+244 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ageing body scans to aid understanding of why diseases occur - BBC", "description": "The results could open up new ways to spot, treat and prevent some diseases, including cancer, experts say.", "url": "https://www.bbc.com/news/health-65615782", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/42C7/production/_129759071_fergus_scan2.jpg", "publishedAt": "2023-05-17T23:53:00Z", "content": "The world's biggest human imaging project is set to rescan the brains and bodies of 60,000 UK volunteers to find new ways of treating and preventing disease. \r\nBy looking at how bodies age, the study… [+3906 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Scientists working on 'universal' flu vaccine that could last years - CBS Boston", "description": "Wouldn't it be nice to get a flu shot that could last for years? Researchers are actively working on a so-called \"universal\" flu vaccine.", "url": "https://www.youtube.com/watch?v=TO4enaNuxuo", "urlToImage": "https://i.ytimg.com/vi/TO4enaNuxuo/maxresdefault.jpg", "publishedAt": "2023-05-17T22:08:12Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Dengue on steady rise, ICMR set to conduct vaccine trial - The Indian Express", "description": "The ICMR, the country’s apex agency for formulation, coordination and promotion of biomedical research, has tied up with two biotech companies — Panacea and Serum Institute of India (SII) — to conduct phase-III trials of their dengue vaccines.", "url": "https://indianexpress.com/article/india/dengue-on-steady-rise-icmr-set-to-conduct-vaccine-trial-8615357/", "urlToImage": "https://images.indianexpress.com/2023/05/dengue1.jpg", "publishedAt": "2023-05-17T21:44:58Z", "content": "With a steady increase in cases of dengue across the country from being restricted to only eight states and Union Territories in 2001 it is prevalent in all states states and UTs at present the India… [+1575 chars]"}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Barbara Brody", "title": "7 Tips to Protect Your Liver Function as You Age - AARP", "description": "100 million Americans suffer from liver disease, and most don’t know it. Find out signs of liver disease and lifestyle changes to prevent damage.", "url": "https://www.aarp.org/health/healthy-living/info-2023/ways-to-protect-your-liver/", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/healthy-living/2023/05/1140-doctorholdingliver.jpg", "publishedAt": "2023-05-17T21:41:36Z", "content": "Your liver deserves more love than you might realize. This hard-working organ performs more than 500 vital functions, from aiding in digestion and storing important vitamins (including A, D, E, K and… [+3834 chars]"}, {"source": {"id": null, "name": "Clevelandclinic.org"}, "author": "Brandon Koziol", "title": "Avoiding Foot Injuries When Running Long Distances - Cleveland Clinic Newsroom", "description": "CLEVELAND – Whether you’re gearing up for a marathon or just want to run longer distances, there are some things you can do to avoid foot injuries. Joy Rowland, DPM, a podiatrist with Cleveland Clinic said starting with the right running shoe is key. “The sho…", "url": "https://newsroom.clevelandclinic.org/2023/05/17/avoiding-foot-injuries-when-running-long-distances/", "urlToImage": "https://newsroom.clevelandclinic.org/wp-content/uploads/sites/4/2023/05/how-to-avoid-foot-injuries-1200x630.jpg", "publishedAt": "2023-05-17T20:28:16Z", "content": "CLEVELAND Whether youre gearing up for a marathon or just want to run longer distances, there are some things you can do to avoid foot injuries.\r\nJoy Rowland, DPM, a podiatrist with Cleveland Clinic … [+1851 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Placenta, Not Brain: Groundbreaking Study Shifts the Schizophrenia Narrative - SciTechDaily", "description": "Potential future prevention strategies may focus on addressing the treatment of the placenta. A new study conducted by the Lieber Institute for Brain Development suggests that the risk of schizophrenia is largely due to the role of over 100 associated genes i…", "url": "https://scitechdaily.com/?p=278590", "urlToImage": "https://scitechdaily.com/images/Schizophrenia-Bipolar-Mental-Disorder.jpg", "publishedAt": "2023-05-17T20:21:46Z", "content": "ByLieber Institute for Brain DevelopmentMay 17, 2023\r\nSchizophrenia is a complex mental disorder characterized by a combination of symptoms that affect a persons thoughts, emotions, and behaviors. It… [+6146 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "7 Foods That Can Help You Look Younger, According to Dietitians and Dermatologists - Verywell Health", "description": "Aging is a natural process, but foods rich in antioxidants may help protect your skin.", "url": "https://www.verywellhealth.com/anti-aging-foods-7496167", "urlToImage": "https://www.verywellhealth.com/thmb/k86Vf8G81ceiqz-KlsulXlmRiJg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Anti-AgingFoods_4000x2700_final-a89c345ffd7f458092da9a483447c2bd.jpg", "publishedAt": "2023-05-17T19:38:30Z", "content": "<ul><li>A diet cant stop the aging process, but certain foods rich in antioxidants and anti-inflammatory properties may help protect the skin and slow damage.</li><li>Preliminary research suggests th… [+6010 chars]"}, {"source": {"id": null, "name": "The Economist"}, "author": "The Economist", "title": "Could phage therapy help combat antimicrobial resistance? - The Economist", "description": "Our podcast on science and technology. This week, we explore the potential of bacteriophages—viruses that can destroy superbugs—and why their time might have come", "url": "https://www.economist.com/phage-pod", "urlToImage": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20230520_PDP509.jpg", "publishedAt": "2023-05-17T17:36:34Z", "content": "ANTIMICROBIAL RESISTANCE killed over a million people in 2019. That figure is expected to rise to ten million by 2050. Antibiotics remain vital to modern medicine, but this hidden pandemic of drug-re… [+1674 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Quetiapine most often prescribed for dementia associated with PD, Lewy bodies - Healio", "description": "CHICAGO &mdash; Quetiapine remains the drug of choice for psychosis in patients with Parkinson&rsquo;s disease dementia and dementia with Lewy bodies, per data at the International Association of Parkinsonism and Related Disorders World Congress.&ldquo;(Our r…", "url": "https://www.healio.com/news/neurology/20230517/quetiapine-most-often-prescribed-for-dementia-associated-with-pd-lewy-bodies", "urlToImage": "https://www.healio.com/~/media/temporary/open-prescription-medicine-bottles.jpg", "publishedAt": "2023-05-17T17:24:12Z", "content": "Source/Disclosures\r\n Source: Burda KV, et al. Exploration of antipsychotic prescribing practices among movement disorders subspecialists for patients with Parkinson’s disease dementia and dementia wi… [+3063 chars]"}, {"source": {"id": null, "name": "Theeverygirl.com"}, "author": "katherine", "title": "New Study Says Taking This Supplement Can Reverse Biological Age By a Year - The Everygirl", "description": "experts say it may be the fountain of youth", "url": "http://theeverygirl.com/vitamin-d-for-biological-age/", "urlToImage": "https://media.theeverygirl.com/wp-content/uploads/2023/05/the-everygirl-social-supplement-reverses-biological-age-1.jpg", "publishedAt": "2023-05-17T16:39:12Z", "content": "The Everygirls product selections are curated by the editorial team. If you buy something through our links, we may earn an affiliate commission, at no cost to you. We only recommend products we genu… [+7393 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Researchers at Anant National University create novel pain relief jacket and knee cap for elders - BSI bureau", "description": "The idea behind the Pain Relief Jacket was planted due to the alarming increase in arthritis patients across age groups", "url": "https://www.biospectrumindia.com/news/90/23101/researchers-at-anant-national-university-create-novel-pain-relief-jacket-and-knee-cap-for-elders.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/knee_cap-23101.png", "publishedAt": "2023-05-17T16:30:21Z", "content": "The idea behind the Pain Relief Jacket was planted due to the alarming increase in arthritis patients across age groups\r\nA team of researchers at Anant National University in Ahmedabad have created u… [+1338 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Nishad Thaivalappil", "title": "Malaria or Dengue? Read to Know the Difference Between the Mosquito-Borne Diseases - News18", "description": "The monsoon season sees a surge in cases of both malaria and dengue cases across the country", "url": "https://www.news18.com/lifestyle/malaria-or-dengue-read-to-know-the-difference-between-the-mosquito-borne-diseases-7842715.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/wp-image-1028-168242658916x9.jpg", "publishedAt": "2023-05-17T15:56:54Z", "content": "As summers are in full swing, few people remember that mosquito-borne diseases like malaria and dengue will soon make their advent once again in the country. The monsoon season sees a surge in cases … [+1951 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Linking air pollution and lung disease - Drug Target Review", "description": "USC researchers gain valuable insights into the biological processes underlying the association between air pollution and lung disease.", "url": "https://www.drugtargetreview.com/news/109878/linking-air-pollution-and-lung-disease/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/lung-disease-1.jpg", "publishedAt": "2023-05-17T15:31:47Z", "content": "Posted: 17 May 2023 | Izzy Wood (Drug Target Review) | No comments yet\r\nUSC researchers gain valuable insights into the biological processes underlying the association between air pollution and lung … [+3419 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "High Blood Pressure: Is Hypertension Different for Women Than Men? A Comprehensive Guide - Zee News", "description": "The incidence of hypertension amongst men is very high and around 33 per cent in India. However, females below the age of 45 that is, pre-menopausal are protected and the incidence is somewhere between 11 to 15 per cent only. But after menopause, the incidenc…", "url": "https://zeenews.india.com/health/high-blood-pressure-is-hypertension-different-for-women-than-men-a-comprehensive-guide-2609499", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/17/1202417-bp-in-men-vs-women.png", "publishedAt": "2023-05-17T15:25:35Z", "content": "Although there are no definite gender-specific differences in the risk of hypertension, women face unique considerations due to hormonal changes, and pregnancy-related factors, said doctors on Wednes… [+3107 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Fermentation, digestive enzymes and other gut health hacks - TODAY", "description": "From fermented beet juice to spirulina and coconut oil, Dr. Taz Bhatia joins TODAY with five ways to fuel a healthy gut.» Subscribe to TODAY: http://on.today...", "url": "https://www.youtube.com/watch?v=0lmlK8Ju8R8", "urlToImage": "https://i.ytimg.com/vi/0lmlK8Ju8R8/maxresdefault.jpg", "publishedAt": "2023-05-17T14:45:00Z", "content": null}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "High-level resource mobilization conference to eliminate viral hepatitis - World Health Organization", "description": "<p><a href=\"https://endhep2030.org/\" target=\"_blank\" data-sf-ec-immutable=\"\">The Hepatitis Fund</a> and the <a href=\"https://www.clintonhealthaccess.org/\" target=\"_blank\" data-sf-ec-immutable=\"\">Clinton Health Access Initiative (CHAI)</a> will partner on the …", "url": "https://www.who.int/news/item/17-05-2023-high-level-resource-mobilization-conference-to-eliminate-viral-hepatitis", "urlToImage": null, "publishedAt": "2023-05-17T14:22:56Z", "content": "The Hepatitis Fund and the Clinton Health Access Initiative (CHAI) will partner on the inaugural Global Hepatitis Resource Mobilization Conference taking place in Geneva on 17 May 2023. The high-leve… [+2006 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "Targeted therapy for treatment-resistant breast cancer - Drug Target Review", "description": "US researchers have uncovered a potential target for treating breast cancer that is resistant to endocrine therapies.", "url": "https://www.drugtargetreview.com/news/109873/targeted-therapy-for-treatment-resistant-breast-cancer/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/breast-cancer-14.jpg", "publishedAt": "2023-05-17T13:57:13Z", "content": "Posted: 17 May 2023 | Izzy Wood (Drug Target Review) | No comments yet\r\nUS researchers have uncovered a potential target for treating breast cancer that is resistant to endocrine therapies because of… [+3125 chars]"}, {"source": {"id": null, "name": "menshealth.com"}, "author": "The Editors of MH", "title": "3 Innovations That Help Detect Killer Cancers Earlier - Men's Health", "description": "Recent tech advances such as liquid biopsies, AI colonoscopies, and prostate MRIs are optimizing screening tactics, which means doctors can spot cancers earlier—and stop its advances faster.", "url": "https://www.menshealth.com/health/a43774635/detect-cancer-colonoscopy-liquid-biopsy-prostate/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/cancer-detection-index-646254fbda6f6.png?crop=1.00xw:1.00xh;0,0&resize=1200:*", "publishedAt": "2023-05-17T13:49:31Z", "content": "Introducing The Optimists Guide to Cancer, where we outline actionable, strategic steps for cancer prevention and survival. To read the rest of the stories, click here.\r\n\"NOBODY SHOULD EVER die from … [+4391 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Editorial Team", "title": "Embrace The Power Of Yoga For Enhancing Heart Health And Managing Hypertension - TheHealthSite", "description": "Understand the link between hypertension and heart health and how incorporating yoga into one's lifestyle can lead to significant improvements. TheHealthSite.com", "url": "https://www.thehealthsite.com/yoga/enhancing-heart-health-and-managing-hypertension-the-power-of-yoga-978773/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/Untitled-30.jpg", "publishedAt": "2023-05-17T13:41:00Z", "content": "Yoga is a holistic approach that harmonizes the body, mind, and spirit.\r\nManaging hypertension is crucial for maintaining a healthy heart. Read on to know how yoga helps in managing hypertension and … [+5090 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Shark Tank Keto Gummies Reviews [Fraudulent Exposed 2023] Trisha Yearwood Keto Gummies Work Or Not? Turbo Keto Gummies Shark Tank! - mid-day.com", "description": "Shark Tank Keto Gummies Controls your Weight Easily", "url": "https://www.mid-day.com/brand-media/article/shark-tank-keto-gummies-reviews-fraudulent-exposed-2023-trisha-yearwood-keto-23287127", "urlToImage": "https://images.mid-day.com/images/images/2023/may/Shark-Tank-Gummies1705_d.jpg", "publishedAt": "2023-05-17T13:13:00Z", "content": "Shark Tank Keto Gummies Controls your Weight Easily\r\nClick Here To Visit Official Website Buy Now\r\nAre you one of those people who are going through obesity which makes you face different weight gain… [+12293 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "https://www.cnbctv18.com", "title": "Low Vitamin D levels linked to persistent COVID-19 symptoms: Study - CNBCTV18", "description": "Long COVID, also known as post COVID-19 syndrome, refers to a condition in which individuals experience persistent symptoms for more than 12 weeks after the initial COVID-19 infection.", "url": "https://www.cnbctv18.com/healthcare/low-vitamin-d-levels-linked-to-persistent-covid-19-symptoms-study-16690961.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2023/01/shutterstock_1643947495.jpg", "publishedAt": "2023-05-17T13:05:14Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Top 2 food groups you should STOP consuming to reduce your risk of diabetes - Times of India", "description": "Your diet plays a crucial role in making you healthy or putting you at risk of diabetes. Choice is yours.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/top-2-food-groups-you-should-stop-consuming-to-reduce-your-risk-of-diabetes/photostory/100279494.cms", "urlToImage": "https://static.toiimg.com/photo/100279580.cms", "publishedAt": "2023-05-17T12:30:00Z", "content": "To stay fit and healthy, and minimize your risk of developing diabetes, you need to consume a healthy, well-balanced diet. Eat plenty of fruits and non-starchy vegetables such as peppers, mushrooms, … [+382 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Nibedita Roy", "title": "Foods rich in biotin that can fix hairloss naturally - Recipes", "description": "", "url": "https://recipes.timesofindia.com/web-stories/these-natural-biotin-foods-can-fix-hair-loss/photostory/100301807.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100301939,imgsize-90136,width-900,height-1200,resizemode-6/100301939.jpg", "publishedAt": "2023-05-17T12:30:00Z", "content": "Almonds are not only a great source of omega 3 fatty acids, fiber, vitamin E, but at the same time it contains around 1.5 micrograms of vitamin H (biotin), which helps in boosting hair growth."}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kinkini Gupta", "title": "World Hypertension Day: 8 Alternative Therapies To Reduce Symptoms - TheHealthSite", "description": "Hypertension can seriously impact your health and even cause a heart attack. Here are some alternative therapies that you could practice safely.", "url": "https://www.thehealthsite.com/webstories/diseases-conditions/world-hypertension-day-8-alternative-therapies-to-reduce-symptoms-978718/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/05/hags.jpg", "publishedAt": "2023-05-17T12:28:20Z", "content": "breathing exercises are very effective to lower blood pressure, relieve stress, and promote overall health.\r\nSource: Thehealthsite"}, {"source": {"id": null, "name": "Next Avenue"}, "author": "Emily Hulse", "title": "Is Vitamin D Key in Managing Mental Health? - Next Avenue", "description": "A healthy vitamin D level may make all the difference in mood and mental well-being", "url": "https://www.nextavenue.org/vitamin-d-managing-mental-health/", "urlToImage": "https://media.tpt.cloud/nextavenue/uploads/2023/05/vitaminD-mentalhealth.jpg", "publishedAt": "2023-05-17T12:09:49Z", "content": "A healthy vitamin D level may make all the difference in mood and mental well-beingVitamin D is a core micronutrient that enhances our health in various ways. Everything from our bones to our muscles… [+5744 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumedha Tripathi", "title": "Here Are The Psychological Effects Caused Due To Hair Loss And How One Can Tackle It - Indiatimes.com", "description": "Most of us have heard the phrase \"having a bad hair day,\" and while this may have earned its relevance and popularity due to pop culture, one cannot deny the importance of our lustrous mane. Basically, the phrase itself defines the direction of the day based …", "url": "https://www.indiatimes.com/lifestyle/mental-health/psychological-effects-caused-due-to-hair-loss-602818.html", "urlToImage": "https://im.indiatimes.in/content/2023/May/hairloss-psychological-effects_64646c32eab3e.jpg", "publishedAt": "2023-05-17T12:08:01Z", "content": "Most of us have heard the phrase \"having a bad hair day,\" and while this may have earned its relevance and popularity due to pop culture, one cannot deny the importance of our lustrous mane. Basicall… [+7066 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Can long conversations on cellphone lead to high blood pressure? Experts explain - Hindustan Times", "description": "A recent study said that talking for 30 minutes or more on cellphone could put one at increased risk of hypertension. Experts are however divided. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-hypertension-day-long-conversations-on-cellphone-could-lead-to-high-blood-pressure-says-study-101684324121110.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/17/1600x900/cellphone_1684324322747_1684324336654.jpg", "publishedAt": "2023-05-17T11:59:42Z", "content": "Long conversations with family and friends over cellphone could be raising your risk of high blood pressure. A recent study published in European Heart Journal Digital Health found that talking for h… [+4797 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "14% elderly suffers psychological health issues, MLNMC study - Hindustan Times", "description": "PRAYAGRAJ: Advancements in the field of medical science have led to higher life expectancy among people", "url": "https://www.hindustantimes.com/cities/others/psychological-health-issues-among-elderly-in-prayagraj-study-reveals-causes-and-recommendations-for-action-101684323831088.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/17/1600x900/14--elderly-suffers-psychological-health-issues--M_1684323823057.jpeg", "publishedAt": "2023-05-17T11:43:50Z", "content": "PRAYAGRAJ: Advancements in the field of medical science have led to higher life expectancy among people. The average life expectancy, which was 62 years and six months in 2000, has increased to 66 ye… [+3529 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Uddipta Banerjee", "title": "What causes side-effects in Vitamin supplements? - The Indian Express", "description": "What causes side-effects in Vitamin supplements?", "url": "https://indianexpress.com/web-stories/wellness/what-causes-side-effects-in-vitamin-supplements/", "urlToImage": "https://images.indianexpress.com/2023/05/Untitled-design-2023-05-12T143506.218.jpg", "publishedAt": "2023-05-17T11:29:02Z", "content": "The side effects of supplements can often be attributed to factors such as incorrect dosage, interactions with medications, or underlying health conditions. \r\nAdjusting the dosage or switching to a d… [+747 chars]"}, {"source": {"id": null, "name": "Jagrantv.com"}, "author": "Ayushee Joshi", "title": "World Hypertension Day 2023: More than 30 minutes on phone can cause High BP; Know what study says - Jagran TV", "description": "Many of us talk on our phones for hours each day, whether it’s for personal or professional reasons or just to catch up with our friends and loved ones. But ...", "url": "https://www.jagrantv.com/en-show/world-hypertension-day-2023-can-long-duration-phone-calls-cause-high-bp-know-what-study-says-rc1042082", "urlToImage": "https://i.ytimg.com/vi/qwQb0YV-u4A/maxresdefault.jpg", "publishedAt": "2023-05-17T10:34:00Z", "content": "Many of us talk on our phones for hours each day, whether its for personal or professional reasons or just to catch up with our friends and loved ones. But have you ever questioned whether this might… [+765 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Oxytocin deficiency found in patients with vasopressin deficiency - Open Access Government", "description": "Researchers have discovered an oxytocin deficiency in patients with vasopressin deficiency caused by a pituitary gland disease", "url": "https://www.openaccessgovernment.org/oxytocin-deficiency-found-patients-vasopressin-deficiency/159124/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2023/05/iStock-615993828-scaled.jpg", "publishedAt": "2023-05-17T10:13:02Z", "content": "For the first time, a team from the University of Basel and the University Hospital of Basel have succeeded in demonstrating oxytocin deficiency in patients with a deficiency of vasopressin caused by… [+2845 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Shireen Jamooji", "title": "5 Dinner Ideas To Help With Weight Loss - Slurrp", "description": "In our quest to achieve weight loss goals, we mustn't perceive food as mere fuel. Instead, let us embrace it as an integral part of the journey, full of delicious possibilities. These meals will help you shed the extra pounds while still feeling indulgent.", "url": "https://www.slurrp.com/article/5-dinner-ideas-to-help-with-weight-loss-1684310681280", "urlToImage": "https://images.slurrp.com/prodarticles/arma2mm0j6.webp", "publishedAt": "2023-05-17T10:05:59Z", "content": "In the quest to shed those extra pounds, we often find ourselves grappling with countless diets, elaborate exercise routines, and an overwhelming abundance of conflicting advice. Yet, we often overlo… [+1607 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Adam Meyer", "title": "7 Worst Daily Habits for Your Joints as You Age - Eat This, Not That", "description": "An ACE-certified personal trainer shares seven of the worst daily habits for your joints as you age so you know what to fix in your routine.", "url": "https://www.eatthis.com/worst-daily-habits-for-joints/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/05/man-shoulder-joint-pain.jpg?quality=82&strip=all", "publishedAt": "2023-05-17T10:00:15Z", "content": "Changes in your body are the name of the game as you get older, and one area that can be particularly affected is your joints. The wear and tear on your joints over time can cause various health issu… [+5918 chars]"}, {"source": {"id": null, "name": "New Food"}, "author": null, "title": "Researchers create genetically modified “allergen-free” eggs - New Food", "description": "Scientists at Hiroshima University have developed a chicken egg that they claim “may be safe for people with egg white allergies”", "url": "https://www.newfoodmagazine.com/news/192458/researchers-create-genetically-modified-allergen-free-eggs/", "urlToImage": "https://www.newfoodmagazine.com/wp-content/uploads/shutterstock_250375228-scaled.jpg", "publishedAt": "2023-05-17T07:59:42Z", "content": "Posted: 17 May 2023 | Grace Galler | No comments yet\r\nScientists at Hiroshima University have developed a chicken egg that they claim may be safe for people with egg white allergies\r\nResearchers at H… [+3691 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Shireen Jamooji", "title": "6 Energy-Boosting Afternoon Snacks To Beat The Mid-Day Slump - Slurrp", "description": "If you find yourself feeling low and lethargic as the day goes on, then you probably need an extra dose of afternoon energy. Rather than reaching for the coffee, try these simple snacks that pack in everything you need for a healthy refreshment.", "url": "https://www.slurrp.com/article/6-energy-boosting-afternoon-snacks-to-beat-the-mid-day-slump-1684308456651", "urlToImage": "https://images.slurrp.com/prodarticles/4v4u4nji75c.webp", "publishedAt": "2023-05-17T07:31:38Z", "content": "An afternoon snack can work wonders when it comes to replenishing your energy levels and banishing that midday fatigue. As the day progresses, our bodies naturally experience a dip in energy due to v… [+2083 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Sangati Jogwar", "title": "Foods that can help in managing endometriosis, know here - OTV News", "description": "Endometriosis is a very painful condition in women that if neglected can cause serious consequences.", "url": "https://odishatv.in/news/health/foods-that-can-help-in-managing-endometriosis-know-here-204063", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/recent_photo_1683825310.webp", "publishedAt": "2023-05-17T05:10:35Z", "content": "Endometriosis is a very painful issue that affects women. It is caused when tissue that is similar to the inner lining of the uterine grows outside the uterus. Although a few studies link food with e… [+1940 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "World Hypertension Day: How to monitor your blood pressure at home - Health shots", "description": "High blood pressure can lead to heart diseases and stroke if left untreated. Here's how you can monitor your blood pressure at home without any hassle to keep your levels in check.", "url": "https://www.healthshots.com/how-to/world-hypertension-day-how-to-measure-blood-pressure-at-home/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/05/17075632/BP-1.jpg", "publishedAt": "2023-05-17T03:29:54Z", "content": "High blood pressure or hypertension occurs when the pressure of blood pushing against the walls of your arteries is too much for them to handle. An increase in your blood pressure levels can increase… [+3949 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": null, "title": "Do you have high cholesterol? Add these foods to lower your LDL cholesterol levels - msnNOW", "description": "Long-term high cholesterol can increase the risk of cardiovascular disease and stroke. Low-density lipoprotein (LDL) cholesterol, sometimes known as \"bad\" cholesterol, can cause plaque to develop in the artery walls if its concentration is too high. A heart a…", "url": "https://newsable.asianetnews.com/lifestyle/do-you-have-high-cholesterol-add-these-foods-to-lower-your-ldl-cholesterol-levels-rba-rur1w9", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bhI7a.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-17T02:00:35Z", "content": "Long-term high cholesterol can increase the risk of cardiovascular disease and stroke. Low-density lipoprotein (LDL) cholesterol, sometimes known as \"bad\" cholesterol, can cause plaque to develop in … [+2290 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Raha Jamal", "title": "The Role of Nutrition in Fitness and Weight Management - Sportskeeda", "description": "Nutrition plays a crucial role in fitness and weight management.", "url": "https://www.sportskeeda.com/health-and-fitness/the-role-nutrition-fitness-weight-management", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/05/e607f-16842620223114-1920.jpg", "publishedAt": "2023-05-16T21:04:00Z", "content": "Nutrition plays a crucial role in fitness and weight management.When it comes to achieving fitness goals and maintaining a healthy weight, while exercise is important for physical fitness, proper nut… [+4015 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "Dr. Abrar Ul Haq Wani", "title": "Healing wounds smartly by smartphones - Greater Kashmir", "description": "Medical services still face snags in treating chronic wounds despite impressive advancements in wound care. The healthcare system has expressed disquiet over th", "url": "https://www.greaterkashmir.com/todays-paper/op-ed/healing-wounds-smartly-by-smartphones", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-10%2F015d9e31-4f7e-46a5-85db-f7fe3a42d9a3%2Fphone_869669_1280.webp?rect=0%2C61%2C1280%2C672&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-05-16T19:16:23Z", "content": "Smartphone-based wound dressing\r\nHealthcare systems now have the chance to pursue changes in wound treatment thanks to the deployment of smartphone-based technology in medical settings. \r\nThe entire … [+2993 chars]"}, {"source": {"id": null, "name": "Supermarket Perimeter"}, "author": "Jeff Gelski", "title": "WHO advises against the use of non-sugar sweeteners - Supermarket Perimeter", "description": "<p>The recommendation does not apply to low-calorie sugars and polyols (sugar alcohols), which are sugars or sugar derivatives containing calories and thus not considered non-sugar sweeteners.</p>", "url": "https://www.supermarketperimeter.com/articles/9718-who-advises-against-the-use-of-non-sugar-sweeteners", "urlToImage": "https://www.supermarketperimeter.com/ext/resources/2021/12/21/SugarCubes_Lead.png?height=635&t=1684251365&width=1200", "publishedAt": "2023-05-16T15:36:37Z", "content": "GENEVA The World Health Organization on May 15 released a new guideline that recommends against the use of non-sugar sweeteners to control body weight or reduce the risk of non-communicable diseases.… [+4675 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Know The Types, Causes, and Heart Disease Symptoms - Emergency Live International", "description": "Heart disease is a general term for a set of heart problems. The heart is a vital organ in the body, and any illness affecting it is life...", "url": "https://www.emergency-live.com/health-and-safety/know-the-types-causes-and-heart-disease-symptoms/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2022/01/cuore-bambini-sindrome-di-brugada-1.jpg", "publishedAt": "2023-05-16T14:15:03Z", "content": "There are many types of cardiovascular disease, and each one has its own symptoms and treatment.\r\nSome cardiovascular diseases are preventable, and most are manageable with proper treatment.\r\nLets fi… [+12709 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss Tips: 8 Things To Keep In Mind When Trying To Follow A Healthy Diet - NDTV", "description": "A balanced healthy diet, combined with regular physical activity, is essential for achieving and maintaining a healthy weight and reducing the risk of obesity-related health problems.", "url": "https://www.ndtv.com/health/weight-loss-tips-8-things-to-keep-in-mind-when-trying-to-follow-a-healthy-diet-4039544", "urlToImage": "https://c.ndtvimg.com/2021-04/835n54u_healthy-diet_625x300_13_April_21.jpg", "publishedAt": "2023-05-16T13:27:42Z", "content": "Your diet should include a variety of foods from all the food groups\r\nA healthy diet and weight loss are inextricably linked because a healthy diet helps in weight loss and maintenance in several way… [+3374 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Blood samples can predict kidney disease with type 2 diabetes patients: Research - Northeast Now", "description": "The research included detailed data from more than 1,200 patients with type 2 diabetes from the Hong Kong Diabetes Register.", "url": "http://nenow.in/health/blood-samples-can-predict-kidney-disease-with-type-2-diabetes-patients-research.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/05/Blood-samples.png", "publishedAt": "2023-05-16T13:20:51Z", "content": "Diabetes is the leading cause of kidney failure worldwide. The study helps to develop computational models to help doctors optimize the treatment of type 2 diabetes to prevent kidney disease. The stu… [+1219 chars]"}, {"source": {"id": null, "name": "Cityairnews.com"}, "author": "City Air News", "title": "Hypertension is now increasingly seen in younger population: expert - Cityairnews", "description": "Dr. Ruchir Kumar Rastogi, senior cardiologist consultant at Ivy Hospital, Mohali said that hypertension is now increasingly seen in the younger population as a result of intake of processed junk food and stressful lifestyle.", "url": "https://www.cityairnews.com/content/hypertension-is-now-increasingly-seen-in-younger-population-expert", "urlToImage": "https://www.cityairnews.com/uploads/images/image_750x_5e15b93be6415.jpg", "publishedAt": "2023-05-16T12:39:56Z", "content": "Chandigarh, May 16, 2023: “It is estimated that 33% urban and 25% rural Indians suffer from blood pressure problems and only 25-40% of these are being detected and treated adequately,”\r\nDr. Ruchir Ku… [+1005 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "Eggs To Bananas: 7 Weight-Loss Friendly Foods To Have - Slurrp", "description": "Eggs To Bananas: 7 Weight-Loss Friendly Foods To HaveEggs To Bananas: 7 Weight-Loss Friendly Foods To HaveBy Tanisha SalwanEggsEggs are a great source of", "url": "https://www.slurrp.com/web-stories/eggs-to-bananas-7-weight-loss-friendly-foods-to-have/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/05/16162632/cropped-ledd-2.webp", "publishedAt": "2023-05-16T10:59:06Z", "content": "Again because of its fiber content, flax seeds keep stomach full for a longer time and prevent hunger pangs."}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora, Times Now Digital", "title": "8 Foods That Make You Feel Hungrier After Eating - Times Now", "description": "", "url": "https://www.timesnownews.com/web-stories/health/8-foods-that-make-you-feel-hungrier-after-eating/photostory/100274922.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100274937,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-05-16T09:39:21Z", "content": "For those trying to drop extra kilos, low-fat yogurt may not necessarily be the perfect choice. It has high sugar levels which make one feel hungry too fast."}, {"source": {"id": null, "name": "WION"}, "author": "Kirtika Katira", "title": "Addressing mental health improves skin health and boosts confidence, says dermatologist | Exclusive - WION", "description": "Addressing mental health improves skin health and boosts confidence, says dermatologist | Exclusive", "url": "https://www.wionews.com/entertainment/lifestyle/news-addressing-mental-health-improves-skin-health-and-boosts-confidence-says-dermatologist--exclusive-592860", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/05/16/352073-untitled-design-2023-05-16t125817928.jpg", "publishedAt": "2023-05-16T07:21:47Z", "content": "In today's fast-paced and demanding world, mental health has become a topic of great importance. The challenges of everyday life can take a toll on our well-being, affecting both our mental and physi… [+6101 chars]"}]}