{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Changing Lifestyle and Its Impact on Health - Rising Kashmir", "description": "An unhealthy lifestyle can lead to challenges such as metabolic disorders, joint and bone problems, cardio-vascular diseases, hypertension, obesity, violence, and so on", "url": "https://www.risingkashmir.com/displaynews.aspx?news=113930", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637966736919503014_Image_OP_1_-_2022-08-21T224441.882.png", "publishedAt": "2022-08-21T19:38:41Z", "content": "Lifestyle is a way of life that is formed by certain geographical, economic, cultural, and religious texts. The features of residents of territory at a specific period and place are referred to as li… [+5328 chars]"}, {"source": {"id": null, "name": "Newsazi.com"}, "author": "Justine", "title": "How To Lose The Last 10 Pounds Fast - News Azi", "description": "Whether you’re just getting back on track with your weight loss goals, or you’ve been at it for a while now, you may have noticed that the last 5 to 10 pounds feel like the hardest to lose. You’re not imagining it. The truth is plateaus on the scale", "url": "https://newsazi.com/how-to-lose-the-last-10-pounds-fast/", "urlToImage": "https://onbetterliving.com/wp-content/uploads/2022/06/Jog_result.jpg", "publishedAt": "2022-08-21T19:00:13Z", "content": "Whether youre just getting back on track with your weight loss goals, or youve been at it for a while now, you may have noticed that the last 5 to 10 pounds feel like the hardest to lose. Youre not i… [+21507 chars]"}, {"source": {"id": null, "name": "Augusta Free Press"}, "author": "All content written by Dr. John Pezos", "title": "Oprah Winfrey Keto Gummies Reviews: Before & After 2022 - Augusta Free Press", "description": "Oprah Winfrey Weight Loss %%currentyear%% ✓ Does Oprah Winfrey Weight Loss Keto Gummies work? ✓ Oprah Winfrey Weight Loss Keto Gummies Side Effects ✓", "url": "https://augustafreepress.com/keto/oprah-winfrey-keto-gummies/", "urlToImage": "https://augustafreepress.com/wp-content/uploads/2022/08/Oprah-Winfrey-Logo.jpg", "publishedAt": "2022-08-21T18:53:42Z", "content": "One of the most trending topics in our modern lives is the issue surrounding a healthy lifestyle. It’s no longer news that obesity has now become an epidemic facing a large percentage of the global p… [+24911 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Covid in Children: Increased Risks of Brain Disorder, Epilepsy Months After Infection - India.com", "description": "Just after the emergence of the Delta variant, increased risks of ischaemic stroke, epilepsy or seizures, cognitive deficit, insomnia, and anxiety disorders were observed, compounded by an increased death rate.", "url": "https://www.india.com/health/covid-in-children-increased-risks-of-brain-disorder-epilepsy-months-after-infection-5585665/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/04/covid-in-children.jpg", "publishedAt": "2022-08-21T18:37:08Z", "content": "New Delhi: Coronavirus has affected the health of adults across nations in long term. But children who suffered from Covid-19 are also at an increased risk of cognitive deficit, insomnia, ischaemic s… [+2243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "'Testing only way to confirm swine flu infection; follow precautions advised for Covid': Epidemiologist Dr Lancelot Pinto - The Indian Express", "description": "In 2020, Maharashtra had witnessed 129 swine flu cases with three deaths; the next year, it recorded 387 cases and two deaths due to the infection.", "url": "https://indianexpress.com/article/cities/mumbai/testing-confirm-swine-flu-infection-precautions-covid-epidemiologist-8103775/", "urlToImage": "https://images.indianexpress.com/2022/08/swine-flu-1200-1.jpg", "publishedAt": "2022-08-21T18:09:48Z", "content": "Maharashtra is witnessing a big jump in swine flu cases this year. In 2020, the state had witnessed 129 swine flu cases with three deaths; the next year, it recorded 387 cases and two deaths due to t… [+4826 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Red wine, olive oil and green tea can help you fight COVID: Expert explains why | Mint - Mint", "description": "An essential enzyme for viral replication is the papain-like protease (PLpro) A cell that has been taken over by a coronavirus is compelled to produce the components for fresh virus particles", "url": "https://www.livemint.com/news/india/red-wine-olive-oil-and-green-tea-can-help-you-fight-covid-expert-explains-why-11661100887113.html", "urlToImage": "https://images.livemint.com/img/2022/08/21/600x338/Red_wine_1644992067325_1661101701853_1661101701853.jpg", "publishedAt": "2022-08-21T17:09:35Z", "content": "Three naturally occurring substances found in foods like red wine, olive oil, and green tea are promising candidates for the creation of coronavirus-fighting medications. DESY's PETRA III X-ray sourc… [+4771 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Acute Pancreatitis, Shock, and Multiple Organ Dysfunction Syndrome in Scrub Typhus - Cureus", "description": "Scrub typhus is an endemic disease caused by the bites of infected chiggers (larval mites) harboring causative bacteria Orientia tsutsugamushi. Acute pancreatitis is a rare but occasionally fatal complication of scrub typhus infection caused by vascular and p…", "url": "https://www.cureus.com/articles/106681-acute-pancreatitis-shock-and-multiple-organ-dysfunction-syndrome-in-scrub-typhus", "urlToImage": "https://assets.cureus.com/uploads/figure/file/421233/article_river_08f136e00d8911ed948f6df1090465a2-CHEST-XRAY-SCRUB-TYPHUS.png", "publishedAt": "2022-08-21T17:06:32Z", "content": "Scrub typhus is an endemic disease caused by the bites of infected chiggers (larval mites) harboring causative bacteria Orientia tsutsugamushi. Acute pancreatitis is a rare but occasionally fatal com… [+14532 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Including sugar substitutes in your diet? It might impact gut microbiome, affect blood sugar levels; reveals s - Times Now", "description": "The research team carefully screened over 1300 people for those who strictly avoid non-nutritive sweeteners in their daily lives, and they found a cohort of 120 people to answer this crucial question. Six groups were created from these participants: two were …", "url": "https://www.timesnownews.com/health/including-sugar-substitutes-in-your-diet-it-might-impact-gut-microbiome-affect-blood-sugar-levels-reveals-study-article-93695314", "urlToImage": "https://static.tnn.in/thumb/msid-93695314,imgsize-100,width-1280,height-720,resizemode-75/93695314.jpg", "publishedAt": "2022-08-21T16:45:14Z", "content": "The researchers transferred microbial samples from the study participants to germ-free mice, which have been raised in completely sterile conditions and lack any microbiomes of their own, in order to… [+20 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Try these natural ways to reduce your cholesterol levels - Times Now", "description": "Eating certain food and beverages can increase your bad cholesterol and reduce the good cholesterol which then becomes harmful for the body. Here, take a look at how you can naturally lower your cholesterol levels.", "url": "https://www.timesnownews.com/health/try-these-natural-ways-to-reduce-your-cholesterol-levels-article-93695211", "urlToImage": "https://static.tnn.in/thumb/msid-93695211,imgsize-100,width-1280,height-720,resizemode-75/93695211.jpg", "publishedAt": "2022-08-21T16:23:18Z", "content": "Soluble fibres are the ones that get dissolved in water but they cant be digested by the human body. Including these fibres can help the good bacteria in the gut which can eventually work to lower th… [+26 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Associated Press", "title": "Polio in US, UK and Israel reveals rare risk of oral vaccine - The New Indian Express", "description": "The latest incidents represent the first time in several years that vaccine-connected polio virus has turned up in rich countries.", "url": "https://www.newindianexpress.com/world/2022/aug/21/polio-in-us-uk-and-israel-reveals-rare-risk-of-oral-vaccine-2489907.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2018/4/17/w600X390/Nigeria_Kid-AP.jpg", "publishedAt": "2022-08-21T15:08:00Z", "content": "LONDON: For years, global health officials have used billions of drops of an oral vaccine in a remarkably effective campaign aimed at wiping out polio in its last remaining strongholds typically, poo… [+12514 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Mihir Merchant", "title": "Betamethasone may reduce side effects of radiation therapy for Prostate cancer: Study - Republic World", "description": "Luksana Chaiswing, University of Kentucky College of Medicine led the study which showed that betamethasone makes cancer cells susceptible to radiation therapy.", "url": "https://www.republicworld.com/technology-news/science/betamethasone-may-reduce-side-effects-of-radiation-therapy-for-prostate-cancer-study-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/dzit76hc9rhatniy_1661088677.jpeg", "publishedAt": "2022-08-21T14:51:00Z", "content": "The steroid betamethasone may be used to reduce the side effects caused by radiation therapy for prostate cancer, according to a recent study published by the University of Kentucky Markey Cancer Cen… [+2239 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New clinical trial at a US University finds new way to treat kidney cancer - ANI News", "description": "Dallas (Texas) [US], August 21 (ANI): There are many different types of kidney cancer, and they can manifest with a few small metastases or many large ones. Today, though, every patient receives the same care. All of them are given medication.", "url": "https://www.aninews.in/news/health/new-clinical-trial-at-a-us-university-finds-new-way-to-treat-kidney-cancer20220821201129", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220821144117.jpg", "publishedAt": "2022-08-21T14:41:47Z", "content": "Dallas (Texas) [US], August 21 (ANI): There are many different types of kidney cancer, and they can manifest with a few small metastases or many large ones. Today, though, every patient receives the … [+2970 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Impact Of Poor Muscle Health On Your Body's Immunity - Morung Express", "description": "New Delhi, August 21 (IANSlife) Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune system even more so to prevent mino", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2022/08/14535882_1661081447_91f45cf237645ca1835b480d7954f3d8.jpg", "publishedAt": "2022-08-21T14:40:20Z", "content": "New Delhi, August 21 (IANSlife) Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses n… [+3721 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Hypertension among COVID-19 patients associated with poor prognosis, finds study - Medical Dialogues", "description": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to...", "url": "https://medicaldialogues.in/medicine/news/hypertension-among-covid-19-patients-associated-with-poor-prognosis-finds-study-97833", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/21/181401-hypertension.jpg", "publishedAt": "2022-08-21T14:30:56Z", "content": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to hypertension, but angiotensin-converting enzyme inhibitors (ACEIs)/angiotensin receptor blockers (A… [+2142 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Ultrashort antibiotics course as effective as longer regimen for pneumonia with normal oxygenation:... - Medical Dialogues", "description": "USA: An \"ultrashort\" course of antibiotics has comparable effects to a longer course in individuals...", "url": "https://medicaldialogues.in/pulmonology/news/ultrashort-antibiotics-course-as-effective-as-longer-regimen-for-pneumonia-with-normal-oxygenation-study-97827", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/30/150721-antibiotics.jpg", "publishedAt": "2022-08-21T14:30:44Z", "content": "USA: An \"ultrashort\" course of antibiotics has comparable effects to a longer course in individuals with normal oxygen saturation levels who are treated for potential pneumonia, researchers state in … [+2830 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Omecamtiv mecarbil fails to improve exercise capacity in HFrEF patients: JAMA - Medical Dialogues", "description": "USA: Omecamtiv mecarbil does not notably improve  exercise capacity across a 20-week span in...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/omecamtiv-mecarbil-fails-to-improve-exercise-capacity-in-hfref-patients-jama-97830", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/08/180319-173376-heart-failure.jpg", "publishedAt": "2022-08-21T14:30:01Z", "content": "USA: Omecamtiv mecarbil does not notably improve exercise capacity across a 20-week span in patients with chronic heart failure with reduced ejection fraction (HFrEF) as compared to placebo states a … [+2809 chars]"}, {"source": {"id": null, "name": "Morningstar.com"}, "author": null, "title": "Ivermectin among generic drugs that failed to help COVID-19 patients avoid hospitalization, large study shows - Morningstar", "description": "", "url": "https://www.morningstar.com/news/marketwatch/20220821169/ivermectin-among-generic-drugs-that-failed-to-help-covid-19-patients-avoid-hospitalization-large-study-shows", "urlToImage": "/assets/img/marketwatch.dad5abb.png", "publishedAt": "2022-08-21T14:10:00Z", "content": "Jaimy Lee \r\nThe New England Journal of Medicine trial showed fluvoxamine and metformin also had no impact stopping severe disease \r\nA new study found three generic drugs -- fluvoxamine, which is ofte… [+3735 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Sri Lanka dengue tally nears 50,000, Mosquito control hampered by shortages - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The Sri Lanka National Dengue Control Unit (NDCU) reports that the dengue fever tally in the island nation is just short of 50,000 cases, according to a Sunday Times report today. 49,941 people were admitted to public hospitals for treatm…", "url": "http://outbreaknewstoday.com/sri-lanka-dengue-tally-nears-50000-mosquito-control-hampered-by-shortages-35108/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2018/06/sri-lanka.png", "publishedAt": "2022-08-21T14:03:08Z", "content": "NewsDesk @bactiman63\r\nThe Sri Lanka National Dengue Control Unit (NDCU) reports that the dengue fever tally in the island nation is just short of 50,000 cases, according to a Sunday Times report toda… [+781 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Java Burn Reviews HIDDEN DANGER Coffee Don’t Buy Until See This - The Tribune India", "description": "Do you feel like no matter how much you exercise, you are just not able to get that figure that you have always dreamt of? If you're seeking a natural supplement to aid in your weight-loss efforts, Java Burn might be quite helpful. It was developed by John Ba…", "url": "https://www.tribuneindia.com/news/brand-connect/java-burn-reviews-hidden-danger-coffee-dont-buy-until-see-this-423915", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_1925629320.jpg", "publishedAt": "2022-08-21T13:56:00Z", "content": "Do you feel like no matter how much you exercise, you are just not able to get that figure that you have always dreamt of? If you're seeking a natural supplement to aid in your weight-loss efforts, J… [+9941 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Diabetic Retinopathy May Covariate With Stroke in Diabetes Mellitus - Cureus", "description": "Diabetes mellitus is a chronic metabolic disorder with increasing prevalence per hour. Cataracts are one of the most common eye complications, and they affect all structures of the eye. The incidence of cataracts is increasing in patients with diabetes by sev…", "url": "https://www.cureus.com/articles/108345-diabetic-retinopathy-may-covariate-with-stroke-in-diabetes-mellitus", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_0.png", "publishedAt": "2022-08-21T13:39:43Z", "content": "According to International Diabetes Federation, more than 285 million people are affected worldwide by diabetes mellitus (DM), and this number is expected to rise almost twofold to 439 million by 203… [+22286 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Kayla Garritano", "title": "4 Food and Drink Combinations To Double Weight Loss - Eat This, Not That", "description": "Trying to lose weight? It's important to eat and drink properly. This is what the best food and drink combination for weight loss is.", "url": "http://www.eatthis.com/best-food-drink-combination-weight-loss/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/08/portioned-plate-chicken-rice-fruit-salad.jpg?quality=82&strip=all", "publishedAt": "2022-08-21T13:34:34Z", "content": "When you think about losing weight, your mind might automatically wander to eating less, skipping meals, and developing other unhealthy habits. Instead, it's important to focus on healthier ways to l… [+4113 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Trending on WION | All you need to know about 'very contagious' Tomato flu first detected in India - WION", "description": "Let us take a look at stories generating interest across WION's social media channels.#TrendingOnWION #India #tomatofluAbout Channel: WION The World is One N...", "url": "https://www.youtube.com/watch?v=BOAp5YLHrdw", "urlToImage": "https://i.ytimg.com/vi/BOAp5YLHrdw/maxresdefault.jpg", "publishedAt": "2022-08-21T12:46:40Z", "content": null}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Make Chai healthier and tastier with these add ons | DH Latest News, DH NEWS, Ingredients, Latest News, NEWS, Food , Make Chai healthier and tastier with these add ons, healthier Chai add ons, tastier Chai add ons - East Coast Daily (English)", "description": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to y", "url": "https://www.eastcoastdaily.in/2022/08/21/make-chai-healthier-and-tastier-with-these-add-ons.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/08/chai-lovers-wallpaper.jpg", "publishedAt": "2022-08-21T12:11:00Z", "content": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to … [+1324 chars]"}, {"source": {"id": null, "name": "Globalonlinemony.com"}, "author": "facebook.com/DrDurgesh.kukmar.sisodiya", "title": "Cerebral Cortex of Developing Human Brain Mapped Using High-Quality MRI Scan Data | Global Online Money - Global Online Money", "description": "Scientists have efficiently mapped the floor of the cerebral cortex of the younger human mind in impressively excessive decision. The mapping, executed", "url": "https://globalonlinemony.com/cerebral-cortex-of-developing-human-brain-mapped-using-high-quality-mri-scan-data-2/", "urlToImage": "https://i.gadgets360cdn.com/large/horizon_worlds_avatar_facebook_mark_zuckerberg_thumb_1660995749153.jpg", "publishedAt": "2022-08-21T11:15:53Z", "content": "Scientists have efficiently mapped the floor of the cerebral cortex of the younger human mind in impressively excessive decision. The mapping, executed utilizing high-quality magnetic resonance imagi… [+2787 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals Alzheimer’s may lead to loss of visual memory - ThePrint", "description": "Washington [US], August 21 (ANI): According to a new MIT study, Alzheimer’s disease impacts at least one form of visual memory by deteriorating a recently discovered circuit that connects the image processing areas of each brain hemisphere. The findings of th…", "url": "https://theprint.in/health/study-reveals-alzheimers-may-lead-to-loss-of-visual-memory/1092823/", "urlToImage": null, "publishedAt": "2022-08-21T11:14:05Z", "content": "Washington [US], August 21 (ANI): According to a new MIT study, Alzheimer’s disease impacts at least one form of visual memory by deteriorating a recently discovered circuit that connects the image p… [+5716 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study suggests therapy for treatment-resistant depression - ThePrint", "description": "Washington [US], August 21 (ANI): According to the researchers, deep brain stimulation (DBS) to the superolateral branch of the medial forebrain bundle (MFB), which is linked to reward and motivation. The study revealed metabolic brain changes over 12 months …", "url": "https://theprint.in/health/study-suggests-therapy-for-treatment-resistant-depression/1092821/", "urlToImage": null, "publishedAt": "2022-08-21T11:13:57Z", "content": "Washington [US], August 21 (ANI): According to the researchers, deep brain stimulation (DBS) to the superolateral branch of the medial forebrain bundle (MFB), which is linked to reward and motivation… [+2874 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Health authorities warn against increasing local transmission of monkeypox in Australian states - ETHealthWorld", "description": "According to the health department, symptoms of monkeypox usually begin seven to 14 days after exposure through skin-to-skin contact and can include fever, headache, body aches and a rash or lesions on the genital area.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/health-authorities-warn-against-increasing-local-transmission-of-monkeypox-in-australian-states/93691072", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93691072,imgsize-1077781,width-1200,height-628,overlay-ethealthworld/health-authorities-warn-against-increasing-local-transmission-of-monkeypox-in-australian-states.jpg", "publishedAt": "2022-08-21T10:30:00Z", "content": "Sydney: Health authorities of the Australian state of New South Wales (NSW) on Sunday warned local residents to be vigilant for the symptoms of monkeypox following local transmission of the virus in … [+1741 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Regeneron's Inmazeb and Ridgeback Bio's Ebanga recommended by WHO for Ebola - Medical Dialogues", "description": "Geneva: The World Health Organization (WHO) has recommended two monoclonal antibody treatments...", "url": "https://medicaldialogues.in/news/industry/pharma/regenerons-inmazeb-and-ridgeback-bios-ebanga-recommended-by-who-for-ebola-97803", "urlToImage": "https://medicaldialogues.in/h-upload/2022/04/02/173410-who.jpg", "publishedAt": "2022-08-21T10:00:30Z", "content": "Geneva: The World Health Organization (WHO) has recommended two monoclonal antibody treatments against Ebola, saying the use of such drugs combined with better care had \"revolutionised\" the treatment… [+1085 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medical Dialogues Bureau", "title": "Monkeypox outbreak: ICMR to conduct sero-survey among contacts of patients - Medical Dialogues", "description": "New Delhi: The apex research regulator, the Indian Council of Medical Research (ICMR) may conduct a...", "url": "https://medicaldialogues.in/news/health/monkeypox-outbreak-icmr-to-conduct-sero-survey-among-contacts-of-patients-97804", "urlToImage": "https://medicaldialogues.in/h-upload/2021/08/03/158460-icmr.jpg", "publishedAt": "2022-08-21T09:45:37Z", "content": "New Delhi: The apex research regulator, the Indian Council of Medical Research (ICMR) may conduct a sero-survey among contacts of monkeypox patients to check for the presence of antibodies and find o… [+2623 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Do you know brain gathers threat cues and turns them into fear? Study reveals - ANI News", "description": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGRP is a protein that permits neurons in two distinct sections…", "url": "https://www.aninews.in/news/health/do-you-know-brain-gathers-threat-cues-and-turns-them-into-fear-study-reveals20220821145906", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220821091036.jpg", "publishedAt": "2022-08-21T09:29:00Z", "content": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGR… [+3698 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Are supplements good for PCOS? Women's health experts answer - Hindustan Times", "description": "Women's health experts spill the beans on whether treatment with supplements can help regulate hormonal balances in people with PCOS or improve their insulin sensitivity, insulin resistance, irregular menstrual cycles, missed periods and unpredictable ovulati…", "url": "https://www.hindustantimes.com/lifestyle/health/are-supplements-good-for-pcos-women-s-health-experts-answer-101661073147182.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/pexels-rodnae-productions-6539914_1661073304166_1661073326404_1661073326404.jpg", "publishedAt": "2022-08-21T09:27:37Z", "content": "Polycystic ovarian syndrome or PCOS is a hormonal imbalance caused by the ovaries creating excess male hormones where the ovaries produce unusually high levels of hormones called androgens, which cau… [+1910 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how mosquitoes possess bizarre sense of smell - ThePrint", "description": "Washington [US], August 21 (ANI): According to a recent study, the unconventional way mosquitoes analyse odours may help explain why they are so good at finding humans to bite. The findings of the study were published in the journal Cell. If you’ve ever spray…", "url": "https://theprint.in/science/study-reveals-how-mosquitoes-possess-bizarre-sense-of-smell/1092692/", "urlToImage": null, "publishedAt": "2022-08-21T09:13:21Z", "content": "Washington [US], August 21 (ANI): According to a recent study, the unconventional way mosquitoes analyse odours may help explain why they are so good at finding humans to bite.\r\nThe findings of the s… [+5758 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Blood tests in newly brain-injured patients predict death, severe disability - ETHealthWorld", "description": "This is the first study to examine the association between biomarker levels of these two proteins and all-cause mortality following TBI, says first author Frederick Korley, M.D., PhD, associate professor of emergency medicine at the University of Michigan Med…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/blood-tests-in-newly-brain-injured-patients-predict-death-severe-disability/93689326", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93689326,imgsize-23532,width-1200,height-628,overlay-ethealthworld/blood-tests-in-newly-brain-injured-patients-predict-death-severe-disability.jpg", "publishedAt": "2022-08-21T08:00:00Z", "content": "Washington: A study finds that blood tests taken on the day of a traumatic brain injury can predict which patients are likely to die or survive with severe disability, allowing clinicians to make dec… [+2930 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Cancer-related fatigue a long-term side effect of breast cancer chemotherapy: Study - Hindustan Times", "description": "The study findings indicate that Cancer-related fatigue (CRF), even years after chemotherapy exposure, may distinctly impact balance regardless of a patient's chemotherapy-induced peripheral neuropathy (CIPN) status.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/cancer-related-fatigue-a-long-term-side-effect-of-breast-cancer-chemotherapy-study-101661067018851.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/9e8ac508-34c3-11ec-a581-90b85644888b_1635078300268_1661067995463_1661067995463.jpg", "publishedAt": "2022-08-21T07:49:10Z", "content": "Cancer-related fatigue (CRF) is a long-term side effect of chemotherapy for breast cancer that contributes to create chronic balance difficulties. The study's findings were published in Rehabilitatio… [+4342 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Supplements that compliment women's bone, hormonal and menstrual health - Hindustan Times", "description": "Women of all age groups require an additional nutrient boost along with their regular diet to bridge the nutritional gap that occurs as a result of every month’s menstrual cycle. Here a list of supplements that compliment women's bone, hormonal and menstrual …", "url": "https://www.hindustantimes.com/lifestyle/health/supplements-that-compliment-women-s-bone-health-hormonal-health-menstrual-health-101661066283730.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/pexels-polina-tankilevitch-3873209_1661066495450_1661066513025_1661066513025.jpg", "publishedAt": "2022-08-21T07:32:57Z", "content": "Women are blessed with the gift of bringing new life into the world hence, hormones play a vital role in supporting the reproductive function but imbalances in hormones can affect a woman at any stag… [+3904 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Expert Recommends Getting Tested If One Suffers From Respiratory Problem To Identify Covid-19 Or Seasonal F - News18", "description": "The monsoon season diseases have signs of high fever, fatigue, and joint and muscle pain, which are also the same indications for Covid-19.", "url": "https://www.news18.com/news/lifestyle/expert-recommends-getting-tested-if-one-suffers-from-respiratory-problem-to-identify-covid-19-or-seasonal-flu-5784289.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/shangai-covid-lockdown-reuters-166045796916x9.jpg", "publishedAt": "2022-08-21T07:32:29Z", "content": "Amid the spike in Covid-19 cases across Delhi, the national capital has also seen a rise in seasonal flu cases recently. In addition to seasonal flu, cases of dengue and chikungunya have also rapidly… [+1860 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Deepali Verma", "title": "Tried Alkaline Diet? It's About All Things Fresh - Slurrp", "description": "In an alkaline diet, fruits and vegetables are preferred over foods with more calories and fat", "url": "https://www.slurrp.com/article/tried-alkaline-diet-its-about-all-things-fresh-1661065846770", "urlToImage": "https://images.slurrp.com/prod/articles/1pblwzoppwj.webp", "publishedAt": "2022-08-21T07:26:14Z", "content": "It's natural to believe there might be something to the alkaline diet given all the talk about it. It has a scientific name with a chemistry-based feel to it. You can find simple-to-follow recommenda… [+3906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Indonesia announces its first case of monkeypox | World News - The Indian Express", "description": "The 27-year-old who lives in the capital, Jakarta, had returned from an overseas trip on August 8, Health Ministry spokesperson Mohammad Syahril said in a news conference.", "url": "https://indianexpress.com/article/world/indonesia-announces-its-first-case-of-monkeypox-8102773/", "urlToImage": "https://images.indianexpress.com/2022/08/monkeypox-test.jpg", "publishedAt": "2022-08-21T06:57:21Z", "content": "A man in Indonesia has tested positive for monkeypox, making him the country’s first confirmed case of the disease, authorities said late Saturday.The 27-year-old who lives in the capital, Jakarta, h… [+1680 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Santiago Perez Patrigeon", "title": "Why treating monkeypox like STI adds less to prevention, more to stigma - ThePrint", "description": "A close relative of the variola virus, monkeypox can spread through skin-to-skin contact and sexual intercourse. It’s not an STI, only behaving like one.", "url": "https://theprint.in/health/why-treating-monkeypox-like-sti-adds-less-to-prevention-more-to-stigma/1091026/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/08/Untitled-design-3.jpg", "publishedAt": "2022-08-21T06:19:34Z", "content": "The recent monkeypox global outbreak, now declared by the World Health Organization as a Public Health Emergency of International Concern (PHEIC), is sadly yet another reason for society to stigmatiz… [+4660 chars]"}, {"source": {"id": null, "name": "Thebetterindia.com"}, "author": "Sowmya Mani", "title": "Science Behind New Superfood ‘Kumkum Bhindi’ that Lowers Cholesterol & High BP - The Better India", "description": "A new variety that is as healthy as it is lucrative has a host of benefits to offer -- science says it can keep your metabolism in check, among many other things.", "url": "https://www.thebetterindia.com/295277/new-superfood-variety-of-okra-red-bhindi-health-benefits-on-cholesterol-and-bp-food-science/", "urlToImage": "https://en-media.thebetterindia.com/uploads/2022/08/Untitled-design-2022-08-20T135742.108-1660984132.jpg", "publishedAt": "2022-08-21T05:29:52Z", "content": "Growing up, we were told that eatingbhindi, or okra, makes our mind sharp, and it is a good source of Vitamin A, K, C &amp; B6. In the past few years, another variety of this vegetable has caught eve… [+2498 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Monkeypox scare: Virus DNA spotted on 21 everyday objects, including toilet seat, light switch among others - DNA India", "description": "To conduct this study on monkeypox virus, a team from the CDC used cotton swabs and collect samples from the surface of different objects.", "url": "https://www.dnaindia.com/health/report-monkeypox-scare-virus-dna-spotted-on-21-everyday-objects-including-toilet-seat-light-switch-among-others-2978243", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/21/2531813-2525800-2525092-monkeypox-ians.jpg", "publishedAt": "2022-08-21T04:11:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 21, 2022, 09:45 AM ISTIt is a well-known fact that all objects and places around us are infected with many kinds of bacteria … [+2074 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Cuba confirms first monkeypox case in visitor from Italy - Moneycontrol", "description": "The patient remains in critical condition.", "url": "https://www.moneycontrol.com/news/world/cuba-confirms-first-monkeypox-case-in-visitor-from-italy-9062871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/08/Monkeypox_AFP-770x435.jpg", "publishedAt": "2022-08-21T02:28:08Z", "content": "Cuba confirmed its first case of monkeypox late on Saturday, the country's Public Health ministry said, after detecting the viral disease in a tourist who had arrived from Italy this week.\r\nThe Itali… [+605 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Passive smoking 10th biggest risk factor for cancer, reveals study - The Tribune India", "description": "People living in close proximity to those who smoke tobacco may have a higher risk of cancer as a new study published in The Lancet journal has found that second-hand smoking is the tenth biggest risk factor for the disease.", "url": "https://www.tribuneindia.com/news/world/passive-smoking-10th-biggest-risk-factor-for-cancer-reveals-study-423754", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_267787749.jpg", "publishedAt": "2022-08-21T01:18:00Z", "content": "PTI\r\nWashington, August 20\r\nPeople living in close proximity to those who smoke tobacco may have a higher risk of cancer as a new study published in The Lancet journal has found that second-hand smok… [+1502 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sridhar Vivan", "title": "Body heating up? Might be new normal, say doctors - Bangalore Mirror", "description": "However, Dr SN Aravinda, Consultant - Internal Medicine, Aster RV Hospital was more cautious. “We surely cannot say such high fever is the new normal. Such high temperatures are usually witnessed onl", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/body-heating-up-might-be-new-normal-say-doctors/articleshow/93682789.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-84566,msid-93682840/93682840.jpg", "publishedAt": "2022-08-21T00:30:00Z", "content": "Proper medication, rest and a healthy diet are some lifestyle habits that will help in staying healthyIf youre one of those who has managed to steer clear of any infection in this weather, you are on… [+2811 chars]"}, {"source": {"id": null, "name": "Brighterkashmir.com"}, "author": null, "title": "Heart Disease: Not an Old Age Thing - Brighter Kashmir", "description": "Heart Disease: Not an Old Age Thing", "url": "http://brighterkashmir.com/heart-disease-not-an-old-age-thing", "urlToImage": "http://secure.brighterkashmir.com//images/news/5c67445d-4b1e-47ce-9c41-6c45bbcfd03a.jpg", "publishedAt": "2022-08-20T19:26:24Z", "content": "May 31, 2022. A melodious evening in the City of Joy. Seemingly healthy, Krishnakumar Kunnath (KK) had fans singing along at the Nazrul Mancha auditorium. He had complained of some uneasiness during … [+5188 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Polio Disease | Polio News | Polio Resurgence News | Polio In London And US | English News Live - CNN-News18", "description": "Polio Disease | Polio News | Polio Resurgence News | Polio In London And US | English News Live#polio #poliovirus #englishnewslive", "url": "https://www.youtube.com/watch?v=wDqRu27N2Hk", "urlToImage": "https://i.ytimg.com/vi/wDqRu27N2Hk/hqdefault.jpg", "publishedAt": "2022-08-20T16:21:06Z", "content": null}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Macquarie University’s research offers new hope for early Alzheimer's alert, and a chance to change course - India Education Diary", "description": "Delhi : New collaborative research from Macquarie University and the CSIRO, Australia’s national science agency, has discovered a potential blood biomarker associated with a risk of cognitive decline can appear years before the onset of dementia symp", "url": "https://indiaeducationdiary.in/macquarie-universitys-research-offers-new-hope-for-early-alzheimers-alert-and-a-chance-to-change-course/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2022-08-20T15:47:55Z", "content": "Delhi : New collaborative research from Macquarie University and the CSIRO, Australias national science agency, has discovered a potential blood biomarker associated with a risk of cognitive decline … [+4492 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "According to a study, sugar metabolism is common in cancer - ANI News", "description": "Washington [US], August 20 (ANI): For more than a century, cancer cell metabolism has been regarded as a puzzle. Recent research from Washington University in St. Louis suggests that it may not be an anomaly after all. On August 15, the study was published in…", "url": "https://www.aninews.in/news/lifestyle/fitness/according-to-a-study-sugar-metabolism-is-common-in-cancer20220820191239", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220820134215.jpg", "publishedAt": "2022-08-20T13:42:00Z", "content": "Washington [US], August 20 (ANI): For more than a century, cancer cell metabolism has been regarded as a puzzle. Recent research from Washington University in St. Louis suggests that it may not be an… [+4087 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Chahat Verma", "title": "Top 5 Workout routines that you should never miss - The Tech Outlook", "description": "We are aware that regular exercise improves health. But with so many alternatives and a never-ending supply of information, it's simple to become confused about what actually works. But don't be alarmed. Your body and back are in good hands! Check ou", "url": "https://www.thetechoutlook.com/featured/top-5-workout-routines-that-you-should-never-miss/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/08/Untitled-design-7-5.jpg", "publishedAt": "2022-08-20T10:24:49Z", "content": "We are aware that regular exercise improves health. But with so many alternatives and a never-ending supply of information, it’s simple to become confused about what actually works. But don’t be alar… [+2880 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "WHO Recommends Broad Use of the First Malaria Vaccine Among Children Living in ... - Latest Tweet by World - LatestLY", "description": "The latest Tweet by World Health Organization states, 'WHO recommends broad use of the first malaria vaccine among children living in #malaria endemic areas with moderate to high transmission. The life-saving vaccine has been shown to have high impact in real…", "url": "https://www.latestly.com/socially/world/who-recommends-broad-use-of-the-first-malaria-vaccine-among-children-living-in-latest-tweet-by-world-health-organization-4104352.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/10/World-Health-Organisation-784x441.jpg", "publishedAt": "2022-08-20T09:31:55Z", "content": "WHO recommends broad use of the first malaria vaccine (RTS,S) among children living in #malaria endemic areas with moderate to high transmission. The life-saving vaccine has been shown to have high i… [+670 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Aditi Sharma", "title": "Mental Health: How effective are anti-depressants? New study creates flutter - Zee News", "description": "Pixabay) Depression doesn’t have a single cause Unlike infectious diseases, there isn’t a one-to-one causal relationship or there isn’t a single factor that leads to depression for all.", "url": "https://zeenews.india.com/health/mental-health-how-effective-are-anti-depressants-new-study-creates-flutter-2499385.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/20/1079951-depression-study.jpg", "publishedAt": "2022-08-20T09:30:46Z", "content": "Cutting off ties with friends. Staying in bed all day. Feeling empty and unmotivated. Anyone who notices these signs in their loved ones would probably suspect they are suffering from the dreaded but… [+4934 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Cornell University: Study identifies gut bacteria that regulate cholesterol - India Education Diary", "description": "Certain species of bacteria in the gut interact with and help balance levels of dietary cholesterol by using it to create a molecule that plays important roles in human health, according to a study published August 18 in Nature Microbiology.Animals n", "url": "https://indiaeducationdiary.in/cornell-university-study-identifies-gut-bacteria-that-regulate-cholesterol/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/12/Cornell-University.png?fit=395%2C128&ssl=1", "publishedAt": "2022-08-20T09:10:48Z", "content": "Certain species of bacteria in the gut interact with and help balance levels of dietary cholesterol by using it to create a molecule that plays important roles in human health, according to a study p… [+3931 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Deep Discovery: There Are Many Comparisons Between Modern And Ancient Human Genomes, Suggests Research - Nation World News", "description": "Ancient DNA (aDNA) from fossil remains continues to explain how prevalent neuropsychiatric disorders emerged in modern humans when modern humans became about", "url": "https://nationworldnews.com/deep-discovery-there-are-many-comparisons-between-modern-and-ancient-human-genomes-suggests-research/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Deep-discovery-There-are-many-comparisons-between-modern-and-ancient.jpg", "publishedAt": "2022-08-20T08:44:30Z", "content": "Ancient DNA (aDNA) from fossil remains continues to explain how prevalent neuropsychiatric disorders emerged in modern humans when modern humans became about 500 kilometers away from Neanderthals. Wr… [+3753 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Cheat meals are linked to eating disorders: Research - ANI News", "description": "Toronto [Canada], August 20 (ANI): According to a new study, more than half of men, women, and transgender or gender nonconforming participants consumed at least one \"cheat meal\" over the course of a year, which is the practice of deviating from one's establi…", "url": "https://www.aninews.in/news/lifestyle/food/cheat-meals-are-linked-to-eating-disorders-research20220820141311", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220820084204.jpg", "publishedAt": "2022-08-20T08:43:00Z", "content": "Toronto [Canada], August 20 (ANI): According to a new study, more than half of men, women, and transgender or gender nonconforming participants consumed at least one \"cheat meal\" over the course of a… [+2325 chars]"}, {"source": {"id": null, "name": "Hinditonews.in"}, "author": null, "title": "Fact check: WHO debunks dubious claims made in fake BBC monkeypox graphic - 1 Hindi to News, Hindi News Today Latest News in Hindi, ताजा खबरें, bharat ke samachar", "description": "Fact check: WHO debunks dubious claims made in fake BBC monkeypox graphic hinditonews.in", "url": "https://hinditonews.in/fact-check-who-debunks-dubious-claims-made-in-fake-bbc-monkeypox-graphic/", "urlToImage": "https://th-i.thgim.com/public/news/national/tamil-nadu/159d4n/article65774677.ece/alternates/FREE_1200/Screenshot%202022-08-13%20173747.png", "publishedAt": "2022-08-20T08:36:34Z", "content": "The claims, presented as a graphic, have been attributed to organisations like the BBC, WHO and CDC. \r\nThe post would have you believe, among other things, that monkeypox has been classified as an ai… [+2683 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Andropause: Everything you need to know about 'male menopause' - The Indian Express", "description": "Andropause can begin around the age of 40 or even earlier, and continues till a man turns 70, said Dr Anubha Singh, Gynaecologist and IVF Specialist", "url": "https://indianexpress.com/article/lifestyle/health/andropause-male-menopause-what-is-it-8052592/", "urlToImage": "https://images.indianexpress.com/2022/07/men-health-1200.jpg", "publishedAt": "2022-08-20T05:55:21Z", "content": "A natural process, all women experience menopause after the age of 50. “This is caused due to a decline in the set ovarian reserve,” said Dr Anubha Singh, Gynaecologistand IVF Specialist from Shantah… [+3989 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "Sankha Ghosh", "title": "Stagnant water, bushes in dengue-drive focus - The Statesman", "description": "In a bid to combat dengue, the Siliguri sub-division administration has appealed to residents in rural areas t", "url": "https://www.thestatesman.com/bengal/stagnant-water-bushes-dengue-drive-focus-1503102022.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2021/11/dengue.jpg", "publishedAt": "2022-08-20T05:45:14Z", "content": "In a bid to combat dengue, the Siliguri sub-division administration has appealed to residents in rural areas to check stagnant water and bushes in and around their households at least once a week.\r\nT… [+2041 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Jal khambata", "title": "Researchers discover ‘master key’ to combat all Covid-19 variants - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/world/researchers-discover-master-key-to-combat-all-covid-19-variants", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-08/97e443cd-e163-4d9f-bcd3-ea02fd85b9be/covid_masterkey.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-08-20T03:30:41Z", "content": "New Delhi: More than two-and-a-half years into the coronavirus pandemic, researchers have achieved a breakthrough in their fight against a virus that keeps mutating and evading the immunity response … [+1898 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "West Michigan manufacturer to soon produce monkeypox vaccine - 13 ON YOUR SIDE", "description": "A manufacturer in West Michigan will soon produce the JYNNEOS smallpox and monkeypox vaccine. Grand River Aseptic Manufacturing, also known as GRAM, stepped ...", "url": "https://www.youtube.com/watch?v=UAcv4ADPA2c", "urlToImage": "https://i.ytimg.com/vi/UAcv4ADPA2c/hqdefault.jpg", "publishedAt": "2022-08-20T03:27:13Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "VERIFY: Yes, you can spread monkeypox to your pet but the risk is low - WUSA9", "description": "The CDC recommends avoiding close contact with your pet if you are infected.", "url": "https://www.youtube.com/watch?v=xS7HKj_Bv1s", "urlToImage": "https://i.ytimg.com/vi/xS7HKj_Bv1s/hqdefault.jpg", "publishedAt": "2022-08-20T03:24:54Z", "content": null}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Dengue larvae found at 1.7K Karnal sites, 519 notices issued - The Tribune India", "description": "With the threat of dengue looming in the rainy season, the Health Department has formed six teams which have so far found the larvae of the disease-causing Aedes mosquito at 1,755 places in the district.", "url": "https://www.tribuneindia.com/news/haryana/dengue-larvae-found-at-1-7k-karnal-sites-519-notices-issued-423442", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_2062498725.jpg", "publishedAt": "2022-08-20T01:42:00Z", "content": "Tribune News Service\r\nKarnal, August 19\r\nWith the threat of dengue looming in the rainy season, the Health Department has formed six teams which have so far found the larvae of the disease-causing Ae… [+1896 chars]"}]}