{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study: Positively charged nanomaterials treat obesity anywhere you want - ETHealthWorld", "description": "Two new studies from researchers at Columbia Engineering and Columbia University Irving Medical Center (CUIMC) may have the answer to targeting fat cells depot-specifically and healthily. The papers demonstrate a new method to treat obesity by using cationic …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-positively-charged-nanomaterials-treat-obesity-anywhere-you-want/95960969", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95960969,imgsize-55526,width-1200,height-628,overlay-ethealthworld/study-positively-charged-nanomaterials-treat-obesity-anywhere-you-want.jpg", "publishedAt": "2022-12-03T11:00:00Z", "content": "Washington: Researchers have long been working on how to treat obesity, a serious condition that can lead to hypertension, diabetes, chronic inflammation, and cardiovascular diseases. Studies have al… [+2753 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Research: Laser therapy helps improve short term memory problems - ETHealthWorld", "description": "The right prefrontal cortex of the brain receives the treatment, known as transcranial photobiomodulation (tPBM). It is generally acknowledged that this region is crucial for working memory. The team's experiment demonstrated how, following several minutes of…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/research-laser-therapy-helps-improve-short-term-memory-problems/95960726", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95960726,imgsize-47322,width-1200,height-628,overlay-ethealthworld/research-laser-therapy-helps-improve-short-term-memory-problems.jpg", "publishedAt": "2022-12-03T10:30:00Z", "content": "Birmingham: UK: In a study that was recently published in Science Advances, laser light therapy was found to be successful in enhancing short-term memory.Researchers from Beijing Normal University an… [+3224 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Turbotest Review: Is Turbo Test Worth It? My Experience on Turbotest Testosterone Booster - The Tribune India", "description": "The past half-century has seen a startling decline in the amount of testosterone found in men. Researchers have established a connection between these drops in testosterone levels and exposure to a variety of toxic pollutants that are becoming increasingly wi…", "url": "https://www.tribuneindia.com/news/brand-connect/turbotest-review-is-turbo-test-worth-it-my-experience-on-turbotest-testosterone-booster-457373", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_575889751.jpg", "publishedAt": "2022-12-03T10:22:00Z", "content": "The past half-century has seen a startling decline in the amount of testosterone found in men. Researchers have established a connection between these drops in testosterone levels and exposure to a v… [+10019 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: 7 healthy dates or khajoor recipes for people with diabetes - Hindustan Times", "description": "Diabetics should try combining dates with a source of complex proteins to manage blood sugar levels. Here are some healthy khajoor recipes.", "url": "https://www.hindustantimes.com/lifestyle/recipe/diabetes-7-healthy-dates-or-khajoor-recipes-for-people-with-diabetes-101670059860613.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/03/1600x900/dates_recipes_1670060041502_1670060048971_1670060048971.jpg", "publishedAt": "2022-12-03T09:40:46Z", "content": "If you are a diabetic with a sweet tooth, eating dates or khajoor in moderation can be a healthy choice for you to satisfy your sugar cravings. High on fructose but highly nutritious, dates are a sto… [+4062 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Miami: A healthy gut is key to a healthy life - India Education Diary", "description": "You are sluggish, cannot focus on your work. You are in a bad mood. It could be your gut. The gut—the gastrointestinal system that extends from our mouth to our anus—is not only there to digest food, it has a direct link to the brain through a series", "url": "https://indiaeducationdiary.in/university-of-miami-a-healthy-gut-is-key-to-a-healthy-life/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/08/University-of-Miami.jpg?fit=1024%2C454&ssl=1", "publishedAt": "2022-12-03T08:46:59Z", "content": "You are sluggish, cannot focus on your work. You are in a bad mood. \r\nIt could be your gut. \r\nThe gutthe gastrointestinal system that extends from our mouth to our anusis not only there to digest foo… [+3296 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Lets address inequalities that fuel HIV/AIDS - Sentinelassam - The Sentinel Assam", "description": "Despite the virus being identified in 1984, more than 35 million people have died of HIV or...", "url": "https://www.sentinelassam.com/editorial/lets-address-inequalities-that-fuel-hivaids-626364", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/12/03/418002-blog-02.jpg", "publishedAt": "2022-12-03T08:44:11Z", "content": "World AIDS Day on December 1 is important because it recapitulates for those working in the government and public health space that HIV has not gone away, it still exists - there is still a vigorous … [+7404 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "Cholesterol control: Reduce bad cholesterol, improve your heart health - check 5 tips - Zee News", "description": "Secrets of a LONG life revealed! Want to live for 90 years?  Tips to follow 3. Take a Krill Oil rich Omega 3 supplement The right kind of Omega-3 supplement is one that is quickly absorbed by the body.", "url": "https://zeenews.india.com/health/cholesterol-control-reduce-bad-cholesterol-improve-your-heart-health-check-5-tips-2543363", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/03/1124969-heart-attack-pain-pixabay.jpg", "publishedAt": "2022-12-03T08:20:59Z", "content": "Cholesterol is an essential component of proper metabolic functioning in the body. It is necessary for producing hormones and for the flexibility of the cellular walls in the body. However, there are… [+3151 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "New Treatment By Delhi Doctors Treats Carpal Tunnel Syndrome Without Surgery - Indiatimes.com", "description": "A minimally-invasive treatment for carpal tunnel syndrome that offers effective long-term relief to patients without requiring further surgeries was recently presented by Dr Anindita Bose, senior resident at the University College of Medical Sciences and Guru…", "url": "https://www.indiatimes.com/technology/science-and-future/new-treatment-by-delhi-doctors-treats-carpal-tunnel-syndrome-without-surgery-586344.html", "urlToImage": "https://im.indiatimes.in/content/2022/Nov/Facebook-Image---2022-11-30T181441167_638751d92166e.jpg", "publishedAt": "2022-12-03T08:17:31Z", "content": "A minimally-invasive treatment for carpal tunnel syndrome that offers effective long-term relief to patients without requiring further surgeries was recently presented by Dr Anindita Bose, senior res… [+3006 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Structural Changes in Brain Magnetic Resonance Imaging Associated With Psychogenic Non-epileptic Seizures: An Analytical Cross-Sectional Study - Cureus", "description": "Background\r\n\r\nPsychogenic non-epileptic seizures (PNES) are often seen as indicators of poor motor and sensory function caused by psychological responses to stressful experiences. A seizure might trigger these reactions. The aim of our study was to assess the…", "url": "https://www.cureus.com/articles/126098-structural-changes-in-brain-magnetic-resonance-imaging-associated-with-psychogenic-non-epileptic-seizures-an-analytical-cross-sectional-study", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_3.png", "publishedAt": "2022-12-03T04:39:10Z", "content": "Background\r\nPsychogenic non-epileptic seizures (PNES) are often seen as indicators of poor motor and sensory function caused by psychological responses to stressful experiences. A seizure might trigg… [+26634 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "6 Metabolism-boosting Foods to Lose Belly Fat Fast - Sportskeeda", "description": "Metabolism-boosting foods are ones that provide adequate nutrients required for various functions in the body.", "url": "https://www.sportskeeda.com/health-and-fitness/6-metabolism-boosting-foods-lose-belly-fat-fast", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/12/2365e-16700174614481-1920.jpg", "publishedAt": "2022-12-03T04:14:36Z", "content": "Metabolism-boosting foods are ones that provide adequate nutrients required for various functions in the body. Foods rich in vitamins, minerals, and antioxidants can increase the metabolic rate of th… [+4258 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Alka Jain", "title": "Pune man tests positive for Zika virus. Here's what symptoms he faced | Mint - Mint", "description": "The patient came to Jahangir Hospital with fever, cough, joint pain, and fatigue on November 16.", "url": "https://www.livemint.com/news/india/pune-man-tests-positive-for-zika-virus-here-s-what-symptoms-he-faced-11670039497716.html", "urlToImage": "https://images.livemint.com/img/2022/12/03/600x338/zika_virus_1670040526525_1670040526670_1670040526670.jpg", "publishedAt": "2022-12-03T04:14:32Z", "content": "A 67-year-old man was found positive for the Zika virus in the Bavdhan area of Maharashtra's Pune district, said the health department on Friday. The infected man is a resident of Nashik and had come… [+1806 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Staff Reporter", "title": "Mumbai: HIV tests at major railway stations for World AIDS Day - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/mumbai-hiv-tests-at-major-railway-stations-for-world-aids-day", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2021-11/d0fd57b8-d6a7-4dc2-87d0-17663ca8a68a/AIDS_day.jpeg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-03T04:07:34Z", "content": "The Mumbai Districts AIDS Control Society (MDACS) an autonomous body of the MCGM is implementingthe National AIDS Control Program(NACP)under the guidance of the National AIDS Control Organisation (NA… [+716 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Ipsita Bhattacharya", "title": "High blood sugar: 7 low-carb, 'magic' vegetables people with diabetes can safely eat - Zee News", "description": "Diabetes or high blood sugar can pose a serious threat to ones health if left untreated and uncontrolled. Type 2 diabetes is often caused by poor lifestyle choices and if you want to keep the sugar levels in your blood in check, it is essential to pay special…", "url": "https://zeenews.india.com/health/high-blood-sugar-7-low-carb-magic-vegetables-people-with-diabetes-can-safely-eat-2543256", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/03/1124872-vegetables-carrot-broc-pixa.jpg", "publishedAt": "2022-12-03T04:03:06Z", "content": "High blood sugar management: Diabetes or high blood sugar can pose a serious threat to one's health if left untreated and uncontrolled. Type 2 diabetes is often caused by poor lifestyle choices and i… [+3062 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Covid pandemic altered teens' brains, study finds - EastMojo", "description": "Washington: A new study suggested that pandemic-related stressors have physically aged brains of adolescents', according to a study. The new findings", "url": "http://www.eastmojo.com/world/2022/12/03/covid-pandemic-altered-teens-brains-study-finds/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/05/coronavirus-5028574_1920.jpg?fit=1920%2C982&ssl=1", "publishedAt": "2022-12-03T03:50:00Z", "content": "Washington: A new study suggested that pandemic-related stressors have physically aged brains of adolescents, according to a study.\r\nThe new findings indicate that the neurological and mental health … [+5416 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Traffic Pollution Has Been Associated With an Increased Risk of Dementia - SciTechDaily", "description": "The meta-analysis reviewed 17 studies studying traffic-related air pollution. According to a meta-analysis recently published in Neurology, the medical journal of the American Academy of Neurology, higher exposure to a certain type of traffic-related air poll…", "url": "https://scitechdaily.com/traffic-pollution-has-been-associated-with-an-increased-risk-of-dementia/", "urlToImage": "https://scitechdaily.com/images/Traffic-Jam.jpg", "publishedAt": "2022-12-03T01:13:51Z", "content": "Dementia is a general term referring to the impaired ability to remember, think, or make decisions, which interferes with doing everyday activities.\r\nThe meta-analysis reviewed 17 studies studying tr… [+3119 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Clinical measles cases in A'bad cross 1,000 mark - Ahmedabad Mirror", "description": "Central team submits report on outbreak; stresses on increasing pace of vaccination in winter; 35k kids vaccinated in special drive", "url": "https://ahmedabadmirror.com/clinical-measles-cases-in-abad-cross-1000-mark/81848366.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1670016523759.jpg-org", "publishedAt": "2022-12-03T00:32:26Z", "content": "Central team submits report on outbreak; stresses on increasing pace of vaccination in winter; 35k kids vaccinated in special drive\r\nA day before Gujarat votes in the first phase of assembly election… [+1810 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study assesses the prevalence of residual lung abnormalities following COVID-19 hospitalization - News-Medical.Net", "description": "In a new study published online in the American Thoracic Society's American Journal of Respiratory and Critical Care Medicine, researchers sought to determine the percentage of COVID-19 patients discharged from the hospital who had a type of fibrotic lung dam…", "url": "https://www.news-medical.net/news/20221202/Study-assesses-the-prevalence-of-residual-lung-abnormalities-following-COVID-19-hospitalization.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Respiratory-620x480.jpg", "publishedAt": "2022-12-02T23:32:00Z", "content": "In a new study published online in the American Thoracic Society's American Journal of Respiratory and Critical Care Medicine, researchers sought to determine the percentage of COVID-19 patients disc… [+4374 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Nick Paul Taylor, The Science Advisory Board contributing writer", "title": "Senescent neuron discovery in brains opens path for Alzheimer's drug development - The Science Board", "description": "Scientists at the Salk Institute for Biological Studies have found that neurons from people with Alzheimer's disease show deterioration and undergo a late-life stress process called cellular senescence, while senescent cells could be a way to slow neuroinflam…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5070", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_cell/2022_08_10_18_33_2953_microglia_neuron_Alzheimers_social.jpg", "publishedAt": "2022-12-02T22:01:40Z", "content": "Alzheimer's patients have significantly higher proportions of neurons that express markers of age-related deterioration, according to the research team's paper published December 1 in the journal Cel… [+2793 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Ikaria Lean Belly Juice Reviews UNTOLD TRUTH Read Before Buying - The Tribune India", "description": "It is difficult to reduce weight and get rid of stubborn belly fat, that much is true. This is especially true if your metabolism is slow. What's worst? Today, we lead hectic and demanding lives. Therefore, concentrating all of our efforts on decreasing weigh…", "url": "https://www.tribuneindia.com/news/brand-connect/ikaria-lean-belly-juice-reviews-untold-truth-read-before-buying-457066", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1031531660.jpg", "publishedAt": "2022-12-02T19:48:00Z", "content": "It is difficult to reduce weight and get rid of stubborn belly fat, that much is true. This is especially true if your metabolism is slow. What's worst? Today, we lead hectic and demanding lives. The… [+13332 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "'Kickin Keto Gummies' Reviews - Website Fact Check - Shocking \"Side Effects\" Exposed! - The Tribune India", "description": "Are you searching for a simple, keto-friendly method to supplement your diet regimen? If so, you remain in luck! Kickin Keto Gummies are a delicious as well as convenient method to do simply that. These gummies are made with ACV (apple cider vinegar) as well …", "url": "https://www.tribuneindia.com/news/brand-connect/kickin-keto-gummies-reviews-website-fact-check-shocking-side-effects-exposed-457064", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1325418780.png", "publishedAt": "2022-12-02T19:38:00Z", "content": "Are you searching for a simple, keto-friendly method to supplement your diet regimen? If so, you remain in luck! Kickin Keto Gummies are a delicious as well as convenient method to do simply that. Th… [+8984 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Diabetes Freedom Reviews - Legit Program Results or Fake Customer Hype? - The Tribune India", "description": "Do you want to add decades to your life by reversing type 2 diabetes? George Reilly's innovative type 2 diabetes reversal program, Diabetes Freedom, may help you manage your symptoms better and allow you to live a healthier, more active life.", "url": "https://www.tribuneindia.com/news/impact-feature/diabetes-freedom-reviews-legit-program-results-or-fake-customer-hype-457057", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1919707400.jpg", "publishedAt": "2022-12-02T19:15:00Z", "content": "Do you want to add decades to your life by reversing type 2 diabetes? George Reilly's innovative type 2 diabetes reversal program, Diabetes Freedom, may help you manage your symptoms better and allow… [+6723 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "What is Alpilean? Review the Research! Know the TRUTH Before Buy - The Tribune India", "description": "One of the most commonly asked questions in the world of weight loss supplementation in December 2022 is \"what is Alpilean?\" With an astronomical rise in fame within the heavily-promoted fat burner formulas, the Alpilean pills are at the top of everyone's hol…", "url": "https://www.tribuneindia.com/news/impact-feature/what-is-alpilean-review-the-research-know-the-truth-before-buy-457052", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_766577769.jpg", "publishedAt": "2022-12-02T18:56:00Z", "content": "One of the most commonly asked questions in the world of weight loss supplementation in December 2022 is \"what is Alpilean?\" With an astronomical rise in fame within the heavily-promoted fat burner f… [+14294 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ashley Lyles", "title": "Green Mediterranean Diet Lowers Visceral Adipose Tissue - Medscape", "description": "A green mainly plant-based Mediterranean diet, high in plant-based polyphenols and low in red/processed meat, may be an effective intervention to encourage the regression of visceral adiposity.", "url": "https://www.medscape.com/viewarticle/984931", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_221202_green_tea_800x450.jpg", "publishedAt": "2022-12-02T18:29:12Z", "content": "Visceral adipose tissue is significantly reduced with the green Mediterranean diet (MED), which consists of polyphenols and reduced red meat intake, according to a new analysis of the 18-month Dietar… [+4764 chars]"}, {"source": {"id": null, "name": "Samaaenglish.tv"}, "author": null, "title": "Unsterilized needles, quacks spread HIV/AIDS more than unsafe intercourse - SAMAA English", "description": "Find latest breaking, trending, viral news from Pakistan and information on top stories, weather, business, entertainment, politics, sports and more. For in-depth coverage, Samaa English provides special reports, video, audio, photo galleries, and interactive…", "url": "https://www.samaaenglish.tv/", "urlToImage": "http://www.samaaenglish.tv/_img/social-default.jpg", "publishedAt": "2022-12-02T17:14:32Z", "content": "Subscribe to notifications\r\nGet the latest news and updates from Samaa TV"}, {"source": {"id": null, "name": "Infectiousdiseaseadvisor.com"}, "author": "Maria Arini Lopez, PT, DPT, CSCS, CMTPT", "title": "Molnupiravir May Be Effective Against COVID-19 in Vaccinated, Unvaccinated Adults - Infectious Disease Advisor", "description": "Researchers evaluated the antiviral efficacy of molnupiravir among vaccinated and unvaccinated patients infected with a broad range of COVID-19 variants.", "url": "https://www.infectiousdiseaseadvisor.com/home/topics/covid19/molnupiravir-shows-moderate-antiviral-activity-against-range-of-covid19-variants/", "urlToImage": null, "publishedAt": "2022-12-02T16:55:00Z", "content": "Molnupiravir may have antiviral activity against COVID-19 infection among both vaccinated and unvaccinated adults infected with a variety of SARS-CoV-2 variants, according to study findings published… [+2942 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Anwesha Mitra", "title": "Explained: What is a 'zombie virus' and should you be worried about the revival of a 48,500 year old pathogen? - Times Now", "description": "Pandoravirus yedoma is among one of 13 viruses described in the yet-to-be-peer-reviewed study and sets a new record age for a frozen virus returning to a form where it may infect other creatures.", "url": "https://www.timesnownews.com/explainer/explained-what-is-a-zombie-virus-and-should-you-be-worried-about-the-revival-of-a-48500-year-old-pathogen-article-95939235", "urlToImage": "https://static.tnn.in/thumb/msid-95939235,imgsize-100,width-1280,height-720,resizemode-75/95939235.jpg", "publishedAt": "2022-12-02T16:33:12Z", "content": "Deepak Chahar claims Malaysian Airlines misplaced his luggage, alleges food not served during travel"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Fatty liver disease conditions 'change the healthy heart to a failing heart' - Healio", "description": "CVD risk increases with the severity of nonalcoholic fatty liver disease, and both CV and liver events are &ldquo;highly related&rdquo; to the degree of hepatic fibrosis present, according to a speaker.CVD remains the leading cause of death in adults with non…", "url": "https://www.healio.com/news/cardiology/20221202/fatty-liver-disease-conditions-change-the-healthy-heart-to-a-failing-heart", "urlToImage": "https://www.healio.com/~/media/slack-news/gastroenterology/misc/gastro-stock-images/liver2_adobe.jpg", "publishedAt": "2022-12-02T16:32:38Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCVD risk increases with the severity of … [+5375 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FP News Service", "title": "Madhya Pradesh: Trident Group makes staffers aware about AIDS - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/bhopal/madhya-pradesh-trident-group-makes-staffers-aware-about-aids", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-12/7eebfa28-63f5-44eb-9bdf-f5649f69651e/Narmadapuram_01.JPG?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-02T16:20:05Z", "content": "Narmadapuram (Madhya Pradesh): Trident Limited organised an AIDS awareness camp on the occasion of World AIDS Day on Thursday. \r\nThe camp was held under the banner of Swabhiman Ki Muskan. Director of… [+1295 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Having difficulty sleeping? You might be at risk of type 2 diabetes - ThePrint", "description": "Washington [US], December 2 (ANI): As the Christmas season approaches, University of South Australia researchers are encouraging people to prioritize a good night’s sleep, as new research indicates that poor sleep may be connected with risk factors for type 2…", "url": "https://theprint.in/health/having-difficulty-sleeping-you-might-be-at-risk-of-type-2-diabetes/1246344/", "urlToImage": null, "publishedAt": "2022-12-02T16:14:36Z", "content": "Washington [US], December 2 (ANI): As the Christmas season approaches, University of South Australia researchers are encouraging people to prioritize a good night’s sleep, as new research indicates t… [+1911 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "Tips for Preventing Hair Loss at Home... - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "beauty : Tips for Preventing Hair Loss at Home...\nHair fall has now become like a disease. Anyway, hair falls more in cold and it has become a problem", "url": "https://www.indiaherald.com/Beauty/Read/994556288/Tips-for-Preventing-Hair-Loss-at-Home", "urlToImage": "https://www.indiaherald.com/imagestore/images/beauty/sagittarius_sagittarius/tips-for-preventing-hair-loss-at-home70108026-08c8-4c7f-9a84-e15bf0280827-415x250-IndiaHerald.jpg", "publishedAt": "2022-12-02T15:54:07Z", "content": "Tips for Preventing Hair Loss at Home...\r\nHair fall has now become like a disease. Anyway, hair falls more in cold and it has become a problem for twelve months in Covid infected. The problem of hair… [+1385 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "A study has found that all types of alcohol, including wine, may increase cancer risk - mid-day.com", "description": "The team found that awareness of the alcohol-cancer link was highest for liquor, with 31.2 per cent of adults being aware of the risk, followed by beer (24.9 per cent) and wine (20.3 per cent)", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/all-types-of-alcohols-including-wine-up-cancer-risk-study-23258551", "urlToImage": "https://images.mid-day.com/images/images/2022/dec/wine-istock-dec_d.jpg", "publishedAt": "2022-12-02T15:35:00Z", "content": "The team found that awareness of the alcohol-cancer link was highest for liquor, with 31.2 per cent of adults being aware of the risk, followed by beer (24.9 per cent) and wine (20.3 per cent)\r\nRepre… [+2350 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Penn Medicine, Philadelphia: Penn Scientists Develop 20-Subtype mRNA Flu Vaccine to Protect Against Future Flu Pandemics - India Education Diary", "description": "An experimental mRNA-based vaccine against all 20 known subtypes of influenza virus provided broad protection from otherwise lethal flu strains in initial tests, and thus might serve one day as a general preventative measure against future flu pandem", "url": "https://indiaeducationdiary.in/penn-medicine-philadelphia-penn-scientists-develop-20-subtype-mrna-flu-vaccine-to-protect-against-future-flu-pandemics/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/08/Penn-Medicine-Philadelphia.png?fit=395%2C270&ssl=1", "publishedAt": "2022-12-02T15:22:30Z", "content": "An experimental mRNA-based vaccine against all 20 known subtypes of influenza virus provided broad protection from otherwise lethal flu strains in initial tests, and thus might serve one day as a gen… [+4069 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "ACE Inhibitors reduce CV, renal, and mortality events independent of associated hyperkalemia - Medical Dialogues", "description": "A new study published in Clinical Journal of American Society of Nephrology suggests that regardless of short-term changes in serum potassium levels, continuing angiotensin-converting enzyme (ACE)...", "url": "https://medicaldialogues.in/nephrology/news/ace-inhibitors-reduce-cv-renal-and-mortality-events-independent-of-associated-hyperkalemia-103237", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/31/177591-4559-pills-1296x728-header.jpg", "publishedAt": "2022-12-02T15:00:00Z", "content": "A new study published in Clinical Journal of American Society of Nephrology suggests that regardless of short-term changes in serum potassium levels, continuing angiotensin-converting enzyme (ACE) in… [+3033 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Neutrophil gelatinase-associated lipocalin and Hs CRP may detect AKI in diabetic children - Medical Dialogues", "description": "A recent study found that levels of Neutrophil gelatinase-associated lipocalin and highly sensitive C reactive protein can be used to detect early acute kidney injury in children with type 1...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/neutrophil-gelatinase-associated-lipocalin-and-hs-crp-may-detect-aki-in-diabetic-children-103171", "urlToImage": "https://medicaldialogues.in/h-upload/2021/01/25/146591-type-1-diabetes.jpg", "publishedAt": "2022-12-02T14:30:35Z", "content": "A recent study found that levels of Neutrophil gelatinase-associated lipocalin and highly sensitive C reactive protein can be used to detect early acute kidney injury in children with type 1 diabetes… [+2397 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanotech Strategy Could Suppress Genetic Arthritis in Mice, Suggests New Study - AZoNano", "description": "A team of researchers at Scripps Research announce successful preliminary tests of a new, nanotechnology-based approach against autoimmune diseases in the November 23rd, 2022, issue of ACS Nano.", "url": "https://www.azonano.com/news.aspx?newsID=39951", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39951_16699896248079405.jpg", "publishedAt": "2022-12-02T14:08:00Z", "content": "Dec 2 2022Reviewed by Alex Smith\r\nA team of researchers at Scripps Research announce successful preliminary tests of a new, nanotechnology-based approach against autoimmune diseases in the November 2… [+4922 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Mahender", "title": "Diagnosis and Treatment for Ewing Sarcoma: A rare type of bone malignancy in children - NewsPatrolling", "description": "Dr. Sushant Ikhar, Consultant Medical Oncologist, HCG Cancer Centre Nagpur Childhood is a critical period for the development of strong, healthy bones. Among children, any complications in the bones will be a life-changing period and can also alter the course…", "url": "https://newspatrolling.com/diagnosis-and-treatment-for-ewing-sarcoma-a-rare-type-of-bone-malignancy-in-children/", "urlToImage": "https://newspatrolling.com/wp-content/uploads/2022/01/health-2.jpg", "publishedAt": "2022-12-02T13:05:28Z", "content": "Dr. Sushant Ikhar, Consultant Medical Oncologist, HCG Cancer Centre Nagpur\r\nChildhood is a critical period for the development of strong, healthy bones. Among children, any complications in the bones… [+4243 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Vitamin D Deficiency can Lead to Early Osteoporosis: Advice by Top10 Bones Specialists - mid-day.com", "description": "", "url": "https://www.mid-day.com/brand-media/article/vitamin-d-deficiency-can-lead-to-early-osteoporosis-advice-by-top10-bones-specialists-23258632", "urlToImage": "https://images.mid-day.com/images/images/2022/dec/Osteoporosis12_d.jpg", "publishedAt": "2022-12-02T12:25:00Z", "content": "1. Dr. Sushrut Babhulkar,\r\nMS (Orth), MCH (Orth) (UK),\r\nSushrut Institute of Medical Sciences, Nagpur.\r\nOsteoporosis is a fairly common problem that makes the bones weak and fractures easily. An opti… [+8505 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Browne", "title": "A Proactive Way to Detect Cancer at Its Earliest Stages - WIRED", "description": "Medtech firm Earli is working on a way to make tumors announce themselves as they appear—and even provide directions to where they are in the body.", "url": "https://www.wired.com/story/making-cancer-reveal-itself/", "urlToImage": "https://media.wired.com/photos/63894dd37c1b7d0edd58fdd5/191:100/w_1280,c_limit/cancer_detection_science_GettyImages-72084578.jpg", "publishedAt": "2022-12-02T12:00:00Z", "content": "In November 2016, German-American entrepreneur Cyriac Roeding read a profile of Sam Gambhir, a physician and scientist at Stanford University School of Medicine, in a magazine. In the article, Gambhi… [+2868 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "4 spices that are great for fighting off cold and cough in winter - Northeast Now", "description": "To stay in good health in these winter months of December, January and February, you should incorporate these five spices in your diet-", "url": "http://nenow.in/health/4-spices-that-are-great-for-fighting-off-cold-and-cough-in-winter.html", "urlToImage": "https://nenow.in/wp-content/uploads/2022/12/4-spices-fighting-off-cold-and-cough-in-winter.png", "publishedAt": "2022-12-02T11:37:06Z", "content": "The season of winter has fully set in now with the arrival of December and some common illnesses such as cough and cold often keeps us away from enjoying nature in its full glory.\r\nWhile medicines ca… [+3324 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amla Health Benefits: From Healthy Liver To Hair Growth, 4 Notable Benefits Of Indian Gooseberry - NDTV", "description": "\"The Indian gooseberry is just the magic pill you need to boost your overall health.\" says nutritionist Lovneet Batra", "url": "https://www.ndtv.com/health/amla-health-benefit-healthy-liver-to-hair-growth-4-notable-benefits-of-indian-gooseberry-3570275", "urlToImage": "https://c.ndtvimg.com/2022-03/2vsju8l8_amla_625x300_23_March_22.jpg", "publishedAt": "2022-12-02T09:59:00Z", "content": "Amla provides us with numerous benefits such as better digestion, diabetes control, hair growth and more\r\nAmla berries include antioxidants and vitamins that have a number of health advantages. Amla … [+2133 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "HGH for Sale Online – How to Buy Best HGH Injections for Men - Deccan Herald", "description": "“To control your hormones is to control your life.” – Dr. Barry Sears The levels of the dozens of hormones in our bodies fluctuate throughout the day, running the complex mechanism that is the human body. Although their impact is significant, you cannot see o…", "url": "https://www.deccanherald.com/brandspot/pr-spot/hgh-for-sale-online-how-to-buy-best-hgh-injections-for-men-1167744.html", "urlToImage": null, "publishedAt": "2022-12-02T09:56:09Z", "content": "To control your hormones is to control your life. Dr. Barry Sears\r\nThe levels of the dozens of hormones in our bodies fluctuate throughout the day, running the complex mechanism that is the human bod… [+14088 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Amit Srivastava", "title": "Navi Mumbai: NMMC identifies four measles-affected areas - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/navi-mumbai-nmmc-identifies-four-measles-affected-areas", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-12/abd362a7-9766-4cbc-b261-4b3ce3bbeb71/measles_su19.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-12-02T08:25:03Z", "content": "Navi Mumbai: The Navi Mumbai Municipal Corporation (NMMC) has identified four measles-affected areas in the city and the civic body will administer an additional dose of vaccinations between 6 months… [+1842 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cut Down On Your Salt Intake For A Healthy Heart, Here's Why - NDTV", "description": "Consuming too much salt can have a negative impact on your heart. Here are some tips that can help lower your intake of salt.", "url": "https://www.ndtv.com/health/heart-health-heres-how-salt-intake-affects-your-heart-health-3570235", "urlToImage": "https://c.ndtvimg.com/2022-09/kn1pbb9_salt_625x300_19_September_22.jpg", "publishedAt": "2022-12-02T07:39:56Z", "content": "Heart Health: High sodium (salt) intake can cause high blood pressure\r\nSodium is an essential part of everyone's diet. It aids in maintaining the right balance of fluid levels in your body and contri… [+4095 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Artificial sweeteners not only shoots up blood sugar levels, but trigger other diseases - Health shots", "description": "Artificial sweeteners are loaded with a lot of side effects, and worsening blood sugar is one of them. Read on understand the link between the two.", "url": "https://www.healthshots.com/healthy-eating/nutrition/artificial-sweeteners-and-their-effect-on-blood-sugar/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/28140508/sweetener.jpg", "publishedAt": "2022-12-02T07:12:33Z", "content": "Cutting down our intake of sugar is one of the first things that we do when we wish to lose weight. Those suffering from diabetes also look for sugar substitutes and often turn to artificial sweetene… [+3233 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Can AIDS Patients Stop The Weakening Of Their Immune Systems? - News18", "description": "HIV is a virus that attacks your body's immune system. When not properly treated or managed, HIV can develop into acquired immunodeficiency syndrome (AIDS)", "url": "https://www.news18.com/news/lifestyle/how-can-aids-patients-stop-the-weakening-of-their-immune-systems-6519175.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/hiv-positive-166979123716x9.jpg", "publishedAt": "2022-12-02T06:56:13Z", "content": "Many misinformation and misconceptions surround the human immunodeficiency virus, otherwise known as HIV. But first, let us understand the difference between HIV and Aids:\r\nHIV is a virus that attack… [+5481 chars]"}, {"source": {"id": null, "name": "Nebusinessmirror.com"}, "author": "", "title": "Air pollution is the leading cause of lung cancer in India: Health experts - North East Business Mirror - North East Business Mirror", "description": "According to a conference organized by the Associated Chambers of Commerce and Industry of India (ASSPCHAM), 'Lung Cancer-Awareness, Prevention, Challenges", "url": "https://nebusinessmirror.com/air-pollution-is-the-leading-cause-of-lung-cancer-in-india-health-experts/", "urlToImage": "https://nebusinessmirror.com/wp-content/uploads/2022/12/WhatsApp-Image-2022-12-02-at-12.06.55-PM.jpeg", "publishedAt": "2022-12-02T06:46:45Z", "content": "According to a conference organized by the Associated Chambers of Commerce and Industry of India (ASSPCHAM), ‘Lung Cancer-Awareness, Prevention, Challenges and Treatment’, air pollution is the main c… [+1637 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "2-dose vaccine offers long-term protection against severe Covid in kids - Daijiworld.com", "description": "New York, Dec 2 (IANS): A two-dose experimental vaccine can provide protection against severe Covid even one year even after the jabs, researchers report.\r\nThe results may reduce the need for frequent boosters and protect special populations that don't have f…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1025342", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-12-02T06:29:17Z", "content": "New York, Dec 2 (IANS): A two-dose experimental vaccine can provide protection against severe Covid even one year even after the jabs, researchers report.\r\nThe results may reduce the need for frequen… [+2055 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "PTI", "title": "Experimental Alzheimer’s drug shows promise - but there are many hurdles still to overcome - ThePrint", "description": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimer’s patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic clumps of amyloid protein associated with the mind-robbing…", "url": "https://theprint.in/world/experimental-alzheimers-drug-shows-promise-but-there-are-many-hurdles-still-to-overcome/1245265/", "urlToImage": null, "publishedAt": "2022-12-02T06:02:04Z", "content": "London, Dec 2 (The Conversation) The first drug that can slow the rate of decline in Alzheimers patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic… [+5015 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "4th Gen Rapid Tests detect more acute HIV infections - BSA bureau", "description": "4th generation testing, equipped with high sensitivity and specificity", "url": "https://www.biospectrumasia.com/news/30/21524/4th-gen-rapid-tests-detect-more-acute-hiv-infections.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/hiv-21524.jpg", "publishedAt": "2022-12-02T05:38:14Z", "content": "Bridging India’s testing gap is essential to strengthen the nation’s infection response and help meet the UNAIDS’ first goal – to diagnose 95 per cent of all HIV-positive patients, which can lead to … [+2443 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "New mRNA vaccines highly effective in reducing malaria infection, transmission: Study - EastMojo", "description": "Washington: Scientists have developed two mRNA vaccine candidates that were highly effective in reducing both malaria infection and transmission in animal", "url": "http://www.eastmojo.com/world/2022/12/02/new-mrna-vaccines-highly-effective-in-reducing-malaria-infection-transmission-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/12/Untitled-design-41.png?fit=1200%2C675&ssl=1", "publishedAt": "2022-12-02T04:50:00Z", "content": "Washington: Scientists have developed two mRNA vaccine candidates that were highly effective in reducing both malaria infection and transmission in animal studies.\r\nThe team from George Washington Un… [+3332 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Padmashree Pande", "title": "When You Struggle To Breathe Every Day: Life With Allergic Rhinitis - The Quint FIT", "description": "Imagine living your life on a timer, to have every minute of your routine mapped down to one task alone – cleaning your nose. As ‘ugh’ as it sounds, welcome to my life. No matter what the weather is, my nose is perennially blocked.", "url": "https://www.thequint.com/fit/when-you-struggle-to-breathe-every-day-life-with-allergic-rhinitis-2", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2F05891a6f-2a8a-4ce7-97f0-b714fd2e26c8%2F5.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-02T04:32:16Z", "content": "In 2020 February, I was on vacation with my cousins in Dubai, UAE. On this particular day on our trip, I remember, we were going to board a ferry to take us to the old city.\r\nBut, from our house in t… [+644 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "New single-dose treatment for sleeping sickness could help eliminate transmission of the disease by 2030 - Medical Dialogues", "description": "Sleeping sickness, or human African  trypanosomiasis (HAT), is a neglected tropical disease, which can be fatal if  left untreated.    A new, single-dose, oral treatment for  sleeping sickness is...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/new-single-dose-treatment-for-sleeping-sickness-could-help-eliminate-transmission-of-the-disease-by-2030-103325", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/30/192596-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-2.jpg", "publishedAt": "2022-12-02T04:15:45Z", "content": "Sleeping sickness, or human African trypanosomiasis (HAT), is a neglected tropical disease, which can be fatal if left untreated.\r\nA new, single-dose, oral treatment for sleeping sickness is as effec… [+1854 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "New genetic mutation behind childhood glaucoma identified - Hindustan Times", "description": "This increase in pressure not only damages the optic nerve but can also affect other structures in a child's eye like the cornea. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/new-genetic-mutation-behind-childhood-glaucoma-identified-101669954231265.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/eye_1_1644416939593_1669954327425_1669954327425.jpg", "publishedAt": "2022-12-02T04:13:42Z", "content": "An international team of researchers led by Mass Eye and Ear, a member of Mass General Brigham and Boston Children's Hospital, has discovered a new genetic mutation that could be the root cause of se… [+6444 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Lack Of Specialised Centres, Social Stigma Weigh On HIV/AIDS... - MENAFN.COM", "description": "(MENAFN - Jordan Times)  AMMAN — Calls are growing to expand psychological and social support for people living with HIV/AIDS in Jordan.The", "url": "https://menafn.com/1105257408/Lack-Of-Specialised-Centres-Social-Stigma-Weigh-On-HIVAIDS-Patients", "urlToImage": "https://menafn.com/updates/pr/2022-12/01/JT_fc9dcimage_story.png", "publishedAt": "2022-12-02T04:07:05Z", "content": "(MENAFN- Jordan Times) AMMAN Calls are growing to expand psychological and social support for people living with HIV/AIDS in Jordan.\r\nThe human immunodeficiency virus (HIV) targets a host's immune sy… [+2599 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Evaluation of glycemic control, arterial stiffness, and hypertension improves risk of macrovascular... - Medical Dialogues", "description": "China: A recent study published in Cardiovascular Diabetology has indicated the clinical importance of the combined evaluation of glycemic and hypertension control and arterial stiffness to", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/evaluation-of-glycemic-control-arterial-stiffness-and-hypertension-improves-risk-of-macrovascular-complications-103314", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/01/192616-diabetes-complications.jpg", "publishedAt": "2022-12-02T04:00:05Z", "content": "China: A recent study published in Cardiovascular Diabetology has indicated the clinical importance of the combined evaluation of glycemic and hypertension control and arterial stiffness to improve t… [+2807 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Measles outbreak: Panic in Malappuram as fresh cases soar - Mathrubhumi English", "description": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, the total number of infected persons touched 239 in Malappuram…", "url": "https://english.mathrubhumi.com/news/kerala/measles-outbreak-panic-in-malappuram-as-fresh-cases-soar-1.8097946", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.8097947:1669952088/vaccination%20(1).jpg?$p=a362ddd&f=16x9&w=1080&q=0.8", "publishedAt": "2022-12-02T03:38:06Z", "content": "Malappuram: As fears of Measles grip Malappuram, the condition has worsened with 35 fresh cases reported in the district on Thursday. At least 20 Measles cases were recorded on Wednesday. By this, th… [+874 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Diabetes in Down Syndrome children: Causes, factors that can increase prevalence - Hindustan Times", "description": "Is down syndrome the reason why we tend to see a rise in diabetes in children? Here's what expert has to say about the causes of diabetes in Down Syndrome children and factors can increase the prevalence of type 2 diabetes in kids | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-in-down-syndrome-children-causes-factors-that-can-increase-prevalence-of-type-2-diabetes-in-kids-101669949120957.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/02/1600x900/pexels-nicola-barts-7943472_1669949379656_1669949406676_1669949406676.jpg", "publishedAt": "2022-12-02T03:38:05Z", "content": "According to health experts, people with Down Syndrome are often diagnosed with diabetes significantly earlier where the average age of diagnosis was 38 compared to 53 in those without Down Syndrome.… [+2740 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Prachi Shah", "title": "Make Singhara a part of your winter diet for these 5 reasons! - Health shots", "description": "Read on to learn about the health benefits of singhara, as well as 5 reasons why you should include this superfood in your winter diet.", "url": "https://www.healthshots.com/healthy-eating/superfoods/water-chestnut-5-health-benefits-of-singhara-during-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/12/01175022/singhara-.jpg", "publishedAt": "2022-12-02T03:29:38Z", "content": "Singhara, also called water chestnut, is a fruit known for being a natural coolant and has a high content of antioxidant properties. This fruit is quite starchy and contains a good amount of fibre. W… [+2698 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Intravenous drug users vulnerable to AIDS - The Tribune India", "description": "The increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence rate in Himachal is relatively low as compared to the national rate.", "url": "https://www.tribuneindia.com/news/himachal/intravenous-drug-users-vulnerable-to-aids-456756", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1178236348.jpg", "publishedAt": "2022-12-02T01:56:00Z", "content": "Tribune News Service\r\nShimla, December 1\r\nThe increasing use of intravenous drugs by addicts in Himachal makes them vulnerable to AIDS. It has become a cause for concern though the AIDS prevalence ra… [+1282 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Harmful gut bacteria co-opt a genetic susceptibility to trigger Crohn’s disease - News-Medical.Net", "description": "Changes in a single gene open the door for harmful gut bacteria to set off the inflammation that drives Crohn’s disease, according to a new study led by Weill Cornell Medicine and NewYork-Presbyterian investigators.", "url": "https://www.news-medical.net/news/20221201/Harmful-gut-bacteria-co-opt-a-genetic-susceptibility-to-trigger-Crohne28099s-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Gastroenterology-620x480.jpg", "publishedAt": "2022-12-01T23:38:00Z", "content": "Changes in a single gene open the door for harmful gut bacteria to set off the inflammation that drives Crohn’s disease, according to a new study led by Weill Cornell Medicine and NewYork-Presbyteria… [+4598 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Don Rauf", "title": "Monkeypox Is Renamed 'Mpox' to Reduce Stigma - Everyday Health", "description": "Monkeypox will now be officially referred to a “mpox,” according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while “monkeypox” is phased out.", "url": "https://www.everydayhealth.com/infectious-diseases/monkeypox-is-renamed-mpox-to-reduce-stigma/", "urlToImage": "https://images.everydayhealth.com/images/monkeypox-is-renamed-mpox-to-reduce-stigma-1440x810.jpg?sfvrsn=be59a73_1", "publishedAt": "2022-12-01T22:03:02Z", "content": "Monkeypox will now be officially referred to as mpox, according to an announcement by the World Health Organization (WHO) on Monday. Both names will be used simultaneously for one year while monkeypo… [+2767 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "5,580 AIDS patients currently registered in Uttarakhand: Health Min - The Siasat Daily", "description": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursday. He was speaking at an awareness rally at the Gandhi Park…", "url": "https://www.siasat.com/5580-aids-patients-currently-registered-in-uttarakhand-health-min-2470173/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/12/Dhan.jpg", "publishedAt": "2022-12-01T16:10:00Z", "content": "Dehradun: There are 5,580 AIDS patients registered in Uttarakhand at present and the HIV infection rate in the state has been reduced to 0.24 per cent, Health Minister Dhan Singh Rawat said on Thursd… [+863 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Scientists link rare genetic phenomenon to neuron function, schizophrenia - TheNewsMill", "description": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia\">schizophrenia, elucidating their contribution to the development of this …", "url": "https://thenewsmill.com/2022/12/scientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=54847&object_id=54847&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2022%252F12%252Fscientists-link-rare-genetic-phenomenon-to-neuron-function-schizophrenia.jpg", "publishedAt": "2022-12-01T15:31:46Z", "content": "Using state-of-the-art whole-genome sequencing and machine learning techniques, researchers conducted one of the first and the largest investigations of tandem repeats in schizophrenia”&gt;schizophre… [+3903 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Women with elevated breast cancer risk could see mortality benefit from estrogen-blocking drugs - EurekAlert", "description": "While it has long been recognized that drugs that block the cancer-promoting activity of estrogen reduce risk of developing new breast cancers, a new computer modeling study led by researchers at Georgetown Lombardi Comprehensive Cancer Center and colleagues …", "url": "https://www.eurekalert.org/news-releases/973023", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-12-01T13:52:30Z", "content": "WASHINGTON – While it has long been recognized that drugs that block the cancer-promoting activity of estrogen reduce risk of developing new breast cancers, a new computer modeling study led by resea… [+7179 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Effect of air pollution on the human immune system - Nature.com", "description": "Inhaled particulates from environmental pollutants accumulate in macrophages in lung-associated lymph nodes over years, compromising immune surveillance via direct effects on immune cell function and lymphoid architecture. These findings reveal the importance…", "url": "https://www.nature.com/articles/s41591-022-02093-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41591-022-02093-7/MediaObjects/41591_2022_2093_Fig1_HTML.png", "publishedAt": "2022-12-01T13:49:37Z", "content": "Our study shows that pollutants in our environment have a direct and detrimental effect on the human immune system, and specifically the immune organs that are associated with the respiratory tract. … [+1494 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Pills to Increase Sex Drive Female 2023 -Start Your Orgasms Today - Deccan Herald", "description": "The female orgasm is a powerful and unique experience. Unfortunately, not enough of us have the quantity and quality of orgasms we deserve. In fact, did you know that only 65% of heterosexual women orgasm during intercourse?1 There are many reasons for this d…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-pills-to-increase-sex-drive-female-2023-start-your-orgasms-today-1167468.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1167468-1669900168.png", "publishedAt": "2022-12-01T13:09:28Z", "content": "The female orgasm is a powerful and unique experience. Unfortunately, not enough of us have the quantity and quality of orgasms we deserve. In fact, did you know that only 65% of heterosexual women o… [+26640 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Alert 2022 - Revive Daily Deep Sleep Support LEGIT or SCAM? What Customer Saying - The Tribune India", "description": "Revive Daily is an exclusive formula that claims to have many health benefits for your body, including weight loss, better sleep, skin health, and more.", "url": "https://www.tribuneindia.com/news/brand-connect/alert-2022-revive-daily-deep-sleep-support-legit-or-scam-what-customer-saying-456669", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_719711458.jpg", "publishedAt": "2022-12-01T12:46:00Z", "content": "Revive Daily is an exclusive formula that claims to have many health benefits for your body, including weight loss, better sleep, skin health, and more.\r\nAccording to the formula's creator, Revive Da… [+14620 chars]"}]}