{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cambridge Researchers Unveil Simple 11-Minute Solution To Reduce Risk of Early Death - SciTechDaily", "description": "One in ten early deaths could be prevented if everyone managed at least half the recommended level of physical activity, say a team led by researchers at the University of Cambridge. In a study published on February 27 in the British Journal of Sports Medicin…", "url": "https://scitechdaily.com/?p=258398", "urlToImage": "https://scitechdaily.com/images/Senior-Couple-Sweaters-Outside.jpg", "publishedAt": "2023-03-06T22:16:28Z", "content": "A study published in the British Journal of Sports Medicine by researchers at the University of Cambridge suggests that 11 minutes of moderate-intensity physical activity, such as a brisk walk, for a… [+5950 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dr Megan Rossi", "title": "The simple diet tweaks that can help boost your mood: DR MEGAN ROSSI - Daily Mail", "description": "DR MEGAN ROSSI: This is not about feeling cheered up by a chocolate bar - which has a more immediate effect on reward centres in your brain.", "url": "https://www.dailymail.co.uk/health/article-11827115/The-simple-diet-tweaks-help-boost-mood-DR-MEGAN-ROSSI.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/06/17/68393841-0-image-a-16_1678125536814.jpg", "publishedAt": "2023-03-06T18:35:49Z", "content": "How does your food make you feel? You might not have given it much consideration but whatever mood you are in right now will, in part, be determined by what you have eaten.\r\nThis is not about feeling… [+10396 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Clinical Trial Reveals: Cutting Just One Food Can Treat Eosinophilic Esophagitis - SciTechDaily", "description": "Scientists have reported the outcomes of the first multi-center randomized trial comparing the effects of two diets. A clinical trial funded by the National Institutes of Health has found that eliminating just animal milk from the diet of adults with eosinoph…", "url": "https://scitechdaily.com/new-clinical-trial-reveals-cutting-just-one-food-can-treat-eosinophilic-esophagitis/", "urlToImage": "https://scitechdaily.com/images/Eosinophil.jpg", "publishedAt": "2023-03-06T10:48:59Z", "content": "ByNIH/National Institute of Allergy and Infectious DiseasesMarch 6, 2023\r\nEosinophils are a type of white blood cell that play a role in the bodys immune response. They are often involved in the immu… [+5946 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jill U. Adams", "title": "Treating asthma is critical to living with it - The Washington Post", "description": "Experts are still trying to pin down why there are so many cases of the condition today.", "url": "https://www.washingtonpost.com/wellness/2023/03/05/asthma-more-common-in-women/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7QLOJUS4ZNHDDF7C6VLLWFNASU.gif&w=1440", "publishedAt": "2023-03-05T12:27:23Z", "content": "Comment on this story\r\nI used to think asthma was a condition you either had or didnt, and that it was typically diagnosed in childhood.\r\nThat changed when I was diagnosed with asthma in my 50s.\r\nIm … [+7233 chars]"}]}