{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Dengue Fever: 5 Food Items To Eat For Fast Recovery - News18", "description": "Once a person has suffered from dengue, their body becomes immune to that particular virus, and the chances of recurrence are very low.", "url": "https://www.news18.com/news/lifestyle/dengue-fever-5-food-items-to-eat-for-fast-recovery-6174157.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/dengue-ians-1-1-166584299016x9.jpg", "publishedAt": "2022-10-15T14:10:39Z", "content": "Dengue fever, a tropical disease transmitted via a mosquito bite, can be fatal if not diagnosed and treated promptly. The recurrence of dengue and the diet to be maintained and followed are two major… [+1858 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "How bad is red meat for you? Health risks get star ratings - Medical Xpress", "description": "Research about what is healthy comes so thick and fast—red meat can appear good for you one week, stroke-inducing the next—that a confused public often struggles to keep up.", "url": "https://medicalxpress.com/news/2022-10-bad-red-meat-health-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/red-meat.jpg", "publishedAt": "2022-10-15T13:30:01Z", "content": "Research about what is healthy comes so thick and fastred meat can appear good for you one week, stroke-inducing the nextthat a confused public often struggles to keep up.\r\nBut a massive new review p… [+4042 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Discriminating cross-reactivity in polyclonal IgG1 responses against SARS-CoV-2 variants of concern - Nature.com", "description": "Profiling antibody repertoires using proteomic approaches may provide a way of screening for antibody cross-reactivity against SARS-CoV-2 variants. Here the authors use a IgG1 specific cleavage method to analyse the IgG1 repertoire within recovered patients a…", "url": "https://www.nature.com/articles/s41467-022-33899-1", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-022-33899-1/MediaObjects/41467_2022_33899_Fig1_HTML.png", "publishedAt": "2022-10-15T12:05:10Z", "content": "Donor characteristics\r\nThe study was conducted at the Amsterdam University Medical Centers, location AMC, in the Netherlands and approved by the local ethical committee of the AMC (NL 73281.018.20). … [+14314 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Monika Mondal", "title": "Why India's Capital Is Teeming With Mosquitoes - WIRED", "description": "City residents have long resorted to low-cost, do-it-yourself remedies that may be harmful to human health.", "url": "https://www.wired.com/story/why-delhi-is-teeming-with-mosquitoes/", "urlToImage": "https://media.wired.com/photos/6349822a6c255af47dbd5ec3/191:100/w_1280,c_limit/mosquito_science_2GBWF58.jpg", "publishedAt": "2022-10-15T12:00:00Z", "content": "Delhi's surge of Culex mosquitoes comes at a time when public health officials are declaring notable victories against other kinds of mosquitoes, including the Anopheles genus that transmits malaria.… [+3526 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IBT News Desk", "title": "Long-term exposure to air pollution making women fatter; there's a way to reverse it - IBTimes India", "description": "Scientists are discovering several new ailments triggered by air pollution, and a new study suggests that air pollution is another factor that tips the scale in mid-life women's weight, body mass index, waist circumference and body fat.", "url": "https://www.ibtimes.co.in/long-term-exposure-air-pollution-making-women-fatter-theres-way-reverse-it-853197", "urlToImage": "https://data1.ibtimes.co.in/en/full/640895/air-pollution-bs-iv-emission.jpg", "publishedAt": "2022-10-15T11:53:55Z", "content": "All women entitled to safe and legal abortion; marital status no bar, SC rules\r\nScientists are discovering several new ailments triggered by air pollution, and a new study suggests that air pollution… [+1484 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Donald Weaver", "title": "Alzheimer’s might not be primarily a brain disease: new theory suggests it's an autoimmune condition - Salon", "description": "A group of neuroscience researchers think Alzheimer's is an autoimmune condition — could this lead to a cure?", "url": "https://www.salon.com/2022/10/15/alzheimers-might-not-be-primarily-a-brain-disease-new-theory-suggests-its-an-autoimmune-condition_partner/", "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2017/06/brain-scans.jpg", "publishedAt": "2022-10-15T11:29:00Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal how thirdhand smoke can cause inflammatory skin diseases - ANI News", "description": "Riverside (California)[US], October 15 (ANI): The residual pollutants from tobacco smoke that remain on surfaces and in dust after the tobacco has been smoked are referred to as thirdhand smoke (THS). It can linger for an indefinite period of time on indoor s…", "url": "https://www.aninews.in/news/science/researchers-reveal-how-thirdhand-smoke-can-cause-inflammatory-skin-diseases20221015164913", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221015111847.jpg", "publishedAt": "2022-10-15T11:19:00Z", "content": "Riverside (California)[US], October 15 (ANI): The residual pollutants from tobacco smoke that remain on surfaces and in dust after the tobacco has been smoked are referred to as thirdhand smoke (THS)… [+3417 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Cape Town: Intimate partner violence hinders adolescents’ ARV treatment adherence - India Education Diary", "description": "Award-winning research into antiretroviral (ARV) treatment adherence, led by PhD student Siyanai Zhou and University of Cape Town (UCT) academic Professor Lucie Cluver, established that intimate partner violence (IPV) and other forms of violence impe", "url": "https://indiaeducationdiary.in/university-of-cape-town-intimate-partner-violence-hinders-adolescents-arv-treatment-adherence/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/download-2.jpg?fit=277%2C182&ssl=1", "publishedAt": "2022-10-15T11:11:55Z", "content": "Award-winning research into antiretroviral (ARV) treatment adherence, led by PhD student Siyanai Zhou and University of Cape Town (UCT) academic Professor Lucie Cluver, established that intimate part… [+5701 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Java Burn Reviews - Will JavaBurn Coffee Work For Weight Loss or Fake Results? - The Tribune India", "description": "Most of us are as pumped up about our weights and fitness as some of us are about finances and investments. Weight loss supplements with different components that can target different issues in the body are easy to find.", "url": "https://www.tribuneindia.com/news/brand-connect/java-burn-reviews-will-javaburn-coffee-work-for-weight-loss-or-fake-results-441585", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1961597220.jpg", "publishedAt": "2022-10-15T10:39:00Z", "content": "Most of us are as pumped up about our weights and fitness as some of us are about finances and investments. Weight loss supplements with different components that can target different issues in the b… [+23718 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "E- gaming can cause life-threatening cardiac arrhythmias in children: Study - Zee News", "description": "The findings of the study were published in the journal of the Heart Rhythm Society, the Cardiac Electrophysiology Society, and the Pediatric Congenital Electrophysiology Society. The researchers observed an uncommon yet distinct pattern in children who lose …", "url": "https://zeenews.india.com/health/e-gaming-can-cause-life-threatening-cardiac-arrhythmias-in-children-study-2522239", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/15/1103797-e-gaming.jpg", "publishedAt": "2022-10-15T10:31:21Z", "content": "The findings of the study were published in the journal of the Heart Rhythm Society, the Cardiac Electrophysiology Society, and the Pediatric &amp; Congenital Electrophysiology Society. The researche… [+4030 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Stress eating? How to train your brain to crave healthy food? - Times Now", "description": "Psychologists say stress induces unhealthy food cravings and thus promotes belly fat. Train your brain in such a manner that it only wants to eat healthy foods even during stressful times. Read on to know how to do it.", "url": "https://www.timesnownews.com/health/stress-eating-how-to-train-your-brain-to-crave-healthy-food-article-94879958", "urlToImage": "https://static.tnn.in/thumb/msid-94879958,imgsize-100,width-1280,height-720,resizemode-75/94879958.jpg", "publishedAt": "2022-10-15T10:17:51Z", "content": "Karwa Chauth 2022: Check out the Moonrise time in Delhi, Gurgaon, Noida, Mumbai, Pune and other Indian cities"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "Top Foods to Help Fight Depression - The Epoch Times", "description": "STORY AT-A-GLANCE A total of 34 nutrients known to be essential for humans were analyzed to find those ...", "url": "https://www.theepochtimes.com/health/top-foods-to-help-fight-depression_4780933.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/10/15/seafood-1200x801.jpeg", "publishedAt": "2022-10-15T10:00:08Z", "content": "STORY AT-A-GLANCE\r\n<ul><li>A total of 34 nutrients known to be essential for humans were analyzed to find those deemed most beneficial for fighting depression. Researchers narrowed it down to the 12 … [+13060 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal why healthy ageing requires an understanding of personality types - ANI News", "description": "Washington [US], October 15 (ANI): According to a new study, older persons may be better supported as they age when their personalities are examined, such as whether they are more like orchids or dandelions.", "url": "https://www.aninews.in/news/health/researchers-reveal-why-healthy-ageing-requires-an-understanding-of-personality-types20221015140714", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221015083511.jpg", "publishedAt": "2022-10-15T09:48:37Z", "content": "Washington [US], October 15 (ANI): According to a new study, older persons may be better supported as they age when their personalities are examined, such as whether they are more like orchids or dan… [+2302 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Effect of maternal smoking during pregnancy on child blood pressure in a European cohort | Scientific Reports - Nature.com", "description": "Scientific Reports - Effect of maternal smoking during pregnancy on child blood pressure in a European cohort", "url": "https://www.nature.com/articles/s41598-022-21337-7", "urlToImage": null, "publishedAt": "2022-10-15T09:09:18Z", "content": "<li>Song, P. et al. Global prevalence of hypertension in children: A systematic review and meta-analysis. JAMA Pediatr.173, 11541163 (2019).\r\nPubMed \r\n PubMed Central \r\n Article \r\nGoogle Scholar \r\n</… [+12058 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Exipure Reviews - Honest Customer Results That Last or Fake User Testimonials? - The Tribune India", "description": "You may have seen people desperate to lose excess fat and resort to many things and measures to become slimmer. The lure of OTC weight loss pills and specialized diets endorsed by celebs can be too hard to resist. However, the bitter truth is most such weight…", "url": "https://www.tribuneindia.com/news/brand-connect/exipure-reviews-honest-customer-results-that-last-or-fake-user-testimonials-441569", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1471427685.png", "publishedAt": "2022-10-15T08:57:00Z", "content": "You may have seen people desperate to lose excess fat and resort to many things and measures to become slimmer. The lure of OTC weight loss pills and specialized diets endorsed by celebs can be too h… [+6583 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Ignite Weight Loss Drops Reviewed - What to Know About Ignite Amazonian Sunrise Drops Before Buy! - The Tribune India", "description": "The newest naturally derived drops from Ignite are brand-new weight-shedding drops that are created from 12 active components. The motionlessness of BAM15, which is also known as the morning hormone, is regarded as the chief reason for excessive unhealthy wei…", "url": "https://www.tribuneindia.com/news/brand-connect/ignite-weight-loss-drops-reviewed-what-to-know-about-ignite-amazonian-sunrise-drops-before-buy-441562", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1704083344.png", "publishedAt": "2022-10-15T08:28:00Z", "content": "The newest naturally derived drops from Ignite are brand-new weight-shedding drops that are created from 12 active components. The motionlessness of BAM15, which is also known as the morning hormone,… [+6997 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Amarose Skin Tag Remover #SkinTag Reviews Scam EXPOSED Price Side Effects Amarose™ - The Tribune India", "description": "Amarose skin Tag Remover serum is an essential serum, It is produced in The United States with natural and organic compounds. This supplement is absorbed by the skin layers and treats moles, skin tags, and growths. This product is safe and effective to use an…", "url": "https://www.tribuneindia.com/news/brand-connect/amarose-skin-tag-remover-skintag-reviews-scam-exposed-price-side-effects-amarose%E2%84%A2-441560", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_825677958.png", "publishedAt": "2022-10-15T08:20:00Z", "content": "Amarose skin Tag Remover serum is an essential serum, It is produced in The United States with natural and organic compounds. This supplement is absorbed by the skin layers and treats moles, skin tag… [+7748 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "How serotonin controls behaviour: Study - Hindustan Times", "description": "Serotonin, a neurotransmitter that is generated by many animals and was first identified in the 1930s, regulates a wide range of behaviours including feeding, sleep, mood, and cognition. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-serotonin-controls-behaviour-study-101665818900715.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/15/1600x900/_4c6376d0-4676-11eb-a3fc-f9413025bbf2_1665818954368_1665818954368.jpg", "publishedAt": "2022-10-15T07:33:13Z", "content": "The COVID-19 pandemic has significantly accelerated a trend that has seen rising rates of anxiety and depression for many years. Frank Schroeder of the Boyce Thompson Institute's latest research coul… [+3538 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Psychological Disorders Linked With Symptomatic COVID-19 Infection: Lancet Study - The Weather Channel", "description": "The study revealed that rises in psychological distress, depression, anxiety, and lower life satisfaction were associated with prior self-reported COVID-19.", "url": "https://weather.com/en-IN/india/health/news/2022-10-15-psychological-disorders-linked-with-symptomatic-covid-19-infectio", "urlToImage": "https://s.w-x.co/in-depression_0.jpg", "publishedAt": "2022-10-15T07:10:10Z", "content": "A Lancet study involving an Indian-origin researcher has linked symptoms of COVID-19 with worse mental health and lower life satisfaction.\r\nResearchers from King's College London and University Colle… [+1867 chars]"}, {"source": {"id": null, "name": "Thekashmiriyat.co.uk"}, "author": "News Desk", "title": "Vaccinate children against HPV to prevent cancers: DAK to parents - The Kashmiriyat", "description": "With the approval of India’s first indigenously developed Human papillomavirus (HPV) vaccine, Doctors Association Kashmir (DAK) on Friday urged parents to get their children vaccinated against HPV to prevent several types of cancers.", "url": "http://thekashmiriyat.co.uk/vaccinate-children-against-hpv-to-prevent-cancers-dak-to-parents/", "urlToImage": "http://thekashmiriyat.co.uk/wp-content/uploads/2020/07/doctor2.jpg", "publishedAt": "2022-10-15T06:45:18Z", "content": "With the approval of Indias first indigenously developed Human papillomavirus (HPV) vaccine, Doctors Association Kashmir (DAK) on Friday urged parents to get their children vaccinated against HPV to … [+1918 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Romaa Daas", "title": "Try eye yoga for gentle relief from visual fatigue - Lifestyle Asia India", "description": "This gentle practice is said to help relieve eye strain, a common problem associated with heavy screen use. Know more about eye yoga.", "url": "https://www.lifestyleasia.com/ind/living/wellness-living/try-eye-yoga-for-gentle-relief-from-visual-fatigue/", "urlToImage": "https://images.lifestyleasia.com/wp-content/uploads/sites/7/2022/10/14141009/Eye-Yoga-Feature.jpg", "publishedAt": "2022-10-15T06:40:40Z", "content": "Everyone’s heard of yoga. But what about eye yoga? This gentle practice is said to help relieve eye strain, an increasingly common problem associated with heavy screen use. Here’s a look at this deca… [+2652 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "Itching, flushing or diarrhea: Watch out for symptoms of alcohol intolerance - Health shots", "description": "If you feel uncomfortable and experience problems after drinking, you need to watch out for the symptoms of alcohol intolerance.", "url": "https://www.healthshots.com/preventive-care/self-care/5-major-symptoms-of-alcohol-allergy-or-intolerance/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/10/14150146/symptoms-of-alcohol-intolerance.jpg", "publishedAt": "2022-10-15T06:30:34Z", "content": "What’s a party without some binge drinking? But does that tend to make you experience hot flashes, nausea, or itching? Beware as it may be due to an allergy to alcohol. Shocked? Well, alcohol allergy… [+3786 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Deepali Verma", "title": "Skipped Eating Breakfast? Have These To Feel Energetic - Slurrp", "description": "Your energy levels throughout the day can be affected by what you eat and when you eat", "url": "https://www.slurrp.com/article/skipped-eating-breakfast-have-these-to-feel-energetic-1665813032073", "urlToImage": "https://images.slurrp.com/prodarticles/qdholqi4zpo.webp", "publishedAt": "2022-10-15T06:09:19Z", "content": "Breakfast is widely acknowledged to be the most significant meal of the day since it contains the vital nutrients needed for optimum health. A filling breakfast increases your capacity for concentrat… [+3005 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Control high blood sugar: 7 best carbs to help manage diabetes - Zee News", "description": "High blood sugar: 7 healthy breakfast options for diabetics - check list 6. Squash Vegetables Among the healthiest vegetables for diabetics are pumpkin, butternut squash, and other types.", "url": "https://zeenews.india.com/health/7-best-carbs-to-help-manage-diabetes-2522073", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/15/1103634-diabetic-food.jpg", "publishedAt": "2022-10-15T05:14:41Z", "content": "Carbohydrates are not your enemy theyre your friend. Your body receives energy from carbohydrates. However, carbs are not all created equal. The idea is to choose whole, unprocessed carbohydrates ove… [+2476 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Expresso Health Updates Of The Week - The Indian Express", "description": "\"In this Expresso Health Updates Of The Week bulletin, we look at the tips by writer Shaheen Bhatt on how to handle anxiety, panic attacks, and depression. We also look at the traditional Indian ingredients that can help fight immunity-related issues, especia…", "url": "https://indianexpress.com/audio/expresso-entertainment-update/expresso-health-updates-of-the-week-12-8156155-8169292-8179156-8189949-8209412/8209412/", "urlToImage": "https://images.indianexpress.com/2022/04/Expresso-health-1200x630-1.jpg", "publishedAt": "2022-10-15T04:00:03Z", "content": "You are listening to the Expresso Health Update. Here is the latest news from the world of Health, brought to you by The Indian Express.\"Let's begin this bulletin with some news on writer Shaheen Bha… [+5026 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "'Mushrooms, a rich source of Vitamin D' - The Tribune India", "description": "October 15 is observed as National Mushroom Day and it offers us an opportunity to appreciate some of the lesser known uses of these plants. Mushrooms are a source of food and medicine for humans and animals alike as they are rich in vitamins, minerals and al…", "url": "https://www.tribuneindia.com/news/ludhiana/mushrooms-a-rich-source-of-vitamin-d-441465", "urlToImage": "https://www.tribuneindia.com/content/images/Logo_eng.png", "publishedAt": "2022-10-15T03:17:00Z", "content": "Tribune News Service\r\nLudhiana, October 14\r\nOctober 15 is observed as National Mushroom Day and it offers us an opportunity to appreciate some of the lesser known uses of these plants. Mushrooms are … [+1312 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "70-yr-old falls prey to swine flu, fourth death this season - The Tribune India", "description": "The district on Friday reported the fourth swine flu death of the season. A 70-year-old man, the resident of SST Nagar of the city succumbed to the highly contagious swine flu at Manipal Hospital in the city.", "url": "https://www.tribuneindia.com/news/patiala/70-yr-old-falls-prey-to-swine-flu-fourth-death-this-season-441441", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1386938072.jpg", "publishedAt": "2022-10-15T02:11:00Z", "content": "Tribune News Service\r\nPatiala, October 14\r\nThe district on Friday reported the fourth swine flu death of the season. A 70-year-old man, the resident of SST Nagar of the city succumbed to the highly c… [+862 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Deepa Kannan", "title": "A five-step approach to avoid food cravings at night - YourStory", "description": "From poorly balanced meals to not sleeping at the right time, there could be several reasons for night cravings. In this article, we look at the possible root causes of night time cravings, and what you can do to avoid it.", "url": "https://yourstory.com/2022/10/do-you-get-food-cravings-in-the-night/amp", "urlToImage": "https://images.yourstory.com/cs/2/11718bd02d6d11e9aa979329348d4c3e/CopyofImageTaggingnoframesEditorialTeamMaster18-1665747568662.png", "publishedAt": "2022-10-15T01:21:00Z", "content": "Having cravings in the night and struggling with poor sleep go hand-in-hand. If you sleep badly, you end up needing food in the night. If you have cravings due to poor blood sugar regulation, then it… [+8745 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Severe COVID-19 outcomes after full vaccination of primary schedule and initial boosters: pooled analysis of national prospective cohort studies of 30 million individuals in England, Northern Ireland, Scotland, and Wales - The Lancet", "description": "Older people, those with multimorbidity, and those with specific underlying health\nconditions remain at increased risk of COVID-19 hospitalisation and death after the\ninitial vaccine booster and should, therefore, be prioritised for additional boosters,\ninclu…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01656-7/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/012dc270-8541-4ec5-992a-54888d26a99b/gr1.jpg", "publishedAt": "2022-10-14T22:07:14Z", "content": "Leston M, Elson WH, Watson C, et al. Representativeness, vaccination uptake and COVID clinical outcomes 202021 in the UK's Oxford-RCGP Research and Surveillance Network: cohort profile. JMIR Public H… [+25 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Senescent cells help to heal damaged tissues - EurekAlert", "description": "Not all senescent cells are harmful “zombies” that should be wiped out to prevent age-related disease, according to new research from UC San Francisco, which found that some of them are embedded in young, healthy tissues and promote normal repair from damage.", "url": "https://www.eurekalert.org/news-releases/968050", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-10-14T21:16:39Z", "content": "Scientists Reappraise the Role of “Zombie” Cells that Anti-Aging Medicine Has Sought to Eliminate\r\nNot all senescent cells are harmful “zombies” that should be wiped out to prevent age-related diseas… [+6910 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "Influenza in the northern hemisphere is back - World Health Organization", "description": "<p><strong>Influenza situation</strong></p><p>October marks the start of the northern hemisphere influenza season.  </p><p>Influenza activity has started to increase in many countries.  Public health measures taken to reduce transmission of COVID-19, also red…", "url": "https://www.who.int/news/item/14-10-2022-influenza-in-the-northern-hemisphere-is-back", "urlToImage": "https://www.who.int/images/default-source/departments/global-influenza-programme/newsletter-images/october-2022/ary-rogerio-silva_paho_2_s.tmb-1200v.jpg?sfvrsn=8c154428_1", "publishedAt": "2022-10-14T20:24:29Z", "content": "Influenza situation\r\nOctober marks the start of the northern hemisphere influenza season.  \r\nInfluenza activity has started to increase in many countries.  Public health measures taken to reduce tran… [+3012 chars]"}, {"source": {"id": null, "name": "Www.epw.in"}, "author": null, "title": "Assessing the Nutritional Status of Rural Labour | Economic and Political Weekly - Economic and Political Weekly", "description": "Recent studies have shown that a nutrition transition is underway in urban and rural India, evident from the declining undernutrition and rapidly increasing overweight. Using the National Family Health Survey data to supplement the analysis of Nupur Kataria (…", "url": "https://www.epw.in/journal/2022/42/discussion/assessing-nutritional-status-rural-labour.html", "urlToImage": "http://www.epw.in/sites/default/files/epw-logo.png", "publishedAt": "2022-10-14T20:22:58Z", "content": "This is an appeal to the subscribers, contributors, advertisers and well-wishers of Economic and Political Weekly (EPW), published by Sameeksha Trust, a public charitable trust registered with the of… [+47 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "37 fresh dengue cases in Lucknow; UP count up to 3,607 - Hindustan Times", "description": "So far, no dengue death reported in state capital; health department teams visit 1,620 homes and offices to check presence of mosquito larvae/stagnant water, notices served on 16 homes", "url": "https://www.hindustantimes.com/cities/lucknow-news/37-fresh-dengue-cases-in-lucknow-up-count-up-to-3607-101665771331887.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/14/1600x900/0c033c88-4bec-11ed-ab1f-c6755d0fab71_1665771330278.jpg", "publishedAt": "2022-10-14T18:15:31Z", "content": "LUCKNOW Over three dozen people (37) in Lucknow tested positive for dengue on Friday, taking the tally of such patients to over 440 while Uttar Pradesh had so far reported 3,607 cases this year, acco… [+872 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Understand the different functions of pituitary gland - Telangana Today", "description": "Today, let's discuss the functions of the hypothalamus and the pituitary gland. The information can be handy for the upcoming exams.", "url": "https://telanganatoday.com/understand-the-different-functions-of-pituitary-gland", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/02/cropped-android-chrome-512x512-1-267x267-2.png", "publishedAt": "2022-10-14T18:12:35Z", "content": null}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "4 Brain-Healthy Foods This Neurologist Recommends to Patients - Eat This, Not That", "description": "To deter or minimize cognitive issues, you may want to incorporate some of these brain-healthy foods into your daily diet.", "url": "https://www.eatthis.com/brain-healthy-foods-neurologist-recommended/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/08/person-slicing-fresh-salmon-dill-lemon.jpg?quality=82&strip=all", "publishedAt": "2022-10-14T17:45:54Z", "content": "It's natural for your brain to change over time as you get older. During your later years of life, you're more likely to experience shifts in your cognition that affect your reasoning, planning, and … [+3253 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Pelvic Floor Strong Alex Miller Fitness Program Danger Reveal You Must See - The Tribune India", "description": "Pelvic Floor Strong, a program that helps women over 30 with pelvic floor dysfunction, is now available. Alex Miller, the creator of Pelvic Floor Strong, says it can strengthen your pelvic muscles with stretches and exercises. This will prevent leakage and ac…", "url": "https://www.tribuneindia.com/news/brand-connect/pelvic-floor-strong-alex-miller-fitness-program-danger-reveal-you-must-see-441297", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_1675685021.jpg", "publishedAt": "2022-10-14T17:40:00Z", "content": "Pelvic Floor Strong, a program that helps women over 30 with pelvic floor dysfunction, is now available. Alex Miller, the creator of Pelvic Floor Strong, says it can strengthen your pelvic muscles wi… [+18856 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Certain types of dietary fibre cause inflammatory response in some patients: Study - The Tribune India", "description": "A recent study has revealed the role of dietary fiber and gut microbes in people with inflammatory bowel disease, a finding which could lead to personalised dietary guidelines.", "url": "https://www.tribuneindia.com/news/health/certain-types-of-dietary-fibre-cause-inflammatory-response-in-some-patients-study-441294", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_2078100973.JPG", "publishedAt": "2022-10-14T17:33:00Z", "content": "ANI\r\nAlberta (Canada), October 14\r\nA recent study has revealed the role of dietary fiber and gut microbes in people with inflammatory bowel disease, a finding which could lead to personalised dietary… [+2467 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Pam Harrison", "title": "Yoga, Other Mindfulness Practices Improve Blood Sugar in Type 2 Diabetes - WebMD", "description": "Patients with type 2 diabetes had better blood sugar control when they participated in mind-body-based practices such as yoga.", "url": "https://www.webmd.com/diabetes/news/20221014/yoga-other-mindful-practices-improve-blood-sugar-type-2-diabetes", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/article_thumbnails/reference_guide/tips_to_manage_your_psoriasis_triggers_ref_guide/1800x1200_tips_to_manage_your_psoriasis_triggers_ref_guide.jpg", "publishedAt": "2022-10-14T17:32:15Z", "content": "Oct. 14, 2022 -- Patients with type 2 diabetes achieve much better control of their blood sugar if they participate in mind-and-body-practices such as yoga, a new study shows.\r\nWhile past research ha… [+1960 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Protetox Pills (Weight Loss Formula) Shocking Customer Reviews & Price, Protetox Scam or Legit? - The Tribune India", "description": "Do you get tired of having to listen to people's unsolicited opinions about your body weight? Are your overweight, making it difficult for you to wear the flattering clothing you've acquired for the summer? Have you let your weight loss journey fall by the wa…", "url": "https://www.tribuneindia.com/news/brand-connect/protetox-pills-weight-loss-formula-shocking-customer-reviews-price-protetox-scam-or-legit-441291", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/10/2022_10$largeimg_934265253.png", "publishedAt": "2022-10-14T17:20:00Z", "content": "Do you get tired of having to listen to people's unsolicited opinions about your body weight? Are your overweight, making it difficult for you to wear the flattering clothing you've acquired for the … [+15410 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Swapnil Mishra", "title": "Mumbai: Doctors caught unawares as pink eye cases surge in last two weeks - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/mumbai-doctors-caught-unawares-as-pink-eye-cases-surge-in-last-two-weeks", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-10/454cb1c3-2266-4ab6-be67-444f82003af9/cold_compress.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-10-14T16:19:34Z", "content": "Cases of conjunctivitis have surged in the last two weeks, especially in children, raising an alarm over addition to monsoon-related diseases. Conjunctivitis, also called pink eye, is extremely conta… [+3084 chars]"}, {"source": {"id": null, "name": "Psychedelicspotlight.com"}, "author": "Ruby Deevoy", "title": "Treating Postpartum Depression with Psychedelics - Psychedelic Spotlight ", "description": "Postpartum depression impacts thousands with no good treatment options. Some people are now treating postpartum depression with psychedelics", "url": "https://psychedelicspotlight.com/treating-postpartum-depression-with-psychedelics/", "urlToImage": "https://psychedelicspotlight.com/wp-content/uploads/2022/10/Postpartum_DepressionArtboard-1.jpg", "publishedAt": "2022-10-14T14:56:36Z", "content": "Despite impacting 1 in 7 women (and 1 in 10 men) postpartum depression (PPD) is still somewhat of an enigma. Understanding of what causes it is seriously lacking, as are treatment options. In fact, i… [+6713 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study presents rare cases of COVID-19-associated pulmonary aspergillosis - News-Medical.Net", "description": "Researchers presented a case series of patients with coronavirus disease 2019 (COVID-19)-associated pulmonary aspergillosis (CAPA). The goal of the study was to inform clinicians and healthcare workers of this serious COVID-19-related complication.", "url": "https://www.news-medical.net/news/20221014/Study-presents-rare-cases-of-COVID-19-associated-pulmonary-aspergillosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_727982_16657544903942709.jpg", "publishedAt": "2022-10-14T13:42:00Z", "content": "A recent study published in the Indian Journal of Critical Care Medicine presented a case series of patients with coronavirus disease 2019 (COVID-19)-associated pulmonary aspergillosis (CAPA). The go… [+3437 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Speed up weight loss and burn more calories with these eating habits - Times Now", "description": "According to nutritionists, the easy ways to burn more calories are eating less junk food, more vegetables, lean protein, reducing bad fats, and hydrating the body with more water.", "url": "https://www.timesnownews.com/health/speed-up-weight-loss-and-burn-more-calories-with-these-eating-habits-article-94864701", "urlToImage": "https://static.tnn.in/thumb/msid-94864701,imgsize-100,width-1280,height-720,resizemode-75/94864701.jpg", "publishedAt": "2022-10-14T13:41:31Z", "content": "Karwa Chauth 2022: Check out the Moonrise time in Delhi, Gurgaon, Noida, Mumbai, Pune and other Indian cities"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 vaccination reduced the severity of the Omicron-driven pandemic wave in Saudi Arabia - News-Medical.Net", "description": "In a new study, researchers conducted a retrospective study of all COVID-19 cases from a single hospital in the Kingdom of Saudi Arabia (KSA) between December 25, 2021, and February 30, 2022.", "url": "https://www.news-medical.net/news/20221014/COVID-19-vaccination-reduced-the-severity-of-the-Omicron-driven-pandemic-wave-in-Saudi-Arabia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_727976_16657533405555383.jpg", "publishedAt": "2022-10-14T13:23:00Z", "content": "In a recent study published in the Journal of Infection and Public Health, researchers conducted a retrospective study of all coronavirus disease 2019 (COVID-19) cases from a single hospital in the K… [+5192 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Anna Gora", "title": "The Vegetarian Diet: Everything you need to know - Livescience.com", "description": "Looking to give up meat, fish and poultry? Here’s what you need to know about following a vegetarian diet", "url": "https://www.livescience.com/the-vegetarian-diet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qbRjMfmX9VxRcEbCwV5LJP-1200-80.jpg", "publishedAt": "2022-10-14T13:00:33Z", "content": "Considering switching to a vegetarian diet, but not sure whether it is a good idea, or how to best handle it? Rest assured you’re not alone. With plant-based diets rocketing in popularity, an increas… [+9622 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Distinct brain networks related to risk, resilience in depression identified during study - Times of India", "description": "Two distinct brain networks have been identified during a study that links the location of brain injury to levels of depression in patients following the injury. While one is associated with increased depression symptoms, the other one is associated with decr…", "url": "https://timesofindia.indiatimes.com/videos/news/distinct-brain-networks-related-to-risk-resilience-in-depression-identified-during-study/videoshow/94862722.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-94862722,imgsize-72078.cms", "publishedAt": "2022-10-14T12:10:30Z", "content": "Oct 14, 2022, 05:40PM ISTSource: ANITwo distinct brain networks have been identified during a study that links the location of brain injury to levels of depression in patients following the injury. W… [+626 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "BS Web Team", "title": "What is DENV-2? All you need to know about new dangerous dengue strain - Business Standard", "description": "The DENV2 variant has caused a rapid surge in dengue fever and death cases in Panchkula Haryana", "url": "https://www.business-standard.com/article/current-affairs/what-is-denv-2-all-you-need-to-know-about-new-dangerous-dengue-strain-122101400863_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-12/05/full/1512415735-9047.jpg", "publishedAt": "2022-10-14T12:07:00Z", "content": "What is DENV-2?\r\nDENV-2, a more lethal dengue virus variant, is extremely severe or harmful in its effects and can cause symptoms of severe dengue. The DENV-2 variant of dengue has been rapidly sprea… [+3090 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "VigFX Reviews - 2022 Does It Work and Worth The Money? - Deccan Herald", "description": "A sensual lifestyle is essential for a sound mind. A disturbed sensual life may have negative effects on life. Nationwide, a lot of people struggle with harmful sensual lifestyles. The functioning of numerous organs and body tissues might be impacted by eroti…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vigfx-reviews-2022-does-it-work-and-worth-the-money-1153582.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1153582-1665748743.png", "publishedAt": "2022-10-14T11:59:03Z", "content": "A sensual lifestyle is essential for a sound mind. A disturbed sensual life may have negative effects on life. Nationwide, a lot of people struggle with harmful sensual lifestyles. The functioning of… [+18822 chars]"}, {"source": {"id": null, "name": "Tkbsen.in"}, "author": null, "title": "Smoking, diabetes, obesity bigger risk factors for COVID-19 death than heart ailment: Study - The Sen Times Online Newspaper", "description": "", "url": "https://www.tkbsen.in/2022/10/smoking-diabetes-obesity-bigger-risk-factors-for-covid-19-death-than-heart-ailment-study/", "urlToImage": "https://www.tkbsen.in/storage/2022/10/Smoking-diabetes-obesity-bigger-risk-factors-for-Covid-death-than-heart-ailment.jpg", "publishedAt": "2022-10-14T11:55:50Z", "content": "Washington, Oct 14 (PTI) Risk factors for cardiovascular disease such as obesity, smoking and diabetes, rather than preexisting heart disease, are the main contributors to death and poor outcomes amo… [+3340 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Amlan Sarkar", "title": "Birdsong Can Reduce Anxiety, Paranoia, New Study Suggests - The Swaddle", "description": "Researchers recommend it as a mental health intervention, showing how rapid urbanization that risks bird populations impacts human health too.", "url": "https://theswaddle.com/birdsong-can-reduce-anxiety-paranoia-new-study-suggests/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/10/Bird-Songs-Editorial.jpg", "publishedAt": "2022-10-14T11:37:48Z", "content": "A new study published yesterday by NatureScientific Reports throws light on the remarkable healing capabilities of birdsongs. The researchers observed that listening to birdsongs helped alleviate fee… [+6211 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Penn Medicine, Philadelphia: Gene Therapy Rapidly Improves Night Vision in Adults with Congenital Blindness, Penn Study Finds - India Education Diary", "description": "Adults with a genetic form of childhood-onset blindness experienced striking recoveries of night vision within days of receiving an experimental gene therapy, according to researchers at the Scheie Eye Institute in the Perelman School of Medicine at", "url": "https://indiaeducationdiary.in/penn-medicine-philadelphia-gene-therapy-rapidly-improves-night-vision-in-adults-with-congenital-blindness-penn-study-finds/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/08/Penn-Medicine-Philadelphia.png?fit=395%2C270&ssl=1", "publishedAt": "2022-10-14T11:20:32Z", "content": "Adults with a genetic form of childhood-onset blindness experienced striking recoveries of night vision within days of receiving an experimental gene therapy, according to researchers at the Scheie E… [+4269 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[Updated] Keto Complete Reviews: Advanced Weight loss Formula! - Deccan Herald", "description": "All junk food, including pizza, burgers, cold beverages, desserts, and ice cream, is incredibly excellent and savory. It seems as though you may take them with you at any time. However, there are situations when we are ignorant of the fact that they are havin…", "url": "https://www.deccanherald.com/brandspot/pr-spot/updated-keto-complete-reviews-advanced-weight-loss-formula-1153562.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1153562-1665745685.png", "publishedAt": "2022-10-14T11:08:05Z", "content": "All junk food, including pizza, burgers, cold beverages, desserts, and ice cream, is incredibly excellent and savory. It seems as though you may take them with you at any time. However, there are sit… [+17927 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Brain Pill Review: Best for Memory, Focus, and Brain Health - Deccan Herald", "description": "Several things can disrupt brain function. Several factors can contribute to mental health issues. Constant headaches, worry, anxiety, and depression plague us. We also struggle with focus, concentration, and low cognitive function. All of these factors have …", "url": "https://www.deccanherald.com/brandspot/pr-spot/brain-pill-review-best-for-memory-focus-and-brain-health-1153552.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1153552-1665744154.png", "publishedAt": "2022-10-14T10:42:34Z", "content": "Several things can disrupt brain function. Several factors can contribute to mental health issues. Constant headaches, worry, anxiety, and depression plague us. We also struggle with focus, concentra… [+18113 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Late night eating may cause greater weight gain – new research points to why - EastMojo", "description": "It’s long been popular advice for people looking to lose weight to avoid late night snacking. It’s no wonder, with a host of research showing that late", "url": "http://www.eastmojo.com/features/2022/10/14/late-night-eating-may-cause-greater-weight-gain-new-research-points-to-why/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/10/late-night-eating.jpg?fit=2400%2C1600&ssl=1", "publishedAt": "2022-10-14T10:30:00Z", "content": "Its long been popular advice for people looking to lose weight to avoid late night snacking. Its no wonder, with a host of research showing that late night eating is linked to greater body weight and… [+5821 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Supplements To Increase Testosterone - Testosterone Tablets - Deccan Herald", "description": "Men may fall short in stating their partners' desires. Even a small adjustment to one's diet or sleeping schedule can have a significant impact on one's sexual life. Men's reproductive health deteriorates as they get older. The partner doesn't achieve the des…", "url": "https://www.deccanherald.com/brandspot/pr-spot/supplements-to-increase-testosterone-testosterone-tablets-1153507.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/dzfbcx-1153507-1665738726.jpg", "publishedAt": "2022-10-14T08:49:55Z", "content": "Men may fall short in stating their partners' desires. Even a small adjustment to one's diet or sleeping schedule can have a significant impact on one's sexual life. Men's reproductive health deterio… [+16693 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Keto vs the Mediterranean: Which diet is better for longevity? - Times Now", "description": "When a comparison between the Mediterranean and Keto diets is made, the Mediterranean diet is a better choice for good effects on health and longevity, according to health and nutrition experts. Keto, which uses saturated fats, is unhealthy in the long term.", "url": "https://www.timesnownews.com/health/keto-vs-the-mediterranean-which-diet-is-better-for-longevity-article-94856668", "urlToImage": "https://static.tnn.in/thumb/msid-94856668,imgsize-100,width-1280,height-720,resizemode-75/94856668.jpg", "publishedAt": "2022-10-14T08:45:49Z", "content": "Karwa Chauth 2022: Check out the Moonrise time in Delhi, Gurgaon, Noida, Mumbai, Pune and other Indian cities"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "D N INDUJAA", "title": "Five basic morning habits to reduce weight quickly!! - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "lifestyle : Your weight starts increasing as soon as the cold comes, so follow these five-morning habits for weight loss from today itself.\nMorning We", "url": "https://www.indiaherald.com/LifeStyle/Read/994541556/Five-basic-morning-habits-to-reduce-weight-quickly", "urlToImage": "https://www.indiaherald.com/imagestore/images/lifestyle/taurus_taurus/five-basic-morning-habits-to-reduce-weight-quickly85f93c19-57b3-4f38-a2ff-e1454e2ff7bf-415x250-IndiaHerald.jpg", "publishedAt": "2022-10-14T06:50:35Z", "content": "Morning Weight Loss Habits: Your energy level also goes down a lot with unhealthy food, so you must follow healthy habits in the morning. Come, know healthy weight loss morning habits\r\nOur morning ha… [+2332 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "PNN", "title": "Depression: The unspoken monster - Dr Adwait Jadhav - Lokmat", "description": "“Sometimes, all you can do is lie in bed and hope to fall asleep before you fall apart.” This is what life seems to a person suffering from depression. During a major depressive episode, the world can seem like a dark place. According to World Health Organiza…", "url": "https://www.lokmattimes.com/health/depression-the-unspoken-monster-dr-adwait-jadhav-a475/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/images/686x514/featured_202210429589.jpg", "publishedAt": "2022-10-14T06:42:01Z", "content": "Sometimes, all you can do is lie in bed and hope to fall asleep before you fall apart. This is what life seems to a person suffering from depression. During a major depressive episode, the world can … [+2128 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[Be Informed] GenFX Reviews: Ingredients, Benefits, This HGH Releaser Supplement! - Deccan Herald", "description": "It may be difficult to fight the signs of age, particularly if your body is unable to keep a healthy balance of hormones. Everyone aspires to age gracefully, but very few people can do so. The issue of aging begins as people get older. People experience weakn…", "url": "https://www.deccanherald.com/brandspot/pr-spot/be-informed-genfx-reviews-ingredients-benefits-this-hgh-releaser-supplement-1153471.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/yjhyghj-1153471-1665728646.jpg", "publishedAt": "2022-10-14T06:24:06Z", "content": "It may be difficult to fight the signs of age, particularly if your body is unable to keep a healthy balance of hormones. Everyone aspires to age gracefully, but very few people can do so. The issue … [+17054 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Superfoods for your heart: 5 best foods to boost heart health - Hindustan Times", "description": "The foods you eat every day can have an impact on a variety of factors that can lead to heart diseases. Here are 5 foods you must eat for improving your heart health. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/superfoods-for-your-heart-5-best-foods-to-boost-heart-health-101665726967989.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/14/1600x900/heart_foods_1665726982099_1665726991517_1665726991517.jpg", "publishedAt": "2022-10-14T06:07:45Z", "content": "What you eat every day impacts your heart health gradually. Junk, deep-fried, processed, sugar-laden and salty foods slowly but surely contribute in damaging your heart. Add to it smoking, sedentary … [+4804 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Glucofort Ingredients Reviews: Glucofort Ingredients List, Glucofort Active Ingredient, Glucofort Supplement Ingredients! - Deccan Herald", "description": "More than 95% of people are coping with different health issues. Some problems cannot be cured. Some medical procedures are also worthless. Diabetes, high cholesterol, high blood pressure, and other health issues are currently the most prevalent diseases. Dia…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucofort-ingredients-reviews-glucofort-ingredients-list-glucofort-active-ingredient-glucofort-supplement-ingredients-1153464.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1153464-1665727364.png", "publishedAt": "2022-10-14T06:02:44Z", "content": "More than 95% of people are coping with different health issues. Some problems cannot be cured. Some medical procedures are also worthless. Diabetes, high cholesterol, high blood pressure, and other … [+17081 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Symptoms, quality of life important to guide treatment for peripheral artery disease PAD - Medical Dialogues", "description": "Peripheral artery disease or PAD is the condition of developing narrowed or clogged arteries in the...", "url": "https://medicaldialogues.in/mdtv/ctvs/videos/symptoms-quality-of-life-important-to-guide-treatment-for-peripheral-artery-disease-pad-100630", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/14/187895-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px.jpg", "publishedAt": "2022-10-14T03:45:44Z", "content": "Peripheral artery disease or PAD is the condition of developing narrowed or clogged arteries in the legs. For people who live with the condition, treatment decisions and criteria for success should b… [+6526 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Odishatv Bureau", "title": "Add these five foods to your diet and boost your immunity this winter - OTV News", "description": "With winter come sniffles, cough, sore throat, and several other minor ailments that can be easily avoided - with some simple steps. Increasing your immunity to combat these issues is one of them. All it takes is to include some delectable foods in your daily…", "url": "https://odishatv.in/news/health/add-these-five-foods-to-your-diet-and-boost-your-immunity-this-winter-187857", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/Winter_1665670335.webp", "publishedAt": "2022-10-14T02:18:39Z", "content": "With winter around the corner, it’s time to put out those woollens in the sun. It is also time to start taking care of your health as the changing weather usually brings with it common cold, cough, a… [+1836 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Kimberly Drake", "title": "Spending Time In 'Blue Spaces' Linked to Better Mental Health - Healthline", "description": "An 18-country analysis published in the Journal of Environmental Psychology found that children exposed to blue spaces, such as inland lakes and coastal areas, were more likely to report better well-being in adulthood.", "url": "https://www.healthline.com/health-news/spending-time-in-blue-spaces-linked-to-better-mental-health", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/10/grandkids-ocean-1200x628-facebook-1200x628.jpg", "publishedAt": "2022-10-13T21:19:12Z", "content": "<ul><li>Growing evidence suggests exposure to natural environments can benefit health and well-being. Yet most research to date has centered around green spaces.</li><li>Using data from 18 regions wo… [+8759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you must consume soya ‘with caution’ | Lifestyle News - The Indian Express", "description": "Dr Archana Sukumaran, an Ayurveda doctor, said that soya, a species of legume is often embroiled in a \"nutritional controversy\"", "url": "https://indianexpress.com/article/lifestyle/health/should-you-eat-soya-heres-what-experts-suggest-8171917/", "urlToImage": "https://images.indianexpress.com/2022/10/soya.jpg", "publishedAt": "2022-10-13T15:20:44Z", "content": "Soya, known to be a rich source of protein for vegetarians, has long been consumed for its nutritional content and versatility. “Soybeans not only have high protein content but are also a rich source… [+5119 chars]"}]}