{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Mumbailive.com"}, "author": null, "title": "Joint Pain on The Rise In Young Adults: Doctors - Mumbai Live", "description": "Joint pain is not just limited to older people anymore There is a rise in joint pain among young adults including those who have recovered from COVID 19 A large number of youngsters are complaining of bone and joint problems It is imperative to take care of y…", "url": "https://www.mumbailive.com/en/health/joint-pain-on-the-rise-in-young-adults-reveals-doctors-74844", "urlToImage": "https://www.mumbailive.com/images/media/images/joint_pain_1661169254290.jpg?bg=d9dad5&crop=275%2C154.38596491228068%2C0%2Cnull&fit=crop&fitToScale=w%2C1368%2C768&fm=webp&h=606.3157894736842&height=183&w=1080&width=275", "publishedAt": "2022-08-22T14:00:00Z", "content": "Joint pain is not just limited to older people anymore. There is a rise in joint pain among young adults, including those who have recovered from COVID-19. A large number of youngsters are complainin… [+2278 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "'Rising Monkeypox cases will not lead to HIV', says top ICMR scientist - Rising Kashmir", "description": "Asked about the effectiveness of the smallpox vaccine against Monkeypox, she stated that the smallpox vaccination is 86 per cent effective at preventing monkeypox.", "url": "https://www.risingkashmir.com/displaynews.aspx?news=113984", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637967479929087852_images_(6).jpeg", "publishedAt": "2022-08-22T13:59:29Z", "content": "A top scientist of the Indian Council of Medical Research-National Institute of Virology on Monday stated that the rising Monkeypox cases will not lead to human immunodeficiency virus (HIV).\r\nIn an e… [+1565 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "IIT, AIIMS discover reasons of bacteria that causes infections in hospitals - Hindustan Times", "description": "The study, being performed in collaboration with Vellore Institute of Technology, uses genomics and molecular biology approaches to identify new genes responsible for the bacteria's potency.", "url": "https://www.hindustantimes.com/science/iit-aiims-discover-reasons-of-bacteria-that-causes-infections-in-hospitals-101661171824466.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/22/1600x900/aiims-bhopal_7f6be2ec-891f-11e6-ab9c-d7a7622475ab_1661175281371_1661175281371.jpg", "publishedAt": "2022-08-22T13:43:05Z", "content": "Researchers at Jodhpur's IIT and AIIMS have been studying a dangerous bacteria called Klebsiella pneumoniae, a major cause of hospital-acquired infection, and found it develops a viscous protective c… [+1888 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Georgetown University: Taking Neuroscience to School- Brain Scans Reveal the Hidden Shape of Thinking and Predict Students’ Learning Better Than Test Scores - India Education Diary", "description": "The traditional tests and grades that educators have long used may measure learning less accurately than scans of the brain, according to a new study published in Science Advances. The paper, authored by a team of researchers from seven universities", "url": "https://indiaeducationdiary.in/georgetown-university-taking-neuroscience-to-school-brain-scans-reveal-the-hidden-shape-of-thinking-and-predict-students-learning-better-than-test-scores/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/08/Georgetown-University.jpg?fit=1024%2C550&ssl=1", "publishedAt": "2022-08-22T13:32:22Z", "content": "The traditional tests and grades that educators have long used may measure learning less accurately than scans of the brain, according to a new study published in Science Advances. The paper, authore… [+5731 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists begin phase 2 clinical trials of lupus pill - News-Medical.Net", "description": "Lupus is an autoimmune disease that attacks organs and can be fatal. There's no cure, so current treatments aim to limit damage and ameliorate symptoms.", "url": "https://www.news-medical.net/news/20220822/Scientists-begin-phase-2-clinical-trials-of-lupus-pill.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_3f4ba59f12944a08a08f3d596bed291c-620x480.jpg", "publishedAt": "2022-08-22T13:31:00Z", "content": "Lupus is an autoimmune disease that attacks organs and can be fatal. There's no cure, so current treatments aim to limit damage and ameliorate symptoms. Some of these therapies have to be injected, s… [+5132 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is The Difference Between Monkeypox & Chickenpox? - NDTV", "description": "Here's everything you need to know about the difference between monkeypox and chickenpox. From symptoms, and origins to how to identify between the two.", "url": "https://www.ndtv.com/health/what-is-the-difference-between-monkeypox-chickenpox-3276197", "urlToImage": "https://c.ndtvimg.com/2022-05/rkjst6a_monkeypox-disease-650_625x300_10_May_22.jpg", "publishedAt": "2022-08-22T13:15:46Z", "content": "Lymph nodes formed in Monkeypox are swollen unlike Chickenpox\r\nMonkeypox and chickenpox are among the most talked about diseases at present. Due to the May 2022 Monkeypox outbreak, a lot of focus has… [+5415 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "COVID-19 mRNA Vaccines Associated with a Decreased Risk of Death in Patients with Heart Failure, Reports New Study - The Weather Channel", "description": "Among 101,786 heart failure patients, the researchers found that receiving an mRNA vaccine was not associated with an increased risk of worsening heart failure. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-08-22-covid-mrna-vaccines-associated-with-lower-risk-of-death", "urlToImage": "https://s.w-x.co/in-vaccine_29.jpg", "publishedAt": "2022-08-22T12:42:18Z", "content": "A study, presented at ESC Congress 2022, found that the vaccines were not associated with an increased risk of worsening heart failure, venous thromboembolism or myocarditis in heart failure patients… [+1823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can lack of sleep put you at a greater risk for diabetes? - The Indian Express", "description": "“Lack of sleep causes stress in the body which leads to increased secretion of the cortisol hormone, also known as the stress hormone. An increase in cortisol levels contributes to increased blood sugar levels,” Dr Narendra explained", "url": "https://indianexpress.com/article/lifestyle/health/lack-of-sleep-deprivation-diabetes-sleeping-disorders-8099974/", "urlToImage": "https://images.indianexpress.com/2022/08/diabetes_1200_getty-1.jpg", "publishedAt": "2022-08-22T12:00:23Z", "content": "Sleep deprivation a condition of not getting adequate duration and/or quality of sleep — has been linked to a host of health ailments, both mild and severe. According to a study published in the Nati… [+5517 chars]"}, {"source": {"id": null, "name": "Elle.in"}, "author": null, "title": "Are PCOD And PCOS The Same? Experts Weigh In - ELLE India", "description": "Are PCOD and PCOS the same? We got in touch with two experts to understand the differences between PCOD and PCOS and bust some myths.", "url": "https://elle.in/pcod-and-pcos-difference/", "urlToImage": "https://elle.in/wp-content/uploads/2022/08/Untitled-design-2022-08-10T170918.944.png", "publishedAt": "2022-08-22T11:51:13Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Cancer deaths related to behavioral risk factors, study says - The Indian Express", "description": "Researchers found 34 risk factors, with smoking, drinking and obesity taking the lead. Smoking alone was responsible for some 33.9% of cancer cases", "url": "https://indianexpress.com/article/lifestyle/health/cancer-deaths-related-to-behavioral-risk-factors-study-says-8104379/", "urlToImage": "https://images.indianexpress.com/2022/08/pexels-ave-calvar-martinez-5072316.jpg", "publishedAt": "2022-08-22T11:00:39Z", "content": "Cancer deaths could be prevented by controlling risk factors such as tobacco consumption, alcohol consumption, and high BMI, a new study by the British journal Lancet has concluded.Buy Now | Our best… [+1526 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Monkeypox reported for 3rd time in a minor in US - Daijiworld.com", "description": "New York, Aug 22 (IANS): A minor in New York has reportedly contracted monkeypox, a first among children in the state, and at least the third reported case of the disease among children in the US.\r\nThe New York Department of Health data released last week doe…", "url": "https://daijiworld.com/news/newsDisplay?newsID=991970", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_220822_mnky.jpeg", "publishedAt": "2022-08-22T10:25:02Z", "content": "New York, Aug 22 (IANS): A minor in New York has reportedly contracted monkeypox, a first among children in the state, and at least the third reported case of the disease among children in the US.\r\nT… [+1411 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Covid patients with these variants exhale most virus, reveals study. Details inside | Mint - Mint", "description": "A research has revealed that Covid infected patients who have received their vaccination doses, including the booster dose, exhale the virus into the air, thereby posing a threat for the others", "url": "https://www.livemint.com/science/news/covid19-patients-of-alpha-delta-omicron-variant-exhale-most-virus-says-study-details-inside-11661161919148.html", "urlToImage": "https://images.livemint.com/img/2022/08/22/600x338/AFP_9KZ6KU_1630201768526_1661161955292_1661161955292.jpg", "publishedAt": "2022-08-22T10:23:30Z", "content": "NEW DELHI : India has logged a slight decline in its daily Covid-19 cases, however, one should keep their guards up. Wearing masks, following Covid Appropriate Behaviour, maintaining hygienic habits … [+3599 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Monkeypox Can Linger On Common Household Items: CDC - odishabytes - OdishaBytes", "description": "New Delhi: Even though two monkeypox patients sharing a home said they disinfected surfaces, washed their hands several times a day and showered regularly, researchers found the virus on 70% of high-contact areas 20 days after their symptoms began, including …", "url": "https://odishabytes.com/monkeypox-can-linger-on-common-household-items-cdc/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2022/07/monkeypox1658480459816.jpeg", "publishedAt": "2022-08-22T10:07:29Z", "content": "New Delhi: Even though two monkeypox patients sharing a home said they disinfected surfaces, washed their hands several times a day and showered regularly, researchers found the virus on 70% of high-… [+1512 chars]"}, {"source": {"id": null, "name": "Mybigplunge.com"}, "author": "Zeyad Masroor Khan", "title": "'India must increase access to quality healthcare to eliminate Malaria' Health - The Plunge Daily", "description": "World Mosquito Day 2022 is an annual observance to commemorate Sir Ronald Ross’ discovery that female anopheles mosquitoes transmit malaria to humans. On World Mosquito Day, Malaria No More, a leading non-governmental organisation working for malaria eliminat…", "url": "https://mybigplunge.com/life/health/india-must-increase-access-to-quality-healthcare-to-eliminate-malaria/", "urlToImage": "https://mybigplunge.com/wp-content/uploads/2022/08/bug-g36c6be14c_1920-1000x600.jpg", "publishedAt": "2022-08-22T10:06:33Z", "content": "World Mosquito Day 2022 is an annual observance to commemorate Sir Ronald Ross discovery that female anopheles mosquitoes transmit malaria to humans. On World Mosquito Day, Malaria No More, a leading… [+2698 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Dietary allergies can be reversed in mice by targeting microbiome: Study - ANI News", "description": "Washington [US], August 22 (ANI): According to a study, several people with dietary allergies have minimal symptoms when they are exposed to triggering foods, others have potentially catastrophic effects. Butyrate, a bacterial chemical produced by healthy mic…", "url": "https://www.aninews.in/news/lifestyle/food/dietary-allergies-can-be-reversed-in-mice-by-targeting-microbiome-study20220822153438", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220822100407.jpg", "publishedAt": "2022-08-22T10:04:00Z", "content": "Washington [US], August 22 (ANI): According to a study, several people with dietary allergies have minimal symptoms when they are exposed to triggering foods, others have potentially catastrophic eff… [+4106 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Polio in US, UK and Israel reveals rare risk of oral vaccine - The Indian Express", "description": "Since 2017, there have been 396 cases of polio caused by the wild virus, versus more than 2,600 linked to the oral vaccine, according to figures from the World Health Organization and its partners.", "url": "https://indianexpress.com/article/world/polio-in-us-uk-and-israel-reveals-rare-risk-of-oral-vaccine-8104428/", "urlToImage": "https://images.indianexpress.com/2022/08/AP22230652430081.jpg", "publishedAt": "2022-08-22T09:39:30Z", "content": "For years, global health officials have used billions of drops of an oral vaccine in a remarkably effective campaign aimed at wiping out polio in its last remaining strongholds typically, poor, polit… [+6111 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Rare type of liver cancer found in mice: Study - Hindustan Times", "description": "The German-Israeli team discovered that precursors of degenerate liver cells are where cHCC/CCA develops. Hepatocellular carcinoma, on the other hand, most likely results from damaged mature liver cells.", "url": "https://www.hindustantimes.com/science/rare-type-of-liver-cancer-found-in-mice-study-101661159048236.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/22/1600x900/32091e86-5d7f-11ec-a699-ff3e8015d447_1639556299511_1661159248981_1661159248981.jpg", "publishedAt": "2022-08-22T09:09:40Z", "content": "Researchers from the German Cancer Research Center (Deutsches Krebsforschungszentrum, DKFZ) and the Hebrew University in Jerusalem have discovered the cell of origin of mixed liver/biliary duct carci… [+3135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "K Srinath Reddy", "title": "Here's how smoking harms the heart, clots blood and causes brain strokes - The Indian Express", "description": "Stopping tobacco consumption halves cardiovascular risk within a year and practically nullifies it by the third year. Deferring the decision to stop can be fatal, as a sudden cardiac death can strike without warning, says cardiologist K. Srinath Reddy﻿", "url": "https://indianexpress.com/article/lifestyle/health-specials/how-smoking-harms-heart-clots-blood-brain-strokes-8104668/", "urlToImage": "https://images.indianexpress.com/2022/08/no-smoking-1200.jpg", "publishedAt": "2022-08-22T09:02:00Z", "content": "A recent publication in the medical journal Lancet reported that 44.4 per cent of global cancer deaths are attributable to three risk factors — smoking, excessive alcohol consumption and a high body … [+6744 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Inflammation Triggered by Injury or Illness: When Recovery Goes Awry - SciTechDaily", "description": "New research findings reveal how recovery progresses following inflammation triggered by injury or illness. New findings offer insight into recovery after inflammation caused by a wide range of injuries or acute illnesses. Scientists defined common healthy tr…", "url": "https://scitechdaily.com/inflammation-triggered-by-injury-or-illness-when-recovery-goes-awry/", "urlToImage": "https://scitechdaily.com/images/Blood-in-Patient-With-Inflammation.jpg", "publishedAt": "2022-08-22T09:00:49Z", "content": "ByHarvard Medical SchoolAugust 22, 2022\r\nA new study provides critical clues on what differentiates a good inflammatory recovery from a bad one.\r\nNew research findings reveal how recovery progresses … [+11919 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Dengue Fever: Symptoms, Causes, Diagnosis, Treatment & Prevention - The Quint FIT", "description": "Dengue fever is quite common during the monsoon. Research shows that 80 percent of dengue cases show no symptoms, making the diagnosis difficult.", "url": "https://www.thequint.com/fit/dengue-fever-causes-symptoms-diagnosis-treatment-management", "urlToImage": "https://images.thequint.com/thequint%2F2022-08%2Fa4a86994-0b04-41f5-baf6-24e0c21b04cf%2Fdengue_vaccine_picture_id1247116794__1_.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-08-22T08:52:00Z", "content": "Cases of dengue fever have risen in recent times and therefore, we thought to share information about dengue as many people would want to know the causes, symptoms, and treatment for the viral diseas… [+606 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Know how poor muscle health impacts your immunity - Zee News", "description": "Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune system even more so to prevent minor infections from turning into more …", "url": "https://zeenews.india.com/health/know-how-poor-muscle-health-impacts-your-immunity-2500156", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/22/1080662-exercise.png", "publishedAt": "2022-08-22T08:37:05Z", "content": "New Delhi: Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune … [+3701 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Curious About Lifestyle Diseases? Here’s How You Can Combat Them - News18", "description": "These tips and tricks will help you avoid and curb lifestyle-related health issues, note them down and thank us later.", "url": "https://www.news18.com/news/lifestyle/curious-about-lifestyle-diseases-heres-how-you-can-combat-them-5791465.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-22t132849.313-166115533216x9.png", "publishedAt": "2022-08-22T08:02:33Z", "content": "Spending long hours at the desk, less physical activity, stress, smoking and a host of other concerning lifestyle habits have become the new norm. These concerns are grouped together among a cluster … [+1997 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Janvi Kapur", "title": "6 Ways to Balance Your Physical and Mental Health - Sportskeeda", "description": "Your mental health has a physical element, too. Although the mind and body are often viewed as being separate, their wellness is closely related.", "url": "https://www.sportskeeda.com/health-and-fitness/ways-balance-mental-health-physical-health", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/08/7320b-16610043996292-1920.jpg", "publishedAt": "2022-08-22T08:02:32Z", "content": "Your mental health has a physical element, too. Although the mind and body are often viewed as being separate, their wellness is closely related. Good mental health can positively affect your physica… [+4959 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "WHO shares simple tips to reduce risk of diabetes, heart disease | Mint - Mint", "description": "As per WHO, noncommunicable diseases (NCDs), including heart disease, stroke, cancer, diabetes and chronic lung disease, are collectively responsible for almost 70 percent of all deaths worldwide.", "url": "https://www.livemint.com/science/health/who-shares-simple-tips-to-reduce-risk-of-diabetes-heart-disease-11661150931384.html", "urlToImage": "https://images.livemint.com/img/2022/08/22/600x338/HEALTH-EBOLA-WHO-0_1661154301616_1661154301616_1661154320065_1661154320065.JPG", "publishedAt": "2022-08-22T07:46:47Z", "content": "The World Health Organization (WHO) in the Western Pacific Region has shared four health tips to protect against noncommunicable diseases (NCDs) such as diabetes, heart disease, stroke and cancer. Th… [+2767 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Mudra Saini", "title": "Monday Mind Talks: Know about Post-traumatic stress disorder and strategies to cope with PTSD anxiety - PINKVILLA", "description": "Dr Satish Kumar CR, Consultant - Clinical Psychology, Manipal Hospital Old Airport Road is here today to provide insight on this disturbing disorder while suggesting effective strategies to cope with this anxiety", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/monday-mind-talks-know-about-post-traumatic-stress-disorder-and-strategies-cope-ptsd-anxiety-1180267", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/social_15_3.jpg?itok=ABMaxlDp", "publishedAt": "2022-08-22T06:57:04Z", "content": "PTSD (Post Traumatic Stress Disorder) is a disorder that is defined as the failure to recuperate after witnessing a distressing event. The condition can stay for months or can even last for years. Th… [+2690 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Study finds which natural remedies help in combating COVID-19 - Rising Kashmir", "description": "Three naturally occurring substances found in foods like red wine, olive oil, and green tea are promising candidates for the creation of coronavirus-fighting medications.", "url": "https://www.risingkashmir.com/displaynews.aspx?news=113964", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637967222594392643_ANI-20220821162304.jpg", "publishedAt": "2022-08-22T06:44:28Z", "content": null}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "The Relationship Between the Blood-Brain-Barrier and the Central Effec | DMSO - Dove Medical Press", "description": "The Relationship Between the Blood-Brain-Barrier and the Central Effects of Glucagon-Like Peptide-1 Receptor Agonists and Sodium-Glucose Cotransporter-2 Inhibitors", "url": "https://www.dovepress.com/the-relationship-between-the-blood-brain-barrier-and-the-central-effec-peer-reviewed-fulltext-article-DMSO", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-08-22T06:28:22Z", "content": "Introduction\r\nType 2 diabetes mellitus (T2DM) and obesity are major public health problems affecting millions of people worldwide. T2DM is a metabolic disorder characterized by long-term hyperglycemi… [+61332 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "WHO", "title": "WHO publishes first guideline for Ebola disease therapeutics - Devdiscourse", "description": "“We have seen incredible advances in both the quality and safety of clinical care during Ebola outbreaks,” said Dr Janet Diaz, lead of the clinical management unit in WHO’s Health Emergencies programme.", "url": "https://www.devdiscourse.com/article/health/2151358-who-publishes-first-guideline-for-ebola-disease-therapeutics", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_03_2021_17_22_30_747099.jpg?width=920&format=jpeg", "publishedAt": "2022-08-22T05:46:39Z", "content": "The World Health Organization (WHO) has published its first guideline for Ebola virus disease therapeutics, with new strong recommendations for the use of two monoclonal antibodies. WHO calls on the … [+5067 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Sugar substitutes impact gut microbiome - The Siasat Daily", "description": "Non-nutritive sweeteners have made the claim that they can provide all the sweetness of sugar without any calories since the late 1800s.", "url": "https://www.siasat.com/sugar-substitutes-impact-gut-microbiome-2395374/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/08/avav.jpg", "publishedAt": "2022-08-22T05:36:00Z", "content": "Weizmann: Non-nutritive sweeteners have made the claim that they can provide all the sweetness of sugar without any calories since the late 1800s. Researchers who published their findings in the jour… [+3503 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Sri Lanka reports nearly 50,000 dengue cases in 2022 - ETHealthWorld", "description": "According to the National Dengue Control Unit (NDCU), 49,941 people have been admitted to hospitals for dengue treatment in the past eight months. Half the cases were reported from the Western province, comprising Colombo, Gampaha and Kalutara districts, Xinh…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/sri-lanka-reports-nearly-50000-dengue-cases-in-2022/93693916", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93693916,imgsize-179546,width-1200,height-628,overlay-ethealthworld/sri-lanka-reports-nearly-50-000-dengue-cases-in-2022.jpg", "publishedAt": "2022-08-22T04:50:00Z", "content": "Colombo: Sri Lanka reported nearly 50,000 cases of dengue in the first eight months of 2022, local media reported.According to the National Dengue Control Unit (NDCU), 49,941 people have been admitte… [+787 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Healthy Breakfast Ideas: 5 Nutritionist-Recommended Food Tips To Kick-Start The Day - NDTV Food", "description": "\"The right breakfast can do both - meet your nutritional needs and keep your energy levels high,\" states nutritionist Anjali Mukherjee.", "url": "https://food.ndtv.com/food-drinks/healthy-breakfast-ideas-5-nutritionist-recommended-food-tips-to-kick-start-the-day-3274448", "urlToImage": "https://i.ndtvimg.com/i/2017-06/fruit-bowl-620x350_620x350_81498544158.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-08-22T04:35:01Z", "content": "By now, we all know how important it is to have a wholesome breakfast. A fulfilling meal in the morning, loaded with every essential nutrient, helps refuel us and kick-start the day. Besides, a whole… [+3375 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Early Blood Tests Can Predict Death From Traumatic Brain Injury: Study - News18", "description": "Blood tests taken on the day of a traumatic brain injury (TBI) can predict which patients are likely to die or survive with severe disability, allowing clinicians to make decisions earlier on the possible treatment of TBI, says a new study.", "url": "https://www.news18.com/news/buzz/early-blood-tests-can-predict-death-from-traumatic-brain-injury-study-5796247.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/blood-test-166114007616x9.png", "publishedAt": "2022-08-22T03:49:34Z", "content": "Blood tests taken on the day of a traumatic brain injury (TBI) can predict which patients are likely to die or survive with severe disability, allowing clinicians to make decisions earlier on the pos… [+1460 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Covid in children raises risk of brain disorders, epilepsy: Know what study says - DNA India", "description": "People who suffered Covid-19 are at an increased risk of cognitive deficit, insomnia, ischemic stroke, nerve/psychotic disorders and epilepsy.", "url": "https://www.dnaindia.com/health/report-covid-in-children-raises-risk-of-brain-disorders-epilepsy-know-what-study-says-2978448", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/22/2532026-untitled-design-23.png", "publishedAt": "2022-08-22T03:28:00Z", "content": "People who suffered Covid-19 are at an increased risk of cognitive deficit, insomnia, ischemic stroke, nerve/psychotic disorders and epilepsy.\r\nReported By:| Edited By: DNA Web Team |Source: DNA Web … [+2179 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Julia Landwehr", "title": "Exercise, doing chores, and socialising can help lower dementia risk, study shows - Lifestyle Asia India", "description": "Frequent exercise, chores, and visits with family and friends were shown to help lower risk of multiple types of dementia.", "url": "https://www.lifestyleasia.com/ind/living/wellness-living/how-to-lower-risk-of-dementia/", "urlToImage": "https://images.lifestyleasia.com/wp-content/uploads/sites/7/2022/08/18151424/Untitled-design-2022-08-18T151417.457.png", "publishedAt": "2022-08-22T02:41:48Z", "content": "Staying mentally and physically engaged may reduce a person’s risk of developing dementia, or a loss of cognitive function, later in life, new study shows.\r\nThe studypublished last month in Neurology… [+7448 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Cancer Vaccines, Avenues Of Study In Development - Nation World News", "description": "Vaccines based on messenger RNA helped prevent Covid-19, a technology that was initially conceived to try to develop cancer vaccines, a fertile area of", "url": "https://nationworldnews.com/cancer-vaccines-avenues-of-study-in-development/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Cancer-vaccines-avenues-of-study-in-development.jpg", "publishedAt": "2022-08-22T01:18:06Z", "content": "Vaccines based on messenger RNA helped prevent Covid-19, a technology that was initially conceived to try to develop cancer vaccines, a fertile area of research with improved knowledge of the immune … [+3356 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Alzheimer’s degrades cells that cross hemispheres, visual memory suffers: Study - ThePrint", "description": "Washington [US], August 22 (ANI): New research reveals cells that span brain hemispheres to coordinate activity in visual processing centres and shows that Alzheimer’s degrades their structure and therefore their function. The results of the study, published …", "url": "https://theprint.in/health/alzheimers-degrades-cells-that-cross-hemispheres-visual-memory-suffers-study/1093509/", "urlToImage": null, "publishedAt": "2022-08-22T01:14:03Z", "content": "Washington [US], August 22 (ANI): New research reveals cells that span brain hemispheres to coordinate activity in visual processing centres and shows that Alzheimer’s degrades their structure and th… [+5540 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Meat, Fish Or Vegetables: This Is The Diet With The Highest Risk Of Hip Fracture - Nation World News", "description": "Research from the University of Leeds in the United Kingdom, published in the journal BMC Medicinehas examined the risk of hip fracture in occasional meat", "url": "https://nationworldnews.com/meat-fish-or-vegetables-this-is-the-diet-with-the-highest-risk-of-hip-fracture/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Meat-fish-or-vegetables-this-is-the-diet-with-the.jpg", "publishedAt": "2022-08-22T00:56:06Z", "content": "Research from the University of Leeds in the United Kingdom, published in the journal BMC Medicinehas examined the risk of hip fracture in occasional meat consumers; Pescatarians, people who eat fish… [+4862 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Consumption of ultra-processed foods increases risk of COVID-19 - News-Medical.Net", "description": "Researchers explore the association between consumption of ultra-processed foods and risk of SARS-CoV-2 infection.", "url": "https://www.news-medical.net/news/20220821/Consumption-of-ultra-processed-foods-increases-risk-of-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_722883_16609548519963415.jpg", "publishedAt": "2022-08-22T00:09:00Z", "content": "The rapid transmission of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), the causal agent of the coronavirus disease 2019 (COVID-19) pandemic, has immensely affected the global hea… [+5461 chars]"}, {"source": {"id": null, "name": "Hardwoodparoxysm.com"}, "author": "Shannon Bailey", "title": "Science, blind people can return to corneal vision with pig collagen - Hardwood Paroxysm", "description": "It will be possible to return to the vision again. A Swedish research team has created an artificial cornea made of pig collagen. Thanks to a new", "url": "https://hardwoodparoxysm.com/science-blind-people-can-return-to-corneal-vision-with-pig-collagen/", "urlToImage": "https://www.notizie.it/wp-content/uploads/2022/08/Cornea-collagene-maiale.jpg", "publishedAt": "2022-08-21T23:43:55Z", "content": "It will be possible to return to the vision again. A Swedish research team has created an artificial cornea made of pig collagen. \r\nThanks to a new innovative study Performed by a Swedish research te… [+1344 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Abhitash Singh", "title": "Swine flu on the rise in Thane; death toll reaches 14 - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/swine-flu-on-the-rise-in-thane-death-toll-reaches-14", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2020-08/9a863dc4-9d04-40b1-a2cf-b4caf844918d/_TEST_28AUG_20_BLSONI_02.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-08-21T17:36:50Z", "content": "In four days (Wednesday to Saturday) five people lost their lives to swine flu in Thane, taking the toll to 14, painting a worrisome picture for the health departments of the Thane Municipal Corporat… [+1447 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Try these natural ways to reduce your cholesterol levels - Times Now", "description": "Eating certain food and beverages can increase your bad cholesterol and reduce the good cholesterol which then becomes harmful for the body. Here, take a look at how you can naturally lower your cholesterol levels.", "url": "https://www.timesnownews.com/health/try-these-natural-ways-to-reduce-your-cholesterol-levels-article-93695211", "urlToImage": "https://static.tnn.in/thumb/msid-93695211,imgsize-100,width-1280,height-720,resizemode-75/93695211.jpg", "publishedAt": "2022-08-21T16:23:18Z", "content": "Soluble fibres are the ones that get dissolved in water but they cant be digested by the human body. Including these fibres can help the good bacteria in the gut which can eventually work to lower th… [+26 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "An episode of diabetic ketoacidosis may increase outpatient mortality risk - Medical Dialogues", "description": "New Zealand: A recent study in Acta Diabetologica reported a significant outpatient mortality risk...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/an-episode-of-diabetic-ketoacidosis-may-increase-outpatient-mortality-risk-97841", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/29/123634-ketoacidosis.jpg", "publishedAt": "2022-08-21T15:45:59Z", "content": "New Zealand: A recent study in Acta Diabetologica reported a significant outpatient mortality risk following an episode of diabetic ketoacidosis (DKA) with most deaths due to macrovascular or infecti… [+2215 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Hypertension among COVID-19 patients associated with poor prognosis, finds study - Medical Dialogues", "description": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to...", "url": "https://medicaldialogues.in/medicine/news/hypertension-among-covid-19-patients-associated-with-poor-prognosis-finds-study-97833", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/21/181401-hypertension.jpg", "publishedAt": "2022-08-21T14:30:56Z", "content": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to hypertension, but angiotensin-converting enzyme inhibitors (ACEIs)/angiotensin receptor blockers (A… [+2142 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Monkeypox In Pets: First Human To Animal Transmission Reported, All You Need To Know - India Today", "description": "The first record of monkeypox transmission from human beings to animals has been reported. WHO has urged caution after a case of dog catching monkeypox surfa...", "url": "https://www.youtube.com/watch?v=zhnuBS0n9Ds", "urlToImage": "https://i.ytimg.com/vi/zhnuBS0n9Ds/hqdefault.jpg", "publishedAt": "2022-08-21T14:18:56Z", "content": null}, {"source": {"id": null, "name": "Morningstar.com"}, "author": null, "title": "Ivermectin among generic drugs that failed to help COVID-19 patients avoid hospitalization, large study shows - Morningstar", "description": "", "url": "https://www.morningstar.com/news/marketwatch/20220821169/ivermectin-among-generic-drugs-that-failed-to-help-covid-19-patients-avoid-hospitalization-large-study-shows", "urlToImage": "/assets/img/marketwatch.dad5abb.png", "publishedAt": "2022-08-21T14:10:00Z", "content": "Jaimy Lee \r\nThe New England Journal of Medicine trial showed fluvoxamine and metformin also had no impact stopping severe disease \r\nA new study found three generic drugs -- fluvoxamine, which is ofte… [+3735 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Make Chai healthier and tastier with these add ons | DH Latest News, DH NEWS, Ingredients, Latest News, NEWS, Food , Make Chai healthier and tastier with these add ons, healthier Chai add ons, tastier Chai add ons - East Coast Daily (English)", "description": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to y", "url": "https://www.eastcoastdaily.in/2022/08/21/make-chai-healthier-and-tastier-with-these-add-ons.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/08/chai-lovers-wallpaper.jpg", "publishedAt": "2022-08-21T12:11:00Z", "content": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to … [+1324 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "ANI", "title": "Study suggests therapy for treatment-resistant depression - Lokmat", "description": "According to the researchers, deep brain stimulation (DBS) to the superolateral branch of the medial forebrain bundle (MFB), which is linked to reward and motivation. The study revealed metabolic brain changes over 12 months after DBS implantation, making it …", "url": "https://www.lokmattimes.com/health/study-suggests-therapy-for-treatment-resistant-depression/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/ANI-20220821110446_202208.jpg", "publishedAt": "2022-08-21T12:09:29Z", "content": "According to the researchers, deep brain stimulation (DBS) to the superolateral branch of the medial forebrain bundle (MFB), which is linked to reward and motivation. The study revealed metabolic bra… [+2912 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "Why do you get fat for no reason? - Spark Chronicles", "description": "Have you ever found yourself with a few extra pounds and do not understand what the cause is? In sho", "url": "https://sparkchronicles.com/why-do-you-get-fat-for-no-reason/", "urlToImage": "https://static.ohga.it/wp-content/uploads/sites/24/2022/08/ingrassare-senza-motivo-perche.jpg", "publishedAt": "2022-08-21T10:44:55Z", "content": "Have you ever found yourself with a few extra pounds and do not understand what the cause is? In short, have you ever thought of gaining weight for no real reason? Let’s try to understand why this ha… [+3141 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medical Dialogues Bureau", "title": "Monkeypox outbreak: ICMR to conduct sero-survey among contacts of patients - Medical Dialogues", "description": "New Delhi: The apex research regulator, the Indian Council of Medical Research (ICMR) may conduct a...", "url": "https://medicaldialogues.in/news/health/monkeypox-outbreak-icmr-to-conduct-sero-survey-among-contacts-of-patients-97804", "urlToImage": "https://medicaldialogues.in/h-upload/2021/08/03/158460-icmr.jpg", "publishedAt": "2022-08-21T09:45:37Z", "content": "New Delhi: The apex research regulator, the Indian Council of Medical Research (ICMR) may conduct a sero-survey among contacts of monkeypox patients to check for the presence of antibodies and find o… [+2623 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "This Is One Of The Best Foods To Lose Weight According To Science - Nation World News", "description": "if we talk foods to lose weightThe avena This is one to keep in mind, as it is a very complete hydrate, protein, satiating and Very useful for both losing", "url": "https://nationworldnews.com/this-is-one-of-the-best-foods-to-lose-weight-according-to-science/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/This-is-one-of-the-best-foods-to-lose-weight.jpg", "publishedAt": "2022-08-21T09:40:35Z", "content": "if we talk foods to lose weightThe avena This is one to keep in mind, as it is a very complete hydrate, protein, satiating and Very useful for both losing weight and increasing muscle mass, Because o… [+2374 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Do you know brain gathers threat cues and turns them into fear? Study reveals - ANI News", "description": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGRP is a protein that permits neurons in two distinct sections…", "url": "https://www.aninews.in/news/health/do-you-know-brain-gathers-threat-cues-and-turns-them-into-fear-study-reveals20220821145906", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220821091036.jpg", "publishedAt": "2022-08-21T09:29:00Z", "content": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGR… [+3698 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals how mosquitoes possess bizarre sense of smell - ANI News", "description": "Washington [US], August 21 (ANI): According to a recent study, the unconventional way mosquitoes analyse odours may help explain why they are so good at finding humans to bite.", "url": "https://www.aninews.in/news/science/study-reveals-how-mosquitoes-possess-bizarre-sense-of-smell20220821145736", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220821092722.jpg", "publishedAt": "2022-08-21T09:27:00Z", "content": "Washington [US], August 21 (ANI): According to a recent study, the unconventional way mosquitoes analyse odours may help explain why they are so good at finding humans to bite.The findings of the stu… [+5633 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Bhagyashree", "title": "At the age of 60 such food and drink will not be able to touch the disease - News Day Express", "description": "In order to stay healthy as we age, it is very important to have a balanced diet. It can help you maintain a healthy weight, stay energized and get the", "url": "https://www.newsdayexpress.com/lifestyle/health/at-the-age-of-60-such-food-and-drink-will-not-be-able-to-touch-the-disease/", "urlToImage": "https://static.langimg.com/thumb/msid-93689991,width-680,resizemode-3/navbharat-times.jpg", "publishedAt": "2022-08-21T08:24:50Z", "content": "In order to stay healthy as we age, it is very important to have a balanced diet. It can help you maintain a healthy weight, stay energized and get the nutrients you need. It also works to reduce the… [+2608 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Supplements that compliment women's bone, hormonal and menstrual health - Hindustan Times", "description": "Women of all age groups require an additional nutrient boost along with their regular diet to bridge the nutritional gap that occurs as a result of every month’s menstrual cycle. Here a list of supplements that compliment women's bone, hormonal and menstrual …", "url": "https://www.hindustantimes.com/lifestyle/health/supplements-that-compliment-women-s-bone-health-hormonal-health-menstrual-health-101661066283730.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/pexels-polina-tankilevitch-3873209_1661066495450_1661066513025_1661066513025.jpg", "publishedAt": "2022-08-21T07:32:57Z", "content": "Women are blessed with the gift of bringing new life into the world hence, hormones play a vital role in supporting the reproductive function but imbalances in hormones can affect a woman at any stag… [+3904 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Expert Recommends Getting Tested If One Suffers From Respiratory Problem To Identify Covid-19 Or Seasonal F - News18", "description": "The monsoon season diseases have signs of high fever, fatigue, and joint and muscle pain, which are also the same indications for Covid-19.", "url": "https://www.news18.com/news/lifestyle/expert-recommends-getting-tested-if-one-suffers-from-respiratory-problem-to-identify-covid-19-or-seasonal-flu-5784289.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/shangai-covid-lockdown-reuters-166045796916x9.jpg", "publishedAt": "2022-08-21T07:32:29Z", "content": "Amid the spike in Covid-19 cases across Delhi, the national capital has also seen a rise in seasonal flu cases recently. In addition to seasonal flu, cases of dengue and chikungunya have also rapidly… [+1860 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Indonesia announces its first case of monkeypox - The Week", "description": "The 27-year-old who lives in Jakarta had returned from an overseas trip on Aug. 8", "url": "https://www.theweek.in/news/world/2022/08/21/indonesia-announces-its-first-case-of-monkeypox.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/2/10/Monkeypox-virus-test-tubes-vial-rack-healthcare-laboratory-postive-test-resul-pandemic-shuy.jpg", "publishedAt": "2022-08-21T04:36:32Z", "content": "A man in Indonesia has tested positive for monkeypox, making him the country's first confirmed case of the disease, authorities said late Saturday.\r\n  The 27-year-old who lives in the capital, Jakart… [+1692 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Anjana A", "title": "Here are 4 tips for reducing emotional stress and anxiety | DH Latest News, DH NEWS, Latest News, NEWS, Life Style, Life Style , Anxiety, Tips, reduce, emotional stress - East Coast Daily (English)", "description": "Experts have determined that many individuals overlook the little things that might make them happy because of the hurried modern lifestyle. There are many challenges in life, and they occasionally ex", "url": "https://www.eastcoastdaily.in/2022/08/21/here-are-4-tips-for-reducing-emotional-stress-and-anxiety.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/08/female_smile_1296x728-header-1296x728-1.jpg", "publishedAt": "2022-08-21T03:21:00Z", "content": "Experts have determined that many individuals overlook the little things that might make them happy because of the hurried modern lifestyle. There are many challenges in life, and they occasionally e… [+1659 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Cuba confirms first monkeypox case in visitor from Italy - Moneycontrol", "description": "The patient remains in critical condition.", "url": "https://www.moneycontrol.com/news/world/cuba-confirms-first-monkeypox-case-in-visitor-from-italy-9062871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/08/Monkeypox_AFP-770x435.jpg", "publishedAt": "2022-08-21T02:28:08Z", "content": "Cuba confirmed its first case of monkeypox late on Saturday, the country's Public Health ministry said, after detecting the viral disease in a tourist who had arrived from Italy this week.\r\nThe Itali… [+605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sridhar Vivan", "title": "Body heating up? Might be new normal, say doctors - Bangalore Mirror", "description": "However, Dr SN Aravinda, Consultant - Internal Medicine, Aster RV Hospital was more cautious. “We surely cannot say such high fever is the new normal. Such high temperatures are usually witnessed onl", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/body-heating-up-might-be-new-normal-say-doctors/articleshow/93682789.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-84566,msid-93682840/93682840.jpg", "publishedAt": "2022-08-21T00:30:00Z", "content": "Proper medication, rest and a healthy diet are some lifestyle habits that will help in staying healthyIf youre one of those who has managed to steer clear of any infection in this weather, you are on… [+2811 chars]"}, {"source": {"id": null, "name": "Brighterkashmir.com"}, "author": null, "title": "Heart Disease: Not an Old Age Thing - Brighter Kashmir", "description": "Heart Disease: Not an Old Age Thing", "url": "http://brighterkashmir.com/heart-disease-not-an-old-age-thing", "urlToImage": "http://secure.brighterkashmir.com//images/news/5c67445d-4b1e-47ce-9c41-6c45bbcfd03a.jpg", "publishedAt": "2022-08-20T19:26:24Z", "content": "May 31, 2022. A melodious evening in the City of Joy. Seemingly healthy, Krishnakumar Kunnath (KK) had fans singing along at the Nazrul Mancha auditorium. He had complained of some uneasiness during … [+5188 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kat Bayly", "title": "Can yoga help you lose weight? - Livescience.com", "description": "It’s known to improve flexibility and reduce stress, but can yoga help you lose weight too?", "url": "https://www.livescience.com/can-yoga-help-you-lose-weight", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dWSgjwz4qtotzFemFDerEU-1200-80.jpg", "publishedAt": "2022-08-20T15:00:02Z", "content": "Can yoga help you lose weight? There’s plenty of evidence to suggest it can help with mobility, but there’s not much proof to show that the exercise is a real calorie-torcher. One study, published in… [+5336 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Aditi Sharma", "title": "Mental Health: How effective are anti-depressants? New study creates flutter - Zee News", "description": "Pixabay) Depression doesn’t have a single cause Unlike infectious diseases, there isn’t a one-to-one causal relationship or there isn’t a single factor that leads to depression for all.", "url": "https://zeenews.india.com/health/mental-health-how-effective-are-anti-depressants-new-study-creates-flutter-2499385.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/20/1079951-depression-study.jpg", "publishedAt": "2022-08-20T09:30:46Z", "content": "Cutting off ties with friends. Staying in bed all day. Feeling empty and unmotivated. Anyone who notices these signs in their loved ones would probably suspect they are suffering from the dreaded but… [+4934 chars]"}]}