{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "COVID-19 virus 1000 times likely to spread through air than surfaces, study finds - WION", "description": "A recent study, which was published in the Journal of Exposure Science & Environmental Epidemiology, states that people are most likely to contract COVID-19 from air particles.", "url": "https://www.wionews.com/world/covid-19-virus-1000-times-likely-to-spread-through-air-than-surfaces-study-finds-476860", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/04/19/255751-covid-19-in-india.jpg", "publishedAt": "2022-05-06T12:41:22Z", "content": "A recent study, which was published in the Journal of Exposure Science &amp; Environmental Epidemiology, states that people are most likely to contract COVID-19 from air particles.\r\nThe study found t… [+1789 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Researchers identify proteins that render malaria treatments ineffective - News9 LIVE", "description": "The findings brings scientists closer to outsmarting the malaria parasite", "url": "https://www.news9live.com/science/researchers-identify-proteins-that-render-malaria-treatments-ineffective-168734", "urlToImage": "https://media.news9live.com/h-upload/2022/05/06/337281-mosuitocropped.jpg", "publishedAt": "2022-05-06T12:39:48Z", "content": "Researchers have found out why malaria parasites are resistant to some treatments, by characterising two proteins PfMDR1 and PfCRT that transport away drugs from regions where they can exert their ki… [+3057 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Impact of COVID-19 during pregnancy on development of fetal auditory system - News-Medical.Net", "description": "In a new study, researchers assessed the effect of coronavirus disease 2019 (COVID-19) during pregnancy and the consequent impact on the auditory system of the infants.", "url": "https://www.news-medical.net/news/20220506/Impact-of-COVID-19-during-pregnancy-on-development-of-fetal-auditory-system.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712916_16518395947097249.jpg", "publishedAt": "2022-05-06T12:33:00Z", "content": "In a recent study published in the American Journal of Otolaryngology, researchers assessed the effect of coronavirus disease 2019 (COVID-19) during pregnancy and the consequent impact on the auditor… [+4784 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Virus detected in pig heart used in human transplant - DNA India", "description": "A Maryland man, 57-year-old David Bennett Sr, died in March, two months after the groundbreaking experimental transplant.", "url": "https://www.dnaindia.com/science/report-virus-detected-in-pig-heart-used-in-human-transplant-maryland-2951052", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/05/06/1743355-1014111-doctor.jpg", "publishedAt": "2022-05-06T12:32:00Z", "content": "Researchers trying to learn what killed the first person to receive a heart transplant from a pig have discovered the organ harboured an animal virus but cannot yet say if it played any role in the m… [+1646 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "6 Exercises For People With Ankylosing Spondylitis - NDTV Doctor", "description": "Suffering from Ankylosing Spondylitis can have numerous effects on the body. Try these exercises to reduce and relieve the symptoms of AS.", "url": "https://doctor.ndtv.com/living-healthy/6-exercises-for-ankylosing-spondylitis-patients-2945619", "urlToImage": "https://c.ndtvimg.com/2020-05/vu08cck_back-pain_625x300_11_May_20.jpg", "publishedAt": "2022-05-06T12:11:48Z", "content": "Ankylosing Spondylitis (AS) is a kind of arthritis that causes pain in your lower back. This happens when the vertebrae in the spinal column merge and become stiff (ankylosis). The main symptoms of A… [+3674 chars]"}, {"source": {"id": null, "name": "Emeatribune.com"}, "author": "News Agencies", "title": "For a respiratory disease, COVID-19 causes some peculiar symptoms. It can diminish th… – EMEA TRIBUNE Breaking News, World News, Latest News, Top Headlines - EMEA TRIBUNE", "description": "", "url": "https://emeatribune.com/for-a-respiratory-disease-covid-19-causes-some-peculiar-symptoms-it-can-diminish-th/", "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png", "publishedAt": "2022-05-06T12:02:16Z", "content": "For a respiratory disease, COVID-19 causes some peculiar symptoms. It can diminish the senses of smell and taste, leave patients with discolored COVID toes or even cause a swollen, bumpy COVID tongue… [+6430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "‘India too may have acute hepatitis cases… Child specialists must stay alert’ - The Indian Express", "description": "Over the last three weeks, several cases of acute hepatitis or liver inflammation of unknown origin have been reported among children in the US and Europe. At least 17 of them needed a liver transplant and one died of the disease as per the World Health Organ…", "url": "https://indianexpress.com/article/lifestyle/health/hepatitis-child-specialists-must-doctor-explains-7904120/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor.jpg", "publishedAt": "2022-05-06T11:37:34Z", "content": "Why Dr Sarin: Dr Shiv Kumar Sarin is the vice-chancellor of the Institute of Liver and Biliary Sciences, a stand-alone government hospital dedicated to the treatment and research of liver diseases. H… [+5355 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "Severe obesity blunts antibody response to Covid vaccines, finds study - Deccan Herald", "description": "Obesity has been a known risk factor for Covid-19 infection. And now a study reveals, that severely obese people may have a significantly weaker immune response to Covid vaccination compared to those with normal weight. Obesity is complicating the course of C…", "url": "https://www.deccanherald.com/science-and-environment/severe-obesity-blunts-antibody-response-to-covid-vaccines-finds-study-1107006.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/05/06/2022-05-02t133421z161834677rc20zt99q3bwrtrmadp3health-coronavirus-philippines-myanmarjpg-1105866-1651505487-1107006-1651836883.jpg", "publishedAt": "2022-05-06T11:30:15Z", "content": "Obesity has been a known risk factor for Covid-19 infection. And now a study reveals, that severely obese people may have a significantly weaker immune response to Covid vaccination compared to those… [+2656 chars]"}, {"source": {"id": null, "name": "BOOM"}, "author": "AFP", "title": "No, Hepatitis Outbreak In Children Is Not Caused Due To COVID-19 Shots | BOOM - BOOM", "description": "Experts dismissed the idea that the COVID-19 shots are to blame, saying most of those affected were...", "url": "https://www.boomlive.in/world/fake-news-covid-19-hepatitis-outbreak-children-vaccination-17778", "urlToImage": "https://www.boomlive.in/h-upload/2022/05/06/976557-hepatitis-outbreak-covid-19.jpg", "publishedAt": "2022-05-06T11:14:54Z", "content": "Online articles shared hundreds of thousands of times on social media claim the global outbreak of severe hepatitis in children is linked to COVID-19 vaccines, citing an April 2022 study as evidence.… [+5526 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Can Rapid Antigen Tests Successfully Detect New Covid Variants? Study Answers | Mint - Mint", "description": "Researchers say that antigen test performance needs to be reevaluated for emerging variants", "url": "https://www.livemint.com/news/india/can-rapid-antigen-tests-successfully-detect-new-covid-variants-study-answers-11651830378212.html", "urlToImage": "https://images.livemint.com/img/2022/05/06/600x338/rapid_antigen_test_1651835029166_1651835029286.JPG", "publishedAt": "2022-05-06T11:05:36Z", "content": "With periodic surges in Covid-19 cases across the globe, the rapid antigen tests continue to remain a useful tool for many. However, due to the emergence of new variants, their efficacy to detect the… [+1701 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Omicron Not Mild As Thought, Latest Study Finds It As Deadly As Delta, Alpha COVID Variants - India.com", "description": "According to the latest study led by the Massachusetts General Hospital and Harvard Medical School, the risks of hospitalisation and mortality, in case of infection from the Omicron variant of COVID-19, were nearly identical between previous waves of Covid-19.", "url": "https://www.india.com/health/covid-4th-wave-omicron-not-mild-as-thought-latest-study-finds-it-as-deadly-as-delta-alpha-covid-variants-5371169/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/04/Omicron.jpg", "publishedAt": "2022-05-06T10:45:38Z", "content": "New York: Coronavirus infection from the Omicron variant is not mild as generally touted, rather is as deadly as Delta, Alpha and other strains of Covid-19 that claimed thousands of lives globally, f… [+2868 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: COVID-19 reinfection can occur sooner than you think; here's why immunity may wane faster - Times of India", "description": "Many researchers have looked into the phenomenon of reinfection and waning immunity. While many agree on COVID immunity lasting upto 90 days and beyond, there are those who have argued it could be shorter.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-covid-19-reinfection-can-occur-sooner-than-you-think-heres-why-immunity-may-wane-faster/photostory/91371363.cms", "urlToImage": "https://static.toiimg.com/photo/91371382.cms", "publishedAt": "2022-05-06T10:30:00Z", "content": "The small case series conducted by the U.S. Centers for Disease Control and Prevention (CDC) looked into 10 cases from four states namely Rhode Island, Vermont, Washington and Wisconsin. The patients… [+992 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Surgery or radiation? Research says THIS produces better quality of life for prostate cancer patients - Times Now", "description": "After being diagnosed with prostate cancer, many men are confused about their treatment options. They probably wonder: Do I go for radiation? Do I go for surgery? Well-intended people may give certain suggestions or recommendations. Here's what a US Prostate …", "url": "https://www.timesnownews.com/health/surgery-or-radiation-research-says-this-produces-better-quality-of-life-for-prostate-cancer-patients-article-91372700", "urlToImage": "https://static.tnn.in/thumb/msid-91372700,imgsize-100,width-1280,height-720,resizemode-75/91372700.jpg", "publishedAt": "2022-05-06T10:12:59Z", "content": "Russia is here forever, there should be no doubt about this: Russian lawmaker discloses Moscow's plans in southern Ukraine"}, {"source": {"id": null, "name": "Medical Device Network"}, "author": "Srivani Venna", "title": "University of Manchester's research reveals new ovarian cancer blood test - Medical Device Network", "description": "The University of Manchester has announced that a simple new blood test could help quickly diagnose ovarian cancer, particularly in women aged below 50 years, according to research. Health charity Wel", "url": "https://www.medicaldevice-network.com/news/university-of-manchesters-ovarian-cancer-test/", "urlToImage": "https://www.medicaldevice-network.com/wp-content/uploads/sites/23/2022/05/Cancer-research-800x778.jpg", "publishedAt": "2022-05-06T09:52:37Z", "content": "The University of Manchester has announced that a simple new blood test could help quickly diagnose ovarian cancer, particularly in women aged below 50 years, according to research.\r\nHealth charity W… [+1750 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Researchers from India, US jointly develop optogenetic tool for neurological disorders - ThePrint", "description": "New Delhi, May 6 (PTI) Researchers at the Jamia Millia Islamia (JMI) here in collaboration with the US National Institutes of Health (NIH) have developed an optogenetic tool which can help understand brain disorders like Alzheimer’s disease, depression and sc…", "url": "https://theprint.in/india/researchers-from-india-us-jointly-develop-optogenetic-tool-for-neurological-disorders/945124/", "urlToImage": null, "publishedAt": "2022-05-06T09:45:52Z", "content": "New Delhi, May 6 (PTI) Researchers at the Jamia Millia Islamia (JMI) here in collaboration with the US National Institutes of Health (NIH) have developed an optogenetic tool which can help understand… [+2550 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Deutsche Welle", "title": "Think 8 hours of sleep is best? Think again! - Hindustan Times", "description": "Are you 38 or older? Then you may want to rethink how much sleep you truly need. A team of international researchers has found that less is more. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/think-8-hours-of-sleep-is-best-think-again-101651829616998.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/06/1600x900/sleep_1651829663776_1651829691538.jpg", "publishedAt": "2022-05-06T09:37:31Z", "content": "Most of us have internalized it as a rule: A full night of sleep means eight hours for adults. But that may no longer be true once people hit a certain age. A team of researchers from the University … [+3539 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Digging Deep: Climate change could mean increased pathogen transmission - The Indian Express", "description": "The number of pathogens jumping from one mammal species to another related species will only increase in the years to come, suggests a new report.", "url": "https://indianexpress.com/article/technology/science/digging-deep-climate-change-could-mean-increased-pathogen-transmission-7904103/", "urlToImage": "https://images.indianexpress.com/2022/05/Pathogen-Pixabay.jpg", "publishedAt": "2022-05-06T09:22:10Z", "content": "Global warming is inevitably going to change biogeography, causing shifts in habitats. Species will come in contact with other species with whom they had no prior contact whatsoever. Mammals and viru… [+5611 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "High Cholesterol: Warning signs that tell your cholesterol level is high and ways to lower it - Times of India", "description": "High cholesterol is associated with major ailments of the body. The buildup of plaques due to the presence of high levels of cholesterol in the body is the main reason behind serious diseases like cardiovascular disease, peripheral arterial disease, coronary …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/high-cholesterol-warning-signs-that-tell-your-cholesterol-level-is-high-and-ways-to-lower-it/photostory/91368522.cms", "urlToImage": "https://static.toiimg.com/photo/91368731.cms", "publishedAt": "2022-05-06T09:05:07Z", "content": "Lifestyle changes are extremely crucial if you have a high level of cholesterol in the body.\r\nDiet, physical activity contribute a lot towards regulating the cholesterol level in a human being.\r\nHere… [+1304 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cognitive impairment from severe Covid-19 similar to 20 years of ageing: Study - The Indian Express", "description": "Scales measuring anxiety, depression and post-traumatic stress disorder were also assessed. Their data were compared against matched controls.", "url": "https://indianexpress.com/article/lifestyle/health/cognitive-impairment-from-severe-covid-19-similar-to-20-years-of-ageing-study-7902274/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-19.jpg", "publishedAt": "2022-05-06T08:40:43Z", "content": "Cognitive impairment as a result of severe COVID-19 is similar to that sustained with 20 years of ageing, between 50 and 70 years of age, and is the equivalent of losing 10 intelligence quotient (IQ)… [+4387 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Researchers present non-endoscopic method to detect esophageal cancer - Code List", "description": "This would mean an advance in early detection in places where there is no access to the necessary equipment for examinations. Lesions in the esophagus caused by cancer. Photo: Shutterstock. Squamous cell carcinoma of the esophagus can be detected by analyzing…", "url": "https://codelist.biz/2022/05/06/researchers-present-non-endoscopic-method-to-detect-esophageal-cancer/", "urlToImage": "https://medicinaysaludpublica.blob.core.windows.net.optimalcdn.com/images/2022/03/03/ce-2021-186f1-d8832c25.jpg", "publishedAt": "2022-05-06T08:28:53Z", "content": "This would mean an advance in early detection in places where there is no access to the necessary equipment for examinations.\r\n Lesions in the esophagus caused by cancer. Photo: Shutterstock.Squamous… [+3161 chars]"}, {"source": {"id": null, "name": "Nagpurtoday.in"}, "author": null, "title": "Can Type-2 diabetes be reversed? - Nagpur News", "description": "Nagpur Today : Nagpur News Featured Can Type-2 diabetes be reversed?", "url": "https://www.nagpurtoday.in/can-type-2-diabetes-be-reversed/05061306", "urlToImage": "https://www.nagpurtoday.in/wp-content/uploads/2022/05/Type-2-Diabetes.jpg", "publishedAt": "2022-05-06T07:38:15Z", "content": "Type-2 diabetes is also known by the acronym T2D. It refers to a condition in a person whose glucose assimilation in the body remains unregulated because of impaired insulin production or acceptance.… [+5198 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Gut bacteria may affect brain health, make you vulnerable to certain brain diseases: Harvard research - Times Now", "description": "You know tension can give you a headache, and a stomach ache. Stress can cause loosies and trigger IBS (Irritable Bowel Syndrome). A Harvard doctor explains how the microbes in your intestine can govern your mental health as well.", "url": "https://www.timesnownews.com/health/gut-bacteria-may-affect-brain-health-make-you-vulnerable-to-certain-brain-diseases-harvard-research-article-91367517", "urlToImage": "https://static.tnn.in/thumb/msid-91367517,imgsize-100,width-1280,height-720,resizemode-75/91367517.jpg", "publishedAt": "2022-05-06T06:57:51Z", "content": "Samantha Ruth Prabhu stuns in hot pink plunging neckline dress, estranged husband Naga Chaitanya's cousin approves"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Massachusetts Institute of Technology: Tracing a cancer’s family tree to its roots reveals how tumors grow - India Education Diary", "description": "Over time, cancer cells can evolve to become resistant to treatment, more aggressive, and metastatic — capable of spreading to additional sites in the body and forming new tumors. The more of these traits that a cancer evolves, the more deadly it bec", "url": "https://indiaeducationdiary.in/massachusetts-institute-of-technology-tracing-a-cancers-family-tree-to-its-roots-reveals-how-tumors-grow/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/12/Massachusetts-Institute-of-Technology.jpg", "publishedAt": "2022-05-06T06:50:24Z", "content": "Over time, cancer cells can evolve to become resistant to treatment, more aggressive, and metastatic capable of spreading to additional sites in the body and forming new tumors. The more of these tra… [+7543 chars]"}, {"source": {"id": null, "name": "Sambadenglish.com"}, "author": "Sambad English Bureau", "title": "Breakfast mistakes you should avoid - Sambad English", "description": "New Delhi: We have always heard \"Eat Breakfast like a King\" but in today's rushed world everyone's meal timings are scattered, sleep is erratic and they want to look a certain way, cutting calories is affecting their breakfast intake every day!Breakf", "url": "https://sambadenglish.com/breakfast-mistakes-you-should-avoid/", "urlToImage": "https://sambadenglish.com/wp-content/uploads/2022/04/protein-breakfast.jpg", "publishedAt": "2022-05-06T06:04:16Z", "content": "New Delhi: We have always heard “Eat Breakfast like a King” but in today’s rushed world everyone’s meal timings are scattered, sleep is erratic and they want to look a certain way, cutting calories i… [+3319 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus symptoms: The most bizarre COVID symptoms seen so far - Times of India", "description": "COVID has posed new threats before us every single day since the pandemic started. New symptoms, new methods of testing, new medicines, new vaccines and a lot many things have come into our lives in these two years.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-the-most-bizarre-covid-symptoms-seen-so-far/photostory/91364584.cms", "urlToImage": "https://static.toiimg.com/photo/91364848.cms", "publishedAt": "2022-05-06T05:30:00Z", "content": "COVID has posed new threats before us every single day since the pandemic started. New symptoms, new methods of testing, new medicines, new vaccines and a lot many things have come into our lives in … [+719 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Master gene that can restore hearing loss discovered - The Statesman", "description": "In a breakthrough, US scientists have discovered a single master gene that programs ear hair cells into either outer or inner ones, overcoming a major hurdle that had prevented the development of these cells to restore hearing.", "url": "https://www.thestatesman.com/technology/science/master-gene-can-restore-hearing-loss-discovered-1503068640.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/04/WhatsApp-Image-2022-04-19-at-13.22.14.jpeg", "publishedAt": "2022-05-06T04:30:01Z", "content": "In a breakthrough, US scientists have discovered a single master gene that programs ear hair cells into either outer or inner ones, overcoming a major hurdle that had prevented the development of the… [+2512 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Is the global increase in measles cases driven by COVID pandemic? - EastMojo", "description": "A report by the World Health Organization (WHO) and UNICEF warns that there could be a significant increase in the number of measles cases around the", "url": "http://www.eastmojo.com/health/2022/05/06/is-the-global-increase-in-measles-cases-driven-by-covid-pandemic/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/07/covid-19-5665811_1280-1.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2022-05-06T03:50:00Z", "content": "A report by the World Health Organization (WHO) and UNICEF warns that there could be a significant increase in the number of measles cases around the world. More than 17,000 cases have already been r… [+5150 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Variolation - Face masks might reduce COVID-19 severity - News-Medical.Net", "description": "In a recent study published in the Journal of the Royal Society Interface, researchers developed an epidemiological model to demonstrate that mask-induced variolation causes milder severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection.", "url": "https://www.news-medical.net/news/20220505/Variolation-Face-masks-might-reduce-COVID-19-severity.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712884_16518086223495033.jpg", "publishedAt": "2022-05-06T03:45:00Z", "content": "In a recent study published in the Journal of the Royal Society Interface, researchers developed an epidemiological model to demonstrate that mask-induced variolation causes milder severe acute respi… [+5315 chars]"}, {"source": {"id": null, "name": "Womenlovetech.com"}, "author": null, "title": "Why It’s Time For Women To Advocate For Their Health - Women Love Tech ", "description": "Research shows that gender biases persist in the healthcare system, significantly undermining the quality of medical care that women receive.", "url": "https://womenlovetech.com/why-its-time-for-women-to-advocate-for-their-health/", "urlToImage": "https://womenlovetech.com/wp-content/uploads/2022/05/pexels-shvets-production-7176317-scaled.jpg", "publishedAt": "2022-05-06T03:43:16Z", "content": "Good health may well be the greatest gift that life has to offer, but its often a gift that many of us take for granted until its gone. Indeed, youre perhaps never more vulnerable than when you find … [+4630 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Ibuprofen administration with RAS inhibitors and diuretics linked to AKI - Medical Dialogues", "description": "Anyone who is taking a diuretic and a renin-angiotensin system (RSA) inhibitor for high blood...", "url": "https://medicaldialogues.in/nephrology/news/ibuprofen-administration-with-ras-inhibitors-and-diuretics-linked-to-aki-92509", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/06/175714-kidney.jpg", "publishedAt": "2022-05-06T02:30:00Z", "content": "Anyone who is taking a diuretic and a renin-angiotensin system (RSA) inhibitor for high blood pressure should be cautious about also taking ibuprofen, according to new research. \r\nDiuretics and RSA i… [+1624 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Reduced-calorie diet plus time-restricted eating promote longevity in mice - News-Medical.Net", "description": "One recipe for longevity is simple, if not easy to follow: eat less. Studies in a variety of animals have shown that restricting calories can lead to a longer, healthier life.", "url": "https://www.news-medical.net/news/20220505/Reduced-calorie-diet-plus-time-restricted-eating-promote-longevity-in-mice.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/weight_loss-620x480.jpg", "publishedAt": "2022-05-05T23:37:00Z", "content": "One recipe for longevity is simple, if not easy to follow: eat less. Studies in a variety of animals have shown that restricting calories can lead to a longer, healthier life.\r\nNow, new research sugg… [+4909 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "NYT News Service", "title": "New subvariant spreading rapidly in US - Times of India - Times of India", "description": "US News: First came Omicron, then came its highly contagious subvariant, BA.", "url": "https://timesofindia.indiatimes.com/world/us/new-subvariant-spreading-rapidly-in-us/articleshow/91358842.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91358891,width-1070,height-580,imgsize-35598,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-05T22:37:00Z", "content": "New subvariant spreading rapidly in US"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "Interferon therapy shows striking results against COVID-19 - Science", "description": "Given early, one shot sliced hospitalization risk by half in large trial", "url": "https://www.science.org/content/article/interferon-therapy-shows-striking-results-against-covid-19", "urlToImage": "https://www.science.org/do/10.1126/science.adc8696/abs/_20220422_on_interferon-drug_thumbnailpicture.jpg", "publishedAt": "2022-05-05T20:13:40Z", "content": "From the earliest days of the pandemic, scientists have hoped that interferons, a family of potent proteins that are the body’s own first line of defense against viruses, could become weapons against… [+6343 chars]"}, {"source": {"id": null, "name": "Consultant360.com"}, "author": null, "title": "Nutritional Supplements, Exercise Reduced Risk of Invasive Cancer in Older Adults - Consultant360", "description": "Researchers tested the effects of lifestyle interventions such as nutritional supplementation and an exercise program in preventing invasive cancer in older adults.", "url": "https://www.consultant360.com/nutritional-supplements-exercise-reduced-risk-invasive-cancer-older-adults", "urlToImage": "https://d148x66490prkv.cloudfront.net/c360/2022-05/exercise%20dumbells%20running%20shoes.jpg", "publishedAt": "2022-05-05T19:34:48Z", "content": "Combining the use of vitamin D3 and omega-3 fatty acids supplements, and weight-bearing exercise may reduce the risk of invasive cancer by nearly 40% in adults aged 70 years or older. Each interventi… [+1597 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Dog Coronavirus Jumps to Humans, With a Protein Shift - SciTechDaily", "description": "Cornell scientists have identified a shift that occurs in canine coronavirus that points to a possible pattern of change found in other coronaviruses and which may provide clues to how they transmit to humans from animals. A new canine coronavirus was first i…", "url": "https://scitechdaily.com/new-dog-coronavirus-jumps-to-humans-with-a-protein-shift/", "urlToImage": "https://scitechdaily.com/images/Dog-COVID-Mask-Close-Up.jpg", "publishedAt": "2022-05-05T19:32:47Z", "content": "ByCornell UniversityMay 5, 2022\r\nResearchers have discovered a shift in canine coronavirus that points to a possible pattern of change found in other coronaviruses and may provide clues to how they s… [+4614 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Fat in the fire - Daily Pioneer", "description": "COVID obesity is a stark truth staring us in the face, and the prediction is scary\n\nThe COVID pandemic is giving rise to a second one that is tugging at the waistline of a growing number of adults and children — the obesity pandemic. The World Health Organisa…", "url": "https://www.dailypioneer.com/2022/columnists/fat-in-the-fire.html", "urlToImage": "https://www.dailypioneer.com/uploads/2022/story/images/big/fat-in-the-fire-2022-05-06.jpg", "publishedAt": "2022-05-05T18:35:42Z", "content": "COVID obesity is a stark truth staring us in the face, and the prediction is scary\r\nThe COVID pandemic is giving rise to a second one that is tugging at the waistline of a growing number of adults an… [+2916 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Covid infection may boost antibodies against common cold - Daily Pioneer", "description": "Getting sick with a common cold doesn't make you immune to Covid-19, but a Covid infection might, at least temporarily, boost the number of antibodies you have against common cold-causing coronaviruses and the SARS-CoV-1 and MERS-CoV viruses, all of which are…", "url": "https://www.dailypioneer.com/2022/india/covid-infection-may-boost-antibodies-against-common-cold.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-05-05T18:31:54Z", "content": "Getting sick with a common cold doesn't make you immune to Covid-19, but a Covid infection might, at least temporarily, boost the number of antibodies you have against common cold-causing coronavirus… [+2357 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Beccy Corkill", "title": "How Do Mosquitoes Locate Their Human Meals? New Research Has An Answer - IFLScience", "description": "Mosquitoes are a buzzing and biting nuisance, but are also the deadliest animals to humans, due to the transmission of different viruses and parasites. Som", "url": "https://www.iflscience.com/plants-and-animals/how-do-mosquitoes-locate-their-human-meals-new-research-has-an-answer/", "urlToImage": "https://cdn.iflscience.com/images/14080556-f04a-5321-a384-98527f21ec04/default-1651757968-aedes-aegypti-mosquito-the-vector-of-many-viruses.jpg", "publishedAt": "2022-05-05T15:43:00Z", "content": "Mosquitoes are a buzzing and biting nuisance, but are also the deadliest animals to humans, due to the transmission of different viruses and parasites. Some species of these flying killing machines f… [+3263 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Andrew E. Budson", "title": "LATE: A common but largely unknown cause of dementia - Medical Xpress", "description": "If dementia is a general term that means thinking and memory has deteriorated to the point that it interferes with day-to-day function, what are the top three disorders that cause dementia in older individuals?", "url": "https://medicalxpress.com/news/2022-05-late-common-largely-unknown-dementia.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/dementia.jpg", "publishedAt": "2022-05-05T15:03:27Z", "content": "If dementia is a general term that means thinking and memory has deteriorated to the point that it interferes with day-to-day function, what are the top three disorders that cause dementia in older i… [+4305 chars]"}, {"source": {"id": null, "name": "Becker's Hospital Review"}, "author": "Erica Carbajal", "title": "6 updates on the US' human bird flu case - Becker's Hospital Review", "description": "Health officials on April 28 confirmed the nation's first human bird flu case after a Colorado man who had been working on a commercial farm with infected poultry tested positive for an H5 virus.", "url": "https://www.beckershospitalreview.com/public-health/6-updates-on-the-us-human-bird-flu-case.html", "urlToImage": null, "publishedAt": "2022-05-05T14:32:25Z", "content": "Health officials on April 28 confirmed the nation's first human bird flu case after a Colorado man who had been working on a commercial farm with infected poultry tested positive for an H5 virus.\r\nSi… [+1976 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "How much extra Vitamin C is essential for good health? - The Siasat Daily", "description": "Wellington: The pandemic is largely responsible for advocating the idea of proper intake of Vitamin C, known as an important immune-support nutrient and vital in helping the body protect itself from severe viral illnesses. But how much is the right amount nee…", "url": "https://www.siasat.com/how-much-extra-vitamin-c-is-essential-for-good-health-2321146/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/Vitamin-C_mar21.jpg", "publishedAt": "2022-05-05T14:04:00Z", "content": "Wellington: The pandemic is largely responsible for advocating the idea of proper intake of Vitamin C, known as an important immune-support nutrient and vital in helping the body protect itself from … [+2405 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Experts recommend additional cholesterol-lowering medications for adults at high risk of heart disease - PTC News", "description": "According to an international team of experts, additional cholesterol-lowering drugs should be offered to patients with \"bad\" cholesterol (LDL) levels (70 mg/dl or more) and those at high risk of heart disease.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://ptcnews-wp.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/05/What-people-with-high-risk-of-heart-disease-should-consume-1.jpg", "publishedAt": "2022-05-05T13:14:18Z", "content": "Washington [US], May 5: According to an international team of experts, additional cholesterol-lowering drugs should be offered to patients with \"bad\" cholesterol (LDL) levels (70 mg/dl or more) and t… [+2149 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Devrupa Rakshit", "title": "Why 'Sleep on It' Is Good Advice For Stressful Situations - The Swaddle", "description": "\"Sleep... help[s] us solve problems by accessing information that is remote to the initial problem [and] may not be initially brought to mind.\"", "url": "https://theswaddle.com/why-sleep-on-it-is-good-advice-for-stressful-situations/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/05/Sleep-on-It-Editorials-min.png", "publishedAt": "2022-05-05T11:30:37Z", "content": "If there is one undisputed common wisdom in this day and time, it is that of “sleeping on something” that perturbs us. Tired after a long day at work? Fought with a friend? Vexed about a major decisi… [+3657 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Real Health: Top Tips for Effective Weight Loss - Independent.ie", "description": "On this week’s episode of Real Health, I’m bringing you my top tips for weight loss. Weight loss is about more than simply wanting to change how you look. We...", "url": "https://www.youtube.com/watch?v=gXWauDc8gVI", "urlToImage": "https://i.ytimg.com/vi/gXWauDc8gVI/hqdefault.jpg", "publishedAt": "2022-05-05T11:00:17Z", "content": null}, {"source": {"id": null, "name": "India TV News"}, "author": "Health Desk", "title": "COVID-19 treatment: Oral medications that can help cure severe viral infection - India TV News", "description": "The COVID-19 pandemic has mandated the requirement of oral medications that can eliminate the viral load inside an infected person's body and help cure the disease.", "url": "https://www.indiatvnews.com/health/covid19-coronavirus-treatment-oral-medication-wonder-drug-molnupiravir-cures-infection-high-daily-dose-2022-05-05-774438", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/05/medicine-1651746926.jpg", "publishedAt": "2022-05-05T10:42:31Z", "content": "<ul><li>Oral medication for COVID-19 will take the load off healthcare system during the ongoing pandemic </li><li>Molnupiravir has been found to be the 'wonder drug' in the treatment of COVID-19 </l… [+2583 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "Avoid these foods for a healthy heart - NewsBytes", "description": "If you want to maintain the health of your heart and cardiovascular system, then start now and make a few diet changes to live healthy and long", "url": "https://www.newsbytesapp.com/news/lifestyle/foods-to-avoid-for-a-healthy-heart/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l71320220505152546.jpeg", "publishedAt": "2022-05-05T09:57:16Z", "content": "Avoid these foods for a healthy heart\r\nExpert opinion byDr Akanksha Saxena\r\nMay 05, 2022, 03:27 pm3 min read\r\nIf you want to maintain the health of your heart and cardiovascular system, then start no… [+2781 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Your child has the right to B12, do not ignore it - Ahmedabad Mirror", "description": "#LONDON\nVitamin B12 deficiency in infants leads to poor motor development and anaemia, according to a study which stated that its deficiency is an enormous yet overlooked problem.\nFor many years, there has been a focus on vitamin A, zinc and iron deficiencies…", "url": "https://www.ahmedabadmirror.com/your-child-has-the-right-to-b12-do-not-ignore-it/81830760.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1651687620346.jpg-org", "publishedAt": "2022-05-05T08:39:25Z", "content": "#LONDONVitamin B12 deficiency in infants leads to poor motor development and anaemia, according to a study which stated that its deficiency is an enormous yet overlooked problem.For many years, there… [+2476 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Copenhagen: Thousands of intestinal viruses have now been mapped. And they can be used to fight antibiotic resistance - India Education Diary", "description": "A new method developed at the University of Copenhagen has been used to identify more than 1,000 different types of bactericidal viruses in the human intestines. The researchers behind the new study believe the discovery may help fight antibiotic res", "url": "https://indiaeducationdiary.in/university-of-copenhagen-thousands-of-intestinal-viruses-have-now-been-mapped-and-they-can-be-used-to-fight-antibiotic-resistance/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-13-1.png", "publishedAt": "2022-05-05T07:50:31Z", "content": "A new method developed at the University of Copenhagen has been used to identify more than 1,000 different types of bactericidal viruses in the human intestines. The researchers behind the new study … [+4505 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research reveals how MRI could revolutionize the diagnosis of heart failure - ANI News", "description": "Norwich [UK], May 5 (ANI): According to a new study from the University of East Anglia and the University of Sheffield, magnetic resonance imaging (MRI) is superior to echocardiography in diagnosing heart failure and is a powerful tool for predicting patient …", "url": "https://www.aninews.in/news/science/research-reveals-how-mri-could-revolutionize-the-diagnosis-of-heart-failure20220505130026", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/TGETGRE2022050506585720220505073016.jpg", "publishedAt": "2022-05-05T07:32:35Z", "content": "Norwich [UK], May 5 (ANI): According to a new study from the University of East Anglia and the University of Sheffield, magnetic resonance imaging (MRI) is superior to echocardiography in diagnosing … [+2647 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Brand Studio", "title": "Is your child flu-safe this summer? - Hindustan Times", "description": "The latest session of HT Spotlight titled ‘VaxTalk: Getting your child summer ready’ saw Dr Pramod Jog, Former President of the Indian Academy of Pediatrics and Professor of Pediatrics at the DY Patil Medical College, Pune, talk about how we can safeguard our…", "url": "https://www.hindustantimes.com/brand-stories/is-your-child-flu-safe-this-summer-101651735000289.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/05/1600x900/WhatsApp_Image_2022-05-05_at_1.25.14_PM_1651737400239_1651737417666.jpeg", "publishedAt": "2022-05-05T07:20:14Z", "content": "After two long years of school closures, children are finally back to their routines. But, with this, the instances of infections and illnesses have also seen a spike. Naturally, parents are worried … [+4819 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mental illness interferes with the body’s blood pressure and heart rate, study shows - News-Medical.Net", "description": "University of South Australia scientists have uncovered another reason why society should be paying more attention to mental health: it is closely aligned to blood pressure and heart rate variations.", "url": "https://www.news-medical.net/news/20220505/Mental-illness-interferes-with-the-bodye28099s-blood-pressure-and-heart-rate-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_712767_16517307474869119.jpg", "publishedAt": "2022-05-05T06:07:00Z", "content": "University of South Australia scientists have uncovered another reason why society should be paying more attention to mental health: it is closely aligned to blood pressure and heart rate variations.… [+2900 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Covid aggravates asthma in children - The Tribune India", "description": "Asthma in children is likely to get worse after a Covid-19 infection, finds a large-scale nationwide study in the US. Six months after a Covid infection, asthmatic children showed significant increases in emergency department visits, hospitalisations, emergen…", "url": "https://www.tribuneindia.com/news/schools/covid-aggravates-asthma-in-children-392033", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/5/2022_5$largeimg_1652811995.jpg", "publishedAt": "2022-05-05T06:07:00Z", "content": "New York, May 4\r\nAsthma in children is likely to get worse after a Covid-19 infection, finds a large-scale nationwide study in the US. Six months after a Covid infection, asthmatic children showed si… [+862 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Prevalence and In-hospital outcomes of diabetes among acute ischemic stroke patients in china: results from the Chinese Stroke Center Alliance - DocWire News", "description": "J Neurol. 2022 May 5. doi: 10.1007/s00415-022-11112-z. Online ahead of print.ABSTRACTBACKGROUND: Patients with ischemic stroke and diabetes are classified", "url": "https://www.docwirenews.com/abstracts/prevalence-and-in-hospital-outcomes-of-diabetes-among-acute-ischemic-stroke-patients-in-china-results-from-the-chinese-stroke-center-alliance/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-05-05T06:00:00Z", "content": "J Neurol. 2022 May 5. doi: 10.1007/s00415-022-11112-z. Online ahead of print.\r\nABSTRACT\r\nBACKGROUND: Patients with ischemic stroke and diabetes are classified as extreme risk for secondary prevention… [+1830 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Business News | IDEA CLINICS to Expand to 20 Cities by the End of 2025 - LatestLY", "description": "Get latest articles and stories on Business at LatestLY. IDEA CLINICS (Institute Of Diabetes, Endocrinology &amp; Adiposity Pvt Ltd), healthcare outside hospital is home to India's largest group of Endocrinologists, aims to expand to 20 cities with a strength…", "url": "https://www.latestly.com/agency-news/business-news-idea-clinics-to-expand-to-20-cities-by-the-end-of-2025-3670889.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/05/image_502022050505033020220505053624-588x441.jpg", "publishedAt": "2022-05-05T05:48:24Z", "content": "New Delhi [India], May 5 (ANI/PNN): IDEA CLINICS (Institute Of Diabetes, Endocrinology &amp; Adiposity Pvt Ltd), healthcare outside hospital is home to India's largest group of Endocrinologists, aims… [+6220 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Surprising risk factors may predict heart attacks in young women - EurekAlert", "description": "A new Yale-led study has for the first time identified which risk factors are more likely to trigger a heart attack or acute myocardial infarction (AMI) for men and women 55 years and younger.", "url": "https://www.eurekalert.org/news-releases/951702", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-05-05T02:04:03Z", "content": "New Haven, Conn. — A new Yale-led study has for the first time identified which risk factors are more likely to trigger a heart attack or acute myocardial infarction (AMI) for men and women 55 years … [+7485 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "'Brain-age' biomarkers predict stroke recover - EurekAlert", "description": "Stroke experts have identified how radiomics, an emerging image-quantifying technology, can be used to extract biomarkers from clinical brain MRI scans in stroke patients and estimate a patient’s relative ‘brain age’.", "url": "https://www.eurekalert.org/news-releases/950848", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-05-04T23:31:45Z", "content": "(5 May 2022, Lyon, France) Stroke experts have identified how radiomics, an emerging image-quantifying technology, can be used to extract biomarkers from clinical brain MRI scans in stroke patients a… [+5868 chars]"}, {"source": {"id": null, "name": "nejm.org"}, "author": null, "title": "Does the World Still Need New Covid-19 Vaccines? | NEJM - nejm.org", "description": "Editorial from The New England Journal of Medicine — Does the World Still Need New Covid-19 Vaccines?", "url": "https://www.nejm.org/doi/full/10.1056/NEJMe2204695", "urlToImage": "https://www.nejm.org/templates/jsp/_mms/image/NEJM_defaultlogo_200px.png", "publishedAt": "2022-05-04T21:01:53Z", "content": "Although there was a global shortage of Covid-19 vaccines in 2021, by mid 2022, the vaccine supply will no longer be a limiting factor in efforts to provide more equitable coverage. As of April 19, 2… [+7453 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Children with different diets have similar growth, nutrition but weight can be impacted | FOX 7 Aust - FOX 7 Austin", "description": "A new study finds children who follow a vegetarian or vegan diet have similar growth and nutrition as children who eat meat but it can have an impact on thei...", "url": "https://www.youtube.com/watch?v=lHdu5kZgJpk", "urlToImage": "https://i.ytimg.com/vi/lHdu5kZgJpk/hqdefault.jpg", "publishedAt": "2022-05-04T18:56:50Z", "content": null}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "We've pinpointed blood proteins activated in the most severe cases of COVID in children - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Melbourne, May 4: In the majority of cases, children who catch COVID won’t end up suffering serious illness. Kids have fewer symptoms, less severe disease, and tend to recover faster than adults. The best case scenario for children sees them having relatively…", "url": "https://www.dailyexcelsior.com/weve-pinpointed-blood-proteins-activated-in-the-most-severe-cases-of-covid-in-children/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/05/download-3-4.jpg", "publishedAt": "2022-05-04T18:31:43Z", "content": "Melbourne, May 4: In the majority of cases, children who catch COVID won’t end up suffering serious illness. Kids have fewer symptoms, less severe disease, and tend to recover faster than adults.The … [+3836 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Acute sleep loss can alter how we see others: Research - ANI News", "description": "Washington [US], May 4 (ANI): Young adults when sleep-deprived evaluate angry faces as less trustworthy and healthy-looking. Furthermore, neutral and fearful faces appear less attractive following sleep loss, suggests the findings of a new study from Uppsala …", "url": "https://www.aninews.in/news/science/acute-sleep-loss-can-alter-how-we-see-others-research20220504234935", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/sleeplossaug2420220504175753.jpg", "publishedAt": "2022-05-04T18:22:39Z", "content": "Washington [US], May 4 (ANI): Young adults when sleep-deprived evaluate angry faces as less trustworthy and healthy-looking. Furthermore, neutral and fearful faces appear less attractive following sl… [+1719 chars]"}]}