{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Covid might have longer impacts on your brain: Study - WION", "description": "Scientists recently discovered that SARS-CoV-2 virus-infected people show signs of severe brain injury and inflammation, including a reduction in oxygen and blood flow into the brain, neuron damage and even small areas of haemorrhage.", "url": "https://www.wionews.com/science/covid-might-have-longer-impacts-on-your-brain-study-468522", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/04/05/252514-braaiinn.jpg, this study as well as the ones in future that focus on how SARS-CoV-2 impacts the human brain will help in better understanding and treatment of patients suffering from neurological effects of COVID-19 and long Covid.\" typeof=\"foaf:Image\" />", "publishedAt": "2022-04-05T11:45:17Z", "content": "Scientists recently discovered that SARS-CoV-2 virus-infected people show signs of severe brain injury and inflammation, including a reduction in oxygen and blood flow into the brain, neuron damage a… [+2038 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Childhood trauma may be linked to multiple sclerosis risk among women: Study - ThePrint", "description": "London [UK], April 5 (ANI): According to a recent study, childhood trauma may be linked to a heightened risk of multiple sclerosis (MS) in later life among women. The findings of the study were published in the ‘Journal of Neurology Neurosurgery & Psychiatry’…", "url": "https://theprint.in/features/childhood-trauma-may-be-linked-to-multiple-sclerosis-risk-among-women-study/903569/", "urlToImage": null, "publishedAt": "2022-04-05T11:30:29Z", "content": "London [UK], April 5 (ANI): According to a recent study, childhood trauma may be linked to a heightened risk of multiple sclerosis (MS) in later life among women.\r\nThe findings of the study were publ… [+3285 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "To Have A Better Relationship With Food, Develop These Habits And Start Following Them On A Daily Basis - NDTV Doctor", "description": "Here are 10 healthy habits to ensure that you feel in control around food", "url": "https://doctor.ndtv.com/living-healthy/here-are-the-10-habits-to-make-you-feel-in-control-around-food-2834088", "urlToImage": "https://c.ndtvimg.com/2022-02/coc0jm18_weight-loss-diet-vs-exercise-_625x300_21_February_22.jpg", "publishedAt": "2022-04-05T11:02:18Z", "content": "Your nutrition has a big impact on how healthy you are on the inside. However, many of us make mistakes when it comes to food. Either we end up binge-eating on a regular basis, or don't prioritise fo… [+2704 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": "Dr. H. Drexel Dobson III, Florida Today", "title": "Dr. Dobson: If found early, colorectal cancer is treatable and survivable - Florida Today", "description": "In 2021, the Centers for Disease Control and Prevention (CDC) lowered its recommended age for colorectal screenings from 50 to 45", "url": "https://www.floridatoday.com/story/life/wellness/2022/04/05/cdc-moved-age-colorectal-cancer-screening-50-45/7249832001/", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2021/11/05/USATODAY/usatsports/247WallSt.com-247WS-985541-imageForEntry6-Zyd.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2022-04-05T10:57:59Z", "content": "Despite being one of the most preventable forms of cancer, colorectal cancer continues to be the third-leading cause of cancer-related deaths, claiming the lives of more than 50,000 Americans each ye… [+3564 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Other than COVID, bats host a number of other virulent zoonotic (animals-to-humans) viruses too - Times of India", "description": "The novel coronavirus which caused the COVID-19 infection was the first of its kind zoonotic virus when it was detected. The virus is said to have been transmitted to human beings from bats. It was first detected in the Wuhan region of China in late 2019. Eve…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-other-than-covid-bats-host-a-number-of-other-virulent-zoonotic-animals-to-humans-viruses-too/photostory/90661176.cms", "urlToImage": "https://static.toiimg.com/photo/90661313.cms", "publishedAt": "2022-04-05T10:30:00Z", "content": "Bats act as a natural reservoir for many viruses, including coronaviruses. As per WHO, bat borne viruses have induced epidemics since 2002.\r\nOne of the main reasons why bats can harbor a number of vi… [+1225 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Long-lasting care for HIV, soon - Ahmedabad Mirror", "description": "#NEWYORK\nUS scientists are using new advances in CRISPR gene-editing technology to uncover new biology that could lead to long-lasting treatments and new therapeutic strategies for Human Immunodeficiency Virus (HIV).\nThe HIV epidemic has been overlooked durin…", "url": "https://www.ahmedabadmirror.com/long-lasting-care-for-hiv-soon/81827395.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1649099685371.jpg-org", "publishedAt": "2022-04-05T10:26:53Z", "content": "<ul><li>Ahmedabad Mirror</li><li> 05-04-2022 03:45 PM</li></ul>\r\nCRISPR gene-editing tech to build new therapeutic strategies for treatment\r\n#NEWYORKUS scientists are using new advances in CRISPR gen… [+861 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Vegan diet can ease arthritis pain, finds study - Rising Kashmir", "description": "A new study has found that a low-fat vegan diet, without calorie restrictions, improves joint pain in patients with rheumatoid arthritis. The participants of the study have also experienced weight loss and improved cholesterol levels.", "url": "https://www.risingkashmir.com/displaynews.aspx?news=103954", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637847252942336738_pexels_photo_567779320220405035413202204050414391649138846_1200.jpg", "publishedAt": "2022-04-05T10:17:20Z", "content": null}, {"source": {"id": null, "name": "Oneindia.com"}, "author": "Simran Kashyap", "title": "Covid new symptoms: Watch out for 9 new coronavirus signs recognised by the NHS - Oneindia", "description": "The official list of Covid-19 symptoms list has been expanded days after officials ended free universal testing in England. The new symptoms include sore throat, diarrhoea, lethargy, and headache.", "url": "https://www.oneindia.com/india/covid-new-symptoms-watch-out-for-9-new-coronavirus-signs-recognised-by-the-nhs-3392090.html", "urlToImage": "https://www.oneindia.com/img/1200x80/2021/08/coronavirus71-1628150195.jpg", "publishedAt": "2022-04-05T10:07:37Z", "content": "London, Apr 05: The official list of Covid-19 symptoms list has been expanded days after officials ended free universal testing in England. The new symptoms include sore throat, diarrhoea, lethargy, … [+1114 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Aggressive warming during surgery does not reduce major complications: Study - Times of India", "description": "Patients kept at a body temperature of 37 C during major surgery had no fewer cardiac complications than patients kept at 35.5 C, according to the American College of Cardiology's researchers.This study was simultaneously published in the journal The Lancet. …", "url": "https://timesofindia.indiatimes.com/videos/news/aggressive-warming-during-surgery-does-not-reduce-major-complications-study/videoshow/90662516.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90662516,imgsize-60506.cms", "publishedAt": "2022-04-05T10:00:35Z", "content": "Apr 05, 2022, 03:30PM ISTSource: ANIPatients kept at a body temperature of 37 C during major surgery had no fewer cardiac complications than patients kept at 35.5 C, according to the American College… [+823 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Doctor explains differences between Dengue, Influenza and Covid-19 - Play Crazy Game", "description": "04/04/2022 19:27 • Updated 04/04/2022 18:40 in Piauí the Dengue cases have increased by 200% in the first two months of 2022 alonecompared to the same period of 2020 and 2021. According to the State Health Department (Sesapi), more than 700 cases this year an…", "url": "https://playcrazygame.com/2022/04/05/doctor-explains-differences-between-dengue-influenza-and-covid-19/", "urlToImage": "https://static.meionorte.com/uploads/imagens/2022/4/4/cresce-numero-de-casos-de-dengue-no-piaui-medico-faz-alerta-e1a95019-a270-4e67-a3e2-b7c9994f30ab.jpg", "publishedAt": "2022-04-05T09:25:57Z", "content": "in Piauí the Dengue cases have increased by 200% in the first two months of 2022 alonecompared to the same period of 2020 and 2021. According to the State Health Department (Sesapi), more than 700 ca… [+2057 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "How Covid-19 can cause long-term pain found - Hindustan Times", "description": "Scientists have found important insights into how SARS-CoV-2, the virus that causes COVID-19, can lead to long-term pain, an advance that could lead to a potential therapy for the disorder. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-covid-19-can-cause-long-term-pain-found-101649147392193.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/05/1600x900/fac3cce2-b28c-11ec-8afe-66f763ad16e7_1648908068499_1649147438846.jpg", "publishedAt": "2022-04-05T08:35:09Z", "content": "Scientists have found important insights into how SARS-CoV-2, the virus that causes COVID-19, can lead to long-term pain, an advance that could lead to a potential therapy for the disorder. (Also rea… [+3531 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Healthy Adults Deliberately Infected by Coronavirus in First Human COVID Challenge Model; Results Reveal How Virus Works | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "For this study, 36 volunteers aged 18-29 years without evidence of previous infection or vaccination were intranasally inoculated with tiny amounts of wild-type coronavirus. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-04-05-first-human-covid-challenge-healthy-adults-deliberately-infected", "urlToImage": "https://s.w-x.co/in-coronavirus_44.jpg", "publishedAt": "2022-04-05T07:25:11Z", "content": "A team of scientists at the Imperial College London deliberately infected more than three dozen healthy adults with SARS-CoV-2, the virus that causes COVID-19, to see how the infection works in the h… [+3504 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Shruti Wilson", "title": "Increased risk of Nipah virus, know how it spreads - symptoms and treatment - News Track English", "description": "New viruses are knocking in the midst of the Coronavirus Pandemic. Now these days Nipah virus is coming to the fore, which is being said that it can pose a big threat. In fact, scientists of the National Institute of Virology, Pune, have given instructions re…", "url": "https://english.newstracklive.com/news/increased-risk-of-nipah-virus-know-how-it-spreads--symptoms-and-treatment-ta303-1221193-1.html", "urlToImage": "https://media.newstrack.in/uploads/health-lifestyle/lifestyle-hacks/Apr/05/big_thumb/NIPAH_624bcc55a1bfc.JPG", "publishedAt": "2022-04-05T06:54:05Z", "content": "New viruses are knocking in the midst of the Coronavirus Pandemic. Now these days Nipah virus is coming to the fore, which is being said that it can pose a big threat. In fact, scientists of the Nati… [+2022 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Trying to cut back on alcohol? Here’s what works - The Indian Express", "description": "Most people successfully quit or cut back their alcohol consumption on their own. People who drink more frequently are much more likely to have symptoms of dependence and might find it more difficult.", "url": "https://indianexpress.com/article/lifestyle/health/trying-to-cut-back-on-alcohol-know-what-works-apps-online-support-medication-7842806/", "urlToImage": "https://images.indianexpress.com/2022/04/alcohol_ts_1200.jpg", "publishedAt": "2022-04-05T06:30:04Z", "content": "With everything going on over the past couple of years, many people have changed their drinking habits. We’ve seen an increased demand for support, suggesting more people are trying to cut back or qu… [+7860 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "Degeneration of neurons makes Alzheimers patients drowsy: Study - Business Standard", "description": "According to a recent study, the drowsiness that many Alzheimer's patients experience are caused not by a lack of sleep, but rather by the degeneration of a type of neuron that keeps us awake", "url": "https://www.business-standard.com/article/current-affairs/degeneration-of-neurons-makes-alzheimer-s-patients-drowsy-study-122040500176_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2019-04/13/full/1555174229-4902.jpg", "publishedAt": "2022-04-05T03:53:00Z", "content": "According to a recent study, the drowsiness that many Alzheimer's patients experience are caused not by a lack of sleep, but rather by the degeneration of a type of neuron that keeps us awake. It als… [+4827 chars]"}, {"source": {"id": null, "name": "News18"}, "author": null, "title": "Time to Plug the Legal Loopholes and Nail Tobacco to Save Our Youth From Cancer - News18", "description": "In India, tobacco-related cancers contribute nearly half of the total cancers in males and one-fifth in females. Still, due to some loopholes in the legal provisions, the tobacco industry is successful at attracting people towards this deadly product.", "url": "https://www.news18.com/news/opinion/time-to-plug-the-legal-loopholes-and-nail-tobacco-to-save-our-youth-from-cancer-4942400.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/no-smoking-164672588116x9.jpg", "publishedAt": "2022-04-05T03:16:12Z", "content": "Twenty years ago, who would have thought that people would stop smoking in most public places and offices! If an ashtray in any office was a common sight, smoking motivated by Bollywood scenes was co… [+4968 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Virologist Angela Rasmussen explains how viruses and vaccines differ - CBCSaskatchewan", "description": "As COVID-19 continues to change scientists are looking at how to adapt the vaccinations created early in the pandemic to determine if booster shots will be r...", "url": "https://www.youtube.com/watch?v=LOYne-w6QQU", "urlToImage": "https://i.ytimg.com/vi/LOYne-w6QQU/maxresdefault.jpg", "publishedAt": "2022-04-05T01:30:03Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Levels of anti-Mullerian hormone may help predict bone loss during menopause transition - News-Medical.Net", "description": "Physicians may be able to determine if menopause-related bone loss is already in progress or about to begin by measuring the level of a hormone that declines as women approach their final menstrual period, new UCLA research finds.", "url": "https://www.news-medical.net/news/20220404/Levels-of-anti-Mullerian-hormone-may-help-predict-bone-loss-during-menopause-transition.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hormone-620x480.jpg", "publishedAt": "2022-04-05T00:40:00Z", "content": "Physicians may be able to determine if menopause-related bone loss is already in progress or about to begin by measuring the level of a hormone that declines as women approach their final menstrual p… [+3752 chars]"}, {"source": {"id": null, "name": "Iowa State Daily"}, "author": "Paige Mountain, paige.mountain@iowastatedaily.com, and Andre Namink, andre.namink@iowastatedaily.com", "title": "Tips from a doctor on protecting your eye health - Iowa State Daily", "description": "Although often overshadowed by other areas of physical health, eye health is extremely important when it comes to overall well-being. Being aware of the factors that affect eye health is", "url": "https://www.iowastatedaily.com/lifestyle/tips-from-a-doctor-on-protecting-your-eye-health-blue-light-uv-rays-contacts-drugs-diabetes-eyes-20-20-optometrist/article_5892ad94-b458-11ec-af70-e322817f3137.html", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/iowastatedaily.com/content/tncms/assets/v3/editorial/4/da/4dad0cca-b459-11ec-93a8-43294e49e834/624b5b0451438.image.jpg?crop=1175%2C617%2C0%2C573&resize=1175%2C617&order=crop%2Cresize", "publishedAt": "2022-04-04T20:46:00Z", "content": "Although often overshadowed by other areas of physical health, eye health is extremely important when it comes to overall well-being. Being aware of the factors that affect eye health is an important… [+7589 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Adesola Mojo", "title": "COVID infection: Questions remain on preventing transmission - Verve Times", "description": "After more than two years of COVID-19 and millions of cases, the question of why some people get infected and others do not remains somewhat of a mystery.\tWhile multiple factors will determine whether a person gets sick, preventing", "url": "https://vervetimes.com/covid-infection-questions-remain-on-preventing-transmission/", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5847703.1649100434!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-04-04T19:56:20Z", "content": "After more than two years of COVID-19 and millions of cases, the question of why some people get infected and others do not remains somewhat of a mystery.\r\nWhile multiple factors will determine wheth… [+8825 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "My five-year-old is now eligible for a COVID vaccine – should I get them immunised? - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Leeds, Apr 4: Since 2020, we’ve heard that COVID is mainly a problem for the elderly or vulnerable. Vaccines have dramatically improved their protection against the disease, but children and younger people – because it’s perceived that COVID poses little risk…", "url": "https://www.dailyexcelsior.com/my-five-year-old-is-now-eligible-for-a-covid-vaccine-should-i-get-them-immunised/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/04/3-8.jpg", "publishedAt": "2022-04-04T19:29:58Z", "content": "Leeds, Apr 4: Since 2020, we’ve heard that COVID is mainly a problem for the elderly or vulnerable. Vaccines have dramatically improved their protection against the disease, but children and younger … [+4777 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "https://www.facebook.com/WebMD", "title": "COVID-19 Cases Remain Low, Stomach Flu Outbreaks Rise - WebMD", "description": "Outbreaks of the norovirus, which causes stomach flu, have increased dramatically since the beginning of January.", "url": "https://www.webmd.com/cold-and-flu/news/20220404/covid-19-cases-remain-low-stomach-flu-outbreaks-rise", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/slideshows/all_about_norovirus_slideshow/1800x1200_all_about_norovirus_slideshow.jpg", "publishedAt": "2022-04-04T19:26:14Z", "content": "April 4, 2022 While coronavirus cases continue to decline across the U.S., another virus is climbing to its pre-pandemic levels, according to NBC News.\r\nOutbreaks of the norovirus, which causes stoma… [+2219 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jake Ellison", "title": "Researchers find patterns of handgun carrying among youth in rural areas, building foundation for injury prevention - Phys.org", "description": "The first results of research led by the University of Washington into handgun carrying by young people growing up in rural areas has found six distinct patterns for when and how often these individuals carry a handgun.", "url": "https://phys.org/news/2022-04-patterns-handgun-youth-rural-areas.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/researchers-find-patte.jpg", "publishedAt": "2022-04-04T19:22:53Z", "content": "The first results of research led by the University of Washington into handgun carrying by young people growing up in rural areas has found six distinct patterns for when and how often these individu… [+6288 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Increased risk of dementia in patients hospitalized for acute kidney injury - EurekAlert", "description": "This study, published in the American Journal of Kidney Diseases (AJKD), demonstrates that there is an increased risk of dementia in patients with AKI-related hospitalizations and may suggest that patients recovering from AKI constitute a high-risk population…", "url": "https://www.eurekalert.org/news-releases/948281", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-04T19:18:08Z", "content": "Acute kidney injury (AKI) causes biochemical changes in the brain in animal models and is associated with adverse neurological complications in hospitalized patients. While there is no known cure, ea… [+1359 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Shaye Glisson", "title": "15 Most Deceptive Food Label Terms That Are Fooling You — Eat This Not That - Eat This, Not That", "description": "Deceptive food labels are prevalent in supermarkets, so we've rounded up and demystified the most commonly misunderstood ones.", "url": "http://www.eatthis.com/news-most-deceptive-food-label-terms-that-are-fooling-you/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/04/woman-reading-nutrition-label.jpg?quality=82&strip=all", "publishedAt": "2022-04-04T17:51:52Z", "content": "The inner aisles of supermarkets are chock-full of foods that claim to make you healthier. Brightly colored food labels proclaim \"sugar-free,\" \"low-calorie,\" and \"natural,\" waiting in hopes you'll sn… [+8106 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Freshwater mussels can inhibit bacterial diseases, finds study - ANI News", "description": "Helsinki [Finland], April 4 (ANI): Researchers from the University of Jyvaskyla found brown trout better survived a Flavobacterium disease outbreak if the fish had larvae of freshwater pearl mussel in their gills.", "url": "https://www.aninews.in/news/science/freshwater-mussels-can-inhibit-bacterial-diseases-finds-study20220404230116", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/55555555555555rtmsnmfsdf2022040417261420220404173105-thumbnail-154x87-70.jpg", "publishedAt": "2022-04-04T17:34:47Z", "content": "Helsinki [Finland], April 4 (ANI): Researchers from the University of Jyvaskyla found brown trout better survived a Flavobacterium disease outbreak if the fish had larvae of freshwater pearl mussel i… [+2096 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Timothy P Hanna", "title": "Cancer treatment and diagnosis backlogs during COVID-19 may affect cancer survival - The Conversation Canada", "description": "In future health emergencies and possibly further waves of the COVID-19 pandemic, caution needs to be taken when extending cancer waiting times for reasons unrelated to patients’ health-care needs.", "url": "https://theconversation.com/cancer-treatment-and-diagnosis-backlogs-during-covid-19-may-affect-cancer-survival-179294", "urlToImage": "https://images.theconversation.com/files/455748/original/file-20220401-18-26ixs9.jpg?ixlib=rb-1.1.0&rect=284%2C189%2C5466%2C2733&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-04-04T17:33:40Z", "content": "Unlike the COVID-19 pandemic, the cancer pandemic has raged on for centuries, though it similarly afflicts people in all corners of the world. In 2020 alone, over 19 million people were diagnosed wit… [+5962 chars]"}, {"source": {"id": null, "name": "Aarp.org"}, "author": "Michelle Crouch", "title": "10 Sneaky Signs of Diabetes - AARP", "description": "​​Lesser-known symptoms like skin tags, sexual dysfunction and mood swings could signal that you have diabetes and it’s time to talk to your doctor.​​", "url": "https://www.aarp.org/health/conditions-treatments/info-2022/sneaky-diabetes-symptoms.html", "urlToImage": "https://cdn.aarp.net/content/dam/aarp/health/conditions_treatments/2022/04/1140-sneaky-diabetes-symptoms.imgcache.rev1b119d1fcaffd08b837a928c60d07b3b.jpg", "publishedAt": "2022-04-04T17:04:40Z", "content": "Tom Werner / Getty Images\r\nMany Americans are familiar with the hallmark symptoms of type 2 diabetes, such as increased thirst and frequent urination. But doctors say there are several lesser-known s… [+4327 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "Half of all older adults now die while dealing with dementia, study reveals - Study Finds", "description": "The new report reveals over 47 percent of seniors die while dealing with some form of the memory-robbing disease.", "url": "https://www.studyfinds.org/older-adults-die-dementia/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2022/04/steven-hwg-zBsdRTHIIm4-unsplash.jpg", "publishedAt": "2022-04-04T17:03:01Z", "content": "ANN ARBOR, Mich. — The number of people living with dementia may be higher than anyone thinks, according to a new study. Researchers from the University of Michigan have discovered that nearly half o… [+2942 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "James Kingsland", "title": "Long COVID symptoms may depend on the variant - Medical News Today", "description": "A new study suggests that variants of SARS-CoV-2 are more likely to cause different long COVID symptoms, especially those related to cognitive function and sense of smell.", "url": "https://www.medicalnewstoday.com/articles/different-sars-cov-2-variants-may-cause-different-long-covid-symptoms", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/04/shadows-mask-long-covid-facebook-1200x628.jpg", "publishedAt": "2022-04-04T16:02:52Z", "content": "<ul><li>More than half of all people who recover from COVID-19 continue to experience lingering symptoms known as long COVID 6 months later.</li><li>A new observational study suggests that, compared … [+5646 chars]"}, {"source": {"id": null, "name": "The European Scientist"}, "author": "Alex Reis", "title": "Monitoring patients to prevent further strokes - The European Scientist", "description": "Almost 1/3 of patients with a stroke with unknown cause have heart problems that should be treated to prevent further strokes but can be challenging to diagnose, according to results presented at the European Heart Rhythm Association Conference (EHRA 2022), a…", "url": "https://www.europeanscientist.com/en/research/monitoring-patients-to-prevent-further-strokes/", "urlToImage": "https://i0.wp.com/www.europeanscientist.com/wp-content/uploads/2022/04/AF9A9122-35BD-4439-9AE4-681250C7C748.jpeg?fit=960%2C710&ssl=1", "publishedAt": "2022-04-04T15:44:07Z", "content": "Almost 1/3 of patients with a stroke with unknown cause have heart problems that should be treated to prevent further strokes but can be challenging to diagnose, according to results presented at the… [+2240 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "This common spice may help defeat the most aggressive form of breast cancer - Study Finds", "description": "In experiments with human cells, cardamonin targeted a specific gene which helps cancer avoid the immune system.", "url": "https://www.studyfinds.org/common-spice-breast-cancer/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2022/04/karyna-panchenko-bF404j83DH0-unsplash.jpg", "publishedAt": "2022-04-04T14:57:11Z", "content": "PHILADELPHIA, Pa. — Cardamom is a spice used in different cuisines throughout the world. Now, a new study finds a substance in this common cooking ingredient may also help defeat one of the most aggr… [+2567 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Pharmacological knowledge regarding Pfizer-BioNTech Vaccine | CPAA - Dove Medical Press", "description": "Evaluating pharmacists’ pharmacological knowledge and views regarding Pfizer-BioNTech COVID-19 Vaccine in Saudi Arabia", "url": "https://www.dovepress.com/evaluating-pharmacists-pharmacological-knowledge-and-views-regarding-p-peer-reviewed-fulltext-article-CPAA", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-04-04T14:32:03Z", "content": "Introduction\r\nSevere acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infection and the resulting disease, coronavirus disease 2019 (COVID-19) has impacted over 180 million people worldwide in J… [+22691 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Mobile app reduces post-traumatic stress - Medical Xpress", "description": "Support offered by a phone app can relieve post-traumatic stress and depression. A new study from Uppsala University's National Centre for Disaster Psychiatry involving 179 patients shows that a dedicated PTSD app, PTSD Coach, helps adults suffering from ment…", "url": "https://medicalxpress.com/news/2022-04-mobile-app-post-traumatic-stress.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/mobile-app-reduces-pos.jpg", "publishedAt": "2022-04-04T14:03:23Z", "content": "Support offered by a phone app can relieve post-traumatic stress and depression. A new study from Uppsala University's National Centre for Disaster Psychiatry involving 179 patients shows that a dedi… [+3265 chars]"}, {"source": {"id": null, "name": "Thefreshtoast.com"}, "author": null, "title": "Doing This At Any Level Increases Your Risk Of Heart Disease, Finds Study - LA Weekly", "description": "Bad news casual drinkers. A new study found no connection between heart health and moderate consumption of alcohol.", "url": "https://thefreshtoast.com/news/doing-this-at-any-level-increases-your-risk-of-heart-disease-finds-study/", "urlToImage": "https://www.laweekly.com/wp-content/uploads/2022/04/doing-this-at-any-level-increases-your-risk-of-heart-disease-e1648852253654.jpg", "publishedAt": "2022-04-04T13:30:48Z", "content": "In partnership with The Fresh Toast\r\nOver the years, alcohol consumption has been linked with a variety of behaviors. While consuming it in large amounts has mostly resulted in negative outcomes, con… [+1730 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Major bleeding reduced in patients having non-cardiac surgery - Medical Xpress", "description": "A large, international study found a drug that helps the blood to clot reduced life-threatening, major and critical organ bleeding in patients undergoing non-cardiac surgery—without increasing major vascular complications.", "url": "https://medicalxpress.com/news/2022-04-major-patients-non-cardiac-surgery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/major-bleeding-reduced.jpg", "publishedAt": "2022-04-04T13:10:49Z", "content": "A large, international study found a drug that helps the blood to clot reduced life-threatening, major and critical organ bleeding in patients undergoing non-cardiac surgerywithout increasing major v… [+2792 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Symptomatic diabetic autonomic neuropathy common in adults with type 1 diabetes - Healio", "description": "About one in five adults with type 1 diabetes reports having symptomatic diabetic autonomic neuropathy, according to study findings published in the Journal of Diabetes and Its Complications. In findings from participants in the T1D Exchange clinic registry, …", "url": "https://www.healio.com/news/endocrinology/20220401/symptomatic-diabetic-autonomic-neuropathy-common-in-adults-with-type-1-diabetes", "urlToImage": "https://www.healio.com/~/media/slack-news/endocrinology/infographics/et0322mizokamistout_mm_graphic_01_web.jpg", "publishedAt": "2022-04-04T12:35:23Z", "content": "About one in five adults with type 1 diabetes reports having symptomatic diabetic autonomic neuropathy, according to study findings published in the Journal of Diabetes and Its Complications. \r\nIn fi… [+4042 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Health Day: From diabetes to cancer, here's how your eyes are a window to health - Hindustan Times", "description": "World Health Day 2022: Eyes aren't just the window to your soul — they also offer a glimpse into your overall health as they are the first indicator of whether you’re suffering from diabetes, hypertension, hyperlipidaemia, immunological diseases and even canc…", "url": "https://www.hindustantimes.com/lifestyle/health/health-day-from-diabetes-to-cancer-here-s-how-your-eyes-are-a-window-to-health-101649074329214.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/nonsap-visuals-z65bg9SI-9I-unsplash_1649074661960_1649074681187.jpg", "publishedAt": "2022-04-04T12:26:23Z", "content": "They say, Eyes aren't just the window to your soul they also offer a glimpse into your overall health and fitness experts root for the same as our eyes are the first indicator of whether we are suffe… [+4440 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "An Analytical Study to Determine the Severity of COVID-19 Among Smokers - Cureus", "description": "Introduction\r\n\r\nIn December of the year 2020, the SARS-CoV-2 virus was discovered in Wuhan, China. It extended to over 180 nations around the world. It can manifest in patients who are asymptomatic to those who are symptomatic, with symptoms ranging from anos…", "url": "https://www.cureus.com/articles/91867-an-analytical-study-to-determine-the-severity-of-covid-19-among-smokers", "urlToImage": "https://public.cureus.com/fallback/default_article_image_0.png", "publishedAt": "2022-04-04T12:18:12Z", "content": "Introduction\r\nIn December of the year 2020, the SARS-CoV-2 virus was discovered in Wuhan, China. It extended to over 180 nations around the world. It can manifest in patients who are asymptomatic to … [+20254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Does eating avocados twice a week lower the risk of heart disease? Here’s what an expert says - The Indian Express", "description": "The study surveyed more than 68,000 women and 41,000 men, who were free of cancer, coronary heart disease and stroke at baseline, on their diets every four years, over a period of 30 years", "url": "https://indianexpress.com/article/lifestyle/health/eating-avocados-twice-a-week-lower-risk-heart-disease-health-study-7846140/", "urlToImage": "https://images.indianexpress.com/2022/03/Avocados-1200.jpg", "publishedAt": "2022-04-04T12:00:29Z", "content": "Avocadosare pear-shaped fruits that contain tons of essential vitamins like A, B, C, E, K and minerals such as copper, iron, potassium and magnesium, making them a healthy choice for consumption. In … [+2980 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "studio18", "title": "HGH For Sale: Best HGH Supplements To Buy Online (Human Growth Pills) - Firstpost", "description": "Before delving into the details of the four best HGH supplements for sale on the market it will be prudent for the readers to know about HGH.", "url": "https://www.firstpost.com/health/hgh-for-sale-best-hgh-supplements-to-buy-online-human-growth-pills-10515981.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/04/HGHForSale_640x320_img1.jpg", "publishedAt": "2022-04-04T11:26:52Z", "content": "Before delving into the details of the four best HGH supplements for sale on the market it will be prudent for the readers to know about HGH.\r\n Read this article to know the details about four top ra… [+30323 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers find cause of irregular heart rhythm in Covid patients - ETHealthWorld", "description": "The SARS-CoV-2, the virus causing Covid-19, can infect cells of the heart's natural pacemaker that maintain the rhythmic beat, setting off a self-destruction process within the cells, according to a preclinical study.", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-find-cause-of-irregular-heart-rhythm-in-covid-patients/90641908", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-90641908,imgsize-29988,width-1200,height-628,overlay-ethealthworld/researchers-find-cause-of-irregular-heart-rhythm-in-covid-patients.jpg", "publishedAt": "2022-04-04T11:15:00Z", "content": "New York, The SARS-CoV-2, the virus causing Covid-19, can infect cells of the heart's natural pacemaker that maintain the rhythmic beat, setting off a self-destruction process within the cells, accor… [+2447 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "COVID infection: Signs you have a weak immune system - Times of India", "description": "A weak immune system is like a passive invitation for germs to invade our body. The body's sole defence mechanism, the immune system, always remains alert against foreign attack. It memorises the pathogen and protects the body from future attacks. Usually thi…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/covid-infection-signs-you-have-a-weak-immune-system/photostory/90640606.cms", "urlToImage": "https://static.toiimg.com/photo/90640851.cms", "publishedAt": "2022-04-04T10:30:00Z", "content": "As per the data obtained from WHO reports, most of the people who contracted the novel coronavirus in 2020 developed antibodies 1-3 weeks after the symptoms started to show. \"Patients who have had mo… [+694 chars]"}, {"source": {"id": null, "name": "Foodingredientsfirst.com"}, "author": null, "title": "Low sodium diet boosts quality of life for heart failure patients, study finds - Food Ingredients First", "description": "04 Apr 2022 --- Lowering sodium intake in chronic heart failure patients improved swelling, tiredness, coughing, and overall quality of life. However, it did not result in fewer emergency visits, hospitalizations or deaths in heart failure patients.", "url": "https://www.foodingredientsfirst.com/news/low-sodium-diet-boosts-quality-of-life-for-heart-failure-patients-study-finds.html", "urlToImage": "https://article.innovadatabase.com/articleimgs/article_images/637846627951098925Woman-adding-salt-to-cooking-pot-on-stove-476992878_5760x3736.jpeg", "publishedAt": "2022-04-04T09:59:09Z", "content": "04 Apr 2022 --- Lowering sodium intake in chronic heart failure patients improved swelling, tiredness, coughing, and overall quality of life. However, it did not result in fewer emergency visits, hos… [+4272 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Lovneet Batra", "title": "Causes and cures for iron deficiency in Indian women - Deccan Herald", "description": "If you notice that you’re tired, fall sick more often, have frequent headaches with dizziness, and appear pale, you may have anaemia. This is a rising problem in women’s health, especially in India, where nearly 53 per cent of women between the ages of 15 and…", "url": "https://www.deccanherald.com/specials/causes-and-cures-for-iron-deficiency-in-indian-women-1097544.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/04/04/istock-515675570-1-1097544-1649066128.jpg", "publishedAt": "2022-04-04T09:55:28Z", "content": "If you notice that youre tired, fall sick more often, have frequent headaches with dizziness, and appear pale, you may have anaemia. This is a rising problem in womens health, especially in India, wh… [+3512 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid raises risk of heart problems more than vaccine: CDC - ETHealthWorld", "description": "These findings, which were for both males and females in all age groups, supported the continued use of recommended mRNA Covid-19 vaccines among all eligible persons aged over 5 years, the CDC said in its latest weekly Morbidity and Mortality Weekly Report.", "url": "https://health.economictimes.indiatimes.com/news/industry/covid-raises-risk-of-heart-problems-more-than-vaccine-cdc/90638324", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-90638324,imgsize-7648,width-1200,height-628,overlay-ethealthworld/covid-raises-risk-of-heart-problems-more-than-vaccine-cdc.jpg", "publishedAt": "2022-04-04T09:30:00Z", "content": "The risk for cardiac complications was significantly higher after Covid-19 infection than after mRNA vaccination developed by Pfizer or Moderna against the deadly infectious disease, according to an … [+880 chars]"}, {"source": {"id": null, "name": "Medical Daily"}, "author": "Athena Chan", "title": "Eating Prunes May Benefit Bone Health, Prevent Osteoporosis: Study - Medical Daily", "description": "A team of researchers conducted a study on three groups of postmenopausal women whose bone mineral density scores were considered low.", "url": "https://www.medicaldaily.com/eating-prunes-may-benefit-bone-health-prevent-osteoporosis-study-464880", "urlToImage": "https://images.medicaldaily.com/sites/medicaldaily.com/files/2019/09/12/bone.jpg", "publishedAt": "2022-04-04T09:19:11Z", "content": "Consuming prunes every day may have benefits for postmenopausal people. It may aid bone health and reduce the risks of osteoporosis.\r\nOsteoporosis is the condition\r\n wherein the bones become fragile,… [+2268 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Exercise could help reduce severity of serious cancer complication, finds study - Rising Kashmir", "description": "Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated with slower tumor growth and helped reduce the effects of a cancer complication known as was…", "url": "https://www.risingkashmir.com/displaynews.aspx?news=103893", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637846347220849273_can-aerobic-exercises-shield-me-from-covid-19-complications-722x406.tmb-0.jpg", "publishedAt": "2022-04-04T09:07:23Z", "content": "Researchers have identified yet another benefit of keeping up the exercise routine. A recent study has found that exercising prior to developing cancer was associated with slower tumor growth and hel… [+2260 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Irritable bowel syndrome: Causes, symptoms, treatment or tips to cure IBS - Hindustan Times", "description": "Irritable Bowel Syndrome is classified as a functional gastrointestinal disorder and is a chronic condition of the lower gastrointestinal tract that is a growing cause of concern among Indians today. Here's all you need to know about its causes, symptoms, tre…", "url": "https://www.hindustantimes.com/lifestyle/health/irritable-bowel-syndrome-causes-symptoms-treatment-or-tips-to-cure-ibs-101649060747644.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/anatomy-g5c89e6e36_1280_1649060975433_1649060997159.png", "publishedAt": "2022-04-04T08:46:03Z", "content": "A very common health condition in India that affects the digestive system, irritable bowel syndrome or IBS is a mix of belly discomfort or pain and trouble with bowel habits: either going more or les… [+6525 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Insect-borne viruses like Zika, dengue may trigger next pandemic: WHO - News9 LIVE", "description": "Globally, the frequency and severity of epidemics of  Zika and dengue are growing, owing to a...", "url": "https://www.news9live.com/health/insect-borne-viruses-like-zika-dengue-may-trigger-next-pandemic-who-162686", "urlToImage": "https://media.news9live.com/h-upload/2022/04/04/275182-covid.jpg", "publishedAt": "2022-04-04T07:56:34Z", "content": "According to the World Health Organization (WHO), insect-borne viruses like Zika and dengue fever could be the source of the next pandemic. Dengue, yellow fever, chikungunya, and Zika are all serious… [+2749 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Smokers have lower chance of surviving heart attack: Study - Hindustan Times", "description": "The study has also found that levels of Alpha-1 Anti Trypsin (A1AT)--a protein in the liver that protects the body's tissues--in smokers were 'significantly less' than in non-smokers. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/smokers-have-lower-chance-of-surviving-heart-attack-study-101649049713624.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/04/1600x900/no_smoking_thumb_1646751669997_1649049762546.jpg", "publishedAt": "2022-04-04T05:25:22Z", "content": "A new study led by researchers at the Jordan University of Science and Technology has found that smokers have a lower chance of surviving a heart attack than non-smokers.\r\nThe study was published in … [+1340 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Want to eat guilt free? Take a look at these light foods - Play Crazy Game", "description": "If you're on a new diet that somehow restricts the amount of food you can eat, you know it's not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don't eat enough to sustain yourself you can end up making your health w…", "url": "https://playcrazygame.com/2022/04/04/want-to-eat-guilt-free-take-a-look-at-these-light-foods/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/frango.jpg", "publishedAt": "2022-04-04T04:59:59Z", "content": "If you’re on a new diet that somehow restricts the amount of food you can eat, you know it’s not easy to stay in line. Starving yourself is not recommended on any diet, after all, if you don’t eat en… [+2347 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Addiction to Online Streaming Affects Health; Experts Advise Balance - Sentinelassam - The Sentinel Assam", "description": "Other behavioural changes include increased dependence of caffeinated drinks and sometimes...", "url": "https://www.sentinelassam.com/life/addiction-to-online-streaming-affects-health-experts-advise-balance-585915", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/04/04/332052-binge-watching.jpg", "publishedAt": "2022-04-04T04:37:35Z", "content": "Rahul (name changed), a 23-year-old Delhi-based working professional, loved the online streaming services. It gave him the ease of watching premium original content from his couch, all for a yearly p… [+5111 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How to Avoid Risk of Headaches While Following the Keto Diet? - News18", "description": "Headache is a common symptom observed by those consuming keto diets. Also known as keto headache, it becomes a constant cause of worry for the first few weeks with the dieters.", "url": "https://www.news18.com/news/lifestyle/how-to-avoid-risk-of-headaches-while-following-the-keto-diet-4936160.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/protein-day-2022-2-164587346016x9.jpg", "publishedAt": "2022-04-04T04:30:47Z", "content": "The journey of losing weight is not easy. With work from home becoming our new normal, the sedentary lifestyle has once again found its way into our lives and has made us all bit lazy. Our physical m… [+2551 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Kevin Kunzmann", "title": "Rivaroxaban Benefits LER Patients Safely Regardless of Chronic Kidney Disease - MD Magazine", "description": "VOYAGER PAD subgroup analyses showed the anticoagulant reduced likelihood of hospitalization without increasing bleeding risk in patients with CKD.", "url": "https://www.hcplive.com/view/rivaroxaban-benefits-ler-patients-safely-chronic-kidney-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/4234007874376ea88a7343def8b8918805e62ad3-620x618.png?fit=crop&auto=format", "publishedAt": "2022-04-04T03:32:29Z", "content": "A subgroup analysis from the VOYAGER PAD trial showed anticoagulant rivaroxaban (Xarelto) was associated with reduced coronary or peripheral events resulting hospitalization among patients with recen… [+2022 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": null, "title": "This virus causes more hospitalizations in children than COVID - Revyuh", "description": "For the past two years, we have all been concerned about the coronavirus and its impact on our children, but the truth is that the RSV virus causes double", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/this-virus-causes-more-hospitalizations-in-children-than-covid/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/04/This-virus-causes-more-hospitalizations-in-children-than-COVID.jpg", "publishedAt": "2022-04-03T23:00:09Z", "content": "For the past two years, we have all been concerned about the coronavirus and its impact on our children, but the truth is that the RSV virus causes double the number of hospitalizations. \r\nHere’s eve… [+4337 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "High cholesterol? 6 foods you can’t miss on your shopping list - Play Crazy Game", "description": "O cholesterol high is an evil that afflicts many people around the world. And, as much as doctors prescribe medication and patients always take the pills in the correct amount and time, there is no better way to control cholesterol than maintaining an exercis…", "url": "https://playcrazygame.com/2022/04/04/high-cholesterol-6-foods-you-cant-miss-on-your-shopping-list/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/chocolate.jpg", "publishedAt": "2022-04-03T19:52:56Z", "content": "O cholesterol high is an evil that afflicts many people around the world. And, as much as doctors prescribe medication and patients always take the pills in the correct amount and time, there is no b… [+2482 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Sue Hughes", "title": "Novel Cholesterol Drug Disappoints: TRANSLATE-TIMI 70 - Medscape", "description": "An investigational antisense oligonucleotide drug targeting a novel cholesterol pathway showed disappointing results in this phase 2b study.", "url": "https://www.medscape.com/viewarticle/971488", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220401_translate_keyboard_800x450.jpg", "publishedAt": "2022-04-03T19:16:05Z", "content": "An investigational drug targeting a novel cholesterol pathway has shown disappointing results in the TRANSLATE-TIMI 70 phase 2b study.\r\nVupanorsen is an antisense oligonucleotide targeting hepatic an… [+8781 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Alzheimer’s: these are the 3 metabolic warning signs at 35 that you should pay attention to - Code List", "description": "Alzheimer's accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that can develop once dementia begins, therefore it is likely that …", "url": "https://codelist.biz/2022/04/03/alzheimers-these-are-the-3-metabolic-warning-signs-at-35-that-you-should-pay-attention-to/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/4/1/f1280x720-36820_168495_5050.png", "publishedAt": "2022-04-03T16:29:46Z", "content": "Alzheimer’s accounts for 70% of the more than 50 million people who suffer from it. dementia, according to the World Health Organization. Consequently, it is the first type of mental diseases that ca… [+1931 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mayo Clinic: Lack of Sleep Increases Unhealthy Belly Fat - SciTechDaily", "description": "New research from Mayo Clinic shows that lack of sufficient sleep combined with free access to food increases calorie consumption and consequently fat accumulation, especially unhealthy fat inside the belly. Findings from a randomized controlled crossover stu…", "url": "https://scitechdaily.com/mayo-clinic-lack-of-sleep-increases-unhealthy-belly-fat/", "urlToImage": "https://scitechdaily.com/images/Abdominal-Belly-Fat.jpg", "publishedAt": "2022-04-03T15:25:40Z", "content": "New research from Mayo Clinic shows that lack of sufficient sleep combined with free access to food increases calorie consumption and consequently fat accumulation, especially unhealthy fat inside th… [+4599 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "These Popular Drinks May Increase Cancer Risk, New Study Suggests — Eat This Not That - Eat This, Not That", "description": "There are some drinks that are better than others when it comes to preventing cancer. A new study shows the correlation.", "url": "http://www.eatthis.com/news-drinks-increase-cancer-risk/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/02/energy-drinks.jpg?quality=82&strip=all", "publishedAt": "2022-04-03T15:00:53Z", "content": "If you're grabbing a beverage on the go, unless you're specifically looking for organic or all-natural options, odds are you're going to end up drinking something with at least some ingredients you d… [+2608 chars]"}]}