{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study identifies potential new approach for treating lupus - ANI News", "description": "The findings of a recent study suggest that targeting iron metabolism in immune system cells may offer a new approach for treating systemic lupus erythematosus (SLE) -- the most common form of the chronic autoimmune disease lupus.", "url": "https://www.aninews.in/news/science/study-identifies-potential-new-approach-for-treating-lupus20230114235829", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230114175500.jpg", "publishedAt": "2023-01-14T18:28:00Z", "content": "Washington [US], January 14 (ANI): The findings of a recent study suggest that targeting iron metabolism in immune system cells may offer a new approach for treating systemic lupus erythematosus (SLE… [+4040 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers discover secreted protein helps to repair, grow muscles - ThePrint", "description": "Tokyo [Japan], January 14 (ANI): A protein known as platelet-derived growth factor subunit B (PDGF-B), which is continually released from skeletal muscle cells, has been found to aid in muscle repair by promoting the formation of myoblasts, or muscle stem cel…", "url": "https://theprint.in/health/researchers-discover-secreted-protein-helps-to-repair-grow-muscles/1315330/", "urlToImage": null, "publishedAt": "2023-01-14T17:16:03Z", "content": "Tokyo [Japan], January 14 (ANI): A protein known as platelet-derived growth factor subunit B (PDGF-B), which is continually released from skeletal muscle cells, has been found to aid in muscle repair… [+2470 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlock the Anti-Aging Secrets of the Brain: How 6 Minutes of Exercise Could Delay Alzheimer's and Parkinson's Disease - SciTechDaily", "description": "Six minutes of high-intensity exercise could extend the lifespan of a healthy brain and delay the onset of neurodegenerative disorders, such as Alzheimer's disease and Parkinson's disease. New research published in The Journal of Physiology on January 11 show…", "url": "https://scitechdaily.com/unlock-the-anti-aging-secrets-of-the-brain-how-6-minutes-of-exercise-could-delay-alzheimers-and-parkinsons-disease/", "urlToImage": "https://scitechdaily.com/images/Healthy-Senior-Couple.jpg", "publishedAt": "2023-01-14T16:48:49Z", "content": "ByThe Physiological SocietyJanuary 14, 2023\r\nAccording to a new study, just six minutes of high-intensity exercise could extend the lifespan of a healthy brain and delay the onset of neurodegenerativ… [+5073 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Joanna Marie", "title": "What's The Difference Between Gallstones And Kidney Stones - Health Digest", "description": "Two common types of stones include gallstones and kidney stones. While they are both types of stones, there are several differences between them.", "url": "https://www.healthdigest.com/1167560/whats-the-difference-between-gallstones-and-kidney-stones/", "urlToImage": "https://www.healthdigest.com/img/gallery/whats-the-difference-between-gallstones-and-kidney-stones/l-intro-1673711568.jpg", "publishedAt": "2023-01-14T16:12:00Z", "content": "Gallstones are formed in the gallbladder, a small organ located under the liver. They are typically made of cholesterol but can also be made of other substances, such as bilirubin, according to Johns… [+909 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Scientists decode physical process behind chocolate melting in mouth - DTNEXT", "description": "During the moments it is in the mouth, the chocolate sensation arises from the way the chocolate is lubricated, either from ingredients in the chocolate itself or from saliva or a combination of the two.", "url": "https://www.dtnext.in/wellbeing/2023/01/14/scientists-decode-physical-process-behind-chocolate-melting-in-mouth", "urlToImage": "https://gumlet.assettype.com/dtnext%2F2023-01%2F852e83f4-bd59-4175-b174-fbf23a882a1e%2FUntitled_16_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-14T14:40:27Z", "content": "WASHINGTON: Scientists have decoded the physical process that takes place in the mouth when a piece of chocolate is eaten, as it changes from a solid into a smooth emulsion that many people find tota… [+3312 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Vitamin B12 Deficiency: Symptoms, Causes and Treatment - News18", "description": "Despite the fact that B12 is found in several foods, Vitamin B12 deficiency is quite prevalent.", "url": "https://www.news18.com/news/lifestyle/vitamin-b12-deficiency-symptoms-causes-and-treatment-6835093.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-1-156-167370415616x9.jpg", "publishedAt": "2023-01-14T13:49:43Z", "content": "Taking a healthy diet and keeping your fitness in check is extremely important. Feeding your body with essential vitamins and minerals is significant, otherwise, it can take a toll on your health. Vi… [+2387 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Cortisol, the stress hormone - Emergency Live International", "description": "Stress, however, is not necessarily bad: there is in fact good stress, called eustress, which enables our organism to cope with small and", "url": "https://www.emergency-live.com/health-and-safety/cortisol-the-stress-hormone/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2022/09/stress-cronico-donna-computer-stanchezza-1.jpg", "publishedAt": "2023-01-14T13:43:55Z", "content": "But if the stress situation lasts too long, and is not followed by a phase of relaxation, it leads to a series of harmful relapses for the organism.\r\nThis is referred to as bad stress, or distress\r\nC… [+3779 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Samantha Boesch", "title": "What Eating Fast Food Can Do to Your Liver, According to New Research - Yahoo Life", "description": "It's safe to say that fast food comes with a hefty amount of negative side effects, and while affordable and convenient, it can potentially wreak havoc on...", "url": "https://www.yahoo.com/lifestyle/eating-fast-food-liver-according-132334431.html", "urlToImage": "https://media.zenfs.com/en/galvanized/06121d8132ac921e75c21bde6f86d1ab", "publishedAt": "2023-01-14T13:23:34Z", "content": "It's safe to say that fast food comes with a hefty amount of negative side effects, and while affordable and convenient, it can potentially wreak havoc on your health if consumed on a regular basis. … [+4848 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Parenting Tips: 10 Signs Of Illness Among Children You Can't Afford to Ignore - News18", "description": "Feeling cold in the summer season is a sign of thyroid problems in children", "url": "https://www.news18.com/news/lifestyle/parenting-tips-10-signs-of-illness-among-children-you-cant-afford-to-ignore-6834745.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-1-150-167370229416x9.jpg", "publishedAt": "2023-01-14T13:18:48Z", "content": "Arent children the lifeline of every household? When they are healthy and smiling, parents also stay happy and at peace. But when the baby falls sick, it becomes the biggest problem for the parents. … [+1423 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "5 multivitamins every man should include in their diet: Heres the expert-backed list - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/lifestyle/5-multivitamins-every-man-should-include-in-their-diet-heres-the-expert-backed-list", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-01/acc07bd9-0617-4f46-b66d-3a66026859a8/hgn.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-01-14T12:26:38Z", "content": "Men and women have different needs, men require more of some nutrients like vitamin B12 and Vitamin K and less of others like iron, compared with women. Always choose multivitamins according to your … [+3539 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "'Support from others in stressful times can ease genetic depression risk' - DTNEXT", "description": "The study shows the importance of social support in buffering the risk of developing depression symptoms in general, using data from two very different groups of people under stress", "url": "https://www.dtnext.in/wellbeing/2023/01/14/support-from-others-in-stressful-times-can-ease-genetic-depression-risk", "urlToImage": "https://gumlet.assettype.com/dtnext%2F2023-01%2F3b4918e9-1ccf-4c48-ad20-8e1d99c172b8%2FUntitled_7_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-14T12:17:05Z", "content": "WASHINGTON: Reaching out to support a person when theyre under stress is always a good idea. But a new study suggests that support could be especially important for someone whose genetic makeup makes… [+3596 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "How to Gain Weight if You're Underweight, Says Doctor - Eat This, Not That", "description": "A doctor shares how to gain weight if you're underweight. These tips will keep your body composition healthy while putting on extra pounds.", "url": "https://www.eatthis.com/how-to-gain-weight-if-underweight/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/01/woman-stepping-on-scale.jpg?quality=82&strip=all", "publishedAt": "2023-01-14T11:00:45Z", "content": "For some people, it can be just as difficult to gain weight as it is for people who are trying to lose weight. There are various reasons you might be looking to gain weight, like if you want to put o… [+5013 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Dread health hazards of sitting all day, take a five-minute walk every half an hour - WION", "description": "Dread health hazards of sitting all day, take a five-minute walk every half an hour", "url": "https://www.wionews.com/science/this-is-how-you-can-beat-health-hazards-of-sitting-all-day-552608", "urlToImage": "http://cdn.wionews.com/sites/default/files/2022/12/05/315897-1449488478vzecirstress-shutterstock680.jpg", "publishedAt": "2023-01-14T10:36:31Z", "content": "A sedentary lifestyle invites many diseases. This much is fairly known. But even sitting long hours on a chair in itself causes various health problems. Now, a study published in Medicine &amp; Scien… [+1231 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Cervical cancer: the importance of prevention - Emergency Live International", "description": "Cervical cancer (or cervical cancer) is a neoplasm that still has a very important epidemiological and social relevance: it is the third...", "url": "https://www.emergency-live.com/health-and-safety/cervical-cancer-the-importance-of-prevention/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2022/10/medicina-online-visita-medica-ginecologica-completa-video-vulva-genitali-interni-esterni-studio-vagina-utero-esame-ecografia-transvaginale-fibromi-polipi-tumore-cancro-gravidanza-incinta.jpg", "publishedAt": "2023-01-14T10:05:30Z", "content": "The main cause of cervical cancer\r\nWe know that the main cause of cervical cancer can be ascribed to the Human Papilloma Virus, HPV (Human Papilloma Virus), now widely recognised as a necessary facto… [+7249 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists use paleogenomics to elucidate 10,000 years of immune system evolution - ThePrint", "description": "Washington [US], January 14 (ANI): Scientists from the Institut Pasteur, Universite Paris Cite, the CNRS and the College de France have used paleogenomics to trace 10,000 years of human immune system evolution. They analysed the genomes of more than 2,800 ind…", "url": "https://theprint.in/science/scientists-use-paleogenomics-to-elucidate-10000-years-of-immune-system-evolution/1314678/", "urlToImage": null, "publishedAt": "2023-01-14T09:13:34Z", "content": "Washington [US], January 14 (ANI): Scientists from the Institut Pasteur, Universite Paris Cite, the CNRS and the College de France have used paleogenomics to trace 10,000 years of human immune system… [+5248 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Prostate cancer: Early detection signs and prevention tips - Hindustan Times", "description": "Prostate cancer is the second most common cancer in the world and the sixth leading cause of cancer death among men globally. Watch out for these early detection signs of prostate cancer and check out these prevention tips by experts | Health", "url": "https://www.hindustantimes.com/lifestyle/health/prostate-cancer-early-detection-signs-and-prevention-tips-101673685125321.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/14/1600x900/Collage_Maker-14-Jan-2023-0215-PM_1673685734313_1673685734559_1673685734559.jpg", "publishedAt": "2023-01-14T09:05:57Z", "content": "In 2030, the worldwide burden of prostate cancer is expected to rise to 1.7 million new cases and 4,99,000 new deaths simply due to population growth and ageing as prostate cancer has become a major … [+8515 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Social isolation linked to dementia among older adults - Mint Lounge", "description": "Researchers found the use of communications technology such as telephone and email lowered the risk for social isolation", "url": "https://lifestyle.livemint.com/health/wellness/social-isolation-linked-to-dementia-among-older-adults-111673611830476.html", "urlToImage": "https://images.livemint.com/img/2023/01/13/1140x641/older_adults_isolation_1673632731769_1673632732041_1673632732041.jpg", "publishedAt": "2023-01-14T08:36:38Z", "content": "Researchers from the Johns Hopkins University School of Medicine and Bloomberg School of Public Health have significantly added to evidence that social isolation is a significant risk factor for deme… [+4289 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "What is diabetes mellitus? Types, risk factors, symptoms and tests taken - Zee News", "description": "Diabetes develops when your bodys cells are unable to absorb sugar (glucose) and use it as fuel. As a result, your bloodstream begins to accumulate additional sugar.", "url": "https://zeenews.india.com/health/what-is-diabetes-mellitus-types-risk-factors-symptoms-and-tests-taken-2561421", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/14/1141401-diabetes-mellitus.png", "publishedAt": "2023-01-14T07:33:00Z", "content": "High blood sugar: Diabetes develops when your body's cells are unable to absorb sugar (glucose) and use it as fuel. As a result, your bloodstream begins to accumulate additional sugar. Mismanagement … [+3189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Rajesh Parikh", "title": "Why moderate running is good for the heart, marathon not so much - The Indian Express", "description": "Research shows how excessive running may have negated the remarkably longer lifespans brought about by moderate running, says Dr Rajesh M. Parikh Director of Medical Research at Mumbai’s Jaslok Hospital & Research Centre", "url": "https://indianexpress.com/article/lifestyle/health-specials/moderate-running-heart-marathon-8381361/", "urlToImage": "https://images.indianexpress.com/2023/01/running_200_getty.jpg", "publishedAt": "2023-01-14T07:27:46Z", "content": "Depending on ones point of view, the very first marathon was either a spectacular success or a deadly disaster. The legend runs that in August 490 BC, Greeks were winning The Battle of Marathon again… [+5816 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Gardening can help reduce cancer risk and boost mental health? Here's what we know - India TV News", "description": "Community gardening could play an important role in preventing cancer, chronic diseases, and mental health disorders.", "url": "https://www.indiatvnews.com/health/gardening-can-help-reduce-cancer-risk-and-boost-mental-health-here-what-we-know-2023-01-14-839148", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/gardening-1673680874.jpg", "publishedAt": "2023-01-14T07:22:02Z", "content": "Do you know gardening can have a powerful impact on your mind and body? Funded by the American Cancer Society, the first-ever, randomized, controlled trial of community gardening found that those who… [+2786 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Gut microbiomes have far-reaching effects on how our bodies function: Study - Hindustan Times", "description": "According to recent studies, the health of our brains is significantly influenced by the gut microbiome. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/gut-microbiomes-have-far-reaching-effects-on-how-our-bodies-function-study-101673680184342.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/14/1600x900/gut_health_thumb_1647058350729_1673680345526_1673680345526.jpg", "publishedAt": "2023-01-14T07:19:19Z", "content": "A study suggested that the trillions of microbes that normally live in our intestines, known as the gut microbiome, have far-reaching effects on how our bodies function. Members of this microbial com… [+6152 chars]"}, {"source": {"id": null, "name": "GQ India"}, "author": "Pallavi Mehra", "title": "Know all the pros and cons of a low-carb diet, according to experts - GQ India", "description": "A low-carb diet can help prevent a number of lifestyle disorders such as heart disease and diabetes. Here’s your complete guide to the low-carb diet!", "url": "https://www.gqindia.com/live-well/content/know-all-the-pros-and-cons-of-a-low-carb-diet-according-to-experts", "urlToImage": "https://assets.gqindia.com/photos/63ab4658077099f5ab0d07cf/16:9/w_1280,c_limit/Low%20Carb1.jpg", "publishedAt": "2023-01-14T06:37:13Z", "content": "A low-carb diet often means low fruit, vegetable and whole grain intake, which reduces the amount of fibre in the diet. Thus, a low fibre could lead to gut health issues such as constipation, IBS, ha… [+1760 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "50% Of Indians Don't Do Even 150 Minutes Of Physical Activity Per Week! - odishabytes - OdishaBytes", "description": "Given India's high rate of incidence of coronary artery disease (CAD), diabetes and high death rate due to cardiovascular diseases, news that over 50 per cent of Indians do not meet the minimum physical activity recommended by the World Health Organisation (W…", "url": "https://odishabytes.com/50-of-indians-dont-do-even-150-minutes-of-physical-activity-per-week/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2019/09/moring-walk.jpg", "publishedAt": "2023-01-14T06:03:07Z", "content": "Given India’s high rate of incidence of coronary artery disease (CAD), diabetes and high death rate due to cardiovascular diseases, news that over 50 per cent of Indians do not meet the minimum physi… [+4524 chars]"}, {"source": {"id": null, "name": "Bharattimes.co.in"}, "author": null, "title": "High cholesterol signs: Can high cholesterol affect your skin? Tips to manage and lower your cholesterol - English Bharat Times", "description": "Restricting high saturated fat.", "url": "https://eng.bharattimes.co.in/high-cholesterol-signs-can-high-cholesterol-affect-your-skin-tips-to-manage-and-lower-your-cholesterol/", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/14/1141316-cholesterol-on-skin.jpeg", "publishedAt": "2023-01-14T05:45:00Z", "content": "high cholesterol: Fatty deposits under the skin can form when you have too much cholesterol in your bloodstream. This can result in oily orange or yellow pimples. In addition, cholesterol can block c… [+1346 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Skipping Meals Could Be Much Worse For You Than We Realized - ScienceAlert", "description": "In the hustle and bustle of modern existence, it can be all too easy to skip a meal or two.", "url": "https://www.sciencealert.com/skipping-meals-could-be-much-worse-for-you-than-we-realized", "urlToImage": "https://www.sciencealert.com/images/2023/01/BrokenDinnerPlateInRedScene.jpg", "publishedAt": "2023-01-14T05:00:33Z", "content": "In the hustle and bustle of modern existence, it can be all too easy to skip a meal or two. You might even do it deliberately. A new study suggests going without one of the standard three meals a day… [+3258 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Cardiovascular health: Tips to keep your heart healthy if you are turning 30 - India TV News", "description": "Cardiovascular health: We must follow some basic lifestyle tips to keep our heart healthy from a young age to avoid the risk of heart disease.", "url": "https://www.indiatvnews.com/health/cardiovascular-health-tips-to-keep-your-heart-healthy-if-you-are-turning-30-health-news-2023-01-12-838787", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/shdgxsxsefgxfcxdddcccscsdddsx-1673546081.jpg", "publishedAt": "2023-01-14T04:30:01Z", "content": "Cardiovascular health: Juggling a family and career has probably left you with little time to worry about yourself. Life is a balancing act, but our health should always come first. Now is the time t… [+3200 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Can some gut bacteria cause diabetes? Can probiotics help in controlling them? - The Indian Express", "description": "A study has found that those with higher levels of a bacterium called Coprococcus tended to have a higher insulin sensitivity while those with Flavonifractor tended to have lower insulin sensitivity. But the differences are not substantial enough to identify …", "url": "https://indianexpress.com/article/lifestyle/health-specials/some-gut-bacteria-cause-diabetes-probiotics-8380926/", "urlToImage": "https://images.indianexpress.com/2023/01/gut-bacteria_200_getty.jpg", "publishedAt": "2023-01-14T03:20:13Z", "content": "Is your gut bacteria and consequently your gut health an indicator whether you will develop diabetes or not? According to a prospective study led by investigators at Cedars-Sinai Medical Center, US, … [+3960 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "US records over 24 mn flu illnesses this season - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/us-records-over-24-mn-flu-illnesses-this-season-3483363", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/6485bfeb2202f4a203b4280188f86177_w_800_h_450.jpg", "publishedAt": "2023-01-14T03:18:10Z", "content": "Los Angeles, Jan 14 (IANS) There have been at least 24 million illnesses, 260,000 hospitalisations and 16,000 deaths from flu so far this season in the US, according to the latest estimates released … [+453 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Coffee may cut the severity of fatty liver in diabetics: Study - Sentinelassam - The Sentinel Assam", "description": "Caffeine, polyphenols, and other natural products found in coffee may help reduce the severity of...", "url": "https://www.sentinelassam.com/topheadlines/coffee-may-cut-the-severity-of-fatty-liver-in-diabetics-study-633083", "urlToImage": "https://assets.sentinelassam.com/h-upload/2023/01/14/430243-coffe12.jpg", "publishedAt": "2023-01-14T01:43:41Z", "content": "NEW DELHI: Caffeine, polyphenols, and other natural products found in coffee may help reduce the severity of non-alcoholic fatty liver disease (NAFLD) among overweight people with type 2 diabetes (T2… [+1824 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Type 1 diabetes: Maintaining the enzyme ACE2 in the gut prevents diabetic blindness - EurekAlert", "description": "Blood from human subjects with Type 1 diabetes and a mouse model of Type 1 diabetes were used to explore mechanisms underlying diabetic retinopathy, the leading cause of blindness in American adults. The results show a way to possibly prevent, or even reverse…", "url": "https://www.eurekalert.org/news-releases/976667", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/0d826f04-e400-4e0b-a931-4d9b50d3050f/Rendition/thumbnail/Content/Public", "publishedAt": "2023-01-13T23:08:18Z", "content": "image: Maria Grantview more \r\nCredit: UAB\r\nBIRMINGHAM, Ala. – The leading cause of blindness in American adults is diabetic retinopathy, progressive damage to blood vessels in the light-sensitive tis… [+5817 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A novel, powerful tool to unveil the communication between gut microbes and the brain - Science Daily", "description": "This laboratory protocol gives researchers a road map to understand the complex traffic system between the gut and the brain and its effects both in health and disease.'", "url": "https://www.sciencedaily.com/releases/2023/01/230113145227.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-13T22:26:48Z", "content": "In the past decade, researchers have begun to appreciate the importance of a two-way communication that occurs between microbes in the gastrointestinal tract and the brain, known as the gut-brain axi… [+4620 chars]"}, {"source": {"id": null, "name": "Real Simple"}, "author": "https://www.facebook.com/realsimple/", "title": "6 Superfoods to Eat for a Strong, Healthy Immune System - Real Simple", "description": "Here are the best foods for immune system strength and support. From leafy greens to green tea, these ingredients are absolutely packed with nutrients for better immunity.", "url": "https://www.realsimple.com/foods-for-immune-system-7093660", "urlToImage": "https://www.realsimple.com/thmb/45lguoHvEOlhVEfpdEB8BBJZrmk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/naturally-boost-immunity-GettyImages-637935358-040258a9205040b1a29eaccc1b98966e.jpg", "publishedAt": "2023-01-13T22:07:18Z", "content": "Immunity is important all year, every year, but it seems to have become an even hotter health topic than ever over the last few years. And it's always of particular interest when cold and flu season … [+6018 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Nutrition, Health, and Your Environment - National Institute of Environmental Health Sciences", "description": "The mission of the National Institute of Environmental Health Sciences is to discover how the environment affects people in order to promote healthier lives.", "url": "https://www.niehs.nih.gov/health/topics/nutrition/index.cfm", "urlToImage": "https://www.niehs.nih.gov/health/assets/images/nutrition_og.jpg", "publishedAt": "2023-01-13T21:33:42Z", "content": "Introduction\r\nWhat we eat is considered an environmental factor that influences health, in positive and negative ways. Healthy diets with an optimal balance of nutrients help people accomplish daily … [+20595 chars]"}, {"source": {"id": null, "name": "Healthgrades.com"}, "author": "https://www.healthgrades.com/contributors/tessa-cooper", "title": "Stress Cause High Blood Pressure? Effects Explained - Healthgrades", "description": "Stress may contribute to increases in blood pressure. However, the extent of these effects can vary depending on many factors. Learn more.", "url": "https://www.healthgrades.com/right-care/high-blood-pressure/does-stress-cause-high-blood-pressure", "urlToImage": "https://dims.healthgrades.com/dims3/MMH/b117c2a/2147483647/strip/true/crop/732x384+0+82/resize/1200x630!/quality/75/?url=https%3A%2F%2Fucmscdn.healthgrades.com%2F54%2F91%2F52747a2eb8acf2a6ebef234fd94d%2Fhg-nails-on-balloon-732x549-thumbnail.jpg", "publishedAt": "2023-01-13T21:17:57Z", "content": "In some cases, stress may contribute to high blood pressure, also known as hypertension. This is because stress can trigger physical reactions in the body that affect the heart and blood vessels. \r\nT… [+6590 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What are the present challenges and future considerations in developing vaccines against mucosal respiratory viruses? - News-Medical.Net", "description": "In a recent review, the former director of the National Institute of Allergy and Infectious Diseases and former chief medical advisor to the president of the United States (U.S.), Dr. Fauci, and his team review the roadblocks to developing effective vaccines …", "url": "https://www.news-medical.net/news/20230113/What-are-the-present-challenges-and-future-considerations-in-developing-vaccines-against-mucosal-respiratory-viruses.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735832_16736432900616559.jpg", "publishedAt": "2023-01-13T21:00:00Z", "content": "In a recent review published in Cell Host &amp; Microbe, the former director of the National Institute of Allergy and Infectious Diseases and former chief medical advisor to the president of the Unit… [+6225 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Steven Reinberg", "title": "Frequent Use of Antibiotics Linked With Higher Odds for Crohn's, Colitis - The Citizen", "description": "FRIDAY, Jan. 13, 2023 (HealthDay News) -- Overuse of antibiotics may trigger inflammatory bowel disease (IBD), new research suggests.Among folks who were 40 or older, a new study found that antibiotics may increase the risk for bowel diseases, such as Crohn's…", "url": "https://consumer.healthday.com/crohn-s-disease-2659072487.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yMzYzMTcxNy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcxMDY1NDIzN30.69XB9hP05MbWycackp8bO1urwyR8GApdkd6th96WlCg/image.jpg?width=1200&height=600&coordinates=0%2C100%2C0%2C100", "publishedAt": "2023-01-13T20:01:49Z", "content": "FRIDAY, Jan. 13, 2023 (HealthDay News) -- Overuse of antibiotics may trigger inflammatory bowel disease (IBD), new research suggests.\r\nAmong folks who were 40 or older, a new study found that antibio… [+4223 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Phentermine Over-The-Counter | 3 ΤΟΡ Phentermine Alternative... - MENAFN.COM", "description": "(MENAFN - News Direct)            New Rochelle, NewYork | January 13, 2023 11:01 AM Eastern Standard Time Surely, Phentermine is the most p", "url": "https://menafn.com/1105426673/Phentermine-Over-The-Counter-3-Phentermine-Alternatives-For-Secure-Weight-Loss", "urlToImage": "https://menafn.com/updates/pr/2023-01/13/ND_44e4aimage_story.png", "publishedAt": "2023-01-13T19:09:15Z", "content": "(MENAFN- News Direct) New Rochelle, NewYork | January 13, 2023 11:01 AM Eastern Standard Time\r\nSurely, Phentermine is the most popular prescription drug for weight loss and obesity.\r\nIt is a medicati… [+21471 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Overactive cell metabolism is associated with biological ageing: Study - The Tribune India", "description": "Why do cells, and thus people, age? The solution could be related to mitochondria, the organelles that provide energy to cells. Though this is not a new thing, direct evidence in human cells had previously been lacking, until now.", "url": "https://www.tribuneindia.com/news/health/overactive-cell-metabolism-is-associated-with-biological-ageing-study-470116", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_738232562.jpg", "publishedAt": "2023-01-13T16:55:00Z", "content": "ANI\r\nNew York, January 13\r\nWhy do cells, and thus people, age? The solution could be related to mitochondria, the organelles that provide energy to cells. Though this is not a new thing, direct evide… [+3980 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Researchers find cause of epilepsy in children - The Tribune India", "description": "Epilepsy affects 4 per cent of the population and is one of the most common brain disorders among children. Most seizure recurrences can be avoided with modern medicine, but approximately 20 per cent of patients do not respond to treatment.", "url": "https://www.tribuneindia.com/news/health/researchers-find-cause-of-epilepsy-in-children-470113", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_116607486.JPG", "publishedAt": "2023-01-13T16:50:00Z", "content": "ANI\r\nSan Diego (California), January 13\r\nEpilepsy affects 4 per cent of the population and is one of the most common brain disorders among children. Most seizure recurrences can be avoided with moder… [+3974 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "John Ely Senior", "title": "The TRUTH on statins: Are the cholesterol-busting pills safe? - Daily Mail", "description": "Statins cost as little as 2p per pill and have been credited with saving millions of lives by preventing heart attacks and strokes but thousands have shunned the drugs over the side effects.", "url": "https://www.dailymail.co.uk/health/article-11631191/The-TRUTH-statins-cholesterol-busting-pills-safe.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/13/16/66549809-0-image-a-16_1673626833892.jpg", "publishedAt": "2023-01-13T16:02:58Z", "content": "It's a landmark decision that could see millions more Britons prescribed statins. \r\nBut at the same time, the move has reignited a decades-long row over whether the cholesterol-busting pills are safe… [+17969 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "High cholesterol: Effective lifestyle changes to lower cholesterol in winters - Hindustan Times", "description": "Winters can wreak havoc with our cholesterol levels. Here are some easy lifestyle changes to keep cholesterol in control and stay healthy. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/high-cholesterol-effective-lifestyle-changes-to-lower-cholesterol-in-winters-101673621543872.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/13/1600x900/cholesterol_thumb_1650696470437_1673621634397_1673621634397.jpg", "publishedAt": "2023-01-13T15:18:54Z", "content": "Winters can increase risk of several ailments and health conditions and it's partly due to our sedentary lifestyle during the season and also the fact that we eat high-calorie food more often as comp… [+3518 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Bariatric surgery treats severe obesity without increasing esophageal and gastric cancer risk: JAMA. - Medical Dialogues", "description": "France:  Researchers have found in a new study that bariatric surgery could treat severe obesity without increasing the risk  of esophageal and gastric cancer.The study has been published in JAMA...", "url": "https://medicaldialogues.in/surgery/news/bariatric-surgery-treats-severe-obesity-without-increasing-esophageal-and-gastric-cancer-risk-jama-105542", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/12/197834-untitled-design-2023-01-12t163402176.jpg", "publishedAt": "2023-01-13T14:30:50Z", "content": "France: Researchers have found in a new study that bariatric surgery could treat severe obesity without increasing the risk of esophageal and gastric cancer.The study has been published in JAMA Surge… [+2452 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Patrick Campbell", "title": "Despite Improved Screening and Rates of Dyslipidemia, Prescribing Not Yet at Optimal levels - MD Magazine", "description": "An analysis of NHANES data from 1999-2018 details the progress made with regard to cholesterol management on a population level but also provides insight into areas where room for improvement still exists.", "url": "https://www.hcplive.com/view/despite-improved-screening-and-rates-of-dyslipidemia-prescribing-not-yet-at-optimal-levels", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/4fe9973aa9fdde24e9d68729eeb7e80ce2b2ffc4-299x375.jpg?fit=crop&auto=format", "publishedAt": "2023-01-13T14:13:15Z", "content": "An analysis of nationwide trends over 2 decades suggests the public health efforts and efforts of clinicians to improve cholesterol control on a population level have been paying dividends.\r\nUsing da… [+5269 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "7 Food Items To Prevent Vitamin D Deficiency In Winter - News18", "description": "Food items to increase vitamin D levels.", "url": "https://www.news18.com/news/lifestyle/7-food-items-to-prevent-vitamin-d-deficiency-in-winter-6827533.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-1-141-167361613316x9.jpg", "publishedAt": "2023-01-13T13:22:57Z", "content": "Vitamin D is considered very important for our bodies, and its deficiency can reduce the absorption of calcium. This may lead to the weakening of our bones. Not only that, but vitamin D is also neces… [+1754 chars]"}, {"source": {"id": null, "name": "NEWS HEADS"}, "author": "Himanshu swaraj", "title": "Taking control of diabetes: How sleep can help, check details - NEWS HEADS", "description": "Prevention Advice for Diabetes: A Global Problem Rapid disease spread is occurring. In India, the number of patients affected by this illness is fast rising as well. About 77 million people in the nation have diabetes. National Institutes of Health In the nex…", "url": "https://www.newsheads.in/lifestyle/news/taking-control-of-diabetes-how-sleep-can-help-check-details-article-68643", "urlToImage": "https://static.newsheads.in/media/thumbs/2023/01/13/412504237-diabetes-test-_1200x675.jpg", "publishedAt": "2023-01-13T13:21:50Z", "content": "Delhi : Prevention Advice for Diabetes: A Global Problem Rapid disease spread is occurring. In India, the number of patients affected by this illness is fast rising as well. About 77 million people i… [+1988 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Here’s Why Fully Vaccinated People are Still At Risk of Covid-19 Infection - News18", "description": "With the rising infection in China, concerns over the possibility of another outbreak of Covid-19 have gripped the entire world.", "url": "https://www.news18.com/news/lifestyle/heres-why-fully-vaccinated-people-are-still-at-risk-of-covid-19-infection-6824983.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-40-2-167361558616x9.png", "publishedAt": "2023-01-13T13:14:16Z", "content": "Infections of the evolving variants of Covid-19 have been reported even in people who had taken all the dosage of vaccination including the booster shots. Like any vaccines, Covid-19 vaccines do not … [+2062 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Slim Keto Gummies Reviews [Scam Exposed] Slim Candy Keto Gummies | Side Effects ALERT Must Read Before Buying - Deccan Herald", "description": "Slim Keto Gummies Reviews: What You Need To Know", "url": "https://www.deccanherald.com/brandspot/pr-spot/slim-keto-gummies-reviews-scam-exposed-slim-candy-keto-gummies-side-effects-alert-must-read-before-buying-1180763.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1180763-1673614961.png", "publishedAt": "2023-01-13T13:02:41Z", "content": "Slim Keto Gummies Reviews: What You Need To Know\r\nIf you're looking for a keto diet supplement that can help you lose weight and tone up your body, Slim Keto Gummies may be a good choice for you. It … [+9382 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Preclinical development of kinetin as a safe error-prone SARS-CoV-2 antiviral able to attenuate virus-induced inflammation - Nature.com", "description": "The search for antivirals against SARS-CoV-2 continue due to the emergence of variants of concerns, able to escape the vaccinal humoral response. In this work, authors pre-clinically explore the potential of kinetin against SARS-CoV-2, which could be used alo…", "url": "https://www.nature.com/articles/s41467-023-35928-z", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41467-023-35928-z/MediaObjects/41467_2023_35928_Fig1_HTML.png", "publishedAt": "2023-01-13T12:55:23Z", "content": "This research complies with ethical regulations. Experiments of infection of K18-hACE2- mice were performed in the Animal Biosafety Level 3 (ABSL-3) multiuser facility, according to the animal welfar… [+37478 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Stem cell therapy can do wonders in preventing the progression of cancer - Economic Times", "description": "Quality stem cell therapy can cause cancerous cells to turn into benevolent ones.", "url": "https://economictimes.indiatimes.com/magazines/panache/stem-cell-therapy-can-do-wonders-in-preventing-the-progression-of-cancer/articleshow/96970021.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96971327,width-1070,height-580,imgsize-49566,overlay-etpanache/photo.jpg", "publishedAt": "2023-01-13T12:55:00Z", "content": "How cells become cancerous is a process researchers are still trying to fully understand. Generally, normal cells grow and multiply through controlled cell division, where old and damaged cells are r… [+5385 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Alpine Ice Hack Recipe (Alpilean Weight Loss Reviews) – Does Alpilean Ice Hack Recipe Work? - mid-day.com", "description": "Alpilean (Alpine Ice Hack) is a powerful and most effective newly introduced weight loss supplement that has taken the fitness industry by storm.", "url": "https://www.mid-day.com/brand-media/article/alpine-ice-hack-recipe-alpilean-weight-loss-reviews-does-alpilean-ice-hack-23265298", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Alpinew123_d.jpg", "publishedAt": "2023-01-13T12:02:00Z", "content": "Alpilean (Alpine Ice Hack) is a powerful and most effective newly introduced weight loss supplement that has taken the fitness industry by storm.\r\nAlpilean consists of 6 alpine nutrients and the ice … [+16718 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Are you getting recurrent UTIs? Your estrogen levels may be to blame - The Indian Express", "description": "US study finds a very strong association between beneficial bacteria in the bladder and the use of estrogen hormone therapy in postmenopausal women. ‘Estrogen supplementation can certainly break the cycle of recurrent infections. Focus on preventives,’ says g…", "url": "https://indianexpress.com/article/lifestyle/health-specials/are-you-getting-recurrent-utis-your-estrogen-levels-may-be-to-blame-8380223/", "urlToImage": "https://images.indianexpress.com/2023/01/UTI_1200_gettyHS_Jan.jpg", "publishedAt": "2023-01-13T12:01:49Z", "content": "Why are older women more prone to urinary tract infections (UTIs)? Turns out their falling estrogen levels are to blame. Researchers at the University of Texas at Dallas have identified specific bact… [+5028 chars]"}, {"source": {"id": null, "name": "Europa.eu"}, "author": null, "title": "ECDC assesses risk to the EU/EEA associated with Omicron XBB1.5 sub-lineage - European Centre for Disease", "description": "In a Threat Assessment Brief released today, the European Centre for Disease Prevention and Control (ECDC) assesses the overall level of risk to the EU/EEA associated with the spread of the Omicron XBB.1.5 SARS-CoV-2 sub-lineage as low for the general populat…", "url": "https://www.ecdc.europa.eu/en/news-events/covid-19-implications-spread-omicron-xbb15", "urlToImage": "https://www.ecdc.europa.eu/sites/default/files/styles/is_large/public/images/Pneumonia-cases-2_H.png?itok=qP3cDz5D", "publishedAt": "2023-01-13T12:00:00Z", "content": "In a Threat Assessment Brief released today, the European Centre for Disease Prevention and Control (ECDC) assesses the overall level of risk to the EU/EEA associated with the spread of the Omicron X… [+2789 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Mysteries About Leading Biomarker for Alzheimer’s Solved - Neuroscience News", "description": "Researchers identify how taupT217, a toxic form of the Tau protein, spreads through the brain as Alzheimer's disease progresses.", "url": "https://neurosciencenews.com/tau217-alzheimers-22243/", "urlToImage": "https://neurosciencenews.com/files/2023/01/alzheimers-biomarker-neurosinces-public.jpg", "publishedAt": "2023-01-13T11:29:34Z", "content": "Summary: Researchers identify how taupT217, a toxic form of the Tau protein, spreads through the brain as Alzheimer’s disease progresses.\r\nSource: University of Virginia\r\nUniversity of Virginia neuro… [+6324 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Chhavi", "title": "Placebo Can Reduce Feelings Of Guilt, Reveals Study - Medical Dialogues", "description": "Placebo Can Reduce Feelings Of Guilt, Reveals Study", "url": "https://medicaldialogues.in/photo-stories/placebo-can-reduce-feelings-of-guilt-reveals-study-212", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/13/198085-amp-stories-cover-59.jpg", "publishedAt": "2023-01-13T11:03:53Z", "content": "PLACEBO CAN REDUCE FEELINGS OF GUILT, REVEALS STUDY"}, {"source": {"id": null, "name": "Techbullion.com"}, "author": "Noor, Angela Scott-Briggs, TechBullion", "title": "Keto Diet For Weight Loss - TechBullion", "description": "The Keto Diet for Weight Loss: A Beginner’s Guide  Introduction The low-carb, high-fat ketogenic diet, commonly referred to as the “keto diet,” has grown in favor of a strategy for weight loss and overall health improvement. The diet works by triggering a con…", "url": "https://techbullion.com/keto-diet-for-weight-loss/", "urlToImage": "https://techbullion.com/wp-content/uploads/2023/01/gggggggggggggggggggggggggggg.png", "publishedAt": "2023-01-13T10:57:57Z", "content": "The Keto Diet for Weight Loss: A Beginner’s Guide\r\n Introduction\r\nThe low-carb, high-fat ketogenic diet, commonly referred to as the “keto diet,” has grown in favor of a strategy for weight loss and … [+3388 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US sees decline in measles vax rates among kindergarteners - Daijiworld.com", "description": "Washington, Jan 13 (IANS): Nearly 250,000 US children who entered kindergarten in fall 2021 are potentially not protected against measles, one of the most infectious pathogens on the planet, according to the Centers for Disease Control and Prevention (CDC).\r\n…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1039417", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/sharmila_130123_vax.jpg", "publishedAt": "2023-01-13T10:02:53Z", "content": "Washington, Jan 13 (IANS): Nearly 250,000 US children who entered kindergarten in fall 2021 are potentially not protected against measles, one of the most infectious pathogens on the planet, accordin… [+903 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Is it flu or Covid-19? Experts on how to differentiate between the symptoms - Hindustan Times", "description": "Flu and Covid-19, both being respiratory illnesses, have a lot in common in terms of symptoms and way of transmission. Here's how you can know the difference between their symptoms. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/is-it-flu-or-covid-19-experts-on-how-to-differentiate-between-the-symptoms-101673602884695.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/13/1600x900/flu_and_covid_1673602937650_1673602950588_1673602950588.jpg", "publishedAt": "2023-01-13T09:52:26Z", "content": "Flu and Covid-19, both being respiratory illnesses, have a lot in common in terms of symptoms like fever, cough, sore throat, difficulty breathing, and how they are transmitted - through cough, sneez… [+4565 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers advanced the age of human neurons beyond what was previously possible - ThePrint", "description": "Washington [US], January 13 (ANI): Northwestern University-led researchers have created the first highly mature neurons from human induced pluripotent stem cells (iPSCs), a feat that opens new opportunities for medical research and potential transplantation t…", "url": "https://theprint.in/health/researchers-advanced-the-age-of-human-neurons-beyond-what-was-previously-possible/1312541/", "urlToImage": null, "publishedAt": "2023-01-13T06:14:32Z", "content": "Washington [US], January 13 (ANI): Northwestern University-led researchers have created the first highly mature neurons from human induced pluripotent stem cells (iPSCs), a feat that opens new opport… [+2997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Can you reverse diabetes with low carb diet? - The Indian Express", "description": "'Remission is possible in recent-onset diabetes when we bring down carbohydrates in the Indian platter to less than 40 per cent,' says Dr Anoop Misra, Chairman of Fortis-CDOC Center of Excellence for Diabetes, Metabolic Diseases, and Endocrinology, New Delhi", "url": "https://indianexpress.com/article/lifestyle/health-specials/can-a-low-carb-diet-lead-to-remission-of-type-2-diabetes-8379265/", "urlToImage": "https://images.indianexpress.com/2023/01/type2diabetes_HS_getty.jpg", "publishedAt": "2023-01-13T06:00:38Z", "content": "Over half of those who went on a low-carb diet were able to achieve remission maintain the blood glucose levels without the use of medicines or insulin with the proportion reaching as high as 77 per … [+5605 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "MobileODT partners with GenWorks to screen & treat cervical cancer - Express Healthcare", "description": "The partnership has launched its new device, Thermoglide. It is a lightweight, portable, FDA-approved device that screens and treats women for cervical cancer in a single sitting", "url": "https://www.expresshealthcare.in/news/mobileodt-partners-with-genworks-to-screen-treat-cervical-cancer/437718/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/01/31182513/admin-ajax-4-1-2.jpg", "publishedAt": "2023-01-13T05:55:30Z", "content": "The partnership has launched its new device, Thermoglide. It is a lightweight, portable, FDA-approved device that screens and treats women for cervical cancer in a single sitting\r\nMobileODT, an Israe… [+1803 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Sandeep Nayar", "title": "Asthma may get worse in winter: 8 tips to reduce the risk - Health shots", "description": "Did you know asthma symptoms can get worse in winter? Here's why and what you can do to protect yourself against asthma attacks.", "url": "https://www.healthshots.com/how-to/tips-to-deal-with-asthma-in-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/13091957/asthma.jpg", "publishedAt": "2023-01-13T04:45:54Z", "content": "The winter season can affect the respiratory system and aggravate respiratory diseases like asthma and chronic obstructive pulmonary disease (COPD). Breathing in cold air can irritate the airway and … [+3714 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study: Hospitalised patients' infections may develop from their own bacteria - Devdiscourse", "description": "Hospitals have strict hygiene and sanitation protocols to protect patients from bacteria that rarely sicken healthy people but can be deadly for vulnerable patients already hospitalized with serious illnesses. Nearly 100,000 people die every year in U.S. hosp…", "url": "https://www.devdiscourse.com/article/health/2317896-study-hospitalised-patients-infections-may-develop-from-their-own-bacteria", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_01_2023_03_35_15_2686071.jpg?width=920&format=jpeg", "publishedAt": "2023-01-13T03:35:17Z", "content": "Hospitals have strict hygiene and sanitation protocols to protect patients from bacteria that rarely sicken healthy people but can be deadly for vulnerable patients already hospitalized with serious … [+4794 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Thoracic Endometriosis: All You Need To Know About This Rare Disorder - News18", "description": "Endometriosis patches that grow around the lungs can cause life-threatening complications", "url": "https://www.news18.com/news/lifestyle/thoracic-endometriosis-all-you-need-to-know-about-this-rare-disorder-6817837.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-35-2-167357992116x9.png", "publishedAt": "2023-01-13T03:19:36Z", "content": "Thoracic endometriosis is a rare disorder in which endometrial tissues develop around the lungs. This rare disorder can lead to chest pain, shortness of breath, and coughing throughout the menstrual … [+2762 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Divya", "title": "Early Diabetes Symptoms in Women That You Should Not Ignore - Sportskeeda", "description": "Diabetes symptoms in women should not be ignored. Sometimes the warning flags are so subtle that you fail to see them. With type 2 diabetes, this is especially true.", "url": "https://www.sportskeeda.com/health-and-fitness/early-diabetes-symptoms-women-that-you-should-not-ignore", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/cd2fe-16735477055563-1920.jpg", "publishedAt": "2023-01-13T00:30:00Z", "content": "Diabetes symptoms in women should not be ignored. Sometimes the warning flags are so subtle that you fail to see them. With type 2 diabetes, this is especially true. Some people don't know they have … [+3793 chars]"}]}