{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Medical ethics that have to be followed while performing plastic surgery in India - Express Healthcare", "description": "Dr Bharath S P, Consultant-Cosmetic and Plastic Surgeon, Manipal Hospital highlights that considering the facts and circumstances, it is imperative that necessary steps are to be taken by the patients to approach the appropriate surgeons to undergo any change…", "url": "https://www.expresshealthcare.in/news/medical-ethics-that-have-to-be-followed-while-performing-plastic-surgery-in-india/435447/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/06/16171311/bharath.jpg", "publishedAt": "2022-06-16T11:46:17Z", "content": "Dr Bharath S P, Consultant-Cosmetic and Plastic Surgeon, Manipal Hospital highlights that considering the facts and circumstances, it is imperative that necessary steps are to be taken by the patient… [+4723 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Cell-based or 'adjuvanted' vaccines: Which flu shot should you choose? - Economic Times", "description": "An annual flu vaccine is recommended for adults and children six months and older.", "url": "https://economictimes.indiatimes.com/magazines/panache/cell-based-or-adjuvanted-vaccines-which-flu-shot-should-you-choose/articleshow/92252879.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92253997,width-1070,height-580,imgsize-50096,overlay-etpanache/photo.jpg", "publishedAt": "2022-06-16T11:00:00Z", "content": "With Australians learning to live with Covid and resuming international travel, cases of influenza are steadily rising. \r\nGetting a flu shot reduces your chance of catching the flu caused by four flu… [+5599 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Rashmi Mabiyan, ET HealthWorld", "title": "'Comprehensive guidelines on do's and don'ts of robotics in advanced cancer care a necessity' - ETHealthWorld", "description": "There has been a paradigm shift in the treatment of cancers in the last few years. The discovery of immunotherapy and the progress of minimally invasive surgery has prolonged the life of cancer survivors. Advancements in chemotherapy and radiotherapy have mad…", "url": "https://health.economictimes.indiatimes.com/news/industry/comprehensive-guidelines-on-dos-and-donts-of-robotics-in-advanced-cancer-care-a-necessity/92253521", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92253521,imgsize-227788,width-1200,height-628,overlay-ethealthworld/comprehensive-guidelines-on-do-s-and-don-ts-of-robotics-in-advanced-cancer-care-a-necessity.jpg", "publishedAt": "2022-06-16T10:59:00Z", "content": "Dr Jagdeesh N. Kulkarni, Director of Minimal Invasive and Robotic Surgery atAsian Cancer Institute, Mumbai speaks to ETHealthworld's Rashmi Mabiyan to discuss how cancer treatment modalities have evo… [+5132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "US announces $122 million fund for India to address challenges posed by infectious diseases - The Indian Express", "description": "The funds will be distributed to the three top Indian health research institutions -- Indian Council of Medical Research (ICMR), National Institute of Virology (NIV) and National Institute of Epidemiology (NIE).", "url": "https://indianexpress.com/article/world/us-announces-usd-122-million-fund-for-india-to-address-challenges-posed-by-infectious-diseases-7973310/", "urlToImage": "https://images.indianexpress.com/2022/06/forex-1.jpg", "publishedAt": "2022-06-16T10:20:26Z", "content": "The United States has announced a funding of USD 122 million to top three Indian medical research institutions to prevent avoidable epidemics, early detection of disease threats, and rapid and effect… [+1981 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Prashasti Sudhakar", "title": "Top 5 Reasons Why You Should Drink Neem Juice Everyday, Health Benefits Of Neem Juice - Watch Video - India.com", "description": "Benefits of neem juice: Neem juice can cure ulcer and also boost immunity. Watch video to know the top 5 health benefits of neem juice.", "url": "https://www.india.com/video-gallery/top-5-reasons-why-you-should-drink-neem-juice-everyday-health-benefits-of-neem-juice-watch-video-5456645/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/06/neem-juice-benefits.jpg", "publishedAt": "2022-06-16T10:16:00Z", "content": "Health Benefits Of Neem Juice: Neem also known as Arishta, Holy tree and Indian Lilac mainly grows in Asian subcontinental regions like India, Pakistan, Nepal, Maldives an Bangladesh. The medicinal p… [+872 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Valproic acid keeps nervous system cells from growing and dividing correctly: Study - ThePrint", "description": "Washington [US], June 16 (ANI): A study reveals how epilepsy and migraine drug causes birth defects. Valproic acid, a drug used to treat epilepsy, migraine, and bipolar disorder can cause birth defects when taken during pregnancy. VPA is widely used to treat …", "url": "https://theprint.in/science/valproic-acid-keeps-nervous-system-cells-from-growing-and-dividing-correctly-study/999172/", "urlToImage": null, "publishedAt": "2022-06-16T10:14:21Z", "content": "Washington [US], June 16 (ANI): A study reveals how epilepsy and migraine drug causes birth defects. Valproic acid, a drug used to treat epilepsy, migraine, and bipolar disorder can cause birth defec… [+2005 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Missing your periods regularly? Expert shares some causes - The Indian Express", "description": "Missing your periods regularly? Expert shares some causes", "url": "https://indianexpress.com/web-stories/wellness/missing-your-periods-regularly/", "urlToImage": null, "publishedAt": "2022-06-16T10:00:11Z", "content": "Hormones like estrogen and progesterone can disrupt your period pattern. This can be due to several lifestyle issues,\" nutritionist Nidhi S took wrote on Instagram. Check out causes here:"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Than 500 Confirmed Monkeypox Cases In Britain: Report - NDTV", "description": "The number of monkeypox cases in Britain exceeded 500 cases on Wednesday, according to the latest official figures.", "url": "https://www.ndtv.com/world-news/more-than-500-confirmed-monkeypox-cases-in-britain-report-3071996", "urlToImage": "https://c.ndtvimg.com/2022-05/iagsqfo_monkeypox-reuters_625x300_28_May_22.jpg", "publishedAt": "2022-06-16T09:40:23Z", "content": "Monkeypox Virus: 52 cases were reported in Britain raising the total to 524 as of Tuesday.\r\nLondon: The number of monkeypox cases in Britain exceeded 500 cases on Wednesday, according to the latest o… [+1162 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Facts about Ramsay Hunt Syndrome: Tips to treat this rare neurological disorder - Hindustan Times", "description": "Are you diagnosed with Ramsay Hunt Syndrome? Then, it will require prompt management. Here's all you need to know about the right kind of treatment that can help one to improve the quality of life once you spot these signs and symptoms of this rare neurologic…", "url": "https://www.hindustantimes.com/photos/lifestyle/facts-about-ramsay-hunt-syndrome-tips-to-treat-this-rare-neurological-disorder-101655368978919.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/16/1600x900/FVQVsVfXsAEioHl_1655369471887_1655370446837.jpg", "publishedAt": "2022-06-16T09:10:56Z", "content": "Are you diagnosed with Ramsay Hunt Syndrome? Then, it will require prompt management. Here's all you need to know about the right kind of treatment that can help one to improve the quality of life on… [+1686 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "AI framework overcomes segmentation challenges for online adaptive radiotherapy – Physics World - physicsworld.com", "description": "A registration-guided deep-learning framework edits cone-beam CT contours for online adaptive radiation therapy", "url": "https://physicsworld.com/a/ai-framework-overcomes-segmentation-challenges-for-online-adaptive-radiotherapy/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/06/radiation-treatment-iStock_Mark-Kostich.jpg", "publishedAt": "2022-06-16T09:09:00Z", "content": "Overcoming the obstacles: Adaptive radiotherapy (ART), especially online ART, effectively accounts for positioning errors and anatomical changes during radiation treatments. A new deep-learning model… [+5028 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Mrityunjay Bose", "title": "Covid-19 can adversely impact male fertility: Study - Deccan Herald", "description": "Covid-19 infection can adversely impact male fertility by dysregulating vital genes and proteins involved in male reproduction, according to a study by Jaslok Hospital and Indian Institute of Technology-Bombay. The first-of-its-kind study research conducted b…", "url": "https://www.deccanherald.com/science-and-environment/covid-19-can-adversely-impact-male-fertility-study-1118610.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/06/16/istock-650097590-1-1118610-1655370272.jpg", "publishedAt": "2022-06-16T09:04:32Z", "content": "Covid-19 infection can adversely impact male fertility by dysregulating vital genes and proteins involved in male reproduction, according to a study by Jaslok Hospital and Indian Institute of Technol… [+1962 chars]"}, {"source": {"id": null, "name": "The Japan Times"}, "author": "Alex Jackson", "title": "Dengue fever a growing threat in Asia - The Japan Times", "description": "Worldwide, the disease is estimated to infect about 390 million people every year, with more than half of the global population now at risk.", "url": "https://www.japantimes.co.jp/news/2022/06/16/asia-pacific/science-health-asia-pacific/dengue-fever-asia/", "urlToImage": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2022/06/np_file_164556-870x489.jpeg", "publishedAt": "2022-06-16T08:31:54Z", "content": "For Kasun Chameera, who lives in Sri Lankas densely populated capital Colombo, dengue fever is a disease which has afflicted many loved ones, including his brother.\r\nWe fear death when we hear about … [+469 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "Soon you can just pop a pill instead of working out - Business Insider India", "description": "Finding it hard to exercise daily? How about popping a pill that could help replace your workouts? Science is closer to that goal, with researchers identifying", "url": "https://www.businessinsider.in/science/health/news/soon-you-can-just-pop-a-pill-instead-of-working-out/articleshow/92249642.cms", "urlToImage": "https://www.businessinsider.in/photo/92249642/soon-you-can-just-pop-a-pill-instead-of-working-out.jpg?imgsize=42348", "publishedAt": "2022-06-16T08:18:00Z", "content": "Finding it hard to exercise daily? How about popping a pill that could help replace your workouts? Science is closer to that goal, with researchers identifying a molecule in the blood that is produce… [+2642 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "10 food tips for regular and painless periods - Times of India", "description": "What you can do — besides stocking up on painkillers, or depending on heating pads— is shift your diet to include some foods that actually help.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/10-food-tips-for-regular-and-painless-periods/photostory/92250032.cms", "urlToImage": "https://static.toiimg.com/photo/92250060.cms", "publishedAt": "2022-06-16T08:12:54Z", "content": "Periods are the worst, but what’s worse is when they’re painful or don’t occur at all. The combination of cramps, bloating, and mood swings can make you want to dive face-first into an entire chocola… [+465 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Lifestyle Diseases That Put Your Heart at Risk - News18", "description": "It becomes extremely crucial to deeply learn about these sneaky health conditions, which can throw you off guard at any time.", "url": "https://www.news18.com/news/lifestyle/lifestyle-diseases-that-put-your-heart-at-risk-5378575.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/heart-attack-165425893016x9.jpg", "publishedAt": "2022-06-16T08:10:54Z", "content": "Heart attack and other cardiovascular diseases continue to remain one of the major health concerns across the globe. Time and again, we have been asked to make changes in our lifestyle in order to ma… [+2240 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Want to Quit Smoking? 5 Ways that Will Help You Resist Tobacco Craving - News18", "description": "Cigarette smoking can lead to lung cancer, heart disease, stroke, asthma and more", "url": "https://www.news18.com/news/lifestyle/want-to-quit-smoking-5-ways-that-will-help-you-resist-tobacco-craving-5369797.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/no-smoking-164672588116x9.jpg", "publishedAt": "2022-06-16T07:50:34Z", "content": "The urge of smoking can be strong because of the intense dependency that nicotine creates after smoking the first cigarette or consuming any other tobacco product. Cigarette smoking can lead to lung … [+1720 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Arpita Sarkar", "title": "Check Out Some Side Effects Of Vitamin B12 If Taken Excessively! - - Woman's Era", "description": "Womansera magazine is a platform for women to get latest info and tips on fashion, beauty, health and relationship advice. Subscribe to India's No.1 women's magazine!", "url": "https://womansera.com/check-out-some-side-effects-of-vitamin-b12-if-taken-excessively/", "urlToImage": "https://womansera.com/wp-content/uploads/2022/06/b12.jpg", "publishedAt": "2022-06-16T07:47:30Z", "content": "Around 47% of Indians suffer from vitamin deficiency and it is especially prevalent among those who have a vegetarian diet. Vitamin B12 is one of the essential elements of the body and many people no… [+1414 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI Press Release", "title": "61 per cent of total piles surgeries for men are in the age group of 26-40: Pristyn Care Mens Health Report - Business Standard", "description": "New Delhi [India], June 16 (ANI/NewsVoir): Social consciousness and increased health awareness are driving more young male adults to take preemptive measures for elective procedures like Gynecomastia surgeries and circumcision. On the occasion of", "url": "https://www.business-standard.com/content/press-releases-ani/61-per-cent-of-total-piles-surgeries-for-men-are-in-the-age-group-of-26-40-pristyn-care-men-s-health-report-122061600477_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-06/16/full/20220616101015.jpg", "publishedAt": "2022-06-16T07:30:07Z", "content": "New Delhi [India], June 16 (ANI/NewsVoir): Social consciousness and increased health awareness are driving more young male adults to take preemptive measures for elective procedures like Gynecomastia… [+5347 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Blood levels of ceramides predict diabetes remission among patients undergoing bariatric surgery - Medical Dialogues", "description": "Ceramides is a waxy, fat-like substance similar to cholesterol present in blood. A new test which...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/blood-levels-of-ceramides-predict-diabetes-remission-among-patients-undergoing-bariatric-surgery-94552", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/16/178704-surgery.jpg", "publishedAt": "2022-06-16T06:57:42Z", "content": "Ceramides is a waxy, fat-like substance similar to cholesterol present in blood. A new test which measures blood levels of ceramides can be used to assess the likelihood that a gastric bypass patient… [+4826 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Southern California: Stress accelerates aging of immune system, study finds - India Education Diary", "description": "Stress — in the form of traumatic events, job strain, everyday stressors and discrimination — accelerates aging of the immune system, potentially increasing a person’s risk of cancer, cardiovascular disease and illness from infections such as COVID-1", "url": "https://indiaeducationdiary.in/university-of-southern-california-stress-accelerates-aging-of-immune-system-study-finds/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Southern-California.jpg", "publishedAt": "2022-06-16T06:50:22Z", "content": "Stress in the form of traumatic events, job strain, everyday stressors and discrimination accelerates aging of the immune system, potentially increasing a persons risk of cancer, cardiovascular disea… [+4293 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Health Conditions That May Result in Unintentional Weight Loss - News18", "description": "Unintentional weight loss can be distressing, particularly when you lose a relatively significant amount and do not know why.", "url": "https://www.news18.com/news/lifestyle/5-health-conditions-that-may-result-in-unintentional-weight-loss-5377597.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/untitled-design-4-17-164881719116x9.png", "publishedAt": "2022-06-16T06:49:26Z", "content": "Weight loss achieved after following a proper diet plan and workout routine is appreciated. However, weight loss becomes a matter of concern if it happens without any such effort. Unintentional weigh… [+2106 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "Can HIV-AIDS be cured? Preliminary results of vaccine say yes - Asianet Newsable ", "description": "The study's findings were published in the journal Nature, and the antibodies were described as safe, powerful, and scalable, which may be relevant not just to infectious disorders but also in the treatment of noncommunicable ailments, such as cancer and auto…", "url": "https://newsable.asianetnews.com/science/can-hiv-aids-be-cured-preliminary-results-of-vaccine-say-yes-gcw-rdk42p", "urlToImage": "https://static-ai.asianetnews.com/images/01cq3qytc0qm40wdz8nxsv5bjc/hiv_aids_1200x630xt.jpg", "publishedAt": "2022-06-16T06:38:35Z", "content": "The study's findings were published in the journal Nature, and the antibodies were described as \"safe, powerful, and scalable, which may be relevant not just to infectious disorders but also in the t… [+2041 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Men’s Health Week: From vitamin D to magnesium, supplements that males need after 40 - Economic Times", "description": "Here are 4 supplements that men should consider taking after they turn 40.", "url": "https://economictimes.indiatimes.com/magazines/panache/mens-health-week-from-vitamin-d-to-magnesium-supplements-that-males-need-after-40/articleshow/92246977.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92247174,width-1070,height-580,imgsize-1527916,overlay-etpanache/photo.jpg", "publishedAt": "2022-06-16T06:32:00Z", "content": "Long work hours, stress, smoking and drinking habits there are many factors that affect mens health adversely. However, by the time they turn 40, if they have not learnt to manage their health relate… [+2102 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen Mary University of London: More than a quarter of people with asthma are still over-using rescue inhalers – putting them at increased risk of severe attacks and hospitalisation - India Education Diary", "description": "Overuse of these inhalers is linked to an increased risk of hospital admissions and severe asthma attacks. They also found that prescribing varies between GP practices, with some overprescribing rescue inhalers to 6% of their asthma patients and some", "url": "https://indiaeducationdiary.in/queen-mary-university-of-london-more-than-a-quarter-of-people-with-asthma-are-still-over-using-rescue-inhalers-putting-them-at-increased-risk-of-severe-attacks-and-hospitalisation/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/03/Queen-Mary-University-of-London.jpg", "publishedAt": "2022-06-16T06:19:31Z", "content": "Overuse of these inhalers is linked to an increased risk of hospital admissions and severe asthma attacks. They also found that prescribing varies between GP practices, with some overprescribing resc… [+3253 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Weight Loss Diet: Try Plant-Based Diet Plan to Keep Your Weighing Scale in Check - India.com", "description": "A plant-based diet for weight loss: Trying to lose weight? Try this vegetarian diet to reach your weight loss goal. Abhishek Gagneja explains why a plant-based diet is good for your health.", "url": "https://www.india.com/lifestyle/weight-loss-diet-try-plant-based-diet-plan-to-keep-your-weighing-scale-in-check-5456497/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/12/pjimage-59-1.jpg", "publishedAt": "2022-06-16T05:54:27Z", "content": "Weight Loss Diet: The adequate intake of protein, an important macronutrient, in the everyday diet is often grossly undermined and neglected: over 70 per cent of the countrys population is protein de… [+4007 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Best Tips to Lose Weight Quickly of 2022 June - bollyinside - BollyInside", "description": "This list is about the Best Tips to Lose Weight Quickly. We will try our best so that you understand this list Best Tips to Lose Weight Quickly. I hope", "url": "https://www.bollyinside.com/articles/best-tips-to-lose-weight-quickly/", "urlToImage": "https://www.bollyinside.com/articles/wp-content/uploads/sites/4/2022/06/Best-Tips-to-Lose-Weight-Quickly.jpg", "publishedAt": "2022-06-16T04:23:13Z", "content": "This list is about the Best Tips to Lose Weight Quickly. We will try our best so that you understand this list Best Tips to Lose Weight Quickly. I hope you like this list Best Tips to Lose Weight Qui… [+8879 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Men’s Health after 40 - Times of India", "description": "Being healthy is important for all ages of life. Like  women, Man also undergoes changes from childhood. This inclu", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/mens-health-after-40/articleshow/92228573.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92228527,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-43676/92228527.jpg", "publishedAt": "2022-06-16T03:30:00Z", "content": "Being healthy is important for all ages of life. Like women, Man also undergoes changes from childhood. This includes Physical and Hormonal changes. Also Men undergo more stress compare to women duri… [+4754 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Explainer: Why WHO is probing if Monkeypox needs global health emergency tag - Times of India", "description": "India News: The World Health Organization is convening a meeting of experts on June 23 to decide whether monkeypox needs to be declared a global health emergency", "url": "https://timesofindia.indiatimes.com/india/why-who-is-probing-if-monkeypox-needs-global-health-emergency-tag/articleshow/92242475.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92243263,width-1070,height-580,imgsize-67838,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-16T03:17:00Z", "content": ""}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Covid-19 fourth wave scare: Researchers identify more than 1,000 genes linked to severe Covid-19 - Zee News", "description": "An international team of researchers has discovered specific genetic signals in people who develop severe coronavirus infection.", "url": "https://zeenews.india.com/world/covid-19-fourth-wave-scare-researchers-identify-more-than-1000-genes-linked-to-severe-covid-19-2474307.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/16/1054322-covid-4.jpg", "publishedAt": "2022-06-16T03:14:33Z", "content": "New York: An international team of researchers has discovered specific genetic signals in people who develop severe coronavirus infection. Using machine learning, researchers from the University of S… [+2493 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Monkeypox virus in semen? WHO probes if it`s a sexually transmitted disease - WION", "description": "Since early May, more than 1,300 cases of the viral sickness have been documented from over 30 nations. The majority of cases have been documented among guys who have had sex with other men.The virus is infrequently encountered outside of Africa, where it is …", "url": "https://www.wionews.com/world/monkeypox-virus-in-semen-who-probes-if-its-a-sexually-transmitted-disease-488597", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/26/265363-monkeypox-1.jpg", "publishedAt": "2022-06-16T03:13:56Z", "content": "The World Health Organization (WHO) is investigating allegations that the monkeypox virus is present in the semen of patients, with the goal of determining if the disease may be transferred sexually,… [+1809 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN World Desk", "title": "Monkeypox: WHO considers renaming virus to avoid discrimination - Times Now", "description": "Tedros Adhanom Ghebreyesus, the WHO’s Director-General said the organisation is “working with partners and experts from around the world on changing the name of the monkeypox virus, its clades and the disease it causes”. An announcement on the new name of mon…", "url": "https://www.timesnownews.com/world/monkeypox-who-considers-renaming-virus-to-avoid-discrimination-article-92242248", "urlToImage": "https://static.tnn.in/thumb/msid-92242248,imgsize-100,width-1280,height-720,resizemode-75/92242248.jpg", "publishedAt": "2022-06-16T02:52:12Z", "content": "The move comes after about 30 scientists from 11 countries called for a need to cut discriminatory language used to differentiate the monkeypox virus in a report released last week. (Representative i… [+4 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "Long Covid to blame for acute hepatitis cases in kids, reveals study - India TV News", "description": "Post-Covid liver injuries have been increasingly reported among adults as well. Similarly, two Indian studies also reported acute hepatitis among children during pandemic.", "url": "https://www.indiatvnews.com/health/long-covid-to-blame-for-acute-hepatitis-cases-in-kids-reveals-study-2022-06-16-784913", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/06/covid-5-1655346544.jpg", "publishedAt": "2022-06-16T02:29:49Z", "content": "Long Covid may be responsible for the global acute hepatitis in kids that has so far no known cause, suggests a study. According to the World Health Organisation (WHO), the mysterious case of acute h… [+2794 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: Study done for over a year says intermittent fasting is not that beneficial; know why - Times of India", "description": "Of the several ways to lose weight, the one that comes directly from celebrities is intermittent fasting. This is one of the main reasons why many people are so keen to try it.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-study-done-for-over-a-year-says-intermittent-fasting-is-not-that-beneficial-know-why/photostory/92230175.cms", "urlToImage": "https://static.toiimg.com/photo/92230465.cms", "publishedAt": "2022-06-16T01:30:00Z", "content": "Of the several ways to lose weight, the one that comes directly from celebrities is intermittent fasting. This is one of the main reasons why many people are so keen to try it.\r\nHowever, weight loss … [+700 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Drug combinations may help to slow the progression of diabetic kidney disease - News-Medical.Net", "description": "A mouse study led by Washington University School of Medicine in St. Louis suggests that combining SGLT2 inhibitors — a newer class of diabetes medications that lowers blood sugar — with older diabetes drugs may help to slow the progression of diabetic kidney…", "url": "https://www.news-medical.net/news/20220615/Drug-combinations-may-help-to-slow-the-progression-of-diabetic-kidney-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/12/3D_rendered_illustration_human_kidneys_-_Sebastian_Kaulitzki_0ca56cd511b54712b78c51b21af2a530-620x480.jpg", "publishedAt": "2022-06-16T00:51:00Z", "content": "A mouse study led by Washington University School of Medicine in St. Louis suggests that combining SGLT2 inhibitors — a newer class of diabetes medications that lowers blood sugar — with older diabet… [+5306 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "São Paulo confirms 3rd case in the state - Play Crazy Game", "description": "The São Paulo State Health Department confirmed today a third case of monkeypox in the state. According to the folder, the patient is a 31-year-old man admitted to the Instituto de Infectologia Emílio Ribas, in São Paulo, with \"a good clinical picture\".Today …", "url": "https://playcrazygame.com/2022/06/16/sao-paulo-confirms-3rd-case-in-the-state/", "urlToImage": "https://conteudo.imguol.com.br/c/entretenimento/20/2022/06/04/variola-dos-macacos-1654349085550_v2_615x300.jpg", "publishedAt": "2022-06-16T00:15:25Z", "content": "The São Paulo State Health Department confirmed today a third case of monkeypox in the state. According to the folder, the patient is a 31-year-old man admitted to the Instituto de Infectologia Emíli… [+4345 chars]"}, {"source": {"id": null, "name": "The List"}, "author": "Kate Hagan Gallup", "title": "The Results Of A New Study On Women's Exercise Routines Might Surprise You - The List", "description": "We all know that exercise is part of a healthy lifestyle. A new study revealed that different exercise routines can yield different results across genders.", "url": "https://www.thelist.com/897380/the-results-of-a-new-study-on-womens-exercise-routines-might-surprise-you/", "urlToImage": "https://www.thelist.com/img/gallery/the-results-of-a-new-study-on-womens-exercise-routines-might-surprise-you/l-intro-1655333175.jpg", "publishedAt": "2022-06-15T23:05:00Z", "content": "This study, as shared by Medical News Today, focused on times of day and not types of exercise, eliminating variables such as exercise equipment mistakes or different diets. The 56 participants aged … [+1079 chars]"}, {"source": {"id": null, "name": "Edtimes.in"}, "author": "https://www.facebook.com/rups.jones", "title": "Unwanted Weight Gain And Mental Hygiene – Are They Connected? - ED Times", "description": "Unwanted weight gain - something that troubles a lot my friends and acquaintances. In some cases a sedentary or an unhealthy lifestyle", "url": "https://edtimes.in/unwanted-weight-gain-and-mental-hygiene-are-they-connected/", "urlToImage": "https://edtimes.in/wp-content/uploads/2022/06/jpg_20220615_180639_0000.jpg", "publishedAt": "2022-06-15T21:48:37Z", "content": "Unwanted weight gain – something that troubles a lot my friends and acquaintances. In some cases a sedentary or an unhealthy lifestyle is to be blamed. Some other cases of unwanted weight gain, howev… [+3947 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Sharma", "title": "India studies how to tackle monkeypox | Mint - Mint", "description": "The move follows the interim advisory of the World Health Organization (WHO) recommending smallpox vaccines for monkeypox.", "url": "https://www.livemint.com/news/world/india-studies-how-to-tackle-monkeypox-11655317487177.html", "urlToImage": "https://images.livemint.com/img/2022/06/15/600x338/WHO-Monkeypox-0_1655293796433_1655317597802.jpg", "publishedAt": "2022-06-15T18:27:18Z", "content": "Scientists and the department of Immunization will brainstorm if there is any need for monkeypox vaccinations in India at the moment, given the country-specific epidemiology of the disease."}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Claims of poliovirus detected in Kolkata sewage sample not true: Official Sources - ThePrint", "description": "By Shalini Bhardwaj New Delhi [India], June 15 (ANI): Government officials on Wednesday refuted media reports that claimed the presence of vaccine-derived poliovirus in the sample of sewage waters in Kolkata. “Some media reports have claimed that polio virus …", "url": "https://theprint.in/india/claims-of-poliovirus-detected-in-kolkata-sewage-sample-not-true-official-sources/998470/", "urlToImage": null, "publishedAt": "2022-06-15T18:16:12Z", "content": "By Shalini Bhardwaj\r\nNew Delhi [India], June 15 (ANI): Government officials on Wednesday refuted media reports that claimed the presence of vaccine-derived poliovirus in the sample of sewage waters i… [+1058 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Julie Upton, MS, RD, CSSD", "title": "4 Surprising Effects of Drinking Milk, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "While many people associate milk with bone health, drinking this beverage is also linked to other health benefits. Read on to learn more.", "url": "http://www.eatthis.com/surprising-effects-drinking-milk/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/woman-drinking-milk.jpg?quality=82&strip=all", "publishedAt": "2022-06-15T15:05:54Z", "content": "There are many reasons why you may drink milk. It could be to improve your bone health, to improve heart health, reduce the risk of obesity, and more.\r\nEnjoying a cup or two of milk every day is one … [+5347 chars]"}, {"source": {"id": null, "name": "Sambadenglish.com"}, "author": "Sambad English Bureau", "title": "Explained: Why Omicron causing breakthrough infections among fully-vaccinated? - Sambad English", "description": "London: People infected with the Omicron variant show poor immune boosting against future SARS-CoV-2 infection, according to a study which may explain why breakthrough cases are happening even among those who are triple vaccinated.A \"breakthrough inf", "url": "https://sambadenglish.com/explained-why-omicron-causing-breakthrough-infections-among-fully-vaccinated/", "urlToImage": "https://sambadenglish.com/wp-content/uploads/2021/07/covid-vaccine-to-pregnant-women.jpg", "publishedAt": "2022-06-15T13:02:03Z", "content": "London: People infected with the Omicron variant show poor immune boosting against future SARS-CoV-2 infection, according to a study which may explain why breakthrough cases are happening even among … [+3163 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "High-risk pregnancy: Early signs that should not be ignored - Hindustan Times", "description": "A high-risk pregnancy is when the woman, her baby or both are at a risk of developing unexpected complications during pregnancy or childbirth. Dr Seema Sharma, Obstetrics & Gynecology, Apollo Cradle & Children Hospital, Moti Nagar on early signs of high-risk …", "url": "https://www.hindustantimes.com/photos/lifestyle/highrisk-pregnancy-early-signs-that-should-not-be-ignored-101655297447241.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/15/1600x900/pregnancy_2_1655297544169_1655297593953.jpg", "publishedAt": "2022-06-15T12:59:55Z", "content": null}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "5 check-ups every man needs - Ahmedabad Mirror", "description": "Most people underestimate the significance of regular examinations. Our hectic and unpredictable lifestyle frequently prevents us from seeking routine preventive care. People usually only come when they are seriously ill. In fact, health surveys show that men…", "url": "https://www.ahmedabadmirror.com/5-check-ups-every-man-needs/81835665.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1655295169548.jpg-org", "publishedAt": "2022-06-15T12:18:26Z", "content": "Most people underestimate the significance of regular examinations. Our hectic and unpredictable lifestyle frequently prevents us from seeking routine preventive care. People usually only come when t… [+4236 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Research Shows How New Nanoparticle May Help in Treating Human Cancers - AZoNano", "description": "The invention of a unique nanoparticle by Wake Forest University School of Medicine researchers has shown a possible new method of treating solid cancers. Cancers of the breast, head and neck, and colon all have solid tumors.", "url": "https://www.azonano.com/news.aspx?newsID=39269", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39269_16553013406171562.jpg", "publishedAt": "2022-06-15T12:11:00Z", "content": "The invention of a unique nanoparticle by Wake Forest University School of Medicine researchers has shown a possible new method of treating solid cancers. Cancers of the breast, head and neck, and co… [+3205 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Why you should take fatty liver seriously - India Today", "description": "Fatty liver disease is on a sharp rise among Indians. Here’s expert advice on how to manage it", "url": "https://www.indiatoday.in/india-today-insight/story/why-you-should-take-fatty-liver-seriously-1962805-2022-06-15", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Health_Liver_Care-647x363.jpeg?19m_.UsrbZywSy52zYlj1QNbSi4OvG8u", "publishedAt": "2022-06-15T12:04:50Z", "content": "Recent studies by The Indian National Association for Study of the Liver (INASL)-NAFLD Taskforce and Indian Consortium on NAFLD estimate that around 30-40 per cent of Indians suffer from fatty liver … [+1513 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Dr Sanjiv Kumar", "title": "As COVID-19 cases rise, vaccines play vital role to prevent mass hospitalization, adverse outcomes - Firstpost", "description": "Vaccines play a crucial role in preventing infection, hospitalizations, and adverse outcomes which cause deaths", "url": "https://www.firstpost.com/opinion/as-covid-19-cases-rise-vaccines-play-vital-role-to-prevent-mass-hospitalization-adverse-outcomes-10796841.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/02/Pfizer.jpg", "publishedAt": "2022-06-15T10:39:26Z", "content": "Vaccines play a crucial role in preventing infection, hospitalizations, and adverse outcomes which cause deaths\r\n Vaccination boosts the human bodys natural immune system, increasing the body's capac… [+3575 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "5 Nutritious Foods That Are Rich in Vitamin D - The Quint FIT", "description": "Vitamin D is essential for bodily functions and mainly for bone health. Sunlight is a great source of vitamin D. Food sources of vitamin D include mushrooms, fortified orange juice, milk, etc.", "url": "https://www.thequint.com/fit/five-foods-rich-in-vitamin-d-eggs-mushrooms", "urlToImage": "https://images.thequint.com/thequint%2F2022-06%2F2589e214-f579-4525-bebc-67bca0b0e268%2Ffoods_rich_in_vitamin_d_picture_id1323159523.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-15T10:23:48Z", "content": "Whole eggs are also a good source of vitamin D and are very nutritious.\r\nThe highest amount of protein in an egg is found in the white part, while the fat, vitamins, and minerals are found in the yol… [+485 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How months-long COVID infections could seed dangerous new variants - Nature Journal", "description": "Tracking SARS-CoV-2 evolution during persistent cases provides insight into the origins of Omicron and other global variants. What can scientists do with this knowledge?", "url": "https://www.nature.com/articles/d41586-022-01613-2?utm_medium=Social&utm_campaign=nature&utm_source=Twitter", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-01613-2/d41586-022-01613-2_23158538.gif", "publishedAt": "2022-06-15T09:03:00Z", "content": "These are mutations that accumulated in the spike protein of SARS-CoV-2 during a seven-month-long infection.Illustration by Nik Spencer/Nature; Source: Ref. 1\r\nVirologist Sissy Sonnleitner tracks nea… [+19376 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "WHO Director-General's opening remarks at the COVID-19 media briefing– 14 June 2022 - World - ReliefWeb", "description": "English News and Press Release on World about Health and Epidemic; published on 14 Jun 2022 by WHO", "url": "https://reliefweb.int/report/world/who-director-generals-opening-remarks-covid-19-media-briefing-14-june-2022", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/disaster-type/EP.png", "publishedAt": "2022-06-15T08:44:59Z", "content": "Good morning, good afternoon and good evening,\r\nToday is World Blood Donor Day.\r\nBlood donations are a lifeline in emergencies, disasters, humanitarian crises, and for people who need regular transfu… [+6663 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "Monkeypox contact tracing tough with many unknown sexual partners: Report - India TV News", "description": "Nearly all (98 per cent) of the cases reported having sex with other men during the incubation period, with about half (44 per cent) reporting more than 10 sexual partners in the previous three months and group sex.", "url": "https://www.indiatvnews.com/health/monkeypox-contact-tracing-tough-with-many-unknown-sexual-partners-report-2022-06-15-784756", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/06/monkeypox-1-1655281066.jpg", "publishedAt": "2022-06-15T08:22:05Z", "content": "Tracing contacts of people infected with monkeypox virus is giving public health officials in the UK a hard time, with many having had unknown sexual partners in \"cruising grounds, sex clubs and duri… [+2299 chars]"}, {"source": {"id": null, "name": "Pelhamplus.com"}, "author": null, "title": "How can one treat Social Anxiety Disorder? - pelhamplus.com", "description": "Social anxiety disorder is a mental health condition that can make it difficult to interact with others. People with a social anxiety disorder may feel", "url": "https://www.pelhamplus.com/other/how-can-one-treat-social-anxiety-disorder/11698/", "urlToImage": "https://www.pelhamplus.com/wp-content/uploads/2022/06/Copy-of-Program-Flyers.png", "publishedAt": "2022-06-15T07:34:13Z", "content": "Social anxiety disorder is a mental health condition that can make it difficult to interact with others. People with a social anxiety disorder may feel anxious or uncomfortable in social situations, … [+3860 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Mediawire", "title": "Protect your family with flu vaccination before the onset of monsoons - Times of India", "description": "The expected heralding of monsoon conjures up the relief images from summer's scorching heat, drizzling rain, and t", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/protect-your-family-with-flu-vaccination-before-the-onset-of-monsoons/articleshow/92222410.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92222410,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-28733/92222410.jpg", "publishedAt": "2022-06-15T06:45:00Z", "content": "The expected heralding of monsoon conjures up the relief images from summer's scorching heat, drizzling rain, and the sound of clouds, revival of the natural beauty of trees and plants. However, the … [+4840 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New breast cancer drug delivers unprecedented levels of survival, stopping tumor growth - ThePrint", "description": "A trial of a newly approved breast cancer drug in patients who are not typically targeted by the drug resulted in extremely encouraging results never seen be...", "url": "https://www.youtube.com/watch?v=i0_ctkpARPU", "urlToImage": "https://i.ytimg.com/vi/i0_ctkpARPU/hqdefault.jpg", "publishedAt": "2022-06-15T06:29:08Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "8 Ways In Which Water Helps You Lose Weight - NDTV Doctor", "description": "It is necessary for us to consume water to maintain good health. In this article, we discuss ways in which drinking ample water promotes weight loss.", "url": "https://doctor.ndtv.com/living-healthy/8-ways-in-which-water-helps-you-lose-weight-2948712", "urlToImage": "https://i.ndtvimg.com/i/2018-02/drinking-water-boosts-metabolism_696x400_81518069706.jpg", "publishedAt": "2022-06-15T05:10:30Z", "content": "Does water help you lose weight?\r\nThe simple answer is yes, drinking ample water helps us lose weight. Whenever we want to lose weight, one of the most popular suggestions is to drink a lot of water.… [+4241 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Monkeypox outbreak: ‘Worried’ WHO calls emergency meeting - The Federal", "description": "The global outbreak of monkeypox is clearly unusual and concerning, says WHO Director-General Tedros Adhanom Ghebreyesus", "url": "https://thefederal.com/health/monkeypox-outbreak-worried-who-calls-emergency-meeting/", "urlToImage": "https://thefederal.com/wp-content/uploads/2022/05/Monkey-Pox.png", "publishedAt": "2022-06-15T00:50:28Z", "content": "The global outbreak of monkeypox is “clearly unusual and concerning”, WHO Director-General Tedros Adhanom Ghebreyesus said on Tuesday as he announced to convene an emergency committee next week to as… [+2939 chars]"}, {"source": {"id": null, "name": "Sharedhealthmb.ca"}, "author": null, "title": "Long COVID - Shared Health", "description": "Long COVID / Post COVID-19 Condition\n\n\n\nGetting back to life after COVID-19\n\n\n\nThe information to date indicates that most people will fully recover from their symptoms after testing positive for COVID-19.  However, for some, symptoms of COVID-19 can linger f…", "url": "https://sharedhealthmb.ca/patient-care/long-covid/", "urlToImage": null, "publishedAt": "2022-06-14T21:40:58Z", "content": "Getting back to life after COVID-19\r\nThe information to date indicates that most people will fully recover from their symptoms after testing positive for COVID-19.  However, for some, symptoms of COV… [+4155 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Health News Roundup: U.S. FDA advisers back authorization of Moderna COVID vaccine for ages 6-17; Air pollution cuts life expectancy by more than two years and more - Devdiscourse", "description": "Read more about Health News Roundup: U.S. FDA advisers back authorization of Moderna COVID vaccine for ages 6-17; Air pollution cuts life expectancy by more than two years and more on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/2073311-health-news-roundup-us-fda-advisers-back-authorization-of-moderna-covid-vaccine-for-ages-6-17-air-pollution-cuts-life-expe", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/23_12_2021_16_11_27_8166358.jpg?width=920&format=jpeg", "publishedAt": "2022-06-14T21:00:26Z", "content": "Following is a summary of current health news briefs.\r\nU.S. FDA advisers weigh ModernaCOVID vaccine heart risk for young men\r\nModerna's COVID-19 vaccine may have a higher risk of heart inflammation i… [+4674 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ted Bosworth", "title": "Prediabetes Is Linked Independently to Myocardial Infarction - Medscape", "description": "A history of prediabetes is a predictor of MI independent of any other risk factor, suggesting that screening efforts should increase.", "url": "https://www.medscape.com/viewarticle/975559", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220614_prediabetes_800x450.jpg", "publishedAt": "2022-06-14T16:47:13Z", "content": "Prediabetes is not only a predictor of diabetes and the cardiovascular complications that ensue, but it is also a risk factor by itself for myocardial infarction, according to data drawn from almost … [+5423 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Sugar.fit's diabetes prog receives accreditation from American Diabetes Association - BSI bureau", "description": "As per the analysis by American Diabetes Association, users showed a reduction in their overall weight, with outcomes affirming positive effects of behaviour change", "url": "https://www.biospectrumindia.com/news/20/21436/sugar-fits-diabetes-prog-receives-accreditation-from-american-diabetes-association.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/health_2_-21436.jpg", "publishedAt": "2022-06-14T15:37:03Z", "content": "As per the analysis by American Diabetes Association, users showed a reduction in their overall weight, with outcomes affirming positive effects of behaviour change\r\nHealth tech startup Sugar.fit has… [+1125 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Empagliflozin does not improve contractile reserve in heart failure: Data from Empire HF trial - Medical Dialogues", "description": "Denmark: The addition of SGLT2 inhibitor empagliflozin to guideline-directed HF therapy for 12 weeks ...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/empagliflozin-does-not-improve-contractile-reserve-in-heart-failure-data-from-empire-hf-trial-94484", "urlToImage": "https://medicaldialogues.in/h-upload/2022/04/02/173376-heart-failure.jpg", "publishedAt": "2022-06-14T15:15:57Z", "content": "Denmark: The addition of SGLT2 inhibitor empagliflozin to guideline-directed HF therapy for 12 weeks did not improve left ventricular (LV) contractile reserve in patients with heart failure (HF) and … [+2483 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Incredible health benefits of moringa or drumstick as per Ayurveda - Hindustan Times", "description": "From treating hairfall, acne, anemia, vitamin deficiency, low immunity, arthritis, cough to asthma, moringa or drumstick has many amazing benefits.", "url": "https://www.hindustantimes.com/photos/lifestyle/incredible-health-benefits-of-moringa-or-drumstick-as-per-ayurveda-101655219258696.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/14/1600x900/drumstick_1_1655219312836_1655219348376.jpg", "publishedAt": "2022-06-14T15:14:05Z", "content": null}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "EXPLAINED | What ICMR Guidelines Say About Management Of Type 1 Diabetes - ABP Live", "description": "The Indian Council of Medical Research (ICMR) recently issued guidelines for the management of type 1 diabetes in India. This is the first time the ICMR has released guidelines for type 1 diabetes.", "url": "https://news.abplive.com/health/icmr-guidelines-say-about-management-of-type-1-diabetes-know-in-details-explained-1537303", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/14/568a953be9d5eaa3faa9a36035ee0424_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-06-14T15:10:32Z", "content": "The Indian Council of Medical Research (ICMR) recently issued guidelines for the management of type 1 diabetes in India. The research body released a 173-page document listing various ways to manage … [+17713 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Navigating food allergies with your kids - 9NEWS", "description": "9Health Expert Dr. Payal Kohli discusses common food allergies in kids, and what parents should do if their child has an allergic reaction. More local videos...", "url": "https://www.youtube.com/watch?v=dCr5MXrpJd8", "urlToImage": "https://i.ytimg.com/vi/dCr5MXrpJd8/maxresdefault.jpg", "publishedAt": "2022-06-14T14:25:48Z", "content": null}]}