{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Nigel Holt", "title": "People with personality disorders are more likely to sign up for psychology studies—here's why that's a problem - Medical Xpress", "description": "Many psychological studies rely on participants to give up their time to take part in experiments or complete questionnaires. They take part because they get paid or because they are required to as part of their university course. But, beyond this, not much i…", "url": "https://medicalxpress.com/news/2023-03-people-personality-disorders-psychology-studieshere.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/people-with-personalit.jpg", "publishedAt": "2023-03-14T18:06:30Z", "content": "Many psychological studies rely on participants to give up their time to take part in experiments or complete questionnaires. They take part because they get paid or because they are required to as p… [+6337 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Jigar Hindocha", "title": "Pune witnesses jump in H3N2 cases this year - Hindustan Times", "description": "Doctors, however, have stated that there is no need to panic as the situation is not life-threatening.", "url": "https://www.hindustantimes.com/cities/pune-news/pune-witnesses-jump-in-h3n2-cases-this-year-101678815440731.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/14/1600x900/This-virus-s-symptoms-are-similar-to-those-of-the-_1678815439753.jpg", "publishedAt": "2023-03-14T17:37:20Z", "content": "Pune: \r\nThis viruss symptoms are similar to those of the common flu. H3N2 influenza infection symptoms include cold, fever, cough, and diarrhoea. (REPRESENTATIVE PIC)\r\nThe presence of 22 H3N2 patient… [+1934 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study paves way for developing effective ASO therapies for brain diseases with fewer side effects - News-Medical.Net", "description": "A promising therapy for a range of brain diseases involves antisense oligonucleotides (ASOs)-;specialized molecules that can modulate RNA and alter protein production-;directly injected into the cerebrospinal fluid, in the space around the brain and spinal co…", "url": "https://www.news-medical.net/news/20230314/Study-paves-way-for-developing-effective-ASO-therapies-for-brain-diseases-with-fewer-side-effects.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Calcium-620x480.jpg", "publishedAt": "2023-03-14T16:53:00Z", "content": "A promising therapy for a range of brain diseases involves antisense oligonucleotides (ASOs)-; specialized molecules that can modulate RNA and alter protein production-; directly injected into the ce… [+3099 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study finds detrimental effects extra pounds on young people - ThePrint", "description": "California [US], March 14 (ANI): A Kaiser Permanente study showed that over 8,00,000 young kids aged 3 to 17 found that those in the upper range of typical weight had a 26 per cent greater chance of developing hypertension than those closer to the average wei…", "url": "https://theprint.in/health/study-finds-detrimental-effects-extra-pounds-on-young-people/1443573/", "urlToImage": null, "publishedAt": "2023-03-14T15:13:38Z", "content": "California [US], March 14 (ANI): A Kaiser Permanente study showed that over 8,00,000 young kids aged 3 to 17 found that those in the upper range of typical weight had a 26 per cent greater chance of … [+2722 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "5 Low-Sodium Food Items For Healthy Heart - Slurrp", "description": "High sodium intake can cause hypertension, heart disease, and stroke. Moreover, it may result in calcium losses, some of which may come from bone. Here are some low sodium food items for a happy heart.", "url": "https://www.slurrp.com/article/5-low-sodium-food-items-for-healthy-heart-1678806174820", "urlToImage": "https://images.slurrp.com/prodarticles/1rejmoom2yk.webp", "publishedAt": "2023-03-14T15:12:59Z", "content": "High sodium intake can cause hypertension, heart disease, and stroke. Moreover, it may result in calcium losses, some of which may come from bone. Here are some low sodium food items for a happy hear… [+2870 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Her Doctor Said Her Illness Was All in Her Head. This Scientist Was Determined to Find the Truth. - Finnoexpert", "description": "Unable to find a mentor interested in hyperemesis, Dr. Fejzo took a job studying ovarian cancer at the university, a position she stayed in, mostly part-time,", "url": "https://finnoexpert.com/2023/03/14/her-doctor-said-her-illness-was-all-in-her-head-this-scientist-was-determined-to-find-the-truth/", "urlToImage": "https://static01.nyt.com/images/2023/03/07/multimedia/00FEJZO-PROFILE2-gqbj/00FEJZO-PROFILE2-gqbj-facebookJumbo-v2.jpg", "publishedAt": "2023-03-14T15:08:15Z", "content": "Unable to find a mentor interested in hyperemesis, Dr. Fejzo took a job studying ovarian cancer at the university, a position she stayed in, mostly part-time, for 20 years. But she began piecing toge… [+3099 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "IANS", "title": "Odisha intensifies surveillance for H3N2 virus - OTV News", "description": "\"The H3N2 has similar symptoms of cold, cough and fever like Covid-19 and other adenovirus. In view of the prevailing situation, we have strengthened our surveillance system through district-level disease surveillance units to identify H3N2 cases,\" said direc…", "url": "https://odishatv.in/news/health/odisha-intensifies-surveillance-for-h3n2-virus-199184", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1678806448.webp", "publishedAt": "2023-03-14T15:08:11Z", "content": "The Odisha government has intensified its ILI (influenza-like illness) and SARI (severe acute respiratory infections) surveillance system following detection of 59 H3N2 cases, a health official said … [+2039 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: Effective home remedies to manage blood sugar levels - Hindustan Times", "description": "Apart from regular exercise, medication, balanced diet and proper sleep, here are some natural home remedies you can try to manage diabetes. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-effective-home-remedies-to-manage-blood-sugar-levels-101678805176050.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/14/1600x900/hgfd_1678520188936_1678805660582_1678805660582.jpg", "publishedAt": "2023-03-14T14:55:48Z", "content": "Covid is almost over, but the next pandemic, as rightly said by many health experts, could be that of chronic illnesses. Diabetes is the worst concern among all as the metabolic disorder is growing r… [+5841 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gut Health: 5 Tips To Deal With Travel Constipation - NDTV", "description": "Through her Instagram reel, nutritionist Lovneet Batra shares 5 tips that might help overcome constipation caused by travelling.", "url": "https://www.ndtv.com/health/gut-health-5-tips-to-deal-with-travel-constipation-3860673", "urlToImage": "https://c.ndtvimg.com/2022-10/f0crkp6g_constipation-causes-in-hindi_625x300_18_October_22.jpg", "publishedAt": "2023-03-14T14:02:34Z", "content": "Constipation from travel or vacation occurs when you find yourself unexpectedly unable to pass stool on time, whether it lasts for a few hours or several days. Several factors, such as a sudden chang… [+2114 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Amyl Guard Reviews (URGENT CONSUMER REPORT) Safe Nutraville Weight Loss Supplement? Ingredients & Official Website! - mid-day.com", "description": "Amyl Guard Amylase Inhibitor is a risk-free weight loss supplement that targets the real root cause of stubborn belly fat.", "url": "https://www.mid-day.com/brand-media/article/amyl-guard-reviews-urgent-consumer-report-safe-nutraville-weight-loss-23275259", "urlToImage": "https://images.mid-day.com/images/images/2023/mar/Amyl-Gaurd1_d.jpg", "publishedAt": "2023-03-14T13:43:00Z", "content": "Amyl Guard Amylase Inhibitor is a risk-free weight loss supplement that targets the real root cause of stubborn belly fat.\r\nOfficial Website: Click Here\r\nWhat is Amyl Guard?\r\nAmyl Guard is an all-new… [+10345 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "Mediterranean Diet Rich In Seafood, Fruits And Nuts May Reduce Dementia Risk By Up To 23%: UK Study - ABP Live", "description": "A Mediterranean diet that has a high intake of healthy plant-based foods may be an important intervention to incorporate into future strategies to reduce dementia risk.", "url": "https://news.abplive.com/science/mediterranean-diet-rich-in-seafood-fruits-and-nuts-may-reduce-dementia-risk-by-up-to-23-percent-uk-study-1588348", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/14/ad6d88649bb44ca55858ae3dd15ed4481678789611858324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-03-14T13:40:45Z", "content": "Consumption of a Mediterranean-like diet rich in foods such as seafood, fruit and nuts may help lower the risk of dementia by up to 23 per cent, according to a new study published in the BMC Medicine… [+3623 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Novel genes linked to risk of schizophrenia identified - Daijiworld.com", "description": "New York, Mar 14 (IANS): Researchers have identified genes that carry the risk for schizophrenia, an advance that may lead to new therapeutics.\r\nSchizophrenia is among the most serious mental illnesses. It occurs in about 1 out of every 100 people, and affect…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1060036", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-03-14T13:40:00Z", "content": "New York, Mar 14 (IANS): Researchers have identified genes that carry the risk for schizophrenia, an advance that may lead to new therapeutics.\r\nSchizophrenia is among the most serious mental illness… [+2014 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "Bhadra Gogoi", "title": "Nagaland reports 723 cases of influenza-like illnesses - Northeast Now", "description": "The Nagaland health and family welfare department on Tuesday said, as per the available data, there are 723 reported cases of acute respiratory infections or influenza-like illnesses and 37 cases of severe acute respiratory infections in the state.", "url": "http://nenow.in/north-east-news/nagaland/nagaland-reports-723-cases-of-influenza-like-illnesses.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/03/sterilization-equipment-4969975_1280.jpg", "publishedAt": "2023-03-14T13:35:06Z", "content": "Dimapur: The Nagaland health and family welfare department on Tuesday said, as per the available data, there are 723 reported cases of acute respiratory infections or influenza-like illnesses and 37 … [+2200 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/prashasti-sudhakarzeemedia-esselgroup-com/", "title": "Benefits Of Cucumber: Weight Loss To Flawless Skin, Reasons Why You Must Add Kheera In Your Summer Diet | Wat - India.com", "description": "Cucumbers detoxify your body and hydrates it from within and also keeps you fresh and healthy. It has 95% water which removes toxins from our body and also works as a body cleanser thereby clearing waste products from body.", "url": "https://www.india.com/video-gallery/benefits-of-cucumber-weight-loss-to-flawless-skin-reasons-why-you-must-add-kheera-in-your-summer-diet-watch-video-5943528/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/03/ucmber-benefits.jpg", "publishedAt": "2023-03-14T13:17:22Z", "content": "Cucumbers detoxify your body and hydrates it from within and also keeps you fresh and healthy. It has 95% water which removes toxins from our body and also works as a body cleanser thereby clearing w… [+682 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Statins may lower heart disease in people with sleep apnea: Study - ANI News", "description": "According to a new study by Columbia University researchers, cholesterol-lowering medicines known as statins have the potential to minimise heart disease in persons with obstructive sleep apnea regardless of whether they use CPAP equipment at night.", "url": "https://www.aninews.in/news/health/statins-may-lower-heart-disease-in-people-with-sleep-apnea-study20230314184735", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230314131525.jpg", "publishedAt": "2023-03-14T13:17:00Z", "content": "New York [US], March 14 (ANI): According to a new study by Columbia University researchers, cholesterol-lowering medicines known as statins have the potential to minimise heart disease in persons wit… [+2965 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Longevity Activator Reviews - Should You Buy Zenith Labs Longevity Supplement or Scam? - Deccan Herald", "description": "ongevity Activator is a day-to-day supplement that aids people in restoring their youthful appearance as well as their activity levels. It is simple to use every day, however, using it with an appetite that is full is crucial to ensure maximum absorption. Wha…", "url": "https://www.deccanherald.com/brandspot/pr-spot/longevity-activator-reviews-should-you-buy-zenith-labs-longevity-supplement-or-scam-1200121.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200121-1678799254.png", "publishedAt": "2023-03-14T13:07:34Z", "content": "ongevity Activator is a day-to-day supplement that aids people in restoring their youthful appearance as well as their activity levels. It is simple to use every day, however, using it with an appeti… [+26610 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "ExoBurn Reviews - Should You Buy This Secret Weight Loss Formula? - Deccan Herald", "description": "There's nothing more annoying than flabby belly fat or jiggly love handles. They can cause you to feel less confident and can cause anxiety and depression. However, there are methods to control excess weight and eliminate it completely. Exercise and diet plan…", "url": "https://www.deccanherald.com/brandspot/pr-spot/exoburn-reviews-should-you-buy-this-secret-weight-loss-formula-1200116.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200116-1678798583.png", "publishedAt": "2023-03-14T12:56:23Z", "content": "There's nothing more annoying than flabby belly fat or jiggly love handles. They can cause you to feel less confident and can cause anxiety and depression. However, there are methods to control exces… [+29683 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "HemoGlutrix Blood Sugar Reviews - Advanced Blood Sugar Formula for Enhanced Wellness or Scam? - Deccan Herald", "description": "HemoGlutrix HemoGlutrix HTML0 is an nutritional supplement that is designed to assist in the control of blood pressure and sugar levels, while also promoting healthy blood flow. Nature's Boost has sold over 1 million bottles, which means you can trust it to m…", "url": "https://www.deccanherald.com/brandspot/pr-spot/hemoglutrix-blood-sugar-reviews-advanced-blood-sugar-formula-for-enhanced-wellness-or-scam-1200112.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200112-1678798180.png", "publishedAt": "2023-03-14T12:49:40Z", "content": "HemoGlutrix HemoGlutrix HTML0 is an nutritional supplement that is designed to assist in the control of blood pressure and sugar levels, while also promoting healthy blood flow. Nature's Boost has so… [+17037 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "How to have a healthy gut this summer - India Today", "description": "Excessive heat can cause gut issues, especially if you're not taking the right precautions.", "url": "https://www.indiatoday.in/health/story/how-to-have-a-healthy-gut-this-summer-2346565-2023-03-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/gut_health_issues-sixteen_nine.png?VersionId=EtLNUp1vpRIKkxH5CWpwt23OUHaNp_OM", "publishedAt": "2023-03-14T12:39:37Z", "content": "By Daphne Clarance: With the sudden soar in temperatures, experts are urging people to take measures to enjoy a healthy summer this year. The centre issued a set of guidelines as the country witnesse… [+2459 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Powher Reviews: Women's Pre-Workout, Fat Burner & Multivtamin Supplements - Deccan Herald", "description": "Powher is a collection of nutritional supplements targeted at women who wish to increase their fitness to the next stage. Powher provides a pre-workout regimen with multivitamins, as well as a formula to cut weight. Does Powher live up the hype? What is the p…", "url": "https://www.deccanherald.com/brandspot/pr-spot/powher-reviews-womens-pre-workout-fat-burner-multivtamin-supplements-1200107.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200107-1678797196.png", "publishedAt": "2023-03-14T12:33:16Z", "content": "Powher is a collection of nutritional supplements targeted at women who wish to increase their fitness to the next stage. Powher provides a pre-workout regimen with multivitamins, as well as a formul… [+21022 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Lean Belly 3X Reviews - Ingredients Side Effects Risk, Customer Complaints - Deccan Herald", "description": "What is the Lean Belly 3X Weight Loss Supplement? If you've tried to shed weight but aren't succeeding with your efforts We have a solution for you that may assist. Our team searched for most effective supplement for losing weight that can assist you shed wei…", "url": "https://www.deccanherald.com/brandspot/pr-spot/lean-belly-3x-reviews-ingredients-side-effects-risk-customer-complaints-1200105.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200105-1678796715.png", "publishedAt": "2023-03-14T12:25:15Z", "content": "What is the Lean Belly 3X Weight Loss Supplement?\r\nIf you've tried to shed weight but aren't succeeding with your efforts We have a solution for you that may assist. Our team searched for most effect… [+25789 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Swine Flu cases along with H3N2 virus on the rise in India; Central government warns to be alert - India TV News", "description": "The H3N2 virus is already wreaking havoc in the country and now swine flu is also spreading rapidly along with it. The Central Government and the Health Ministry have alerted the people. Read on to know more.", "url": "https://www.indiatvnews.com/health/swine-flu-cases-along-with-h3n2-virus-on-the-rise-in-india-central-government-warns-to-be-alert-2023-03-14-854524", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/03/asddssdddsdddsdfddddsssddsssd-1678795459.jpg", "publishedAt": "2023-03-14T12:15:47Z", "content": "While the influenza A subtype H3N2 virus is the dominant virus in India, cases of swine flu or the H1N1 virus are rapidly increasing across the country.  By March, there were widespread cases of the … [+2141 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Scientists highlight need to identify viruses before they cause future pandemics - News9 LIVE", "description": "Scientists have proposed a four-step procedure to identify viruses before they jump to humans", "url": "https://www.news9live.com/science/scientists-highlight-need-to-identify-viruses-before-they-cause-future-pandemics-au941-2075229", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/03/1920_20768897040-f05e1f8d3b-o.jpg", "publishedAt": "2023-03-14T12:00:24Z", "content": "Scientists have proposed a four-step procedure to identify viruses before they jump to humans\r\n<ul><li>The approach will allow humanity to be more prepared to tackle future pandemics. </li><li>We nee… [+2471 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Detox Tea Cleanse Products for Weight Loss Reviewed - Deccan Herald", "description": "Detox tea is one type of tea made of herbs and is believed to aid in our body's naturally detoxification process. The tea's ingredients could help to rid the body of toxins, promote the digestion process, and increase the level of energy. The most common ingr…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-detox-tea-cleanse-products-for-weight-loss-reviewed-1200096.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200096-1678795109.png", "publishedAt": "2023-03-14T11:58:29Z", "content": "Detox tea is one type of tea made of herbs and is believed to aid in our body's naturally detoxification process. The tea's ingredients could help to rid the body of toxins, promote the digestion pro… [+35719 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "acxion precio - acxion ap precio - fentermina precio - acxion efectos secundarios - acxion plm - Deccan Herald", "description": "Yet, Acxion pills are becoming increasingly popular on various internet platforms. A majority of them are located in Mexico but there are a few that aren't. The purchase of Acxion Weight loss pills from such outlets is not legal and you can't be sure that you…", "url": "https://www.deccanherald.com/brandspot/pr-spot/acxion-precio-acxion-ap-precio-fentermina-precio-acxion-efectos-secundarios-acxion-plm-1200090.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1200090-1678793435.png", "publishedAt": "2023-03-14T11:30:35Z", "content": "Yet, Acxion pills are becoming increasingly popular on various internet platforms. A majority of them are located in Mexico but there are a few that aren't.\r\nThe purchase of Acxion Weight loss pills … [+19034 chars]"}, {"source": {"id": null, "name": "Idiva.com"}, "author": "Tanvi Nalin Shrivastava", "title": "Yoga Exercise For Ankle And Feet - iDiva.com", "description": "We often neglect our feet and ankles, but we don't realise just how important these parts are for our overall health.We usually don’t even realise the relevance of including exercices for our ankles and feet in our routine.Whether it is for runring, dancing, …", "url": "https://www.idiva.com/health-wellness/well-being/garland-pose-toe-squats-and-other-yoga-exercises-for-strong-feet-and-ankles/18053650", "urlToImage": "https://im.idiva.com/content/2023/Mar/social---2023-03-14T163349436_641054c99827b.png", "publishedAt": "2023-03-14T11:30:00Z", "content": "We often neglect our feet and ankles, but we don't realise just how important these parts are for our overall health.We usually dont even realise the relevance of including exercices for our ankles a… [+8873 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Oral Cancer: Causes, Symptoms And Preventions - News18", "description": "According to experts, cigarette smoking, consuming tobacco and gutkha are responsible for most oral cancer cases.", "url": "https://www.news18.com/lifestyle/oral-cancer-causes-symptoms-and-preventions-7291447.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/03/oral-cancer.png", "publishedAt": "2023-03-14T10:46:00Z", "content": "Every year, the world witnesses over 1 crore people die of cancer, according to a World Health Organisation (WHO) report. The cases of cancer, a deadly disease, are increasing rapidly in India. Accor… [+2195 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Covid-19 can cause 'face blindness': Study | MorungExpress | morungexpress.com - Morung Express", "description": "New York, March 14 (IANS) Covid-19 can cause difficulty recognising faces and navigational problems, according to a new study.", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/03/31995860_1678790607_Covid-19 can cause 'face blindness'.jpg", "publishedAt": "2023-03-14T10:43:38Z", "content": "New York, March 14 (IANS) Covid-19 can cause difficulty recognising faces and navigational problems, according to a new study.\r\nThe study, published in the journal Cortex, is the first to report \"pro… [+2483 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Vitamin B12 deficiency: 6 common signs and symptoms to watch out for - Hindustan Times", "description": "Your memory problems, mood swings or night-time sweating could be due to deficiency of Vitamin B12. Here are signs and symptoms you should be aware of. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/vitamin-b12-deficiency-6-common-signs-and-symptoms-to-watch-out-for-101678790335661.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/14/1600x900/cholesterol_02_1645849283767_1678790369758_1678790369758.jpg", "publishedAt": "2023-03-14T10:43:20Z", "content": "Vitamin B12 deficiency is more common in elderly compared to young across the globe but vegans and vegetarians are more at risk of developing it. This is the reason at least 47% Indians have Vitamin … [+2181 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Mosquito Cells Mapped To Help the Insects Choose Tastiest Humans - India Education Diary", "description": "In a bid to understand why mosquitoes may be more attracted to one human than another, Johns Hopkins Medicine researchers say they have mapped specialized receptors on the insects’ nerve cells that are able to fine-tune their ability to detect partic", "url": "https://indiaeducationdiary.in/mosquito-cells-mapped-to-help-the-insects-choose-tastiest-humans/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/03/Vanessa-NR.jpg?fit=1024%2C576&ssl=1", "publishedAt": "2023-03-14T10:18:14Z", "content": "In a bid to understand why mosquitoes may be more attracted to one human than another, Johns Hopkins Medicine researchers say they have mapped specialized receptors on the insects nerve cells that ar… [+4421 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Study Reveals Potential New Target for Head and Neck Cancer Immunotherapy - Technology Networks", "description": "A new study has linked high levels of a gene product, produced by many types of cancer, with an elevated immune response and improved outcomes in a common form of head and neck cancer.", "url": "https://www.technologynetworks.com/cancer-research/news/study-reveals-potential-new-target-for-head-and-neck-cancer-immunotherapy-371112", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/371112/study-reveals-potential-new-target-for-head-and-neck-cancer-immunotherapy-371112-640x360.jpg?cb=20230314", "publishedAt": "2023-03-14T10:17:10Z", "content": "Researchers at University of California San Diego School of Medicine and UC San Diego Moores Cancer Center have identified a strong association between the product of a gene expressed in most cancers… [+4457 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Monoclonal antibody tech promises better disease prevention and control in Africa - Down To Earth Magazine", "description": "Although the technology is not new, it is relatively unexplored in low- and middle-income countries", "url": "https://www.downtoearth.org.in/news/world/monoclonal-antibody-tech-promises-better-disease-prevention-and-control-in-africa-88219", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2023-03-14/0.70790400_1678785939_mon.jpg", "publishedAt": "2023-03-14T10:02:14Z", "content": "Although the technology is not new, it is relatively unexplored in low- and middle-income countriesEvery year, Africa faces over 100 health emergencies, more than any other region in the world, accor… [+6257 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Healthy Heart Tips: 5 Important Tests To Get Done And Keep A Check On Your Heart - Jagran English", "description": "One of the main advantages of getting your heart checked is the early diagnosis of heart related problems", "url": "https://english.jagran.com/lifestyle/healthy-heart-tips-important-tests-to-get-done-and-keep-a-check-on-your-heart-10068980", "urlToImage": "https://imgeng.jagran.com/images/2023/mar/types-of-heart-tests1678787222944.jpg", "publishedAt": "2023-03-14T09:41:00Z", "content": "THE HEART is one of the main and most important parts of our body. It is extensively crucial to maintain heart health as it is a pivotal part of health and well-being. In recent times, many celebriti… [+2379 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Akankshya Bahinipaty", "title": "Body Dysmorphic Disorder Is on the Rise; Here's What You Need to Know About It - The Swaddle", "description": "The rising popularity of weight-loss fads like Ozempic prompts concerns about body dysmorphic disorder, which experts say is getting worse.", "url": "https://theswaddle.com/body-dysmorphic-disorder-is-on-the-rise-heres-what-you-need-to-know-about-it/", "urlToImage": "https://n5a7d2f2.stackpathcdn.com/wp-content/uploads/2023/03/Body-Dysmorphic-Disorder-Editorial.jpg", "publishedAt": "2023-03-14T08:57:47Z", "content": "For the average adult user, Ozempic, a new FDA-approved drug, helps those with Type II diabetes manage their blood sugar. Like all drugs, it has several side effects: nausea, dizziness, and weight lo… [+7725 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Low carb, plant-based diet can cut risk of heart disease, cancer in diabetics, says Harvard study. Can Indians use this meal plan? - The Indian Express", "description": "‘We were not able to increase protein to more than 30 per cent with just plant sources; we had to give additional protein supplements,’ says Dr Anoop Misra, Chairman of Fortis C-DOC Hospital for Diabetes and Allied Sciences, who has attempted a plant and dair…", "url": "https://indianexpress.com/article/health-wellness/low-carb-plant-diet-heart-disease-cancer-diabetics-harvard-study-8496159/", "urlToImage": "https://images.indianexpress.com/2023/03/plant-diet_200_getty.jpg", "publishedAt": "2023-03-14T08:03:57Z", "content": "Switching to a low carbohydrate diet that is primarily plant-based can help in reducing deaths due to cardiovascular diseases and cancers among those with Type-2 diabetes, according to a study by Har… [+4012 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "17% of Denmark's Covid patients develop long-lasting symptoms: Survey - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/17-of-denmarks-covid-patients-develop-longlasting-symptoms-survey-3559597", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/1a1c6cfd370b69857e45d7bec7389f83_w_800_h_450.jpg", "publishedAt": "2023-03-14T07:57:15Z", "content": "Copenhagen, March 14 (IANS) In Denmark, 17 out of 100 people who had tested positive for Covid-19 experienced \"long-term effects\" within six to 12 months of being infected, according to the prelimina… [+1350 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Surgery & chemotherapy, not the only options for prostate cancer patients: Study - ETHealthWorld", "description": "The study directly compared the three approaches - surgery to remove tumors, radiation treatment and monitoring. Most prostate cancer grows slowly, so it takes many years to look at the disease's outcomes.", "url": "https://health.economictimes.indiatimes.com/news/industry/surgery-chemotherapy-not-the-only-options-for-prostate-cancer-patients-study/98626285", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98626404,imgsize-14,width-1200,height-628,overlay-ethealthworld/surgery-chemotherapy-not-the-only-options-for-prostate-cancer-patients-study.jpg", "publishedAt": "2023-03-14T07:25:00Z", "content": "New Delhi: Researchers have found long-term evidence that actively monitoring localized prostate cancer is a safe alternative to immediate surgery or radiation. The results, released on Saturday, are… [+2621 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Fitness coach shares tips to combat obesity and aid weight loss - WION", "description": "Fitness coach shares tips to combat obesity and aid weight loss", "url": "https://www.wionews.com/entertainment/lifestyle/news-fitness-coach-shares-tips-to-combat-obesity-and-aid-weight-loss-571827", "urlToImage": "http://cdn.wionews.com/sites/default/files/2022/09/30/300146-sahfjan-7.jpg", "publishedAt": "2023-03-14T07:22:41Z", "content": "Obesity is a lifestyle disorder, not a disease! And, this lifestyle disorder emerges from the choices we make in terms of what we consume and how much we exercise. It is a major challenge for millenn… [+3374 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Can deep brain stimulation cure Parkinson's disease? | TheHealthSite.com - TheHealthSite", "description": "While most people with Parkinson's disease are treated with medication deep brain stimulation is recommended in some cases. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/parkinsons-disease/deep-brain-stimulation-dbs-for-parkinsons-disease-all-you-need-about-this-surgical-procedure-961332/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/03/Parkinsons-disease.jpg", "publishedAt": "2023-03-14T07:06:00Z", "content": "Can deep brain stimulation cure Parkinson's disease? \r\nAlthough Deep Brain Stimulation (DBS) does not cure Parkinson's disease, it can ease the symptoms, reduce medication and enhance the quality of … [+3858 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "How To Lose Weight In 7 Days: 7 Effective Tips That Can Help You Lose Belly Fat - Jagran English", "description": "Weight Loss Tips Most people can reduce belly fat by switching to healthy lifestyle changes such as healthy eating exercising regularly practising mindful eating and managing stress", "url": "https://english.jagran.com/lifestyle/how-to-lose-weight-in-7-days-effective-tips-that-can-help-you-lose-belly-fat-10068920", "urlToImage": "https://imgeng.jagran.com/images/2023/mar/quick-weoght-loss-tips1678772216641.jpg", "publishedAt": "2023-03-14T05:32:00Z", "content": "WE ALL want to lose that extra fat accumulated in the belly. Losing abdominal fat, or belly fat is a common weight loss goal. But this goal is not achieved that easily. With major diet plans and exer… [+3286 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "High Cholesterol: 8 Expert Tips to Lower Bad Cholesterol Levels Naturally - India.com", "description": "A few easy dietary changes, along with exercise and other heart-healthy practices, may help you control high cholesterol naturally.", "url": "https://www.india.com/health/high-cholesterol-8-expert-tips-to-lower-bad-cholesterol-levels-naturally-5943333/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/03/Collage-Maker-14-Mar-2023-10-40-AM-1217.jpg", "publishedAt": "2023-03-14T05:11:01Z", "content": "A few easy dietary changes, along with exercise and other heart-healthy practices, may help you control high cholesterol naturally.\r\nHigh Cholesterol: 8 Expert Tips to Lower Bad Cholesterol Levels Na… [+3303 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Weight Loss: Fad Diets - Yes Or No? Check Out Expert's Tip To Shed Kilos - msnNOW", "description": "A fad diet can be a short-term, instant approach to losing weight, but doing it repeatedly might actually lead to weight gain. Fad diets limit protein consumption and also dehydrate the human body. As a result, not only will people lose weight, but they may a…", "url": "https://zeenews.india.com/health/weight-loss-fad-diets-yes-or-no-check-out-experts-tip-to-shed-kilos-2583366", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA18B7oj.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-03-14T05:06:25Z", "content": "© Provided by Zee News\r\nThe fact is that most individuals wish to reduce weight as rapidly as possible, and we live in a culture where fast satisfaction and instant results are anticipated. Fad diets… [+3037 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Poor Sleep The Night Before You Get Shot Can Decrease Vaccine Effectiveness: Study - NDTV", "description": "Sleeping less than six hours the night before you get a vaccination shot may limit your body's response to the vaccine, reducing protection against the virus or bacteria, according to a new study.", "url": "https://www.ndtv.com/feature/poor-sleep-the-night-before-you-get-shot-can-decrease-vaccine-effectiveness-study-3858821", "urlToImage": "https://c.ndtvimg.com/2023-03/0o8dtgeg_sleep-generic_625x300_14_March_23.jpg", "publishedAt": "2023-03-14T03:44:57Z", "content": "If one is sleep-deprived, they should consider delaying the vaccination. (Unsplash/Rep pic)\r\nSleeping less than six hours the night before you get a vaccination shot - whether for COVID-19, the flu o… [+2251 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kinkini Gupta", "title": "Psoriasis Diet: What To Eat And What Not To Eat - TheHealthSite", "description": "A proper diet can help reduce the symptoms of psoriasis.", "url": "https://www.thehealthsite.com/webstories/fitness/diet/psoriasis-diet-what-to-eat-and-what-not-to-eat-961168/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/03/and.jpg", "publishedAt": "2023-03-14T03:33:55Z", "content": "Omega-3 fatty acids are essential fatty acids that are found in fatty fish, such as salmon, mackerel, and sardines. They are also found in walnuts, chia seeds, and flaxseeds. \r\nSource: Thehealthsite"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Immunity-boosting spices to beat flu symptoms - Indiatimes.com", "description": "Our immune system helps protect us against bacteria and several viruses. It keep illnesses and infections at bay, which is why taking care of it should be our top most priority. Spices can be the best home remedies to start with.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/immunity-boosting-spices-to-beat-flu-symptoms/photostory/98601106.cms", "urlToImage": "https://static.toiimg.com/photo/98601126.cms", "publishedAt": "2023-03-14T03:30:00Z", "content": "Our immune system is made up of a complex network of cells, tissues, organs, and the substances, which help combat infections and other diseases. \r\nUnfortunately, a change in weather, air pollution a… [+501 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Attention! Your walking style could be a sign of THIS deadly disease - Times Now", "description": "Strange as it may sound, if you are suffering from an advanced stage of non-alcoholic fatty liver disease, you may have an unsteady and clumsy walk, with a tendency to lose control over your limbs and fall. Read on to know more about this and how you can redu…", "url": "https://www.timesnownews.com/health/attention-your-walking-style-could-be-a-sign-of-this-deadly-disease-article-98618610", "urlToImage": "https://static.tnn.in/thumb/msid-98618610,updatedat-1678757822712,width-1280,height-720,resizemode-75/98618610.jpg", "publishedAt": "2023-03-14T01:37:02Z", "content": "95th Academy Award 2023: Ram Charan, Jr NTR's RRR's Naatu Naatu CREATES history as it WINS at 95th Academy Awards. Shah Rukh Khan reacts to win"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/newsdesk/", "title": "Delhi Sees Uptick In ICU Admissions Amid H3N2 Influenza Cases Spike - msnNOW", "description": "Delhi witnessed a sudden uptick in ICU admissions as the city grappled with a surge in H3N2 influenza cases even as doctors warned people to mask up.", "url": "https://www.india.com/news/delhi/h3n2-influenza-cases-spike-icu-admissions-delhi-restrictions-mask-mandate-doctors-flu-children-at-risk-5943053/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/03/H3N2-Influenza-Latest-Update.jpg", "publishedAt": "2023-03-14T01:29:47Z", "content": "Delhi witnessed a sudden uptick in ICU admissions as the city grappled with a surge in H3N2 influenza cases even as doctors warned people to mask up.\r\nH3N2 Influenza: Doctors have advised people in D… [+2848 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Innate immune molecule could be at the root of ALS - News-Medical.Net", "description": "While drugs are on the market to slow the progression of neurodegenerative diseases, there are still no cures.", "url": "https://www.news-medical.net/news/20230313/Innate-immune-molecule-could-be-at-the-root-of-ALS.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/3D_illustration_mitchondria_-_Wire_man__2906c5e1a5514570bffd716b0c282567-620x480.jpg", "publishedAt": "2023-03-13T18:52:00Z", "content": "While drugs are on the market to slow the progression of neurodegenerative diseases, there are still no cures. But researchers at Boston Children's Hospital and Harvard Medical School are looking for… [+4213 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Fast Five Quiz: Stroke Risk Assessment in Atrial Fibrillation - Medscape Reference", "description": "How much do you know about stroke risk assessment in atrial fibrillation? Test your knowledge with this quick quiz.", "url": "https://reference.medscape.com/viewarticle/988436", "urlToImage": "https://img.medscape.com/thumbnail_library/ps_230120_atrial_fibrillation_800x450.jpg", "publishedAt": "2023-03-13T17:43:21Z", "content": "Author(s)\r\nSandeep K. Goyal, MD\r\nMedical Director of Electrophysiology Labs, Piedmont Healthcare Atlanta, Piedmont Heart Institute, Atlanta, Georgia\r\nDisclosure: Sandeep K. Goyal, MD, has disclosed t… [+145 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": null, "title": "Doctors Are Seeing These Common Long Covid Symptoms Most - msnNOW", "description": "Researchers are slowly narrowing the field.", "url": "https://www.prevention.com/health/a43234324/most-common-long-covid-symptoms/", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA18kCbh.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-03-13T17:16:02Z", "content": "Theres a lot the medical community is still sorting out about long COVID, so its understandable to have questions if you develop new symptoms without an obvious cause. Could you have long COVID or so… [+6259 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Anabolic Steroids UK - Best Place To Buy Anabolic Steroids Online In UK For 2023 - Deccan Herald", "description": "Steroids are widely used by fitness enthusiasts in the UK particularly among weightlifters and professional bodybuilders, due to the increased need of performance improvement. Instead of taking UK andabolic steroids the best option is to test legal steroids a…", "url": "https://www.deccanherald.com/brandspot/pr-spot/anabolic-steroids-uk-best-place-to-buy-anabolic-steroids-online-in-uk-for-2023-1199811.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p10-1199811-1678712258.png", "publishedAt": "2023-03-13T12:57:38Z", "content": "Steroids are widely used by fitness enthusiasts in the UK particularly among weightlifters and professional bodybuilders, due to the increased need of performance improvement. Instead of taking UK an… [+34212 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Vyvanse vs. Adderall: Similarities and Differences - Deccan Herald", "description": "Vyvanse (lisdexamfetamine) and Adderall (amphetamine and dextroamphetamine) are stimulant medications prescribed to treat attention-deficit/hyperactivity disorder (ADHD).1 There are however a few differentiating factors between the two. Its effects Vyvanse te…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vyvanse-vs-adderall-similarities-and-differences-1199808.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p9-1199808-1678711342.png", "publishedAt": "2023-03-13T12:42:22Z", "content": "Vyvanse (lisdexamfetamine) and Adderall (amphetamine and dextroamphetamine) are stimulant medications prescribed to treat attention-deficit/hyperactivity disorder (ADHD).1\r\nThere are however a few di… [+22883 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Close the Care Gap: Role that each of us can play to combat cancer - BSI bureau", "description": "It is great to see many corporates recognising the importance of preventive action and also role of caregivers", "url": "https://www.biospectrumindia.com/views/21/22790/close-the-care-gap-role-that-each-of-us-can-play-to-combat-cancer.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/cancer-22790.png", "publishedAt": "2023-03-13T12:31:00Z", "content": "It is great to see many corporates recognising the importance of preventive action and also role of caregivers\r\nThe first case of Cancer was reported in the 16th and 17th centuries, and while there h… [+2867 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Simple genetic urine test shows potential for early detection of bladder cancer - News-Medical.Net", "description": "Testing for genetic mutations in urine can detect bladder cancer years before the disease shows clinical symptoms, new research has shown.", "url": "https://www.news-medical.net/news/20230313/Simple-genetic-urine-test-shows-potential-for-early-detection-of-bladder-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-03-13T12:21:00Z", "content": "Testing for genetic mutations in urine can detect bladder cancer years before the disease shows clinical symptoms, new research has shown.\r\nThe study, by researchers from France, Iran and the United … [+5176 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds association between parental autonomy support, controlling parenting in development of children's behaviour - ANI News", "description": "The interaction between teenagers and their parents has long been a fascinating topic in psychological study. Numerous studies emphasise the importance of parental conduct in the development of children. Parental autonomy support, in particular, has been iden…", "url": "https://www.aninews.in/news/science/study-finds-association-between-parental-autonomy-support-controlling-parenting-in-development-of-childrens-behaviour20230313165814", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230313112025.jpg", "publishedAt": "2023-03-13T11:28:00Z", "content": "Kyoto [Japan], March 13 (ANI): The interaction between teenagers and their parents has long been a fascinating topic in psychological study. Numerous studies emphasise the importance of parental cond… [+4679 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Active Keto Gummies Reviews (Scam Alert) Customer Warning 2023 Latest Reports? - mid-day.com", "description": "Active keto gummies are a scientific formulation for weight reduction that focuses on emitting all the excessive unwanted fat content from the system.", "url": "https://www.mid-day.com/brand-media/article/active-keto-gummies-reviews-scam-alert-customer-warning-2023-latest-reports-23275050", "urlToImage": "https://images.mid-day.com/images/images/2023/mar/Active-Keto-Apple1_d.jpg", "publishedAt": "2023-03-13T11:23:00Z", "content": "Active keto gummies are a scientific formulation for weight reduction that focuses on emitting all the excessive unwanted fat content from the system.\r\nIt contains full spectrum BHB blends and nutrit… [+7698 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Medicine Used To Treat Type 2 Diabetes Might Heal Blinding IIH Headaches: Study - Zee News", "description": "This is a major trial for the rare and debilitating condition IIH that can lead to people, usually women, going blind and suffering disabling daily headaches. There are no current licensed drugs to treat IIH and hence this result is a major step forward for I…", "url": "https://zeenews.india.com/health/medicine-used-to-treat-type-2-diabetes-might-heal-blinding-iih-headaches-study-2583145", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/03/13/1166716-diabetes.jpg", "publishedAt": "2023-03-13T11:11:48Z", "content": "A new experiment has discovered that patients suffering from `blinding` headaches known as Idiopathic Intracranial Hypertension (IIH) might be treated with an injectable peptide used to treat type 2 … [+4056 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JUDY SIEGEL-ITZKOVICH", "title": "First in Israel: Doctors treat acid reflux without invasive surgery - The Jerusalem Post", "description": "The safe and innovative treatment has been researched and approved by the US Food and Drug Administration.", "url": "https://www.jpost.com/health-and-wellness/article-734163", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/t_JD_ArticleMainImageFaceDetect/529463", "publishedAt": "2023-03-13T11:00:00Z", "content": "Specialists at Jerusalem’s Shaare Zedek Medical Center (SZMC) have performed for the first time in Israel an innovative endoscopic procedure that successfully treats patients suffering from heartburn… [+5038 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Health experts bust myths related to epileptic seizures - Hindustan Times", "description": "There are numerous myths about epilepsy such as the belief that it is incurable, that people having an epileptic episode are possessed and so on. Health experts bust myths on epileptic seizures | Health", "url": "https://www.hindustantimes.com/lifestyle/health/health-experts-bust-myths-related-to-epileptic-seizures-101678695463897.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/13/1600x900/seizure_1653058791309_1678695672215_1678695672215.jpg", "publishedAt": "2023-03-13T08:33:31Z", "content": "Epilepsy affects 10 million people in India with a prevalence of about 1% of the population. There are numerous myths about epilepsy, such as the belief that it is incurable (it is treatable), that p… [+2292 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers find new strategies to treat Clostridioides difficile infections - ETHealthWorld", "description": "C. difficile is the leading cause of hospital-acquired infections and a leading cause of antibiotic-associated diarrhoea. Understanding its metabolic mechanisms at a cellular level may be useful for preventing and treating infections: Leo L. Cheng", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-find-new-strategies-to-treat-clostridioides-difficile-infections/98596535", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98596535,imgsize-31324,width-1200,height-628,overlay-ethealthworld/researchers-find-new-strategies-to-treat-clostridioides-difficile-infections.jpg", "publishedAt": "2023-03-13T05:20:00Z", "content": "Massachusetts: Researchers at Brigham and Women's Hospital (BWH) and Massachusetts General Hospital (MGH), two of the founding institutions of Mass General Brigham, have discovered the metabolic mech… [+2883 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can a dash of lime or a piece of orange help lower bad LDL cholesterol, reduce the risk of heart attack? Understanding health benefits of citrus fruits - The Indian Express", "description": "Citrus fruits have a soluble fibre like pectin, which can bind with cholesterol inside the stomach and carry it out of the body before it has a chance to get absorbed into the bloodstream, says Ritika Samaddar, Regional Head, Department of Clinical Nutrition …", "url": "https://indianexpress.com/article/health-wellness/orange-lemon-a-day-cholesterol-heart-attack-risk-8493024/", "urlToImage": "https://images.indianexpress.com/2023/03/citrus-fruits_200_getty.jpg", "publishedAt": "2023-03-13T01:06:21Z", "content": "By Ritika Samaddar\r\nSometimes, we just need to look around us to find solutions to our chronic illnesses. And since we have a high availability of citrus fruits, like oranges, lemons, grapefruit and … [+3849 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ipsita Pati", "title": "Influenza cases up, Covid tests to gain pace again in Gurgaon - Times of India", "description": "With the rise in flu cases in the city, the health department on Sunday directed all government facilities to undertake screening for influenza-like i", "url": "https://timesofindia.indiatimes.com/city/gurgaon/influenza-cases-up-covid-tests-to-gain-pace-again-in-gurgaon/articleshow/98590901.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-98590908,width-1070,height-580,imgsize-26360,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-03-12T23:12:00Z", "content": ""}]}