{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Pulmonologyadvisor.com"}, "author": "melissaalvarez", "title": "Surgical Treatment in Patients With NTM-PD Associated With Positive Outcomes - Pulmonology Advisor", "description": "A systematic review and meta-analysis assessed treatment outcomes and complication rates of adjunctive surgery in patients with NTM-PD.", "url": "https://www.pulmonologyadvisor.com/home/topics/lung-infection/surgical-treatment-in-patients-with-ntm-pd-associated-with-positive-outcomes/", "urlToImage": null, "publishedAt": "2022-11-22T18:15:00Z", "content": "Adjunctive surgery is effective and has acceptable rates of complications for selected patients with nontuberculous mycobacterial pulmonary disease (NTM-PD), according to meta-analysis findings publi… [+3560 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Proteomic analysis identifies novel phenotypes associated with COVID-19 severity in circulating immune cells - News-Medical.Net", "description": "In a recent study, researchers used proteomic analysis to identify novel immune cell phenotypes associated with severe coronavirus disease 2019 (COVID-19).", "url": "https://www.news-medical.net/news/20221122/Proteomic-analysis-identifies-novel-phenotypes-associated-with-COVID-19-severity-in-circulating-immune-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731834_16691391759213346.jpg", "publishedAt": "2022-11-22T17:55:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers used proteomic analysis to identify novel immune cell phenotypes associated with severe coronavirus disease 2019 (COVID-19). Addi… [+6785 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Previously unknown links between genetic factors in ASD identified - News-Medical.Net", "description": "In a new study published today in Cell Reports, researchers from the Donald K. Johnson Eye Institute (DKJEI), part of the Krembil Research Institute at University Health Network, have identified previously unknown connections between genetic factors in Autism…", "url": "https://www.news-medical.net/news/20221122/Previously-unknown-links-between-genetic-factors-in-ASD-identified.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-11-22T17:23:00Z", "content": "In a new study published today in Cell Reports, researchers from the Donald K. Johnson Eye Institute (DKJEI), part of the Krembil Research Institute at University Health Network, have identified prev… [+3749 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Disease X, other pathogens that can cause future pandemics to be identified by WHO | Mint - Mint", "description": "The WHO is convening over 300 scientists who will consider the evidence on over 25 virus families and bacteria and the Disease X", "url": "https://www.livemint.com/news/disease-x-other-pathogens-future-endemic-pandemic-who-11669135094347.html", "urlToImage": "https://images.livemint.com/img/2022/11/22/600x338/HEALTH-EUROPE_1669135288588_1669135288724_1669135288724.JPG", "publishedAt": "2022-11-22T16:43:27Z", "content": "The World Health Organization (WHO) will soon be updating the list of priority pathogens, including Disease X\", that can cause future outbreaks and pandemics. The list is being updated to guide globa… [+2148 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Jessica Migala", "title": "Causes and Risk Factors for Androgenetic Alopecia - Everyday Health", "description": "Alopecia causes vary, and for androgenetic alopecia specifically, various risk factors from genetics to age could be the root of your symptoms. Discover the top risk factors and causes for male and female pattern hair loss in this article.", "url": "https://www.everydayhealth.com/hair-loss/causes-and-risk-factors-for-androgenetic-alopecia/", "urlToImage": "https://images.everydayhealth.com/images/androgenic-alopecia-causes-and-risk-factors-subguide-1440x810.jpg?sfvrsn=cd72d6ab_1", "publishedAt": "2022-11-22T16:05:55Z", "content": "There are two main risk factors for androgenetic alopecia: genetics and age. Other risk factors can contribute, too.\r\nGenetics\r\nVariation of the androgen receptor (AR)gene (though there may be other … [+3038 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "One-Year-Old Dies Due To Measles In Mumbai, 10 Deaths This Year - NDTV", "description": "Mumbai today reported 20 new confirmed cases of measles, while a one-year-old girl died of the viral infection. The infection count in Mumbai since January 1 this year has gone up to 220, the Brihanmumbai Municipal Corporation (BMC) said.", "url": "https://www.ndtv.com/india-news/one-year-old-dies-due-to-measles-in-mumbai-10-deaths-this-year-3544434", "urlToImage": "https://c.ndtvimg.com/2022-11/na229hq4_measles-generic-istock_625x300_18_November_22.jpg", "publishedAt": "2022-11-22T15:51:00Z", "content": "New Delhi: Mumbai today reported 20 new cases of measles, while a one-year-old girl died of the viral infection, the Brihanmumbai Municipal Corporation (BMC) said. Since January 1 this year, Mumbai h… [+563 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Chris Anderson", "title": "Low Protein Diet May Inhibit Colon Cancer Growth - Inside Precision Medicine", "description": "A low-protein diet disrupts a nutrient signaling pathway in cells that is a driver of colon cancer.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/colorectal-cancer/low-protein-diet-may-inhibit-colon-cancer-growth/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2019/04/ColorectalCancer.jpg", "publishedAt": "2022-11-22T15:38:13Z", "content": "Researchers from the University of Michigan Rogel Cancer Center have published new research in the journal Gastroenterology, showing that a low-protein diet disrupts a nutrient signaling pathways in … [+3684 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "High good cholesterol levels may not guarantee low heart disease risk | Study - India TV News", "description": "As people strive to maintain high levels of 'good' cholesterol in their diet, new research has revealed that high-density lipoprotein (HDL) cholesterol may not be effective in 'uniformly predicting cardiovascular disease risk' for adults belonging to all race…", "url": "https://www.indiatvnews.com/health/high-good-cholesterol-levels-may-not-guarantee-low-heart-disease-risk-study-2022-11-22-825742", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/11/dsdedfcsffdddddgusdwd-1669131078.jpg", "publishedAt": "2022-11-22T15:33:02Z", "content": "As people strive to maintain high levels of \"good\" cholesterol in their diet, new research has revealed that high-density lipoprotein (HDL) cholesterol may not be effective in \"uniformly predicting c… [+3018 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "18F-sodium fluoride PET-CT visualizes bone formation in psoriatic arthritis patients: Study - Medical Dialogues", "description": "Netherlands: For imaging patients with psoriatic arthritis (PsA), F-18 sodium fluoride (NaF) PET/CT may be a valuable tool as it reveals the formation of new molecular bone in the peripheral", "url": "https://medicaldialogues.in/radiology/news/18f-sodium-fluoride-pet-ct-visualizes-bone-formation-in-psoriatic-arthritis-patients-study-102684", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191560-naf-pet-psoriatic-arthritis.jpg", "publishedAt": "2022-11-22T14:30:35Z", "content": "Netherlands: For imaging patients with psoriatic arthritis (PsA), F-18 sodium fluoride (NaF) PET/CT may be a valuable tool as it reveals the formation of new molecular bone in the peripheral joints m… [+3107 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Daily coffee consumption lowers diabetes risk in women with history of gestational diabetes - Medical Dialogues", "description": "Drinking one cup of caffeinated coffee daily as a replacement for other artificially sweetened beverages and sugar-sweetened beverages reduced the risk of type 2 diabetes by 9% and 17%,...", "url": "https://medicaldialogues.in/diet-nutrition/news/daily-coffee-consumption-lowers-diabetes-risk-in-women-with-history-of-gestational-diabetes-102689", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191516-coffee.jpg", "publishedAt": "2022-11-22T14:30:16Z", "content": "Drinking one cup of caffeinated coffee daily as a replacement for other artificially sweetened beverages and sugar-sweetened beverages reduced the risk of type 2 diabetes by 9% and 17%, respectively.… [+3019 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Persistent hematuria associated with strong risks of incident chronic kidney disease - Medical Dialogues", "description": "Hematuria, which refers to the presence of blood in the urine, has been reported to be associated with increased risk of chronic kidney disease (CKD). However, the relationship between hematuria...", "url": "https://medicaldialogues.in/nephrology/news/persistent-hematuria-associated-with-strong-risks-of-incident-chronic-kidney-disease-102630", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/17/191173-untitled-design-2022-11-17t104722026.jpg", "publishedAt": "2022-11-22T14:30:09Z", "content": "Hematuria, which refers to the presence of blood in the urine, has been reported to be associated with increased risk of chronic kidney disease (CKD). However, the relationship between hematuria that… [+975 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals how drinking can affect baby’s brain structure during pregnancy - ThePrint", "description": "Chicago [US], November 22 (ANI): According to a recent MRI study, drinking alcohol during pregnancy, even in low to moderate doses, can affect the baby’s brain structure and impede brain development. Results of the study will be presented next week at the ann…", "url": "https://theprint.in/science/study-reveals-how-drinking-can-affect-babys-brain-structure-during-pregnancy/1230391/", "urlToImage": null, "publishedAt": "2022-11-22T14:14:41Z", "content": "Chicago [US], November 22 (ANI): According to a recent MRI study, drinking alcohol during pregnancy, even in low to moderate doses, can affect the baby’s brain structure and impede brain development.… [+4389 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study suggests protein plays a key role in immunotherapy - ANI News", "description": "The study found protein is crucial in helping malignancies avoid immune attacks. The \"fragile X mental retardation protein\" (FMRP) is a protein that controls a network of genes and cells in the tumor microenvironment that help the tumor \"hidden\" from immune c…", "url": "https://www.aninews.in/news/science/study-suggests-protein-plays-a-key-role-in-immunotherapy20221122185820", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221122132804.jpg", "publishedAt": "2022-11-22T13:28:00Z", "content": "Lausanne [Switzerland], November 22 (ANI): By using the patient's own immune system against the tumour, immunotherapy is a cutting-edge method of treating cancer. Our ability to combat cancer has cha… [+7513 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study shows superbugs in the environment rarely transfer over to humans - ETHealthWorld", "description": "These bacteria are now highly resistant to antibiotics, with some strains even resistant to carbapenems, one of the so-called \"last resort\" class of antibiotics which is only used when no other antibiotic treatment works.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-shows-superbugs-in-the-environment-rarely-transfer-over-to-humans/95691936", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95691936,imgsize-5058,width-1200,height-628,overlay-ethealthworld/study-shows-superbugs-in-the-environment-rarely-transfer-over-to-humans.jpg", "publishedAt": "2022-11-22T13:12:00Z", "content": "Washington (US): An international team of scientists investigating transmission of a deadly drug-resistant bacteria that rivals MRSA, has found that whilst the bugs are found in livestock, pets and t… [+4612 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Lauren Martin", "title": "Prediabetes and high cholesterol diet: Foods to eat, sample diet plan, - Medical News Today", "description": "Nutrition is very important for people with prediabetes and high cholesterol. Dietitians frequently recommend the Mediterannean and DASH diets, but advice varies from person to person. Learn more.", "url": "https://www.medicalnewstoday.com/articles/diet-for-prediabetes-and-high-cholesterol", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/10/prediabetes_cholesterol_GettyImages1335878891_Thumb.jpg", "publishedAt": "2022-11-22T13:09:28Z", "content": "A nutritious, balanced diet is important for people with prediabetes and high cholesterol. Although individual recommendations vary, dietitians frequently recommend the Mediterranean and DASH diets.\r… [+8080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some low-carb, high-fibre foods that are ideal for weight loss - The Indian Express", "description": "According to nutritionist Divya Sobti, coconut is low in carbs and high in fibre and fat, so it may help stabilise your blood sugar", "url": "https://indianexpress.com/article/lifestyle/health/low-carb-high-fibre-foods-weight-loss-diet-snacks-fruits-8156484/", "urlToImage": "https://images.indianexpress.com/2021/03/pixabay_fruit-healthy-eating_incopy.jpg", "publishedAt": "2022-11-22T12:50:56Z", "content": "There’s no denying the benefits of consuming a fibre-rich diet. From aiding weight loss to keeping one fuller for longer, fibre also helps control blood sugar levels. But many of the high-fibre foods… [+2854 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Phentermine Over the Counter Alternatives, 5 Best Adipex OTC to Buy Online and In Store Near Me - Deccan Herald", "description": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase. Whether you opt for a Phentermine over-the-counter online or in store brand we have 5 of the most effective natural substitutes reviewed …", "url": "https://www.deccanherald.com/brandspot/pr-spot/phentermine-over-the-counter-alternatives-5-best-adipex-otc-to-buy-online-and-in-store-near-me-1164734.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164734-1669119785.png", "publishedAt": "2022-11-22T12:23:05Z", "content": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase.\r\nWhether you opt for a Phentermine over-the-counter online or in store brand … [+27530 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Bacterial infections second leading cause of death worldwide: study - Global Times", "description": "Bacterial infections are the second leading cause of death worldwide, accounting for one in eight of all deaths in 2019, the first global estimate of their lethality revealed on Tuesday.", "url": "https://www.globaltimes.cn/page/202211/1280170.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-12-09/ac76206f-f3fc-4670-a566-c25bcb368c88.jpeg", "publishedAt": "2022-11-22T12:17:00Z", "content": "Chen Borui checks the culture of bacteria strains in a laboratory at Fuzhou Dermatosis Prevention Hospital in Fuzhou, southeast China's Fujian Province, Dec. 8, 2021. Having been studying and working… [+2049 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Carbs For Diabetics: 5 Whole Grains People With Diabetes Can Add To Their Diet - NDTV", "description": "Diabetes diet: These are some of the whole grains that can provide carbs and control blood sugar levels at the same time.", "url": "https://www.ndtv.com/health/carbs-for-diabetics-5-whole-grains-people-with-diabetes-can-add-to-their-diet-3543448", "urlToImage": "https://i.ndtvimg.com/i/2017-11/whole-grains_650x400_61509947059.jpg", "publishedAt": "2022-11-22T11:28:06Z", "content": "People with diabetes are usually advised to avoid carbs\r\nIt's true that you need to be very careful about your food choices if you are a diabetic. And sometimes, there seems to be a lot of confusion … [+2261 chars]"}, {"source": {"id": null, "name": "Regmednet.com"}, "author": "Megan Giboney", "title": "Regenerating livers with the bacteria that causes leprosy - RegMedNet", "description": "Researchers have shown that leprosy, one of the oldest infectious diseases in human history may hold the key to regenerating livers.", "url": "https://www.regmednet.com/regenerating-livers-with-the-bacteria-that-causes-leprosy/", "urlToImage": "https://www.regmednet.com/wp-content/uploads/2022/11/RMN-News-article-banners-3.png", "publishedAt": "2022-11-22T11:27:30Z", "content": "Researchers from the University of Edinburgh (UK) have shown that leprosy, one of the oldest infectious diseases in human history may hold the key to regenerating livers.  \r\nIn findings published in … [+1574 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Devrupa Rakshit", "title": "Why We Might Feel Lonelier as We Age - The Swaddle", "description": "\"[The] loneliness results from a discrepancy between expected and actual social relationships,” a researcher explained.", "url": "https://theswaddle.com/why-people-might-feel-lonelier-as-they-age/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/11/Loneliness-Editorial.jpg", "publishedAt": "2022-11-22T10:48:37Z", "content": "As teenagers and young adults, people often tend to determine their self-worthby the number of friends in their circle. As they begin to grow older, though, many start preferring fewer, but closer fr… [+4921 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Pain relievers may worsen arthritis inflammation, study finds - Devdiscourse", "description": "Read more about Pain relievers may worsen arthritis inflammation, study finds on Devdiscourse", "url": "https://www.devdiscourse.com/article/science-environment/2260998-pain-relievers-may-worsen-arthritis-inflammation-study-finds", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_06_2022_16_22_58_38393.jpg?width=920&format=jpeg", "publishedAt": "2022-11-22T10:47:08Z", "content": "Taking certain anti-inflammatory pain relievers for osteoarthritis may worsen inflammation in the knee joint over time, according to a study.\r\nOsteoarthritis is the most common form of arthritis, aff… [+3726 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Red Boost Tonic Reviews - Dosage, Consumer Reports, Benefits & Side Effects - Deccan Herald", "description": "What is Red Boost Tonic? Red Boost is a blood flow support formulation that efficiently enhances male sexual performance.  The manufacturer claims that the formula targets the root cause of sexual health problems and restores sexual stamina.  Red Boost is pro…", "url": "https://www.deccanherald.com/brandspot/pr-spot/red-boost-tonic-reviews-dosage-consumer-reports-benefits-side-effects-1164699.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164699-1669112087.png", "publishedAt": "2022-11-22T10:14:47Z", "content": "What is Red Boost Tonic?\r\nRed Boost is a blood flow support formulation that efficiently enhances male sexual performance. \r\nThe manufacturer claims that the formula targets the root cause of sexual … [+8314 chars]"}, {"source": {"id": null, "name": "Endocrinologynetwork.com"}, "author": null, "title": "European Study Links Antibiotic Exposure to Increased Risk of Type 2 Diabetes Later in Life - Endocrinology Network", "description": "An analysis of data from a pair of studies examining cardiovascular risk in individuals from countries in Europe provides insight into an apparent increase in the likelihood of developing type 2 diabetes among people with a history of exposure to antibiotics.", "url": "https://www.endocrinologynetwork.com/view/european-study-links-antibiotic-expsure-to-increased-risk-of-type-2-diabetes-later-in-life", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/endocrinology/6bcc6962daca3c5f30c0271cfc3a1590431f7870-5230x4000.jpg?fit=crop&auto=format", "publishedAt": "2022-11-22T10:06:59Z", "content": "Each course of antibiotics during young adulthood was associated with a 2-4% increase in risk of developing type 2 diabetes, according to the results of a new analysis.\r\nUsing data from the Cardiovas… [+3796 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Testosterone Booster for Erectile Dysfunction - Deccan Herald", "description": "The rate at which testosterone level decreases as we become older is quite alarming. Some of the low testosterone levels associated with problems are fatigue, muscle loss, decreased energy and many others. However, there are numerous (over 160) testosterone b…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-testosterone-booster-for-erectile-dysfunction-1164690.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164690-1669111080.png", "publishedAt": "2022-11-22T09:58:00Z", "content": "The rate at which testosterone level decreases as we become older is quite alarming.\r\nSome of the low testosterone levels associated with problems are fatigue, muscle loss, decreased energy and many … [+16270 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Two-thirds of first-wave patients developed long Covid: Spain study - The New Indian Express", "description": "The most common persistent symptoms among both hospitalised and nonhospitalised patients were fatigue, pain, and memory loss.", "url": "https://www.newindianexpress.com/lifestyle/health/2022/nov/22/two-thirds-of-first-wave-patients-developed-long-covid-spain-study-2520955.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/11/11/w600X390/CHINACOVID.jpg", "publishedAt": "2022-11-22T09:51:00Z", "content": "LONDON: Over two-thirds of non-hospitalised patients infected with the SARS-CoV-2 virus in the first wave of the pandemic developed long COVID, according to a study conducted in Spain.\r\nThe results, … [+5916 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": "Brittany Trang", "title": "Why doesn't the U.S. have at-home flu tests? - STAT", "description": "“It's really rare, and it's really new, that people are allowed to know about what's happening inside their body without a physician in the middle,” says Michael Mina, a former assistant professor of epidemiology at Harvard.", "url": "https://www.statnews.com/2022/11/22/why-doesnt-the-u-s-have-at-home-flu-tests/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/11/52404275096_3762354908_o-1024x576.jpg", "publishedAt": "2022-11-22T09:43:55Z", "content": "Flu season is underway. RSV is putting record numbers of children in hospitals. And health professionals are gearing up for another Covid winter.\r\nWith so many potential viruses in play, it would be … [+10939 chars]"}, {"source": {"id": null, "name": "Biospectrumasia.com"}, "author": null, "title": "Japan to develop first blood biomarker-based diagnostic workflow for dementia - BSA bureau", "description": "Shimadzu, Eisai, Oita University, and Usuki City Medical Association commence joint research", "url": "https://www.biospectrumasia.com/news/50/21475/japan-to-develop-first-blood-biomarker-based-diagnostic-workflow-for-dementia-.html", "urlToImage": "https://www.biospectrumasia.com/uploads/articles/12-21475.jpeg", "publishedAt": "2022-11-22T09:07:41Z", "content": "For building an ecosystem that improves the early detection of Alzheimer's disease \r\nShimadzu Corporation, Eisai Co., Oita University, and Usuki City Medical Association have announced the commenceme… [+1897 chars]"}, {"source": {"id": null, "name": "MensXP.com"}, "author": "Saurabh Dixit", "title": "Heat Boils 101: Here’s Why They Occur And How To Deal With Them - msnNOW", "description": "Getting a boil is like getting work calls on weekends; they’re stressful to deal with, are a pain, and can ruin your day. While this is a natural part of life that occurs from time to time, handling it can be pretty frustrating. And contrary to their name, th…", "url": "https://www.mensxp.com/grooming/skin-care/122717-how-to-deal-with-heat-boils.html", "urlToImage": "https://img.mensxp.com/media/content/2022/Nov/image1_637c8ba8d2121.jpeg", "publishedAt": "2022-11-22T08:38:16Z", "content": "Getting a boil is like getting work calls on weekends; theyre stressful to deal with, are a pain, and can ruin your day. While this is a natural part of life that occurs from time to time, handling i… [+8032 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Edinburgh: An excess of salty food seasons the body with stress - India Education Diary", "description": "Scientists found in studies of mice that a high-salt diet increased the levels of a stress hormone by 75 per cent.Experts hope the findings will encourage a review of public health policy around salt consumption, with a view to manufacturers reducing", "url": "https://indiaeducationdiary.in/university-of-edinburgh-an-excess-of-salty-food-seasons-the-body-with-stress/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/12/University_of_Edinburgh_ceremonial_roundel.svg_.png?fit=1017%2C1024&ssl=1", "publishedAt": "2022-11-22T08:19:31Z", "content": "Scientists found in studies of mice that a high-salt diet increased the levels of a stress hormone by 75 per cent.\r\nExperts hope the findings will encourage a review of public health policy around sa… [+1687 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Why cervical cancer is rising among young women - Mint Lounge", "description": "Despite the fact that HPV screening has made cervical cancer preventable, the number of women in their early 30s getting diagnosed with it is still rising", "url": "https://lifestyle.livemint.com/health/wellness/why-cervical-cancer-is-rising-among-young-women-111669097104660.html", "urlToImage": "https://images.livemint.com/img/2022/11/22/1140x641/Cancer_1669098362006_1669098391727_1669098391727.jpg", "publishedAt": "2022-11-22T07:10:37Z", "content": "The frequency of cervical cancer among women in their early 30s has dramatically increased recently, according to recent research.\r\nThe findings were published in the Journal of the American Medical … [+4802 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Does your head hurt after eating or drinking? Know 6 food items that can trigger headaches - Health shots", "description": "Headaches can have a various underlying causes, but did you know that sometimes having your favourite food or drink can make your head hurt?", "url": "https://www.healthshots.com/healthy-eating/nutrition/headaches-know-6-foods-and-drinks-which-can-make-your-head-hurt/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/22115233/wine-and-headache.jpg", "publishedAt": "2022-11-22T06:54:02Z", "content": "What’s in your diet? It’s an important question that you should ask yourself as it can have answers to your health issues. For instance, there might be foods that often cause headaches. Some of the f… [+3392 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "Foods that will help Lower Cholesterol Levels - The Quint FIT", "description": "Here is a list of foods that are rich in monounsaturated fats and fiber that will help reduce LDL and increase good cholesterol instead.", "url": "https://www.thequint.com/fit/foods-that-will-help-lower-cholesterol-levels", "urlToImage": "https://images.thequint.com/thequint%2F2022-11%2F975e67d8-d2f2-4ff1-8f43-1627476ad16b%2Fcholesterol_workplace_of_a_doctor_stethoscope_on_wooden_desk_background_jpg_s_1024x1024_w_is_k_20_c_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-11-22T06:33:09Z", "content": "High cholesterol is a problem that arises when there is a high amount of fat in the blood which is caused due to lack of exercise, obesity, eating fatty food, and drinking alcohol. Thus, dietary and … [+768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Diksha Dayal", "title": "A vitamin-packed superfood: How a tomato keeps your weight, blood pressure, diabetes and heart health under control - The Indian Express", "description": "The nutritional load of tomatoes varies according to cooking method and type. So while tomato soup, juices and purees can help you manage weight, raw tomatoes can help you with dehydration and spaghetti sauces protect the heart. Cherry tomatoes have higher be…", "url": "https://indianexpress.com/article/lifestyle/health-specials/vitamin-packed-superfood-tomato-weight-blood-pressure-diabetes-heart-health-under-control-8282322/", "urlToImage": "https://images.indianexpress.com/2022/11/tomatoes-759.jpg", "publishedAt": "2022-11-22T06:20:54Z", "content": "We often wonder why the Mediterranean diet is considered the healthiest. But the simple answer lies in the fact that it contains a bulk of tomatoes. These are considered a rich source of Vitamin K an… [+7265 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "IANS", "title": "Dengue Outbreak in Uttar Pradesh: Lucknow Reports 47 Cases in Single Day - LatestLY", "description": "Even as the mercury begins to dip and winter sets in, there has been no let-up in dengue cases, with Lucknow registering 47 cases in just a day. Majority of the new dengue cases were reported from congested residential and commercial localities like Aishbagh …", "url": "https://www.latestly.com/india/news/dengue-outbreak-in-uttar-pradesh-lucknow-reports-47-cases-in-single-day-4490321.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/11/69-8-784x441.jpg", "publishedAt": "2022-11-22T05:11:56Z", "content": "Lucknow, November 21: Even as the mercury begins to dip and winter sets in, there has been no let-up in dengue cases, with Lucknow registering 47 cases in just a day. Majority of the new dengue cases… [+1661 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Odishatv Bureau", "title": "Eat these four foods to feel stress-free instantly - OTV News", "description": "Stress has now become a common conversation point in workplaces especially when confronted with meeting deadlines, dealing with financial problems, health issues, and making study and career decisions.", "url": "https://odishatv.in/health/news-eat-these-four-foods-to-feel-stress-free-instantly-190766", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1669040129.webp", "publishedAt": "2022-11-22T04:52:33Z", "content": "It is normal to experience tension, anxiety, grief, and worry. And food can be your best friend while coping with it. When you're feeling stressed, the body demands certain vitamins and minerals, inc… [+1657 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Connection between gut and stroke-induced cognitive impairment: Research - Hindustan Times", "description": "Two-thirds of stroke patients will develop cognitive impairment, while one-third of all stroke patients will go on to develop dementia, according to recent research, so there is a critical need for more effective stroke therapies that preserve cognitive funct…", "url": "https://www.hindustantimes.com/lifestyle/health/connection-between-gut-and-stroke-induced-cognitive-impairment-research-101669090354820.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/22/1600x900/intelligence-g5b7c9b1ab_1920_1667638104502_1669090429688_1669090429688.jpg", "publishedAt": "2022-11-22T04:16:19Z", "content": "A major contributor to dementia, substantial long-term impairment, and mortality is stroke. The American Heart Association revealed that stroke patients are more likely to experience depression, whic… [+4521 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Rashi Prakash", "title": "Tumour matrix profiling gives clues to progression of some lung cancers - Medical Dialogues", "description": "Squamous cell carcinoma is the second most  prevalent type of lung cancer and treatment options for these patients remain  limited and have remained largely unchanged over decades. High rates of...", "url": "https://medicaldialogues.in/mdtv/pulmonology/videos/tumour-matrix-profiling-gives-clues-to-progression-of-some-lung-cancers-102721", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/22/191606-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-1.jpg", "publishedAt": "2022-11-22T03:45:24Z", "content": "Squamous cell carcinoma is the second most prevalent type of lung cancer and treatment options for these patients remain limited and have remained largely unchanged over decades. High rates of recurr… [+2406 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Shruti Saini", "title": "Do your teeth hurt during winter? Follow these 7 expert tips to prevent it - Health shots", "description": "Do you experience tooth pain during winter? If so, keep in mind these 7 tips to deal with the pain and keep your oral health in check.", "url": "https://www.healthshots.com/preventive-care/self-care/7-tips-for-dental-care-and-to-treat-tooth-pain-during-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/21190538/dental-care.jpg", "publishedAt": "2022-11-22T03:29:53Z", "content": "The cold weather not also dries out your skin, but it can also increase your risk for dental problems. Many people tend to get worried about increased teeth’ sensitivity before winter sets in. Rememb… [+3089 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "IIT-Delhi researcher reveals significant brain abnormalities in long Covid patients - Daijiworld.com", "description": "New Delhi, Nov 22 (IANS): Sapna S. Mishra, a PhD candidate at the Indian Institute of Technology in Delhi, and a team of researchers have used a special type of MRI to uncover brain changes in patients up to six months after they recovered from Covid-19.\r\nMRI…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1021936", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-11-22T02:58:35Z", "content": "New Delhi, Nov 22 (IANS): Sapna S. Mishra, a PhD candidate at the Indian Institute of Technology in Delhi, and a team of researchers have used a special type of MRI to uncover brain changes in patien… [+2594 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Gold Coast Keto Gummies Maggie Beer Australia Shocking Shark Tank Exposed Chemist Warehouse 2022 - The Tribune India", "description": "&nbsp;Gold Coast Keto Gummies Maggie Beer are extremely popular. If you have weight gain issues and have tried so many diets unsuccessfully, you should give these wonderful fat burners a trial as they offer ultimate weight-loss results. OFFICIAL WEBSITE-&rdqu…", "url": "https://www.tribuneindia.com/news/brand-connect/gold-coast-keto-gummies-maggie-beer-australia-shocking-shark-tank-exposed-chemist-warehouse-2022-453473", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1644748702.jpg", "publishedAt": "2022-11-22T02:40:00Z", "content": "Gold Coast Keto Gummies Maggie Beer are extremely popular. If you have weight gain issues and have tried so many diets unsuccessfully, you should give these wonderful fat burners a trial as they offe… [+8519 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Study reports higher number of child abuse cases in areas selling alcohol - Devdiscourse", "description": "The number of stores selling alcohol in a neighborhood is linked to cases of child abuse and neglect in the same area, a new study suggests.", "url": "https://www.devdiscourse.com/article/science-environment/2260435-study-reports-higher-number-of-child-abuse-cases-in-areas-selling-alcohol", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_11_2022_02_29_06_4465024.jpg?width=920&format=jpeg", "publishedAt": "2022-11-22T02:29:17Z", "content": "According to a Sacramento, California, research there were 10.5 per cent more children placed in foster care and 13.5 per cent more substantiated occurrences of child abuse and neglect in a census tr… [+3899 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "The Cause of Alzheimer's Could Be Coming From Inside Your Mouth - ScienceAlert", "description": "In recent years, a growing number of scientific studies have backed an alarming hypothesis: Alzheimer's disease isn't just a disease, it's an infection.", "url": "https://www.sciencealert.com/the-cause-of-alzheimers-could-be-coming-from-inside-your-mouth", "urlToImage": "https://www.sciencealert.com/images/2022/11/FingerPointsAtMouthXray.jpg", "publishedAt": "2022-11-22T01:37:34Z", "content": "In recent years, a growing number of scientific studies have backed an alarming hypothesis: Alzheimer's disease isn't just a disease, it's an infection.\r\nWhile the exact mechanisms of this infection … [+3733 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "Stages of ALS: Progression Before and After Diagnosis - Verywell Health", "description": "ALS progresses in a matter of years, depending on whether it's diagnosed and treated. Learn what to expect from one ALS stage to the next.", "url": "https://www.verywellhealth.com/stages-of-als-progression-6829517", "urlToImage": "https://www.verywellhealth.com/thmb/8z6a2c88t29JhWELk67LV8_8HpQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1344081003-f89bfbc95fb44ddda21c45de5d7b9382.jpg", "publishedAt": "2022-11-21T22:59:27Z", "content": "After being diagnosed with amyotrophic lateral sclerosis (ALS), the stage may be determined by two staging systems. The stages describe the progression of the condition. In ALS, weakness gradually wo… [+8492 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Surveys show differing attitudes toward monkeypox vaccination - CIDRAP", "description": null, "url": "https://www.cidrap.umn.edu/news-perspective/2022/11/surveys-show-differing-attitudes-toward-monkeypox-vaccination", "urlToImage": "https://www.cidrap.umn.edu/sites/default/themes/siteskin/inc/images/logo-fb.png", "publishedAt": "2022-11-21T21:14:19Z", "content": "Men who have sex with men (MSM) account for the vast majority of US monkeypox cases, and a new survey shows urban versus rural MSM have significantly different attitudes about vaccination and disease… [+1852 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Tremor, restless legs syndrome, schizophrenia among risk factors linked to PD - Healio", "description": "An increased risk for Parkinson&rsquo;s disease was associated with a range of factors, comorbidities and prodromal features, some of which may appear 5 to 10 years prior to diagnosis, according to a study in JAMA Neurology.&ldquo;Prodromal features of Parkin…", "url": "https://www.healio.com/news/neurology/20221121/tremor-restless-legs-syndrome-schizophrenia-among-risk-factors-linked-to-pd", "urlToImage": "https://www.healio.com/~/media/temporary/schizophrenia.jpg", "publishedAt": "2022-11-21T20:11:47Z", "content": "Source/Disclosures\r\n Disclosures: \r\nSchrag reports receiving a salary from the National Institute for Health and Care Research Biomedical Research Council during the conduct of the study; grants from… [+3517 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Helen Leask", "title": "New Trials in Breast Cancer: Could Your Patient Benefit? - Medscape", "description": "Could one of your patients benefit from being enrolled into one of the clinical trials now enrolling patients with breast cancer?", "url": "https://www.medscape.com/viewarticle/984390", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_211216_breast_cancer_tumor_800x450.jpg", "publishedAt": "2022-11-21T17:51:06Z", "content": "Several clinical trials in breast cancer have started in recent months. Maybe one of your patients could benefit from taking part.\r\nHER2/neu-positive breast cancer with high risk of recurrence follow… [+7575 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Almonds can help cut calories, finds study - ANI News", "description": "Weight loss is never an easy nut to crack, but a handful of almonds could keep extra kilos at bay, reveals a new research from the University of South Australia.", "url": "https://www.aninews.in/news/lifestyle/fitness/almonds-can-help-cut-calories-finds-study20221121213856", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221121160836.jpg", "publishedAt": "2022-11-21T16:08:00Z", "content": "Sydney [Australia], November 21 (ANI): While losing weight can be a thankless job, a new research by the University of South Australia suggests that a handful of almonds can help keep additional poun… [+2687 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Relationship Between the Periodontal Status of Pregnant Women and the Incidence and Severity of Pre-term and/or Low Birth Weight Deliveries: A Retrospective Observational Case-Control Study - Cureus", "description": "Background: Literature worldwide has linked periodontitis to preterm births and/or low-birth-weight infants. However, to our knowledge, research on this topic is scarce in India. The United Nations Children's Fund (UNICEF) reports that South Asian nations, pa…", "url": "https://www.cureus.com/articles/120953-relationship-between-the-periodontal-status-of-pregnant-women-and-the-incidence-and-severity-of-pre-term-andor-low-birth-weight-deliveries-a-retrospective-observational-case-control-study", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_3.png", "publishedAt": "2022-11-21T16:05:57Z", "content": "Background: Literature worldwide has linked periodontitis to preterm births and/or low-birth-weight infants. However, to our knowledge, research on this topic is scarce in India. The United Nations C… [+35750 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Lead exposure tied to increased risk of CVD mortality: JAHA - Medical Dialogues", "description": "USA: Research published in the JAHA (Journal of the American Heart Association) has again underlined cardiovascular risks linked with environmental exposure to heavy metals (lead) and the lack of...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/lead-exposure-tied-to-increased-risk-of-cvd-mortality-jaha-102681", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191564-lead-exposure.jpg", "publishedAt": "2022-11-21T14:30:57Z", "content": "USA: Research published in the JAHA (Journal of the American Heart Association) has again underlined cardiovascular risks linked with environmental exposure to heavy metals (lead) and the lack of tre… [+2891 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Do herbal supplements of Ginkgo biloba impact course of tinnitus? - Medical Dialogues", "description": "Ginkgo biloba herbal extracts may be less effective than a placebo or may have no impact at all as a hearing aid, says an article published in Cochrane Database of Systematic Reviews.People who...", "url": "https://medicaldialogues.in/ent/news/do-herbal-supplements-of-ginkgo-biloba-impact-course-of-tinnitus-102679", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/20/150484-ginkgo-biloba.jpg", "publishedAt": "2022-11-21T14:30:35Z", "content": "Ginkgo biloba herbal extracts may be less effective than a placebo or may have no impact at all as a hearing aid, says an article published in Cochrane Database of Systematic Reviews.\r\nPeople who exp… [+2319 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Rare case of developing pleural, pericardial effusion and anasarca with low-dose oral minoxidil: A... - Medical Dialogues", "description": "South Africa: A recent case report published in JAAD Case Reports, reports the case of an African woman with frontal fibrosing alopecia (FFA) in whom pleural, pericardial effusion and anasarca...", "url": "https://medicaldialogues.in/dermatology/cases/rare-case-of-developing-pleural-pericardial-effusion-and-anasarca-with-low-dose-oral-minoxidil-a-report-102553", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/18/191388-swelling-in-lower-extremity.jpg", "publishedAt": "2022-11-21T14:30:08Z", "content": "South Africa: A recent case report published in JAAD Case Reports, reports the case of an African woman with frontal fibrosing alopecia (FFA) in whom pleural, pericardial effusion and anasarca develo… [+2768 chars]"}, {"source": {"id": null, "name": "Edtimes.in"}, "author": "Brand Voice", "title": "Dr. Prashanth Arun – Consultant Physician & Diabetologist sheds light on myths and facts about Diabetes - ED Times", "description": "Dr. Prashanth Arun is a young and dynamic consultant physician and Diabetologist at MV Hospital for diabetes in Chennai Tamil Nadu. He is widely known to create content on medical topics on various social media platforms. He is very friendly to his patients a…", "url": "https://edtimes.in/dr-prashanth-arun-consultant-physician-diabetologist-sheds-light-on-myths-and-facts-about-diabetes/", "urlToImage": "https://edtimes.in/wp-content/uploads/2022/11/EDTIMEs-2-640x427.jpeg", "publishedAt": "2022-11-21T12:29:27Z", "content": "Dr. Prashanth Arun is a young and dynamic consultant physician and Diabetologist at MV Hospital for diabetes in Chennai Tamil Nadu. He is widely known to create content on medical topics on various s… [+4950 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Fat Burning GNC Appetite Suppressants Of [#BE Informed] 2022 - Deccan Herald", "description": "The Centers for Disease Control and Prevention (CDC) report that adult obesity rates in all states are higher than 20%. Nearly 100 million adults are affected by the prevalence of this ever-growing epidemic, and obesity-related diseases like heart disease, ty…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-fat-burning-gnc-appetite-suppressants-of-be-informed-2022-1164411.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164411-1669031693.png", "publishedAt": "2022-11-21T11:54:53Z", "content": "The Centers for Disease Control and Prevention (CDC) report that adult obesity rates in all states are higher than 20%. Nearly 100 million adults are affected by the prevalence of this ever-growing e… [+17073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Don't miss out on these skincare habits in your 20s - The Indian Express", "description": "From saying no to physical scrubs to incorporating retinol in your routine — here are some essential skincare habits for your 20s", "url": "https://indianexpress.com/article/lifestyle/life-style/skincare-tips-habits-20s-sunscreen-retinol-scrubs-diet-exercise-8079609/", "urlToImage": "https://images.indianexpress.com/2022/08/GettyImages-skincare-tips-skin-glow-1200.jpg", "publishedAt": "2022-11-21T11:30:04Z", "content": "There’s no better time than your 20s to pay attention to your health, hair,and, of course, skin. Inadequate skin and hair care habits during the 20s can show signs of damagein the years to come.As su… [+1925 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Youtheory Fat Burner [#Exposed] A Detailed Overview - Deccan Herald", "description": "From childhood, we know that exercising and maintaining a balanced diet is essential for our well-being. However, the meaning of it changes when we grow up. We want to get the shape of our dreams to make our place in society.  Even though there's no ideal bod…", "url": "https://www.deccanherald.com/brandspot/pr-spot/youtheory-fat-burner-exposed-a-detailed-overview-1164389.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164389-1669027645.png", "publishedAt": "2022-11-21T10:46:31Z", "content": "From childhood, we know that exercising and maintaining a balanced diet is essential for our well-being. However, the meaning of it changes when we grow up. We want to get the shape of our dreams to … [+15993 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "COVID can alter our genetic makeup & worsen diabetes - Ahmedabad Mirror", "description": "COVID can alter our genetic makeup & worsen diabetes", "url": "https://www.ahmedabadmirror.com/covid-can-alter-our-genetic-makeup--worsen-diabetes/81847700.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1669019169238.jpg-org", "publishedAt": "2022-11-21T08:43:01Z", "content": "It can also cause cognitive dysfunctions, push complications such as cardiomyopathy and muscle flaws\r\n#NEWYORKCOVID-19 can alter a person’s genetic makeup which can enhance the proliferation of disea… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Simple tips to take care of the nutritional needs of preterm babies - The Indian Express", "description": "Preterm birth is a nutritional emergency; these babies have high nutritional demand. But, despite medical advances in NICU care, it is quite challenging to achieve weight gain in these babies, said a doctor", "url": "https://indianexpress.com/article/lifestyle/health/nutritional-needs-preterm-babies-health-feeding-breast-milk-nicu-8275346/", "urlToImage": "https://images.indianexpress.com/2022/11/GettyImages-newborn-baby-1200.jpg", "publishedAt": "2022-11-21T07:50:16Z", "content": "Preterm babies, more than full-term babies, need a lot of care and attention. Doctors often advise mothers to breastfeed their babies for their complete nutrition up to 6 months of age, with bodies l… [+3520 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Sarah Murray", "title": "Tighter controls on antibiotics promise to curb drug-resistance - Financial Times", "description": "Medicines are often given for viral infections such as flu, for which they are useless, but can cause side effects", "url": "https://www.ft.com/content/523fde0d-79e2-4622-9c6d-4f5ff44432af", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F63c464ad-c6d7-4544-8f3c-e75dd1deddf7.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2022-11-21T04:01:08Z", "content": "Tackling antibiotic resistance calls for high-level political commitment and more investment in drug research. But, as health experts and hospital systems are finding, there is a simpler but equally … [+5481 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Put blood pressure, cholesterol woes at bay with a sweet ingredient - study says 2 spoons in a day is all you - Times Now", "description": "High cholesterol is often known as a silent killer as it can result in coronary heart disease if not addressed well in time. Additionally, high blood sugar is a consequence suffered by diabetes patients as they sometimes fail to control the way their body pro…", "url": "https://www.timesnownews.com/health/put-blood-pressure-cholesterol-woes-at-bay-with-a-sweet-ingredient-study-says-2-spoons-in-a-day-is-all-you-need-article-95647958", "urlToImage": "https://static.tnn.in/thumb/msid-95647958,imgsize-100,width-1280,height-720,resizemode-75/95647958.jpg", "publishedAt": "2022-11-21T03:48:01Z", "content": "Haryana village gifts SUV, Rs 2 cr to losing candidate to avoid bitterness, rivalry"}, {"source": {"id": null, "name": "Freethink.com"}, "author": "Kristin Houser", "title": "Electrically stimulating the brain helps stop binge eating - Freethink", "description": "Two people with binge eating disorder reported that deep brain stimulation helped them control their eating and lose weight in a small study.", "url": "https://www.freethink.com/health/binge-eating-disorder", "urlToImage": "https://www.freethink.com/wp-content/uploads/2022/11/binge-eating-disorder-thumb.jpg?resize=1200,630", "publishedAt": "2022-11-20T23:00:00Z", "content": null}]}