{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Environmental factors are highly predictive of people's risk of death, study shows - News-Medical.Net", "description": "Along with high blood pressure, diabetes, and smoking, environmental factors such as air pollution are highly predictive of people's chances of dying, especially from heart attack and stroke, a new study shows.", "url": "https://www.news-medical.net/news/20220624/Environmental-factors-are-highly-predictive-of-peoples-risk-of-death-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2022-06-24T21:56:00Z", "content": "Along with high blood pressure, diabetes, and smoking, environmental factors such as air pollution are highly predictive of people's chances of dying, especially from heart attack and stroke, a new s… [+4111 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PLT Girija and TM Mukundan", "title": "Crisis in healthcare and the role of Ayurveda - The New Indian Express", "description": "Ayurvedic treatment is cost-effective and the need for hospitalisation is far less and there are no invasive procedures.", "url": "https://www.newindianexpress.com/opinions/2022/jun/25/crisis-in-healthcare-and-the-role-of-ayurveda-2469378.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/3/19/w600X390/ami.jpg", "publishedAt": "2022-06-24T20:08:00Z", "content": "India planned to achieve \"health for all\" by 2000. We are nowhere near achieving this target even today. For, since Independence, the country followed a healthcare policy that ignored the indigenous,… [+6107 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Becky McCall", "title": "Acute Hepatitis Cases in Children Show Declining Trend; Adenovirus, COVID-19 Remain Key Leads - Medscape", "description": "Experts update the latest case numbers for acute hepatitis in children and discuss possible factors that result in the disease, namely, adenovirus and COVID-19, either separately or together.", "url": "https://www.medscape.com/viewarticle/976174", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_190306_liver_800x450.jpg", "publishedAt": "2022-06-24T18:40:03Z", "content": "LONDON Case numbers of acute hepatitis in children show \"a declining trajectory,\" and COVID-19 and adenovirus remain the most likely, but as yet unproven, causative agents, said experts in an update … [+5218 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "COVID vaccines prevented over 42 lakh deaths in India: Lancet - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/world/covid-vaccines-prevented-over-42-lakh-deaths-in-india-lancet", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2021-09%2Ff293e534-ce20-4fcc-a2d8-2d70bb0fe144%2FIMG_7451.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-24T18:30:00Z", "content": "\"Our findings show that millions of lives have likely been saved by making vaccines available to people everywhere, regardless of their wealth. However, more could have been done. If the targets set … [+225 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New genetic disease that delays children's brain development discovered by scientists - ANI News", "description": "Washington [US], June 24 (ANI): During a recent study, scientists identified a new genetic disease, which causes some children's brains to develop abnormally, resulting in delayed intellectual development.", "url": "https://www.aninews.in/news/science/new-genetic-disease-that-delays-childrens-brain-development-discovered-by-scientists20220624234934", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/dna2022011905593fgfdsgsf2022011906312220220624174908.jpg", "publishedAt": "2022-06-24T18:19:00Z", "content": "Washington [US], June 24 (ANI): During a recent study, scientists identified a new genetic disease, which causes some children's brains to develop abnormally, resulting in delayed intellectual develo… [+3942 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Maternal vaccination during pregnancy helps protect babies from being hospitalized due to COVID-19 - News-Medical.Net", "description": "In a new study sponsored by the Centers for Disease Control and Prevention and published in the New England Journal of Medicine, researchers provide additional evidence that COVID-19 vaccination during pregnancy helps protect babies younger than 6 months from…", "url": "https://www.news-medical.net/news/20220624/Maternal-vaccination-during-pregnancy-helps-protect-babies-from-being-hospitalized-due-to-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2022-06-24T17:22:00Z", "content": "In a new study sponsored by the Centers for Disease Control and Prevention and published in the New England Journal of Medicine, researchers provide additional evidence that COVID-19 vaccination duri… [+3093 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Luke Coutinho", "title": "Wellness by Luke Coutinho: How hormones affect your heart health - Hindustan Times", "description": "A healthy lifestyle, especially when started young, goes a long way in preventing cardiovascular disease", "url": "https://www.hindustantimes.com/lifestyle/brunch/wellness-by-luke-coutinho-how-hormones-affect-your-heart-health-101656089185215.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/24/1600x900/18cffd60-f3c8-11ec-bb9b-b9389131acd3_1656089182586.jpg", "publishedAt": "2022-06-24T16:46:24Z", "content": "One would usually not think about hormones when you consider heart health, but these chemical messengers have a role to play, too. Hormones affect everything in our body and keep dictating their term… [+4473 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "New gene type explains why women experience different heart disease symptoms than men - ANI News", "description": "Washington [US], June 24 (ANI): According to a study by the University of Florida, newly identified genes may help explain why women experience different heart disease symptoms than men do, which often leads to misdiagnosing serious problems.", "url": "https://www.aninews.in/news/health/new-gene-type-explains-why-women-experience-different-heart-disease-symptoms-than-men20220624221121", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/unnamed_1202206230712022022062307590620220624160947.jpg", "publishedAt": "2022-06-24T16:41:00Z", "content": "Washington [US], June 24 (ANI): According to a study by the University of Florida, newly identified genes may help explain why women experience different heart disease symptoms than men do, which oft… [+3616 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Hiral patel", "title": "Prostate RT improves overall survival in men with newly diagnosed, low-burden metastatic prostate cancer - Medical Dialogues", "description": "UK: In men with newly diagnosed, low-burden metastatic prostate cancer, Prostate radiotherapy RT...", "url": "https://medicaldialogues.in/oncology/news/prostate-rt-improves-overall-survival-in-men-with-newly-diagnosed-low-burden-metastatic-prostate-cancer-94864", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/11/178396-image.jpg", "publishedAt": "2022-06-24T14:30:19Z", "content": "UK: In men with newly diagnosed, low-burden metastatic prostate cancer, Prostate radiotherapy RT improves overall survival (OS), without detriment in quality of life( QoL), states long-term results f… [+3331 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Hiral patel", "title": "Fourth dose of Pfizer vaccine protects medicos against COVID-19 hospitalizations and deaths: JAMA - Medical Dialogues", "description": "Israel: In residents of long-term care facilities (LTCFs), the fourth dose of the Pfizer BioNTech...", "url": "https://medicaldialogues.in/medicine/news/fourth-dose-of-pfizer-vaccine-protects-medicos-against-covid-19-hospitalizations-and-deaths-jama-95010", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/24/179338-untitled-design-1.jpg", "publishedAt": "2022-06-24T14:30:16Z", "content": "Israel: In residents of long-term care facilities (LTCFs), the fourth dose of the Pfizer BioNTech (BNT162b2) COVID-19 vaccine was associated with high protection against COVID-19 hospitalizations and… [+3099 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Africa CDC warns spike in monkeypox cases - ThePrint", "description": "Addis Ababa [Ethiopia], June 24 (ANI/Xinhua): The Africa Center for Disease Control (Africa CDC) warned monkeypox cases are increasing across the African continent. Ahmed Ogwell, acting director of Africa CDC, while addressing journalists in his period briefi…", "url": "https://theprint.in/world/africa-cdc-warns-spike-in-monkeypox-cases/1011008/", "urlToImage": null, "publishedAt": "2022-06-24T14:14:27Z", "content": "Addis Ababa [Ethiopia], June 24 (ANI/Xinhua): The Africa Center for Disease Control (Africa CDC) warned monkeypox cases are increasing across the African continent.\r\nAhmed Ogwell, acting director of … [+2175 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Use of new-generation ACURATE neo2 with TAVR tied to less paravalvular leak: Study - Medical Dialogues", "description": "USA: Transcatheter aortic valve replacement (TAVR) with new-generation ACURATE neo2 is associated...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/use-of-new-generation-acurate-neo2-with-tavr-tied-to-less-paravalvular-leak-study-94906", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/14/178557-new-generation-acurate-neo2.jpg", "publishedAt": "2022-06-24T14:00:00Z", "content": "USA: Transcatheter aortic valve replacement (TAVR) with new-generation ACURATE neo2 is associated with a lower prevalence of moderate or severe paravalvular aortic regurgitation (AR), suggests a rece… [+2622 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Shruti Wilson", "title": "The big news: Now sweet candy will cure malaria! - News Track English", "description": "You all know that more than four million people die every year due to malaria worldwide. Yes, and an estimated two-thirds of deaths occur due to this disease in children under the age of five. At the same time, now the researchers of Jawaharlal Nehru Universi…", "url": "https://english.newstracklive.com/news/the-big-news-now-sweet-candy-will-cure-malaria-ta303-1236113-1.html", "urlToImage": "https://media.newstrack.in/uploads/health-lifestyle/home-tips-hacks/Jun/24/big_thumb/CANDY3_62b59adaf2966.JPG", "publishedAt": "2022-06-24T13:01:36Z", "content": "You all know that more than four million people die every year due to malaria worldwide. Yes, and an estimated two-thirds of deaths occur due to this disease in children under the age of five. At the… [+2286 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "Watch: Celebrity nutritionist Lovneet Batra shares tips to keep fatigue at bay - Firstpost", "description": "If you are feeling sluggish and tired all the time, you might need to take a look at your lifestyle choices. Nutritionist Lovneet Batra has shared some easy tips in her recent Instagram post that can be of help while dealing with fatigue.", "url": "https://www.firstpost.com/living/watch-celebrity-nutritionist-lovneet-batra-shares-tips-to-keep-fatigue-at-bay-10834061.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/08/fatigue-640.jpg", "publishedAt": "2022-06-24T13:01:22Z", "content": "If you are feeling sluggish and tired all the time, you might need to take a look at your lifestyle choices. Nutritionist Lovneet Batra has shared some easy tips in her recent Instagram post that can… [+2533 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Tau proteins weakens transmission across synapses, leading to Alzheimers disease - News9 LIVE", "description": "The study indicates that a small peptide called PHDP5 can potentially be used to treat Alzheimer's", "url": "https://www.news9live.com/science/tau-proteins-weakens-transmission-across-synapses-leading-to-alzheimers-disease-178448", "urlToImage": "https://media.news9live.com/h-upload/2022/06/24/437241-20220622-headercropped1.jpg", "publishedAt": "2022-06-24T13:00:01Z", "content": "Neurons in the brain die in patients suffering from Alzheimer's disease, slowly degrading memory and thinking abilities. Alzheimer's disease is the most common type of dementia, impacting 50 million … [+2543 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "GIBS to organise the 7th Annual Congress on IC/BPS GIBS 2022 in August - Express Healthcare", "description": "The 2022 annual conference of GIBS has been envisaged around the current theme \"Save a Bladder -Save a Family”", "url": "https://www.expresshealthcare.in/news/gibs-to-organise-the-7th-annual-congress-on-ic-bps-gibs-2022-in-august/435522/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/06/kidney-1.jpg", "publishedAt": "2022-06-24T12:47:52Z", "content": "The 2022 annual conference of GIBS has been envisaged around the current theme “Save a Bladder -Save a Family\r\nGlobal Interstitial Cystitis, Bladder Pain Society (GIBS) has announced that the 7th Ann… [+1871 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Do you have a COVID cough? Experts reveal the best sleeping position for relief - Times of India", "description": "Persistent cough was one of the most reported symptoms of COVID-19 during the second wave of coronavirus. While with the Omicron variant, sore throat, runny nose, and body pain have become more common, cough continues to be one of the reigning COVID-19 sympto…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-do-you-have-a-covid-cough-experts-reveal-the-best-sleeping-position-for-relief/photostory/92432521.cms", "urlToImage": "https://static.toiimg.com/photo/92432531.cms", "publishedAt": "2022-06-24T12:30:00Z", "content": "There are several other ways to treat COVID cough.\r\nThe NHS recommends, \"To help ease a cough, try having a teaspoon of honey. But do not give honey to babies under 12 months. If this does not help, … [+723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "New ICMR study reports silent spread of Zika virus in India - The Indian Express", "description": "“We wanted to determine the presence of the virus from different geographical regions and hence researchers from the National Institute of Virology Pune and other ICMR institutes screened clinical samples of 1,475 patients from May-Oct 2021 and re-tested them…", "url": "https://indianexpress.com/article/cities/pune/zika-virus-spread-icmr-study-india-7989210/", "urlToImage": "https://images.indianexpress.com/2021/07/zika-3.jpg", "publishedAt": "2022-06-24T12:18:41Z", "content": "A new study of the Indian Council of Medical Research (ICMR) has indicated the spread of the Zika virus to several states of India and calls for an urgent need to strengthen its surveillance. Researc… [+3791 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Travel-therapy can provide real mental health and well being benefits: Study - ThePrint", "description": "Washington [US], June 24 (ANI): A new cross-disciplinary paper from Edith Cowan University (ECU) proposes we change the way we view tourism, seeing it not just as a recreational experience but as an industry that can provide real health benefits. The collabor…", "url": "https://theprint.in/features/travel-therapy-can-provide-real-mental-health-and-well-being-benefits-study/1010791/", "urlToImage": null, "publishedAt": "2022-06-24T12:13:49Z", "content": "Washington [US], June 24 (ANI): A new cross-disciplinary paper from Edith Cowan University (ECU) proposes we change the way we view tourism, seeing it not just as a recreational experience but as an … [+2755 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "The Conversation", "title": "Traces of Poliovirus detected in London sewage: A guide to understand the disease - Firstpost", "description": "Poliomyelitis (polio) is a devastating disease that historically has caused paralysis and death around the world. It is caused by polioviruses, small RNA viruses that can damage cells in the nervous system", "url": "https://www.firstpost.com/health/traces-of-poliovirus-detected-in-london-sewage-a-guide-to-understand-the-disease-10832991.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/06/Polio1.jpg", "publishedAt": "2022-06-24T11:24:21Z", "content": "Poliomyelitis (polio) is a devastating disease that historically has caused paralysis and death around the world. It is caused by polioviruses, small RNA viruses that can damage cells in the nervous … [+4453 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "CDC is investigating the outbreak of the meningococcal disease in gay and bisexuals in Florida, here's all - Economic Times", "description": "After what is being described among the worst outbreaks, CDC is investigating the meningococcal disease in bisexual and gay men in Florida. Find out how the investigation is underway.", "url": "https://economictimes.indiatimes.com/news/international/us/cdc-is-investigating-the-outbreak-of-the-meningococcal-disease-in-gay-and-bisexuals-in-florida-heres-all-you-need-to-know-about-the-disease/articleshow/92434507.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92434490,width-1070,height-580,imgsize-27064,overlay-economictimes/photo.jpg", "publishedAt": "2022-06-24T10:14:00Z", "content": "There has been an increased incidence of meningococcal disease in Florida's gay and bisexual men. This has made the Florida Department of Health and the US Centre for Disease Control take action and … [+2304 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Immunocompromised woman remains COVID-19 positive for 124 days, treated with breast milk - DNA India", "description": "COVID-19 news: The breast milk was donated by a woman who had been vaccinated against the coronavirus.", "url": "https://www.dnaindia.com/health/report-immunocompromised-woman-remains-covid-19-positive-for-124-days-treated-with-breast-milk-2963215", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/06/24/2461609-2459618-covid.jpg", "publishedAt": "2022-06-24T09:51:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Jun 24, 2022, 03:26 PM ISTIn a rare case of long Covid, a woman with a rare genetic disease that made her immunocompromised, rema… [+1796 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Erectile dysfunction drugs may help treat oesophageal cancer: Research - Sentinelassam - The Sentinel Assam", "description": "A group of drugs commonly used to treat erectile dysfunction may be able to boost the effect of...", "url": "https://www.sentinelassam.com/international/erectile-dysfunction-drugs-may-help-treat-oesophageal-cancer-research-598904", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/06/24/358106-erec.jpg", "publishedAt": "2022-06-24T09:50:22Z", "content": "LONDON: A group of drugs commonly used to treat erectile dysfunction may be able to boost the effect of chemotherapy in oesophageal cancer, according to new research. Oesophageal cancer affects the f… [+2748 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Inability to balance on one leg for 10 seconds linked to early death: study - Telangana Today", "description": "Inability to balance on one leg for 10 seconds linked to early death: study", "url": "https://telanganatoday.com/inability-to-balance-on-one-leg-for-10-seconds-linked-to-early-death-study", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/06/Inability-to-balance-on-one-leg-for-10-seconds-linked-to-early-death-study.jpg", "publishedAt": "2022-06-24T09:44:01Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds women itch less as compared to men - ANI News", "description": "Kyoto [Japan], June 24 (ANI): Human females have a significantly lower incidence of severe psoriasis, which is one of the many factors that men may find to be envious of them at least when it comes to severe skin inflammation, according to a study led by a te…", "url": "https://www.aninews.in/news/lifestyle/others/study-finds-women-itch-less-as-compared-to-men20220624150630", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Screenssfshot_2022-06-24_15053620220624093552.jpg", "publishedAt": "2022-06-24T09:36:00Z", "content": "Kyoto [Japan], June 24 (ANI): Human females have a significantly lower incidence of severe psoriasis, which is one of the many factors that men may find to be envious of them at least when it comes t… [+1422 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Prediction of difficulty in direct laryngoscopy | Scientific Reports - Nature.com", "description": "Scientific Reports - Prediction of difficulty in direct laryngoscopy", "url": "https://www.nature.com/articles/s41598-022-13523-4", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-13523-4/MediaObjects/41598_2022_13523_Fig1_HTML.png", "publishedAt": "2022-06-24T09:23:39Z", "content": "Difficult laryngeal exposure, although not a common situation encountered in laryngology, may cause problems for the surgeon, especially if he or she is not prepared, and for the patient with the ris… [+9126 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Obesity and genetics: Expert shares insights - Hindustan Times", "description": "From burning less calories to the presence of the FTO gene in the body, the expert addressed the issue of obesity and its relationship with the genetic makeup of the body. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/obesity-and-genetics-expert-shares-insights-101656058913664.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/24/1600x900/7543ff1e-5919-11ec-9219-1c314990d170_1639072717268_1656058957464.jpg", "publishedAt": "2022-06-24T08:24:38Z", "content": "Obesity is a health condition which involves accumulation of a large amount of fat. Unlike what we think, Obesity is not just a cosmetic condition. It, in fact, involves and increases the risk of a l… [+1890 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Monkeypox outbreak: How to protect yourself against monkeypox virus and what to do if you have symptoms | Mint - Mint", "description": "Monkeypox outbreak: Read here to find out how to protect yourself from monkeypox virus and what to do if you have symptoms", "url": "https://www.livemint.com/news/india/monkeypox-outbreak-how-to-protect-yourself-from-virus-and-what-to-do-if-you-have-symptoms-11656052076390.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/HEALTH-MONKEYPOX--0_1653094497933_1656057416268.JPG", "publishedAt": "2022-06-24T08:20:16Z", "content": "Monkeypox outbreak: With over 3,200 confirmed monkeypox cases and one death, the World Health Organisation convened its emergency committee on Thursday to consider if the spiraling outbreak of monkey… [+3107 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Arpita Sarkar", "title": "What Is Radiotherapy? How Is It Used In Treatment Of Cancer? - Woman's Era", "description": "Womansera magazine is a platform for women to get latest info and tips on fashion, beauty, health and relationship advice. Subscribe to India's No.1 women's magazine!", "url": "https://womansera.com/what-is-radiotherapy-how-is-it-used-in-treatment-of-cancer/", "urlToImage": "https://womansera.com/wp-content/uploads/2022/06/radio.jpg", "publishedAt": "2022-06-24T07:58:27Z", "content": "Radiotherapy or Radiation Therapy is one of the most widely used treatments for cancer. Physicians recommend radiotherapy based on the type of cancer. According to statistics, at present 67% of patie… [+2016 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Symptomatology of long COVID among children below 14 years of age in Denmark - News-Medical.Net", "description": "Researchers investigated long COVID symptoms among SARS-CoV-2-infected Danish children below 14 years of age.", "url": "https://www.news-medical.net/news/20220624/Symptomatology-of-long-COVID-among-children-below-14-years-of-age-in-Denmark.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_717640_16560571689321927.jpg", "publishedAt": "2022-06-24T07:57:00Z", "content": "In a recent study published in The Lancet Child and Adolescent Health, researchers investigated long coronavirus disease (COVID) symptoms among severe acute respiratory syndrome coronavirus 2 (SARS-C… [+6535 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "ANI", "title": "Researchers find molecular factors to treat melanoma skin cancer - Telangana Today", "description": "Researchers find molecular factors to treat melanoma skin cancer", "url": "https://telanganatoday.com/researchers-find-molecular-factors-to-treat-melanoma-skin-cancer", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/02/cropped-android-chrome-512x512-1-267x267-2.png", "publishedAt": "2022-06-24T07:27:24Z", "content": null}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Nearly 1 in 5 American adults report having long Covid - Ahmedabad Mirror", "description": "Nearly one out of five adults in the US who previously had Covid-19 now report having symptoms of long COVID, according to new data revealed by the government.\n\nThe data published was sourced through the &quot;Household Pulse Survey&quot; conducted by the US …", "url": "https://ahmedabadmirror.com/nearly-1-in-5-american-adults-report-having-long-covid/81836621.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1656054321645.jpg-org", "publishedAt": "2022-06-24T07:17:18Z", "content": "Nearly one out of five adults in the US who previously had Covid-19 now report having symptoms of long COVID, according to new data revealed by the government.\r\nThe data published was sourced through… [+760 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Ayati Devices introduces diabetic neuropathy screener VIBRASENSE - BSI bureau", "description": "The technology has been developed at IIT Bombay and is CDSCO approved", "url": "https://www.biospectrumindia.com/news/20/21483/ayati-devices-introduces-diabetic-neuropathy-screener-vibrasense.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/vibrasense-21483.jpg", "publishedAt": "2022-06-24T06:14:05Z", "content": "Mumbai-based heathcare startup Ayati Devices has introduced VIBRASENSE, which can detect foot ulcers. VIBRASENSE is a quick screening tool that quantifies the severity of foot neuropathy.\r\nThe device… [+549 chars]"}, {"source": {"id": null, "name": "Updatenews360.com"}, "author": null, "title": "Monkeypox may soon get a new name by WHO - Updatenews360", "description": "Spread the loveThe World Health Organization announced last week that it is “working with partners...", "url": "https://www.updatenews360.com/english/international/monkeypox-may-soon-get-a-new-name-by-who/", "urlToImage": "https://www.updatenews360.com/english/wp-content/uploads/2022/06/Untitled-4-11.jpg", "publishedAt": "2022-06-24T06:11:23Z", "content": "The World Health Organization announced last week that it is “working with partners and experts from around the world on changing the name of monkeypox virus, its clades and the disease it causes.”\r\n… [+517 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "BP monitors: Digital vs Manual, just what you need to know - ETHealthWorld", "description": "Blood pressure is one of the most important indicators used by healthcare practitioners to assess a patient's health, and with the increasing number of BP health concerns amongst the population, it is becoming necessary to check one's blood pressure regularly…", "url": "https://health.economictimes.indiatimes.com/news/medical-devices/bp-monitors-digital-vs-manual-just-what-you-need-to-know/92427574", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92427574,imgsize-40754,width-1200,height-628,overlay-ethealthworld/bp-monitors-digital-vs-manual-just-what-you-need-to-know.jpg", "publishedAt": "2022-06-24T05:30:00Z", "content": "A trip to the doctor is no longer necessary, especially to check our vital signs like blood pressure, sugar levels, and temperature. Although medical equipment and monitors for taking these readings … [+3669 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Covid reinfection risks rising, need to take precautions: 10 points from survey | Mint - Mint", "description": "18% citizens surveyed have had one or more in the family who got reinfected with Covid-19 in the last six months.In the case of Covid reinfection, people have faced organ system disorder: lungs by 5%, cardiovascular by 5%, blood disorder by 2.6%, fatigue by 3…", "url": "https://www.livemint.com/news/india/covid-reinfection-risks-rising-need-to-take-precautions-10-points-from-survey-11656041551351.html", "urlToImage": "https://images.livemint.com/img/2022/06/24/600x338/Covid-19-Testing_1656048281771_1656048282025.jpg", "publishedAt": "2022-06-24T05:26:34Z", "content": "The latest survey on Covid-19 cases has revealed that 2 in 10 families surveyed were reinfected from the respiratory infection in the last six months. \"45% got their reinfection weeks after the origi… [+2426 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Should diabetics have jackfruit or kathal? | Lifestyle News - The Indian Express", "description": "Packed with vitamins, trace minerals, and antioxidants, jackfruits are an excellent source of fibre. But, should diabetics consume it?", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-jackfruit-katahal-kathal-benefits-blood-sugar-health-7986574/", "urlToImage": "https://images.indianexpress.com/2022/06/jackfruit1200.jpg", "publishedAt": "2022-06-24T05:20:56Z", "content": "According to the World Health Organization, diabetes — a chronic, metabolic disease — “is a growing challenge in India with an estimated 8.7 per cent diabetic population in the age group of 20 and 70… [+2648 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "What is liquid biopsy that can detect breast cancer & why it's important for patients undergoing chemo? - Economic Times", "description": "A liquid biopsy is a non-invasive alternative to surgical biopsies.", "url": "https://economictimes.indiatimes.com/magazines/panache/what-is-liquid-biopsy-that-can-detect-metastatic-breast-why-its-important-for-cancer-patients-undergoing-chemo/articleshow/92426981.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92427312,width-1070,height-580,imgsize-1318041,overlay-etpanache/photo.jpg", "publishedAt": "2022-06-24T05:12:00Z", "content": "The easiest and the earliest way of detecting breast tumors (or cancer) is a breast scan. However, following that initial step, mammography and biopsy are often painful for some women. But, now a new… [+1815 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Oldest antibiotic prevents rheumatic heart disease, but India’s burden still high. Here’s why - ThePrint", "description": "Rheumatic heart disease is associated with a bacterial infection that can later manifest as heart problems. WHO says it’s the most commonly acquired heart disease in people under 25.", "url": "https://theprint.in/health/oldest-antibiotic-prevents-rheumatic-heart-disease-but-indias-burden-hasnt-eased-heres-why/1008821/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/06/reh.jpg", "publishedAt": "2022-06-24T05:01:02Z", "content": "New Delhi: Much has been written about Indias burden of non-communicable diseases such as diabetes and hypertension, but there’s also an infectious disease component to some of them. One of them is r… [+5946 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Prof (Dr) Saransh Jain", "title": "How Drugs and Substance Abuse Affect Your Sex Life and How to Overcome It - News18", "description": "Substance use disorder is a medical problem, not a moral or personal failure. Once you are free from active addiction, you can begin addressing other areas of physical and emotional well-being, including your sexual health", "url": "https://www.news18.com/news/lifestyle/how-drugs-and-substance-abuse-affect-your-sex-life-and-how-to-overcome-it-5424361.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/untitled-design-6-29-164458869716x9.png", "publishedAt": "2022-06-24T03:00:23Z", "content": "Sex may permeate our popular culture, but conversations about it are still associated with stigma and shame in Indian households. As a result, most individuals dealing with sexual health issues or tr… [+5821 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mild COVID causes increase in neurotoxic metabolites - News-Medical.Net", "description": "In a recent study posted to the bioRxiv* pre-print server, researchers investigated the blood levels of neurotoxic metabolites in patients with mild coronavirus disease 2019 (COVID-19).", "url": "https://www.news-medical.net/news/20220623/Mild-COVID-causes-increase-in-neurotoxic-metabolites.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_717623_16560380794303868.jpg", "publishedAt": "2022-06-24T02:42:00Z", "content": "In a recent study posted to the bioRxiv* pre-print server, researchers investigated the blood levels of neurotoxic metabolites in patients with mild coronavirus disease 2019 (COVID-19).\r\nStudy: Incre… [+7143 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Omega-3 supplementation significantly reduces homocysteine levels, lowering CVD risk: Study - Medical Dialogues", "description": "Tehran, Iran: Omega 3 supplementation significantly improves plasma homocysteine (Hcy) levels, show...", "url": "https://medicaldialogues.in/diet-nutrition/news/omega-3-supplementation-significantly-reduces-homocysteine-levels-lowering-cvd-risk-study-94945", "urlToImage": "https://medicaldialogues.in/h-upload/2020/07/15/131702-omega-3.jpg", "publishedAt": "2022-06-24T01:15:57Z", "content": "Tehran, Iran: Omega 3 supplementation significantly improves plasma homocysteine (Hcy) levels, show results from a meta-analysis. Further studies however will be needed to confirm the findings. The s… [+2295 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marcia Frellick", "title": "Typhoid Fever Bacteria Becoming More Resistant to Antibiotics - Medscape", "description": "Typhoid Fever Bacteria Becoming More Resistant to Antibiotics", "url": "https://www.medscape.com/viewarticle/976136", "urlToImage": "https://img.medscape.com/thumbnail_library/Medscape_News.jpg", "publishedAt": "2022-06-24T00:37:00Z", "content": "Bacteria that cause typhoid fever are becoming increasingly resistant to common antibiotics worldwide, a new analysis indicates.\r\nResistant strains of Salmonella enterica serovar Typhi (S Typhi) almo… [+5867 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "TS witnesses surge in dengue, malaria cases - The New Indian Express", "description": "As it has started raining at some places in the State, the water stagnates in empty places around residences, contributing to the rise of the cases.", "url": "https://www.newindianexpress.com/states/telangana/2022/jun/24/ts-witnesses-surge-in-dengue-malaria-cases-2469179.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/4/30/w600X390/RECOVERING_.jpg", "publishedAt": "2022-06-24T00:30:00Z", "content": "HYDERABAD: The State has reported more than 500 cases of dengue since the beginning of this year with approximately 103 cases reported in the last month. Lack of awareness among people about dengue p… [+2179 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Girls and boys show similar rates of concerns for ASD, research finds - News-Medical.Net", "description": "Published in Biological Psychiatry, a multidisciplinary study led by the University of Minnesota demonstrated that an equal number of girls and boys can be identified as having concerns for autism spectrum disorder (ASD) when screened earlier, correcting larg…", "url": "https://www.news-medical.net/news/20220623/Girls-and-boys-show-similar-rates-of-concerns-for-ASD-research-finds.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Autism-620x480.jpg", "publishedAt": "2022-06-24T00:22:00Z", "content": "Published in Biological Psychiatry, a multidisciplinary study led by the University of Minnesota demonstrated that an equal number of girls and boys can be identified as having concerns for autism sp… [+3002 chars]"}, {"source": {"id": null, "name": "Intelligentliving.co"}, "author": "Jennifer Barns", "title": "6 Tips You Need To Hear If You Suffer From Diabetes - Intelligent Living", "description": "If you are someone that suffers from diabetes, then you know how difficult it can be to manage the condition. There are so many things that you have to keep track of, including your blood sugar levels, the foods that you eat, and how much exercise you get eac…", "url": "https://www.intelligentliving.co/6-tips-you-need-to-hear-if-you-suffer-from-diabetes/", "urlToImage": "https://www.intelligentliving.co/wp-content/uploads/2022/06/diabetes-blood-test.jpg", "publishedAt": "2022-06-24T00:21:41Z", "content": "If you are someone that suffers from diabetes, then you know how difficult it can be to manage the condition. There are so many things that you have to keep track of, including your blood sugar level… [+5831 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Deep Shukla", "title": "COVID-19: Simple glucose meter test could tell if you have antibodies - Medical News Today", "description": "Researchers have developed a new rapid, cost-effective glucose-meter test that could help people assess their immunity against COVID-19.", "url": "https://www.medicalnewstoday.com/articles/could-glucose-meters-be-used-to-assess-immunity-against-covid-19", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/06/glucose_meter_GettyImages1360140280_Thumb.jpg", "publishedAt": "2022-06-23T16:52:13Z", "content": "<ul><li>Current assays that can accurately measure antibody levels against SARS-CoV-2the virus that causes COVID-19are costly, time-consuming, and require sophisticated detection systems.</li><li>How… [+7142 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Research finds skin disorders can affect mental health of children, young people - ThePrint", "description": "Washington [US], June 23 (ANI): Skin disorders can have a devastating impact on the physical and mental health of children and young people and although effective treatments are available, they are scarce, researchers have said. The Medical Research Foundatio…", "url": "https://theprint.in/health/research-finds-skin-disorders-can-affect-mental-health-of-children-young-people/1009521/", "urlToImage": null, "publishedAt": "2022-06-23T16:14:00Z", "content": "Washington [US], June 23 (ANI): Skin disorders can have a devastating impact on the physical and mental health of children and young people and although effective treatments are available, they are s… [+7508 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study analyzes the contagious capacity of a single drop of saliva - News-Medical.Net", "description": "A study by the UPV/EHU-University of the Basque Country has established that the two-meter safety distance may be reasonable for preventing Covid-19 infection.", "url": "https://www.news-medical.net/news/20220623/Study-analyzes-the-contagious-capacity-of-a-single-drop-of-saliva.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-06-23T14:34:00Z", "content": "A study by the UPV/EHU-University of the Basque Country has established that the two-meter safety distance may be reasonable for preventing Covid-19 infection.\r\nAccording to a study published in the … [+3490 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Hyponatremia in patients with acute myocardial infarction tied to mortality risk: BMC - Medical Dialogues", "description": "USA: Hyponatremia on admission and at any points within first 7 days of hospitalization in patients...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/hyponatremia-in-patients-with-acute-myocardial-infarction-tied-to-mortality-risk-bmc-94874", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/22/179094-hospital-admission.jpg", "publishedAt": "2022-06-23T14:30:28Z", "content": "USA: Hyponatremia on admission and at any points within first 7 days of hospitalization in patients with acute myocardial infarction is associated with in-hospital and 30-day mortality, says a new st… [+2079 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Hiral patel", "title": "Glycemic gap increases mortality risk in critically ill diabetes patients: Study - Medical Dialogues", "description": "China: An article published in the Journal of Intensive Care Medicine states that Glycemic Gap is...", "url": "https://medicaldialogues.in/critical-care/news/glycemic-gap-increases-mortality-risk-in-critically-ill-diabetes-patients-study-94854", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/24/179323-untitled-design-7.jpg", "publishedAt": "2022-06-23T14:30:06Z", "content": "China: An article published in the Journal of Intensive Care Medicine states that Glycemic Gap is independently associated with an increased risk of mortality in critically ill diabetic patients. ICU… [+2536 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight", "title": "Weight loss expert, Dr. Mohit Bhandari on metabolic health, and the globally acclaimed weight-loss innovat - Economic Times", "description": "To help people in their weight loss journey, there is a new innovation named Allurion. Read to know more about Allurion method of losing weight", "url": "https://economictimes.indiatimes.com/magazines/panache/weight-loss-expert-dr-mohit-bhandari-on-metabolic-health-and-the-globally-acclaimed-weight-loss-innovation-allurion/articleshow/92415528.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92415504,width-1070,height-580,imgsize-16018,overlay-etpanache/photo.jpg", "publishedAt": "2022-06-23T13:27:00Z", "content": "Modern lifestyle is largely sedentary in nature, owing to which many of us fail to meet our daily physical activity requirements. The impact of it has been further bolstered by the Covid-19 pandemic … [+8438 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can diabetes-prone children have fun during vacations? Yes - The Indian Express", "description": "Encourage your child to take part in physical activities outdoors, adopt healthy eating habits and watch his weight, says Dr Suranjit Chatterjee, Senior Consultant, Internal Medicine, Indraprastha Apollo Hospital, Delhi", "url": "https://indianexpress.com/article/lifestyle/health/can-diabetes-prone-children-have-fun-during-vacations-yes-7986974/", "urlToImage": "https://images.indianexpress.com/2022/06/Doctor.jpg", "publishedAt": "2022-06-23T12:46:47Z", "content": "For children, vacation is synonymous with freedom, fun and food. They dont want any interference from anyone during this time and parents indulge them too. But, as a parent, you know your child best … [+4987 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Study: Mushroom extract supports clearing human papillomavirus (HPV) infections - DNA India", "description": "A recent study by researchers of UT Health Houston discovered that using mushroom extract daily helps the immune system in clearing human papillomavirus (HPV) infections. The findings of the research were published in the journal 'Frontiers in Oncology'. The …", "url": "https://www.dnaindia.com/lifestyle/video-study-mushroom-extract-supports-clearing-human-papillomavirus-hpv-infections-2962962", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/06/23/2442313-1655980954-00000004.jpg", "publishedAt": "2022-06-23T10:42:42Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Cara Williams", "title": "What is the connection between the thyroid and diabetes? - Medical News Today", "description": "What is the link between thyroid diseases and diabetes? Read on to learn more about the connection between these two endocrine disorders.", "url": "https://www.medicalnewstoday.com/articles/thyroid-and-diabetes", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/04/Diabetes_thyroid_GettyImages518008997_Thumb.jpg", "publishedAt": "2022-06-23T10:26:24Z", "content": "Diabetes and thyroid disorders are relatively common conditions that involve problems with hormones. While researchers are unsure of the exact cause, growing evidence suggests a link between these co… [+7939 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Mahabubnagar farmer recovers after complex brain surgery at Medicover Hospitals - Telangana Today", "description": "Mahabubnagar farmer recovers after complex brain surgery at Medicover Hospitals", "url": "https://telanganatoday.com/mahabubnagar-farmer-recovers-after-complex-brain-surgery-at-medicover-hospitals", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/06/Mahabubnagar-farmer-recovers-after-complex-brain-surgery-at-Medicover-Hospitals.jpg", "publishedAt": "2022-06-23T09:55:14Z", "content": null}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Anna Smith", "title": "Cerebral venous thrombosis: Causes, treatment, and diagnosis - Medical News Today", "description": "Cerebral venous thrombosis (CVT) is when a blood clot forms in a vein of the brain. This can lead to burst blood vessels that leak into brain tissues.", "url": "https://www.medicalnewstoday.com/articles/venous-thrombosis-brain", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/05/cerebral_thrombosis_GettyImages1235741663_Thumb.jpg", "publishedAt": "2022-06-23T09:52:41Z", "content": "Cerebral venous thrombosis (CVT) is when a blood clot forms in a vein of the brain. This can lead to blood vessels breaking, causing blood to leak into brain tissues.\r\nThe cerebral veins are a networ… [+6611 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Healthy and quick breakfast tips for busy working women - Times of India", "description": "Breakfast is the most important meal of the day as it literally breaks the overnight fasting period, as the name su", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/healthy-and-quick-breakfast-tips-for-busy-working-women/articleshow/92406615.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92406590,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-90240/92406590.jpg", "publishedAt": "2022-06-23T08:00:00Z", "content": "Breakfast is the most important meal of the day as it literally breaks the overnight fasting period, as the name suggests!\r\nYoure running to work, but sadly, a store-bought muffin just wont cut it. T… [+2602 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Manchester: Blood vessel breakthrough major step towards Alzheimer’s treatment - India Education Diary", "description": "A breakthrough in our understanding of Alzheimer’s disease has revealed changes to blood vessels in the brain, potentially presenting a path for developing new drugs to help fight the disease, according to University of Manchester research funded by", "url": "https://indiaeducationdiary.in/university-of-manchester-blood-vessel-breakthrough-major-step-towards-alzheimers-treatment/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/01/﻿The-University-of-Manchester.jpg", "publishedAt": "2022-06-23T06:15:55Z", "content": "A breakthrough in our understanding of Alzheimers disease has revealed changes to blood vessels in the brain, potentially presenting a path for developing new drugs to help fight the disease, accordi… [+3034 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Toxic Particles Once Inhaled May Travel Directly to The Brain, Study Suggests - ScienceAlert", "description": "Air pollution doesn't just impact the health of your lungs and heart. Recent research has found fine particulate matter can also cause damage to the brain, and scientists think they've finally figured out how.", "url": "https://www.sciencealert.com/researchers-uncover-a-potential-highway-that-carries-air-pollution-to-the-brain", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/AirPollutionBrainInvasion_1024.jpg", "publishedAt": "2022-06-23T06:07:39Z", "content": "Air pollution doesn't just impact the health of your lungs and heart. Recent research has found fine particulate matter can also cause damage to the brain, and scientists think they've finally figure… [+3751 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "Headaches in pregnancy: All you need to know - The Indian Express", "description": "To prevent stress from building up into a headache you can consult a physiotherapist.", "url": "https://indianexpress.com/article/parenting/health-fitness/headaches-pregnancy-causes-symptoms-prevention-treatment-7985080/", "urlToImage": "https://images.indianexpress.com/2020/07/pregnant-women-1200.jpg", "publishedAt": "2022-06-23T05:30:50Z", "content": "If youre pregnant and having headaches, youre not alone. It is common for a pregnant woman to suffer from headaches or migraines. Studies show that around 40 percent and 50 percent of pregnant women … [+7865 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Is Psoriasis Contagious? Ayurveda Expert Debunks Common Myths - News18", "description": "Recently, Ayurveda expert Dr Nitika Kohli shared a series of photos on Instagram debunking the myths about psoriasis.", "url": "https://www.news18.com/news/lifestyle/is-psoriasis-contagious-ayurveda-expert-debunks-common-myths-5420731.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/untitled.jpg", "publishedAt": "2022-06-23T03:43:08Z", "content": "Psoriasis is not contagious, but if not treated at an early stage this may lead to serious conditions\r\nThe most common misconception about several skin diseases is that they are contagious and its no… [+9404 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Myths surrounding salt being bad, less consumption of salt helps in weight loss - Hindustan Times", "description": "Is salt is an unnecessary ingredient in the diet? Going low on salt can help lose weight? Can we do without any salt in our diet? Nutritionists bust myths surrounding salt and differentiate health facts from fiction  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/myths-surrounding-salt-being-bad-less-consumption-of-salt-helps-in-weight-loss-101655949793384.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/23/1600x900/pexels-artem-beliaikin-452744_1655950100422_1655950118544.jpg", "publishedAt": "2022-06-23T02:18:50Z", "content": "Salt is important for taste and it is no secret that food without salt is tasteless nor can one cherish food without salt but it is also believed that salt is out to kill and we shouldnt be eating an… [+2838 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Study Shows New Tuft Cell Development for Treating Lung Cancer - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. In 2018, Professor Christopher Vakoc's team at Cold Spring Harbor Laboratory (CSHL) discovered a new type of small cell lung cancer.", "url": "https://www.latestly.com/agency-news/science-news-study-shows-new-tuft-cell-development-for-treating-lung-cancer-3860109.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/06/represenative_image_13.06.2220220613140150202206141644442022061916504220220622172356-588x441.jpg", "publishedAt": "2022-06-23T00:00:26Z", "content": "New York [US], June 23 (ANI): In 2018, Professor Christopher Vakoc's team at Cold Spring Harbor Laboratory (CSHL) discovered a new type of small cell lung cancer.\r\nThe Vakoc team discovered how tufte… [+2321 chars]"}]}