{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "PsyPost"}, "author": "Ben Singh, Carol Maher, and Jacinta Brinsley", "title": "Review of 1,039 studies indicates exercise can be more effective than counselling or medication for depression - PsyPost", "description": "A study published in the British Journal of Sports Medicine reviewed more than 1,000 research trials examining the effects of physical activity on depression, anxiety, and psychological distress. It showed exercise is an effective way to treat mental health i…", "url": "https://www.psypost.org/2023/03/review-of-1039-studies-indicates-exercise-can-be-more-effective-than-counselling-or-medication-for-depression-68813", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/03/woman-and-man-lifting-barbells-in-gym.jpg", "publishedAt": "2023-03-03T18:56:15Z", "content": "The world is currently grappling with a mental health crisis, with millions of people reporting depression, anxiety, and other mental health conditions. According to recent estimates, nearly half of … [+5084 chars]"}, {"source": {"id": null, "name": "Big Think"}, "author": "Peter Rogers", "title": "Tirzepatide: A novel obesity drug ushers in a new era of weight loss — because this one works - Big Think", "description": "Scientists are still figuring out why tirzepatide causes weight loss. One theory is that they “accidentally” created a new hormone.", "url": "https://bigthink.com/health/tirzepatide-novel-obesity-drug-actually-works/", "urlToImage": "https://bigthink.com/wp-content/uploads/2023/03/AdobeStock_183618080-copy.jpg?resize=1200,630", "publishedAt": "2023-03-03T17:00:00Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Caitlin Tilley", "title": "China reports TWO human cases of bird flu in middle-aged man and woman hundreds of miles apart - Daily Mail", "description": "The woman, from the Jiangsu province in eastern China, tested positive for the H5N1 strain of bird flu last month. A man from southern China has tested positive for H5N6.", "url": "https://www.dailymail.co.uk/health/article-11812571/China-reports-TWO-human-cases-bird-flu-middle-aged-man-woman-hundreds-miles-apart.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/02/21/68271561-0-image-a-77_1677792061927.jpg", "publishedAt": "2023-03-02T22:12:51Z", "content": "China has reported two human cases of bird flu in a man and woman more than 800 hundreds miles apart amid growing concerns the virus is poised to spill over into people and cause a pandemic.\r\nThe 53-… [+9106 chars]"}]}