{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research sheds light on cardiac pathology mechanisms of COVID-19 - News-Medical.Net", "description": "Researchers compared cardiac autopsy samples from severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) positive cases with age-matched samples from influenza hemagglutinin 1 neuraminidase 1 (H1N1) cases, non-influenza lymphocytic myocarditis cases, an…", "url": "https://www.news-medical.net/news/20221115/Research-sheds-light-on-cardiac-pathology-mechanisms-of-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731208_16685593586819941.jpg", "publishedAt": "2022-11-16T00:43:00Z", "content": "In a recent study published in the journal Angiogenesis, a team of researchers compared cardiac autopsy samples from severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) positive cases with a… [+7674 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "The need for the Government to encourage advanced research on reversing diabetes - ETHealthWorld", "description": "Due to the 10–15 years of gradual and concealed progression of type 2 diabetes, many people are unaware of their diabetes risk or that they have the condition. Consequently, it poses a significant threat to global health. There is an urgent need for the gover…", "url": "https://health.economictimes.indiatimes.com/news/industry/the-need-for-the-government-to-encourage-advanced-research-on-reversing-diabetes/95521669", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95521669,imgsize-57006,width-1200,height-628,overlay-ethealthworld/the-need-for-the-government-to-encourage-advanced-research-on-reversing-diabetes.jpg", "publishedAt": "2022-11-15T23:59:00Z", "content": "by Dr. Ashu GoyalDiabetes is a chronic illness and affects more than 425 million people across the globe. While one-third of the diabetic population is older than 65, an escalating number of children… [+4749 chars]"}, {"source": {"id": null, "name": "Spectrum"}, "author": "Spectrum", "title": "Tying PPFIA3 to autism: A quick take at SfN with Tuan Chao and Maimuna Paul | Spectrum - Spectrum - Autism Research News ", "description": "Work in fruit flies has helped Paul decode a neurodevelopmental syndrome in children caused by rare de novo variants in the gene PPFIA3.", "url": "https://www.spectrumnews.org/news/tying-ppfia3-to-autism-a-quick-take-at-sfn-with-tuan-chao-and-maimuna-paul/", "urlToImage": "https://spectrumnews-web-assets.s3.amazonaws.com/wp-content/uploads/2022/11/15165423/844-Chao-Paul-SFN-autism-thumbnail.jpg", "publishedAt": "2022-11-15T22:58:50Z", "content": "Maimuna Paul, a postdoctoral researcher in Tuan Chaos lab at Baylor College of Medicine in Houston, Texas, presented a poster at Neuroscience 2022 describing a series of experiments in which she used… [+2640 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Multilevel Brain Atlases Provide Tools for Better Mental Health Diagnosis - Neuroscience News", "description": "A newly developed brain atlas could help with the study and diagnosis of mental health and neurodegenerative disorders by correlating brain networks with underlying anatomical structures.", "url": "https://neurosciencenews.com/brain-atlas-mental-health-21850/", "urlToImage": "https://neurosciencenews.com/files/2022/11/mental-health-brain-map-neurosicences.jpg", "publishedAt": "2022-11-15T21:24:52Z", "content": "Summary: A newly developed brain atlas could help with the study and diagnosis of mental health and neurodegenerative disorders by correlating brain networks with underlying anatomical structures.\r\nS… [+4792 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Robby Berman", "title": "Tomatoes linked to improved gut health, study finds - Medical News Today", "description": "A new study observed the effects of tomato consumption in pigs and noted a shift toward a more favorable gut microbiome. The tomato-fed pigs experienced greater diversity in their gut microbial community, believed to be a signifier of stronger gut health.", "url": "https://www.medicalnewstoday.com/articles/tomatoes-linked-to-improved-gut-health-study-finds", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/11/Tomatoes_gut_GettyImages1395555132_Thumb.jpg", "publishedAt": "2022-11-15T20:56:32Z", "content": "<ul><li>A recent study observed the effects of tomato consumption on the gut microbiome in pigs.</li><li>After 10 piglets were fed a diet of which 10% was freeze-dried tomato powder, their ratio of g… [+5138 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "A link between lethal childhood disease and age-related muscle decline - EurekAlert", "description": "Adopting some of the strategies behind successfully treating the childhood disease spinal muscular atrophy may enable development of therapies to curb the muscle decline that accompanies aging, new research suggests.", "url": "https://www.eurekalert.org/news-releases/971439", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-15T20:32:16Z", "content": "SAN DIEGO – Adopting some of the strategies behind successfully treating the childhood disease spinal muscular atrophy may enable development of therapies to curb the muscle decline that accompanies … [+4879 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "Morning exercise lowers risk of heart disease and stroke: Study - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/health/morning-exercise-lowers-risk-of-heart-disease-and-stroke-study", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2021-12%2F942ad009-c179-4986-8353-5268f4b994bc%2FIMG_20211204_105006.jpg?rect=0%2C0%2C3000%2C1575&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-11-15T19:56:35Z", "content": "San Francisco: Morning physical activity is associated with the lowest risk of heart disease and stroke, as per a new study.\r\nAccording to the study, which was published in the European Journal of Pr… [+428 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "How Can You Use Teleophthalmology to Prevent Vision Loss in Patients with Diabetes? | NIDDK - National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK)", "description": "Learn how health care professionals can improve eye health for patients with diabetes through teleophthalmology.", "url": "https://www.niddk.nih.gov/health-information/professionals/diabetes-discoveries-practice/2022/teleophthalmology-prevent-vision-loss-patients-diabetes", "urlToImage": "https://www.niddk.nih.gov/-/media/Images/Blog/2022-Blog-Post-Images/DDPB_Sitecore_Teleophthalmology_1200x700.jpg", "publishedAt": "2022-11-15T19:39:29Z", "content": "Are you ready to use teleophthalmology to prevent vision loss in patients with diabetes?\r\nAccording to the Centers for Disease Control and Prevention, more than 37 million people have diabetes in the… [+8962 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Dismantling five decades of public health policy with spurious interpretation of a single study may relapse nutritional blindness among vulnerable children in India | European Journal of Clinical Nutrition - Nature.com", "description": "European Journal of Clinical Nutrition - Dismantling five decades of public health policy with spurious interpretation of a single study may relapse nutritional blindness among vulnerable children...", "url": "https://www.nature.com/articles/s41430-022-01228-w", "urlToImage": null, "publishedAt": "2022-11-15T19:26:08Z", "content": "<li>Baethge C, Seger G. Our readers voice: Letters to the Editor are an important component of the discussion of scientific articles, in DeutschesÄrzteblatt as in Other Journals. Our correspondence p… [+2879 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "One-year-old boy dies of measles in Mumbai; 142 cases reported so far in 2022 - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/national/one-year-old-boy-dies-of-measles-in-mumbai-142-cases-reported-so-far-in-2022/459003.html", "urlToImage": "", "publishedAt": "2022-11-15T18:45:42Z", "content": "Mumbai, Nov 15 (PTI) A one-year-old boy has died of measles in Mumbai amid an outbreak of the viral infection in the city, where 142 cases of the disease have been recorded so far this year as agains… [+399 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Unraveling the biology behind aggressive pediatric brain tumor reveals potential new treatment avenue - EurekAlert", "description": "Researchers at the University of Michigan Rogel Cancer Center have identified a novel treatment approach to an aggressive type of pediatric brain cancer, using therapies already approved to treat cancer. The team developed a mouse model of pediatric glioma wi…", "url": "https://www.eurekalert.org/news-releases/971418", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/6bb6e367-330e-4ff5-836f-376361e02b1f/Rendition/thumbnail/Content/Public", "publishedAt": "2022-11-15T18:09:32Z", "content": "image: Immunostaining in a genetically engineered pediatric high grade glioma model harboring the H3-G34R mutation. Tumor cells are shown in green, nuclei in blue, and H3-G34-mutation in red.view mor… [+5658 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Health & Wellness News | ⚡When Is World COPD Day 2022? Know History, Significance and All About the Day - LatestLY", "description": "Read Latest Health & Wellness News Quickly Here | COPD is a type of progressive lung disease with symptoms including shortness of breath and cough, which may or may not produce mucus. The lung ailment progressively worsens, with everyday activities such as wa…", "url": "https://www.latestly.com/quickly/lifestyle/health-wellness/when-is-world-copd-day-2022-know-history-significance-and-all-about-the-day-4459050.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/11/World-COPD-Day-2022.jpg", "publishedAt": "2022-11-15T18:07:24Z", "content": "COPD is a type of progressive lung disease with symptoms including shortness of breath and cough, which may or may not produce mucus. The lung ailment progressively worsens, with everyday activities … [+179 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Q&A: 'Being proactive' best way to prevent traction alopecia, improve symptoms - Healio", "description": "Traction alopecia, a subtype of alopecia that typically leads to hair loss along the hairline, is common among people with skin of color and especially affects Black women, according to the Skin of Color Society.Tight hair styling and pulling from the scalp c…", "url": "https://www.healio.com/news/dermatology/20221115/qa-being-proactive-best-way-to-prevent-traction-alopecia-improve-symptoms", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/dermatology/a/alopecia-2.jpg", "publishedAt": "2022-11-15T17:21:24Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nTraction alopecia, a subtype of alopecia… [+4445 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds that honey bee life spans are 50 per cent shorter today than they were 50 years ago - ANI News", "description": "A new study by entomologists shows that the lifespan for individual honey bees kept in a controlled, laboratory environment is 50 per cent shorter than it was in the 1970s.", "url": "https://www.aninews.in/news/science/study-finds-that-honey-bee-life-spans-are-50-per-cent-shorter-today-than-they-were-50-years-ago20221115223838", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221115165319.jpg", "publishedAt": "2022-11-15T17:08:00Z", "content": "Washington [US], November 15 (ANI): A new study by entomologists shows that the lifespan for individual honey bees kept in a controlled, laboratory environment is 50 per cent shorter than it was in t… [+4236 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Sotagliflozin reduces 30-day HF readmission rates in type 2 diabetes - Healio", "description": "CHICAGO &mdash; The dual SGLT inhibitor sotagliflozin reduced 30- and 90-day rates of CV mortality and HF-related events when administered before hospital discharge after an episode of worsening HF, according to new data from the SOLOIST trial.Approximately 2…", "url": "https://www.healio.com/news/cardiology/20221115/sotagliflozin-reduces-30day-hf-readmission-rates-in-type-2-diabetes", "urlToImage": "https://www.healio.com/~/media/clinical-guidance/og-images/type2diabetesog.jpg", "publishedAt": "2022-11-15T17:04:18Z", "content": "Source/Disclosures\r\n Source: Pitt B, et al. Abstract 302. Presented at: American Heart Association Scientific Sessions; Nov. 5-7, 2022; Chicago (hybrid meeting).\r\nDisclosures: \r\nPitt reports receivin… [+4860 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ann Thomas, MD, MPH", "title": "Preeclampsia Linked to Higher Risk for CVD, Stroke in Offspring - Medscape", "description": "A new study reported the strongest evidence to date that the children of mothers with preeclampsia carry a significantly higher risk for cardiovascular disease throughout childhood and into adulthood.", "url": "https://www.medscape.com/viewarticle/984060", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_190903_pregnant_800x450.jpg", "publishedAt": "2022-11-15T16:06:36Z", "content": "Preeclampsia is a major cause of maternal and perinatal morbidity and mortality, affecting as many as 5% of pregnancies worldwide. New evidence suggests that the complication doesn't end with deliver… [+3835 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Breast cancer: Pain, flaky skin to limps, know symptoms and causes - India TV News", "description": "Breast cancer is one of the most common diseases among women. Although breast cancer survival rates have increased, the number of deaths associated with this disease is steadily declining. Know symptoms and causes of this deadly disease.", "url": "https://www.indiatvnews.com/health/breast-cancer-pain-flaky-skin-to-limps-know-symptoms-and-causes-2022-11-15-824051", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/11/breast-cancer-1-1668519787.jpg", "publishedAt": "2022-11-15T15:08:50Z", "content": "Breast cancer is one of the most common diseases among women in which the cancer forms in the cells of the breasts. Considerable support for breast cancer awareness and research funding has always he… [+2194 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Aerobic exercise lowers risk of metastatic cancer: Study - Hindustan Times", "description": "The probability of cancer metastatic spread can be reduced by aerobic exercise by 72 percent, according to a recent study. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/aerobic-exercise-lowers-risk-of-metastatic-cancer-study-101668523860093.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/15/1600x900/aerobic_exercise_1668523947135_1668523963707_1668523963707.jpg", "publishedAt": "2022-11-15T14:57:30Z", "content": "The probability of cancer metastatic spread can be reduced by aerobic exercise by 72 percent, according to a recent study. The amount of glucose (sugar) consumed by internal organs rises during inten… [+4766 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr. Praveen Gulab Dandekar talks about Diabetes in Adults - Zee News", "description": "Obesity Sedentary lifestyle Affluence Indian ethnicity Family history of type 2 diabetes Low birth weight Exposure to type 2 diabetes in the womb History of diabetes during pregnancy in women If you have any of the above risk factors, it may be beneficial to …", "url": "https://zeenews.india.com/health/dr-praveen-gulab-dandekar-talks-about-diabetes-in-adults-2535634.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/15/1117486-dr-praveen-gulab-dandekar.jpg", "publishedAt": "2022-11-15T14:52:37Z", "content": "Diabetes in adults\r\nDiabetes was earlier thought to be a disease of old people. Over the years, that notion is changing quickly. Many people are diagnosed with diabetes much earlier in their life. Ma… [+3554 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr. Kailash Tripathi talks about adherence to therapy for Diabetes control - Zee News", "description": "García-Pérez LE, Alvarez M, Dilla T, Gil-Guillén V, Orozco-Beltrán D. Adherence to therapies in patients with type 2 diabetes. Diabetes Ther. 2013 Dec;4(2):175-94.  World Health Organization: Adherence to long-term therapies. Evidence for action.", "url": "https://zeenews.india.com/health/dr-kailash-tripathi-talks-about-adherence-to-therapy-for-diabetes-control-2535617.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/15/1117493-dr-kailash-tripathi.jpg", "publishedAt": "2022-11-15T14:51:22Z", "content": "Adherence to therapy for diabetes control\r\nThe degree to which a patient is committed to taking medication, adhering to a diet, making lifestyle changes, and aligning with accepted advice from a heal… [+3731 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr. Vikas Namdeo Desale explains what is Diabetes - Zee News", "description": "NIH. https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-d... Kaiser Permanente. https://wa.kaiserpermanente.org/kbase/topic.jhtml?docId=uf6060 Banday MZ, Sameer AS, Nissar S. Pathophysiology of diabetes: An overview. Avicenna J Med. 2020 O…", "url": "https://zeenews.india.com/health/dr-vikas-namdeo-desale-explains-what-is-diabetes-2535646.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/15/1117468-dr-vikas-namdeo-desale.jpg", "publishedAt": "2022-11-15T14:42:50Z", "content": "What is diabetes?\r\nDiabetes is a disease in which blood sugar/glucose levels go high. Blood glucose comes from food, which is the body's energy source. The body has a mechanism to absorb, manage and … [+3258 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "Researchers awarded £2M to develop drugs to prevent epileptic seizures in children - Labiotech.eu", "description": "Scientists at Aston University have started on a project to will look for new drug treatments to prevent the onset of childhood epilepsy.", "url": "https://www.labiotech.eu/trends-news/funding-drugs-prevent-epileptic-seizures-children/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2022/11/shutterstock-1454067764.jpg", "publishedAt": "2022-11-15T14:42:24Z", "content": "Scientists at Aston University in the U.K. have started work on a project that will look for new drug treatments to prevent the onset of childhood epilepsy.\r\nThe three-year Medical Research Council (… [+2728 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Prior antibiotic use linked to risk of subsequent Herpes zoster infection: PLOS ONE - Medical Dialogues", "description": "UK: Prior use of antibiotics raises the risk of subsequent herpes zoster infection, is the conclusion drawn from a recent study published in PLOS One.The researchers observed a strong association...", "url": "https://medicaldialogues.in/dermatology/news/prior-antibiotic-use-linked-to-risk-of-subsequent-herpes-zoster-infection-plos-one-102298", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/14/190786-antibiotics.jpg", "publishedAt": "2022-11-15T14:30:10Z", "content": "UK: Prior use of antibiotics raises the risk of subsequent herpes zoster infection, is the conclusion drawn from a recent study published in PLOS One.The researchers observed a strong association bet… [+2640 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Ketogenic diet may show more promising results than Mediterranean diets in short-term type 2 diabetes management - News-Medical.Net", "description": "Researchers evaluated the short-term impact of the very-low-calorie ketogenic diet (VLCKD) and Mediterranean diet (MD) on the gut microbiota (GM) of obese patients with new-onset type II diabetes (T2DM).", "url": "https://www.news-medical.net/news/20221115/Ketogenic-diet-may-show-more-promising-results-than-Mediterranean-diets-in-short-term-type-2-diabetes-management.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731110_16685197082428199.jpg", "publishedAt": "2022-11-15T14:03:00Z", "content": "In a recent article published in Metabolites, researchers evaluated the short-term impact of the very-low-calorie ketogenic diet (VLCKD) and Mediterranean diet (MD) on the gut microbiota (GM) of obes… [+8453 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Tru Bio Keto Gummies - Slim Candy Keto Gummies EXPOSED Side Effects PRICE & Is It Worth Buying? - The Tribune India", "description": "illions of individuals in the United States constantly fight a losing battle that impacts practically every aspect of their lives. Maintaining a lower proportion of body fat and a thinner appearance is an ongoing task that may often feel insurmountable. So ma…", "url": "https://www.tribuneindia.com/news/brand-connect/tru-bio-keto-gummies-slim-candy-keto-gummies-exposed-side-effects-price-is-it-worth-buying-451262", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_1124293377.png", "publishedAt": "2022-11-15T13:32:00Z", "content": "illions of individuals in the United States constantly fight a losing battle that impacts practically every aspect of their lives. Maintaining a lower proportion of body fat and a thinner appearance … [+7500 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "pankaj@bansal", "title": "Pneumonia Cases on Rise Post Covid Infection: Doctors - NewsPatrolling", "description": "Mumbai: Just like heart issues, and stroke, even pneumonia is commonly seen in patients who have recovered from Covid-19 infection. Currently, pneumonia has become one of the common complications after Covid infection. It is imperative for people to take utmo…", "url": "https://newspatrolling.com/pneumonia-cases-on-rise-post-covid-infection-doctors/", "urlToImage": null, "publishedAt": "2022-11-15T12:49:08Z", "content": "Mumbai: Just like heart issues, and stroke, even pneumonia is commonly seen in patients who have recovered from Covid-19 infection. Currently, pneumonia has become one of the common complications aft… [+1882 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers suggest how new test can help cystic fibrosis patients - ANI News", "description": "Researchers revealed how test can benefit  patient's medical treatment. The urine test can make easier for doctors to diagnose how badly a patient is affected by the hereditary disease cystic fibrosis.", "url": "https://www.aninews.in/news/science/researchers-suggest-how-new-test-can-help-cystic-fibrosis-patients20221115175136", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221115122059.jpg", "publishedAt": "2022-11-15T12:21:00Z", "content": "Washington [US], November 15 (ANI): To assess the effectiveness of novel medicines and gauge the severity of the deadly disease cystic fibrosis, researchers have created a test that's urine that meas… [+4358 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Revive Daily Reviews (Updated) - WARNING! Read This Before You Order! - mid-day.com", "description": "Revive Daily Reviews - Revive Daily is a nutritional supplement designed to give you a deep, restful sleep to promote anti-aging benefits and weight loss. Any side effects? Any complaints? Read this unbiased review before ordering.", "url": "https://www.mid-day.com/brand-media/article/revive-daily-reviews-updated-warning-read-this-before-you-order-23255668", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Revive213_d.jpg", "publishedAt": "2022-11-15T12:05:00Z", "content": "Revive Daily Reviews - Revive Daily is a nutritional supplement designed to give you a deep, restful sleep to promote anti-aging benefits and weight loss. Any side effects? Any complaints? Read this … [+10463 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "How COVID-19 causes neurological damage found - ETHealthWorld", "description": "In order to identify typical changes associated with neuro-Covid, the team of researchers compared the cerebrospinal fluid and blood plasma of these individuals with samples from a control group. They also measured the brain structures of test subjects and su…", "url": "https://retail.economictimes.indiatimes.com/news/diagnostics/how-covid-19-causes-neurological-damage-found/95533556", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95533556,imgsize-2347168,width-1200,height-628,overlay-ethealthworld/how-covid-19-causes-neurological-damage-found.jpg", "publishedAt": "2022-11-15T11:45:00Z", "content": "London: COVID-19 may cause damage to the nervous system, even though it does not affect nerve cells, according to a small study. While it was not uncommon for some people to lose their sense of taste… [+3752 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Kartikeya Kohli", "title": "Renal function deterioration among diabetes patients strongly linked to HF hospitalization - Medical Dialogues", "description": "FRANCE: Beyond baseline eGFR, renal function deterioration was a major and independent risk factor linked to the development of heart failure hospitalization (HFH) in people with type 2 diabetes,...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/renal-function-deterioration-among-diabetes-patients-strongly-linked-to-hf-hospitalization-102340", "urlToImage": "https://medicaldialogues.in/h-upload/2021/08/28/159635-kidney-transplant-and-heart-valve.jpg", "publishedAt": "2022-11-15T10:30:56Z", "content": "FRANCE: Beyond baseline eGFR, renal function deterioration was a major and independent risk factor linked to the development of heart failure hospitalization (HFH) in people with type 2 diabetes, sta… [+2789 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Blinking electrical signals in breast cancer cells may indicate how they grow and spread: Research - News9 LIVE", "description": "The research found that the membrane voltage in breast cancer cells is higher than in healthy cells, and it changes over time, making them act a lot like neurons", "url": "https://www.news9live.com/health/health-conditions/blinking-electrical-signals-in-breast-cancer-cells-may-indicate-how-they-grow-and-spread-research-207995", "urlToImage": "https://media.news9live.com/h-upload/2022/09/15/557797-2973079170092a08f5c65b.jpg", "publishedAt": "2022-11-15T08:17:33Z", "content": "A recent study from Imperial College London discovered voltages in the membranes of breast cancer cells, offering hints as to how the cells develop and spread. \r\nThe research found that when cells be… [+2141 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Toronto: Researchers identify SARS-CoV-2 variant in white-tailed deer, evidence of deer-to-human transmission - India Education Diary", "description": "In the summer of 2020, months after the World Health Organization declared COVID-19 a global pandemic, Samira Mubareka and her colleagues began testing wildlife in Ontario and Quebec for the new coronavirus SARS-CoV-2.“Pretty early in the pandemic, w", "url": "https://indiaeducationdiary.in/university-of-toronto-researchers-identify-sars-cov-2-variant-in-white-tailed-deer-evidence-of-deer-to-human-transmission/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/05/University-of-Toronto.png?fit=1024%2C683&ssl=1", "publishedAt": "2022-11-15T08:04:13Z", "content": "In the summer of 2020, months after the World Health Organization declared COVID-19 a global pandemic, Samira Mubareka and her colleagues began testing wildlife in Ontario and Quebec for the new coro… [+5313 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best HGH Supplements: Top 4 Natural Human Growth Hormone Boosters Pills For Men & Women - Deccan Herald", "description": "Human growth hormone, or HGH, is a naturally occurring component of the pituitary gland's output that improves strength, metabolism, injury recovery and muscle growth. Science demonstrates that food and lifestyle might impact HGH production.", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-hgh-supplements-top-4-natural-human-growth-hormone-boosters-pills-for-men-women-1162505.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1162505-1668498417.png", "publishedAt": "2022-11-15T07:46:57Z", "content": "Human growth hormone, or HGH, is a naturally occurring component of the pituitary gland's output that improves strength, metabolism, injury recovery and muscle growth. Science demonstrates that food … [+10598 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Salma Khalik", "title": "Getting second Covid-19 infection not more dangerous, say S'pore experts - asianews.network", "description": "Refuting a US study, the researchers found that patients with reinfections were three times more likely to be hospitalised than those infected for the first time.", "url": "https://asianews.network/getting-second-covid-19-infection-not-more-dangerous-say-spore-experts/", "urlToImage": "https://asianews.network/wp-content/uploads/2022/11/dw-covid-reinfection-221114_5.webp", "publishedAt": "2022-11-15T06:53:56Z", "content": "November 15, 2022\r\nSINGAPORE – An American study suggesting that people who are infected with Covid-19 for a second time are at higher risk of organ failure and death is questionable, with inherent l… [+4008 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Business Insider India", "title": "Study tells us why we feel lonelier as we age - Business Insider India", "description": "New research has shed light on why when you have an idea of a festive picture-perfect holiday season, what actually transpires doesn't always measure up. That's", "url": "https://www.businessinsider.in/science/health/news/study-tells-us-why-we-feel-lonelier-as-we-age/articleshow/95525391.cms", "urlToImage": "https://www.businessinsider.in/photo/95525391/study-tells-us-why-we-feel-lonelier-as-we-age.jpg?imgsize=21468", "publishedAt": "2022-11-15T06:33:00Z", "content": "New research has shed light on why when you have an idea of a festive picture-perfect holiday season, what actually transpires doesn't always measure up.\r\nThat's where loneliness comes from, suggests… [+4352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Influenza and COVID-19: What's in store for the fall/winter respiratory virus season? - The Indian Express", "description": "The previously predictable pattern of influenza activity in the global North and South has become somewhat unpredictable in post-pandemic seasons", "url": "https://indianexpress.com/article/lifestyle/health/influenza-covid-19-fall-winter-respiratory-virus-season-8267282/", "urlToImage": "https://images.indianexpress.com/2022/11/influenza.jpg", "publishedAt": "2022-11-15T06:30:52Z", "content": "Public health experts in the Northern Hemisphere are predicting a fall/winter respiratory virus season for the ages one that highlights the importance of global surveillance efforts and vaccines as t… [+7944 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Asthma and COPD: How to use inhalers correctly? Feat. Aditi Govitrikar - Times Of India", "description": "Using inhalers correctly is of utmost importance to effectively manage asthma and COPD. But you will be surprised to know that as per data, 90% of patients d...", "url": "https://www.youtube.com/watch?v=Na_Ut_EfGzo", "urlToImage": "https://i.ytimg.com/vi/Na_Ut_EfGzo/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AGUA4AC0AWKAgwIABABGH8gGyhBMA8=&rs=AOn4CLDWKdtiAr44Piu12SEPHGVTwem0iw", "publishedAt": "2022-11-15T06:24:51Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Calculator that weighs individual’s risk/bene - EurekAlert", "description": "Osteoporosis is a major, worsening public health problem and bisphosphonates which help restore a healthier balance of bone production and resorption, have been a relatively inexpensive, successful treatment, particularly for those at highest risk for fractur…", "url": "https://www.eurekalert.org/news-releases/971277", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/4895855c-e6b5-43b7-93ec-ff70b9c1b2c1/Rendition/thumbnail/Content/Public", "publishedAt": "2022-11-15T05:21:41Z", "content": "image: Laura Carbone, MDview more \r\nCredit: Michael Holahan, Augusta University\r\nAUGUSTA, Ga. (Nov. 15, 2022) – Osteoporosis is a major, worsening public health problem and bisphosphonates which help… [+9754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Find out all about polyphenols and how they protect against heart disease, type 2 diabetes - The Indian Express", "description": "In fruits, apples, grapes, pomegranates, strawberries, plums, etc., are rich in polyphenols, while in vegetables, carrots, broccoli, potatoes, spinach, etc., are good sources", "url": "https://indianexpress.com/article/lifestyle/food-wine/polyphenols-good-health-healthy-eating-fruits-vegetables-8089470/", "urlToImage": "https://images.indianexpress.com/2022/11/GettyImages-pomegranates-1200.jpg", "publishedAt": "2022-11-15T04:30:25Z", "content": "As more people become conscious of their health and what they put on their plate, they learn about the various options available when it comes to boosting digestive health, including some dos and don… [+3142 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "AI transforms smartwatch ECG signals into a diagnostic tool for heart failure - Science Daily", "description": "A study reports the ability of a smartwatch ECG to accurately detect heart failure in nonclinical environments. Researchers applied artificial intelligence (AI) to Apple Watch ECG recordings to identify patients with a weak heart pump. Participants in the stu…", "url": "https://www.sciencedaily.com/releases/2022/11/221114190626.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-11-15T02:41:46Z", "content": "A study published in Nature Medicine reports the ability of a smartwatch ECG to accurately detect heart failure in nonclinical environments. Researchers at Mayo Clinic applied artificial intelligence… [+4082 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "SRL Diagnostics publishes data study ahead of World Diabetes Day 2022 - ETHealthWorld", "description": "With more than 77 million people with diabetes, India ranks second in number of cases worldwide. It is also estimated that approximately 43.9 million people are undiagnosed and account for 57% of adults. The prevalence of diabetes in India stood at 8.9% in 20…", "url": "https://retail.economictimes.indiatimes.com/news/industry/srl-diagnostics-publishes-data-study-ahead-of-world-diabetes-day-2022/95518736", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95518736,imgsize-57006,width-1200,height-628,overlay-ethealthworld/srl-diagnostics-publishes-data-study-ahead-of-world-diabetes-day-2022.jpg", "publishedAt": "2022-11-15T00:47:00Z", "content": "14th November 2022, , Mumbai, India has emerged as the diabetes capital of the world with incidence steadily on the rise over the last three decades. The prevalence of diabetes in India stood at 8.9%… [+3383 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Maryland School of Medicine", "title": "Brain Area Thought to Impart Consciousness, Behaves Instead Like an Internet Router - Newswise", "description": "Researchers at the University of Maryland School of Medicine posit that a region of the brain that Francis Crick thought to impart consciousness may have been i", "url": "https://www.newswise.com/articles/brain-area-thought-to-impart-consciousness-behaves-instead-like-an-internet-router", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/11/14/63727f3ae1712_Brainimages.png&width=600&height=600", "publishedAt": "2022-11-14T17:55:00Z", "content": "Newswise — Tucked underneath the brain’s outer, wrinkly cortex is a deeply mysterious area, known as the claustrum.  This region has long been known to exchange signals with much of the cortex, which… [+6469 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Batya Swift Yasgur, MA", "title": "Get Hives and Wheeze When It's Cold? It May Be Cold Urticaria - WebMD", "description": "With cold urticaria, patients develop red, raised, itchy bumps — hives — after exposure to cold, and may have trouble breathing.", "url": "https://www.webmd.com/cold-and-flu/news/20221114/hives-and-wheezing-when-cold-may-be-cold-urticaria", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/articles/health_tools/why_your_feet_are_always_cold_and_what_to_do_about_it_slideshow/1800ss_getty_rf_woman_sitting_by_window_on_winter_day.jpg", "publishedAt": "2022-11-14T17:47:00Z", "content": "Nov. 14, 2022 -- Yvette Braunstein, a social worker at a New York City hospital, develops hives when she is exposed to the cold, whether its cold weather outdoors or cold objects, like ice water. Bra… [+2050 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Uncovering how air pollution causes lung cancer - Medical Xpress", "description": "Cigarette smoking is the No. 1 risk factor for lung cancer. Exposure to second-hand smoke can also increase the risk of lung cancer. This is what scientists have known for a long time. What they did not know until now is that very small pollutant particles in…", "url": "https://medicalxpress.com/news/2022-11-uncovering-air-pollution-lung-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/uncovering-how-air-pol.jpg", "publishedAt": "2022-11-14T17:30:10Z", "content": "Cigarette smoking is the No. 1 risk factor for lung cancer. Exposure to second-hand smoke can also increase the risk of lung cancer. This is what scientists have known for a long time. What they did … [+3094 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel drug could help to fight both COVID-19 and cancer - News-Medical.Net", "description": "While vaccination can provide life-saving protection against COVID-19, scientists are still searching for ways to treat severe infections, including in people who cannot get vaccinated or in the event that dangerous new strains of the virus arise that could b…", "url": "https://www.news-medical.net/news/20221114/Novel-drug-could-help-to-fight-both-COVID-19-and-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2022-11-14T17:25:00Z", "content": "While vaccination can provide life-saving protection against COVID-19, scientists are still searching for ways to treat severe infections, including in people who cannot get vaccinated or in the even… [+5610 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Recognizing Comorbid Anxiety Disorders in Patients With Clinical Depression - Medscape", "description": "In reflecting on his early career, Lorenzo Norris, MD, wishes he had been more aware of the presence of comorbid anxiety disorders in his patients with depression.", "url": "https://www.medscape.com/viewarticle/976931", "urlToImage": "https://img.medscape.com/thumbnail_library/976931_v2.jpg", "publishedAt": "2022-11-14T16:13:01Z", "content": "Lorenzo Norris, MD, reflects on his early days as a young clinician and realizing that he needed to be more aware of the presence of comorbid anxiety disorders when treating patients with depression.… [+631 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Sarah Ezrin", "title": "Yoga and Heart Conditions: Safety and Benefits - Healthline", "description": "Exercise is important for a healthy heart. But is yoga a good idea? The answer is, it depends. Here's what to know about yoga and heart conditions.", "url": "https://www.healthline.com/health/fitness/yoga-and-heart-conditions", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/04/senior-female-yoga-class-732-549-feature-thumb.jpg", "publishedAt": "2022-11-14T15:37:41Z", "content": "There are several benefits of yoga for heart conditions, as long as you keep these important safety considerations top of mind.\r\nYoga is often touted for its ability to calm the mind, but a growing n… [+8059 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Onset of winter fails to check spread of dengue in U.P.’s Prayagraj - Hindustan Times", "description": "There seems to be no respite from dengue in Sangam city despite the onset of winter", "url": "https://www.hindustantimes.com/cities/lucknow-news/onset-of-winter-fails-to-check-spread-of-dengue-in-u-p-s-prayagraj-101668437693720.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/14/1600x900/08b652d8-642c-11ed-812a-04a87baf2f58_1668437692252.jpg", "publishedAt": "2022-11-14T14:54:53Z", "content": "There seems to be no respite from dengue in Sangam city despite the onset of winter. With 159 confirmed cases reported in past seven days between November 7 and November 13, the tally of dengue cases… [+2900 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "High levels of popular supplement could increase risk of developing breast cancer - Medical Dialogues", "description": "Switzerland: Studies in the past have linked commercial dietary supplements like nicotinamide riboside (NR), a form of vitamin B3, to benefits related to cardiovascular, metabolic and neurological...", "url": "https://medicaldialogues.in/diet-nutrition/news/high-levels-of-popular-supplement-could-increase-risk-of-developing-breast-cancer-102301", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/12/190681-untitled-design-2022-11-12t124812541.jpg", "publishedAt": "2022-11-14T14:31:45Z", "content": "Switzerland: Studies in the past have linked commercial dietary supplements like nicotinamide riboside (NR), a form of vitamin B3, to benefits related to cardiovascular, metabolic and neurological he… [+3994 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "New Monoclonal Antibody For Treatment Of Malaria - Forbes", "description": "A new monoclonal antibody treatment for malaria may soon aid the millions impacted by the disease annually.", "url": "https://www.forbes.com/sites/williamhaseltine/2022/11/14/new-monoclonal-antibody-for-treatment-of-malaria/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/637242c987cba7e77561196b/0x0.jpg?format=jpg&crop=645,362,x0,y0,safe&width=1200", "publishedAt": "2022-11-14T13:33:45Z", "content": "Monoclonal antibody imaging.\r\nAstraZeneca\r\nMonoclonal antibodies are among our greatest assets in treating and preventing virus-induced disease. While the spotlight has focused squarely on Covid-19 m… [+4921 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Elana Spivack", "title": "This diet helps your mental health by boosting your gut health - Inverse", "description": "A recent study shows evidence that the psychobiotic diet, which consists of prebiotic and fermented foods, is linked to improved mental wellness.", "url": "https://www.inverse.com/mind-body/psychogut", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/11/7/65d8f8bf-146a-4c4c-8f19-1b9ea6ec4a98-getty-1414386450.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-11-14T13:30:25Z", "content": "Despite how it sounds,\r\n a psychobiotic diet has nothing to do with Alfred Hitchcock or what Patrick Bateman eats. The term, popularized by neuroscientist John Cryan at the University College Cork in… [+5620 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Warning - Glucofort Blood Sugar Support Untold Truth You Must Know Before Order - The Tribune India", "description": "GlucoFort, a cutting-edge treatment for type 2 diabetes, eliminates the root cause. Individuals who consume the right amount of carbohydrates can lead a healthy lifestyle with normal blood sugar levels.", "url": "https://www.tribuneindia.com/news/brand-connect/warning-glucofort-blood-sugar-support-untold-truth-you-must-know-before-order-450913", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_59191916.jpg", "publishedAt": "2022-11-14T12:39:00Z", "content": "GlucoFort, a cutting-edge treatment for type 2 diabetes, eliminates the root cause. Individuals who consume the right amount of carbohydrates can lead a healthy lifestyle with normal blood sugar leve… [+25473 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Gut-friendly bacteria can aid in treating inflammatory bowel disease: Study - mid-day.com", "description": "Combined with probiotics, nanoparticle backpacks could significantly improve, and simplify, IBD treatments, according to research at the University of Wisconsin Madison in the US which was led by Quanyin Hu, a biomedical engineer and professor", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/probiotic-backpacks-can-treat-inflammatory-bowel-disease-at-any-stage-23255434", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/tablet-fourteen-nov_d.jpg", "publishedAt": "2022-11-14T12:06:00Z", "content": "Combined with probiotics, nanoparticle backpacks could significantly improve, and simplify, IBD treatments, according to research at the University of Wisconsin Madison in the US which was led by Qua… [+2499 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "World Diabetes Day 2022: How Artificial Intelligence is Transforming Eye Care for Diabetes Patients - News18", "description": "Maintaining a healthy lifestyle and regular eye check-ups can detect and prevent diabetic retinopathy early to avoid irreversible blindness", "url": "https://www.news18.com/news/lifestyle/world-diabetes-day-2022-how-artificial-intelligence-is-transforming-eye-care-for-diabetes-patients-6383149.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/shutterstock_1455443186-166842692216x9.jpg", "publishedAt": "2022-11-14T11:56:53Z", "content": "With the International Diabetes Foundation projecting that at least 700 million people will be living with diabetes mellitus by 2045, there is a growing concern that diabetic retinopathy may become a… [+3413 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Mizoram reports high rate of dengue infection this year - EastMojo", "description": "Aizawl: The dengue infestation has spread to almost all the 11 districts of the Mizoram, which has till October recorded an exponential jump of 934 per", "url": "http://www.eastmojo.com/mizoram/2022/11/14/dengue-infection-high-in-mizoram-this-year/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/09/Untitled-design-2022-09-12T103746.017.png?fit=1280%2C720&ssl=1", "publishedAt": "2022-11-14T11:22:57Z", "content": "Aizawl: The dengue infestation has spread to almost all the 11 districts of the Mizoram, which has till October recorded an exponential jump of 934 per cent in the incidence of the disease over that … [+3984 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Trivedi", "title": "Eat THESE fruits if you have dengue fever - Zee News", "description": "The Dengue virus causes severe illness and fever. This illness is spread to people by the bite of a mosquito carrying the pathogen. The patient with dengue fever requires rest, attention, and a nourishing diet. As the mercury hits high during our battle with …", "url": "https://zeenews.india.com/food-recipes/eat-these-fruits-if-you-have-dengue-fever-2535291.htm", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/14/1117033-untitled-design-2022-11-14t162715.313.png", "publishedAt": "2022-11-14T10:57:38Z", "content": "New Delhi: The Dengue virus causes severe illness and fever. This illness is spread to people by the bite of a mosquito carrying the pathogen. The patient with dengue fever requires rest, attention, … [+3586 chars]"}, {"source": {"id": null, "name": "EURACTIV"}, "author": "Amalie Holmgaard Mersh", "title": "Adult immunisation key in shift towards preventative health - EURACTIV", "description": "European populations are growing older, increasing the burden on already struggling health systems, but one wa", "url": "https://www.euractiv.com/section/health-consumers/news/adult-immunisation-key-in-shift-towards-preventative-health/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2022/03/w_57262138-800x450.jpg", "publishedAt": "2022-11-14T10:40:24Z", "content": "European populations are growing older, increasing the burden on already struggling health systems, but one way of reducing the burden is through adult immunisation programmes to combat vaccine-preve… [+4683 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/jason-wachob", "title": "3 Underrated Tips To Prevent Heart Disease, From A Cardiologist | mindbodygreen - mindbodygreen", "description": "Three nonnegotiables.", "url": "https://www.mindbodygreen.com/articles/underrated-tips-to-prevent-heart-disease-from-cardiologist", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_crop,x_0,y_0,w_2000,h_1334/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/hmu7sh419labc0s6h.jpg", "publishedAt": "2022-11-14T10:09:24Z", "content": "On the subject of sleep, Twyman also stresses the importance of living in tune with your circadian rhythm. Your circadian biology is so significant for overall health, in fact, that he even considers… [+1694 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Why Older People Are More Susceptible to the Flu - Technology Networks", "description": "Researchers have identified that increased levels of an immune modulator in the lungs as we age contributes to the loss of macrophages that protect us from the flu, making older people more susceptible.", "url": "https://www.technologynetworks.com/proteomics/news/why-older-people-are-more-susceptible-to-the-flu-367579", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367579/why-older-people-are-more-susceptible-to-the-flu-367579-640x360.jpg?cb=20221114", "publishedAt": "2022-11-14T09:16:01Z", "content": "Though the COVID-19 pandemic provided a brief respite, influenza virus is back in circulation and, as usual, poses a special danger to people over the age of 65. But why are older people more suscept… [+2858 chars]"}]}