{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Express"}, "author": "Harriet Whitehead", "title": "How to sleep: The high protein foods you may need to avoid before bed - Express", "description": "SLEEPING through the night is not something everyone is always able to do, and there is a lot of advice to be found around improving your quality of sleep, and adopting healthy sleep routines. This may include avoiding high protein foods straight before bed.", "url": "https://www.express.co.uk/life-style/health/1579886/how-to-sleep-avoid-high-protein-foods-steak-chicken-before-bed", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579886.jpg", "publishedAt": "2022-03-13T12:23:02Z", "content": "The charity adds: “Diet is also multifaceted. It isn’t just one food; instead, it is cumulative, affected by when, what, and how much we eat throughout a day and over weeks, months, and years.\r\n“Indi… [+460 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "ECMO treatment leads to 'exceptional' lung recovery in severe Covid cases: Study - Mint", "description": "The use of ECMO support for severe COVID-19 can result in exceptional early survival, and these patients who leave the hospital without the need for oxygen therapy are very likely to remain alive and well 1 year later, say researchers", "url": "https://www.livemint.com/science/ecmo-treatment-leads-to-exceptional-lung-recovery-in-severe-covid-cases-study-11647167965815.html", "urlToImage": "https://images.livemint.com/img/2022/03/13/600x338/Virus-Outbreak-China-1_1647013376303_1647169930599.jpg", "publishedAt": "2022-03-13T11:13:54Z", "content": "Patients with severe Covid-19, if treated with extracorporeal membrane oxygenation (ECMO), may see a major improvement in lung recovery, making their return to normal lives much faster, a study, publ… [+2071 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 reasons other than COVID-19 that can lead to loss of smell - Times of India", "description": "The novel coronavirus brought along several symptoms ranging from a mild fever, persistent cough, fatigue to a more mysterious ailment i.e. the loss of sense of smell and taste, also known as anosmia. While it causes no severe complications in the body, the c…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/5-reasons-other-than-covid-19-that-can-lead-to-loss-of-smell/photostory/90157038.cms", "urlToImage": "https://static.toiimg.com/photo/90157049.cms", "publishedAt": "2022-03-13T10:30:00Z", "content": "The novel coronavirus brought along several symptoms ranging from a mild fever, persistent cough, fatigue to a more mysterious ailment i.e. the loss of sense of smell and taste, also known as anosmia… [+559 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": null, "title": "Biotin Is In Tons Of Hair Supplements — But Does It Work? - mindbodygreen.com", "description": "If you're on a quest for long locks, check out this supplement.*", "url": "https://www.mindbodygreen.com/articles/biotin-for-hair-growth-does-it-work", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_720,h_378,g_auto,q_85,fl_lossy,f_jpg/org/engukc4ynl08jeq1y.jpg", "publishedAt": "2022-03-13T10:11:41Z", "content": "If youre on a mission to grow healthy locks, youve likely heard of biotin.* The nutrient is a popular ingredient in not only hair and beauty supplements, but multivitamins as well. But how does bioti… [+7631 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is Nordic Diet and how does it help prevent cardiovascular diseases - Times of India", "description": "Nordic diet refers to a healthy diet which consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognized as extremely healthy, tasty, and sustainable.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/what-is-nordic-diet-and-how-it-helps-prevent-cardiovascular-diseases/photostory/90183708.cms", "urlToImage": "https://static.toiimg.com/photo/90183720.cms", "publishedAt": "2022-03-13T09:57:30Z", "content": "Nordic diet refers to a healthy diet that consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognised as extremely healthy, tasty, and sustainable. The diet is adapted t… [+814 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Music combined with auditory beat stimulation can reduce anxiety: Study - Hindustan Times", "description": "Anxiety has been steadily increasing, particularly in the adolescent and young adult populations, over recent decades. Studies have previously shown that listening to music can reduce anxiety, perhaps even more effectively than some anti-anxiety medications. …", "url": "https://www.hindustantimes.com/lifestyle/health/music-combined-with-auditory-beat-stimulation-can-reduce-anxiety-study-101647164819972.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/13/1600x900/Mp3_player_1646369764673_1647164921069.jpg", "publishedAt": "2022-03-13T09:50:18Z", "content": "Treatments integrating music and auditory beat stimulation are effective in reducing anxiety in some patients, a recent study suggested.\r\nThe study by Adiel Mallik and Frank Russo of the Ryerson Univ… [+3009 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Diabetes symptoms: Blurred eyesight is a sign - Verve Times", "description": "Diabetes UK says: “No individual is the same. The symptoms you experience won’t exactly match those of another person.“However, the most common symptoms experienced by many people with diabetes are increased thirst, increased urination, feeling tired", "url": "https://vervetimes.com/diabetes-symptoms-blurred-eyesight-is-a-sign/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579832.jpg", "publishedAt": "2022-03-13T09:41:13Z", "content": "Drinking more water is important for glucose control because it allows the body to flush any excess sugar.\r\nCarbohydrate intake should also be managed efficiently, as the body breaks downs down the n… [+307 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Protein consumption from multiple sources may lower risk of High BP - PTC News", "description": "The following markup is a basic AMP page.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://amp.dev/static/img/sharing/docs-guide-600x314.png", "publishedAt": "2022-03-13T09:31:05Z", "content": "Toggle Sidebar\r\nToggle SidebarThe following markup is a basic AMP page.\r\n&lt;!doctype html&gt;&lt;htmlamplang=\"en\"&gt;&lt;head&gt;&lt;metacharset=\"utf-8\"&gt;&lt;scriptasyncsrc=\"https://cdn.ampproject… [+2805 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Why masking, physical distancing, hand-washing should continue in post-Covid world? - Mint", "description": "Following the onset of the pandemic in March 2020, many regions around the world reported a dramatic decrease in demand for acute healthcare services, including urgent care visits to emergency departments and inpatient hospital stays", "url": "https://www.livemint.com/science/health/why-masking-physical-distancing-should-continue-in-the-post-covid-world-11647160979678.html", "urlToImage": "https://images.livemint.com/img/2022/03/13/600x338/d7adc534-a99a-11ea-b9f9-151bdea23004_1591642513641_1647162256331.jpg", "publishedAt": "2022-03-13T09:07:54Z", "content": "Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However, surprisingly li… [+6353 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Man who Had Stroke Developed Black Hair on Tongue, Read about the Peculiar Condition - News18", "description": "Black Hairy Tongue is known as lingua villosa nigra. It gives the tongue a dark, furry appearance.", "url": "https://www.news18.com/news/buzz/man-who-had-stroke-developed-black-hair-on-tongue-read-about-the-peculiar-condition-4868675.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-2022-03-13t133802.133-164715902816x9.jpg", "publishedAt": "2022-03-13T08:10:39Z", "content": "A recent report has highlighted the bizarre medical condition known as black hairy tongue or BHT. The case came to light when a man visited a dermatology clinic after the top of his tongue became coa… [+2417 chars]"}, {"source": {"id": null, "name": "MyLondon"}, "author": "Helena Vesty, Lucy Williamson", "title": "The signs you might have an unhealthy gut - and what you can do about it - My London", "description": "Trillions of bacteria live in our guts - and it's important to keep them happy", "url": "https://www.mylondon.news/news/health/problem-poos-disturbed-sleep-bad-23349439", "urlToImage": "https://i2-prod.mylondon.news/news/health/article22789549.ece/ALTERNATES/s1200/1_woman-g9fc9add5f_1920.jpg", "publishedAt": "2022-03-13T08:00:00Z", "content": "When you're gut is happy and healthy, the rest of your body will usually follow suit. There have also been demonstrated links between gut health and mood, mental health, endocrine disorders, skin con… [+3430 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "COVID-19 now less deadly than flu, says an expert - msnNOW", "description": "According to infectious diseases expert Professor Paul Hunter, COVID-19 now could be less deadly than flu in the UK.", "url": "https://zeenews.india.com/health/covid-19-now-less-deadly-than-flu-says-an-expert-2444861", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAUZTGE.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-03-13T07:44:13Z", "content": "© Provided by Zee NewsLondon: Covid-19 now could be less deadly than flu in the UK, infectious diseases expert Professor Paul Hunter said, although he warned another variant could still change this. … [+1176 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Video Desk", "title": "Mental Health Tips: How Can Students Calm Their Exam Results Anxiety And Stress? Watch - India.com", "description": "Stressing and panicking  over exam results is a very normal phenomenon and is seen is seen in almost every student who has taken a test or exam. So, in this video, we will be suggesting you a few tips to soothe and calm down your stress and anxiety levels. Wa…", "url": "https://www.india.com/video-gallery/mental-health-tips-how-can-students-calm-their-exam-results-anxiety-and-stress-watch-5276077/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/HOW-to-deal-with-exam-anxiety.jpg", "publishedAt": "2022-03-13T06:45:00Z", "content": "Mental Health Tips: CBSE is soon going to declare the results of class 10th and 12th Term 1 exams. However, the confirmed date of the same is not yet officially revealed. While some students are eage… [+748 chars]"}, {"source": {"id": null, "name": "Boston Herald"}, "author": "Dr. John De Jong", "title": "Keeping an eye on bird flu outbreak - Boston Herald", "description": "If this H5N1 strain truly became a serious public health concern, the authorities would make sure that the public was well aware of the prevalence and risk and further precautions would be implemen…", "url": "https://www.bostonherald.com/2022/03/13/keeping-an-eye-on-bird-flu-outbreak/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2022/03/AP21007404919305.jpg?w=1024&h=683", "publishedAt": "2022-03-13T05:21:22Z", "content": "My cousin lives in a more rural area and raises chickens primarily as pets, but he and his wife do consume the eggs and share some with their friends and neighbors. He informs me that there seems to … [+2562 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "602,350 Americans died of cancer in 2020: CDC - Ahmedabad Mirror", "description": "A total of 602,350 people died of cancer in the US in 2020, but fatality rates due to the disease have continued to drop in the country, according to the US Centers for Disease Control and Prevention (CDC).\n\nCancer remained the second leading cause of death i…", "url": "https://ahmedabadmirror.com/602350-americans-died-of-cancer-in-2020-cdc/81824488.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1646991468760.jpg-org", "publishedAt": "2022-03-13T04:44:57Z", "content": "A total of 602,350 people died of cancer in the US in 2020, but fatality rates due to the disease have continued to drop in the country, according to the US Centers for Disease Control and Prevention… [+712 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": "Cornelius", "title": "Anti-inflammatory reduces death of hospitalized with rheumatoid arthritis - The Goa Spotlight", "description": "posted on 04/03/2022 06:00 (credit: JOSEP LAGO) An anti-inflammatory used to treat rheumatoid arthritis reduced the risk of death by 13% in hospitalized patients with the severe form of covid-19. The", "url": "https://thegoaspotlight.com/anti-inflammatory-reduces-death-of-hospitalized-with-rheumatoid-arthritis/", "urlToImage": "https://midias.correiobraziliense.com.br/_midias/jpg/2021/08/04/675x450/1_cbifot040820214978-25593316.jpg?20220303173634?20220303173634", "publishedAt": "2022-03-12T23:47:34Z", "content": "posted on 04/03/2022 06:00\r\n(credit: JOSEP LAGO)\r\nAn anti-inflammatory used to treat rheumatoid arthritis reduced the risk of death by 13% in hospitalized patients with the severe form of covid-19. T… [+3309 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Medicine makes discovery that promises to revolutionize diabetes treatment - Play Crazy Game", "description": "The release of data from the Genome project kick-started genomic medicine. From that moment on we knew that medicine would never be the same. The possibility of deciphering 99% of the human genetic material to understand a diversity of diseases makes us under…", "url": "https://playcrazygame.com/2022/03/13/medicine-makes-discovery-that-promises-to-revolutionize-diabetes-treatment/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/02/sintomas-diabetes.jpg", "publishedAt": "2022-03-12T22:30:20Z", "content": "The release of data from the Genome project kick-started genomic medicine. From that moment on we knew that medicine would never be the same. The possibility of deciphering 99% of the human genetic m… [+3691 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "The Brain-Boosting Foods That Will Help You Get The Most From Your Cerebral Cores, According To Harvard Expert - Optic Flux", "description": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren't eating enough of premised on her experience with hundreds of individuals – consuming them may enhance your mood, enha…", "url": "https://www.opticflux.com/the-brain-boosting-foods-that-will-help-you-get-the-most-from-your-cerebral-cores-according-to-harvard-expert/16782/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/12/louis-hansel-phEaeqe555M-unsplash-scaled.jpg", "publishedAt": "2022-03-12T22:24:16Z", "content": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren’t eating enough of premised on her experience with hundreds… [+1945 chars]"}, {"source": {"id": null, "name": "VENTS Magazine"}, "author": "RJ Frometa", "title": "Does Whey Protein Help in Building Muscles? - - VENTS Magazine", "description": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some pl", "url": "https://ventsmagazine.com/2022/03/12/does-whey-protein-help-in-building-muscles/", "urlToImage": null, "publishedAt": "2022-03-12T21:58:06Z", "content": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some p… [+3724 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Eating Lentils, Grains And Nuts Add 10 Years To Your Life, Says Study - Indiatimes.com", "description": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a longer life-span - marking an improvement of 10 years than th…", "url": "https://www.indiatimes.com/technology/science-and-future/eating-lentils-nuts-extend-life-study-564154.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage18-copy_6229e96c2c834.jpg", "publishedAt": "2022-03-12T20:51:25Z", "content": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a l… [+2028 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Know everything about Cervical Cancer - Rising Kashmir", "description": null, "url": "https://www.risingkashmir.com/displaynews.aspx?news=102429", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637826770727623748_download_-_2022-03-12T234737.883.jpg", "publishedAt": "2022-03-12T18:29:18Z", "content": "Cervical Canceris a type of cancer that occurs in the cells of the cervix —the lower part of the uterus that connects to the vagina. Various strains of the Human Papilloma virus (HPV),a sexually tran… [+13393 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Agencies", "title": "COVID vaccination benefits cancer patients, claims study - India TV News", "description": "The results showed that most cancer patients had seroconverted, meaning they developed antibodies after receiving the vaccine. Overall, 71.3 per cent of patients seroconverted after the first dose, 90.3 per cent after the second. There were, however, differen…", "url": "https://www.indiatvnews.com/health/covid-vaccination-benefits-cancer-patients-claims-study-2022-03-12-764078", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-2022-03-12t234348-1647108833.jpg", "publishedAt": "2022-03-12T18:20:34Z", "content": "It has been unclear if cancer patients considered immunocompromised could prevent or lessen the risk of COVID-19 infection through vaccination. Moffitt Cancer Center researchers have put together one… [+2600 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Healthy eating and diet tips for women - Rising Kashmir", "description": "Rising Kashmir: Leading English newspaper in Jammu and Kashmir", "url": "https://www.risingKashmir.com/", "urlToImage": "https://www.risingkashmir.com/userfiles/image/safe_imagenow.png", "publishedAt": "2022-03-12T18:17:05Z", "content": null}, {"source": {"id": null, "name": "Uttarakhandnewsnetwork.com"}, "author": "Uttarakhand News", "title": "Hybrid Corona variant made up of Delta-Omicron variant identified - Uttarakhand News Network", "description": "People have breathed a sigh of relief due to the reduction in the cases of corona virus in the country. But in the meantime, news of a concern has come to the fore from the World Health Organization (", "url": "https://uttarakhandnewsnetwork.com/2022/03/hybrid-corona-variant-made-up-of-delta-omicron-variant-identified/", "urlToImage": "https://uttarakhandnewsnetwork.com/wp-content/uploads/2021/04/corona-virus.jpg", "publishedAt": "2022-03-12T17:25:00Z", "content": "People have breathed a sigh of relief due to the reduction in the cases of corona virus in the country. But in the meantime, news of a concern has come to the fore from the World Health Organization … [+1181 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Losartan off the market: how to proceed if you need the drug | Health - Play Crazy Game", "description": "disclosure Losartan has been withdrawn from the market Sanofi Medley's announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among patients who use the drug to treat high blood pressure or hear…", "url": "https://playcrazygame.com/2022/03/12/losartan-off-the-market-how-to-proceed-if-you-need-the-drug-health/", "urlToImage": "https://i0.statig.com.br/bancodeimagens/6h/2r/5w/6h2r5ws8vnhqfdcbzv91fy3w0.jpg", "publishedAt": "2022-03-12T17:14:25Z", "content": "disclosureLosartan has been withdrawn from the market\r\nSanofi Medley’s announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among pa… [+5007 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Rebecca Sohn", "title": "Glaucoma: Cause, symptoms, treatment and prevention - Livescience.com", "description": "The cause of glaucoma is unknown, but it is accompanied by high eye pressure.", "url": "https://www.livescience.com/glaucoma-facts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JhVBi2U5wmR7Zka2tPkypZ-1200-80.jpg", "publishedAt": "2022-03-12T16:37:13Z", "content": "Glaucoma is a group of eye diseases that can cause vision loss and blindness. Though the cause is not entirely known, many people with glaucoma have high eye pressure. Excess fluid builds up inside t… [+10576 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Dexamethasone at discharge for COVID-19 does not reduce readmission, mortality - Healio", "description": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\n      Cheng-Wei Huang, MD, a physician at Kaiser Permanente Los An…", "url": "https://www.healio.com/news/infectious-disease/20220311/dexamethasone-at-discharge-for-covid19-does-not-reduce-readmission-mortality", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/other/steroids_shutterstock.jpg", "publishedAt": "2022-03-12T16:02:18Z", "content": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\r\nCheng… [+1958 chars]"}, {"source": {"id": null, "name": "Oswego Daily News"}, "author": null, "title": "Oswego County Health Department Offers Opportunities To Vaccinate Pets - Oswego Daily News", "description": "The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative measures are subject to change depending on COVID-19 virus activity and resp…", "url": "https://oswegocountytoday.com/news/oswego-county-health-department-offers-opportunities-to-vaccinate-pets/", "urlToImage": "https://i0.wp.com/oswegocountytoday.com/wp-content/uploads/2017/03/rabies-princess.jpg?fit=1200%2C1114&ssl=1", "publishedAt": "2022-03-12T14:58:12Z", "content": "File photo 2017: Princess didnt flinch as she got her shot.\r\nOSWEGO COUNTY The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative mea… [+3291 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Understand what is Acanthosis Nigricans that causes dark spots on the skin - Play Crazy Game", "description": "We all know that all it takes is small changes in our bodies for us to be aware of symptoms. After all, it is important to identify potential diseases and conditions as early as possible. So if you've ever wondered what are dark spots on skin, know that there…", "url": "https://playcrazygame.com/2022/03/12/understand-what-is-acanthosis-nigricans-that-causes-dark-spots-on-the-skin/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/manchas-na-pele.jpg", "publishedAt": "2022-03-12T14:35:56Z", "content": "We all know that all it takes is small changes in our bodies for us to be aware of symptoms. After all, it is important to identify potential diseases and conditions as early as possible. So if you’v… [+1845 chars]"}, {"source": {"id": null, "name": "Omegaunderground.com"}, "author": "Laila Azzahra", "title": "X Important Strategies for Preventing UTIs - Omega Underground", "description": "Urinary tract infections range from uncomfortable to painful, so it’s best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of…", "url": "https://omegaunderground.com/x-important-strategies-for-preventing-utis/", "urlToImage": "https://omegaunderground.com/wp-content/uploads/2022/03/X-Important-Strategies-for-Preventing-UTIs-01.jpeg", "publishedAt": "2022-03-12T14:22:09Z", "content": "Urinary tract infections range from uncomfortable to painful, so its best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of a few important strategies.\r\n… [+4740 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Molly Hembree, MS, RD, LD", "title": "The #1 Best Leafy Green to Help Control Body Fat, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "Consuming this dark leafy green is not only part of a healthy diet, but it can also help support your weight loss efforts.", "url": "http://www.eatthis.com/best-leafy-green-control-body-fat/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/holding-leafy-greens.jpg?quality=82&strip=all", "publishedAt": "2022-03-12T14:03:41Z", "content": "Our body has a need for anatomical fat, even subcutaneous adipose tissue (essential fat beneath the skin), and some visceral adipose tissue (fat surrounding organs, with excess often deposited in the… [+2940 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "New study sheds light on how blood clots are formed during wound healing - The Siasat Daily", "description": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing. The research was published in the journal, 'Science Advances'. The research examined the behaviour of platelets at a wound site, s…", "url": "https://www.siasat.com/new-study-sheds-light-on-how-blood-clots-are-formed-during-wound-healing-2289858/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/blood-clots-_mar12.jpg", "publishedAt": "2022-03-12T13:40:00Z", "content": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing.\r\nThe research was published in the journal, ‘Science Advances’.\r\nThe r… [+1910 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Edo Paz, MD", "title": "I'm a Doctor and Here's How to Lower Your Blood Sugar — Eat This Not That - Eat This, Not That", "description": "There is no need to panic—there are methods (aside from taking insulin, if advised by your doctor) that can bring it down over the long term.", "url": "http://www.eatthis.com/news-heres-how-to-lower-your-blood-sugar/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/11/woman-diabetes-test-blood-sugar.jpg?quality=82&strip=all", "publishedAt": "2022-03-12T13:16:11Z", "content": "If you have recently excessive thirst, hunger, fatigue, and go to the bathroom more often than usual, you may suffer from high blood sugar. Even if that's the case, there is no need to panicthere are… [+5749 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Gabby Landsverk", "title": "How to know if you should try fitness supplements for weight loss and muscle gain, or if it's just a waste of - Business Insider India", "description": "Fitness supplements can give you an edge in the gym, but only when used correctly, experts say. Certain supplements may be more helpful for your goals, while", "url": "https://www.businessinsider.in/science/health/news/how-to-know-if-you-should-try-fitness-supplements-for-weight-loss-and-muscle-gain-or-if-its-just-a-waste-of-money-according-to-experts/articleshow/90172866.cms", "urlToImage": "https://www.businessinsider.in/photo/90172866/how-to-know-if-you-should-try-fitness-supplements-for-weight-loss-and-muscle-gain-or-if-its-just-a-waste-of-money-according-to-experts.jpg?imgsize=95912", "publishedAt": "2022-03-12T13:00:00Z", "content": "Fitness\r\n supplements like creatine\r\n are extensively researched, generally safe, and have evidence-based benefits for boosting performance and gains in the gym. \r\nHowever, supplements can be costly,… [+3712 chars]"}, {"source": {"id": null, "name": "MyLondon"}, "author": "Melissa Sigodo", "title": "Vitamin D deficiency: Symptoms to look out for and what happens if you take too much - My London", "description": "You could be left with long term health problems if you take too much", "url": "https://www.mylondon.news/news/health/vitamin-d-deficiency-symptoms-look-23369274", "urlToImage": "https://i2-prod.mylondon.news/incoming/article16042330.ece/ALTERNATES/s1200/2_Vitamin-D-research.jpg", "publishedAt": "2022-03-12T12:32:05Z", "content": "Keeping your health in tip-top shape requires a balance of nutrients to keep our systems going. One vitamin plays a key role in maintaining good health and without it, it can lead to bone pain and de… [+2870 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "What to eat to sleep well? - Play Crazy Game", "description": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other. Between dimming the lights (and also the brightness of the tablet), av…", "url": "https://playcrazygame.com/2022/03/12/what-to-eat-to-sleep-well/", "urlToImage": "https://www.cenariomt.com.br/wp-content/uploads/2022/03/food-g424a820c5_1920.jpg", "publishedAt": "2022-03-12T12:01:57Z", "content": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other.\r\nBetween d… [+921 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Clara Olshansky", "title": "The Best Eating Habit To Prevent Dementia, New Study Finds — Eat This Not That - Eat This, Not That", "description": "Try introducing foods to your diet that strengthen brain health and cognitive function to prevent possible dementia in the future.", "url": "http://www.eatthis.com/eating-habit-to-prevent-dementia/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/eating-fiber-foods.jpg?quality=82&strip=all", "publishedAt": "2022-03-12T12:00:53Z", "content": "The foods that you eat can affect your life in so many ways. Not only do they help determine how much energy you have throughout the day, how your immune system functions, and even how well you sleep… [+2585 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Prajwal Wele", "title": "Serious mental illness may cause high-risk heart disorders, change health behaviours, says expert - News9 LIVE", "description": "The researchers believed this is the first study to examine estimated 30-year (lifetime)...", "url": "https://www.news9live.com/health/covid-19/serious-mental-illness-may-cause-high-risk-heart-disorders-change-health-behaviours-says-expert-158713", "urlToImage": "https://media.news9live.com/h-upload/2022/03/12/255401-operation-doctor-medical-9747111zon.jpg", "publishedAt": "2022-03-12T11:53:18Z", "content": "A study published in the journal of the American Heart Association reported that those diagnosed with bipolar disorder, schizophrenia or schizoaffective disorder might have a higher risk of cardiovas… [+2721 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Fatty liver disease: Subtle personality may signal ‘the liver is struggling’ - Verve Times", "description": "The British Liver Trust (BLT) says liver problems develop silently with no obvious symptoms in the early stages yet the disease is largely preventable through lifestyle changes. The disease tends to develop in people who are overweight or obese or ha", "url": "https://vervetimes.com/fatty-liver-disease-subtle-personality-may-signal-the-liver-is-struggling/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579556.jpg", "publishedAt": "2022-03-12T11:21:09Z", "content": "The British Liver Trust (BLT) says liver problems develop silently with no obvious symptoms in the early stages yet the disease is largely preventable through lifestyle changes. The disease tends to … [+2584 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Obesity: Causes and preventive tips, as suggested by the doctors - Hindustan Times", "description": "About 1 in 5 children and more than 1 in 3 adults struggle with obesity. How do you know you are in obese category? Read on to know all about it from doctors, along with its causes and preventive tips | Health", "url": "https://www.hindustantimes.com/lifestyle/health/obesity-causes-and-preventive-tips-as-suggested-by-the-doctors-101647080174811.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/12/1600x900/towfiqu-barbhuiya-J6g_szOtMF4-unsplash_1647082379074_1647082399880.jpg", "publishedAt": "2022-03-12T10:55:02Z", "content": "Obesity is a chronic disorder that involves excessive amount of body fat which isn't just a cosmetic concern but also involves health problems such as heart diseases, diabetes, high blood pressure, s… [+7796 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Australia leaders to meet amid Omicron sub-variant concerns, flood damage - ETHealthWorld", "description": "COVID-19 infections and hospital admissions have declined over the past few weeks but authorities have flagged the BA.2 sub-variant was becoming the dominant Omicron variant in New South Wales (NSW), Australia's most populous state.", "url": "https://health.economictimes.indiatimes.com/news/policy/australia-leaders-to-meet-amid-omicron-sub-variant-concerns-flood-damage/90167197", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-90167197,imgsize-37462,width-1200,height-628,overlay-ethealthworld/australia-leaders-to-meet-amid-omicron-sub-variant-concerns-flood-damage.jpg", "publishedAt": "2022-03-12T10:45:00Z", "content": "Sydney, - Australia's national cabinet will meet on Friday against a backdrop of concerns about the spread of the new sub-variant of the Omicron strain of the coronavirus, while eastern states battle… [+1850 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Superadmin", "title": "Covid causing lot of serious kidney issues: Expert - United News of India", "description": "", "url": "https://www.uniindia.com/story/Covid-causing-lot-of-serious-kidney-issues-Expert", "urlToImage": "https://www.uniindia.com/public/default-image/default-730x400.png", "publishedAt": "2022-03-12T10:43:00Z", "content": "Oscar nominated 'Writing..."}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers say damage to inner ear system can predict fall risk among Alzheimer's patients - ANI News", "description": "Washington [US], March 12 (ANI): A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients' well-documented higher risk of falling.", "url": "https://www.aninews.in/news/science/researchers-say-damage-to-inner-ear-system-can-predict-fall-risk-among-alzheimers-patients20220312160909", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/ddddddddddddddddddfdgdfgdfgdfg20220312095840-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-12T10:39:00Z", "content": "ANI | Updated: Mar 12, 2022 16:09 IST\r\nWashington [US], March 12 (ANI): A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients' well-do… [+3960 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study: Antiseptic drug effective for preventing recurrent urinary tract infections - ANI News", "description": "London [UK], March 12 (ANI): A team of UK researchers, led by clinicians and scientists from Newcastle-upon-Tyne, set out to test if methenamine hippurate is an effective alternative to standard antibiotic treatment for preventing recurrent UTI (urinary tract…", "url": "https://www.aninews.in/news/science/study-antiseptic-drug-effective-for-preventing-recurrent-urinary-tract-infections20220312153752", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/dfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfdfgertwettwerr20220312100443-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-12T10:07:00Z", "content": "London [UK], March 12 (ANI): A team of UK researchers, led by clinicians and scientists from Newcastle-upon-Tyne, set out to test if methenamine hippurate is an effective alternative to standard anti… [+3151 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IANS", "title": "Researchers re-engineer red blood cells to trigger immune system against Covid, its variants and new viruses - IBTimes India", "description": "Researchers have teamed up to modify red blood cells to transport viral agents which can safely trigger the immune system to protect the body against SARS-CoV-2, creating a promising new vehicle for vaccine delivery.", "url": "https://www.ibtimes.co.in/researchers-re-engineer-red-blood-cells-trigger-immune-system-against-covid-its-variants-new-846502", "urlToImage": "https://data1.ibtimes.co.in/en/full/770280/red-blood-cells.jpg", "publishedAt": "2022-03-12T08:58:25Z", "content": "Vitality of Covid booster doses: Data from Switzerland sheds crucial clues\r\nResearchers have teamed up to modify red blood cells to transport viral agents which can safely trigger the immune system t… [+1442 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Wisconsin-Madison: Antivirals, some antibodies, work well against BA.2 omicron variant of COVID-19 virus - India Education Diary", "description": "The antiviral therapies remdesivir, molnupiravir, and the active ingredient in Pfizer’s Paxlovid pill (nirmatrelvir), remain effective in laboratory tests against the BA.2 variant of SARS-CoV-2, the virus that causes COVID-19.The BA.2 variant also re", "url": "https://indiaeducationdiary.in/university-of-wisconsin-madison-antivirals-some-antibodies-work-well-against-ba-2-omicron-variant-of-covid-19-virus/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/uw-logo-color-flush-300x180-2.png", "publishedAt": "2022-03-12T07:24:40Z", "content": "The antiviral therapies remdesivir, molnupiravir, and the active ingredient in Pfizers Paxlovid pill (nirmatrelvir), remain effective in laboratory tests against the BA.2 variant of SARS-CoV-2, the v… [+2616 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Transmission of SARS-CoV-2 delta variant (AY.127) from pet hamsters to humans, leading to onward human-to-human transmission: a case study - The Lancet", "description": "Pet hamsters can be naturally infected with SARS-CoV-2. The virus can circulate among\nhamsters and lead to human infections. Both genetic and epidemiological results strongly\nsuggest that there was more than one hamster-to-human transmission event in this stu…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00326-9/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/c58a5fee-3f5b-467c-8a8b-7040fc018904/gr1.jpg", "publishedAt": "2022-03-12T06:22:57Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Omicron ‘Stealth Variant’ Still At High Level, UK Study Finds - Swachh India NDTV", "description": "A BA.2 sub-lineage of the Omicron variant of COVID-19, named a", "url": "https://swachhindia.ndtv.com/omicron-stealth-variant-still-at-high-level-uk-study-finds-67153/", "urlToImage": "https://w.ndtvimg.com/sites/3/2022/03/11193207/660-42.jpg", "publishedAt": "2022-03-12T04:30:01Z", "content": "(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)\r\nNDTV Dettol have been working towards a clean and healthy India since 2014 via the Ba… [+2080 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Can drinking cow milk help fight Covid infection? - Ahmedabad Mirror", "description": "Cow milk contains proteins with virus inhibiting properties that can help prevent Covid-19 from replicating in a person&#39;s body and cause infection, according to a study.\n\nThe protein lactoferrin is found in the milk of most mammals.\n\nResearchers from the …", "url": "https://ahmedabadmirror.com/can-drinking-cow-milk-help-fight-covid-infection/81823903.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1646645009571.jpg-org", "publishedAt": "2022-03-12T04:05:48Z", "content": "Cow milk contains proteins with virus inhibiting properties that can help prevent Covid-19 from replicating in a person's body and cause infection, according to a study.\r\nThe protein lactoferrin is f… [+2059 chars]"}, {"source": {"id": null, "name": "Lodivalleynews.com"}, "author": "Willa Ruiz", "title": "Polio: how is vaccination done in Brazil? - Lodi Valley News.com", "description": "Rate our content: An error occurred while placing your order, please try again! Yes Thank...", "url": "https://www.lodivalleynews.com/polio-how-is-vaccination-done-in-brazil/", "urlToImage": "https://www.lodivalleynews.com/wp-content/uploads/2022/03/Polio-how-is-vaccination-done-in-Brazil.svg.svg+xml", "publishedAt": "2022-03-12T03:41:56Z", "content": "Thank you!Your evaluation is necessary for us to continue improving the Pebmed portal\r\nYes\r\nA recent account for Polio cases in Malawi and Israel They caught the attention of the international commun… [+2867 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Survey: About 16% of couples are discordant about COVID-19 vaccination - News-Medical.Net", "description": "A small but significant portion of couples contain one partner who is vaccinated against COVID-19 and another partner who is not, a Washington State University survey has found.", "url": "https://www.news-medical.net/news/20220311/Survey-About-1625-of-couples-are-discordant-about-COVID-19-vaccination.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2022-03-12T02:37:00Z", "content": "A small but significant portion of couples contain one partner who is vaccinated against COVID-19 and another partner who is not, a Washington State University survey has found. Reasons for not getti… [+2833 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "The 'Sleep Hormone' Could Heal the Brain - The Epoch Times", "description": "According to a recent report published in Alzheimer’s and Dementia Journal, Alzheimer’s disease – the sixth leading cause of ...", "url": "https://www.theepochtimes.com/how-to-improve-your-brain-function-with-melatonin_4332423.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/03/11/shutterstock_1658984641-2-1200x800.jpg", "publishedAt": "2022-03-11T22:56:11Z", "content": "According to a recent report published in Alzheimers and Dementia Journal, Alzheimers disease the sixth leading cause of death in the United States claimed over 121,000 lives in 2019 alone, before th… [+5195 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Kristeen Cherney", "title": "Hand Tools You Can Use If You Have Rheumatoid Arthritis - Healthline", "description": "Learn more about the types of hand tools available that may help with daily tasks when you’re feeling the effects of rheumatoid arthritis.", "url": "https://www.healthline.com/health/rheumatoid-arthritis/hand-tools-for-people-with-rheumatoid-arthritis", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/01/Compression-Glove-Hand-1200x628-Facebook-1200x628.jpg", "publishedAt": "2022-03-11T22:45:15Z", "content": "If youre living with rheumatoid arthritis (RA), you may know the role that chronic inflammation\r\n plays in creating swelling and painful joints including the joints in your hands.\r\nWhile the goal of … [+6515 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Julia Ries", "title": "COVID Will Become a Seasonal Disease, Experts Say - Healthline", "description": "COVID-19 will likely become a seasonal illness like most respiratory viruses that strike in the winter months, according to the CDC's Dr. Rochelle Walensky.", "url": "https://www.healthline.com/health-news/covid-19-will-likely-become-a-seasonal-disease-cdc-director-says", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/03/masked-crowd-1200x628-facebook-1200x628.jpg", "publishedAt": "2022-03-11T20:08:41Z", "content": "<ul><li>COVID-19 is expected to become a seasonal illness like most respiratory viruses that strike in the winter months, according to the CDCs Dr. Rochelle Walensky.</li><li>Scientists are monitorin… [+4892 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Jeff Somers", "title": "These Simple Home Health Tests Are Actually Worth Trying - Lifehacker", "description": "There are a lot of ways you can check your own health at home without a doctor or a kit—but only a handful are actually useful.", "url": "https://lifehacker.com/these-simple-home-health-tests-are-actually-worth-tryin-1848640897", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/3e36aba17951789d1f9ef733792fb245.jpg", "publishedAt": "2022-03-11T18:00:00Z", "content": "We know that if we want to maintain our health, prevention and early detection of diseases or disorders is key. Still, seeing a physician regularly can be expensive and logistically challengingand a … [+5592 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Annie Lennon", "title": "Long COVID: Nerve damage may arise from immune system dysfunction - Medical News Today", "description": "A new, small scale study concludes that neuropathic symptoms in long COVID may arise from immune system dysfunction.", "url": "https://www.medicalnewstoday.com/articles/nerve-damage-in-long-covid-may-arise-from-immune-dysfunction", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/03/Nerve-damage-long-covid-thumb.jpg", "publishedAt": "2022-03-11T16:57:50Z", "content": "<ul><li>In a recently published study, researchers investigated the reasons behind neuropathic symptoms in long COVID.</li><li>They found that neuropathic symptoms in long COVID may arise from immune… [+6425 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel genetic relationships with severe SARS-CoV-2 - News-Medical.Net", "description": "Researchers discovered multiple novel genetic processes underpinning severe COVID-19 using genome-wide association studies and meta-analyses.", "url": "https://www.news-medical.net/news/20220311/Novel-genetic-relationships-with-severe-SARS-CoV-2.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_706981_16470158385093463.jpg", "publishedAt": "2022-03-11T16:32:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers discovered multiple novel genetic processes underpinning severe coronavirus disease 2019 (COVID-19). For this, they used genome-w… [+6845 chars]"}, {"source": {"id": null, "name": "WCVB Boston"}, "author": null, "title": "Two years into the COVID-19 pandemic, the world takes cautious steps forward - WCVB Boston", "description": "Two years after COVID-19 was declared a pandemic, mask mandates are disappearing, vaccines are available and a tentative return to normal is underway.", "url": "https://www.wcvb.com/article/two-years-into-the-covid-19-pandemic-the-world-takes-cautious-steps-forward/39407213", "urlToImage": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap22070201894318.jpg?crop=1.00xw:0.804xh;0.00160xw,0.0571xh&resize=1200:*", "publishedAt": "2022-03-11T15:44:00Z", "content": "PORTLAND, Ore. —With COVID-19 case numbers plummeting, Emily Safrin did something she hadn't done since the pandemic began two years ago: She put her fears aside and went to a concert. \r\nThe fully va… [+7460 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Treatment for children with nonsevere TB can be shortened to 4 months - Healio", "description": "Treatment for children with nonsevere tuberculosis can be safely shortened from 6 to 4 months, according to the results of a study published this week in The New England Journal of Medicine.", "url": "https://www.healio.com/news/primary-care/20220311/treatment-for-children-with-nonsevere-tb-can-be-shortened-to-4-months", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/other/tb.jpg", "publishedAt": "2022-03-11T15:11:50Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nTreatment for children with nonsevere tu… [+3543 chars]"}, {"source": {"id": null, "name": "Thebiochronicle.com"}, "author": null, "title": "Why Men Need To Care About Skin Care Too - The Bio Chronicle", "description": "Men can start taking care of their skin. This article will discuss the importance of skincare for men and how it differs from women.", "url": "https://www.thebiochronicle.com/health/18897/why-men-need-to-care-about-skin-care-too/", "urlToImage": "https://www.thebiochronicle.com/wp-content/uploads/2022/03/Screenshot-2022-03-11-at-15.11.08.png", "publishedAt": "2022-03-11T15:11:43Z", "content": "Many people believe that men’s skin is more resilient than women’s; in fact, many men around the world don’t take the same level of care as women when it comes to their skin. While men’s skin differs… [+5901 chars]"}, {"source": {"id": null, "name": "The Star, Kenya"}, "author": "BBC NEWS", "title": "Do liquid diets work and are they safe? - The Star, Kenya", "description": "There are many different kinds of liquid diets but they all have the same aim - to lose weight quickly.", "url": "https://www.the-star.co.ke/sasa/lifestyle/2022-03-11-do-liquid-diets-work-and-are-they-safe/", "urlToImage": "https://lh3.googleusercontent.com/dACQFsuALcAtlOqK19RDtksFy9pqmZNdVlfPqDx-8gopP1vNsMU5W6Amn47zft73z8yaBpjSd93Lb6I3gpxHx9M5UVo6D2_LV4wq6QoIVwE=s1000", "publishedAt": "2022-03-11T15:07:10Z", "content": "Fruit and vegetable juice provides lots of minerals and vitamins - but very little protein or fat.\r\nEven fibre would be in short supply unless the whole fruit, including the skin and seeds, was pulpe… [+2433 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "Cancer-Detecting Ants Could Be The Future of Early Detection - Optic Flux", "description": "While sniffer dogs are famous for their detecting abilities, a recent study reveals that ants may learn to recognize malignant cells far more quickly than their four-legged counterparts. The latest research, issued in the journal iScience, demonstrates that a…", "url": "https://www.opticflux.com/cancer-detecting-ants-could-be-the-future-of-early-detection/16738/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2022/03/ants-498731_960_720.jpg", "publishedAt": "2022-03-11T14:59:54Z", "content": "While sniffer dogs are famous for their detecting abilities, a recent study reveals that ants may learn to recognize malignant cells far more quickly than their four-legged counterparts. The latest r… [+1719 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Swapnil Mishra", "title": "Maharashtra: Boy suffering from Gastroesophageal reflux disease since birth treated with laparoscopic - Free Press Journal", "description": "An oesophagal manometry test was done to check whether the oesophagus is working properly and measures the pressures of the food pipe.", "url": "https://www.freepressjournal.in/mumbai/maharashtra-boy-suffering-from-gastroesophageal-reflux-disease-since-birth-treated-with-laparoscopic-fundoplication-surgery-after-12-years", "urlToImage": "https://images.assettype.com/freepressjournal/2022-03/3d98c87d-19c0-443b-a690-3a31158e62da/reflux_clinic_web.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-11T14:48:22Z", "content": "City-based doctors successfully treated a boy from Kolhapur with Gastroesophageal reflux disease (GERD) or acid reflux for 12 years. After undergoing endoscopy it revealed that the patient has a prem… [+2796 chars]"}, {"source": {"id": null, "name": "Cambridgeshire Live"}, "author": "Rachel Dixon, Izzie Deibe", "title": "Six high blood pressure symptoms that show your hypertension could be seriously dangerous - Cambridgeshire Live", "description": "High blood pressure increases your risk of heart attack, heart failure and strokes.", "url": "https://www.cambridge-news.co.uk/news/health/six-high-blood-pressure-symptoms-23361192", "urlToImage": "https://i2-prod.cambridge-news.co.uk/incoming/article23346169.ece/ALTERNATES/s1200/2_Checking-blood-pressure-at-home.jpg", "publishedAt": "2022-03-11T13:36:50Z", "content": "One in three Brits have high blood pressure, according to a study by charity Blood Pressure UK.\r\nIt can cause serious illnesses and conditions if it goes unmanaged; such as heart attacks and strokes,… [+3583 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Why Responding to COVID-19 Requires Justice, Not Charity - World - ReliefWeb", "description": "English News and Press Release on World about Health, Protection and Human Rights and Epidemic; published on 11 Mar 2022 by Open Society Foundations", "url": "https://reliefweb.int/report/world/why-responding-covid-19-requires-justice-not-charity", "urlToImage": "https://reliefweb.int/profiles/reliefweb/themes/kobe/images/metatag/disaster-type/epidemic.png", "publishedAt": "2022-03-11T12:50:33Z", "content": "Globally, the COVID-19 pandemic has resulted in 400 million infections and more than five million deaths. While the virus does not discriminate, the crisis has shed light on the stark inequities betw… [+6051 chars]"}]}