{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Dailypioneer.com"}, "author": "Daily Pioneer", "title": "MCD continues anti-dengue campaign, challans departments and citizens for negligence - Daily Pioneer", "description": "With the number of dengue cases continuing to rise especially in the provisional State capital, the Municipal Corporation of Dehradun continued its campaign by undertaking foggind and spraying of larvicide in various areas of Dehradun on Sunday. The corporati…", "url": "https://www.dailypioneer.com/2023/state-editions/mcd-continues-anti-dengue-campaign--challans-departments-and-citizens-for-negligence.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2023-09-10T20:32:30Z", "content": "With the number of dengue cases continuing to rise especially in the provisional State capital, the Municipal Corporation of Dehradun continued its campaign by undertaking foggind and spraying of lar… [+2154 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "COVID mutates rapidly in white-tailed deer, but here's why we don't need to worry – for now - Daily Excelsior", "description": "Preston (UK), Sept 10: At some point during the pandemic, Sars-CoV-2, the virus that causes COVID, spread from humans to white-tailed deer in the US. In 2021, scientists revealed that 40% of white-tailed deer sampled in Michigan, Pennsylvania, Illinois and Ne…", "url": "https://www.dailyexcelsior.com/covid-mutates-rapidly-in-white-tailed-deer-but-heres-why-we-dont-need-to-worry-for-now/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/09/covid.jpg", "publishedAt": "2023-09-10T20:24:16Z", "content": "Preston (UK), Sept 10: At some point during the pandemic, Sars-CoV-2, the virus that causes COVID, spread from humans to white-tailed deer in the US.In 2021, scientists revealed that 40% of white-tai… [+4110 chars]"}, {"source": {"id": null, "name": "OncLive"}, "author": "Caroline Seymour", "title": "Dose Optimization Continues After Preliminary Efficacy, Safety Signals With BI 764532 in DLL3+ SCLC - OncLive", "description": "Treatment with at least 90 μg/kg of the novel DLLC-targeting T-cell–engager BI 764532 was well tolerated and led to tumor shrinkage in patients with small cell lung cancer and neuroendocrine carcinoma.", "url": "https://www.onclive.com/view/dose-optimization-continues-after-preliminary-efficacy-safety-signals-with-bi-764532-in-dll3-sclc", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/onclive/3d5b727298b916b3d29a06a9a345abd1753b9f77-200x200.jpg?fit=crop&auto=format", "publishedAt": "2023-09-10T19:55:08Z", "content": "Treatment with at least 90 g/kg of the novel DLLC-targeting T-cellengager BI 764532 was well tolerated and led to tumor shrinkage in patients with small cell lung cancer (SCLC) and neuroendocrine car… [+5182 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Isabella Ciccone, MPH", "title": "SomnoRing Appears Usable and Acceptable to Assess Sleep Health in Diverse Populations - Neurology Live", "description": "Recent research highlights how advanced technology like remote monitoring devices or wearables and smartphone-based apps for sleep health can be delivered at the point of care to meet the needs of patients.", "url": "https://www.neurologylive.com/view/somnoring-appears-usable-acceptable-assess-sleep-health-diverse-populations", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/9a3e8a60da214d2388a1f46185b099dc4863683f-300x300.png?fit=crop&auto=format", "publishedAt": "2023-09-10T19:04:44Z", "content": "In a recent study published in JMIR Formative Research, findings from a 7-night experiment among a group of racially, ethnically, and socioeconomically diverse patients with sleep disorders perceived… [+4829 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "K. Srinath Reddy", "title": "Book Extract: Why poor health hounds the poor - National Herald", "description": "K. Srinath Reddy on how good health is inextricably linked to education and how social discrimination affects health outcomes.", "url": "https://www.nationalheraldindia.com/book-extract/book-extract-why-poor-health-hounds-the-poor", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2023-08%2F9a0c8de1-7565-40c8-a503-e2147bbaef6d%2FGettyImages_870050974.jpg?rect=0%2C0%2C3879%2C2036&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-09-10T18:00:00Z", "content": "It has been clearly shown, in studies conducted across many countries, that healthcare available to poorer sections of the community is poor in quality and also frequently comes at an unaffordable pr… [+1766 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "The lost lessons of the COVID-19 pandemic - Arab News", "description": "What if rich countries have let their guard down on COVID-19 too soon? (Reuters/File Photo) The rituals of fall in the Northern Hemisphere now include preparing for a fresh variant of the coronavirus that causes COVID-19, in addition to the annual flu season.…", "url": "https://www.arabnews.com/node/2371011", "urlToImage": "https://www.arabnews.com/sites/default/files/authors/3994331-rohintonpmedhora1.png", "publishedAt": "2023-09-10T17:51:57Z", "content": "https://arab.news/j4nex\r\nThe rituals of fall in the Northern Hemisphere now include preparing for a fresh variant of the coronavirus that causes COVID-19, in addition to the annual flu season. This y… [+6845 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Paul B. Fitzgerald", "title": "Transcranial magnetic stimulation can treat depression. Developing research suggests it could also help autism, ADHD and OCD - PsyPost", "description": "Transcranial Magnetic Stimulation (TMS), a method where magnetic pulses activate nerve cells in the brain, offers a promising new therapeutic option for depression and is being explored for other conditions like OCD, autism, ADHD, chronic pain, and dementia. …", "url": "https://www.psypost.org/2023/09/transcranial-magnetic-stimulation-can-treat-depression-developing-research-suggests-it-could-also-help-autism-adhd-and-ocd-184203", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/09/brain.jpg", "publishedAt": "2023-09-10T17:15:49Z", "content": "Since the start of the COVID pandemic, there has been more attention given to problems of mental ill-health including depression than ever before. A new therapeutic option, especially for depression,… [+5955 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study finds how specific T cells in brain slow progression of Alzheimer’s disease - ThePrint", "description": "Washington [US], September 10 (ANI): Up to 5.8 million Americans currently suffer from Alzheimer’s disease, a neurological ailment marked by a progressive deterioration in cognitive function, including memory loss. Alzheimer’s sufferers’ brains contain protei…", "url": "https://theprint.in/health/study-finds-how-specific-t-cells-in-brain-slow-progression-of-alzheimers-disease/1755884/", "urlToImage": null, "publishedAt": "2023-09-10T17:13:42Z", "content": "The findings of the study were published in Nature Immunology.\r\n“People typically think of the immune system as being involved in defense from bacterial or viral infection, though there is growing in… [+4614 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "IANS", "title": "Dengue patient numbers rising in Bengal with every passing day - DTNEXT", "description": "The maximum number of cases has been reported from North 24 Parganas district followed by Nadia", "url": "https://www.dtnext.in/lifestyle/wellbeing/dengue-patient-numbers-rising-in-bengal-with-every-passing-day-735471", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/09/10/763846-dengue.jpg", "publishedAt": "2023-09-10T17:00:00Z", "content": "KOLKATA: Dengue seems to be taking a serious turn in West Bengal, especially in the rural pockets of the state, with every passing day as the number of affected people crossed the 15,000 mark by Sund… [+1228 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Do You Know Common Blood Pressure Drugs Linked to Low Knee Replacement Risk? Study Finds - LatestLY", "description": "Get latest articles and stories on Health at LatestLY.  Those with knee discomfort who take the common class of blood pressure-lowering drugs known as beta-blockers appear to have a lower risk of total knee arthroplasty (TKA) for the treatment of advanced ost…", "url": "https://www.latestly.com/agency-news/health-news-do-you-know-common-blood-pressure-drugs-linked-to-low-knee-replacement-risk-study-finds-5402751.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/09/ANI-20230910120755-588x441.jpeg", "publishedAt": "2023-09-10T16:26:19Z", "content": "Washington DC [US], September 10 (ANI): Those with knee discomfort who take the common class of blood pressure-lowering drugs known as beta-blockers appear to have a lower risk of total knee arthropl… [+3412 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Four-year-old boy dies of dengue in Tamil Nadu; opposition calls out government for negligence | Health - Devdiscourse", "description": "A four-year-old boy died here on Sunday of dengue fever, prompting political leaders to call out the negligence of the ruling DMK government and urging it to take preventive measures to halt the spread of the virus.Principal opposition party AIADMK and Pattal…", "url": "https://www.devdiscourse.com/article/health/2588463-four-year-old-boy-dies-of-dengue-in-tamil-nadu-opposition-calls-out-government-for-negligence", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_19_01_27_1763153.jpg?width=920&format=jpeg", "publishedAt": "2023-09-10T15:46:59Z", "content": "A four-year-old boy died here on Sunday of dengue fever, prompting political leaders to call out the ''negligence'' of the ruling DMK government and urging it to take preventive measures to halt the … [+1550 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Mir Alamgir", "title": "No. of dengue cases in Hyderabad increase 10 times in August - The Siasat Daily", "description": "Hyderabad: Health authorities in Telangana are on high alert as the state has witnessed a significant surge in dengue cases. In August, Hyderabad alone reported 1,171 dengue cases, a substantial increase compared to the previous month when there were only 164…", "url": "https://www.siasat.com/no-of-dengue-cases-in-hyderabad-increase-10-times-in-august-2691487/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/11/Dengue.jpg", "publishedAt": "2023-09-10T15:46:00Z", "content": "Hyderabad: Health authorities in Telangana are on high alert as the state has witnessed a significant surge in dengue cases. In August, Hyderabad alone reported 1,171 dengue cases, a substantial incr… [+2479 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Anujj Trehaan", "title": "On a weight loss journey? Expert recommends eating these fruits - NewsBytes", "description": "Are you on a weight loss journey and eating more fruits to meet your goals? Well, you may be surprised to know that not all fruits will help you shed those extra kilos", "url": "https://www.newsbytesapp.com/news/lifestyle/5-fruits-for-weight-loss/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l64320230910205107.jpeg", "publishedAt": "2023-09-10T15:25:01Z", "content": "On a weight loss journey? Expert recommends eating these fruits\r\nLifestyle\r\nInclude these fruits in your weight loss diet\r\nWhen it comes to weight loss, people often switch to a fruit-based diet. \r\n … [+2140 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Digital Desk", "title": "Health Benefits of Figs: Prevents cancer, boosts bone health, improves heart health - Republic World", "description": "Discover the incredible health benefits of figs, from cancer-fighting antioxidants to fertility-boosting properties, and why they're a must-add to your diet.", "url": "https://www.republicworld.com/lifestyle/health/health-benefits-of-figs-prevents-cancer-boosts-bone-health-improves-heart-health-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/eumsqqocgda7mzcx_1694346939.jpeg", "publishedAt": "2023-09-10T15:02:00Z", "content": "Figs, those delicious, sweet fruits that often find their way into our desserts and salads, have been enjoyed for centuries for their delectable taste. But did you know that these tiny, teardrop-shap… [+2347 chars]"}, {"source": {"id": null, "name": "Cancernetwork.com"}, "author": "Hayley Virgil", "title": "Study Shows 5 Key Determinants of Health Drive Outcomes in Hematologic Malignancies - www.oncnursingnews.com/", "description": "Although survival is improving overall, disparities continue to grow.", "url": "https://www.cancernetwork.com/view/health-insurance-income-and-marital-status-contribute-to-blood-cancer-disparities", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/oncnurse/10018ceca2e81f29aa151fa5a617b1524c38ebb1-4528x2491.jpg?fit=crop&auto=format", "publishedAt": "2023-09-10T15:01:27Z", "content": "A systematic review of several observational studies showed that there are 5 social determinants of health that are primarily driving survival disparities in patients with hematologic malignancies. T… [+5428 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Simple Vishwakarma", "title": "Discover health benefits of saffron: Nutrient powerhouse, rich in antioxidants - Republic World", "description": "Discover saffron's antioxidant-rich, anti-inflammatory, brain health-boosting properties for a healthier lifestyle.", "url": "https://www.republicworld.com/lifestyle/health/discover-health-benefits-of-saffron-nutrient-powerhouse-rich-in-antioxidants-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/rf25tb7v9cx8fbc8_1694345061.jpeg", "publishedAt": "2023-09-10T14:40:00Z", "content": "When it comes to culinary delights, saffron is a spice that has long been cherished for its unique flavour and vibrant hue. But did you know that this exotic spice is also a treasure trove of health … [+2528 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "ANI", "title": "Researchers develop new test to detect early stages of tooth decay at home - Telangana Today", "description": "A novel product developed by researchers at the University of Cincinnati can alert consumers to the early stages of tooth decay brought on by conditions like gingivitis and periodontitis.", "url": "https://telanganatoday.com/researchers-develop-new-test-to-detect-early-stages-of-tooth-decay-at-home", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2023/09/teeth-decay.jpg", "publishedAt": "2023-09-10T14:15:17Z", "content": null}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "Are You Having The Right Food Combinations? See What An Expert Says - Slurrp", "description": "Having a balanced diet is considered the most important. But did you know that eating the right food combinations is as essential as eating a nutrient-rich diet? Scroll down to know about some right food combinations as per Nutritionist Lovneet Batra.", "url": "https://www.slurrp.com/article/are-you-having-the-right-food-combinations-see-what-an-expert-says-1694352676243", "urlToImage": "https://images.slurrp.com/prodarticles/wbf3l2fh4db.webp", "publishedAt": "2023-09-10T13:54:05Z", "content": "Having a balanced diet comprising essential nutrients is one of the easiest ways to have a healthy and fit body. And you know what? Not just eating but eating the right food combinations plays a cruc… [+1059 chars]"}, {"source": {"id": null, "name": "Tbsnews.net"}, "author": null, "title": "'I pray no parent loses their child to dengue as I have' - The Business Standard", "description": "17 year-old Tasnia died from dengue on 2 September within four days of running a fever", "url": "https://www.tbsnews.net/bangladesh/health/i-pray-no-parent-loses-their-child-dengue-i-have-698122", "urlToImage": "https://www.tbsnews.net/sites/default/files/styles/social_share/public/images/2023/09/10/375702620_341359238340123_3982428392921249815_n.jpg", "publishedAt": "2023-09-10T13:52:37Z", "content": "\"My daughter was very strong. You couldn't really tell from looking at her just how much pain she was in, how badly she was suffering. I remember the doctor asking us to give her some water and she g… [+4196 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Hepatitis C Patients Should Consider Re-Vaccination For Hepatitis B Virus: Study - Zee News", "description": "World Suicide Prevention Day 2023: 7 Ways To Support Anyone Struggling With Suicidal Thoughts What was not known until now is that after treating hepatitis C the hepatitis B vaccine seems to be more effective in this population. This is important as many of t…", "url": "https://zeenews.india.com/health/hepatitis-c-patients-should-consider-re-vaccination-for-hepatitis-b-virus-study-2660522", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/09/10/1278529-hepatitis.jpg", "publishedAt": "2023-09-10T13:41:32Z", "content": "Hepatitis C patients should consider re-vaccination for hepatitis B virus, suggests a study after a previous research showed low response among patients with hepatitis C, finds study. Hepatitis C is … [+1711 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "E.coli outbreak at Alberta daycares leaves parents unsure of where to bring their kids - CTV News", "description": "An Alberta mother starts a crowdfunding campaign for victims of the E. coli outbreak across several daycares. Tyson Fedor reports.Subscribe to CTV News to wa...", "url": "https://www.youtube.com/watch?v=LijA9dhtqUY", "urlToImage": "https://i.ytimg.com/vi/LijA9dhtqUY/maxresdefault.jpg", "publishedAt": "2023-09-10T13:32:47Z", "content": null}, {"source": {"id": null, "name": "Dermatologytimes.com"}, "author": "Heather Raglin, Editor", "title": "Understanding the Psychiatric Premise Behind Psychocutaneous Disorders - Dermatology Times", "description": "Stress from dermatologic conditions can create or magnify psychiatric illness.", "url": "https://www.dermatologytimes.com/view/understanding-the-psychiatric-premise-behind-psychocutaneous-disorders", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/b54d82a6b762b85b637fd6b6760391c8aebd3d0b-5743x3519.jpg?fit=crop&auto=format", "publishedAt": "2023-09-10T13:07:26Z", "content": "In a literature review of psychotherapeutic treatment of psychocutaneous disorders, researchers found that the majority of psychocutaneous disorders can be categorized under 3 Diagnostic and Statisti… [+5836 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "These three mistakes after dinner can increase your weight - DNA India", "description": "In this article, we'll delve into these mistakes and explore why they should be avoided to maintain a healthy weight.", "url": "https://www.dnaindia.com/lifestyle/report-these-three-mistakes-after-dinner-can-increase-your-weight-3059910", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/09/10/2607063-untitled-design-33.jpg", "publishedAt": "2023-09-10T13:05:00Z", "content": "In this article, we'll delve into these mistakes and explore why they should be avoided to maintain a healthy weight.Dinner is not just a meal; it's an opportunity to nourish our bodies and refuel af… [+2342 chars]"}, {"source": {"id": null, "name": "PR Web"}, "author": null, "title": "Stigmatization of Smoking-Related Diseases is a Barrier to Care and the Problem May Be on the Rise - PR Web", "description": "/PRNewswire-PRWeb/ -- The stigma that patients face when diagnosed with lung cancer is associated with poorer psychosocial outcomes, including distress and...", "url": "https://www.prweb.com/releases/stigmatization-of-smoking-related-diseases-is-a-barrier-to-care-and-the-problem-may-be-on-the-rise-301922692.html", "urlToImage": "https://mma.prnewswire.com/media/2206262/Harrison_Head_Shot.jpg?p=facebook", "publishedAt": "2023-09-10T12:30:00Z", "content": "SINGAPORE, Sept. 10, 2023 /PRNewswire-PRWeb/ -- The stigma that patients face when diagnosed with lung cancer is associated with poorer psychosocial outcomes, including distress and isolation, delaye… [+5398 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Alcohol And Women: Understanding The Complex Relationship And Its Health Impact - NDTV", "description": "Learn how alcohol affects women - from cardiovascular health to bone health.", "url": "https://www.ndtv.com/food/alcohol-and-women-understanding-the-complex-relationship-and-its-health-impact-4377354", "urlToImage": "https://c.ndtvimg.com/2023-09/hpf4li98_alcohol_625x300_10_September_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20230906.04", "publishedAt": "2023-09-10T12:26:18Z", "content": "Alcohol affects women differently.\r\nDrinking alcoholic beverages is a common practice for adult women today. However, what many may not realize is that women's bodies don't respond to alcohol in the … [+3862 chars]"}, {"source": {"id": null, "name": "Cityairnews.com"}, "author": "Rajat Kumar", "title": "KMVites attend seminar on Nutrition and Brain Health at PGIMER - Cityairnews", "description": "Kanya Maha Vidyalaya (Autonomous) students of B.Sc. Home Science and B.Voc. (Nutrition, Exercise and Health) visited Department of Dietetics, PGIMER, Chandigarh to attend a Seminar on ‘Nutrition and Brain Health’ and celebrated ‘National Nutrition Month 2023’…", "url": "https://www.cityairnews.com/content/kmvites-attend-seminar-on-nutrition-and-brain-health-at-pgimer", "urlToImage": "https://www.cityairnews.com/uploads/images/image-750x-2023-09-10-05:46:59pm-64fdb3bba2842.jpg", "publishedAt": "2023-09-10T12:17:41Z", "content": "Jalandhar, September 10, 2023: Kanya Maha Vidyalaya (Autonomous) students of B.Sc. Home Science and B.Voc. (Nutrition, Exercise and Health) visited Department of Dietetics, PGIMER, Chandigarh to atte… [+892 chars]"}, {"source": {"id": null, "name": "Psychiatric Times"}, "author": "Leah Kuntz", "title": "Paliperidone Palmitate as a Treatment for Schizophrenia - Psychiatric Times", "description": "These 3 posters covered the efficacy and safety of paliperidone palmitate in patients with schizophrenia.", "url": "https://www.psychiatrictimes.com/view/paliperidone-palmitate-as-a-treatment-for-schizophrenia", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/psychtimes/5a0ccf57230583bd34e9094253c60b10146d7cbb-4928x3264.jpg?fit=crop&auto=format", "publishedAt": "2023-09-10T12:00:43Z", "content": "CONFERENCE REPORTER\r\nResearchers evaluated the efficacy and safety of paliperidone palmitate (PP), an atypical antipsychotic, in 3 different studies, results of which were presented via poster sessio… [+3228 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Healing power of art for diabetics: A complementary approach to manage diabetes - Hindustan Times", "description": "Art therapy stands out as a powerful and transformative tool for diabetics to navigate a web of emotions and challenges that accompany diabetes. Here's how", "url": "https://www.hindustantimes.com/lifestyle/art-culture/healing-power-of-art-for-diabetics-a-complementary-approach-to-diabetes-management-101694344165399.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/10/1600x900/pexels-thirdman-6732660_1694344580090_1694344612105.jpg", "publishedAt": "2023-09-10T11:25:44Z", "content": "Managing diabetes is an ongoing journey that affects not just the body but also the mind and spirit but while conventional treatments primarily revolve around medication and lifestyle adjustments, th… [+4165 chars]"}, {"source": {"id": null, "name": "Targetedonc.com"}, "author": "Naomi G. Dempsey, MD", "title": "Fertility and Overtreatment of Premenopausal Breast Cancer - Targeted Oncology", "description": "Fertility preservation should be offered to anyone who is interested in becoming pregnant after chemotherapy for breast cancer.", "url": "https://www.targetedonc.com/view/fertility-and-overtreatment-of-premenopausal-breast-cancer", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/72def5e8854903a11bede091e0b6b4278f3206b9-1920x1080.png?fit=crop&auto=format", "publishedAt": "2023-09-10T11:10:28Z", "content": "One key concern about chemotherapy in premenopausal women is its impact on fertility. Chemotherapy can cause premature ovarian failure and infertility, and a future desire for fertility should be dis… [+5037 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Colour of phlegm may predict outcomes for patients with lung disease: Study - Hindustan Times", "description": "The study states that colour of phlegm in bronchiectasis patients can indicate the degree of inflammation in their lungs. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/color-of-phlegm-may-predict-outcomes-for-patients-with-lung-disease-bronchiectasis-research-101694341587130.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/10/1600x900/human-g829f65af6_1280_1673260125231_1694342035100.png", "publishedAt": "2023-09-10T11:07:31Z", "content": "According to recent research presented at the European Respiratory Society International Congress in Milan, Italy, the colour of phlegm from people suffering from the lung condition bronchiectasis ma… [+5432 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Maitry Kothari", "title": "Check out what Katrina Kaif eats for a toned body - DNA India", "description": "List of items Katrina Kaif eats to stay healthy and fit.", "url": "https://www.dnaindia.com/web-stories/lifestyle/check-out-what-katrina-kaif-eats-for-a-toned-body--1694341325822", "urlToImage": null, "publishedAt": "2023-09-10T10:54:54Z", "content": "Katrina eats soup, fish, chapati, and vegetables for dinner."}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "New study explains why diabetic individuals' wounds heal slowly - DTNEXT", "description": "Diabetes also compromises the release and uptake of exosomes in wounds, Ghatak and his team found.", "url": "https://www.dtnext.in/lifestyle/wellbeing/new-study-explains-why-diabetic-individuals-wounds-heal-slowly-735424", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/13/740441-research.jpg", "publishedAt": "2023-09-10T10:47:49Z", "content": "PENNSYLVANIA: A new Nano Today study headed by researchers from the University of Pittsburgh and UPMC discovered that people with diabetes had faulty exosomes, which can cause inflammation and slow d… [+3710 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "For teens with depression, sleep-wake therapy offers new hope: Research - Hindustan Times", "description": "The study states that promoting appropriate sleep patterns in teenagers can help them with their educational needs. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/for-teens-with-depression-sleep-wake-therapy-offers-new-hope-research-101694341713141.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/10/1600x900/sleep_1690887493784_1694342402588.jpg", "publishedAt": "2023-09-10T10:41:51Z", "content": "Promoting appropriate sleep in adolescent night owls links teens' biology with their educational needs.\r\nFor teens with depression, sleep-wake therapy offers new hope: Research\r\nSchool systems aren't… [+3159 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Matt Hoffman", "title": "NeurologyLive® Brain Games: September 10, 2023 - Neurology Live", "description": "Test your neurology knowledge with NeurologyLive®'s weekly quiz series, featuring questions on a variety of clinical and historical neurology topics. This week's topic is stroke.", "url": "https://www.neurologylive.com/view/neurologylive-brain-games-september-10-2023", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/2accefc3e108ad7aa14a54f1b916b59d81c52548-1251x1251.png?fit=crop&auto=format", "publishedAt": "2023-09-10T10:01:33Z", "content": "Welcome to NeurologyLive® Brain Games! This weekly quiz series, which goes live every Sunday morning, will feature questions on a variety of clinical and historical neurology topics, written by physi… [+1306 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Kristina Das", "title": "Minor lifestyle decisions affect the wellness of our kidneys, explains expert - India TV News", "description": "Focusing on your kidney's health is a crucial part of maintaining your general health.", "url": "https://www.indiatvnews.com/health/minor-lifestyle-decisions-affect-the-wellness-of-our-kidneys-explains-expert-2023-09-10-891898", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/09/kidney-welness-1694338851.jpg", "publishedAt": "2023-09-10T09:46:54Z", "content": "Kidneys work nonstop in our bodies to keep us healthy and disease-free. They remove toxins, filter waste, and balance vital minerals which helps control blood pressure levels. The small decisions we … [+3260 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New COVID variant 'not more severe', expert says - Sky News", "description": "There is a new COVID variant - BA.2.86.Asked about its severity on Sunday Morning with Trevor Phillips, Professor Devi Sridhar said it does not appear to be ...", "url": "https://www.youtube.com/watch?v=uWCTs10Ih_U", "urlToImage": "https://i.ytimg.com/vi/uWCTs10Ih_U/maxresdefault.jpg", "publishedAt": "2023-09-10T09:34:18Z", "content": null}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Study shows how microdevices can be used to treat brain cancer - DTNEXT", "description": "Researchers have created a device that can help in therapy testing in patients with gliomas, which are brain or spinal cord tumors.", "url": "https://www.dtnext.in/lifestyle/wellbeing/study-shows-how-microdevices-can-be-used-to-treat-brain-cancer-735372", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/09/10/763692-braintumour.jpg", "publishedAt": "2023-09-10T09:00:23Z", "content": "Massachusetts [US]: The innovative device, which is the size and shape of a grain of rice, can perform hundreds of studies at the same time to examine the impact of novel treatments on some of the mo… [+4330 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Debosmita Ghosh, Times Now", "title": "8 Yoga Asanas to Reduce Headache - Times Now", "description": "8 Yoga Asanas to Reduce Headache", "url": "https://www.timesnownews.com/web-stories/health/8-yoga-asanas-to-reduce-headache/photostory/103551108.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-103551142,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-09-10T08:00:57Z", "content": "This asana gives your body a good stretch and helps it to relax completely. It also helps to improve the flow of blood and oxygen to the brain, thereby, helping to reduce headaches."}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Study discovers how lack of sleep might affect brain - DTNEXT", "description": "Studies indicate that lack of sleep leads to neurological damage in the hippocampus, a part of the brain involved in learning and memory.", "url": "https://www.dtnext.in/lifestyle/wellbeing/study-discovers-how-lack-of-sleep-might-affect-brain-735366", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/09/10/763686-sleep.jpg", "publishedAt": "2023-09-10T08:00:46Z", "content": "WASHINGTON (US): Sleep deprivation not only makes you feel terrible, but research has shown that it also affects your brain. Long-term sleep deprivation increases the risk of acquiring neurological d… [+2072 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Onam Gupta", "title": "Weight Loss: 10-Minute Workout Before Leaving For Work - India.com", "description": "", "url": "https://www.india.com/webstories/lifestyle/weight-loss-10-minute-workout-before-leaving-for-work-6307518/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/09/WhatsApp-Image-2023-09-09-at-5.00.13-PM-5.jpeg", "publishedAt": "2023-09-10T07:24:45Z", "content": "Jumping Jacks- A quick set of jumping jacks can enhance blood circulation and energize your body for the day ahead.\r\nBodyweight squats- Daily performing at least 10-15 squats can improve lower body s… [+624 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Vomiting in newborns: Causes, tips to ensure proper feeding practices - Hindustan Times", "description": "Health expert reveals the causes of vomiting in newborns and premature babies and suggests how parents can feed their little ones in the right way | Health", "url": "https://www.hindustantimes.com/lifestyle/health/vomiting-in-newborns-causes-tips-to-ensure-proper-feeding-practices-101694328745852.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/10/1600x900/virus-outbreak-ukraine-stranded-babies_e29136fa-b1da-11ea-ad6c-23734eaf1981_1694329128710.jpg", "publishedAt": "2023-09-10T07:08:48Z", "content": "Vomiting is a common concern for parents of newborns and premature babies and while it can be distressing to witness your little one vomiting, health experts point out that it is essential to underst… [+5318 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Thomson Reuters Foundation", "title": "Mosquito-Borne Dengue Grows Deadlier in South Asia as Planet Warms - Voice of America - VOA News", "description": "Experts say rising temperatures, longer monsoon seasons provide ideal breeding conditions for mosquitoes", "url": "https://www.voanews.com/a/mosquito-borne-dengue-grows-deadlier-in-south-asia-as-planet-warms/7259434.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-10ec-08dbb016eb3e_cx0_cy7_cw0_w1200_r1.jpg", "publishedAt": "2023-09-10T07:03:32Z", "content": "DHAKA/KATHMANDU  Mosquito-borne dengue fever is taking a heavy toll on South Asian nations this year as Bangladesh grapples with record deaths and Nepal faces cases in new areas, with disease experts… [+6819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Common foods that can help in healing headache - Times of India - Times of India", "description": "Staying mindful of caffeine intake, choosing dark chocolate in moderation, and sipping on soothing herbal teas like peppermint or chamomile can be pa", "url": "https://timesofindia.indiatimes.com/life-style/food-news/common-foods-that-can-help-in-healing-headache/articleshow/103541132.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-103541439,width-1070,height-580,imgsize-83604,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-09-10T06:17:00Z", "content": "Best dressed TV celebs of the week"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Reveals That Lonely People Process the World Differently - SciTechDaily", "description": "A researcher from USC Dornsife in psychology comparing brain images has found significant differences in the brain processing patterns of lonely individuals when compared to those who aren't lonely. The Russian writer and philosopher Leo Tolstoy may have been…", "url": "https://scitechdaily.com/?p=306765", "urlToImage": "https://scitechdaily.com/images/Simple-Brain-Waves-Signals-Illustration.jpg", "publishedAt": "2023-09-10T05:32:09Z", "content": "ByUniversity of Southern CaliforniaSeptember 9, 2023\r\nNew researchers reveals that lonely individuals have distinct and varied brain processing patterns when compared to those who arent lonely, which… [+6952 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "NIV study finds new variant of chickenpox-causing virus in India - ETHealthWorld", "description": "NIV scientist Dr Pragya Yadav, who is also one of the authors of the study, said, \"The Clade 9 is the most common VZV strain in circulation in countries like Germany, UK and US. However, this is the first study reporting the circulation of VZV Clade 9 in Indi…", "url": "https://health.economictimes.indiatimes.com/news/industry/niv-study-finds-new-variant-of-chickenpox-causing-virus-in-india/103547387", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-103547387,imgsize-16516,width-1200,height=765,overlay-ethealth/industry/niv-study-finds-new-variant-of-chickenpox-causing-virus-in-india.jpg", "publishedAt": "2023-09-10T05:07:27Z", "content": "Pune: The National Institute of Virology (NIV) has found the presence of Clade 9 variant of chickenpox-causing varicella-zoster virus (VZV) for the first time in the country in its latest study, layi… [+1330 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "IANS", "title": "Proton beam therapy may shorten breast cancer treatment: Study - DTNEXT", "description": "The study, published in The Lancet Oncology, uncovered the evidence supporting a shorter treatment time for breast cancer patients.", "url": "https://www.dtnext.in/lifestyle/wellbeing/proton-beam-therapy-may-shorten-breast-cancer-treatment-study-735354", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/09/10/763666-breastcancer1in4women.jpg", "publishedAt": "2023-09-10T05:00:06Z", "content": "SAN FRANCISCO: Proton beam therapy, known for its precision in targeting cancer cells while preserving healthy tissue to reduce the risk of side effects, may help cut down duration of breast cancer t… [+2361 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "PCOS Awareness Month 5 Common Signs And Symptoms To Watch Out For - Jagran English", "description": "PCOS Awareness Month It is an important event observed from 1st to 30th September across the globe PCOS or Polycystic Ovary Syndrome is a reproductive condition that some women experience due to hormone imbalance and other factors", "url": "https://english.jagran.com/lifestyle/pcos-awareness-month-common-signs-and-symptoms-to-watch-out-for-10099470", "urlToImage": "https://imgeng.jagran.com/images/2023/sep/pcos-awareness-month1694321838754.jpg", "publishedAt": "2023-09-10T04:49:00Z", "content": "Signs Of PCOS: PCOS Awareness Month is observed every year in September is a federally designated event and is sponsored by the PCOS Challenge: The National Polycystic Ovary Syndrome Association. The… [+3363 chars]"}, {"source": {"id": null, "name": "Diabetes.co.uk"}, "author": null, "title": "Top researcher unveils ways to reduce cholesterol - Diabetes.co.uk", "description": "People can reduce their cholesterol by consuming more green leafy vegetables, beans, oats, soy milk and seeds, a researcher from the University of Toronto has said. Dr David Jenkins believes that high cholesterol levels can be lowered by following his portfol…", "url": "https://www.diabetes.co.uk/news/2023/sep/top-researcher-unveils-ways-to-reduce-cholesterol.html", "urlToImage": "https://www.diabetes.co.uk/wp-content/uploads/2023/09/scaleonyellow-1000x600.jpg", "publishedAt": "2023-09-10T04:41:35Z", "content": "People can reduce their cholesterol by consuming more green leafy vegetables, beans, oats, soy milk and seeds, a researcher from the University of Toronto has said.\r\nDr David Jenkins believes that hi… [+1437 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Niveditha Kalyanaraman", "title": "6 Fruits That You Must NOT Eat At Night - Slurrp", "description": "Fruits you must avoid at night.", "url": "https://www.slurrp.com/web-stories/6-fruits-that-you-must-not-eat-at-night/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/09/10094706/cropped-pexels-jane-doan-1171170.jpg", "publishedAt": "2023-09-10T04:17:13Z", "content": "Fruits are nutrient agents and are healthy choices for a diet. But there are some fruits that you must not eat at night due to the trouble they pose, hindering your sleep.Here are 6 fruits you must a… [+13 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Sonali Sharma", "title": "Diabetes diet: 10 low GI fruits to control blood sugar spike - DNA India", "description": "Diabetes diet: Low GI Fruits That Can Be Good For Diabetics", "url": "https://www.dnaindia.com/web-stories/health/diabetes-diet-10-low-gi-fruits-to-control-blood-sugar-spike-1694318843472", "urlToImage": null, "publishedAt": "2023-09-10T04:16:48Z", "content": "Guava contains vitamin C, antioxidants, potassium, and fibre, this delicious fruit is also considered good for diabetics."}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Diabetes Management: 5 Tips to Prevent Your Blood Sugar Hike And Maintain Glucose Level - India.com", "description": "Severe effects from persistently high blood sugar are often irreversible. A balanced diet, consistent exercise, and frequent monitoring can all help you manage your diabetes, though.", "url": "https://www.india.com/health/diabetes-management-5-tips-to-prevent-your-blood-sugar-hike-and-maintain-glucose-level-6306879/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/09/Collage-Maker-10-Sep-2023-09-10-AM-3236.jpg", "publishedAt": "2023-09-10T03:48:59Z", "content": "Severe effects from persistently high blood sugar are often irreversible. A balanced diet, consistent exercise, and frequent monitoring can all help you manage your diabetes, though.\r\nDiabetes Manage… [+1975 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "INDIATODAY", "title": "At-home treatment tips for Dengue - India Today", "description": "Dengue is caused by the bite of an infected mosquito. While there is no cure for Dengue, experts have shared tips to manage the symptoms of the disease.", "url": "https://www.indiatoday.in/visualstories/wellness/at-home-treatment-tips-for-dengue-61622-10-09-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/09/gettyimages-1139947549_1200_675.jpg", "publishedAt": "2023-09-10T01:31:52Z", "content": "Dengue is caused by the bite of an infected mosquito. Symptoms include high fever, headache, body aches, nausea, rash, belly pain, vomiting, bleeding from the nose or gums, and extreme fatigue."}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Yoga may be a drug-free way women can stave off Alzheimer's disease - Study Finds", "description": "Yoga is not only a great way to exercise, but it can also help prevent cognitive decline.", "url": "https://studyfinds.org/yoga-women-alzheimers/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2022/06/pexels-nataliya-vaitkevich-4827956-scaled-e1655826925339.jpg", "publishedAt": "2023-09-09T21:05:45Z", "content": "LOS ANGELES — Yoga is not only a great way to exercise, but it can also help prevent cognitive decline. UCLA Health researchers found that Kundalini yoga, a gentle form of yoga emphasizing breathing,… [+2824 chars]"}, {"source": {"id": null, "name": "Deseret News"}, "author": "Margaret Darby", "title": "Berries are a superfood packed with health benefits - Deseret News", "description": "Berries are a superfood rich with nutrients and health benefits", "url": "https://www.deseret.com/2023/9/9/23864907/eating-berries-health-benefits-superfoods", "urlToImage": "https://deseret.brightspotcdn.com/dims4/default/96527ad/2147483647/strip/true/crop/2400x1370+0+106/resize/1461x834!/quality/90/?url=https%3A%2F%2Fcdn.vox-cdn.com%2Fthumbor%2FDSBgJNrMFrPvp-_pT19Seic9gKA%3D%2F0x0%3A2400x1528%2F2400x1528%2Ffilters%3Afocal%281258x791%3A1259x792%29%2Fcdn.vox-cdn.com%2Fuploads%2Fchorus_asset%2Ffile%2F24906933%2Fmerlin_1799345.jpg", "publishedAt": "2023-09-09T17:13:00Z", "content": "Berries are a superfood rich with nutrients such as fiber, magnesium, vitamin C, potassium and antioxidants, per The Washington Post. A daily dose of berries can benefit your heart, skin and mental h… [+5280 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Keto Diet Boosts Fertility Among Women With PCOS: Study - Zee News", "description": "The ketogenic (keto) diet may not only help lose that extra fat but also cut down hormone imbalances, enabling women with polycystic ovary syndrome (PCOS) to conceive, according to a new study. PCOS is the most common hormone disorder in women, affecting 7-10…", "url": "https://zeenews.india.com/health/keto-diet-boosts-fertility-among-women-with-pcos-study-2660163", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/09/09/1278249-keto-diet.jpg", "publishedAt": "2023-09-09T17:10:23Z", "content": "The ketogenic (keto) diet may not only help lose that extra fat but also cut down hormone imbalances, enabling women with polycystic ovary syndrome (PCOS) to conceive, according to a new study. PCOS … [+1902 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "6 Potassium Rich Foods For A Balanced Diet: Banana, Sweet Potato And More - Slurrp", "description": "For a healthy body and mind, a nutrient-rich diet plays an essential role. Potassium is a key component when it comes to muscle function, nerve function, heart health and others. Scroll down to know about six potassium-rich foods that you can have for a balan…", "url": "https://www.slurrp.com/article/6-potassium-rich-foods-for-a-balanced-diet-banana-sweet-potato-and-more-1694276663756", "urlToImage": "https://images.slurrp.com/prodarticles/3epxq3idh7o.webp", "publishedAt": "2023-09-09T16:33:15Z", "content": "If some studies are to be believed, adequate potassium intake can help lower the risk of irregular heart rhythms. A diet rich in potassium can help lower blood pressure and potentially helps countera… [+872 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Researchers suggest Musashi-2 controls skeletal muscle composition - TheNewsMill", "description": "Tokyo [Japan], September 9 (ANI): Musashi-2 (Msi2) is a major player in the control of skeletal muscle metabolism and mass, according to research from Tokyo Metropolitan University. They observed lower muscle mass in mice that had the Msi2 gene knocked out du…", "url": "https://thenewsmill.com/2023/09/researchers-suggest-musashi-2-controls-skeletal-muscle-composition/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=137407&object_id=137407&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F09%252Fresearchers-suggest-musashi-2-controls-skeletal-muscle-composition.jpg", "publishedAt": "2023-09-09T12:31:00Z", "content": "Tokyo [Japan], September 9 (ANI): Musashi-2 (Msi2) is a major player in the control of skeletal muscle metabolism and mass, according to research from Tokyo Metropolitan University. They observed low… [+2858 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Dolan.Banerjee", "title": "New Covid Variant Cases Surge In US With School Returning - Asiana Times", "description": "With school returning, hospitalizations because of the Pirola covid variant has been increasing across a lot of the US. This is the first time that the covid situation has been rising in the states. The increase has been happening right before the updated sho…", "url": "https://asianatimes.com/pirola-covid-variant-rise-in-cases-in-the-us/", "urlToImage": "https://sgp1.digitaloceanspaces.com/spaces-asianatimes/2023/09/pirola-covid-featured-new.jpg", "publishedAt": "2023-09-09T11:32:59Z", "content": "With school returning, hospitalizations because of the Pirola covid variant has been increasing across a lot of the US. This is the first time that the covid situation has been rising in the states. … [+3359 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Kristina Das", "title": "Avoiding Fad Diets to Reading Labels: 10 behavioural hacks for mindful eating - India TV News", "description": "If you are prepared to adopt a different strategy that draws on the knowledge of our forebears, mindful eating is a route worth taking. This age-old method offers a unique path of transformation.", "url": "https://www.indiatvnews.com/lifestyle/food/avoiding-fad-diets-to-reading-labels-10-behavioural-hacks-for-mindful-eating-2023-09-09-891717", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/09/mindful-eating-1694255639.jpg", "publishedAt": "2023-09-09T10:34:51Z", "content": "People who try to lose weight or try to remain fit are generally tired of the never-ending cycle of overeating and dieting. Today, food is often reduced to ingredient lists, calorie counts, or transi… [+4677 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research shines light on early life factors that may increase risk of cardiovascular disease in women - News-Medical.Net", "description": "Advanced research is casting light on possible early life factors – including poverty, physical or mental abuse ­– that may impact the rate of egg loss and increase the risk of cardiovascular disease in post-menopausal women.", "url": "https://www.news-medical.net/news/20230909/Research-shines-light-on-early-life-factors-that-may-increase-risk-of-cardiovascular-disease-in-women.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/heart_disease_1_12c3ff20f43b43d898bf18f5689e0c7c-620x480.jpg", "publishedAt": "2023-09-09T10:04:00Z", "content": "Advanced research is casting light on possible early life factors – including poverty, physical or mental abuse ­– that may impact the rate of egg loss and increase the risk of cardiovascular disease… [+3959 chars]"}, {"source": {"id": null, "name": "Kreedon.com"}, "author": "Saurabh Sameer Karmarkar", "title": "Top 10 Health Benefits Of Kapalbhati | Your Path to Radiant Health - KreedOn", "description": "Delve into the practice of Kapalbhati Pranayama, covering its proper execution, its benefits, & essential precautions to keep in mind", "url": "https://www.kreedon.com/health-benefits-of-kapalbhati-pranayama/", "urlToImage": "https://www.kreedon.com/wp-content/uploads/2023/09/yoga-for-weight-loss-kapalbhati.jpg", "publishedAt": "2023-09-09T09:12:03Z", "content": "Yoga is one of the greatest gifts India has given to the entire world. Yoga has been a point of fascination for foreigners and many of them have included yoga in their daily workout routine and fitne… [+7530 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Akshita Jolly", "title": "Uric Acid Diet: Avoid These Foods To Maintain Balance In Your Body! - HerZindagi", "description": "Uric Acid Diet: Avoid These Foods To Maintain Balance In Your Body!", "url": "https://www.herzindagi.com/web-stories/health/uric-acid-diet-foods-to-avoid-to-maintain-balance-ws-17618", "urlToImage": "https://images.herzindagi.info/webstories/17618/social-media-1694249979.jpeg", "publishedAt": "2023-09-09T09:00:30Z", "content": "<ul>Watching our diet habits is extremely important so that we can take care of our health. Avoid these foods to keep your uric acid level in balance. Tap to see. </ul>\r\nSugar \r\n<ul>Sugar has an elem… [+798 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Does excessive gyming and steroids lead to fertility issues in men? - Hindustan Times", "description": "Steroids were originally made as medical supplements but are now used in body building industry too. Does excessive gyming and steroids lead to male infertility | Health", "url": "https://www.hindustantimes.com/lifestyle/health/male-infertility-does-excessive-gyming-and-steroids-lead-to-fertility-issues-in-men-101694243806606.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/09/1600x900/anastase-maragos-7kEpUPB8vNk-unsplash_1694244798009_1694244831729.jpg", "publishedAt": "2023-09-09T07:50:43Z", "content": "A six-pack guy is what many girls dream of and a six-pack body is every mans dream so, to make this dream come true, they hit the gym but making a macho heroic body with six packs is not easy and is … [+4384 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Swine Flu Strains in Cambodian Pigs Could Heighten Pandemic Risks | Weather.com - The Weather Channel", "description": "Pigs play a crucial role in the emergence and potential spread of influenza viruses between animals and humans because they provide an ideal environment for the exchange of gene segments, ultimately leading to the creation of new viruses.", "url": "https://weather.com/en-IN/india/health/news/2023-09-09-swine-flu-strains-in-cambodian-pigs-could-heighten-pandemic-risks", "urlToImage": "https://s.w-x.co/in-pigs.jpg", "publishedAt": "2023-09-09T06:49:23Z", "content": "Scientists have identified several previously unknown strains of swine flu viruses that have quietly circulated in Cambodian pig populations for the past 15 years, potentially posing a pandemic risk.… [+3003 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Online AI-based test for Parkinson's severity shows promising results - Sentinelassam - The Sentinel Assam", "description": "Researchers have developed a new online artificial intelligence (AI) tool that can help people with Parkinson's disease remotely assess the severity of their symptoms within minutes.", "url": "https://www.sentinelassam.com/science-and-technology/online-ai-based-test-for-parkinsons-severity-shows-promising-results-666194", "urlToImage": "https://assets.sentinelassam.com/h-upload/2023/09/09/479080-parkinson-artificial-intelligence-updrs.jpg", "publishedAt": "2023-09-09T03:59:16Z", "content": "New York: Researchers have developed a new online artificial intelligence (AI) tool that can help people with Parkinson's disease remotely assess the severity of their symptoms within minutes. \r\nDesc… [+2245 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "High BP while lying down linked to heart attack, stroke risk: Research - Sentinelassam - The Sentinel Assam", "description": "People who had high blood pressure (BP) while lying flat on their backs had an increased risk of heart attack, stroke, heart failure or premature death, according to new research.", "url": "https://www.sentinelassam.com/topheadlines/high-bp-while-lying-down-linked-to-heart-attack-stroke-risk-research-666173", "urlToImage": "https://assets.sentinelassam.com/h-upload/2023/09/09/479059-health.jpg", "publishedAt": "2023-09-09T02:08:44Z", "content": "NEW YORK: People who had high blood pressure (BP) while lying flat on their backs had an increased risk of heart attack, stroke, heart failure or premature death, according to new research. The study… [+2522 chars]"}]}