{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "Newswise"}, "author": "Regenstrief Institute", "title": "Multistate study examines mRNA vaccine effectiveness for immunocompromised adults during Omicron BA.4 and BA.5 predominance - Newswise", "description": "A new study from the Centers for Disease Control and Prevention’s VISION Network presents and analyzes some of the first real-world data on mRNA COVID vaccine", "url": "https://www.newswise.com/coronavirus/multistate-study-examines-mrna-vaccine-effectiveness-for-immunocompromised-adults-during-omicron-ba-4-and-ba-5-predominance", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2022-10-26T17:25:00Z", "content": "Newswise — INDIANAPOLIS -- A new study from the Centers for Disease Control and Prevention’s VISION Network presents and analyzes some of the first real-world data on mRNA COVID vaccine effectiveness… [+10080 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "As Protection From Current Covid-19 Monoclonal Antibody Treatments Fades, The Discovery Of A New Class Of Antibodies Brings Hope - Forbes", "description": "New classes of antibodies may be one of our best tools to overcome new immune evasive variants.", "url": "https://www.forbes.com/sites/williamhaseltine/2022/10/26/as-protection-from-current-covid-19-monoclonal-antibody-treatments-fades-the-discovery-of-a-new-class-of-antibodies-brings-hope/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63594ce3da3b6af85908fd10/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-10-26T17:07:39Z", "content": "Female hand sifting flour against a dark blue background. Close-up shot\r\ngetty\r\nThe latest Omicron subvariants are evolving to become more immune evasive, rendering monoclonal antibody treatments suc… [+5132 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mary Kekatos", "title": "Patients with weakened immune systems suffer severe effects, death from monkeypox: CDC - ABC News", "description": "Many patients with severe monkeypox had untreated HIV, the CDC said.", "url": "https://abcnews.go.com/Health/patients-weakened-immune-system-suffer-severe-effects-death/story?id=92128529", "urlToImage": "https://s.abcnews.com/images/Health/monkeypox-vaccination-gty-jt-221026_1666799843368_hpMain_16x9_992.jpg", "publishedAt": "2022-10-26T17:04:09Z", "content": "Immunocompromised patients who contract monkeypox can suffer devastating consequences, according to new federal data.\r\nA report, published Wednesday by the Centers for Disease Control and Prevention,… [+2279 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "At risk for diabetes? Cut the carbs, says new study - Science Daily", "description": "A low-carbohydrate diet, if sustained, may be a useful dietary approach for preventing and treating type 2 diabetes, but more research is needed, according to a new study. The clinical trial looked at how low-carb diets affect blood sugar control.", "url": "https://www.sciencedaily.com/releases/2022/10/221026114351.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-26T17:03:12Z", "content": "While low-carb diets are often recommended for those being treated for diabetes, little evidence exists on whether eating fewer carbs can impact the blood sugar of those with diabetes or prediabetes … [+2992 chars]"}, {"source": {"id": null, "name": "Consultant360.com"}, "author": null, "title": "Medical or Surgical Treatment? Clinical Factors to Consider in Patients With Crohn Disease - Consultant360", "description": "Despite several medical therapies currently available to treat Crohn disease, many patients still undergo surgical treatment. Benjamin Cohen, MD, co-section head and clinical director of the Department of Inflammatory Bowel Disease at The Cleveland Clinic, di…", "url": "https://www.consultant360.com/qas/medical-or-surgical-treatment-clinical-factors-consider-patients-crohn-disease", "urlToImage": "https://d148x66490prkv.cloudfront.net/c360/2022-10/benjamin%20cohen%20md.jpeg", "publishedAt": "2022-10-26T15:32:23Z", "content": "Although there are several medical therapies currently available to treat patients with Crohn disease, many patients still undergo surgical treatment. According to Benjamin Cohen, MD,co-section head … [+7755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why you need not fear the hip replacement surgery - The Indian Express", "description": "Recent advancements and minimally invasive procedures have made these surgeries easier with less recovery time and better pain control, says Dr Akhilesh Yadav, Associate Director, Orthopaedics and Joint Replacement, Max Super Speciality Hospital, Vaishali", "url": "https://indianexpress.com/article/lifestyle/health-specials/hip-replacement-surgery-8231845/", "urlToImage": "https://images.indianexpress.com/2022/10/hip-replacement-surgery-hero-1.jpg", "publishedAt": "2022-10-26T15:21:59Z", "content": "Until a few years ago, people had to stay in hospitals for more than a couple of weeks after a hip replacement surgery. They would become dependent on other people as well as walkers to learn to use … [+3583 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Glycemic variability closely associated with increase in risk of all-cause mortality - Medical Dialogues", "description": "China: In a new study conducted by Junxiang Chen and the team, it was found that the number of...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/glycemic-variability-closely-associated-with-increase-in-risk-of-all-cause-mortality-101212", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/16/185739-hyperglycemia.jpg", "publishedAt": "2022-10-26T14:30:35Z", "content": "China: In a new study conducted by Junxiang Chen and the team, it was found that the number of unfavorable outcomes related to diabetes that long-term glycemic variability (GV) was associated with va… [+2265 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Heart health tips: Can you prevent sudden cardiac arrest? Here's what to know - Hindustan Times", "description": "A lot of young people are suffering from heart attacks and a lot of celebrities have fallen for it too because people generally have abnormalities in their heart muscles or electrical channel abnormalities. Check out these primary preventions for sudden cardi…", "url": "https://www.hindustantimes.com/lifestyle/health/heart-health-tips-can-you-prevent-sudden-cardiac-arrest-here-s-what-you-need-to-know-101666791253991.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/26/1600x900/heart-g484eac088_1920_1666791626651_1666791649738_1666791649738.jpg", "publishedAt": "2022-10-26T14:12:29Z", "content": "South East Asians have very high chances of coronary artery disease, nearly 2-3 times higher than Caucasians while Indians tend to have diffused coronary artery diseases with all vessels involved. On… [+5121 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "E-cigarettes can cause cardiac arrhythmias, warns new research - The Siasat Daily", "description": "A new US study involving an Indian-origin researcher has found that exposure to e-cigarette aerosols can cause heart arrhythmias", "url": "https://www.siasat.com/e-cigarettes-can-cause-cardiac-arrhythmias-warns-new-research-2442836/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/04/E-cigarettes_APR13.jpg", "publishedAt": "2022-10-26T14:03:00Z", "content": "New York: A new US study involving an Indian-origin researcher has found that exposure to e-cigarette aerosols can cause heart arrhythmias in animal models — both in the form of premature and skipped… [+2488 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Ceftolozane/Tazobactam Plus Metronidazole: Effective Treatment for Intra-Abdominal Infection - Medical Dialogues", "description": "CHINA: In accordance with results published in the International Journal of Infectious Diseases,...", "url": "https://medicaldialogues.in/gastroenterology/news/ceftolozanetazobactam-plus-metronidazole-effective-treatment-for-intra-abdominal-infection-101191", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/30/150721-antibiotics.jpg", "publishedAt": "2022-10-26T14:00:55Z", "content": "CHINA: In accordance with results published in the International Journal of Infectious Diseases, ceftolozane/tazobactam plus metronidazole was reported to be noninferior to meropenem for the treatmen… [+3018 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Role of Procalcitonin in Mechanically Ventilated Patients of COPD with respiratory failure - Medical Dialogues", "description": "CHINA: According to a report published in the International Journal of Chronic Obstructive Pulmonary ...", "url": "https://medicaldialogues.in/pulmonology/news/role-of-procalcitonin-in-mechanically-ventilated-patients-of-copd-with-respiratory-failure-101193", "urlToImage": "https://medicaldialogues.in/h-upload/2020/12/25/144719-copd.jpg", "publishedAt": "2022-10-26T14:00:00Z", "content": "CHINA: According to a report published in the International Journal of Chronic Obstructive Pulmonary Disease, the detection of procalcitonin can direct the choice of ventilation switching points in s… [+3560 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Ayurvedic Practices For A Healthy Liver - News18", "description": "From processing the food that we eat to removing harmful toxins, our liver does most of the work to keep us healthy", "url": "https://www.news18.com/news/lifestyle/ayurvedic-practices-for-a-healthy-liver-6247051.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/shutterstock_1350063266-166679191916x9.jpg", "publishedAt": "2022-10-26T13:47:08Z", "content": "From processing the food that we eat to removing harmful toxins, our liver does most of the work to keep us healthy. This is why, Yoga and Ayurveda Practitioner, Life Coach and Founder of Yogi Fuel, … [+9123 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid-causing virus in air detected with high-tech bubbles - ETHealthWorld", "description": "Such a detector could be positioned on a wall or ceiling, or in an air duct, where there's constant air movement, to alert occupants immediately when even a trace level of the virus is present.", "url": "https://health.economictimes.indiatimes.com/news/medical-devices/covid-causing-virus-in-air-detected-with-high-tech-bubbles/95103293", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95103293,imgsize-42842,width-1200,height-628,overlay-ethealthworld/covid-causing-virus-in-air-detected-with-high-tech-bubbles.jpg", "publishedAt": "2022-10-26T13:41:00Z", "content": "New York: Researchers have demonstrated that they can identify SARS-CoV-2, the virus that causes Covid-19, in the air by employing a nanotechnology-packed bubble that ruptures when it comes into cont… [+1406 chars]"}, {"source": {"id": null, "name": "Thecardiologyadvisor.com"}, "author": "Emily Estrada", "title": "HbA1c Associated With HF With Recovered Ejection Fraction in Type 2 Diabetes - The Cardiology Advisor", "description": "Researchers sought to determine the relationship between glycemic control and incidence of HFrecEF in patients with HFrEF and type 2 diabetes.", "url": "https://www.thecardiologyadvisor.com/home/topics/heart-failure/hba1c-associated-with-hf-with-recovered-ejection-fraction-in-type-2-diabetes-t2dm/", "urlToImage": null, "publishedAt": "2022-10-26T13:25:00Z", "content": "Patients with type 2 diabetes mellitus (T2DM) who develop heart failure (HF), especially HF with ischemic etiology, are less likely to have subsequent partial or complete recovery of ejection fractio… [+3152 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Study suggests lowering blood pressure helps prevent dementia - Global Times", "description": "A study conducted by the George Institute for Global Health and the University of New South Wales (UNSW) suggests that lowering blood pressure in later life can cut the risk of dementia.", "url": "https://www.globaltimes.cn/page/202210/1278040.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-03-05/cbc18881-da9f-4cb0-9ca9-9d768adaf7ed.jpeg", "publishedAt": "2022-10-26T13:25:00Z", "content": "A study conducted by the George Institute for Global Health and the University of New South Wales (UNSW) suggests that lowering blood pressure in later life can cut the risk of dementia.Dementia is a… [+1742 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "5 Things To Do To Prevent Breast Cancer - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-Women who don’t have children (nulliparous) are at higher risk of developing breast cancer. Women who have never breast fed are similarly at higher risk of breast cancer", "url": "http://bwhealthcareworld.businessworld.in/article/5-Things-To-Do-To-Prevent-Breast-Cancer-/26-10-2022-451804", "urlToImage": "http://static.businessworld.in/article/article_large_image/1634541117_F2Snl7_c.jpeg", "publishedAt": "2022-10-26T13:22:43Z", "content": "Women who dont have children (nulliparous) are at higher risk of developing breast cancer. Women who have never breast fed are similarly at higher risk of breast cancerBreast cancer develops when cel… [+3611 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What 'Virtual Autopsy' Revealed About Health Of A 17th Century Mummified Baby - NDTV", "description": "Researchers from Germany conducted a \"virtual autopsy\" on a baby who had been mummified and buried in an Austrian mausoleum.", "url": "https://www.ndtv.com/world-news/scientists-conduct-virtual-autopsy-of-austrias-mummified-baby-find-signs-of-malnutrition-3464045", "urlToImage": "https://c.ndtvimg.com/2022-10/o78sc9a8_mummified-baby_625x300_26_October_22.jpg", "publishedAt": "2022-10-26T13:22:21Z", "content": "The mummified infant was discovered in an aristocratic family's crypt.\r\nA toddler who had been mummified had his cause of death determined roughly 400 years after his death. The baby was found buried… [+2015 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "No link between prenatal exposure to anesthesia and impaired neurodevelopmental outcomes - Medical Xpress", "description": "A new study published in Anaesthesia has found no link between antenatal exposure to anesthesia and subsequent impaired neurodevelopmental outcomes in children. The project was led by Professor Steffen Rex and a team from the Anesthesiology Department at the …", "url": "https://medicalxpress.com/news/2022-10-link-prenatal-exposure-anesthesia-impaired.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/anesthesia-1.jpg", "publishedAt": "2022-10-26T13:16:03Z", "content": "A new study published in Anaesthesia has found no link between antenatal exposure to anesthesia and subsequent impaired neurodevelopmental outcomes in children. The project was led by Professor Steff… [+3387 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "What are the ways to prevent sickness? - Firstpost", "description": "It is important for you to get 8 hours of sleep every day. You should get sound, good quality sleep.", "url": "https://www.firstpost.com/living/five-lifestyle-changes-you-can-adopt-to-prevent-sickness-11516041.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/10/SICKNESS.jpg", "publishedAt": "2022-10-26T13:08:21Z", "content": "Staying fit and healthy is the key to enjoying life to the fullest. But occasionally, as and when the seasons change, we all get sick. While eating the right kinds of food and exercising daily are pr… [+1928 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": "leventelmastas", "title": "Why Is It Important To Maintain Bone Health? What Are the Foods That Strengthen Bones? - RaillyNews", "description": "Why Is It Important To Maintain Bone Health? What Are the Foods That Strengthen Bones? - Physical Therapy and Rehabilitation Specialist Associate Professor Ahmet İnanır gave important information on the subject. To have strong and healthy bones", "url": "https://www.raillynews.com/2022/10/what-are-the-foods-that-strengthen-bones-why-it-is-important-to-maintain-bone-health/", "urlToImage": "https://rayhaber.com/wp-content/uploads/2022/10/saglikli-kemikler.jpg", "publishedAt": "2022-10-26T12:52:13Z", "content": "Why Is It Important To Maintain Bone Health? What Are the Foods That Strengthen Bones?\r\nPhysical Therapy and Rehabilitation Specialist Associate Professor Ahmet nanr gave important information on the… [+3581 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Warrior diet, intermittent fasting can affect female hormones: Study - Mathrubhumi English", "description": "Chicago [US]: Although intermittent fasting has been proven to be a successful weight loss method, some have expressed concern that it might harm women's reproductive hormones. Recently, a group of researchers from the University of Illinois at Chicago publis…", "url": "https://english.mathrubhumi.com/features/health/warrior-diet-intermittent-fasting-can-affect-female-hormones-study-1.7990689", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.7990702:1666785302/diet%20(1).jpg?$p=06b9c21&f=16x9&w=1080&q=0.8", "publishedAt": "2022-10-26T11:57:11Z", "content": "Chicago [US]: Although intermittent fasting has been proven to be a successful weight loss method, some have expressed concern that it might harm women's reproductive hormones. Recently, a group of r… [+3809 chars]"}, {"source": {"id": null, "name": "Medicinematters.com"}, "author": null, "title": "Minimal access breast surgery 'valid' option for early breast cancer - medwireNews", "description": "Minimal access breast surgery offers comparable long-term outcomes to conventional surgery for women with stage 0–III breast cancer, show the results of a propensity-matched, retrospective cohort study.", "url": "https://oncology.medicinematters.com/breast-cancer/surgery/minimal-access-breast-surgery-valid-option-ebc/23641420", "urlToImage": "https://media.springernature.com/lw400/springer-cms/rest/v1/img/23641438/v2/16by9?as=jpg", "publishedAt": "2022-10-26T11:48:34Z", "content": "medwireNews: Minimal access breast surgery (MABS) offers comparable long-term outcomes to conventional surgery for women with stage 0III breast cancer, show the results of a propensity-matched, retro… [+2569 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Sex after menopause: How women can have a great sex life even after menstruation stops - check doctor`s adv... - Zee News", "description": "Menopause is the natural biological process characterized by the cessation or stopping of a womans menstrual cycle, marking the end of fertility. The general onset is observed in middle-aged women, i.e., between 40 to 50 years of age.", "url": "https://zeenews.india.com/health/sex-after-menopause-how-women-can-have-a-great-sex-life-after-menstruation-stops-check-doctors-advice-2526907", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/10/26/1108359-couple-hug-pixabay.jpg", "publishedAt": "2022-10-26T10:27:27Z", "content": "New Delhi: Menopause is the natural biological process characterized by the cessation or stopping of a woman's menstrual cycle, marking the end of fertility. The general onset is observed in middle-a… [+5246 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Samrat Sharma", "title": "Covid-19 severely raised risks of heart disease, death, especially among younger people - India Today", "description": "Heart attack deaths within the first year of the pandemic rose by 14 per cent to 1.64 lakh from 1.44 lakh in the year before the Covid pandemic.", "url": "https://www.indiatoday.in/diu/story/covid-19-severely-risks-heart-disease-death-younger-people-2289678-2022-10-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/covid_case-sixteen_nine_1-sixteen_nine.jpeg?VersionId=Zyi4XwtxFziLPKWLvoNML.WZxv6rY4p4", "publishedAt": "2022-10-26T10:08:06Z", "content": "By Samrat Sharma: The world has travelled through three deadly Covid-19 waves. However, a sigh of relief still looks like a distant dream. New studies reveal that the infection has severely raised th… [+2038 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Relevance of plasma biomarkers to pathologies in Alzheimer's disease, Parkinson's disease and frontotemporal dementia | Scientific Reports - Nature.com", "description": "Scientific Reports - Relevance of plasma biomarkers to pathologies in Alzheimer’s disease, Parkinson’s disease and frontotemporal dementia", "url": "https://www.nature.com/articles/s41598-022-22647-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22647-6/MediaObjects/41598_2022_22647_Fig1_HTML.png", "publishedAt": "2022-10-26T09:45:59Z", "content": "<li>OBryant, S. E. et al. Blood-based biomarkers in Alzheimer disease: Current state of the science and a novel collaborative paradigm for advancing from discovery to clinic. Alzheimers Dement.13, 45… [+18993 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Telangana Today", "title": "Hair straightening products may increase risk of cancer in women: Study - Telangana Today", "description": "For women in the study who frequently use hair straightening products, the risk of developing uterine cancer by the age of 70 was 4.05 per cent while it was 1.64 per cent for people who never used the products.", "url": "https://telanganatoday.com/hair-straightening-products-may-increase-risk-of-cancer-in-women-study", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/10/Hair-straightening-1.jpg", "publishedAt": "2022-10-26T09:43:06Z", "content": null}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Reuters", "title": "It takes guts: Study shows snacking on almonds improve gut health | Daily Sabah - Daily Sabah", "description": "Almonds are among the world&#039;s most popular tree nuts. They are highly nutritious and rich in healthy fats, antioxidants, vitamins and minerals. They...", "url": "https://www.dailysabah.com/life/health/it-takes-guts-study-shows-snacking-on-almonds-improve-gut-health", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2022/10/26/thumbs/800x531/237793.jpg", "publishedAt": "2022-10-26T09:22:02Z", "content": "Almonds are among the world's most popular tree nuts. They are highly nutritious and rich in healthy fats, antioxidants, vitamins and minerals. They are delicious to snack on to say the least, and it… [+1947 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "WHO releases first-ever list of fungal infection, flags global health threat | Mint - Mint", "description": "The WHO FPPL list is divided into three categories: critical, high and medium priority", "url": "https://www.livemint.com/science/health/who-releases-first-ever-list-of-fungal-infection-flags-global-health-threat-11666770808109.html", "urlToImage": "https://images.livemint.com/img/2022/10/26/600x338/fungalinfection_1666772179946_1666772180166_1666772180166.jpg", "publishedAt": "2022-10-26T08:21:17Z", "content": "The World Health Organisation (WHO) has published a report highlighting the first-ever list of fungal \"priority pathogens\" a catalogue of the 19 fungi that represent the greatest threat to public hea… [+2934 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Mimi Banerjee", "title": "Ways To Take Care Of The Mental Health Of PCOS Patients - Asiana Times", "description": "Women who suffer from polycystic ovarian syndrome may have significant difficulties in several aspects of their lives. Most of the time, it has effects that aren't just physical but also harmful to our mental health due to hormonal imbalance, weight gain, and…", "url": "https://asianatimes.com/ways-to-take-care-mental-health-of-pcos-patients/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/10/a-depressed-woman.jpg", "publishedAt": "2022-10-26T08:08:05Z", "content": "Women who suffer from polycystic ovarian syndrome may have significant difficulties in several aspects of their lives. Most of the time, it has effects that aren’t just physical but also harmful to o… [+4438 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Alzheimer's Disease Linked Brain Insulin Resistance Clarified - Genetic Engineering & Biotechnology News", "description": "Defects in insulin receptors at the blood–brain barrier contribute to brain insulin resistance and affect β-amyloid pathology in Alzheimer's disease.", "url": "https://www.genengnews.com/neuroscience/alzheimers-disease-linked-brain-insulin-resistance-clarified/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/08/GettyImages-1019918500-scaled.jpg", "publishedAt": "2022-10-26T08:00:48Z", "content": "Experiments on post-mortem brain tissues from 60 deceased patients with Alzheimers disease (AD) and an AD animal model indicate that defects in insulin receptors at the bloodbrain barrier contribute … [+5146 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "New drug found effective for treating urinary tract infections: Study - Hindustan Times", "description": "A new drug combination has been found to be more effective, especially against persistent, drug-resistant infections, according to an international study.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/new-drug-found-effective-for-treating-complicated-urinary-tract-infections-study-101666769213497.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/26/1600x900/UTI_thumb_1665994622217_1666770603882_1666770603882.jpg", "publishedAt": "2022-10-26T07:51:09Z", "content": "A new drug combination has been found to be more effective, especially against persistent, drug-resistant infections, according to an international study conducted by a Rutgers expert comparing new a… [+3393 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Deepanshu Joshi", "title": "Tackling SIDS And Its Effects - Asiana Times", "description": "Sudden infant death syndrome (SIDS), often called \"cot death,\" is the abrupt and unknown death of an otherwise healthy baby.", "url": "https://asianatimes.com/tackling-sids-and-its-effects/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/10/Empty-crib-broken-heart.jpg", "publishedAt": "2022-10-26T07:44:45Z", "content": "Sudden infant death syndrome (SIDS), often called “cot death,” is the abrupt and unknown death of an otherwise healthy baby.\r\nSIDS is the greatest cause of death for infants aged one month to one yea… [+3654 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Preparing for a world with Alzheimer's treatment - Devdiscourse", "description": "The drug mopped up a protein associated with the disease but didnt appear to improve symptoms.More than a year later, the discussion has shifted from what has at times been a nonsensical debate on the different theories of what causes Alzheimers to other issu…", "url": "https://www.devdiscourse.com/article/health/2227017-preparing-for-a-world-with-alzheimers-treatment", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_06_2022_13_45_19_8689252.jpg?width=920&format=jpeg", "publishedAt": "2022-10-26T06:58:48Z", "content": "As Alzheimer's cases grow, scientists have been deep in debate over its causes. Now treatments are on the horizon, the new race is to ready the health system.\r\nWhen the US Food and Drug Administratio… [+3545 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "An Instagram page that uses humour to get through cancer - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/health/wellness/an-instagram-page-that-uses-humour-to-get-through-cancer-111666706369969.html", "urlToImage": "https://images.livemint.com/img/2022/10/25/1140x641/Breast_Cancer_1666707863912_1666707881340_1666707881340.jpg", "publishedAt": "2022-10-26T02:33:39Z", "content": "While going through cancer for the first time in 2015, Olivia Clarke discovered that, surprisingly enough, cancer had a funny side: whether it was humorous situations in the doctor's waiting room or … [+5567 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Diya Maria George", "title": "Surviving strokes: Tips to reduce the risk - The New Indian Express", "description": "Ahead of World Stroke Day, Dr Bhargavi Ramanujam explain this conditional and shared what can be done to reduce the risk of developing stroke.", "url": "https://www.newindianexpress.com/cities/delhi/2022/oct/26/surviving-strokes-tips-toreduce-the-risk-2511824.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/12/18/w600X390/Facto.jpg", "publishedAt": "2022-10-26T02:32:00Z", "content": "Unhealthy food habits, irregular exercise routines, and stressful work life may increase the risk of having a stroke. Even in surviving a stroke, conditions such as difficulties with speech and mobil… [+9464 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Raghavendra Gadagkar", "title": "More Fun Than Fun: When Natural Selection Makes Us Less Fit – The Wire Science - The Wire Science", "description": "'Survival of the fittest' – a phrase originally used by Herbert Spencer and later somewhat uncritically adopted by Darwin – is rather misleading.", "url": "https://science.thewire.in/the-sciences/natural-selection-fitness-evolutionary-medicine/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/10/25171155/IMG_4892-scaled.jpeg", "publishedAt": "2022-10-26T02:29:35Z", "content": "Down House, Charles Darwins family house in which Darwin lived and worked, wrote On the Origin of Species and conducted many elegant experiments to test his ideas. Down House is now preserved for pub… [+32666 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Brain fog is not limited to Covid. How do you know if you have it? - ETHealthWorld", "description": "Brain fog was one of the most common symptoms to emerge in the first months of Covid.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/brain-fog-is-not-limited-to-covid-how-do-you-know-if-you-have-it/95088485", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95088485,imgsize-19762,width-1200,height-628,overlay-ethealthworld/brain-fog-is-not-limited-to-covid-how-do-you-know-if-you-have-it.jpg", "publishedAt": "2022-10-26T01:15:00Z", "content": "PERTH: The COVID pandemic has introduced many scientific and medical terms into our everyday language. Many of us are now fluent in conversations about viral strains, PCR tests and mortality rates. \"… [+6276 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "VMC launches drive to give anti-rabies vaccine to 3,500 stray dogs - The New Indian Express", "description": "Dogs from suburbs are complicating the issue, the veterinarian pointed out and said action will be taken to control the problem.", "url": "https://www.newindianexpress.com/cities/vijayawada/2022/oct/26/vmc-launches-drive-to-give-anti-rabies-vax-to-3500-stray-dogs-2511832.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/10/18/w600X390/Dogs_EPS.jpg", "publishedAt": "2022-10-26T01:06:00Z", "content": "VIJAYAWADA: Vijayawada Municipal Corporation (VMC) has launched a special drive to administer anti-rabies vaccine to stray dogs under its ambit. As per official estimates, there are approximately 3,5… [+2198 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Overexpression of KIF11 gene may offset Alzheimer’s-related cognitive decline in mice and humans - News-Medical.Net", "description": "The overexpression of a gene tied to cell division and the structure and function of neurons may prevent and protect against cognitive decline in both mice and humans with Alzheimer’s disease (AD), according to a new study by scientists at the University of C…", "url": "https://www.news-medical.net/news/20221025/Overexpression-of-KIF11-gene-may-offset-Alzheimere28099s-related-cognitive-decline-in-mice-and-humans.aspx", "urlToImage": "https://www.news-medical.net/themes/Standard/images/full_site_logo.png", "publishedAt": "2022-10-26T00:20:00Z", "content": "The overexpression of a gene tied to cell division and the structure and function of neurons may prevent and protect against cognitive decline in both mice and humans with Alzheimer’s disease (AD), a… [+3384 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Where Do Fears Come From? - Neuroscience News", "description": "Exposure therapy for fears and phobias may only have a 50% success rate because fear memories outlast competing safety memories learned from therapy. Researchers investigate the genesis of fear memories and have developed a new mathematical model to help stre…", "url": "https://neurosciencenews.com/fear-exposure-memory-21728/", "urlToImage": "https://neurosciencenews.com/files/2022/10/fear-treatment-neurosicnes-public.jpg", "publishedAt": "2022-10-25T22:12:44Z", "content": "Summary: Exposure therapy for fears and phobias may only have a 50% success rate because fear memories outlast competing safety memories learned from therapy. Researchers investigate the genesis of f… [+12224 chars]"}, {"source": {"id": null, "name": "PR Web"}, "author": null, "title": "Targeting One Type of Immune Cell With Another Slows Cancer Growth in Preclinical Studies - PR Web", "description": "NEW YORK (PRWEB) October 25, 2022 \n\n A new approach to cancer immunotherapy that uses one type of immune cell to kill another—rather than directly attacking the cancer—provokes a robust anti-tumor i", "url": "https://www.prweb.com/releases/targeting_one_type_of_immune_cell_with_another_slows_cancer_growth_in_preclinical_studies/prweb18980997.htm", "urlToImage": "http://ww1.prweb.com/prfiles/2022/10/25/18980997/NewsImage_vcsPRAsset_521997_121932_027a2ac3-552c-4291-b3c0-12e3d2e870b5_0.png", "publishedAt": "2022-10-25T20:46:40Z", "content": "Mice with lung cancer were treated with macrophage-targeting CAR T cells resulting in reduced numbers of tumor macrophages (right side), shrunken tumors, and extended survival.\r\nOur initial goal was … [+7610 chars]"}, {"source": {"id": null, "name": "Rotary.org"}, "author": null, "title": "Global health leaders see a clear path to polio eradication - Rotary International", "description": null, "url": "https://www.rotary.org/en/global-health-leaders-see-clear-path-polio-eradication", "urlToImage": "https://www.rotary.org/sites/default/files/styles/w_600/public/World-Polio-Day-2022-WPD22-hero.png?itok=KMUaF-eM", "publishedAt": "2022-10-25T20:17:06Z", "content": "By Ryan Hyland and Arnold R. Grahl\r\nPhotography by Monika Lozinska\r\nGlobal health leaders expressed confidence that polio will be eradicated worldwide and praised the frontline workers who are strivi… [+5386 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "John Parkinson", "title": "Evaluating the Safety in Hepatitis B Vaccines - Contagionlive.com", "description": "Investigators examined the profiles of the HepB-CPG vaccine and HepB-alum vaccines to study the onset of select immune-mediated diseases, herpes zoster, or anaphylaxis.", "url": "https://www.contagionlive.com/view/evaluating-the-safety-in-hepatitis-b-vaccines", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/9b5b829bbc3e0c89ff459d8a1f7a1a8c51ae9fea-1280x720.png?fit=crop&auto=format", "publishedAt": "2022-10-25T18:50:32Z", "content": "According to a study conducted last year, the number of Americans and foreign born people living in the United States estimated to have chronic hepatitis B is 2.4 million.1\r\nIn addition to a large nu… [+2646 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Gravitas: New Hybrid virus detected - WION", "description": "Scientists have observed two viruses merging to form a hybrid for the very first time. The hybrid of influenza and RSV could circumvent immune responses. Priyanka Sharma tells you more.", "url": "https://www.wionews.com/videos/gravitas-new-hybrid-virus-detected-528352", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/10/26/2510_WOYB_GRAVITAS_New_Hybrid_Virus_05-1666723513-00000003.jpg", "publishedAt": "2022-10-25T18:45:01Z", "content": "© 2022. Indiadotcom Digital Private Limited. All Rights Reserved."}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Dengue cases continues to mount despite onset of winters - Daily Pioneer", "description": "The onset of winters has failed to have a limiting effect on the spread of dengue in Uttarakhand. On Tuesday the&nbsp;state health department reported 18 new cases of the disease on the day which increased the tally of the vector borne disease to 1819 in the …", "url": "https://www.dailypioneer.com/2022/state-editions/dengue-cases-continues-to-mount-despite-onset-of-winters.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-10-25T18:33:10Z", "content": "The onset of winters has failed to have a limiting effect on the spread of dengue in Uttarakhand. On Tuesday the state health department reported 18 new cases of the disease on the day which increase… [+1277 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "Oatmeal for Weight Loss: Here’s How It Can Help - Sportskeeda", "description": "Oatmeal is a popular breakfast food around the globe. They are very easy to cook and also astonishingly versatile.", "url": "https://www.sportskeeda.com/health-and-fitness/oatmeal-weight-loss-here-s-how-it-can-help", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/10/49c8d-16667157572402-1920.jpg", "publishedAt": "2022-10-25T17:34:12Z", "content": "Oatmeal is a popular breakfast food around the globe. They are very easy to cook and also astonishingly versatile. Oatmeal can be used in smoothies, milkshakes, porridges, and even in baked items lik… [+4162 chars]"}, {"source": {"id": null, "name": "NutraIngredients-usa.com"}, "author": "nutraingredients-usa.com", "title": "Study: Higher omega-3 levels keep brains young longer - NutraIngredients-usa.com", "description": "New research has suggested higher omega-3s levels might help forestall some of the changes seen in aging brains that in some cases are the precursors of dementia.", "url": "https://www.nutraingredients-usa.com/Article/2022/10/25/study-higher-omega-3-levels-keep-brains-young-longer", "urlToImage": "https://www.nutraingredients-usa.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-usa.com/news/research/study-higher-omega-3-levels-keep-brains-young-longer/15883709-1-eng-GB/Study-Higher-omega-3-levels-keep-brains-young-longer.jpg", "publishedAt": "2022-10-25T16:59:00Z", "content": "The new research was published recently in the journal Neurology.  It was the work of researchers from California, Massachusetts, South Dakota and Texas.\r\nThe research uses a data set derived from th… [+1428 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Metabolically healthy obesity \"worst\"- increases risk of prehypertension and hypertension - Medical Dialogues", "description": "CHINA: The results of recent research published in the Diabetology and Metabolic syndrome, BMC has...", "url": "https://medicaldialogues.in/diet-nutrition/news/metabolically-healthy-obesity-worst-increases-risk-of-prehypertension-and-hypertension-101022", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/17/188170-untitled-design-45.jpg", "publishedAt": "2022-10-25T14:30:53Z", "content": "CHINA: The results of recent research published in the Diabetology and Metabolic syndrome, BMC has linked Metabolically Healthy Obesity (MHO) with increased risk of prehypertension and hypertension, … [+4871 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Bangladesh dengue cases near 33K year to date - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The Bangladesh Directorate General of Health Services (DGHS) reported some 750 additional dengue fever cases Monday, bringing the country total to 32,716 year to date. This year’s tally is the second highest since 2000 when the government…", "url": "http://outbreaknewstoday.com/bangladesh-dengue-cases-near-33k-year-to-date-55087/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2021/10/bangladesh-g152b6179e_640.png", "publishedAt": "2022-10-25T14:10:16Z", "content": "NewsDesk @bactiman63\r\nThe Bangladesh Directorate General of Health Services (DGHS) reported some 750 additional dengue fever cases Monday, bringing the country total to 32,716 year to date.\r\nThis yea… [+938 chars]"}, {"source": {"id": null, "name": "Empr.com"}, "author": "Steve Duffy", "title": "Antibiotic Overuse Common in Children Hospitalized With COVID-19 - Monthly Prescribing Reference", "description": "Bacterial culture growth was reported in 13 (14%) patients, and 5 (5%) had urinary tract or bloodstream infections.", "url": "https://www.empr.com/home/mpr-first-report/id-week-2022/antibiotic-overuse-common-in-children-hospitalized-with-covid-19/", "urlToImage": "https://www.empr.com/wp-content/uploads/sites/7/2019/11/antibiotics_G_639979482.jpg", "publishedAt": "2022-10-25T13:30:00Z", "content": "Children hospitalized with COVID-19 infection are frequently prescribed unnecessary antibiotic therapy despite a low rate of culture-confirmed bacterial coinfection, according to study results presen… [+1836 chars]"}, {"source": {"id": null, "name": "Longevity.technology"}, "author": "Ivy C", "title": "New Research Shows Late-Night Snacking Increases Obesity Risk - Longevity.Technology", "description": "Late-night snacking has always been a no-no in terms of healthy habits. Did you know it also increases obesity risk?", "url": "https://longevity.technology/lifestyle/new-research-shows-late-night-snacking-increases-obesity-risk/", "urlToImage": "https://longevity.technology/lifestyle/wp-content/uploads/2022/10/New-research-shows-late-night-snacking-increases-obesity-risk.jpg", "publishedAt": "2022-10-25T12:57:39Z", "content": "It’s always been well-known advice for people wanting to lose weight to avoid late-night snacking. No wonder, as a host of research shows the link between late-night eating and increased body weight … [+9105 chars]"}, {"source": {"id": null, "name": "EIN News"}, "author": null, "title": "Irish Health Organizations Launch Adaptation of Landmark Canadian Obesity Guidelines - EIN News", "description": "Canadian expertise in obesity prevention and treatment has made the leap across the Atlantic, as Ireland unveils new Adult Clinical Practice Guidelines (CPGs)", "url": "https://www.einnews.com/pr_news/597713481/irish-health-organizations-launch-adaptation-of-landmark-canadian-obesity-guidelines", "urlToImage": "https://www.globenewswire.com/newsroom/ti?nf=ODY4MTA5MiM1MjIwOTMyIzIwODUzODY=", "publishedAt": "2022-10-25T12:38:00Z", "content": "/EIN News/ -- EDMONTON, Alberta, Oct. 25, 2022 (GLOBE NEWSWIRE) -- Canadian expertise in obesity prevention and treatment has made the leap across the Atlantic, as Ireland unveils new Adult Clinical … [+3296 chars]"}, {"source": {"id": null, "name": "Dynamitenews.com"}, "author": null, "title": "Health: Research Shows How Stress Affects Brain - Dynamite News", "description": "We've all experienced the paralyzing effects of danger or threat at some point. Read on for details:", "url": "https://www.dynamitenews.com/story/research-shows-how-stress-affects-brain", "urlToImage": "https://www.dynamitenews.com/images/2022/10/25/research-shows-how-stress-affects-brain/6357cfd4c8bc5.jpg", "publishedAt": "2022-10-25T12:35:02Z", "content": "We've all experienced the paralyzing effects of danger or threat at some point. Read on for details:\r\nIowa [US]:  We've all experienced the paralysing effects of danger or threat at some point.Resear… [+4441 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Sotrovimab effective treatment option for COVID-19 infection in Kidney Transplant Recipients - Medical Dialogues", "description": "SPAIN: According to research published in Clinical Kidney Journal, the monoclonal antibody...", "url": "https://medicaldialogues.in/nephrology/news/sotrovimab-effective-treatment-option-for-covid-19-infection-in-kidney-transplant-recipients-101192", "urlToImage": "https://medicaldialogues.in/h-upload/2022/03/15/172349-sotrovimab.jpg", "publishedAt": "2022-10-25T12:30:49Z", "content": "SPAIN: According to research published in Clinical Kidney Journal, the monoclonal antibody sotrovimab can be safely utilized in kidney transplant patients with COVID-19, including older people and th… [+3369 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Fact Check: Boston University Researchers Created New COVID-19 Strain That Can Kill 80% of People It - LatestLY", "description": "It must be noted that the research was conducted on mice only and as such, cannot be generalized to determine its impact on humans.", "url": "https://www.latestly.com/socially/social-viral/fact-check/users-online-are-claiming-that-boston-university-researchers-created-a-new-covid-19-strain-latest-tweet-by-reuters-fact-check-4375847.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/10/Boston-University-784x441.jpg", "publishedAt": "2022-10-25T12:17:25Z", "content": "Multiple users online have claimed that Boston University researchers have created a new COVID-19 strain that can kill 80 percent of the people it infects. However, the news is fake. It must be noted… [+1085 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Intranasal COVID-19 Vaccine Protects Against Variants in Animals - Technology Networks", "description": "Researchers have developed an intranasal vaccine for COVID-19 that, in hamsters, can fight off the original virus and two variants.", "url": "https://www.technologynetworks.com/vaccines/news/intranasal-covid-19-vaccine-protects-against-variants-in-animals-366909", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/366909/intranasal-covid-19-vaccine-protects-against-variants-in-animals-366909-640x360.jpg?cb=20221025", "publishedAt": "2022-10-25T08:47:32Z", "content": "An intranasal vaccine against SARS-CoV-2 could quickly get to the respiratory tract, where the virus most commonly causes symptoms. And a spray or droplets could be a more palatable option for people… [+2625 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Had a bypass surgery or stenting? How can a heart patient get back to exercise? - The Indian Express", "description": "There is no defined limit to the amount of exercise you can do with heart disease but at the same time, it’s important to discuss your case with your doctor and listen to your body. Your programme should include a pre-exercise medical evaluation, graded exerc…", "url": "https://indianexpress.com/article/lifestyle/health-specials/bypass-surgery-hear-patient-exercise-8228697/", "urlToImage": "https://images.indianexpress.com/2022/10/Walking-2.jpg", "publishedAt": "2022-10-25T07:33:21Z", "content": "On December 13, 2018, Dhananjay Yellurkar, then 55, crossed the finish line of the Antarctic Ice Marathon in sub-zero weather. This is a feat attempted by very few and completed by even fewer. While … [+4365 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Impact of prognostic tests in the treatment of early-stage breast cancer - Express Healthcare", "description": "Dr Alpesh Kikani, Medical Oncologist, Shashwat Haemato-Onco Associates, Rajkot explains that breast cancer patients who are diagnosed at an early stage can take help of a prognostic test to understand the disease better and get personalised treatment.", "url": "https://www.expresshealthcare.in/news/impact-of-prognostic-tests-in-the-treatment-of-early-stage-breast-cancer/436760/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/10/New-Project-2-2.jpg", "publishedAt": "2022-10-25T07:29:13Z", "content": "Dr Alpesh Kikani, Medical Oncologist, Shashwat Haemato-Onco Associates, Rajkot explains that breast cancer patients who are diagnosed at an early stage can take help of a prognostic test to understan… [+5295 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Hypertension: Advantages of tech-driven solutions - Express Healthcare", "description": "Runam Mehta, CEO, HealthCube emphasises on the role of technology in preventing and treatig cardiovascular diseases", "url": "https://www.expresshealthcare.in/news/hypertension-advantages-of-tech-driven-solutions/436757/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/10/New-Project-1-3.jpg", "publishedAt": "2022-10-25T07:20:22Z", "content": "Runam Mehta, CEO, HealthCube emphasises on the role of technology in preventing and treatig cardiovascular diseases \r\nDo you know India accounts for 20 percent of all the deaths due to heart disease … [+4198 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Kajal Rajput", "title": "World Breast Cancer Awareness month: Max Institute of Cancer Care, Lajpat Nagar celebrates long-term... - Medical Dialogues", "description": "New Delhi: To create awareness around Breast Cancer during Breast Cancer Month which is observed in...", "url": "https://medicaldialogues.in/news/health/hospital-diagnostics/world-breast-cancer-awareness-month-max-institute-of-cancer-care-lajpat-nagar-celebrates-long-term-breast-cancer-survivors-100945", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/19/188491-max.jpg", "publishedAt": "2022-10-25T04:15:48Z", "content": "New Delhi: To create awareness around Breast Cancer during Breast Cancer Month which is observed in October annually, Max Institute of Cancer Care, Lajpat Nagar organised a press conference where lon… [+3916 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCL: Five hours’ sleep a night linked to higher risk of multiple diseases - India Education Diary", "description": "The research, published in PLOS Medicine, analysed the impact of sleep duration on the health of more than 7,000 men and women at the ages of 50, 60 and 70, from the Whitehall II cohort study.Researchers examined the relationship between how long eac", "url": "https://indiaeducationdiary.in/ucl-five-hours-sleep-a-night-linked-to-higher-risk-of-multiple-diseases/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/ucl.png?fit=768%2C480&ssl=1", "publishedAt": "2022-10-25T03:10:57Z", "content": "The research, published in PLOS Medicine, analysed the impact of sleep duration on the health of more than 7,000 men and women at the ages of 50, 60 and 70, from the Whitehall II cohort study.\r\nResea… [+3006 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: Your Smell Could Attract Mosquitoes - VOA Learning English", "description": "Researchers found that people who attract mosquitoes the most produce a lot of certain chemicals on their skin. These chemicals are connected to the scent that attracts mosquitoes.", "url": "https://learningenglish.voanews.com/a/study-your-smell-could-attract-mosquitoes/6797114.html", "urlToImage": "https://gdb.voanews.com/03990000-0aff-0242-3f83-08dab21c85a0_w1200_r1.jpeg", "publishedAt": "2022-10-24T22:01:26Z", "content": "A new study finds that some people attract mosquitoes much more than others, and it probably involves the way they smell.\r\nThe researchers found that people who attract mosquitoes the most produce a … [+3988 chars]"}, {"source": {"id": null, "name": "Worldhealth.net"}, "author": null, "title": "Video Gaming May Be Associated With Better Cognitive Performance In Children, Study Suggests - Anti Aging News", "description": "According to an NIH news release, a study of nearly 2,000 children found that those who reported playing video games for three hours per day or more performed better on cognitive skills tests involving impulse control and working memory compared to children w…", "url": "https://www.worldhealth.net/news/video-gaming-may-be-associated-better-cognitive-performance-children-study-suggests", "urlToImage": "https://www.worldhealth.net/media/original_images/AdobeStock_22211514.jpeg", "publishedAt": "2022-10-24T21:29:29Z", "content": "According to an NIH news release, a study of nearly 2,000 children found that those who reported playing video games for three hours per day or more performed better on cognitive skills tests involvi… [+6663 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "The Science Advisory Board staff writers", "title": "Pluripotent stem cell model of PTSD sheds light on how neurons react to stress - The Science Board", "description": "A team of scientists have discovered that stem cell-derived neurons from combat veterans with post-traumatic stress disorder (PTSD) react differently to a stress hormone than those from veterans without PTSD.", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=4904", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_cell/2022_10_24_20_57_4864_patient_sad_man_social.jpg", "publishedAt": "2022-10-24T21:07:35Z", "content": "The study, published October 20 in Nature Neuroscience, is the first to use induced pluripotent stem cell models to study PTSD, and the findings could provide insights into how genetics can make some… [+2038 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "VIDEO: Neurological long COVID-19: 'It's time' to approach therapeutics - Healio", "description": "CHICAGO &ndash; Jennifer A. Frontera, MD, professor of neurology at NYU School of Medicine, discussed possible therapeutic strategies for those with long COVID who are experiencing neurological symptoms at ANA 2022.\n&ldquo;Right now, [it is] estimated that th…", "url": "https://www.healio.com/news/neurology/20221024/video-neurological-long-covid19-its-time-to-approach-therapeutics", "urlToImage": "https://www.healio.com/~/media/slack-news/psychiatry/misc/video-og-images/frontera_ogimage_1200x630.png", "publishedAt": "2022-10-24T18:36:15Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCHICAGO – Jennifer A. Frontera, MD, prof… [+778 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Dengue cases on the rise, 7000 infections in last one week - The Indian Express", "description": "“The situation is alarming. More than 3,000 people have been admitted to government hospitals in the last one week. Deaths are increasing as many of them are critical,\" said a health official.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-dengue-cases-on-the-rise-7000-infections-in-last-one-week/", "urlToImage": "https://images.indianexpress.com/2022/10/dengue-1200-2-3.jpg", "publishedAt": "2022-10-23T22:42:02Z", "content": "Dengue cases continue to rise in West Bengal with the state recording 7,000 vector-borne infections in the past one week, an average 1,000 cases a day, the data shows.According to senior officials in… [+1406 chars]"}]}