{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Take on Hypoglycaemia With These 5 Tips To Lower Blood Sugar Level - News18", "description": "When your body does not create enough insulin or does not use insulin efficiently, you suffer from high blood sugar.", "url": "https://www.news18.com/news/lifestyle/take-on-hypoglycaemia-with-these-5-tips-to-lower-blood-sugar-level-6917269.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-69-1-167500639016x9.png", "publishedAt": "2023-01-30T04:00:29Z", "content": "Diabetes and prediabetes are linked to high blood sugar, also known as hyperglycaemia. Normally, your body maintains blood sugar levels by making insulin, a hormone that allows your cells to use the … [+2789 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Rollout of HPV vaccine: Govt's likely to float global tender in April - EastMojo", "description": "New Delhi: The Health Ministry intends to roll out HPV vaccine against cervical cancer in the national immunisation programme for girls aged nine to 14", "url": "http://www.eastmojo.com/national-news/2023/01/30/rollout-of-hpv-vaccine-govts-likely-to-float-global-tender-in-april/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/01/Untitled-design-111.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-01-30T03:50:00Z", "content": "New Delhi: The Health Ministry intends to roll out HPV vaccine against cervical cancer in the national immunisation programme for girls aged nine to 14 years in June for which a global tender is like… [+3517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "If Rahul Gandhi can snack on makhanas, should you too? - The Indian Express", "description": "Yes, because their glycemic index  is below 55, lower than known carbohydrates like rice, wheat and refined flour. This means the blood glucose levels won’t rise immediately and no extra levels would be floating in your bloodstream. Besides their high protein…", "url": "https://indianexpress.com/article/health-wellness/makhanas-rahul-gandhi-snacks-8411834/", "urlToImage": "https://images.indianexpress.com/2023/01/makhanas_foxnuts_200_getty.jpg", "publishedAt": "2023-01-30T03:40:56Z", "content": "Makhanas, also known as fox nuts or lotus seeds, have always been used as a fasting food. The reason is they are among the most nutritious snacking options, can be dry roasted, are low in calories an… [+2971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "This is what an unhealthy diet can do to your body - The Indian Express", "description": "Extreme detox programs can lead to more stress on the body, leading to a rapid release of toxins that maybe difficult for it to handle, said Karishma Chawla, a nutritionist and lifestyle educator", "url": "https://indianexpress.com/article/lifestyle/health/unhealthy-diet-gut-health-tips-weight-loss-hormonal-constipation-8395196/", "urlToImage": "https://images.indianexpress.com/2023/01/gut-health_200_getty.jpg", "publishedAt": "2023-01-30T03:40:44Z", "content": "Most of the common diseases today, like obesity, diabetes, hormonal imbalance, cancer, and high blood pressure, are lifestyle-related. But experts stress that many people are still not aware of this … [+3669 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Using systems biology research to alter the properties of carcinogenic cells in the lungs - News-Medical.Net", "description": "KAIST (President Kwang Hyung Lee) announced on January 30th that a research team led by Professor Kwang-Hyun Cho from the Department of Bio and Brain Engineering succeeded in using systems biology research to change the properties of carcinogenic cells in the…", "url": "https://www.news-medical.net/news/20230129/Using-systems-biology-research-to-alter-the-properties-of-carcinogenic-cells-in-the-lungs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-01-30T02:55:00Z", "content": "KAIST (President Kwang Hyung Lee) announced on January 30th that a research team led by Professor Kwang-Hyun Cho from the Department of Bio and Brain Engineering succeeded in using systems biology re… [+5992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can you suffer a heart attack while sleeping? - The Indian Express", "description": "While it is commonly known that heart attacks are more likely to strike early in the morning, can they occur when a person is asleep?", "url": "https://indianexpress.com/article/lifestyle/health/heart-attacks-while-sleeping-causes-prevention-8410910/", "urlToImage": "https://images.indianexpress.com/2023/01/heart-attacks-1200.jpg", "publishedAt": "2023-01-30T02:50:22Z", "content": "The rising incidence of heart attacks has been a cause of concern globally. In an earlier interaction with indianexpress.com, Dr Subhendu Mohanty, Head and Senior Consultant, Sharda Hospital said tha… [+6351 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Immunity vs Covid is stronger with more time between jab, infection: Study - EastMojo", "description": "Washington: Immunity from COVID-19 appears to gather strength with more time between vaccination and infection, according to a new study. Researchers from", "url": "http://www.eastmojo.com/world/2023/01/30/immunity-vs-covid-is-stronger-with-more-time-between-jab-infection-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/06/corona-5017820_1280.jpg?fit=1280%2C874&ssl=1", "publishedAt": "2023-01-30T02:50:00Z", "content": "Washington: Immunity from COVID-19 appears to gather strength with more time between vaccination and infection, according to a new study.\r\nResearchers from Oregon Health and Science University, US, m… [+4222 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Protein Or Carbs? What Should Be Eaten First To Avoid Unnecessary Glucose Spike, Know From An Expert - News18", "description": "The expert sheds light on a theory that suggests eating protein before carbs result in the reduction of insulin and glucose by 30-40%.", "url": "https://www.news18.com/news/lifestyle/protein-or-carbs-what-should-be-eaten-first-to-avoid-unnecessary-glucose-spike-know-from-an-expert-6930409.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-68-1-167500534116x9.png", "publishedAt": "2023-01-30T02:30:42Z", "content": "It could get overwhelming to eat only a balanced diet to avoid unnecessary glucose spikes. Well, what if theres more to it than just consuming a balanced diet? Health expert Pooja Makhija recently hi… [+1848 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supercharged T Cells: A New Way To Kill Pancreatic Cancer With Minimal Side Effects - SciTechDaily", "description": "A new immunotherapy releases cancer-killing cytokines only within the tumor. Researchers at the University of California San Francisco (UCSF) have developed a new T cell-based immunotherapy that selectively targets cancer cells, producing a powerful anti-canc…", "url": "https://scitechdaily.com/?p=246482", "urlToImage": "https://scitechdaily.com/images/Cancer-Immunotherapy-T-Cells.jpg", "publishedAt": "2023-01-29T23:38:17Z", "content": "Pancreatic cancer is a type of cancer that develops in the pancreas, an organ located behind the stomach that plays a crucial role in digestion and the regulation of blood sugar. Pancreatic cancer is… [+5434 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Alex Oliveira", "title": "Friends of mom who strangled her three young kids to death battled with postpartum psychosis - Daily Mail", "description": "Friends of Lindsay Clancy, 32, have recalled her as a kind and loving person. They've said it was clear she suffered from severe postpartum depression.", "url": "https://www.dailymail.co.uk/news/article-11690217/Friends-mom-strangled-three-young-kids-death-battled-postpartum-psychosis.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/29/22/67102133-0-image-a-23_1675032047903.jpg", "publishedAt": "2023-01-29T22:35:51Z", "content": "Friends of a mother who murdered her three children while suffering with severe postpartum depression have banded together in support of her after the tragedy. \r\nThose close to Lindsay Clancy, 32, ha… [+11659 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "What If I Ate A Lot Of Avocados Every Day? It Happens To Your Body - Nation World News", "description": "Who does not dream that it is small slice up avocado Cocktails on toast or in shrimp becomes a whole piece? it Creamy and Nutritious Fruit Apart from the", "url": "https://nationworldnews.com/what-if-i-ate-a-lot-of-avocados-every-day-it-happens-to-your-body/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/What-if-I-ate-a-lot-of-avocados-every-day.jpeg", "publishedAt": "2023-01-29T22:31:43Z", "content": "Who does not dream that it is small slice up avocado Cocktails on toast or in shrimp becomes a whole piece? it Creamy and Nutritious Fruit Apart from the famous, one of the most popular in the world … [+3083 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "5 foods that can make your memory problems worse - NewsBytes", "description": "One of the most important organs in your body, your brain requires adequate nutrition and a healthy diet to keep it in optimum condition", "url": "https://www.newsbytesapp.com/news/lifestyle/5-foods-that-make-your-memory-problem-worse/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l47520230120160757.jpeg", "publishedAt": "2023-01-29T20:45:02Z", "content": "5 foods that can make your memory problems worse\r\nJan 30, 2023, 02:15 am2 min read\r\nOne of the most important organs in your body, your brain requires adequate nutrition and a healthy diet to keep it… [+2257 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "World's first guidelines created to prevent heart problems in kids fighting cancer - ANI News", "description": "The world's first international clinical guidelines to help prevent and treat heart complications in children undergoing cancer treatment have been created.", "url": "https://www.aninews.in/news/health/worlds-first-guidelines-created-to-prevent-heart-problems-in-kids-fighting-cancer20230130020659", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230129203650.jpg", "publishedAt": "2023-01-29T20:36:00Z", "content": "Melbourne [Australia], January 30 (ANI): The world's first international clinical guidelines for preventing and treating heart problems in cancer patients' children have been developed.The guidelines… [+2454 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Aanchal Mathur", "title": "Weight Loss: How Turmeric Mint Tea Can Aid In Losing Belly Fat - Slurrp", "description": "Several experts have stressed upon consuming herbal teas regularly as they have fat-burning properties and can also help boost your metabolism", "url": "https://www.slurrp.com/article/weight-loss-how-turmeric-mint-tea-can-aid-in-losing-belly-fat-1675022620658", "urlToImage": "https://images.slurrp.com/prodarticles/4qrbf4ftmmn.webp", "publishedAt": "2023-01-29T20:14:43Z", "content": "Several experts have stressed upon consuming herbal teas regularly as they have fat-burning properties and can also help boost your metabolism. And we have just the perfect one to begin with. - turme… [+617 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Divya", "title": "Home Remedies for Sunburn to Get Instant Relief - Sportskeeda", "description": "Are you looking for home remedies for sunburn? If yes, then you have come to the right place!", "url": "https://www.sportskeeda.com/health-and-fitness/home-remedies-sunburn-get-instant-relief", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/01/085c6-16750162116424-1920.jpg", "publishedAt": "2023-01-29T19:20:50Z", "content": "Are you looking for home remedies for sunburn? If yes, then you have come to the right place! \r\nAbout 35% of American adults get sunburns annually. If you expose your skin to too much sun without usi… [+4191 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Foods That Promote Liver Health - Nation World News", "description": "liver It is the largest solid organ in the human body with over 500 functions, it is a very complete organ that filters blood, processes blood sugar, produces", "url": "https://nationworldnews.com/foods-that-promote-liver-health/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Foods-That-Promote-Liver-Health.jpeg", "publishedAt": "2023-01-29T18:14:12Z", "content": "liver It is the largest solid organ in the human body with over 500 functions, it is a very complete organ that filters blood, processes blood sugar, produces bile that facilitates digestion, secrete… [+3226 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Serotonin can potentially accelerate degenerative mitral regurgitation, study says - News-Medical.Net", "description": "Serotonin can impact the mitral valve of the heart and potentially accelerate a cardiac condition known as degenerative mitral regurgitation, according to a new study led by researchers at Columbia University's Department of Surgery in collaboration with the …", "url": "https://www.news-medical.net/news/20230129/Serotonin-can-potentially-accelerate-degenerative-mitral-regurgitation-study-says.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Serotonin-620x480.jpg", "publishedAt": "2023-01-29T18:04:00Z", "content": "Serotonin can impact the mitral valve of the heart and potentially accelerate a cardiac condition known as degenerative mitral regurgitation, according to a new study led by researchers at Columbia U… [+5816 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Love Apples? Here's Why You Should Drink Apple Juice Every Day - Slurrp", "description": "We all know that eating apples regularly is very important to keep the system going. Do you know that apple juice is also loaded with nutrients?", "url": "https://www.slurrp.com/article/love-apples-heres-why-you-should-drink-apple-juice-every-day-1675011491870", "urlToImage": "https://images.slurrp.com/prodarticles/vhz2pomdej.webp", "publishedAt": "2023-01-29T17:27:28Z", "content": "Everybody has heard the proverb \"An apple a day keeps the doctor away.\" We all need to include apples in our daily diets to reap incredible health advantages. Consuming apple juice is one simple meth… [+1948 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "MIT researchers develop an AI model that can detect future lung cancer risk - India Education Diary", "description": "The name Sybil has its origins in the oracles of Ancient Greece, also known as sibyls: feminine figures who were relied upon to relay divine knowledge of the unseen and the omnipotent past, present, and future. Now, the name has been excavated from a", "url": "https://indiaeducationdiary.in/mit-researchers-develop-an-ai-model-that-can-detect-future-lung-cancer-risk/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/20230110_MITMGB_Sybil-1.jpg?fit=900%2C599&ssl=1", "publishedAt": "2023-01-29T16:49:51Z", "content": "The name Sybil has its origins in the oracles of Ancient Greece, also known as sibyls: feminine figures who were relied upon to relay divine knowledge of the unseen and the omnipotent past, present, … [+7051 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Algarve SS Keto Gummies Reviews [Lifetime KETO & Lifeline KETO] Where Can I Buy Algrave Keto? - The Tribune India", "description": "Algarve Keto Gummies are made of organic ingredients that boost the user's metabolism and calorie burn, even while they sleep. Many people mistakenly think increasing their physical activity can aid in weight loss.", "url": "https://www.tribuneindia.com/news/brand-connect/algarve-ss-keto-gummies-reviews-lifetime-keto-lifeline-keto-where-can-i-buy-algrave-keto-474719", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_143884103.png", "publishedAt": "2023-01-29T15:29:00Z", "content": "Algarve Keto Gummies are made of organic ingredients that boost the user's metabolism and calorie burn, even while they sleep. Many people mistakenly think increasing their physical activity can aid … [+7749 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Cervical cancer: Causes, risk factors, symptoms, diagnosis, prevention tips - Hindustan Times", "description": "Cervical cancer happens in cervix cells, the lower part of uterus that connects to vagina but are you aware how various strains of the human papillomavirus (HPV) gets transmitted? Here's all you need to know about the causes, risk factors, symptoms, diagnosis…", "url": "https://www.hindustantimes.com/lifestyle/health/cervical-cancer-causes-risk-factors-symptoms-diagnosis-prevention-tips-101675005161299.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/29/1600x900/Fmq4dYyWAAA01ip_1675005335144_1675005357760_1675005357760.jpg", "publishedAt": "2023-01-29T15:24:09Z", "content": "Cervical cancer is commonly seen in women but do you know that it is possible to detect this cancer and seek prompt medical attention? It is important to be aware about the investigations that are ca… [+3981 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "High fat diet reduce brain’s ability to regulate food intake - ThePrint", "description": "Washington [US], January 29 (ANI): Regularly eating a high fat/calorie diet could reduce the brain’s ability to regulate calorie intake. New research in rats found that after short periods of being fed a high fat/high calorie diet, the brain adapts to react t…", "url": "https://theprint.in/science/high-fat-diet-reduce-brains-ability-to-regulate-food-intake/1341749/", "urlToImage": null, "publishedAt": "2023-01-29T15:15:23Z", "content": "Washington [US], January 29 (ANI): Regularly eating a high fat/calorie diet could reduce the brain’s ability to regulate calorie intake. New research in rats found that after short periods of being f… [+3643 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Foods to eat and avoid after miscarriage - Northeast Now", "description": "Sometimes some serious medical complications in the pregnancy, consuming alcohol, smoking and medical conditions such as diabetes may lead to higher chances of miscarriage.", "url": "http://nenow.in/health/top-6-foods-to-eat-and-avoid-after-miscarriage.html", "urlToImage": "https://nenow.in/wp-content/uploads/2023/01/Miscarriage.png", "publishedAt": "2023-01-29T15:01:56Z", "content": "Pregnancy is the biggest blessing in a womens life. A women need to be very careful about their food diet, maintaining a healthy lifestyle and go for routine health checkup during this phase.\r\nBut so… [+4127 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Best Heart Supplements: Top 5 Healthy Cardiovascular Vitamins Pills in 2023 - The Tribune India", "description": "Due to the absence of physical symptoms that would cause a person to seek medical attention, high blood pressure, the most important warning that anything is wrong with their cardiovascular health often goes unnoticed.", "url": "https://www.tribuneindia.com/news/brand-connect/best-heart-supplements-top-5-healthy-cardiovascular-vitamins-pills-in-2023-474713", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_359787098.jpg", "publishedAt": "2023-01-29T14:49:00Z", "content": "Due to the absence of physical symptoms that would cause a person to seek medical attention, high blood pressure, the most important warning that anything is wrong with their cardiovascular health of… [+18252 chars]"}, {"source": {"id": null, "name": "Unite.AI"}, "author": "Alex McFarland", "title": "Researchers Use Voice Data and AI For Early Diagnosis of Parkinson’s - Unite.AI", "description": "Parkinson’s disease affects more than 10 million people across the globe, and while there is still no cure, the disease can be better controlled if symptoms are detected early on. One of the main aspects of Parkinson’s is that as it progresses, speech changes…", "url": "https://www.unite.ai/researchers-use-voice-data-and-ai-for-early-diagnosis-of-parkinsons/", "urlToImage": "https://www.unite.ai/wp-content/uploads/2023/01/19-02-12-Rytis-Maskeliunas-7-768x512-1.jpg", "publishedAt": "2023-01-29T13:53:57Z", "content": "Parkinsons disease affects more than 10 million people across the globe, and while there is still no cure, the disease can be better controlled if symptoms are detected early on. One of the main aspe… [+2879 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Aryan Bajaj", "title": "Why do I have ingrown scalp hair? How to get rid of them? - Sportskeeda", "description": "Ingrown scalp hair is a common condition that occurs when hair grows back into the skin instead of up and out, causing redness, irritation, and even pain.", "url": "https://www.sportskeeda.com/health-and-fitness/why-i-ingrown-scalp-hair-how-get-rid-them", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/93864-16749954250362-1920.jpg", "publishedAt": "2023-01-29T13:31:34Z", "content": "Ingrown scalp hair is a common condition that occurs when hair grows back into the skin instead of up and out, causing redness, irritation, and even pain. \r\nPeople with all hair textures can experien… [+4410 chars]"}, {"source": {"id": null, "name": "Avenuemail.in"}, "author": null, "title": "Stephen Hawking's life and work: A story of resilience and grit - Avenue Mail", "description": "Stephen Hawking's life and work: A story of resilience and grit | Opinion News | The Avenue Mail", "url": "https://avenuemail.in/stephen-hawkings-life-and-work-a-story-of-resilience-and-grit/", "urlToImage": "https://i0.wp.com/avenuemail.in/wp-content/uploads/2023/01/2-3.jpg?fit=800%2C800&ssl=1", "publishedAt": "2023-01-29T13:18:03Z", "content": "“However difficult life may seem, there is always something you can do and succeed at.” (Stephen Hawking)\r\nStephen Hawking was a renowned theoretical physicist, cosmologist, and author who made groun… [+4035 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "FPJ Web Desk", "title": "Kareena Kapoor Khan's nutritionist Rujuta Diweka shares 7 tips to eating right and building a healthy routine - Free Press Journal", "description": "Kareena Kapoor Khan's nutritionist Rujuta Diweka shares 7 tips to eating right and building a healthy routine", "url": "https://www.freepressjournal.in/lifestyle/kareena-kapoor-khans-nutritionist-rujuta-diweka-shares-7-tips-to-eating-right-and-building-a-healthy-routine", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-01/bbc4c83c-0a2e-4288-bc64-1cdbc58b0f76/6sec1.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-01-29T13:11:37Z", "content": "It's a time to cleanse our thoughts, habits and rethink our belief system. Bring in the renewed glory, wash away your food fears as celebrity nutritionist Rujuta Diwekar shares tips on eating right i… [+66 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Phani Madhuri V", "title": "5 tips to balance hormones naturally in women - Health shots", "description": "A hormonal imbalance is not complementary to good health. So, if you want to know how to balance hormones naturally, practice these 5 tips!", "url": "https://www.healthshots.com/preventive-care/self-care/5-tips-to-balance-hormones-naturally-in-women/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/29182133/hormones.jpg", "publishedAt": "2023-01-29T12:52:07Z", "content": "A healthy lifestyle is the precursor of a healthy individual with a sound body and mind. Maintaining a healthy lifestyle requires an individual to follow a good diet, stay physically active and pract… [+5094 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medical Dialogues  Team", "title": "Cadila Gets CDSCO Panel Nod To Manufacture, Market Cholecalciferol aqueous injection - Medical Dialogues", "description": "New Delhi: The Drug major, Cadila Pharmaceuticals has got a go ahead from the Subject Expert Committee (SEC) functional under the Central Drug Standard Control Organisation (CDSCO) to manufacture...", "url": "https://medicaldialogues.in/news/industry/pharma/cadila-gets-cdsco-panel-nod-to-manufacture-market-cholecalciferol-aqueous-injection-106294", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/06/193010-cadila-pharma-new.jpg", "publishedAt": "2023-01-29T12:30:05Z", "content": "This came after the firm presented the proposal of manufacture and marketing permission for a Cholecalciferol aqueous injection of 6,00,000 IU along with serum calcium level data of both the groups (… [+1190 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Include these practices to boost your family's mental and physical well-being | Tips - India TV News", "description": "Good emotional, mental and physical health can significantly enhance family relationships. A healthy lifestyle is essential to a healthy, happy and disease-free life.", "url": "https://www.indiatvnews.com/health/include-these-practices-to-boost-your-family-mental-and-physical-well-being-health-tips-2023-01-29-843142", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/adses-1674991670.jpg", "publishedAt": "2023-01-29T11:40:28Z", "content": "A healthy mind is vital for general well-being and life satisfaction. Changing to a healthy way of living is the key to making significant improvements in our life. The positive impacts on mental hea… [+2429 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Archana Dhawan Bajaj", "title": "Pregnancy: Know 5 causes of miscarriage and reduce its risk - Health shots", "description": "Several pregnancies end in miscarriage. But what are the actual causes of miscarriage? Read on to find out and take precautions.", "url": "https://www.healthshots.com/preventive-care/reproductive-care/5-causes-of-miscarriage-in-early-months-of-pregnancy/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/27201616/causes-of-miscarriage.jpg", "publishedAt": "2023-01-29T11:00:14Z", "content": "If you are pregnant, worrying about the risks of pregnancy loss or a miscarriage may cloud your mind sometimes. You must know that most of the times, a miscarriage happens for reasons that are beyond… [+3498 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Love Milk? Boost Milk Nutrition By Avoiding Some Food Pairings - Slurrp", "description": "Milk is an essential beverage in everyone's life. We all like to pair it with something else to enhance its flavour. Do you know adding certainn food items to milk may make it injurious?", "url": "https://www.slurrp.com/article/love-milk-boost-milk-nutrition-by-avoiding-some-food-pairings-1674985207314", "urlToImage": "https://images.slurrp.com/prodarticles/x3ciarf06e.webp", "publishedAt": "2023-01-29T09:57:46Z", "content": "Milk is a versatile ingredient that can be used in a variety of ways. It is often consumed on its own, added to cereal, or used in cooking and baking. It is also a key ingredient in many popular dess… [+5043 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "Deaths from heart diseases went up during COVID pandemic, says a study - India TV News", "description": "Several people who had new or existing heart disease and stroke symptoms were reluctant to seek medical care, particularly in the early days of the COVID pandemic.", "url": "https://www.indiatvnews.com/health/deaths-from-heart-diseases-went-up-during-covid-pandemic-says-study-2023-01-26-842380", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/covid-8-1674725265.jpg", "publishedAt": "2023-01-29T09:30:01Z", "content": "The number of people dying from cardiovascular disease (CVD) in the US escalated during the first year of the Covid-19 pandemic, from 874,613 CVD-related deaths recorded in 2019 to 928,741 in 2020, a… [+2367 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Air pollution can slow down our brains: study - ETHealthWorld", "description": "An fMRI revealed that participants had decreased functional connectivity in widespread regions of the DMN after exposure to diesel exhaust, compared to filtered air.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/air-pollution-can-slow-down-our-brains-study/97415278", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97415278,imgsize-31938,width-1200,height-628,overlay-ethealthworld/air-pollution-can-slow-down-our-brains-study.jpg", "publishedAt": "2023-01-29T09:30:00Z", "content": "New Delhi: Just two hours of exposure to air pollution may impair human brain function, according to a study. The researchers found that exposure to diesel exhaust for just two hours causes a decreas… [+3115 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "Weight Loss: 5 Drinks to Add to Your Morning Routine that can Help You Shed that Belly Fat - Zee News", "description": "A controlled diet and adequate exercise are part of ongoing efforts to lose weight. However, a few small adjustments can help you speed up this procedure. Do you start your mornings with a cup of coffee? But I s it the healthiest way to begin the day in terms…", "url": "https://zeenews.india.com/health/weight-loss-5-drinks-to-add-to-your-morning-routine-that-can-help-shed-that-belly-fat-2566900", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/29/1146871-detox-water.jpg", "publishedAt": "2023-01-29T09:20:02Z", "content": "Weight loss tips: A controlled diet and adequate exercise are part of ongoing efforts to lose weight. However, a few small adjustments can help you speed up this procedure. Do you start your mornings… [+2635 chars]"}, {"source": {"id": null, "name": "Quintdaily.com"}, "author": "Quintdaily", "title": "Artificial Skin or Synthetic Skins - Case Study - QuintDaily - Thе Quіnt", "description": "Artificial Skin and all you need to know about this. The reasons why artificial skin is helpful for us and have a look idea by Quintdaily.", "url": "https://quintdaily.com/2023/01/artificial-skin-or-synthetic-skins/", "urlToImage": "https://quintdaily.com/wp-content/uploads/2023/01/Artificial-Skin.jpeg", "publishedAt": "2023-01-29T09:06:40Z", "content": "Artificial skin price, what are the types of artificial skin? People start thinking about this, once they have wound or hard scratches affected/  Do you know that the outermost epidermis and the deep… [+3408 chars]"}, {"source": {"id": null, "name": "Onlinewiki.in"}, "author": "OnlineWiki", "title": "Cancer risk factors to avoid - Online Wiki", "description": "The risk of cancer increases with the amount of alcohol consumed. [iStockphoto] Between 30-50 per cent of all cancer cases ... Read more", "url": "https://www.onlinewiki.in/wiki/mesothelioma/cancer-risk-factors-to-avoid/", "urlToImage": "https://www.onlinewiki.in/wp-content/uploads/2023/01/Lsn9SS7DfAdfWCs47jnAmzFD4XHs5ulaD4e53SJv.jpg", "publishedAt": "2023-01-29T08:08:09Z", "content": "The risk of cancer increases with the amount of alcohol consumed. [iStockphoto]\r\nBetween 30-50 per cent of all cancer cases are preventable, according to the World Health Organisation.\r\nHere are some… [+2996 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bianca Salonga", "title": "A Guide For Choosing The Right Dietary Supplements To Suit Your Wellness Journey - Forbes", "description": "Depending on the day and what the body needs, there are specific supplements on the shelf to help enhance our wellness journeys. Each formula, designed to that support us as we aim to show up as the best versions of ourselves.", "url": "https://www.forbes.com/sites/biancasalonga/2023/01/29/a-guide-for-choosing-the-right-dietary-supplements-to-suit-your-wellness-journey/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63d4f35cc30a4889814c5504/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-01-29T07:27:32Z", "content": "The supplements and vitamins space is crowded with countless options bearing the promise of optimal ... [+] health. As consumers, we often wonder: \"Which ones do I truly need?\"\r\ngetty\r\nThe conversati… [+9415 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Luke Coutinho", "title": "Heres why vitamin D3 and B12 deficiencies are called silent epidemics - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/weekend/heres-why-vitamin-d3-and-b12-deficiencies-are-a-silent-epidemic", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-01/2db31029-f7d2-43f5-ac9c-1503cac0446f/lead__main_img.jfif?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-01-29T07:08:00Z", "content": "In Integrative and Lifestyle Medicine, we invest time in identifying the root cause behind every symptom and disease. And there is one root cause that seems to be a commonality in almost every other … [+3712 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Experts uphold universal HPV vaccination to save women from cervical cancer, Health News - ETHealthWorld", "description": "Over 7.4 crore cervical cancer cases and 6.2 crore deaths could be averted in the next 100 years if 78 of the world's poorest countries rapidly deploy HPV vaccinations, cervical screening and cancer treatment report as key interventions of World Health Organi…", "url": "https://health.economictimes.indiatimes.com/news/industry/experts-uphold-universal-hpv-vaccination-to-save-women-from-cervical-cancer/97412956", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97412956,imgsize-1558525,width-1200,height-628,overlay-ethealthworld/experts-uphold-universal-hpv-vaccination-to-save-women-from-cervical-cancer.jpg", "publishedAt": "2023-01-29T06:20:00Z", "content": "New Delhi: Globally, 27 per cent of cervical cancer cases are from India which is home to 16-17 per cent of the world's women population. The current estimates indicate approximately 1,00,000 new cas… [+4265 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "Can you Take Too Much Vitamin D? 3 out of 4 Indians Suffer from Vitamin D Deficiency; Check Daily Dietary I... - Zee News", "description": "A nutrient that is vital for health is vitamin D. While some foods do contain a tiny amount of vitamin D, sunshine is the main source of this vitamin for most people. In contrast to most other vitamins, vitamin D is distinctive.", "url": "https://zeenews.india.com/health/can-you-take-too-much-vitamin-d-3-out-of-4-indians-suffer-from-vitamin-d-deficiency-check-daily-dietary-intake-2566824", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/29/1146780-vitamin-d-deficiency.jpg", "publishedAt": "2023-01-29T06:10:35Z", "content": "Vitamin D deficiency: A nutrient that is vital for health is vitamin D. While some foods do contain a tiny amount of vitamin D, sunshine is the main source of this vitamin for most people. In contras… [+3194 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "MicroRNA affects inflammation in lupus disease: Research - ETHealthWorld", "description": "Given that altered miRNA expression has been reported in lupus disease, researchers have long suspected a connection. Now, a group of scientists, headed by Professor Hiroshi Suzuki at the Department of Molecular Oncology, and Lecturer Noritoshi Kato and Resea…", "url": "https://retail.economictimes.indiatimes.com/news/diagnostics/microrna-affects-inflammation-in-lupus-disease-research/97412753", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97412753,imgsize-16216,width-1200,height-628,overlay-ethealthworld/microrna-affects-inflammation-in-lupus-disease-research.jpg", "publishedAt": "2023-01-29T06:00:00Z", "content": "Nagoya [Japan]: Researchers from Nagoya University's Graduate School of Medicine in Japan have uncovered how microRNA (miRNA) affects inflammation in mice with lupus. They discovered two downregulate… [+4969 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Cervical cancer: Elimination is possible, artificial intelligence may reduce treatment time - News9 LIVE", "description": "Researchers at University of Tokyo have demonstrated promising new cancer treatment, they are using artificial DNA to target and kill cancer cells", "url": "https://www.news9live.com/health/cervical-cancer-elimination-is-possible-artificial-intelligence-may-reduce-treatment-time-au2070-2039596", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/Cancer-cells.jpg", "publishedAt": "2023-01-29T05:14:15Z", "content": "Researchers at University of Tokyo have demonstrated promising new cancer treatment, they are using artificial DNA to target and kill cancer cells\r\n<ul><li>The Indian government will provide cervical… [+4453 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Winter Melon Health Benefits: 5 Reasons Why You MUST Eat Petha in Winter - India.com", "description": "<b>Winter Melon Health Benefits: Melon, which is known by different names worldwide, is rich in vitamins, minerals, and natural substances. It may help to improve eye, skin and heart health - Check here:</b>", "url": "https://www.india.com/health/winter-melon-health-benefits-petha-khaane-ke-fayede-4-reasons-must-eat-petha-ash-gourd-winter-5873894/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/Winter-Melon.jpg", "publishedAt": "2023-01-29T04:29:39Z", "content": "Winter Melon Health Benefits: Melon, which is known by different names worldwide, is rich in vitamins, minerals, and natural substances. It may help to improve eye, skin and heart health - Check here… [+2601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Swear By These 4 Desi 'Super Drinks' For A Healthy Lifestyle - NDTV Food", "description": "Lovneet Batra says, \"What we drink can be more powerful in making or breaking our health than what we eat. So, find your tonic and sip it.\"", "url": "https://food.ndtv.com/health/swear-by-these-4-tonics-for-a-healthy-lifestyle-3731690", "urlToImage": "https://c.ndtvimg.com/2022-09/82516ukg_detox-drink_625x300_29_September_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-01-29T04:22:19Z", "content": "We have often been told to eat healthy, cut down on snacks and monitor calorie intake. But honestly, it is quite a task. The commitment to a healthy diet and lifestyle lasts only a few days. While ma… [+1933 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN,China Global Television Network", "title": "Children's COVID-19 immune response fast but won't last: Aussie study - CGTN", "description": "New Australian research revealed on Friday found that while children's immune systems could help them avoid severe symptoms from COVID-19 infections, the system is less likely to \"form memory\" of previous infections.", "url": "https://news.cgtn.com/news/2023-01-29/Children-s-COVID-19-immune-response-fast-but-won-t-last-Aussie-study-1gYYjQGeJ3y/index.html", "urlToImage": "https://news.cgtn.com/news/2023-01-29/Children-s-COVID-19-immune-response-fast-but-won-t-last-Aussie-study-1gYYjQGeJ3y/img/1ee9c177d46a4506a0139479bbd78b33/1ee9c177d46a4506a0139479bbd78b33-750.png", "publishedAt": "2023-01-29T03:22:31Z", "content": "New Australian research revealed on Friday found that while children's immune systems could help them avoid severe symptoms from COVID-19 infections, the system is less likely to \"form memory\" of pre… [+2583 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Agnihotri", "title": "Balancing the diet: Essential nutrients for optimal health in children and women - Hindustan Times", "description": "It is important for children and women to have a balanced diet that includes a variety of nutrient-dense foods to meet their unique nutritional needs. Check out essential nutrients that you must include in your diet. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/balancing-the-diet-essential-nutrients-for-optimal-health-in-children-and-women-101674959273576.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/29/1600x900/national-cancer-institute-BQPi8F_UON0-unsplash_1674959955563_1674959973038_1674959973038.jpg", "publishedAt": "2023-01-29T02:48:11Z", "content": "Nutrition plays a vital role in the growth and development of children and women. Adequate intake of essential nutrients is necessary for maintaining good health and preventing chronic diseases. Howe… [+3985 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Prithvijit Mitra", "title": "Doxycycline effective in checking progression of Covid-19, finds study - Indiatimes.com", "description": "​CMRI Hospital in Kolkata was one of the six Indian hospitals where a trial to check the effectiveness of the antibiotic doxycycline was carried out.", "url": "https://timesofindia.indiatimes.com/city/kolkata/doxycycline-effective-in-checking-progression-of-covid-19-finds-study/articleshow/97409825.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97409845,width-1070,height-580,imgsize-25016,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-29T02:30:00Z", "content": ""}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Nirmal Jovial", "title": "Is it possible to recover from a severe heart attack? - The Week", "description": "An estimated 1.9 crore people die due to cardiovascular problems every year", "url": "https://www.theweek.in/health/more/2023/01/28/med-talk-severe-heart-attack.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/more/images/2023/1/28/21-Normal-heart-new.jpg", "publishedAt": "2023-01-29T02:12:00Z", "content": "Is it possible to fully recover from a severe heart attack? A recent study by scientists at UT Southwestern Medical Center in Texas, published in Science, suggests that with the help of gene editing,… [+2302 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Dr Alok Kulkarni", "title": "ADHD: Restless with a cause - The Week", "description": "The heterogenous condition can persist into adulthood, says Dr Alok Kulkarni", "url": "https://www.theweek.in/health/more/2023/01/28/adhd-factors-manifestations-training-medicines.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/more/images/2023/1/28/25-shutterstock.jpg", "publishedAt": "2023-01-29T02:04:00Z", "content": "I was at a friends place when I bumped into his child who was restlessly running around. He could hardly wait for his turn. He was constantly in motion as if driven by a motor. I was told that he was… [+5713 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Richa Barua", "title": "Thyroid in children: Expert highlights the importance of early detection - Asianet Newsable ", "description": "Asianet News spoke to Dr Sameera S Rao, Pediatrician and Neonatologist, at Motherhood Hospitals, who provided key insights into the symptoms of thyroid hormone deficiency in children, and what parents must do.", "url": "https://newsable.asianetnews.com/lifestyle/thyroid-in-children-expert-highlights-the-importance-of-early-detection-rba-rp74fb", "urlToImage": "https://static-ai.asianetnews.com/images/01gqw5x1jnjamp5vcv9esaj8rd/whatsapp-image-2023-01-28-at-5-58-56-pm_1200x630xt.jpg", "publishedAt": "2023-01-29T02:00:37Z", "content": "Asianet News spoke to Dr Sameera S Rao, Pediatrician and Neonatologist, at Motherhood Hospitals, who provided key insights into the symptoms of thyroid hormone deficiency in children, and what parent… [+4544 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Differentiated Thyroid Cancer in a Pediatric Population: Estimating the Risk of Recurrence and Evolution Over Time - Cureus", "description": "Background\r\n\r\nDifferentiated thyroid cancer (DTC) is the most common endocrine cancer during childhood, and the prognosis is usually good. The 2015 American Thyroid Association (ATA) pediatric guidelines for DTC classify patients into three categories (low, i…", "url": "https://www.cureus.com/articles/129972-differentiated-thyroid-cancer-in-a-pediatric-population-estimating-the-risk-of-recurrence-and-evolution-over-time", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_0.png", "publishedAt": "2023-01-28T21:36:44Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers find regulating immunological memory might help immune system fight disease - ThePrint", "description": "Missouri [US], January 28 (ANI): Scientists have long worked to better understand the immunological responses of the human body throughout various diseases, such as cancer and inflammatory diseases. In a recent study at the University of Missouri, Emma Teixei…", "url": "https://theprint.in/science/researchers-find-regulating-immunological-memory-might-help-immune-system-fight-disease/1340685/", "urlToImage": null, "publishedAt": "2023-01-28T18:15:38Z", "content": "Missouri [US], January 28 (ANI): Scientists have long worked to better understand the immunological responses of the human body throughout various diseases, such as cancer and inflammatory diseases.\r… [+2969 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Rajshree Vora", "title": "Sujok therapy for treating tinnitus - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/health/sujok-therapy-for-treating-tinnitus", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2023-01/ae24843c-93c7-45f7-ba1b-03af281144c4/mal_aux_oreilles_scaled.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-01-28T17:22:08Z", "content": "When phantom sounds, or sounds without an external source, are heard in one or both ears, the condition is known as tinnitus. This is a common disorder that affects around 15% to 20% of the populatio… [+1222 chars]"}, {"source": {"id": null, "name": "Theweeklymail.com"}, "author": "Abhilasha", "title": "Health tips: 5 essential changes in lifestyle to maintain good health and to control cholesterol level - The Weekly Mail", "description": "Health tips: people take medicines to maintain the level of cholesterol. But if you do not want to take English medicines to control it, you can bring it under control by changing your lifestyle.", "url": "https://theweeklymail.com/health-tips-5-essential-changes-in-lifestyle-to-maintain-good-health-and-cholesterol-level", "urlToImage": "https://theweeklymail.com/uploads/images/202301/image_870x580_63d558d73aaee.jpg", "publishedAt": "2023-01-28T17:21:40Z", "content": "Changes in lifestyle for control cholesterol: Build up of cholesterol levels, more than normal levels, can pose serious health risks, leading to heart attack and stroke. While there are different typ… [+1493 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Is maida difficult or easy to digest? A nutritionist breaks popular myth - Hindustan Times", "description": "Nutritionist Bhuvan Rastogi in his recent Instagram post claims that 'maida is not easily digested' is a myth. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/is-maida-difficult-or-easy-to-digest-a-nutritionist-breaks-popular-myth-101674912411142.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/28/1600x900/samosa_1674913159613_1674913167150_1674913167150.jpg", "publishedAt": "2023-01-28T13:45:39Z", "content": "Maida or all-purpose flour is an integral part of our life and while we try to minimise its consumption, we cannot really eliminate it from our food habits. It is there in your morning sandwich, in y… [+2646 chars]"}, {"source": {"id": null, "name": "Jmig.org"}, "author": null, "title": "Plexiform tumorlet of the uterus: a rare entity - Journal of Minimally Invasive Gynecology", "description": "The Mayo Clinic Institutional Review Board (IRB) acknowledges that based on the responses\nsubmitted for this new activity through the Mayo Clinic IRBe Human Subjects Research\nWizard tool, and in accordance with the Code of Federal Regulations, 45 CFR 46.102,\n…", "url": "https://www.jmig.org/article/S1553-4650(23)00019-5/fulltext", "urlToImage": "https://www.jmig.org/cms/asset/6b186af5-f330-46c3-a6a3-90f419263e66/gr2.jpg", "publishedAt": "2023-01-28T13:30:05Z", "content": "If you don't remember your password, you can reset it by entering your email address and clicking the Reset Password button. You will then receive an email that contains a secure link for resetting y… [+132 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Yukta Dawe", "title": "Male Baldness: Ayurvedic ways to get rid of it - News Track English", "description": "Baldness is common these days amongst men and women due to changes in the environment, the continuous use of chemical products. But there is a difference between male and female baldness. Baldness at a particular area is very common among man. Here are some A…", "url": "https://english.newstracklive.com/news/male-baldness-ayurvedic-ways-to-get-rid-of-it-sc24-nu352-ta352-1266266-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/fashion-and-beauty/Jan/28/big_thumb/Baldness_63d4f71a62bab.JPG", "publishedAt": "2023-01-28T10:40:22Z", "content": "Baldness is common these days amongst men and women due to changes in the environment, the continuous use of chemical products. But there is a difference between male and female baldness. Baldness at… [+1755 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Workout guide: From bone strengthening to Managing weight, 5 crucial benefits of weight training - DNA India", "description": "Know how helpful strength training is in increasing the strength and power of your body along with weight loss.", "url": "https://www.dnaindia.com/lifestyle/report-workout-guide-from-bone-strengthening-to-managing-weight-5-crucial-benefits-of-weight-training-3020045", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/01/28/2569267-untitled-design-1.jpg", "publishedAt": "2023-01-28T10:35:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Jan 28, 2023, 04:46 PM ISTFor weight loss, from nutritionists to gym trainers, everyone runs with a stick behind them. Sometimes … [+1760 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Fatty liver disease: How to identify if you have fatty liver? | The Times of India - Times of India", "description": "It is extremely important to identify the symptoms of the disease so that you can get medical help at the earliest.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/fatty-liver-disease-how-to-identify-if-you-have-fatty-liver/photostory/97397384.cms", "urlToImage": "https://static.toiimg.com/photo/97397447.cms", "publishedAt": "2023-01-28T10:30:00Z", "content": "A person is at an increased risk of fatty liver when he/ she is obese, has type 2 diabetes, is resistant to insulin, has thyroid issues, has high blood pressure, and high cholesterol.\r\nUnhealthy life… [+206 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US reports 100 pediatric flu deaths this season - ETHealthWorld", "description": "Nearly 4,000 people were hospitalised due to flu in the US in the latest week ending January 21, CDC data showed. Six influenza-associated pediatric deaths were reported this week, Xinhua news agency reported.", "url": "https://health.economictimes.indiatimes.com/news/industry/us-reports-100-pediatric-flu-deaths-this-season/97392044", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97392044,imgsize-4596,width-1200,height-628,overlay-ethealthworld/us-reports-100-pediatric-flu-deaths-this-season.jpg", "publishedAt": "2023-01-28T05:50:00Z", "content": "Los Angeles: The US has reported a total of 91 pediatric flu deaths so far this season, according to the latest data released on Friday by the US Centers for Disease Control and Prevention (CDC).Ther… [+477 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Antibodies against coronavirus 'coldspots' discovered - EastMojo", "description": "London: Scientists have discovered regions on the coronavirus which do not change, or 'coldspots', and that antibodies specific for these coldspots", "url": "http://www.eastmojo.com/coronavirus-updates/2023/01/28/antibodies-against-coronavirus-coldspots-discovered/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/covid-19-photo-1.jpg?fit=1200%2C675&ssl=1", "publishedAt": "2023-01-28T05:10:00Z", "content": "London: Scientists have discovered regions on the coronavirus which do not change, or ‘coldspots’, and that antibodies specific for these coldspots may help fight future coronaviruses, according to a… [+1741 chars]"}]}