{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "WebMD"}, "author": "Lisa O’Mary", "title": "COVID Infection, Vaccination Linked to Rare Heart Condition - WebMD", "description": "A new study confirms a link between POTS (postural orthostatic tachycardia syndrome) and COVID-19 infection. The study also found increased prevalence among people who got COVID-19 vaccines but hadn’t been infected.", "url": "https://www.webmd.com/heart-disease/news/20221213/covid-infection-vaccination-linked-rare-heart-condition", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/article_thumbnails/slideshows/8_ways_improving_odds_reduce_risk_heart_failure_slideshow/1800x1200_8_ways_improving_odds_reduce_risk_heart_failure_slideshow.jpg", "publishedAt": "2022-12-13T19:17:38Z", "content": "Dec. 13, 2022 A rare and debilitating heart condition known as postural orthostatic tachycardia syndrome, or POTS, was one of the first post-COVID health disorders that puzzled doctors early in the p… [+2026 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Mapping E. coli to overcome antibiotic resistance - Phys.org", "description": "Antibiotic resistance, when infection-causing bacteria evolve so they are no longer affected by typical antibiotics, is a global concern. New research at the University of Tokyo has mapped the evolution and process of natural selection of Escherichia coli (E.…", "url": "https://phys.org/news/2022-12-coli-antibiotic-resistance.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/mapping-e-coli-to-over.jpg", "publishedAt": "2022-12-13T19:00:01Z", "content": "Antibiotic resistance, when infection-causing bacteria evolve so they are no longer affected by typical antibiotics, is a global concern. New research at the University of Tokyo has mapped the evolut… [+4763 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Frequent use of mobile phones to calm kids increases emotional dysregulation: Study - Daily Pioneer", "description": "Frequent use of devices like smartphones and tablets to calm upset children aged 3-5 was associated with increased emotional dysregulation in kids, particularly in boys, according to a Michigan Medicine study in JAMA Pediatrics.\n\n“Using mobile devices to sett…", "url": "https://www.dailypioneer.com/2022/india/frequent-use-of-mobile-phones-to-calm-kids-increases-emotional-dysregulation--study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-12-13T18:31:18Z", "content": "Frequent use of devices like smartphones and tablets to calm upset children aged 3-5 was associated with increased emotional dysregulation in kids, particularly in boys, according to a Michigan Medic… [+1514 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research reveals doctors give ineffective weight loss advice to patients with obesity - ANI News", "description": "A new research study published in Family Practice, published by Oxford University Press, finds that when doctors tell patients living with obesity to lose weight the guidance they give is generally vague, superficial, and commonly not supported by scientific …", "url": "https://www.aninews.in/news/health/research-reveals-doctors-give-ineffective-weight-loss-advice-to-patients-with-obesity20221213233622", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221213180608.jpg", "publishedAt": "2022-12-13T18:06:00Z", "content": "New York [US], December 13 (ANI): According to a recent study, doctors typically give patients who are obese ambiguous, superficial, and frequently unsupported by scientific evidence advice when tell… [+2445 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research reveals subcutaneous fat is protector of females' brains - ANI News", "description": "Females' propensity to deposit more fat in places like their hips, buttocks and the backs of their arms, so-called subcutaneous fat, is protective against brain inflammation, which can result in problems like dementia and stroke, at least until menopause, sci…", "url": "https://www.aninews.in/news/health/research-reveals-subcutaneous-fat-is-protector-of-females-brains20221213231135", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221213174113.jpg", "publishedAt": "2022-12-13T17:41:00Z", "content": "Georgia [US], December 13 (ANI): Subcutaneous fat, which females are more likely to store in areas like the backs of their arms, hips, and buttocks, is thought to protect against brain inflammation, … [+6186 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Why does fat return after dieting? The microbiome might have a hand - Nature.com", "description": "Experiments on mice suggest that gut bacteria contribute to the post-diet rebound of fat tissue.", "url": "https://www.nature.com/articles/d41586-022-04387-9", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-04387-9/d41586-022-04387-9_23801816.jpg", "publishedAt": "2022-12-13T17:36:06Z", "content": "Thank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\r\n the best experience, we recommend you use a more up to date browser (or turn off compatibi… [+139 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Zika virus: How to prevent, expert suggests these steps | Mint - Mint", "description": "Caused by a virus transmitted primarily by the Aedes mosquito, which bites during the day, symptoms of this disease include mild fever, rashes, conjunctivitis, muscle and joint pain, malaise, or a headache", "url": "https://www.livemint.com/science/health/zika-virus-how-to-prevent-expert-suggests-these-steps-11670937235739.html", "urlToImage": "https://images.livemint.com/img/2022/12/13/600x338/Dengue_Vaccine_1670950244964_1670950245202_1670950245202.jpg", "publishedAt": "2022-12-13T17:01:37Z", "content": "A 5-year-old girl in Karnataka has tested positive for the Zika virus and has been advised to take precautionary measures. Caused by a virus transmitted primarily by the Aedes mosquito, which bites d… [+1573 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "New Immune Culprit Discovered in Alzheimer’s Disease - Neuroscience News", "description": "In patients with cognitive decline, the cerebral spinal immune system is dramatically altered. The findings shed light on how inflammation and the immune system play a role in neurodegenerative diseases like Alzheimer's.", "url": "https://neurosciencenews.com/immune-alzheimers-22066/", "urlToImage": "https://neurosciencenews.com/files/2022/12/alzheimers-immune-cells-neurosciences-public.jpg", "publishedAt": "2022-12-13T16:58:46Z", "content": "Summary: In patients with cognitive decline, the cerebral spinal immune system is dramatically altered. The findings shed light on how inflammation and the immune system play a role in neurodegenerat… [+4784 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Bird flu outbreak reported in two villages in Kerala - Deccan Herald", "description": "A bird flu outbreak has been reported in two panchayats in Kottayam district prompting the authorities to order culling of around 8,000 ducks, hens and other domestic birds within one km radius of the affected areas. District Collector P K Jayasree chaired an…", "url": "https://www.deccanherald.com/national/south/bird-flu-outbreak-reported-in-two-villages-in-kerala-1171449.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/12/13/2021-12-17t113301z400362479rc2bgr9n6zslrtrmadp3health-birdflu-francejpg-1068812-1641540472-1082625-1645116445-1-1083126-1645267814-1-1171449.jpg", "publishedAt": "2022-12-13T16:02:02Z", "content": "A bird flu outbreak has been reported in two panchayats in Kottayam district prompting the authorities to order culling of around 8,000 ducks, hens and other domestic birds within one km radius of th… [+1454 chars]"}, {"source": {"id": null, "name": "Health Feedback"}, "author": "Flora Teoh", "title": "No, a German “autopsy report” didn’t show COVID-19 vaccines as “likely” cause of sudden deaths - Health Feedback", "description": "While COVID-19 vaccines have indeed been associated with an elevated risk of certain adverse events like myocarditis, COVID-19 itself is associated with greater risks, including cardiac complications. To date, the scientific evidence shows that the benefits o…", "url": "https://healthfeedback.org/claimreview/german-autopsy-report-didnt-covid-19-vaccines-likely-cause-sudden-deaths/", "urlToImage": "https://healthfeedback.org/wp-content/uploads/2022/12/German-autopsy-report-didnt-show-COVID-19-vaccines-as-likely-cause-sudden-deaths-e1670939774621.png", "publishedAt": "2022-12-13T15:53:14Z", "content": "FULL CLAIM: Major New Autopsy Report Reveals Those Who Died Suddenly Were Likely Killed by the Covid Vaccine; The fact that those who die suddenly after vaccination may have died from the hidden effe… [+9439 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Zika Virus: Work is being done to manufacture vaccine, says NTAGI Chief Dr NK Arora - Economic Times", "description": "Talking about Zika Virus, National Technical Advisory Group on Immunisation (NTAGI) chief Dr NK Arora on December 13 said that work is being done to manufacture a vaccine for Zika Virus. Pregnant women and their children are being monitored. “Cervical cancer …", "url": "https://economictimes.indiatimes.com/news/india/zika-virus-work-is-being-done-to-manufacture-vaccine-says-ntagi-chief-dr-nk-arora/videoshow/96205590.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96205590,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-13T15:44:00Z", "content": "Talking about Zika Virus, National Technical Advisory Group on Immunisation (NTAGI) chief Dr NK Arora on December 13 said that work is being done to manufacture a vaccine for Zika Virus. Pregnant wom… [+765 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "WHO calls on countries to tax sugar-sweetened beverages to save lives - World Health Organization", "description": "<p>Today, WHO released its first-ever global tax manual for sugar-sweetened beverages (SSBs). Currently, at least 85 countries implement some type of SBB taxation. <br /></p><p><a href=\"https://www.who.int/publications/i/item/9789240056299\" data-sf-ec-immutab…", "url": "https://www.who.int/news/item/13-12-2022-who-calls-on-countries-to-tax-sugar-sweetened-beverages-to-save-lives", "urlToImage": "https://cdn.who.int/media/images/default-source/health-taxes/ssb-sugar-image.tmb-1200v.png?sfvrsn=7928bbdc_1", "publishedAt": "2022-12-13T15:41:04Z", "content": "Today, WHO released its first-ever global tax manual for sugar-sweetened beverages (SSBs). Currently, at least 85 countries implement some type of SBB taxation. \r\nThe WHO manual highlights the experi… [+2028 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Oral glucose tolerance test for gestational diabetes | DMSO - Dove Medical Press", "description": "Comparing capillary blood glucose testing with 2-h plasma glucose measurements obtained using 75-g OGTT to screen for GDM at primary healthcare clinics.", "url": "https://www.dovepress.com/diagnostic-accuracy-of-capillary-blood-glucometer-testing-for-gestatio-peer-reviewed-fulltext-article-DMSO", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-12-13T15:40:55Z", "content": "Introduction\r\nGestational diabetes mellitus (GDM) is a condition diagnosed during pregnancy that was not clearly overt diabetes prior to gestation.1 GDM is a neglected risk to the health of both moth… [+29718 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Specific bacteria in the bladder may indicate who is more prone to recurrent UTIs - News-Medical.Net", "description": "Researchers at The University of Texas at Dallas have identified specific bacteria in the bladder that may indicate which postmenopausal women are more susceptible to recurrent urinary tract infections (UTIs), and they found that estrogen may play a role in r…", "url": "https://www.news-medical.net/news/20221213/Specific-bacteria-in-the-bladder-may-indicate-who-is-more-prone-to-recurrent-UTIs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg", "publishedAt": "2022-12-13T15:36:00Z", "content": "Researchers at The University of Texas at Dallas have identified specific bacteria in the bladder that may indicate which postmenopausal women are more susceptible to recurrent urinary tract infectio… [+4693 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Dance of the scrotal worms documented on video - Medical Xpress", "description": "Two doctors at the Max Super Specialty Hospital in India has documented the filarial dance of scrotal worms on video. In the video, the undulations of live worms residing in a male patient's scrotum can be seen.", "url": "https://medicalxpress.com/news/2022-12-scrotal-worms-documented-video.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/dance-of-the-scrotal-w.jpg", "publishedAt": "2022-12-13T15:32:02Z", "content": "Two doctors at the Max Super Specialty Hospital in India has documented the filarial dance of scrotal worms on video. In the video, the undulations of live worms residing in a male patient's scrotum … [+3160 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Mediterranean diet not only promotes health but also fertility: Research - Devdiscourse", "description": "The Mediterranean diet, which emphasizes fruits, vegetables, and legumes, has long been praised for its numerous health benefits.  Recent research suggests that it may also aid in the treatment of infertility, making it a non-invasive and cost-effective metho…", "url": "https://www.devdiscourse.com/article/health/2284751-mediterranean-diet-not-only-promotes-health-but-also-fertility-research", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_12_2022_15_07_49_1760753.jpg?width=920&format=jpeg", "publishedAt": "2022-12-13T15:07:52Z", "content": "The Mediterranean diet, which comprises fruits, vegetables and legumes, has long been praised for its numerous health benefits. Now, a research has suggested it may also help in the treatment of infe… [+2882 chars]"}, {"source": {"id": null, "name": "Youthincmag.com"}, "author": null, "title": "WHO Most Likey To Rename Monkeypox To Mpox: Why? - Youth Incorporated", "description": "To curb the stigma of Mpox which was being associated with the disease and to tackle racism, the WHO has decided to change the name.", "url": "https://youthincmag.com/who-most-likey-to-rename-monkeypox-to-mpox-why", "urlToImage": "https://youthincmag.com/wp-content/uploads/2022/12/Froedtert.jpg", "publishedAt": "2022-12-13T14:59:53Z", "content": "Just when the world was recovering from COVID-19, a potential pandemic disease got us all freaking out. The Monkeypox outbreak. International public health agency, The World Health Organisation, is n… [+2674 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "IANS", "title": "Google Developing New Technology To Combat Insect-Borne Diseases Using Decades-Old Datasets Mined by Google - LatestLY", "description": "As hundreds of millions of people are affected by insect-borne diseases every year, Google is developing a new technology to combat such diseases using decades-old datasets mined by Google Books.", "url": "https://www.latestly.com/technology/google-developing-new-technology-to-combat-insect-borne-diseases-using-decades-old-datasets-mined-by-google-books-4582566.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/12/Google-784x441.jpg", "publishedAt": "2022-12-13T14:51:09Z", "content": "San Francisco, December 13 : As hundreds of millions of people are affected by insect-borne diseases every year, Google is developing a new technology to combat such diseases using decades-old datase… [+1790 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Measles in the US: 5 Things You Need to Know - Medscape", "description": "Even if pediatric patients or their families have not traveled recently, they may still be at risk within a community where its members travel internationally and vaccination rates are low.", "url": "https://www.medscape.com/viewarticle/985328", "urlToImage": "https://img.medscape.com/thumbnail_library/is_190208_measles_virus_800x450.jpg", "publishedAt": "2022-12-13T14:47:30Z", "content": "1. Measles is circulating, and undervaccinated communities are at risk.\r\nWhile overall childhood vaccination rates remain high in the United States, measles cases still occur here. Measles is easily … [+4448 chars]"}, {"source": {"id": null, "name": "OpIndia"}, "author": "OpIndia Staff", "title": "Man claims to solve fertility issues and genetic disorders with artificial womb facility called Ectolife. Here is what we know so far - OpIndia", "description": "The concept video claimed that Ectolife will extensively use AI technologies to provide nutrients that are customised to the needs of each child | OpIndia News", "url": "https://www.opindia.com/2022/12/ectolife-concept-video-artificial-womb-facility-future/", "urlToImage": "https://www.opindia.com/wp-content/uploads/2022/12/Opindia-Office-Work-14.jpg", "publishedAt": "2022-12-13T13:51:34Z", "content": "On Friday (December 9), a filmmaker and science communicator by the name of Hashem Al-Ghaili released a concept video of an artificial womb facility called Ectolife. \r\nThe said video claimed that it … [+2269 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Tanya Dutt", "title": "PCOS diet: Tips to help with the symptoms of Polycystic Ovary Syndrome; check expert`s advise - Zee News", "description": "An imbalance of reproductive hormones in women can lead to polycystic ovarian syndrome (PCOS), a health issue. It causes a number of concerns, including irregular menstruation cycles, facial hair growth, and difficulty with conceiving.", "url": "https://zeenews.india.com/health/pcos-diet-tips-to-help-with-the-symptoms-of-polycystic-ovary-syndrome-check-experts-advise-2548189", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/12/13/1129062-pcos-diet.png", "publishedAt": "2022-12-13T13:24:08Z", "content": "PCOS lifestyle tips: An imbalance of reproductive hormones in women can lead to polycystic ovarian syndrome (PCOS), a health issue. It causes a number of concerns, including irregular menstruation cy… [+3900 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr. Anil Venkitachalam, Dr. L H Hiranandani", "title": "Chronic Migraine With Aura: What Patients Should Know - NDTV Doctor", "description": "Annually, over 2.5 out of 100 individuals with episodic migraine have a tendency to develop chronic migraine. The pattern of chronic migraine differs from patient to patient.", "url": "https://doctor.ndtv.com/living-healthy/chronic-migraine-with-aura-what-patients-should-know-3603385", "urlToImage": "https://c.ndtvimg.com/2018-12/bqdc35f8_migraine_625x300_04_December_18.jpg", "publishedAt": "2022-12-13T12:45:24Z", "content": "A migraine is a complex, neurological disorder that causes pulsating (repeated) and throbbing pain on one side of the head and can last anywhere from 4 to 72 hours. Migraine is the second most cause … [+4776 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Trisha Yearwood Weight Loss Keto Gummies Shocking Exposed Warning? (Scam OR Legit) trisha yearwood gummies? - The Tribune India", "description": "Individuals who have trouble losing weight sometimes rely on wrong measures that may lead to fatal consequences. Skipping meals is a common mistake to stay fit. Without this goof, you can easily lose 4 to 8 pounds with the most talked about strategy called Tr…", "url": "https://www.tribuneindia.com/news/brand-connect/trisha-yearwood-weight-loss-keto-gummies-shocking-exposed-warning-scam-or-legit-trisha-yearwood-gummies-460618", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_2060678662.jpg", "publishedAt": "2022-12-13T12:25:00Z", "content": "Individuals who have trouble losing weight sometimes rely on wrong measures that may lead to fatal consequences. Skipping meals is a common mistake to stay fit. Without this goof, you can easily lose… [+8353 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "A new infection called Strep-A is spreading in the UK | WION Shorts - WION", "description": "There is a new infection that is killing children in the United Kingdom called Strep-A. A bacterial infection, Strep-A can be found in the throat or the skin...", "url": "https://www.youtube.com/watch?v=foUz2l19L38", "urlToImage": "https://i.ytimg.com/vi/foUz2l19L38/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4Ac4FgAKACooCDAgAEAEYYyBjKGMwDw==&rs=AOn4CLApErf8mAAkbaJjMXziwldgWs07Ow", "publishedAt": "2022-12-13T12:17:09Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "HGH Injections for Weight Loss Alternatives - Deccan Herald", "description": "The common notion of losing weight through diet and exercise certainly works for a lot of people However, not everyone is able to be a fitness enthusiast or follow the diet What makes losing weight so difficult or why people keep looking for shortcuts to reac…", "url": "https://www.deccanherald.com/brandspot/pr-spot/hgh-injections-for-weight-loss-alternatives-1171377.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1171377-1670933384.jpg", "publishedAt": "2022-12-13T12:09:44Z", "content": "The common notion of losing weight through diet and exercise certainly works for a lot of people However, not everyone is able to be a fitness enthusiast or follow the diet\r\nWhat makes losing weight … [+32348 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Doctors warn blood groups can contribute in developing heart disease - News9 LIVE", "description": "According to The American Heart Association, people with blood groups A and B, are more at risk of developing blood clots in the arteries of the heart.", "url": "https://www.news9live.com/health/health-conditions/doctors-warn-blood-groups-can-contribute-in-developing-heart-disease-213795", "urlToImage": "https://media.news9live.com/h-upload/2022/12/13/592016-lab-3498584480.jpg", "publishedAt": "2022-12-13T11:56:58Z", "content": "These days, a heart attack has become a very serious ailment. Fatalities due to heart disease are steadily rising. There are many reasons for the increase in heart disease. These include poor dietary… [+1929 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Multiple respiratory viruses co-circulating with flu in US: CDC - ETHealthWorld", "description": "Seasonal flu activity is high across the country and so far this season, there have been at least 13 million cases, 120,000 hospitalisations and 7,300 deaths the CDC estimates.", "url": "https://health.economictimes.indiatimes.com/news/industry/multiple-respiratory-viruses-co-circulating-with-flu-in-us-cdc/96200148", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96200148,imgsize-7930,width-1200,height-628,overlay-ethealthworld/multiple-respiratory-viruses-co-circulating-with-flu-in-us-cdc.jpg", "publishedAt": "2022-12-13T11:28:00Z", "content": "Washington: Multiple respiratory viruses are currently co-circulating with influenza in the US, the Centers for Disease Control and Prevention (CDC) said and urged the public to take flu shots and Co… [+900 chars]"}, {"source": {"id": null, "name": "Edtimes.in"}, "author": "Brand Voice", "title": "Why Is It Important to Get Your Sugar Tested? - ED Times", "description": "Why Is It Important to Get Your Sugar Tested? Testing your blood sugar is a vital aspect of managing type 1 and type 2 diabetes and keeping related complications at bay. All diabetics need to know when and how frequently this should be done for maximum benefi…", "url": "https://edtimes.in/why-is-it-important-to-get-your-sugar-tested/", "urlToImage": "https://edtimes.in/wp-content/uploads/2022/12/Why-Is-It-Important-to-Get-Your-Sugar-Tested-640x427.jpeg", "publishedAt": "2022-12-13T10:24:15Z", "content": "Why Is It Important to Get Your Sugar Tested?\r\nTesting your blood sugar is a vital aspect of managing type 1 and type 2 diabetes and keeping related complications at bay. All diabetics need to know w… [+4349 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Mudit Chhikara", "title": "Myth or Reality: Green Tea Helps Burn Body Fat and Lose Weight - Jagran Josh", "description": "The consumption and production of green tea have experienced an exponential rise in recent years due to the belief that green tea helps burn fat and lose weight. Check whether the link between green tea and weight loss is a myth or reality.", "url": "https://www.jagranjosh.com/general-knowledge/myth-or-reality-green-tea-helps-burn-body-fat-and-lose-weight-1670928040-1", "urlToImage": "https://img.jagranjosh.com/images/2022/December/13122022/green-tea-myth.jpg", "publishedAt": "2022-12-13T10:18:00Z", "content": "Myth or Reality: Green tea is quickly becoming the favourite beverage of fitness enthusiasts. Green tea's popularity has skyrocketed in recent years, thanks to its supposedly miraculous health benefi… [+5169 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Severe COVID-19 Is Producing Early Ageing-Like Effects In Brain - The Weather Channel", "description": "Despite COVID-19 primarily being a respiratory illness, there have been numerous accounts of neurological symptoms like brain fog or lack of focused thinking, memory loss, and depression.", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-12-13-severe-covid-19-is-producing-early-ageing-like-effects-in-brain", "urlToImage": "https://s.w-x.co/in-brain_6.jpg", "publishedAt": "2022-12-13T10:17:50Z", "content": "Even as we try to put the COVID-19 pandemic behind us and get on with our lives, new details about the disease that previously went unnoticed keep emerging to haunt us. And now, a new study has linke… [+2913 chars]"}, {"source": {"id": null, "name": "Startup.info"}, "author": "Startup Info Team", "title": "Figur UK Reviews SHOCKING Results Read Before Buying - Startup.info", "description": "We evaluate a number of factors when choosing a weight-loss capsule to make the best decision. The purchasing choice alters if the company is not forthcoming", "url": "https://startup.info/figur-uk-reviews-shocking-results-read-before-buying/", "urlToImage": "https://startup.info/wp-content/uploads/2022/12/Sans-titre-110.jpg", "publishedAt": "2022-12-13T09:45:40Z", "content": "Figur Reviews: Worthy Product or a Fake? You Need to check out this Review Before purchasing\r\nWe evaluate a number of factors when choosing a weight-loss capsule to make the best decision. The purcha… [+12291 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Pancreatic cancer patients can increase survival rates by opting for chemotherapy before surgery: Study - ThePrint", "description": "Colorado [US], December 13 (ANI): A randomised clinical trial has found that treating pancreatic cancer patients with chemotherapy before surgery significantly improved 1-year survival rates compared to immediate surgery. Published in The Lancet Gastroenterol…", "url": "https://theprint.in/science/pancreatic-cancer-patients-can-increase-survival-rates-by-opting-for-chemotherapy-before-surgery-study/1263642/", "urlToImage": null, "publishedAt": "2022-12-13T09:14:39Z", "content": "Colorado [US], December 13 (ANI): A randomised clinical trial has found that treating pancreatic cancer patients with chemotherapy before surgery significantly improved 1-year survival rates compared… [+3215 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New compound reverses gut inflammation in mice - Tech Explorist", "description": "The drug acts like a master reset switch in the intestines.", "url": "https://www.techexplorist.com/new-compound-reverses-gut-inflammation-mice/55370/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/compound-FexD.jpg", "publishedAt": "2022-12-13T08:05:44Z", "content": "Crohn’s disease and ulcerative colitis are both examples of inflammatory bowel disease (IBD), which is characterized by an overabundance of immune cells and inflammatory signaling chemicals known as … [+3284 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Julianna LeMieux, PhD", "title": "Synthetic Cell Adhesion Molecules Customize Cell–Cell Interactions - Genetic Engineering & Biotechnology News", "description": "Cellular “glue” to regenerate tissues, heal wounds, and regrow nerves represents a step toward building tissues and organs—a goal of regenerative medicine.", "url": "https://www.genengnews.com/cell-biology/synthetic-cell-adhesion-molecules-customize-cell-cell-interactions/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/12/UCSF_20160203_UCOP_002-scaled-e1670881085186.jpg", "publishedAt": "2022-12-13T08:00:35Z", "content": "Cell adhesion molecules are ubiquitous, specifying precise cellcell interactions in many, diverse, cellular processes. Now, researchers have engineered molecules that act like cellular glue, allowing… [+3398 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Ananya Singh", "title": "Women Are More Likely to Experience Adverse Drug Reactions. A New Study Tells Us Why - The Swaddle", "description": "A new study in mice debunks the popular belief that women are “scaled down” versions of men, highlighting the need for sex-based data in biomedical research.", "url": "https://theswaddle.com/women-are-more-likely-to-experience-adverse-drug-reactions-a-new-study-tells-us-why/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/12/131222_sex-diff-drugs_Editorial.jpg", "publishedAt": "2022-12-13T07:47:34Z", "content": "Researchers have long known that women are more likely to experience adverse drug reactions (ADR). Previous studies have attempted to quantify this, finding that women are 50-75% more likely to repor… [+5584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "How physios and occupational therapists are helping long Covid sufferers - The Indian Express", "description": "Studies have found exercise programs can help people with long COVID to reverse the effects of fatigue, muscle weakness, shortness of breath and exercise intolerance", "url": "https://indianexpress.com/article/lifestyle/health/how-physios-and-occupational-therapists-are-helping-long-covid-sufferers-8319686/", "urlToImage": "https://images.indianexpress.com/2022/12/conv.jpg", "publishedAt": "2022-12-13T06:30:53Z", "content": "Treating people for long COVID that is, symptoms that last longer than four weeks after COVID infection can be extremely complex due to the wide variety of problems associated with the condition.Whil… [+5347 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "Emergency rooms in Italian hospitals being 'pushed to their limits' - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/emergency-rooms-in-italian-hospitals-being-pushed-to-their-limits-3451213", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/f4bba73d76fa55e4b150ed3ed1419071_w_800_h_450.jpg", "publishedAt": "2022-12-13T05:52:07Z", "content": "Rome, Dec 13 (IANS) Emergency rooms in Italian hospitals were being \"pushed to their limits\" by the rising tide of Covid-19 and influenza infections as colder weather sweeps across the country, healt… [+906 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "IANS", "title": "Co-circulation of viruses to put pressure on EU healthcare systems: ECDC - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/cocirculation-of-viruses-to-put-pressure-on-eu-healthcare-systems-ecdc-3451184", "urlToImage": "https://i-invdn-com.investing.com/news/https://i-invdn-com.investing.com/akapi-images/800x450/1a52bfee90c0356eae5d491dadd5d051_w_800_h_450.jpg", "publishedAt": "2022-12-13T05:27:05Z", "content": "Stockholm, Dec 13 (IANS) The European Union (EU)/European Economic Area (EEA) could face \"significant pressure\" on healthcare systems in the coming months, he European Centre for Disease Prevention a… [+1671 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Special Measles-Rubella Vaccination Drive In Thane From Dec 15 - NDTV", "description": "A special Measles-Rubella vaccination drive will be conducted in Thane district from December 15 to January 25, 2023, a local health official said on Tuesday.", "url": "https://www.ndtv.com/india-news/special-measles-rubella-vaccination-drive-in-thane-from-dec-15-3601758", "urlToImage": "https://c.ndtvimg.com/2022-11/oltvf7g_mumbai-measles-vax-pti_625x300_30_November_22.jpg", "publishedAt": "2022-12-13T04:57:32Z", "content": "The officials aim to vaccinate all children who need immunisation before January 26.\r\nThane: A special Measles-Rubella vaccination drive will be conducted in Thane district from December 15 to Januar… [+664 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Early life trauma could lead to a binge eating disorder - Mint Lounge", "description": "A new study has discovered that more than eight out of ten of those who have binge-eating disorders have experienced early life trauma", "url": "https://lifestyle.livemint.com/health/wellness/early-life-trauma-could-lead-to-a-binge-eating-disorder-111670894124282.html", "urlToImage": "https://images.livemint.com/img/2022/12/13/1140x641/Binge_eating_1670894793650_1670894814643_1670894814643.jpg", "publishedAt": "2022-12-13T02:32:04Z", "content": "Over eight out of ten of those who have binge eating disorder, which affects about 3 per cent of Americans, also experienced childhood abuse, neglect, or other trauma.\r\nNow, a Virginia Tech scientist… [+4149 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Radifah Kabir", "title": "'Unbalanced' Genes Lead To Ageing, AI Analysis Of Multiple Species Reveals. Know What It Means - ABP Live", "description": "It is important for cells to balance the activity of long and short genes. Longer genes are linked to longer lifespans, and shorter genes are linked to shorter lifespans, the study found.", "url": "https://news.abplive.com/science/unbalanced-genes-lead-to-ageing-ai-analysis-of-multiple-species-reveals-know-what-it-means-1569284", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/12/13/f5c72dc0916d508b188c4821571f8b601670870270684324_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-12-13T01:46:13Z", "content": "Ageing is an inevitable phenomenon. Researchers from Northwestern University recently discovered a previously unknown mechanism that drives ageing, using artificial intelligence. The researchers anal… [+7018 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A handy lesson about pain and the brain in stroke survivors - News-Medical.Net", "description": "A world-first study of stroke survivors shows how chronic pain can alter body perception, with the brain tricking patients into believing their affected hand is a different size, increasing the risk of accidents.", "url": "https://www.news-medical.net/news/20221212/A-handy-lesson-about-pain-and-the-brain-in-stroke-survivors.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Stroke-620x480.jpg", "publishedAt": "2022-12-13T01:42:00Z", "content": "A world-first study of stroke survivors shows how chronic pain can alter body perception, with the brain tricking patients into believing their affected hand is a different size, increasing the risk … [+2434 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Using RNA interference to correct a mistake in the genetic code of patients with Fukuyama muscular dystrophy - Medical Xpress", "description": "Muscular dystrophy is a debilitating disease that causes progressive weakening and loss of muscles. Fukuyama congenital muscular dystrophy (FCMD), the second most common form of childhood muscular dystrophy in Japan, is a severe neuromuscular disorder charact…", "url": "https://medicalxpress.com/news/2022-12-rna-genetic-code-patients-fukuyama.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/novel-method-with-impl.jpg", "publishedAt": "2022-12-12T20:49:03Z", "content": "Muscular dystrophy is a debilitating disease that causes progressive weakening and loss of muscles. Fukuyama congenital muscular dystrophy (FCMD), the second most common form of childhood muscular dy… [+5283 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Bariatric Surgery Reduces Obesity-Related Cancer Risk - Medscape", "description": "Maurie Markman, MD, discusses results from a case-control study of individuals with high BMI, demonstrating reduced obesity-related cancer risk following bariatric surgery.", "url": "https://www.medscape.com/viewarticle/981929", "urlToImage": "https://img.medscape.com/thumbnail_library/Markman_on_Oncology_800x600.jpg", "publishedAt": "2022-12-12T19:28:07Z", "content": "This transcript has been edited for clarity.\r\nI'm Dr Maurie Markman from Cancer Treatment Centers of America. Im going to briefly discuss a component of a very complex and somewhat controversial topi… [+3710 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Partially vaxxed 4-year-old dies of suspected measles - Hindustan Times", "description": "According to the Brihanmumbai Municipal Corporation (BMC), the child developed the symptoms of measles on December 6. On December 11, her condition worsened and she had to be admitted to the intensive care unit (ICU) of a civic hospital. | Mumbai news", "url": "https://www.hindustantimes.com/cities/mumbai-news/partially-vaxxed-4-year-old-dies-of-suspected-measles-101670872887756.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/12/1600x900/Under-the-ongoing-outbreak-response-immunisation--_1670872886095.jpg", "publishedAt": "2022-12-12T19:21:27Z", "content": "Mumbai: A four-year-old girl from Saki Naka died on Monday while undergoing treatment for suspected measles. This would be the sixteenth death in the city suspected to be caused by measles.\r\nAccordin… [+1049 chars]"}, {"source": {"id": null, "name": "Washingtoncitypaper.com"}, "author": "Sponsored Content, UP Venture Media", "title": "9 Best Thermogenic Fat Burner Supplements to Use in 2023 - Washington City Paper", "description": "Are you struggling to lose weight? Check out the best thermogenic fat burner that can speed up your weight loss journey.", "url": "http://washingtoncitypaper.com/article/581687/best-thermogenic-fat-burner/", "urlToImage": "https://newspack-washingtoncitypaper.s3.amazonaws.com/uploads/2022/12/Picture1-20.png", "publishedAt": "2022-12-12T19:12:12Z", "content": "If you struggle with losing weight, youre not alone. The weight loss journey can be a slow and frustrating process. If youve been doing everything under the sun to lose weight with no luck so far, an… [+35559 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Nick Paul Taylor, The Science Advisory Board contributing writer", "title": "Discovery of toxin linked to severe COVID-19 points to new way to treat disease - The Science Board", "description": "A viral toxin produced by the SARS-CoV-2 virus may damage cell barriers, inducing vascular leak and driving severe COVID-19 infections, according to researchers at the University of California, Berkeley (UC Berkeley).", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5111", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_can/2020_07_22_17_41_6021_SARS-CoV-2_spike_coronavirus_20200722173424.jpeg", "publishedAt": "2022-12-12T18:33:22Z", "content": "Severe COVID-19 is associated with pulmonary edema -- abnormal buildup of fluid in the lungs -- which is linked to epithelial and endothelial barrier dysfunction. Researchers previously identified an… [+2660 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Awareness & alertness can prevent breast cancer - Daily Pioneer", "description": "Onset of breast cancer may be determined with proactive screening; healthy lifestyle and diet can beat the malady\n\nAccording to various studies, around 2.25 million individuals are living with cancer and it contributes to approximately eight per cent of the t…", "url": "https://www.dailypioneer.com/2022/columnists/awareness---alertness-can-prevent-breast-cancer.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-12-12T18:30:31Z", "content": "Onset of breast cancer may be determined with proactive screening; healthy lifestyle and diet can beat the malady\r\nAccording to various studies, around 2.25 million individuals are living with cancer… [+4582 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Measles kills four-year-old girl in Mumbai, toll reaches 16 - Devdiscourse", "description": "According to a statement issued by the Brihanmumbai Municipal Corporation (BMC), the girl had an acute respiratory failure due to bronchopneumonia with measles.", "url": "https://www.devdiscourse.com/article/headlines/2283345-measles-kills-four-year-old-girl-in-mumbai-toll-reaches-16", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_12_2022_16_48_29_0903482.jpg?width=920&format=jpeg", "publishedAt": "2022-12-12T16:48:32Z", "content": "A four-year-old girl died in Mumbai on Monday after contracting measles, taking the city's official death toll from the highly infectious disease to 16. According to a statement issued by the Brihanm… [+990 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Psychotropics use tied to lower risk of COVID-19 and related deaths, study says - Medical Dialogues", "description": "New research findings emphasise the protective effects of psychotropic medications on COVID-19 risk, particularly among older populations.China: A recent study published in European...", "url": "https://medicaldialogues.in/psychiatry/news/psychotropics-use-tied-to-lower-risk-of-covid-19-and-related-deaths-study-says-103904", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/12/193616-psychotropics.jpg", "publishedAt": "2022-12-12T14:30:25Z", "content": "New research findings emphasise the protective effects of psychotropic medications on COVID-19 risk, particularly among older populations.China: A recent study published in European Neuropsychopharma… [+2896 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research finds how antibody therapy impacts COVID vaccines - ANI News", "description": "Nearly three years into the pandemic, many of us now carry antibodies against the virus--due to an infection or two, a few doses of mRNA vaccine, or a round of monoclonal-antibody treatment. But not all immune responses are created equal, and how we first dev…", "url": "https://www.aninews.in/news/health/research-finds-how-antibody-therapy-impacts-covid-vaccines20221212190600", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221212121103.jpeg", "publishedAt": "2022-12-12T13:36:00Z", "content": "New York [US], December 12 (ANI): Many of us have antibodies against the virus about three years after the pandemic began, thanks to a few infections, doses of the mRNA vaccine, or a round of monoclo… [+4898 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Phenq PM Review – I Tried It For 30 Days! Here's My Results. - Deccan Herald", "description": "PhenQ PM is a powerful fat-incinerating formula that helps accelerating the fat burning process in the body while you sleep. PhenQ PM is a natural weight loss and weight regulating formula that manage all the aspects related to night-time fat burning, so that…", "url": "https://www.deccanherald.com/brandspot/pr-spot/phenq-pm-review-i-tried-it-for-30-days-heres-my-results-1171034.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1171034-1670850807.png", "publishedAt": "2022-12-12T13:12:04Z", "content": "PhenQ PM is a powerful fat-incinerating formula that helps accelerating the fat burning process in the body while you sleep. \r\nPhenQ PM is a natural weight loss and weight regulating formula that man… [+18122 chars]"}, {"source": {"id": null, "name": "Inventiva"}, "author": "pema", "title": "Deaths Due To Sudden Heart Attacks Is On The Rise In India, COVID Or COVID Vaccine? Matter Of Investigation - Inventiva", "description": "India has recently witnessed a spike in cardiovascular-related deaths. India has recently witnessed a spike in cardiovascular-related deaths. In fact, the younger generation has been witnessing this t", "url": "https://www.inventiva.co.in/trends/deaths-due-to-sudden-heart-attack/", "urlToImage": "https://www.inventiva.co.in/wp-content/uploads/2022/12/1920_gettyimages-1212727590.jpg", "publishedAt": "2022-12-12T12:41:00Z", "content": "India has recently witnessed a spike in cardiovascular-related deaths. In fact, the younger generation has been witnessing this too. There has been a number of cases in India where celebrities have b… [+7888 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "5 Best Testosterone Boosters for Muscle Gain: Top Rated Testosterone Pills for Bodybuilding & Muscle Growth in 2023 - Deccan Herald", "description": "Testosterone levels are vital for a man’s overall health, but with levels peaking in young adulthood, decreased testosterone may seem like an inevitable fate. In fact, studies show that testosterone decreases 1% per year after the age of 30 When you factor in…", "url": "https://www.deccanherald.com/brandspot/pr-spot/5-best-testosterone-boosters-for-muscle-gain-top-rated-testosterone-pills-for-bodybuilding-muscle-growth-in-2023-1171018.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1171018-1670848662.png", "publishedAt": "2022-12-12T12:35:13Z", "content": "Testosterone levels are vital for a mans overall health, but with levels peaking in young adulthood, decreased testosterone may seem like an inevitable fate. In fact, studies show that testosterone d… [+29721 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sayantani Biswas", "title": "Did not contract Covid-19? It might be because of vaccine or… | Mint - Mint", "description": "Some theories attributed this to increased immunity while some said this could be genetic bonding of the said person. Is this phenomenon the secret to eradicating the coronavirus completely?", "url": "https://www.livemint.com/science/health/did-not-contract-covid-19-it-might-be-because-of-vaccine-or-11670844928158.html", "urlToImage": "https://images.livemint.com/img/2022/12/12/600x338/CHINA-HEALTH-VIRUS-7_1670845317979_1670845317979_1670845329515_1670845329515.jpg", "publishedAt": "2022-12-12T12:20:14Z", "content": "While three waves of the coronavirus pandemic brought the world to a standstill, some people evaded contracting the viral infection altogether. During the pandemic popular terms like Covid virgin or … [+1893 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Aanchal Mathur", "title": "Diabetes Diet: Manage Blood Sugar Levels With Methi Tea - Slurrp", "description": "Methi seeds are full of fibre, which tends to slow down the digestion process, and regulate the absorption of carbohydrates and sugar. Besides, the antioxidants, anti-viral and anti-inflammatory properties in methi seeds help promote immunity, warm us up from…", "url": "https://www.slurrp.com/article/diabetes-diet-manage-blood-sugar-levels-with-methi-tea-1670846143039", "urlToImage": "https://images.slurrp.com/prodarticles/usazxtv5f8h.webp", "publishedAt": "2022-12-12T12:15:22Z", "content": "While there are many suggestions, tips and dietary recommendations that one can follow to manage diabetes, everything goes for a toss once winter arrives. After all, the season is one where you get t… [+772 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Rising heart attacks in youth; Experts give reasons - Mathrubhumi English", "description": "New Delhi: Widely conceived to occur in 'obese' and 'high-on-cholesterol' people, recent instances of young people 'collapsing' from heart attacks may tell a different, alarming story.Many videos have emerged showing people doing everyday activities such as w…", "url": "https://english.mathrubhumi.com/features/health/what-could-precipitate-heart-attacks-in-the-young-1.8127250", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.8127251:1670846024/Untitled%20design.jpg?$p=1a4beb7&f=16x9&w=1080&q=0.8", "publishedAt": "2022-12-12T11:55:55Z", "content": "New Delhi: Widely conceived to occur in 'obese' and 'high-on-cholesterol' people, recent instances of young people 'collapsing' from heart attacks may tell a different, alarming story.\r\nMany videos h… [+6495 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Catherine Schuster-Bruce", "title": "A woman felt short of breath for months. Tests on her lung fluid revealed she had breast cancer. - Business Insider India", "description": "A 61-year-old went for an assessment because she'd been feeling really breathless for two months. Doctors found that fluid had built up around her lungs and", "url": "https://www.businessinsider.in/science/health/news/a-woman-felt-short-of-breath-for-months-tests-on-her-lung-fluid-revealed-she-had-breast-cancer-/articleshow/96175363.cms", "urlToImage": "https://www.businessinsider.in/photo/96175363/a-woman-felt-short-of-breath-for-months-tests-on-her-lung-fluid-revealed-she-had-breast-cancer-.jpg?imgsize=323598", "publishedAt": "2022-12-12T11:42:00Z", "content": "A woman who felt breathless and wheezy was diagnosed with advanced breast cancer, which had spread to her skull, according to a report. \r\nThe unnamed 61-year-old woman, who had well-controlled asthma… [+2758 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Alpine Ice Hack (Alpilean Reviews) Fake Customer Results Exposed - mid-day.com", "description": "Alpilean is a weight-loss supplement that’s been formulated by doctors using clinically-backed ingredients. The basis for this supplement is apparently based on a Alpine Ice Hack Method weight loss hack that’s been an Alpine secret for healthy weight loss for…", "url": "https://www.mid-day.com/brand-media/article/alpine-ice-hack-alpilean-reviews-fake-customer-results-exposed-23259993", "urlToImage": "https://images.mid-day.com/images/images/2022/dec/Alpilean_01_d.jpg", "publishedAt": "2022-12-12T11:27:00Z", "content": "Alpilean is a weight-loss supplement thats been formulated by doctors using clinically-backed ingredients. The basis for this supplement is apparently based on a Alpine Ice Hack Method weight loss ha… [+18909 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Garima Sadhwani", "title": "Liver Diseases May Cause Abnormalities in Your Heart: What New Study Says - The Quint FIT", "description": "Liver diseases, even in early stages, can impact your heart health, found a new study published in the Frontiers in Cardiovascular Medicine journal by researchers at the Smidt Heart Institute at Cedars-Sinai.", "url": "https://www.thequint.com/fit/can-liver-problems-cause-abnormalities-in-your-heart-a-new-study-says-they-can", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2F46721721-fb8f-477b-8d4b-8c3c1062b9ea%2F6.png?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-12T11:00:00Z", "content": "The big reveal: The researchers found that increased FIB-4 scores in a person, which indicate liver fibrosis or severe liver disease, are also associated with heart abnormalities. \r\nWhat are experts … [+416 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Govindraj Ethiraj, IndiaSpend.com", "title": "To prevent measles from spreading further, India needs to immunise 95% of the susceptible population - Scroll.in", "description": "Epidemiologist K Srinath Reddy talks about the measures that ought to be taken to check the rising measles cases in the country.", "url": "https://scroll.in/article/1039487/to-prevent-measles-from-spreading-further-india-needs-to-immunise-95-of-susceptible-population", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/184188-iqqfmcllif-1670743881.jpg", "publishedAt": "2022-12-12T08:00:00Z", "content": "India, particularly Maharashtra\r\n, is currently seeing a measles outbreak\r\n. The state has recorded 925 confirmed cases\r\n and 17 deaths so far. Meanwhile, Chinas government is finally relaxing its st… [+16638 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Diet tips: 6 healthy eating habits you should include in your lifestyle - Hindustan Times", "description": "A new year is about to begin and along with that are “Healthy vows” piling up. Healthy eating habits are not just an action but rather a mindset you build over a period of time. Check out these 6 healthy eating habits by diet experts that you should include i…", "url": "https://www.hindustantimes.com/lifestyle/health/diet-tips-6-healthy-eating-habits-you-should-include-in-your-lifestyle-101670829575192.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/12/1600x900/pexels-ba-tik-3754293_1670829711181_1670829740209_1670829740209.jpg", "publishedAt": "2022-12-12T07:32:35Z", "content": "Bethenny Frankel rightly said, Your diet is a bank account. Good food choices are your investments hence, if you form healthy eating habits for yourself, it will be easier for you to have healthier m… [+3409 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Benefits of Cabbage: 4 Solid Reasons Why You Must Have Patta Gobhi in Winter - India.com", "description": "Benefits of Cabbage, 4 Solid Reasons Why You Must Have Patta Gobhi in Winter, health benefits of cabbage", "url": "https://www.india.com/health/benefits-of-cabbage-4-solid-reasons-why-you-must-have-patta-gobhi-in-winter-5796801/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/12/Collage-Maker-12-Dec-2022-10.46-AM.jpg", "publishedAt": "2022-12-12T05:36:00Z", "content": "Cabbage or patta gobhi is a powerhouse of nutrients. Here are 4 solid reasons why this leafy vegetable deserves a special place at your table. \r\nBenefits of Cabbage: 4 Solid Reasons Why You Must Have… [+2350 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "'Take care': WHO expert warns high rates of viruses circulating now | Mint - Mint", "description": "There are more than 500 subvariants of omicron that are in circulation right now, the WHO expert said", "url": "https://www.livemint.com/news/world/take-care-who-expert-warns-high-rates-of-viruses-circulating-now-11670816774207.html", "urlToImage": "https://images.livemint.com/img/2022/12/12/600x338/Virus-Outbreak-Pediatric-Vaccines-0_1670819365253_1670819365253_1670819388383_1670819388383.jpg", "publishedAt": "2022-12-12T04:31:47Z", "content": "WHO's Covid-19 technical head warned that a range of viruses and pathogens are circulating at a very high rate at present. Expert Maria Van Kerkhove on Twitter wrote, \"Covid-19, flu, RSV and other pa… [+2371 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "New customisable strontium-filled scaffold may enhance dental implant healing: Study - Times of India", "description": "Researchers from the University at Buffalo have developed a new strontium-loaded scaffold that can be customised to fit any size dental implant and may aid in patient healing and tissue attachment. The new study, published earlier in the Journal of Biomedical…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/new-customisable-strontium-filled-scaffold-may-enhance-dental-implant-healing-study/videoshow/96161361.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/96161361/size-61224/96161361.jpg", "publishedAt": "2022-12-12T03:43:01Z", "content": "Researchers from the University at Buffalo\r\n have developed a new strontium-loaded scaffold\r\n that can be customised to fit any size dental\r\n implant and may aid in patient healing and tissue attachm… [+1239 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "CDC director begging public to get flu and COVID vaccines as cases soar - 11Alive", "description": "Rates of the flu are currently higher than the country has seen in a decade, as deaths because of the virus have totaled more than all of last year.", "url": "https://www.youtube.com/watch?v=GpMovJlzVic", "urlToImage": "https://i.ytimg.com/vi/GpMovJlzVic/hqdefault.jpg", "publishedAt": "2022-12-12T00:07:57Z", "content": null}]}