{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mapping Matters: new cellular atlas of endometriosis for better understanding of the disease - News-Medical.Net", "description": "In this interview, News Medical spoke to Kate Lawrenson, Ph.D., about their latest research which detailed the molecular profile of endometriosis to help improve therapeutic options for the millions of women suffering from the disease.", "url": "https://www.news-medical.net/news/20230119/Mapping-Matters-new-cellular-atlas-of-endometriosis-for-better-understanding-of-the-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736086_16740359202007660.jpg", "publishedAt": "2023-01-19T08:17:00Z", "content": "In this interview, News Medical speaks to Kate Lawrenson, Ph.D., about their latest research which detailed the molecular profile of endometriosis to help improve therapeutic options for the millions… [+7789 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US experimental HIV vaccine regimen safe but ineffective: Study - ETHealthWorld", "description": "The trial was conducted by the HIV Vaccine Clinical Trials Network funded by the US National Institute of Allergy and Infectious Diseases, based at the Fred Hutchinson Cancer Research Centre in Seattle.", "url": "https://health.economictimes.indiatimes.com/news/industry/us-experimental-hiv-vaccine-regimen-safe-but-ineffective-study/97119854", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97119854,imgsize-23200,width-1200,height-628,overlay-ethealthworld/us-experimental-hiv-vaccine-regimen-safe-but-ineffective-study.jpg", "publishedAt": "2023-01-19T07:00:00Z", "content": "Los Angeles: A US investigational HIV vaccine regimen was safe but did not provide protection against HIV acquisition, according to a statement of the US National Institute of Health (NIH).The trial,… [+669 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Ovarian Cysts Symptoms And Treatment: All About The Infertility Issue Many Women Are Struggling With - India.com", "description": "Many women will develop at least one ovarian cyst during their lifetime. In most cases, cysts are painless and cause no symptoms.", "url": "https://www.india.com/health/ovarian-cysts-symptoms-and-treatment-all-about-the-infertility-issue-many-women-are-struggling-with-5860628/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-19-at-11.15.44-AM.jpeg", "publishedAt": "2023-01-19T05:46:38Z", "content": "Many women will develop at least one ovarian cyst during their lifetime. In most cases, cysts are painless and cause no symptoms.\r\nOvarian Cysts Symptoms And Treatment: All About The Infertility Issu… [+2590 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What your period is trying to tell you about your thyroid | The Times of India - Times of India", "description": "When your thyroid hormone production is inadequate, numerous body processes slow down including periods.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-your-period-is-trying-to-tell-you-about-your-thyroid/photostory/97090694.cms", "urlToImage": "https://static.toiimg.com/photo/97090808.cms", "publishedAt": "2023-01-19T05:30:00Z", "content": "<li>If you experience heavy menstrual bleeding, i.e if you need to change your pad or tampon less than 2 hours or pass clots very often it could be due to hypothyroidism i.e. your thyroid gland doesn… [+971 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "High BMI may metabolise Vitamin D differently, could diminish supplement effects: Study - The Week", "description": "Scientists have uncovered new evidence that vitamin D may be metabolised differently in people with an elevated body mass index (BMI), diminishing the impact of supplementation in such individuals, according to a new study.", "url": "https://www.theweek.in/news/health/2023/01/19/high-bmi-may-metabolise-vitamin-d-differently--could-diminish-su.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/quickscan/images/2018/10/26/6-vitamin-d-supplements-do-not.jpg", "publishedAt": "2023-01-19T05:16:02Z", "content": "Scientists have uncovered new evidence that vitamin D may be metabolised differently in people with an elevated body mass index (BMI), diminishing the impact of supplementation in such individuals, a… [+3718 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Ipsita Bhattacharya", "title": "HIGH blood sugar management: 5 types of nuts that are good for people with diabetes - check list - Zee News", "description": "Why you should have THESE nuts Sumaiya A lists the different types of nuts that are good for people with diabetes and why: 1) Almond: Consumption of this nut is especially good when it comes to glucose control in pre-diabetes.", "url": "https://zeenews.india.com/health/high-blood-sugar-management-5-types-of-nuts-that-are-good-for-people-with-diabetes-check-list-2563181", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/19/1143281-nuts-diet-pixabay.jpg", "publishedAt": "2023-01-19T04:45:50Z", "content": "If you have diabetes or high blood sugar, what cannot and can be eaten becomes a major topic of concern. Diet plays a significant role in controlling Type 2 diabetes and as Sumaiya A, Clinical Dietit… [+2445 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "Stop gaining belly fat with the help of these 10 yoga poses - Health shots", "description": "This winter, try these 10 yoga poses to reduce belly fat and, in turn, get a flat stomach and say bye-bye to stubborn fat!", "url": "https://www.healthshots.com/fitness/weight-loss/10-yoga-poses-to-reduce-belly-fat-during-winter-season/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/18234956/belly-fat.jpg", "publishedAt": "2023-01-19T03:29:14Z", "content": "You may not realise it too early, but obesity has several negative repercussions for your body. It can hamper your sleep cycle, make you feel more tired and raise your chance of developing a number o… [+4835 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Tanaz Meghjani | Bloomberg", "title": "Covid immunity lasts at least a year after infection plus shots: Studys - Business Standard", "description": "Boosters conferred an additional 6 months of protection", "url": "https://www.business-standard.com/article/current-affairs/covid-immunity-lasts-at-least-a-year-after-infection-plus-shots-study-123011900167_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-01/19/full/1674097211-0177.jpg", "publishedAt": "2023-01-19T03:02:00Z", "content": "People who have been both previously infected and vaccinated against Covid-19 get long-lasting protection against severe disease and hospitalization, a large international study found.\r\nThe combinati… [+1001 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Aspirin as effective as blood thinner injections to prevent deadly complications in patients hospitalized with bone fractures: Multi-center trial of more than 12000 orthopedic trauma patients likely to change standard of care - Science Daily", "description": "Patients hospitalized with fractures typically receive an injectable blood thinner, low-molecular-weight heparin, to prevent life-threatening blood clots. A new clinical trial, however, found that inexpensive over-the-counter aspirin is just as effective.", "url": "https://www.sciencedaily.com/releases/2023/01/230118195700.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-19T02:17:58Z", "content": "Patients hospitalized with fractures typically receive an injectable blood thinner, low-molecular-weight heparin, to prevent life-threatening blood clots. A new clinical trial, however, found that in… [+5790 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "HEAR SCORE: anamnestic & EKG data, low risk chest pain | OAEM - Dove Medical Press", "description": "Careful evaluation of clinical data & EKG allows to correctly discriminate which patients won’t have adverse cardiac events, reducing the length of stay in ED.", "url": "https://www.dovepress.com/hear-score-a-proposal-to-use-only-anamnestic-and-ekg-data-to-evaluate--peer-reviewed-fulltext-article-OAEM", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-19T00:31:52Z", "content": "Introduction\r\nChest pain in a common symptom in patients attending Emergency Department (ED) worldwide.1,2 An extensive variety of disorders can be related, ranging from life-threatening syndromes su… [+17349 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "The benefit of vaccination after previous SARS-CoV-2 infection in the omicron era - The Lancet", "description": "Understanding the durability of the protection conferred by SARS-CoV-2 infection and\nvaccination is of utmost importance to guide COVID-19 mitigation policies worldwide.\nIn November, 2021, before the emergence of the omicron (B.1.1.529) variant, an estimated\n…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00880-5/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/5e57d0ae-f0cd-4d28-810e-3ea4958049df/fx1.jpg", "publishedAt": "2023-01-18T23:30:14Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "First-in-human use of a modular capsid virus-like vaccine platform: an open-label, non-randomised, phase 1 clinical trial of the SARS-CoV-2 vaccine ABNCoV2 - The Lancet", "description": "Immunisation with ABNCoV2 was well tolerated, safe, and resulted in a functional immune\nresponse. The data support the need for additional clinical development of ABNCoV2\nas a second-generation SARS-CoV-2 vaccine. The modular cVLP platform will accelerate\nvac…", "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(22)00337-8/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/dae1155b-7b65-4988-97a8-da65f12f94a2/gr1.jpg", "publishedAt": "2023-01-18T23:30:14Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marilynn Larkin", "title": "COPD Patients at Higher Risk of Death 1 Year After Surgery - Medscape", "description": "Patients with chronic obstructive pulmonary disease are 26% more likely to die after elective surgery and to incur increased healthcare costs, compared with peers without the condition, researchers say.", "url": "https://www.medscape.com/viewarticle/987144", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230118_senior_spirometry_800x450.jpg", "publishedAt": "2023-01-18T21:30:11Z", "content": "Patients with chronic obstructive pulmonary disease (COPD) are more likely to die within a year of undergoing elective surgery and to incur higher healthcare costs than similar patients without COPD,… [+5966 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Srishti Singh Sisodia", "title": "Why does joint pain increase in winter season? Expert tells WION the reasons and preventive measures - WION", "description": "Why does joint pain increase in winter season? Expert tells WION the reasons and preventive measures", "url": "https://www.wionews.com/entertainment/lifestyle/news-why-does-joint-pain-increase-in-winter-season-expert-tells-wion-the-reasons-and-preventive-measures-553986", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/01/19/326591-orthopaedic-problems.png", "publishedAt": "2023-01-18T20:27:09Z", "content": "Winter season comes with a number of health issues, such as cold, flu, pneumonia, sore throat, asthma attacks, etc. Joint pain is also quite usual when the temperature starts to drop, some people fee… [+3386 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Lana Dykes", "title": "Yoga, Cognitive Behavioral Therapy Improved Patient-Reported Outcomes in Fibromyalgia, IBS - MD Magazine", "description": "Improved patient-reported outcomes were observed in patients who used mind-body interventions, such as cognitive behavioral therapy and yoga, and were effective for managing IBS and fibromyalgia.", "url": "https://www.hcplive.com/view/yoga-cognitive-behavioral-therapy-improves-patient-reported-outcomes-in-fibromyalgia-ibs", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/2b2ce48b37c5ba6d8f37eaaddcc03fc3ca2a67b0-5933x3955.jpg?fit=crop&auto=format", "publishedAt": "2023-01-18T19:14:50Z", "content": "Mind-body interventions (MBIs), specifically cognitive behavioral therapy (CBT) and yoga, were shown to improve patient-reported outcome measures in patients with fibromyalgia (FM) and irritable bowe… [+3672 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How our microbiome is shaped by family, friends and even neighbours - Nature.com", "description": "Social contacts throughout a person’s lifetime seed the body with microbes that could influence health and disease.", "url": "https://www.nature.com/articles/d41586-023-00118-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00118-w/d41586-023-00118-w_23932580.jpg", "publishedAt": "2023-01-18T18:07:55Z", "content": "The microbial communities living in and on our bodies evolve through our lives and are shaped by our social interactions, a study has found.Credit: Moyo Studio/E+/Getty\r\nPeople living in the same hou… [+3721 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Nuclear remodelling contributes to cardiac dysfunction during ageing - Nature.com", "description": "A new study shows that age-dependent nuclear remodelling in cardiomyocytes (via age-related loss of nuclear lamins) contributes to cardiac dysfunction through a process that is conserved in flies, mice and nonhuman primates.", "url": "https://www.nature.com/articles/s41569-023-00832-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41569-023-00832-y/MediaObjects/41569_2023_832_Figa_HTML.png", "publishedAt": "2023-01-18T17:36:10Z", "content": "Ageing is associated with a progressive decline in organ function, including the heart. However, the detailed mechanisms of age-related cardiac functional decline are unclear. A new study shows that … [+391 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Researchers identify therapeutic targets to overcome radioresistance of brain cancer cells: A new drug could potentially replace the current standard for treating brain cancer by sensitizing the cancer cells to radiotherapy - Science Daily", "description": "Glioblastoma (GBM) is a WHO grade IV brain tumor with dismal prognosis. Although post-surgical radiation chemotherapy combined with temozolomide is the standard line of treatment, GBM cells surviving radiotherapy contribute to tumor progression and recurrence…", "url": "https://www.sciencedaily.com/releases/2023/01/230118092036.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-18T17:06:28Z", "content": "Glioblastoma (GBM) is a WHO grade IV brain tumor with dismal prognosis. Although post-surgical radiation chemotherapy combined with temozolomide is the standard line of treatment, GBM cells surviving… [+3402 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Sagar Puri", "title": "Apple Health Benefits: This Red fruit helps in reducing Cholesterol- Know why you should eat it everyday - Zee News", "description": "Here are some of its benefits 1. Apple helps in Reducing Cholestrol According to a study eating 2 apples can helps in reducing Cholestrol levels. In human studies, consuming up to two to three medium-sized apples resulted in a decrease in total cholesterol le…", "url": "https://zeenews.india.com/health/apple-health-benefits-this-red-fruit-helps-in-reducing-cholesterol-know-why-you-should-eat-it-everyday-2563108", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/18/1143195-apple-health-benefits.jpg", "publishedAt": "2023-01-18T17:04:01Z", "content": "There is a quote that 'an apple a day keeps the doctor away'. Apples are the second most consumed fruit worldwide due to their health benefits. They play a significant role in the overall dietary int… [+2199 chars]"}, {"source": {"id": null, "name": "Dermatologyadvisor.com"}, "author": "Colby Stong", "title": "Keloids, Hypertrophic Scars, and Atopic Eczema - Dermatology Advisor", "description": "Comorbidities of excessive scarring across ethnic groups are investigated.", "url": "https://www.dermatologyadvisor.com/home/topics/skin-injury/keloids-hypertrophic-scars-and-atopic-eczema/", "urlToImage": null, "publishedAt": "2023-01-18T16:47:00Z", "content": "Excessive scarring from keloids and hypertrophic scars is associated with an increased risk for atopic eczema, investigators reported in a study published JAMA Dermatology.\r\nResearchers used data fro… [+3993 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Pure Neuro Reviews [2023 Urgently-Updated] Amazon, Coupon Code, Ingredients, Miracle - Deccan Herald", "description": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions such as thinking memory, memory, learning social cognition,…", "url": "https://www.deccanherald.com/brandspot/pr-spot/pure-neuro-reviews-2023-urgently-updated-amazon-coupon-code-ingredients-miracle-1182334.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p21-1182334-1674056303.png", "publishedAt": "2023-01-18T15:38:23Z", "content": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions… [+26798 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keto Excel Keto Gummies Australia Reviews 2023: Chemist Warehouse Exposed Hidden Dangers! - The Tribune India", "description": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies Australia help the body through ketosis and fasting. This i…", "url": "https://www.tribuneindia.com/news/brand-connect/keto-excel-keto-gummies-australia-reviews-2023-chemist-warehouse-exposed-hidden-dangers-471559", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1685757973.png", "publishedAt": "2023-01-18T15:25:00Z", "content": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies… [+9254 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Aislinn Antrim", "title": "Study: Increased Coffee Consumption May Reduce Severity of Non-Alcoholic Fatty Liver Disease in Patients With Type 2 Diabetes - Pharmacy Times", "description": "Individuals with higher caffeine levels were less likely to have liver fibrosis, while higher levels of non-caffeine coffee components were associated with reduced fatty liver index scores.", "url": "https://www.pharmacytimes.com/view/study-increased-coffee-consumption-may-reduce-severity-of-non-alcoholic-fatty-liver-disease-in-patients-with-type-2-diabetes", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/13003e3ce26d4b8eb963d06cb9d5be4560e1d92a-986x810.png?fit=crop&auto=format", "publishedAt": "2023-01-18T15:24:48Z", "content": "Caffeine, polyphenols, and other natural products found in coffee may help reduce the severity of non-alcoholic fatty liver disease (NAFLD) among overweight individuals with type 2 diabetes, accordin… [+2584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ADHD more important predictor of anxiety, depression than autism: Study - The Indian Express", "description": "The study, led by psychologists at the University of Bath, UK, is the first to show that adults with high levels of attention-deficit hyperactivity disorder (ADHD) symptoms are more likely to experience anxiety and depression than adults with high levels of a…", "url": "https://indianexpress.com/article/lifestyle/health/adhd-attention-deficit-predictor-anxiety-depression-autism-study-8389505/", "urlToImage": "https://images.indianexpress.com/2023/01/adhd-1200.jpg", "publishedAt": "2023-01-18T15:20:52Z", "content": "Scientists have found that ADHD is more predictive of poor mental health outcomes in adults than other neurodevelopmental conditions, like autism.The study, led by psychologists at the University of … [+4478 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Ayurveda expert debunks myths about Shilajit, the Himalayan herb - Hindustan Times", "description": "Shilajit provides so much more than just increased strength, sexual stamina and testosterone levels. It is known for its wealth of minerals, which encourages increased human strength, agility and endurance. Ayurveda expert busts the myths associated with cons…", "url": "https://www.hindustantimes.com/lifestyle/health/ayurveda-expert-debunks-myths-about-shilajit-the-himalayan-herb-101674053890133.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/FmMpjU2XwAA_hPr_1674054238875_1674054266408_1674054266408.jpg", "publishedAt": "2023-01-18T15:15:47Z", "content": "Shilajit as an ingredient has various myths associated with it and the health benefits of it take a backseat while the myths do the rounds so, we are taking it upon ourselves to address the various p… [+3871 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Biomarkers Predicting Poor Prognosis in Covid-19 Patients: A Survival Analysis - Cureus", "description": "Introduction\r\n\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importance. The objective of this study is to determine the relat…", "url": "https://www.cureus.com/articles/132461-biomarkers-predicting-poor-prognosis-in-covid-19-patients-a-survival-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/527759/article_river_4d90f260886611eda03ce7ff2d482aa6-cox.png", "publishedAt": "2023-01-18T15:11:24Z", "content": "Introduction\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importa… [+35617 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Synogut Reviews: Amazon, Where to Buy, Pills, Price - Deccan Herald", "description": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and poor digestive systems. The reason for this is mostly due to…", "url": "https://www.deccanherald.com/brandspot/pr-spot/synogut-reviews-amazon-where-to-buy-pills-price-1182322.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p18-1182322-1674054168.png", "publishedAt": "2023-01-18T15:02:48Z", "content": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and … [+34754 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Back Pain Breakthrough Reviews: Dr. Steve Young Help You? - Deccan Herald", "description": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasional stiffness or ashes it is important to know that your body…", "url": "https://www.deccanherald.com/brandspot/pr-spot/back-pain-breakthrough-reviews-dr-steve-young-help-you-1182321.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p17-1182321-1674053743.png", "publishedAt": "2023-01-18T14:55:43Z", "content": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasion… [+20743 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "All Day Slimming Tea Reviews: Herbal Tea Helps in Weight Loss! - Deccan Herald", "description": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people continue to overlook how important the practice of maintain…", "url": "https://www.deccanherald.com/brandspot/pr-spot/all-day-slimming-tea-reviews-herbal-tea-helps-in-weight-loss-1182319.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p16-1182319-1674053444.png", "publishedAt": "2023-01-18T14:50:44Z", "content": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people… [+31612 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Saline nasal spray good enough for reducing snoring and breathing difficulties in children: JAMA - Medical Dialogues", "description": "According to a randomized MIST trial, Intranasal mometasone furoate was no better than saline for resolving symptoms of sleep-disordered breathing (SDB) in children after six weeks of treatment....", "url": "https://medicaldialogues.in/ent/news/saline-nasal-spray-good-enough-for-reducing-snoring-and-breathing-difficulties-in-children-jama-105765", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/18/198630-untitled-design-2023-01-18t104534010.jpg", "publishedAt": "2023-01-18T14:30:42Z", "content": "According to a randomized MIST trial, Intranasal mometasone furoate was no better than saline for resolving symptoms of sleep-disordered breathing (SDB) in children after six weeks of treatment. Howe… [+3114 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Indo-Mediterranean diet bests DASH diet for lowering BP, CVD and all cause mortality - Medical Dialogues", "description": "This study published in the Nutrients Journal highlights the role of nutritious diet (DASH, Indo-Western and Japanese) against Western-type that can lead to increased levels of oxidative stress", "url": "https://medicaldialogues.in/diet-nutrition/news/indo-mediterranean-diet-bests-dash-diet-for-lowering-bp-cvd-and-all-cause-mortality-105739", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/04/196273-mediterranean-diet.jpg", "publishedAt": "2023-01-18T14:30:30Z", "content": "This study published in the Nutrients Journal highlights the role of nutritious diet (DASH, Indo-Western and Japanese) against Western-type that can lead to increased levels of oxidative stress and i… [+2409 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Albuminuric diabetic kidney disease may increase risk of Diabetic Foot Ulcer by two to three folds - Medical Dialogues", "description": "France: According to a recent research paper  published in the Journal of Diabetes And its Complications, the researchers  have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/albuminuric-diabetic-kidney-disease-may-increase-risk-of-diabetic-foot-ulcer-by-two-to-three-folds-105691", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/16/198355-diabetic-foot-ulcer.jpg", "publishedAt": "2023-01-18T14:30:25Z", "content": "France: According to a recent research paper published in the Journal of Diabetes And its Complications, the researchers have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic Ki… [+3330 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Inclisiran treatment in high-risk patients provides sustained reductions in LDL-cholesterol: ORION-3 - Medical Dialogues", "description": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/inclisiran-treatment-in-high-risk-patients-provides-sustained-reductions-in-ldl-cholesterol-orion-3-105746", "urlToImage": "https://medicaldialogues.in/h-upload/2021/09/14/160388-ldl-c.jpg", "publishedAt": "2023-01-18T14:30:15Z", "content": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the ORION-3… [+3795 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Amyl Guard Reviews: Ingredients, Customer reviews, Worthy Supplement to Buy or Scam? - Deccan Herald", "description": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same! Are you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredient that will aid you in losing weight without having to make…", "url": "https://www.deccanherald.com/brandspot/pr-spot/amyl-guard-reviews-ingredients-customer-reviews-worthy-supplement-to-buy-or-scam-1182310.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p14-1182310-1674051198.png", "publishedAt": "2023-01-18T14:13:18Z", "content": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same!\r\nAre you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredi… [+28672 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "How To Unlock Your Hip Flexors [Reviewed] Legit DVD Videos or Scam? - Deccan Herald", "description": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our hip is the most powerful and important muscle that connects t…", "url": "https://www.deccanherald.com/brandspot/pr-spot/how-to-unlock-your-hip-flexors-reviewed-legit-dvd-videos-or-scam-1182303.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p12-1182303-1674049612.png", "publishedAt": "2023-01-18T13:46:52Z", "content": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our h… [+29622 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What is The Biggest Risk Factor of Cervical Cancer? An Oncologist Answers | The Quint - The Quint", "description": "Tune in to the latest episode of News and Views to know all about cervical cancer, risk factors, preventive measures, and the HPV vaccine. #cervicalcancer #r...", "url": "https://www.youtube.com/watch?v=xt4-S_Iw_SI", "urlToImage": "https://i.ytimg.com/vi/xt4-S_Iw_SI/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYDyBlKFswDw==&rs=AOn4CLDakPnrWNaT2WGkz1Sw_tK7FMCoEw", "publishedAt": "2023-01-18T13:30:18Z", "content": null}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Sunflowers use an internal clock to bloom at optimal times - Earth.com", "description": "Sunflowers use an internal clock to bloom at optimal times • Earth.com", "url": "https://www.earth.com/news/sunflowers-use-an-internal-clock-to-bloom-at-optimal-times/", "urlToImage": "https://cff2.earth.com/uploads/2023/01/18052252/Sunflowers-scaled.jpg", "publishedAt": "2023-01-18T13:01:34Z", "content": "Sunflower heads consist of hundreds of tiny florets. Due to the way sunflowers grow, the youngest florets are in the center of the flower face and the most mature one at the edges, forming a spiral p… [+2630 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the impact of maternal hypertension and mental disorders on neonatal outcomes? - News-Medical.Net", "description": "Researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.", "url": "https://www.news-medical.net/news/20230118/What-is-the-impact-of-maternal-hypertension-and-mental-disorders-on-neonatal-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736094_16740431646153003.jpg", "publishedAt": "2023-01-18T12:25:00Z", "content": "In a recent study published in the Journal of Affective Disorders, researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.\r\nStudy: The effect of ma… [+5872 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Resurge Reviews [2023 Updated] Work For Weight Loss? Read - Deccan Herald", "description": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this. Furthermore the weight loss market is exploding and you will find an abundance of appetit…", "url": "https://www.deccanherald.com/brandspot/pr-spot/resurge-reviews-2023-updated-work-for-weight-loss-read-1182281.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p9-1182281-1674043886.png", "publishedAt": "2023-01-18T12:11:26Z", "content": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this.\r\nFurthermore the weight loss … [+24508 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Dolly Parton CBD Gummies REVIEWS Shark Tank REVEALED SCAM Or Legit? - mid-day.com", "description": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.", "url": "https://www.mid-day.com/brand-media/article/dolly-parton-cbd-gummies-reviews-shark-tank-revealed-scam-or-legit-23266101", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Dolly-Parton-CBD-Gummies1_d.jpg", "publishedAt": "2023-01-18T12:05:00Z", "content": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.\r\nThey are made with all the natural ingredients which are organ… [+7740 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "How to involve vitamin C in everyday life? - The Indian Express", "description": "How to involve vitamin C in everyday life?", "url": "https://indianexpress.com/web-stories/wellness/how-to-involve-vitamin-c-in-everyday-life/", "urlToImage": "https://images.indianexpress.com/2023/01/VITAMIN-C.jpg", "publishedAt": "2023-01-18T11:17:38Z", "content": "According to Harvard School of Public Health, fruits and vegetables are the best sources of this vitamin especially citrus foods, bell peppers, cruciferous vegetables and white potatoes."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Covid-19: Why are some patients presenting with ‘unusually high grade fever, prolonged cough’ even after two weeks? - The Indian Express", "description": "Normally, we know that Covid-10 only lasts approximately five to seven days, after which the fever and cough should go away, however some patients have persistent fever even after 12 to 14 days, said Dr Anil Ballani, consultant, Internal Medicine, P D Hinduja…", "url": "https://indianexpress.com/article/lifestyle/health/covid-19-covid-patients-unusually-high-grade-fever-prolonged-cough-two-weeks-8388884/", "urlToImage": "https://images.indianexpress.com/2023/01/cough_200_getty.jpg", "publishedAt": "2023-01-18T11:00:24Z", "content": "There has been a dip in cases of Covid-19, with active case load declining to 1,998 on Wednesday as per Ministry of Health, but doctors are “witnessing unusually high grade fever, and prolonged cough… [+4102 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Watch: Researchers suggest effects of resistance training in older adults - Times of India", "description": "A protein response that takes place at the cellular level as a result of ageing includes a balance between oxidants and antioxidants, low-grade inflammation, and is the cause of many medical conditions. Exercise has been found to balance oxidants lik>", "url": "https://timesofindia.indiatimes.com/videos/news/watch-researchers-suggest-effects-of-resistance-training-in-older-adults/videoshow/97090024.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97090024,imgsize-49716.cms", "publishedAt": "2023-01-18T11:00:12Z", "content": "Jan 18, 2023, 04:30PM ISTSource: ANIA protein response that takes place at the cellular level as a result of ageing includes a balance between oxidants and antioxidants, low-grade inflammation, and i… [+587 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Nervogen Pro Reviews Urgent Update Amazon, Walmart - Deccan Herald", "description": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lead to nerve pain and other chronic issues. Neuropathy is comm…", "url": "https://www.deccanherald.com/brandspot/pr-spot/nervogen-pro-reviews-urgent-update-amazon-walmart-1182245.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p6-1182245-1674039509.png", "publishedAt": "2023-01-18T10:58:29Z", "content": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lea… [+28970 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Okinawa Flat Belly Tonic Reviews: Amazon, GNC, Recipe and Official Website - Deccan Herald", "description": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each person is the strength. No matter what your race, color or sex or…", "url": "https://www.deccanherald.com/brandspot/pr-spot/okinawa-flat-belly-tonic-reviews-amazon-gnc-recipe-and-official-website-1182240.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p5-1182240-1674038974.png", "publishedAt": "2023-01-18T10:49:34Z", "content": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each perso… [+33130 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "GlucoBerry Reviews: MD/PROCESS Blood Sugar Supplement Work? Urgent Update - Deccan Herald", "description": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by many people as treatments to control their blood sugar level…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucoberry-reviews-md/process-blood-sugar-supplement-work-urgent-update-1182225.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1182225-1674037104.png", "publishedAt": "2023-01-18T10:18:24Z", "content": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by … [+31558 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "ProMind Complex Reviews Urgent Update amazon - Deccan Herald", "description": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of our lives, but they also shape us into who we're present da…", "url": "https://www.deccanherald.com/brandspot/pr-spot/promind-complex-reviews-urgent-update-amazon-1182218.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1182218-1674035897.png", "publishedAt": "2023-01-18T09:57:13Z", "content": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of… [+33361 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/prashasti-sudhakarzeemedia-esselgroup-com/", "title": "Health Tips: Beware ! These Food Items Can Make Your Brain Weak And Slow - Watch Video - India.com", "description": "There are certain food items that can be toxic for our brain. These food items make our brain slow and makes us lose our focus as well. Watch video to know what these food items are.", "url": "https://www.india.com/video-gallery/health-tips-beware-these-food-items-can-make-your-brain-weak-and-slow-watch-video-5858881/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/foods-that-make-brain-slow.jpg", "publishedAt": "2023-01-18T06:41:54Z", "content": "There are certain food items that can be toxic for our brain. These food items make our brain slow and makes us lose our focus as well. Watch video to know what these food items are. \r\nHealth Tips: D… [+603 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "5 Lifestyle Changes That Will Help To Lower Bad Cholesterol In Our Body During Winters - ABP Live", "description": "We all need some cholesterol in our bodies to function, but having too much can clog the arteries and contribute to future health concerns, including heart disease.", "url": "https://news.abplive.com/lifestyle/5-lifestyle-changes-that-will-help-to-lower-bad-cholesterol-in-our-body-during-winters-1576025", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/16/0d8833f364491e65a49bf020e43416581673871944341557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-18T06:30:00Z", "content": "New Delhi: Winters can raise the risk of a variety of diseases and health disorders, owing to our sedentary lifestyle throughout the season, as well as the fact that we consume more high-calorie food… [+2870 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "Post News Network", "title": "US reports 26,000 weekly child Covid-19 cases - OrissaPOST", "description": "Los Angeles: Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and the Children’s Hospital Association. This is a decrease from the previous wee…", "url": "https://www.orissapost.com/us-reports-26000-weekly-child-covid-19-cases/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2023/01/US-reports-26000-weekly-child-Covid-19-cases.jpg", "publishedAt": "2023-01-18T06:08:39Z", "content": "Los Angeles: Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and the Children’s Ho… [+1017 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Can diabetics and weight-watchers have dates, dried fruits and raisins? - The Indian Express", "description": "Dried fruits contain about two/third carbohydrates, have a low protein content and a high amount of fibre. A moderate intake of raisins and nuts is fine for an active and fit person with or without diabetes, says Dr Anoop Misra, Chairman, Fortis CDOC Hospital…", "url": "https://indianexpress.com/article/lifestyle/health-specials/diabetics-weight-watchers-dates-dried-fruits-and-raisins-8388395/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200.jpg", "publishedAt": "2023-01-18T03:40:47Z", "content": "An Indian patient of mine has been living in Saudi Arabia and gets a check-up done from time to time whenever he is here. This time he asked me, Doc, dates are very popular there. Can I take them? I … [+3616 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/video-desk/", "title": "Health Tips: Add These Foods In Your Kids Diet For Proper Functioning And Growth Of Brain | Watch Video - India.com", "description": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that kids eat meals that are very nourishing and brain-boosting …", "url": "https://www.india.com/video-gallery/health-tips-add-these-foods-in-your-kids-diet-for-proper-functioning-and-growth-of-brain-watch-video-5857925/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/brain_booster_foods_for_kids.jpeg", "publishedAt": "2023-01-18T03:30:05Z", "content": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that… [+828 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dt Divya", "title": "Herbal tea to turmeric milk: 5 healthy drinks to stay hydrated in winter - Health shots", "description": "Read about these 5 hydrating drinks, apart from water, to avoid dehydration during this time and stay energised and active throughout the day.", "url": "https://www.healthshots.com/healthy-eating/nutrition/5-healthy-drinks-to-stay-hydrated-in-winter/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/17230621/drinks1.jpg", "publishedAt": "2023-01-18T03:29:06Z", "content": "Winter seasons concerns include dry and dull skin, but we often overlook the need for proper hydration. We fail to drink enough water during winter because of the low temperatures, and as a result, w… [+4219 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Smartphone App Can Significantly Improve Memory Recall - Neuroscience News", "description": "A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer's disease. The app mimics the function of the hippocampus, constructing and maintaining m…", "url": "https://neurosciencenews.com/hippocamera-app-memory-22271/", "urlToImage": "https://neurosciencenews.com/files/2023/01/memory-phone-app-neurosicence.jpg", "publishedAt": "2023-01-17T16:44:21Z", "content": "Summary: A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer’s disease. The app m… [+9304 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "5 common myths related to sugar - Firstpost", "description": "All cells require sugar, but cancer cells even require other nutrients to survive, like amino acids and fats, so it’s not just about sugar.", "url": "https://www.firstpost.com/living/5-common-myths-related-to-sugar-that-you-may-have-heard-of-12002732.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/sugar-export.jpg", "publishedAt": "2023-01-17T13:51:09Z", "content": "Most of us like to eat sugar, whether it is in the form of mithai, chocolate, cookies or even the sugar in your tea. But no matter how much we say we can’t live without our daily dose of sugar, its c… [+2266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some Ayurvedic swaps to help you manage PCOS better - The Indian Express", "description": "\"The Ayurvedic approach to treating PCOS includes dietary changes like consuming a balanced and nourishing diet, increasing the intake of bitter and astringent vegetables and more,\" said r Yogini Patil, BAMS and nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/ayurvedic-swaps-to-help-manage-pcos-better-8168682/", "urlToImage": "https://images.indianexpress.com/2022/09/PCOS-1.jpg", "publishedAt": "2023-01-17T13:30:37Z", "content": "Polycystic ovarian syndrome (PCOS) is a hormonal (endocrine) disorder that can lead to irregular periods, excess body hair, skin issues, weight gain, and also anxiety. As such, it is essential to kee… [+3590 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Researchers use MRI data to predict brain tumor progression - Big News Network", "description": "Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately", "url": "https://www.bignewsnetwork.com/news/273384850/researchers-use-mri-data-to-predict-brain-tumor-progression", "urlToImage": "https://cdn.bignewsnetwork.com/ani1673962018.jpg", "publishedAt": "2023-01-17T13:18:00Z", "content": "Washington [US], January 17 (ANI): Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.\r\nGlioblastoma multiforme… [+2228 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Quietum Plus Reviews: Amazon, Tinnitus, Consumer Reports, Ingredients - Deccan Herald", "description": "Quietum Plus: Your search stops hear! Hearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern life it's obvious that this problem isn't reserved for the elde…", "url": "https://www.deccanherald.com/brandspot/pr-spot/quietum-plus-reviews-amazon-tinnitus-consumer-reports-ingredients-1181979.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181979-1673958573.png", "publishedAt": "2023-01-17T12:29:33Z", "content": "Quietum Plus: Your search stops hear!\r\nHearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern li… [+31006 chars]"}]}