{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Avocados: Using this delectable fruit for the benefit of your skin - Times Now", "description": "This fruit has several nutrients present in it along with some healthy fats and all of these factors make this fruit a favourite among many. However, the fruit is not just beneficial for your health, but, it is also good for your skin. The vitamins present in…", "url": "https://www.timesnownews.com/health/avocados-using-this-delectable-fruit-for-the-benefits-of-your-skin-article-93827862", "urlToImage": "https://static.tnn.in/thumb/msid-93827862,imgsize-100,width-1280,height-720,resizemode-75/93827862.jpg", "publishedAt": "2022-08-28T02:16:48Z", "content": "Avocados can help improve skin elasticity. The fats present in avocados can help to improve skin elasticity. When your skin elasticity is good, the appearance of wrinkles and fine lines also reduces."}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Sneha Ramesh", "title": "Wastewater surveillance extends its reach to track H1N1, monkeypox - Deccan Herald", "description": "With the flu-like cases on the increase in the city, Bengaluru’s Precision Health initiative, a wastewater surveillance programme piloted by the COVIDActionCollab (CAC) has widened its scope to study the prevalence of H1N1, influenza, and monkeypox.", "url": "https://www.deccanherald.com/city/top-bengaluru-stories/bengaluru-wastewater-surveillance-extends-its-reach-to-track-h1n1-monkeypox-1140010.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/08/28/virus-1140010-1661653852.jpg", "publishedAt": "2022-08-28T01:30:50Z", "content": "With the flu-like cases on the increase in the city, Bengalurus Precision Health initiative, a wastewater surveillance programme piloted by the COVIDActionCollab (CAC) has widened its scope to study … [+1749 chars]"}, {"source": {"id": null, "name": "The Sunday Guardian"}, "author": null, "title": "No specific treatment for tomato flu, say health experts - The Sunday Guardian Live - The Sunday Guardian", "description": "New Delhi: Several health experts have stated that children and immune-compromised adults are at utmost risk as the Tomato Flu is highly contagious. Currently, there is no specific treatment for the flu and the symptoms are almost similar to dengue, and chiku…", "url": "https://www.sundayguardianlive.com/news/no-specific-treatment-tomato-flu-say-health-experts", "urlToImage": "https://www.sundayguardianlive.com/wp-content/uploads/2022/08/Tanmaya-Das-Tomato-flu-edited.jpg", "publishedAt": "2022-08-27T23:12:13Z", "content": "New Delhi: Several health experts have stated that children and immune-compromised adults are at utmost risk as the Tomato Flu is highly contagious. Currently, there is no specific treatment for the … [+2116 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Artificial Intelligence Model Can Detect Parkinson’s From Breathing Patterns - Neuroscience News", "description": "A newly developed artificial intelligence model can detect Parkinson's disease by reading a person's breathing patterns. The algorithm can also discern the severity of Parkinson's disease and tract progression over time.", "url": "https://neurosciencenews.com/artificial-intelligence-breathing-parkinsons-21305/", "urlToImage": "https://neurosciencenews.com/files/2022/08/ai-parkinsons-breathing-neurosicences-public.jpg", "publishedAt": "2022-08-27T21:59:00Z", "content": "Summary: A newly developed artificial intelligence model can detect Parkinson’s disease by reading a person’s breathing patterns. The algorithm can also discern the severity of Parkinson’s disease an… [+6626 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Cardiovascular disease risk increases if you have autoimmune disorders - ThePrint", "description": "Leuven [Belgium], August 28 (ANI): In high-income areas like Europe and the United States, 10% of the population has been identified as having one or more autoimmune illnesses. Examples include type I diabetes, lupus erythematosus, psoriasis, systemic scleros…", "url": "https://theprint.in/health/cardiovascular-disease-risk-increases-if-you-have-autoimmune-disorders/1104068/", "urlToImage": null, "publishedAt": "2022-08-27T20:13:21Z", "content": "Leuven [Belgium], August 28 (ANI): In high-income areas like Europe and the United States, 10% of the population has been identified as having one or more autoimmune illnesses.\r\nExamples include type… [+5296 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Mapping Brain Stem’s Control of Eating Could Lead to Better Treatments for Obesity - Neuroscience News", "description": "Researchers investigate neural pathways that meet in the brainstem which help control feeding behaviors.", "url": "https://neurosciencenews.com/brainstem-eating-obesity-21301/", "urlToImage": "https://neurosciencenews.com/files/2022/08/brainstem-eating-neurosicences-public.jpg", "publishedAt": "2022-08-27T20:06:07Z", "content": "Summary: Researchers investigate neural pathways that meet in the brainstem which help control feeding behaviors.\r\nSource: University of Michigan\r\nEvery meal you sit down to makes an impression, with… [+4945 chars]"}, {"source": {"id": null, "name": "YourTango"}, "author": "Alice Kelly", "title": "18 Foods To Add To Your Diet If You Want To Reduce Anxiety - YourTango", "description": "These foods that help with anxiety have been proven to lower stress levels and boost mood. Add them to your diet to feel more at ease.", "url": "https://www.yourtango.com/self/foods-help-with-anxiety-stress", "urlToImage": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/foods-that-help-with-anxiety.png?itok=xwZR9RxP", "publishedAt": "2022-08-27T19:39:24Z", "content": "Diets arent just about weight loss and looking good. Feeling good is just as, if not more, important than what is going on on the outside.\r\nIncluding a bunch of foods that help with anxiety into your… [+9312 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Dr Irfan Shaikh", "title": "Impact of poor muscle health on your body's immunity - The Hans India", "description": "Building and maintaining a robust immune system is important for leading healthy, wholesome lives,...", "url": "https://www.thehansindia.com/featured/sunday-hans/impact-of-poor-muscle-health-on-your-bodys-immunity-759488", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/08/27/1309766-physi.jpg", "publishedAt": "2022-08-27T18:44:14Z", "content": "Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune system even… [+3677 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Why healthy eating is important - The Hans India", "description": "If you've ever asked someone for advice on how to stay healthy, they've undoubtedly told you to 'eat ...", "url": "https://www.thehansindia.com/featured/sunday-hans/why-healthy-eating-is-important-759487", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/08/27/1309765-kids.jpg", "publishedAt": "2022-08-27T18:35:51Z", "content": "If you've ever asked someone for advice on how to stay healthy, they've undoubtedly told you to 'eat a nutritious diet', but really-what does that even mean? \r\nDifferent nutrients and their importanc… [+3864 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Sclerosing Encapsulating Peritonitis Mimicking an Internal Hernia: A Case Report - Cureus", "description": "Sclerosing encapsulating peritonitis (SEP) is a rare entity that could lead to abdominal obstruction; however, despite being reported in several case series, its underlying pathophysiology is still unclear. A large proportion of SEP cases are diagnosed incide…", "url": "https://www.cureus.com/articles/103484-sclerosing-encapsulating-peritonitis-mimicking-an-internal-hernia-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/433868/article_river_3de39fd0200011edad04295c24d8be7a-X-ray.png", "publishedAt": "2022-08-27T18:31:39Z", "content": "Sclerosing encapsulating peritonitis (SEP) is a rare entity that could lead to abdominal obstruction; however, despite being reported in several case series, its underlying pathophysiology is still u… [+12390 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "DENGUE MENACE - Daily Pioneer", "description": "Climate change-induced temperatures causing erratic precipitation patterns, severe rainfall events, and seasonal changes are all known to boost mosquito populations. This means, once isolated to a few areas in the tropics, higher number of mosquitos available…", "url": "https://www.dailypioneer.com/2022/sunday-edition/dengue-menace.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-08-27T18:31:26Z", "content": "Climate change-induced temperatures causing erratic precipitation patterns, severe rainfall events, and seasonal changes are all known to boost mosquito populations. This means, once isolated to a fe… [+14293 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "'It's Time To Find Therapeutic Solutions to Dengue Menace' - Daily Pioneer", "description": "Compared to the funds and research carried out on Covid-19 during the past two years, only a fraction of that has been invested to develop dengue vaccine and drugs, despite the disease being around for decades and wreaking havoc every year across countries.Gi…", "url": "https://www.dailypioneer.com/2022/sunday-edition/---it-s-time-to-find-therapeutic-solutions-to-dengue-menace-.html", "urlToImage": "https://www.dailypioneer.com/uploads/2022/story/images/big/---it-s-time-to-find-therapeutic-solutions-to-dengue-menace--2022-08-28.jpg", "publishedAt": "2022-08-27T18:31:26Z", "content": "Compared to the funds and research carried out on Covid-19 during the past two years, only a fraction of that has been invested to develop dengue vaccine and drugs, despite the disease being around f… [+5040 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Team MP", "title": "Dengue: Kolkata registers about 438 cases so far this yr - Millennium Post", "description": "Kolkata: In the wake of a rising number of dengue cases across the state, various government run...", "url": "http://www.millenniumpost.in/kolkata/dengue-kolkata-registers-about-438-cases-so-far-this-yr-491042", "urlToImage": "http://www.millenniumpost.in/images/logo.png", "publishedAt": "2022-08-27T18:12:47Z", "content": "Kolkata: In the wake of a rising number of dengue cases across the state, various government run hospitals in the subdivision and block levels have been urged to make necessary arrangements to treat … [+2102 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Felicity Nelson", "title": "There is a 'Shockingly Weird' Reason Mosquitoes Always Seem to Find Us, Says Study - ScienceAlert", "description": "The relentless accuracy with which some mosquito species hunt down humans may result from their bizarrely wired olfactory system, which has an in-built backup for detecting human scents.", "url": "https://www.sciencealert.com/there-is-a-shockingly-weird-reason-mosquitoes-always-seem-to-find-us-says-study", "urlToImage": "https://www.sciencealert.com/images/2022/08/mossie-moon-image-1024.jpg", "publishedAt": "2022-08-27T18:04:18Z", "content": "The relentless accuracy with which some mosquito species hunt down humans may result from their bizarrely wired olfactory system, which has an in-built backup for detecting human scents.\r\nMosquitoes … [+2816 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Vital role of immune cells in liver regeneration identified during research - ThePrint", "description": "Washington [US], August 27 (ANI): The vital role of immune cells that boost the production of liver cells has recently been discovered by MedUni Vienna research. The results of the study were recently published in the esteemed Journal of Hepatology. During th…", "url": "https://theprint.in/science/vital-role-of-immune-cells-in-liver-regeneration-identified-during-research/1103945/", "urlToImage": null, "publishedAt": "2022-08-27T17:15:33Z", "content": "Washington [US], August 27 (ANI): The vital role of immune cells that boost the production of liver cells has recently been discovered by MedUni Vienna research.\r\nThe results of the study were recent… [+2225 chars]"}, {"source": {"id": null, "name": "Easternmirrornagaland.com"}, "author": null, "title": "Smoking Also Leads to Thicker, Weaker Hearts — Study - Eastern Mirror", "description": "It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts. The researchers found that the more people smoked, the worse their heart fun…", "url": "https://easternmirrornagaland.com/smoking-also-leads-to-thicker-weaker-hearts-study/", "urlToImage": null, "publishedAt": "2022-08-27T16:22:39Z", "content": "It is well known that smoking causes blocked arteries, leading to coronary heart disease and stroke. A new study on Thursday warned that smoking also leads to thicker, weaker hearts.\r\nThe researchers… [+2306 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Steve Stiles", "title": "Vintage Drug Atop Loop Diuretics Boosts ADHF Decongestion: ADVOR - Medscape", "description": "Adding the IV drug to loop diuretics in the ADVOR trial improved decongestion success in volume-overloaded patients with acute decompensated heart failure, researchers reported.", "url": "https://www.medscape.com/viewarticle/979851", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220825_urine_bag_800x450.jpg", "publishedAt": "2022-08-27T16:07:39Z", "content": "A decades-old drug, added to standard loop diuretics, could potentially help more volume-overloaded patients with acute decompensated heart failure (ADHF) to be discharged from the hospital 'dry,' a … [+9515 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Incompetent cervix: Symptoms, risk factors, complications, tips to prevent it - Hindustan Times", "description": "Here's all you need to know about the symptoms, risk factors, complications and tips to prevent incompetent cervix or cervical insufficiency/cervical incompetence that could lead to premature delivery or pregnancy loss. Read about it and take timely treatment…", "url": "https://www.hindustantimes.com/lifestyle/health/incompetent-cervix-can-lead-to-premature-birth-or-pregnancy-loss-here-are-its-symptoms-risk-factors-complications-tips-to-prevent-it-101661613056136.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/27/1600x900/pexels-dominika-roseclay-1145997_1661613633318_1661613646039_1661613646039.jpg", "publishedAt": "2022-08-27T15:29:00Z", "content": "Before conceiving, the cervix or the lower part of the uterus that opens to the vagina is closed and firm. As one becomes pregnant, the cervix tends to soften, decreases in length (effaces) and opens… [+2563 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Germany to Distribute 19,500 More Monkeypox Vax Doses - India.com", "description": "There have been 3,405 cases of monkeypox reported in Germany since May. The vaccine Germany has procured is Imvanex and is also used to treat smallpox.", "url": "https://www.india.com/news/world/germany-to-distribute-19500-more-monkeypox-vax-doses-5596718/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/Vaccine-2.jpg", "publishedAt": "2022-08-27T14:44:43Z", "content": "Berlin: The German government is distributing 19,500 more monkeypox vaccine doses across the country next week, the Health Ministry said, as demand continues to outstrip supply in hotspots. Some 40,0… [+1594 chars]"}, {"source": {"id": null, "name": "Upjobsnews.com"}, "author": null, "title": "I Had Monkeypox, and the Physical and Emotional Pain Were Excruciating & More Latest News Here - upjobsnews", "description": "", "url": "https://upjobsnews.com/i-had-monkeypox-and-the-physical-and-emotional-pain-were-excruciating-more-latest-news-here/", "urlToImage": "https://i.insider.com/6307dce7830ed800183fd54a?width=1200&format=jpeg", "publishedAt": "2022-08-27T14:05:48Z", "content": "I spent most of June isolating with COVID-19, a disease I’d managed to avoid until this summer. Frustratingly, as an out gay man, the diagnosis meant spending nearly all of Pride Month by myself, pac… [+8825 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "The #1 Best Vegetable for Gut Health - Eat This, Not That", "description": "Eating plenty of fruits and vegetables can help your gut health significantly. But what is the absolute best vegetable to eat for your gut?", "url": "https://www.eatthis.com/best-vegetable-for-gut-health/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/08/eating-a-salad-2.jpg?quality=82&strip=all", "publishedAt": "2022-08-27T13:01:13Z", "content": "Your daily diet directly impacts your gut health, which can affect many different aspects of your health. But sometimes, it can be difficult to know the best foods to eat for your gut.\r\nAs a baseline… [+2293 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "4 Effective Ways To Manage Low Blood Glucose Levels - India.com", "description": "As per a recent study undertaken by the Indian Council of Medical Research (ICMR), India is home to the world’s second-largest adult diabetes population and every sixth person with diabetes in the world is an Indian.", "url": "https://www.india.com/lifestyle/4-effective-ways-to-manage-low-blood-glucose-levels-diabetes-insulin-5596362/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/QT-diabetes.jpg", "publishedAt": "2022-08-27T12:39:28Z", "content": "Effective Ways To Manage Low Blood Glucose Levels: Diabetes contributes greatly to the health burden of India. As per a recent study undertaken by the Indian Council of Medical Research (ICMR), India… [+4176 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Yoga Asanas for PCOD and PCOS - SHOWSHA", "description": "PCOS and PCOD, a common endocrine disorder with females causes the ovaries to produce an excess of male hormones, resulting in irregular periods, weight gain...", "url": "https://www.youtube.com/watch?v=svHcXepv1d4", "urlToImage": "https://i.ytimg.com/vi/svHcXepv1d4/hqdefault.jpg", "publishedAt": "2022-08-27T12:30:15Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "7 Healthy Snacks For Your Next Road Trip - Daijiworld.com", "description": "By IANSlife\r\nNew Delhi, Aug 27 (IANSlife): Road trips are a relieving getaway from the daily structured routines we often find ourselves engulfed in, an escape to find new paths in our lives as we slowly cruise down the highway and let the heart wander to fin…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=993754", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_270822_food.jpg", "publishedAt": "2022-08-27T10:57:21Z", "content": "By IANSlife\r\nNew Delhi, Aug 27 (IANSlife): Road trips are a relieving getaway from the daily structured routines we often find ourselves engulfed in, an escape to find new paths in our lives as we sl… [+4083 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "High-dose influenza vaccination significantly reduces mortality among elderly: Innovative randomised... - Medical Dialogues", "description": "Researchers have found in an innovative, pragmatic randomised trial that high-dose influenza...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/high-dose-influenza-vaccination-significantly-reduces-mortality-among-elderly-innovative-randomised-trial-98173", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/27/184446-flue.jpg", "publishedAt": "2022-08-27T10:42:57Z", "content": "Researchers have found in an innovative, pragmatic randomised trial that high-dose influenza vaccination among elderly patients significantly reduces morbidity and mortality.\r\nFurther high dose influ… [+6572 chars]"}, {"source": {"id": null, "name": "Youthincmag.com"}, "author": null, "title": "Tattoos & Piercings: Precaution & Safety Over The Trend - Youth Incorporated", "description": "Tattoos & piercings have gained popularity among teens. This has also led to a rise in infections. So what precautions must one take?", "url": "https://youthincmag.com/tattoos-piercings-precaution-safety-over-the-trend", "urlToImage": "https://youthincmag.com/wp-content/uploads/2022/08/pexels-cottonbro-4125582-scaled.jpg", "publishedAt": "2022-08-27T10:33:58Z", "content": "The love for getting inked and pierced has been there since the beginning. Recently, though, this form of beautification has gained popularity, especially among teens. One in four teens today either … [+5077 chars]"}, {"source": {"id": null, "name": "Bollywood Hungama"}, "author": "Bollywood Hungama", "title": "Keto Blast Gummies Reviews SCAM ALERT: Must Read It First Before Buying - Bollywood Hungama", "description": "Keto Blast Gummies Reviews SCAM ALERT: Must Read It First Before Buying. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at Bollywoo…", "url": "https://www.bollywoodhungama.com/news/bollywood/keto-blast-gummies-reviews-scam-alert-must-read-first-buying/", "urlToImage": "https://media2.bollywoodhungama.in/wp-content/uploads/2022/08/Keto-Blast-Gummies-Reviews-SCAM-ALERT-Must-Read-It-First-Before-Buying.jpeg", "publishedAt": "2022-08-27T08:31:03Z", "content": "Keto Blast Gummies Essential Details To Know:\r\nIt's nearly impossible to slim down on your own. What you need are Keto Blast Gummies Advanced formula tablets! The nutrients from these pills will help… [+9917 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Regular Exercise May Reduce Risk Of Covid-19: Study - News18", "description": "Incorporating regular physical activity in weekly routines helps to safeguard against Covid-19", "url": "https://www.news18.com/news/lifestyle/regular-exercise-may-reduce-risk-of-covid-19-study-5822179.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-2-16-166150914916x9.jpg", "publishedAt": "2022-08-27T07:46:18Z", "content": "While it is not surprising to know the health benefits of being physically active and regular exercising, a new study shows that it can also reduce chances of getting severely infected from the Covid… [+1868 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "High Cholesterol: 4 daily exercises to lower bad cholesterol in your body - DNA India", "description": "Here are some daily exercises that can be done to lower bad cholesterol.", "url": "https://www.dnaindia.com/lifestyle/photo-gallery-high-cholesterol-4-daily-exercises-to-lower-bad-cholesterol-in-your-body-2980001", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/27/2533633-untitled-design-34.jpg", "publishedAt": "2022-08-27T07:38:00Z", "content": "Swimming is most likely the aerobic activity that will protect your joints the best. In a study, experts compared swimming to walking for women between the ages of 50 and 70. They discovered that swi… [+533 chars]"}, {"source": {"id": null, "name": "Upjobsnews.com"}, "author": null, "title": "Recently Discovered Molecule Kills Hard-To-Treat Cancers & More Latest News Here - upjobsnews", "description": "", "url": "https://upjobsnews.com/recently-discovered-molecule-kills-hard-to-treat-cancers-more-latest-news-here/", "urlToImage": "https://scitechdaily.com/images/Lymphocytes-Attacking-Cancer-Cell.jpg", "publishedAt": "2022-08-27T07:26:02Z", "content": "The study was carried out in isolated cells, in human cancer tissue, and in human cancers grown in mice.\r\nThe new compound called ERX-41 kills a broad spectrum of hard-to-treat cancers.\r\nA new molecu… [+7032 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Monkeypox: Three of Five Cases in Delhi Show History of Heterosexual Contact; Two Have No Records of Sexual Activity - The Weather Channel", "description": "The report has further revealed that the cases did not report international travel history in the last month from the date of onset of symptoms. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/health/news/2022-08-27-three-monkeypox-cases-in-delhi-show-history-of-heterosexual-contact", "urlToImage": "https://s.w-x.co/in-monkeypox%282%29.jpg", "publishedAt": "2022-08-27T07:20:50Z", "content": "Out of the five confirmed cases of monkeypox in the national capital, three had a history of heterosexual contact within 21 days of onset of symptoms, while two others had no sexual contact at all, r… [+2677 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Is Monkeypox Severe In Children? Here is What Parents Should Know - News18", "description": "The higher-level complication and severity of monkeypox in children have been red-flagged not just by WHO but by several other organisations as well", "url": "https://www.news18.com/news/lifestyle/is-monkeypox-severe-in-children-here-is-what-parents-should-know-5824591.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/1024-x-576-4-1-165330627316x9.jpg", "publishedAt": "2022-08-27T07:20:34Z", "content": "The World Health Organization (WHO) declared monkeypox a public health emergency of international concern on July 24. More than 43,000 cases of monkeypox have been reported from 92 countries since Ma… [+1956 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What is the West Nile Virus? | The Hindu - The Hindu", "description": "At a time when the world is fighting a Monkeypox outbreak and the Covid-19 pandemic, a new virus is causing panic in New York City The West Nile virus has be...", "url": "https://www.youtube.com/watch?v=_2Z6URO2Bx8", "urlToImage": "https://i.ytimg.com/vi/_2Z6URO2Bx8/hqdefault.jpg", "publishedAt": "2022-08-27T07:00:17Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Artificial Intelligence: Path-breaking revolution in Indian Healthcare System - ETHealthWorld", "description": "In the form of machine learning, AI has the capability for the development of precision medicine, which is the future of advanced care. Although early efforts at providing diagnosis and treatment recommendations have proven challenging AI will ultimately mast…", "url": "https://health.economictimes.indiatimes.com/news/health-it/artificial-intelligence-path-breaking-revolution-in-indian-healthcare-system/93813886", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93813886,imgsize-159690,width-1200,height-628,overlay-ethealthworld/artificial-intelligence-path-breaking-revolution-in-indian-healthcare-system.jpg", "publishedAt": "2022-08-27T06:50:00Z", "content": "by Dr Varun GargThe use of Artificial intelligence (AI) is progressively increasing in business and society as a whole and is beginning to be applied to the healthcare sector as well. AI has the pote… [+4520 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Half of the mothers of autistic children suffer from depression: Study - Hindustan Times", "description": "Regardless of ASD status, the researchers discovered that child behaviour problems predicted higher levels of maternal depression in the future. However, they did not observe an inverse effect; prior maternal depression did not predict later child behaviour p…", "url": "https://www.hindustantimes.com/lifestyle/health/half-of-the-mothers-of-autistic-children-suffer-from-depression-study-101661581888940.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/27/1600x900/_9f8cedf6-36da-11eb-a00e-2cd7664e001b_1661581953685_1661581953685.jpg", "publishedAt": "2022-08-27T06:35:07Z", "content": "According to a recent survey conducted over a period of 18 months, approximately 50% of all mothers of children with autism spectrum disorder (ASD) had elevated levels of depressive symptoms, while r… [+5624 chars]"}, {"source": {"id": null, "name": "Theweeklymail.com"}, "author": "Staff Editor", "title": "As soon as you see these symptoms, the lovers of alcohol understand that the liver is completely damaged. - The Weekly Mail", "description": "Liver is a very important part of our body. The liver performs many functions in the body such as breaking down drugs, alcohol and toxins, producing bile and storing glucose. But liver damage starts due to many things. One of the main reasons for liver damage…", "url": "https://theweeklymail.com/as-soon-as-you-see-these-symptoms-the-lovers-of-alcohol-understand-that-the-liver-is-completely-damaged", "urlToImage": "https://theweeklymail.com/uploads/images/202208/image_750x500_6309aeda8a956.jpg", "publishedAt": "2022-08-27T05:50:04Z", "content": "The liver is an organ located on the upper side of the abdomen. Which is inside your ribs. The liver performs many functions in the body such as breaking down drugs, alcohol and toxic substances, pro… [+5379 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Vaamanaa Sethi", "title": "An Italian man gets Covid-19, monkeypox and HIV at the same time – here’s what doctors say about co-infections - Business Insider India", "description": "The Italian man’s case is unique, say experts, as he developed all the symptoms of three diseases. Doctors say that people of any age group can be co-infected", "url": "https://www.businessinsider.in/science/health/news/an-italian-man-gets-covid-19-monkeypox-and-hiv-at-the-same-time-heres-what-doctors-say-about-co-infections/articleshow/93804451.cms", "urlToImage": "https://www.businessinsider.in/photo/93804451/an-italian-man-gets-covid-19-monkeypox-and-hiv-at-the-same-time-heres-what-doctors-say-about-co-infections.jpg?imgsize=23158", "publishedAt": "2022-08-27T04:30:00Z", "content": "After a 36-year-old man in Italy was diagnosed with Covid-19, monkeypox\r\n and HIV\r\n — all at once, concerns of co-infections have gone up, across the world.\r\nThe Italian man’s case is unique say expe… [+3443 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Epidemiological Update: Monkeypox in women - 26 August 2022 - Argentina - ReliefWeb", "description": "Situation Report in English on Argentina and 28 other countries about Health and Epidemic; published on 26 Aug 2022 by PAHO and WHO", "url": "https://reliefweb.int/report/argentina/epidemiological-update-monkeypox-women-26-august-2022", "urlToImage": "https://reliefweb.int/sites/default/files/styles/large/public/previews/63/ef/63efb6e8-1aed-490d-b2af-de89fea37e7f.png", "publishedAt": "2022-08-27T04:23:40Z", "content": "Global situation summary\r\nBetween 1 January and 25 August 2022, a total of 46,048 confirmed cases, including 15 deaths, were reported from 99 Member States in all 6 World Health Organization (WHO) Re… [+2179 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Rachael Zimlich, RN, BSN", "title": "Rheumatoid Arthritis and Heart Failure: Risks, Symptoms, More - Healthline", "description": "Rheumatoid arthritis increases your risk of heart disease and heart failure. Learn more about reducing your risk and preventing cardiac complications.", "url": "https://www.healthline.com/health/rheumatoid-arthritis/rheumatoid-arthritis-heart-failure", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/04/Senior-woman-sitting-while-measuring-her-blood-header-1200x628.jpg", "publishedAt": "2022-08-27T01:53:04Z", "content": "Rheumatoid arthritis (RA) is an autoimmune condition that happens when your immune system mistakenly attacks your bodys own tissues, causing inflammation. The inflammation primarily affects your join… [+4813 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Jocelyn Solis-Moreira", "title": "Premature menopause could trigger serious heart problems for younger women - Study Finds", "description": "Researchers warn that the risk of heart failure went up as the age of menopause onset went down.", "url": "https://studyfinds.org/premature-menopause-heart-problems/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2021/08/AdobeStock_123848498-scaled.jpeg", "publishedAt": "2022-08-26T22:18:43Z", "content": "SOPHIA ANTIPOLIS, France — Experiencing menopause before turning 40 may significantly increase the risk of dying from heart disease among women. A new study from Korea involving 1.4 million women fou… [+3632 chars]"}, {"source": {"id": null, "name": "Stanford.edu"}, "author": null, "title": "Disrupting viral packaging may be key to pandemic preparedness, Stanford researchers find - Stanford Medical Center Report", "description": "Disrupting a virus’s genome packaging can halt replication and jumpstart a natural immune response against subsequent exposures, a Stanford Medicine study finds.", "url": "https://med.stanford.edu/news/all-news/2022/08/viral-packaging-antiviral.html", "urlToImage": "http://med.stanford.edu/content/dam/sm-news/images/2022/08/Glenn-antiviral-art.index.jpg", "publishedAt": "2022-08-26T19:51:43Z", "content": "Glenn and Hagey wondered if antiviral drugs targeting more mundane, but equally important, steps in the viral life cycle could stop or slow infections genome packaging, for example. After all, packin… [+6295 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": "Tushar Kaushik", "title": "Dietary changes can lead to diabetes remission: ICMR study - Deccan Chronicle", "description": "The majority of Indians' diets consist of 65 to 70 per cent carbohydrates and little protein", "url": "https://www.deccanchronicle.com/nation/current-affairs/270822/dietary-changes-can-lead-to-diabetes-remission-icmr-study.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-94jctlgusa2far3oj8kd40h3s6-20220712213237.Medi.jpeg", "publishedAt": "2022-08-26T18:35:00Z", "content": "HYDERABAD: A recent national study funded by the Indian Council of Medical Research (ICMR) that included responses from 18,090 adults found that making minor dietary changes can result in diabetes re… [+2918 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Yash Lakhan", "title": "Incredible Drinks To Say Goodbye To Belly Fat - Slurrp", "description": "Belly fat is like an uninvited guest that arrives unannounced and refuses to leave.", "url": "https://www.slurrp.com/article/incredible-drinks-to-say-goodbye-to-belly-fat-1661538090627", "urlToImage": "https://images.slurrp.com/prod/articles/o8ux5dpah3j.webp", "publishedAt": "2022-08-26T18:30:05Z", "content": "Belly fat is like an uninvited guest that arrives unannounced and refuses to leave. If you think you're tough and focused, remember this: there's something tougher than you and all of us. It's the st… [+3465 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Yuri Maricich, MD, MBA", "title": "The Potential of Digital Therapeutics and Cognitive Behavioral Therapy for Insomnia: Yuri Maricich, MD, MBA - Neurology Live", "description": "The internal medicine physician, and chief medical officer and head of development at Pear Therapeutics discussed the findings of a recent study assessing cognitive behavioral therapy for insomnia. [WATCH TIME: 4 minutes]", "url": "https://www.neurologylive.com/view/potential-digital-therapeutics-cognitive-behavioral-therapy-insomnia-yuri-maricich", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/d920d78e02401c06330e80b9b87ae66918a5e2d1-1034x580.png?fit=crop&auto=format", "publishedAt": "2022-08-26T17:25:20Z", "content": "WATCH TIME: 4 minutes\r\nTheres been a lot of work looking at the importance ofand what is addressed in the clinical guidelinescognitive behavioral therapy for insomnia, but unfortunately, the vast maj… [+2368 chars]"}, {"source": {"id": null, "name": "Harlemworldmagazine.com"}, "author": "Harlem World Magazine", "title": "Signs Of Chronic Dehydration: Causes And Treatments - Harlem World Magazine", "description": "The human body needs water to function. It plays a role in regulating many functions, such as regulating temperature and the flow of nutrients. When you", "url": "https://www.harlemworldmagazine.com/signs-of-chronic-dehydration-causes-and-treatments/", "urlToImage": "http://www.harlemworldmagazine.com/wp-content/uploads/2022/08/water-man-health-961.jpg", "publishedAt": "2022-08-26T17:17:26Z", "content": "The human body needs water to function. It plays a role in regulating many functions, such as regulating temperature and the flow of nutrients. \r\nWhen you breathe, sweat, urinate or defecate, you los… [+4657 chars]"}, {"source": {"id": null, "name": "Contentmediasolution.com"}, "author": null, "title": "DeepTek’s AI powered solutions accelerates Mongolia's fight against TB - Content Media Solution", "description": "As per the studies by WHO, Mongolia is one of the countries with the highest", "url": "https://contentmediasolution.com/business/deepteks-ai-powered-solutions-accelerates-mongolias-fight-against-tb/", "urlToImage": "https://contentmediasolution.com/wp-content/uploads/2021/05/cropped-website_logo_transparent_background.png", "publishedAt": "2022-08-26T16:09:20Z", "content": "As per the studies by WHO, Mongolia is one of the countries with the highest TB prevalence, with around 4000 TB cases reported yearly. In 2020, the tuberculosis death rate in Mongolia was 9.8 cases p… [+3174 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Catherine Crider", "title": "Hypertension and Kidney Disease: Top 10 Signs and Symptoms - Healthline", "description": "You can experience a range of unpleasant symptoms if you have high blood pressure and kidney disease. If you believe that you are showing signs of hypertension or kidney disease you should speak to your doctor right away to begin treatment.", "url": "https://www.healthline.com/health/hypertension-and-kidney-disease-ten-signs", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/06/male-lower-back-pain-732-549-feature-thumb.jpg", "publishedAt": "2022-08-26T15:28:59Z", "content": "Nearly 50%\r\n of U.S. adults have high blood pressure, or hypertension. More than 1 in 7\r\n have chronic kidney disease. With such high percentages, its likely you or someone you know has one or both o… [+4950 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Earlier Is Better: Treat Patients Before Type 2 Diabetes Develops - Medscape", "description": "Ralph DeFronzo, MD, discusses treating type 2 diabetes early and using drugs to correct the pathophysiologic disturbances associated with it.", "url": "https://www.medscape.com/viewarticle/977614", "urlToImage": "https://img.medscape.com/thumbnail_library/977614.jpg", "publishedAt": "2022-08-26T13:45:23Z", "content": "This transcript has been edited for clarity.\r\nOne of the major problems we have to deal with in terms of the treatment of type 2 diabetes is to recognize that it's a very complicated disease with at … [+3820 chars]"}, {"source": {"id": null, "name": "Case.edu"}, "author": "Aambar Agarwal", "title": "It's time to reevaluate personal hygiene – The Observer - The Observer", "description": "On May 7, the first monkeypox case of 2022 outside of Central and West Africa was recorded. At the time, the World Health Organization (WHO) stressed that the risk of onward transmission was small, suggesting the insignificance of that case to the world. Yet,…", "url": "https://observer.case.edu/its-time-to-reevaluate-personal-hygiene/", "urlToImage": "https://observer.case.edu/wp-content/uploads/2017/09/image1.jpg", "publishedAt": "2022-08-26T13:14:00Z", "content": "On May 7, the first monkeypox case of 2022 outside of Central and West Africa was recorded. At the time, the World Health Organization (WHO) stressed that the risk of onward transmission was small, s… [+4398 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Strides' Kenya-based unit gets WHO nod to produce antimalarial drug - ETHealthWorld", "description": "UCL's achieved pre-qualification with funding from global health agency Unitaid and support from Universal Corporation (MMV). Pre-qualification is a service provided by WHO to assess the quality, safety and efficacy of medicinal products.", "url": "https://health.economictimes.indiatimes.com/news/pharma/strides-kenya-based-unit-gets-who-nod-to-produce-antimalarial-drug/93802666", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93802666,imgsize-106198,width-1200,height-628,overlay-ethealthworld/strides-kenya-based-unit-gets-who-nod-to-produce-antimalarial-drug.jpg", "publishedAt": "2022-08-26T12:45:00Z", "content": "New Delhi: Strides Pharma Science on Friday said its Kenya-based unit has received a certification from the World Health Organisation (WHO) to produce a antimalarial drug to prevent infection in preg… [+1794 chars]"}, {"source": {"id": null, "name": "Whyquit.com"}, "author": null, "title": "Use tobacco, smoke or vape? Test your cancer IQ. - WhyQuit", "description": "When it comes to cancer, how risky is tobacco use?", "url": "https://whyquit.com/pr/082622-test-your-cancer-iq.html", "urlToImage": null, "publishedAt": "2022-08-26T12:04:21Z", "content": "1. True or False: Among 4.5 million worldwide 2019 cancer deaths, the leading cancer risk factor for both males and females was tobacco use.\r\nTrue. An August 2022 Lancet study\r\n analyzed risk factors… [+6290 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "Hard-to-treat depression: Stimulating 'reward' brain area helps - Medical News Today", "description": "New research has found that applying deep brain stimulation to the brain's reward and motivation center can improve treatment-resistant depression.", "url": "https://www.medicalnewstoday.com/articles/stimulation-of-brains-reward-center-can-help-with-treatment-resistant-depression", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/08/brain_stimulation_GettyImages973766374_Thumb.jpg", "publishedAt": "2022-08-26T10:56:08Z", "content": "<ul><li>About 30% of people with major depressive disorder (MDD) develop treatment-resistant depression. </li><li>Researchers from UTHealth Houston say deep brain stimulation applied to certain areas… [+6214 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Sex Pills for Men: Best Sexual Enhancement Pills in 2022 - Deccan Herald", "description": "Are you having any sort of issues regarding sex? Then this will be the right article for you where you will get to know about the best top ranking and safe sexual enhancement pills for men on the online market. When you look at all the activities which are go…", "url": "https://www.deccanherald.com/brandspot/pr-spot/sex-pills-for-men-best-sexual-enhancement-pills-in-2022-1139519.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/1_60.png", "publishedAt": "2022-08-26T09:39:22Z", "content": "Are you having any sort of issues regarding sex? Then this will be the right article for you where you will get to know about the best top ranking and safe sexual enhancement pills for men on the onl… [+33237 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "New generation of Covid vax shows promising results - Punjab News Express", "description": "<p><strong>STOCKHOLM:</strong>&nbsp;A team of researchers is developing a coronavirus vaccine designed to be less sensitive to mutations and will likely be equipped for future strains.</p>", "url": "https://www.punjabnewsexpress.com/technology/news/new-generation-of-covid-vax-shows-promising-results-179429", "urlToImage": "https://www.punjabnewsexpress.com/images/article/article179429.jpg", "publishedAt": "2022-08-26T09:33:45Z", "content": "STOCKHOLM: A team of researchers is developing a coronavirus vaccine designed to be less sensitive to mutations and will likely be equipped for future strains.\r\nAs per a study, published in the journ… [+1802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "When should I get tested if I have viral fever? What is the fastest way to recover from viral flu? - The Indian Express", "description": "‘Antipyretics are the safest bet. Just take Paracetamol and relax. There is no need to take any antibiotics because these are all viral illnesses. A five-day dose of Vitamin C doesn’t do much. There is no need for any of it,’ says Dr Atul Gogia, Internal Medi…", "url": "https://indianexpress.com/article/lifestyle/health-specials/when-should-test-viral-fever-covid-viral-flu-8113012/", "urlToImage": "https://images.indianexpress.com/2022/08/Untitled-design-73.png", "publishedAt": "2022-08-26T09:18:27Z", "content": "Several cities are reporting cases of not just Covid-19 but other viral fevers such as seasonal flu (H1N1) and dengue. In fact, with overlapping symptoms and sometimes simultaneous cases, people are … [+4552 chars]"}, {"source": {"id": null, "name": "Vashonbeachcomber.com"}, "author": "Wire Service", "title": "Nerve Control 911 Reviews - Negative Side Effects Risk to Worry About? | Vashon-Maury Island Beachcomber - Vashon-Maury Island Beachcomber", "description": "<p>What is the nervous system? What functions does it perform in your body? These questions would look familiar to you as we all have studied this system in school.</p>", "url": "https://www.vashonbeachcomber.com/marketplace/nerve-control-911-reviews-negative-side-effects-risk-to-worry-about/", "urlToImage": "https://www.vashonbeachcomber.com/wp-content/uploads/2022/08/30203227_web1_M1-VIB-20220826Nerve-Control-911-Teaser.jpg", "publishedAt": "2022-08-26T08:30:00Z", "content": "What is the nervous system? What functions does it perform in your body? These questions would look familiar to you as we all have studied this system in school.\r\nThe central nervous system consists … [+20360 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Bhagyashree", "title": "Now heart attack coming at the age of 40, if you want to avoid then get TMT test done - News Day Express", "description": "Heart Attack The risk is increasing rapidly. Now only the elderly, weak or sick people are at risk of heart attack, but healthy and young people are also", "url": "https://www.newsdayexpress.com/lifestyle/health/now-heart-attack-coming-at-the-age-of-40-if-you-want-to-avoid-then-get-tmt-test-done/", "urlToImage": "https://static.langimg.com/thumb/msid-93796571,width-680,resizemode-3/40--93796571.jpg", "publishedAt": "2022-08-26T08:23:10Z", "content": "Heart Attack The risk is increasing rapidly. Now only the elderly, weak or sick people are at risk of heart attack, but healthy and young people are also succumbing to it. recently ‘Bhabhi ji is at h… [+2764 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Differentiating between COVID, influenza and allergy; key to effective treatment: Health experts - ETHealthWorld", "description": "Health experts recommend the high-risk population to take an anti-influenza vaccine to avoid severe complications. Those suffering from post-viral fatigue syndrome and chronic fatigue syndrome must focus on hydration and seek adequate treatment for the same.", "url": "https://health.economictimes.indiatimes.com/news/industry/differentiating-between-covid-influenza-and-allergy-key-to-effective-treatment-health-experts/93795145", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93795145,imgsize-1268837,width-1200,height-628,overlay-ethealthworld/differentiating-between-covid-influenza-and-allergy-key-to-effective-treatment-health-experts.jpg", "publishedAt": "2022-08-26T07:21:00Z", "content": "New Delhi: In order to differentiate between COVID, influenza and allergy, the health experts recommend the high-risk population to take an anti-influenza vaccine to avoid severe complications. Advis… [+1655 chars]"}, {"source": {"id": null, "name": "Diagnostic and Interventional Cardiology"}, "author": "milla1cf", "title": "COVID mRNA vaccines are Safe in Patients with Heart Failure - Diagnostic and Interventional Cardiology", "description": "August 26, 2022 — COVID mRNA vaccines are associated with a decreased risk of death in patients with heart failure, according to research presented at ESC Congress 2022. The study also found that the vaccines were not associated with an increased risk of wors…", "url": "https://www.dicardiology.com/content/covid-mrna-vaccines-are-safe-patients-heart-failure", "urlToImage": "http://www.dicardiology.com/sites/default/files/GettyImages-1306165716.jpg", "publishedAt": "2022-08-26T07:00:00Z", "content": "August 26, 2022  COVID mRNA vaccines are associated with a decreased risk of death in patients with heart failure, according to research presented at ESC Congress 2022. The study also found that the … [+3985 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Pelvic pain: Causes, symptoms, tests required, treatment - Hindustan Times", "description": "Pelvic pain is a common problem that affects women more than men. If you are experiencing pelvic discomfort, do not suffer in silence. Here's all you need to know about its causes, symptoms, tests required and treatment | Health", "url": "https://www.hindustantimes.com/lifestyle/health/pelvic-pain-causes-symptoms-tests-required-treatment-101661492397165.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/26/1600x900/FayLlP3WIAAONgS_1661495263696_1661495280001_1661495280001.jpg", "publishedAt": "2022-08-26T06:38:54Z", "content": "Living with pelvic discomfort can be extremely challenging and stressful as long-term chronic pelvic pain sufferers frequently struggle with depression, anxiety and sleep issues. Therefore, it is adv… [+3635 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Trend tracker: Popular probiotics research, women's health, and Korea data revealed - NutraIngredients-Asia", "description": "This round-up looks at the popular research surrounding probiotics and its functions, how Kirin is seeing potential in the women’s health sector, and South Korea’s health functional foods production trends.", "url": "https://www.nutraingredients-asia.com/Article/2022/08/26/Popular-probiotics-research-women-s-health-Korea-data-revealed-in-trends-round-up", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/article/2022/08/26/popular-probiotics-research-women-s-health-korea-data-revealed-in-trends-round-up/15714513-1-eng-GB/Popular-probiotics-research-women-s-health-Korea-data-revealed-in-trends-round-up.jpg", "publishedAt": "2022-08-26T06:05:00Z", "content": "Kirin has invested in local womens health brand Wray through its innovation fund aimed at supporting start-ups with innovative and unique technologies.\r\nThe firm is investing in womens health because… [+1430 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Queen's University Belfast: New discovery on how antibiotic resistant microbes protect themselves from attack of body’s defences - India Education Diary", "description": "Klebsiella pneumoniae can cause deadly infections such as pneumonia, wound or bloodstream infections, that are becoming untreatable due to the lack of effective antibiotics due to antibiotic resistance (AMR).AMR is a major global health threat, accou", "url": "https://indiaeducationdiary.in/queens-university-belfast-new-discovery-on-how-antibiotic-resistant-microbes-protect-themselves-from-attack-of-bodys-defences/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/Queens-University-Belfast.jpg?fit=1024%2C491&ssl=1", "publishedAt": "2022-08-26T06:04:57Z", "content": "Klebsiella pneumoniae can cause deadly infections such as pneumonia, wound or bloodstream infections, that are becoming untreatable due to the lack of effective antibiotics due to antibiotic resistan… [+3623 chars]"}]}