{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Mumbai sees three-fold rise in measles - mid-day.com", "description": "From 37 cases in 2019, the city’s measles count has reached 109 this year; Centre’s team lands in Mumbai, to visit Govandi today to review situation", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/mumbai-sees-three-fold-rise-in-measles-23255125", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Govandi-vaccine_d.jpg", "publishedAt": "2022-11-12T01:55:00Z", "content": "From 37 cases in 2019, the citys measles count has reached 109 this year; Centres team lands in Mumbai, to visit Govandi today to review situation\r\nBMC health officials screen children in Govandi on … [+2471 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Well-equipped gut-friendly bacteria hold promise for improving IBD treatments - News-Medical.Net", "description": "Like elite firefighters headed into the wilderness to combat an uncontrolled blaze, probiotic bacteria do a better job quelling gut inflammation when they're equipped with the best gear.", "url": "https://www.news-medical.net/news/20221111/Well-equipped-gut-friendly-bacteria-hold-promise-for-improving-IBD-treatments.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/9/Digital_composite_of_highlighted_red_painful_intestine_of_woman__health_care_%26__-_mi_viri_M1_e6797484d65c4349af727c0f40f1116a-620x480.jpg", "publishedAt": "2022-11-12T01:32:00Z", "content": "Like elite firefighters headed into the wilderness to combat an uncontrolled blaze, probiotic bacteria do a better job quelling gut inflammation when they're equipped with the best gear.\r\nA new study… [+3983 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Anonymous", "title": "Living with paranoid schizophrenia - Deccan Herald", "description": "As tears rolled down my face, my husband asked, “Should I love you like a poodle?” I hoped he would urge me to stay and reassure me that everything was fine and that he loved me and our five-year-old daughter. I was being sent to my mother’s house without my …", "url": "https://www.deccanherald.com/special-features/living-with-paranoid-schizophrenia-1161511.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/12/schizo-1161511-1668216592.jpg", "publishedAt": "2022-11-12T01:29:52Z", "content": "As tears rolled down my face, my husband asked, Should I love you like a poodle? I hoped he would urge me to stay and reassure me that everything was fine and that he loved me and our five-year-old d… [+12500 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals change in symptoms before and after start of dialysis in older patients with kidney failure - News-Medical.Net", "description": "In a study published in CJASN that included older adults with kidney failure, symptoms related to their condition worsened in the year before patients started dialysis but stabilized after dialysis initiation.", "url": "https://www.news-medical.net/news/20221111/Study-reveals-change-in-symptoms-before-and-after-start-of-dialysis-in-older-patients-with-kidney-failure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Dialysis-620x480.jpg", "publishedAt": "2022-11-12T00:28:00Z", "content": "In a study published in CJASN that included older adults with kidney failure, symptoms related to their condition worsened in the year before patients started dialysis but stabilized after dialysis i… [+2361 chars]"}, {"source": {"id": null, "name": "Hepmag.com"}, "author": null, "title": "Poor-Quality Sleep Linked to Fatty Liver Disease - Hep Treatment News", "description": "People with a tendency to be active later in the day may be at greater risk for severe NAFLD.", "url": "https://www.hepmag.com/article/poorquality-sleep-linked-fatty-liver-disease", "urlToImage": "https://cdn3.poz.com/131400_iStock-1257145596.jpg_79033219-89dd-4297-b6a6-d6110c6ae8f4_x2.jpg", "publishedAt": "2022-11-11T23:59:41Z", "content": "Disturbed nighttime sleep, daytime napping and snoring are associated with an increased risk of metabolic-associated fatty liver disease (MAFLD), according to research published in the Journal of Cli… [+5153 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Joanne Lewsley", "title": "Seven benefits of vitamin D - Livescience.com", "description": "Discover all the important benefits of vitamin D, from building strong bones and teeth to improving your mental wellbeing", "url": "https://www.livescience.com/benefits-of-vitamin-d", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6A9LKwtHi3b97V3TNhjHCJ-1200-80.jpg", "publishedAt": "2022-11-11T21:00:37Z", "content": "The benefits of vitamin D have long been reported, but are you getting enough of this nutrient in your everyday diet for optimal health and wellbeing? Whether you opt for a daily dose of sunshine, a … [+7334 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Alzheimer's disease can be diagnosed before symptoms emerge - EurekAlert", "description": "A large study led by Lund University in Sweden has shown that people with Alzheimer's disease can now be identified before they experience any symptoms. It is now also possible to predict who will deteriorate within the next few years. The study is published …", "url": "https://www.eurekalert.org/news-releases/971054", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-11T20:09:55Z", "content": "A large study led by Lund University in Sweden has shown that people with Alzheimer's disease can now be identified before they experience any symptoms. It is now also possible to predict who will de… [+3363 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Mohit Khanna", "title": "Ludhiana: Amid rise in stubble burning cases, DMCH sees 15% more heart patients in past month - Hindustan Times", "description": "The number of heart patients visiting out-patient departments and admitted to emergency wards of Dayanand Medical College and Hospital (DMCH) in Ludhiana has increased by 15% since the first week of October, when the number of stubble burning cases started ri…", "url": "https://www.hindustantimes.com/cities/chandigarh-news/ludhiana-amid-rise-in-stubble-burning-cases-dmch-sees-15-more-heart-patients-in-past-month-101668197001075.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/b2830d70-61fb-11ed-a886-4f0eae2e705f_1668196999907.jpg", "publishedAt": "2022-11-11T20:03:20Z", "content": "The number of heart patients visiting out-patient departments and admitted to emergency wards of Dayanand Medical College and Hospital (DMCH) has increased by 15% since the first week of October, whe… [+1345 chars]"}, {"source": {"id": null, "name": "Umn.edu"}, "author": null, "title": "Long recovery, brain damage, effect of stressors with long COVID - CIDRAP", "description": "Two of the 4 new studies show that SARS-CoV-2 can profoundly damage the brain for months.", "url": "https://www.cidrap.umn.edu/news-perspective/2022/11/long-recovery-brain-damage-effect-stressors-long-covid", "urlToImage": "https://www.cidrap.umn.edu/sites/default/files/styles/thumbnail/public/images/news/tired_woman_at_train_window-frerieke.jpg?itok=c_NfKe1I", "publishedAt": "2022-11-11T19:59:32Z", "content": "Four new long-COVID studies reveal that 10% of French patients infected early in the pandemic still had symptoms 1 year later, SARS-CoV-2 can profoundly damage the brain for months, and very stressfu… [+5792 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Linah Baliga", "title": "61 dengue cases reported in first six days of November - Hindustan Times", "description": "The BMC sends teams to the spots where dengue cases are reported and takes immediate remedial measures, fumigating the entire area and looking for the Aedes vector to destroy it. | Mumbai news", "url": "https://www.hindustantimes.com/cities/mumbai-news/61-dengue-cases-reported-in-first-six-days-of-november-101668195203126.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/7cab4f40-61f7-11ed-bcc6-92f852aad067_1668195202116.jpg", "publishedAt": "2022-11-11T19:33:22Z", "content": "Mumbai: Sixty-one cases of dengue have been reported in the first six days of November according to the data provided by the Brihanmumbai Municipal Corporations (BMC) public health department. H (Wes… [+2572 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "How we experience the pain of other people? - EurekAlert", "description": "A new study from the Netherlands Institute for Neuroscience recorded from neurons of human patients to show that the pain of others is directly mapped onto neurons in the insula – a brain region critical for our own emotions.", "url": "https://www.eurekalert.org/news-releases/971090", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-11T19:10:07Z", "content": "A new study from the Netherlands Institute for Neuroscience recorded from neurons of human patients to show that the pain of others is directly mapped onto neurons in the insula – a brain region crit… [+7932 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "'Repeat Covid infections may increase risk of organ failure' - Daily Pioneer", "description": "Limiting exposure to the virus is especially important with new variants emerging, mutating and already causing an upswing in infections in some parts of the world, a study has said warning that repeat infections with the SARS-CoV-2 virus may increase the ris…", "url": "https://www.dailypioneer.com/2022/india/---repeat-covid-infections-may-increase-risk-of-organ-failure---.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-11-11T18:30:53Z", "content": "Limiting exposure to the virus is especially important with new variants emerging, mutating and already causing an upswing in infections in some parts of the world, a study has said warning that repe… [+1955 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Corrie Pelc", "title": "Lab-grown blood: What is it, and how could it be useful? - Medical News Today", "description": "A new trial from the United Kingdom investigates the use of laboratory-grown blood in transfusions in humans. The research may help those with certain blood disorders.", "url": "https://www.medicalnewstoday.com/articles/researchers-are-trialing-lab-grown-blood-transfusions-what-to-know", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/11/laboratory_blood_GettyImages1243720642_Thumb.jpg", "publishedAt": "2022-11-11T17:20:11Z", "content": "<ul><li>Blood plays a vital role in the health of the body, however, some people have blood disorders that cause blood not to act as it should. </li><li>A team of researchers led by the National Heal… [+7961 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "World Pneumonia Day: 9 must-have foods during pneumonia for a speedy recovery - Recipes", "description": "World Pneumonia Day (November 12) is an annual global forum for the fight against pneumonia. As per statistics and experts, it is a preventable and treatable disease that sickens 155 million children under the age of 5 and kills 1.6 million each year. All one…", "url": "https://recipes.timesofindia.com/web-stories/world-pneumonia-day-9-must-have-foods-during-pneumonia-for-a-speedy-recovery/photostory/95452961.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-95452975,width-900,height-1200,resizemode-6.cms", "publishedAt": "2022-11-11T16:39:53Z", "content": "World Pneumonia Day (November 12) is an annual global forum for the fight against pneumonia. As per statistics and experts, it is a preventable and treatable disease that sickens 155 million children… [+216 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Altered cell behavior behind resistance in neuroblastoma - Medical Xpress", "description": "Researchers at Lund University in Sweden have identified one of the reasons why the childhood cancer neuroblastoma becomes resistant to chemotherapy. The findings are significant for how future treatments should be designed. The results have been published in…", "url": "https://medicalxpress.com/news/2022-11-cell-behavior-resistance-neuroblastoma.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/altered-cell-behaviour.jpg", "publishedAt": "2022-11-11T16:09:22Z", "content": "Researchers at Lund University in Sweden have identified one of the reasons why the childhood cancer neuroblastoma becomes resistant to chemotherapy. The findings are significant for how future treat… [+2826 chars]"}, {"source": {"id": null, "name": "Mdanderson.org"}, "author": "Cynthia DeMarco", "title": "Cervical cancer symptoms: What to look for and when to see a doctor - MD Anderson Cancer Center", "description": "What are the symptoms of cervical cancer? Three patients share what they experienced, and gynecologic cancer surgeon Jolyn Sharpe Taylor, M.D., weighs in on when to see a doctor.", "url": "https://www.mdanderson.org/cancerwise/cervical-cancer-symptoms--what-to-look-for-and-when-to-see-a-doctor.h00-159544479.html", "urlToImage": "https://www.mdanderson.org/cancerwise/2022/11/cervical-cancer-symptoms--what-to-look-for-and-when-to-see-a-doctor/jcr:content/blog/adaptiveimage.resize.702.404.jpg", "publishedAt": "2022-11-11T16:07:30Z", "content": "Like many women diagnosed with cervical cancer\r\n, Linda Ryan\r\n didnt initially have any symptoms\r\n. So, she didnt know she had the disease until a routine Pap test came back abnormal\r\n after a well-w… [+4013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Need appropriate steps to ensure Indian scientists are worthy of a Nobel Prize: Dr Himmatrao Bawaskar - The Indian Express", "description": "The expert in a letter titled, ‘Nomination for Nobel Prizes: Is it possible for Indian Scientists' published online on The Lancet on Friday said, \"Research productivities of India’s research institutes should be monitored closely.\"", "url": "https://indianexpress.com/article/cities/pune/science-free-corruption-political-administrative-interference-himmatrao-bawaskar-8263193/", "urlToImage": "https://images.indianexpress.com/2022/01/Himmatrao-Bawaskar.jpg", "publishedAt": "2022-11-11T15:55:11Z", "content": "Known for his research on path-breaking treatment for scorpion stings, Padma Shri awardee Dr Himmatrao Bawaskar in a letter to the editor published in The Lancet on Friday said that science should be… [+2786 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "COVID vaccines: “We flew the aeroplane while we were still building it” - Nature.com", "description": "Recently retired head of vaccine R&D at Pfizer, Kathrin Jansen, discusses the lightning speed development of SARS-CoV-2 vaccines — and the implications for vaccine platforms.", "url": "https://www.nature.com/articles/d41573-022-00191-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41573-022-00191-2/d41573-022-00191-2_23701468.jpg", "publishedAt": "2022-11-11T15:50:55Z", "content": "Credit: Pfizer\r\nThe unique power of vaccines to prevent disease captured Kathrin Jansens imagination at an early age. I remember lining up in the school auditorium for my smallpox vaccine. I thought … [+11646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you should not ignore constipation, receding hairline, weight gain, stiffness, and weak memory - The Indian Express", "description": "\"The easiest and quickest way to ascertain the deficiency is a urine test. Results may be obtained in a matter of minutes, although it isn't as precise as some other tests,\" said Dr Ashoka Varshini Panga", "url": "https://indianexpress.com/article/lifestyle/health/iodine-deficiency-symptoms-causes-diagnosis-treatment-8250026/", "urlToImage": "https://images.indianexpress.com/2022/11/thyroid_1200_getty.jpg", "publishedAt": "2022-11-11T15:20:08Z", "content": "Worldwide, there are two billion individuals who suffer from iodine deficiency, according to World Health Organization (WHO). “It’s more prevalent in poor nations where individuals might not have eno… [+3618 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Study: Covid vax linked to higher antibody levels in pregnant women, babies - mid-day.com", "description": "The study by researchers at Children's Hospital of Philadelphia (CHOP) and the University of Pennsylvania also found that vaccine timing played an important role in maximising the transfer of antibodies", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/covid-vax-leads-to-higher-antibody-levels-in-pregnant-women-babies-23254978", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Covid-cases-aa_d.jpg", "publishedAt": "2022-11-11T14:52:00Z", "content": "The study by researchers at Children's Hospital of Philadelphia (CHOP) and the University of Pennsylvania also found that vaccine timing played an important role in maximising the transfer of antibod… [+2392 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Addition of Sleep deprivation to treatment of depression may not enhance outcomes - Medical Dialogues", "description": "The addition of sleep deprivation to treatment packages  leads to enhanced depressive outcomes suggests a recent study published in the Sleep  Medicine Reviews    Sleep deprivation, alone or in...", "url": "https://medicaldialogues.in/psychiatry/news/addition-of-sleep-deprivation-to-treatment-of-depression-may-not-enhance-outcomes-102069", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/29/189330-download-4.jpg", "publishedAt": "2022-11-11T14:30:13Z", "content": "The addition of sleep deprivation to treatment packages leads to enhanced depressive outcomes suggests a recent study published in the Sleep Medicine ReviewsSleep deprivation, alone or in combination… [+1706 chars]"}, {"source": {"id": null, "name": "Farm and Dairy"}, "author": "Other News", "title": "Tracing tomatoes’ health benefits to gut microbes - Farm and Dairy", "description": "Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favorable profile in young pigs.", "url": "https://www.farmanddairy.com/news/tracing-tomatoes-health-benefits-to-gut-microbes/745420.html", "urlToImage": "https://d27p2a3djqwgnt.cloudfront.net/wp-content/uploads/2019/07/22172509/tomato-2643774_1280-e1563830731882.jpg", "publishedAt": "2022-11-11T14:20:09Z", "content": "Two weeks of eating a diet heavy in tomatoes increased the diversity of gut microbes and altered gut bacteria toward a more favorable profile in young pigs, researchers found.\r\nAfter observing these … [+4092 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Prima Slim Review: Will PrimaSlim Work For You or Cheap Diet Pills? - The Tribune India", "description": "Losing weight safely and naturally can be challenging as many medications, supplements, and surgeries claim to help people attain that ideal weight but do nothing. While maintaining a healthy lifestyle, the right supplement can greatly improve your weight los…", "url": "https://www.tribuneindia.com/news/brand-connect/prima-slim-review-will-primaslim-work-for-you-or-cheap-diet-pills-450006", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_601622987.jpg", "publishedAt": "2022-11-11T13:12:00Z", "content": "Losing weight safely and naturally can be challenging as many medications, supplements, and surgeries claim to help people attain that ideal weight but do nothing. While maintaining a healthy lifesty… [+9700 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Amarose Skin Tag Remover Reviews: Legit or Scam Skin Tag Remover? - mid-day.com", "description": "People care about their skin and are willing to spend as much money as they can to get the best high-quality products that can work like magic. This is the reason why the skin care industry is making billions and is one of the most dynamic industries.", "url": "https://www.mid-day.com/brand-media/article/amarose-skin-tag-remover-reviews-legit-or-scam-skin-tag-remover-23255066", "urlToImage": "https://images.mid-day.com/images/images/2022/nov/Amarose_d.jpg", "publishedAt": "2022-11-11T13:07:00Z", "content": "People care about their skin and are willing to spend as much money as they can to get the best high-quality products that can work like magic. This is the reason why the skin care industry is making… [+5822 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Researchers find experimental cancer vaccine shows promise in animals - Times of India", "description": "Investigators from the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health have reported an experimental therapeutic cancer vaccine induced two distinct and desirable immune system responses that led to sig…", "url": "https://timesofindia.indiatimes.com/videos/news/researchers-find-experimental-cancer-vaccine-shows-promise-in-animals/videoshow/95455176.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-95455176,imgsize-40500.cms", "publishedAt": "2022-11-11T12:51:54Z", "content": "Nov 11, 2022, 06:21PM ISTSource: ANIInvestigators from the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health have reported an experimental thera… [+660 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Researchers find difference in brains of boys, girls with binge eating disorder - Times of India", "description": "A team of researchers from the Keck School of Medicine at USC conducted the first known comparison of the brains of boys and girls with binge eating disorder and discovered notable changes in brain structure between the sexes. The research was recently publis…", "url": "https://timesofindia.indiatimes.com/videos/news/researchers-find-difference-in-brains-of-boys-girls-with-binge-eating-disorder/videoshow/95455096.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-95455096,imgsize-57830.cms", "publishedAt": "2022-11-11T12:49:38Z", "content": "Nov 11, 2022, 06:19PM ISTSource: ANIA team of researchers from the Keck School of Medicine at USC conducted the first known comparison of the brains of boys and girls with binge eating disorder and d… [+560 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Pelvic Floor Strong Reviews - Alex Miller Bladder Leakage Method - The Tribune India", "description": "Pelvic Floor Strong is a self-help program by Alex Miller, a fitness expert, and expert on women's health, that helps women strengthen their pelvic floor muscles. With the help of this workout plan, women can learn how to strengthen their pelvic floor using a…", "url": "https://www.tribuneindia.com/news/brand-connect/pelvic-floor-strong-reviews-alex-miller-bladder-leakage-method-449993", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_2147292686.jpg", "publishedAt": "2022-11-11T12:43:00Z", "content": "Pelvic Floor Strong is a self-help program by Alex Miller, a fitness expert, and expert on women's health, that helps women strengthen their pelvic floor muscles. With the help of this workout plan, … [+11115 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "UTIFIX Reviews - PureHealth Research UTI FIX Urinary Tract Infection Support - The Tribune India", "description": "Having painful urination is not normal. Urinary tract infections or UTIs disrupt the urinary system and cause pain, burning sensations, urge to pee frequently, or bloody urine.", "url": "https://www.tribuneindia.com/news/brand-connect/utifix-reviews-purehealth-research-uti-fix-urinary-tract-infection-support-449987", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/11/2022_11$largeimg_556733976.jpg", "publishedAt": "2022-11-11T12:28:00Z", "content": "Having painful urination is not normal. Urinary tract infections or UTIs disrupt the urinary system and cause pain, burning sensations, urge to pee frequently, or bloody urine.\r\nThis infection result… [+8672 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Does Radiation From 5G Cell Phones Increase The Risk Of Cancer? Expert Answers - News18", "description": "The frequency of the second, third and fourth-generation cell phones remains in the range of 0.7 to 2.7 GHz", "url": "https://www.news18.com/news/lifestyle/does-radiation-from-5g-cell-phones-increase-the-risk-of-cancer-expert-answers-6363433.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/001-27-166816936116x9.png", "publishedAt": "2022-11-11T12:23:48Z", "content": "The introduction of the 5G network in India is not without its share of controversies. Environmentalists have opposed it from the start, claiming that the fifth generation could emit radiation that m… [+1538 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "ACT invests 3.2 crore towards catalysing accessible & affordable cancer care in India - Express Healthcare", "description": "ACT For Health will provide catalytic grant funding, accelerate scale of the solutions by providing key network interventions, and enable widespread ecosystem adoption", "url": "https://www.expresshealthcare.in/news/act-invests-3-2-crore-towards-catalysing-accessible-affordable-cancer-care-in-india/436949/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/02/02122810/admin-ajax-4-1.jpg", "publishedAt": "2022-11-11T12:03:19Z", "content": "ACT For Health will provide catalytic grant funding, accelerate scale of the solutions by providing key network interventions, and enable widespread ecosystem adoption\r\nACT, a non-profit venture phil… [+2812 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Diabetes incidence high among 40-60 years age group: Tata 1mg - ETHealthWorld", "description": "In addition to the genetic predisposition, the main culprits for causing a surge in diabetes cases in India are unhealthy lifestyle factors like lack of physical activity, excessive fast-food consumption, smoking, and alcohol consumption.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/diabetes-incidence-high-among-40-60-years-age-group-tata-1mg/95452774", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95452774,imgsize-1271217,width-1200,height-628,overlay-ethealthworld/diabetes-incidence-high-among-40-60-years-age-group-tata-1mg.jpg", "publishedAt": "2022-11-11T11:50:00Z", "content": "New Delhi: Ahead of World Diabetes Day on November 14, Tata 1mg shared that one-third of the people who tested for HbA1c at Tata 1mg Labs, were found to have diabetes, with the highest incidence repo… [+2635 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Tips to take care of diabetic patients as they are at high kidney disease risk - Hindustan Times", "description": "World Diabetes Day 2022: Kidney disease is an important and dreadful complication of diabetes mellitus and diabetic patients are at high risk of chronic kidney disease. Follow these vital tips for a healthy, happy and productive life, safe from kidney disorde…", "url": "https://www.hindustantimes.com/lifestyle/health/world-diabetes-day-2022-diabetic-patients-are-at-high-risk-of-chronic-kidney-disease-here-s-how-to-control-blood-sugar-levels-101668164781182.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/pexels-klaus-nielsen-6303708_1668165121224_1668165151008_1668165151008.jpg", "publishedAt": "2022-11-11T11:29:30Z", "content": "Diabetes Mellitus in its advanced stages is characterized by elevated glucose (sugar) levels in blood and is usually brought to attention when the patient presents with weight loss, increased thirst … [+2550 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[#SCAM ] Pro Bio Keto Gummies Reviews Exposed Consumer ALERT Price Ingredients Cost Where to buy? - Deccan Herald", "description": "Love Your Body with Pro Bio Keto Gummies . Pro Bio Keto Gummies  according to the manufacturer, are a secure dietary supplement that you can use in addition to a ketogenic diet to help you reach and maintain ketosis and lose weight more quickly.", "url": "https://www.deccanherald.com/brandspot/pr-spot/scam-pro-bio-keto-gummies-reviews-exposed-consumer-alert-price-ingredients-cost-where-to-buy-1161428.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1161428-1668163456.png", "publishedAt": "2022-11-11T10:42:37Z", "content": "Love Your Body with Pro Bio Keto Gummies . Pro Bio Keto Gummies  according to the manufacturer, are a secure dietary supplement that you can use in addition to a ketogenic diet to help you reach and … [+16327 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Diabetes Day 2022: 7 Yoga Asanas To Improve Insulin Sensitivity - NDTV", "description": "Yoga: Similar to diet and other lifestyle changes that can improve insulin sensitivity, yoga may also be helpful.", "url": "https://www.ndtv.com/health/world-diabetes-day-2022-7-yoga-asanas-to-improve-insulin-sensitivity-3511357", "urlToImage": "https://c.ndtvimg.com/2022-06/thmnc0bo_yoga-day-things-to-know-_650x400_22_June_22.jpg", "publishedAt": "2022-11-11T10:35:58Z", "content": "World Diabetes Day 2022: Vrikshasana helps increase insulin sensitivity\r\nWorld Diabetes Day was created in 1991 by the International Diabetes Federation with assistance from WHO in response to growin… [+4913 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Discovery Brings Us Closer to Diabetes and Cancer Drugs Without Injections - Technology Networks", "description": "A new study is paving the way for diabetes and cancer patients to forget needles and injections, and instead take pills to manage their conditions.", "url": "https://www.technologynetworks.com/drug-discovery/news/discovery-brings-us-closer-to-diabetes-and-cancer-drugs-without-injections-367563", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/367563/discovery-brings-us-closer-to-diabetes-and-cancer-drugs-without-injections-367563-640x360.jpg?cb=20221111", "publishedAt": "2022-11-11T10:15:23Z", "content": "Researchers at UC Riverside are paving the way for diabetes and cancer patients to forget needles and injections, and instead take pills to manage their conditions. \r\nSome drugs for these diseases di… [+2826 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dengue: Foods To Eat When Recovering From Dengue Fever - NDTV", "description": "Dengue fever: A healthy diet can help you recover well from dengue fever. Here's a list of foods and drinks that can aid in fast recovery.", "url": "https://www.ndtv.com/health/dengue-foods-to-eat-when-recovering-from-dengue-3510465", "urlToImage": "https://c.ndtvimg.com/2020-07/mpllimko_coconut-water_625x300_14_July_20.jpg", "publishedAt": "2022-11-11T09:22:00Z", "content": "Dengue fever: Coconut water is a rich source of salts and minerals, which prevent dehydration\r\nWhile dengue cases have suddenly increased in recent months in Delhi and many other states, including We… [+4320 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "Suffering from gastric problems? Follow these tips that can help you poop - Health shots", "description": "Constipation is a digestive problem that can be painful and uncomfortable. Here are 6 tips to help you cure constipation.", "url": "https://www.healthshots.com/how-to/suffering-from-gastric-problems-follow-these-tips-that-can-help-you-poop/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/11122404/constipation-1.jpg", "publishedAt": "2022-11-11T09:00:10Z", "content": "Digestion is a complex process that can easily disrupt your everyday life. You eat one thing wrong and your whole digestive system turns upside down. One problem that affects millions of people on a … [+4696 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bath: Birth cohort study reveals the mental health burden of trauma in childhood - India Education Diary", "description": "Findings from a major birth cohort study in Brazil suggest that children exposed to life threatening or horrifying events, such as witnessing someone die, or experiencing serious injury or sexual violence, are almost twice as likely to develop psychi", "url": "https://indiaeducationdiary.in/university-of-bath-birth-cohort-study-reveals-the-mental-health-burden-of-trauma-in-childhood/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/University-of-Bath.png?fit=360%2C180&ssl=1", "publishedAt": "2022-11-11T08:35:56Z", "content": "Findings from a major birth cohort study in Brazil suggest that children exposed to life threatening or horrifying events, such as witnessing someone die, or experiencing serious injury or sexual vio… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Prof. K Srinath Reddy", "title": "Why you shouldn't go for HRT after menopause and save your heart - The Indian Express", "description": "Women can and should maintain their blood vessels healthy after menopause through their own efforts, even though nature is no longer putting in an extra effort. Mechanically replacing female sex hormones does not mimic nature’s fine tuned balance and can caus…", "url": "https://indianexpress.com/article/lifestyle/health-specials/hrt-menopause-heart-women-health-tips-8262313/", "urlToImage": "https://images.indianexpress.com/2022/11/Reddy-menopause.jpg", "publishedAt": "2022-11-11T07:06:25Z", "content": "Before menopause, women have a lower risk of cardiovascular disease than men. This has been well established in many studies across the world. On the assumption that female sex hormones are mainly re… [+6169 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Diabetes: Exercise can help you maintain blood sugar levels; adopt THESE workouts in daily routine - DNA India", "description": "Muscles can utilize your blood glucose without insulin intervention when you`re doing physical activity.", "url": "https://www.dnaindia.com/health/report-diabetes-exercise-can-help-you-maintain-blood-sugar-levels-adopt-these-workouts-in-daily-routine-3001338", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/11/11/2553168-aerobics.jpg", "publishedAt": "2022-11-11T06:57:00Z", "content": "Physical activity or a regular workout regime is a key element in managing type 2 diabetes. Until recently studies showing the significance of exercise to manage diabetes were very less. However, now… [+5526 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Chronic cough: 5 common reasons why you can't stop coughing - Hindustan Times", "description": "Dry cough can silently ruin your health whether you are recovering from a Covid infection or facing the ill effects of air pollution. Here are common reasons why your cough just won't go away. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/chronic-cough-5-common-reasons-why-you-can-t-stop-coughing-101668149345914.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/11/1600x900/chronic_coughing_1668149392272_1668149404053_1668149404053.jpg", "publishedAt": "2022-11-11T06:55:41Z", "content": "Persistent or chronic coughs are becoming quite common nowadays. Covid, pollution, asthma, tuberculosis - there is a long list of factors that's may be making our cough last for longer than it should… [+2585 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Vitamins to Boost Testosterone Supplement - Vitamins That Increase Testosterone - Deccan Herald", "description": "Today, the majority of individuals struggle to lead ideal sensual lives for a variety of reasons. Low erection and hormonal imbalances are two major contributors to the poor sensual life. The males are unable to give their partners results that are satisfacto…", "url": "https://www.deccanherald.com/brandspot/pr-spot/vitamins-to-boost-testosterone-supplement-vitamins-that-increase-testosterone-1161355.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1161355-1668148769.png", "publishedAt": "2022-11-11T06:39:29Z", "content": "Today, the majority of individuals struggle to lead ideal sensual lives for a variety of reasons. Low erection and hormonal imbalances are two major contributors to the poor sensual life. The males a… [+16613 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Vaamanaa Sethi", "title": "Lung blockages, growth retardation and allergies — This is how air pollution is affecting your child’s health - Business Insider India", "description": "Air pollution affects not just the lungs but the skin, eyes, nose, kidney and even the brain in both children and adults, say doctors and experts. Bronchitis", "url": "https://www.businessinsider.in/india/news/lung-blockages-growth-retardation-and-allergies-this-is-how-air-pollution-is-affecting-your-childs-health/articleshow/95442684.cms", "urlToImage": "https://www.businessinsider.in/photo/95442684/lung-blockages-growth-retardation-and-allergies-this-is-how-air-pollution-is-affecting-your-childs-health.jpg?imgsize=988484", "publishedAt": "2022-11-11T05:23:00Z", "content": "Every year with the onset of winters, toxic smog and pollutants\r\n surround the national capital and neighbouring regions leading to various health problems including cough, cold, sore throat, and wat… [+3188 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "Nosh on these 5 winter superfoods to improve digestion and immunity - Health shots", "description": "Add these superfoods for better digestion to your diet during the winter season. They’ll keep your immunity strong as well!", "url": "https://www.healthshots.com/healthy-eating/superfoods/5-winter-superfoods-for-better-digestion-and-immunity/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/10122723/winter-foods.jpg", "publishedAt": "2022-11-11T05:00:52Z", "content": "Winter is almost here and you can feel it in the air! And this is the time when due to cold weather, eating unsafe, and decreased activity one’s gut health can go for a toss. According to Ayurveda, t… [+3255 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Covid infection changes genetic material of cells: Study - EastMojo", "description": "Washington: Scientists have shown for the first time that infection by SARS-CoV-2 changes the functioning of host cell RNA, according to a study.The", "url": "http://www.eastmojo.com/coronavirus-updates/2022/11/11/covid-infection-changes-genetic-material-of-cells-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/Untitled-design-2022-08-16T125503.137.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-11-11T04:50:00Z", "content": "Washington: Scientists have shown for the first time that infection by SARS-CoV-2 changes the functioning of host cell RNA, according to a study.\r\nThe scientists at the Federal University of Sao Paul… [+3968 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sumi Sukanya Dutta", "title": "This test package promises faster and better diagnosis of PCOS in women - Moneycontrol", "description": "Polycystic ovary syndrome is a common endocrine disorder predominantly affecting women of reproductive age. Clinical manifestations are diverse, including overproduction of some male hormones, lack of ovulation, infertility, hair loss and increased risk of me…", "url": "https://www.moneycontrol.com/news/trends/this-test-package-promises-faster-and-better-diagnosis-of-pcos-in-women-9493771.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2017/03/blood_samples_pharma_lab_720-770x433.jpg", "publishedAt": "2022-11-11T04:21:47Z", "content": "Diagnosing polycystic ovary syndrome (PCOS), one of the commonest chronic hormonal conditions in women, has become easier with Veera Health, a major digital therapeutics platform for managing the ail… [+2647 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "International New York Times", "title": "Preventive cardiology pioneer Lewis Kuller dies at 88 - Deccan Herald", "description": "Dr Lewis Kuller, a top public health researcher and a leading figure in preventive cardiology, could trace his interest in the field to when he was a medical resident in New York’s Brooklyn borough in the early 1960s, responding by ambulance to emergency call…", "url": "https://www.deccanherald.com/science-and-environment/preventive-cardiology-pioneer-lewis-kuller-dies-at-88-1161306.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/11/kuller-1161306-1668136888.jpg", "publishedAt": "2022-11-11T03:21:28Z", "content": "Dr Lewis Kuller, a top public health researcher and a leading figure in preventive cardiology, could trace his interest in the field to when he was a medical resident in New Yorks Brooklyn borough in… [+6973 chars]"}, {"source": {"id": null, "name": "Everyday Health"}, "author": "Paula Derrow", "title": "Psoriasis on the Knees and Elbows: How to Treat Flares - Everyday Health", "description": "The knees and elbows are common spots for psoriasis. Here’s what those inflamed patches look like, plus the latest on medications and home remedies.", "url": "https://www.everydayhealth.com/psoriasis/psoriasis-on-the-knees-and-elbows-what-it-looks-like-how-to-treat-it/", "urlToImage": "https://images.everydayhealth.com/images/psoriasis-on-the-knees-and-elbows-1440x810.jpg?sfvrsn=c209e967_1", "publishedAt": "2022-11-10T22:16:02Z", "content": "Ellen Paces journey with psoriasis has been a long one. Im 67, Ive had psoriasis since I was 11 years old, and its been a challenge throughout, says Pace, a psychotherapist who lives in Brooklyn, New… [+5561 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Matthew Gavidia", "title": "Simvastatin Ineffective as Disease-Modifying Therapy for Intermediate Parkinson Disease - AJMC.com Managed Markets Network", "description": "Patients with intermediate and mild Parkinson disease, defined by a Hoehn & Yahr stage of 3 or less, experienced an additional deterioration in motor function with simvastatin compared with placebo while not taking medication at 24 months.", "url": "https://www.ajmc.com/view/simvastatin-ineffective-as-disease-modifying-therapy-for-intermediate-parkinson-disease", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c1f2e78910bb5bdd4efa7f07071caa2860df4230-800x400.jpg?fit=crop&auto=format", "publishedAt": "2022-11-10T21:28:37Z", "content": "Simvastatin was futile as a disease-modifying therapy in patients with intermediate Parkinson disease (PD), according to study findings published recently in JAMA Neurology.\r\nAn estimated 6.2 million… [+4734 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Lisa O’Mary", "title": "High Blood Pressure Increases Risk of Severe COVID: Study - WebMD", "description": "Research has already linked high blood pressure with an increased risk of developing a severe case of COVID-19. Now, a new study out of the United Kingdom identifies at what level high blood pressure can help predict a life-threatening case of the virus.", "url": "https://www.webmd.com/hypertension-high-blood-pressure/news/20221110/high-blood-pressure-severe-covid-study", "urlToImage": "https://img.webmd.com/vim/live/webmd/consumer_assets/site_images/article_thumbnails/blog_posts-doctors/1800x1200_blood-pressure-cuff.jpg", "publishedAt": "2022-11-10T19:32:06Z", "content": "Nov. 10, 2022 Research has already linked high blood pressure with an increased risk of a severe case of COVID-19. Now, a new study out of the United Kingdom identifies at what level high blood press… [+1524 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "OPTION: Feasible to replace aspirin with indobufen in DAPT after PCI - Healio", "description": "CHICAGO &mdash; In patients who had PCI with a drug-eluting stent, dual antiplatelet therapy with indobufen plus clopidogrel was noninferior to DAPT with aspirin plus clopidogrel, according to the results of the OPTION trial.      Junbo Ge, MD, FACC, FAHA, fr…", "url": "https://www.healio.com/news/cardiac-vascular-intervention/20221110/option-feasible-to-replace-aspirin-with-indobufen-in-dapt-after-pci", "urlToImage": "https://www.healio.com/~/media/slack-news/cardiology/misc/lth/lth-og-and-social-images/interventional-cardiologist_adobe-stock.jpg", "publishedAt": "2022-11-10T18:33:28Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nCHICAGO — In patients who had PCI with a… [+4410 chars]"}, {"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "Climate change threatens mountainous Nepal with a spike in dengue infections - Gavi, the Vaccine Alliance", "description": "Classically a disease of lower-lying areas, dengue cases have this year surged in the hill zones of the Himalayan state.", "url": "https://www.gavi.org/vaccineswork/climate-change-threatens-mountainous-nepal-spike-dengue-infections", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2022/Header/Cover_photo-Dengue_Spray_Kathmandu_h1.jpg", "publishedAt": "2022-11-10T17:40:58Z", "content": "Nirmal Khatri, an entrepreneur from Beni, in Nepal's Myagdi district, was diagnosed dengue-positive on October 8. He had been sick for days suffering a high, continuous fever of up to 40 degrees Cels… [+5800 chars]"}, {"source": {"id": null, "name": "Pulmonologyadvisor.com"}, "author": "melissaalvarez", "title": "Low-Dose ICS for Mild Asthma Prevents Small Drop in FEV1 Seen in High Altitudes - Pulmonology Advisor", "description": "What precautions are needed to protect individuals with mild, seasonal asthma from high altitude conditions?", "url": "https://www.pulmonologyadvisor.com/home/topics/asthma/low-dose-ics-for-mild-asthma-prevents-drop-in-fev1-at-high-altitudes/", "urlToImage": null, "publishedAt": "2022-11-10T16:55:00Z", "content": "Low-dose inhaled corticosteroid (ICS) treatment in individuals with mild, seasonal asthma prevents a decrease in pulmonary function in response to high altitude (HA) environmental factors, according … [+3387 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Monitoring Potassium in Hemodialysis Patients - DocWire News", "description": "Due to elevated levels of potassium, patients with kidney failure requiring dialysis are at high risk for hyperkalemia, a complication associated with Results of a cost-utility analysis comparing the use of a real-time potassium monitoring device in patients …", "url": "https://www.docwirenews.com/nephtimes/nephtimes-diseases-and-conditions/hyperkalemia/monitoring-potassium-in-hemodialysis-patients/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2020/04/GettyImages-1076181336-e1622041823709.jpg", "publishedAt": "2022-11-10T15:15:26Z", "content": "Due to elevated levels of potassium, patients with kidney failure requiring dialysis are at high risk for hyperkalemia, a complication associated with increased morbidity and mortality. Interventions… [+2379 chars]"}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Brian Consiglio-Missouri", "title": "Key mutations make monkeypox stronger and smarter - Futurity: Research News", "description": "Like COVID-19, mutations have allowed monkeypox to get smarter, spreading quickly and evading drugs. New research digs into key mutations.", "url": "https://www.futurity.org/monkeypox-virus-mutations-2827492-2/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2022/11/monkeypox-virus-mutations-1600.jpg", "publishedAt": "2022-11-10T14:50:42Z", "content": "Researchers have identified the specific mutations in the monkeypox virus that contribute to its continued infectiousness.\r\nMonkeypox has infected more than 77,000 people in more than 100 countries w… [+3928 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Microvascular complications have synergistic negative effect on all cause mortality among diabetics - Medical Dialogues", "description": "Italy: A recent study published in Cardiovascular Diabetology has shown the synergistic, long-term, and adverse effects of diabetic microvascular complications (MVC) on mortality in both type 1...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/microvascular-complications-have-synergistic-negative-effect-on-all-cause-mortality-among-diabetics-102035", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/01/189596-diabetes-care.jpg", "publishedAt": "2022-11-10T14:30:12Z", "content": "Italy: A recent study published in Cardiovascular Diabetology has shown the synergistic, long-term, and adverse effects of diabetic microvascular complications (MVC) on mortality in both type 1 diabe… [+2752 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Lakshita Singh", "title": "Expert Explains If Back Pain During Periods Is Normal - HerZindagi English", "description": "Lower back pain, feeling bloated, breast tenderness, and mood swings are common symptoms of periods.", "url": "https://www.herzindagi.com/health/expert-explains-if-back-pain-during-periods-is-normal-article-213406", "urlToImage": "https://images.herzindagi.info/image/2022/Nov/back-pain-during-periods.jpg", "publishedAt": "2022-11-10T13:34:47Z", "content": "Periods are an uncomfortable time for most menstruators. Adding to the discomfort, it also comes with other complications such as bloating, breast tenderness, mood swings etc. Another common problem … [+2393 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Hina", "title": "Insufficient Protein Intake Leading To Overeating: - Asiana Times", "description": "Studies found protein hunger is causing people to overeat in response to the body’s strong appetite for protein. Nowadays, because of the body's strong appetite and modern diets, people sometimes overeat fats and carbohydrates, and the body vigorously favours…", "url": "https://asianatimes.com/insufficient-protein-intake-leading-to-overeating/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/11/nm-overeating-and-your-heart_preview.jpg", "publishedAt": "2022-11-10T13:10:30Z", "content": "Studies found protein hunger is causing people to overeat in response to the bodys strong appetite for protein.\r\nNowadays, because of the body’s strong appetite and modern diets, people sometimes ove… [+3359 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Vaccine inequity: Disparity in access to doses hits low-income countries, says WHO - Down To Earth Magazine", "description": "Only 2 manufacturers are supplying key vaccines such as pneumococcal vaccines, measles and rubella-containing vaccines across the world", "url": "https://www.downtoearth.org.in/news/world/vaccine-inequity-disparity-in-access-to-doses-hits-low-income-countries-says-who-85908", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-11-10/0.40558800_1668082920_doses.jpg", "publishedAt": "2022-11-10T13:00:19Z", "content": "Only 2 manufacturers are supplying key vaccines such as pneumococcal vaccines, measles and rubella-containing vaccines across the worldVaccine inequity is not a novel phenomenon but has only been hig… [+3966 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "5 Things to Know About Heart Disease and Signs You Have it — Eat This Not That - Eat This, Not That", "description": "Heart disease still remains the leading cause of death in the United States and the statistics are alarming.", "url": "https://www.eatthis.com/things-to-know-about-heart-disease-and-signs-you-have-it/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/heart-burn-e1658198914568.jpg?quality=82&strip=all", "publishedAt": "2022-11-10T12:30:42Z", "content": "Heart disease still remains the leading cause of death in the United States and the statistics are alarming. The Centers for Disease Control and Prevention states, \"One person dies every 34 seconds i… [+8144 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Heavy smoking may trigger small cell lung cancer risks in men: AIIMS study - News9 LIVE", "description": "The high prevalence of tuberculosis in Indian settings leads to a significant delay in the diagnosis of lung cancer.", "url": "https://www.news9live.com/health/heavy-smoking-may-trigger-small-cell-lung-cancer-risks-aiims-study-207175", "urlToImage": "https://media.news9live.com/h-upload/2022/11/10/580087-smkoe.jpg", "publishedAt": "2022-11-10T11:27:55Z", "content": "A study conducted by the doctors at All India Institute of Medical Science (AIIMS) has found that small-cell lung cancer can predominantly affect malehealth with a heavy smoking index. People who are… [+3593 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "Mahender", "title": "Breast Lumps: Signs, Causes, Treatment - NewsPatrolling", "description": "Breast cancer involves abnormal growth of cells in breasts that forms a lump or mass of tissues in the breasts. It is the most common kind of cancer affecting women and rarely affects men too. When detected early, breast cancer can be cured, and fatalities ca…", "url": "https://newspatrolling.com/breast-lumps-signs-causes-treatment/", "urlToImage": "https://newspatrolling.com/wp-content/uploads/2022/11/Dr-Kritika-Murugan.jpg", "publishedAt": "2022-11-10T10:39:09Z", "content": "Breast cancer involves abnormal growth of cells in breasts that forms a lump or mass of tissues in the breasts. It is the most common kind of cancer affecting women and rarely affects men too. When d… [+4786 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Good news for multi-drug resistant TB patients as clinical trial finds short treatment regimens safe, effective - The Indian Express", "description": "The Lancet study showed that both Bedaquiline-containing regimens – a nine-month oral regimen and a six-month regimen with eight weeks of second line injectables -- had superior efficacy. But India has stubborn resistance where the new regime may not be as ef…", "url": "https://indianexpress.com/article/lifestyle/health-specials/tb-multi-drug-resistant-clinical-trial-short-treatment-regimens-8260944/", "urlToImage": "https://images.indianexpress.com/2022/11/TB-patients-1.jpeg", "publishedAt": "2022-11-10T10:22:27Z", "content": "In a breather to patients suffering from multi-drug resistant tuberculosis (MDR-TB), a serious infection affecting the lungs, a study has found that two new shortened treatment regimens using the dru… [+6453 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Chances of finding COVID-virus ancestor 'almost nil', say virologists - Nature.com", "description": "Genome analysis finds SARS-CoV-2 and bat coronaviruses shared an ancestor just a few years ago, but extensive recombination has muddied the picture.", "url": "https://www.nature.com/articles/d41586-022-03611-w", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03611-w/d41586-022-03611-w_23688610.jpg", "publishedAt": "2022-11-10T10:22:23Z", "content": "Evidence suggests that SARS-CoV-2 probably emerged in horseshoe bats.Credit: Bruce Thomson/Nature Picture Library\r\nThe virus that causes COVID-19 probably shared an ancestor with bat coronaviruses mo… [+5087 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "Kalyani Sharma", "title": "Prioritising communicable diseases in post-pandemic world - Express Healthcare", "description": "The new era of communicable diseases demands fresh strategies and a balance of resources, policies and technology", "url": "https://www.expresshealthcare.in/news/prioritising-communicable-diseases-in-post-pandemic-world/436919/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/11/EH_November_2022_CoverStory_Feature_750.jpg", "publishedAt": "2022-11-10T09:59:23Z", "content": "The new era of communicable diseases demands fresh strategies and a balance of resources, policies and technology\r\nApart from already existing communicable diseases like Tuberculosis (TB), AIDS and M… [+25041 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New nanoparticle to make an anti-inflammatory drug much more effective - Tech Explorist", "description": "A new nanoparticle acts at the heart of cells.", "url": "https://www.techexplorist.com/new-nanoparticle-make-anti-inflammatory-drug-effective/54806/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/11/electron-micrograph.jpg", "publishedAt": "2022-11-10T08:43:07Z", "content": "Inflammation is required for protective responses against pathogens and is thus essential for survival, but sustained inflammation can lead to diseases such as atherosclerosis and cancer. There are s… [+3855 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Research: Role of nutrient may reveal dietary target in fight against microbial infections - Zee News", "description": "According to a recent Yale study, a vitamin that is frequently found in human diets has been found to support the survival of a bacterium that causes cancer. The results could point to a crucial target for brand-new medications to combat a variety of viral di…", "url": "https://zeenews.india.com/video/news/research-role-of-nutrient-may-reveal-dietary-target-in-fight-against-microbial-infections-2533500.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/10/00000003_35.jpg", "publishedAt": "2022-11-10T08:40:02Z", "content": null}]}