{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "The Economist", "title": "What makes ultra-processed foods so bad for your health? - Hindustan Times", "description": "They are calorie-rich, nutrient-poor and hard to stop eating | Health", "url": "https://www.hindustantimes.com/lifestyle/health/what-makes-ultra-processed-foods-so-bad-for-your-health-101691609851016.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/08/09/1600x900/806d7c5c-1688-11ee-b1ba-27d3a5e89783_1688194754510_1691609956719.jpg", "publishedAt": "2023-08-09T19:54:41Z", "content": "FOOD SHOPPING has become a dangerous pursuit. Nutritional horrors lurk on every shelf. Ready-meals are packed with salt and preservatives, breakfast cereals are sweeter than chocolate bars, and proce… [+4346 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "AHA/ACC Issue Updated Chronic Coronary Disease Guidelines - Medscape", "description": "The latest guidance emphasizes evidence-based and patient-centered care and includes key updates on revascularization, beta-blocker use, and routine functional and anatomic testing.", "url": "https://www.medscape.com/viewarticle/995320", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230809_heart_cardiovascular_system_800x450.jpg", "publishedAt": "2023-08-09T19:47:10Z", "content": "The latest clinical practice guideline for managing patients with chronic coronary disease (CCD) takes an evidence-based and patient-centered approach to care and includes key updates on revasculariz… [+5291 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Natalie Neysa Alund", "title": "TikTokers help Portland animal sanctuary hit with rare infection - USA TODAY", "description": "TikTok animal rescuer Lee Asher said his Oregon sanctuary was hit by a rare pneumonia outbreak that threatens his 42 dogs. One of them has died.", "url": "https://www.usatoday.com/story/news/nation/2023/08/09/tiktokers-portland-animal-sanctuary-rare-infection/70557162007/", "urlToImage": "https://www.usatoday.com/gcdn/authoring/authoring-images/2023/08/09/USAT/70560118007-lee-asher-with-some-of-his-dogs-at-the-asher-house-in-oregon.png?crop=633,359,x0,y228&width=633&height=359&format=pjpg&auto=webp", "publishedAt": "2023-08-09T19:32:38Z", "content": "An Oregon-based animal sanctuary is praising some of its TikTok followers for quickly stepping in to help with vet bills after more than dozen of its dogs recently contracted a rare infection.\r\nThe A… [+3130 chars]"}, {"source": {"id": null, "name": "Mongabay.com"}, "author": "Xavier Bartaburu", "title": "Zika, dengue transmission expected to rise with climate change - Mongabay.com", "description": "A new study foresees a 20% increase in cases of viruses like dengue, Zika and chikungunya over the next 30 years due to climate change. Higher temperatures are already causing the diseases carried by the Aedes aegypti mosquito to spread in cooler regions like…", "url": "https://news.mongabay.com/2023/08/zika-dengue-transmission-expected-to-rise-with-climate-change/", "urlToImage": "https://imgs.mongabay.com/wp-content/uploads/sites/20/2023/08/09191328/Aedes_aegypti-768x512.jpg", "publishedAt": "2023-08-09T19:23:27Z", "content": "<ul><li>A new study foresees a 20% increase in cases of viruses like dengue, Zika and chikungunya over the next 30 years due to climate change.</li><li>Higher temperatures are already causing the dis… [+9415 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Genetic marker that often points to heart disease and Alzheimer's may have fertility benefit - Medical Xpress", "description": "Previous research has revealed that the Apolipoprotein-ε4 (APOE-ε4) allele increases the risk for a variety of diseases in aging populations, specifically Alzheimer's and cardiovascular disease. Yet despite its negative effects, this allele remains prevalent …", "url": "https://medicalxpress.com/news/2023-08-genetic-marker-heart-disease-alzheimer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/genetic-marker-which-o.jpg", "publishedAt": "2023-08-09T18:12:54Z", "content": "Previous research has revealed that the Apolipoprotein-4 (APOE-4) allele increases the risk for a variety of diseases in aging populations, specifically Alzheimer's and cardiovascular disease. Yet de… [+6901 chars]"}, {"source": {"id": null, "name": "Diagnostic Imaging"}, "author": "Jeff Hall", "title": "New Meta-Analysis Details Most Common Brain MRI Findings with COVID-19 - Diagnostic Imaging", "description": "The most common brain MRI findings associated with COVID-19 included acute/subacute infarction in 22 percent of patients and cerebral microbleeds in 17 percent of patients.", "url": "https://www.diagnosticimaging.com/view/new-meta-analysis-details-most-common-brain-mri-findings-with-covid-19", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/diag_imaging/d430ca001f1cae55f20e907fab94547d0baad678-1200x681.png?fit=crop&auto=format", "publishedAt": "2023-08-09T17:13:50Z", "content": "More than a third of people with COVID-19 have neurological manifestations and a newly published meta-analysis reveals the most common abnormality findings on magnetic resonance imaging (MRI) that ar… [+2872 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Aditi Ray Chowdhury", "title": "WHO Classifies New EG.5 Covid Strain As 'Variant of Interest' As Cases Surge in US, UK - News18", "description": "However, the WHO also made it clear that the new strain did not seem to pose more of a threat to public health than other variants", "url": "https://www.news18.com/world/who-classifies-new-eg-5-covid-strain-as-variant-of-interest-amid-cases-surge-in-us-uk-8530214.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/covid19-coronavirus-india11-2-168086994116x9.jpg", "publishedAt": "2023-08-09T17:05:37Z", "content": "As more cases of the new Covid variant EG.5 which has descended from the rapidly spreading Omicron are coming to the fore in the UK, China, and the US, the World Health Organisation on Wednesday clas… [+3360 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Deep-learning technology could help scientists to develop personalized immunotherapies and vaccines - News-Medical.Net", "description": "Deep-learning technology developed by a team of Johns Hopkins engineers and cancer researchers can accurately predict cancer-related protein fragments that may trigger an immune system response.", "url": "https://www.news-medical.net/news/20230809/Deep-learning-technology-could-help-scientists-to-develop-personalized-immunotherapies-and-vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-08-09T16:56:00Z", "content": "Deep-learning technology developed by a team of Johns Hopkins engineers and cancer researchers can accurately predict cancer-related protein fragments that may trigger an immune system response. If v… [+6460 chars]"}, {"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "Climate change spurs dengue crisis in Bangladesh - Gavi, the Vaccine Alliance", "description": "With more than 2,000 new dengue patients recorded each day, Bangladesh has converted Dhaka’s dedicated COVID-19 hospital into a dedicated dengue facility.", "url": "https://www.gavi.org/vaccineswork/climate-change-spurs-dengue-crisis-bangladesh", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2023/Header/Dengue_patients_h1.jpg", "publishedAt": "2023-08-09T15:02:24Z", "content": "Bangladesh is struggling with a serious spike of dengue cases across the country. The epidemics epicentre is in Dhaka, the countrys capital. Health authorities and experts observe that climate change… [+7461 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Mitchel L. Zoler, PhD", "title": "Growth Hormone Links With Worse T2D Control in Adolescents - Medscape", "description": "Three proteins involved in growth-hormone action are linked with glucose control in adolescents with type 2 diabetes, suggesting the possibility of risk stratification to guide management during puberty.", "url": "https://www.medscape.com/viewarticle/995304", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230809_growth_hormone_800x450.jpg", "publishedAt": "2023-08-09T14:27:26Z", "content": "Plasma levels of three proteins involved in growth hormone activity showed significant links to the controllability of type 2 diabetes in adolescents, a finding that suggests these proteins may serve… [+4998 chars]"}, {"source": {"id": null, "name": "Sambadenglish.com"}, "author": "Priya Ranjan Swain", "title": "Keep premises clean or face penal action, warns BMC as dengue cases surge in Odisha capital - Sambad English", "description": "Bhubaneswar: The Bhubaneswar Municipal Corporation (BMC) has decided to impose penalties on households, commercial establishments and institutions if potential sources of dengue mosquito breeding or larvae are found on their premises.The BMC made thi", "url": "https://sambadenglish.com/keep-premises-clean-or-face-penal-action-warns-bmc-as-dengue-cases-surge-in-odisha-capital/", "urlToImage": "https://sambadenglish.com/wp-content/uploads/2015/12/Dengue.jpg", "publishedAt": "2023-08-09T13:57:52Z", "content": "Bhubaneswar: The Bhubaneswar Municipal Corporation (BMC) has decided to impose penalties on households, commercial establishments and institutions if potential sources of dengue mosquito breeding or … [+1327 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "INDIATODAY", "title": "5 foods that can help reduce back pain - India Today", "description": "Back pain is a common ailment that affects many people worldwide. Your diet can play a significant role in managing and even reducing back pain.", "url": "https://www.indiatoday.in/visualstories/wellness/foods-that-can-help-reduce-back-pain-54848-09-08-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/08/back-ache_1200_675.jpg", "publishedAt": "2023-08-09T13:39:52Z", "content": "A diet rich in spinach, broccoli, sweet potatoes, berries, watermelon, green tea, beans, and nuts can ease your pain due to their anti-inflammatory properties."}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "Daily Excelsior", "title": "Consuming Sugary Drinks Daily Linked With Higher Risk Of Liver Cancer And Disease In Women - Daily Excelsior", "description": "New Delhi, Aug 9: Women consuming sugar-sweetened drinks daily are a higher risk of developing liver cancer and chronic liver disease mortality, scientists have found in the US. The observational study, led by researchers from Brigham and Women’s Hospital, US…", "url": "https://www.dailyexcelsior.com/consuming-sugary-drinks-daily-linked-with-higher-risk-of-liver-cancer-and-disease-in-women/", "urlToImage": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/08/sugar.jpg", "publishedAt": "2023-08-09T13:39:39Z", "content": "New Delhi, Aug 9: Women consuming sugar-sweetened drinks daily are a higher risk of developing liver cancer and chronic liver disease mortality, scientists have found in the US.The observational stud… [+1867 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "7 habits of a good sleeper that can help boost your sleep quality - Hindustan Times", "description": "Getting enough sleep is essential for maintaining optimal health and well-being. It is important to establish healthy habits for improving sleep quality. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/7-habits-of-a-good-sleeper-that-can-boost-your-sleep-quality-101691587268312.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/08/09/1600x900/sleep_1690887493784_1691587664858.jpg", "publishedAt": "2023-08-09T13:35:41Z", "content": "Sleep is an important yet one of the most ignored aspects of our life. Sleep can play an important role in our overall health as even when we are asleep, our body is at work and performs important fu… [+3856 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "TheHealthSite.com", "title": "Things About Plastic Surgery You Didn't know | TheHealthSite.com - TheHealthSite", "description": "Over 30 million surgical and non-surgical procedures were performed globally in 2021 according to the International Society of Aesthetic Plastic Surgery. On the one hand plastic surgery is becoming more and more popular but on the other hand there are many mi…", "url": "https://www.thehealthsite.com/videos/things-about-plastic-surgery-you-didnt-know999371-999371/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/08/00000013-3.jpg", "publishedAt": "2023-08-09T13:17:00Z", "content": "Plastic Surgery: Over time, plastic surgery, a field within healthcare that is frequently clouded by myths, has grown in popularity. Over 30 million surgical and non-surgical procedures were performe… [+471 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Desk", "title": "5 Ways to Reduce Uric Acid in Your Body - WION", "description": "Source: Healthline", "url": "https://www.wionews.com/web-stories/life-fun/health-and-wellness/5-ways-to-reduce-uric-acid-in-your-body-1691584871168", "urlToImage": null, "publishedAt": "2023-08-09T13:15:55Z", "content": "Avoiding or limiting the intake of purine-rich food will help in reducing the uric acid levels in the body. Purine-rich foods include red meat, fish, beer, etc."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How effective are seasonal vaccines in preventing influenza? - News-Medical.Net", "description": "Researchers review the effectiveness of seasonal vaccinations against influenza.", "url": "https://www.news-medical.net/news/20230809/How-effective-are-seasonal-vaccines-in-preventing-influenza.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_755861_16915780126072232.jpg", "publishedAt": "2023-08-09T13:05:00Z", "content": "In a recent study published in Vaccines, researchers review the effectiveness of seasonal vaccinations against influenza, in which almost 50% of vaccinations were found to prevent disease successfull… [+7691 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "What Makes You Crave Food? | Health Wealth, Ep 02 - India Today", "description": "In this episode we discover why digestion should be in our minds when we order a late night binge, the dark side of gluten and how not to go crazy shopping for probiotics.", "url": "https://podcasts.indiatoday.in/health/health-wealth/what-makes-you-crave-food-health-wealth-ep-02-629062-2023-08-09", "urlToImage": "https://akm-img-a-in.tosshub.com/lingo/itpod/images/podcast/202308/2-one_one.jpg", "publishedAt": "2023-08-09T13:05:00Z", "content": "\"Meet the little creatures in your gut. They are responsible for so much more than just breaking down your food. New research is showing how gut bacteria can influence metabolism, emotions, and even … [+361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "New Covid variant ERIS detected in India: Know the symptoms and risk factors of the new variant that’s spreading across the globe - The Indian Express", "description": "Since its first detection in the country, two months have passed without a significant surge in cases during June and July, suggesting that this sub-variant has not been able to make a noticeable impact in India. However, it is important that we remain vigila…", "url": "https://indianexpress.com/article/health-wellness/new-covid-variant-eris-detected-india-know-symptoms-risk-factors-8884521/", "urlToImage": "https://images.indianexpress.com/2023/08/eris-variant.jpg", "publishedAt": "2023-08-09T13:04:19Z", "content": "The World Health Organisation (WHO) has listed the latest COVID-19 variant, EG.5.1, simply known as ERIS, on its radar as cases started picking up in the US and UK. In India, as of now, there has bee… [+4528 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Vicky Pathare", "title": "Over 200 inmates at Yerawada mental hospital infected with conjunctivitis - Hindustan Times", "description": "Around 200 inmates at a mental hospital in Yerawada, India have been infected with conjunctivitis, or \"eye flu,\" in the past eight days. The hospital has created separate wards for male and female patients and is conducting daily screenings and isolation of s…", "url": "https://www.hindustantimes.com/cities/pune-news/200-inmates-infected-with-conjunctivitis-at-mental-hospital-officials-struggle-to-manage-spread-of-infection-101691584570819.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/08/09/1600x900/As-per-the-officials--eye-flu-cases-started-to-rep_1691585827926.jpg", "publishedAt": "2023-08-09T12:36:10Z", "content": "At least 200 inmates have been infected with conjunctivitis in the last eight days at the Regional Mental Hospital (RMH), Yerawada.\r\nAs per the officials, eye flu cases started to report last week. I… [+1973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Conjunctivitis Recovery: Follow These Do's And Don'ts To Take Care Of Your Eyes - NDTV", "description": "Conjunctivitis, also known as pink eye, is the most common type of eye infection. It is highly contagious and affects people of all ages.", "url": "https://www.ndtv.com/health/conjunctivitis-recovery-follow-these-dos-and-donts-to-take-care-of-your-eyes-4283510", "urlToImage": "https://c.ndtvimg.com/2022-06/71luksgo_allergic-conjunctivitis-home-remedies_625x300_17_June_22.jpg", "publishedAt": "2023-08-09T12:30:02Z", "content": "Conjunctivitis is an inflammation of the conjunctiva\r\nA rapid increase in conjunctivitis cases has been observed over the past month in India. The humid weather during monsoon offers a favourable env… [+2037 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nibedita Roy", "title": "What are Triglycerides? How Triglyceride lowering foods help in improving heart health - IndiaTimes", "description": "Increased levels of Triglycerides in the blood can have a negative impact on heart health and may also lead to insulin imbalance. Here's a list of foods that can help in lowering Triglyceride levels naturally.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/what-are-triglycerides-how-triglyceride-lowering-foods-help-in-improving-heart-health/photostory/102573127.cms", "urlToImage": "https://static.toiimg.com/photo/102573223.cms", "publishedAt": "2023-08-09T12:30:00Z", "content": "Inclusion of leafy greens like spinach, kale, broccoli can naturally help in reducing triglycerides levels. This is because of the rich concentration of vitamins, minerals, and fiber that support hea… [+136 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Yoga tips for immunity: 8 daily practices to fight infections during monsoon - Hindustan Times", "description": "During monsoon, it's important to follow a daily routine that can prepare our body to fight infections and boost overall well-being.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/yoga-tips-for-immunity-8-daily-practices-to-fight-infections-boost-wellness-during-monsoon-101691582650315.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/08/09/1600x900/Ch-p4xXUUAM4PuD_1636184037061_1691582773226.jpg", "publishedAt": "2023-08-09T12:17:20Z", "content": "While monsoon season is pleasant and rains can lift moods and spirits, diseases and infections often play spoilsport. Due to humidity and prolonged rains, bacteria and virus get the right atmosphere … [+3742 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Air pollution linked to rise in antibiotic resistance - INSIGHTSIAS - Insights IAS", "description": "Source: The Guardian   Context: A global study suggests that air pollution is contributing to a rise in antibiotic resistance, posing a significant threat to human health worldwide. The analysis shows a consistent link between increased air pollution and risi…", "url": "https://www.insightsonindia.com/2023/08/09/air-pollution-linked-to-rise-in-antibiotic-resistance/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2023/08/polution.jpg", "publishedAt": "2023-08-09T11:56:43Z", "content": null}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Conjunctivitis cases surge in Mumbai, a 210 pc increase in a week - mid-day.com", "description": "Mumbai has witnessed a sharp increase of 210 per cent in conjunctivitis cases within a single week", "url": "https://www.mid-day.com/mumbai/mumbai-news/article/conjunctivitis-cases-surge-in-mumbai-a-210-pc-increase-in-a-week-23302702", "urlToImage": "https://images.mid-day.com/images/images/2023/aug/aug9-eyes_d.jpg", "publishedAt": "2023-08-09T11:41:00Z", "content": "Mumbai has witnessed a sharp increase of 210 per cent in conjunctivitis cases within a single week. According to a report from the state government, Mumbai recorded 1,275 cases of conjunctivitis in t… [+2973 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Kim Schewitz", "title": "A 101-year-old neurologist who still works full time shares what he eats in a day - Business Insider India", "description": "Dr. Howard Tucker is 101 years old and still works full-time as a neurologist.He shared what he eats in a day on an episode of the mindbodygreen podcast. Dr.", "url": "https://www.businessinsider.in/science/health/news/a-101-year-old-neurologist-who-still-works-full-time-shares-what-he-eats-in-a-day/articleshow/102576961.cms", "urlToImage": "https://www.businessinsider.in/photo/102576961/a-101-year-old-neurologist-who-still-works-full-time-shares-what-he-eats-in-a-day.jpg?imgsize=195316", "publishedAt": "2023-08-09T11:41:00Z", "content": "Dr. Howard Tucker turned 101 last month.\r\nThe neurologist, who was born on July 10, 1922, in Cleveland, Ohio, still works full-time and lives with his wife of 66 years.\r\nTucker told the mindbodygreen… [+2909 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "5 incredible benefits of Pomegranate Peels for Sore Throat - Asianet Newsable ", "description": "Unveiling the Natural Remedy: 5 Big Benefits of Pomegranate Peels for Soothing Sore Throats. Pomegranates are renowned for their delicious seeds and juice, but did you know that their peels hold a treasure trove of health benefits?", "url": "https://newsable.asianetnews.com/lifestyle/5-incredible-benefits-of-pomegranate-peels-for-sore-throat-vma-eai-rz4fgx", "urlToImage": "https://static-ai.asianetnews.com/images/01h6v8yyxnk0e1w9a0vcx74a72/whatsapp-image-2023-08-02-at-18-49-07--1-_1200x630xt.jpg", "publishedAt": "2023-08-09T11:19:46Z", "content": "Unveiling the Natural Remedy: 5 Big Benefits of Pomegranate Peels for Soothing Sore Throats. Pomegranates are renowned for their delicious seeds and juice, but did you know that their peels hold a tr… [+2574 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Weight loss drug shows major cardiovascular benefits - FOX 5 New York", "description": "A new study found that the drug Wegovy cuts the risk of stroke and heart attacks by 20%.Subscribe to FOX 5 NY: https://www.youtube.com/fox5ny?sub_confirmatio...", "url": "https://www.youtube.com/watch?v=5L7xH1s3P6s", "urlToImage": "https://i.ytimg.com/vi/5L7xH1s3P6s/maxresdefault.jpg", "publishedAt": "2023-08-09T11:17:05Z", "content": null}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "CEPI partners with Gennova to develop mRNA vax tech against 'Disease X' - The Statesman", "description": "The Coalition for Epidemic Preparedness Innovations (CEPI) on Tuesday announced a new funding agreement with Pune-based Gennova Biopharmaceuticals to advance… <a href=\"https://www.thestatesman.com/technology/cepi-partners-with-gennova-to-develop-mrna-vax-tech…", "url": "https://www.thestatesman.com/technology/cepi-partners-with-gennova-to-develop-mrna-vax-tech-against-disease-x-1503209788.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/12/Coronavirus.jpg", "publishedAt": "2023-08-09T11:00:00Z", "content": "The Coalition for Epidemic Preparedness Innovations (CEPI) on Tuesday announced a new funding agreement with Pune-based Gennova Biopharmaceuticals to advance the development of their self-amplifying … [+2377 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Nutrition support shown to prevent TB, related deaths in India: Lancet study - ETHealthWorld", "description": "All patients received a monthly 10 kilograms food basket (rice, pulses, milk powder, oil) and multivitamins for 6 months. In family members, the intervention group received 5 kg rice and 1.5 kg pulses per head per month. After screening all household contacts…", "url": "https://health.economictimes.indiatimes.com/news/industry/nutrition-support-shown-to-prevent-tb-related-deaths-in-india-lancet-study/102572542", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-102572542,imgsize-25724,width-1200,height=765,overlay-ethealth/industry/nutrition-support-shown-to-prevent-tb-related-deaths-in-india-lancet-study.jpg", "publishedAt": "2023-08-09T10:34:46Z", "content": "New Delhi: A monthly food basket with adequate protein and multivitamins has been found to reduce new tuberculosis cases by nearly half among family members of TB patients in India, according to a st… [+4531 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Can CBT help type 2 diabetes and obesity patients implement lifestyle alterations? - News-Medical.Net", "description": "Researchers examine the impact of cognitive behavioral therapy (CBT) on lifestyle changes among type 2 diabetes and obesity patients.", "url": "https://www.news-medical.net/news/20230809/Can-CBT-help-type-2-diabetes-and-obesity-patients-implement-lifestyle-alterations.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_755850_1691573367467187.jpg", "publishedAt": "2023-08-09T10:25:00Z", "content": "In an article published in Scientific Reports, researchers examine the impact of cognitive behavioral therapy (CBT) on lifestyle changes among type 2 diabetes and obesity patients.\r\nStudy: Cognitive … [+5180 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Effect of mutations in cancer-driving genes across human cancers - News-Medical.Net", "description": "Effect of mutations in cancer-driving genes across human cancers.", "url": "https://www.news-medical.net/news/20230809/Effect-of-mutations-in-cancer-driving-genes-across-human-cancers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_755857_16915755168433452.jpg", "publishedAt": "2023-08-09T10:07:00Z", "content": "In a recent study published in Scientific Reports, researchers used multiple publically available cancer sequencing project datasets encompassing 20,331 primary tumor genomic sequences representing 4… [+5448 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra, Times Now Digital", "title": "8 Vegan Superfoods That Prevent Clogged Arteries - Times Now", "description": "8 vegan superfoods that prevent clogged arteries", "url": "https://www.timesnownews.com/web-stories/health/8-vegan-superfoods-that-prevent-clogged-arteries/photostory/102571170.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102572179,width-900,height-1200,resizemode-6.cms", "publishedAt": "2023-08-09T10:01:38Z", "content": "Lemons are citrus fruits that are delicious and provide a variety of vitamins, minerals, and antioxidants, including flavonoids. Lemons help decrease inflammation and prevent free radicals from oxidi… [+15 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Queensland scientists developing new vaccine to fight multiple sclerosis | 7NEWS - 7NEWS Australia", "description": "It's a crippling disease affecting 33,000 Australians. Now Aussie scientists have made a major breakthrough in the fight against multiple sclerosis. They're ...", "url": "https://www.youtube.com/watch?v=botSLQdyrZ4", "urlToImage": "https://i.ytimg.com/vi/botSLQdyrZ4/hqdefault.jpg", "publishedAt": "2023-08-09T09:44:28Z", "content": null}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "7 ways to boost blood circulation and increase longevity - Health shots", "description": "If you wish to live longer, you should know how to boost blood circulation. Good blood flow in your body is essential for overall bodily function and a strong immune system.", "url": "https://www.healthshots.com/how-to/tips-to-boost-blood-circulation/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/08/09135256/blood-circulation.jpg", "publishedAt": "2023-08-09T09:30:38Z", "content": "When it comes to health, it is common to focus on the big picture. However, overlooking small things can have notable negative effects on your overall well-being. One of them is maintaining healthy b… [+4952 chars]"}, {"source": {"id": null, "name": "GQ India"}, "author": "Saurav S", "title": "5 lifestyle habits to adopt once you’ve entered your 30s - GQ India", "description": "A new decade warrants a new set of habits", "url": "https://www.gqindia.com/content/5-lifestyle-habits-to-adopt-once-youve-entered-your-30s", "urlToImage": "https://assets.gqindia.com/photos/64d33fb78f837ce57057b422/16:9/w_1280,c_limit/_Lifestyle-habits-to-adopt-in-your-30s_001.jpg", "publishedAt": "2023-08-09T09:30:00Z", "content": "There are all kinds of habits - some we adopt willingly, and some others we have to adopt. Then there are those that we must adopt - habits that can make our lives simpler, easier &amp; more comforta… [+2225 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "CT imaging reveals that COVID-19 vaccination may protect against severe lung pathology - News-Medical.Net", "description": "Researchers determine how COVID-19 vaccination influences lung-sequelae-related pathology and the manifestation of severe infection.", "url": "https://www.news-medical.net/news/20230809/CT-imaging-reveals-that-COVID-19-vaccination-may-protect-against-severe-lung-pathology.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_755810_16915243898511179.jpg", "publishedAt": "2023-08-09T07:53:00Z", "content": "The rapid worldwide transmission of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) led to the coronavirus disease 2019 (COVID-19) pandemic. Since the start of the pandemic, scientis… [+5110 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The effectiveness of antimicrobial mouthwashes in reducing viral load in saliva of COVID-19 patients - News-Medical.Net", "description": "Researchers assess the effectiveness of three types of mouthwash in reducing the viral load of SARS-CoV-2 in the saliva of infected individuals.", "url": "https://www.news-medical.net/news/20230809/The-effectiveness-of-antimicrobial-mouthwashes-in-reducing-viral-load-in-saliva-of-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_755809_16915232394393729.jpg", "publishedAt": "2023-08-09T07:44:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic, which was caused by the rapid transmission of the severe acute respiratory disease coronavirus 2 (SARS-CoV-2), has claimed more than 6.9 million live… [+5183 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Dr. Arpita Chatterjee", "title": "5 best ingredients to add to your Skincare routine for reducing dark spots - Sportskeeda", "description": "Skin with dark spots can be a standard issue for many skincare fans.", "url": "https://www.sportskeeda.com/lifestyle/5-best-ingredients-add-skincare-routine-reducing-dark-spots", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/08/33687-16915135351027-1920.jpg", "publishedAt": "2023-08-09T07:36:26Z", "content": "Skin with dark spots can be a standard issue for many skincare fans. These spots are also comprehended as hyperpigmentation induced by sun exposure, hormonal shifts, pollutants, acne, and skin blemis… [+6298 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Nikita Toppo", "title": "Cooking Tips: 5 Common Mistakes To Avoid While Cooking Grains - Slurrp", "description": "Being an essential part of our daily diet, grains are very nutritious. They are rich in fibre, vitamins, minerals, and other nutrients that lower the risk of diabetes, control weight, and keep the heart healthy. But have you been cooking them correctly? Here …", "url": "https://www.slurrp.com/article/cooking-tips-5-common-mistakes-to-avoid-while-cooking-grains-1691561959811", "urlToImage": "https://images.slurrp.com/prodarticles/2vx4h4n1xi2.webp", "publishedAt": "2023-08-09T06:34:41Z", "content": "Being an essential part of our daily diet, grains are very nutritious. They are rich in fibre, vitamins, minerals, and other nutrients that lower the risk of diabetes, control weight, and keep the he… [+781 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rajeshwaari Kalla", "title": "Syphilis: Everything you need to know about the danger behind painless sores on genitals - Moneycontrol", "description": "Syphilis: Here's everything you need to know about this disease. Syphilis spreads through sexual contact and usually starts as a painless sore. But when the disease progresses, it passes through various stages, and the symptoms tend to change at every step.", "url": "https://www.moneycontrol.com/news/health-and-fitness/syphilis-sexually-transmitted-disease-safe-sex-condoms-everything-you-need-to-know-about-the-danger-behind-painless-sores-on-genitals-11131001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/08/Syphilis-causes-770x433.jpg", "publishedAt": "2023-08-09T05:34:40Z", "content": "If you notice a painless sore on the genitals, rectum, or in your mouth that eventually transforms into a rash, know that it could indicate an underlying condition called syphilis.\r\nA systemic infect… [+3119 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Diabetes: 7 body parts that can warn you of excessive blood sugar level - IndiaTimes", "description": "​Diabetes is spreading faster and several factors can be held accountable for this. A Lancet study estimated that by 2050, a total of 1.31 billion people are likely to be affected by diabetes. If we look at the number of affected people in the country, it is …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/diabetes-7-body-parts-that-can-warn-you-of-excessive-blood-sugar-level/photostory/102560371.cms", "urlToImage": "https://static.toiimg.com/photo/102560662.cms", "publishedAt": "2023-08-09T05:30:00Z", "content": "The skin, the body's largest organ, can offer subtle but significant clues about diabetes. Individuals with diabetes often experience dry, itchy skin due to dehydration resulting from frequent urinat… [+339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ambrish Mithal", "title": "Can insulin pumps control blood sugar better minus the pricks? - The Indian Express", "description": "While costs and stigma are hurdles, these devices reduce the number of pricks, can adjust insulin for different time periods of day and night, exercise, sickness, menstruation, exams and different day to day situations. Use of insulin pumps reduces episodes o…", "url": "https://indianexpress.com/article/health-wellness/insulin-pumps-managing-diabetes-artificial-intelligence-pancreas-8883468/", "urlToImage": "https://images.indianexpress.com/2023/08/insulin.jpg", "publishedAt": "2023-08-09T05:20:49Z", "content": "In all my years of practice as an endocrinologist, I have not come across any patient who is enthusiastic about taking insulin. The fear of insulin pervades all ages and cuts across continents. A hug… [+5856 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Understanding Conjunctivitis - The New Indian Express", "description": "The tears and eye secretions of the infected person are the source of spread of the infection and hands are means of transmitting it to one’s eyes.", "url": "https://www.newindianexpress.com/cities/hyderabad/2023/aug/09/understanding-conjunctivitis-2603294.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2023/8/9/w600X390/Conjunctivitis.jpg", "publishedAt": "2023-08-09T05:10:00Z", "content": "HYDERABAD: Conjunctivitis or pink eye is a seasonal infection affecting the front portion of the eyeball. Madras eye was the name given by the colonial British doctors stationed in Madras as it was r… [+5807 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Brain stimulation improves gait function in Parkinson’s disease patients: Study - DTNEXT", "description": "Patients with Parkinson's disease (PD), an illness that affects millions of people worldwide, experience gait-related abnormalities that significantly lower their quality of life.", "url": "https://www.dtnext.in/lifestyle/wellbeing/brain-stimulation-improves-gait-function-in-parkinsons-disease-patients-study-728907", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/08/09/755062-untitleddesign7.jpg", "publishedAt": "2023-08-09T05:01:35Z", "content": "TOKYO: Patients with Parkinson's disease (PD), an illness that affects millions of people worldwide, experience gait-related abnormalities that significantly lower their quality of life. Despite the … [+4120 chars]"}, {"source": {"id": null, "name": "Mumbailive.com"}, "author": null, "title": "Chronic Pain: Symptoms, Cause, Treatments - Here's All You Need To Know - Mumbai Live", "description": "What Is Chronic Pain Acute pain can occur for a short while after injury but tends to disappear after the healing is complete Typical solutions such as pain relief gel or pain relief patches are enough to support healing Chronic pain on the other hand continu…", "url": "https://www.mumbailive.com/en/lifestyle/chronic-pain-symptoms-cause-treatments-here's-all-you-need-to-know-80243", "urlToImage": "https://www.mumbailive.com/images/media/images/chronic_pain_1691503485357.jpg?bg=4554a2&crop=288.5625%2C162%2Cnull%2C0&fit=crop&fitToScale=h%2C1368%2C768&fm=webp&h=606.3157894736842&height=162&w=1080&width=311", "publishedAt": "2023-08-09T04:00:00Z", "content": "What Is Chronic Pain\r\nAcute pain can occur for a short while after injury but tends to disappear after the healing is complete. Typical solutions such as pain relief gel or pain relief patches are en… [+4131 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "100 dengue cases in South Dum Dum; 149 suffer in BMC areas - IndiaTimes", "description": "More than 100 dengue cases and one death have been reported from South Dum Dum Municipality areas this year so far. The civic authorities are entering", "url": "https://timesofindia.indiatimes.com/city/kolkata/100-dengue-cases-in-south-dum-dum-149-suffer-in-bmc-areas/articleshow/102555899.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102563745,width-1070,height-580,imgsize-1445465,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-08-09T02:52:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sheezan Nezami", "title": "11 dengue cases recorded in Patna district since July - IndiaTimes", "description": "Altogether 11 dengue cases have so far been recorded in Patna district since July this year. Among the affected persons, some had travel history. Deng", "url": "https://timesofindia.indiatimes.com/city/patna/11-dengue-cases-recorded-in-patna-district-since-july/articleshow/102552932.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102552956,width-1070,height-580,imgsize-985377,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-08-09T00:28:00Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "2 new human cases of West Nile virus detected - FOX31 Denver", "description": "Two new cases of West Nile virus have been detected in Jefferson and Broomfield counties. Alex Rose explains what the Colorado Department of Public Health an...", "url": "https://www.youtube.com/watch?v=jUG9_uVXTpA", "urlToImage": "https://i.ytimg.com/vi/jUG9_uVXTpA/maxresdefault.jpg", "publishedAt": "2023-08-08T23:53:09Z", "content": null}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers discover possible new biomarker of MS-like autoimmune disease - News-Medical.Net", "description": "It has been known for several years that the diagnosis \"multiple sclerosis\" conceals a whole range of different illnesses, each requiring customized treatment. Researchers at the University of Basel and the University Hospital of Basel have now described a po…", "url": "https://www.news-medical.net/news/20230808/Researchers-discover-possible-new-biomarker-of-MS-like-autoimmune-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/92036744-620x480.jpg", "publishedAt": "2023-08-08T19:23:00Z", "content": "It has been known for several years that the diagnosis \"multiple sclerosis\" conceals a whole range of different illnesses, each requiring customized treatment. Researchers at the University of Basel … [+3944 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Tanisha Rajput", "title": "5 Famous People Diagnosed with ALS - WION", "description": "Here are 5 famous people diagnosed with ALS. Tap!", "url": "https://www.wionews.com/web-stories/trending/5-famous-people-diagnosed-with-als-1691510031237", "urlToImage": null, "publishedAt": "2023-08-08T16:08:34Z", "content": "The famous baseball player was diagnosed with the illness, which damaged the motor neurons in his brain cutting the connection between the brain and muscles. He tried playing with ALS, but it became … [+43 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Ayurvedic infertility pills cause lead poisoning in Canadian woman: Report - Daijiworld.com", "description": "Toronto, Aug 8 (IANS): A 39-year-old woman in Canada experienced lead poisoning and landed in hospital after using Ayurvedic medicines to treat infertility, according to a case report in CMAJ (Canadian Medical Association Journal) on Tuesday.", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1108059", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-08-08T14:32:15Z", "content": "Toronto, Aug 8 (IANS): A 39-year-old woman in Canada experienced lead poisoning and landed in hospital after using Ayurvedic medicines to treat infertility, according to a case report in CMAJ (Canadi… [+2271 chars]"}, {"source": {"id": null, "name": "News24online.com"}, "author": "Saurav Gupta", "title": "How well has the COVID-19 vaccine aged? - News24", "description": "The efficacy of Covid vaccines in older age groups varies depending on the type of vaccine and the study design.", "url": "https://news24online.com/lifestyle/how-well-has-the-covid-19-vaccine-aged/157879/", "urlToImage": "https://news24online.com/wp-content/uploads/2023/08/New-Project-2023-08-08T185714.675.webp", "publishedAt": "2023-08-08T13:27:48Z", "content": "The current count of active cases worldwide stands at over 20 million (data accurate as per the time of writing this article), of which, 99.8% conform as mild cases (source: Worldometers). Now that t… [+3879 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Research Finds Short Bursts Of Daily Activity Linked To Reduced Cancer Risk - India Education Diary", "description": "Promising new research suggests a total of just 4.5 minutes of vigorous activity that makes you huff and puff during daily tasks could reduce the risk of some cancers by up to 32 percent.Published in JAMA Oncology and led by the University of Sydney,", "url": "https://indiaeducationdiary.in/research-finds-short-bursts-of-daily-activity-linked-to-reduced-cancer-risk/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/08/health-main.jpg", "publishedAt": "2023-08-08T13:23:54Z", "content": "Promising new research suggests a total of just 4.5 minutes of vigorous activity that makes you huff and puff during daily tasks could reduce the risk of some cancers by up to 32 percent.\r\nPublished … [+5650 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Dengue scare: Why second infection is deadlier; know how symptoms change - Hindustan Times", "description": "The severity of a dengue infection can be higher when people experience a second attack. Know how the disease's symptoms change in case of reinfection. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/dengue-scare-why-second-infection-is-deadlier-know-how-symptoms-change-in-case-of-reinfection-101691491604733.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/08/08/1600x900/The-dengue-case-count-in-Ghaziabad-stood-at-29-til_1690962967873_1691491729713.jpg", "publishedAt": "2023-08-08T10:53:20Z", "content": "As dengue cases rise rapidly across many parts of the country and Delhi witnesses a remarkable surge in people suffering from the disease, it's time to follow all precautions, even if you have recove… [+5250 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Urbanisation driving inflammatory bowel disease in young Indians: Study - Ahmedabad Mirror", "description": "Urbanisation driving  inflammatory bowel disease in young Indians: Study", "url": "https://www.ahmedabadmirror.com/urbanisation-driving-inflammatory-bowel-disease-in-young-indians-study/81861568.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1691431640682.jpg-org", "publishedAt": "2023-08-08T09:34:05Z", "content": "Increased urbanisation is leading to a surge in inflammatory bowel disease (IBD) among young adults and even adolescents in Indians, according to the world’s largest population-based study on 30,000 … [+2260 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hypocalcemia: Signs, Causes, Treatment & Prevention - NDTV", "description": "Below we discuss the signs, causes, treatment and prevention tips for hypocalcemia.", "url": "https://www.ndtv.com/health/hypocalcemia-signs-causes-treatment-prevention-4279296", "urlToImage": "https://c.ndtvimg.com/2022-11/mqasjqno_-calcium-deficiency-and-bone-health_625x300_01_November_22.jpg", "publishedAt": "2023-08-08T08:23:56Z", "content": "Low levels of calcium can lead to muscle cramps, twitching, or spasms, particularly in the hands and feet\r\nHypocalcemia is a condition characterised by low levels of calcium in the blood. Low levels … [+3973 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Desk", "title": "What is Vitamin P & 5 Ways It Keeps You Healthy - WION", "description": "What is Vitamin P & 5 Ways It Keeps You Healthy", "url": "https://www.wionews.com/web-stories/life-fun/health-and-wellness/what-is-vitamin-p-5-ways-it-keeps-you-healthy-1691478124278", "urlToImage": null, "publishedAt": "2023-08-08T07:34:20Z", "content": "Some food items with high flavonoid content include onions, blueberries, bananas, citrus fruits, red wine, and dark chocolate."}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Study of the Clinical Profile and Respiratory Index of Severity in Children (RISC) Score in Infants Admitted With Acute Respiratory Infections at a Tertiary Care Hospital - Cureus", "description": "Background\n\nPneumonia is a major infectious cause of mortality in young children worldwide. The Respiratory Index of Severity in Children (RISC) score was designed with the intent to provide an objective mean to quantify the severity of lower respiratory trac…", "url": "https://www.cureus.com/articles/171807-a-study-of-the-clinical-profile-and-respiratory-index-of-severity-in-children-risc-score-in-infants-admitted-with-acute-respiratory-infections-at-a-tertiary-care-hospital", "urlToImage": "https://assets.cureus.com/uploads/figure/file/685065/article_river_7a815a90354411eea2786597fffafb2e-RISC-Scoring-System-1-.png", "publishedAt": "2023-08-08T04:17:21Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Health Tips: 5 Amazing Benefits Of Consuming Mushrooms In Your Regular Diet - Jagran English", "description": "Health Benefits Of Mushrooms There are a wide variety of foods that we can consume for a healthy and fit body without compromising our taste buds Mushrooms are ideally low-calorie food that offers impressive benefits for a healthy and fit body", "url": "https://english.jagran.com/lifestyle/health-tips-amazing-benefits-of-consuming-mushrooms-in-your-regular-diet-10092406", "urlToImage": "https://imgeng.jagran.com/images/2023/aug/health-benefits-of-mushroom1691466609441.jpg", "publishedAt": "2023-08-08T03:59:51Z", "content": "Health Benefits Of Mushrooms: Mushrooms are an ideal vegetable packed with tons of essential nutrients, which make them a great addition to your regular diet. Not only are mushrooms healthy but also … [+2097 chars]"}]}