{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "Artificial sweeteners not safe, may up cancer risk: Study - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/todays-paper/health-todays-paper/artificial-sweeteners-not-safe-may-up-cancer-risk-study", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-03%2F5ec30e79-e432-4f1b-bd00-3ea831d8a6f8%2FAritificial_sugar.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-28T19:30:00Z", "content": "London: Love to consume soft drinks with no added sugars, table-top sweeteners, and yogurt/cottage cheese containing artificial sweeteners? Beware, you may be at increased risk of cancer, warned a st… [+438 chars]"}, {"source": {"id": null, "name": "The List"}, "author": "Marica Laing", "title": "10 Things You (Probably) Do Every Day That Affect Your Gut Health - The List", "description": "Much research these days shows the role that our gut has on our overall health. But there are actually everyday things we can do to aid in our gut health.", "url": "https://www.thelist.com/813449/10-things-you-probably-do-every-day-that-affect-your-gut-health/", "urlToImage": "https://www.thelist.com/img/gallery/10-things-you-probably-do-every-day-that-affect-your-gut-health/l-intro-1648489337.jpg", "publishedAt": "2022-03-28T19:24:00Z", "content": "Suffering from chronic constipation? It's probably your gut trying to tell you it's thirsty! According to Healthline, water is imperative to keep your gut bacteria balanced. Failing to drink enough w… [+1171 chars]"}, {"source": {"id": null, "name": "DVIDS"}, "author": null, "title": "National Kidney Month Focuses on Raising Awareness of CKD - DVIDS", "description": "Dietitian specializes in nutrition for kidney patients.", "url": "https://www.dvidshub.net/news/417310/national-kidney-month-focuses-raising-awareness-ckd", "urlToImage": "https://cdn.dvidshub.net/media/thumbs/photos/2203/7112166/1000w_q75.jpg", "publishedAt": "2022-03-28T18:03:00Z", "content": "Approximately 37 million people in the United States are estimated to have chronic kidney disease (CKD), and as many as nine in 10 people are not aware of it, according to the National Institute of D… [+4623 chars]"}, {"source": {"id": null, "name": "The Detroit News"}, "author": "Meredith Cohn, The Detroit News", "title": "A broccoli a day keeps COVID (and colds) away? Researchers are looking into it - Detroit News", "description": "Researchers at Johns Hopkins Children’s Center found that a chemical compound called sulforaphane found in abundance in broccoli cabbage, kale and Brussels sprouts might slow growth of coronaviruses such as those that cause COVID-19 and the common cold.", "url": "https://www.detroitnews.com/story/life/2022/03/28/broccoli-day-keeps-covid-and-colds-away-researchers-looking-into/7194420001/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/03/28/PDTN/d2cd4b60-a5bd-4212-89ee-b2725bba55eb-LIFE-HEALTH-CORONAVIRUS-BROCCOLI-DMT.jpg?auto=webp&crop=2120,1193,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-03-28T17:52:56Z", "content": "Baltimore — Your mom was right: Eat your vegetables!\r\nVegetables have long been a mainstay of a healthy diet, but there may be one more reason to eat your greens. They may stave off a bad COVID-19 in… [+2421 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Natalie P.", "title": "What Is the Best Seven Day Diet Plan for Weight Loss? - Sportskeeda", "description": "Fad diets and quick weight-loss have been all the rage for a few years now, with celebrities and sportspeople endorsing various meal plans regularly.", "url": "https://www.sportskeeda.com/health-and-fitness/the-best-seven-day-diet-right-now", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/03/bb649-16484835619049-1920.jpg", "publishedAt": "2022-03-28T17:51:55Z", "content": "Fad diets and quick weight-loss have been all the rage for a few years now, with celebrities and sportspeople endorsing various meal plans regularly.\r\nAmongst the additional factors involved with die… [+3988 chars]"}, {"source": {"id": null, "name": "Thebeet.com"}, "author": "maxwellrabb", "title": "Study: Eat These Plant-Based Foods To Lower Heart Disease Risk - The Beet", "description": "A report published in Advances in Nutrition just revealed that increased levels of plant-based omega-3s could help reduce risk factors for heart disease.", "url": "https://thebeet.com/eat-these-plant-based-foods-to-lower-heart-disease-risk-study-says/", "urlToImage": "https://townsquare.media/site/959/files/2022/03/attachment-GettyImages-1281233480.jpg?w=1200&h=0&zc=1&s=0&a=t&q=89", "publishedAt": "2022-03-28T17:47:47Z", "content": "A common misconception says that eating salmon, mackerel, and other seafood is the only way to get enough omega-3s, but new research reveals that loading up on the plant-based version of this essenti… [+4728 chars]"}, {"source": {"id": null, "name": "Midland Reporter-Telegram"}, "author": "American Heart Association News", "title": "Pre-existing disabilities, dementia can interfere with stroke diagnosis and treatment - Midland Reporter-Telegram", "description": "People with disabilities or dementia may not get timely or appropriate treatment when...", "url": "https://www.mrt.com/news/article/Pre-existing-disabilities-dementia-can-interfere-17034063.php", "urlToImage": "https://www.mrt.com/img/pages/article/opengraph_default.jpg", "publishedAt": "2022-03-28T17:41:37Z", "content": "People with disabilities or dementia may not get timely or appropriate treatment when they have a stroke, according to a new report that says those conditions can make it challenging to assess the se… [+3844 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Identifying risk factors following ICH strokes: New research shows correlations that lead to worse patient outcomes - Science Daily", "description": "Researchers reveal new insights into how different risk factors following intracerebral hemorrhages can affect patient outcomes.", "url": "https://www.sciencedaily.com/releases/2022/03/220328121359.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-28T16:52:33Z", "content": "A new study led by University of Cincinnati researchers provides new insights on how different risk factors following one of the most severe types of stroke can affect patient outcomes.Daniel Woo, MD… [+4347 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Management of antithrombotics in GI bleed, endoscopy addressed - Medical Xpress", "description": "In a clinical practice guideline issued jointly by the American College of Gastroenterology and the Canadian Association of Gastroenterology and published online March 17 in the American Journal of Gastroenterology, updated recommendations are presented for t…", "url": "https://medicalxpress.com/news/2022-03-antithrombotics-gi-endoscopy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/management-of-antithro.jpg", "publishedAt": "2022-03-28T16:30:01Z", "content": "In a clinical practice guideline issued jointly by the American College of Gastroenterology and the Canadian Association of Gastroenterology and published online March 17 in the American Journal of G… [+2248 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Aging Baby Boomers keep on using... bringing substance abuse, and treatment, into old age - Medical Xpress", "description": "The rate at which older adults were treated for substance abuse increased sharply from 2000 to 2017, UConn Health researchers report in the March 28 issue of the Journal of Clinical Psychiatry. The rates of older adults getting treatment increased substantial…", "url": "https://medicalxpress.com/news/2022-03-aging-baby-boomers-substance-abuse.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/addiction.jpg", "publishedAt": "2022-03-28T16:25:15Z", "content": "The rate at which older adults were treated for substance abuse increased sharply from 2000 to 2017, UConn Health researchers report in the March 28 issue of the Journal of Clinical Psychiatry. The r… [+2689 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Jeff Csatari", "title": "Eating Habits for a Healthy Gut as You Age, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "Research suggests establishing healthy eating habits for your gut could be even more important as you age. A few dietitians share their tips.", "url": "http://www.eatthis.com/healthy-gut-habits-aging/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/fermented-foods.jpg?quality=82&strip=all", "publishedAt": "2022-03-28T15:50:22Z", "content": "Research indicates that dysbiosis, or the imbalance in the microflora of your gut, can influence all kinds of health problemsmetabolic diseases like obesity and diabetes, cardiovascular disease, immu… [+5310 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "COVID-19 vaccination during pregnancy does not increase complications around the time of childbirth, study finds: Study of Ontario pregnancies provides further evidence on safety of mRNA vaccines during pregnancy - Science Daily", "description": "Researchers have found that receiving a COVID-19 vaccine during pregnancy does not lead to increases in the frequency of complications around the time of childbirth. The findings provide further assurances about the safety of mRNA vaccines for this particular…", "url": "https://www.sciencedaily.com/releases/2022/03/220328112701.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-28T15:45:18Z", "content": "Researchers have found that receiving a COVID-19 vaccine during pregnancy does not lead to increases in the frequency of complications around the time of childbirth. The findings, which are published… [+1957 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Sputnik V become first COVID vaccine with proven efficacy on HIV patients - Mint", "description": "Based on data from more than 24,000 HIV+ patients in Moscow on antiretroviral therapy (ART), Sputnik V’s efficacy was 79%.", "url": "https://www.livemint.com/companies/news/sputnik-v-become-first-covid-vaccine-with-proven-efficacy-on-hiv-patients-11648480290771.html", "urlToImage": "https://images.livemint.com/img/2022/03/28/600x338/Russia_Sputnik_V_1642401223202_1648481094098.jpg", "publishedAt": "2022-03-28T15:25:33Z", "content": "Sputnik V became worlds first COVID vaccine with proven efficacy for people living with HIV, a new study showed. The study has been published by The Lancet."}, {"source": {"id": null, "name": "ZME Science"}, "author": "Alexandru Micu", "title": "Non-hormonal male birth control pill prototype is 99% effective in mice - ZME Science", "description": "If everything goes well, it could be commercially available in the next 5 years.", "url": "https://www.zmescience.com/medicine/male-non-hormonal-contraceptive-pill-89347373/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/03/tablets-5620566_1280.jpg", "publishedAt": "2022-03-28T14:31:12Z", "content": "New research reports on very promising results with the much-desired male contraceptive pill — in mice.\r\nImage credits Heung Soon.\r\nBirth control options for men today are quite limited: there’s cond… [+4277 chars]"}, {"source": {"id": null, "name": "Egypt Independent"}, "author": "CNN", "title": "Studies link Covid-19 infection with increased risk of new diabetes diagnosis - Egypt Independent", "description": "(CNN) - Over a year after recovering from a Covid-19 infection, Jennifer Hobbs is adjusting to her new normal: brain fog, joint pain, elevated liver enzymes and, now, type 2 diabetes. Hobbs had predia", "url": "https://www.egyptindependent.com/studies-link-covid-19-infection-with-increased-risk-of-new-diabetes-diagnosis/", "urlToImage": "https://amayei.nyc3.digitaloceanspaces.com/2021/10/4c2d5f09-01ef-48ef-b52e-f227efafbdb3_65209e06.jpg", "publishedAt": "2022-03-28T14:17:37Z", "content": "(CNN) – Over a year after recovering from a Covid-19 infection, Jennifer Hobbs is adjusting to her new normal: brain fog, joint pain, elevated liver enzymes and, now, type 2 diabetes. Hobbs had predi… [+7560 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "How the COVID-19 pandemic changed our approach to sore throats and runny noses - Economic Times", "description": "If you have cold symptoms and return negative rapid antigen tests, isolating isn't mandatory - but it's a good idea.", "url": "https://economictimes.indiatimes.com/magazines/panache/how-the-covid-19-pandemic-changed-our-approach-to-sore-throats-and-runny-noses/articleshow/90499876.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90500046,width-1070,height-580,imgsize-59474,overlay-etpanache/photo.jpg", "publishedAt": "2022-03-28T13:53:00Z", "content": "As we head towards winter, the likelihood of picking up a pesky cold increases. But COVID changes how we approach sore throats and runny noses. \r\nIf you have cold symptoms and return negative rapid a… [+5214 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Andrea Hargraves", "title": "Increase in dengue cases in Santa Catarina requires intensification of preventive measures - brytfmonline.com", "description": "With more than 500 dengue cases recorded in Santa Catarina in the first quarter of...", "url": "https://www.brytfmonline.com/increase-in-dengue-cases-in-santa-catarina-requires-intensification-of-preventive-measures/", "urlToImage": null, "publishedAt": "2022-03-28T13:49:30Z", "content": "With more than 500 dengue cases recorded in Santa Catarina in the first quarter of 2022 alone, the passwords are alert and prevention. According to the state health department, through the Directorat… [+1349 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Children age 0-3 months with brain tumours shows five-year survival: Study - The Siasat Daily", "description": "Aurora: Researchers from the University of Colorado (CU) Cancer Center has found that the youngest patients with brain tumours - those ages from 0 to 3 months - have about half the five-year survival rate as children ages 1 to 19. The study was published in t…", "url": "https://www.siasat.com/children-age-0-3-months-with-brain-tumours-shows-five-year-survival-study-2298439/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/brain-_mar28.jpg", "publishedAt": "2022-03-28T13:46:00Z", "content": "Aurora: Researchers from the University of Colorado (CU) Cancer Center has found that the youngest patients with brain tumours – those ages from 0 to 3 months – have about half the five-year survival… [+5028 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Omicron+Delta recombinant hints emergence of supervirus, expert warns; explains key features of next COVID variant - Mint", "description": "Experts pointed out that hybrid variants (recombinants) need to be watched closely as they can pick up the best parts of both and quickly develop into a supervirus", "url": "https://www.livemint.com/science/news/omicron-delta-recombinant-hints-emergence-of-supervirus-expert-warns-explains-key-features-of-next-covid-variant-11648471676858.html", "urlToImage": "https://images.livemint.com/img/2022/03/28/600x338/Omicron_Delta_recombinant_1648474428984_1648474429190.jpg", "publishedAt": "2022-03-28T13:42:22Z", "content": "Since Omicron and Delta recombinant virus came into the picture constant studies are being conducted to find out how potent or transmissible it could be. However, experts pointed out that hybrid vari… [+2607 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "Why HIV remains in human body even after antiretroviral therapy - India TV News", "description": "Researchers from the University of Alberta in Canada have revealed a possible answer to the mystery of why infected people can't get rid of HIV altogether. The team found that in HIV patients, killer T cells -- a type of white blood cells responsible for iden…", "url": "https://www.indiatvnews.com/health/why-hiv-remains-in-human-body-even-after-antiretroviral-therapy-2022-03-28-766327", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/hiv-1648473243.jpg", "publishedAt": "2022-03-28T13:14:52Z", "content": "While antiretroviral therapy (ART) is known to limit HIV replication leading to elimination of most infected cells, the virus is never fully eliminated from the human body. It tends to linger in some… [+2104 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Brain Fog And Concentration Result of Long Covid, Finds Study - News18", "description": "The only way of dealing with Long Covid or any of the variants of the virus is taking as many precautions as possible.", "url": "https://www.news18.com/news/lifestyle/brain-fog-and-concentration-result-of-long-covid-finds-study-4912367.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/covid-19-163725361816x9.png", "publishedAt": "2022-03-28T13:14:26Z", "content": "Covid-19 has shown too many variations in the symptoms that people suffer from when they contract the virus. Some face these symptoms for less time and others deal with it for longer periods. While m… [+1942 chars]"}, {"source": {"id": null, "name": "IFLScience"}, "author": "Dr Alfredo Carpineti", "title": "What Is Alopecia, And Is There A Cure? - IFLScience", "description": "It is normal to lose a certain amount of hair; we lose somewhere between 50-100 hairs a day. However, not all hair loss is the same. Aging causes hair thin", "url": "https://www.iflscience.com/health-and-medicine/what-is-alopecia-and-is-there-a-cure/", "urlToImage": "https://cdn.iflscience.com/images/f915de37-bd4a-502f-8cf1-e898a868f4fd/default-1648467187-image-credit-suthikait-teerawattanaphan-shutterstock-com.jpg", "publishedAt": "2022-03-28T13:09:00Z", "content": "It is normal to lose a certain amount of hair; we lose somewhere between 50-100 hairs a day. However, not all hair loss is the same. Aging causes hair thinning and hair loss, particularly in men. Mal… [+3794 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Carbohydrates are the key to a healthy diet according to a nutrition expert - Code List", "description": "Although carbohydrates have had a bad name for years - considered a blight on some popular diets - nutrition experts remind us that carbohydrates are a key ingredient of a healthy diet. Carla Duenas, RDN, CDCES, Registered Dietitian with Baptist Health South …", "url": "https://codelist.biz/2022/03/28/carbohydrates-are-the-key-to-a-healthy-diet-according-to-a-nutrition-expert/", "urlToImage": "https://baptisthealth.net/baptist-health-news/wp-content/uploads/2022/03/shutterstock_1155446311.jpg", "publishedAt": "2022-03-28T12:56:24Z", "content": "Although carbohydrates have had a bad name for years – considered a blight on some popular diets – nutrition experts remind us that carbohydrates are a key ingredient of a healthy diet.\r\nCarbohydrate… [+5833 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "English publisher", "title": "Djibouti Ministry of Health launches round two of nationwide polio vaccination campaign - WHO Regional Office for the Eastern Mediterranean", "description": "", "url": "http://www.emro.who.int/polio/polio-news/djibouti-ministry-of-health-launches-round-two-of-nationwide-polio-vaccination-campaign.html?format=html", "urlToImage": "http://www.emro.who.int/images/stories/polio/polio-vaccination-campaign-djibouti.jpg", "publishedAt": "2022-03-28T12:53:02Z", "content": "More than 150 000 children under the age of five across Djibouti are targeted to receive a second dose of polio vaccine, following the first supplementary dose given in round one of the campaign in F… [+2848 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "IANS", "title": "Lifestyle changes during COVID-19 may be behind a spike in the cases of liver disease - Times of India", "description": "The retrospective study led by researchers at Osaka City University in Japan revealed that cases of metabolic dysfu", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/lifestyle-changes-during-covid-19-may-be-behind-a-spike-in-the-cases-of-liver-disease/articleshow/90497765.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-90498191,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-96364/90498191.jpg", "publishedAt": "2022-03-28T12:26:00Z", "content": "Lifestyle changes triggered rise in liver disease during the first year of the Covid-19 pandemic, according to a new study.\r\nThe retrospective study led by researchers at Osaka City University in Jap… [+2287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Study Finds New Type Of UV Light Makes Indoor Air As Safe As Outdoors - Swachh India NDTV", "description": "Using far-UVC light in places where people gather indoors could help prevent the next pandemic, finds a new study", "url": "https://swachhindia.ndtv.com/study-finds-new-type-of-uv-light-makes-indoor-air-as-safe-as-outdoors-67491/", "urlToImage": "https://w.ndtvimg.com/sites/3/2022/03/28173935/660x330-covid-2.jpg", "publishedAt": "2022-03-28T12:17:12Z", "content": "New York: According to a new study led by Columbia University, a new type of ultraviolet light is safe for people. It took less than five minutes to reduce the level of indoor airborne microbes by mo… [+7417 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The potential risk of SARS-CoV-2 transmission through fomites contaminated by hospitalized COVID-19 patients - News-Medical.Net", "description": "Researchers evaluated the potential risk of SARS-CoV-2 transmission through fomites contaminated by hospitalized COVID-19 patients during coughing or intense moistening with saliva.", "url": "https://www.news-medical.net/news/20220328/The-potential-risk-of-SARS-CoV-2-transmission-through-fomites-contaminated-by-hospitalized-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_708705_16484690045444443.jpg", "publishedAt": "2022-03-28T12:06:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers evaluated the potential risk of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) transmission through fomites contami… [+5376 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Tuberculosis: Medicinal and alternative therapies to treat TB - Hindustan Times", "description": "With emergence of multi-drug-resistant TB, an increasing need has been felt to find adjuvant therapies and herbal remedies that can aid patient recovery and contain the toxic effects of chemical-based drugs. Doctors believe practicing specific alternative the…", "url": "https://www.hindustantimes.com/lifestyle/health/tuberculosis-medicinal-and-alternative-therapies-to-treat-tb-101648467176295.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/28/1600x900/towfiqu-barbhuiya-C-zwLtPSErc-unsplash_1648467640693_1648467657919.jpg", "publishedAt": "2022-03-28T11:51:33Z", "content": "According to the World Health Organization, tuberculosis or TB remains one of the worlds deadliest infectious killers as each day, over 4,100 people lose their lives to it and close to 28,000 people … [+4567 chars]"}, {"source": {"id": null, "name": "Cityspidey.com"}, "author": null, "title": "Ways to burn visceral fat with walking - CitySpidey.com", "description": "High levels of Visceral body fat can have immense health complications", "url": "https://www.cityspidey.com/news/17079/ways-to-burn-visceral-fat-with-walking", "urlToImage": "https://cityspideynews.s3.amazonaws.com/uploads/spidey/202203/visceral-cover-1648464625.webp", "publishedAt": "2022-03-28T10:50:34Z", "content": "Belly fat is easily visible and losing it is the most common health  goal many individuals want to achieve. Although this may be the  topmost priority for you, have you ever focused on visceral body … [+2778 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Dementia risk increases in women due to this commonly prescribed drug - Times of India", "description": "The condition affects the elderly more prominently than others and the signs start reflecting clearly after 65 years.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/dementia-risk-increases-in-women-due-to-this-commonly-prescribed-drug/photostory/90494885.cms", "urlToImage": "https://static.toiimg.com/photo/90494977.cms", "publishedAt": "2022-03-28T10:45:00Z", "content": "During the study, the researchers looked at 14,542 volunteer female nurses living in the U.S. The participants were asked to complete a self-administered computerised test to measure aspects of their… [+478 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Monit Khanna", "title": "Stem Cell Research Close To Finding Type-1 Diabetes Cure In Near Future - Indiatimes.com", "description": "A novel stem cell research could be the answer for one day curing Type-1 diabetes in individuals and helping them live better lives.                         UnsplashAlso Read: Peptides Flexibility More Effective In Treating Type-2 Diabetes, Finds StudyDevelop…", "url": "https://www.indiatimes.com/technology/science-and-future/stem-cell-research-type-1-diabetes-565496.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/Facebook-Image---2022-03-28T132147623_62416a3875012.jpg", "publishedAt": "2022-03-28T10:42:45Z", "content": "A novel stem cell research could be the answer for one day curing Type-1 diabetes in individuals and helping them live better lives. \r\nUnsplash\r\nAlso Read: Peptides Flexibility More Effective In Trea… [+1961 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Health Desk", "title": "List of all the Important Vitamins you should include in your diet plan - India TV News", "description": "Vitamin not only adds nutritional value to one's body but, also helps in the overall growth of bodily functions. So, here is a list of all important vitamins one should add to their diet plan to lead a healthy life.", "url": "https://www.indiatvnews.com/health/list-of-all-the-important-vitamins-you-should-include-in-your-diet-plan-2022-03-28-766244", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-25-1648465140.jpg", "publishedAt": "2022-03-28T10:36:45Z", "content": "<ul><li>Important Vitamin that help in bodily growth. </li><li>List of Vitamin A to Vitamin K food rich with Nutrient. </li><li>Proper intake of vitamins, minerals, and nutrients reduces health probl… [+2216 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Omicron BA.2 viral load twice as COVID BA.1 subvariant, warns expert. What does it indicate? Read here - Mint", "description": "The increased viral load in the upper pharynx upon BA.2 infection may provide part of the explanation why Omicron BA.2 is more transmissible than variant across populations.", "url": "https://www.livemint.com/science/health/omicron-ba-2-viral-load-twice-as-covid-ba-1-subvariant-warns-expert-what-does-it-indicate-11648457863309.html", "urlToImage": "https://images.livemint.com/img/2022/03/28/600x338/Omicron__1648460257202_1648460257456.jpg", "publishedAt": "2022-03-28T09:38:20Z", "content": "The viral load for Omicron BA.2 is twice as much as the previously identified subvariant Omicron BA.1, a new study has revealed. And authors further explained, the increased viral load in the upper p… [+1436 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Nanobodies may stop infection from a range of COVID-19 variants - Health Europa", "description": "Karolinska Institutet researchers have identified that nanobodies from an alpaca may be effective at neutralising SARS-CoV-2 variants.", "url": "https://www.healtheuropa.eu/nanobodies-may-stop-infection-from-a-range-of-covid-19-variants/114428/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/03/©-iStock-koto_feja.jpg", "publishedAt": "2022-03-28T09:12:53Z", "content": "The Karolinska Institutet team has designed a new method for discovering potent miniature antibodies called nanobodies that can be employed to mitigate COVID-19 infection. The novel strategy has enab… [+3103 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Drinking coffee could benefit heart, help you live longer: Study - Ahmedabad Mirror", "description": "Contrary to worries among some doctors and the public, drinking coffee may protect your heart instead of causing or worsening heart problems, find a new study.&nbsp;\nAccording to three research abstracts, drinking two to three cups of coffee daily has been as…", "url": "https://ahmedabadmirror.com/drinking-coffee-could-benefit-heart-help-you-live-longer-study/81826339.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1648406050828.jpg-org", "publishedAt": "2022-03-28T08:50:45Z", "content": "Contrary to worries among some doctors and the public, drinking coffee may protect your heart instead of causing or worsening heart problems, find a new study. According to three research abstracts, … [+2271 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Testing negative despite Covid-19 symptoms? This is what it could be - News18", "description": "Even though you tested negative for Covid-19 and have symptoms it is advised to isolate yourself from others and stay at home.", "url": "https://www.news18.com/news/lifestyle/testing-negative-despite-covid-19-symptoms-this-is-what-it-could-be-4911992.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/australia-covid-hospital-reuters-164248865216x9.jpg", "publishedAt": "2022-03-28T08:23:45Z", "content": "Covid-19 is a respiratory illness that affects the lower as well as the upper respiratory tract. The symptoms of Covid-19 range from fever, cough, sore throat, fatigue and runny nose. Severe symptoms… [+1729 chars]"}, {"source": {"id": null, "name": "Inventiva"}, "author": "nishi", "title": "Is The Terrifying Covid-19 Pandemic Over Two Years Later? - Inventiva", "description": "Is The Covid-19 Pandemic Over Two Years Later? World Health Organisation also suggests the pandemic is here to stay, following various reports that indicate this is the case. It's been two years since", "url": "https://www.inventiva.co.in/trends/is-the-covid-19-pandemic/", "urlToImage": "https://i0.wp.com/www.inventiva.co.in/wp-content/uploads/2022/03/3eea6b30-1d45-4327-b653-d158342af91a_1920x1080.jpg", "publishedAt": "2022-03-28T07:48:36Z", "content": "World Health Organisation also suggests the pandemic is here to stay, following various reports that indicate this is the case.\r\nIt’s been two years since the pandemic started, and there’s still one … [+8469 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Sexually transmitted infections: Hidden symptoms that should never be ignored - Times Now", "description": "Experts have revealed some hidden symptoms of an STI that warrant urgent attention, and these do not appear on or around the genitals.", "url": "https://www.timesnownews.com/health/sexually-transmitted-infections-hidden-symptoms-that-should-never-be-ignored-article-90490624", "urlToImage": "https://static.tnn.in/thumb/msid-90490624,imgsize-100,width-1280,height-720,resizemode-75/90490624.jpg", "publishedAt": "2022-03-28T07:37:00Z", "content": "Ranbir Kapoor, Alia Bhatt to get married in April? Actor's aunt Rima Jain reacts, 'They will decide and then... '"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "SII Seeks Emergency Use Authorisation For rBCG Tuberculosis Vaccine - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-Recombinant BCG ( rBCG) vaccines are manufactured through advanced technology that allows the insertion of foreign genes or overexpression of native genes, into the BCG vaccine", "url": "http://bwhealthcareworld.businessworld.in/article/SII-Seeks-Emergency-Use-Authorisation-For-rBCG-Tuberculosis-Vaccine/28-03-2022-423818", "urlToImage": "http://static.businessworld.in/article/article_large_image/1610617952_9Ly8E8_2021_01_14T094657Z_1_LYNXMPEH0D0K9_RTROPTP_4_HEALTH_CORONAVIRUS_INDIA_SERUM.JPG", "publishedAt": "2022-03-28T07:33:47Z", "content": "The Serum Institute has applied to the Drugs Controller General of India seeking emergency use authorisation for its recombinant BCG (rBCG) vaccine for the prevention of tuberculosis, official source… [+1637 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Co-infection of COVID and influenza can spike risk of severe diseases, death: Lancet Study - News9 LIVE", "description": "The study involved more than 3,05,000 hospitalised patients with COVID in the UK between February 6, ...", "url": "https://www.news9live.com/health/covid-19/co-infection-of-sars-cov-2-influenza-can-spike-severe-diseases-and-death-risk-lancet-study-161416", "urlToImage": "https://media.news9live.com/h-upload/2022/03/28/264272-covid.jpg", "publishedAt": "2022-03-28T07:25:49Z", "content": "New research published in The Lancet journalshows, adults who have been hospitalised due to COVID-19 and flu at the same time are at a greater risk of severe disease and death compared to patients wh… [+1221 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Study finds T cell responses even after 12 months of initial COVID infection - News9 LIVE", "description": "The study has been done to evaluate the protective effect of memory T cell immune responses against...", "url": "https://www.news9live.com/health/covid-19/study-finds-t-cell-responses-even-after-12-months-of-initial-covid-infection-161408", "urlToImage": "https://media.news9live.com/h-upload/2022/03/28/264276-corona-5974596960720.jpg", "publishedAt": "2022-03-28T07:00:47Z", "content": "During the third wave, led by Omicron, India observed a surge in COVID cases, reinfections in unvaccinated people and breakthrough infections even among the fully vaccinated. Laboratory studies under… [+3952 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Health Tips: Here’s How Much Protein You Should Consume in a Day to Remain Fit - India.com", "description": "Protein is essential for human life. A building block of every human cell, it regulates cell function, building tissue, and helping your blood carry oxygen throughout the body.", "url": "https://www.india.com/health/health-tips-heres-how-much-protein-you-should-consume-in-a-day-to-remain-fit-5306688/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/pjimage-2022-03-28T121307.700.jpg", "publishedAt": "2022-03-28T06:50:16Z", "content": "You might be aware that anything in excess is harmful. The same is the case with protein. Though we know that protein is good for health, do we know where to stop? How much is too much and bad for th… [+3667 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: As COVID-19 cases surge, expert lists down top 5 symptoms to watch out for - Times of India", "description": "The sudden rise in coronavirus cases has become a source of great concern. Just when we thought things were going back to normal, the BA.2 subvariant of COVID's Omicron is wreaking havoc in many parts of the world, leaving experts and doctors highly concerned.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-as-covid-19-cases-surge-expert-lists-down-top-5-symptoms-to-watch-out-for/photostory/90458791.cms", "urlToImage": "https://static.toiimg.com/photo/90458803.cms", "publishedAt": "2022-03-28T05:30:00Z", "content": "The sudden rise in coronavirus cases has become a source of great concern. Just when we thought things were going back to normal, the BA.2 subvariant of COVID's Omicron is wreaking havoc in many part… [+1211 chars]"}, {"source": {"id": null, "name": "Sproutwired.com"}, "author": "Cory Weinberg", "title": "Paralyzed patient receives brain implant and is subsequently able to communicate. - Sprout Wired", "description": "Using new technology, a completely paralyzed man is given the ability to communicate letter by letter, making words and sentences...", "url": "https://www.sproutwired.com/paralyzed-patient-receives-brain-implant-and-is-subsequently-able-to-communicate/", "urlToImage": "https://www.sproutwired.com/wp-content/uploads/2022/03/RTX76K2K-1.webp", "publishedAt": "2022-03-28T05:19:24Z", "content": "Using new technology, a completely paralyzed man is given the ability to communicate letter by letter, making words and sentences using thoughts alone. This is no crap shoot at an online casino – thi… [+7247 chars]"}, {"source": {"id": null, "name": "Alphanewscall.com"}, "author": null, "title": "TruKeto Reviews – An Advanced Ketogenic Fat Burning Formula! - Alpha News Call", "description": "Read this TruKeto review to know all about the benefits, dosage and uses of this keto friendly weight loss diet pills with its results", "url": "https://alphanewscall.com/2022/03/28/truketo-reviews/", "urlToImage": "https://alphanewscall.com/wp-content/uploads/2022/03/TruKeto-Reviews.jpg", "publishedAt": "2022-03-28T05:01:40Z", "content": "TruKeto is one of the latest supplements to hit the market. If you go by the TruKeto reviews, it ranks as one of the best keto-based diet pills. This is because it has been specially formulated to he… [+11157 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Australians warned of impending influenza surge - Sentinelassam - The Sentinel Assam", "description": "On Sunday, Australia reported more than 40,000 new Covid-19 cases and 11 deaths, according to health ...", "url": "https://www.sentinelassam.com/international/australians-warned-of-impending-influenza-surge-584807", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/03/28/329536-australians-warned.jpg", "publishedAt": "2022-03-28T04:59:07Z", "content": "Canberra: An expert on Sunday warned that Australia is set for a return of influenza in the wake of the Covid-19 pandemic.\r\nCases of influenza hit an all-time low in Australia in 2021 as a result of … [+1768 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Tuberculosis infection protects mice against COVID-19 - News-Medical.Net", "description": "To study if prior Mtb infection affects the response to CoV2 infection, K18-hACE2 (ACE2) and C57BL/6 (B6) mice were infected with Mtb, and post thirty days, were exposed to CoV2.", "url": "https://www.news-medical.net/news/20220327/Tuberculosis-infection-protects-mice-against-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_708676_16484361399416380.jpg", "publishedAt": "2022-03-28T03:04:00Z", "content": "Coronavirus disease 2019 (COVID19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2 or CoV2) and tuberculosis (TB) caused by Mycobacterium tuberculosis (Mtb) – are two fatal glob… [+7072 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "PTI", "title": "Why pregnant people should get vaccinated for COVID-19 a maternal care expert explains - National Herald", "description": "The ripple effects of COVID-19 go well beyond the person with the infection, particularly in pregnancy. It's clear that the vaccine can help prevent serious illness in pregnant people", "url": "https://www.nationalheraldindia.com/national/why-pregnant-people-should-get-vaccinated-for-covid-19-a-maternal-care-expert-explains", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2021-07%2Fa4d5e3ac-0f2b-4803-88e0-9ba00ef9e2c8%2FAll_you_need_to_know_about_Covid_vaccination_for_pregnant_women.jpg?rect=0%2C0%2C825%2C433&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-28T02:15:00Z", "content": "At the same time, it is also important that a parent do everything possible to protect the well-being of the pair.\r\nAs a family physician specializing in maternity care, I often hear of the challenge… [+1312 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Music Is Just as Powerful at Improving Mental Health as Exercise, Review Suggests - ScienceAlert", "description": "The next time you're not able to get out to the gym, maybe spin some records instead: new research suggests the positive impact on mental health from singing, playing, or listening to music is around the same impact experienced with exercise or weigh", "url": "https://www.sciencealert.com/music-is-just-as-powerful-at-improving-mental-health-as-exercise-review-suggests", "urlToImage": "https://www.sciencealert.com/images/2022-03/processed/WomanWearingHeadphonesDances_1024.jpg", "publishedAt": "2022-03-27T18:02:32Z", "content": "The next time you're not able to get out to the gym, maybe spin some records instead: new research suggests the positive impact on mental health from singing, playing, or listening to music is around… [+3123 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Daily consumption of cranberries can improve cardiovascular health: Study - Times of India", "description": "According to a new study, daily consumption of cranberries can improve cardiovascular function in healthy men. The study included 45 healthy men who consumed whole cranberry powder equivalent to 110g of fresh cranberries per day (9 g powder) or a placebo for …", "url": "https://timesofindia.indiatimes.com/videos/news/daily-consumption-of-cranberries-can-improve-cardiovascular-health-study/videoshow/90479955.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90479955,imgsize-57410.cms", "publishedAt": "2022-03-27T16:23:30Z", "content": "Mar 27, 2022, 09:53PM ISTSource: ANIAccording to a new study, daily consumption of cranberries can improve cardiovascular function in healthy men. The study included 45 healthy men who consumed whole… [+411 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study details how mosquitoes ignore insect repellents - ANI News", "description": "Washington [US], March 27 (ANI): Scientists from Johns Hopkins Medicine have found the process that makes mosquitoes able to ignore common insect repellents.", "url": "https://www.aninews.in/news/science/study-details-how-mosquitoes-ignore-insect-repellents20220327193227", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/pexels-pixabay-867222022032713524920220327140158-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-27T14:02:00Z", "content": "ANI | Updated: Mar 27, 2022 19:32 IST\r\nWashington [US], March 27 (ANI): Scientists from Johns Hopkins Medicine have found the process that makes mosquitoes able to ignore common insect repellents.The… [+3485 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Research Finds Correct Diet Can Help Safeguard Against Acute Kidney Injury - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Four out of six different nutritional strategies help out in preventing acute kidney injury, suggests a team of researchers.", "url": "https://www.latestly.com/agency-news/health-news-research-finds-correct-diet-can-help-safeguard-against-acute-kidney-injury-3519900.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/03/cancer30_mGWA7in2022010107033220220327125831-588x441.jpg", "publishedAt": "2022-03-27T13:16:20Z", "content": "Berlin [Germany], March 27 (ANI): Four out of six different nutritional strategies help out in preventing acute kidney injury, suggests a team of researchers.\r\nThe findings of the study were publishe… [+3048 chars]"}, {"source": {"id": null, "name": "Statesville Record & Landmark"}, "author": "Special to the Record & Landmark", "title": "National Colorectal Cancer awareness: What to expect from a colonoscopy - Statesville Record & Landmark", "description": "When your doctor tells you it’s time to get your first colonoscopy, your initial thoughts may be those of worry and apprehension. Though you may be dreading your procedure, colonoscopies", "url": "https://statesville.com/news/local/national-colorectal-cancer-awareness-what-to-expect-from-a-colonoscopy/article_f354cb54-aba3-11ec-9daf-cb00eace0bcd.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/statesville.com/content/tncms/assets/v3/editorial/8/27/82755ac4-aba4-11ec-895a-bbdbedb1958e/623cbf87536a8.image.jpg?crop=1869%2C981%2C122%2C0&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-03-27T13:00:00Z", "content": "Special to the Record &amp; Landmark\r\nWhen your doctor tells you its time to get your first colonoscopy, your initial thoughts may be those of worry and apprehension. Though you may be dreading your … [+4842 chars]"}, {"source": {"id": null, "name": "Newsd.in"}, "author": "Newsd", "title": "Study sheds light on health benefits of regular exercise for people with depression, anxiety - Newsd.in", "description": "The research findings added to mounting evidence that exercise improves cardiovascular health by helping to activate parts of the brain that counteract stress.", "url": "https://newsd.in/study-sheds-light-on-health-benefits-of-regular-exercise-for-people-with-depression-anxiety/", "urlToImage": "https://newsd.in/wp-content/uploads/2017/11/1486106688-exercise-517-getty.jpg", "publishedAt": "2022-03-27T12:32:10Z", "content": "Researchers have found that regular physical activity has nearly doubled the cardiovascular benefits in individuals with depression or anxiety, compared to those without these diagnoses. The study wa… [+4290 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Statins side effects: Cholesterol drug may cause hepatitis – symptoms to spot - Express", "description": "STATINS are a type of drug used to treat high cholesterol. Just like other medicines they can cause side effects. Some of these side effects are more serious than others.", "url": "https://www.express.co.uk/life-style/health/1586973/statins-high-cholesterol-cause-hepatitis-symptoms", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1586973.jpg", "publishedAt": "2022-03-27T12:27:00Z", "content": "HDL stands for high-density lipoprotein; this is the type of cholesterol required for overall cardiovascular health.\r\nThe type of cholesterol requiring the prescription of statins is referred to as L… [+1071 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Citrus peels: Doctors share benefits, tips to use them for healthy glowing skin - Hindustan Times", "description": "If you, like us, still live in the world of traditional salon-based facials say ‘hello’ to citrus peels! They are non-irritating, highly effective and suitable for all skin types. Check out their benefits inside and ways to use them for a healthy and glowing …", "url": "https://www.hindustantimes.com/lifestyle/fashion/citrus-peels-doctors-share-benefits-tips-to-use-them-for-healthy-glowing-skin-101648380403436.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/27/1600x900/shell-g21febacea_1920_1648381974494_1648381995302.jpg", "publishedAt": "2022-03-27T12:09:27Z", "content": "Citrus fruits like oranges, lemons, kiwis etc are packed with immune-boosting Vitamin C but apart from eating their fleshy part, fitness and skincare experts suggest consuming the citrus fruit's peel… [+4574 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Nottingham: Rates of Crohn’s and Colitis have been vastly underestimated for decades, says new study - India Education Diary", "description": "New research, led by experts at the University of Nottingham, shows that the number of people in the UK living with Inflammatory Bowel Disease (IBD) - the two main forms of which are Crohn's Disease and Ulcerative Colitis - has been vastly underestim", "url": "https://indiaeducationdiary.in/university-of-nottingham-rates-of-crohns-and-colitis-have-been-vastly-underestimated-for-decades-says-new-study/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/University-of-Nottingham.jpeg", "publishedAt": "2022-03-27T10:07:30Z", "content": "New research, led by experts at the University of Nottingham, shows that the number of people in the UK living with Inflammatory Bowel Disease (IBD) – the two main forms of which are Crohn’s Disease … [+5650 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds men and women process pain signal differently - ANI News", "description": "Washington [US], March 27 (ANI): Researchers have found that neurons in the spinal cord process pain signals differently in women compared to men.", "url": "https://www.aninews.in/news/health/study-finds-men-and-women-process-pain-signal-differently20220327150908", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/rtyhyggfhgfhgf2022032709144820220327093856-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-27T09:39:00Z", "content": "Washington [US], March 27 (ANI): Researchers have found that neurons in the spinal cord process pain signals differently in women compared to men.\r\nThe finding, published in the journal BRAIN, could … [+1197 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Reuters", "title": "COVID-19 roundup: Diabetes risk rises, kids antibodies last 6 months | Daily Sabah - Daily Sabah", "description": "In this week&#039;s roundup, the latest scientific research on the coronavirus and efforts to find treatments and vaccines suggest that immune system...", "url": "https://www.dailysabah.com/life/health/covid-19-roundup-diabetes-risk-rises-kids-antibodies-last-6-months", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2022/03/27/thumbs/800x531/193784.jpg", "publishedAt": "2022-03-27T09:26:00Z", "content": "In this week's roundup, the latest scientific research on the coronavirus and efforts to find treatments and vaccines suggest that immune system memory persists a year after COVID-19, type-2 diabetes… [+4833 chars]"}, {"source": {"id": null, "name": "PsychCentral.com"}, "author": "Stacey L. Nash", "title": "The Link Between Postpartum Depression and PTSD - PsychCentral.com", "description": "Different aspects of the birthing experience may increase your chances of developing postpartum depression, PTSD, or both. Help is available to help you cope.", "url": "https://psychcentral.com/depression/postpartum-depression-post-traumatic-stress-disorder", "urlToImage": "https://post.psychcentral.com/wp-content/uploads/sites/4/2021/11/mother-in-bath-robe-holding-infant-baby-window-1200x628-facebook-1200x628.jpg", "publishedAt": "2022-03-27T07:00:00Z", "content": "We include products we think are useful for our readers. If you buy through links on this page, we may earn a small commission. Heres our process.\r\nPPD and PTSD can be concurrent conditions after chi… [+7764 chars]"}, {"source": {"id": null, "name": "Centralrecorder.com"}, "author": null, "title": "You may have the disease by looking at your eyes. - Central Recorder", "description": "Your eyes can reveal a lot about you health.", "url": "https://centralrecorder.com/you-may-have-the-disease-by-looking-at-your-eyes/", "urlToImage": "https://centralrecorder.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=89781&type=play", "publishedAt": "2022-03-26T21:35:57Z", "content": "Your eyes can reveal a lot about you health.\r\nThese signs can indicate warning signs for many conditions, including diabetes.\r\n1\r\nDepending on the state of the diabetes, signs and symptoms can be see… [+2654 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": "Cornelius", "title": "Sugar and cholesterol rate at age 35 may be linked to Alzheimer’s in the future - The Goa Spotlight", "description": "A team of US researchers was investigating conditions that may increase or decrease the risk of developing Alzheimer's disease in old age. More than 40 years after the start of the research, the team", "url": "https://thegoaspotlight.com/sugar-and-cholesterol-rate-at-age-35-may-be-linked-to-alzheimers-in-the-future/", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/dGlZyTwzwgh2_V9zWHQr_A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/uu/api/res/1.2/MA_nkT3cwK3CE45rXBSMAA--~B/aD03ODg7dz0xNDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/pt/canal_tech_990/a4422f33c7eb652ef7f9b1aa1de20b5f", "publishedAt": "2022-03-26T21:30:24Z", "content": "A team of US researchers was investigating conditions that may increase or decrease the risk of developing Alzheimer’s disease in old age. More than 40 years after the start of the research, the team… [+2438 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "David Hamilton", "title": "Certain Exercises Can Help With Muscular Dystrophy: Study - Global Circulate", "description": "According to the team of University of Maine researchers, muscular dystrophy is a debilitating disease that causes the weakness and breakdown of skeletal muscles that progressively worsen over time. The study published in the journal EL", "url": "https://globalcirculate.com/certain-exercises-can-help-with-muscular-dystrophy-study/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/pjimage-2022-03-26T170851.606.jpg", "publishedAt": "2022-03-26T21:27:05Z", "content": "According to the team of University of Maine researchers, muscular dystrophy is a debilitating disease that causes the weakness and breakdown of skeletal muscles that progressively worsen over time. … [+3456 chars]"}]}