{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Medscape"}, "author": "Batya Swift Yasgur, MA, LSW", "title": "Electroacupuncture Promising for Depression-Related Insomnia - Medscape", "description": "For individuals with comorbid depression and insomnia, electroacupuncture can help improve both sleep disturbances and depressive symptoms, new research suggests.", "url": "https://www.medscape.com/viewarticle/977121", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220707_electroaccupuncture_800x450.jpg", "publishedAt": "2022-07-13T20:05:40Z", "content": "Electroacupuncture (EA) may significantly improve sleep quality in patients with depression who also have insomnia, new research suggests.\r\nIn a study of more than 200 adults with depression and como… [+7136 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Pig heart transplants succeed in brain-dead recipients in US - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "WASHINGTON, July 13: Surgeons in the US have successfully transplanted genetically-engineered pig hearts into recently deceased humans, an advance towards a long-term goal of performing such surgeries regularly in living patients, researchers said. The surger…", "url": "https://www.dailyexcelsior.com/pig-heart-transplants-succeed-in-brain-dead-recipients-in-us/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/07/download-21-8.jpg", "publishedAt": "2022-07-13T19:28:47Z", "content": "WASHINGTON, July 13: Surgeons in the US have successfully transplanted genetically-engineered pig hearts into recently deceased humans, an advance towards a long-term goal of performing such surgerie… [+3732 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Genetic testing can be beneficial for depression patients, suggests study - ANI News", "description": "Washington [US], July 13 (ANI): Pharmacogenomic testing can help providers avoid prescribing antidepressant medications that may have undesirable outcomes, suggests a new US Department of Veterans Affairs study.", "url": "https://www.aninews.in/news/science/genetic-testing-can-be-beneficial-for-depression-patients-suggests-study20220713233741", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/GENE_MUTATIONNNNN2022042809164720220428104742202206200736562022062514345020220_RLToXqR.jpg", "publishedAt": "2022-07-13T18:07:00Z", "content": "Washington [US], July 13 (ANI): Pharmacogenomic testing can help providers avoid prescribing antidepressant medications that may have undesirable outcomes, suggests a new US Department of Veterans Af… [+7949 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Comparison of Early Outcomes in Patients Undergoing Suture Fixation Versus Tack Fixation of Mesh in Laparoscopic Transabdominal Preperitoneal (TAPP) Repair of Inguinal Hernia - Cureus", "description": "Introduction: The advent of laparoscopic techniques in repairing inguinal hernia has significantly improved outcomes of inguinal hernia surgery. However, acute and chronic postoperative pain after fixation of mesh with tacks and the cost of tacking devices ar…", "url": "https://www.cureus.com/articles/103296-comparison-of-early-outcomes-in-patients-undergoing-suture-fixation-versus-tack-fixation-of-mesh-in-laparoscopic-transabdominal-preperitoneal-tapp-repair-of-inguinal-hernia", "urlToImage": "https://assets.cureus.com/uploads/figure/file/399432/article_river_2ad89ae001aa11eda32545440b658925-flow-diagram-cropped.png", "publishedAt": "2022-07-13T17:32:26Z", "content": "Introduction: The advent of laparoscopic techniques in repairing inguinal hernia has significantly improved outcomes of inguinal hernia surgery. However, acute and chronic postoperative pain after fi… [+24949 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Why Is There an Increased Risk for Sudden Cardiac Death in Patients With Early Repolarization Syndrome? - Cureus", "description": "The last two decades have changed the viewpoint on early repolarization syndrome (ERS). The prevalence of the early repolarization pattern is variable and ranges between 3-24% depending upon age, gender, and criteria used for J-point upliftment from baseline …", "url": "https://www.cureus.com/articles/98033-why-is-there-an-increased-risk-for-sudden-cardiac-death-in-patients-with-early-repolarization-syndrome", "urlToImage": "https://assets.cureus.com/uploads/figure/file/377002/article_river_81736bf0e19311ec9a18178e329d2c2c-Mac-cropped.png", "publishedAt": "2022-07-13T17:21:05Z", "content": "Sudden cardiac death (SCD) is an untoward natural death from a cause of cardiac origin in a patient without any preceding disease that would result in a quick fatality within a brief period, often on… [+27739 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Study: Influenza virus does not affect the severity of SARS-CoV-2 infection - Times Now", "description": "Several clinical studies had previously reported on co-infection of SARS-CoV-2 with other viruses. These viruses infect the same cells within the airway. Notably, the influenza A virus interferes with SARS-CoV-2 replication in the lung and can continue to do …", "url": "https://www.timesnownews.com/health/covid-19-study-influenza-virus-does-not-affect-the-severity-of-sars-cov-2-infection-article-92859753", "urlToImage": "https://static.tnn.in/thumb/msid-92859753,imgsize-100,width-1280,height-720,resizemode-75/92859753.jpg", "publishedAt": "2022-07-13T17:17:24Z", "content": "NEET 2022 Live: Updates on NEET UG Admit Card, postponement news and more on neet.nta.nic.in, nta.ac.in"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Association Between Vision and Brain Cortical Thickness | EB - Dove Medical Press", "description": "Assessing the association between visual function and cortical thickness in older adults", "url": "https://www.dovepress.com/association-between-vision-and-brain-cortical-thickness-in-a-community-peer-reviewed-fulltext-article-EB", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-07-13T16:47:41Z", "content": "Introduction\r\nVisual impairment is a major cause of disability and institutionalization in older people.1 It has also been associated with depression and cognitive function, but its effect on brain s… [+28102 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Awareness and prompt treatment can control progression of renal ailments - Rising Kashmir", "description": "As most of the people do not have any symptoms of the progression of the disease, until the advanced stages, it is important to get tested annually", "url": "https://www.risingkashmir.com/displaynews.aspx?news=111165", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637933017738411036_Image_OP_2_(87).png", "publishedAt": "2022-07-13T16:40:14Z", "content": "With significant rise in the incidences of renal failure due to Chronic Kidney Diseases (CKD) there is an urgent need to raise awareness among the masses. The number of patients suffering from CKD ha… [+3713 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss story: “I lost 20 kilos by giving up dairy, adding salads to my diet and walking 7-10k steps daily” - Times of India", "description": "If you have a weight loss story to share, send it to us at toi.health1@gmail.com", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-story-i-lost-20-kilos-by-giving-up-dairy-adding-salads-to-my-diet-and-walking-7-10k-steps-daily/photostory/92851766.cms", "urlToImage": "https://static.toiimg.com/photo/92851778.cms", "publishedAt": "2022-07-13T16:30:00Z", "content": "My breakfast: Based on a diet recommended to me, I have only hot water in the morning with some fruits like banana and papaya. This is followed by some sprouts and juices. Basically, I don’t eat any … [+1492 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Steph Coelho", "title": "Psoriatic arthritis and dental health: Links and more - Medical News Today", "description": "Research suggests a connection between PsA and dental health. Learn more about possible links and ways to prevent dental issues.", "url": "https://www.medicalnewstoday.com/articles/psoriatic-arthritis-tooth-decay", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/06/toothbrush-dental-psoriatic-arthritis-thumb.jpg", "publishedAt": "2022-07-13T15:57:04Z", "content": "Psoriatic arthritis (PsA) is a chronic inflammatory condition that affects the joints. It can also cause fatigue, eye problems, and a higher likelihood of dental issues.\r\nMore than one-third\r\n of peo… [+4341 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Delayed Presentation of Post-traumatic Multiorgan Left Diaphragmatic Hernia: A Case Report and Literature Review - Cureus", "description": "Post-traumatic diaphragmatic injuries can present as diaphragmatic hernia with herniation of abdominal viscera into the thoracic cavity. It is challenging for trauma surgeons to identify the delayed presentation of post-traumatic diaphragmatic injuries which …", "url": "https://www.cureus.com/articles/101974-delayed-presentation-of-post-traumatic-multiorgan-left-diaphragmatic-hernia-a-case-report-and-literature-review", "urlToImage": "https://assets.cureus.com/uploads/figure/file/407783/article_river_ca8ddf1002a811ed9f5feb88b734be80-IMG_6586.png", "publishedAt": "2022-07-13T15:51:59Z", "content": "Post-traumatic diaphragmatic injuries can present as diaphragmatic hernia with herniation of abdominal viscera into the thoracic cavity. It is challenging for trauma surgeons to identify the delayed … [+10583 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "'Simple and economic' tool: Triglyceride glucose index predicts HFpEF in hypertension - Healio", "description": "The triglyceride glucose index, a novel marker of insulin resistance, strongly correlates with the occurrence of HF with preserved ejection fraction in adults with hypertension, according to an analysis of electronic medical records data.&ldquo;A growing body…", "url": "https://www.healio.com/news/cardiology/20220713/simple-and-economic-tool-triglyceride-glucose-index-predicts-hfpef-in-hypertension", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/cardiology/b/bp_male-patient.jpg", "publishedAt": "2022-07-13T15:46:18Z", "content": "The triglyceride glucose index, a novel marker of insulin resistance, strongly correlates with the occurrence of HF with preserved ejection fraction in adults with hypertension, according to an analy… [+2396 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Male Pattern Baldness: Causes, warning signs and symptoms, treatment - Hindustan Times", "description": "Worried that you might lose your crowning glory? It’s pretty common to lose your hair and almost go bald in your early twenties due to a medical condition known as Andro Genetic Alopecia or male pattern baldness. Here are its causes, warning signs and symptom…", "url": "https://www.hindustantimes.com/lifestyle/health/male-pattern-baldness-causes-warning-signs-and-symptoms-treatment-of-andro-genetic-alopecia-101657724135977.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/13/1600x900/pexels-karolina-grabowska-7285533_1657724715668_1657724767556_1657724767556.jpg", "publishedAt": "2022-07-13T15:28:09Z", "content": "Male Pattern Baldness is also known as Androgenic Alopecia is among the most common causes of hair loss in males which can start at the age of 20-25 years and by the age of 50, half of the males expe… [+6660 chars]"}, {"source": {"id": null, "name": "Webnewsobserver.com"}, "author": "https://www.facebook.com/webnewsobserver", "title": "7 Incredible health benefits of pumpkin seeds - Web News Observer", "description": "Although the pumpkin seeds look small, they have multiple nutritional benefits. Even if you consume a small amount of the seeds, they can provide you with the", "url": "https://webnewsobserver.com/7-incredible-health-benefits-of-pumpkin-seeds/", "urlToImage": "https://blaze.webnewsobserver.com/wp-content/uploads/2022/07/7-Incredible-health-benefits-of-pumpkin-seeds.jpg", "publishedAt": "2022-07-13T15:09:27Z", "content": "Although the pumpkin seeds look small, they have multiple nutritional benefits. Even if you consume a small amount of the seeds, they can provide you with the best quality zinc, magnesium, and health… [+2419 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Breakthrough: Indian Scientists Develop Novel Mechanism To Inactivate Coronavirus - odishabytes - OdishaBytes", "description": "New Delhi: A new class of synthetic peptides has been developed by Indian researchers that can block the entry of SARS-CoV-2 virus into body cells and clump the virus particles together, thereby reducing their ability to spread infection. This novel approach …", "url": "https://odishabytes.com/breakthrough-indian-scientists-develop-novel-mechanism-to-inactivate-coronavirus/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2021/12/corona-use.jpg", "publishedAt": "2022-07-13T15:00:26Z", "content": "New Delhi: A new class of synthetic peptides has been developed by Indian researchers that can block the entry of SARS-CoV-2 virus into body cells and clump the virus particles together, thereby redu… [+1539 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Parenting tips to help kids with ADHD thrive - CHCH News", "description": "Parenting a child with ADHD? Parenting coach Michelle McVittie joined us this morning with tips on how to help them thrive.", "url": "https://www.youtube.com/watch?v=6Atn0nefqwA", "urlToImage": "https://i.ytimg.com/vi/6Atn0nefqwA/hqdefault.jpg", "publishedAt": "2022-07-13T14:51:26Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Curbing Candida: The cells that keep fungal infections at bay - Medical Xpress", "description": "Of all the fungi that live in the human body, the most infamous is probably the yeast Candida. This distant cousin of baker's yeast is notorious for causing various types of thrush that can be a major nuisance, but it can also lead to an invasive infection th…", "url": "https://medicalxpress.com/news/2022-07-curbing-candida-cells-fungal-infections.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2015/candidaalbic.jpg", "publishedAt": "2022-07-13T14:40:52Z", "content": "Of all the fungi that live in the human body, the most infamous is probably the yeast Candida. This distant cousin of baker's yeast is notorious for causing various types of thrush that can be a majo… [+6172 chars]"}, {"source": {"id": null, "name": "Melmagazine.com"}, "author": "Joshschollmeyer", "title": "Why a Day at the Beach Turns Men into Insatiable Bears - MEL Magazine", "description": "It’s not you. A new study says that it’s the sun that makes you want that second hamburger, fourth hog dog and sixth bag of chips", "url": "https://melmagazine.com/en-us/story/hunger-sunlight-men-study", "urlToImage": "https://melmagazine.com/wp-content/uploads/2022/07/Sun_Turns_You_into_Insatiable_Bear-1.jpg", "publishedAt": "2022-07-13T14:12:43Z", "content": "Every time I go to the beach with a group of guy friends, they manage to make the trash-eating seagulls seem downright dainty. It doesnt matter how many cold cuts or snacks we pack, or how many conce… [+1705 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Zika virus infects 7-year-old Maharashtra girl; Check symptoms, treatment of Zika virus - Zee News", "description": "A seven-year-old girl in Maharashtras Palghar district has been found infected with the Zika virus. The health department has informed that the said girl is a resident of Ashramshala in Jhai of Palghar district.", "url": "https://zeenews.india.com/india/zika-virus-infects-7-year-old-maharashtra-girl-check-symptoms-treatment-of-zika-virus-2485013.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/07/13/1064696-denguemosquito0pixabay.jpg", "publishedAt": "2022-07-13T14:07:33Z", "content": "Mumbai: A seven-year-old girl in Maharashtra's Palghar district has been found infected with the Zika virus. The health department has informed that the said girl is a resident of Ashramshala in Jhai… [+2208 chars]"}, {"source": {"id": null, "name": "Thebetterindia.com"}, "author": "Krystelle Dsouza", "title": "Dreading Dengue? ICMR Launches Eco-friendly Tech to Kills Mosquitos - The Better India", "description": "Extensively tested, this unique bio-larvicide is also expected to bring in foreign exchange via exports to tropical countries burdened with mosquito-borne diseases.", "url": "https://www.thebetterindia.com/290763/icmr-develops-ecofriendly-bti-tech-to-kill-mosquitos-biolarvicide-dengue-chikungunya/", "urlToImage": "https://en-media.thebetterindia.com/uploads/2022/07/MOSQUITO-1657720357.jpg", "publishedAt": "2022-07-13T14:04:46Z", "content": "Vector-borne diseases (VBD) account for over 17 per cent of all infectious diseases and cause more than 7 lakh deaths annually. In India, even as 2020 saw a decrease in the incidence of such illnesse… [+2377 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How Does Sleep Affect Heart Health? - News-Medical.Net", "description": "We all know about the importance of getting a good night’s sleep, but can it affect our heart health?", "url": "https://www.news-medical.net/health/How-Does-Sleep-Affect-Heart-Health.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/Article_Images/ImageForArticle_22842_16577210411276971.jpg", "publishedAt": "2022-07-13T13:58:00Z", "content": "Sleep duration and mortalityAffect of sleep duration on coronary heart disease, stroke, and total cardiovascular diseaseSleep duration and coronary artery calcificationSleep duration and hypertension… [+6626 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "The Worst Breakfast Habits for Dementia, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "You can sometimes slow down the progression of dementia with your diet. Here are some of the worst breakfast habits for those with dementia.", "url": "http://www.eatthis.com/worst-breakfast-habits-dementia/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/07/elderly-couple-eating-breakfast.jpg?quality=82&strip=all", "publishedAt": "2022-07-13T13:57:59Z", "content": "Dementia can be a devastating diagnosis to receive. And one of the most difficult aspects of dementia to deal with is the fact that a cure hasn't been discovered yet. However, there are thankfully pl… [+3179 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Researchers show effectiveness of migraine drugs in weight loss - The Siasat Daily", "description": "Triptans, a commonly prescribed class of migraine drugs, may also be useful in treating obesity, a new study suggests.", "url": "https://www.siasat.com/researchers-show-effectiveness-of-migraine-drugs-in-weight-loss-2368747/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/07/migraine.jpg", "publishedAt": "2022-07-13T13:55:00Z", "content": "Washington: Triptans, a commonly prescribed class of migraine drugs, may also be useful in treating obesity, a new study suggests.\r\nIn studies on obese mice, a daily dose of triptan led animals to ea… [+3268 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Rainy Mumbai on leptospirosis alert — what causes the infection, prevention and cure - CNBCTV18", "description": "The Brihanmumbai Municipal Corporation (BMC) has advised people to avoid wading in stagnant water and floodwater — currently almost an impossibility in monsoon-hit Mumbai — while issuing a warning about leptospirosis, which may be on the rise.", "url": "https://www.cnbctv18.com/healthcare/rainy-mumbai-on-leptospirosis-alert-what-causes-the-infection-prevention-and-cure-14121962.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/07/mumbai-rains-12-1019x573.jpg", "publishedAt": "2022-07-13T13:15:34Z", "content": "With heavy rains lashing Mumbai, the Health Department of the Brihanmumbai Municipal Corporation (BMC) has warned citizens against leptospirosis cases, which may be on the rise, said reports.\r\nMumbai… [+3395 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Five Protein-rich Foods To Ease Long COVID Symptoms - News18", "description": "It is important to have a strong immune system that can fight back the germs", "url": "https://www.news18.com/news/lifestyle/five-protein-rich-foods-to-ease-long-covid-symptoms-5548177.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/protein-day-2022-3-164587034216x9.jpg", "publishedAt": "2022-07-13T13:12:49Z", "content": "The bodys immunity is vital in fighting the effects of the coronavirus. A weak immunity system results in the COVID-19 symptoms lingering in the body even after the virus has left it. Hence, it is im… [+1741 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "Apart from COVID-19, be careful about these monsoon fevers too - NewsBytes", "description": "While the monsoon rains and pleasant weather give you some relief from the summer heat, it brings along a host of diseases and viral infections", "url": "https://www.newsbytesapp.com/news/lifestyle/five-types-of-monsoon-fevers/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l49720220713183333.jpeg", "publishedAt": "2022-07-13T13:10:46Z", "content": "Apart from COVID-19, be careful about these monsoon fevers too\r\nJul 13, 2022, 06:40 pm2 min read\r\nWhile the monsoon rains and pleasant weather give you some relief from the summer heat, it brings alo… [+2401 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "COVID-19 booster vaccine beneficial for lupus patients: Study - ETHealthWorld", "description": "The discovery, according to researchers, should provide comfort to the more than 200,000 Americans who suffer from SLE, a disorder where the immune system of the body unintentionally targets its own healthy tissues, particularly joints and skin.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-19-booster-vaccine-beneficial-for-lupus-patients-study/92854907", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92854907,imgsize-42374,width-1200,height-628,overlay-ethealthworld/covid-19-booster-vaccine-beneficial-for-lupus-patients-study.jpg", "publishedAt": "2022-07-13T12:45:00Z", "content": "New York: Those with systemic lupus erythematosus, or SLE, who received a \"booster\" dose of the SARS-CoV-2 vaccine after receiving the full dosage are about half as likely to experience a subsequent … [+4280 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Single MRI scan of the brain could detect Alzheimer's disease – Physics World - physicsworld.com", "description": "A combination of structural MRI and machine learning can diagnose Alzheimer’s disease, even at an early stage", "url": "https://physicsworld.com/a/single-mri-scan-of-the-brain-could-detect-alzheimers-disease/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/07/MRI-brain-Pexels-Anna-Shvets.jpg", "publishedAt": "2022-07-13T12:10:16Z", "content": "Early diagnosis: A predictive model uses structural MRI data to diagnose Alzheimers disease, even before obvious shrinkage of the brain occurs. (Courtesy: Pexels/Anna Shvets)\r\nAlzheimers disease (AD)… [+5525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stress & Diet: How Stress Affects Our Diet & How To Deal With It - NDTV", "description": "Here's everything you need to know about stress and how it may affect one's diet.", "url": "https://www.ndtv.com/health/stress-diet-how-stress-affects-our-diet-how-to-deal-with-it-3131250", "urlToImage": "https://c.ndtvimg.com/2020-11/6e3ga0i_meal-prepping-_625x300_16_November_20.jpg", "publishedAt": "2022-07-13T12:00:18Z", "content": "Mapping out a diet routine can help you follow a proper diet\r\nWhat is stress?\r\nStress is a common yet complex emotion. Stress on its own is a very normal emotion and may even be good for the body and… [+4164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "'HPV vaccination can prevent more than 90 per cent of cervical cancers when given at the recommended age' - The Indian Express", "description": "The administration of vaccination to girls and women is best before they are exposed to the virus. Those between the age group of 12 and 26 are considered ideal candidates for getting the vaccination, says Dr Sarika Gupta, Senior Consultant, Oncology and Robo…", "url": "https://indianexpress.com/article/lifestyle/health-specials/hpv-vaccination-prevent-cervical-cancers-age-8027086/", "urlToImage": "https://images.indianexpress.com/2022/01/pexels-VACCINE.jpg", "publishedAt": "2022-07-13T11:52:20Z", "content": "Indias first Quadrivalent Human Papillomavirus vaccine (qHPV)to fight cervical cancer has received a nod from the DCGI for widespread use to protect our women vulnerable to contracting it. According … [+3425 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Want To Control Blood Sugar Spikes? Check Out This Nutrition Hack By Health Expert - NDTV Doctor", "description": "Nutritionist Pooja Makhija suggests eating vegetables and proteins before carbohydrates, to keep blood sugar spikes in control.", "url": "https://doctor.ndtv.com/heart/does-eating-order-impact-blood-sugar-this-is-what-nutritionist-pooja-makhija-says-3093665", "urlToImage": "https://c.ndtvimg.com/2021-03/jdhjvrgg_fruits-and-vegetables-_625x300_22_March_21.jpg", "publishedAt": "2022-07-13T11:17:33Z", "content": "Food plays a vital role in achieving health goals and in fulfilling bodies' nutritional requirements. While people are often mindful of what they eat, a simple yet powerful phenomenon known as the Ea… [+2708 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Reuters", "title": "Why world's first malaria shot won't reach millions of children who need it - Deccan Herald", "description": "After decades of work, the World Health Organization (WHO) endorsed the first-ever malaria vaccine last year - a historic milestone that promised to drive back a disease that kills a child every minute. In reality, efforts are falling well short of that, with…", "url": "https://www.deccanherald.com/international/why-worlds-first-malaria-shot-wont-reach-millions-of-children-who-need-it-1126312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/07/13/mosquito-afp-1126312-1657710895.jpg", "publishedAt": "2022-07-13T11:14:01Z", "content": "After decades of work, the World Health Organization (WHO) endorsed the first-ever malaria vaccine last year - a historic milestone that promised to drive back a disease that kills a child every minu… [+10283 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "Develop more vaccines to combat 'silent pandemic' of antimicrobial resistance: WHO | Indiablooms - First Portal on Digital News Management - indiablooms", "description": "New York: More vaccines must be developed to tackle antimicrobial-resistant (AMR) bacterial pathogens, and countries must make better use of the ones currently available, the World Health Organization (WHO) said on Tuesday.", "url": "https://www.indiablooms.com/health-details/H/11724/develop-more-vaccines-to-combat-silent-pandemic-of-antimicrobial-resistance-who.html", "urlToImage": "https://www.indiablooms.com/health_pic/2022/997879a6c60075d5f3997728da47e637.jpg", "publishedAt": "2022-07-13T10:58:48Z", "content": "New York: More vaccines must be developed to tackle antimicrobial-resistant (AMR) bacterial pathogens, and countries must make better use of the ones currently available, the World Health Organizatio… [+2719 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "10 Foods That Reduce Your Risk Of Cardiovascular Diseases - NDTV", "description": "Add these foods to your diet to lower your risk of developing cardiovascular diseases.", "url": "https://www.ndtv.com/health/10-foods-that-reduce-your-risk-of-cardiovascular-diseases-3109226", "urlToImage": "https://i.ndtvimg.com/i/2018-01/beans-can-give-you-gas_650x400_81515483843.jpg", "publishedAt": "2022-07-13T10:35:11Z", "content": "Beans reduce blood pressure and lower cholesterol\r\nDifferent organs play different roles in our bodies. Every organ plays an integral role and significantly affects our health. A good heart means lon… [+3794 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Non-alcoholic fatty liver disease: Experiencing THIS sign in the morning should not be taken lightly - Times of India", "description": "This symptom can severely impact your everyday life, decrease productivity at work or academic performance.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/non-alcoholic-fatty-liver-disease-experiencing-this-sign-in-the-morning-should-not-be-taken-lightly/photostory/92850032.cms", "urlToImage": "https://static.toiimg.com/photo/msid-92850480.cms", "publishedAt": "2022-07-13T10:30:00Z", "content": "The most effective treatment for liver disease is weight loss, as it helps to prevent the build-up of fatty cells inside the liver. Some studies show that following the Mediterranean diet can help to… [+439 chars]"}, {"source": {"id": null, "name": "European Pharmaceutical Review"}, "author": null, "title": "Nipah virus vaccine enters Phase I trial - European Pharmaceutical Review", "description": "The mRNA-1215 vaccine for Nipah virus – a disease of pandemic potential, will be evaluated for safety, tolerability and immunogenicity.", "url": "https://www.europeanpharmaceuticalreview.com/news/173100/nipah-virus-vaccine-enters-phase-i-trial/", "urlToImage": "https://www.europeanpharmaceuticalreview.com/wp-content/uploads/Nipah-virus-e1657705764724.jpg", "publishedAt": "2022-07-13T09:52:44Z", "content": "Posted: 13 July 2022 | Hannah Balfour (European Pharmaceutical Review) | No comments yet\r\nThe investigational mRNA-1215 vaccine developed to prevent Nipah virus a bat-borne disease of pandemic potent… [+2950 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Study says Covid Virus May Survive for 30 Days on Frozen Meat - News18", "description": "The research is important because SARS-CoV-2 can replicate within the gut, as well as in the respiratory tract, said Bailey.", "url": "https://www.news18.com/news/lifestyle/study-says-covid-virus-may-survive-for-30-days-on-frozen-meat-5546149.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/beef-165181569016x9.png", "publishedAt": "2022-07-13T08:27:16Z", "content": "The SARS-CoV-2 virus, which causes COVID-19, may survive on meat and fish products in the refrigerator or the freezer for up to 30 days, a study suggests.\r\nThe research, recently published in the jou… [+1979 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Yoga for increasing height: 5 most effective exercises to grow taller - Hindustan Times", "description": "Are you looking for a safe way to add a few centimetres to your height? Then look no further as Yoga is a holistic practice that can provide you with the solution to increase your height. Fitness expert reveals 5 most effective exercises to grow taller | Heal…", "url": "https://www.hindustantimes.com/lifestyle/health/yoga-for-increasing-height-5-most-effective-exercises-to-grow-taller-101657698401138.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/13/1600x900/Collage_Maker-13-Jul-2022-01.36-PM_1657699528400_1657699547618_1657699547618.jpg", "publishedAt": "2022-07-13T08:08:17Z", "content": "The practice of Yoga is known to increase your growth hormone and fitness experts insist that practising specific Yoga asanas is definitely one way to charge these hormones up and get them working fo… [+3232 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Do you have dark gums? Easy home remedies to treat this problem - Hindustan Times", "description": "Smoking, gum diseases or certain medication can cause blackening of your gum. But fret not. Here are some easy expert-approved home remedies for treatment. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/do-you-have-dark-gums-easy-home-remedies-to-treat-this-problem-101657695104596.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/13/1600x900/dark_gum_1657695249037_1657695261326_1657695261326.jpg", "publishedAt": "2022-07-13T06:58:49Z", "content": "Are your gums turning dark or black and you have no idea why that is happening? There could be many reasons behind discolouration of your gums ranging from lifestyle factors to medical conditions. Al… [+3740 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Newer Omicron subvariants account for over 80% new infections in the US - Ahmedabad Mirror", "description": "The newer and most contagious Omicron subvariants, known as BA.4 and BA.5, now make up more than 80 percent of Covid-19 infections in the US, according to data released by the US Centers for Disease Control and Prevention (CDC).\n\nThe BA.5 subvariant accounted…", "url": "https://ahmedabadmirror.com/newer-omicron-subvariants-account-for-over-80-new-infections-in-the-us/81838842.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1657694029338.jpg-org", "publishedAt": "2022-07-13T06:46:54Z", "content": "The newer and most contagious Omicron subvariants, known as BA.4 and BA.5, now make up more than 80 percent of Covid-19 infections in the US, according to data released by the US Centers for Disease … [+1160 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "TestoPrime Reviews (Updated 2022): Is it Fat Burner Worth Your Money Or Not? - Deccan Herald", "description": "TestoPrime is a supplement created to improve testosterone levels in men who suffer from hormonal deficiencies. It is an all-natural supplement that comes in a capsular form and super convenient to use. According to the official website, only four capsules pe…", "url": "https://www.deccanherald.com/brandspot/pr-spot/testoprime-reviews-updated-2022-is-it-fat-burner-worth-your-money-or-not-1126233.html", "urlToImage": null, "publishedAt": "2022-07-13T06:14:43Z", "content": "TestoPrime is a supplement created to improve testosterone levels in men who suffer from hormonal deficiencies. It is an all-natural supplement that comes in a capsular form and super convenient to u… [+20214 chars]"}, {"source": {"id": null, "name": "Eletsonline.com"}, "author": null, "title": "SRL Diagnostics launches Fatty Liver Index | eHealth Magazine eHealth Magazine - Elets", "description": "SRL Diagnostics has launched 'Fatty Liver Index'; a first-line diagnostic test for Non-Alcoholic Fatty Liver Disease.", "url": "https://ehealth.eletsonline.com/2022/07/srl-diagnostics-launches-fatty-liver-index/", "urlToImage": "https://ehealth.eletsonline.com/wp-content/uploads/2022/07/Fatty-Liver-Index.jpeg", "publishedAt": "2022-07-13T05:03:20Z", "content": "SRL Diagnostics has launched Fatty Liver Index; a first-line diagnostic test for Non-Alcoholic Fatty Liver Disease. Fatty Liver Index (FLI) is an algorithm-based index that includes multiple paramete… [+3270 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Long covid patients travel abroad seeking for unproven \"blood-washing\" treatment - News-Medical.Net", "description": "Thousands of people experiencing the debilitating symptoms of long covid are traveling abroad to seek costly but unproven treatments such as \"blood washing\", according to an investigation carried out by The BMJ and ITV News released today.", "url": "https://www.news-medical.net/news/20220713/Long-covid-patients-travel-abroad-seeking-for-unproven-blood-washing-treatment.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_of_human_red_blood_cells-Sebastian_Kaulitzki-2000_0cda0d0f3cb64b54bebc8de4486ae6a5-620x480.jpg", "publishedAt": "2022-07-13T05:00:00Z", "content": "Thousands of people experiencing the debilitating symptoms of long covid are traveling abroad to seek costly but unproven treatments such as \"blood washing\", according to an investigation carried out… [+6749 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Longer vaccine interval may be more effective against Omicron sub-variants: study - CGTN", "description": "In the absence of Omicron-specific vaccines, extending the vaccination interval between doses may provide a higher level of protection against Omicron sub-variants, according to a new study.", "url": "https://news.cgtn.com/news/2022-07-13/Longer-vaccine-gap-may-be-more-effective-against-Omicron-sub-variants-1bCWqaS4j0Q/index.html", "urlToImage": "https://news.cgtn.com/news/2022-07-13/Longer-vaccine-gap-may-be-more-effective-against-Omicron-sub-variants-1bCWqaS4j0Q/img/62f1114f01cc4b599dd5fe316095d1b0/62f1114f01cc4b599dd5fe316095d1b0-750.jpeg", "publishedAt": "2022-07-13T03:24:44Z", "content": "In the absence of Omicron-specific vaccines, extending the vaccination interval between doses may provide a higher level of protection against Omicron sub-variants, according to a new study.\r\nThe stu… [+2320 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Umesh Isalkar", "title": "Two patients succumb to dengue complications, one had Covid too - Times of India", "description": "Hospitals in the city are already reporting the season’s first cases of Covid-dengue coinfection. Over the last few days, two persons have died of de", "url": "https://timesofindia.indiatimes.com/city/pune/two-patients-succumb-to-dengue-complications-one-had-covid-too/articleshow/92840982.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-07-13T03:02:00Z", "content": ""}, {"source": {"id": null, "name": "Healthline"}, "author": "Jennifer M. Edwards", "title": "Can Sleep Apnea Cause Dry Eyes? Eye-Related Complications - Healthline", "description": "Dry eye is very common, especially for those with sleep apnea who use breathing devices at home to help them sleep. Here's why and what you can do for it.", "url": "https://www.healthline.com/health/sleep-apnea/can-sleep-apnea-cause-dry-eyes", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/07/man-rubbing-his-eyes-facebook-1200x628.png", "publishedAt": "2022-07-12T19:18:50Z", "content": "Obstructive sleep apnea is a condition that causes you to stop breathing in your sleep, leading you to wake up frequently during the night in order to keep breathing.\r\nIt can contribute to some serio… [+8671 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Migraine sufferers have treatment choices – a neurologist explains options beyond just pain medication - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "Colorado (US), July 12: Migraine headaches currently affect more than one billion people across the globe and are the second-leading cause of disability worldwide. Nearly one-quarter of US households have at least one member who suffers from migraines. An est…", "url": "https://www.dailyexcelsior.com/migraine-sufferers-have-treatment-choices-a-neurologist-explains-options-beyond-just-pain-medication/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/07/download-3-11.jpg", "publishedAt": "2022-07-12T19:14:17Z", "content": "Colorado (US), July 12: Migraine headaches currently affect more than one billion people across the globe and are the second-leading cause of disability worldwide.Nearly one-quarter of US households … [+7969 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Staff Reporter", "title": "Madhya Pradesh: IIT Indore research explores impacts of cancer-causing virus on brain cells - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/indore/madhya-pradesh-iit-indore-research-explores-impacts-of-cancer-causing-virus-on-brain-cells", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-03/fbb0385d-0fa3-4f73-96fb-c917712b7b45/stethoscope_myeloma_ribbon_23_2147738494.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-07-12T18:35:01Z", "content": "Indore (Madhya Pradesh): A research team from IIT Indore utilised the Raman microspectroscopy technique, supported by the Department of Science and Technology (DST) under the FIST scheme to explore t… [+2805 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A machine learning model to predict immunotherapy response in cancer patients - Science Daily", "description": "Development of a precision medicine technology based on artificial intelligence that predicts immunotherapy response in cancer patients.", "url": "https://www.sciencedaily.com/releases/2022/07/220712102724.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-07-12T17:18:17Z", "content": "Immunotherapy is a new cancer treatment that activates the body's immune system to fight against cancer cells without using chemotherapy or radiotherapy. It has fewer side effects than conventional a… [+2402 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "PTX3 levels act as biomarkers of mortality in patients with sepsis: BMC - Medical Dialogues", "description": "China: In a new study conducted by Guobin Wang and the team, it was found that individuals with...", "url": "https://medicaldialogues.in/critical-care/news/ptx3-levels-act-as-biomarkers-of-mortality-in-patients-with-sepsis-bmc-95843", "urlToImage": "https://medicaldialogues.in/h-upload/2021/07/22/157759-critical-care.jpg", "publishedAt": "2022-07-12T14:00:04Z", "content": "China: In a new study conducted by Guobin Wang and the team, it was found that individuals with sepsis who did not survive had much greater levels of Pentraxin-3 (PTX3) than patients who did. Mortali… [+2235 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Namrata Devikar", "title": "Only five test positive for swine flu, 1 death in 2022 in Pune - Hindustan Times", "description": "The symptoms include fever, lethargy, sneezing, coughing, difficulty in breathing and a decreased appetite.", "url": "https://www.hindustantimes.com/cities/pune-news/only-five-test-positive-for-swine-flu-1-death-in-2022-in-pune-101657630981986.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/12/1600x900/8d35bce4-01e2-11ed-ab02-e6bf6409323d_1657630958611.jpg", "publishedAt": "2022-07-12T13:03:01Z", "content": "Pune city, this year, has reported only five positive cases for H1N1 influenza or swine flu with one death so far according to health department officials. As the focus on health department officials… [+2109 chars]"}, {"source": {"id": null, "name": "Archziner.com"}, "author": null, "title": "The 10 Best Summer Fruits For GLOWING Skin (according to nutritionists) - Archziner", "description": "Eating the right foods can help you achieve your dream, glowy complexion. So, find out which summer fruits you need in your diet this summer.", "url": "https://archziner.com/lifestyle/10-summer-fruits-for-fresh-radiant-skin-according-to-nutritionists/", "urlToImage": "https://archziner.com/wp-content/uploads/2022/07/which-fruits-are-good-for-skin-and-hair-e1657630547818.jpg", "publishedAt": "2022-07-12T12:54:02Z", "content": "Beautiful skin and hair, a healthy body, cheerfulness, freshness, and energy we can easily have them all with regular servings of fruits! And, summer is the best time to eat a bowl of juicy fruit sal… [+6131 chars]"}, {"source": {"id": null, "name": "Thebetterindia.com"}, "author": "Anjali Krishnan", "title": "Why Your Dadi’s Turmeric Ghee Concoction Is A Must Have In The Monsoon - The Better India", "description": "From digestion and brain health to boosting immunity, there are many health benefits in one glass of this drink. Here’s the recipe.", "url": "https://www.thebetterindia.com/290540/turmeric-black-pepper-and-ghee-drink-for-monsoon-recipe-health-benefits-food-science/", "urlToImage": "https://en-media.thebetterindia.com/uploads/2022/07/Turmeric-ghee-concoction-1657548894.jpg", "publishedAt": "2022-07-12T12:24:19Z", "content": "The monsoon is an exciting time to experience beautiful rains and cold weather, but its also when we need to be extra cautious about our health.\r\nThe humid and wet climate enables several microorgani… [+3385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can a protein-rich diet help you lose weight? - The Indian Express", "description": "Just having a high protein diet will not help you lose weight until you back it up with increased physical activity. If you’re trying to lose weight and doing a lot of exercise, there’s definitely going to be some amount of muscle breakdown. So, a high protei…", "url": "https://indianexpress.com/article/lifestyle/health-specials/protein-rich-diet-help-lose-weight-8024580/", "urlToImage": "https://images.indianexpress.com/2022/07/prot-diet.jpg", "publishedAt": "2022-07-12T09:18:02Z", "content": "Is higher protein the answer to weight woes? A new study in the journal Obesity has revealed that a protein-rich diet encourages lower intake of sugar and processed foods and higher intake of green v… [+3860 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": "Web Developer", "title": "Video games enhance brain activity, decision-making skills: Study - mid-day.com", "description": "The authors, who used functional magnetic resonance imaging (FMRI) in the study, said the findings suggest that video games could be a useful tool for training in perceptual decision-making", "url": "https://www.mid-day.com/lifestyle/health-&-fitness/article/video-games-enhance-brain-activity-decision-making-skills-study-23235556", "urlToImage": null, "publishedAt": "2022-07-12T06:44:00Z", "content": "The findings of recent research by Georgia State University researchers suggest that frequent video game players show superior sensorimotor decision-making skills and enhanced activity in key regions… [+3379 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study offers first proof of connection between chronic pain and opioid use disorders - ETHealthWorld", "description": "Chronic pain may lead to OUD, and people with chronic pain and OUD have a harder time quitting opioids than people with OUD only.", "url": "https://health.economictimes.indiatimes.com/news/industry/study-offers-first-proof-of-connection-between-chronic-pain-and-opioid-use-disorders/92818571", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92818571,imgsize-44780,width-1200,height-628,overlay-ethealthworld/study-offers-first-proof-of-connection-between-chronic-pain-and-opioid-use-disorders.jpg", "publishedAt": "2022-07-12T05:15:00Z", "content": "Columbus: Scientists have long suspected a link between opioid use disorder (OUD) and chronic pain, but the brain processes that link OUD and chronic pain remain unknown. Researchers from The Ohio St… [+3413 chars]"}, {"source": {"id": null, "name": "Healthcare IT News"}, "author": null, "title": "Australia's CSIRO develops machine learning tool that spots emerging COVID-19 variants - Healthcare IT News", "description": "Using VariantSpark, researchers were able to identify new variants a week before they could be flagged by health professionals.", "url": "https://www.healthcareitnews.com/news/anz/australias-csiro-develops-machine-learning-tool-spots-emerging-covid-19-variants", "urlToImage": "https://www.healthcareitnews.com/sites/hitn/files/VariantSpark-can-analyse-data-from-the-SarsCoV2-virus-Photo-credit-Fusion-Medical.jpg", "publishedAt": "2022-07-12T04:12:13Z", "content": "Researchers at the Commonwealth Scientific and Industrial Research Organisation, Australias national science agency, have developed a machine learning tool to quickly identify emerging dangerous COVI… [+2811 chars]"}, {"source": {"id": null, "name": "National Herald"}, "author": "IANS", "title": "Explained: How Covid-19 infection damages brain - National Herald", "description": "While SARS-CoV-2 does not directly affect the brain, the immune response triggered by the infection damages the brain's blood vessels, leading to short- and long-term neurological symptoms", "url": "https://www.nationalheraldindia.com/international/explained-how-covid-19-infection-damages-brain", "urlToImage": "https://gumlet.assettype.com/nationalherald%2F2022-07%2F1a8c7956-5666-44c9-9ccd-92694ab4c41e%2FExplained__How_Covid_19_infection_damages_brain.jpeg?rect=0%2C0%2C1200%2C630&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-07-12T03:18:00Z", "content": "\"Activation of the endothelial cells brings platelets that stick to the blood vessel walls, causing clots to form and leakage to occur. At the same time the tight junctions between the endothelial ce… [+1256 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "S. Behring", "title": "Does a Full Blood Count Test Detect Cervical Cancer? - Healthline", "description": "A full blood test can't detect cervical cancer, but it can help manage it. Let's look at other tests and risk factors for CC:", "url": "https://www.healthline.com/health/cervical-cancer/can-a-full-blood-count-detect-cervical-cancer", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/05/blood-test-tubes-facebook-1200x628.jpg", "publishedAt": "2022-07-11T22:09:13Z", "content": "A full blood count is a test thats part of the diagnostic process for almost any cancer or disease. The test shows the levels of red blood cells, white blood cells, and platelets in your blood. \r\nThe… [+5453 chars]"}]}