{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Ajmc.com"}, "author": "Julia Bonavitacola", "title": "Long-term Dupilumab Effective in Patients With Asthma, Including Those With Nasal Polyps - AJMC.com Managed Markets Network", "description": "Patients with asthma who were with or without a diagnosis of nasal polyps were found to have results with long-term dupilumab.", "url": "https://www.ajmc.com/view/long-term-dupilumab-effective-in-patients-with-asthma-including-those-with-nasal-polyps", "urlToImage": "https://www.ajmc.com/AJMC_25Lockup.png", "publishedAt": "2022-12-05T18:12:43Z", "content": "A study published in Annals of Allergy, Asthma &amp; Immunology found that dupilumab was effective in patients with a diagnosis of asthma with or without a diagnosis of nasal polyps.\r\nThere are appro… [+4285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Large-scale vaccination, identifying hotspots: State task force drafts action plan to tackle measles - The Indian Express", "description": "Maharashtra has reported 836 measles cases and 18 deaths this year. The task force has suggested an active search for hotspots and special vaccination campaigns in the state.", "url": "https://indianexpress.com/article/cities/pune/large-scale-vaccination-identifying-hotspots-state-task-force-drafts-action-plan-to-tackle-measles-8307665/", "urlToImage": "https://images.indianexpress.com/2022/12/measles-9-3.jpg", "publishedAt": "2022-12-05T17:49:43Z", "content": "A meeting of experts with the Maharashtra state task force on measles prevention and control has resulted in an action plan for a mass-scale vaccination campaign in hotspot areas to tackle the menace… [+2731 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Roxanne Nelson, RN, BSN", "title": "Less Than Third of Americans Aware of Cancer Risk From Alcohol - Medscape", "description": "Despite strong evidence that all alcoholic beverages increase the risk of many types of cancer, Americans continue to be little aware of this risk, a new survey reveals.", "url": "https://www.medscape.com/viewarticle/985002", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_221205_wine_beer_liquor_800x450.jpg", "publishedAt": "2022-12-05T17:38:05Z", "content": "Another survey has shown that Americans are largely unaware of the link between alcohol consumption and cancer.\r\nThe new findings, from a nationally representative survey that included responses from… [+3441 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Ruchir Kumar", "title": "Patna to get surveillance centre for communicable diseases - Hindustan Times", "description": "As a post-Covid initiative, the Centre had selected Patna among 20 cities in India to set up a metropolitan surveillance centre for communicable diseases, initially for five years.", "url": "https://www.hindustantimes.com/cities/patna-news/patna-to-get-surveillance-centre-for-communicable-diseases-101670258868401.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/05/1600x900/276305e6-74bc-11ed-83df-4c1406394be7_1670258866306.jpg", "publishedAt": "2022-12-05T16:47:47Z", "content": "Rajaghat in Patna has been selected among 20 locations in India to host Bihars lone metropolitan surveillance centre for communicable diseases, officials familiar with the matter said.\r\nThe governmen… [+2760 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Home air purifiers can improve markers of cardiovascular health in people with COPD - News-Medical.Net", "description": "A six-month study led by Johns Hopkins Medicine researchers concludes that the use of portable home air purifiers can improve some markers of cardiovascular health in people with chronic obstructive pulmonary disease, or COPD.", "url": "https://www.news-medical.net/news/20221205/Home-air-purifiers-can-improve-markers-of-cardiovascular-health-in-people-with-COPD.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-12-05T16:35:00Z", "content": "A six-month study led by Johns Hopkins Medicine researchers concludes that the use of portable home air purifiers can improve some markers of cardiovascular health in people with chronic obstructive … [+5667 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Living in greener places linked to better mental health, lower medication use - ANI News", "description": "Many well-known health benefits of urban green space include increased life expectancy, fewer mental health issues, and improved cognitive performance. However, it is unclear how much green space is required to benefit people's health.", "url": "https://www.aninews.in/news/lifestyle/others/living-in-greener-places-linked-to-better-mental-health-lower-medication-use20221205220338", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221205163325.jpg", "publishedAt": "2022-12-05T16:33:00Z", "content": "Washington [US], December 5 (ANI): Many well-known health benefits of urban green space include increased life expectancy, fewer mental health issues, and improved cognitive performance. However, it … [+3113 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Tim Smith", "title": "Psoriasis Patients with Lupus Erythematosus Skew Female, More Likely to Have Joint Involvement - MD Magazine", "description": "In a recent study, patients with psoriasis and coexistent lupus erythematosus were analyzed regarding their clinical characteristics, condition management, and quality of life.", "url": "https://www.hcplive.com/view/psoriasis-patients-lupus-erythematosus-skew-female-more-likely-joint-involvement", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/dec1c766f96bbaf40126541b26b7dc5dcbafea83-300x300.jpg?fit=crop&auto=format", "publishedAt": "2022-12-05T16:26:18Z", "content": "A cross-sectional study on clinical characteristics, life quality, and condition management of psoriasis patients with coexistent lupus erythematosus (LE) finds that this type of combined condition i… [+3729 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "The husband-and-wife duo built a complete health solution to fight micronutrient deficiency in India - mid-day.com", "description": "The award-winning dietician and fitness enthusiast duo of Dr. Rekha and Saurabh have started an innovative health solution called InstaEats, India's first natural micronutrient snack for daily nutrition and wellness.", "url": "https://www.mid-day.com/brand-media/article/the-husband-and-wife-duo-built-a-complete-health-solution-to-fight-micronutrient-23259168", "urlToImage": "https://images.mid-day.com/images/images/2022/dec/InstaFats_d.jpg", "publishedAt": "2022-12-05T16:17:00Z", "content": "The award-winning dietician and fitness enthusiast duo of Dr. Rekha and Saurabh have started an innovative health solution called InstaEats, India's first natural micronutrient snack for daily nutrit… [+4078 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Diana Isaacs, PharmD, BCPS, BC-ADM, CDCES, Natalie Bellini, DNP, FNP-BC", "title": "Limitations of Injectable Insulin in Type 1 and Type 2 Diabetes - MD Magazine", "description": "Drs Diana Isaacs and Natalie Bellini discuss the limitations of injectable insulins in achieving time-in-range and glucose targets in type 1 and type 2 diabetes.", "url": "https://www.hcplive.com/view/limitations-of-injectable-insulin-in-type-1-and-type-2-diabetes", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/d233ec23efec66f39a5e1e7ce15797210ce52deb-1920x1080.jpg?fit=crop&auto=format", "publishedAt": "2022-12-05T16:04:38Z", "content": "Natalie Bellini, DNP, FNP-BC: The hardest part, if I can get the basal set, is getting those post-meal spikes down. In every interaction with every patient, there is at least some discussion of post-… [+3152 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "New Method to Separate and Categorize Blood-Based Nanoparticles - AZoNano", "description": "A single sound wave creates a series of “virtual pillars” down the middle of a fluid-filled channel, gently moving nanoparticles to the side.", "url": "https://www.azonano.com/news.aspx?newsID=39953", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/ImageForNews_39953_16702555711818070.jpg", "publishedAt": "2022-12-05T15:57:00Z", "content": "Dec 5 2022Reviewed by Alex Smith\r\nA device that applies sound waves to divide and sort minute particles located in the blood within minutes has been developed by Engineers at Duke University. The tec… [+5096 chars]"}, {"source": {"id": null, "name": "Technotification.com"}, "author": "Rishabh Shandilya", "title": "Bad Habits You Should Break If You Want to Achieve Great Success - Technotification", "description": "Your creative juices don't follow a timetable. Having limits is acceptable, even encouraged, in certain situations.", "url": "https://www.technotification.com/2022/12/bad-habits-you-should-break-if-you-want-to-achieve-great-success.html", "urlToImage": "https://www.technotification.com/wp-content/uploads/2022/12/bad-habits-x-.jpeg", "publishedAt": "2022-12-05T15:32:45Z", "content": "Picasso was prone to several vices. A typical day for him would begin with him sleeping till early afternoon. Alcohol was consumed by him. In this case, he smoked. Basically, he lied. He’d become fix… [+2912 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "COVID-19 vaccination correlates with fewer associated deaths among patients on dialysis - Healio", "description": "Patients undergoing dialysis who received a COVID-19 vaccination experienced fewer associated hospitalizations and deaths than those who did not receive a vaccination, according to data published in the American Journal of Kidney Diseases.Further, vaccine eff…", "url": "https://www.healio.com/news/nephrology/20221205/covid19-vaccination-correlates-with-fewer-associated-deaths-among-patients-on-dialysis", "urlToImage": "https://www.healio.com/~/media/temporary/covid19.jpg", "publishedAt": "2022-12-05T15:24:08Z", "content": "Patients undergoing dialysis who received a COVID-19 vaccination experienced fewer associated hospitalizations and deaths than those who did not receive a vaccination, according to data published in … [+3153 chars]"}, {"source": {"id": null, "name": "Cancertherapyadvisor.com"}, "author": "Leah Lawrence", "title": "Breast Cancer Survivors Have Increased Risk of Implant-Associated ALCL - Oncology Nurse Advisor", "description": "Breast cancer survivors have an increased risk of breast implant-associated ALCL, but the absolute risk is “extremely low,” according to researchers.", "url": "https://www.cancertherapyadvisor.com/home/cancer-topics/breast-cancer/implant-associated-alcl-risk-increased-breast-cancer-survivors/", "urlToImage": "https://www.cancertherapyadvisor.com/wp-content/uploads/sites/12/2021/10/Breast-implants-ss-129884363.jpg", "publishedAt": "2022-12-05T15:20:00Z", "content": "Breast cancer survivors have an increased risk of breast implant-associated anaplastic large-cell lymphoma (ALCL), but the absolute risk is extremely low, according to researchers. They reported thes… [+1911 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Ranita Ray", "title": "Heard About Coconut Embryo? You Must Start Eating! Here Is Why - Slurrp", "description": "Don't go by the name! This embryo, also known as the coconut pearl or coconut apple, is high in antioxidants and minerals. It boosts immunity and has antiviral, antibacterial, antifungal, and antiparasite effects. If you need a natural source of instant energ…", "url": "https://www.slurrp.com/article/heard-about-coconut-embryo-you-must-start-eating-here-is-why-1670248499319", "urlToImage": "https://images.slurrp.com/prodarticles/emfqzr2r7o.webp", "publishedAt": "2022-12-05T14:33:07Z", "content": "Have you ever cracked open a coconut and observed a small spherical, soft, and spongy structure? Are you torn about whether or not to consume it? If that's the case, you must stay with us to explore … [+3625 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Opioid-gabapentinoid therapy for GI diseases increases risk of depression - Medical Dialogues", "description": "Despite manageable gastrointestinal (GI) side effects, opioid-gabapentinoid combo therapy may be linked to a higher risk of central nervous system (CNS) depression and mortality says an article...", "url": "https://medicaldialogues.in/medicine/news/opioid-gabapentinoid-therapy-for-gi-diseases-increases-risk-of-depression-103313", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/21/188755-medicine-new-1.jpg", "publishedAt": "2022-12-05T14:30:59Z", "content": "Despite manageable gastrointestinal (GI) side effects, opioid-gabapentinoid combo therapy may be linked to a higher risk of central nervous system (CNS) depression and mortality says an article publi… [+2531 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "CHEST releases updated guidelines on perioperative management of antithrombotic therapy - Medical Dialogues", "description": "USA: The American College of Chest Physicians (CHEST) has released new guidelines for the perioperative management of antithrombotic therapy. The guidelines, published in the CHEST journal with", "url": "https://medicaldialogues.in/surgery/guidelines/chest-releases-updated-guidelines-on-perioperative-management-of-antithrombotic-therapy-103492", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/05/192901-antithrombotic-therapy.jpg", "publishedAt": "2022-12-05T14:30:39Z", "content": "USA: The American College of Chest Physicians (CHEST) has released new guidelines for the perioperative management of antithrombotic therapy. The guidelines, published in the CHEST journal with the i… [+4146 chars]"}, {"source": {"id": null, "name": "BOXROX"}, "author": null, "title": "20 Healthy Foods that will Help you Lose Belly Fat | BOXROX - BOXROX", "description": "Foods that will Help you Lose Belly Fat. Add these tasty foods into your diet if you want to get healthier, leaner and fitter.", "url": "https://www.boxrox.com/20-healthy-foods-that-will-help-you-lose-belly-fat/", "urlToImage": "https://image.boxrox.com/2018/08/Healthy-Heart.png", "publishedAt": "2022-12-05T14:30:00Z", "content": "Max Posternak from Gravity Transformation has come up with an extensive list of 20 foods that will help you lose belly fat.\r\nSource: Stevie D Photography / Vitamix\r\nDiet\r\nIf you’re seriously trying t… [+7548 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "What are the health benefits of low sodium diet? - Firstpost", "description": "When you have a low-sodium diet then the chances of  getting high blood pressure are very less.", "url": "https://www.firstpost.com/living/low-sodium-diet-5-health-benefits-you-should-know-11756611.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/12/WhatsApp-Image-2022-12-05-at-7.44.42-PM.jpg", "publishedAt": "2022-12-05T14:16:05Z", "content": "Sodium is known to have several benefits for our bodies. Sodium is naturally found in vegetables and eggs and is also the main component of table salt. \r\nThough it is important for our health, its co… [+1765 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid variants still transmissible between species: Study - ETHealthWorld", "description": "The findings, published in the journal Royal Society Open Science, show how the viral spike proteins in several SARS-CoV-2 variants interact with the host cell receptors known as ACE2 in both humans and various bats of genus Rhinolophus.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-variants-still-transmissible-between-species-study/96006613", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96006613,imgsize-125372,width-1200,height-628,overlay-ethealthworld/covid-variants-still-transmissible-between-species-study.jpg", "publishedAt": "2022-12-05T14:15:00Z", "content": "Dubai: The SARS-CoV-2 virus is still highly transmissible between mammals, according to a study based on computer simulations. Researchers at Rochester Institute of Technology (RIT), US, found that c… [+1663 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Morning exercise linked to decreased incidence of cardiovascular illnesses - Medical Dialogues", "description": "Researchers have found in a new study that Morning walks significantly decrease cardiovascular incidents. The study underlines potential value of chronoactivity in cardiovascular disease (CVD)...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/morning-exercise-linked-to-decreased-incidence-of-cardiovascular-illnesses-103496", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/10/187543-walking-toward-group-closeupfeetthmb.jpg", "publishedAt": "2022-12-05T14:00:33Z", "content": "Researchers have found in a new study that Morning walks significantly decrease cardiovascular incidents. The study underlines potential value of chronoactivity in cardiovascular disease (CVD) preven… [+2777 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Devrupa Rakshit", "title": "Being Glued to Smartphones Can Curb Creativity, Research Shows - The Swaddle", "description": "Addiction to smartphones may prevent the brain’s prefrontal cortex and temporal areas from being active when thinking creatively.", "url": "https://theswaddle.com/being-glued-to-smartphones-can-curb-creativity-research-shows/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/12/051222_phone-creativity_Editorial.jpg", "publishedAt": "2022-12-05T13:55:35Z", "content": "In the era of smartphones and instant gratification, it’s become easier to keep boredom at bay. The moment we start to get bored, all we have to do is reach for our phones, and either scroll through … [+5478 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Deploying technology to detect TB - Express Healthcare", "description": "Madhav Joshi, CEO, India Health Fund talks about the role of technology in managing Tuberculosis (TB)", "url": "https://www.expresshealthcare.in/news/deploying-technology-to-detect-tb/437175/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/12/05190736/CEO-Madhav-Joshi.jpg", "publishedAt": "2022-12-05T13:38:21Z", "content": "Madhav Joshi, CEO, India Health Fund talks about the role of technology in managing Tuberculosis (TB)\r\nTB is a serious threat to public health and over the last decade, there has been a significant i… [+3068 chars]"}, {"source": {"id": null, "name": "FOX 29 News Philadelphia"}, "author": "Sponsored", "title": "Best Phentermine Over The Counter: Top 5 Diet Pills Of 2022 - FOX 29 Philadelphia", "description": "Are you searching for the best phentermine over-the-counter deals? We have a whole list of the top 5 picks ready to help you in this article", "url": "https://www.fox29.com/sponsored/best-phentermine-over-the-counter-top-5-diet-pills-of-2022", "urlToImage": "https://images.foxtv.com/static.fox29.com/www.fox29.com/content/uploads/2022/12/1280/720/SPONSORED-Feature-Image.jpg?ve=1&tl=1", "publishedAt": "2022-12-05T13:31:48Z", "content": "Weight loss is a difficult journey. We all strive hard to lose unwanted fat over our bodies. We exercise, exhaust, diet, burn calories, and do whatever we can in this journey. However, if our calorie… [+32024 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Elana Spivack", "title": "How much salt is too much? Heart health study has a new answer - Inverse", "description": "A study looked at the link between how frequently people added salt to their meals and the incidence of heart disease.", "url": "https://www.inverse.com/mind-body/how-much-salt-is-too-much", "urlToImage": "https://imgix.bustle.com/uploads/getty/2022/12/1/9a2a1267-ee92-4e01-9f2a-1a6735abc94e-getty-1426947699.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2022-12-05T13:30:25Z", "content": "Unfortunately, some\r\ningredients\r\n that make food especially delicious also help drive us to our graves. And it can be hard to make salad as addictive as salt-laden potato chips.\r\nEveryone needs the … [+4751 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Comparison of blood plasma protein expression in mild, moderate, and severe COVID-19 identifies novel disease severity biomarkers - News-Medical.Net", "description": "Researchers evaluated blood plasma proteins to identify new targets for COVID-19 treatment approaches and prevent complications associated with severe illness.", "url": "https://www.news-medical.net/news/20221205/Comparison-of-blood-plasma-protein-expression-in-mild-moderate-and-severe-COVID-19-identifies-novel-disease-severity-biomarkers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_732788_16702463640597372.jpg", "publishedAt": "2022-12-05T13:24:00Z", "content": "In a recent study posted to the bioRxiv* server, researchers evaluated blood plasma proteins to identify new targets for coronavirus disease 2019 (COVID-19) treatment approaches and prevent complicat… [+5646 chars]"}, {"source": {"id": null, "name": "Indiaai.gov.in"}, "author": null, "title": "Exploring Simulated annealing - a probabilistic technique - INDIAai", "description": "Simulated annealing (SA) is often used when the search space is clear.", "url": "https://indiaai.gov.in/article/exploring-simulated-annealing-a-probabilistic-technique", "urlToImage": "https://d12aarmt01l54a.cloudfront.net/cms/images/Media-20221205181921/1200-630.png", "publishedAt": "2022-12-05T13:20:09Z", "content": "Simulated annealing (SA)\r\n is often used when the search space is clear. In addition, simulated annealing may be better than exact algorithms like gradient descent or branch and bound when finding an… [+3193 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Fungal Sinusitis: Know The Symptoms And Treatment Of This Nose Infection - News18", "description": "If you have a runny nose along with swelling, then you may have contracted a fungal infection, which is known as Fungal Sinusitis.", "url": "https://www.news18.com/news/lifestyle/fungal-sinusitis-know-the-symptoms-and-treatment-of-this-nose-infection-6543331.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-design-6-8-167024540516x9.png", "publishedAt": "2022-12-05T13:03:56Z", "content": "A lot of people suffer from a runny nose or common cold and cough in winter. Typically, all of these are caused by a viral infection. There is nothing to be worried about if it is a common cold. Howe… [+1586 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "12 Proven Ways to Increase Testosterone - Deccan Herald", "description": "Levels Naturally There are several techniques to raise testosterone, but only a few of them are simple, natural, and efficient. You should have patience with the outcomes when you first begin using these natural testosterone-boosting strategies and supplement…", "url": "https://www.deccanherald.com/brandspot/pr-spot/12-proven-ways-to-increase-testosterone-1168707.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1168707-1670244435.png", "publishedAt": "2022-12-05T12:47:15Z", "content": "Levels Naturally\r\nThere are several techniques to raise testosterone, but only a few of them are simple, natural, and efficient. You should have patience with the outcomes when you first begin using … [+7348 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Lifelong stress may increase risk for cancer mortality - Healio", "description": "Higher allostatic load, a measure of lifelong stress, correlated with increased risk for cancer mortality, especially among younger populations, according to study results published in SSM Population Health. The findings showed associations of high allostatic…", "url": "https://www.healio.com/news/hematology-oncology/20221202/lifelong-stress-may-increase-risk-for-cancer-mortality", "urlToImage": "https://www.healio.com/~/media/slack-news/hemonc/misc/infographics/hot-infographics/2022/12-december/hot1022moore_ig2_web.jpg", "publishedAt": "2022-12-05T12:10:06Z", "content": "Higher allostatic load, a measure of lifelong stress, correlated with increased risk for cancer mortality, especially among younger populations, according to study results published in SSM Population… [+3893 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop a polyvalent lipid nanoparticle mRNA vaccine against Monkeypox virus - News-Medical.Net", "description": "Researchers developed an mRNA technology-based vaccine candidate against the monkeypox virus and evaluated its immunogenicity in animal models.", "url": "https://www.news-medical.net/news/20221205/Researchers-develop-a-polyvalent-lipid-nanoparticle-mRNA-vaccine-against-Monkeypox-virus.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_732776_16702373882021295.jpg", "publishedAt": "2022-12-05T10:56:00Z", "content": "In a recent study posted to the bioRxiv* server, researchers developed a messenger ribonucleic acid (mRNA) technology-based vaccine candidate against the monkeypox virus (MPXV) and evaluated its immu… [+6518 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Rahul Dolare", "title": "How does weight loss help in the management of arthritis? - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/how-does-weight-loss-help-in-the-management-of-arthritis/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2022/12/weight-loss.jpeg", "publishedAt": "2022-12-05T10:41:53Z", "content": "Authored by Dr. Chethana D, Consultant – Rheumatology, Aster CMI Hospital, Bangalore\r\nPune, 5th December 2022: Living with Rheumatoid Arthritis (RA) can be challenging as constant aches, swelling in … [+4968 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Long Covid Symptoms In Children Likely To Change Over Time: Lancet Study - NDTV", "description": "Symptoms of long Covid experienced by children and young people may change over time, according to the largest study of its kind published in The Lancet Regional Health - Europe.", "url": "https://www.ndtv.com/india-news/long-covid-symptoms-in-children-likely-to-change-over-time-lancet-study-3579014", "urlToImage": "https://c.ndtvimg.com/2022-01/j5o8gf0o_covid-test-israel-reuters_625x300_06_January_22.jpg", "publishedAt": "2022-12-05T10:38:00Z", "content": "The researchers said doctors should be aware of the change in symptoms in children. (File)\r\nLondon: Symptoms of long Covid experienced by children and young people may change over time, according to … [+2907 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Rahul Dolare", "title": "80 Yr Old Man Successfully Undergoes TAR Procedure For Hernia In Pune Hospital - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/80-yr-old-man-successfully-undergoes-tar-procedure-for-hernia-in-pune-hospital/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2015/10/Punekar-News-logo3.png", "publishedAt": "2022-12-05T10:37:51Z", "content": "Pune, 5th December 2022: A team headed by Dr Kedar Patil, Lead Bariatric, Hernia &amp; Advanced Laparoscopic Surgeon at Apollo Spectra Hospitals successfully treated an 80-year-old elderly man with a… [+3656 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Suruchi N G", "title": "5 Reasons to eat apples in winter, find out here - Asianet Newsable ", "description": "Apples have a juicy flavour to them and are high in dietary fibre pectin, which is known for boosting your metabolism, maintaining your heart health and regulating blood sugar spikes. They can also be had as a healthy snack. Read on to find out more.", "url": "https://newsable.asianetnews.com/lifestyle/5-reasons-to-eat-apples-in-winter-find-out-here-sur-rmeymk", "urlToImage": "https://static-ai.asianetnews.com/images/01dyyvkk4nf6kccpffvj487b7z/edit--11--jpg_1200x630xt.jpg", "publishedAt": "2022-12-05T10:32:44Z", "content": "Apples have a juicy flavour to them and are high in dietary fibre pectin, which is known for boosting your metabolism, maintaining your heart health and regulating blood sugar spikes. They can also b… [+2364 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Gaurvi Narang", "title": "New Alzheimer's drug Lecanemab shows promising results, but raises several questions - ThePrint", "description": "While lecanemab saw less decline in cognition and function of patients, the drug is effective only at a very early stage -- closer to the onset of the disease.", "url": "https://theprint.in/health/new-alzheimers-drug-lecanemab-shows-promising-results-but-raises-several-questions/1249186/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/08/brain-1787622_1280.jpg", "publishedAt": "2022-12-05T10:27:03Z", "content": "New Delhi: A promising new drug that slows down Alzheimers disease will be rolled out for the US Food and Drug Administrations (FDA) approval next year.\r\nThe encouraging yet not entirely groundbreaki… [+4069 chars]"}, {"source": {"id": null, "name": "SheFinds"}, "author": "faith geiger", "title": "A Personal Trainer Tells Us How To Boost Your Metabolism Through Your Workouts - SheFinds", "description": "Discover two of the best types of exercise to boost your metabolism, according to experts. Only on SheFinds.", "url": "https://www.shefinds.com/collections/boost-metabolism-workout-hiit-strength-training/", "urlToImage": "https://www.shefinds.com/files/2022/12/woman-strength-training-with-barbell.jpg", "publishedAt": "2022-12-05T10:00:54Z", "content": "Exercise is a vital part of any good weight loss plan. We probably don’t have to tell you twice that getting up and moving as much as possible is essential to a healthy lifestyle, especially if you’r… [+3106 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "TurboTest Reviews: Will the TurboTest Supplement Work for You? - Deccan Herald", "description": "Despite their age, men always want to sexually gratify their partners. Regrettably, becoming older might lead to a reduction in the synthesis of some hormones that are essential to maintaining sexual health. Some individuals achieve and maintain optimal sexua…", "url": "https://www.deccanherald.com/brandspot/pr-spot/turbotest-reviews-will-the-turbotest-supplement-work-for-you-1168599.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1168599-1670233498.png", "publishedAt": "2022-12-05T09:44:25Z", "content": "Despite their age, men always want to sexually gratify their partners. Regrettably, becoming older might lead to a reduction in the synthesis of some hormones that are essential to maintaining sexual… [+11229 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Hitansha Tagra", "title": "Indoor workers are at high risk of vitamin D deficiency; expert advises use of supplements - News9 LIVE", "description": "Vitamin D is a nutrient your body requires for normal bone development and maintenance", "url": "https://www.news9live.com/health/indoor-workers-are-at-high-risk-of-vitamin-d-deficiency-expert-advises-use-of-supplements-211983", "urlToImage": "https://media.news9live.com/h-upload/2022/12/05/588677-d.jpg", "publishedAt": "2022-12-05T09:29:27Z", "content": "Your nine-to-five job could be a huge factor that puts you at higher risk of Vitamin D deficiency. A vitamin D deficiency occurs when your body does not have enough vitamin D. It is primarily respons… [+2932 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Rishabh Raj", "title": "Foods to avoid after you hit 40 - NewsBytes", "description": "Food helps us in sustaining life and growth, and the quality of life depends on what you are eating and what you aren't", "url": "https://www.newsbytesapp.com/news/lifestyle/foods-to-avoid-for-40-above-year-olds/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l2620221205145132.jpeg", "publishedAt": "2022-12-05T09:26:18Z", "content": "Foods to avoid after you hit 40\r\nDec 05, 2022, 02:56 pm2 min read\r\nAs you age, it is important to pay attention to your diet.\r\n Food helps us in sustaining life and growth, and the quality of life de… [+2019 chars]"}, {"source": {"id": null, "name": "Drug Target Review"}, "author": null, "title": "What parts of a tumour are linked to muscle wasting? - Drug Target Review", "description": "US researchers found that the severity of muscle wasting from cancer is related to the type, size and location of the tumour, in mice.", "url": "https://www.drugtargetreview.com/news/106930/what-parts-of-a-tumour-are-linked-to-muscle-wasting/", "urlToImage": "https://www.drugtargetreview.com/wp-content/uploads/muscle-wasting.jpg", "publishedAt": "2022-12-05T09:10:06Z", "content": "Posted: 5 December 2022 | Izzy Wood (Drug Target Review) | No comments yet\r\nUS researchers found that the severity of muscle wasting from cancer is related to the type, size and location of the tumou… [+2387 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Chemist Warehouse - Gold Coast Keto Australia Dark Truth You Need to Know - The Tribune India", "description": "Gold Coast Keto Capsules are a ketogenic diet that helps you lose every ounce of excess body weight. It helps the body get the most out of fat-burning machines without consuming too much energy. It reduces appetite and makes people feel better about eating sm…", "url": "https://www.tribuneindia.com/news/brand-connect/chemist-warehouse-gold-coast-keto-australia-dark-truth-you-need-to-know-457970", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_223868913.png", "publishedAt": "2022-12-05T08:27:00Z", "content": "Gold Coast Keto Capsules are a ketogenic diet that helps you lose every ounce of excess body weight. It helps the body get the most out of fat-burning machines without consuming too much energy. It r… [+14498 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Christina Jackson", "title": "Misfolding Protein May Pave the Road to Personalized Medicine Approach - Genetic Engineering & Biotechnology News", "description": "Mutation in the misfolding protein that causes Parkinson's disease offers protection against multiple system atrophy.", "url": "https://www.genengnews.com/neurological-disorders/misfolding-protein-may-pave-the-road-to-personalized-medicine-approach/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2020/10/Oct13_2020_Getty_1136667866_FemaleScientistNeurons.jpg", "publishedAt": "2022-12-05T08:00:45Z", "content": "Researchers at the University of Massachusetts Amherst have discovered that a mutation in the misfolding protein that causes Parkinson’s disease offers protection against the fatal neurodegenerative … [+3497 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Fatty liver cure tips: Nutritional diet, supplements, lifestyle, fitness tweaks - Hindustan Times", "description": "The work-from-home situation and the inactivity experienced during lockdowns have led to a rise in disorders related to the liver and today, about one member of every family suffers from fatty liver. Here are tips on nutritional diet, supplements, lifestyle a…", "url": "https://www.hindustantimes.com/lifestyle/health/fatty-liver-cure-tips-nutritional-diet-supplements-lifestyle-fitness-tweaks-101670221397656.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/05/1600x900/FjBKjhZX0AEaJjN_1670223589544_1670223609081_1670223609081.jpg", "publishedAt": "2022-12-05T07:06:48Z", "content": "Maintaining good health requires the body to undergo regular detoxification and the liver is crucial to this process where most liver conditions can be avoided. Doctors assert that the work-from-home… [+4617 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Kavita", "title": "Give your heart some extra care post cardiac surgery to avoid complications - Health shots", "description": "Did you know that people who have had a cardiac surgery can suffer a cardiac arrest? Here's how to reduce your risk.", "url": "https://www.healthshots.com/how-to/reduce-the-risk-of-cardiac-arrest-post-cardiac-surgery/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/12/05100235/post-cardiac-surgery.jpg", "publishedAt": "2022-12-05T06:15:12Z", "content": "The daily hustle, work pressure, and infinite nerve-cracking situations put a lot of stress on your heart. An unhealthy lifestyle with low physical activities and intake of high-calorie, processed fo… [+4004 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Amy Moriarty", "title": "Before you tell someone they're 'a bit OCD', maybe you should pause - The Irish Times", "description": "People with obsessive-compulsive disorder may be stuck in an infinite number of thought loops, cycling around and around", "url": "https://www.irishtimes.com/health/your-wellness/2022/12/05/before-you-tell-someone-theyre-a-bit-ocd-maybe-you-should-pause/", "urlToImage": "https://www.irishtimes.com/resizer/015Ga7Z46Bmrtlm971U2kldWl4o=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/6EX5SD6JRJGS5GJZIRVPFLFFYI.jpg", "publishedAt": "2022-12-05T06:07:05Z", "content": "Not long ago I was browsing a quaint rural giftshop, the type where every product has been carefully positioned such that you want everything despite needing nothing.\r\nI caught the eye of the shop as… [+6019 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Rishabh Raj", "title": "5 ways to detox after binge-eating during the wedding season - NewsBytes", "description": "At weddings, we consume all sorts of junk and sugary food, but let that not disturb your healthy dietary habit", "url": "https://www.newsbytesapp.com/news/lifestyle/5-ways-to-detox-after-wedding-season-binge-eating/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l49820221128153222.jpeg", "publishedAt": "2022-12-05T05:38:25Z", "content": "5 ways to detox after binge-eating during the wedding season\r\nDec 05, 2022, 11:08 am2 min read\r\nThis wedding season, you might have already visited many functions and reception parties, and we are su… [+2107 chars]"}, {"source": {"id": null, "name": "Businesswireindia.com"}, "author": null, "title": "Art of Healing Cancer Launches High-Dose Vitamin C IVC Treatment for Cancer Patients - Business Wire India", "description": "Art of Healing Cancer Launches High-Dose Vitamin C IVC Treatment for Cancer Patients", "url": "https://www.businesswireindia.com/art-of-healing-cancer-launches-high-dose-vitamin-c-ivc-treatment-for-cancer-patients-82074.html", "urlToImage": "https://cms.businesswireindia.com/Uploads/OGTag/OG_Companylog_82074.jpg", "publishedAt": "2022-12-05T05:33:33Z", "content": "In 2020, the combined age-standardised rate for all cancers, excluding non-melanoma skin cancer, was 190 per 100,000, and men had a greater rate of developing cancer (206.9 per 100,000) than women (1… [+3589 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Consuming ghee 'has some contraindications'; find out what they are - The Indian Express", "description": "\"Always remember, just because something is healthy, doesn't mean it is suited for you,\" the expert said", "url": "https://indianexpress.com/article/lifestyle/health/ghee-health-impacts-pregnancy-liver-fever-digestion-8028470/", "urlToImage": "https://images.indianexpress.com/2022/07/Getty-ghee_1200.jpg", "publishedAt": "2022-12-05T04:30:45Z", "content": "Indian cuisine can’t be imagined without dollops of ghee– considered one of the healthiest everyday foods, according to Ayurveda. It not just adds a rich taste to a range of dishes but also has sever… [+2033 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Karishma Pranav Bhavsar", "title": "Measles surge in India: Govt directs states to boost fever, rash surveillance | Mint - Mint", "description": "The World Health Organisation (WHO) have asserted saying that a single case can lead to 12 to 18 infections.", "url": "https://www.livemint.com/science/health/measles-surge-in-india-govt-directs-states-to-boost-fever-rash-surveillance-11670205769284.html", "urlToImage": "https://images.livemint.com/img/2022/12/05/600x338/INDIA-HEALTH-VACCINE-measles_1669248015179_1670208597549_1670208597549.jpg", "publishedAt": "2022-12-05T03:03:49Z", "content": "The recent measles outbreak, which is vastly common among children, is risking millions of lives, with some Indian states seeing a massive surge. The World Health Organisation (WHO) too have asserted… [+5762 chars]"}, {"source": {"id": null, "name": "Stylemania.it"}, "author": null, "title": "The oldest virus ever, discovered under the Siberian ice, is 48,500 years old - msnNOW", "description": "The Pandoravirus yedoma, an ancient virus found in Siberian permafrost, has been revived after 48,500 years. It is one of the seven types of permafrost virus, the soil perpetually frozen in depth. The youngest had been frozen for 27,000 years and the oldest, …", "url": "https://www.stylemania.it/scienza/scoperto-sotto-i-ghiacci-siberiani-il-virus-pi-antico-di-sempre-ha-48-500-anni_346722.htm?lang=EN", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA14U5nE.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-12-05T03:00:00Z", "content": "Please give an overall site rating:"}, {"source": {"id": null, "name": "The Quint"}, "author": "Saadhya Mohan", "title": "Do You Have Nightmares About Exams as An Adult? Psychologists Decode Why - The Quint FIT", "description": "Exam Anxiety: Many adults continue to dream about exam even years after they graduated. Dr Ruksheda Syeda, a psychotherapist in Mumbai, notes, \"These dreams, are reflective of days which were stressful or an event that is causing anxiety.\"", "url": "https://www.thequint.com/fit/do-you-still-have-nightmares-dreams-about-exams-as-an-adult", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2Fc82997ce-f624-4dc5-a4d3-40194d937e1b%2Fexam_stress.jpg?rect=0%2C0%2C2000%2C1050&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-05T02:30:00Z", "content": "Dr Ruksheda Syeda, a psychotherapist in Mumbai, notes, \"75 percent of the population has recurrent dreams, and of those, 75 percent have recurrent bad dreams. It is a normal physiological process. Th… [+296 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News - LatestLY", "description": "Get latest articles and stories on Science at LatestLY.  \nStudy disocveered that blood-brain barrier has long been recognised for its capacity to maintain exact control over which molecules can enter the nervous system, little is known about how the cells tha…", "url": "https://www.latestly.com/agency-news/science-news-researchers-discover-new-conceptual-approach-for-blood-brain-barrier-in-neuron-function-damage-4544492.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg", "publishedAt": "2022-12-05T01:42:27Z", "content": "Washington [US], December 5 (ANI): There is very little knowledge on how the cells that make up the blood-brain barrier affect the nervous system's functionality, despite the fact that the blood-brai… [+5864 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI", "title": "Study explores how common immune cells might prevent intestinal healing - Business Standard", "description": "Karolinska Institute researchers have demonstrated that B lymphocytes on which the efficient operation of the immune system depends can occasionally cause more harm than good", "url": "https://www.business-standard.com/article/current-affairs/study-explores-how-common-immune-cells-might-prevent-intestinal-healing-122120400844_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-10/13/full/1665664092-6994.jpg", "publishedAt": "2022-12-04T18:00:00Z", "content": "Karolinska Institutet researchers have demonstrated that B lymphocytes, on which the efficient operation of the immune system depends, can occasionally cause more harm than good since their numbers s… [+2495 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Alpilean Weight Loss Supplement - Are Alpine Ice Hack Reviews Legit or Fake News? - The Tribune India", "description": "December 2022 Alpilean Customer Update: Ever since Alpilean healthy weight loss support pills launched in October 2022, it has been in extreme demand all around the world. However, fast forward to December 2022 and there are new safety concerns and side effec…", "url": "https://www.tribuneindia.com/news/impact-feature/alpilean-weight-loss-supplement-are-alpine-ice-hack-reviews-legit-or-fake-news-457711", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_751381914.jpg", "publishedAt": "2022-12-04T15:18:00Z", "content": "December 2022 Alpilean Customer Update: Ever since Alpilean healthy weight loss support pills launched in October 2022, it has been in extreme demand all around the world. However, fast forward to De… [+14391 chars]"}, {"source": {"id": null, "name": "Startup.info"}, "author": "Startup Info Team", "title": "Revive Daily Reviews: Fake GH & Deep Sleep Supplement or Real Pills? [Customer Results] - Startup.info", "description": "Revive Daily GH & Deep Sleep is a dietary supplement that is known to promote healthy weight loss and a better sleeping cycle at the same time. Its", "url": "https://startup.info/revive-daily-reviews-fake-gh-deep-sleep-supplement-or-real-pills-customer-results/", "urlToImage": "https://startup.info/wp-content/uploads/2022/12/revive.jpg", "publishedAt": "2022-12-04T15:01:37Z", "content": "Revive Daily GH &amp; Deep Sleep is a dietary supplement that is known to promote healthy weight loss and a better sleeping cycle at the same time. Its one-of-a-kind formula is constructed out of the… [+19639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Here's why you should avoid dairy and high glycemic index food if you have acne - The Indian Express", "description": "\"Research has shown that dairy is known to trigger acne, so one must avoid that. Having food with omega-3 always helps with inflammation and reduces acne,\" says Dr. Vandana Punjabi, a dermatologist.", "url": "https://indianexpress.com/article/lifestyle/life-style/learn-how-your-diet-affects-acne-8186333/", "urlToImage": "https://images.indianexpress.com/2022/07/Getty-acne-1200.jpg", "publishedAt": "2022-12-04T12:50:35Z", "content": "While we can always choose products to treat or prevent acne, it is always suggested to first work on diet as it can affect their breakout.Dr. Aanchal Pant, a dermatologist, recently addressed the to… [+1850 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Omicron: 7 important tips to prevent Covid infection in winter season - Hindustan Times", "description": "It is important for people to protect themselves from seasonal flu and the possible new immune strains of the Omicron variant of SARS-CoV-2. Here are some tips to follow. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/omicron-7-important-tips-to-prevent-covid-infection-in-winter-season-101670149297238.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/04/1600x900/omicron_XBB_1666159718655_1670149377887_1670149377887.jpg", "publishedAt": "2022-12-04T10:27:28Z", "content": "Covid-19 pandemic is far from over and one needs to be especially cautious in winters as it's the season of viral infections including influenza and Covid. Amid pandemic turning less aggressive and p… [+3982 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Green tea extract may be harmful to liver; Check out why - ANI News", "description": "According to a study, long-term consumption of high-dose green tea extract may offer some protection against cancer, cardiovascular disease, obesity, and type 2 diabetes, but it may also cause liver damage in a small number of people.", "url": "https://www.aninews.in/news/lifestyle/fitness/green-tea-extract-may-be-harmful-to-liver-check-out-why20221204133620", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221204080602.jpg", "publishedAt": "2022-12-04T08:06:00Z", "content": "Washington [US], December 4 (ANI): Long-term consumption of high-dose green tea extract may provide some protection against cancer, cardiovascular disease, obesity, and type 2 diabetes, according to … [+2754 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Research: Gossypetin found in hibiscus may beat Alzheimer's disease - ETHealthWorld", "description": "AD begins as Ab and Tau protein aggregates form deposits in the brain tissue. Microglia internalize such aggregates (phagocytosis) to protect the brain. However, incessant exposure to Ab will ultimately exhaust the microglia, leading to a chronic inflammatory…", "url": "https://health.economictimes.indiatimes.com/news/industry/research-gossypetin-found-in-hibiscus-may-beat-alzheimers-disease/95977207", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95977207,imgsize-34010,width-1200,height-628,overlay-ethealthworld/research-gossypetin-found-in-hibiscus-may-beat-alzheimer-s-disease.jpg", "publishedAt": "2022-12-04T07:37:00Z", "content": "Washington (US): A research team has verified that gossypetin activates immune cells in the brain that clear A beta, which triggers Alzheimer's disease.Professor Kyong-Tai Kim and PhD candidate Kyung… [+1953 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Scientists find out new genetic mutation responsible for childhood glaucoma - ThePrint", "description": "Boston [US], December 4 (ANI): An international team led by Mass Eye and Ear, a member of Mass General Brigham and Boston Children’s Hospital, has discovered a new genetic mutation that could be the root cause of severe cases of childhood glaucoma, a devastat…", "url": "https://theprint.in/health/scientists-find-out-new-genetic-mutation-responsible-for-childhood-glaucoma/1247994/", "urlToImage": null, "publishedAt": "2022-12-04T07:13:44Z", "content": "Boston [US], December 4 (ANI): An international team led by Mass Eye and Ear, a member of Mass General Brigham and Boston Children’s Hospital, has discovered a new genetic mutation that could be the … [+6320 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "11% of Covid cases that needed hospitalisations had lung scarring: US study - EastMojo", "description": "Washington: Up to 11 per cent of Covid cases that needed hospitalisation had lung scarring which may be irreversible and could get worse over time,", "url": "http://www.eastmojo.com/world/2022/12/04/11-of-covid-cases-that-needed-hospitalisations-had-lung-scarring-us-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/06/covid-19-5070657_1280.jpg?fit=1280%2C854&ssl=1", "publishedAt": "2022-12-04T05:00:00Z", "content": "Washington: Up to 11 per cent of Covid cases that needed hospitalisation had lung scarring which may be irreversible and could get worse over time, according to a study conducted in the United States… [+4147 chars]"}]}