{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study sheds light on origins of breast cancer in people with BRCA2 mutations - News-Medical.Net", "description": "A pioneering study led by Professor Ashok Venkitaraman from the Cancer Science Institute of Singapore (CSI Singapore) at the National University of Singapore and Dr Mona Shehata from the University of Cambridge (UK) has uncovered vital insights into the disti…", "url": "https://www.news-medical.net/news/20231101/Study-sheds-light-on-origins-of-breast-cancer-in-people-with-BRCA2-mutations.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2023-11-02T07:22:00Z", "content": "A pioneering study led by Professor Ashok Venkitaraman from the Cancer Science Institute of Singapore (CSI Singapore) at the National University of Singapore and Dr Mona Shehata from the University o… [+3043 chars]"}, {"source": {"id": null, "name": "AuntMinnie"}, "author": "Kate Madden Yee", "title": "CT radiomics help characterize retroperitoneal sarcomas - AuntMinnie", "description": "CT radiomics can help clinicians predict the histological type and grade of retroperitoneal sarcomas, a recently published study has found.", "url": "https://www.auntminnie.com/imaging-informatics/advanced-visualization/article/15637714/ct-radiomics-help-characterize-retroperitoneal-sarcomas", "urlToImage": "https://img.auntminnie.com/files/base/smg/all/image/2023/11/Sarcoma.6542898e1f220.png?auto=format%2Ccompress&fit=max&q=70&w=1200", "publishedAt": "2023-11-02T07:19:45Z", "content": "CT radiomics can help clinicians predict the histological type and grade of retroperitoneal sarcomas, a study published in the November issue of The Lancet Oncology has found.\r\nThe results could have… [+3245 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "5 Foods That Are More Hydrating Than A Glass Of Than Water | Peaches, Cucumber Others - Jagran English", "description": "Foods With More Hydration Than Water: Drinking plenty of water everyday is extremely important to hydrate the body, flush out the toxins and enhance the digestive system.", "url": "https://english.jagran.com/lifestyle/5-foods-that-are-more-hydrating-than-a-glass-of-than-water-peaches-cucumber-others-10111298", "urlToImage": "https://imgeng.jagran.com/images/2023/nov/foods-with-more-hydration-than-water1698909034462.jpg", "publishedAt": "2023-11-02T06:58:00Z", "content": "Foods With More Hydration Than Water: Many of us assume that the only source of hydration for our body is water. Although water is the main source of hydration, there are certain foods that have more… [+2058 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "The impact of geo-political socio-economic factors on vaccine dissemination trends: a case-study on COVID-19 vaccination strategies - BMC Public Health - BMC Public Health", "description": "Background The world in recent years has seen a pandemic of global scale. To counter the widespread loss of life and severe repercussions, researchers developed vaccinations at a fast pace to immunize the population. While the vaccines were developed and test…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-023-17000-z", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2023-11-02T06:49:12Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Covid vaccine does not increase risk of miscarriage: Study - The Week", "description": "Getting a Covid-19 vaccine prior to conceiving does not increase the risk of early or late miscarriage,", "url": "https://www.theweek.in/news/health/2023/11/02/covid-vaccine-does-not-increase-risk-of-miscarriage-study.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2022/images/2022/10/20/Pfizer-COVID-19-booster-vaccine-ap.jpg", "publishedAt": "2023-11-02T06:11:00Z", "content": "Researchers at the University of Sydney has discovered that drugs commonly used to treat common infections in children and babies are losing their effectiveness in various parts of the world, includi… [+3106 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "How Pudina Water Helps In High Uric Acid Levels 4 Reasons To Drink It On An Empty Stomach - Jagran English", "description": "Pudina Water For High Uric Acid Levels: Some common causes of high uric acid levels include drinking too much alcohol, too much soda drinks, high blood pressure, genetics, and kidney problems among others.", "url": "https://english.jagran.com/lifestyle/how-pudina-water-helps-in-high-uric-acid-levels-reasons-to-drink-it-on-an-empty-stomach-10111285", "urlToImage": "https://imgeng.jagran.com/images/2023/nov/pudina-water-for-high-uric-acid1698905542643.jpg", "publishedAt": "2023-11-02T06:08:00Z", "content": "Pudina Water For High Uric Acid Levels: Hyperuricemia is a very common health condition which is usually diagnosed after gout or kidney stones cause symptoms. High uric acid levels can be a condition… [+1735 chars]"}, {"source": {"id": null, "name": "EURACTIV"}, "author": "Christoph Schwaiger", "title": "Amsterdam start-up receives funding to develop revolutionary type 1 diabetes treatment - EURACTIV", "description": "Advanced Microbiome Interventions start-up believes the key to helping type 1 diabetes patients avoid daily in", "url": "https://www.euractiv.com/section/health-consumers/news/amsterdam-start-up-receives-funding-to-develop-revolutionary-type-1-diabetes-treatment/", "urlToImage": "https://www.euractiv.com/wp-content/uploads/sites/2/2023/11/diabe-800x450.jpg", "publishedAt": "2023-11-02T05:57:43Z", "content": "Advanced Microbiome Interventions (AMI) start-up has received funding to help it research whether the key to helping type 1 diabetes patients avoid regular insulin shots lies within the body’s microo… [+4880 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Wet cough: 9 home remedies to stop coughing - Health shots", "description": "Wet cough can be common as the season changes, While over-the-counter medicines are available, you can also try home remedies for wet cough.", "url": "https://www.healthshots.com/preventive-care/self-care/wet-cough/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/11/02094226/cough-3.jpg", "publishedAt": "2023-11-02T05:00:30Z", "content": "When the weather changes, we often sneeze or cough. The thing about coughing is that once it starts, it takes forever to stop. It can keep you up all night, make it difficult to speak and just leave … [+4192 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Preschoolers' plate paradox: More calories served, less self-regulation at snack time - News-Medical.Net", "description": "Children's energy intake rises and falls with the energy density of their meals, not due to self-regulation but rather the quantity of high-energy foods served, reveals a study on preschoolers' eating habits. The study suggests kids may not adjust their porti…", "url": "https://www.news-medical.net/news/20231102/Preschoolers-plate-paradox-More-calories-served-less-self-regulation-at-snack-time.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_763341_16988994945641134.png", "publishedAt": "2023-11-02T04:32:00Z", "content": "In an article currently in press in The American Journal of Clinical Nutrition, a team of scientists studied the food intake of preschool children to examine the relationship between factors such as … [+5372 chars]"}, {"source": {"id": null, "name": "Healthpolicy-watch.news"}, "author": "https://www.facebook.com/HealthPolicyWatch", "title": "New Gonorrhoea Treatment Shows Positive Results In Trial Sponsored By Non-Profit Partnership - Health Policy Watch", "description": "The world may soon have a new antibiotic to treat gonorrhoea after a successful phase 3 trial of an oral pill, zoliflodacin, that was led and sponsored by a", "url": "https://healthpolicy-watch.news/new-gonorrhoea-treatment-shows-positive-results-in-trial-sponsored-by-non-profit-partnership/", "urlToImage": "https://i0.wp.com/healthpolicy-watch.news/wp-content/uploads/2023/11/Manica-Balasegaram-STI-trial-TY-thumb.webp", "publishedAt": "2023-11-02T04:00:26Z", "content": "GARDP executive director Manica Balasegaram, whose partnership has led the trial.\r\nThe world may soon have a new antibiotic to treat gonorrhoea after a successful phase 3 trial of an oral pill, zolif… [+6858 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "How to protect hair from air pollution if your city has poor AQI - Health shots", "description": "Air pollution not only affects your lungs and skin. Your hair can also get damaged. Here are some helpful tips to protect your hair from air pollution.", "url": "https://www.healthshots.com/how-to/protect-hair-from-air-pollution/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/11/02084001/strong-hair.jpg", "publishedAt": "2023-11-02T03:29:05Z", "content": "It will be time for fireworks soon, as Diwali is approaching. But several cities are already getting affected by air pollution. People who get exposed to air pollution often complain about cough, itc… [+3793 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "5 Effective Tips To Protect Yourself From Dengue Fever - Jagran English", "description": "Dengue Fever: There has been a surge in the bone-breaking fever in different parts of the country. More than 3,000 cases of dengue were reported this year in the National Captial.", "url": "https://english.jagran.com/lifestyle/5-effective-tips-to-protect-yourself-from-dengue-fever-10111250", "urlToImage": "https://imgeng.jagran.com/images/2023/nov/tips-for-protection-against-dengue1698895754502.jpg", "publishedAt": "2023-11-02T03:24:00Z", "content": "Dengue Fever: Different parts of the country are dealing with escalating cases of dengue fever. Dengue is termed as a bone-breaking fever caused by any one of four closely related dengue viruses. It … [+2282 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Singhara For Weight Loss: How Water Chestnut Helps You Shed Extra Kilos in Winter? - India.com", "description": "Singhara For Weight Loss: A nutrient-dense food, water chestnuts aka singhara are rich in fiber, potassium, manganese, copper, vitamin B6, and riboflavin. It is a low-calorie fruit with negligible amount of fat!", "url": "https://www.india.com/lifestyle/singhara-for-weight-loss-how-water-chestnut-helps-you-shed-extra-kilos-in-winter-6466441/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/11/Singhara.jpg", "publishedAt": "2023-11-02T03:13:02Z", "content": "Singhara For Weight Loss: A nutrient-dense food, water chestnuts aka singhara are rich in fiber, potassium, manganese, copper, vitamin B6, and riboflavin. It is a low-calorie fruit with negligible am… [+2531 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "ANI", "title": "Researchers develop new antibody against breast cancers - DTNEXT", "description": "With additional research, the antibody could provide a viable therapeutic treatment for the same breast tumours.", "url": "https://www.dtnext.in/lifestyle/wellbeing/researchers-develop-new-antibody-against-breast-cancers-745625", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/09/08/763046-researches.jpg", "publishedAt": "2023-11-02T03:00:38Z", "content": "NEW YORK: An antibody developed in the lab of Cold Spring Harbour Laboratory Professor Nicholas Tonks can inhibit an enzyme that may aid in the spread of some breast tumours. \r\nWith additional resear… [+2241 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "First mice engineered to survive COVID-19 like young, healthy humans - Science Daily", "description": "Researchers have genetically engineered the first mice that get a human-like form of COVID-19, according to a new study.", "url": "https://www.sciencedaily.com/releases/2023/11/231101180522.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-11-02T02:32:12Z", "content": "Researchers have genetically engineered the first mice that get a human-like form of COVID-19, according to a study published online November 1in Nature.Led by researchers from NYU Grossman School of… [+5109 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sumati Yengkhom", "title": "Hospitals across city see uptick in dengue admissions after puja - Times of India", "description": "After a significant drop in dengue admissions before and during Durga Puja, hospitals in Kolkata are now seeing an increase in patients admitted with", "url": "https://timesofindia.indiatimes.com/city/kolkata/hospitals-across-city-see-uptick-in-dengue-admissions-after-puja/articleshow/104901633.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-104901641,width-1070,height-580,imgsize-1137605,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-11-02T01:53:55Z", "content": "9 signs you have met an angel in human form"}, {"source": {"id": null, "name": "DNA India"}, "author": "Riddhima Kanetkar", "title": "Surprising health benefits of Imli (tamarind) - DNA India", "description": "Surprising health benefits of Imli (tamarind)", "url": "https://www.dnaindia.com/web-stories/lifestyle/surprising-health-benefits-of-imli-tamarind-weight-loss-diabetes-type-2-blood-sugar-levels-immunity-1698889170796", "urlToImage": null, "publishedAt": "2023-11-02T01:49:38Z", "content": "Riddhima Kanetkar\r\nTamarind (Imli) is rich in fibre and has no fat content. It helps in weight loss as it contains flavonoids and polyphenols\r\nPolyphenolic compounds found in tamarind (imli) can prev… [+723 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Christina Jackson", "title": "Cancer Drug May Be Repurposed for Inflammatory Diseases - Genetic Engineering & Biotechnology News", "description": "A cancer drug in the final stages of clinical trials may be able to help treat a range of inflammatory diseases.", "url": "https://www.genengnews.com/topics/drug-discovery/cancer-drug-may-be-repurposed-for-inflammatory-diseases/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/08/Apr1_2016_36788637_CancerTarget_StealthNanoparticles19010925511881883814.jpg", "publishedAt": "2023-11-02T01:01:32Z", "content": "A cancer drug in the final stages of clinical trials may be able to help treat a range of inflammatory diseases including gout, heart failure, cardiomyopathy, and atrial fibrillation, according to sc… [+3144 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sridhar Vivan", "title": "Talking point: Matters of the heart post-covid - Bangalore Mirror", "description": "Dr Vikranth Veeranna (Consultant Cardiologist, Sparsh Hospital) said that it is essential to note that a straightforward recovery from covid should not significantly elevate one’s risk during exercis", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/talking-point-matters-of-the-heart-post-covid/articleshow/104897256.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-179312,msid-104897257/104897257.jpg", "publishedAt": "2023-11-02T00:30:00Z", "content": "City docs stress there are no clear guidelines on when to start exercising after covid; say patients whose lungs were affected during the infection can take it slow and easyUnion Health Minister Mans… [+3208 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Connor Iapoce", "title": "John W. Ostrominski, MD: Prevalence of Cardiac-Renal-Metabolic Conditions in United States - MD Magazine", "description": "John W. Ostrominski, MD, describes the prevalence and overlap of cardiac, renal, and metabolic conditions in US adults over a 20-year period.", "url": "https://www.hcplive.com/view/john-w-ostrominski-md-prevalence-cardiac-renal-metabolic-conditions", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/64abfb880272714504df0ced71f6ea158e225e2b-300x300.jpg?fit=crop&auto=format", "publishedAt": "2023-11-02T00:03:25Z", "content": "A recent cross-sectional cohort study assessed temporal trends in cardiac, renal, and metabolic condition prevalence and overlap using National Health and Nutrition Examination Survey (NHANES) data b… [+8052 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "What happens when we pass out? Researchers ID new brain and heart connections - Science Daily", "description": "Researchers have for the first time identified the genetic pathway between the heart and brain tied to fainting. They found that vagal sensory neurons trigger fainting, laying a foundation for addressing fainting-related disorders.", "url": "https://www.sciencedaily.com/releases/2023/11/231101180641.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-11-01T23:47:38Z", "content": "Nearly 40 percent of people experience syncope, or fainting spells, at least once in their lives. These brief losses of consciousness, whether brought by pain, fear, heat, hyperventilation or other c… [+5038 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Vector-borne diseases a big concern: Joint Director Health - The Indian Express", "description": "Gayatri Divecha, Head of CSR and Sustainability at Godrej Industries Ltd and associate companies said in their vector borne disease control programmes they have reached out to 30 million Indians at high risk.", "url": "https://indianexpress.com/article/cities/pune/vector-borne-diseases-a-big-concern-joint-director-health-9009916/", "urlToImage": "https://images.indianexpress.com/2023/11/Stethoscope-1.jpeg", "publishedAt": "2023-11-01T22:46:00Z", "content": "Citing the growing number of cases of vector borne diseases in the state, the Joint Director of Health, Communicable Diseases, Maharashtra, emphasised the need to invest in technology and prevention … [+541 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Masking up matters: High-quality studies confirm face masks significantly curb COVID-19 spread - News-Medical.Net", "description": "This 'Special Communication' article in JAMA Network Open compiles high-quality studies to underline the effectiveness of face masks in curbing community-level transmission of SARS-CoV-2. The article emphasizes that surgical masks are more effective than clot…", "url": "https://www.news-medical.net/news/20231101/Masking-up-matters-High-quality-studies-confirm-face-masks-significantly-curb-COVID-19-spread.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_763317_16988784551625391.jpg", "publishedAt": "2023-11-01T22:42:00Z", "content": "A 'Special Communication' article published in the journal JAMA Network Open provides a detailed overview of current high-quality literature describing the utility of face masks in reducing community… [+5932 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Extreme heat in the US may increase heart-related deaths; THESE people are at most risk - IndiaTimes", "description": "Extreme heat in the US is linked to a surge in heart-related deaths, with a focus on specific vulnerable groups. A study reveals that rising heat levels between 2008 and 2019 caused 1,700 excess cardiovascular deaths annually, and this toll could triple to 5,…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/extreme-heat-in-the-us-may-increase-heart-related-deaths-these-people-are-at-most-risk/photostory/104889481.cms", "urlToImage": "https://static.toiimg.com/photo/104889586.cms", "publishedAt": "2023-11-01T22:30:00Z", "content": "According to the study published in the journal Circulation, the heat index (includes both temperature and humidity) between 2008 and 2019 in the US was associated with nearly 1,700 excess cardiovasc… [+576 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "USDA shares process of trapping raccoons, updates public on testing efforts - KETV NewsWatch 7", "description": "USDA shares process of trapping raccoons, updates public on testing effortsSubscribe to KETV on YouTube now for more: http://bit.ly/1emyaD5Get more Omaha new...", "url": "https://www.youtube.com/watch?v=iPVIQ41h44c", "urlToImage": "https://i.ytimg.com/vi/iPVIQ41h44c/maxresdefault.jpg", "publishedAt": "2023-11-01T22:24:24Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Sperm count likely to be impacted due to high mobile phone use: Study - IndiaTimes", "description": "Science News: A recent study has found a potential link between mobile phone usage and declining male sperm count. Young men who used their phones more than 20 time", "url": "https://timesofindia.indiatimes.com/home/science/sperm-count-likely-to-be-impacted-due-to-high-mobile-phone-use-study/articleshow/104898418.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-104898422,width-1070,height-580,imgsize-906076,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-11-01T21:44:22Z", "content": "<ul><li>News</li>\r\n<li>Science News</li>\r\n<li>Sperm count likely to be impacted due to high mobile phone use: Study</li></ul>\r\nA recent study has found a potential link between mobile phone usage and… [+476 chars]"}, {"source": {"id": null, "name": "MedPage Today"}, "author": "Jennifer Henderson", "title": "Situs Inversus Cases Rise After China Lifts Zero-COVID Policy - Medpage Today", "description": "Experts in the U.S. weigh in on early observations at two Chinese centers", "url": "https://www.medpagetoday.com/special-reports/features/107106", "urlToImage": "https://assets.medpagetoday.net/media/images/107xxx/107106.jpg", "publishedAt": "2023-11-01T21:00:12Z", "content": "There was a \"striking increase\" in the number of cases of fetal situs inversus at two Chinese obstetric centers after the zero-COVID policies were lifted in the country, researchers reported.\r\nFrom J… [+5404 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "CU professor of ophthalmology receives grant to study Parkinson's disease biomarkers - News-Medical.Net", "description": "For some, the eyes are a window into the soul. But for Jayashree Kalpathy-Cramer, PhD, professor of ophthalmology at the University of Colorado School of Medicine, they're a window into human health.", "url": "https://www.news-medical.net/news/20231101/CU-professor-of-ophthalmology-receives-grant-to-study-Parkinsons-disease-biomarkers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2015/7/image_28620e4b6b0047f7ab9154b41d739db1-620x480.jpg", "publishedAt": "2023-11-01T20:50:00Z", "content": "For some, the eyes are a window into the soul. But for Jayashree Kalpathy-Cramer, PhD, professor of ophthalmology at the University of Colorado School of Medicine, they're a window into human health.… [+3370 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Breakthrough discovery sheds light on heart and muscle health - Science Daily", "description": "The human heart, often described as the body's engine, is a remarkable organ that tirelessly beats to keep us alive. At the core of this vital organ, intricate processes occur when it contracts, where thick and thin protein-filaments interact within the sarco…", "url": "https://www.sciencedaily.com/releases/2023/11/231101134919.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-11-01T20:39:39Z", "content": "The human heart, often described as the body's engine, is a remarkable organ that tirelessly beats to keep us alive. At the core of this vital organ, intricate processes occur when it contracts, wher… [+5976 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Chelsie Derman", "title": "PTSD Linked to Genetic Cardiometabolic, Respiratory, Digestive Conditions - MD Magazine", "description": "A new study found that 25% of PSG-PTSD were related to metabolic traits.", "url": "https://www.hcplive.com/view/ptsd-linked-genetic-cardiometabolic-respiratory-digestive-conditions", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/1eb788e335a6c21063765be5554efe0b64a0b2bc-526x490.png?fit=crop&auto=format", "publishedAt": "2023-11-01T20:33:06Z", "content": "PTSD symptoms can put an individual at risk of developing somatic cardiometabolic, respiratory, or digestive conditions if the individual has certain genetics, according to new research.\r\nThe genetic… [+5739 chars]"}, {"source": {"id": null, "name": "Charcot-marie-toothnews.com"}, "author": "Margarida Maia, PhD", "title": "Cellular response to stress links different types of CMT2, per study - Charcot-Marie-Tooth News", "description": "Many mutated proteins causing the different forms of Charcot-Marie-Tooth disease type 2 (CMT2) tend to go to stress granules in nerve cells.", "url": "https://charcot-marie-toothnews.com/?p=79027&preview=true&preview_id=79027", "urlToImage": "https://charcot-marie-toothnews.com/wp-content/uploads/2022/07/MiceGroup.png", "publishedAt": "2023-11-01T20:13:47Z", "content": "Many of the mutated proteins that cause the different forms of Charcot-Marie-Tooth disease type 2 (CMT2) tend to go to a point in nerve cells, or neurons, called stress granules.\r\nThere, upon stress,… [+3660 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Mask mandates in health care settings return to some Bay Area counties - NBC Bay Area", "description": "Some Bay Area counties starting this week have required masks again in certain indoor settings due to the resurgence of respiratory illnesses such as COVID, ...", "url": "https://www.youtube.com/watch?v=IGseIO4umsQ", "urlToImage": "https://i.ytimg.com/vi/IGseIO4umsQ/maxresdefault.jpg", "publishedAt": "2023-11-01T19:16:17Z", "content": null}, {"source": {"id": null, "name": "Food-safety.com"}, "author": "Bailee Henderson", "title": "Study Shows Potential of Antimicrobial Blue Light for Listeria Inactivation in Food Processing Plants - Food Safety Magazine", "description": "<p>A recent study<em> </em>has demonstrated the efficacy of antimicrobial blue light technology for the inactivation of both dried cells and biofilms of <em>Listeria monocytogenes </em>on surfaces found in food processing environments. </p>", "url": "https://www.food-safety.com/articles/8998-study-shows-potential-of-antimicrobial-blue-light-for-listeria-inactivation-in-food-processing-plants", "urlToImage": "https://www.food-safety.com/ext/resources/News/2023/blue-light-waves.png?height=635&t=1698860372&width=1200", "publishedAt": "2023-11-01T17:42:09Z", "content": "A recent study published in Applied and Environmental Microbiology has demonstrated the efficacy of antimicrobial blue light technology in the inactivation of both dried cells and biofilms of Listeri… [+2239 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Reuters", "title": "More older former smokers need lung cancer screening, experts say - DTNEXT", "description": "Previously, the ACS called for screening only for long-time or heavy smokers who had given up cigarettes less than 15 years earlier", "url": "https://www.dtnext.in/lifestyle/wellbeing/more-older-former-smokers-need-lung-cancer-screening-experts-say-745563", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/11/01/776225-smoke.jpg", "publishedAt": "2023-11-01T17:41:23Z", "content": "WASHINGTON: New lung cancer screening guidelines issued by the American Cancer Society (ACS) on Wednesday call for annual testing with lowdose computed tomography (CT) for anyone aged 50 to 80 who wa… [+2863 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "How to make a business case for lifestyle medicine - Healio", "description": "DENVER &mdash; The lifestyle medicine model makes good business sense, but a business plan is needed to make it a logical decision for your organization, a speaker said here.&ldquo;If we can undo what is going on in our system, we can save money. We can do it…", "url": "https://www.healio.com/news/primary-care/20231101/how-to-make-a-business-case-for-lifestyle-medicine", "urlToImage": "https://www.healio.com/~/media/slack-news/fm_im/misc/infographics/2023/11-november/pc1023mauch_aclm_graphic_01.jpg", "publishedAt": "2023-11-01T17:02:49Z", "content": "Key takeaways:\r\n<ul><li>A lifestyle medicine business plan will be successful if it is timebound, specific and aligned with the organization’s goals.</li><li>Make the case that lifestyle medicine can… [+3791 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "AI Technology Increases Medical Image Analysis Accuracy - AZoRobotics", "description": "A research team has effectively created technology that, through the use of the mutual information loss function during image conversion, can decrease structural distortion in images.", "url": "https://www.azorobotics.com/News.aspx?newsID=14437", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ImageForNews_14437_16988565114343500.jpg", "publishedAt": "2023-11-01T16:43:00Z", "content": "A research team has effectively created technology that, through the use of the mutual information loss function during image conversion, can decrease structural distortion in images.\r\nImage Credit: … [+4028 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health experts give important information to remember for Diabetes Awareness Month - KWQC News", "description": "Health experts give important information to remember for Diabetes Awareness Month   For more Local News from KWQC:  https://www.kwqc.com/ For more YouTube C...", "url": "https://www.youtube.com/watch?v=PyEDt5eYySc", "urlToImage": "https://i.ytimg.com/vi/PyEDt5eYySc/maxresdefault.jpg", "publishedAt": "2023-11-01T16:39:30Z", "content": null}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Leslie McGorman, MPPA", "title": "Political and Social Barriers to Ending the HIV Epidemic - Contagionlive.com", "description": "Learning about these barriers is the first step to overcoming them.", "url": "https://www.contagionlive.com/view/political-and-social-barriers-to-ending-the-hiv-epidemic", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/21721c11c0c031fdf378f3871cf19dc353c38a82-764x484.png?fit=crop&auto=format", "publishedAt": "2023-11-01T15:57:26Z", "content": "Wecan end the HIV epidemic.We have all the biomedical interventions needed. Epidemiologists have conducted research, and their modeling lays out exactly what we need to end the HIV epidemic.\r\nEpidemi… [+13965 chars]"}, {"source": {"id": null, "name": "Newsnationnow.com"}, "author": "Stephanie Whiteside", "title": "Over half of parents worry about internet addiction in kids - NewsNation Now", "description": "The survey compared parental concerns about internet addiction and substance addiction.", "url": "https://www.newsnationnow.com/business/tech/over-half-parents-worry-internet-addiction/", "urlToImage": "https://www.newsnationnow.com/wp-content/uploads/sites/108/2023/05/64540c10a135a0.51889079.jpeg?w=1280", "publishedAt": "2023-11-01T15:48:41Z", "content": "(NewsNation) A new study found more than half of parents with kids aged 9 to 15 worried about internet addiction, with social media and gaming being the top areas of concern.\r\nA study posted in the J… [+2214 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Reversible Splenial Lesion Syndrome Associated With Dengue Encephalopathy: A Case Report - Cureus", "description": "Infection with the dengue virus can present with a variety of clinical manifestations that can range from asymptomatic or mild disease to severe hemorrhagic shock. In this report, we present a 25-year-old female patient with complaints of fever, headache, vom…", "url": "https://www.cureus.com/articles/199799-reversible-splenial-lesion-syndrome-associated-with-dengue-encephalopathy-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/784090/article_river_e6b0c940773d11eeb7c701bdffc1d430-image-3-.png", "publishedAt": "2023-11-01T15:44:16Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kinkini Gupta", "title": "Dengue Outbreak: Delhi Records Highest Number Of Cases In 5 Years; Total Tally Crosses 5000 | TheHealthSit - TheHealthSite", "description": "This year Delhi witnessed more than 5000 dengue infection cases recording the highest number in the last 5 years. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/dengue-outbreak-delhi-records-highest-number-of-cases-in-5-years-total-tally-crosses-5000-1027134/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/10/mosquito-biting-person-with-flat-design_23-2147938205.jpg", "publishedAt": "2023-11-01T14:35:00Z", "content": "Dengue Outbreak: Delhi Records Highest Number Of Cases In 5 Years; Total Tally Crosses 5000\r\nThis year, Delhi witnessed more than 5000 dengue infection cases, recording the highest number in the last… [+1793 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Puja Awasthi", "title": "Alternative therapies for stroke treatment: Everything you need to know - The Week", "description": "October 29 is observed as World Stroke Day", "url": "https://www.theweek.in/news/health/2023/11/01/alternative-therapies-for-stroke-treatment-everything-you-need-to-know.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/health/quickscan/images/2021/11/22/14-Best-time-for-rehabilitation-after-a-stroke.jpg", "publishedAt": "2023-11-01T14:15:01Z", "content": "Strokes are one of the leading causes of death in India. According to a paper in the National Library of Medicine, the burden of stroke is increasing in India. They are the fourth leading cause of de… [+4857 chars]"}, {"source": {"id": null, "name": "Multiple Sclerosis News Today"}, "author": "Marisa Wexler, MS", "title": "Immune cell, fat metabolism changes may explain MS progression - Multiple Sclerosis News Today", "description": "More activity among certain immune cells, and differences in iron regulation and fat metabolism were seen in SPMS and benign MS patients.", "url": "https://multiplesclerosisnewstoday.com/news-posts/2023/11/01/immune-cell-fat-metabolism-differences-ms-progression/", "urlToImage": "https://multiplesclerosisnewstoday.com/wp-content/uploads/2022/06/LabScientist.png", "publishedAt": "2023-11-01T14:08:48Z", "content": "More activity among certain immune cells, as well as differences in immune signaling molecules, iron regulation, and fat metabolism, may explain why multiple sclerosis (MS) progresses more over time … [+5398 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Nutritional Considerations in Colorectal Surgery in Diverting Ileostomy Patients: A Review - Cureus", "description": "Colorectal surgery often results in a temporary or permanent ileostomy construction. The general nutritional status and intake of patients with an ileostomy have not received much attention and scientific evidence is lacking. Nutritional complications associa…", "url": "https://www.cureus.com/articles/194460-nutritional-considerations-in-colorectal-surgery-in-diverting-ileostomy-patients-a-review", "urlToImage": "https://assets.cureus.com/uploads/figure/file/765393/article_river_a13a2f20611011ee8f0d6d0171633a09-Figure-1-nQQ-.png", "publishedAt": "2023-11-01T13:59:16Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "News Direct", "title": "HKBU studies show over half of COVID-19 patients have post-disease syndrome - Yahoo Finance", "description": "HONG KONG SAR - Media OutReach - 1 November 2023 - The School of Chinese Medicine at Hong Kong Baptist University (HKBU) found that 55% of the patients who...", "url": "https://finance.yahoo.com/news/hkbu-studies-show-over-half-130000644.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8J9uG.IY6zQA9h1.rwXl_w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/news_direct/f2d036029a71c75c9bb559c49926f8ab", "publishedAt": "2023-11-01T13:00:00Z", "content": "HONG KONG SAR --News Direct-- Hong Kong Baptist University\r\nHONG KONG SAR - Media OutReach - 1 November 2023 - The School of Chinese Medicine at Hong Kong Baptist University (HKBU) found that 55% of … [+5982 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "HT Brand Studio", "title": "Transforming Stroke Recovery: How HCAH’s Comprehensive Rehabilitation Programs Empower Stroke Survivors - Health shots", "description": "A top official of the HCAC - HealthCare at Home - talks about the rehabilitation programs for the benefit of stroke survivors.", "url": "https://www.healthshots.com/brand-posts/transforming-stroke-recovery-how-hcahs-comprehensive-rehabilitation-programs-empower-stroke-survivors/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/11/01182043/Dr-Gaurav-Thukkral.jpg", "publishedAt": "2023-11-01T12:52:25Z", "content": "Dr. Gaurav Thukkral, Co-founder and COO of HCAH India, in an interview, discusses the comprehensive approaches that empower stroke survivors to overcome physical and cognitive challenges during their… [+6168 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "INDIATODAY", "title": "7 Easy Ways to Train Your Brain - India Today", "description": "Discover seven practical methods to enhance brain health and cognitive function. From mental exercises to a brain-boosting diet, these techniques empower you to unlock your full mental potential.", "url": "https://www.indiatoday.in/visualstories/education/7-easy-ways-to-train-your-brain-73586-01-11-2023", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/visualstory/wp/2023/11/natasha-connell-byp5TTxUbL0-unsplash-fotor-20231101175520-scaled.jpg", "publishedAt": "2023-11-01T12:50:19Z", "content": "Practice meditation, deep breathing, or yoga to reduce stress's harmful effects on memory and attention."}, {"source": {"id": null, "name": "Futurity: Research News"}, "author": "Corrie Pikul-Brown", "title": "Health economists: COVID vax campaign saved 2.4 million lives - Futurity: Research News", "description": "The global COVID-19 vaccination campaign saved 2.4 million lives in 141 countries. Equitable vaccine distribution could have saved 670,000 more.", "url": "https://www.futurity.org/covid-19-vaccines-viruses-2993552/", "urlToImage": "https://www.futurity.org/wp/wp-content/uploads/2023/11/COVID-19_vaccines_1600.jpg", "publishedAt": "2023-11-01T12:26:35Z", "content": "The global COVID-19 vaccination campaign saved 2.4 million lives in 141 countries and could have saved about 670,000 more had the vaccines been distributed equitably, say researchers.\r\nThe findings c… [+2810 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Patients with asthma, COPD, ILD have reduced COVID vaccine protection - Healio", "description": "Patients with asthma, COPD and interstitial lung disease have reduced SARS-CoV-2 vaccine-specific antibody, B-cell and T-cell responses, which signals poorer protection against COVID-19, according to results published in ERJ Open Research.&ldquo;The findings …", "url": "https://www.healio.com/news/pulmonology/20231101/patients-with-asthma-copd-ild-have-reduced-covid-vaccine-protection", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/pulmonology/v/vaccine_adobe.jpg", "publishedAt": "2023-11-01T12:04:01Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nKey takeaways:\r\n<ul><li>Protection again… [+5453 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Firstpost", "title": "9 benefits of starting your day with black coffee - Firstpost", "description": "Starting your day with a cup of black coffee goes beyond a caffeine jolt. From mood enhancement to weight management, it offers a range of health benefits", "url": "https://www.firstpost.com/web-stories/lifestyle/9-benefits-of-starting-your-day-with-black-coffee-13652.html", "urlToImage": "https://images.news18.com/webstories/2023/11/cropped-Web-capture_1-11-2023_164126_in.pinterest.com_.jpeg", "publishedAt": "2023-11-01T11:36:47Z", "content": "Weight ManagementBlack coffee, devoid of calories, promotes healthy weight management. Its caffeine content enhances metabolism, increases energy, and reduces appetite.\r\nElevates Mood\r\nBlack coffee a… [+1153 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Brain Health: 7 Worst Everyday Habits That Lead to Memory Loss Symptoms - India.com", "description": "Brain health starts to deteriorate with age and it becomes imperative to nurture and nourish our brain. Here is how these sedentary lifestyle habits may causes memory loss.", "url": "https://www.india.com/health/brain-health-7-worst-everyday-habits-that-lead-to-memory-loss-symptoms-6464756/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/11/brain-health-habits.jpg", "publishedAt": "2023-11-01T11:13:56Z", "content": "Brain health starts to deteriorate with age and it becomes imperative to nurture and nourish our brain. Here is how these sedentary lifestyle habits may causes memory loss. \r\nBrain Health: 6 Worst Ev… [+2927 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Heena Sharma", "title": "5 Health Benefits of Eating Fish - WION", "description": "5 Health Benefits of Eating Fish", "url": "https://www.wionews.com/web-stories/life-fun/5-health-benefits-of-eating-fish-1698834380351", "urlToImage": null, "publishedAt": "2023-11-01T10:40:07Z", "content": "Fish provides essential amino acids needed for muscle growth, repair, and overall body function. It is also generally lower in saturated fat."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Simple, rapid blood test can diagnose TB accurately in children: Lancet study - ETHealthWorld", "description": "The new diagnostic tool, described in The Lancet Infectious Diseases journal, and tested as part of a large-scale study in five countries, offers significant progress in this area. The most commonly used tuberculosis tests have been based on microbiological a…", "url": "https://health.economictimes.indiatimes.com/news/industry/simple-rapid-blood-test-can-diagnose-tb-accurately-in-children-lancet-study/104887516", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-104887516,imgsize-14946,width-1200,height=765,overlay-ethealth/industry/simple-rapid-blood-test-can-diagnose-tb-accurately-in-children-lancet-study.jpg", "publishedAt": "2023-11-01T10:32:33Z", "content": "New Delhi: A simple, rapid blood test can help diagnose tuberculosis accurately in children, according to the findings of a study conducted in five countries, including India. About 2,40,000 children… [+2755 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Qiagen receives CDSCO approval for blood-borne virus testing assays - BSI bureau", "description": "Qiagen receives CDSCO approval for blood-borne virus testing assays", "url": "https://www.biospectrumindia.com/news/60/23780/qiagen-receives-cdsco-approval-for-blood-borne-virus-testing-assays.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/qiagen-23780.png", "publishedAt": "2023-11-01T09:20:48Z", "content": "Qiagen N.V. has announced that its NeuMoDx human  immunodeficiency virus type 1 (HIV-1), hepatitis B virus (HBV) and hepatitis C virus (HCV) quantitative assays for blood-borne virus (BBV) testing ha… [+1242 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Online Bureau, ET HealthWorld", "title": "Apollo Cancer Centres introduces India’s Fastest & Most Precise Breast Cancer Diagnosis Programme - ETHealthWorld", "description": "The programme is designed to ensure timely and accurate diagnosis, alleviating the stress of protracted waiting times for results. It includes advanced diagnostic technologies, including mammography, ultrasound, and biopsy, to promptly and precisely assess br…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/apollo-cancer-centres-introduces-indias-fastest-most-precise-breast-cancer-diagnosis-programme/104883902", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-104883902,imgsize-15030,width-1200,height=765,overlay-ethealth/diagnostics/apollo-cancer-centres-introduces-indias-fastest-most-precise-breast-cancer-diagnosis-programme.jpg", "publishedAt": "2023-11-01T08:45:13Z", "content": "New Delhi: \r\nThe programme is designed to ensure timely and accurate diagnosis, alleviating the stress of protracted waiting times for results. It includes advanced diagnostic technologies, including… [+3305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Bihar records highest dengue cases and deaths in 5 years: What’s behind the surge - The Indian Express", "description": "There has been an increase of 608% in the number of dengue cases in Bihar between 2018 and 2023. What’s causing the spread?", "url": "https://indianexpress.com/article/explained/bihar-highest-dengue-cases-deaths-9008868/", "urlToImage": "https://images.indianexpress.com/2023/11/dengue-bihar.jpg", "publishedAt": "2023-11-01T08:30:34Z", "content": "Bihar has recorded more than 15,000 dengue cases with 59 deaths so far this year, according to the official records released on Tuesday (October 31). These are the highest numbers of reported dengue … [+3008 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Understanding vaginal discharge: What’s normal and when should you seek help - Mint Lounge", "description": "Normal discharge is a sign of good feminine health. Here are pointers on how to know when something’s off and do’s and don’ts to keep in mind", "url": "https://lifestyle.livemint.com/health/wellness/vaginal-discharge-ph-balance-feminine-health-dos-and-donts-111698760566077.html", "urlToImage": "https://images.livemint.com/img/2023/10/31/1140x641/deon-black-unsplash_1698761550721_1698761566333.jpg", "publishedAt": "2023-11-01T02:35:52Z", "content": "Understanding and maintaining healthy vaginal discharge is vital to a womans reproductive and overall health. However, it is essential to understand the red flags of this signifier of feminine health… [+5001 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "DNR reports first CWD-positive deer in Ogemaw Co. - WNEM TV5", "description": "The Michigan Department of Natural Resources reported a deer in Ogemaw County has tested positive for chronic wasting disease (CWD).   For more Local News fr...", "url": "https://www.youtube.com/watch?v=bibwdI-5fvA", "urlToImage": "https://i.ytimg.com/vi/bibwdI-5fvA/maxresdefault.jpg", "publishedAt": "2023-10-31T22:46:17Z", "content": null}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "Coconut Milk: Canned or in a Carton, Is It Healthy? - Verywell Health", "description": "Coconut milk can be a plant-based substitute for dairy milk. It has some beneficial compounds but contains saturated fat. Learn more about its possible benefits and risks.", "url": "https://www.verywellhealth.com/coconut-milk-7971556", "urlToImage": "https://www.verywellhealth.com/thmb/WXpSLuRY2Z_-gNi_wL5FR7U4ibE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/coconut-milk-GettyImages-1227562918-b6fcd10c0e964e33a5f6b92e75d54c00.jpg", "publishedAt": "2023-10-31T22:14:53Z", "content": "Coconut milk is made from the white flesh, or coconut meat, inside the coconut and water. Its different from coconut cream, which is made with less water and has a thicker, creamier texture, and coco… [+9456 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Hannah Flynn", "title": "Cervical cancer: Induction chemotherapy could improve survival by 39% - Medical News Today", "description": "A short course of induction chemotherapy may be able to reduce relapse and death rates from cervical cancer by 39%, a new trial indicates.", "url": "https://www.medicalnewstoday.com/articles/induction-chemotherapy-improves-cervical-cancer-survival-relapse-rates", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/10/induction-chemotherapy-IV-732x549-thumbnail.jpg", "publishedAt": "2023-10-31T17:56:01Z", "content": "<ul><li>Recent improvements in cancer survival rates are partly due to improvements in treatments, as well as screening and prevention. </li><li>Efforts to improve cervical cancer survival have focus… [+6748 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Pilot awards to advance global brain health and dementia projects - EurekAlert", "description": "Today, the Alzheimer’s Association, Global Brain Health Institute (GBHI), and the UK-based Alzheimer’s Society announced the most recent awardees of the Pilot Awards for Global Brain Health Leaders, a competitive funding initiative dedicated to nurturing effo…", "url": "https://www.eurekalert.org/news-releases/1006404", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-10-31T15:05:09Z", "content": "Today, the Alzheimer’s Association, Global Brain Health Institute (GBHI), and the UK-based Alzheimer’s Society announced the most recent awardees of the Pilot Awards for Global Brain Health Leaders, … [+7583 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID and flu vaccine campaign is underway - CP24", "description": "The province's COVID-19 and flu vaccine campaign is underway. Dr. Isaac Bogoch, Infectious Diseases specialist at Toronto General Hospital, spoke to us about...", "url": "https://www.youtube.com/watch?v=gocFpr58_LA", "urlToImage": "https://i.ytimg.com/vi/gocFpr58_LA/maxresdefault.jpg", "publishedAt": "2023-10-31T13:22:34Z", "content": null}]}