{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Severe Covid-19 triggered natural brain ageing, reveal scientists - ETHealthWorld", "description": "Using a molecular profiling technique called RNA sequencing to measure the levels of every gene expressed in a particular tissue sample, the scientists assessed changes in gene expression profiles in the brains of Covid-19 patients and compared them to those …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/severe-covid-19-triggered-natural-brain-ageing-reveal-scientists/96059493", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96059493,imgsize-33366,width-1200,height-628,overlay-ethealthworld/severe-covid-19-triggered-natural-brain-ageing-reveal-scientists.jpg", "publishedAt": "2022-12-07T12:13:00Z", "content": "New York: In a first, researchers have discovered that severe Covid-19 is linked with molecular signatures of brain ageing, suggesting that many biological pathways that change with natural ageing in… [+2507 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Fat around organs more susceptible to severe Covid than fat under skin: Study - ETHealthWorld", "description": "Visceral adipocytes, or tissues where fat is stored as an energy source, were infected, they produced a larger amount of pro-inflammatory cytokines, which warned the immune system of the existence of a threat to be combated.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/fat-around-organs-more-susceptible-to-severe-covid-than-fat-under-skin-study/96059004", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96059004,imgsize-392954,width-1200,height-628,overlay-ethealthworld/fat-around-organs-more-susceptible-to-severe-covid-than-fat-under-skin-study.jpg", "publishedAt": "2022-12-07T11:53:00Z", "content": "Washington: Scientists have found that the fat around the liver, intestines and other organs, or visceral fat, contributes more towards severe Covid-19 than does subcutaneous fat, or fat under the sk… [+3492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "What is the right amount of vitamin D you need? Can too much hurt you? - The Indian Express", "description": "Taking 60,000 international units (IU) a day of vitamin D for several months has been shown to cause toxicity. This level is many times higher than the Recommended Dietary Allowance (RDA) for most adults at 600 IU of vitamin D a day. So don't pop pills withou…", "url": "https://indianexpress.com/article/lifestyle/health-specials/right-amount-vitamin-d-health-hypervitaminosis-8311477/", "urlToImage": "https://images.indianexpress.com/2022/12/vitamin-d_1200_getty.jpg", "publishedAt": "2022-12-07T11:51:01Z", "content": "Most Indians complaining of brittle or aching bones think they may be suffering from Vitamin D deficiency and with over the counter medication, manage their condition through self-medication rather t… [+6952 chars]"}, {"source": {"id": null, "name": "FoodNavigator.com"}, "author": "foodnavigator.com", "title": "Data highlights 'shocking' extent of malnutrition - FoodNavigator.com", "description": "As new research demonstrates the widespread nature of micronutrient deficiencies in pre-school children and women globally, nutrition experts warn the surging cost of living could mean things are about to get worse.", "url": "https://www.foodnavigator.com/Article/2022/12/07/data-highlights-shocking-extent-of-malnutrition", "urlToImage": "https://www.foodnavigator.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/science/data-highlights-shocking-extent-of-malnutrition/16001348-1-eng-GB/Data-highlights-shocking-extent-of-malnutrition.png", "publishedAt": "2022-12-07T11:43:59Z", "content": "More than half of pre-school age children and over two-thirds of non-pregnant women of reproductive age worldwide have micronutrient deficiencies, according to the findings of a new scientific review… [+3651 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Air pollution-triggered immune surveillance deficits in the lungs increase the risk of respiratory diseases with aging - News-Medical.Net", "description": "Researchers highlighted the significance of air quality in preserving immune health over the human lifespan, especially lung-related immunity, owing to the lungs' continuous exposure to the environment.", "url": "https://www.news-medical.net/news/20221207/Air-pollution-triggered-immune-surveillance-deficits-in-the-lungs-increase-the-risk-of-respiratory-diseases-with-aging.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_733026_1670410786470946.jpg", "publishedAt": "2022-12-07T11:26:00Z", "content": "In a recent research briefing published in Nature Medicine, researchers highlighted the significance of air quality in preserving immune health over the human lifespan, especially lung-related immuni… [+4154 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "How metastatic cancer causes leaky blood vessels: Research - Hindustan Times", "description": "The work expands on recent findings that showed that endothelial cells have chirality, a type of mirrored-image orientation similar to right and left hands, and they tend to skew in a clockwise direction. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-metastatic-cancer-causes-leaky-blood-vessels-research-101670404507705.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/07/1600x900/998d9154-290d-11ed-b699-b608dd3b520f_1661939843635_1670404774819_1670404774819.jpg", "publishedAt": "2022-12-07T10:12:18Z", "content": "Researchers examine the local communication between endothelial cells and tumors cells and its effects on endothelial cell orientation. The approach uses co-cultured human umbilical vein endothelial … [+3007 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Could Tomatoes and Potatoes Give Rise to New Cancer Drugs? - Technology Networks", "description": "Cancer drugs of the future could one day be produced from glycoalkaloids found in plants from the genus Solanum, such as potatoes and tomatoes.<br />", "url": "https://www.technologynetworks.com/drug-discovery/news/could-potatoes-and-tomatoes-give-rise-to-new-cancer-drugs-368250", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/368250/could-potatoes-and-tomatoes-give-rise-to-new-cancer-drugs-368250-640x360.jpg?cb=20221207", "publishedAt": "2022-12-07T10:05:09Z", "content": "Everyone knows someone who has had cancer. In 2020, around 19m new cases and around 10m deaths were registered worldwide. Treatments are improving all the time but can damage healthy cells or have se… [+4568 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Strep A Infection: Know Its Causes, Symptoms And Treatment - News18", "description": "It is important to recognise early symptoms of Strep A infection and undergo treatment as soon as possible.", "url": "https://www.news18.com/news/lifestyle/strep-a-infection-know-its-causes-symptoms-and-treatment-6560881.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/12/untitled-design-1-24-167040731416x9.png", "publishedAt": "2022-12-07T10:02:47Z", "content": "After the COVID-19 pandemic wreaked havoc, another viral disease, known as Strep A infection, is rapidly spreading in the UK. According to a report by Zee News, health officials have issued warnings … [+2114 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Alpilean Customer Update - December 2022 - What Users Must Know First! - The Tribune India", "description": "First off, there are extensive Alpilean customer reviews to read too; but this is meant to tap into the highlights of the Alpilean ice hack phenomena happening across the globe right now. In this December 2022 update for all soon-to-be Alpilean customers, thi…", "url": "https://www.tribuneindia.com/news/brand-connect/alpilean-customer-update-december-2022-what-users-must-know-first-458653", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_618675310.jpg", "publishedAt": "2022-12-07T09:47:00Z", "content": "First off, there are extensive Alpilean customer reviews to read too; but this is meant to tap into the highlights of the Alpilean ice hack phenomena happening across the globe right now. In this Dec… [+6053 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Common workplace fumes, dusts may heighten rheumatoid arthritis risk - ThePrint", "description": "Stockholm [Sweden], December 7 (ANI): According to research published online in the Annals of the Rheumatic Diseases, breathing in everyday occupational dust and fumes from substances including vapours, gases, and solvents may increase the chance of developin…", "url": "https://theprint.in/health/common-workplace-fumes-dusts-may-heighten-rheumatoid-arthritis-risk/1252746/", "urlToImage": null, "publishedAt": "2022-12-07T09:14:16Z", "content": "Stockholm [Sweden], December 7 (ANI): According to research published online in the Annals of the Rheumatic Diseases, breathing in everyday occupational dust and fumes from substances including vapou… [+5256 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Amlan Sarkar", "title": "Study Observes Rapid Aging in Teenagers' Brain Scans Post-Lockdown - The Swaddle", "description": "The effects are similar to those previously observed as a result of violence, neglect, and family dysfunction.", "url": "https://theswaddle.com/study-observes-rapid-aging-in-teenagers-brain-scans-post-lockdown/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/12/Brain-Scans-Editorial.jpg", "publishedAt": "2022-12-07T08:28:30Z", "content": "A new study published at the beginning of this month throws light on the physical changes that adolescents’ brains went through during Covid19 lockdowns. The study, published in Biological Psychiatry… [+4907 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Soniya Y", "title": "Gluten-Free Diet: Is It Safe? - Sportskeeda", "description": "The gluten-free diet has become very popular over the past few years and for good reason. Folks who are gluten-intolerant simply feel better when they avoid it.", "url": "https://www.sportskeeda.com/health-and-fitness/gluten-free-diet-is-it-safe", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/12/7b46c-16703993067796-1920.jpg", "publishedAt": "2022-12-07T07:58:50Z", "content": "The gluten-free diet has become very popular over the past few years and for good reason. Folks who are gluten-intolerant simply feel better when they avoid it. For some, though, this diet isnt all t… [+5678 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Type 2 Diabetes Management - The Tribune India", "description": "Diabetes is a chronic disease that affects a huge part of the world's population, who are either living with it or on the verge of developing diabetes at some time in their lives. The average person frequently underestimates the risks associated with diabetes…", "url": "https://www.tribuneindia.com/news/brand-connect/type-2-diabetes-management-458646", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_253296211.jpg", "publishedAt": "2022-12-07T07:54:00Z", "content": "Diabetes is a chronic disease that affects a huge part of the world's population, who are either living with it or on the verge of developing diabetes at some time in their lives. The average person … [+9051 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Pandoravirus: the melting Arctic is releasing ancient germs – how worried should we be? - Deccan Herald", "description": "By Paul Hunter for The Conversation Scientists have recently revived several large viruses that had been buried in the frozen Siberian ground (permafrost) for tens of thousands of years. The youngest virus to be revived was a sprightly 27,000 years old. And t…", "url": "https://www.deccanherald.com/science-and-environment/pandoravirus-the-melting-arctic-is-releasing-ancient-germs-how-worried-should-we-be-1169449.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/12/07/glacier-reuters-1169449-1670399180.jpg", "publishedAt": "2022-12-07T07:46:20Z", "content": "By Paul Hunter for The Conversation\r\nScientists have recently revived several large viruses that had been buried in the frozen Siberian ground (permafrost) for tens of thousands of years.\r\nThe younge… [+5017 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "What is Phentermine Used for Loss-Weight - Deccan Herald", "description": "Many women find it difficult to shed weight, even by following an energizing diet and regular exercising. If you are struggling to shed weight because of hormones, poor eating habits, or slower metabolism, there's many (Phentermine) What is Phentermine Used f…", "url": "https://www.deccanherald.com/brandspot/pr-spot/what-is-phentermine-used-for-loss-weight-1169426.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Picture1-1169426-1670395793.jpg", "publishedAt": "2022-12-07T06:20:19Z", "content": "Many women find it difficult to shed weight, even by following an energizing diet and regular exercising. If you are struggling to shed weight because of hormones, poor eating habits, or slower metab… [+33522 chars]"}, {"source": {"id": null, "name": "Dnpindia.in"}, "author": "Rafia Tasleem", "title": "Individuals with mental disorders lose years of working life: Research - DNP INDIA ", "description": "Mental health: A new study from Aarhus University, people with mental disorders work 10.5 years less than the general population.", "url": "https://www.dnpindia.in/health/individuals-with-mental-disorders-lose-years-of-working-life-research/139573/", "urlToImage": "https://www.dnpindia.in/wp-content/uploads/2022/12/Mental-disorder.webp", "publishedAt": "2022-12-07T06:07:04Z", "content": "Mental health: According to a new study from Aarhus University, people with mental disorders work 10.5 years less than the general population.\r\nThe study is the first to map an estimate of lost worki… [+4553 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Figur Dragons Den [New Report] - Deccan Herald", "description": "Figur Dragons Den is a brand new and top-rated product in the UK that is designed to help you achieve rapid and safe weight loss. The pills are made up of exotic ingredients that act in the fat-burning process. What makes Figur Dragons Den crucial for losing …", "url": "https://www.deccanherald.com/brandspot/pr-spot/figur-dragons-den-new-report-1169424.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1169424-1670392853.png", "publishedAt": "2022-12-07T06:00:53Z", "content": "Figur Dragons Den is a brand new and top-rated product in the UK that is designed to help you achieve rapid and safe weight loss. The pills are made up of exotic ingredients that act in the fat-burni… [+32691 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "The Conversation", "title": "Be Warned: Why measles is now a ‘global threat’ - msnNOW", "description": "The World Health Organization has declared measles an ‘imminent threat in every region of the world,’ owing to limited access to routine healthcare and lower immunisation uptake during the COVID pandemic. Nearly 40 million children missed at least one measles…", "url": "https://www.firstpost.com/explainers/be-warned-why-measles-is-now-a-global-threat-11765241.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/12/221123-measles-mn-1450-68a0c3.jpg", "publishedAt": "2022-12-07T05:34:12Z", "content": "One consequence of the pandemic was reduced access to routine healthcare and lower uptake of immunisations. As a result, in November 2022, the World Health Organization (WHO) declared measles to be a… [+4541 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "News Desk", "title": "Telangana: 47 in every 10000 infected with HIV-AIDS - The Siasat Daily", "description": "Hyderabad: Despite various awareness campaigns 47 people out of 10,000 people in the state are infected by HIV-AIDS. The Telangana State AIDS Control Society is out to raise awareness among the people about this disease in Telangana using auto-rickshaws. Dr G…", "url": "https://www.siasat.com/telangana-47-in-every-10000-infected-with-hiv-aids-2473872/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/04/Untitled-design-26.png", "publishedAt": "2022-12-07T05:12:00Z", "content": "Hyderabad: Despite various awareness campaigns 47 people out of 10,000 people in the state are infected by HIV-AIDS. The Telangana State AIDS Control Society is out to raise awareness among the peopl… [+1209 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Devyani Madaik", "title": "“Awareness About HIV/AIDS Have Reduced Stigma Around It”: Mona Balani, HIV/TB Activist - Swachh India NDTV", "description": "Mona. Balani and her husband were diagnosed with HIV in 1999. Back then, HIV meant AIDS, and it was equated with death, according to Ms Balani. But in recent years, the increase in awareness has changed the lens through which society looks at people diagnosed…", "url": "https://swachhindia.ndtv.com/awareness-about-hiv-aids-have-reduced-stigma-around-it-mona-balani-hiv-tb-activist-72973/", "urlToImage": "https://w.ndtvimg.com/sites/3/2022/12/07103350/660-26.jpg", "publishedAt": "2022-12-07T05:06:38Z", "content": "New Delhi: For decades, the stigma around HIV/AIDS has been recognised as a significant barrier in the fight against the epidemic. In India, this stigma has been shown to cause psychological distress… [+5755 chars]"}, {"source": {"id": null, "name": "Contentmediasolution.com"}, "author": null, "title": "Ed-tech Brand Organises Arts and Crafts Workshop for Children Affected by AIDS - Content Media Solution", "description": "Bangalore, 7 December 2022: This World AIDS day, the world’s biggest edtech brand BYJU’S organized", "url": "https://contentmediasolution.com/health/ed-tech-brand-organises-arts-and-crafts-workshop-for-children-affected-by-aids/", "urlToImage": "https://contentmediasolution.com/wp-content/uploads/2021/05/cropped-website_logo_transparent_background.png", "publishedAt": "2022-12-07T04:56:02Z", "content": "Bangalore, 7 December 2022:  This World AIDS day, the world’s biggest edtech brand BYJU’S organized an arts and crafts workshop for children at DESIRE society, an NGO that works towards improving the… [+945 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "A healthy lifestyle may prevent more than half of inflammatory bowel disease cases: Study - Medical Dialogues", "description": "Inflammatory bowel disease, or IBD for short,  affects an estimated 3 million adults in the US and another 1.3 million in  Europe. And diagnoses have been increasing, particularly in newly ...", "url": "https://medicaldialogues.in/mdtv/gastroenterology/videos/a-healthy-lifestyle-may-prevent-more-than-half-of-inflammatory-bowel-disease-cases-study-103631", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/07/193115-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-2.jpg", "publishedAt": "2022-12-07T03:45:02Z", "content": "Inflammatory bowel disease, or IBD for short, affects an estimated 3 million adults in the US and another 1.3 million in Europe. And diagnoses have been increasing, particularly in newly industrialis… [+4294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr. Ambrish Mithal", "title": "The good news pill: How your diabetes drug can help you lose weight - The Indian Express", "description": "Injectable Semaglutide (as opposed to oral, which is available in India) given in a dose of 2.4 mg weekly can result in a mean weight loss of 15 kg over 7 months in those without diabetes. The figures for those with diabetes are slightly lower, says Dr Ambris…", "url": "https://indianexpress.com/article/lifestyle/health-specials/which-diabetes-drugs-can-lead-to-weight-loss-and-by-how-much-8310117/", "urlToImage": "https://images.indianexpress.com/2022/12/medicine.jpg", "publishedAt": "2022-12-07T03:30:27Z", "content": "Though not discussed as much as other chronic illnesses, obesity is actually the mother of all diseases. Adults are considered obese when their body mass index (BMI) is above a particular cut-off. Fo… [+5366 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Physical functions among Japanese children deteriorated after the onset of pandemic, study finds - News-Medical.Net", "description": "A team of researchers from Nagoya University in central Japan investigated how restrictions on children's activities during the COVID-19 pandemic affected their life habits and their abilities to perform physical activities.", "url": "https://www.news-medical.net/news/20221206/Physical-functions-among-Japanese-children-deteriorated-after-the-onset-of-pandemic-study-finds.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2022-12-07T02:36:00Z", "content": "A team of researchers from Nagoya University in central Japan investigated how restrictions on children's activities during the COVID-19 pandemic affected their life habits and their abilities to per… [+4476 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Sandhya Ramesh", "title": "Blame french fries, not potato. Boiled aloo has no diabetes link, but other veggies keep it at bay - ThePrint", "description": "People consuming vegetables in plenty had 21% lower risk than those taking them in least amount, finds study. Fries, chips, & buttery mashed dish elevate chances of type 2 diabetes.", "url": "https://theprint.in/health/blame-french-fries-not-potato-boiled-aloo-has-no-diabetes-link-but-other-veggies-keep-it-at-bay/1251321/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/05/ukraine-2652561_1920-e1622270022468.jpg", "publishedAt": "2022-12-07T01:00:43Z", "content": "Bengaluru: With the rise of low-carb diets and their increasingly evident health benefits, the staple potato a carbohydrate-rich vegetable has become contentious, especially when it comes to diabetes… [+4748 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "As the U.S. Hits the Highest Levels of Hospitalizations in a Decade from Influenza for ... - Latest Tweet - LatestLY", "description": "The latest Tweet by Reuters states, 'As the U.S. hits the highest levels of hospitalizations in a decade from influenza for this time of year, with at least 14 children already dead so far this flu season, doctors are echoing the CDC’s message for people to g…", "url": "https://www.latestly.com/socially/world/as-the-u-s-hits-the-highest-levels-of-hospitalizations-in-a-decade-from-influenza-for-latest-tweet-by-reuters-4553012.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/06/TW-Reuters-4-784x441.png", "publishedAt": "2022-12-06T20:06:11Z", "content": "As the U.S. hits the highest levels of hospitalizations in a decade from influenza for this time of year, with at least 14 children already dead so far this flu season, doctors are echoing the CDCs m… [+588 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Nisha Kumari", "title": "SARS-CoV-2 variants still transmissible between species, a newly published study - Asiana Times", "description": "The findings were based on humans and some species of bat in the genus Rhinolophus. Spike proteins in several SARS-CoV-2 variants interact with ACE2 receptors on host cells.", "url": "https://asianatimes.com/sars-cov-2-variants-show-cross-species-infectivity/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/12/IA.jpg", "publishedAt": "2022-12-06T17:43:03Z", "content": "A study based on computer simulations on SARS-CoV-2 variants at Rochester Institute of Technology (RIT), US, found how S proteins function not only to infect cells but also attach themselves to the h… [+3167 chars]"}, {"source": {"id": null, "name": "Zawya.com"}, "author": null, "title": "Eritrea: Commemoration of World AIDS Day 2022 - ZAWYA", "description": "", "url": "https://www.zawya.com/en/press-release/africa-press-releases/eritrea-commemoration-of-world-aids-day-2022-hub632uf", "urlToImage": null, "publishedAt": "2022-12-06T17:30:15Z", "content": "WHO Eritrea joined the World in commemorating World AIDS Day 2022 under the theme Equalize at Orotta Conference Hall in Asmara on 1st December 2022.\r\nThe theme of this years World AIDS Day sought to … [+3819 chars]"}, {"source": {"id": null, "name": "Eatingwell.com"}, "author": "Leah Goggins", "title": "5 Things You Should Do Every Day for Your Gut Health, According to a Gastroenterologist - EatingWell", "description": "Keep these habits in mind for a healthy gut.", "url": "https://www.eatingwell.com/article/8017087/things-you-should-do-every-day-for-gut-health/", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B953%2C661%5D&w=1946&h=973&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2022%2F12%2F06%2F5-things-you-should-do-every-day-for-your-gut-health-copy.jpg", "publishedAt": "2022-12-06T17:29:38Z", "content": "Taking care of your gut health can be a tricky thing. When your microbiome—that's the neighborhood of trillions of bacteria living in your gut—is put off-balance, the results can affect your sleep, w… [+4651 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "KRAS drug stops cancer growth in preclinical models of pancreatic cancer: Study - ANI News", "description": "Cancer-causing gene mutation KRAS, found in nearly 30 per cent of all human tumours, successfully shrunk tumours or stopped cancer growth in preclinical models of pancreatic cancer.", "url": "https://www.aninews.in/news/health/kras-drug-stops-cancer-growth-in-preclinical-models-of-pancreatic-cancer-study20221206225225", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221206172206.jpg", "publishedAt": "2022-12-06T17:22:00Z", "content": "Washington [US], December 6 (ANI): A new study has revealed that a small molecule inhibitor that attacks the difficult-to-target, cancer-causing gene mutation KRAS, found in nearly 30 per cent of all… [+3701 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Katharine Lang", "title": "Cardiovascular disease: DASH diet linked to 10% lower risk - Medical News Today", "description": "A new study suggests that the DASH diet may help reduce cardiovascular risk by over 10%. Women and Black adults may reap the highest benefits.", "url": "https://www.medicalnewstoday.com/articles/drugs-opzelura-2", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/12/Effects_Diet_Stocksy_txp19a81b88rCa300_Medium_2578176_Thumb.jpg", "publishedAt": "2022-12-06T16:59:36Z", "content": "<ul><li>Prevalence of cardiovascular disease is rising due to changing lifestyles, an aging population, and better survival rates for heart attacks and strokes.</li><li>There is growing evidence that… [+6584 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Marianne Guenot", "title": "Weight can pile back on if you stop using semaglutide drugs Wegovy and Ozempic, doctor warns - Business Insider India", "description": "Semaglutide has shown promise as an obesity treatment, causing dramatic and effective weight loss.But it is a lifelong commitment — those stopping the drug", "url": "https://www.businessinsider.in/science/health/news/weight-can-pile-back-on-if-you-stop-using-semaglutide-drugs-wegovy-and-ozempic-doctor-warns/articleshow/96036906.cms", "urlToImage": "https://www.businessinsider.in/photo/96036906/weight-can-pile-back-on-if-you-stop-using-semaglutide-drugs-wegovy-and-ozempic-doctor-warns.jpg?imgsize=57042", "publishedAt": "2022-12-06T16:25:00Z", "content": "Those who lose weight using semaglutide are likely to put it back on if they ever stop taking the drug, research shows. \r\nWhile the drug is a potential game changer for people who are sick from obesi… [+2967 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "Aging in eye can predict kidney failure risk, finds study - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/health/aging-in-eye-can-predict-kidney-failure-risk-finds-study", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-05%2Feea40d99-0fd7-485e-b15d-196b1d91d3bf%2F83a6a368c73810b0df963c8c5d905441.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-06T15:11:31Z", "content": "The incidence of end stage kidney disease (ESKD) is known to increase with age.\r\n\"We have previously developed and validated retinal age based on fundus images used as a biomarker of ageing. However,… [+216 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Personalized kidney screening in type 1 diabetes tied to early detection and reduced testing frequency - Medical Dialogues", "description": "USA: Adopting a personalized approach alternative to annual screening for patients with type 1 diabetes (T1D) can considerably reduce the frequency of urine testing and the time with undetected...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/personalized-kidney-screening-in-type-1-diabetes-tied-to-early-detection-and-reduced-testing-frequency-103316", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/05/190072-kidney-screening.jpg", "publishedAt": "2022-12-06T14:30:29Z", "content": "USA: Adopting a personalized approach alternative to annual screening for patients with type 1 diabetes (T1D) can considerably reduce the frequency of urine testing and the time with undetected chron… [+3000 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Lung abnormalities persist after COVID-19 hospitalization even without severe illness - Healio", "description": "Among patients previously hospitalized with COVID-19, researchers estimated that up to 11% had fibrotic patterning, according to a study published in American Journal of Respiratory and Critical Care Medicine.The abnormal lung patterns observed in this study …", "url": "https://www.healio.com/news/pulmonology/20221206/lung-abnormalities-persist-after-covid19-hospitalization-even-without-severe-illness", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/pulmonology/l/lungs-drawing_adobe.jpg", "publishedAt": "2022-12-06T13:53:23Z", "content": "Among patients previously hospitalized with COVID-19, researchers estimated that up to 11% had fibrotic patterning, according to a study published in American Journal of Respiratory and Critical Care… [+5986 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": "Ruchi Rai Sohni", "title": "Making healthy choices to prevent kidney issues - Telangana Today", "description": "Dr. Rajasekara recommends a few tips for everyone to prevent their kidneys.", "url": "https://telanganatoday.com/making-healthy-choices-to-prevent-kidney-issues", "urlToImage": "https://cdn.telanganatoday.com/wp-content/uploads/2022/12/Yashoda-hospitals.jpg", "publishedAt": "2022-12-06T13:49:44Z", "content": null}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "IANS", "title": "How to eat fruit - The New Indian Express", "description": "When it comes to vitamins and antioxidants, the peel is frequently the best part. Apple peels, for example, are high in fibre, vitamin C, and A.", "url": "https://www.newindianexpress.com/lifestyle/health/2022/dec/06/how-toeat-fruit-2525617.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/6/9/w600X390/fruit_bowl.jpg", "publishedAt": "2022-12-06T13:38:00Z", "content": "NEW DELHI: Fruit is great for weight loss because it is low calorie, high fibre, and water content. Fruit is nature's quick snack and is a great source of vitamins and other elements that help mainta… [+4798 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Billy Gardell Keto Gummies Reviews [Scam OR Legit] Shocking Shark Tank Exposed? - The Tribune India", "description": "Billy Gardell Keto Gummies they are an easy and quick way to lose body corpulence within days of ingesting them without any negative impact. OFFICIAL WEBSITE-&rdquo; CLICK HERE&rdquo;", "url": "https://www.tribuneindia.com/news/brand-connect/billy-gardell-keto-gummies-reviews-scam-or-legit-shocking-shark-tank-exposed-458367", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1988024857.jpg", "publishedAt": "2022-12-06T13:25:00Z", "content": "Billy Gardell Keto Gummies they are an easy and quick way to lose body corpulence within days of ingesting them without any negative impact. OFFICIAL WEBSITE-” CLICK HERE”\r\nA rundown on the keto diet… [+8205 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Tanisha Salwan", "title": "Weight Loss: 5 Vegetables You Must Include In Your Diet - Slurrp", "description": "Losing weight could be hard and we know this. Right from having herbal teas to working out in the gym, we do a lot just to shed some extra kilos. But what if we tell you that there are some vegetables that can actually help you? Yes! Scroll down to know more!", "url": "https://www.slurrp.com/article/weight-loss-5-vegetables-you-must-include-in-your-diet-1670325740089", "urlToImage": "https://images.slurrp.com/prodarticles/fvzq4m7k5mn.webp", "publishedAt": "2022-12-06T12:24:39Z", "content": "We have grown up hearing from our mothers how important is to eat vegetables. Vegetables could be a solution to all our problems. We all know that vegetables and fruits are extremely healthy. Every s… [+2411 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "COVID-19 vaccination side effects among the child age group: a large cross-sectional online based survey in Saudi Arabia - BMC Infectious Diseases - BMC Infectious Diseases", "description": "Background Multiple vaccines have been tested in clinical trials for their efficacy and safety. In Saudi Arabia, Pfizer–BioNTech or Moderna were approved for children, however, previous studies to report their safety profile are limited. This research aims to…", "url": "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-022-07905-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12879.jpg", "publishedAt": "2022-12-06T11:55:43Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: As Cases Rise In Children, Here's What You Can Do To Prevent Diabetes In Your Kid - NDTV", "description": "Continue reading this article as we discuss how you can prevent your child from getting type-2 diabetes.", "url": "https://www.ndtv.com/health/diabetes-as-cases-rise-in-children-heres-what-you-can-do-to-prevent-diabetes-in-your-kid-3564471", "urlToImage": "https://c.ndtvimg.com/2018-12/mrep07t_kid-eating-breakfast_625x300_21_December_18.jpg", "publishedAt": "2022-12-06T11:18:55Z", "content": "Make sure your kid eating a healthy and balanced diet\r\nA chronic condition called type 2 diabetes alters how your child's body uses sugar aka glucose as fuel. Without therapy, the disease causes bloo… [+3688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Want A Healthier Gut? Adding Spices And Herbs To Your Meals Could Do The Trick, Says Study - NDTV", "description": "Adding a few pinches of herbs and spices to your meals could possibly give your gut a healthy boost.", "url": "https://www.ndtv.com/world-news/want-a-healthier-gut-adding-spices-and-herbs-to-your-meals-could-do-the-trick-study-says-3582327", "urlToImage": "https://c.ndtvimg.com/2022-12/2oc01fe_participants-who-added-spices-to-their-meals-showed-an-increase-in-gut-bacteria-diversity_625x300_06_December_22.jpg", "publishedAt": "2022-12-06T10:37:48Z", "content": "Participants who added spices to their meals showed an increase in gut bacteria diversity\r\nGut health refers to the balance of microorganisms that live in the digestive tract. It's essential to maint… [+2121 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Winter Diet: 6 Herbs That Can Help You Boost Immunity This Winter - NDTV", "description": "In this article, we share some of the best herbs to add to your winter diet for strong immunity and optimal health.", "url": "https://www.ndtv.com/health/winter-diet-6-herbs-that-can-help-you-boost-immunity-this-winter-3580607", "urlToImage": "https://c.ndtvimg.com/2019-01/so684ugo_herbs_625x300_31_January_19.jpg", "publishedAt": "2022-12-06T08:55:20Z", "content": "Herbs are easy to incorporate in the diet and very beneficial for the body\r\nThe winter season gives a chilly break from the scorching hot summer. As much as it's perfect for multiple activities, it i… [+3526 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Is Covid-19 vaccine causing increase in heart attack cases? Expert take - Hindustan Times", "description": "Even as Covid vaccines have been marked safe and effective, medical practitioners do not completely rule out a mild impact of vaccine on heart health | Health", "url": "https://www.hindustantimes.com/lifestyle/health/is-covid-19-vaccine-causing-increase-in-heart-attack-cases-here-s-what-cardiologists-say-101670315250295.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/06/1600x900/covid_vaccine_1670315389962_1670315390160_1670315390160.jpg", "publishedAt": "2022-12-06T08:35:40Z", "content": "As more reports of sudden cardiac arrest in young and healthy trickle in from various parts of the country, the possible impact of Covid vaccine on heart has once again come under spotlight. Even as … [+4030 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Japanese Encephalitis Infection reported in Pune: Know its symptoms and treatment - India TV News", "description": "There is no cure for Japanese Encephalitis. It is said that those who suffer from JE may have permanent neurologic or psychiatric sequelae. Know everything about it here.", "url": "https://www.indiatvnews.com/health/japanese-encephalitis-infection-reported-in-pune-know-its-symptoms-and-treatment-2022-12-06-829042", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/12/japanese-encephalitis-1670313079.jpeg", "publishedAt": "2022-12-06T07:54:42Z", "content": "Japanese Encephalitis Infection is one of the most deadly viral infections and takes lives every year. It is a viral brain infection that has been reported in Pune in a four-year-old boy. Following t… [+2045 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Online platforms give access to testosterone therapy without caution: Study - ETHealthWorld", "description": "Testosterone therapy can have numerous risks which patients need to have information of before undertaking it. And according to a new study published in the journal named \"JAMA Internal Medicine\", not many of these platforms are providing the appropriate guid…", "url": "https://health.economictimes.indiatimes.com/news/health-it/online-platforms-give-access-to-testosterone-therapy-without-caution-study/96021245", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-96021245,imgsize-43604,width-1200,height-628,overlay-ethealthworld/online-platforms-give-access-to-testosterone-therapy-without-caution-study.jpg", "publishedAt": "2022-12-06T05:52:00Z", "content": "Washington (US): The United States has seen a rise in demand for testosterone therapy. Motivations range from virility enhancement to an increment in strength and energy. It has become a full-blown b… [+5087 chars]"}, {"source": {"id": null, "name": "Cityspidey.com"}, "author": null, "title": "How to be more active throughout the day and lose weight - CitySpidey.com", "description": "When you have a long call to attend, try taking a walk", "url": "https://www.cityspidey.com/news/19668/how-to-be-more-active-throughout-the-day-and-lose-weight", "urlToImage": "https://cityspideynews.s3.amazonaws.com/uploads/spidey/202212/cover--lose-weight-1670244826.webp", "publishedAt": "2022-12-06T05:13:40Z", "content": "Do you want to lose weight but going to a gym doesn't fit in your schedule? Don't worry, a lot of people face the same. Most of us have a habit of procrastination and love to be a couch potato, which… [+2155 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Experimental Alzheimer's drug shows promise, but hurdles are plenty - EastMojo", "description": "The first drug that can slow the rate of decline in Alzheimer’s patients has been found. The experimental drug, called lecanemab, is an antibody that", "url": "http://www.eastmojo.com/world/2022/12/06/experimental-alzheimers-drug-shows-promise-but-there-are-many-hurdles-to-overcome/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/12/maxresdefault.jpg?fit=1280%2C720&ssl=1", "publishedAt": "2022-12-06T00:30:47Z", "content": "The first drug that can slow the rate of decline in Alzheimers patients has been found. The experimental drug, called lecanemab, is an antibody that targets the toxic clumps of amyloid protein associ… [+5601 chars]"}, {"source": {"id": null, "name": "Getbengal.com"}, "author": null, "title": "Bengali scientists nail down antibiotic-resistant 'Superbugs' - Get Bengal", "description": "Seven scientists including three Bengali researchers identified the superbug", "url": "https://www.getbengal.com/details/bengali-scientists-nail-down-antibiotic-resistant-superbugs", "urlToImage": "https://www.getbengal.com/uploads/story_image/Antibiotic-Resistant-Superbugs.jpg", "publishedAt": "2022-12-06T00:30:00Z", "content": "Antibiotics provide effective treatment for a wide variety of infections and illnesses. Sir Alexander Fleming, a Scottish researcher, is credited with the discovery of penicillin in 1928. The introdu… [+4675 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Hospitalizations lower for patients with advanced CKD who choose conservative management - Healio", "description": "ORLANDO &mdash; Patients with advanced chronic kidney disease who choose conservative management have lower hospitalization rates vs. patients who choose dialysis, according to a study presented at ASN Kidney Week.&ldquo;Given evidence that dialysis results i…", "url": "https://www.healio.com/news/nephrology/20221205/hospitalizations-lower-for-patients-with-advanced-ckd-who-choose-conservative-management", "urlToImage": "https://www.healio.com/~/media/slack-news/nephrology/misc/infographics/2022/december/nni1222rhee_asn_graphic_01_web.jpg", "publishedAt": "2022-12-05T21:24:44Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nORLANDO — Patients with advanced chronic… [+2384 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "The Hans India", "title": "Long Covid symptoms in kids change over time, reveals Lancet study - The Hans India", "description": "Symptoms of long Covid experienced by children and young people change over time and while some of...", "url": "https://www.thehansindia.com/hans/young-hans/long-covid-symptoms-in-kids-change-over-time-reveals-lancet-study-772034", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/12/05/1323487-wf.jpg", "publishedAt": "2022-12-05T19:04:23Z", "content": "Symptoms of long Covid experienced by children and young people change over time and while some of the children's original symptoms declined, new symptoms were reported, the world's largest study on … [+1667 chars]"}, {"source": {"id": null, "name": "Becker's Hospital Review"}, "author": "Mariah Taylor", "title": "AI can use 1 x-ray to determine 10-year heart disease risk, researchers say - Becker's Hospital Review", "description": "Researchers developed a deep learning artificial intelligence model that can predict the 10-year risk of cardiovascular disease using a single X-ray.", "url": "https://www.beckershospitalreview.com/cardiology/ai-can-use-1-x-ray-to-determine-10-year-heart-disease-risk-researchers-say.html", "urlToImage": null, "publishedAt": "2022-12-05T19:00:56Z", "content": "Researchers developed a deep learning artificial intelligence model that can predict the 10-year risk of cardiovascular disease using a single X-ray.\r\nThe AI, known as CXR-CVD risk deep learning mode… [+1278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Large-scale vaccination, identifying hotspots: State task force drafts action plan to tackle measles - The Indian Express", "description": "Maharashtra has reported 836 measles cases and 18 deaths this year. The task force has suggested an active search for hotspots and special vaccination campaigns in the state.", "url": "https://indianexpress.com/article/cities/pune/large-scale-vaccination-identifying-hotspots-state-task-force-drafts-action-plan-to-tackle-measles-8307665/", "urlToImage": "https://images.indianexpress.com/2022/12/measles-9-3.jpg", "publishedAt": "2022-12-05T17:49:43Z", "content": "A meeting of experts with the Maharashtra state task force on measles prevention and control has resulted in an action plan for a mass-scale vaccination campaign in hotspot areas to tackle the menace… [+2731 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Roxanne Nelson, RN, BSN", "title": "Less Than Third of Americans Aware of Cancer Risk From Alcohol - Medscape", "description": "Despite strong evidence that all alcoholic beverages increase the risk of many types of cancer, Americans continue to be little aware of this risk, a new survey reveals.", "url": "https://www.medscape.com/viewarticle/985002", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_221205_wine_beer_liquor_800x450.jpg", "publishedAt": "2022-12-05T17:38:05Z", "content": "Another survey has shown that Americans are largely unaware of the link between alcohol consumption and cancer.\r\nThe new findings, from a nationally representative survey that included responses from… [+3441 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Living in greener places linked to better mental health, lower medication use - ANI News", "description": "Many well-known health benefits of urban green space include increased life expectancy, fewer mental health issues, and improved cognitive performance. However, it is unclear how much green space is required to benefit people's health.", "url": "https://www.aninews.in/news/lifestyle/others/living-in-greener-places-linked-to-better-mental-health-lower-medication-use20221205220338", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221205163325.jpg", "publishedAt": "2022-12-05T16:33:00Z", "content": "Washington [US], December 5 (ANI): Many well-known health benefits of urban green space include increased life expectancy, fewer mental health issues, and improved cognitive performance. However, it … [+3113 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Tim Smith", "title": "Psoriasis Patients with Lupus Erythematosus Skew Female, More Likely to Have Joint Involvement - MD Magazine", "description": "In a recent study, patients with psoriasis and coexistent lupus erythematosus were analyzed regarding their clinical characteristics, condition management, and quality of life.", "url": "https://www.hcplive.com/view/psoriasis-patients-lupus-erythematosus-skew-female-more-likely-joint-involvement", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/dec1c766f96bbaf40126541b26b7dc5dcbafea83-300x300.jpg?fit=crop&auto=format", "publishedAt": "2022-12-05T16:26:18Z", "content": "A cross-sectional study on clinical characteristics, life quality, and condition management of psoriasis patients with coexistent lupus erythematosus (LE) finds that this type of combined condition i… [+3729 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Exploring the genetic overlap between twelve psychiatric disorders - Nature.com", "description": "Cross-trait meta-analysis on 12 psychiatric disorders identifies the genetic overlap between pairs of disorders and highlights the challenges of cross-trait genetic research.", "url": "https://www.nature.com/articles/s41588-022-01245-2", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-022-01245-2/MediaObjects/41588_2022_1245_Fig1_HTML.png", "publishedAt": "2022-12-05T16:18:55Z", "content": "<li>Momen, N. C. et al. Association between mental disorders and subsequent medical conditions. N. Engl. J. Med.382, 17211731 (2020).\r\nArticle \r\n PubMed \r\n PubMed Central \r\nGoogle Scholar \r\n</li><li>… [+11864 chars]"}, {"source": {"id": null, "name": "Cancertherapyadvisor.com"}, "author": "Leah Lawrence", "title": "Breast Cancer Survivors Have Increased Risk of Implant-Associated ALCL - Oncology Nurse Advisor", "description": "Breast cancer survivors have an increased risk of breast implant-associated ALCL, but the absolute risk is “extremely low,” according to researchers.", "url": "https://www.cancertherapyadvisor.com/home/cancer-topics/breast-cancer/implant-associated-alcl-risk-increased-breast-cancer-survivors/", "urlToImage": "https://www.cancertherapyadvisor.com/wp-content/uploads/sites/12/2021/10/Breast-implants-ss-129884363.jpg", "publishedAt": "2022-12-05T15:20:00Z", "content": "Breast cancer survivors have an increased risk of breast implant-associated anaplastic large-cell lymphoma (ALCL), but the absolute risk is extremely low, according to researchers. They reported thes… [+1911 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Research: Gossypetin found in hibiscus may beat Alzheimer's disease - Times of India", "description": "A research team has verified that gossypetin activates immune cells in the brain that clear A beta, which triggers Alzheimer's disease. Professor Kyong-Tai Kim and PhD candidate Kyung Won Jo (Department of Life Sciences) at POSTECH has verified that the gossy…", "url": "https://timesofindia.indiatimes.com/videos/news/research-gossypetin-found-in-hibiscus-may-beat-alzheimers-disease/videoshow/96008005.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-96008005,imgsize-1329021.cms", "publishedAt": "2022-12-05T14:52:47Z", "content": "Dec 05, 2022, 08:22PM ISTSource: ANIA research team has verified that gossypetin activates immune cells in the brain that clear A beta, which triggers Alzheimer's disease. Professor Kyong-Tai Kim and… [+1087 chars]"}, {"source": {"id": null, "name": "Ancavasculitisnews.com"}, "author": "Steve Bryson, PhD, Steve Bryson, PhD", "title": "Only Moderate Immune Response for CoronaVac Vaccine in AAV |... - ANCA Vasculitis News", "description": "The CoronaVac COVID-19 vaccine has an excellent safety profile but only generates moderate immune responses in ANCA vasculitis (AAV) patients.", "url": "https://ancavasculitisnews.com/news/only-moderate-immune-response-coronavac-covid-19-vaccine-aav/", "urlToImage": "https://ancavasculitisnews.com/wp-content/uploads/2022/11/SphereBacteria.png", "publishedAt": "2022-12-05T14:49:35Z", "content": "The CoronaVac COVID-19 vaccine has an excellent safety profile, but generates only a moderate immune response in people with ANCA-associated vasculitis (AAV), a clinical trial analysis found.\r\nAlthou… [+6054 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "The Science Advisory Board staff writers", "title": "B cells hinder intestinal healing, offer potential IBD drug target - The Science Board", "description": "New research reveals that B cells, white blood cells that are critical to the proper functioning of the immune system, greatly increase after bowel damage and prevent the tissue from healing. The findings have implications for the treatment of inflammatory bo…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5079", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_can/2021_08_25_18_26_4543_digestive_system_intestine_social.jpg", "publishedAt": "2022-12-05T14:39:11Z", "content": "Researchers at Karolinska Institutet in Sweden found that the B cell population increases sharply in the colon during the healing of colonic lesions, and these cells mainly accumulate in areas where … [+1093 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Opioid-gabapentinoid therapy for GI diseases increases risk of depression - Medical Dialogues", "description": "Despite manageable gastrointestinal (GI) side effects, opioid-gabapentinoid combo therapy may be linked to a higher risk of central nervous system (CNS) depression and mortality says an article...", "url": "https://medicaldialogues.in/medicine/news/opioid-gabapentinoid-therapy-for-gi-diseases-increases-risk-of-depression-103313", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/21/188755-medicine-new-1.jpg", "publishedAt": "2022-12-05T14:30:59Z", "content": "Despite manageable gastrointestinal (GI) side effects, opioid-gabapentinoid combo therapy may be linked to a higher risk of central nervous system (CNS) depression and mortality says an article publi… [+2531 chars]"}, {"source": {"id": null, "name": "Newswire.com"}, "author": null, "title": "PositiveSingles Raises HIV Awareness in Honor of World AIDS Day, Which Kicked Off the Month of December - Digital Journal", "description": "PositiveSingles is a popular online dating portal that has does great work. They have several success stories and are now looking to create HIV awareness in honor of World AIDS Day, which occurred on December 1st.", "url": "https://www.newswire.com/news/positivesingles-raises-hiv-awareness-in-honor-of-world-aids-day-which-21893659", "urlToImage": "https://cdn.newswire.com/files/x/f5/0d/9705699e6f2743f7afa9c37ed6d5.jpg", "publishedAt": "2022-12-05T14:24:10Z", "content": "PositiveSingles is a popular online dating portal that has does great work. They have several success stories and are now looking to create HIV awareness in honor of World AIDS Day, which occurred on… [+2303 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Deploying technology to detect TB - Express Healthcare", "description": "Madhav Joshi, CEO, India Health Fund talks about the role of technology in managing Tuberculosis (TB)", "url": "https://www.expresshealthcare.in/news/deploying-technology-to-detect-tb/437175/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/12/05190736/CEO-Madhav-Joshi.jpg", "publishedAt": "2022-12-05T13:38:21Z", "content": "Madhav Joshi, CEO, India Health Fund talks about the role of technology in managing Tuberculosis (TB)\r\nTB is a serious threat to public health and over the last decade, there has been a significant i… [+3068 chars]"}, {"source": {"id": null, "name": "Indiaai.gov.in"}, "author": null, "title": "Exploring Simulated annealing - a probabilistic technique - INDIAai", "description": "Simulated annealing (SA) is often used when the search space is clear.", "url": "https://indiaai.gov.in/article/exploring-simulated-annealing-a-probabilistic-technique", "urlToImage": "https://d12aarmt01l54a.cloudfront.net/cms/images/Media-20221205181921/1200-630.png", "publishedAt": "2022-12-05T13:20:09Z", "content": "Simulated annealing (SA)\r\n is often used when the search space is clear. In addition, simulated annealing may be better than exact algorithms like gradient descent or branch and bound when finding an… [+3193 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Krati Purwar", "title": "Hormonal IUD: Working, Benefits & Side Effects Explained By An Expert - HerZindagi English", "description": "We talked to an expert to understand how a hormonal IUD works and its benefits. Read on.", "url": "https://www.herzindagi.com/health/hormonal-iud-working-benefits-and-side-effects-explained-by-an-expert-article-215820", "urlToImage": "https://images.herzindagi.info/image/2022/Dec/intrauterine-device-how-it-works-benefits-side-effects.jpg", "publishedAt": "2022-12-05T13:11:21Z", "content": "Sex is a pleasurable act that many women cannot enjoy because of the fear of getting pregnant. However, contraceptives offer them the ease to enjoy the moment without any worries. One such option the… [+3910 chars]"}, {"source": {"id": null, "name": "The Irish Sun"}, "author": "Isabel Shaw", "title": "The cancer symptoms you can notice when you walk – and 7 other signs to watch for... - The Irish Sun", "description": "MANY of us believe we know most of the obvious cancer symptoms. Unexplained lumps, bumps and general tiredness are widely understood to be early indicators of the disease. But struggling to walk ca…", "url": "https://www.thesun.ie/health/9851591/cancer-symptom-walk/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2022/12/photo-taken-phuket-thailand-780783104-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-12-05T12:39:25Z", "content": "MANY of us believe we know most of the obvious cancer symptoms. \r\nUnexplained lumps, bumps and general tiredness are widely understood to be early indicators of the disease. \r\nBone cancer often leg p… [+2542 chars]"}]}