{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Biopharmadive.com"}, "author": "Delilah Alvarado", "title": "EMA backs Pfizer's RSV vaccine for use during pregnancy - BioPharma Dive", "description": "The regulator’s recommendation for approval of Pfizer’s shot as a maternal immunization comes ahead of the FDA, which is currently reviewing that indication.", "url": "https://www.biopharmadive.com/news/rsv-vaccine-maternal-pregnancy-ema-europe-pfizer/688618/", "urlToImage": "https://www.biopharmadive.com/imgproxy/zKdwAH3Fyty1hfgDMUnrYEhLcV9UtTCrUNTuc4ccq3s/g:ce/rs:fill:770:435:0/bG9jYWw6Ly8vZGl2ZWltYWdlL0dldHR5SW1hZ2VzLTEyMjc3Mzk3NDVfd3k5UnU2Zy5qcGc.jpg", "publishedAt": "2023-07-21T16:15:58Z", "content": "Dive Brief:\r\n<ul><li>Pfizers vaccine for respiratory syncytial virus has gained the backing of the European Medicines Agency, which on Thursday recommended approval of the shot for use during pregnan… [+2113 chars]"}, {"source": {"id": null, "name": "UN News"}, "author": null, "title": "Spike in dengue cases due to global warming, warns WHO - UN News", "description": "Global warming marked by higher average temperatures, precipitation and longer periods of drought, could prompt a record number of dengue infections worldwide, the World Health Organization (WHO) warned on Friday.", "url": "https://news.un.org/en/story/2023/07/1138962", "urlToImage": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/31-03-2022_Unsplash_mosquito.jpg/image770x420cropped.jpg", "publishedAt": "2023-07-21T15:21:07Z", "content": "About half of the world's population is at risk of dengue, and dengue affects approximately 129 countries, said Dr Raman Velayudhan, WHOs Head of the Global Programme on control of Neglected Tropical… [+3235 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "World Brain Day 2023: Exercises to keep your brain active and avoid dementia - Hindustan Times", "description": "Want to stay mentally young forever? Here are techiques and exercises to keep your brain active. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/world-brain-day-2023-exercises-to-keep-your-brain-active-and-avoid-dementia-101689946305270.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/07/21/1600x900/brain_workout_thumb_1689947248936_1689947268773.jpg", "publishedAt": "2023-07-21T13:54:13Z", "content": "Just like the body, your brain also requires workout to remain active and agile as one grows older. Amid growing cases of dementia which have roots in stress and unhealthy lifestyle, a little extra c… [+4186 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Murali Krishnan", "title": "Stigma and ignorance at heart of India's diabetes problem - DW (English)", "description": "India is seeing a rapid rise in childhood diabetes cases, and experts say an assessment of the consequences is crucial for developing targeted prevention and treatment approaches.", "url": "https://www.dw.com/en/stigma-and-ignorance-at-heart-of-indias-diabetes-problem/a-66307086", "urlToImage": "https://static.dw.com/image/66308062_6.jpg", "publishedAt": "2023-07-21T13:44:59Z", "content": "Parth Sharma is 15 years old and has diabetes. He is careful to adhere to his insulin schedule to ensure his glucose levels are under control. He injects insulin up to five times a day from an insuli… [+6910 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Make fatty fish, nuts & seeds part of daily diet: Food rich in omega-3 fatty acids can boost lung health - Economic Times", "description": "A study has revealed that Omega-3 fatty acids can have benefits for lung health. Omega-3 acids were found to have anti-inflammatory action, making them useful for maintaining lung health.", "url": "https://economictimes.indiatimes.com/magazines/panache/make-fatty-fish-nuts-seeds-part-of-daily-diet-food-rich-in-omega-3-fatty-acids-can-boost-lung-health/articleshow/102016203.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102016726,width-1070,height-580,imgsize-277270,overlay-etpanache/photo.jpg", "publishedAt": "2023-07-21T13:31:00Z", "content": "New Delhi, Omega-3 fatty acids, which are abundant in fish and fish oil supplements, may be beneficial for lung health, according to large, multi-faceted study in healthy adults. The research, publis… [+3201 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "World Brain Day: Get better sleep, eat healthy food & exercise daily to delay cognitive decline - Economic Times", "description": "Good quality sleep is crucial for brain function, as per a study by UCL and the University of the Republic in Uruguay. Suffering from lifestyle conditions such as high BP, vascular or blood vessel diseases, and diabetes, can be detrimental to brain health.", "url": "https://economictimes.indiatimes.com/magazines/panache/world-brain-day-get-better-sleep-eat-healthy-food-exercise-daily-to-delay-cognitive-decline/articleshow/102019357.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102019395,width-1070,height-580,imgsize-66320,overlay-etpanache/photo.jpg", "publishedAt": "2023-07-21T13:26:00Z", "content": "Brain - the most crucial part of the body - defines who you are.It can break or make your existence. Hence, it needs constant exercise to function smoothly.\r\nSeveral things can affect cognitive healt… [+1885 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Nutritional, health and socio-demographic determinants of anaemia in adolescent girls in Kumbungu District, Ghana - BMC Nutrition - BioMed Central", "description": "Background Anaemia is a serious health problem among adolescent girls in Ghana. The aims of this study were to measure the prevalence and identify the nutritional, health, and socio-demographic determinants of anaemia in adolescent girls in Kumbungu District,…", "url": "https://bmcnutr.biomedcentral.com/articles/10.1186/s40795-023-00749-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/40795.jpg", "publishedAt": "2023-07-21T12:50:40Z", "content": null}, {"source": {"id": null, "name": "Mongabay.com"}, "author": "saumitrashinde", "title": "Can lab-grown mosquitoes counter dengue? - Mongabay-India", "description": "This week Mongabay-India reported on lab-grown mosquitoes that fight dengue, Delhi floods, river revival in Tamil Nadu, and more.", "url": "https://india.mongabay.com/2023/07/delhi-floods-tamil-nadu-mosquitoes-dengue/", "urlToImage": "https://imgs.mongabay.com/wp-content/uploads/sites/30/2023/07/18215201/12-e1689697561313-1200x800.png", "publishedAt": "2023-07-21T12:41:52Z", "content": "This weeks environment and conservation news stories rolled into one.\r\nSubscribe to our YouTube channel to watch the latest high quality, original video stories from natures frontline in India.\r\nTo r… [+2127 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Green Bananas Can You These Amazing 5 Health Benefits; Know How To Use - NDTV", "description": "Raw bananas are loaded with several essential nutrients. Here are some surprising health benefits of eating green bananas.", "url": "https://www.ndtv.com/health/green-bananas-can-you-these-amazing-5-health-benefits-know-how-to-use-4229558", "urlToImage": "https://c.ndtvimg.com/pnugjji8_raw-banana_625x300_24_July_18.jpg", "publishedAt": "2023-07-21T12:21:22Z", "content": "Green bananas are a great source of potassium\r\nBananas are a great source of potassium, fibre and several other essential nutrients. Bananas are easily available and are a go-to fruit for many. Start… [+2337 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": null, "title": "Practo Launches Transform: A Diabetes Management and Remission Program - Press Trust of India", "description": "Pti: Practo Launches Transform: A Diabetes Management and Remission Program", "url": "https://www.ptinews.com/pti/Practo-Launches-Transform--A-Diabetes-Management-and-Remission-Program/63686.html", "urlToImage": null, "publishedAt": "2023-07-21T12:15:08Z", "content": "More than 88% people living with diabetes reduced or stopped medications over the course of 6 months \r\nIndia – Business Wire India \r\nPracto, India’s leading digital healthcare company, introduces 'Tr… [+7171 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Pallavi Mehra", "title": "Skincare: Expert Shares Hydration Tips To Combat Dryness And Dullness During Monsoon - Zee News", "description": "1. Gentle Exfoliators Exfoliate with scrubs that feel like a gentle kiss on your skin, giving you an instant boost of glow and love by sloughing off dead, toxic, and damaged skin cells. Exfoliation is a crucial step in your skincare routine as it gets rid of …", "url": "https://zeenews.india.com/lifestyle/beauty-fashion/skincare-expert-shares-hydration-tips-to-combat-dryness-and-dullness-during-monsoon-2638470.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/07/21/1245865-skincare-routine.jpg", "publishedAt": "2023-07-21T11:24:05Z", "content": "Monsoons are all about embracing nature, luscious greenery, whistling winds, breezy climes, and some sweet relief from the scorching summer heat. Everything about the monsoon sounds so gleeful and se… [+3701 chars]"}, {"source": {"id": null, "name": "Mypunepulse.com"}, "author": "Punepulse", "title": "Pune News : PMC Appeals Medical Practitioners and Pathology Clinics To Update About Water And Vector Borne Diseases - Pune Pulse", "description": "The Pune Municipal Corporation has appealed to the healthcare professionals, pathology clinics, medical practitioners to timely update about the patients coming up with vector borne and water borne diseases. The civic body stated that as per the Maharashtra P…", "url": "https://www.mypunepulse.com/pune-news-pmc-appeals-medical-practitioners-and-pathology-clinics-to-update-about-water-and-vector-borne-diseases/", "urlToImage": "https://www.mypunepulse.com/wp-content/uploads/2023/07/PMC-Appeals-Medical-Practitioners-and-Pathology-Clinics-To-Update-About-Water-And-Vector-Borne-Diseases.jpg", "publishedAt": "2023-07-21T11:17:17Z", "content": "The Pune Municipal Corporation has appealed to the healthcare professionals, pathology clinics, medical practitioners to timely update about the patients coming up with vector borne and water borne d… [+638 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Aishwarya Sahasrabudhe", "title": "Keep Dengue At Bay; 6 Foods To Increase Platelet Count - Slurrp", "description": "Platelets are responsible for blood clotting in the body. A lowered platelet count can increase fatigue, cause prolonged bleeding and excessive bruising. Platelet count drops due to certain nutrient deficiencies or more commonly while suffering from dengue, h…", "url": "https://www.slurrp.com/article/keep-dengue-at-bay-6-foods-to-increase-platelet-count-and-stay-healthy-1689937494225", "urlToImage": "https://images.slurrp.com/prodarticles/u7i5ahbhnig.webp", "publishedAt": "2023-07-21T11:15:21Z", "content": "Having a naturally high production of platelets which perform their function of aggregation and adhesion to the optimum is extremely essential for healthy bodily repair and recovery. A lowered platel… [+955 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Herbalife Weight Loss Reviews: Products, Nutrition, Shake, Plan, Protein Powder, Drink! - Deccan Herald", "description": "Herbalife Weight Loss Reviews: You may have heard the phrase “Health is wealth” that means the most valuable and important thing in a person’s life is their health. If a person is not healthy, they may not enjoy their life fully even if they have everything e…", "url": "https://www.deccanherald.com/brandspot/sponsored/herbalife-weight-loss-reviews-products-nutrition-shake-plan-protein-powder-drink-1239297.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201392-1239297-1689937770.jpg", "publishedAt": "2023-07-21T11:09:30Z", "content": "Herbalife Weight Loss Reviews: You may have heard the phrase Health is wealth that means the most valuable and important thing in a persons life is their health. If a person is not healthy, they may … [+30405 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Deepali Verma", "title": "What's The Best Way To Have Nuts - Raw, Soaked Or Roasted? - Slurrp", "description": "Nuts, whether raw, soaked, or roasted, are nutrient-packed powerhouses that offer a plethora of health benefits. Learn fascinating facts about these crunchy treats and their positive impact on your well-being.", "url": "https://www.slurrp.com/article/whats-the-best-way-to-have-nuts-raw-soaked-or-roasted-experts-reveal-1689936939277", "urlToImage": "https://images.slurrp.com/prodarticles/ov6i55usze.webp", "publishedAt": "2023-07-21T11:09:07Z", "content": "Nuts, regardless of whether they are consumed raw, soaked, or roasted, have been a longstanding component of human diets for centuries. They are highly regarded not only for their enjoyable flavour b… [+2709 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A model-based approach to estimating vaccine effectiveness against SARS-CoV-2 variants of concern - News-Medical.Net", "description": "A group of researchers examined the effectiveness of updated vaccines and variant-matched boosters.", "url": "https://www.news-medical.net/news/20230721/A-model-based-approach-to-estimating-vaccine-effectiveness-against-SARS-CoV-2-variants-of-concern.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_754296_16899365947345083.jpg", "publishedAt": "2023-07-21T10:51:00Z", "content": "In a recent study published in Nature Communications, a group of researchers examined\r\nthe effectiveness of updated vaccines and variant-matched boosters against the severe acute respiratory syndrome… [+6517 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Slurrp Desk", "title": "Exploring The Health Benefits Of 8 Daily Indian Spices, Turmeric To Cinnamon - Slurrp", "description": "Unveil the hidden gems of Indian cuisine! This captivating piece reveals the remarkable health merits of 8 cherished Indian spices. From the golden magic of turmeric to the aromatic allure of cinnamon, delve into the centuries-old secrets of these flavorful w…", "url": "https://www.slurrp.com/article/exploring-the-health-benefits-of-8-daily-indian-spices-turmeric-to-cinnamon-1689791005996", "urlToImage": "https://images.slurrp.com/prodarticles/nxvztncz6q.webp", "publishedAt": "2023-07-21T10:49:37Z", "content": "1. Turmeric:\r\n\" style=\"height: 370px;\"&gt;\r\nVideo Credits: Home Cooked/YouTube\r\nThe tiny but mighty cloves are packed with antioxidants that can help fight oxidative stress and reduce inflammation in… [+189 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Contrave Weight Loss Reviews - Deccan Herald", "description": "Contrave Weight Loss Reviews: Natural supplements for contrave weight loss are products that can help you lose fat faster than just eating healthy and exercising. The best supplements for contrave weight loss have natural ingredients that can make your metabo…", "url": "https://www.deccanherald.com/brandspot/sponsored/contrave-weight-loss-reviews-1239252.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201390-1239252-1689933873.jpg", "publishedAt": "2023-07-21T10:04:33Z", "content": "Contrave Weight Loss Reviews: Natural supplements for contrave weight loss are products that can help you lose fat faster than just eating healthy and exercising. The best supplements for contrave we… [+34340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "This herb can help solve most of your hair problems - The Indian Express", "description": "This herb can help solve most of your hair problems", "url": "https://indianexpress.com/web-stories/beauty/this-herb-can-help-solve-most-of-your-hair-problems/", "urlToImage": "https://images.indianexpress.com/2023/02/FALSE-DAISY.jpg", "publishedAt": "2023-07-21T09:47:01Z", "content": "According to Ayurveda, bhringraj is the best herb to manage most of your hair problems.\r\nIt not only helps reduce hair fall, but it also promotes hair growth and prevents greying of hair, owing to it… [+1047 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Scientists reveal why obesity makes ovarian cancer more deadly - ANI News", "description": "The majority of women with ovarian cancer are diagnosed with the most advanced stage of the disease. Less than a third of people diagnosed with the condition survive five years. According to a recent study, as the third most frequent type of gynaecological ca…", "url": "https://www.aninews.in/news/health/scientists-reveal-why-obesity-makes-ovarian-cancer-more-deadly20230721144707", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230721075424.jpg", "publishedAt": "2023-07-21T09:17:00Z", "content": "Washington DC [US], July 21 (ANI): The majority of women with ovarian cancer are diagnosed with the most advanced stage of the disease. Less than a third of people diagnosed with the condition surviv… [+2350 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI PR", "title": "India shows significant results in immunization, reveals WHO and UNICEF data - ThePrint", "description": "PNN New Delhi [India], July 21: Post Covid-19, India has achieved significant results through successful social mobilization and strategic communication in tackling vaccine hesitancy and boosting confidence in promoting importance of immunization.  According …", "url": "https://theprint.in/ani-press-releases/india-shows-significant-results-in-immunization-reveals-who-and-unicef-data/1680096/", "urlToImage": null, "publishedAt": "2023-07-21T09:15:13Z", "content": "PNN\r\nNew Delhi [India], July 21: Post Covid-19, India has achieved significant results through successful social mobilization and strategic communication in tackling vaccine hesitancy and boosting co… [+2767 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "Benefits of kalonji: 5 reasons why you should black seeds you should know - Health shots", "description": "Kalonji or black seeds is a powerhouse of nutrients that can help you deal with numerous diseases. From managing skin problems to keeping your cholesterol levels in check, read on to know the benefits of kalonji.", "url": "https://www.healthshots.com/healthy-eating/superfoods/benefits-of-kalonji-or-black-seeds/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/07/21130005/Kalonji.jpg", "publishedAt": "2023-07-21T09:00:37Z", "content": "It goes without saying that the Indian kitchen is full of nature’s gifts that can heal you from pretty much anything. For thousands of years, generations have turned to those botanical powerhouses to… [+4570 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New mRNA Malaria Vaccine Targets Immune Cells in the Liver - Technology Networks", "description": "A new mRNA vaccine targeting immune cells in the liver could be the key to tackling malaria, a disease that causes over half a million deaths each year according to the World Health Organization, yet has no effective long-lasting vaccine.<br /><br />", "url": "https://www.technologynetworks.com/biopharma/news/new-mrna-malaria-vaccine-targets-immune-cells-in-the-liver-376568", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/376568/new-mrna-malaria-vaccine-targets-immune-cells-in-the-liver-376568-640x360.jpg?cb=20230721", "publishedAt": "2023-07-21T08:32:10Z", "content": "A new mRNA vaccine targeting immune cells in the liver could be the key to tackling malaria, a disease that causes over half a million deaths each year according to the World Health Organization, yet… [+3949 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Two-year-old boy succumbs to brain-eating amoeba infection - Times of India", "description": "Trending News: A two-year-old boy named Woodrow Bundy has died from a brain-eating amoeba infection after playing i", "url": "https://timesofindia.indiatimes.com/etimes/trending/two-year-old-boy-succumbs-to-brain-eating-amoeba-infection/articleshow/102007846.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102007825,width-1070,height-580,imgsize-33190,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-07-21T08:30:00Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "Onam Gupta", "title": "Weight Loss: 7 Home Exercises To Reduce Thigh Fat - India.com", "description": "", "url": "https://www.india.com/webstories/lifestyle/weight-loss-7-home-exercises-to-reduce-thigh-fat-6179436/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/07/WhatsApp-Image-2023-07-21-at-1.00.59-PM-5.jpeg", "publishedAt": "2023-07-21T08:20:55Z", "content": "Squats are effective for toning your thighs and strengthening muscles of the lower part of the body\r\nLunges are effective to reduce thigh fat and can help activate your hamstring, hip flexor, abducto… [+534 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Immune boosting model overcomes the limitations of the leaky and polarized vaccination models - News-Medical.Net", "description": "Researchers compare different approaches to the dynamical modeling of vaccination and immunity.", "url": "https://www.news-medical.net/news/20230721/Immune-boosting-model-overcomes-the-limitations-of-the-leaky-and-polarized-vaccination-models.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_754262_16898811817546238.jpg", "publishedAt": "2023-07-21T08:15:00Z", "content": "Vaccination plays a vital role in preventing the incidence of new infections and associated diseases. However, vaccination often fails to provide complete protection, which is referred to as imperfec… [+5939 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Powerhouse proteins protect cardiac cells from chemotherapy damage: Research - ThePrint", "description": "Chicago [US], July 21 (ANI): The University of Illinois at Chicago researchers discovered a method for enzymes to help avoid cardiac damage in chemotherapy patients.  The enzymes are normally found in a cell’s mitochondria, the powerhouse that produces energy…", "url": "https://theprint.in/science/powerhouse-proteins-protect-cardiac-cells-from-chemotherapy-damage-research/1679969/", "urlToImage": null, "publishedAt": "2023-07-21T08:13:41Z", "content": "Chicago [US], July 21 (ANI): The University of Illinois at Chicago researchers discovered a method for enzymes to help avoid cardiac damage in chemotherapy patients. \r\nThe enzymes are normally found … [+3192 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "IISc researchers design synthetic peptide capable of poisoning antibiotic-resistant bacteria - Deccan Herald", "description": "Researchers at the Indian Institute of Science (IISc) have designed a short peptide capable of poisoning a key enzyme in disease-causing bacteria, including some of most deadly and antibiotic-resistant species. Made from a short stretch of about 24 amino acid…", "url": "https://www.deccanherald.com/science-and-environment/iisc-researchers-design-synthetic-peptide-capable-of-poisoning-antibiotic-resistant-bacteria-1239200.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/07/21/iisc-dh-1-1201161-1679100299-1203339-1679695615-1214531-1682899248-1230354-1687466795-1234324-1688610152-1236139-1689169983-1239200-1689924827.jpg", "publishedAt": "2023-07-21T07:33:47Z", "content": "Researchers at the Indian Institute of Science (IISc) have designed a short peptide capable of poisoning a key enzyme in disease-causing bacteria, including some of most deadly and antibiotic-resista… [+3635 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "5 healthy afternoon habits inspired by the longest-living people in the world - IndiaTimes", "description": "Learn from the Blue Zones - Nicoya, Costa Rica; Loma Linda, California; Ikaria, Greece; Okinawa, Japan; and Sardinia, Italy - and redefine your afternoons for better longevity. Instead of stressing about productivity, focus on purpose to find fulfillment and …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/de-stress/5-healthy-afternoon-habits-inspired-by-the-longest-living-people-in-the-world/photostory/102007541.cms", "urlToImage": "https://static.toiimg.com/photo/102007604.cms", "publishedAt": "2023-07-21T07:30:00Z", "content": "We all pay attention to morning and bedtime routines, however, have you even thought about how you spend your afternoons, and its impact on your longevity? If you work in an office, chances are your … [+555 chars]"}, {"source": {"id": null, "name": "Newsdrum.in"}, "author": "NewsDrum Desk", "title": "Mental illness in fathers may increase the risk of preterm birth: Research - NewsDrum", "description": "Mothers with a mental illness are more likely to give birth too early, according to research. But the risk of preterm ...", "url": "https://www.newsdrum.in/international/mental-illness-in-fathers-may-increase-the-risk-of-preterm-birth-new-research", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x627/newsdrum-in/media/media_files/spxHhilWiVOIVoin3a4R.jpg", "publishedAt": "2023-07-21T07:20:48Z", "content": "Solna: Mothers with a mental illness are more likely to give birth too early, according to research. But the risk of preterm birth can also be affected by a fathers mental health. In our new study pu… [+4101 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "The Challenge of Antimicrobial Resistance in the Indian Healthcare System - Cureus", "description": "The emergence and rapid spread of antimicrobial resistance (AMR) pose a grave threat to public health globally, and particularly so in India. With its unique combination of a dense population, a significant disease burden, and diverse healthcare practices, In…", "url": "https://www.cureus.com/articles/165013-the-challenge-of-antimicrobial-resistance-in-the-indian-healthcare-system?score_article=true", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_0.png", "publishedAt": "2023-07-21T07:17:05Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Here is everything you need to know about female sexual dysfunction - The Indian Express", "description": "Here is everything you need to know about female sexual dysfunction", "url": "https://indianexpress.com/web-stories/wellness/here-is-everything-you-need-to-know-about-female-sexual-dysfunction/", "urlToImage": "https://images.indianexpress.com/2023/03/FSD-1.jpg", "publishedAt": "2023-07-21T06:46:38Z", "content": "There are various symptoms depending on the kind of sexual dysfunction you are facing:\r\nThe most common FSD includes a lack of sexual desire and interest.\r\nYour desire for sex may be there, but you h… [+601 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Eat your first meal before 8 am and last meal before 7 pm to reduce risk of Type 2 Diabetes - TheHealthSite", "description": "A new study from France has suggested that having an early breakfast and an early dinner may help reduce the risk of developing type 2 diabetes. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/diabetes/eating-breakfast-before-8-am-may-reduce-risk-of-type-2-diabetes-say-experts-994601/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/07/Eat-Breakfast-Before-8-am.jpg", "publishedAt": "2023-07-21T06:46:00Z", "content": "Eat your first meal before 8 am and last meal before 7 pm \r\nThe risk of developing type 2 diabetes is significantly higher in people who regularly eat breakfast after 9 a.m., compared to those who ea… [+2322 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "'She devoted her life to serving others, yet she faced constant disappointments' - Times of India", "description": "Soul Curry invites you to share your real-life soul-stirring experiences. If you have any such story to share, do send it to us at soulcurry@timesinte", "url": "https://timesofindia.indiatimes.com/life-style/relationships/soul-curry/she-devoted-her-life-to-serving-others-yet-she-faced-constant-disappointments/articleshow/102005967.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102006194,width-1070,height-580,imgsize-59522,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-07-21T06:40:00Z", "content": "Like Shiv Shakti's Subha Rajput, divas who played goddess Parvati"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Other health benefits of fenugreek seeds - The Indian Express", "description": "Other health benefits of fenugreek seeds", "url": "https://indianexpress.com/web-stories/wellness/other-health-benefits-of-fenugreek-seeds/", "urlToImage": "https://images.indianexpress.com/2023/05/FENUGREEK.jpg", "publishedAt": "2023-07-21T05:16:15Z", "content": "Apart from weight loss, there are many other health benefits associated with this superfood seed.\r\nFenugreek seeds has shown to be anti-carcinogenic. Research has shown that they hinder the growth of… [+755 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Sanchari Ghosh", "title": "New research finds possible relations between constipation and cognitive decline - Sportskeeda", "description": "Constipation is a problem that troubles many.", "url": "https://www.sportskeeda.com/health-and-fitness/new-research-finds-possible-relations-constipation-cognitive-decline", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/07/758bd-16898824716516-1920.jpg", "publishedAt": "2023-07-21T05:16:00Z", "content": "Constipation is a problem that troubles many. According to The National Institute of Diabetes and Digestive and Kidney Diseases, approximately 16 out of 100 adults in the United States are prone to t… [+2685 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Psychological distress in ectopic pregnancy | NDT - Dove Medical Press", "description": "Reviewing the psychological distress, influencing factors, measurement tools, and nursing interventions in patients with ectopic pregnancy. Read more", "url": "https://www.dovepress.com/research-progress-on-psychological-distress-in-patients-with-ectopic-p-peer-reviewed-fulltext-article-NDT", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-07-21T04:46:26Z", "content": "Background\r\nEctopic pregnancy refers to the implantation of the fertilized egg outside the uterine cavity. According to the implantation site, it is classified as a tubal pregnancy, ovarian pregnancy… [+27157 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "To improve the implementation of glycemic control | IJGM - Dove Medical Press", "description": "Reviewing the progress of research on the various quantifiable parameters of glycemic variability and their relationships with vascular lesions and mechanisms.", "url": "https://www.dovepress.com/correlation-between-glycemic-variability-and-diabetic-complications-a--peer-reviewed-fulltext-article-IJGM", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-07-21T04:14:15Z", "content": "Introduction\r\nDiabetes is a common lifelong chronic disease whose prevalence continues to increase worldwide. The chronic high blood glucose levels caused by the disease have a negative impact on the… [+46945 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Karishma Pranav Bhavsar", "title": "Amid rise in dengue cases, Delhi govt asks chemists not to sell painkillers like Aspirin, Ibuprofen without prescription | Mint - Mint", "description": "The Delhi government has asked chemical associations to stop selling drugs like Aspirin and Ibuprofen without a doctor's prescription, amid a rise in vector-borne diseases such as dengue and chikungunya. The government also advised chemist shop owners to keep…", "url": "https://www.livemint.com/news/india/amid-rise-in-dengue-cases-delhi-govt-asks-chemists-not-to-sell-painkillers-like-aspirin-ibuprofen-without-prescription-11689909202915.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/21/600x338/pain_killer_1689910685525_1689910685699.JPG", "publishedAt": "2023-07-21T03:50:20Z", "content": "Amid rise in vector-borne diseases, the Delhi government's Department of Drugs Control has asked all chemical associations in the city to refrain from selling drugs like Aspirin and Ibuprofen without… [+3613 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "A single flea bite sent him to the hospital. One month later, he's lost his hands and toes. - KENS 5: Your San Antonio News Source", "description": "Doctors said Michael Kohlhof, a volunteer and handyman, was infected with a rare form of Typhus. Now, he needs help.", "url": "https://www.youtube.com/watch?v=Bi1f56nd01I", "urlToImage": "https://i.ytimg.com/vi/Bi1f56nd01I/hqdefault.jpg", "publishedAt": "2023-07-21T03:21:46Z", "content": null}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Challenging Case of Kaposi Sarcoma Inflammatory Cytokine Syndrome - Cureus", "description": "Kaposi Sarcoma Inflammatory Cytokine Syndrome (KICS) is a serious, uncommon disease that occurs in patients who are positive for HIV and human herpesvirus-8 (HHV-8). It is characterized by a constellation of clinical findings, including fever, weight loss, an…", "url": "https://www.cureus.com/articles/167158-a-challenging-case-of-kaposi-sarcoma-inflammatory-cytokine-syndrome", "urlToImage": "https://assets.cureus.com/uploads/figure/file/666135/article_river_0dec94800f5111eeb407a360a42e3217-H-E-40x.png", "publishedAt": "2023-07-21T02:41:31Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Mathematical neural network theory explains how memories are consolidated in the brain - News-Medical.Net", "description": "How useful a memory is for future situations determines where it resides in the brain, according to a new theory proposed by researchers at HHMI\"s Janelia Research Campus and collaborators at UCL.", "url": "https://www.news-medical.net/news/20230720/Mathematical-neural-network-theory-explains-how-memories-are-consolidated-in-the-brain.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2023-07-21T02:06:00Z", "content": "How useful a memory is for future situations determines where it resides in the brain, according to a new theory proposed by researchers at HHMI\"s Janelia Research Campus and collaborators at UCL.\r\nT… [+2725 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anuja Jaiswal", "title": "Dengue starts to sting, admissions rise in Delhi hospitals - IndiaTimes", "description": "The number of dengue patients being admitted to hospitals across the city has been steadily increasing in the past three days. Some facilities have b", "url": "https://timesofindia.indiatimes.com/city/delhi/dengue-starts-to-sting-admissions-rise/articleshow/101998666.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101998673,width-1070,height-580,imgsize-16072,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-07-20T23:28:00Z", "content": "This August, explore these pretty places in South India"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "New global action plan on epilepsy and other neurological disorders published - World Health Organization", "description": "<p><p><a name=\"_Hlk140692745\" data-sf-ec-immutable=\"\">WHO’s </a><a href=\"https://www.who.int/publications/i/item/9789240076624\" data-sf-ec-immutable=\"\">Intersectoral Global Action Plan</a> (IGAP) on epilepsy and other neurological disorders, published today i…", "url": "https://www.who.int/news/item/20-07-2023-new-global-action-plan-on-epilepsy-and-other-neurological-disorders-published", "urlToImage": "https://cdn.who.int/media/images/default-source/epilepsy/epilepsy_action_plan.pdf.tmb-1200v.jpg?sfvrsn=e89ee621_1", "publishedAt": "2023-07-20T20:41:43Z", "content": "Intersectoral Global Action Plan (IGAP) on epilepsy and other neurological disorders, published today in all six UN languages, sets out the actions needed to improve access to care and treatment for … [+2632 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "Ultra-Thin Microcatheter with Fiber Optic Sensors a Game Changer in Heart Disease Detection - HospiMedica", "description": "A new diagnostic technology uses tiny fiber optic sensors to detect the causes of heart disease, more quickly and accurately than existing methods.", "url": "https://www.hospimedica.com/critical-care/articles/294797967/ultra-thin-microcatheter-with-fiber-optic-sensors-a-game-changer-in-heart-disease-detection.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2023-07-20/SDD-294797967.jpg", "publishedAt": "2023-07-20T18:36:48Z", "content": "There is growing evidence that points to the importance of accurate assessments of the coronary microvasculature (the constriction of the smallest heart vessels) in tailoring heart disease therapies.… [+2996 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What are Cholesterol Vaccines? - News-Medical.Net", "description": "Low low-density lipoprotein (LDL) cholesterol levels can cause artery blockages and diseases like heart attacks and strokes.  Vaccines targeting an important regulator of LDL receptors can be highly beneficial.", "url": "https://www.news-medical.net/health/What-are-Cholesterol-Vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/Article_Images/ImageForArticle_23801_16898663232929900.jpg", "publishedAt": "2023-07-20T15:27:50Z", "content": "Low-density lipoproteins (LDLs)PCSK9 geneTherapeutic strategiesInclisiranReferencesFurther reading\r\nLow levels of low-density lipoprotein (LDL) cholesterol can cause artery blockages and diseases lik… [+8232 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Vegetarianism and Its Implications for Body Mass Index, Health, and Dietary Awareness in a Metropolitan City in India: A Cross-Sectional Study - Cureus", "description": "Background\r\n\r\nThis cross-sectional study aimed to assess and analyze the awareness of vegetarianism and its prevalence as a lifestyle practice in an urban population of Hyderabad, India.\r\n\r\nMethodology\r\n\r\nA predesigned, semi-structured questionnaire was used …", "url": "https://www.cureus.com/articles/138647-vegetarianism-and-its-implications-for-body-mass-index-health-and-dietary-awareness-in-a-metropolitan-city-in-india-a-cross-sectional-study", "urlToImage": "https://assets.cureus.com/uploads/figure/file/643693/article_river_9af35010fb1711eda7f923443318cc4f-undefined-14-.png", "publishedAt": "2023-07-20T12:13:15Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha Yadav", "title": "Tips To Reduce Muscle Cramps After Exercise - Hindustan Times", "description": "Here are some tips to reduce muscle cramps", "url": "https://www.hindustantimes.com/web-stories/lifestyle/tips-to-reduce-muscle-cramps-after-exercise-101689847285197.html", "urlToImage": null, "publishedAt": "2023-07-20T12:05:12Z", "content": "By Neha YadavPublished Jul 20, 2023\r\nHindustan TimesLifestylePhoto Credits: Unsplash"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Health Desk", "title": "5 swelled body parts can be indicators of fatty liver disease - India TV News", "description": "If you have any of these five body parts that are swollen, it could be an indication of fatty liver disease and should not be ignored.", "url": "https://www.indiatvnews.com/health/5-swelled-body-parts-can-be-indicators-of-fatty-liver-disease-2023-07-20-882058", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/07/swelled-body-parts-1689854122.jpg", "publishedAt": "2023-07-20T11:56:50Z", "content": "Fatty liver disease is a condition where fat accumulates in the liver and can lead to serious complications. While fatty liver disease is usually asymptomatic, there are certain body parts that can s… [+1763 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Getty Images", "title": "Changes in lifestyle to lower the risk of cancer - Regular body check-ups - Economic Times", "description": "The likelihood of detecting cancer early can be increased by performing routine self-exams and having screenings for cancers, such as skin, colon, cervix, and breast cancer. When treatment begins, chances of success are highest. ​Regular body check-ups​", "url": "https://economictimes.indiatimes.com/news/india/changes-in-lifestyle-to-lower-the-risk-of-cancer/regular-body-check-ups/slideshow/101987086.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101987086,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-20T11:17:00Z", "content": "Carrier 1.5 Ton 3 Star AI Flexicool Inverter Split AC (Copper, Convertible 4-in-1 Cooling,High Density Filter, Auto Cleanser, 2023 Model,ESTER Exi - CAI18ER3R32F0,White)\r\nBuy Now"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Namita S Kalla", "title": "Home remedies: 6 health benefits of drinking ginger tea - Moneycontrol", "description": "Health benefits of ginger tea: From soothing discomfort and relieving nausea to boosting immunity and reducing inflammation, this potent root has been cherished in home remedies for ages.", "url": "https://www.moneycontrol.com/news/health-and-fitness/home-remedies-health-benefits-of-ginger-tea-in-boosting-immunity-digestion-nausea-10994901.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/07/Health-benefits-of-ginger-tea-770x433.jpg", "publishedAt": "2023-07-20T11:12:39Z", "content": "Health benefits of ginger and ginger tea: Among the most popular, and effective, herbs in home remedies for a number of health issues, gingers therapeutic benefits have been documented in detail for … [+3812 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alexa Mellardo", "title": "How to Lose Belly Fat After 50, Say Experts - Eat This, Not That", "description": "If you're wondering how to lose belly fat after 50, experts share exactly how you can melt excess fat and get lean through diet and exercise.", "url": "https://www.eatthis.com/how-to-lose-belly-fat-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/07/mature-woman-drinking-smoothie.jpg?quality=82&strip=all", "publishedAt": "2023-07-20T11:01:01Z", "content": "Growing into your 50s is yet another beautiful chapter of life. But alas, the struggle to shed weight becomes all too real with age. By making some necessary adjustments to your routine, you can blas… [+6233 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Monitoring T Cells Might Allow Type 1 Diabetes Prevention: Study - Zee News", "description": "Waterborne Disease: 8 Early Signs And Symptoms of Dengue You Should NOT Ignore The study’s first authors were graduate student Siddhartha Sharma and research assistants Josh Boyer and Xuqian Tan, all of the Teyton lab at the time of the study. Type 1 diabetes…", "url": "https://zeenews.india.com/health/monitoring-t-cells-might-allow-type-1-diabetes-prevention-study-2637906", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/07/20/1245028-diabetes-2.jpg", "publishedAt": "2023-07-20T08:59:10Z", "content": "Scripps Scientists have discovered that analysing a certain type of immune cell in the blood can help identify people at risk of developing type 1 diabetes, a fatal autoimmune illness. If the new app… [+3727 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Aishwarya Sahasrabudhe", "title": "Lowering BP And More, Benefits Of A Low-Sodium Diet - Slurrp", "description": "Sodium is an extremely essential mineral processed by the kidneys that are responsible for maintaining electrolyte balance in the body. Too much or too little of sodium can both be harmful for healthy bodily function. A low-sodium diet is beneficial for those…", "url": "https://www.slurrp.com/article/cut-down-salt-in-your-diet-lowering-bp-and-more-benefits-of-a-low-sodium-diet-1689841511323", "urlToImage": "https://images.slurrp.com/prodarticles/b4v6k9yb80f.webp", "publishedAt": "2023-07-20T08:39:43Z", "content": "Too high, or too low sodium levels can both be harmful. This mineral is found in most foods like fruits, vegetables, dairy and of course, salt. Many times, cutting out packaged and processed foods th… [+469 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "What are the potential applications of bacteriophages, also known as “good viruses,” in fighting bacterial infections? Analyse the advantages and challenges of using bacteriophages as an alternative to antibiotics and their significance in addressing the global - Insights IAS", "description": "Topic: Science and Technology- developments and their applications and effects in everyday life. 5. What are the potential applications of bacteriophages, also known as “good viruses,” in fighting bacterial infections? Analyse the advantages and challenges of…", "url": "https://www.insightsonindia.com/2023/07/20/what-are-the-potential-applications-of-bacteriophages-also-known-as-good-viruses-in-fighting-bacterial-infections-analyse-the-advantages-and-challenges-of-using-bacteriophages-as-an-alternative/", "urlToImage": null, "publishedAt": "2023-07-20T07:39:04Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Seed Probiotic Reviews: Ortho biotic, Petz park probiotic and Modere probiotic! - Deccan Herald", "description": "Seed Probiotic: Probiotics are good for your gut. You can find them in yogurt and pills. But can they make you hard to poop? Let’s talk about this more. Some research has looked at how probiotics affect your gut. Some research says that probiotics help you po…", "url": "https://www.deccanherald.com/brandspot/sponsored/seed-probiotic-reviews-ortho-biotic-petz-park-probiotic-and-modere-probiotic-1238888.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201372-1238888-1689838591.jpg", "publishedAt": "2023-07-20T07:36:31Z", "content": "Seed Probiotic: Probiotics are good for your gut. You can find them in yogurt and pills. But can they make you hard to poop? Lets talk about this more. Some research has looked at how probiotics affe… [+16813 chars]"}, {"source": {"id": null, "name": "Guwahati Plus"}, "author": null, "title": "Rising HIV Infections Amongst Injecting Drug Users Cause Concern In Assam - Guwahati Plus", "description": "There is growing concern in Assam over the increasing number of Human Infected Virus (HIV) infections among Injecting Drug Users (IDUs).", "url": "https://www.guwahatiplus.com/assam/rising-hiv-infections-amongst-injecting-drug-users-cause-concern-in-assam", "urlToImage": "https://www.guwahatiplus.com/storage/app/public/daily_banners/fb_image/c9b35758effccef5a14002ad846be38c.png", "publishedAt": "2023-07-20T06:21:42Z", "content": "This material may not be published, broadcast, rewritten, or redistributed, 2023 © G plus. All rights reserved. Copyright © 2023 Insight Brandcom Pvt. Ltd. All rights reserved."}, {"source": {"id": null, "name": "India.com"}, "author": "Anshul Rani", "title": "8 Tips to Prevent Dengue and Malaria This Monsoon - India.com", "description": "Dengue and Malaria is very common during monsoon days. some tips how you can protect yourself from this disease.", "url": "https://www.india.com/webstories/health/8-tips-to-prevent-dengue-and-malaria-this-monsoon-6177145/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/07/dengu.jpg", "publishedAt": "2023-07-20T06:12:56Z", "content": "Some tips to take care of yourself during the rainy season.\r\nLight the dark areas like the staircase and alley to keep mosquitos at bay.\r\nRemember to use mosquito nets properly while going to bed to … [+462 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Women who underwent breast cancer treatment age faster: Study - ETHealthWorld", "description": "Biological age reflects a person's cell and tissue health, and it differs from chronological age. To measure biological age, the researchers studied 417 women who had blood samples collected at two time points about eight years apart. About half of the women …", "url": "https://health.economictimes.indiatimes.com/news/industry/women-who-underwent-breast-cancer-treatment-age-faster-study/101975740", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-101975740,imgsize-26828,width-1200,height=765,overlay-ethealth/industry/women-who-underwent-breast-cancer-treatment-age-faster-study.jpg", "publishedAt": "2023-07-20T05:25:55Z", "content": "North Carolina: A new study conducted by researchers at the National Institutes of Health and their collaborators have found that women who have been diagnosed with and treated for breast cancerage b… [+2950 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "AI could help detect early signs of Alzheimer's - Global News", "description": "While there is no cure for Alzheimer's, an early diagnosis can make a major difference in managing symptoms and planning for the future. Aritificial intellig...", "url": "https://www.youtube.com/watch?v=BDwCOjdvDvc", "urlToImage": "https://i.ytimg.com/vi/BDwCOjdvDvc/maxresdefault.jpg", "publishedAt": "2023-07-20T02:15:00Z", "content": null}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Depression in Patients With Intracranial Hemorrhage Secondary to Traumatic Brain Injury - Cureus", "description": "This article discusses the prevalence of depression in patients with intracranial hemorrhage (ICH) and the relationship of selective serotonin reuptake inhibitor (SSRI) use with bleeding risk. A detailed account of the patient’s psychiatric history and curren…", "url": "https://www.cureus.com/articles/167315-depression-in-patients-with-intracranial-hemorrhage-secondary-to-traumatic-brain-injury", "urlToImage": "https://assets.cureus.com/uploads/figure/file/668451/article_river_0dd24c20175c11eea74f93dfb97b75b0-Screen-Shot-2023-06-30-at-11.37.24-AM.png", "publishedAt": "2023-07-19T18:32:29Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}]}