{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Pusan National University researchers identify therapeutic targets to overcome radioresistance of brain cancer cells - EurekAlert", "description": "Glioblastoma (GBM) is a WHO grade IV brain tumor with dismal prognosis. Although post-surgical radiation chemotherapy combined with temozolomide is the standard line of treatment, GBM cells surviving radiotherapy contribute to tumor progression and recurrence…", "url": "https://www.eurekalert.org/news-releases/976946", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/13016845-f813-490e-b385-572bdfd83afb/Rendition/thumbnail/Content/Public", "publishedAt": "2023-01-19T02:02:11Z", "content": "image: Researchers from Korea and USA unveil the mechanism of radioresistance, or resistance to chemotherapy, in glioblastoma (brain cancer) cells, identifying potential therapeutic targets and a cli… [+5622 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "HEAR SCORE: anamnestic & EKG data, low risk chest pain | OAEM - Dove Medical Press", "description": "Careful evaluation of clinical data & EKG allows to correctly discriminate which patients won’t have adverse cardiac events, reducing the length of stay in ED.", "url": "https://www.dovepress.com/hear-score-a-proposal-to-use-only-anamnestic-and-ekg-data-to-evaluate--peer-reviewed-fulltext-article-OAEM", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-19T00:31:52Z", "content": "Introduction\r\nChest pain in a common symptom in patients attending Emergency Department (ED) worldwide.1,2 An extensive variety of disorders can be related, ranging from life-threatening syndromes su… [+17349 chars]"}, {"source": {"id": null, "name": "European Society of Cardiology"}, "author": null, "title": "COVID-19 patients retain elevated risk of death for at least 18 months after infection - European Society of Cardiology", "description": "Your access to the latest cardiovascular news, science, tools and resources.", "url": "https://www.escardio.org/The-ESC/Press-Office/Press-releases/covid-19-patients-retain-elevated-risk-of-death-for-at-least-18-months-after-inf", "urlToImage": "https://www.escardio.org/static_file/Escardio/Medias/common-library/logos/esc/ESC%20&%20Associations%20Lockup%20Vertical.jpg", "publishedAt": "2023-01-19T00:14:58Z", "content": "Sophia Antipolis, 19 January 2023:  COVID-19 is associated with higher risks of cardiovascular disease and death in the short- and long-term, according to a study in nearly 160,000 participants publi… [+4460 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "The benefit of vaccination after previous SARS-CoV-2 infection in the omicron era - The Lancet", "description": "Understanding the durability of the protection conferred by SARS-CoV-2 infection and\nvaccination is of utmost importance to guide COVID-19 mitigation policies worldwide.\nIn November, 2021, before the emergence of the omicron (B.1.1.529) variant, an estimated\n…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00880-5/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/5e57d0ae-f0cd-4d28-810e-3ea4958049df/fx1.jpg", "publishedAt": "2023-01-18T23:30:14Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "First-in-human use of a modular capsid virus-like vaccine platform: an open-label, non-randomised, phase 1 clinical trial of the SARS-CoV-2 vaccine ABNCoV2 - The Lancet", "description": "Immunisation with ABNCoV2 was well tolerated, safe, and resulted in a functional immune\nresponse. The data support the need for additional clinical development of ABNCoV2\nas a second-generation SARS-CoV-2 vaccine. The modular cVLP platform will accelerate\nvac…", "url": "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(22)00337-8/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/dae1155b-7b65-4988-97a8-da65f12f94a2/gr1.jpg", "publishedAt": "2023-01-18T23:30:14Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2023 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marilynn Larkin", "title": "COPD Patients at Higher Risk of Death 1 Year After Surgery - Medscape", "description": "Patients with chronic obstructive pulmonary disease are 26% more likely to die after elective surgery and to incur increased healthcare costs, compared with peers without the condition, researchers say.", "url": "https://www.medscape.com/viewarticle/987144", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230118_senior_spirometry_800x450.jpg", "publishedAt": "2023-01-18T21:30:11Z", "content": "Patients with chronic obstructive pulmonary disease (COPD) are more likely to die within a year of undergoing elective surgery and to incur higher healthcare costs than similar patients without COPD,… [+5966 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Srishti Singh Sisodia", "title": "Why does joint pain increase in winter season? Expert tells WION the reasons and preventive measures - WION", "description": "Why does joint pain increase in winter season? Expert tells WION the reasons and preventive measures", "url": "https://www.wionews.com/entertainment/lifestyle/news-why-does-joint-pain-increase-in-winter-season-expert-tells-wion-the-reasons-and-preventive-measures-553986", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/01/19/326591-orthopaedic-problems.png", "publishedAt": "2023-01-18T20:27:09Z", "content": "Winter season comes with a number of health issues, such as cold, flu, pneumonia, sore throat, asthma attacks, etc. Joint pain is also quite usual when the temperature starts to drop, some people fee… [+3386 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Nuclear remodelling contributes to cardiac dysfunction during ageing - Nature.com", "description": "A new study shows that age-dependent nuclear remodelling in cardiomyocytes (via age-related loss of nuclear lamins) contributes to cardiac dysfunction through a process that is conserved in flies, mice and nonhuman primates.", "url": "https://www.nature.com/articles/s41569-023-00832-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41569-023-00832-y/MediaObjects/41569_2023_832_Figa_HTML.png", "publishedAt": "2023-01-18T17:36:10Z", "content": "Ageing is associated with a progressive decline in organ function, including the heart. However, the detailed mechanisms of age-related cardiac functional decline are unclear. A new study shows that … [+391 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Sagar Puri", "title": "Apple Health Benefits: This Red fruit helps in reducing Cholesterol- Know why you should eat it everyday - Zee News", "description": "Here are some of its benefits 1. Apple helps in Reducing Cholestrol According to a study eating 2 apples can helps in reducing Cholestrol levels. In human studies, consuming up to two to three medium-sized apples resulted in a decrease in total cholesterol le…", "url": "https://zeenews.india.com/health/apple-health-benefits-this-red-fruit-helps-in-reducing-cholesterol-know-why-you-should-eat-it-everyday-2563108", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/18/1143195-apple-health-benefits.jpg", "publishedAt": "2023-01-18T17:04:01Z", "content": "There is a quote that 'an apple a day keeps the doctor away'. Apples are the second most consumed fruit worldwide due to their health benefits. They play a significant role in the overall dietary int… [+2199 chars]"}, {"source": {"id": null, "name": "Empr.com"}, "author": "Brian Park, PharmD", "title": "Lack of Efficacy Ends Trial Evaluating Janssen's HIV Vaccine Candidate - Monthly Prescribing Reference", "description": "The decision to discontinue the study was made based on an analysis from an independent data and safety monitoring board.", "url": "https://www.empr.com/home/news/drugs-in-the-pipeline/lack-of-efficacy-ends-trial-evaluating-janssens-hiv-vaccine-candidate/", "urlToImage": "https://www.empr.com/wp-content/uploads/sites/7/2021/12/prepping-vaccine-g-rf-556421531.jpg", "publishedAt": "2023-01-18T16:10:00Z", "content": "A phase 3 trial evaluating Janssens investigational HIV vaccine for the prevention of HIV-1 infection in HIV-1 seronegative cisgender men and transgender individuals will be discontinued.\r\nThe multic… [+2006 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr. V Ravi", "title": "Cervical Cancer Awareness Month 2023: Understanding The Importance Of Regular Screenings - NDTV Doctor", "description": "In certain cases, HPV doesn't always cause symptoms, and here the only way to be sure of the cervical cancer status is through regular screening.", "url": "https://doctor.ndtv.com/womens-health/cervical-cancer-awareness-month-2023-understanding-the-importance-of-regular-screenings-3704213", "urlToImage": "https://i.ndtvimg.com/i/2017-12/cervical-cancer-prevention_650x400_51513849002.jpg", "publishedAt": "2023-01-18T15:39:09Z", "content": "Just like how the pink colour represents breast cancer, Teal draws attention to the second most common malignant Cervical Cancer amongst women.\r\nOver 99% of cervical cancer cases are caused by Human … [+3980 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Pure Neuro Reviews [2023 Urgently-Updated] Amazon, Coupon Code, Ingredients, Miracle - Deccan Herald", "description": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions such as thinking memory, memory, learning social cognition,…", "url": "https://www.deccanherald.com/brandspot/pr-spot/pure-neuro-reviews-2023-urgently-updated-amazon-coupon-code-ingredients-miracle-1182334.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p21-1182334-1674056303.png", "publishedAt": "2023-01-18T15:38:23Z", "content": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions… [+26798 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marlene Busko", "title": "Nitrite Food Additives May Increase Risk of Type 2 Diabetes - Medscape", "description": "Greater intake of nitrites from food additives was tied to greater risk of developing type 2 diabetes, in a French study, but some experts question the findings.", "url": "https://www.medscape.com/viewarticle/987095", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230118_sodium_nitrate_800x450.jpg", "publishedAt": "2023-01-18T15:29:34Z", "content": "Consuming a large amount of nitrites from food additives versus none was associated with a greater risk of developing type 2 diabetes in the NutriNet-Santé study in France, researchers report.\r\nHowev… [+6511 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Wellness Wednesday: Busting health myths - News4JAX The Local Station", "description": "Dominique Landry, certified personal trainer and founder of Fit Enough, joins us to answer your biggest health questions and debunk myths about fitness.", "url": "https://www.youtube.com/watch?v=Vv7D7Dg7LoA", "urlToImage": "https://i.ytimg.com/vi/Vv7D7Dg7LoA/maxresdefault.jpg", "publishedAt": "2023-01-18T15:29:08Z", "content": null}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keto Excel Keto Gummies Australia Reviews 2023: Chemist Warehouse Exposed Hidden Dangers! - The Tribune India", "description": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies Australia help the body through ketosis and fasting. This i…", "url": "https://www.tribuneindia.com/news/brand-connect/keto-excel-keto-gummies-australia-reviews-2023-chemist-warehouse-exposed-hidden-dangers-471559", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1685757973.png", "publishedAt": "2023-01-18T15:25:00Z", "content": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies… [+9254 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Biomarkers Predicting Poor Prognosis in Covid-19 Patients: A Survival Analysis - Cureus", "description": "Introduction\r\n\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importance. The objective of this study is to determine the relat…", "url": "https://www.cureus.com/articles/132461-biomarkers-predicting-poor-prognosis-in-covid-19-patients-a-survival-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/527759/article_river_4d90f260886611eda03ce7ff2d482aa6-cox.png", "publishedAt": "2023-01-18T15:11:24Z", "content": "Introduction\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importa… [+35617 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Synogut Reviews: Amazon, Where to Buy, Pills, Price - Deccan Herald", "description": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and poor digestive systems. The reason for this is mostly due to…", "url": "https://www.deccanherald.com/brandspot/pr-spot/synogut-reviews-amazon-where-to-buy-pills-price-1182322.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p18-1182322-1674054168.png", "publishedAt": "2023-01-18T15:02:48Z", "content": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and … [+34754 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Back Pain Breakthrough Reviews: Dr. Steve Young Help You? - Deccan Herald", "description": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasional stiffness or ashes it is important to know that your body…", "url": "https://www.deccanherald.com/brandspot/pr-spot/back-pain-breakthrough-reviews-dr-steve-young-help-you-1182321.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p17-1182321-1674053743.png", "publishedAt": "2023-01-18T14:55:43Z", "content": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasion… [+20743 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "All Day Slimming Tea Reviews: Herbal Tea Helps in Weight Loss! - Deccan Herald", "description": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people continue to overlook how important the practice of maintain…", "url": "https://www.deccanherald.com/brandspot/pr-spot/all-day-slimming-tea-reviews-herbal-tea-helps-in-weight-loss-1182319.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p16-1182319-1674053444.png", "publishedAt": "2023-01-18T14:50:44Z", "content": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people… [+31612 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Body Dissatisfaction primary cause of eating disorders at any age including during perimenopause - Medical Dialogues", "description": "Eating disorders are stereotypically associated with adolescents and young adults. Growing evidence, however, suggests that these conditions can occur at any time during a woman's lifespan,...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/body-dissatisfaction-primary-cause-of-eating-disorders-at-any-age-including-during-perimenopause-105794", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/18/198649-untitled-design-2023-01-18t114638036.jpg", "publishedAt": "2023-01-18T14:30:43Z", "content": "Eating disorders are stereotypically associated with adolescents and young adults. Growing evidence, however, suggests that these conditions can occur at any time during a woman's lifespan, including… [+3077 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Indo-Mediterranean diet bests DASH diet for lowering BP, CVD and all cause mortality - Medical Dialogues", "description": "This study published in the Nutrients Journal highlights the role of nutritious diet (DASH, Indo-Western and Japanese) against Western-type that can lead to increased levels of oxidative stress", "url": "https://medicaldialogues.in/diet-nutrition/news/indo-mediterranean-diet-bests-dash-diet-for-lowering-bp-cvd-and-all-cause-mortality-105739", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/04/196273-mediterranean-diet.jpg", "publishedAt": "2023-01-18T14:30:30Z", "content": "This study published in the Nutrients Journal highlights the role of nutritious diet (DASH, Indo-Western and Japanese) against Western-type that can lead to increased levels of oxidative stress and i… [+2409 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Albuminuric diabetic kidney disease may increase risk of Diabetic Foot Ulcer by two to three folds - Medical Dialogues", "description": "France: According to a recent research paper  published in the Journal of Diabetes And its Complications, the researchers  have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/albuminuric-diabetic-kidney-disease-may-increase-risk-of-diabetic-foot-ulcer-by-two-to-three-folds-105691", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/16/198355-diabetic-foot-ulcer.jpg", "publishedAt": "2023-01-18T14:30:25Z", "content": "France: According to a recent research paper published in the Journal of Diabetes And its Complications, the researchers have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic Ki… [+3330 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Inclisiran treatment in high-risk patients provides sustained reductions in LDL-cholesterol: ORION-3 - Medical Dialogues", "description": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/inclisiran-treatment-in-high-risk-patients-provides-sustained-reductions-in-ldl-cholesterol-orion-3-105746", "urlToImage": "https://medicaldialogues.in/h-upload/2021/09/14/160388-ldl-c.jpg", "publishedAt": "2023-01-18T14:30:15Z", "content": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the ORION-3… [+3795 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Amyl Guard Reviews: Ingredients, Customer reviews, Worthy Supplement to Buy or Scam? - Deccan Herald", "description": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same! Are you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredient that will aid you in losing weight without having to make…", "url": "https://www.deccanherald.com/brandspot/pr-spot/amyl-guard-reviews-ingredients-customer-reviews-worthy-supplement-to-buy-or-scam-1182310.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p14-1182310-1674051198.png", "publishedAt": "2023-01-18T14:13:18Z", "content": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same!\r\nAre you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredi… [+28672 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "How To Unlock Your Hip Flexors [Reviewed] Legit DVD Videos or Scam? - Deccan Herald", "description": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our hip is the most powerful and important muscle that connects t…", "url": "https://www.deccanherald.com/brandspot/pr-spot/how-to-unlock-your-hip-flexors-reviewed-legit-dvd-videos-or-scam-1182303.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p12-1182303-1674049612.png", "publishedAt": "2023-01-18T13:46:52Z", "content": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our h… [+29622 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Turmeric milk to herbal tea; try these healthy drinks to stay hydrated in winters - India TV News", "description": "As a result of the cold temperatures, we forget to drink water because our thirst cues are weaker, and we consequently feel dehydrated. Here are 5 winter beverages that will help you stay hydrated.", "url": "https://www.indiatvnews.com/health/turmeric-milk-to-herbal-tea-try-these-healthy-drinks-to-stay-hydrated-in-winters-health-tips-2023-01-18-840347", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/er-1-1674048782.jpg", "publishedAt": "2023-01-18T13:45:07Z", "content": "Winter season concerns include dry and dull skin, but we often overlook the need for proper hydration. We fail to drink enough water in winter due to the low temperatures, and as a result, we get deh… [+2971 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What is The Biggest Risk Factor of Cervical Cancer? An Oncologist Answers | The Quint - The Quint", "description": "Tune in to the latest episode of News and Views to know all about cervical cancer, risk factors, preventive measures, and the HPV vaccine. #cervicalcancer #r...", "url": "https://www.youtube.com/watch?v=xt4-S_Iw_SI", "urlToImage": "https://i.ytimg.com/vi/xt4-S_Iw_SI/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYDyBlKFswDw==&rs=AOn4CLDakPnrWNaT2WGkz1Sw_tK7FMCoEw", "publishedAt": "2023-01-18T13:30:18Z", "content": null}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Ultraviolet light emitting devices leads to cell death, cancer-causing mutations in human - ANI News", "description": "There may be greater public health risks associated with the ultraviolet nail polish drying equipment used to cure gel manicures than previously realised. These ultraviolet (UV) light-emitting devices were studied by researchers at the University of Californi…", "url": "https://www.aninews.in/news/science/ultraviolet-light-emitting-devices-leads-to-cell-death-cancer-causing-mutations-in-human20230118185532", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230118132431.jpg", "publishedAt": "2023-01-18T13:25:00Z", "content": "San Diego (California) [US] January 18 (ANI): There may be greater public health risks associated with the ultraviolet nail polish drying equipment used to cure gel manicures than previously realised… [+6093 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "India to face 'tsunami' of chronic diseases like cancer: US-based oncologist - The New Indian Express", "description": "As per the Globocan estimates, the cancer burden worldwide is expected to be 28.4 million cases in 2040, a 47 per cent rise from 2020, due to demographic changes.", "url": "https://www.newindianexpress.com/nation/2023/jan/18/india-to-face-tsunami-of-chronic-diseases-like-cancer-us-based-oncologist-2539039.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/12/14/w600X390/cancer.jpg", "publishedAt": "2023-01-18T13:22:00Z", "content": "THIRUVANANTHAPURAM: India will face a tsunami of chronic diseases such as cancer due to globalization, growing economy, ageing population and changing lifestyle, warns a leading oncologist, making it… [+9896 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Reducing calories may result in greater weight loss than intermittent fasting - Hindustan Times", "description": "According to recent research 'time-restricted eating patterns' - known as intermittent fasting - are popular, rigorously designed studies have not yet determined whether limiting the total eating window during the day helps to control weight. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/reducing-calories-may-result-in-greater-weight-loss-than-intermittent-fasting-study-reveals-101674044355696.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/istockphoto-1190114524-612x612_1667128302204_1674046040650_1674046040650.jpg", "publishedAt": "2023-01-18T12:52:50Z", "content": "According to a research, the number and quantity of meals were more important predictors of weight gain or reduction than the interval between meals. The findings of the study were published in the J… [+4504 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Simple nasal spray significantly reduces snoring and breathing difficulties in children: Study - TheNewsMill", "description": "A simple nasal spray significantly reduced snoring and breathing difficulties in children and halved the number needing to have their tonsils removed, according to a new study.The research, led by the Murdoch Children's Research Institute and published in JAM…", "url": "https://thenewsmill.com/2023/01/simple-nasal-spray-significantly-reduces-snoring-and-breathing-difficulties-in-children-study/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=65731&object_id=65731&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F01%252Fsimple-nasal-spray-significantly-reduces-snoring-and-breathing-difficulties-in-children-study.jpg", "publishedAt": "2023-01-18T12:31:55Z", "content": "A simple nasal spray significantly reduced snoring and breathing difficulties in children and halved the number needing to have their tonsils removed, according to a new study.The research, led by th… [+3051 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "High BMI could diminish Vitamin D effects: Study - Hindustan Times", "description": "The study, by researchers from Brigham and Women's Hospital, US, is a new analysis of data from the VITAL trial.", "url": "https://www.hindustantimes.com/health/high-bmi-could-diminish-vitamin-d-effects-study-101674042951768.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/125535c6-ba53-11ec-9361-7d60ea16730d_1649763520875_1674043502431_1674043502431.jpg", "publishedAt": "2023-01-18T12:26:51Z", "content": "Scientists have uncovered new evidence that vitamin D may be metabolised differently in people with an elevated body mass index (BMI), diminishing the impact of supplementation in such individuals, a… [+3967 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the impact of maternal hypertension and mental disorders on neonatal outcomes? - News-Medical.Net", "description": "Researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.", "url": "https://www.news-medical.net/news/20230118/What-is-the-impact-of-maternal-hypertension-and-mental-disorders-on-neonatal-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736094_16740431646153003.jpg", "publishedAt": "2023-01-18T12:25:00Z", "content": "In a recent study published in the Journal of Affective Disorders, researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.\r\nStudy: The effect of ma… [+5872 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Potential breakthrough in preventing secondary cancers? | WION Shorts - WION", "description": "Israeli scientists believe they’ve discovered a way to prevent cancerous cells from entering blood and moving around the body causing secondary tumours. The ...", "url": "https://www.youtube.com/watch?v=hkgKPdEIT2A", "urlToImage": "https://i.ytimg.com/vi/hkgKPdEIT2A/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4Ac4FgAKACooCDAgAEAEYZSBWKE0wDw==&rs=AOn4CLDJuSblzXSarUMMVwkV9_ddYSweVA", "publishedAt": "2023-01-18T12:14:17Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Resurge Reviews [2023 Updated] Work For Weight Loss? Read - Deccan Herald", "description": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this. Furthermore the weight loss market is exploding and you will find an abundance of appetit…", "url": "https://www.deccanherald.com/brandspot/pr-spot/resurge-reviews-2023-updated-work-for-weight-loss-read-1182281.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p9-1182281-1674043886.png", "publishedAt": "2023-01-18T12:11:26Z", "content": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this.\r\nFurthermore the weight loss … [+24508 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Dolly Parton CBD Gummies REVIEWS Shark Tank REVEALED SCAM Or Legit? - mid-day.com", "description": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.", "url": "https://www.mid-day.com/brand-media/article/dolly-parton-cbd-gummies-reviews-shark-tank-revealed-scam-or-legit-23266101", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Dolly-Parton-CBD-Gummies1_d.jpg", "publishedAt": "2023-01-18T12:05:00Z", "content": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.\r\nThey are made with all the natural ingredients which are organ… [+7740 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Watch: Researchers suggest effects of resistance training in older adults - Times of India", "description": "A protein response that takes place at the cellular level as a result of ageing includes a balance between oxidants and antioxidants, low-grade inflammation, and is the cause of many medical conditions. Exercise has been found to balance oxidants lik>", "url": "https://timesofindia.indiatimes.com/videos/news/watch-researchers-suggest-effects-of-resistance-training-in-older-adults/videoshow/97090024.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97090024,imgsize-49716.cms", "publishedAt": "2023-01-18T11:00:12Z", "content": "Jan 18, 2023, 04:30PM ISTSource: ANIA protein response that takes place at the cellular level as a result of ageing includes a balance between oxidants and antioxidants, low-grade inflammation, and i… [+587 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Nervogen Pro Reviews Urgent Update Amazon, Walmart - Deccan Herald", "description": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lead to nerve pain and other chronic issues. Neuropathy is comm…", "url": "https://www.deccanherald.com/brandspot/pr-spot/nervogen-pro-reviews-urgent-update-amazon-walmart-1182245.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p6-1182245-1674039509.png", "publishedAt": "2023-01-18T10:58:29Z", "content": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lea… [+28970 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Okinawa Flat Belly Tonic Reviews: Amazon, GNC, Recipe and Official Website - Deccan Herald", "description": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each person is the strength. No matter what your race, color or sex or…", "url": "https://www.deccanherald.com/brandspot/pr-spot/okinawa-flat-belly-tonic-reviews-amazon-gnc-recipe-and-official-website-1182240.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p5-1182240-1674038974.png", "publishedAt": "2023-01-18T10:49:34Z", "content": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each perso… [+33130 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Meditation Alters Gut Microbes In Buddhist Monks For Better Mental Health - ABP Live", "description": "To reach this conclusion, the researchers analysed the stool and blood samples of 37 Tibetan Buddhist monks from three temples and 19 secular residents in the neighbouring areas.", "url": "https://news.abplive.com/lifestyle/meditation-alters-gut-microbes-in-buddhist-monks-for-better-mental-health-1576361", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/18/c1e1a7b773fe45ab852eff36d66fcefa1673981515270556_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-18T10:30:00Z", "content": "Gut microbes found in Buddhist monks have been linked to lower risks of anxiety, depression and even cardio-vascular disease, thus lowering the risk of mental ill-health as they grow older. A study, … [+2163 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "GlucoBerry Reviews: MD/PROCESS Blood Sugar Supplement Work? Urgent Update - Deccan Herald", "description": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by many people as treatments to control their blood sugar level…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucoberry-reviews-md/process-blood-sugar-supplement-work-urgent-update-1182225.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1182225-1674037104.png", "publishedAt": "2023-01-18T10:18:24Z", "content": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by … [+31558 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "ProMind Complex Reviews Urgent Update amazon - Deccan Herald", "description": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of our lives, but they also shape us into who we're present da…", "url": "https://www.deccanherald.com/brandspot/pr-spot/promind-complex-reviews-urgent-update-amazon-1182218.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1182218-1674035897.png", "publishedAt": "2023-01-18T09:57:13Z", "content": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of… [+33361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Here’s why you should switch to millets: Study shows refined flour builds up cholesterol in your heart - The Indian Express", "description": "“Eating refined grains is akin to consuming sugars and oils. This is because the removal of bran and fibres increases the glycemic index of the grains. There should be an effort to reduce the amount of simple carbohydrates from the diet, especially when carbo…", "url": "https://indianexpress.com/article/health-wellness/heres-why-you-should-switch-to-millets-study-shows-refined-flour-builds-up-cholesterol-in-your-heart-8389609/", "urlToImage": "https://images.indianexpress.com/2023/01/millets.jpg", "publishedAt": "2023-01-18T09:14:22Z", "content": "What we have known has now been proved clinically, that refined grains are bad for your heart health. In fact, a study of 2,099 Iranian individuals has shown that consumption of refined grains milled… [+2984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "COVID-19 during pregnancy increases major health risks: Study - ETHealthWorld", "description": "This study provides the most comprehensive evidence to date suggesting that COVID-19 is a threat during pregnancy: Emily R. Smith", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-19-during-pregnancy-increases-major-health-risks-study/97085064", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97085064,imgsize-21168,width-1200,height-628,overlay-ethealthworld/covid-19-during-pregnancy-increases-major-health-risks-study.jpg", "publishedAt": "2023-01-18T08:30:00Z", "content": "Washington: According to new research published in BMJ Global Health, pregnant women infected with the virus that causes COVID-19 have 7 times increased chance of dying and a considerably increased r… [+2956 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Can diabetics and weight-watchers have dates, dried fruits and raisins? - The Indian Express", "description": "Dried fruits contain about two/third carbohydrates, have a low protein content and a high amount of fibre. A moderate intake of raisins and nuts is fine for an active and fit person with or without diabetes, says Dr Anoop Misra, Chairman, Fortis CDOC Hospital…", "url": "https://indianexpress.com/article/lifestyle/health-specials/diabetics-weight-watchers-dates-dried-fruits-and-raisins-8388395/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200.jpg", "publishedAt": "2023-01-18T03:40:47Z", "content": "An Indian patient of mine has been living in Saudi Arabia and gets a check-up done from time to time whenever he is here. This time he asked me, Doc, dates are very popular there. Can I take them? I … [+3616 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/video-desk/", "title": "Health Tips: Add These Foods In Your Kids Diet For Proper Functioning And Growth Of Brain | Watch Video - India.com", "description": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that kids eat meals that are very nourishing and brain-boosting …", "url": "https://www.india.com/video-gallery/health-tips-add-these-foods-in-your-kids-diet-for-proper-functioning-and-growth-of-brain-watch-video-5857925/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/brain_booster_foods_for_kids.jpeg", "publishedAt": "2023-01-18T03:30:05Z", "content": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that… [+828 chars]"}, {"source": {"id": null, "name": "Telesurenglish.net"}, "author": "teleSUR/gsd-MS", "title": "Tuberculosis Vaccine Accelerator Council Initiative - WHO - teleSUR English", "description": "A high-level round table on tuberculosis was held at the World Economic Forum in Davos.", "url": "https://www.telesurenglish.net/news/Tuberculosis-Vaccine-Accelerator-Council-Initiative---WHO-20230117-0020.html", "urlToImage": "https://www.telesurtv.net/__export/1674010836156/sites/telesur/img/2023/01/17/cgmeifangzhang.jpg_1810791533.jpg", "publishedAt": "2023-01-18T03:09:12Z", "content": "World Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus announced Tuesday at the World Economic Forum Davos 2023 a plan to create a new Tuberculosis Vaccine Accelerator Council. \r… [+1828 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US reports 26000 weekly child Covid-19 cases - Daijiworld.com", "description": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and the Children's Hospital Association.\r\nThis is a decrease from …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1040844", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-01-18T02:50:12Z", "content": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and th… [+1025 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Andy Fell", "title": "Circadian clock controls sunflower blooms, optimizing for pollinators - Phys.org", "description": "An internal circadian clock controls the distinctive concentric rings of flowering in sunflowers, maximizing visits from pollinators, shows a new study from plant biologists at the University of California, Davis. The work is published Jan. 13 in eLife.", "url": "https://phys.org/news/2023-01-circadian-clock-sunflower-blooms-optimizing.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/circadian-clock-contro.jpg", "publishedAt": "2023-01-17T21:06:47Z", "content": "An internal circadian clock controls the distinctive concentric rings of flowering in sunflowers, maximizing visits from pollinators, shows a new study from plant biologists at the University of Cali… [+3496 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "5 toxic brain foods to avoid, according to a Harvard nutritionist #Shorts - CNBC Make It", "description": "Did you know that changing your diet could also have an impact on your mood and mental well-being? :leafy_green: Dr. Uma Naidoo suggests avoiding these 5 foo...", "url": "https://www.youtube.com/watch?v=qAtLVJu5qZg", "urlToImage": "https://i.ytimg.com/vi/qAtLVJu5qZg/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYNyAlKH8wDw==&rs=AOn4CLChySLoAM2qW0sTwezYcb4jcpp2Sw", "publishedAt": "2023-01-17T17:00:26Z", "content": null}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Smartphone App Can Significantly Improve Memory Recall - Neuroscience News", "description": "A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer's disease. The app mimics the function of the hippocampus, constructing and maintaining m…", "url": "https://neurosciencenews.com/hippocamera-app-memory-22271/", "urlToImage": "https://neurosciencenews.com/files/2023/01/memory-phone-app-neurosicence.jpg", "publishedAt": "2023-01-17T16:44:21Z", "content": "Summary: A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer’s disease. The app m… [+9304 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Food", "title": "Skin Care: 5 Indian Foods That Are Promote Collagen Production - NDTV Food", "description": "We all love soft and supple skin. Hence, we keep it moisturised and hydrated with creams and serums. While skin products are well promoted across the globe, each of them has at least some amount of chemicals and preservatives. This is why experts suggest, loa…", "url": "https://food.ndtv.com/photos/skin-care-5-indian-foods-that-are-promote-collagen-production-104182", "urlToImage": "https://drop.ndtv.com/albums/COOKS/skin-care-5-ind_638095836894072083/638095836894072083_640x480.jpeg?downsize=120:90", "publishedAt": "2023-01-17T14:57:33Z", "content": null}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "5 common myths related to sugar - Firstpost", "description": "All cells require sugar, but cancer cells even require other nutrients to survive, like amino acids and fats, so it’s not just about sugar.", "url": "https://www.firstpost.com/living/5-common-myths-related-to-sugar-that-you-may-have-heard-of-12002732.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/sugar-export.jpg", "publishedAt": "2023-01-17T13:51:09Z", "content": "Most of us like to eat sugar, whether it is in the form of mithai, chocolate, cookies or even the sugar in your tea. But no matter how much we say we can’t live without our daily dose of sugar, its c… [+2266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some Ayurvedic swaps to help you manage PCOS better - The Indian Express", "description": "\"The Ayurvedic approach to treating PCOS includes dietary changes like consuming a balanced and nourishing diet, increasing the intake of bitter and astringent vegetables and more,\" said r Yogini Patil, BAMS and nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/ayurvedic-swaps-to-help-manage-pcos-better-8168682/", "urlToImage": "https://images.indianexpress.com/2022/09/PCOS-1.jpg", "publishedAt": "2023-01-17T13:30:37Z", "content": "Polycystic ovarian syndrome (PCOS) is a hormonal (endocrine) disorder that can lead to irregular periods, excess body hair, skin issues, weight gain, and also anxiety. As such, it is essential to kee… [+3590 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Thyroid Awareness Month | What Every Woman Should Know About Thyroid Disorders - SHOWSHA", "description": "Do you know women are more prone to thyroid issues and can suffer from it irrespective of their age? That’s why, in this thyroid awareness month, it’s import...", "url": "https://www.youtube.com/watch?v=HwblTcwlPds", "urlToImage": "https://i.ytimg.com/vi/HwblTcwlPds/maxresdefault.jpg", "publishedAt": "2023-01-17T13:30:05Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Quietum Plus Reviews: Amazon, Tinnitus, Consumer Reports, Ingredients - Deccan Herald", "description": "Quietum Plus: Your search stops hear! Hearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern life it's obvious that this problem isn't reserved for the elde…", "url": "https://www.deccanherald.com/brandspot/pr-spot/quietum-plus-reviews-amazon-tinnitus-consumer-reports-ingredients-1181979.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181979-1673958573.png", "publishedAt": "2023-01-17T12:29:33Z", "content": "Quietum Plus: Your search stops hear!\r\nHearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern li… [+31006 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers use MRI data to predict brain tumor progression - ANI News", "description": "Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.", "url": "https://www.aninews.in/news/science/researchers-use-mri-data-to-predict-brain-tumor-progression20230117172550", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230117075802.jpg", "publishedAt": "2023-01-17T11:55:00Z", "content": "Washington [US], January 17 (ANI): Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.Glioblastoma multiforme (… [+2216 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "What Is Mediterranean Diet? 5 Effective Benefits For Weight Loss And Healthy Body - Jagran English", "description": "", "url": "https://english.jagran.com/lifestyle/what-is-mediterranean-diet-5-effective-benefits-for-weight-loss-and-healthy-body-10061394", "urlToImage": "https://imgeng.jagran.com/images/2023/jan/Mediterraneandiet1673925326074.jpg", "publishedAt": "2023-01-17T03:10:44Z", "content": "WE ALL tend to lose those extra kilos accumulated around our abdomen and other parts of the body. In order to lose significant weight, major people try numerous exercises, weight loss diet plans and … [+3225 chars]"}]}