{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Cancer: 8 silent signs that should not be ignored - Times of India", "description": "Cancer is a chronic disease that can affect different parts of the body. It occurs when cells in the body start to divide and grow uncontrollably, destroying healthy tissues and leading to a wide array of symptoms.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/cancer-8-silent-signs-that-should-not-be-ignored/photostory/97500531.cms", "urlToImage": "https://static.toiimg.com/photo/97500554.cms", "publishedAt": "2023-02-01T05:30:00Z", "content": "Cancer is a chronic disease that can affect different parts of the body. It occurs when cells in the body start to divide and grow uncontrollably, destroying healthy tissues and leading to a wide arr… [+720 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Make Nutritious Millets Bhakri Using These Kitchen Secrets - Nutritionist Shares - NDTV Food", "description": "Millet has a rich nutrient profile and is considered great to include in your healthy diet regime. Rujuta Diwekar shares some quick tips to make millet rotis at home.", "url": "https://food.ndtv.com/food-drinks/try-nutritionist-approved-kitchen-secrets-to-include-millets-in-your-diet-3740153", "urlToImage": "https://c.ndtvimg.com/2023-02/g7pkcus_roti_625x300_01_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-02-01T05:13:21Z", "content": "When we kick off our fitness journey, a lot of things get changed, which includes our eating habits. We have to quit eating the scrumptious samosas, ditch the sugary drinks, and reluctantly give up l… [+3117 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Know how eating high fat and high calorie foods can rewire your brain to eat for pleasure, cause obesity - The Indian Express", "description": "Researchers from Penn State College of Medicine, US, found that after being continuously fed a high fat/high calorie diet, the brain adapts to what is being ingested and forgets to balance calorie intake. The study proves junk foods are endocrine disruptors, …", "url": "https://indianexpress.com/article/health-wellness/eating-high-fat-high-calorie-foods-rewire-your-brain-obesity-8416486/", "urlToImage": "https://images.indianexpress.com/2023/02/obesity_200_getty.jpg", "publishedAt": "2023-02-01T03:40:30Z", "content": "Next time you pop that biscuit absent-mindedly or reach out for the packet of chips out of habit while hammering away at your keyboard, know that you are not only loading up on calories, you are also… [+4801 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Best Ayurvedic home remedies to make your vision stronger - Times of India", "description": "​Here are some crucial ayurvedic solutions to enhance your vision.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/wellness/best-ayurvedic-home-remedies-to-make-your-vision-stronger/photostory/97502580.cms", "urlToImage": "https://static.toiimg.com/photo/97502643.cms", "publishedAt": "2023-02-01T03:30:00Z", "content": "“Regularly, twice a day, wash your eyes with Triphala water. Triphala eyewash is incredibly effective at treating eye conditions and preserving eyesight. Dry eyes, computer vision syndrome, cataracts… [+747 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Breast MRI found to be superior at detecting breast cancer in women with dense breasts - News-Medical.Net", "description": "Compared to other common supplemental screening methods, breast MRI was superior at detecting breast cancer in women with dense breasts, according to a study published in Radiology, a journal of the Radiological Society of North America.", "url": "https://www.news-medical.net/news/20230131/Breast-MRI-found-to-be-superior-at-detecting-breast-cancer-in-women-with-dense-breasts.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-02-01T03:20:00Z", "content": "Compared to other common supplemental screening methods, breast MRI was superior at detecting breast cancer in women with dense breasts, according to a study published in Radiology, a journal of the … [+4301 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Ramya Vennapusala", "title": "Diving deep into the depth of HPV - The New Indian Express", "description": "CE speaks to doctors about the importance and need of HPV vaccine and its benefits in fighting cervical cancer", "url": "https://www.newindianexpress.com/cities/hyderabad/2023/feb/01/diving-deep-into-the-depth-of-hpv-2543110.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2023/2/1/w600X390/cancer_ribbon.jpg", "publishedAt": "2023-02-01T03:10:00Z", "content": "HYDERABAD: Cervical cancer is the fourth most common cancer among women globally, and second in India. Around 12,7000 are affected by cervical cancer out of which 67,000 people die annually in India.… [+7332 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "‘Awareness, prevention key to fighting cancer’ - Times of India", "description": "In India where around nine lakh people die every day due to cancer, experts ahead of the World Cancer Day (on Saturday) said there is a need to increa", "url": "https://timesofindia.indiatimes.com/city/mumbai/awareness-prevention-key-to-fighting-cancer/articleshow/97508503.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97511294,width-1070,height-580,imgsize-15590,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-02-01T02:43:00Z", "content": ""}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "7 Simple Tips To Keep Workplace Stress At Bay - News18", "description": "A healthy and cheerful mind is necessary at the office if you want to stay focused and relaxed throughout the day", "url": "https://www.news18.com/news/lifestyle/7-simple-tips-to-keep-workplace-stress-at-bay-6958111.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-86-167518197216x9.png", "publishedAt": "2023-02-01T02:30:36Z", "content": "Are you under a lot of stress at work? The deadline, work pressure, and many other factors at your place of work could be stressful. Due to stress, your performance and health may get impacted. It ca… [+2979 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Menstrual symptoms hurt workplace productivity of many women, UVA health study finds - EurekAlert", "description": "Menstrual symptoms reduce the workplace productivity of many American women, with 45.2% reporting that their symptoms require them to take days off, according to a new UVA Health survey. The study also found that digital health apps can help women better mana…", "url": "https://www.eurekalert.org/news-releases/978225", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/24b9d0b3-2bf9-47f9-b5f5-13800d9fe51f/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-01T02:01:39Z", "content": "image: UVA Health's Jennifer L. Payne, MD, led a study that found menstrual symptoms reduce the workplace productivity of many American women, with 45.2% reporting that their symptoms require them to… [+3918 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Vrinda Mundara", "title": "Three healthy superfoods you must consume during winters - Asianet Newsable ", "description": "Add these three healthy and energy-boosting foods to your winter diet that looks as good as you are.", "url": "https://newsable.asianetnews.com/gallery/lifestyle/three-healthy-superfoods-you-must-consume-during-winters-vma-rpcvn8", "urlToImage": "https://static-ai.asianetnews.com/images/01gr45xmhe706rrwsawb3rzxvs/whatsapp-image-2023-01-31-at-19-48-20_1200x630xt.jpg", "publishedAt": "2023-02-01T02:00:36Z", "content": "Add these three healthy and energy-boosting foods to your winter diet that looks as good as you are.\r\nImage: Getty Images, Freepik\r\nWinter has its effects on beauty and fashion. We revamp our wardrob… [+1758 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers develop new way to increase the potency of cancer vaccines - News-Medical.Net", "description": "A new way to significantly increase the potency of almost any vaccine has been developed by researchers from the International Institute for Nanotechnology (IIN) at Northwestern University.", "url": "https://www.news-medical.net/news/20230131/Researchers-develop-new-way-to-increase-the-potency-of-cancer-vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-02-01T01:24:00Z", "content": "A new way to significantly increase the potency of almost any vaccine has been developed by researchers from the International Institute for Nanotechnology (IIN) at Northwestern University. The scien… [+8857 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New technique offers a two-prong approach to attacking cancers - News-Medical.Net", "description": "When noninvasive sound waves break apart tumors, they trigger an immune response in mice. By breaking down the cell wall \"cloak,\" the treatment exposes cancer cell markers that had previously been hidden from the body's defenses, researchers at the University…", "url": "https://www.news-medical.net/news/20230131/New-technique-offers-a-two-prong-approach-to-attacking-cancers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-02-01T01:17:00Z", "content": "When noninvasive sound waves break apart tumors, they trigger an immune response in mice. By breaking down the cell wall \"cloak,\" the treatment exposes cancer cell markers that had previously been hi… [+3350 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Cancer immunotherapy does not interfere with COVID-19 immunity in vaccinated patients, study shows - News-Medical.Net", "description": "Research findings published in Frontiers in Immunology show that cancer immunotherapy does not interfere with COVID-19 immunity in previously vaccinated patients.", "url": "https://www.news-medical.net/news/20230131/Cancer-immunotherapy-does-not-interfere-with-COVID-19-immunity-in-vaccinated-patients-study-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-02-01T01:11:00Z", "content": "Research findings published in Frontiers in Immunology show that cancer immunotherapy does not interfere with COVID-19 immunity in previously vaccinated patients. These findings support recommending … [+2670 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Gabby Landsverk", "title": "People who suffer 3 or more concussions in a lifetime are at risk of serious brain damage, study finds - Business Insider India", "description": "New research suggests recurring, mild head injuries can stack up to serious neurological issues. Three concussions seems to be a turning point for brain issues,", "url": "https://www.businessinsider.in/science/health/news/people-who-suffer-3-or-more-concussions-in-a-lifetime-are-at-risk-of-serious-brain-damage-study-finds/articleshow/97506947.cms", "urlToImage": "https://www.businessinsider.in/photo/97506947/people-who-suffer-3-or-more-concussions-in-a-lifetime-are-at-risk-of-serious-brain-damage-study-finds.jpg?imgsize=66542", "publishedAt": "2023-01-31T23:30:00Z", "content": "Head injuries are a major risk factor for brain problems later in life, and even minor damage may stack up over time, new research suggests.\r\nJust one moderate-to-severe concussion, or multiple milde… [+2466 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "Cervical Cancer: Stages, Symptoms, Causes, Prevention and Treatment - Rising Kashmir", "description": "DR.SUMAN LAL\n&nbsp;\nCervical cancer is a form of a life-threatening cancer which starts in the cells of the cervix. The cervix is referred to as the entrance to the uterus (or the womb). Most cervical cancer cases are caused due to infection from high-risk hu…", "url": "http://risingkashmir.com/cervical-cancer-stages-symptoms-causes-prevention-and-treatment-253ea299-b105-4eec-a00b-5fdbada8e418", "urlToImage": "http://admin.risingkashmir.com/Source/News/e4406efe-d058-44b3-ab22-7111add58ba9.jpg", "publishedAt": "2023-01-31T22:18:02Z", "content": "DR.SUMAN LAL\r\nCervical cancer is a form of a life-threatening cancer which starts in the cells of the cervix. The cervix is referred to as the entrance to the uterus (or the womb). Most cervical canc… [+4004 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Moderate and Intense Physical Activity Favors Good Sleep - Neuroscience News", "description": "Physical activity improves sleep quality, especially for women, a new study reports.", "url": "https://neurosciencenews.com/exercise-sleep-22414/", "urlToImage": "https://neurosciencenews.com/files/2023/01/sleep-exercise-neurosicences-public.jpg", "publishedAt": "2023-01-31T22:15:36Z", "content": "Summary: Physical activity improves sleep quality, especially for women, a new study reports.\r\nSource: Japan Advanced Institute of Science and Technology\r\nAn adequate amount of good-quality sleep is … [+5726 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Bizz Buzz", "title": "Only 7 symptoms directly related to long Covid: Study - Bizz Buzz", "description": "These health symptoms are fast-beating heart, hair loss, fatigue, chest pain, shortness of breath, joint pain and obesity", "url": "https://www.bizzbuzz.news/industry/pharma/only-7-symptoms-directly-related-to-long-covid-study-1194810", "urlToImage": "https://www.bizzbuzz.news/h-upload/2023/01/31/1651906-covid19.jpg", "publishedAt": "2023-01-31T22:09:48Z", "content": "New York: Long Covid patients are susceptible to developing only seven health symptoms for up to a year following the infection, a new study has revealed. These seven symptoms are fast-beating heart,… [+1546 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Study finds link between depression and risk of heart disease in young adults - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "WASHINGTON, Jan 31: Young adults who feel down or depressed are more likely to develop cardiovascular disease (CVD) and have poor heart health, according to a new study. The study also found that young adults who self-reported feeling depressed or having poor…", "url": "https://www.dailyexcelsior.com/study-finds-link-between-depression-and-risk-of-heart-disease-in-young-adults/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2023/01/depression.jpg", "publishedAt": "2023-01-31T21:33:05Z", "content": "WASHINGTON, Jan 31:\r\nYoung adults who feel down or depressed are more likely to develop cardiovascular disease (CVD) and have poor heart health, according to a new study.The study also found that you… [+3447 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Nina Cosdon", "title": "Marburg Virus Investigational Vaccine Safe and Immunogenic in Humans - Contagionlive.com", "description": "This first-in-human, phase 1 vaccine trial produced a lasting immune response against Marburg virus.", "url": "https://www.contagionlive.com/view/marburg-virus-investigational-vaccine-safe-and-immunogenic-in-humans", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/ce5b7daad67d2b2c246ad5d1a4576e5837e92296-3840x2160.jpg?fit=crop&auto=format", "publishedAt": "2023-01-31T21:32:55Z", "content": "Marburg virus poses an imminent threat requiring rapid vaccine research and development. This was exacerbated by the recent emergence of Marburg in Ghana.\r\nMarburg virus (MARV) is a filovirus in the … [+3087 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New vaccine targets life-threatening fungal infections, a growing health concern: Fungal infections cause 1.5M+ deaths each year, and there's no vaccine to prevent them - Science Daily", "description": "A new vaccine could be the first clinically approved immunization to protect against invasive fungal infections, a growing concern as antifungal drug resistance increases. Fungal infections cause more than 1.5 million deaths worldwide each year and cost billi…", "url": "https://www.sciencedaily.com/releases/2023/01/230131124430.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-31T21:32:44Z", "content": "A new vaccine from the University of Georgia could be the first clinically approved immunization to protect against invasive fungal infections, a growing concern as antifungal drug resistance increas… [+3834 chars]"}, {"source": {"id": null, "name": "Patientcareonline.com"}, "author": "Grace Halsey", "title": "Air Pollution Independently Linked to Asthma Exacerbation in Urban-dwelling Children - Patient Care Online", "description": "Asthma exacerbations in children living in low-income urban areas were significantly associated with reduced air quality and specific pollutants in a new analysis.", "url": "https://www.patientcareonline.com/view/air-pollution-independently-linked-to-asthma-exacerbation-in-urban-dwelling-children", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/patientcare/ba9bfe73ed06239d3147924dac25dddde0929770-803x534.jpg?fit=crop&auto=format", "publishedAt": "2023-01-31T20:11:52Z", "content": "In low-income urban areas, decreases in air quality related to specific pollutants were significantly associated with nonviral exacerbations of asthma in children, a finding that led a team of invest… [+3680 chars]"}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "PhenQ Reviews 2023: Legit Fat Burner Supplements or Diet Pills Scam? - The Times of Israel", "description": "Want to get rid of that stubborn fat? Get your hands on the best weight loss pill, PhenQ, and put your worries to rest!", "url": "https://www.timesofisrael.com/spotlight/phenq-reviews/", "urlToImage": "https://static.timesofisrael.com/www/images/toi_icon_fb_1200.png", "publishedAt": "2023-01-31T19:56:38Z", "content": "After the pandemic hit, it became disastrous to many people’s physical and mental health, and the number of them struggling with weight gain has grown tremendously. The good news is you aren’t the on… [+19720 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Healthy lifestyle can cut CVD risk in patients with FH - Healio", "description": "A healthy lifestyle was associated with reduced risk for CVD among adults with familial hypercholesterolemia regardless of their familial hypercholesterolemia mutation status, researchers reported.&ldquo;DNA is not destiny; it is not deterministic for familia…", "url": "https://www.healio.com/news/cardiology/20230131/healthy-lifestyle-can-cut-cvd-risk-in-patients-with-fh", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/cardiology/h/hypercholesterolemia_adobestock.jpg", "publishedAt": "2023-01-31T19:26:19Z", "content": "Source/Disclosures\r\n Disclosures: \r\nThe study authors report no relevant financial disclosures. Santos reports receiving consultant, research and speaking fees from Abbott, Ache, Amgen, Amryt, AstraZ… [+3712 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of North Carolina School of Medicine", "title": "Scientists Document Two Separate Reservoirs of Latent HIV in Patients - Newswise", "description": "UNC-Chapel Hill scientists and colleagues provide indirect evidence for the existence of a distinct latent reservoir of CD4+ T cells in the central nervous syst", "url": "https://www.newswise.com/articles/scientists-document-two-separate-reservoirs-of-latent-hiv-in-patients", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2023/01/31/63d946711348f_swanstromTree.jpg&width=600&height=600", "publishedAt": "2023-01-31T17:05:00Z", "content": "Newswise — CHAPEL HILL, NC – When people living with HIV take antiviral therapy (ART), their viral loads are driven so low that a standard blood test cannot detect the virus. However, once ART is sto… [+4207 chars]"}, {"source": {"id": null, "name": "New Food"}, "author": null, "title": "Research shows impact of 'hyper-palatable' foods across four diets - New Food", "description": "The new findings from the University of Kansas may provide clearer guidance about the hyper-palatable food you put on your plate.", "url": "https://www.newfoodmagazine.com/news/189329/research-shows-impact-of-hyper-palatable-foods-across-four-diets/", "urlToImage": "https://www.newfoodmagazine.com/wp-content/uploads/snacks-4.jpg", "publishedAt": "2023-01-31T16:26:43Z", "content": "Posted: 31 January 2023 | Ria Kakkad (New Food) | No comments yet\r\nThe new findings may provide clearer guidance about the hyper-palatable food you put on your plate.\r\nFirst described by Associate Pr… [+2725 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "A new biomaterial injected intravenously reduces inflammation and heals cells and tissues - ETHealthWorld", "description": "The team wanted to develop a treatment that could be administered immediately after a heart attack. This meant developing a biomaterial that could be infused into a blood vessel in the heart at the same time as other treatments such as angioplasty or a stent,…", "url": "https://health.economictimes.indiatimes.com/news/industry/a-new-biomaterial-injected-intravenously-reduces-inflammation-and-heals-cells-and-tissues/97499903", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97499903,imgsize-2604,width-1200,height-628,overlay-ethealthworld/a-new-biomaterial-injected-intravenously-reduces-inflammation-and-heals-cells-and-tissues.jpg", "publishedAt": "2023-01-31T15:37:00Z", "content": "Los Angeles: Scientists have developed a new biomaterial that can be injected intravenously, reduces inflammation in tissue and that could be used to repair the damage to cardiac tissue resulting fro… [+4012 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruby Khanna", "title": "Menopause Weight Gain: Why It Happens, and What to Do? - Sportskeeda", "description": "Menopause weight gain is a very common concern among women. It can happen due to certain reasons, including changes in hormones, aging, genetics, and lifestyle.", "url": "https://www.sportskeeda.com/health-and-fitness/menopause-weight-gain-why-it-happens-what-do", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/17bd9-16751772318357-1920.jpg", "publishedAt": "2023-01-31T15:25:51Z", "content": "Menopause weight gain is a very common concern among women. It can happen due to certain reasons, including changes in hormones, aging, genetics, and lifestyle.\r\nHormonal changes in the menopause, in… [+4526 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brain: 5 Foods To Eat & 5 Foods To Avoid For Good Brain Health - NDTV", "description": "In this article, we share our list of the best and worst foods for brain health.", "url": "https://www.ndtv.com/health/brain-5-foods-to-eat-5-foods-to-avoid-for-good-brain-health-3740610", "urlToImage": "https://c.ndtvimg.com/2022-06/10vn8akg_brain-foods_650x400_14_June_22.jpg", "publishedAt": "2023-01-31T15:04:32Z", "content": "Certain foods can help boost the health of our brain\r\nOne of the most significant organs in your body is your brain. It maintains all of your body's processes running smoothly, including your heart p… [+4645 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Miriam E. Tucker, for Medscape", "title": "GLP-1 Agonists Protected Kidneys in T2D With Advanced DKD - Medscape", "description": "Among adults with type 2 diabetes and an eGFR < 30 mL/min/1.73m2, treatment with a GLP-1 agonist was associated with better renal preservation and survival compared with a DPP-4 inhibitor.", "url": "https://www.medscape.com/viewarticle/987702", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230125_kidney_disease_800x450.jpg", "publishedAt": "2023-01-31T15:04:05Z", "content": "Researchers published the study covered in this summary on Research Square as a preprint that has not yet been peer reviewed.<li>During a mean follow-up of 2.1 years, the rate of the composite cardio… [+1570 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/morgan-chamberlain", "title": "6 Multi Non-Negotiables + Red Flags, From An Integrative MD - mindbodygreen", "description": "Watch out for these multivitamin red flags!", "url": "https://www.mindbodygreen.com/articles/amy-shah-ultimate-multivitamin-review", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/o9gus9fjnl3ylpy1a.png", "publishedAt": "2023-01-31T13:36:40Z", "content": "For all these reasons and more, Shah recommends mindbodygreens ultimate multivitamin+.* Im really critical when it comes to multivitamins, so I really scrutinized this label before recommending it to… [+282 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Oxandrolone Cycle - Oxandrolone Online - Oxandrolon - Deccan Herald", "description": "This Anavar Oxandrolone review provides a step-by step detail of my experiences using the anabolic steroids. So, you could anticipate some crucial and relevant information from this Anavar Oxandrolone review that is important to you. In the end that if you're…", "url": "https://www.deccanherald.com/brandspot/pr-spot/oxandrolone-cycle-oxandrolone-online-oxandrolon-1186397.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186397-1675170719.png", "publishedAt": "2023-01-31T13:11:59Z", "content": "This Anavar Oxandrolone review provides a step-by step detail of my experiences using the anabolic steroids. So, you could anticipate some crucial and relevant information from this Anavar Oxandrolon… [+19729 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Cleanest Body Reviews 2023 Updated – Is It Legit or Cheap Ingredients? - Deccan Herald", "description": "Water is vital for the human body, so it's not surprising that many people are worried regarding the purity of their drinking water. What are you going to do to realize that you're more likely to become obese since your tap water is contaminated with mutated …", "url": "https://www.deccanherald.com/brandspot/pr-spot/cleanest-body-reviews-2023-updated-is-it-legit-or-cheap-ingredients-1186388.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186388-1675169750.png", "publishedAt": "2023-01-31T12:55:50Z", "content": "Water is vital for the human body, so it's not surprising that many people are worried regarding the purity of their drinking water. What are you going to do to realize that you're more likely to bec… [+28958 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Purvi Kalra", "title": "Avoid giving these milk combinations to your kids for their health’s sake - Health shots", "description": "Your child’s gut is sensitive. Avoid giving your child these unhealthy milk combinations for your child's good gut health!", "url": "https://www.healthshots.com/mom-says/avoid-giving-these-milk-combinations-to-your-kids-for-their-healths-sake/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2021/11/11212048/milk.jpg", "publishedAt": "2023-01-31T12:52:46Z", "content": "Our children are always notorious and try to keep away from healthy food in order to dive into processed foods. As mothers, we want nothing but the good health of our children, and we try our best to… [+2891 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keto Excel Gummies Australia [Chemist Warehouse] Chrissie Swan Keto Gummies | ViaKeto Gummies NZ, EXPOESD Is It Worth The Money? - The Tribune India", "description": "Keto Diet has become a trendy way to lose weight. People all over the world are gravitating toward this weight-loss method. Everyone needs a short route to cut down fat and have a slim and fit body. Ketosis forces the body to use fats as the source of energy …", "url": "https://www.tribuneindia.com/news/brand-connect/keto-excel-gummies-australia-chemist-warehouse-chrissie-swan-keto-gummies-viaketo-gummies-nz-expoesd-is-it-worth-the-money-475358", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_326226076.jpg", "publishedAt": "2023-01-31T12:32:00Z", "content": "Keto Diet has become a trendy way to lose weight. People all over the world are gravitating toward this weight-loss method. Everyone needs a short route to cut down fat and have a slim and fit body. … [+12931 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Isabel Shaw", "title": "How healthy are you? Simple test helps estimate when you’ll die... - The US Sun", "description": "EVER think you’d live your life differently if you knew how long you had left? Or perhaps you’d shake off some of your unhealthy habits if you knew they were shortening your life. Now, …", "url": "https://www.the-sun.com/health/7268322/test-shows-die-lifespan/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2023/01/NINTCHDBPICT000735820372.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-01-31T11:11:58Z", "content": "EVER think you'd live your life differently if you knew how long you had left?\r\nOr perhaps you'd shake off some of your unhealthy habits if you knew they were shortening your life.\r\nThe calculator ca… [+4004 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "SLMR Weight Loss Supplement - Deccan Herald", "description": "Are you fed up by seeing identical figures in the same place on the bar? It's not just you. A lot of people are struggling with weight loss. It's a long, difficult process and can sometimes yield no result. You're doing everything correctly however, the scale…", "url": "https://www.deccanherald.com/brandspot/pr-spot/slmr-weight-loss-supplement-1186362.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186362-1675163456.png", "publishedAt": "2023-01-31T11:10:56Z", "content": "Are you fed up by seeing identical figures in the same place on the bar? It's not just you. A lot of people are struggling with weight loss. It's a long, difficult process and can sometimes yield no … [+34202 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Agnihotri", "title": "Power up your snacks: 9 simple ways to add more protein in your snacks - Hindustan Times", "description": "From protein-rich cheela to dal salad, satisfy your cravings with these protein-packed snack ideas.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/power-up-your-snacks-9-simple-ways-to-add-more-protein-in-your-snacks-101675160692538.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/31/1600x900/pexels-cottonbro-studio-4873699_1675162934316_1675162947642_1675162947642.jpg", "publishedAt": "2023-01-31T11:10:15Z", "content": "Protein is an essential macronutrient that plays a vital role in maintaining a healthy and balanced diet. Whether you are looking to build muscle, lose weight, or simply fuel your body throughout the… [+4122 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Yash Lakhan", "title": "Make Your Own Vegan Buttermilk At Home! - Slurrp", "description": "For vegan buttermilk, use freshly squeezed lemon juice or vinegar. Your buttermilk can have a distinctive tangy flavour, which will be provided by distilled white vinegar and apple cider vinegar. Balsamic, sherry, white, and red wine kinds of vinegar should n…", "url": "https://www.slurrp.com/article/make-your-own-vegan-buttermilk-at-home-1675162025667", "urlToImage": "https://images.slurrp.com/prodarticles/qa0db5jus4i.webp", "publishedAt": "2023-01-31T10:52:57Z", "content": "Buttermilk, which is typically a byproduct of producing butter, can be turned vegan by using a nut or plant-based milk alternative. Discover how to use almond milk and lemon juice to create a homemad… [+1589 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "What are the different heart-related tests to check its health? - Firstpost", "description": "An ECG refers to a quick and painless test which records the electrical signals in your heart. It tells us if the heart is beating too fast or too slowly.", "url": "https://www.firstpost.com/living/ecg-echocardiogram-and-more-5-heart-related-tests-to-check-its-health-12076292.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/01/jnjkbhjvgc-23.jpg", "publishedAt": "2023-01-31T10:43:21Z", "content": "Prevention is always better than cure or medical intervention, especially when it comes to the health of the heart. Stressful life along with the lifestyle factors surely takes a toll on the heart he… [+2092 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Sports-related sudden cardiac arrest rare in older adults: Research - Times of India", "description": "A recent study has claimed that sports-related sudden cardiac arrest in older individuals occurs in just 2 to 3 incidents per 1,00,000 people annually. The research was published in the peer-reviewed journal JACC: Clinical Electrophysiology. 77 (1.9 >", "url": "https://timesofindia.indiatimes.com/videos/news/sports-related-sudden-cardiac-arrest-rare-in-older-adults-research/videoshow/97489914.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-97489914,imgsize-1191900.cms", "publishedAt": "2023-01-31T10:41:27Z", "content": "Jan 31, 2023, 04:11PM ISTSource: ANIA recent study has claimed that sports-related sudden cardiac arrest in older individuals occurs in just 2 to 3 incidents per 1,00,000 people annually. The researc… [+2677 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Are you doing your best to stay protected from common flu? - Daijiworld.com", "description": "By IANSlife\r\nNew Delhi, Jan 31 (IANSlife): With every other person in the city complaining of flu and cold, masking up may be the best thing you can do not just for yourself but others around you. By continuing the usage of masks if you feel any flu like symp…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1045416", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/arun_310123_flu.jpg", "publishedAt": "2023-01-31T10:37:41Z", "content": "By IANSlife\r\nNew Delhi, Jan 31 (IANSlife): With every other person in the city complaining of flu and cold, masking up may be the best thing you can do not just for yourself but others around you. By… [+3373 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Semi-living \"Cyborg\" Cells Made By Scientists Could Revolutionize Medicine - The Hans India", "description": "Researchers have created adaptable, synthetic \"cyborg\" cells via a challenging chemical...", "url": "https://www.thehansindia.com/tech/semi-living-cyborg-cells-made-by-scientists-could-revolutionize-medicine-780198", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/01/31/1332775-sev.jpg", "publishedAt": "2023-01-31T10:30:28Z", "content": "Researchers have created adaptable, synthetic \"cyborg\" cells via a challenging chemical technique. While they lack the capacity to divide and expand, they yet resemble live cells in many ways. The no… [+1708 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "What You Should Know About the Diphtheria Outbreak in Nigeria - AllAfrica - Top Africa News", "description": "An outbreak of diphtheria, a serious disease that is especially harmful to children, has been confirmed in Nigeria. But what is diphtheria, and what leads to its spread, asks Motunrayo Joel from Africa Check.\n\n\r \n\nDiphtheria is a highly contagious infection t…", "url": "https://allafrica.com/view/group/main/main/id/00084707.html", "urlToImage": "https://cdn05.allafrica.com/download/pic/main/main/csiid/00621070:9afcafb1bee51012dfdcc6f6c0bd4e80:arc614x376:w1200.jpg", "publishedAt": "2023-01-31T10:16:51Z", "content": "An outbreak of diphtheria, a serious disease that is especially harmful to children, has been confirmed in Nigeria. But what is diphtheria, and what leads to its spread, asks Motunrayo Joel from Afri… [+1019 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Supervised exercise may prevent diabetes over ten years: JAMA - Medical Dialogues", "description": "China: Supervised vigorous and moderate exercise may prevent type 2 diabetes in individuals at high risk with nonalcoholic fatty liver disease and central obesity, a recent study has shown. The...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/supervised-exercise-may-prevent-diabetes-over-ten-years-jama-106377", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/09/125349-walk-for-exercise.jpg", "publishedAt": "2023-01-31T09:57:33Z", "content": "China: Supervised vigorous and moderate exercise may prevent type 2 diabetes in individuals at high risk with nonalcoholic fatty liver disease and central obesity, a recent studyhas shown. The findin… [+3695 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Does Provitalize Work - Reviews of Provitalize - Provitalize Scam - Deccan Herald", "description": "Reduce weight by taking Provitalize, or it's what they claim. We heard about the probiotic which has turned into a weight-loss supplement researchers from our team were eager to know what this brand new product was about. For more information about the ingred…", "url": "https://www.deccanherald.com/brandspot/pr-spot/does-provitalize-work-reviews-of-provitalize-provitalize-scam-1186312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1186312-1675156728.png", "publishedAt": "2023-01-31T09:18:48Z", "content": "Reduce weight by taking Provitalize, or it's what they claim. We heard about the probiotic which has turned into a weight-loss supplement researchers from our team were eager to know what this brand … [+24345 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Study finds preventive, therapeutic measures for optic nerve hypoplasia in newborns - News9 LIVE", "description": "The disorder arises when the optic nerves that convey information from the retina to the brain are undeveloped at birth", "url": "https://www.news9live.com/health/study-finds-preventive-therapeutic-measures-for-optic-nerve-hypoplasia-in-newborns-au2070-2041272", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/01/Eye.jpg", "publishedAt": "2023-01-31T08:20:47Z", "content": "The disorder arises when the optic nerves that convey information from the retina to the brain are undeveloped at birth\r\n<ul><li>According to the NIH, and while exact figures are unclear, the disease… [+2038 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Parkinson's Disease: Here Are 9 Early Signs To Look Out For - NDTV", "description": "Continue reading as we discuss some common symptoms of Parkinson's disease and signs that might go unnoticed.", "url": "https://www.ndtv.com/health/parkinsons-disease-here-are-9-early-signs-to-look-out-for-3738887", "urlToImage": "https://i.ndtvimg.com/i/2016-04/parkinsons-generic_650x400_51461654109.jpg", "publishedAt": "2023-01-31T08:17:28Z", "content": "Parkinson's disease can be diagnosed by looking out for the early signs\r\nParkinson's disease is a chronic condition that affects both the neurological system and the bodily components that are under … [+4406 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Leeds-led research finds arthritis sufferers are 20% less likely to be in work - India Education Diary", "description": "The typical person living with arthritis in the UK is 20% less likely to be in work than their equivalent without the condition, new research shows.And the most striking finding was that non-university educated women aged 60-plus are at least 37% les", "url": "https://indiaeducationdiary.in/university-of-leeds-led-research-finds-arthritis-sufferers-are-20-less-likely-to-be-in-work/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/image-1-6.jpg?fit=800%2C400&ssl=1", "publishedAt": "2023-01-31T08:11:29Z", "content": "The typical person living with arthritis in the UK is 20% less likely to be in work than their equivalent without the condition, new research shows.\r\nAnd the most striking finding was that non-univer… [+8473 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight", "title": "ZS PRIZE jury member Prof. K. Srinath Reddy on improving the healthcare framework in India - Economic Times", "description": "ZS PRIZE jury member Prof. K. Srinath Reddy, who is the President of Public Health Foundation of India, shares his views on some of the biggest healthcare challenges faced by India today and decodes what is needed at the public administration and policy level…", "url": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/zs-prize-jury-member-prof-k-srinath-reddy-on-improving-the-healthcare-framework-in-india/videoshow/97483118.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97483118,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-31T07:49:00Z", "content": "ZS PRIZE jury member Prof. K. Srinath Reddy, who is the President of Public Health Foundation of India, shares his views on some of the biggest healthcare challenges faced by India today and decodes … [+425 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers suggest pharmacologic treatments for managing tooth extraction pain - ANI News", "description": "The current clinical practice guidelines lack evidence-based guidance on the effective management of acute dental pain. The National Academies' report entitled \"Framing Opioid Prescribing Guidelines for Acute Pain\", highlighted the need to formalize evidence-…", "url": "https://www.aninews.in/news/health/researchers-suggest-pharmacologic-treatments-for-managing-tooth-extraction-pain20230131114057", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230131061044.jpg", "publishedAt": "2023-01-31T06:10:00Z", "content": "Washington [US], January 31 (ANI): In order to formalise evidence-based alternatives to opioid analgesics for acute pain treatment following tooth extraction in adults, a recent study assessed the ef… [+2636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heart Health: How To Lower Risk Of Myocardial Infarction In Winter Months - NDTV", "description": "Continue reading as we share preventive measures that help lower your risk of myocardial infarction in the winter months.", "url": "https://www.ndtv.com/health/heart-how-to-lower-risk-of-myocardial-infarction-in-winter-months-3736612", "urlToImage": "https://c.ndtvimg.com/2022-12/7j5qbje8_heart-attack_625x300_06_December_22.jpg", "publishedAt": "2023-01-31T05:53:54Z", "content": "Heart attack can be triggered by the winter cold\r\nBe mindful that cold weather can cause arteries to constrict, reducing the amount of blood reaching the heart. Strenuous activities can significantly… [+3204 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Multiple Benefits Of Sleeping Under A Weighted Blanket That Should Not Be Overlooked - News18", "description": "In case you have not gotten a good night's sleep this winter, get hold of a weighted blanket immediately and you will see the change-", "url": "https://www.news18.com/news/lifestyle/multiple-benefits-of-sleeping-under-a-weighted-blanket-that-should-not-be-overlooked-6956989.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-80-1-167514392916x9.png", "publishedAt": "2023-01-31T05:47:59Z", "content": "There are several simple ways to improve your sleep quality, from cutting out cups of coffee to avoiding any daytime naps - but there are also bedroom additions to consider; specifically weighted bla… [+3747 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Can dates help diabetics lower blood sugar? Know how much, which variety and ripeness suits you - The Indian Express", "description": "Put together by Dr Anoop Misra, Chairman, Fortis CDOC Hospital for Diabetes and Allied Sciences, and Dr Meenakshi Bajaj, dietician, Tamil Nadu Government Multi-Super Speciality Hospital, Chennai, a review of several studies shows how dates, had the right way,…", "url": "https://indianexpress.com/article/health-wellness/dates-diabetics-lower-blood-sugar-how-much-which-variety-and-ripeness-8414079/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200_getty.jpg", "publishedAt": "2023-01-31T03:40:46Z", "content": "There is a common belief that people with Type 2 diabetes must avoid consumption of dates. But a recent review of research findings shows that the intake of dates does not have a significant effect o… [+5686 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Mukund Setlur", "title": "Applying ‘hungry lion algorithm’ in career and life - Deccan Herald", "description": "You are in a savannah forest, enjoying a cool evening. Just a few steps away, you see the grass in front of you shaking; you suspect that it could be a lion. Dr Neil de Grasse Tyson in his book, Starry Messenger: Cosmic Perspectives on Civilization conceives …", "url": "https://www.deccanherald.com/supplements/dh-education/applying-hungry-lion-algorithm-in-career-and-life-1186096.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/01/31/file7oprh73nvnr54uny1g6-1186096-1675091780-1-1186096-1675133081.jpg", "publishedAt": "2023-01-31T02:44:41Z", "content": "You are in a savannah forest, enjoying a cool evening. Just a few steps away, you see the grass in front of you shaking; you suspect that it could be a lion. Dr Neil de Grasse Tyson in his book, Star… [+4666 chars]"}, {"source": {"id": null, "name": "Koreabiomed.com"}, "author": "Kim Yoon-mi", "title": "These 3 diseases may lead to breast cancer. What are they? - KBR", "description": "Breast cancer is the most commonly occurring cancer in women. It is a malignant tumor with the potential to spread to other organs and threaten life.According to the National Cancer Center, Korea had 24,806 breast cancer patients in 2020. If breast cancer is …", "url": "https://www.koreabiomed.com/news/articleView.html?idxno=20335", "urlToImage": "https://cdn.koreabiomed.com/news/thumbnail/202301/20335_20371_3730_v150.jpg", "publishedAt": "2023-01-31T02:38:50Z", "content": "Breast cancer is the most commonly occurring cancer in women. It is a malignant tumor with the potential to spread to other organs and threaten life.\r\nAccording to the National Cancer Center, Korea h… [+3087 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New discovery about microglia heralds myriad possibilities for treating neurodegenerative diseases - News-Medical.Net", "description": "Combating Alzheimer's and other neurodegenerative diseases by inserting healthy new immune cells into the brain has taken a leap toward reality.", "url": "https://www.news-medical.net/news/20230130/New-discovery-about-microglia-heralds-myriad-possibilities-for-treating-neurodegenerative-diseases.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/92036744-620x480.jpg", "publishedAt": "2023-01-30T23:56:00Z", "content": "Combating Alzheimer's and other neurodegenerative diseases by inserting healthy new immune cells into the brain has taken a leap toward reality. Neuroscientists at the University of California, Irvin… [+4635 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Liver cancer treatment can place significant financial burden on patients, analysis shows - News-Medical.Net", "description": "Hepatocellular carcinoma (HCC), the most common type of liver cancer, can place a significant financial burden on patients, according to an analysis led by a researcher at UT Southwestern Medical Center.", "url": "https://www.news-medical.net/news/20230130/Liver-cancer-treatment-can-place-significant-financial-burden-on-patients-analysis-shows.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/10/shutterstock_532679098_573152c4350d4fe79b49ad0eacf10282-620x480.jpg", "publishedAt": "2023-01-30T23:33:00Z", "content": "Hepatocellular carcinoma (HCC), the most common type of liver cancer, can place a significant financial burden on patients, according to an analysis led by a researcher at UT Southwestern Medical Cen… [+4030 chars]"}, {"source": {"id": null, "name": "25newsnow.com"}, "author": "CNN Newsource staff", "title": "COVID-19 a leading cause of death in children, study says - 25 News Now", "description": "After looking at federal data, researchers concluded about one of every 100,000 children died from COVID-19 between August 2021 and July 2022.", "url": "https://www.25newsnow.com/2023/01/30/covid-19-leading-cause-death-children-study-says/", "urlToImage": "https://gray-week-prod.cdn.arcpublishing.com/resizer/bpcFQdRJU1y0W9WxwCnO1_UHrxc=/1200x600/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/K4XCWY4D2JF6BLBG5THMEA2ROA.jpg", "publishedAt": "2023-01-30T18:24:00Z", "content": "(CNN) Recent data states COVID-19 was a leading cause of death for children in the United States, but children are still less likely to die from the virus than any other age group, according to a new… [+523 chars]"}, {"source": {"id": null, "name": "Asbestos.com"}, "author": "Sean Marchese, MS, RN", "title": "Study Shows Opdivo, Yervoy Effective After Mesothelioma Surgery - Asbestos.com", "description": "A new study from Japan concluded that immunotherapy might be an effective treatment for mesothelioma that recurs after surgery.", "url": "https://www.asbestos.com/news/2023/01/30/opdivo-yervoy-mesothelioma-recurrence-surgery/", "urlToImage": "https://www.asbestos.com/wp-content/uploads/syringe_iv_immunotherapy.jpg", "publishedAt": "2023-01-30T17:51:06Z", "content": "Patients with recurrent mesothelioma cancer often have few options. A new study by the Hyogo College of Medicine in Japan may have a potential answer. \r\nThis study tested the safety and efficacy of t… [+4614 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Contact lenses to treat dry eye syndrome - Science Daily", "description": "Engineers have developed a contact lens prototype that is specially designed to prevent contact lens-induced dry eye (CLIDE). The lens alleviates this condition by facilitating tear flow in response to normal eye blinking. This can relieve the discomfort, vis…", "url": "https://www.sciencedaily.com/releases/2023/01/230130112431.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-30T16:56:45Z", "content": "A collaborative team from the Terasaki Institute for Biomedical Innovation (TIBI) has developed a contact lens prototype that is specifically designed to prevent contact lens-induced dry eye (CLIDE).… [+4319 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "How to Avoid Blood Sugar Spike? What Should You Eat First - Proteins or Carbs? - Sportskeeda", "description": "Blood sugar spikes are usually caused by carbohydrates. All carbs are broken down by enzymes in the body to yield glucose. Levels of glucose rise when you consume carbs in your meals.", "url": "https://www.sportskeeda.com/health-and-fitness/how-avoid-blood-sugar-spike-what-should-you-eat-first-proteins-carbs", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/1ba6b-16750852471233-1920.jpg", "publishedAt": "2023-01-30T13:39:14Z", "content": "Blood sugar spikes are usually caused by carbohydrates. All carbs are broken down by enzymes in the body to yield glucose. Levels of glucose rise when you consume carbs in your meals. \r\nGlucose also … [+3102 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Kids fight off COVID-19 quickly but don't develop adaptive immunity - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2023-01-30T09:00:07Z", "content": ""}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Govt likely to float global tender for HPV vaccine in April; Serum Institute, Merck may participate - Medical Dialogues", "description": "New Delhi: The Health Ministry intends to roll out HPV vaccine against cervical cancer in the national immunisation programme for girls aged 9 to 14 years in June for which a global tender is...", "url": "https://medicaldialogues.in/news/industry/pharma/govt-likely-to-float-global-tender-for-hpv-vaccine-in-april-serum-institute-merck-may-participate-106311", "urlToImage": "https://medicaldialogues.in/h-upload/2021/09/18/160546-hpv-vaccination.jpg", "publishedAt": "2023-01-30T07:12:56Z", "content": "New Delhi: The Health Ministry intends to roll out HPV vaccine against cervical cancer in the national immunisation programme for girls aged 9 to 14 years in June for which a global tender is likely … [+2799 chars]"}]}