{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Hcplive.com"}, "author": "Connor Iapoce", "title": "Diabetic Retinopathy May Predict Hemodialysis Induction in Patients with T2D - MD Magazine", "description": "Diabetic retinopathy and microalbuminuria were associated with a significantly higher risk of hemodialysis induction in individuals with T2D.", "url": "https://www.hcplive.com/view/diabetic-retinopathy-predict-hemodialysis-induction-patients-t2d", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/5a5da0da32cc1fbc1d9cf03c9b0e5f0de5d6d182-300x300.jpg?fit=crop&auto=format", "publishedAt": "2023-06-30T21:02:45Z", "content": "New research suggests diabetic retinopathy is predictive of hemodialysis induction in patients with type 2 diabetes (T2D) at the early stage of diabetic nephropathy, with normo- and microalbuminuria … [+3859 chars]"}, {"source": {"id": null, "name": "Prevention.com"}, "author": "Shannen Zitz", "title": "Vaginal Cramps: 11 Causes and When to See a Doctor - Prevention Magazine", "description": "Plus, when to see your doctor.", "url": "https://www.prevention.com/health/health-conditions/a44374904/vaginal-cramps/", "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/stomach-ache-1557864082.jpg?crop=1.00xw:0.752xh;0,0.115xh&resize=1200:*", "publishedAt": "2023-06-30T19:55:42Z", "content": "Muscle cramps and pelvic pain are often high on the list of uncomfortable health issuesbut when these symptoms combine with vaginal cramps, you may start to worry. While cramps can be completely norm… [+8126 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WHO to say Diet Coke, Chewing Gums, Cough Drops Cause Cancer | Vantage with Palki Sharma - Firstpost", "description": "WHO to say Diet Coke, Chewing Gums, Cough Drops Cause Cancer | Vantage with Palki SharmaDiet coke became a fizzy elixir that promised to help its patrons she...", "url": "https://www.youtube.com/watch?v=Qq6VJJ6pJQU", "urlToImage": "https://i.ytimg.com/vi/Qq6VJJ6pJQU/maxresdefault.jpg", "publishedAt": "2023-06-30T18:00:15Z", "content": null}, {"source": {"id": null, "name": "Medscape"}, "author": "Megan Brooks", "title": "New AHA Statement on Ischemia After Cardiac Surgery - Medscape", "description": "A high level of suspicion is needed to diagnose postoperative ischemia after cardiac surgery, and prompt treatment is the key to a good clinical outcome, the AHA says in a new scientific statement.", "url": "https://www.medscape.com/viewarticle/993932", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_211004_female_surgeons_operation_800x450.jpg", "publishedAt": "2023-06-30T17:49:05Z", "content": "The American Heart Association (AHA) outlines \"considerations\" on the management of acute postoperative myocardial ischemia (PMI) after cardiac surgery in a scientific statement.\r\nAlthough an infrequ… [+2769 chars]"}, {"source": {"id": null, "name": "Sci.news"}, "author": "News Staff", "title": "Monthly Vitamin D May Prevent Heart Attacks in Older People, Study Shows - Sci.News", "description": "New research indicates that vitamin D supplementation might reduce the incidence of major cardiovascular events, particularly myocardial infarction and coronary revascularization, among people aged over 60.", "url": "https://www.sci.news/medicine/monthly-vitamin-d-cardiovascular-events-12053.html", "urlToImage": "https://cdn.sci.news/images/2023/06/image_12053-Vitamin-D.jpg", "publishedAt": "2023-06-30T17:41:50Z", "content": "New research indicates that vitamin D supplementation might reduce the incidence of major cardiovascular events, particularly myocardial infarction and coronary revascularization, among people aged o… [+4137 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Loneliness linked with elevated risk of heart disease in patients with diabetes: Study - Organiser", "description": "Researchers found loneliness is a greater risk factor for heart disease in diabetic patients than diet, exercise, smoking and depression. This research", "url": "https://organiser.org/2023/06/30/181407/health/loneliness-linked-with-elevated-risk-of-heart-disease-in-patients-with-diabetes-study/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/06/untitled-64.jpg", "publishedAt": "2023-06-30T17:33:13Z", "content": "Researchers found loneliness is a greater risk factor for heart disease in diabetic patients than diet, exercise, smoking and depression.\r\nThis research was published in the European Heart Journal, a… [+4155 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Kiley Price", "title": "'Disappearing' Y chromosome in aging men may worsen bladder cancer, mouse study shows - Livescience.com", "description": "As men get older, they can lose Y chromosomes in a portion of their cells. This could be helping certain cancers evade the immune system.", "url": "https://www.livescience.com/health/cancer/disappearing-y-chromosome-in-aging-men-may-worsen-bladder-cancer-mouse-study-shows", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EE9CaBtt5M5raai9vw2SWk-1200-80.jpg", "publishedAt": "2023-06-30T16:17:32Z", "content": "Most men carry one X and one Y sex chromosome in each of their body's cells. However, over their lifetimes, many men start losing Y chromosomes in a portion of their cells, and this might hamper thei… [+4399 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Jake Remaly", "title": "Parenteral Nutrition Predicts Retinopathy of Prematurity - Medscape", "description": "Infants who received parenteral nutrition for at least 14 days were significantly more likely to develop the vision disorder, according to a new study.", "url": "https://www.medscape.com/viewarticle/993923", "urlToImage": "https://img.medscape.com/thumbnail_library/ps_210921_retinopathy_of_prematurity_800x450.jpg", "publishedAt": "2023-06-30T16:09:30Z", "content": "How long infants use parenteral nutrition helps predict whether they will develop retinopathy of prematurity (ROP), according to research published online June 29 in JAMA Ophthalmology.\r\nMETHODOLOGY:… [+1593 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Jane Langille", "title": "International team develops new vaccine distribution model - Medical Xpress", "description": "Researchers from Weill Cornell Medicine, Cornell's Ithaca campus, Singapore University of Technology and Design, and San Jose State University in California have developed a model for optimizing the dispensing of vaccines during pandemics that uses a new meas…", "url": "https://medicalxpress.com/news/2023-06-international-team-vaccine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/international-team-dev.jpg", "publishedAt": "2023-06-30T15:47:05Z", "content": "Researchers from Weill Cornell Medicine, Cornell's Ithaca campus, Singapore University of Technology and Design, and San Jose State University in California have developed a model for optimizing the … [+5725 chars]"}, {"source": {"id": null, "name": "Manilastandard.net"}, "author": "Macon Ramos-Araneta", "title": "Cardiologist warns vs. eating bad cholesterol - manilastandard.net", "description": "The president of the Philippine Lipid and Atherosclerosis Society has warned the public against having high amounts of low-density lipoproteins", "url": "https://manilastandard.net/news/national/314345058/cardiologist-warns-vs-eating-bad-cholesterol.html", "urlToImage": "https://manilastandard.net/wp-content/uploads/2023/06/PLAS.png", "publishedAt": "2023-06-30T15:15:00Z", "content": "The president of the Philippine Lipid and Atherosclerosis Society has warned the public against having high amounts of low-density lipoproteins (LDL), the bad cholesterol or Lechon de Leche.\r\nSpeakin… [+2282 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Angela Nicoletti", "title": "Researchers discover new weapon against antibiotic resistance—it also fights malaria - Medical Xpress", "description": "Florida International University scientists discovered the first and only known natural arsenic-containing antibiotic to fight antibiotic resistance. Now, research reveals it can stop transmission of a deadly disease spreading in the U.S. for the first time i…", "url": "https://medicalxpress.com/news/2023-06-weapon-antibiotic-resistanceit-malaria.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-discover-n-15.jpg", "publishedAt": "2023-06-30T15:08:08Z", "content": "Florida International University scientists discovered the first and only known natural arsenic-containing antibiotic to fight antibiotic resistance. Now, research reveals it can stop transmission of… [+3795 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "ECG-AI Tool Diagnoses Heart Attacks Faster and More Accurately Than Current Approaches - HospiMedica", "description": "A new tool is now available to detect subtle ECG indicators that clinicians might find challenging to identify, making it easier for them to classify chest pain patients.", "url": "https://www.hospimedica.com/critical-care/articles/294797742/ecg-ai-tool-diagnoses-heart-attacks-faster-and-more-accurately-than-current-approaches.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2023-06-30/SDD-294797742.jpg", "publishedAt": "2023-06-30T14:55:28Z", "content": "When a patient experiences chest pain and is rushed to the hospital, an electrocardiogram (ECG) is typically the first diagnostic tool used to confirm or rule out a heart attack. In an ECG, healthcar… [+2850 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Batya Swift Yasgur, LSW", "title": "Intense Exercise May Be Risky in Moderate to Severe Stenosis - Medscape", "description": "Exercise is usually beneficial for cardiovascular health, but this study suggests it may raise the ischemic stroke risk among those with moderate to severe carotid stenosis.", "url": "https://www.medscape.com/viewarticle/993912", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230630_senior_man_in_gym_800x450.jpg", "publishedAt": "2023-06-30T14:07:45Z", "content": "Intense exercise may increase stroke risk among patients with moderate or severe stenosis, new research suggests.\r\nInvestigators simulated blood flow in a sophisticated computational model of the int… [+6525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Manya Singh", "title": "Haircare Tips: Eat These Vitamin B-Rich Foods For Thicker Healthier Hair - NDTV Doctor", "description": "When it comes to hair health, vitamin B plays a vital role in promoting strong and healthy hair growth, here's how to add it to your diet.", "url": "https://doctor.ndtv.com/nutrition/haircare-tips-eat-these-vitamin-b-rich-foods-for-thicker-healthier-hair-4166799", "urlToImage": "https://c.ndtvimg.com/2022-11/1232buc_haircare650_625x300_25_November_22.jpg", "publishedAt": "2023-06-30T14:00:34Z", "content": "Vitamin B is a group of essential water-soluble vitamins that play a crucial role in supporting various bodily functions. There are eight different types of vitamin B, including thiamine (B1), ribofl… [+3812 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Batya Swift Yasgur, MA, LSW", "title": "Noninvasive Brain Stimulation Promising for Acute Stroke - Medscape", "description": "Noninvasive brain stimulation may help salvage penumbra affected by acute ischemic stroke, promising results from a new pilot study suggest.", "url": "https://www.medscape.com/viewarticle/993908", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_210324_ischemic_stroke_800x450.jpg", "publishedAt": "2023-06-30T13:35:37Z", "content": "High-definition cathodal transcranial direct current stimulation (HD C-tDCS) is a promising approach for treating acute ischemic stroke (AIS), results of a pilot study suggest.\r\nInvestigators explore… [+7344 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Mansha Agrawal", "title": "Be HAPPY, Be HEALTHY : 7 Essential Tips for a Healthy Lifestyle! - News Track English", "description": "Living a healthy lifestyle is crucial for overall well-being and longevity. Making conscious choices to prioritize your physical and mental health can significantly impact your quality of life.  Making healthy habits part of your daily life means you’re less …", "url": "https://english.newstracklive.com/news/essential-tips-sc53-nu411-ta267-1282417-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Jun/30/big_thumb/cp_649ecace4d155.png", "publishedAt": "2023-06-30T13:18:48Z", "content": "Living a healthy lifestyle is crucial for overall well-being and longevity. Making conscious choices to prioritize your physical and mental health can significantly impact your quality of life.  Maki… [+4060 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Water fasts may help you lose weight, but you might gain it back quickly: Study - Devdiscourse", "description": "According to a study from the University of Illinois Chicago, water fasts, in which participants only ingest water for a period of time, may aid in weight loss, but it's not obvious how long the weight loss will last. Additionally, the researchers discovered …", "url": "https://www.devdiscourse.com/article/health/2506758-water-fasts-may-help-you-lose-weight-but-you-might-gain-it-back-quickly-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_06_2023_13_00_54_9231209.jpg?width=920&format=jpeg", "publishedAt": "2023-06-30T13:00:59Z", "content": "According to a study from the University of Illinois Chicago, water fasts, in which participants only ingest water for a period of time, may aid in weight loss, but it's not clear how long the weight… [+3835 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "Whole Milk vs. Skimmed Milk: Which one is healthier for you? - Moneycontrol", "description": "Choosing between whole milk and skimmed milk ultimately depends on individual health goals and preferences. Whole milk offers a higher fat content and richer taste, while skimmed milk provides lower fat content and is lower in calories.", "url": "https://www.moneycontrol.com/news/health-and-fitness/whole-milk-vs-skimmed-milk-which-one-is-healthier-for-you-10884281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Health-benefits-of-milk-770x433.jpg", "publishedAt": "2023-06-30T12:31:46Z", "content": "Be it for your cereal bowl for breakfast, your evening latte, or a nightcap for a sound sleep, a glass of milk can make a huge difference to your diet. The most common question is which milk is actua… [+2769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nutritionist Explains How Fibre, Protein And A Pre-Diabetic Diet May Help Manage PCOS - NDTV Food", "description": "PCOS diet: Nutritionist Simrun Chopra recently shared some important dietary and lifestyle habits that could help those with PCOS.", "url": "https://food.ndtv.com/health/how-to-manage-pcos-nutritionist-reveals-key-diet-tips-to-follow-4166448", "urlToImage": "https://c.ndtvimg.com/2023-06/qca0m2s8_pcos-diet_625x300_30_June_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-06-30T12:31:36Z", "content": "Polycystic Ovary Syndrome (PCOS) is a hormonal disorder experienced by women in which cysts get formed in the ovaries, caused by an over-production of hormones called androgens. PCOS may lead to infr… [+2251 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Gut microbes could be early sign of Alzheimer’s disease - India Education Diary", "description": "­People in the earliest stage of Alzheimer’s disease — after brain changes have begun but before cognitive symptoms become apparent — harbor an assortment of bacteria in their intestines that differs from the gut bacteria of healthy people, according", "url": "https://indiaeducationdiary.in/gut-microbes-could-be-early-sign-of-alzheimers-disease/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/Washington-University-in-St.Louis_.jpg", "publishedAt": "2023-06-30T12:18:40Z", "content": "­People in the earliest stage of Alzheimers disease after brain changes have begun but before cognitive symptoms become apparent harbor an assortment of bacteria in their intestines that differs from… [+4810 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Hearing restoration: New hope for people with hearing loss - Tech Explorist", "description": "Gene therapy restores hearing in adult mice through cerebrospinal fluid.", "url": "https://www.techexplorist.com/hearing-restoration-new-hope-people-hearing-loss/63333/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/side-view-man-wearing-hearing-aids.jpg", "publishedAt": "2023-06-30T12:13:16Z", "content": "The human ear is a complex and intricate sensory organ responsible for our ability to perceive sound. However, scientists have faced significant challenges when it comes to hearing restoration. In a … [+4108 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "India News | Exposure to Tobacco Smoke Linked with Increase in Heavy Metals in Children's Saliva - LatestLY", "description": "Get latest articles and stories on India at LatestLY.   Exposure to tobacco smoke has been linked with an increase in the presence of non-essential heavy metals such as lead in children's saliva, which could cause biological malfunctioning, leading to health …", "url": "https://www.latestly.com/agency-news/india-news-exposure-to-tobacco-smoke-linked-with-increase-in-heavy-metals-in-childrens-saliva-5236091.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-India-News-784x441.jpg", "publishedAt": "2023-06-30T12:00:21Z", "content": "New Delhi, Jun 30 (PTI) Exposure to tobacco smoke has been linked with an increase in the presence of non-essential heavy metals such as lead in children's saliva, which could cause biological malfun… [+2894 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "What is alcohol poisoning? Here's what happens to your liver and body if you drink too much alcohol - Moneycontrol", "description": "Alcohol poisoning wreaks havoc on the liver, inducing a cascade of damaging effects that can lead to severe health complications. From fatty liver disease to cirrhosis, the liver's ability to metabolise alcohol is overwhelmed, resulting in inflammation, scarr…", "url": "https://www.moneycontrol.com/news/health-and-fitness/what-is-alcohol-poisoning-heres-what-happens-to-your-liver-and-body-if-you-drink-too-much-alcohol-10882721.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Causes-and-symptoms-of-alcohol-poisoning--770x433.jpg", "publishedAt": "2023-06-30T11:50:02Z", "content": "Planning on binge drinking with friends this weekend? You might want to rethink your plan. For too much alcohol can turn a fun night into an absolute nightmare in no time! Alcohol poisoning is a seve… [+3535 chars]"}, {"source": {"id": null, "name": "Medical Device Network"}, "author": "Kiays Khalil", "title": "Shaping the future of UK medtech - Medical Device Network", "description": "The landscape of the medical technology industry in the UK is expected to grow following a publication of a policy paper by the British government. But what is the plan and how will medtech firms react to proposed initiatives?", "url": "http://www.medicaldevice-network.com/features/shaping-the-future-of-uk-medtech/", "urlToImage": "https://www.medicaldevice-network.com/wp-content/uploads/sites/23/2023/06/2-min-scaled.jpg", "publishedAt": "2023-06-30T11:45:01Z", "content": "The UK is showing potential to be a leading example of a nation who puts innovation of medtech first, creating jobs and international trade.\r\nWith the National Health Service (NHS) calling for innova… [+7285 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Allpr Solution", "title": "Keto ACV Gummies Canada (Shark Tank Weight Loss Gummies CA) Apple Cider Vinegar Keto Scam & Are Pro Keto ACV Gummies Works Fake Exposed? - Devdiscourse", "description": "Read more about Keto ACV Gummies Canada (Shark Tank Weight Loss Gummies CA) Apple Cider Vinegar Keto Scam & Are Pro Keto ACV Gummies Works Fake Exposed? on Devdiscourse", "url": "https://www.devdiscourse.com/article/health/2506554-keto-acv-gummies-canada-shark-tank-weight-loss-gummies-ca-apple-cider-vinegar-keto-scam-are-pro-keto-acv-gummies-works-fak", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_06_2023_16_10_10_0664923.jpg?width=920&format=jpeg", "publishedAt": "2023-06-30T10:44:10Z", "content": "Keto ACV Gummies: A Comprehensive Detail on Keto Gummies for Natural Weight Loss!\r\nPeople often complain that most of their attempts to lose weight fail due to inconsistency and zero results, even th… [+9985 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover That Experimental Cancer Drug May Slow Inflammation Linked to Heart Disease - SciTechDaily", "description": "Potential new therapy emerges from\"reverse-engineering\" an existing compound. A new study conducted by researchers at NYU Grossman School of Medicine suggests that an experimental drug, previously tested for the potential treatment of cancer, lung, and Alzhei…", "url": "https://scitechdaily.com/scientists-discover-that-experimental-cancer-drug-may-slow-inflammation-linked-to-heart-disease/", "urlToImage": "https://scitechdaily.com/images/Heart-Disease-Concept-1.jpg", "publishedAt": "2023-06-30T10:41:35Z", "content": "ByNYU Langone Health / NYU Grossman School of MedicineJune 30, 2023\r\nResearchers have discovered that the experimental drug saracatinib, previously tested for potential use in treating various diseas… [+8587 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Exploring the potential mechanisms of action for HF and SLE | JIR - Dove Medical Press", "description": "To identify shared immune cells and co-disease genes in chronic heart failure & systemic lupus erythematosus, as well as explore their potential mechanisms.", "url": "https://www.dovepress.com/identification-of-shared-immune-cells-and-immune-related-co-disease-ge-peer-reviewed-fulltext-article-JIR", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-06-30T09:35:35Z", "content": "Introduction\r\nHeart failure (HF) is a pathological condition of myocardial injury resulting from various etiologies, such as myocardial infarction, cardiomyopathy, haemodynamic overload, and inflamma… [+42188 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Scientists find gene preventing bird flu virus from spreading to humans - Ahmedabad Mirror", "description": "Scientists find gene preventing bird flu virus from spreading to humans", "url": "https://www.ahmedabadmirror.com/scientists-find-gene-preventing-bird-flu-virus-from-spreading-to-humans/81859157.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1688062018128.jpg-org", "publishedAt": "2023-06-30T09:33:30Z", "content": "An international team of scientists has identified a gene that is preventing the bird flu viruses from spilling over into humans. In the study, published in the journal Nature, researchers revealed a… [+1173 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Long Covid not a single condition, symptoms can change over time: Study - Daijiworld.com", "description": "New York, Jun 30 (IANS): Long Covid is not a single condition, and should not be treated as such, according to a new study.\r\nAccording to researchers from the University of Washington, most long Covid studies have focused primarily on the individual symptoms …", "url": "https://www.daijiworld.com/index.php/news/newsDisplay?newsID=1095087", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-06-30T09:31:16Z", "content": "New York, Jun 30 (IANS): Long Covid is not a single condition, and should not be treated as such, according to a new study.\r\nAccording to researchers from the University of Washington, most long Covi… [+1935 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Siraj Ansari", "title": "Freedom Water 5 Reviews – Is it Worth Buying? Price, Where to Buy, and Latest Info! - ThePrint", "description": "Freedom Water 5 is a water filtration system that attracts contaminants, impurities, dangerous metals, and other contaminants from your water supply.", "url": "https://theprint.in/theprint-valuead-initiative/freedom-water-5-reviews-is-it-worth-buying-price-where-to-buy-and-latest-info/1648813/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/06/Untitled-design-53-4.jpg", "publishedAt": "2023-06-30T08:52:25Z", "content": "What is Freedom Water 5 Pitcher?\r\nFreedom Water 5  is a water purifying system that has been designed to eliminate toxins from the water. \r\nAccording to research, most individuals do not use purifier… [+9424 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Bizz Buzz", "title": "Why type A blood linked to Covid risk? - Bizz Buzz", "description": "The SARS-CoV-2 preferentially infects blood group A cells, finds a study providing a direct link between this blood group and a higher rate of infection with the virus", "url": "https://www.bizzbuzz.news/eco-buzz/why-type-a-blood-linked-to-covid-risk-1229379", "urlToImage": "https://www.bizzbuzz.news/h-upload/2023/06/30/1739303-covid.jpg", "publishedAt": "2023-06-30T08:31:59Z", "content": "New York The SARS-CoV-2, the virus that causes Covid-19, preferentially infects blood group A cells, finds a study providing a direct link between this blood group and a higher rate of infection with… [+2492 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Stress, microRNAs, and stress-related psychiatric disorders: an overview | Molecular Psychiatry - Nature.com", "description": "Molecular Psychiatry - Stress, microRNAs, and stress-related psychiatric disorders: an overview", "url": "https://www.nature.com/articles/s41380-023-02139-3", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41380-023-02139-3/MediaObjects/41380_2023_2139_Fig1_HTML.png", "publishedAt": "2023-06-30T07:57:51Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "National drug pricing body fixes ceiling prices of 51 drugs and 2 formulations - Moneycontrol", "description": "The price of 24 anti-diabetic formulations that lead with dapagliflozin and another 14 with vildagliptin and two with sitagliptin molecules were set", "url": "https://www.moneycontrol.com/news/trends/health/national-drug-pricing-body-fixes-ceiling-prices-of-51-drugs-and-2-formulations-10881761.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Medicine-box-770x433.jpg", "publishedAt": "2023-06-30T07:26:59Z", "content": "The National Pharmaceutical Pricing Authority (NPPA) has fixed the ceiling price of two anti-coagulant formulations and 51 drugs in a notification dated June 28 effectively bringing down their prices… [+1137 chars]"}, {"source": {"id": null, "name": "Editorji.com"}, "author": "Editorji News Desk", "title": "Why does consuming yogurt in the morning have immense health benefits? - Editorji", "description": "If you’re looking for a breakfast that offers immense health benefits, consider adding yogurt to your morning routine.", "url": "https://www.editorji.com/lifestyle-news/health/why-does-consuming-yogurt-in-the-morning-have-immense-health-benefits-1688109154849", "urlToImage": "https://cdn.editorji.com/4UTTOb8nuR.jpg", "publishedAt": "2023-06-30T07:12:34Z", "content": "Yogurt is a popular dairy product that is consumed by most people. This dairy product can be eaten with fruits, blended into smoothies, or can be added to many dishes. \r\nStarting your day with a serv… [+1238 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Allergic Rhinitis-Phenotypes, Challenges, Therapeutic Approach and Role of Montelukast Fexofenadine... - Medical Dialogues", "description": "Atopic diseases are becoming increasingly prevalent worldwide, and allergic rhinitis (AR), an IgE-mediated inflammatory disease, is one among them. Globally, up to 25% of children and up to 40% of...", "url": "https://medicaldialogues.in/ent/perspective/allergic-rhinitis-phenotypes-challenges-therapeutic-approach-and-role-of-montelukast-fexofenadine-combination-113687", "urlToImage": "https://medicaldialogues.in/h-upload/2023/06/27/212890-allergic-rhinitis.jpg", "publishedAt": "2023-06-30T06:53:21Z", "content": "Atopic diseases are becoming increasingly prevalent worldwide, and allergic rhinitis (AR), an IgE-mediated inflammatory disease, is one among them. Globally, up to 25% of children and up to 40% of ad… [+7820 chars]"}, {"source": {"id": null, "name": "Pgurus.com"}, "author": "PGurus Newsdesk", "title": "India's First Schizophrenia Surgery Successfully Performed in Gurugram - PGurus", "description": "A 28-year-old man from Africa, suffering from schizophrenia from 13 years of age, has become the first person to undergo surgery for schizophrenia in India", "url": "https://www.pgurus.com/indias-first-schizophrenia-surgery-successfully-performed-in-gurugram-hospital/", "urlToImage": "https://www.pgurus.com/wp-content/uploads/2023/06/Gurugram-hospital-performs-Indias-1st-surgery-to-treat-schizophrenia.jpg", "publishedAt": "2023-06-30T06:03:34Z", "content": "A 28-year-old man from Africa, suffering from schizophrenia from 13 years of age, has become the first person to undergo surgery for schizophrenia in India.\r\n“This is the first surgery performed in I… [+2936 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Consult experts for weight guidance during pregnancy, study recommends - ETHealthWorld", "description": "A meta-analysis of nearly 35,000 individuals from 99 studies published in JAMA Network Open discovered that interventions from allied health professionals like as dietitians were the most beneficial for managing gestational weight gain (GWG).", "url": "https://health.economictimes.indiatimes.com/news/industry/consult-experts-for-weight-guidance-during-pregnancy-study-recommends/101382510", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-101382510,imgsize-9902,width-1200,height=765,overlay-ethealth/industry/consult-experts-for-weight-guidance-during-pregnancy-study-recommends.jpg", "publishedAt": "2023-06-30T05:02:30Z", "content": "England: A recent review of over 100 research papers suggests that pregnant women may benefit from more support from qualified dietitians in controlling weight gain during pregnancy.A meta-analysis o… [+2401 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Risk Factors of Overweight, Obesity - School Children 6-18 y | NDS - Dove Medical Press", "description": "Intricate network of risk factors inc. socioeconomic, household, environmental, biological elements signif. contribute to growing prevalence of obesity", "url": "https://www.dovepress.com/risk-factors-of-overweight-and-obesity-among-school-children-aged-6-to-peer-reviewed-fulltext-article-NDS", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-06-30T03:39:29Z", "content": "Introduction\r\nDisease patterns are undergoing significant changes worldwide, capturing the interest of different healthcare professionals and policymakers.1 This is especially noticeable in low- and … [+65550 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Rishabh Raj", "title": "11 benefits of using mango seeds for body, skin, and hair - Recipes", "description": "As per Ayurveda, mango seeds are rich in nutrients and have antioxidant and anti-inflammatory properties that fight inflammation and boost metabolism and immunity. Tap next to learn its benefits for the body, skin, and hair.", "url": "https://recipes.timesofindia.com/web-stories/11-benefits-of-using-mango-seeds-for-body-skin-and-hair/photostory/101379191.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101379204,imgsize-56648,width-900,height-1200,resizemode-6/101379204.jpg", "publishedAt": "2023-06-30T03:30:00Z", "content": "As per Ayurveda, mango seeds are rich in nutrients and have antioxidant and anti-inflammatory properties that fight inflammation and boost metabolism and immunity. Tap next to learn its benefits for … [+24 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rajeshwaari Kalla", "title": "Symptoms of enlarged adenoids in children: Persistent common cold, difficulty breathing, hearing loss - Moneycontrol", "description": "Is your child having difficulty breathing? Frequent colds and mouth breathing may be signs of adenoid enlargement. Here are the symptoms, diagnosis, and treatment options for this common condition in children.", "url": "https://www.moneycontrol.com/news/health-and-fitness/symptoms-of-enlarged-adenoids-in-children-persistent-common-cold-difficulty-breathing-hearing-loss-10880281.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Symptoms-of-enlarged-adenoids-in-children-770x433.jpg", "publishedAt": "2023-06-30T03:20:30Z", "content": "Is your child complaining of difficulty in breathing? Do they frequently suffer from a common cold and find it more comfortable to breathe through their mouth? Pay attention if you notice symptoms su… [+3499 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Vinod Kumar", "title": "Experts pick holes in Pb malaria surveillance net - Indiatimes.com", "description": "An evaluation of malaria surveillance in Punjab carried out by a team of experts has found the state wanting in most parameters.", "url": "https://timesofindia.indiatimes.com/city/chandigarh/experts-pick-holes-in-pb-malaria-surveillance-net/articleshow/101379614.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101381592,width-1070,height-580,imgsize-1173608,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-30T03:02:00Z", "content": "9 soft skills that are always in demand at work"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "A healthy lifestyle reduces risk of developing severe liver disease - News-Medical.Net", "description": "Researchers investigate the correlation between a healthy lifestyle and Life’s Essential 8 scores in new-onset severe non-alcoholic fatty liver disease.", "url": "https://www.news-medical.net/news/20230629/A-healthy-lifestyle-reduces-risk-of-developing-severe-liver-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_752559_16880886301772685.jpg", "publishedAt": "2023-06-30T02:48:00Z", "content": "In a recent study published in Metabolism, researchers investigate the correlation between a healthy lifestyle and Life's Essential 8 (LE8) scores in new-onset severe non-alcoholic fatty liver diseas… [+5320 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Parth Shastri", "title": "Never too young for a heart attack: Sudden deaths leave more questions than answers - Indiatimes.com", "description": "Earlier this week, Gujarat was jolted by shocking deaths of two students - a 17-year-old girl in Navsari and a 28-year-old youth in Rajkot - who fata", "url": "https://timesofindia.indiatimes.com/city/ahmedabad/emri-108-logs-14-of-heart-emergencies-in-10-30-age-grp/articleshow/101377301.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101377325,width-1070,height-580,imgsize-1242523,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-30T00:03:00Z", "content": "9 soft skills that are always in demand at work"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Elana Gotkine", "title": "Anti-reflux mucosectomy effective for GERD in long term - Medical Xpress", "description": "For patients with gastroesophageal reflux disease (GERD), anti-reflux mucosectomy (ARMS) shows long-term efficacy and is also effective for patients with reflux hypersensitivity, according to a study published online June 18 in Digestive Endoscopy.", "url": "https://medicalxpress.com/news/2023-06-anti-reflux-mucosectomy-effective-gerd-term.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/anti-reflux-mucosectom.jpg", "publishedAt": "2023-06-29T19:30:01Z", "content": "For patients with gastroesophageal reflux disease (GERD), anti-reflux mucosectomy (ARMS) shows long-term efficacy and is also effective for patients with reflux hypersensitivity, according to a study… [+2148 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Probing the underlying mechanisms of immune dysfunction in Chronic lymphocytic leukemia - Tech Explorist", "description": "With a median age at diagnosis of 70 years, chronic lymphocytic leukemia (CLL) is the most common form of leukemia in Western nations and primarily", "url": "https://www.techexplorist.com/mechanisms-immune-dysfunction-chronic-lymphocytic-leukemia/63211/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/3qk8xDI.jpg", "publishedAt": "2023-06-29T18:00:00Z", "content": "With a median age at diagnosis of 70 years, chronic lymphocytic leukemia (CLL) is the most common form of leukemia in Western nations and primarily affects the elderly. Following SARS-CoV-2 mRNA immu… [+3590 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/francesca-bond", "title": "Doing This Can Decrease Your \"Brain Age\" By Nearly A Year - mindbodygreen", "description": "Your \"brain age\" isn't set in stone.", "url": "https://www.mindbodygreen.com/articles/weight-loss-and-brain-age", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/7803jxg6cju00xf6t.jpg", "publishedAt": "2023-06-29T16:52:48Z", "content": "Theres a lot to aging that is beyond our control, but there are some tried-and-true lifestyle changes that we can make to improve our brain health and overall well-being as we grow older.\r\nEat a bala… [+1973 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Amritha K", "title": "Fenugreek For Weight Loss: 3 Ways To Use This Kitchen Herb To Lose Fat - Boldsky", "description": "Read on to know how fenugreek can aid in weight loss with these 3 powerful methods....", "url": "https://www.boldsky.com/health/fenugreek-for-weight-loss-3-ways-to-use-this-kitchen-herb-to-lose-fat-147084.html", "urlToImage": "https://www.boldsky.com/img/1200x60x675/2023/06/fenugreek-weightloss-feature-1688055421.jpg", "publishedAt": "2023-06-29T16:20:57Z", "content": "Fenugreek,\r\na\r\npowerful\r\nherb\r\nknown\r\nfor\r\nits\r\nnumerous\r\nhealth\r\nbenefits,\r\ncan\r\nalso\r\nbe\r\nan\r\neffective\r\naid\r\nin\r\nweight\r\nloss.\r\nWith\r\nits\r\nnatural\r\nproperties,\r\nfenugreek\r\ncan\r\nhelp\r\nboost\r\nmetabo… [+2975 chars]"}, {"source": {"id": null, "name": "Cityairnews.com"}, "author": "City Air News", "title": "Bladder Cancer in Women: Symptoms, Treatment & Prevention - Cityairnews", "description": "Bladder cancer is a highly prevalent disease that affects both men and women. However, when it comes to diagnosing and treating this condition, women encounter various difficulties. Bladder cancer in women sometimes occurs with unusual symptoms and needs spec…", "url": "https://www.cityairnews.com/content/bladder-cancer-in-women-symptoms-treatment-prevention", "urlToImage": "https://www.cityairnews.com/uploads/images/image_750x_5e15b93be6415.jpg", "publishedAt": "2023-06-29T15:44:45Z", "content": "By Dr. Chandrashekhar Prasad Singh, Medical Oncologist, HCG Cancer Centre, Ranchi\r\nBladder cancer is a highly prevalent disease that affects both men and women. However, when it comes to diagnosing a… [+4177 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Renowned innovator in robotic surgery named as new chair of the Department of Otolaryngology—Head and Neck Surgery at NYU Langone - News-Medical.Net", "description": "Umamaheswar Duvvuri, MD, PhD, a renowned researcher and innovator in advanced, minimally invasive robotic surgery of the head and neck, has been named the Mendik Foundation Professor of Otolaryngology and the new chair of the Department of Otolaryngology—Head…", "url": "https://www.news-medical.net/news/20230629/Renowned-innovator-in-robotic-surgery-named-as-new-chair-of-the-Department-of-Otolaryngologye28094Head-and-Neck-Surgery-at-NYU-Langone.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Otolaryngology-620x480.jpg", "publishedAt": "2023-06-29T14:19:00Z", "content": "Umamaheswar Duvvuri, MD, PhD, a renowned researcher and innovator in advanced, minimally invasive robotic surgery of the head and neck, has been named the Mendik Foundation Professor of Otolaryngolog… [+3363 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Sneha Kumari", "title": "Yoga poses for toned shoulders - News9 LIVE", "description": "Yoga poses for toned shoulders", "url": "https://www.news9live.com/web-stories/health/yoga-poses-for-toned-shoulders", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/06/cropped-pexels-marta-wave-6453874-scaled-1.jpg", "publishedAt": "2023-06-29T14:16:48Z", "content": "Yoga poses for toned shoulders\r\nCat Pose benefits the shoulders by strengthening them. The asana movements  massage and activate your digestive organs.\r\nPosture and muscular flexibility may be improv… [+636 chars]"}, {"source": {"id": null, "name": "Drishtiias.com"}, "author": null, "title": "IMS BHU prepared Herbal Antibiotic - Drishti IAS", "description": "IMS BHU prepared Herbal Antibiotic", "url": "https://www.drishtiias.com/state-pcs-current-affairs/ims-bhu-prepared-herbal-antibiotic", "urlToImage": "https://www.drishtiias.com/drishti/img/drishti-dual-logo.jpg", "publishedAt": "2023-06-29T12:37:48Z", "content": "Why in News?\r\nAccording to information received from the media on June 28, 2023, the Faculty of Ayurveda of The IMS, BHU, Banaras, Uttar Pradesh, has prepared herbal antibiotics in place of ineffecti… [+3435 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Michigan Medicine - University of Michigan", "title": "Researchers discover new opportunities for preventing kidney injury following cardiac surgery - Newswise", "description": "A new study finds that the minimum level of oxygen delivery during cardiopulmonary bypass may be lower than previously thought — meaning, there may be opportu", "url": "https://www.newswise.com/articles/researchers-discover-new-opportunities-for-preventing-kidney-injury-following-cardiac-surgery", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-06-29T12:20:00Z", "content": "Newswise — When a person has heart surgery, they’re often managed on cardiopulmonary bypass.\r\nThis process, involving a machine that temporarily takes over for the heart and lungs during the operatio… [+4186 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "News Track", "title": "If you want to keep your kidneys healthy, then make these foods a part of your diet - News Track English", "description": "It is critical for the kidney to be healthy in order to stay healthy. It functions as a body filter. Stones in the kidney are frequently caused by poor eating habits. In this case, you can keep your kidneys healthy by including certain foods in your diet.\r\n\r\n…", "url": "https://english.newstracklive.com/news/if-you-want-to-keep-your-kidneys-healthy-then-make-these-foods-a-part-of-your-diet-sc56-nu228-ta267-1282278-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/food-recipe/Jun/29/big_thumb/SUPER-FOOD_649d67676522e.png", "publishedAt": "2023-06-29T11:41:20Z", "content": "It is critical for the kidney to be healthy in order to stay healthy. It functions as a body filter. Stones in the kidney are frequently caused by poor eating habits. In this case, you can keep your … [+1739 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  WALLA!", "title": "5 health benefits of pineapple: Unveiling the power of this tropical fru - The Jerusalem Post", "description": "Discover the surprising advantages of pineapple and boost your health naturally.", "url": "https://www.jpost.com/omg/article-748147", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/541837", "publishedAt": "2023-06-29T11:07:00Z", "content": "Pineapple Day is here, and what better way to celebrate this delicious fruit than by exploring its numerous health benefits? Beyond its exquisite taste, pineapple offers a wealth of health bonuses th… [+3642 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Purvi Kalra", "title": "5 top tips to maintain oral hygiene and have sparkling teeth - Health shots", "description": "Keeping up with your oral hygiene is a lifetime job, however, with the healthy daily habits reckoned by the expert you can understand how to maintain oral hygiene.", "url": "https://www.healthshots.com/how-to/tips-to-maintain-oral-hygiene/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/29152636/oral-hygiene.jpg", "publishedAt": "2023-06-29T10:30:46Z", "content": "Maintaining sparkling teeth and fresh breath are indicators of overall good health and are a lifetime job. Even if someone has complimented your nice teeth, you still need to ensure taking the right … [+3569 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Study identifies potential new treatment for patients with liver disease - Ahmedabad Mirror", "description": "Study identifies potential new treatment for patients with liver disease", "url": "https://www.ahmedabadmirror.com/study-identifies-potential-new-treatment-for-patients-with-liver-disease/81859075.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1687977881618.jpg-org", "publishedAt": "2023-06-29T09:38:47Z", "content": "US researchers have led a study to examine a potential new treatment option for patients with nonalcoholic steatohepatitis (NASH)-related fibrosis. The results describe a drug, called Pegozafermin th… [+1953 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "Is jamun good for weight loss, immunity and digestion? Here are the health benefits of jamun - Moneycontrol", "description": "Jamun fruit benefits: Who else can’t help but feel nostalgic thinking of the good old childhood days when checking each other’s tongues for purple colour after eating jamun was an interesting game played every summer? But did you know this delicious summertim…", "url": "https://www.moneycontrol.com/news/health-and-fitness/is-jamun-good-for-weight-loss-immunity-and-digestion-here-are-the-health-benefits-of-eating-jamun-daily-10877581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Health-benefits-of-eating-jamun-fruit-770x433.jpg", "publishedAt": "2023-06-29T09:06:03Z", "content": "Is jamun good? Also known as Indian blackberry or java plum, jamun is a delicious tropical fruit native to India and Southeast Asia. The juicy, sweet, slightly tangy fruit that overflows summer marke… [+2828 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Rashmi rana", "title": "Reduced Fall Risk Screening for Older Opioid Users - Asiana Times", "description": "Research presented at the American Academy of Physician Associates (AAPA) national conference in May 2023 highlighted the importance of screening older adults for fall risk when prescribing opioids. However, due to time and staff constraints, many clinics str…", "url": "https://asianatimes.com/https-asianatimes-com-wp-admin-post-phppost212677actionedit/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/06/4NhFCxBy-ehc-social-isolation_1.jpg", "publishedAt": "2023-06-29T05:47:20Z", "content": "Research presented at the American Academy of Physician Associates (AAPA) national conference in May 2023 highlighted the importance of screening older adults for fall risk when prescribing opioids. … [+3398 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Dementia symptoms: This is the most commonly MISSED warning sign of dementia - Times of India", "description": "The most commonly missed warning sign of dementia is trouble with spatial issues, speech, and directions. Difficulty with language and visual/spatial skills can manifest before memory loss in certain cases.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/dementia-symptoms-this-is-the-most-commonly-missed-warning-sign-of-dementia/photostory/101339341.cms", "urlToImage": "https://static.toiimg.com/photo/101339351.cms", "publishedAt": "2023-06-29T05:30:00Z", "content": "There are many factors that can eventually contribute to dementia. Some factors, such as age, family history and down syndrome can't be changed. Other risk factors that may be managed include diet an… [+502 chars]"}, {"source": {"id": null, "name": "Nation.africa"}, "author": "Mary Wangari", "title": "Simple blood test detecting more than 50 cancer types - Nation", "description": "Simple blood test detecting more than 50 cancer types", "url": "https://nation.africa/kenya/health/simple-blood-test-detecting-more-than-50-cancer-types-4284154", "urlToImage": "https://nation.africa/resource/image/4284174/landscape_ratio3x2/1200/800/bd6f42d5f1b30c71e5c383eb68ea2134/cM/blood-test.jpg", "publishedAt": "2023-06-29T04:00:00Z", "content": "Scientists have developed a new screening technology that detects more than 50 types of cancer from just a single blood test. \r\nThe trailblazing invention known as Galleri test is developed by a Unit… [+3376 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Steffy Thevar", "title": "Kids’ common ailments turned severe after lockdowns: Study - Indiatimes.com", "description": "Adenoviral infection emerged as the common ailment in children with normal immune response after the Covid-19 pandemic and ensuing lockdowns, a study", "url": "https://timesofindia.indiatimes.com/city/pune/kids-common-ailments-turned-severe-after-lockdowns-study/articleshow/101354049.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101358302,width-1070,height-580,imgsize-38816,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-29T03:06:00Z", "content": "9 soft skills that are always in demand at work"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ipsita Pati", "title": "Ramp up fever surveys and sample collection, govt health centres told - Indiatimes.com", "description": "Anticipating a rise in dengue and malaria cases in the coming months, the health department has directed all centres to increase sample collection and", "url": "https://timesofindia.indiatimes.com/city/gurgaon/ramp-up-fever-surveys-and-sample-collection-govt-health-centres-told/articleshow/101352921.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101356003,width-1070,height-580,imgsize-985377,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-29T02:43:00Z", "content": "9 soft skills that are always in demand at work"}]}