{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Medscape"}, "author": "Nancy A. Melville", "title": "Vitamin D Deficiency Clearly Linked to Inflammation - Medscape", "description": "Vitamin D deficiency is unequivocally linked with inflammation in the form of C-reactive protein (CRP) levels in new research using data from the UK Biobank.", "url": "https://www.medscape.com/viewarticle/979452", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220819_vitamin_d_diagnosis_800x450.jpg", "publishedAt": "2022-08-19T13:51:34Z", "content": "Vitamin D deficiency has a causative role in the systemic inflammation that commonly accompanies it, with inflammation declining, reflected by reductions in elevated C-reactive protein (CRP), as vita… [+6124 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Trivitron Healthcare launches CoE in metabolomics, genomics, newborn screening and molecular diagnostics - Express Healthcare", "description": "Centre of Excellence will focus on creating unparalleled medical discoveries to transform healthcare delivery", "url": "https://www.expresshealthcare.in/news/trivitron-healthcare-launches-coe-in-metabolomics-genomics-newborn-screening-and-molecular-diagnostics/436046/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/08/19182342/IMG-20220819-WA0008-1.jpg", "publishedAt": "2022-08-19T12:57:17Z", "content": "Centre of Excellence will focus on creating unparalleled medical discoveries to transform healthcare delivery\r\nTrivitron Healthcare, a global manufacturer of medical devices has constantly strived to… [+3273 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Can Covid affect mental health and brain disorders two years after infection? - Economic Times", "description": "The study also saw an ongoing risk of psychosis and seizures in children.", "url": "https://economictimes.indiatimes.com/magazines/panache/can-covid-affect-mental-health-and-brain-disorders-two-years-after-infection/articleshow/93662148.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93662265,width-1070,height-580,imgsize-48914,overlay-etpanache/photo.jpg", "publishedAt": "2022-08-19T12:48:00Z", "content": "The occurrence of mental health conditions and neurological disorders among people recovering from Covid has been a concern since early in the pandemic. Several studies have shown that a significant … [+4301 chars]"}, {"source": {"id": null, "name": "Starofmysore.com"}, "author": "Author", "title": "World Mosquito Day in city on Aug. 20 - Star of Mysore", "description": "Mysore/Mysuru: In a bid to create awareness about controlling diseases such as malaria, dengue, filarial, brain fever etc., the Office of the District Vector-Borne Diseases Control Officer of the Health and Family Welfare Department will be celebrating World …", "url": "https://starofmysore.com/world-mosquito-day-in-city-on-aug-20/", "urlToImage": "https://starofmysore.com/wp-content/uploads/2017/07/news-18-mosquito.jpg", "publishedAt": "2022-08-19T12:14:57Z", "content": "Mysore/Mysuru: In a bid to create awareness about controlling diseases such as malaria, dengue, filarial, brain fever etc., the Office of the District Vector-Borne Diseases Control Officer of the Hea… [+1381 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Protetox Reviews", "title": "Protetox: Quickly Reduce Weight and Improves Metabolism! - openPR", "description": "Millions of people around the world are affected by obesity Experts believe obesity is caused by an unhealthy lifestyle and a high carbohydrate diet Extra fat can be challenging to lose especially if you have hormone problems slow metabolism large ...", "url": "https://www.openpr.com/news/2709901/protetox-quickly-reduce-weight-and-improves-metabolism", "urlToImage": "https://cdn.openpr.com/V/8/V819871451_g.jpg", "publishedAt": "2022-08-19T12:10:07Z", "content": "Protetox\r\nMillions of people around the world are affected by obesity. Experts believe obesity is caused by an unhealthy lifestyle and a high-carbohydrate diet. Extra fat can be challenging to lose, … [+14210 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox: As Cases Rise In India, Here Are Some Commonly Asked Questions Answered (FAQs) - NDTV", "description": "Monkeypox: We discuss and answer the most frequently asked questions about monkeypox.", "url": "https://www.ndtv.com/health/monkeypox-as-cases-rise-in-india-here-are-some-commonly-asked-questions-answered-faqs-3268358", "urlToImage": "https://c.ndtvimg.com/2019-10/voapcepo_washing-hands-_625x300_14_October_19.jpg", "publishedAt": "2022-08-19T11:15:07Z", "content": "Monkeypox: Washing hands regularly can help reduce chances of contracting monkeypox\r\nMonkeypox has taken the globe by a storm since its outbreak in May this year. As the cases rise globally, so does … [+3607 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Altai Balance Reviews: Does This Supplement Work? Urgent USA Customer Update! - Deccan Herald", "description": "Altai Balance is a nutritional supplement that helps maintain healthy blood sugar levels. As a dietary supplement, people with diabetes may take two capsules of the Altai Balance formula daily to balance blood sugar. It also helps with weight reduction, has a…", "url": "https://www.deccanherald.com/brandspot/pr-spot/altai-balance-reviews-does-this-supplement-work-urgent-usa-customer-update-1137495.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fhjcgh.jpg", "publishedAt": "2022-08-19T10:57:11Z", "content": "Altai Balance is a nutritional supplement that helps maintain healthy blood sugar levels.\r\nAs a dietary supplement, people with diabetes may take two capsules of the Altai Balance formula daily to ba… [+10117 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Java Burn Reviews - java burn ingredients, benefits and where to buy? - Deccan Herald", "description": "Losing weight is one of the most difficult things to do especially when people have such busy and strict schedules to adhere to. People tend to go on many absurd diets or do unrealistic workouts to reach their fitness goals. They are willing to invest all the…", "url": "https://www.deccanherald.com/brandspot/pr-spot/java-burn-reviews-java-burn-ingredients-benefits-and-where-to-buy-1137494.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fggmgh.png", "publishedAt": "2022-08-19T10:51:52Z", "content": "Losing weight is one of the most difficult things to do especially when people have such busy and strict schedules to adhere to. People tend to go on many absurd diets or do unrealistic workouts to r… [+6033 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Male Extra Reviews: My Experience on MaleExtra Erectile Dysfunction Pills! - Deccan Herald", "description": "Most men have erectile dysfunction, which is pretty common at some point in their lives, especially after they hit their thirties.   However, the majority of men never seek help, which may damage relationships, erode self-esteem, and lessen the enjoyment of s…", "url": "https://www.deccanherald.com/brandspot/pr-spot/male-extra-reviews-my-experience-on-maleextra-erectile-dysfunction-pills-1137491.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/dfhfgb.jpg", "publishedAt": "2022-08-19T10:47:58Z", "content": "Most men have erectile dysfunction, which is pretty common at some point in their lives, especially after they hit their thirties.However, the majority of men never seek help, which may damage relati… [+9237 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "UltraLoad Reviews: My Experience on Ultra Load Semen Enhancer Supplement! - Deccan Herald", "description": "UltraLoad is a high-end male enhancement pill made up of carefully chosen natural components that work together to provide powerful sexual performance.   This pill is ideal for increasing load, improving sexual performance, or experiencing strong orgasms and …", "url": "https://www.deccanherald.com/brandspot/pr-spot/ultraload-reviews-my-experience-on-ultra-load-semen-enhancer-supplement-1137486.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/zgnxfng.jpg", "publishedAt": "2022-08-19T10:41:36Z", "content": "UltraLoad is a high-end male enhancement pill made up of carefully chosen natural components that work together to provide powerful sexual performance.This pill is ideal for increasing load, improvin… [+10486 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "'ICPA Clinical Series’ latest episode busts myths around guided implant surgeries - Express Healthcare", "description": "‘ICPA Clinical Series’ is an initiative to address specific clinical challenges dentists face in their everyday practice", "url": "https://www.expresshealthcare.in/news/icpa-clinical-series-latest-episode-busts-myths-around-guided-implant-surgeries/436043/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2022/08/tooth-2874551_640-1.jpg", "publishedAt": "2022-08-19T10:24:43Z", "content": "ICPA Clinical Series is an initiative to address specific clinical challenges dentists face in their everyday practice\r\nICPA Health Products Ltd (ICPA) hosted its latest Clinical Series episode on ma… [+1201 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "PhenQ Reviews: Best Thermogenic Fat Burning Pills of 2022 - Deccan Herald", "description": "When an overweight person departs from the ordinary in a negative way that looks so simple to repair from the outside, it harms their self-esteem and induces bouts of depression and social anxiety. Obesity is a rising problem in our modern culture, and dealin…", "url": "https://www.deccanherald.com/brandspot/pr-spot/phenq-reviews-best-thermogenic-fat-burning-pills-of-2022-1137477.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/gncghvn.png", "publishedAt": "2022-08-19T10:20:11Z", "content": "When an overweight person departs from the ordinary in a negative way that looks so simple to repair from the outside, it harms their self-esteem and induces bouts of depression and social anxiety. O… [+6198 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "US study finds diabetes drug metformin may reduce Covid death risk by half - Business Standard", "description": "The widely available diabetes drug metformin may reduce the risk of hospitalisation and death from Covid by more than half if taken within four days of the start of the symptoms according to a study", "url": "https://www.business-standard.com/article/current-affairs/us-study-finds-diabetes-drug-metformin-may-reduce-covid-death-risk-by-half-122081900613_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/misc/2016-08/11/full/lupin-s-secondary-packaging-unit-at-goa-facility-1470901025-0527850.jpg", "publishedAt": "2022-08-19T10:16:00Z", "content": "The widely available diabetes drug metformin may reduce the risk of emergency room visits, hospitalisation, and death from COVID-19 by more than half if taken within four days of the start of the sym… [+2260 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Gorilla Flow Reviews: Is This Prostate Supplement Worth It? USA Customer Results & Complaints - Deccan Herald", "description": "Gorilla Flow is a prostate enlargement supplement that alleviates the swelling of the prostate gland in men as they age. This supplement was created after years of study by trained medical specialists on the lifestyle of gorillas and how they manage to keep p…", "url": "https://www.deccanherald.com/brandspot/pr-spot/gorilla-flow-reviews-is-this-prostate-supplement-worth-it-usa-customer-results-complaints-1137474.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/zdhgfxgn.jpg", "publishedAt": "2022-08-19T10:13:55Z", "content": "Gorilla Flow is a prostate enlargement supplement that alleviates the swelling of the prostate gland in men as they age. This supplement was created after years of study by trained medical specialist… [+10127 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "IANS", "title": "WHO experts recommend 2nd Covid booster for vulnerable groups - Lokmat", "description": "Geneva, Aug 19  Countries should consider giving a second Covid-19 vaccine booster to the elderly, pregnant women, health workers, people with weaker immune systems and those at higher risk of severe disease, according to a team of experts from the World Heal…", "url": "https://www.lokmattimes.com/international/who-experts-recommend-2nd-covid-booster-for-vulnerable-groups/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/63a85dd6735270f10a5cb0b17b285dfd_202208.jpg", "publishedAt": "2022-08-19T10:12:33Z", "content": "Geneva, Aug 19 Countries should consider giving a second Covid-19 vaccine booster to the elderly, pregnant women, health workers, people with weaker immune systems and those at higher risk of severe … [+2062 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "GlucoTrust Reviews: Beware Of The Ingredients And Interactions Before Buying GlucoTrust - Deccan Herald", "description": "GlucoTrust is one of the many blood sugar supplements available on the market that aids in maintaining normal blood sugar levels in its users. The product attempts to promote healthy blood sugar levels with its all-natural elements.   (ACT NOW & SAVE) Click H…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucotrust-reviews-beware-of-the-ingredients-and-interactions-before-buying-glucotrust-1137472.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/xfgncgh.jpg", "publishedAt": "2022-08-19T10:08:55Z", "content": "GlucoTrust is one of the many blood sugar supplements available on the market that aids in maintaining normal blood sugar levels in its users. The product attempts to promote healthy blood sugar leve… [+10646 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Performer 8 Reviews (USA) - Shocking Results! I Tried Performer8 For 30 Days - Deccan Herald", "description": "Performer 8 is one of the better-known male enhancement supplements. It has been on the market for a while and has had quite a few large-scale marketing campaigns, even though it is only sold online. And for many men, the question isn't just whether or not Pe…", "url": "https://www.deccanherald.com/brandspot/pr-spot/performer-8-reviews-usa-shocking-results-i-tried-performer8-for-30-days-1137464.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/fxgngfcn.jpg", "publishedAt": "2022-08-19T09:56:41Z", "content": "Performer 8 is one of the better-known male enhancement supplements. It has been on the market for a while and has had quite a few large-scale marketing campaigns, even though it is only sold online.… [+9073 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "How many minutes should you exercise to stay healthy? Here's what experts say | Mint - Mint", "description": "According to the study, conducted by the American Heart Association’s scientific journal, those working out two to four times over the minimum amount of exercise, had lower cardiovascular disease death risk.", "url": "https://www.livemint.com/news/world/regular-exercise-with-added-duration-can-lower-premature-mortality-here-s-how-11660901311334.html", "urlToImage": "https://images.livemint.com/img/2022/08/19/600x338/Regular_exercise_1660901524017_1660901524145_1660901524145.jpg", "publishedAt": "2022-08-19T09:36:01Z", "content": "Consistent exercise or regular exercise is good for health and a new study revealed those practicing it on everyday basis have a lower risk of premature mortality. According to the study, conducted b… [+2681 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Sydney scientists discover a breakthrough in the fight against dementia | 7NEWS - 7NEWS Australia", "description": "There’s been a breakthrough in the fight against dementia with Sydney scientists discovering a biomarker in the blood that points to a greater chance of deve...", "url": "https://www.youtube.com/watch?v=FwbVsBCD8R4", "urlToImage": "https://i.ytimg.com/vi/FwbVsBCD8R4/hqdefault.jpg", "publishedAt": "2022-08-19T09:16:10Z", "content": null}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Natural compounds show potential in creation of Covid-19 medicines - ThePrint", "description": "Washington [U.S], August 19 (ANI): According to a study, three natural chemicals found in food products such as green tea, olive oil, and red wine are possible candidates for the creation of coronavirus medicines. In a comprehensive screening of a large libra…", "url": "https://theprint.in/features/natural-compounds-show-potential-in-creation-of-covid-19-medicines/1089817/", "urlToImage": null, "publishedAt": "2022-08-19T09:13:40Z", "content": "Washington [U.S], August 19 (ANI): According to a study, three natural chemicals found in food products such as green tea, olive oil, and red wine are possible candidates for the creation of coronavi… [+4055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Why is swine flu surging in Maharashtra? What are the symptoms? - The Indian Express", "description": "Once every decade or so, larger changes in the virus can cause a big jump in numbers. The new strain can have the same effect as the original strain had on a native population, says Dr. Lancelot Pinto, epidemiologist and pulmonologist from Hinduja hospital.", "url": "https://indianexpress.com/article/lifestyle/health-specials/why-swine-flu-surging-in-maharashtra-what-are-symptoms-8099492/", "urlToImage": "https://images.indianexpress.com/2022/08/swine-flu_759.jpg", "publishedAt": "2022-08-19T09:11:34Z", "content": "In the first 12 days of August, Maharashtra reported nearly 900 new cases of swine flu with 23 fatalities linked to the infection. This is almost a 162 per cent increase over the total swine flu case… [+4452 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Mohammed Hussain Ahmed", "title": "Swine flu, dengue, fever cases increasing in Telangana: Dr Junaidi - The Siasat Daily", "description": "Hyderabad: The cases of fever, cough and cold are increasing across Telangana state and doctors are advising people not to take these symptoms lightly and get proper treatment. According to Dr Khizar Hussain Junaidi, the number of swine flu cases in Telangana…", "url": "https://www.siasat.com/swine-flu-dengue-fever-cases-increasing-in-telangana-dr-junaidi-2393475/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2020/07/dengue-mosquito.jpg", "publishedAt": "2022-08-19T09:06:00Z", "content": "Hyderabad: The cases of fever, cough and cold are increasing across Telangana state and doctors are advising people not to take these symptoms lightly and get proper treatment.\r\nAccording to Dr Khiza… [+1224 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Joint pain on the rise in young adults, say doctors - ETHealthWorld", "description": "Young adults in their 20s, 30s, and 40s are also complaining of joint pain due to working from home and eating high fat and sugar diet, along with those who have recovered from Covid-19. The symptoms of it are swollen, red and tender joints, constant pain and…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/joint-pain-on-the-rise-in-young-adults-say-doctors/93657846", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93657846,imgsize-25196,width-1200,height-628,overlay-ethealthworld/joint-pain-on-the-rise-in-young-adults-say-doctors.jpg", "publishedAt": "2022-08-19T09:03:00Z", "content": "Pune: There is a rise in joint pain among young adults, including those who have recovered from Covid-19. A large number of youngsters are complaining of bone and joint problems. It is imperative to … [+1907 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Anirudh Bhattacharyya", "title": "Scientists discover ‘weak spot’ across major Covid-19 variants - Hindustan Times", "description": "The study is led by Indo-Canadian scientist, Dr Sriram Subramaniam, at Canada’s University of British Columbia, and published as a peer-reviewed article in the journal Nature Communications | World News", "url": "https://www.hindustantimes.com/world-news/scientists-discover-weak-spot-across-major-covid-19-variants-101660899584554.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/19/1600x900/13548314-1f9d-11ed-8c4d-fc6273086eb8_1660899579026.jpg", "publishedAt": "2022-08-19T08:59:43Z", "content": "Researchers, led by an Indo-Canadian scientist, say they have discovered a common vulnerability across major variants of Covid-19, including the more transmissible Omicron subvariants, according to a… [+2467 chars]"}, {"source": {"id": null, "name": "Kashmirobserver.net"}, "author": "KO", "title": "Smoking, Alcohol, High BMI Main Causes Of Global Cancer Deaths: Lancet - Kashmir Observer", "description": "Smoking, alcohol use, high body mass index (BMI), and other known risk factors were responsible for nearly 4.45 million global cancer deaths in 2019, according to study published in The Lancet jour…", "url": "https://kashmirobserver.net/2022/08/19/smoking-alcohol-high-bmi-main-causes-of-global-cancer-deaths-lancet/", "urlToImage": "https://i0.wp.com/kashmirobserver.net/wp-content/uploads/2020/07/Smokers-may-be-at-higher-risk-of-severe-COVID-19-infections.jpg?fit=700%2C467&ssl=1", "publishedAt": "2022-08-19T08:40:36Z", "content": "Representational Photo\r\nWashington- Smoking, alcohol use, high body mass index (BMI), and other known risk factors were responsible for nearly 4.45 million global cancer deaths in 2019, according to … [+5182 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Daily activities that can reduce risk of chronic diseases - Hindustan Times", "description": "Make these lifestyle changes right away to significantly reduce chances of developing the most common and deadly chronic diseases. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/daily-activities-that-can-reduce-risk-of-chronic-diseases-101660897752422.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/19/1600x900/chronic_disease_1660897896673_1660897904594_1660897904594.jpg", "publishedAt": "2022-08-19T08:37:49Z", "content": "Chronic illnesses popularly referred to as lifestyle diseases are often caused by people's faulty lifestyle choices. Not able to give up smoking, unhealthy eating habits, a job that requires one to c… [+2767 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Dentists should give antibiotics to high-risk patients to prevent heart infection: Study - Express Healthcare", "description": "University of Sheffield study finds that antibiotics reduce the risk of a life-threatening heart infection following invasive dental treatment - for high-risk patients", "url": "https://www.expresshealthcare.in/news/dentists-should-give-antibiotics-to-high-risk-patients-to-prevent-heart-infection-study/436041/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/02/28202447/admin-ajax-4-1-8.jpg", "publishedAt": "2022-08-19T07:31:02Z", "content": "University of Sheffield study finds that antibiotics reduce the risk of a life-threatening heart infection following invasive dental treatment – for high-risk patients\r\nPeople who are at high risk of… [+5896 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Combination of CT and X-ray chest detects early recurrence and second primary Lung cancer: LANCET - Medical Dialogues", "description": "A combination of thoracic CT scan with chest x-ray during follow-up helps in detecting early...", "url": "https://medicaldialogues.in/oncology/news/combination-of-ct-and-x-ray-chest-detects-early-recurrence-and-second-primary-lung-cancer-lancet-97720", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/10/182954-lung-cancer.jpg", "publishedAt": "2022-08-19T07:30:26Z", "content": "A combination of thoracic CT scan with chest x-ray during follow-up helps in detecting early recurrence and second primary lung cancer as per a recent trial that was published in the journal, 'The La… [+2906 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "ANI Press Release", "title": "HBOT-India launches one of the First Medical Grade Hyperbaric Oxygen Therapy in Gurugram, Delhi NCR, India - Business Standard", "description": "Gurugram (Haryana) [India], August 19 (ANI/BusinessWire India): In 2020, according to the International Diabetes Federation (IDF), 463 million people have diabetes in the world, 88 million people in the South Asia region, of this 88 million people,", "url": "https://www.business-standard.com/content/press-releases-ani/hbot-india-launches-one-of-the-first-medical-grade-hyperbaric-oxygen-therapy-in-gurugram-delhi-ncr-india-122081900430_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-08/19/full/20220819124844.jpg", "publishedAt": "2022-08-19T07:30:05Z", "content": "Gurugram (Haryana) [India], August 19 (ANI/BusinessWire India): In 2020, according to the International Diabetes Federation (IDF), 463 million people have diabetes in the world, 88 million people in … [+5081 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "GoKeto Gummies Reviews Capsules, Side Effects, And Where To Buy - The Tribune India", "description": "GoKeto Gummies are supplement capsules that put the body in a state of Ketosis with ease and thereby burn fat instead of carbs for energy, increasing mental clarity, fighting the risk of obesity and other weight-related conditions, and stabilizing appetite wi…", "url": "https://www.tribuneindia.com/news/brand-connect/goketo-gummies-reviews-capsules-side-effects-and-where-to-buy-423277", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_722362711.jpg", "publishedAt": "2022-08-19T07:30:00Z", "content": "GoKeto Gummies are supplement capsules that put the body in a state of Ketosis with ease and thereby burn fat instead of carbs for energy, increasing mental clarity, fighting the risk of obesity and … [+7066 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Cold atmospheric plasma- promising treatment of atopic dermatitis - Medical Dialogues", "description": "Atopic Dermatitis (AD) is  a chronic inflammatory skin disease. The main clinical treatment of AD...", "url": "https://medicaldialogues.in/dermatology/news/cold-atmospheric-plasma-promising-treatment-of-atopic-dermatitis-97718", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/13/180636-atopic-dermatitis.jpg", "publishedAt": "2022-08-19T07:03:58Z", "content": "Atopic Dermatitis (AD) is a chronic inflammatory skin disease. The main clinical treatment of AD was topical hormonal drug used. Although they have good curative effect, their side effects are also o… [+2140 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Bavarian Nordic signs up U.S. firm for packaging monkeypox vaccine - ETHealthWorld", "description": "The Danish company has doubled its capacity from before the outbreak started in May and expects to further increase it even as it explores more partnerships to improve global access to the vaccine.", "url": "https://health.economictimes.indiatimes.com/news/pharma/bavarian-nordic-signs-up-u-s-firm-for-packaging-monkeypox-vaccine/93653711", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93653711,imgsize-43356,width-1200,height-628,overlay-ethealthworld/bavarian-nordic-signs-up-u-s-firm-for-packaging-monkeypox-vaccine.jpg", "publishedAt": "2022-08-19T06:30:00Z", "content": "Copenhagen: Danish biotech firm Bavarian Nordic said on Thursday it has signed up a U.S.-based manufacturer to package its Jynneosmonkeypox vaccine and the production is expected to begin later this … [+1113 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Intensive gymming can damage your heart; tips to improve cardiac health - Hindustan Times", "description": "While moderate exercise can decrease your chances of heart attack, increasing the intensity of your workout can do the reverse and make you more susceptible to cardiac deaths. Here's what you need to do. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/intensive-gymming-can-damage-your-heart-tips-to-improve-cardiac-health-101660887769588.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/19/1600x900/gymming_thumb_1660888063421_1660888078405_1660888078405.jpg", "publishedAt": "2022-08-19T05:52:06Z", "content": "The activities that are beneficial for losing weight may not be necessarily good for your heart. Intensive gymming as a way to lose weight has come under the scanner after a spate of celebrities have… [+3305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Is pregnancy possible after multiple failed IVF attempts? Can your frozen eggs and sperm be as healthy later? - The Indian Express", "description": "‘You must get married or begin a family only when you feel prepared to do so. In urban centres, it has become increasingly common for both partners to become financially independent first before committing to a family. But they can plan their fertility journe…", "url": "https://indianexpress.com/article/lifestyle/health-specials/pregnancy-ivf-attempts-frozen-eggs-sperm-8098949/", "urlToImage": "https://images.indianexpress.com/2022/08/Untitled-design-66.png", "publishedAt": "2022-08-19T05:04:34Z", "content": "1) After repeated attempts, which are also cost-consuming, many couples opt out of in-vitro fertilisation (IVF) treatments, losing their hope for pregnancy. Can pregnancy be successful after multiple… [+9642 chars]"}, {"source": {"id": null, "name": "VOGUE India"}, "author": "Tatiana Dias", "title": "Does the use of sunscreen deplete vitamin D levels? - VOGUE India", "description": "To sunscreen or not to sunscreen, experts dive into the truth behind these claims", "url": "https://www.vogue.in/beauty/content/does-the-use-of-sunscreen-deplete-vitamin-d-levels", "urlToImage": "https://assets.vogue.in/photos/62f35fa873e663a411080f60/16:9/w_1280,c_limit/Alia%20Bhatt.jpg", "publishedAt": "2022-08-19T04:33:44Z", "content": "Sunscreen is sacrosanct. Sunscreen is a religion. Sunscreen can never be missed. It is a known fact that this one skincare product holds powers that no other does. It is literally the golden child an… [+3441 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Successfully engineered Immune cell model way for new treatments amongst immunocompromised children - Medical Dialogues", "description": "The research, led by the Murdoch Children's Research Institute and published in Stem Cell Reports,...", "url": "https://medicaldialogues.in/mdtv/pediatrics-neonatology/videos/successfully-engineered-immune-cell-model-way-for-new-treatments-amongst-immunocompromised-children-97726", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/19/183717-blur-background-44.jpg", "publishedAt": "2022-08-19T04:00:04Z", "content": "The research, led by the Murdoch Children's Research Institute and published in Stem Cell Reports, used cutting edge stem cell technology to better understand how the infection invades immune cells a… [+1598 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Our Correspondent", "title": "Scared of cholesterol? Know how to regulate it by changing your diet - Onmanorama", "description": "The production of cholesterol would be reduced by lowering the intake of food items that are loaded with carbohydrates, fat and protein.", "url": "https://www.onmanorama.com/food/features/2022/08/18/diet-changes-to-control-high-cholesterol.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/food/features/images/2022/8/18/healthy-food-diet-olive-oil.jpg", "publishedAt": "2022-08-19T00:47:04Z", "content": "Medical experts say that cholesterol is one of the most misunderstood terms. They vow that cholesterol is not an enemy but a friend. However, it becomes a villain when it is not regulated in the righ… [+3520 chars]"}, {"source": {"id": null, "name": "Diagnostic Imaging"}, "author": "Jeff Hall", "title": "PET Imaging Study Links COVID-19 to Reduced Myocardial Flow Reserve - Diagnostic Imaging", "description": "Emerging research from a positron emission tomography (PET) study suggests that prior COVID-19 infection can lead to a 30 percent increased risk of lower myocardial flow reserve in patients with cardiovascular risk factors ranging from diabetes to coronary ar…", "url": "https://www.diagnosticimaging.com/view/pet-imaging-study-links-covid-19-to-reduced-myocardial-flow-reserve", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/diag_imaging/edeec6f67c4c6b9a9c81fa75aa6b29b6b32c3499-940x788.png?fit=crop&auto=format", "publishedAt": "2022-08-18T23:20:40Z", "content": "In what researchers are calling particularly relevant to long-haul COVID-19, a new study demonstrates that people with prior COVID-19 infection and cardiovascular risk factors have a significantly hi… [+2224 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Emergence of vaccine-derived poliovirus in high-income settings in the absence of oral polio vaccine use - The Lancet", "description": "On June 22, 2022, the UK Health Security Agency announced that vaccine-derived poliovirus\ntype 2 (VDPV2) had been repeatedly detected in sewage in London, UK.1 Several weeks\nlater, the New York State Department of Health reported a case of acute flaccid paral…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01582-3/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/37661e7b-319a-4a1c-863a-dfbbee0768c5/fx1.jpg", "publishedAt": "2022-08-18T22:40:13Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the association between COVID-19 and thrombotic events? - News-Medical.Net", "description": "In a new study, researchers assessed the association of COVID-19 and influenza with thrombotic events among patients.", "url": "https://www.news-medical.net/news/20220818/What-is-the-association-between-COVID-19-and-thrombotic-events.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_722808_16608550648726062.jpg", "publishedAt": "2022-08-18T21:06:00Z", "content": "In a recent study published in the JAMA Network journal, researchers assessed the association of coronavirus disease 2019 (COVID-19) and influenza with thrombotic events among patients.\r\nStudy: Assoc… [+5674 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Eva johansen, Simone Buzwell", "title": "Don't blame women for low libido. Sexual sparks fly when partners do their share of chores – including calling the plumber - The Conversation", "description": "Women in equal relationships are more satisfied with their relationships and, in turn, feel more sexual desire than those in unequal relationships.", "url": "https://theconversation.com/dont-blame-women-for-low-libido-sexual-sparks-fly-when-partners-do-their-share-of-chores-including-calling-the-plumber-185401", "urlToImage": "https://images.theconversation.com/files/479547/original/file-20220817-13-j51tsx.jpg?ixlib=rb-1.1.0&rect=0%2C860%2C5805%2C2902&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-08-18T20:05:47Z", "content": "When a comic about mental load went viral in 2017, it sparked conversations about the invisible workload women carry. Even when women are in paid employment, they remember their mother-in-laws birthd… [+6382 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Human brain’s cerebral cortex mapped by scientists - ThePrint", "description": "Washington [US], August 18 (ANI): The surface of the cortex of the young human brain has been mapped by scientists at the UNC School of Medicine with unprecedented resolution. It revealed the development of key functional regions from two months before birth …", "url": "https://theprint.in/science/human-brains-cerebral-cortex-mapped-by-scientists/1089154/", "urlToImage": null, "publishedAt": "2022-08-18T18:13:31Z", "content": "Washington [US], August 18 (ANI): The surface of the cortex of the young human brain has been mapped by scientists at the UNC School of Medicine with unprecedented resolution. It revealed the develop… [+4441 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Krishna Ramanujan", "title": "Study identifies gut bacteria that regulate cholesterol - Phys.org", "description": "Certain species of bacteria in the gut interact with and help balance levels of dietary cholesterol by using it to create a molecule that plays important roles in human health, according to a study published August 18 in Nature Microbiology.", "url": "https://phys.org/news/2022-08-gut-bacteria-cholesterol.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-identifies-gut-b.jpg", "publishedAt": "2022-08-18T17:07:03Z", "content": "Certain species of bacteria in the gut interact with and help balance levels of dietary cholesterol by using it to create a molecule that plays important roles in human health, according to a study p… [+4556 chars]"}, {"source": {"id": null, "name": "HospiMedica"}, "author": "HospiMedica International", "title": "New Ablation Technique Shows Promise for Hard-to-Treat Ventricular Tachycardia Heart Rhythms - HospiMedica", "description": "A new ablation technique for patients with ventricular tachycardia has been used in a first-in-human multicenter trial that involved several methods to directly eliminate abnormal heart tissue which causes life-threatening rhythm.", "url": "https://www.hospimedica.com/critical-care/articles/294794293/new-ablation-technique-shows-promise-for-hard-to-treat-ventricular-tachycardia-heart-rhythms.html", "urlToImage": "https://www.hospimedica.com/images/stories/articles/article_images/2022-08-18/SDD-294794293.jpg", "publishedAt": "2022-08-18T16:52:42Z", "content": "Therapies of medication and traditional ablation, which uses heat or cold to scar small areas of heart tissue, may not be enough to prevent ventricular tachycardia, an abnormally rapid heart rhythm t… [+2738 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Breast cancer: Government data shows fatal disease's increasing prevalence - India Today", "description": "Breast cancer is the most prevalent form of cancer worldwide. More than two lakh women in India were diagnosed with breast cancer in 2020.", "url": "https://www.indiatoday.in/diu/story/breast-cancer-government-data-shows-fatal-disease-s-increasing-prevalence-1989694-2022-08-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/breast-647x363.png?BpYOIxHg0tScqfqVk8hJNwgayJredAP.", "publishedAt": "2022-08-18T16:30:20Z", "content": "Breast cancer is one of the most prevalent and fatal forms of cancer. Government data shows that, on average, nearly four out of ten women diagnosed with breast cancer succumbed to the disease in Ind… [+5254 chars]"}, {"source": {"id": null, "name": "Sparkchronicles.com"}, "author": null, "title": "Measuring diabetes: here's when and how to do it, here's the guide - Spark Chronicles", "description": "Glycemic self-monitoring is necessary and indispensable for the patient who has to coexist with a ch", "url": "https://sparkchronicles.com/measuring-diabetes-heres-when-and-how-to-do-it-heres-the-guide/", "urlToImage": "https://www.giornal.it/wp-content/uploads/2022/05/Glucometro-per-monitorare-la-glicemia-compressed.jpg", "publishedAt": "2022-08-18T15:55:47Z", "content": "Glycemic self-monitoring is necessary and indispensable for the patient who has to coexist with a chronic disease, which must be assisted for life, namely diabetes. Teaching the person to carry out g… [+2077 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "Mizoram reports first case of Japanese Encephalitis - Northeast Now", "description": "Mizoram on Thursday reported its first case of Japanese Japanese Encephalitis (JE), that's spread through mosquito bites.", "url": "http://nenow.in/north-east-news/mizoram/mizoram-reports-first-case-of-japanese-encephalitis.html", "urlToImage": "https://nenow.in/wp-content/uploads/2019/07/Japanese-Encephalitis.jpg", "publishedAt": "2022-08-18T15:55:45Z", "content": "AIZAWL:  Mizoram on Thursday reported its first case of Japanese Encephalitis (JE), a viral brain infection that’s spread through mosquito bites.\r\nState nodal officer of the Integrated Disease Survei… [+1883 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Women face worse complications after peripheral vascular intervention compared to men: Circulation - Medical Dialogues", "description": "Women compared to men had twice as much bleeding requiring transfusion, higher mortality, and more...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/women-face-worse-complications-after-peripheral-vascular-intervention-compared-to-men-circulation-97682", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/18/183583-peripheral-vascular-disease.jpg", "publishedAt": "2022-08-18T14:30:04Z", "content": "Women compared to men had twice as much bleeding requiring transfusion, higher mortality, and more amputations. \r\nUSA: Women undergoing lower-extremity peripheral vascular intervention (PVI) are at h… [+2217 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "IANS", "title": "56% people infected with Omicron didn't know it: Study - OTV News", "description": "The findings, published in JAMA Network Open, showed that only 44 per cent of participants with newly positive SARS-CoV-2 antibodies had awareness of being infected with the virus. The majority (56 per cent) were unaware of any recent Covid-19 infection.", "url": "https://odishatv.in/news/covid-19/56-people-infected-with-omicron-didn-t-know-it-study-183422", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1654671836.jpg", "publishedAt": "2022-08-18T13:48:11Z", "content": "The majority of people who were likely infected with the Omicron variant of SARS-CoV-2, the virus that causes Covid-19, did not know they had the virus, according to a new study.\r\nResearchers from Sm… [+2143 chars]"}, {"source": {"id": null, "name": "Lokmattimes.com"}, "author": "Lokmat English Desk", "title": "WHO Says Vaccines Not 100% Effective on Monkeypox as Global Cases Increase - Lokmat", "description": "WHO Says Vaccines Not 100% Effective on Monkeypox as Global Cases Increase", "url": "https://www.lokmattimes.com/photos/health/who-says-vaccines-not-100-effective-on-monkeypox-as-global-cases-increase/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/images/686x514/monkeypox3_202205823970.png", "publishedAt": "2022-08-18T11:32:03Z", "content": "But in May, cases of the disease, which causes fever, muscular aches and large boil-like skin lesions, began spreading rapidly around the world, mainly among men who have sex with men."}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Dr. Michael Daignault, USA TODAY", "title": "Breast cancer, other screenings skipped during pandemic. What to know. - USA TODAY", "description": "Primary care doctors face a daunting backlog of screening tests for their patients. Here's what you need to know to make sure you're up-to-date.", "url": "https://www.usatoday.com/story/life/health-wellness/2022/08/18/breast-cancer-lung-colon-screenings-skipped-pandemic/10326436002/", "urlToImage": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2022/04/05/USATODAY/usatsports/imageForEntry94-QTV.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2022-08-18T11:03:20Z", "content": "At the start of the COVID-19 pandemic, we saw a drastic decline in the number of patients with non-COVID medical emergencies. A CDC study found that overall ER visits declined 42% from March to April… [+6095 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Losing weight after 60: Healthy diet plan and exercise tips for seniors - Hindustan Times", "description": "Being overweight makes management of many chronic diseases like hypertension, diabetes etc difficult for elderly people but losing weight after 60 is also very tricky. Any rigorous form of weight loss may prove harmful. Here are some healthy diet plan and exe…", "url": "https://www.hindustantimes.com/lifestyle/health/losing-weight-after-60-healthy-diet-plan-and-exercise-tips-for-seniors-101660814803502.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/18/1600x900/pexels-rodnae-productions-7867632_1660815140062_1660815155698_1660815155698.jpg", "publishedAt": "2022-08-18T10:48:00Z", "content": "A recent survey has shown that approximately 23% of the elderly in India are overweight while the percentage is higher in western countries. Being overweight makes management of many chronic diseases… [+4692 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shivi Kataria", "title": "Transcranial direct current stimulation may be beneficial for refractory auditory hallucinations in... - Medical Dialogues", "description": "Despite adequate pharmacological therapy, up to 30% of schizophrenia patients suffer from...", "url": "https://medicaldialogues.in/psychiatry/news/transcranial-direct-current-stimulation-may-be-beneficial-for-refractory-auditory-hallucinations-in-schizophrenia-97694", "urlToImage": "https://medicaldialogues.in/h-upload/2021/04/21/151472-20130812-schizophrenia-lowres.jpg", "publishedAt": "2022-08-18T10:29:41Z", "content": "Despite adequate pharmacological therapy, up to 30% of schizophrenia patients suffer from treatment-refractory auditory hallucinations (TRAH). Studies defining the role of transcranial direct current… [+2311 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Researchers Find Cheat Meals Associated With Eating Disorders - News18", "description": "Based on the reports that have come from the study, it can be noted that most amounts of cheat meals are usually consumed by men.", "url": "https://www.news18.com/news/lifestyle/researchers-find-cheat-meals-associated-with-eating-disorders-5775685.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-18t154320.723-166081770116x9.png", "publishedAt": "2022-08-18T10:15:29Z", "content": "Over the course of a year, more than half of men, women, and transgender or gender nonconforming participants engaged in at least one cheat meal the practice of deviating from ones established dietar… [+2309 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Monkeypox cases jumped 20% in the last week to 35000 across 92 countries: WHO - Arirang News", "description": "WHO '원숭이두창 발병 일주일에 20%씩 증가…전세계 3만5천건'Worldwide, cases of monkeypox have jumped by 20 percent in the last week almost 7-thousand-500 new cases,... bringing th...", "url": "https://www.youtube.com/watch?v=HtkEmws6IOQ", "urlToImage": "https://i.ytimg.com/vi/HtkEmws6IOQ/maxresdefault.jpg", "publishedAt": "2022-08-18T09:05:35Z", "content": null}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "How post-Covid loss of smell or taste affects cognition - Daijiworld.com", "description": "Sao Paulo, Aug 18 (IANS): Patients with the most severe post-Covid smell and taste disorders are likely to perform worst in cognitive tests, especially when these involve memory, finds a study strengthening the hypothesis that loss of smell could be an early …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=990648", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-08-18T08:30:16Z", "content": "Sao Paulo, Aug 18 (IANS): Patients with the most severe post-Covid smell and taste disorders are likely to perform worst in cognitive tests, especially when these involve memory, finds a study streng… [+2780 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Tanushree Banerjee", "title": "Love for pizzas & doughnuts is hurting your brain. Replace fried food with baked items, keep nuts & berrie - Economic Times", "description": "Last month, a University of South Australia study revealed that eating fatty meals can damage cognitive function.", "url": "https://economictimes.indiatimes.com/magazines/panache/love-for-pizzas-doughnuts-is-hurting-your-brain-replace-fried-food-with-baked-items-keep-nuts-berries-handy-for-snacking/articleshow/93635627.cms", "urlToImage": "https://img.etimg.com/thumb/msid-93635866,width-1070,height-580,imgsize-35706,overlay-etpanache/photo.jpg", "publishedAt": "2022-08-18T08:11:00Z", "content": "Two years of the Covid pandemic have left us with a lesson of a lifetime health is wealth. \r\nPandemics will come and go, and only your health can get you through such a crisis. One of the most import… [+7083 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Molbio Diagnostics unveils Truenat RT-PCR test for HIV - Medical Dialogues", "description": "Company's Chief Technical Officer Chandrasekhar Nair said, \"We needed an effective means of testing...", "url": "https://medicaldialogues.in/news/industry/pharma/molbio-diagnostics-unveils-truenat-rt-pcr-test-for-hiv-1-hiv-2-97669", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/09/182895-hiv-1.jpg", "publishedAt": "2022-08-18T06:36:45Z", "content": "Panaji: Molbio Diagnostics, an in-vitro diagnostics company and inventor of Truenat technology has announced the launch of a new test for differential diagnosis of HIV 1 and HIV 2 with viral loads wi… [+1365 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Bhagyashree", "title": "Long Covid effect: Apart from cough-fatigue, patients recovering from corona may have this serious disease related to heart - News Day Express", "description": "Coronavirus is a deadly virus and it does not leave behind the patients even after recovery. In people who have had corona and their report has come", "url": "https://www.newsdayexpress.com/lifestyle/health/long-covid-effect-apart-from-cough-fatigue-patients-recovering-from-corona-may-have-this-serious-disease-related-to-heart/", "urlToImage": "https://static.langimg.com/thumb/msid-93621961,width-680,resizemode-3/navbharat-times.jpg", "publishedAt": "2022-08-18T02:30:01Z", "content": "Coronavirus is a deadly virus and it does not leave behind the patients even after recovery. In people who have had corona and their report has come negative, some symptoms of corona can last for a l… [+2466 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Amid shortage of AIDS drug, UT relies on nearby states - The Tribune India", "description": "Reeling under a shortage of medicines used in the treatment of patients infected with HIV, the Chandigarh Health Department is relying on other states to meet the demand.", "url": "https://www.tribuneindia.com/news/chandigarh/amid-shortage-of-aids-drug-ut-relies-on-nearby-states-422819", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_359732719.jpg", "publishedAt": "2022-08-18T01:57:00Z", "content": "Tribune News Service\r\nNaina Mishra\r\nChandigarh, August 17\r\nReeling under a shortage of medicines used in the treatment of patients infected with HIV, the Chandigarh Health Department is relying on ot… [+2249 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Malaria vax to benefit millions: Unicef - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "United Nations, Aug 17: British pharmaceutical company GSK has been awarded a contract to produce the world’s first malaria vaccine so that millions more children will be protected against the killer disease, the UN Children’s Fund (UNICEF) announced. The lan…", "url": "https://www.dailyexcelsior.com/malaria-vax-to-benefit-millions-unicef/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/08/download-15-11.jpg", "publishedAt": "2022-08-17T19:28:40Z", "content": "United Nations, Aug 17: British pharmaceutical company GSK has been awarded a contract to produce the world’s first malaria vaccine so that millions more children will be protected against the killer… [+1873 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Century-old TB vaccine may protect against infectious diseases like COVID-19 - UNTV News and Rescue", "description": "A new study has found that a century-old tuberculosis vaccine may offer a measure of protection against coronavirus.Subscribe to our official YouTube channel...", "url": "https://www.youtube.com/watch?v=zHQgjcIQP4Y", "urlToImage": "https://i.ytimg.com/vi/zHQgjcIQP4Y/hqdefault.jpg", "publishedAt": "2022-08-17T15:00:40Z", "content": null}]}