{"status": "ok", "totalResults": 64, "articles": [{"source": {"id": null, "name": "Medscape"}, "author": "Pooja Shah", "title": "Your Patients Are Rotting Their Teeth With Vaping - Medscape", "description": "People who vape have a higher likelihood of developing tooth decay that could lead to cavities, a new study found.", "url": "https://www.medscape.com/viewarticle/984557", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_210910_teen_vaping_800x450.jpg", "publishedAt": "2022-11-23T18:15:02Z", "content": "Karina Irusa\r\nPrimary care physicians, and especially pediatricians, should consider telling their patients about the long-term oral health problems associated with vaping. \r\nA new study found that p… [+3570 chars]"}, {"source": {"id": null, "name": "Urologytimes.com"}, "author": "Urology Times staff", "title": "Overview of kidney cancer epidemiology underscores importance of modifiable risk factors - Urology Times", "description": "\"What was surprising to me is that the incidence [of kidney cancer] has leveled off over the past 2 years,\" says Laura Bukavina, MD, MPH.", "url": "https://www.urologytimes.com/view/overview-of-kidney-cancer-epidemiology-underscores-importance-of-modifiable-risk-factors", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/urologytimes/67c4173f176fe86e3efbc9529e9e3d46f5319411-356x200.jpg?fit=crop&auto=format", "publishedAt": "2022-11-23T17:02:58Z", "content": "In this interview, Laura Bukavina, MD, MPH; and Sarah P. Psutka, MD, MS, discuss Epidemiology of Renal Cell Carcinoma: 2022 Update, which was recently published in European Urology.1 Bukavina is a ur… [+12071 chars]"}, {"source": {"id": null, "name": "Nsoj.in"}, "author": "Sai", "title": "Detrimental effects of obsessive workouts - National School of Journalism (NSoJ)", "description": "New link emerging between strenuous exercise and adverse outcomes.", "url": "https://www.nsoj.in/stories/detrimental-effects-of-obsessive-workouts", "urlToImage": "https://s3.ap-south-1.amazonaws.com/nsojbanglore/stories/blog_images/000/001/030/original/s1.png?1669222179", "publishedAt": "2022-11-23T16:50:27Z", "content": "Perfect lean arms, deleted muffin tops, fat bellies, love handles, and toned legs are certain features that Gen Z girls crave for, while the men crave for ripped six packs and bulky muscular arms. Ce… [+3898 chars]"}, {"source": {"id": null, "name": "Northwestern.edu"}, "author": null, "title": "Vitamin D fails to reduce statin-associated muscle pain - Northwestern Now", "description": "Study is the first placebo-controlled, randomized clinical trial to study this", "url": "https://news.northwestern.edu/stories/2022/11/vitamin-d-fails-to-reduce-statin-associated-muscle-pain/", "urlToImage": "https://news.northwestern.edu/assets/Stories/2022/11/Vitamin-D-pill__ScaleWidthWzQ4MF0.jpg", "publishedAt": "2022-11-23T16:31:25Z", "content": "Patients who take statins to lower high cholesterol levels often complain of muscle pains, which can lead them to stop taking the highly effective medication and put them at greater risk of heart att… [+4291 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "8-Month-Old Child Dies Of Measles In Mumbai, Centre Issues Advisory - NDTV", "description": "An 8-month-old child was identified as the latest casualty of a measles outbreak in Mumbai, taking the total number of deaths to 12 on Wednesday, as the central government expressed concern at the rising cases and issued an advisory.", "url": "https://www.ndtv.com/india-news/8-month-old-child-dies-in-mumbai-of-suspected-measles-3547345", "urlToImage": "https://c.ndtvimg.com/2022-11/na229hq4_measles-generic-istock_625x300_18_November_22.jpg", "publishedAt": "2022-11-23T15:46:00Z", "content": "<li>Mumbai recorded 13 new cases of measles, taking the tally of infections since the beginning of the year to 233, authorities said.\r\n</li><li>The 8-month-old boy from neighbouring Bhiwandi died in … [+1653 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Benzodiazepines linked to increased risk for drug overdose among young people - Healio", "description": "Benzodiazepines, compared with alternative pharmacologic treatments for common sleep disorders, were linked to an increased risk for drug overdoses among young people, researchers reported in JAMA Network Open.\nBenzodiazepines are prescribed for the treatment…", "url": "https://www.healio.com/news/psychiatry/20221123/benzodiazepines-linked-to-increased-risk-for-drug-overdose-among-young-people", "urlToImage": "https://www.healio.com/~/media/slack-news/psychiatry/misc/other/sleeping_child_194913328.jpeg", "publishedAt": "2022-11-23T15:38:35Z", "content": "Benzodiazepines, compared with alternative pharmacologic treatments for common sleep disorders, were linked to an increased risk for drug overdoses among young people, researchers reported in JAMA Ne… [+2740 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "COVID-19 May Increase Risk Of Stroke In Children: Study - NDTV", "description": "Children may be at increased risk of stroke after COVID-19 infection, according to a small study conducted in the US.", "url": "https://www.ndtv.com/world-news/covid-19-may-increase-risk-of-stroke-in-children-study-3546112", "urlToImage": "https://c.ndtvimg.com/2020-04/aojn21t8_-us-coronavirus-hospital-new-york-afp_625x300_03_April_20.jpg", "publishedAt": "2022-11-23T14:48:56Z", "content": "The study's results are in contrast to the findings of a 2021 international study. (Representational)\r\nWashington: Children may be at increased risk of stroke after COVID-19 infection, according to a… [+2452 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Machine learning gives nuanced view of Alzheimer's stages | Cornell Chronicle - Cornell Chronicle", "description": "A Cornell-led collaboration used machine learning to pinpoint the most accurate means, and timelines, for anticipating the advancement of Alzheimer’s disease.", "url": "https://news.cornell.edu/stories/2022/11/machine-learning-gives-nuanced-view-alzheimers-stages", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/istock-1179697528-machine-learning-1280x720_0.jpg?itok=s3Y43vPe", "publishedAt": "2022-11-23T14:38:23Z", "content": "A Cornell-led collaboration used machine learning to pinpoint the most accurate means, and timelines, for anticipating the advancement of Alzheimers disease in people who are either cognitively norma… [+4875 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Diabetes: causes, symptoms and complications - Emergency Live International", "description": "Diabetes is a chronic disease characterised by an increase in glycaemia, i.e. the concentration of sugar in the blood that the body is...", "url": "https://www.emergency-live.com/health-and-safety/diabetes-causes-symptoms-and-complications/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2020/09/diabetes_diabetics_kidney_failure_autophagy.png", "publishedAt": "2022-11-23T14:35:11Z", "content": "A condition of hyperglycaemia occurs when blood sugar exceeds 100 mg/dl on an empty stomach or 140 mg/dl two hours after a meal.\r\nThis condition may depend on a defect in the function or a deficit in… [+10094 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study: Persistent asthma associated with plaque buildup in carotid arteries - ThePrint", "description": "Dallas (Texas) [US], November 23 (ANI): Adults with chronic asthma may have a higher risk of heart attack or stroke due to carotid artery plaque development. The new study was just released in the American Heart Association’s open-access, peer-reviewed public…", "url": "https://theprint.in/health/study-persistent-asthma-associated-with-plaque-buildup-in-carotid-arteries/1232127/", "urlToImage": null, "publishedAt": "2022-11-23T14:13:30Z", "content": "Dallas (Texas) [US], November 23 (ANI): Adults with chronic asthma may have a higher risk of heart attack or stroke due to carotid artery plaque development.\r\nThe new study was just released in the A… [+5969 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Alarming increase in lung cancer among women, children, and non-smokers: Study - Hindustan Times", "description": "In a study headed by Dr. Arvind Kumar from Medanta Hospital, it was discovered that a growing percentage of patients who presented to the outpatient clinic were non-smokers who belonged to a younger age group. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/alarming-increase-in-lung-cancer-among-women-children-and-non-smokers-study-101669210509573.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/23/1600x900/_8834a5f0-f820-11e7-95e6-04e0a17510b6_1669210714431_1669210714431.jpg", "publishedAt": "2022-11-23T13:44:45Z", "content": "The study conducted by a team led by Dr Arvind Kumar from Medanta hospital observed that an increasing number of patients treated in the outpatient clinic were non-smokers of a relatively younger age… [+4180 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "For The First Time, Scientists Identify How Migraine Affects Brain - NDTV", "description": "Researchers said the discovery could one day lead to new treatments for the chronic condition.", "url": "https://www.ndtv.com/science/for-the-first-time-scientists-identify-how-migraine-affects-brain-3546833", "urlToImage": "https://i.ndtvimg.com/i/2016-04/brain-generic_650x400_41461054329.jpg", "publishedAt": "2022-11-23T12:37:33Z", "content": "An MRI scan revealed enlarged perivascular spaces in brain. (Representational Photo)\r\nMigraine doesn't just give you a bad headache, it can also have significant impact on daily life. An episode usua… [+2210 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Antioxidant flavonols intake linked to slower mental decline : Study - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/antioxidant-flavonols-intake-linked-to-slower-mental-decline-study/463693.html", "urlToImage": "", "publishedAt": "2022-11-23T12:29:34Z", "content": "Washington, Nov 23 (PTI) People who eat or drink more foods with antioxidant flavonols, found in several fruits, vegetables, tea and wine, may have a slower rate of memory decline, according to a stu… [+371 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "MPOX: Monkeypox Set To Be Renamed To Destigmatise Virus - odishabytes - OdishaBytes", "description": "Washington: Monkeypox is likely to get a new name soon. The World Health Organization (WHO) is planning to rename it as MPOX to destigmatise the virus, Politico reported. There has been growing pressure from officials of the Joe Biden-headed US government, wh…", "url": "https://odishabytes.com/mpox-monkeypox-set-to-be-renamed-to-destigmatise-virus/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2022/05/monkey-e1653138679955.jpg", "publishedAt": "2022-11-23T12:00:09Z", "content": "Washington: Monkeypox is likely to get a new name soon.\r\nThe World Health Organization (WHO) is planning to rename it as MPOX to destigmatise the virus, Politico reported.\r\nThere has been growing pre… [+931 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Type 2 diabetes linked with gestational diabetes in South Asian women, says study - ETHealthWorld", "description": ".The team measured the genetic risk of type 2 diabetes using a polygenic risk score, which estimates the hereditary risk of an individual developing a disease based on the number of risk alleles they have. The researchers found that South Asian women with hig…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/type-2-diabetes-linked-with-gestational-diabetes-in-south-asian-women-says-study/95716051", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95716051,imgsize-22454,width-1200,height-628,overlay-ethealthworld/type-2-diabetes-linked-with-gestational-diabetes-in-south-asian-women-says-study.jpg", "publishedAt": "2022-11-23T11:45:00Z", "content": "Canada: Women of South Asian origin may be more likely to experience gestational diabetes due to the same complex genetics that increases their chance of acquiring type 2 diabetes, according to a stu… [+3472 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Did You Know Honey Could Reduce The Risk Of Cardiovascular Diseases? - News18", "description": "The antioxidants such as Vitamin C, flavonoids, monophenolics, and polyphenolics present in honey aid in preventing heart diseases.", "url": "https://www.news18.com/news/india/did-you-know-honey-could-reduce-the-risk-of-cardiovascular-diseases-6452713.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/11/untitled-design-16-15-166920212516x9.png", "publishedAt": "2022-11-23T11:16:00Z", "content": "In todays day and age of deteriorating lifestyles, heart attacks and strokes have been shockingly common in the younger age groups too. However, certain foods have proven to be effective in reducing … [+1639 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Patrick Lee", "title": "How New Doctors Feel; Bacterial Deaths; and Youth Sexuality - Medscape", "description": "The top 3 things you should know to start your day.", "url": "https://www.medscape.com/viewarticle/984421", "urlToImage": "https://img.medscape.com/thumbnail_library/3_Things_Thumbnail_800x450.png", "publishedAt": "2022-11-23T11:03:25Z", "content": "New Doctors Find Fulfillment and Frustration\r\nNew doctors say patient care is their biggest joy but add that they are frustrated by social factors. Some 27% of new doctors say that working with patie… [+3065 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Antibiotic use in gastrointestinal surgery patients at a Vietnamese national hospital - BMC Gastroenterology - BMC Gastroenterology", "description": "Background Invasive gastrointestinal surgery may be performed as an open or endoscopic procedure, such as laparoscopic semi-colon surgery, laparoscopic appendectomy, laparoscopic gastrectomy, and anal surgery, among other such operations. Regardless of the ap…", "url": "https://bmcgastroenterol.biomedcentral.com/articles/10.1186/s12876-022-02587-1", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12876.jpg", "publishedAt": "2022-11-23T10:45:57Z", "content": null}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Characteristics of bloodstream infection and initial antibiotic use in critically ill burn patients and their impact on patient prognosis | Scientific Reports - Nature.com", "description": "Scientific Reports - Characteristics of bloodstream infection and initial antibiotic use in critically ill burn patients and their impact on patient prognosis", "url": "https://www.nature.com/articles/s41598-022-24492-z", "urlToImage": null, "publishedAt": "2022-11-23T09:56:10Z", "content": "Infection, especially bloodstream infection, is the main cause of death in burn patients18. With the increasing use of antibiotics, bacterial resistance in burn patients is gradually becoming severe1… [+15175 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Discovery suggests new way to target mantle cell lymphoma - ANI News", "description": "A form of blood cancer known as mantle cell lymphoma is critically dependent on a protein that coordinates gene expression, such that blocking its activity with an experimental drug dramatically slows the growth of this lymphoma in preclinical tests, accordin…", "url": "https://www.aninews.in/news/health/discovery-suggests-new-way-to-target-mantle-cell-lymphoma20221123150434", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221123085923.jpg", "publishedAt": "2022-11-23T09:34:00Z", "content": "Washington [US], November 23 (ANI): A form of blood cancer known as lymphoma\"&gt;mantle cell lymphoma is critically dependent on a protein that coordinates gene expression, such that blocking its act… [+3111 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "Vitamin D Foods: Health Benefits, Food Sources,and More - Sportskeeda", "description": "Vitamin D is a fat-soluble vitamin that is essential for bone density and maintenance of mineral balance in our bodies. The health benefits of vitamin D are well known.", "url": "https://www.sportskeeda.com/health-and-fitness/vitamin-d-foods-health-benefits-food-sources-more", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/abf8a-16691569343706-1920.jpg", "publishedAt": "2022-11-23T09:30:00Z", "content": "Vitamin D is a fat-soluble vitamin that is essential for bone density and maintenance of mineral balance in our bodies. The health benefits of vitamin D are well known. This vitamin also helps in the… [+4857 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers find link between genetic factors and Autism Spectrum Disorder - ETHealthWorld", "description": "This neurodevelopmental disorder is associated with a wide range of physiological and behavioural symptoms, including deficits in communication, cognition and motor function, as well as seizures and hyperactivity.", "url": "https://retail.economictimes.indiatimes.com/news/diagnostics/researchers-find-link-between-genetic-factors-and-autism-spectrum-disorder/95710801", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95710801,imgsize-190748,width-1200,height-628,overlay-ethealthworld/researchers-find-link-between-genetic-factors-and-autism-spectrum-disorder.jpg", "publishedAt": "2022-11-23T09:20:00Z", "content": "Toronto: Researchers have found correlations between genetic variables and Autism Spectrum Disorder (ASD) that were previously unknown.This neurodevelopmental disorder is associated with a wide range… [+3349 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Poor diet can damage blood vessels, lead to metabolic dysfunction: Study - News9 LIVE", "description": "The researchers probed whether a healthy diet could reduce the disease-causing molecular signatures induced by a bad diet", "url": "https://www.news9live.com/health/health-conditions/poor-diet-can-damage-blood-vessels-lead-to-metabolic-dysfunction-study-209605", "urlToImage": "https://media.news9live.com/h-upload/2022/11/23/584457-434273721102ffb5bdc6db.jpg", "publishedAt": "2022-11-23T09:12:39Z", "content": "Metabolic diseases affect blood vessels in different organs of our body, revealed a research team. For instance, blood vessels in the liver and fat tissue struggle to process the excess lipids, kidne… [+1714 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "High salt diet: 4 ways eating too much salt can affect your brain - Hindustan Times", "description": "Eating excessive salt has been linked to many diseases like high blood pressure, heart disease and stroke. Now a recent study has talked about its impact on brain and how it raises stress levels. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/high-salt-diet-4-ways-eating-too-much-salt-can-affect-your-brain-101669193696012.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/23/1600x900/salt_thumb_1669194059653_1669194078089_1669194078089.jpg", "publishedAt": "2022-11-23T09:11:14Z", "content": "We are eating way too much salt than we should thanks to all the processed food around us that we munch for convenience and which contains high amounts of salt. Eating excessive salt has been linked … [+3014 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr Rupali Bhoye talks about stigma around diabetes - Zee News", "description": "A Contact-Based Educational Approach. Clin Diabetes. 2019 Apr;37(2):108-115. Liu NF, Brown AS, Folias AE, et al. Stigma in People With Type 1 or Type 2 Diabetes. Clin Diabetes. 2017 Jan;35(1):27-34. CDC.", "url": "https://zeenews.india.com/india/dr-rupali-bhoye-talks-about-stigma-around-diabetes-2539066.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/23/1120715-dr-rupali-bhoye.jpg", "publishedAt": "2022-11-23T08:13:10Z", "content": "Stigma is an unfortunate reality in several medical conditions, including diabetes. Stigma is negative attitudes, judgment, discrimination, or prejudice against someone because of diabetes. More than… [+2877 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Tremor, schizophrenia, restless legs syndrome major risk factors for incident Parkinson's disease: JAMA - Medical Dialogues", "description": "A new study published in the Journal of American Medical Association neurology suggests that the connections reported in a representative population between Parkinson disease (PD) and specific", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/tremor-schizophrenia-restless-legs-syndrome-major-risk-factors-for-incident-parkinsons-disease-jama-102798", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/15/190922-amantadine-in-parkinsons-disease.jpg", "publishedAt": "2022-11-23T08:12:20Z", "content": "A new study published in the Journal of American Medical Association neurology suggests that the connections reported in a representative population between Parkinson disease (PD) and specific risk f… [+3286 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Chhavi", "title": "How To Look After Your Eyes In Winters - Medical Dialogues", "description": "How To Look After Your Eyes In Winters", "url": "https://medicaldialogues.in/photo-stories/how-to-look-after-your-eyes-in-winters-127", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/23/191694-amp-stories-cover-12.jpg", "publishedAt": "2022-11-23T07:02:28Z", "content": "HOW TO LOOK AFTER YOUR EYES IN WINTER\r\nWinter and dryness go hand-in-hand. The loss of moisture from the eyes causes eye dryness. To avoid dry eyes, keep your body hydrated by drinking a lot of water… [+1974 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "[SCAM EXPOSED] King Cobra Gummies Reviews GNC MUST READ Amazon and EBay Review! - Deccan Herald", "description": "Overview: - King Cobra Gummies Reviews", "url": "https://www.deccanherald.com/brandspot/pr-spot/scam-exposed-king-cobra-gummies-reviews-gnc-must-read-amazon-and-ebay-review-1164944.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164944-1669184513.png", "publishedAt": "2022-11-23T06:21:07Z", "content": "Overview: - King Cobra Gummies Reviews\r\nKing Cobra Gummies Review is the best male enhancement supplement that you should try to improve your sexual wellbeing. It contains natural ingredients that wi… [+10449 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego: Parsing the Genetic Drivers of Head and Neck Cancers - India Education Diary", "description": "Head and neck cancer, which kills more than 400,000 persons worldwide each year, has multiple causes. The human papilloma virus (HPV), a sexually transmitted infection, is one, but the most common and lethal subtype are HPV-negative head and neck can", "url": "https://indiaeducationdiary.in/uc-san-diego-parsing-the-genetic-drivers-of-head-and-neck-cancers/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/02/1200px-University_of_California_San_Diego_seal.svg_.png?fit=1024%2C1024&ssl=1", "publishedAt": "2022-11-23T05:52:13Z", "content": "Head and neck cancer, which kills more than 400,000 persons worldwide each year, has multiple causes. The human papilloma virus (HPV), a sexually transmitted infection, is one, but the most common an… [+4495 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "UK says monkeypox vaccine is '78% effective' - ETHealthWorld", "description": "More than 55,000 vaccine doses have been administered in England, NHS national director of vaccinations and screening Steve Russell said.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/uk-says-monkeypox-vaccine-is-78-effective/95703540", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95703540,imgsize-43356,width-1200,height-628,overlay-ethealthworld/uk-says-monkeypox-vaccine-is-78-effective.jpg", "publishedAt": "2022-11-23T05:20:00Z", "content": "London: UK public health officials on Tuesday said the monkeypox vaccine was 78 per cent effective, urging men who have sex with men to take up the jab.The UK Health Security Agency said its latest a… [+1484 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Weight loss: Study finally names the BEST tea to melt belly fat - Times Now", "description": "When it comes to weight loss, experts say that incorporating this tea into the diet could work wonders to speed up metabolism and melt the extra kilos faster than usual. Peppermint tea is low in calories and full of antioxidants and is considered one of the b…", "url": "https://www.timesnownews.com/health/weight-loss-study-finally-names-the-best-tea-to-melt-belly-fat-article-95702918", "urlToImage": "https://static.tnn.in/thumb/msid-95702918,imgsize-100,width-1280,height-720,resizemode-75/95702918.jpg", "publishedAt": "2022-11-23T04:54:01Z", "content": "According to a study published in the Journal of Clinical Gastroenterology, experts people who consume peppermint oil had more relief from the symptoms of irritable bowel syndrome (IBS), suffered fro… [+41 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Are cornflakes good for daily breakfast? Find out what a nutritionist says - Health shots", "description": "Cornflakes are an easy breakfast option for most of us, but they may have some side effects too! So if you're eating breakfast cereals too often, it may be time to rethink.", "url": "https://www.healthshots.com/healthy-eating/superfoods/side-effects-of-eating-cornflakes-for-breakfast-daily/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/23093822/cornflakes.jpg", "publishedAt": "2022-11-23T04:45:23Z", "content": "In these fast-paced lifestyles, we are always falling back upon quick ways to do things. This also includes our meals. While breakfast should be the ‘king meal’ of the day, people lean on quick-fix, … [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Does Apple cider vinegar help you lose weight, burn fat & control blood sugar levels ? - The Indian Express", "description": "It does not work in isolation, so it is also important to follow a balanced diet with healthy lifestyle habits such as exercising, following regular sleeping patterns and keeping yourself hydrated, says Dr Priyanka Lulla, Clinical Dietician, Sir HN Reliance F…", "url": "https://indianexpress.com/article/lifestyle/health-specials/apple-cider-vinegar-weight-loss-health-8284361/", "urlToImage": "https://images.indianexpress.com/2022/11/apple-759.jpg", "publishedAt": "2022-11-23T04:44:09Z", "content": "If we study the evolution of our food habits over centuries, then we know that compounds with vinegar have been used for centuries because of their cleansing, restorative and healing properties. Appl… [+4243 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Steroid use linked to serious side effects among adolescents and young adults - Medical Dialogues", "description": "Recent research has found the use of  anabolic-androgenic steroids among adolescents and young adults to be  associated with serious side effects. The study also revealed that steroid use  among...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/steroid-use-linked-to-serious-side-effects-among-adolescents-and-young-adults-102802", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/23/191734-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-6.jpg", "publishedAt": "2022-11-23T04:15:45Z", "content": "Recent research has found the use of anabolic-androgenic steroids among adolescents and young adults to be associated with serious side effects. The study also revealed that steroid use among this po… [+1653 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Myocarditis after COVID vaccination is rare but higher in younger males - News-Medical.Net", "description": "In a recent study published in the Canadian Medical Association Journal, researchers observed the incidence of myocarditis following messenger ribonucleic acid (mRNA)-based vaccination against coronavirus disease 2019 (COVID-19). Additionally, they compared t…", "url": "https://www.news-medical.net/news/20221122/Myocarditis-after-COVID-vaccination-is-rare-but-higher-in-younger-males.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731867_16691764495938058.jpg", "publishedAt": "2022-11-23T04:08:00Z", "content": "In a recent study published in the Canadian Medical Association Journal, researchers observed the incidence of myocarditis following messenger ribonucleic acid (mRNA)-based vaccination against corona… [+5519 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "\"Good\" cholesterol's role in universally predicting heart disease risk challenged - Medical Dialogues", "description": "A National Institutes of Health-supported  study recently found that while low levels of HDL cholesterol predicted an  increased risk of heart attacks or related deaths for white adults - a ...", "url": "https://medicaldialogues.in/mdtv/cardiology/videos/good-cholesterols-role-in-universally-predicting-heart-disease-risk-challenged-102799", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/23/191716-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-1.jpg", "publishedAt": "2022-11-23T03:30:42Z", "content": "A National Institutes of Health-supported study recently found that while low levels of HDL cholesterol predicted an increased risk of heart attacks or related deaths for white adults - a long-accept… [+2317 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study investigates spread of Klebsiella superbug between humans and the environment - News-Medical.Net", "description": "An international team of scientists investigating transmission of a deadly drug-resistant bacteria that rivals MRSA, has found that whilst the bugs are found in livestock, pets and the wider environment, they are rarely transmitted to humans through this rout…", "url": "https://www.news-medical.net/news/20221122/Study-investigates-spread-of-Klebsiella-superbug-between-humans-and-the-environment.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Microbiology-620x480.jpg", "publishedAt": "2022-11-23T02:43:00Z", "content": "An international team of scientists investigating transmission of a deadly drug-resistant bacteria that rivals MRSA, has found that whilst the bugs are found in livestock, pets and the wider environm… [+4999 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Push to use antibiotics to prevent sexually transmitted infections raises concerns - Nature.com", "description": "The strategy has been shown to reduce STIs, but could increase antimicrobial resistance.", "url": "https://www.nature.com/articles/d41586-022-03801-6", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-03801-6/d41586-022-03801-6_23734208.jpg", "publishedAt": "2022-11-23T01:39:31Z", "content": "Gonorrhoea bacteria (pictured) has development resistance to some antibiotics. Credit: SPL\r\nA health department in the United States has become one of the first to recommend that people who are at hi… [+7963 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "Tokyo Medical and Dental University", "title": "Remdesivir reduces COVID-19 mortality in a real-world setting - Newswise", "description": "The COVID-19 pandemic has led to an explosion of clinical research resulting in the development of a variety of vaccines and treatments, although the efficacy o", "url": "https://www.newswise.com/coronavirus/remdesivir-reduces-covid-19-mortality-in-a-real-world-setting", "urlToImage": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2022/11/22/637d6c9e9313d_Low-ResFigure.jpg.png&width=600&height=600", "publishedAt": "2022-11-23T00:45:00Z", "content": "Newswise — Tokyo, Japan - The COVID-19 pandemic has led to an explosion of clinical research resulting in the development of a variety of vaccines and treatments, although the efficacy of some remain… [+2937 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Rose McNulty", "title": "Review Highlights Need for Further Research, Individualized Treatments for Endometriosis-Associated Infertility - AJMC.com Managed Markets Network", "description": "Although there is a clinically recognized association between endometriosis and infertility, the mechanisms behind the association are not fully understood.", "url": "https://www.ajmc.com/view/review-highlights-need-for-further-research-individualized-treatments-for-endometriosis-associated-infertility", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/0e28e973db0ec578742c12381bf6c31e3758ed76-1280x1280.jpg?fit=crop&auto=format", "publishedAt": "2022-11-22T22:40:57Z", "content": "Endometriosis is known to be associated with infertility, but the mechanisms behind the association are not fully understood. A review published in Frontiers in Endocrinology summarizes current knowl… [+4886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "1.74 lakh children in Maharashtra missed measles shots till September - The Indian Express", "description": "Till September, nearly 1.74 lakh children under the age of five in Maharashtra had missed their scheduled vaccination against measles, according to data from the Health department.", "url": "https://indianexpress.com/article/cities/mumbai/1-74-lakh-children-in-maharashtra-missed-measles-shots-till-september-8283905/", "urlToImage": "https://images.indianexpress.com/2022/11/measles-4-1.jpg", "publishedAt": "2022-11-22T20:30:05Z", "content": "THE RECENT measles outbreak in parts of Maharashtra has once again brought to the fore how the national immunisation programme was adversely affected by the Covid-19 pandemic.Till September, nearly 1… [+2197 chars]"}, {"source": {"id": null, "name": "Mit.edu"}, "author": "David Orenstein | Picower Institute for Learning and Memory", "title": "Alzheimer's risk gene undermines insulation of brain's “wiring” - MIT News", "description": "MIT research shows that in people carrying the APOE4 risk variant, a key brain cell type mismanages cholesterol needed to insulate neurons properly — another sign that APOE4 contributes to Alzheimer&#039;s disease by disrupting lipids in the brain.", "url": "https://news.mit.edu/2022/alzheimers-risk-gene-undermines-insulation-of-brain-wiring-1122", "urlToImage": "https://news.mit.edu/sites/default/files/images/202211/myelin-neurons.jpg", "publishedAt": "2022-11-22T19:15:00Z", "content": "Its well-known that carrying one copy of the APOE4 gene variant increases ones risk for Alzheimers disease threefold and two copies about tenfold, but the fundamental reasons why, and what can be don… [+7003 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Is It Healthy To Apply Ghee On Chapati? - Slurrp", "description": "Putting ghee on chapati is an Indian tradition. Every household has their own way of applying ghee to the chapatis, some prefer less some more. Do you know applying ghee is healthy and it does not promote weight gain?", "url": "https://www.slurrp.com/article/is-it-healthy-to-apply-ghee-on-chapati-1669141330687", "urlToImage": "https://images.slurrp.com/prodarticles/rhayg0muzwl.webp", "publishedAt": "2022-11-22T18:38:02Z", "content": "Many of us enjoy eating chapati or roti with a dab of clarified butter or ghee. In addition to softening the rotis, it also keeps it from becoming dry and flaky. But do experts advise ghee to be adde… [+1416 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Proteomic analysis identifies novel phenotypes associated with COVID-19 severity in circulating immune cells - News-Medical.Net", "description": "In a recent study, researchers used proteomic analysis to identify novel immune cell phenotypes associated with severe coronavirus disease 2019 (COVID-19).", "url": "https://www.news-medical.net/news/20221122/Proteomic-analysis-identifies-novel-phenotypes-associated-with-COVID-19-severity-in-circulating-immune-cells.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731834_16691391759213346.jpg", "publishedAt": "2022-11-22T17:55:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers used proteomic analysis to identify novel immune cell phenotypes associated with severe coronavirus disease 2019 (COVID-19). Addi… [+6785 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "A 'memory' of HIV infection stays in cells: Study - ANI News", "description": "Even though antiretroviral therapy has made HIV a manageable disease, people living with it often suffer from chronic inflammation. This can put them at an increased risk of developing comorbidities such as cardiovascular disease and neurocognitive dysfunctio…", "url": "https://www.aninews.in/news/science/a-memory-of-hiv-infection-stays-in-cells-study20221122231032", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221122173414.jpg", "publishedAt": "2022-11-22T17:40:00Z", "content": "Washington [US] November 22 (ANI): Even though antiretroviral therapy has made HIV a manageable disease, people living with it often suffer from chronic inflammation. This can put them at an increase… [+2982 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "MRI shows significant brain abnormalities post-COVID: IIT Delhi study - The Siasat Daily", "description": "New Delhi: Using a special type of MRI, researchers at the Indian Institute of Technology (IIT) Delhi have uncovered brain changes in patients up to six months after they recovered from COVID-19. Studies have shown that about one in five adults go on to devel…", "url": "https://www.siasat.com/mri-shows-significant-brain-abnormalities-post-covid-iit-delhi-study-2463337/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/11/nnrsnr.jpg", "publishedAt": "2022-11-22T17:28:00Z", "content": "New Delhi: Using a special type of MRI, researchers at the Indian Institute of Technology (IIT) Delhi have uncovered brain changes in patients up to six months after they recovered from COVID-19. Stu… [+3906 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Disease X, other pathogens that can cause future pandemics to be identified by WHO | Mint - Mint", "description": "The WHO is convening over 300 scientists who will consider the evidence on over 25 virus families and bacteria and the Disease X", "url": "https://www.livemint.com/news/disease-x-other-pathogens-future-endemic-pandemic-who-11669135094347.html", "urlToImage": "https://images.livemint.com/img/2022/11/22/600x338/HEALTH-EUROPE_1669135288588_1669135288724_1669135288724.JPG", "publishedAt": "2022-11-22T16:43:27Z", "content": "The World Health Organization (WHO) will soon be updating the list of priority pathogens, including Disease X\", that can cause future outbreaks and pandemics. The list is being updated to guide globa… [+2148 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Chris Anderson", "title": "Low Protein Diet May Inhibit Colon Cancer Growth - Inside Precision Medicine", "description": "A low-protein diet disrupts a nutrient signaling pathway in cells that is a driver of colon cancer.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/colorectal-cancer/low-protein-diet-may-inhibit-colon-cancer-growth/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2019/04/ColorectalCancer.jpg", "publishedAt": "2022-11-22T15:38:13Z", "content": "Researchers from the University of Michigan Rogel Cancer Center have published new research in the journal Gastroenterology, showing that a low-protein diet disrupts a nutrient signaling pathways in … [+3684 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Daily coffee consumption lowers diabetes risk in women with history of gestational diabetes - Medical Dialogues", "description": "Drinking one cup of caffeinated coffee daily as a replacement for other artificially sweetened beverages and sugar-sweetened beverages reduced the risk of type 2 diabetes by 9% and 17%,...", "url": "https://medicaldialogues.in/diet-nutrition/news/daily-coffee-consumption-lowers-diabetes-risk-in-women-with-history-of-gestational-diabetes-102689", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/21/191516-coffee.jpg", "publishedAt": "2022-11-22T14:30:16Z", "content": "Drinking one cup of caffeinated coffee daily as a replacement for other artificially sweetened beverages and sugar-sweetened beverages reduced the risk of type 2 diabetes by 9% and 17%, respectively.… [+3019 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Semen Quality in Males Suffering From COVID-19: A Pilot Study - Cureus", "description": "Background\r\n\r\nIt is well known that some viral infections may affect male fertility. Coronavirus disease (COVID-19) can lead to multiorgan damage through the angiotensin-converting enzyme-2 receptor, abundant in testicular tissue. However, little information …", "url": "https://www.cureus.com/articles/123758-semen-quality-in-males-suffering-from-covid-19-a-pilot-study", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_0.png", "publishedAt": "2022-11-22T13:40:32Z", "content": "Background\r\nIt is well known that some viral infections may affect male fertility. Coronavirus disease (COVID-19) can lead to multiorgan damage through the angiotensin-converting enzyme-2 receptor, a… [+32098 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study suggests protein plays a key role in immunotherapy - ANI News", "description": "The study found protein is crucial in helping malignancies avoid immune attacks. The \"fragile X mental retardation protein\" (FMRP) is a protein that controls a network of genes and cells in the tumor microenvironment that help the tumor \"hidden\" from immune c…", "url": "https://www.aninews.in/news/science/study-suggests-protein-plays-a-key-role-in-immunotherapy20221122185820", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221122132804.jpg", "publishedAt": "2022-11-22T13:28:00Z", "content": "Lausanne [Switzerland], November 22 (ANI): By using the patient's own immune system against the tumour, immunotherapy is a cutting-edge method of treating cancer. Our ability to combat cancer has cha… [+7513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some low-carb, high-fibre foods that are ideal for weight loss - The Indian Express", "description": "According to nutritionist Divya Sobti, coconut is low in carbs and high in fibre and fat, so it may help stabilise your blood sugar", "url": "https://indianexpress.com/article/lifestyle/health/low-carb-high-fibre-foods-weight-loss-diet-snacks-fruits-8156484/", "urlToImage": "https://images.indianexpress.com/2021/03/pixabay_fruit-healthy-eating_incopy.jpg", "publishedAt": "2022-11-22T12:50:56Z", "content": "There’s no denying the benefits of consuming a fibre-rich diet. From aiding weight loss to keeping one fuller for longer, fibre also helps control blood sugar levels. But many of the high-fibre foods… [+2854 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Almonds can help cut calories, finds research - Zee News", "description": "While losing weight can be a thankless job, new research by the University of South Australia suggests that a handful of almonds can help keep additional pounds at bay. Researchers, who studied how almonds can alter human appetite, discovered that a snack of …", "url": "https://zeenews.india.com/video/news/almonds-can-help-cut-calories-finds-research-2538870.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/11/22/00000003_58.jpg", "publishedAt": "2022-11-22T12:25:01Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Phentermine Over the Counter Alternatives, 5 Best Adipex OTC to Buy Online and In Store Near Me - Deccan Herald", "description": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase. Whether you opt for a Phentermine over-the-counter online or in store brand we have 5 of the most effective natural substitutes reviewed …", "url": "https://www.deccanherald.com/brandspot/pr-spot/phentermine-over-the-counter-alternatives-5-best-adipex-otc-to-buy-online-and-in-store-near-me-1164734.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164734-1669119785.png", "publishedAt": "2022-11-22T12:23:05Z", "content": "This guide to choosing Phentermine alternatives will provide everything you need to make an informed choice and purchase.\r\nWhether you opt for a Phentermine over-the-counter online or in store brand … [+27530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Carbs For Diabetics: 5 Whole Grains People With Diabetes Can Add To Their Diet - NDTV", "description": "Diabetes diet: These are some of the whole grains that can provide carbs and control blood sugar levels at the same time.", "url": "https://www.ndtv.com/health/carbs-for-diabetics-5-whole-grains-people-with-diabetes-can-add-to-their-diet-3543448", "urlToImage": "https://i.ndtvimg.com/i/2017-11/whole-grains_650x400_61509947059.jpg", "publishedAt": "2022-11-22T11:28:06Z", "content": "People with diabetes are usually advised to avoid carbs\r\nIt's true that you need to be very careful about your food choices if you are a diabetic. And sometimes, there seems to be a lot of confusion … [+2261 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Red Boost Tonic Reviews - Dosage, Consumer Reports, Benefits & Side Effects - Deccan Herald", "description": "What is Red Boost Tonic? Red Boost is a blood flow support formulation that efficiently enhances male sexual performance.  The manufacturer claims that the formula targets the root cause of sexual health problems and restores sexual stamina.  Red Boost is pro…", "url": "https://www.deccanherald.com/brandspot/pr-spot/red-boost-tonic-reviews-dosage-consumer-reports-benefits-side-effects-1164699.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164699-1669112087.png", "publishedAt": "2022-11-22T10:14:47Z", "content": "What is Red Boost Tonic?\r\nRed Boost is a blood flow support formulation that efficiently enhances male sexual performance. \r\nThe manufacturer claims that the formula targets the root cause of sexual … [+8314 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Testosterone Booster for Erectile Dysfunction - Deccan Herald", "description": "The rate at which testosterone level decreases as we become older is quite alarming. Some of the low testosterone levels associated with problems are fatigue, muscle loss, decreased energy and many others. However, there are numerous (over 160) testosterone b…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-testosterone-booster-for-erectile-dysfunction-1164690.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1164690-1669111080.png", "publishedAt": "2022-11-22T09:58:00Z", "content": "The rate at which testosterone level decreases as we become older is quite alarming.\r\nSome of the low testosterone levels associated with problems are fatigue, muscle loss, decreased energy and many … [+16270 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Why cervical cancer is rising among young women - Mint Lounge", "description": "Despite the fact that HPV screening has made cervical cancer preventable, the number of women in their early 30s getting diagnosed with it is still rising", "url": "https://lifestyle.livemint.com/health/wellness/why-cervical-cancer-is-rising-among-young-women-111669097104660.html", "urlToImage": "https://images.livemint.com/img/2022/11/22/1140x641/Cancer_1669098362006_1669098391727_1669098391727.jpg", "publishedAt": "2022-11-22T07:10:37Z", "content": "The frequency of cervical cancer among women in their early 30s has dramatically increased recently, according to recent research.\r\nThe findings were published in the Journal of the American Medical … [+4802 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Natalia Ningthoujam", "title": "Does your head hurt after eating or drinking? Know 6 food items that can trigger headaches - Health shots", "description": "Headaches can have a various underlying causes, but did you know that sometimes having your favourite food or drink can make your head hurt?", "url": "https://www.healthshots.com/healthy-eating/nutrition/headaches-know-6-foods-and-drinks-which-can-make-your-head-hurt/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/22115233/wine-and-headache.jpg", "publishedAt": "2022-11-22T06:54:02Z", "content": "What’s in your diet? It’s an important question that you should ask yourself as it can have answers to your health issues. For instance, there might be foods that often cause headaches. Some of the f… [+3392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Diksha Dayal", "title": "A vitamin-packed superfood: How a tomato keeps your weight, blood pressure, diabetes and heart health under control - The Indian Express", "description": "The nutritional load of tomatoes varies according to cooking method and type. So while tomato soup, juices and purees can help you manage weight, raw tomatoes can help you with dehydration and spaghetti sauces protect the heart. Cherry tomatoes have higher be…", "url": "https://indianexpress.com/article/lifestyle/health-specials/vitamin-packed-superfood-tomato-weight-blood-pressure-diabetes-heart-health-under-control-8282322/", "urlToImage": "https://images.indianexpress.com/2022/11/tomatoes-759.jpg", "publishedAt": "2022-11-22T06:20:54Z", "content": "We often wonder why the Mediterranean diet is considered the healthiest. But the simple answer lies in the fact that it contains a bulk of tomatoes. These are considered a rich source of Vitamin K an… [+7265 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Odishatv Bureau", "title": "Eat these four foods to feel stress-free instantly - OTV News", "description": "Stress has now become a common conversation point in workplaces especially when confronted with meeting deadlines, dealing with financial problems, health issues, and making study and career decisions.", "url": "https://odishatv.in/health/news-eat-these-four-foods-to-feel-stress-free-instantly-190766", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1669040129.webp", "publishedAt": "2022-11-22T04:53:26Z", "content": "It is normal to experience tension, anxiety, grief, and worry. And food can be your best friend while coping with it. When you're feeling stressed, the body demands certain vitamins and minerals, inc… [+1662 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Elevated incidence and risk for a new diagnosis of diabetes after COVID-19 - News-Medical.Net", "description": "In a recent study published in the journal BMC Medicine, researchers estimated the prevalence of new-onset diabetes following coronavirus disease 2019 (COVID-19).", "url": "https://www.news-medical.net/news/20221121/Elevated-incidence-and-risk-for-a-new-diagnosis-of-diabetes-after-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_731725_16690910640922197.jpg", "publishedAt": "2022-11-22T04:26:00Z", "content": "In a recent study published in the journal BMC Medicine, researchers estimated the prevalence of new-onset diabetes following coronavirus disease 2019 (COVID-19).\r\nNotwithstanding the numerous vaccin… [+4948 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Connection between gut and stroke-induced cognitive impairment: Research - Hindustan Times", "description": "Two-thirds of stroke patients will develop cognitive impairment, while one-third of all stroke patients will go on to develop dementia, according to recent research, so there is a critical need for more effective stroke therapies that preserve cognitive funct…", "url": "https://www.hindustantimes.com/lifestyle/health/connection-between-gut-and-stroke-induced-cognitive-impairment-research-101669090354820.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/22/1600x900/intelligence-g5b7c9b1ab_1920_1667638104502_1669090429688_1669090429688.jpg", "publishedAt": "2022-11-22T04:16:19Z", "content": "A major contributor to dementia, substantial long-term impairment, and mortality is stroke. The American Heart Association revealed that stroke patients are more likely to experience depression, whic… [+4521 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: Repeat COVID Infection Is Riskier than First - VOA Learning English", "description": "A new study has found that the risk of death, hospitalization and serious health issues from COVID-19 increases with reinfection regardless of vaccination.", "url": "https://learningenglish.voanews.com/a/study-repeat-covid-infection-is-riskier-than-first/6830847.html", "urlToImage": "https://gdb.voanews.com/c36e0000-0aff-0242-770d-08d9ed367739_w1200_r1.jpg", "publishedAt": "2022-11-21T22:01:23Z", "content": "A new study has found that the risk of death, hospitalization and serious health issues from COVID-19 increases with reinfection regardless of vaccination.\r\nThe study examined U.S. Department of Vete… [+2905 chars]"}]}