{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "Monkeypox cases due to the side effect of AstraZenecaCovishield vaccine? Answer is here - Zee News", "description": "The global rise in monkeypox cases has led to a rash of social media posts, many claiming the chimpanzee adenovirus vector used in AstraZeneca s Covid vaccine, which has partnered with India to produce Covishield, is behind the outbreak and some suggesting th…", "url": "https://zeenews.india.com/world/monkeypox-cases-due-to-the-side-effect-of-astrazeneca/covishield-vaccine-answer-is-here-2469843.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/02/1049394-astrazeneca-monkeypox.png", "publishedAt": "2022-06-02T12:25:37Z", "content": "Monkeypox outbreak: The global rise in monkeypox cases has led to a rash of social media posts, many claiming the chimpanzee adenovirus vector used in AstraZeneca's Covid vaccine, which has partnered… [+3556 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "WHO warns monkeypox spreading ‘undetected’ for a while now - WION", "description": "More than 550 cases of the monkeypox have been confirmed in over 30 countries. WHO has warned that the outbreak of endemic diseases such as monkeypox has become more frequent, and it is likely that the disease has been spreading undetected for a while now. Ex…", "url": "https://www.wionews.com/world/who-warns-monkeypox-spreading-undetected-for-a-while-now-484425", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/02/267309-fumtxnpxsaejrzb.jpeg", "publishedAt": "2022-06-02T11:33:04Z", "content": "The World Health Organisation warned on Wednesday that outbreak of endemic diseases such as monkeypox has become more frequent, and it is likely that monkeypox has been spreading undetected for a whi… [+2345 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Detection of Arthritis Now Possible Thanks to Artificial Intelligence - SciTechDaily", "description": "Neural network learns to differentiate between healthy and inflamed bones using finger joints. Researchers have been able to teach artificial intelligence neural networks to distinguish between two different kinds of arthritis and healthy joints. The neural n…", "url": "https://scitechdaily.com/early-detection-of-arthritis-now-possible-thanks-to-artificial-intelligence/", "urlToImage": "https://scitechdaily.com/images/Human-Brain-Artificial-Intelligence-AI-Illustration.jpg", "publishedAt": "2022-06-02T10:32:18Z", "content": "A new study finds that utilizing artificial intelligence could allow scientists to detect arthritis earlier.\r\nNeural network learns to differentiate between healthy and inflamed bones using finger jo… [+5355 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "How to recognise signs of mental disorder; psychiatrist offers tips - Hindustan Times", "description": "Mental disorders can be incredibly complex and unique. They often manifest themselves in different ways in different people. Here's how to recognise signs. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-to-recognise-signs-of-mental-disorder-psychiatrist-offers-tips-101654165234403.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/mental_health_disorder_thumb_1654165330789_1654165343008.jpg", "publishedAt": "2022-06-02T10:26:31Z", "content": "Recognising mental illnesses is not easy as they can manifest differently in different people and even people who are diagnosed with the same mental disorder may exhibit an entirely different set of … [+2988 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "A biomarker in liquid biopsy for lung cancer can be reliable than tumour biopsy: Study - ThePrint", "description": "New York [US], June 2 (ANI): Mount Sinai researchers have proven that a simple blood test called a liquid biopsy can be a stronger predictor of whether cancer immunotherapy will work for a patient with lung cancer than an invasive tumour biopsy technique. The…", "url": "https://theprint.in/health/a-biomarker-in-liquid-biopsy-for-lung-cancer-can-be-reliable-than-tumour-biopsy-study/980699/", "urlToImage": null, "publishedAt": "2022-06-02T10:13:47Z", "content": "New York [US], June 2 (ANI): Mount Sinai researchers have proven that a simple blood test called a liquid biopsy can be a stronger predictor of whether cancer immunotherapy will work for a patient wi… [+2709 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Here’s How Tobacco Affects Female Fertility - News18", "description": "Menopause occurs 1 to 4 years earlier in women who smoke, as compared to non-smokers.", "url": "https://www.news18.com/news/lifestyle/heres-how-tobacco-affects-female-fertility-5291371.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/tobacco-165390367916x9.jpg", "publishedAt": "2022-06-02T09:51:33Z", "content": "A lot has been said and penned down on the ill effects of tobacco. The impact of tobacco on both male and female health is well known. Irrespective of the quantity or frequency of consumption, consum… [+2224 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DH Web Desk", "title": "SII to launch India’s first indigenous HPV vaccine against cervical cancer - Deccan Herald", "description": "In a major push in the fight against cervical cancer, the Serum Institute of India (SII) is set to launch India’s first indigenous Human Papillomavirus (HPV) vaccine. According to a Livemint report, the Pune-based drugmaker hopes to introduce the vaccine in t…", "url": "https://www.deccanherald.com/national/sii-to-launch-india-s-first-indigenous-hpv-vaccine-against-cervical-cancer-1114604.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/06/02/human-papilloma-virus-inoculation-1-1099815-1649692502-1114604-1654162729.jpg", "publishedAt": "2022-06-02T09:38:49Z", "content": "In a major push in the fight against cervical cancer, the Serum Institute of India (SII) is set to launch Indias first indigenous Human Papillomavirus (HPV) vaccine. According to a Livemintreport, th… [+1259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "This ultrathin fuel cell could power body implants with electricity from blood glucose - The Indian Express", "description": "This fuel cell can convert the glucose in your blood into electricity so that medical implants and other in-body sensors can be powered without using batteries.", "url": "https://indianexpress.com/article/technology/science/this-ultrathin-fuel-cell-could-power-body-implants-with-electricity-from-blood-glucose-7949044/", "urlToImage": "https://images.indianexpress.com/2022/06/MIT_Sugar-Battery-01-press_0.jpg", "publishedAt": "2022-06-02T09:32:23Z", "content": "Engineers at MIT and the Technical University of Munich have designed a new type of glucose fuel cell that measures just 400 nanometres thick this means it is thinner than a sheet of paper that is ab… [+3216 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Planning To Go Vegan? Heres How To Maintain A Good Protein Intake - NDTV", "description": "Implementing veganism is a huge commitment towards the well-being of our planet and the beings around us. Here's how to maintain a protein-rich diet if you are planning to go vegan.", "url": "https://www.ndtv.com/health/planning-to-go-vegan-heres-how-to-maintain-a-good-protein-intake-3030867", "urlToImage": "https://i.ndtvimg.com/i/2014-11/soy-milk_625x300_81416557368.jpg", "publishedAt": "2022-06-02T09:08:46Z", "content": "Soy milk is a great substitute for dairy milk as it is rich in protein\r\nGoing vegan is a huge commitment. Veganism refers to a diet as well as a lifestyle where one takes conscious efforts to not use… [+3888 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "West Nile fever: Common symptoms; how is it different from Malaria - Hindustan Times", "description": "West Nile virus is spread to humans through the bite of an infected female mosquito. The symptoms are mild and last a few days.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/west-nile-fever-causes-common-symptoms-treatment-how-is-it-different-from-malaria-101654158175598.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/02/1600x900/4bf2cb16-d4db-11ec-ae80-64fe22456763_1652682434816_1654158415313.jpg", "publishedAt": "2022-06-02T08:32:36Z", "content": "A 47-year-old man from Kerala's Thrissur district, died of West Nile fever on Sunday after which the health department of the state is taking measures to control mosquito breeding. West Nile virus is… [+4907 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Heat And Heart Failure: 7 Tips to Protect Your Heart This Summer - India.com", "description": "High temperatures put more pressure on the heart to work harder, thus making the summers more challenging for heart failure patients.", "url": "https://www.india.com/health/heat-and-heart-failure-7-tips-to-protect-your-heart-this-summer-5428587/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/01/Heart-Attack-In-Winter-highest-risk-of-heart-attack-in-Winter-keep-yourself-safe-with-these-habits.jpg", "publishedAt": "2022-06-02T07:44:15Z", "content": "The brutal summer this year has proven to be challenging for people across the country. With temperatures soaring to nearly 50 degrees Celsius in parts of the country, the heatwave has affected every… [+4114 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Medtronic India unveils Pipeline Vantage Embolization Device with shield technology to treat Brain... - Medical Dialogues", "description": "Cerebral or brain aneurysm is a condition where there is a ballooning or weakening of the inside...", "url": "https://medicaldialogues.in/news/industry/medical-devices/medtronic-india-unveils-pipeline-vantage-embolization-device-with-shield-technology-to-treat-brain-aneurysms-93850", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/02/177766-pipeline-vantage.jpg", "publishedAt": "2022-06-02T07:09:35Z", "content": "Mumbai: India Medtronic Private Limited, a wholly-owned subsidiary of Medtronic plc a healthcare technology company, has announced the launch of CE marked fourth-generation flow diverter, Pipeline Va… [+2968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "K Srinath Reddy", "title": "Why has aspirin advice for heart protection changed? - The Indian Express", "description": "The recent change in guidelines, to dis-favour the routine use of aspirin, takes into account the reduction in anticipated benefits due to the increased protection being offered by other drugs and non-drug measures.", "url": "https://indianexpress.com/article/lifestyle/health/aspirin-heart-protection-risk-prevention-america-guidelines-7948784/", "urlToImage": "https://images.indianexpress.com/2022/06/asprin-1200.jpg", "publishedAt": "2022-06-02T07:00:58Z", "content": "For many decades, aspirin was advised to prevent heart attacks, both for those who had pre-existing cardiovascular disease (CVD) and for preventing coronary heart disease (CHD). Baby aspirin (low dos… [+9649 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stephen Moss", "title": "Geese, skuas, cranes and even foxes: avian flu takes growing toll on wildlife - The Guardian", "description": "One ecologist counted 160 dead wild birds while walking round a Scottish loch, and figures from other countries are just as worrying", "url": "https://amp.theguardian.com/environment/2022/jun/02/geese-skuas-cranes-foxes-avian-flu-takes-growing-toll-on-wildlife-aoe", "urlToImage": null, "publishedAt": "2022-06-02T06:30:00Z", "content": "The age of extinctionOne ecologist counted 160 dead wild birds while walking round a Scottish loch, and figures from other countries are just as worrying\r\nAs he walked along the shoreline of a Highla… [+5354 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How To Manage Kids With Asthma; Tips For Parents - News18", "description": "India is one of the leading countries in terms of concentrations of air pollution caused by various sources of exhaustion.", "url": "https://www.news18.com/news/lifestyle/how-to-manage-kids-with-asthma-tips-for-parents-5277613.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/asthma-165159853316x9.jpg", "publishedAt": "2022-06-02T06:08:17Z", "content": "Asthma is a chronic condition that can affect people of all ages. Asthma, among kids, is also becoming a major concern for parents these days.\r\nIf your kid is suffering from this chronic condition, t… [+1292 chars]"}, {"source": {"id": null, "name": "Newstodaynet.com"}, "author": null, "title": "First case of monkeypox confirmed in Hungary - News Today", "description": "Hungarian health authorities have confirmed the country's first case of monkeypox in a 38-year-old man.", "url": "https://newstodaynet.com/2022/06/02/first-case-of-monkeypox-confirmed-in-hungary/", "urlToImage": "https://newstodaynet.com/wp-content/uploads/2022/06/001bc734-1600.webp", "publishedAt": "2022-06-02T05:39:48Z", "content": "Budapest : Hungarian health authorities have confirmed the country’s first case of monkeypox in a 38-year-old man. The disease does not spread easily, only through close contact, said the chief medic… [+797 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Dementia: THESE changes can act as early predictors of brain decline - Times of India", "description": "Dementia is a group of illnesses that affects at least two or more brain functions including memory, thinking and/or judgment. It is not a specific disease rather can be an outcome of several diseases.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/dementia-these-changes-can-act-as-early-predictors-of-brain-decline/photostory/91916709.cms", "urlToImage": "https://static.toiimg.com/photo/91916719.cms", "publishedAt": "2022-06-02T05:30:00Z", "content": "As it is known, dementia is a general term to refer to a group of disorders caused by abnormal brain changes and activities. These then lead to a decline in one's thinking abilities and also affect a… [+656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What should a diabetic keep in mind when having pumpkin? - The Indian Express", "description": "With a high GI, at 75, it is believed that pumpkin is not good for diabetes patients., said Preety Tyagi, a nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-patients-pumpkins-benefits-7941185/", "urlToImage": "https://images.indianexpress.com/2020/07/pumpkin-seeds-1200.jpg", "publishedAt": "2022-06-02T05:20:29Z", "content": "Diabetes, a condition caused by insufficient insulin in the blood or lack of proper movement of the same, has today become increasingly common in people of all age groups. It is one of the most commo… [+3226 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Brain cell activity is responsible for central nervous system disorder outcomes - ThePrint", "description": "Los Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the spinal cord is responsible for regulating the body’s response to the central nervous systems (CNS) …", "url": "https://theprint.in/health/brain-cell-activity-is-responsible-for-central-nervous-system-disorder-outcomes/980345/", "urlToImage": null, "publishedAt": "2022-06-02T05:14:12Z", "content": "Los Angeles (California) [US], June 2 (ANI): According to a research led by the investigators at the Cedars-Sinai Medical Center, brain cell activities and the spinal cord is responsible for regulati… [+3879 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "K1 Keto life (Reviews) Beware of Shark Tank Scams Before Buy! - The Tribune India", "description": "Are you also looking to decrease weight to make your body attractive? Well, being overweight is one of the major causes that can cause several health problems. In modern society, people are eating lots of glucose and carbohydrates which tend to cause excessiv…", "url": "https://www.tribuneindia.com/news/brand-connect/k1-keto-life-reviews-beware-of-shark-tank-scams-before-buy-400338", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_1844081162.jpg", "publishedAt": "2022-06-02T04:56:00Z", "content": "Are you also looking to decrease weight to make your body attractive? Well, being overweight is one of the major causes that can cause several health problems. In modern society, people are eating lo… [+6318 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Amid monkeypox scare, Delhi directs govt hospitals to be on alert - India Today", "description": "A day after the Centre issued an advisory, the Delhi government directed all the hospitals to be on alert for any early symptoms of monkeypox.", "url": "https://www.indiatoday.in/cities/delhi/story/delhi-news-monkeypox-government-hospitals-on-alert-1957322-2022-06-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Monkeypox-647x363.jpeg?dIPbVRlOHs0jqsOFurunr_QjIRAEe0vj", "publishedAt": "2022-06-02T04:53:18Z", "content": "All the government hospitals in Delhi on Wednesday were directed to be on alert for any early symptoms of monkeypox and to ensure prompt reporting.\r\nThe Delhi government directed the hospitals a day … [+1452 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Iraq Witnesses Outbreak Of Nose-Bleed Fever: Know More About The Deadly Disease - TIMES NOW", "description": "The deadly Nose-Bleed Fever has no vaccine and its onset can be swift, causing severe bleeding both internally and externally and especially from the nose. I...", "url": "https://www.youtube.com/watch?v=1Ot4PGQETqo", "urlToImage": "https://i.ytimg.com/vi/1Ot4PGQETqo/hqdefault.jpg", "publishedAt": "2022-06-02T04:00:01Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Most difficult nutrients to get and how you can fix that - Times of India", "description": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness. However, even a plate full of nutrient-dense foods does not provide your body with all the vitamins and minerals it needs. While y…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/most-difficult-nutrients-to-get-and-how-you-can-fix-that/photostory/91941956.cms", "urlToImage": "https://static.toiimg.com/photo/91942027.cms", "publishedAt": "2022-06-02T03:30:00Z", "content": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness.\r\nHowever, even a plate full of nutrient-dense foods does not provide y… [+618 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Michael Schulson", "title": "How Do You Calculate the Risk of a Lab Leak? – The Wire Science - The Wire Science", "description": "The odds of a dangerous pathogen escaping a lab are uncertain, and have implications for COVID-19 and more.", "url": "https://science.thewire.in/health/covid19-pandemic-lab-leak-risk/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/06/01173544/NIAID_Integrated_Research_Facility_-_Positive_Pressure_Personnel_Suit.jpg", "publishedAt": "2022-06-02T01:59:52Z", "content": "Scientists working inside positive pressure personnel suit at a BSL-4 laboratory in Frederick, Maryland. Photo: NIAID\r\nOn a sunny September morning in 2011, at a conference on the Mediterranean islan… [+16573 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Chetana Belagere", "title": "Asymptomatic Covid patients less likely to spread infection - The New Indian Express", "description": "Virologists in India say it may not be correct to completely dismiss the possibility of spread by asymptomatic patients.", "url": "https://www.newindianexpress.com/cities/bengaluru/2022/jun/02/asymptomatic-covid-patients-less-likely-to-spread-infection-2460750.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/6/1/w600X390/COVID_Gurugram.jpg", "publishedAt": "2022-06-02T01:42:00Z", "content": "BENGALURU: Asymptomatic Covid-19 patients were so far considered silent spreaders, however, a study claimed that people infected with SARS-CoV-2 but with no symptoms, are 66% less likely to pass on t… [+2756 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Importance of flu vaccine amid the COVID-19 pandemic | New Day - CNN Philippines", "description": "With the rainy season upon us and the threat of COVID-19 still very much present, medical experts have been stressing the need to get and update our vaccines...", "url": "https://www.youtube.com/watch?v=daJ9aAlvECw", "urlToImage": "https://i.ytimg.com/vi/daJ9aAlvECw/hqdefault.jpg", "publishedAt": "2022-06-02T01:26:31Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Bengalureans, get your daily dose of Vitamin D - Bangalore Mirror", "description": "Bengaluru skies have been cloudy nearly most of the year and with pre-covid normalcy making a comeback, Vitamin D-deficient individuals are finding it hard to follow an active lifestyle.", "url": "https://bangaloremirror.indiatimes.com/bangalore/civic/bengalureans-get-your-daily-dose-of-vitamin-d/articleshow/91948569.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-289072,msid-91948523/91948523.jpg", "publishedAt": "2022-06-02T00:30:00Z", "content": "By Melvin MathewLack of sunny days causing rise in Vitamin D\r\n deficiency cases; doctors say exposure to sunlight every day mandatory to curb fatigue &amp; brittle bonesSunny days are on the wane and… [+2890 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Engineers Develop Nanoparticles That Cross the Blood-Brain Barrier - Neuroscience News", "description": "Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles can get into tumors and kill glioblastoma brain cancer cells.", "url": "https://neurosciencenews.com/bbb-nanoparticles-glioblastoma-20718/", "urlToImage": "https://neurosciencenews.com/files/2022/06/bbb-nanoparticles-neurosinces-public.jpg", "publishedAt": "2022-06-01T21:34:41Z", "content": "Summary: Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles … [+6811 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Diabetes: High blood sugar can affect vital organs, tips to keep your kidneys healthy - Times Now", "description": "Look around and you’ll find several people who suffer from diabetes. Diabetes is a major cause of kidney diseases and hence it is important that people with diabetes keep a regular check on their kidney health.", "url": "https://www.timesnownews.com/health/diabetes-high-blood-sugar-can-affect-vital-organs-tips-to-keep-your-kidneys-healthy-article-91945681", "urlToImage": "https://static.tnn.in/thumb/msid-91945681,imgsize-100,width-1280,height-720,resizemode-75/91945681.jpg", "publishedAt": "2022-06-01T17:16:18Z", "content": "KK death: 'ACs not working, 7000 people in auditorium against capacity of 3000' - BJP MP writes to Amit Shah"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Hearing Outcomes of Infants Born to Mothers With Active COVID-19 Infection - Cureus", "description": "Introduction\r\n\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and the ramifications on infant hearing. This retrospective s…", "url": "https://www.cureus.com/articles/99081-hearing-outcomes-of-infants-born-to-mothers-with-active-covid-19-infection", "urlToImage": "https://assets.cureus.com/uploads/figure/file/380347/article_river_b291b230d80d11eca5df6d9ad78e20f8-image.png", "publishedAt": "2022-06-01T17:13:32Z", "content": "Introduction\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and… [+22369 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Dallas: Neuroscientist Seeks Origins of Alcoholism at Molecular Level - India Education Diary", "description": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist is trying to pinpoint these neurological changes at", "url": "https://indiaeducationdiary.in/university-of-texas-at-dallas-neuroscientist-seeks-origins-of-alcoholism-at-molecular-level/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Texas-at-Dallas.jpg", "publishedAt": "2022-06-01T16:51:08Z", "content": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist … [+4496 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research: Diet unlikely to ease osteoarthritis, rheumatoid arthritis progression - ANI News", "description": "Washington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoarthritis and rheumatoid arthritis.", "url": "https://www.aninews.in/news/health/research-diet-unlikely-to-ease-osteoarthritis-rheumatoid-arthritis-progression20220601214649", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Arthritis_june2022010215540720220601155659.jpg", "publishedAt": "2022-06-01T16:16:00Z", "content": "ANI | Updated: Jun 01, 2022 21:46 IST\r\nWashington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoar… [+3954 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study links rising symptoms of depression among pregnant moms to their kids' behavioural issues - ANI News", "description": "Washington [US], June 1 (ANI): UCLA psychology researchers and colleagues have reported that children whose mothers experience rising levels of depression from the period before pregnancy until the months just after giving birth are at greater risk of develop…", "url": "https://www.aninews.in/news/lifestyle/parenting/study-links-rising-symptoms-of-depression-among-pregnant-moms-to-their-kids-behavioural-issues20220601214539", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ewftgw4etfrewrfre2022060115474620220601161508.jpg", "publishedAt": "2022-06-01T16:15:00Z", "content": "ANI | Updated: Jun 01, 2022 21:45 IST\r\nWashington [US], June 1 (ANI): UCLA psychology researchers and colleagues have reported that children whose mothers experience rising levels of depression from … [+4574 chars]"}, {"source": {"id": null, "name": "FoodNavigator.com"}, "author": "foodnavigator.com", "title": "Vitamin D food fortification works better with water and milk than in juice: study - FoodNavigator.com", "description": "By measuring the maximum concentration over time, Danish researchers found bioavailability of vitamin D to be higher in milk and water.", "url": "https://www.foodnavigator.com/Article/2022/06/01/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study", "urlToImage": "https://www.foodnavigator.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/science/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study/15464101-2-eng-GB/Vitamin-D-food-fortification-works-better-with-water-and-milk-than-in-juice-study.jpg", "publishedAt": "2022-06-01T14:43:00Z", "content": "Vitamin D insufficiency is a global health problem, linked with multiple health issues, including the immune response to COVID-19. Estimates show that as much as 40% of the European population could … [+1424 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "This one food can help reduce diabetes type 2 and LDL levels naturally - Times of India", "description": "There’s no denying that the high triglyceride levels and insulin imbalance are some of the major reasons why disorders like type 2 diabetes and high cholesterol happen, but did you know just modifying your diet with this one food can fix it all! Yes, it's tru…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/this-one-food-can-help-reduce-diabetes-and-cholesterol-naturally/photostory/91944245.cms", "urlToImage": "https://static.toiimg.com/photo/91944286.cms", "publishedAt": "2022-06-01T14:30:00Z", "content": "There are several ways to include oats in your diet given below:\r\nOats smoothie and shake: \r\nMake your fruit and vegetable smoothies and shakes healthier and heavy by adding soaked oats. This will he… [+738 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Lorraine L. Janeczko, MPH", "title": "TDF Use in HBV-HIV Coinfection Linked With Kidney, Bone Issues - Medscape", "description": "Kidney function and bone turnover may worsen in patients who are coinfected with HBV and HIV and take tenofovir disoproxil fumarate (TDF), researchers report.", "url": "https://www.medscape.com/viewarticle/974867", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_190510_truvada_800x450.jpg", "publishedAt": "2022-06-01T14:11:03Z", "content": "Patients coinfected with hepatitis B virus (HBV) and human immunodeficiency virus (HIV) who take tenofovir disoproxil fumarate (TDF) may have worsening renal function and bone turnover, according to … [+6041 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Reasons Behind Delayed or Irregular Menstrual Cycle - News18", "description": "The common causes can range from hormonal imbalances to serious medical conditions", "url": "https://www.news18.com/news/lifestyle/reasons-behind-delayed-or-irregular-menstrual-cycle-5277601.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/periods-163855917716x9.jpg", "publishedAt": "2022-06-01T13:38:22Z", "content": "There are many factors from changes in sleeping cycle to stress which can affect the menstrual cycle. Being pregnant is a possible reason for a missed period but there are also other factors that aff… [+1933 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Ayurveda tips to improve metabolism; dos and don'ts you must remember - Hindustan Times", "description": "Having a slow metabolism not only leads to weight gain but a series of health issues from skin troubles, hair loss, chronic fatigue, to unhealthy cravings. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/ayurveda-tips-to-improve-metabolism-dos-and-don-ts-you-must-remember-101654088955078.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/metabolism_1654089069171_1654089079489.jpg", "publishedAt": "2022-06-01T13:15:43Z", "content": "Having a good metabolism is important for the healthy functioning of the body. It is the process by which your body converts what you consume into energy. Having a slow metabolism not only leads to w… [+2452 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Swine flu outbreak: 3 H1N1 cases detected in Madhya Pradesh's Indore | Mint - Mint", "description": "Two men and a woman, who have been infected with the H1N1 virus, are undergoing treatment at a local hospital and their condition is said to be stable.", "url": "https://www.livemint.com/news/india/swine-flu-outbreak-3-h1n1-cases-detected-in-madhya-pradesh-s-indore-11654088428696.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/Swine_Flu_1654089009996_1654089010178.PNG", "publishedAt": "2022-06-01T13:11:30Z", "content": "Three persons have been found to be infected with swine flu in Madhya Pradesh's Indore and they are currently undergoing treatment for the same, a state health official informed on Wednesday.   Chief… [+1426 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Twitching can be a Warning Sign of Cancer, Look for These Symptoms - News18", "description": "Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywhere in the body", "url": "https://www.news18.com/news/lifestyle/twitching-can-be-a-warning-sign-of-cancer-look-for-these-symptoms-5273911.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/world-cancer-day-164821611916x9.png", "publishedAt": "2022-06-01T12:58:35Z", "content": "A dreadful disease, cancer can affect any part of the human body including blood, bones, lungs or liver. Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywher… [+1778 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Monkeypox virus outbreak: This `COUNTRY` confirms 12 more cases, patients have... - Zee News", "description": "The Spanish Ministry of Health has confirmed 12 new monkeypox cases, raising the total caseload to 132. Spain, followed by the UK, becomes the country with the most detected cases of the disease in the current outbreak, Xinhua news agency reported.", "url": "https://zeenews.india.com/india/monkeypox-virus-outbreak-this-country-confirms-12-more-cases-patients-have-mild-symptoms-2469459.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/01/1048954-webp.net-resizeimage-2022-06-01t173043.032.jpg", "publishedAt": "2022-06-01T12:01:53Z", "content": "The Spanish Ministry of Health has confirmed 12 new monkeypox cases, raising the total caseload to 132. Spain, followed by the UK, becomes the country with the most detected cases of the disease in t… [+648 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Bowl Method Can Help You Keep Your Calorie Intake In Check - News18", "description": "The bowl method simply involves choosing a small bowl to measure the portions of your food to prevent you from overeating", "url": "https://www.news18.com/news/lifestyle/how-bowl-method-can-help-you-keep-your-calorie-intake-in-check-5290369.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/untitled-design-8-165408126916x9.png", "publishedAt": "2022-06-01T11:02:14Z", "content": "Losing weight and going for a lean look is something almost everyone desires. While many of you may be training regularly in the gym and trying to shed those extra kilos, your diet plays an equally i… [+1573 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Eleanor Bird, M.S.", "title": "Monkeypox treatment: Smallpox antiviral shows promise - Medical News Today", "description": "A study looking at seven previous cases of monkeypox in the U.K. suggests that tecovirimat, an antiviral used against smallpox, may also treat monkeypox.", "url": "https://www.medicalnewstoday.com/articles/monkeypox-small-study-points-to-a-promising-antiviral", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/05/Antiviral-pills-factory-monkeypox-thumb.jpg", "publishedAt": "2022-06-01T11:00:33Z", "content": "<ul><li>In a new study, researchers describe seven cases of monkeypox that occurred in the United Kingdom between 2018 and 2021, the first cases of in-hospital and household transmission outside of A… [+6851 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Leeds: COVID-19's toll on global cardiac services - India Education Diary", "description": "A major study has revealed the global collateral damage caused by the disruption to cardiac services from the COVID-19 pandemic.Researchers warn that problems with heart health will “...continue to accrue unless mitigation strategies are speedily imp", "url": "https://indiaeducationdiary.in/university-of-leeds-covid-19s-toll-on-global-cardiac-services/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/University-of-Leeds.png", "publishedAt": "2022-06-01T10:50:48Z", "content": "A major study has revealed the global collateral damage caused by the disruption to cardiac services from the COVID-19 pandemic.\r\nResearchers warn that problems with heart health will …continue to ac… [+8324 chars]"}, {"source": {"id": null, "name": "Citizen Matters"}, "author": "Geeta Lal Sahai", "title": "Mental illness a ticking time bomb, say experts - Citizen Matters", "description": "Sadly, the state offers no help to families of people with mental illness, no medical help, economic security or concession of any sort.", "url": "https://citizenmatters.in/mental-illness-support-care-laws-guardianship-other-issues-30660", "urlToImage": "https://images.citizenmatters.in/wp-content/uploads/sites/2/2022/06/01122447/mental-illness-brain-pixabay-Jun22.jpg", "publishedAt": "2022-06-01T10:42:48Z", "content": "We are sitting on a mental health time bomb, say mental health experts. Our mental health policies need to be revisited.\r\nRepresentational image by Gerd Altmann/Pixabay CC0\r\nI just want to run away; … [+7067 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "EXPLAINED | The Difference Between A Cardiac Arrest And A Heart Attack - ABP Live", "description": "Heart attacks are caused by a blockage that stops blood flow to the heart, while a cardiac arrest is caused when the heart's electrical system malfunctions.", "url": "https://news.abplive.com/health/explained-the-difference-between-a-cardiac-arrest-and-a-heart-attack-1534983", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2022/06/01/2156667af492c63e82bdd48e15615078_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-06-01T10:28:39Z", "content": "New Delhi: Cardiovascular diseases (CVDs) are the leading cause of death globally, with an estimated 17.9 million deaths worldwide due to CVD in 2019. These deaths accounted for 32 per cent of all gl… [+3238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "'The long shadow of Long Covid has taken its toll on mental health,' expert says - The Indian Express", "description": "We speak to Dr Debasish Basu, professor and head of the Department of Psychiatry, Postgraduate Institute of Medical Education & Research, Chandigarh, to discuss the neuropsychiatric symptoms of Long Covid, the probable causes, how psychological factors like f…", "url": "https://indianexpress.com/article/lifestyle/health/long-covid-mental-health-impact-expert-7947200/", "urlToImage": "https://images.indianexpress.com/2022/05/Chennai-1-2.jpg", "publishedAt": "2022-06-01T09:57:16Z", "content": "ALONG with the Covid-19 pandemic, its Long Covid that has emerged as the new challenge for the medical fraternity.Brain fog, anxiety, constant fatigue, breathlessness, depression, muscle weakness, sl… [+6439 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Science has proof of how bad diet can lead to bad memory - ThePrint", "description": "Campus Voice is an initiative by ThePrint where young Indians get an opportunity to express their opinions on a prevalent issue.", "url": "https://theprint.in/campus-voice/science-has-proof-of-how-bad-diet-can-lead-to-bad-memory/976669/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/10/bacon-burger-beef-burger.jpg", "publishedAt": "2022-06-01T09:16:56Z", "content": "Strong immunity building is a drawing-room conversation in every house, especially after Covid. Despite an increased interest in the concept of immunity, most of the time we fail to put a stop to our… [+3836 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Major body organs affected by COVID; symptoms to watch out for - Times of India", "description": "With COVID, still being in pandemic stage, and in view of its consequence on other organs it is essential to know the basic symptoms associated with COVID which can guide the patient to seek medical assistance at the earliest.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-major-body-organs-affected-by-covid-symptoms-to-watch-out-for/photostory/91937253.cms", "urlToImage": "https://static.toiimg.com/photo/91937442.cms", "publishedAt": "2022-06-01T08:30:00Z", "content": "In the heart, COVID can cause acute coronary syndrome, congestive heart failure, myocarditis, and arrhythmias.\r\nThough the reasons behind these heart complications are several, COVID's link can not b… [+689 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Unnati Gusain", "title": "Zoonosis leads to 60% of all known infectious diseases, 75% emerging illnesses - News9 LIVE", "description": "A zoonosis is an infectious disease that is transmitted between species from animals to humans.", "url": "https://www.news9live.com/health/zoonosis-leads-to-60-of-all-known-infectious-diseases-75-emerging-illnesses-173718", "urlToImage": "https://media.news9live.com/h-upload/2022/06/01/407144-virus-a-member-of-the-virus-family-arenaviridae-is-a-single-stranded-rna-virus-and-is-zoonotic-850x5471.jpg", "publishedAt": "2022-06-01T07:29:20Z", "content": "Just as COVID-19, one of the worst zoonotic diseases was ebbing, monkeypox took over the headlines. According to the World Health Organization, monkeypox is a viral zoonotic disease, caused by monkey… [+5529 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: 8 Sweet Snacks Safe For Diabetics - NDTV", "description": "Eating something delicious if you are craving something sweet is not ideal if you have diabetes. Here are sweet snacks completely safe for diabetics.", "url": "https://www.ndtv.com/health/diabetes-8-sweet-snacks-safe-for-diabetics-3026251", "urlToImage": "https://c.ndtvimg.com/2020-05/i3hiuje8_chia-pudding_625x300_08_May_20.jpg", "publishedAt": "2022-06-01T06:43:01Z", "content": "Chia pudding is a healthy and sweet snack for diabetics\r\nDiabetes is caused as a response to resistance to insulin in the cells. Insulin is the hormone that helps regulate the glucose levels in the b… [+3415 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Thyroid: Types of disorders, risk factors, symptoms, tests - Hindustan Times", "description": "Here's all you need to know about thyroid hormones in normal health and disease conditions, the types of disorders due to imbalance in thyroid hormones, their symptoms and protocol for testing of thyroid diseases | Health", "url": "https://www.hindustantimes.com/lifestyle/health/thyroid-types-of-disorders-due-to-imbalance-in-thyroid-hormones-risk-factors-symptoms-protocol-for-testing-of-thyroid-diseases-101654063659006.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/FTzTfeQXsAMtjXR_1654064055678_1654064078267.jpg", "publishedAt": "2022-06-01T06:25:51Z", "content": "The thyroid gland, located in the front of the neck, is the main source of thyroid hormones in the body and hypothalamic thyrotropin-releasing hormone (TRH) stimulates thyroid-stimulating hormone (TS… [+6465 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Acute stress may hamper body’s fight against Covid, influenza: Study - EastMojo", "description": "Washington: Acute stress may impair the body's ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a", "url": "http://www.eastmojo.com/world/2022/06/01/acute-stress-may-hamper-bodys-fight-against-covid-influenza-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-8-13.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-01T06:10:00Z", "content": "Washington: Acute stress may impair the bodys ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a study conducted in mice.\r\nThe research, published … [+3621 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "IIT-D study reveals mechanisms driving SARS-CoV-2 evolution in humans - BioSpectrum India", "description": "The results lay the necessary groundwork for future studies", "url": "https://www.biospectrumindia.com/news/58/21351/iit-d-study-reveals-mechanisms-driving-sars-cov-2-evolution-in-humans.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_281615630-21351.jpg", "publishedAt": "2022-06-01T05:56:28Z", "content": "A team of researchers at the Indian Institute of Technology Delhi (IIT-D) has discovered the existence of temporal variations in selection pressures during SARS-CoV-2 evolution and adaptation to the … [+1222 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arthritis: 10 Common Workout Mistakes That Might Be Worsening Your Arthritis - NDTV", "description": "Working out is great if you have arthritis but doing it incorrectly might worsen it. Here are the most common workout mistakes you might be making.", "url": "https://www.ndtv.com/health/arthritis-10-common-workout-mistakes-that-might-be-worsening-your-arthritis-3015212", "urlToImage": "https://c.ndtvimg.com/2020-03/n6ssraqo_stairs-_625x300_09_March_20.jpg", "publishedAt": "2022-06-01T04:39:23Z", "content": "If you have arthritis, taking stairs might worsen your symptoms\r\nArthritis refers to the condition under which, you experience pain, swelling, and stiffness in your joints. Arthritis may be due to gr… [+3820 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Esha Chainani", "title": "The Issue With Seeing PCOS As Just a 'Period Problem' - The Swaddle", "description": "People think of PCOS as a purely physical problem that occurs a few days a month, as opposed to a chronic condition that reduces the overall quality of life.", "url": "https://theswaddle.com/the-issue-with-seeing-pcos-as-just-a-period-problem/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/06/PCOS-Editorials-min.png", "publishedAt": "2022-06-01T03:48:00Z", "content": "I constantly feel like Im a fat waste of space. These were the exact words Rekha*, 23 said when asked about her mental health during my consultation with her. \r\nAs a gynecologist in Mumbai specializi… [+8623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Paint your plate with colour: A meal packed with phytonutrients - Hindustan Times", "description": "From the health benefits of phytonutrients to the quantity of consumption that should be followed, here is all that you need to know. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/paint-your-plate-with-colour-a-meal-packed-with-phytonutrients-101654055021107.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/veggies_1653488130974_1654055055020.jpg", "publishedAt": "2022-06-01T03:46:30Z", "content": "Phytonutrients are natural compounds found in fruits, vegetables and whole grain products which helps in working with other essential nutrients in promoting good health. Phytonutrients come with mult… [+2335 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "姜璐", "title": "UK revises monkeypox guidelines as cases rise - Chinadaily.com.cn - China Daily", "description": "The United Kingdom's Health Security Agency (UKHSA) has issued revised guidelines about monkeypox after the outbreak of the virus across the UK saw the total number of cases so far rise to 179.", "url": "http://global.chinadaily.com.cn/a/202206/01/WS6296bd1ea310fd2b29e6029f.html", "urlToImage": "//img2.chinadaily.com.cn/images/202206/01/6296eb49a310fd2bec8cafcc.jpeg", "publishedAt": "2022-06-01T01:34:56Z", "content": "Test tube labeled \"Monkeypox virus positive\" are seen in this illustration taken May 22, 2022. [Photo/Agencies] \r\nThe United Kingdom's Health Security Agency (UKHSA) has issued revised guidelines abo… [+2894 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Manage your BP, manage your pregnancy - The New Indian Express", "description": "Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood.", "url": "https://www.newindianexpress.com/cities/chennai/2022/jun/01/manage-your-bp-manage-your-pregnancy-2460252.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/4/10/w600X390/Pregnant_Woman_Photo.jpg", "publishedAt": "2022-06-01T01:27:00Z", "content": "CHENNAI: Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood. You are said to have high blood pressure (also called hypertension) when this force of your blood … [+3466 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Does coffee protect against liver cancer, melanomas, oral and pharyngeal cancers OR causes the disease? A doct - Times Now", "description": "Dr Prasad Kasbekar, Consultant Surgical Oncologist, Masina Hospital, Byculla, Mumbai cites that studies suggest that coffee is not associated with cancers in general. A few studies have been associating coffee with the risk of bladder cancer and lung cancer, …", "url": "https://www.timesnownews.com/health/does-coffee-protect-against-liver-cancer-melanomas-oral-and-pharyngeal-cancers-or-causes-the-disease-a-doctor-explains-article-91929025", "urlToImage": "https://static.tnn.in/thumb/msid-91929025,imgsize-100,width-1280,height-720,resizemode-75/91929025.jpg", "publishedAt": "2022-06-01T01:15:45Z", "content": "Stocks to track in trade for June 02, 2022: RIL, Greaves Cotton, NMDC, Yes Bank, Religare, PDS"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Acute Myocardial Infarction After COVID-19 Vaccination: A Case Report - Cureus", "description": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine across the globe, various cases were reported with thrombotic ev…", "url": "https://www.cureus.com/articles/94893-acute-myocardial-infarction-after-covid-19-vaccination-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/362096/article_river_a05d5a90bc9e11ecb6c169d390228567-Figure-1.png", "publishedAt": "2022-05-31T17:39:04Z", "content": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine acro… [+12842 chars]"}]}