{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Scidev.net"}, "author": "davisweddi", "title": "New vaccines and old can curb drug resistance - WHO - SciDev.Net", "description": "Vaccines can prevent deadly infections, lessening the need for antimicrobial medicines, says the WHO.", "url": "https://www.scidev.net/global/news/new-vaccines-and-old-can-curb-drug-resistance-who/", "urlToImage": "https://www.scidev.net/global/wp-content/uploads/Argentina_AMR_MAIN.jpg", "publishedAt": "2022-07-19T09:50:38Z", "content": "[NEW DEHLI] Trials of new vaccine candidates must be accelerated and existing vaccine use stepped up to prevent life-threatening infections that can no longer be beaten by antimicrobial medicines, th… [+5523 chars]"}, {"source": {"id": null, "name": "Eletsonline.com"}, "author": null, "title": "Understanding electron technology and its pioneering power to better health | eHealth Magazine eHealth Magazine - Elets", "description": "Apply enough energy to an atom, and it becomes electrically charged. When such an atom, called an air ion, gains an electron, it becomes a negative ion.", "url": "https://ehealth.eletsonline.com/2022/07/understanding-electron-technology-and-its-pioneering-power-to-better-health/", "urlToImage": "https://ehealth.eletsonline.com/wp-content/uploads/2022/07/hitesh-ji.jpeg", "publishedAt": "2022-07-19T09:37:09Z", "content": "Apply enough energy to an atom, and it becomes electrically charged. When such an atom, called an air ion, gains an electron, it becomes a negative ion. Negative ion technology, or electron technolog… [+4469 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Amlan Sarkar", "title": "Early-Life Trauma May Speed Up Aging in Adults, Study Suggests - The Swaddle", "description": "Traumatic events encountered during childhood can lead to damage in cells, tissues, and organs.", "url": "https://theswaddle.com/early-life-trauma-may-speed-up-aging-in-adults-study-suggests/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/07/190722_early-abuse_Editorial.jpg", "publishedAt": "2022-07-19T09:36:43Z", "content": "An analysis of data from a long-term study on middle-aged to older Canadian adults has helped researchers establish new links in the relation between difficult childhoods and rapid biological aging i… [+4867 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "How Covid-19 can be dangerous in pregnancy - Deccan Herald", "description": "Pregnant women with SARS-CoV-2, the virus that causes Covid-19, had double the risk of being admitted to the intensive care unit (ICU), according to a study. The study, published in the Clinical Infectious Diseases journal, showed that pregnant women with Cov…", "url": "https://www.deccanherald.com/science-and-environment/how-covid-19-can-be-dangerous-in-pregnancy-1128086.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/07/19/clipboard-2022-02-16t025421922-1082027-1644960327-1084209-1645565751-1128086-1658222211.jpg", "publishedAt": "2022-07-19T09:16:51Z", "content": "Pregnant women with SARS-CoV-2, the virus that causes Covid-19, had double the risk of being admitted to the intensive care unit (ICU), according to a study.\r\nThe study, published in the Clinical Inf… [+1916 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Explainers", "title": "'Dil dhadakne do': How scientists grew a piece of a human heart in a laboratory - Firstpost", "description": "Scientists and researchers from University of Toronto and University of Montreal in Canada have grown a small-scale model of a human left heart ventricle — the main chamber of heart — in the lab. This can help in studying heart diseases and test out therapies…", "url": "https://www.firstpost.com/health/dil-dhadakne-do-how-scientists-grew-a-piece-of-a-human-heart-in-a-laboratory-10928871.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/07/laboratory-2815641_960_720.jpg", "publishedAt": "2022-07-19T09:10:40Z", "content": "Scientists and researchers from University of Toronto and University of Montreal in Canada have grown a small-scale model of a human left heart ventricle the main chamber of heart in the lab. This ca… [+4697 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Press Trust of India", "title": "'COVID-19 infection doubles risk of mental health problems, financial difficulties in older adults' - Firstpost", "description": "New research, recently published in the journal PNAS, used data from 5,146 adults between the ages of 52 and 74 to examine the immediate and longer-term impact of COVID-19 on their mental health, well-being, social interactions, and financial outcomes", "url": "https://www.firstpost.com/world/covid-19-infection-doubles-risk-of-mental-health-problems-financial-difficulties-in-older-adults-10928951.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/05/COVID-test-1.jpg", "publishedAt": "2022-07-19T09:05:19Z", "content": "New research, recently published in the journal PNAS, used data from 5,146 adults between the ages of 52 and 74 to examine the immediate and longer-term impact of COVID-19 on their mental health, wel… [+3844 chars]"}, {"source": {"id": null, "name": "Egypt Independent"}, "author": "CNN", "title": "Global study finds surprising results for alcohol consumption - Egypt Independent", "description": "(CNN) - No amount of alcohol is healthy if you are younger than 40, mostly due to alcohol-related deaths by auto accidents, injury and homicide, according to a new global study. If you are 40 or older", "url": "https://www.egyptindependent.com/global-study-finds-surprising-results-for-alcohol-consumption/", "urlToImage": "https://amayei.nyc3.digitaloceanspaces.com/2022/07/62cc21cdd8d2e.image_.jpg", "publishedAt": "2022-07-19T08:17:06Z", "content": "(CNN) – No amount of alcohol is healthy if you are younger than 40, mostly due to alcohol-related deaths by auto accidents, injury and homicide, according to a new global study.\r\nIf you are 40 or old… [+7383 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Bristol: Scientists discover genes that affect the risk of developing pre-leukaemia - India Education Diary", "description": "Led by scientists from the Universities of Bristol and Cambridge, the Wellcome Sanger Institute, the Health Research Institute of Asturias in Spain, and AstraZeneca, the study reveals that specific inherited genetic changes affect the likelihood of d", "url": "https://indiaeducationdiary.in/university-of-bristol-scientists-discover-genes-that-affect-the-risk-of-developing-pre-leukaemia/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/University_of_Bristol_logo-2-1024x309.png", "publishedAt": "2022-07-19T08:13:50Z", "content": "Led by scientists from the Universities of Bristol and Cambridge, the Wellcome Sanger Institute, the Health Research Institute of Asturias in Spain, and AstraZeneca, the study reveals that specific i… [+2955 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: Ayurvedic remedies to prevent heart and kidney disorders in diabetics - Hindustan Times", "description": "Diabetes can raise your risk of heart ailments and kidney disorders. Here are effective Ayurvedic tips to prevent these deadly diabetes complications. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/diabetes-ayurvedic-remedies-to-prevent-heart-and-kidney-disorders-in-diabetics-101658216501385.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/19/1600x900/diabetes_1652450112046_1658216544661_1658216544661.jpg", "publishedAt": "2022-07-19T07:47:24Z", "content": "Uncontrolled diabetes can take a toll on your heart and kidney health and over the time damage these crucial organs. From heart attack, stroke, cardiac failure to chronic kidney diseases requiring di… [+2638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Can You Cure Insomnia Through Exercising Regularly? - NDTV", "description": "Here's everything you need to know about the benefits of exercising if you have insomnia. We also discuss exercises that reduce insomnia symptoms.", "url": "https://www.ndtv.com/health/can-you-cure-insomnia-through-exercising-regularly-3149056", "urlToImage": "https://i.ndtvimg.com/i/2017-11/yoga-poses_650x400_81511260822.jpg", "publishedAt": "2022-07-19T07:16:17Z", "content": "Yoga has been proven helpful in reducing insomnia symptoms\r\nInsomnia is one of the most commonly known sleeping disorders. This sleeping condition causes a severe lack of sleep. Someone who suffers f… [+3764 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Saumya Kalia", "title": "People With Low BMIs Aren't Necessarily More Physically Active, Shows Study - The Swaddle", "description": "The research changes how we study obesity, as most effort so far has looked at people with high body mass index only.", "url": "https://theswaddle.com/study-shows-underweight-people-with-low-bmis-arent-necessarily-more-physically-active/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/07/BMI_Editorial.jpg", "publishedAt": "2022-07-19T07:04:58Z", "content": "There are a lot of untruths, scientific and cultural, about health and fitness, that we have come to embrace. Chief among them is that of the body mass index (BMI), a value calculated using people’s … [+5572 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Study Says Novel Coronavirus Manipulates Cells to Replicate - News18", "description": "Study explores how a human protein interacts with a SARS-CoV-2 protein, as well as one of the ways the virus that causes COVID-19 recruits cells to replicate", "url": "https://www.news18.com/news/lifestyle/study-says-novel-coronavirus-manipulates-cells-to-replicate-5583055-5583055.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/school-1-164966021316x9.jpg", "publishedAt": "2022-07-19T07:01:05Z", "content": "An article published in the journal Frontiers in Cellular and Infection Microbiology describes a study conducted by researchers at the State University of Campinas (UNICAMP) and the University of So … [+2926 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Personal Genomics can create a world without premature mortality due to NCD - ETHealthWorld", "description": "The global NCD-related premature mortality surge has also hit India where the total deaths caused by NCDs, as per a report by Apollo Hospitals Group released in 2021, went up to almost 65 percent. With NCDs increasingly affecting life’s most productive phase,…", "url": "https://health.economictimes.indiatimes.com/news/industry/personal-genomics-can-create-a-world-without-premature-mortality-due-to-ncd/92974187", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92974187,imgsize-52446,width-1200,height-628,overlay-ethealthworld/personal-genomics-can-create-a-world-without-premature-mortality-due-to-ncd.jpg", "publishedAt": "2022-07-19T06:46:00Z", "content": "Dr Sajeev NairThe premature mortality and morbidity from non-communicable diseases (NCDs) which are not contagious have emerged as a key global concern. According to a report on mortality due to NCDs… [+5574 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Radiocontrast-Diatrozate and Iopromide-Induced Severe Hypocalcemia Leading to Painful Tetanic and Severe Laryngeal Spasm: A Near Fatal Encounter - Cureus", "description": "Routinely advised radiological investigations like contrast-enhanced scans can have adverse effects on electrolyte imbalance due to the administration of Radiocontrast. Urograffin (Diatrizoate) and Ultravist (Iopromide) are some of the common examples of cont…", "url": "https://www.cureus.com/articles/101718-radiocontrast-diatrozate-and-iopromide-induced-severe-hypocalcemia-leading-to-painful-tetanic-and-severe-laryngeal-spasm-a-near-fatal-encounter", "urlToImage": "https://assets.cureus.com/uploads/figure/file/392156/article_river_9b30ab40f9ce11ec9a80b563cf364829-calciumcasereportPicture-1.png", "publishedAt": "2022-07-19T06:42:52Z", "content": "Routinely advised radiological investigations like contrast-enhanced scans can have adverse effects on electrolyte imbalance due to the administration of Radiocontrast. Urograffin (Diatrizoate) and U… [+10002 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "High blood viscosity can predict higher risk of death in COVID-19 hospitalised patients: Study - Deccan Herald", "description": "Patients hospitalised with COVID-19 who have a high estimated blood viscosity are more likely to die from complications. High blood viscosity reduces blood flow to small vessels and raises the risk of blood clots. This blood thickness measurement can be used …", "url": "https://www.deccanherald.com/video/science-and-environment/high-blood-viscosity-can-predict-higher-risk-of-death-in-covid-19-hospitalised-patients-study-1128038.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2022/07/19/jul19v10-1128038-1658211978.jpg", "publishedAt": "2022-07-19T06:26:18Z", "content": "Patients hospitalised with COVID-19 who have a high estimated blood viscosity are more likely to die from complications. High blood viscosity reduces blood flow to small vessels and raises the risk o… [+953 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Unhealthy Habits You Need To Get Rid Of Immediately For A Healthy Heart - News18", "description": "If its symptoms are not taken care of in time, a  person may even lose their life.", "url": "https://www.news18.com/news/lifestyle/5-unhealthy-habits-you-need-to-get-rid-of-immediately-for-a-healthy-heart-5582875.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/001-21-4-165821111716x9.png", "publishedAt": "2022-07-19T06:14:19Z", "content": "Our sedentary lifestyle is a source of many problems and the latest is the rising cases of people reporting heart issues. Heart-related problems can start due to many reasons like lack of exercise, c… [+2467 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Monkeypox cases in Israel surpass 100 - Ahmedabad Mirror", "description": "Monkeypox cases in Israel have totaled 101, with 35 new cases detected over the past week, the county&#39;s Health Ministry said in a statement.\n\nThe Ministry on Monday added that it has ordered 10,000 doses of vaccine produced by Danish manufacturer Bavarian…", "url": "https://www.ahmedabadmirror.com/monkeypox-cases-in-israel-surpass-100/81839428.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1658209887028.jpg-org", "publishedAt": "2022-07-19T06:04:26Z", "content": "Monkeypox cases in Israel have totaled 101, with 35 new cases detected over the past week, the county's Health Ministry said in a statement.\r\nThe Ministry on Monday added that it has ordered 10,000 d… [+809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Pune sees spike in dengue fever, 50 cases confirmed in two weeks - The Indian Express", "description": "Dengue fever is transmitted to humans through the bite of infected mosquitoes. The primary vectors that transmit the disease are Aedes aegypti mosquitoes and breeding occurs mainly through man-made containers, including buckets and discarded containers, offic…", "url": "https://indianexpress.com/article/cities/pune/pune-dengue-spike-8038300/", "urlToImage": "https://images.indianexpress.com/2022/07/dengue.jpg", "publishedAt": "2022-07-19T06:03:48Z", "content": "The health department of the Pune Municipal Corporation has said that there has been a rise in the number of dengue cases in the city. Close to 200 cases of dengue and 72 of chikungunya have been con… [+2267 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "India's first cervical cancer vaccine Cervavac to be out soon, know how it works - DNA India", "description": "India's first Quadrivalent Human Papillomavirus vaccine manufactured by SII will be launched by the end of the year.", "url": "https://www.dnaindia.com/health/report-india-s-first-cervical-cancer-vaccine-to-be-out-soon-sii-cervavac-quadrivalent-human-papillomavirus-2969717", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/07/19/2523518-fotojet-44-1.jpg", "publishedAt": "2022-07-19T05:48:18Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Jul 19, 2022, 11:18 AM ISTThe Centre plans to roll out India’s first Quadrivalent Human Papillomavirus vaccine (qHPV), manufacture… [+1917 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Apple Cider Vinegar Improves Indigestion, Says Nutritionist Anjali Mukherjee - NDTV Doctor", "description": "Apple Cider Vinegar is prepared by fermenting the sugar from the apples.", "url": "https://doctor.ndtv.com/living-healthy/can-apple-cider-vinegar-aid-indigestion-anjali-mukherjee-answers-3168987", "urlToImage": "https://c.ndtvimg.com/2022-06/1hke08c8_weight-loss-drinks_625x300_28_June_22.jpg", "publishedAt": "2022-07-19T05:29:44Z", "content": "Are you someone who suffers from indigestion? Do you feel constant pain in your abdominal region? If yes, then please fret not as there is nothing to worry about. All you need to do is keep a check o… [+2929 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "Still coughing after COVID? Here’s why it happens and what to do about it - EastMojo", "description": "Coughing is a socially awkward symptom, particularly since the COVID pandemic hit. The problem is, coughing may persist for weeks or months after the", "url": "http://www.eastmojo.com/coronavirus-updates/2022/07/19/still-coughing-after-covid-heres-why-it-happens-and-what-to-do-about-it/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/07/Untitled-design-2022-07-18T135903.005.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-07-19T04:30:00Z", "content": "Coughing is a socially awkward symptom, particularly since the COVID pandemic hit.\r\nThe problem is, coughing may persist for weeks or months after the infection has gone. Around 2.5% of people are st… [+6448 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Nonpharmaceutical Interventions to Prevent SARS-CoV-2 - Medscape", "description": "Basic reproduction number measurements provide insight into the effectiveness of nonpharmaceutical interventions in preventing the transmission of SARS-CoV-2 in healthcare settings.", "url": "https://www.medscape.com/viewarticle/976465", "urlToImage": "https://img.medscape.com/thumbnail_library/Social_Facebook_806x806.jpg", "publishedAt": "2022-07-19T04:08:18Z", "content": "Abstract and Introduction \r\nAbstract\r\nOutbreaks of SARS-CoV-2 infection frequently occur in hospitals. Preventing nosocomial infection requires insight into hospital transmission. However, estimates … [+3700 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "The right way to eat protein to boost your health - Times of India", "description": "The building block of life is protein. One might suffer from several health problems if he/she does not get enough", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/the-right-way-to-eat-protein-to-boost-your-health/articleshow/92959761.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92959829,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-2446186/92959829.jpg", "publishedAt": "2022-07-19T03:30:00Z", "content": "The building block of life is protein. One might suffer from several health problems if he/she does not get enough protein. However, consuming more than required isn't necessarily better. Although it… [+3706 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Zika virus silently spreading across India: Here's all you need to know - Business Standard", "description": "Like dengue, yellow fever, and chikungunya, Zika also is a mosquito-borne infection. Watch this video to know all about the virus#Zika #Zikavirus #Virus #dis...", "url": "https://www.youtube.com/watch?v=Y4zl-1rbwS0", "urlToImage": "https://i.ytimg.com/vi/Y4zl-1rbwS0/hqdefault.jpg", "publishedAt": "2022-07-19T03:22:34Z", "content": null}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Why do heart failures rise with age among men? - Sentinelassam - The Sentinel Assam", "description": "Men die, on average, several years younger than women, a difference that previous studies have...", "url": "https://www.sentinelassam.com/international/why-do-heart-failures-rise-with-age-among-men-603245", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/07/19/366126-2183126.jpg", "publishedAt": "2022-07-19T03:12:46Z", "content": "LONDON: Loss of the Y chromosome - male sex chromosome - in elderly men causes development of fibrosis in the heart, impaired heart function, and death from cardiovascular diseases, finds a study.\r\nM… [+2580 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "French lab scientists couldn't make bat virus mutate to become like SARS-CoV-2. Why it matters - ThePrint", "description": "Scientists at Pasteur Institute in France conducted experiments with bat virus similar to SARS-CoV-2 & tried to spur evolution of a mutation that could cause it to adapt to human cells.", "url": "https://theprint.in/health/french-lab-scientists-couldnt-make-bat-virus-mutate-to-become-like-sars-cov-2-why-it-matters/1044761/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/07/bat-flickr.jpg", "publishedAt": "2022-07-19T01:30:48Z", "content": "New Delhi: In a study that has yielded potentially important clues about the origins of the Covid-19 pandemic, scientists of the Pasteur Institute in France conducted experiments with a bat virus sim… [+5818 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study links low vitamin D level with risk of dementia - News-Medical.Net", "description": "The American Journal of Clinical Nutrition has recently published a study that describes the impact of vitamin D status on brain health. The study findings reveal that vitamin D deficiency increases the risk of dementia.", "url": "https://www.news-medical.net/news/20220718/Study-links-low-vitamin-D-level-with-risk-of-dementia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_719793_16581908711815992.jpg", "publishedAt": "2022-07-19T00:36:00Z", "content": "The American Journal of Clinical Nutrition has recently published a study that describes the impact of vitamin D status on brain health. The study findings reveal that vitamin D deficiency increases … [+4072 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Too much restriction of salt may worsen outcomes in patients with HF with preserved ejection fraction - Medical Dialogues", "description": "Salt restriction is frequently recommended in heart failure guidelines, but the optimal restriction...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/too-much-restriction-of-salt-may-worsen-outcomes-in-patients-with-hf-with-preserved-ejection-fraction-96193", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/11/178408-heart.jpg", "publishedAt": "2022-07-18T23:30:54Z", "content": "Salt restriction is frequently recommended in heart failure guidelines, but the optimal restriction range (from less than 1.5 g to less than 3 g daily) and its effect on patients with heart failure w… [+4853 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Long COVID affects 23 per cent SARS-CoV-2 patients, study says - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Top Stories", "description": "LOS ANGELES, July 18: About 23 per cent of people infected with the SARS-CoV-2 virus may develop long COVID with symptoms lasting for more than 12 weeks, according to a study. The research, published recently in the journal Scientific Reports, also identified…", "url": "https://www.dailyexcelsior.com/long-covid-affects-23-per-cent-sars-cov-2-patients-study-says-2/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/07/long-covid-symtoms.jpg", "publishedAt": "2022-07-18T21:31:11Z", "content": "LOS ANGELES, July 18:About 23 per cent of people infected with the SARS-CoV-2 virus may develop long COVID with symptoms lasting for more than 12 weeks, according to a study.The research, published r… [+2723 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study offers new insights into brain metastases in patients with melanoma - News-Medical.Net", "description": "Brain metastasis is one of the most common causes of cancer-related deaths and occurs very frequently in patients with advanced melanoma.", "url": "https://www.news-medical.net/news/20220718/Study-offers-new-insights-into-brain-metastases-in-patients-with-melanoma.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Melanoma-620x480.jpg", "publishedAt": "2022-07-18T21:19:00Z", "content": "Brain metastasis is one of the most common causes of cancer-related deaths and occurs very frequently in patients with advanced melanoma. Although new immunotherapies are effective in some patients w… [+3960 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Cryptogenic Disease X: An imminent pandemic - Rising Kashmir", "description": "According to the World Health Organization (WHO), \"Disease X represents the knowledge that a serious international epidemic or pandemic could be caused by a pathogen currently unknown to cause human disease\"", "url": "https://www.risingkashmir.com/displaynews.aspx?news=111570", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637937442313209110_web-lungs-452st.jpg", "publishedAt": "2022-07-18T19:30:40Z", "content": "Yes, it is incredibly intriguing for scientists to launch their hypotheses about new and emerging illnesses, but it's also imperative to envisage what kind of template it imprints on the brains of or… [+7965 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Excellent Outcomes With the Selective Use of Oral Antibiotic Therapy for Bone and Joint Infections: A Single-Center Experience - Cureus", "description": "Background and objective\r\n\r\nRecent studies have challenged the notion that prolonged intravenous (IV) antibiotics are preferable to oral antibiotics for treating musculoskeletal infections. Our institution’s orthopedic surgery and orthopedic infectious diseas…", "url": "https://www.cureus.com/articles/97555-excellent-outcomes-with-the-selective-use-of-oral-antibiotic-therapy-for-bone-and-joint-infections-a-single-center-experience", "urlToImage": "https://assets.cureus.com/uploads/figure/file/402532/article_river_91fd5fd0f56b11ecb657f52f0496d2b5-Figure-1.png", "publishedAt": "2022-07-18T19:23:04Z", "content": "Background and objective\r\nRecent studies have challenged the notion that prolonged intravenous (IV) antibiotics are preferable to oral antibiotics for treating musculoskeletal infections. Our institu… [+20510 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Late Night News | Latest Updates | Monkey Pox Threat | Ben Stokes Retire | Maharashtra Bus Flooded - CNN-News18", "description": "LATE NIGHT NEWS | LATEST UPDATES | MONKEY POX THREAT | BEN STOKES RETIRE | Madhya Pradesh Bus Flooded#monkeypox #benstokes #maharashtrapolitics", "url": "https://www.youtube.com/watch?v=pYBih3zgRwI", "urlToImage": "https://i.ytimg.com/vi/pYBih3zgRwI/hqdefault.jpg", "publishedAt": "2022-07-18T17:14:07Z", "content": null}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "DCGI approves Themis Medicare’s VIRALEX for COVID-19 and other viral respiratory infection - msnNOW", "description": "Meanwhile, VIRALEX is an oral medication available in the form of a 500 mg tablet and is available only on prescription from a Registered Medical Practitioner.", "url": "https://www.financialexpress.com/healthcare/covid-19/dcgi-approves-themis-medicares-viralex-for-covid-19-and-other-viral-respiratory-infection/2598130/?utm_source=msn&amp;utm_medium=Referral", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAZGQNI.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2022-07-18T15:44:00Z", "content": "© Provided by The Financial Express\r\n The company claims that VIRALEX is an immunomodulatory agent with an anti-viral action having an established safety profile. (File)\r\nThemis Medicare on Monday an… [+1900 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Normal saline prevents urethrorectal fistulas after prostate cryoablation: Study - Medical Dialogues", "description": "China: In a new study conducted by Ning Wang and colleagues, it was shown that normal saline (NS)...", "url": "https://medicaldialogues.in/urology/news/normal-saline-prevents-urethrorectal-fistulas-after-prostate-cryoablation-study-96188", "urlToImage": "https://medicaldialogues.in/h-upload/2021/04/19/151424-surgery.jpg", "publishedAt": "2022-07-18T15:30:06Z", "content": "China: In a new study conducted by Ning Wang and colleagues, it was shown that normal saline (NS) injection can be used to increase the anterior perirectal space following cryoablation surgery which … [+2053 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the impact of lower COVID-19 vaccine doses in younger cohorts? - News-Medical.Net", "description": "A new study evaluated the impact of the lower SARS-CoV-2 vaccine dosages in younger populations.", "url": "https://www.news-medical.net/news/20220718/What-is-the-impact-of-lower-COVID-19-vaccine-doses-in-younger-cohorts.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_719727_16581553204817762.jpg", "publishedAt": "2022-07-18T14:54:00Z", "content": "A recent study published in the Open Forum Infectious Diseases journal evaluated the impact of the lower severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) vaccine dosages in younger popula… [+9409 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "intranasal corticosteroids not recommended for most children with OSA: study - Medical Dialogues", "description": "According to a recent study published in The Chest, treatment with intranasal corticosteroids is...", "url": "https://medicaldialogues.in/pulmonology/news/intranasal-corticosteroids-not-recommended-for-most-children-with-osa-study-96046", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/14/180745-images.jpg", "publishedAt": "2022-07-18T14:15:19Z", "content": "According to a recent study published in The Chest, treatment with intranasal corticosteroids is ineffective in children with obstructive sleep apnea syndrome.Obstructive sleep apnea occurs when the … [+2577 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "New Yorkers turn up in large numbers to get monkeypox vaccine - WION", "description": "New York has emerged as epicentre for the outbreak of monkeypox in the USA. When monkeypox vaccines became available, New Yorkers queue up in long lines to ensure they get vaccinated.", "url": "https://www.wionews.com/photos/new-yorkers-turn-up-in-large-numbers-to-get-monkeypox-vaccine-498545", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/photo_page/public/2022/07/18/280124-monkeypox-2.jpg", "publishedAt": "2022-07-18T13:24:50Z", "content": "New York has emerged as epicentre for the outbreak of monkeypox in the USA. When monkeypox vaccines became available, New Yorkers queue up in long lines to ensure they get vaccinated."}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds online parenting courses protect kids against negative impacts of divorce - ANI News", "description": "Arizona [US], July 18 (ANI): An online parenting skills programme for separating or divorcing parents reduces interparental conflict, enhances parenting quality, and lessens symptoms of anxiety and sadness in children, according to a recent study from the Ari…", "url": "https://www.aninews.in/news/lifestyle/parenting/study-finds-online-parenting-courses-protect-kids-against-negative-impacts-of-divorce20220718181901", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/dtrvtvfvvvv2022071812312320220718124823.jpg", "publishedAt": "2022-07-18T12:49:00Z", "content": "Arizona [US], July 18 (ANI): An online parenting skills programme for separating or divorcing parents reduces interparental conflict, enhances parenting quality, and lessens symptoms of anxiety and s… [+4170 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Arpita Sarkar", "title": "These Food Items Can Prevent Your Allergy Problems; Check Out! - Woman's Era", "description": "Womansera magazine is a platform for women to get latest info and tips on fashion, beauty, health and relationship advice. Subscribe to India's No.1 women's magazine!", "url": "https://womansera.com/these-food-items-can-prevent-your-allergy-problems-check-out/", "urlToImage": "https://womansera.com/wp-content/uploads/2022/07/allergies.jpg", "publishedAt": "2022-07-18T12:48:44Z", "content": "Everyone has an immune system of their own. When that immune system is disturbed for some reason, it manifests itself in allergy-like problems. So first of all it is necessary to keep the immune syst… [+1475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "25 million kids missed routine vaccinations because of COVID - The Indian Express", "description": "About 25 million children worldwide have missed out on routine immunizations against common diseases because the coronavirus pandemic disrupted regular health services.", "url": "https://indianexpress.com/article/parenting/health-fitness/25-million-kids-missed-routine-vaccinations-because-of-covid-8031062/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-cdc-3992931.jpg", "publishedAt": "2022-07-18T11:52:08Z", "content": "About 25 million children worldwide have missed out on routine immunizationsagainst common diseases like diptheria, largely because the coronavirus pandemic disrupted regular health services or trigg… [+2857 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Stellenbosch University: Study says, Covid-19 impact could have been less devastating if populations were healthier - India Education Diary", "description": "Aside from vaccination, focussed public health efforts to target obesity could be a safeguard in a potential future novel viral pandemic, according to frontline Covid-19 doctors from Stellenbosch University (SU) and the University of Cape Town (UCT).", "url": "https://indiaeducationdiary.in/stellenbosch-university-study-says-covid-19-impact-could-have-been-less-devastating-if-populations-were-healthier/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/06/Stellenbosch-University-1024x717.jpg", "publishedAt": "2022-07-18T11:45:48Z", "content": "Aside from vaccination, focussed public health efforts to target obesity could be a safeguard in a potential future novel viral pandemic, according to frontline Covid-19 doctors from Stellenbosch Uni… [+4676 chars]"}, {"source": {"id": null, "name": "Raillynews.com"}, "author": "leventelmastas", "title": "Common Misconceptions about Cholesterol - RaillyNews", "description": "Known Facts About Cholesterol - Yeditepe University Kozyatağı Hospital Internal Medicine specialist Dr. Mehmet Akif Öztürk, the society still has enough information about cholesterol", "url": "https://www.raillynews.com/2022/07/misconceptions-about-cholesterol/", "urlToImage": "https://rayhaber.com/wp-content/uploads/2022/07/Kolesterolle-Ilgili-Dogru-Bilinen-Yanlislar.jpg", "publishedAt": "2022-07-18T11:31:32Z", "content": "Common Misconceptions about Cholesterol\r\nYeditepe University Kozyata Hospital Internal Medicine specialist Dr. Mehmet Akif Öztürk argued that the society still does not have enough information about … [+3739 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Tara Haelle", "title": "Marital Status Plays Modest Role in Gastric Cancer Survival - Medscape", "description": "Though the study identified better overall survival among married patients, the findings more likely represent a proxy for a stronger support network rather than an effect from marital status itself.", "url": "https://www.medscape.com/viewarticle/977381", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220712_marital_status_survey_800x450.jpg", "publishedAt": "2022-07-18T10:56:19Z", "content": "Marital status is a relevant risk factor in considering the prognosis of patients with gastric cancer, according to research published in the Journal of Investigative Medicine.\r\nTumor size remained t… [+7732 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Antacids and heart diseases: Doctors explain the relationship - Hindustan Times", "description": "Doctors pointed out the relationship between the overuse of antacids and how it can lead to cardiovascular diseases. Know all about it here. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/antacids-and-heart-diseases-doctors-explain-the-relationship-101658140781452.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/18/1600x900/x_1658140811907_1658140820231_1658140820231.jpg", "publishedAt": "2022-07-18T10:43:40Z", "content": "Antacids are medicines which help in neutralising the acid in the stomach. Acid reflux is caused by the backward flow of the stomach acid into the esophagus. This further causes burning pain in the c… [+2333 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA  Web Team", "title": "In depth about breast cancer: Symptoms, risk factors and all you need to know - DNA India", "description": "Here is all you need to know about breast cancer, and its various symptoms and risk factors.", "url": "https://www.dnaindia.com/health/report-in-depth-about-breast-cancer-symptoms-risk-factors-and-all-you-need-to-know-2969498", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/07/18/2523303-fotojet-42-1.jpg", "publishedAt": "2022-07-18T10:14:51Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Jul 18, 2022, 03:44 PM ISTBreast cancer also referred to as the “silent killer” is the second most common cancer after skin cancer… [+2443 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "The characteristics of circulating T follicular helper cells in COVID-19 patients across mild to severe disease - News-Medical.Net", "description": "Researchers found that late generation of functional SARS-CoV-2-selective circulating T follicular helper cells correlated with severe illness.", "url": "https://www.news-medical.net/news/20220718/The-characteristics-of-circulating-T-follicular-helper-cells-in-COVID-19-patients-across-mild-to-severe-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_719693_16581388801755086.jpg", "publishedAt": "2022-07-18T10:13:00Z", "content": "In a recent study posted to the medRxiv* preprint server, researchers found that late generation of functional severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2)-selective circulating T fol… [+5402 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "COVID-19 vaccine protection short-lived, booster shots important: Study - ThePrint", "description": "Washington, Jul 18 (PTI) Strong protection following COVID-19 vaccination is short-lived, making an additional booster shot necessary for individuals, according to a study. The research, published in the journal Proceedings of the National Academy of Sciences…", "url": "https://theprint.in/world/covid-19-vaccine-protection-short-lived-booster-shots-important-study/1044038/", "urlToImage": null, "publishedAt": "2022-07-18T10:00:06Z", "content": "Washington, Jul 18 (PTI) Strong protection following COVID-19 vaccination is short-lived, making an additional booster shot necessary for individuals, according to a study.\r\n The research, published … [+2719 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "Monsoon season: How to boost your immunity to deal with diseases that spread during rains - Asianet Newsable ", "description": "We spoke to Dr Haroon. H, Consultant - Internal Medicine, KMC Hospital, BR Ambedkar Circle, Mangalore, who gave us some tips and advice to fight from Monsoon diseases", "url": "https://newsable.asianetnews.com/lifestyle/monsoon-season-how-to-boost-your-immunity-to-deal-with-diseases-that-spread-during-rains-rba-rf7l6p", "urlToImage": "https://static-ai.asianetnews.com/images/01g7xe4w00vbzyhjafwpv9qfek/7-infections-during-rainy-season---2-_1200x630xt.jpg", "publishedAt": "2022-07-18T09:04:01Z", "content": "We spoke to Dr Haroon. H, Consultant - Internal Medicine, KMC Hospital, BR Ambedkar Circle, Mangalore, who gave us some tips and advice to fight from Monsoon diseasesIndia generally experiences monso… [+3536 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Carotenoid-Rich Diet Could Improve Women's Health - Technology Networks", "description": "Research suggests that rates of illness in women can be improved by a diet high in pigmented carotenoids such as yams, kale, spinach, watermelon, bell peppers, tomatoes, oranges and carrots, particularly for preventing visual and cognitive loss.", "url": "https://www.technologynetworks.com/applied-sciences/news/carotenoid-rich-diet-could-improve-womens-health-363775", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/363775/carotenoid-rich-diet-could-improve-womens-health-363775-640x360.jpg?cb=20220718", "publishedAt": "2022-07-18T09:00:16Z", "content": "Women tend to live longer than men but typically have higher rates of illness. Now, new research from University of Georgia suggests these higher rates of illness can be improved by a better diet, on… [+3734 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Dani Blum", "title": "Why is Endometriosis Often Ignored? Symptoms and Treatment, Explained - The New York Times", "description": "Nearly one in 10 women experience the chronic pain of endometriosis, but for many, the symptoms are dismissed. Why is this still happening?", "url": "https://www.nytimes.com/2022/07/18/well/live/endometriosis-symptoms-treatment.html", "urlToImage": "https://static01.nyt.com/images/2022/07/17/well/17well-endometriosis/17well-endometriosis-facebookJumbo.jpg", "publishedAt": "2022-07-18T09:00:03Z", "content": "For some people with Stage 4, they never have any pain in their whole life, she said. And some people with barely Stage 1 have the worst pain and cant get out of bed.\r\nDespite patients pain, doctors … [+1448 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Patterns and Trajectories of Pulmonary Function in Coronavirus Disease 2019 Survivors: An Exploratory Study Conducted in Central India - Cureus", "description": "Background: The ongoing pandemic of coronavirus disease 2019 (COVID-19) has negatively impacted respiratory health worldwide. The severity of the disease varies considerably, and patients may present with bronchitis, pneumonia, and acute respiratory distress …", "url": "https://www.cureus.com/articles/94975-patterns-and-trajectories-of-pulmonary-function-in-coronavirus-disease-2019-survivors-an-exploratory-study-conducted-in-central-india", "urlToImage": "https://assets.cureus.com/uploads/figure/file/398636/article_river_edc9b930f06b11ecafd57fb9667e29ff-g1-4-.png", "publishedAt": "2022-07-18T04:59:18Z", "content": "Background: The ongoing pandemic of coronavirus disease 2019 (COVID-19) has negatively impacted respiratory health worldwide. The severity of the disease varies considerably, and patients may present… [+28576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stressed At Work? Here's How You Can Lower Work Stress - NDTV", "description": "Try these 12 tips if you have been experiencing work stress.", "url": "https://www.ndtv.com/health/stressed-at-work-heres-how-you-can-lower-work-stress-3113385", "urlToImage": "https://c.ndtvimg.com/nev29p7o_talking-while-sleeping_625x300_23_August_18.jpg", "publishedAt": "2022-07-18T04:30:58Z", "content": "Getting proper sleep can help reduce work stress\r\nStress is a normal emotion that one may experience towards something. It can cause mental and physical reactions in the body. Stress at work is one o… [+3355 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Monkeypox cases likely undercounted: Dr. Anthony Fauci - Sentinelassam - The Sentinel Assam", "description": "And although monkeypox is not a sexually transmitted disease, it has mostly been spreading among men ...", "url": "https://www.sentinelassam.com/international/monkeypox-cases-likely-undercounted-dr-anthony-fauci-603050", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/07/18/365715-httpsd1e00ek4ebabmscloudfrontnetproduction7ba38544-9e46-4e6c-984c-4c14be2dbb7f.jpg", "publishedAt": "2022-07-18T03:14:34Z", "content": "NEW YORK: The monkeypox case is likely undercounted, said top US infectious disease expert Dr. Anthony Fauci, emphasising the need to take the disease more seriously. \r\nThe US Centers for Disease Con… [+2201 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Involve communities: TB elimination is a people’s agenda - ETHealthWorld", "description": "Given the number of TB cases in the country, there is an urgent need to foreground the problem and place TB patients at the centre, surrounded by a supportive ecosystem of family and the community. Since TB patients suffer socio-economic consequences like sti…", "url": "https://health.economictimes.indiatimes.com/news/policy/involve-communities-tb-elimination-is-a-peoples-agenda/92936471", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92936471,imgsize-427329,width-1200,height-628,overlay-ethealthworld/involve-communities-tb-elimination-is-a-people-s-agenda.jpg", "publishedAt": "2022-07-18T01:42:00Z", "content": "by Dr Rehana BegumAccording to World Health Organization (WHO), 10 million people are afflicted with tuberculosis (TB) annually. Though both preventable and curable, each year, 1.5 million people die… [+4435 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Toby Amidor, MS, RD, CDN", "title": "The #1 Worst Protein for Your Heart, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "Among the many protein options out there, this is the worst kind to consume. Here's what you should know to keep your heart healthy.", "url": "http://www.eatthis.com/worst-protein-heart/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/07/bacon-sausage-breakfast.jpg?quality=82&strip=all", "publishedAt": "2022-07-17T10:40:18Z", "content": "Protein is a macronutrient that provides the body with amino acids that are used for many biological roles in the body. You can get protein from both plant and animal foods, but you do have to be mor… [+2736 chars]"}]}