{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Mallika Soni", "title": "Tick virus detected in UK, health agency warns: What we know so far - Hindustan Times", "description": "Tick Virus In UK: People should check their clothes and body regularly for ticks after being outdoors, the health agency advised. | World News", "url": "https://www.hindustantimes.com/world-news/tick-virus-detected-in-uk-health-agency-warns-what-we-know-so-far-101680656407521.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/05/1600x900/_129273270_gettyimages-1289080738jpg_1680665806597_1680665806854_1680665806854.webp", "publishedAt": "2023-04-05T03:48:59Z", "content": "A tick virus which can cause serious meningitis-like symptoms has been detected in several areas in England, UK Health Security Agency (UKHSA) informed. The agency advised changes to testing in hospi… [+1908 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "How does nutrition affect female fertility? - News-Medical.Net", "description": "A new study reviews current evidence supporting the role of nutrition as a modifiable risk factor for female infertility and poor IVF outcomes.", "url": "https://www.news-medical.net/news/20230404/How-does-nutrition-affect-female-fertility.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_744049_16806242136499992.jpg", "publishedAt": "2023-04-05T01:22:00Z", "content": "A new study published in the journal Reproductive Toxicologyreviews current evidence supporting the role of nutrition as a modifiable risk factor for female infertility and poor in vitro fertilizatio… [+5037 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Robert Abraham", "title": "Get tuberculosis diagnosis in 2 hours at PGIMER Chandigarh - Hindustan Times", "description": "Compared to the previous solid sputum culture tests whose results would take up to four weeks, Gene-Xpert provides tuberculosis test results within two hours", "url": "https://www.hindustantimes.com/cities/chandigarh-news/pgimer-adopts-gene-xpert-for-rapid-tb-testing-results-within-2-hours-up-to-70-tests-daily-aids-in-selecting-treatment-regimens-and-infection-control-decisions-101680645119058.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/04/1600x900/The-automatic-Gene-Xpert-machine-can-test-16-sampl_1680645112951.jpg", "publishedAt": "2023-04-04T21:51:58Z", "content": "The Post Graduate Institute of Medical Education and Research (PGIMER) has adopted Gene-Xpert test for rapid testing of all types of tuberculosis (TB).\r\nThe automatic Gene-Xpert machine can test 16 s… [+2326 chars]"}, {"source": {"id": null, "name": "Mirchi.in"}, "author": "Mirchi", "title": "How effective is Mediterranean diet for weight loss? - Mirchi Plus", "description": "It’s important to understand that the Mediterranean diet doesn’t give immediate visible results. One needs to be consistent to see its effect on weight. You need to adhere to the necessary changes required in your diet and overall lifestyle to see the desired…", "url": "https://mirchi.in/stories/lifestyle/how-effective-is-mediterranean-diet-for-weight-loss/99249589", "urlToImage": "https://static.mirchi.in/thumb/imgsize-53434,msid-99249589,width-800,height-450,resizemode-1/99249589.jpg", "publishedAt": "2023-04-04T21:16:54Z", "content": "A Mediterranean diet\r\n can lead to weight loss. Several studies have shown that following a Mediterranean diet can help you lose weight without really limiting your calorie intake. If we call the Med… [+2487 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Healthy sleep pattern may help offset asthma risk regardless of genetic susceptibility - News-Medical.Net", "description": "Poor quality sleep may bolster a person's genetic susceptibility to asthma, potentially doubling their risk of being diagnosed with the condition, suggests a large UK Biobank study, published in the open access journal BMJ Open Respiratory Research.", "url": "https://www.news-medical.net/news/20230404/Healthy-sleep-pattern-may-help-offset-asthma-risk-regardless-of-genetic-susceptibility.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2023-04-04T19:51:00Z", "content": "Poor quality sleep may bolster a person's genetic susceptibility to asthma, potentially doubling their risk of being diagnosed with the condition, suggests a large UK Biobank study, published in the … [+5232 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Moderate Drinking Has No Health Benefits, Analysis of Decades of Research Finds - Finnoexpert", "description": "For decades, scientific studies suggested moderate drinking was better for most people’s health than not drinking at all, and could even help them live longer.", "url": "https://finnoexpert.com/2023/04/05/moderate-drinking-has-no-health-benefits-analysis-of-decades-of-research-finds/", "urlToImage": "https://static01.nyt.com/images/2023/04/04/multimedia/04alcohol-wmlg/04alcohol-wmlg-facebookJumbo.jpg", "publishedAt": "2023-04-04T19:40:18Z", "content": "Most of those studies were observational, meaning they could identify links or associations but they could be misleading and did not prove cause and effect. Scientists said that the older studies fai… [+1334 chars]"}, {"source": {"id": null, "name": "Clinicaladvisor.com"}, "author": "Kristin Della Volpe", "title": "Clinicians Weigh In on AAP Childhood Obesity Guideline - Clinical Advisor", "description": "Survey respondents are cautious about the long-term effects of using antiobesity medications and bariatric surgery as recommended in the AAP childhood obesity guideline.", "url": "https://www.clinicaladvisor.com/home/topics/obesity-information-center/clinicians-survey-childhood-obesity-guideline/", "urlToImage": "https://www.clinicaladvisor.com/wp-content/uploads/sites/11/2019/12/stepping-on-scale_G_1162174122.jpg", "publishedAt": "2023-04-04T18:54:00Z", "content": "A majority of nurse practitioners and physician associates (84%) said they did not agree with the inclusion of bariatric surgery and antiobesity medications in the childhood obesity guideline issued … [+2441 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds how ultrasound is effective in diagnosing specific breast symptoms - ANI News", "description": "According to a study, ultrasound works well as a stand-alone diagnostic technique for patients with specific breast symptoms", "url": "https://www.aninews.in/news/science/study-finds-how-ultrasound-is-effective-in-diagnosing-specific-breast-symptoms20230405001213", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230404184154.jpg", "publishedAt": "2023-04-04T18:42:00Z", "content": "Illinois [United States], April 5 (ANI): According to a study, ultrasound works well as a stand-alone diagnostic technique for patients with specific breast symptoms. Focal breast complaints can rela… [+3121 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health expert talks impact of living with chronic cough - KOIN 6", "description": "Pulmonologist Dr. Meilan Han and Bev Stewart – National Senior Director of Lung Diseases at the American Lung Association -- joined Everyday Northwest to tal...", "url": "https://www.youtube.com/watch?v=PiHfgTX0XjI", "urlToImage": "https://i.ytimg.com/vi/PiHfgTX0XjI/maxresdefault.jpg", "publishedAt": "2023-04-04T18:34:20Z", "content": null}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Detecting, predicting, and preventing aortic ruptures with computational modeling - EurekAlert", "description": "According to some estimates, up to 80% of patients who experience a ruptured abdominal aortic aneurysm will die before they reach the hospital or during surgery. But early intervention can prevent rupture and improve outcomes. In Physics of Fluids, researcher…", "url": "https://www.eurekalert.org/news-releases/984588", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/757eac23-3369-4e02-bf9a-be61848d900a/Rendition/thumbnail/Content/Public", "publishedAt": "2023-04-04T17:55:27Z", "content": "image: AAA development and ruptured stage (left) and simulated results (right).view more \r\nCredit: AAA development and ruptured stage (left) and simulated results (right). Credit: Cardiovascular Biom… [+3308 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "American Heart Association (AHA)", "title": "Communication may guide family members’ decisions after sudden cardiac death - Newswise", "description": "Surviving family members of a person who died from sudden cardiac death rely on information from death investigators and health care professionals to process th", "url": "https://www.newswise.com/articles/communication-may-guide-family-members-decisions-after-sudden-cardiac-death", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-04-04T17:25:00Z", "content": "Research Highlights:\r\n<ul><li>Surviving family members of a person who died from sudden cardiac death rely on information from death investigators and health care professionals to process their relat… [+8573 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Innovative approach to customize treatments for colorectal cancer - News-Medical.Net", "description": "How to determine the most effective treatment for colon cancer? The response to chemotherapy varies greatly from one patient to another.", "url": "https://www.news-medical.net/news/20230404/Innovative-approach-to-customize-treatments-for-colorectal-cancer.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-04-04T16:31:00Z", "content": "How to determine the most effective treatment for colon cancer? The response to chemotherapy varies greatly from one patient to another. A team from the UNIGE has developed a new method for testing d… [+4283 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "New genetic loci associated with gestational duration show a complex link with birth weight - Nature.com", "description": "A GWAS meta-analysis, combined with tracing the parental transmitted and non-transmitted alleles in parent–offspring pairs, enabled us to distinguish the effects of maternal and fetal genomes on gestational duration and their links with birth weight. The iden…", "url": "https://www.nature.com/articles/s41588-023-01344-8", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41588-023-01344-8/MediaObjects/41588_2023_1344_Fig1_HTML.png", "publishedAt": "2023-04-04T15:27:10Z", "content": "<li>Chawanpaiboon, S. et al. Global, regional, and national estimates of levels of preterm birth in 2014: a systematic review and modelling analysis. Lancet Glob. Health7, e37e46 (2019). Estimates of… [+1499 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals how microbes in guts suggest new approach to treat inflammatory bowel diseases - ANI News", "description": "Inflammatory bowel illnesses like Crohn's disease and ulcerative colitis may soon be treated with a two-drug combination, according to recent discoveries about how our systems interact with the bacteria that live in our guts.", "url": "https://www.aninews.in/news/science/study-reveals-how-microbes-in-guts-suggest-new-approach-to-treat-inflammatory-bowel-diseases20230404204840", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230404114313.jpg", "publishedAt": "2023-04-04T15:18:00Z", "content": "Cincinnati [United States], April 4 (ANI): Inflammatory bowel diseases like Crohn's disease and ulcerative colitis may soon be treated with a two-drug combination, according to recent discoveries abo… [+2051 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Parkinson's Disease: Signs, non-motor manifestations one should watch out for - Hindustan Times", "description": "Before onset of Parkinson’s disease, certain signs can indicate one may suffer from this disease in later life. Watch out for these non-motor manifestations | Health", "url": "https://www.hindustantimes.com/lifestyle/health/parkinsons-disease-signs-non-motor-manifestations-one-should-watch-out-for-101680619707720.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/04/1600x900/parkinsons-g558796eac_1920_1680619872965_1680619893257_1680619893257.jpg", "publishedAt": "2023-04-04T15:12:43Z", "content": "Parkinsons disease (PD) is debilitating for the patient and it is the need of the hour for the patient to pay enough attention to his/her health and spot non-motor manifestations which are in some ca… [+2868 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": null, "title": "Discovery of first steps in drug resistance process reveals new targets for antibiotics - The Science Board", "description": "ScienceBoard.net is a community of international scientific professionals working in the life science and medical industries. We provide opportunities for news, research, and collaboration to scientists, laboratory and medical professionals, academic trainees…", "url": "https://www.scienceboard.net/index.aspx?sec=sup&amp;sub=cell&amp;pag=dis&amp;ItemID=5349", "urlToImage": null, "publishedAt": "2023-04-04T15:00:23Z", "content": "Bioprocessing\r\n Follow the newest trends in bioprocessing, including updates on consumables, upstream processes, and downstream techniques.Learn more \r\nCancer &amp; Disease Research\r\n This research i… [+1574 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": "https://www.mindbodygreen.com/wc/devon-barrow", "title": "U.S. Soy Is A Sustainable Solution For Our Health *And* The Planet's—The Full Story - mindbodygreen", "description": "After learning about the transparency, consistent improvement, and reliability behind U.S.- grown soy, our appreciation for this versatile ingredient continues to grow.", "url": "https://www.mindbodygreen.com/articles/us-soy-is-sustainable-solution-for-our-health-and-planets-full-story", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_2000,h_1200,g_auto,fl_lossy,f_jpg/org/rj0cbqnh7lfwolo74.jpeg", "publishedAt": "2023-04-04T14:47:05Z", "content": "Just like biodegradable plastics and water conservation, U.S. Soy is a major player in the sustainability movement. This starts with U.S. soybean farmers, who are committed to sustainable farming and… [+1048 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Determinants of effective treatment coverage for posttraumatic stress disorder: findings from the World Mental Health Surveys - BMC Psychiatry - BMC Psychiatry", "description": "Background Posttraumatic stress disorder (PTSD) is associated with significant morbidity, but efficacious pharmacotherapy and psychotherapy are available. Data from the World Mental Health Surveys were used to investigate extent and predictors of treatment co…", "url": "https://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-023-04605-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12888.jpg", "publishedAt": "2023-04-04T12:47:04Z", "content": null}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Manasvi Jain", "title": "Move more, sit less: 8 Tips from Rujuta Diwekar to boost your health and energy! - Health shots", "description": "Try these some simple and fun tips that can help you sit less and move more in your daily routine, without sacrificing your downtime. These tips will make it easy for you to stay active and energised throughout the day.", "url": "https://www.healthshots.com/fitness/staying-fit/8-tips-to-sit-less-move-more-and-have-an-active-lifestyle/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/04/04174308/move-more-sit-less.jpg", "publishedAt": "2023-04-04T12:30:42Z", "content": "Are you tired of feeling like a couch potato all day long? Do you want to add some more movement to your daily routine but don’t know where to start? Look no further! We’ve got some easy and fun tips… [+3603 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Periodic Booster Shots Targeted At New Strains May Help Limit COVID Spread - The Weather Channel", "description": "The study showed that it's possible to design a variant-specific booster that doesn't just strengthen the antibodies people already have but elicits new antibodies.", "url": "https://weather.com/en-IN/india/coronavirus/news/2023-04-04-periodic-booster-shots-targeted-at-new-strains-may-limit-covid", "urlToImage": "https://s.w-x.co/in-vaccine%20nurse.jpg", "publishedAt": "2023-04-04T12:24:46Z", "content": "Updated COVID booster shots will be important for shoring up population immunity as new variants emerge, suggests a study.\r\nHowever, the trick is to target a variant for the booster that is so differ… [+3053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Himalayan garlic: Reasons ‘ek potli lahsun’ deserves to be on your plate - The Indian Express", "description": "\"A single clove of this garlic helps in relaxing muscles and hence reducing blood pressure,\" said Sohini Banerjee, consultant dietician, ILS Hospitals, Howrah (Kolkata)", "url": "https://indianexpress.com/article/lifestyle/health/himalayan-garlic-snow-mountain-health-benefits-8518470/", "urlToImage": "https://images.indianexpress.com/2023/03/snow-garlic_200_kashmirica_insta.jpg", "publishedAt": "2023-04-04T12:00:44Z", "content": "Seasonal food comes packed with various nutritious properties, which is why experts also recommend consuming them on the regular. Among such foods is the Himalayan garlic, also called Kashmiri garlic… [+3018 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "New Chip-Based RT-PCR Test Can Diagnose H3N2/H1N1 In Just An Hour | TheHealthSite.com - TheHealthSite", "description": "Diagnosis of H3N2/H1N1 becomes easier faster and more effective with a new chip-based RT-PCR test developed by Molbio Diagnostics. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/new-chip-based-rt-pcr-test-can-diagnose-h3n2-h1n1-in-just-an-hour-967383/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/04/Untitled-5.jpg", "publishedAt": "2023-04-04T11:55:00Z", "content": "Truenat H3N2/H1N1 test can provide sample-to-result in an hours time.\r\nDiagnosis of H3N2/H1N1 becomes easier, faster and more effective with a new chip-based RT-PCR test developed by Molbio Diagnosti… [+2219 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "mRNA vaccine beats infection for key defense against COVID-19, Stanford Medicine scientists find | Indiablooms - First Portal on Digital News Management - indiablooms", "description": "The Pfizer/BioNTech mRNA vaccine directed at COVID-19 is much better than natural infection at revving up key immune cells called killer T cells to fight future infection by SARS-CoV-2, the virus that causes COVID-19, Stanford Medicine investigators have foun…", "url": "https://www.indiablooms.com/health-details/H/12549/mrna-vaccine-beats-infection-for-key-defense-against-covid-19-stanford-medicine-scientists-find.html", "urlToImage": "https://www.indiablooms.com/health_pic/2023/7a0d414dc3bc5289e2121b9026af15d1.jpg", "publishedAt": "2023-04-04T11:51:22Z", "content": "The Pfizer/BioNTech mRNA vaccine directed at COVID-19 is much better than natural infection at revving up key immune cells called killer T cells to fight future infection by SARS-CoV-2, the virus tha… [+7133 chars]"}, {"source": {"id": null, "name": "Cityspidey.com"}, "author": null, "title": "Discovering the Benefits of Vitamin C for Optimal Health - CitySpidey.com", "description": "Vitamin C can boost bone, skin and joint health", "url": "https://www.cityspidey.com/news/20789/discovering-the-benefits-of-vitamin-c-for-optimal-health", "urlToImage": "https://cityspideynews.s3.amazonaws.com/uploads/spidey/202304/cover-(42)-1680595292.jpg", "publishedAt": "2023-04-04T11:32:32Z", "content": "Vitamin C is an essential nutrient for the human body, but our bodies do not produce it. Many studies have shown the importance of vitamin C for our immune system, but it can also boost bone, skin, a… [+2150 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kidney: Proteinuria Is A Condition Where Protein Is Found In The Urine; Here's Why & How To Prevent It - NDTV", "description": "Read on as we discuss what is Proteinuria, what may cause it, its symptoms and how can you prevent and treat it.", "url": "https://www.ndtv.com/health/kidney-proteinuria-is-a-condition-where-protein-is-found-in-the-urine-heres-why-how-to-prevent-it-3919632", "urlToImage": "https://c.ndtvimg.com/2018-09/707knqgg_kidney-diseases-in-childhood_625x300_11_September_18.jpg", "publishedAt": "2023-04-04T11:23:12Z", "content": "Proteinuria is a condition caused by the presence of excess protein in the urine\r\nProteinuria is a condition characterised by the presence of excess protein, mainly albumin, in the urine. Generally, … [+4409 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "How H3N2 virus could be fatal for diabetes - India Today", "description": "H3N2 complications can be more severe for a person with diabetes. Here's what precautions you should take.", "url": "https://www.indiatoday.in/health/story/how-h3n2-virus-could-be-fatal-for-diabetes-2355622-2023-04-04", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/h3n2_diabetes-sixteen_nine.png?VersionId=WPADtzt3OyhLvDRngfzHZgGgfVT6Cfee", "publishedAt": "2023-04-04T11:00:36Z", "content": "By Daphne Clarance: India has been witnessing rampant viral infections, especially the H3N2 strain. The common symptoms of viral infection include cold, diarrhoea, runny nose, sore throat and, in man… [+2129 chars]"}, {"source": {"id": null, "name": "Ibgnews.com"}, "author": "Suman Munshi", "title": "WORLD BIPOLAR DAY – how to treat and prevent Bipolar Disorder? - IBG NEWS", "description": "WORLD BIPOLAR DAY – how to treat and prevent Bipolar Disorder? Dr. DEBANJAN BANERJEEConsultant Neuropsychiatrist, APOLLO Multispecialty Hospitals (AMHL), Kolkata Remember Dr. Jekyll and Mr. Hyde?The antagonistic representations of the nature of the same perso…", "url": "https://ibgnews.com/2023/04/04/world-bipolar-day-how-to-treat-and-prevent-bipolar-disorder/", "urlToImage": "https://ibgnews.com/wp-content/uploads/2023/04/Bipolar-Disorder.png", "publishedAt": "2023-04-04T10:36:10Z", "content": "Read Time:4 Minute, 22 Second \r\nWORLD BIPOLAR DAY how to treat and prevent Bipolar Disorder?\r\nDr. DEBANJAN BANERJEEConsultant Neuropsychiatrist, APOLLO Multispecialty Hospitals (AMHL), Kolkata\r\nRemem… [+5513 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Scientists find a peptide that can replicate benefits of bariatric surgery, Ozempic - Mint Lounge", "description": "Though human trials are pending, researchers from the American Chemical Society say a class of peptides has shown promising results in controlling obesity without major side-effects", "url": "https://lifestyle.livemint.com/health/wellness/scientists-find-a-peptide-that-can-replicate-benefits-of-bariatric-surgery-ozempic-111680598148024.html", "urlToImage": "https://images.livemint.com/img/2023/04/04/1140x641/bariatric_surgery_1680598707406_1680598718261_1680598718261.jpg", "publishedAt": "2023-04-04T10:34:42Z", "content": "Imagine getting the benefits of gastric bypass surgery without having to go under the knife -- a new class of compounds may be able to do just that. These potential treatments significantly reduce bo… [+5269 chars]"}, {"source": {"id": null, "name": "Techbullion.com"}, "author": "Ali Bajwa, Angela Scott-Briggs, TechBullion", "title": "Debunk Top Myths Related to Diabetes - TechBullion", "description": "Are you diagnosed with diabetes? Is it confusing? Are you feeling overwhelmed? Do not panic. As you are not alone, there are millions of people who are affected by diabetes all over the world. It is obvious that managing diabetes is not easy, but it is someth…", "url": "https://techbullion.com/debunk-top-myths-related-to-diabetes/", "urlToImage": "https://techbullion.com/wp-content/uploads/2023/04/th-2023-04-04T032559.245.jpg", "publishedAt": "2023-04-04T10:28:05Z", "content": "Are you diagnosed with diabetes? Is it confusing? Are you feeling overwhelmed? Do not panic. As you are not alone, there are millions of people who are affected by diabetes all over the world. It is … [+3128 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Making vaccine shots stress-free - Ahmedabad Mirror", "description": "Making vaccine shots stress-free", "url": "https://www.ahmedabadmirror.com/making-vaccine-shots-stress-free/81853917.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1680546361874.jpg-org", "publishedAt": "2023-04-04T10:22:06Z", "content": "Vaccinations are necessary for all age groups, but newborns and small children require them the most. Their small and delicate bodies leave them susceptible to a variety of infections including rotav… [+2080 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Health Desk", "title": "Cataracts: Ways in which you can reduce risk of this common eye condition - India TV News", "description": "Cataracts are a common eye condition that can lead to vision loss and blindness. However, there are some preventative measures that can help safeguard your eye health and preserve your vision for years to come.", "url": "https://www.indiatvnews.com/health/cataracts-ways-in-which-you-can-reduce-risk-of-this-common-eye-condition-2023-04-04-860305", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/04/cataract-1680596204.jpg", "publishedAt": "2023-04-04T10:14:23Z", "content": "Cataracts are a common eye condition that can lead to vision loss and even blindness. They occur when the natural lens in the eye becomes cloudy, making it difficult to see. It causes blurry vision, … [+1883 chars]"}, {"source": {"id": null, "name": "Florida Today"}, "author": "Susie Bond, Florida Today", "title": "Iron deficiency anemia can lead to a list of problems. Here's what to know - Florida Today", "description": "Iron deficiency anemia is a condition where a lack of iron in the body leads to a reduction in the number of red blood cells.", "url": "https://www.floridatoday.com/story/life/wellness/2023/04/04/iron-deficiency-anemia-can-lead-to-a-list-of-problems-heres-what-to-know/70056807007/", "urlToImage": "https://www.gannett-cdn.com/-mm-/d8d0774057d19139d16e6ede624d76e89947662d/c=1-0-1365-767/local/-/media/2021/04/08/USATODAY/usatsports/imageforentry15-e5o.jpg?auto=webp&format=pjpg&width=1200", "publishedAt": "2023-04-04T09:12:20Z", "content": "Feeling tired? Experiencing headaches, dizziness or lightheadedness? Brittle nails?\r\nYou might have iron deficiency anemia.\r\nTrue nutrient deficiencies are rather unusual in this day and time, when m… [+3890 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Uddipta Banerjee", "title": "Why do you crave fried or sweet foods after a hangover? - The Indian Express", "description": "Why do you crave fried or sweet foods after a hangover?", "url": "https://indianexpress.com/web-stories/wellness/why-do-you-crave-fried-or-sweet-foods-after-a-hangover/", "urlToImage": "https://images.indianexpress.com/2023/03/Untitled-design-2023-03-31T153917.781.jpg", "publishedAt": "2023-04-04T08:15:32Z", "content": "Why do you crave fried or sweet foods after a hangover?\r\nAt parties, sometimes, you may end up having one too many only to wake up dehydrated, groggy, nauseous, and with a severe headache the morning… [+862 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "US CDS warns of Marburg virus outbreak: Facts on transmission, symptoms, severity - Indiatimes.com", "description": "​The US Centers for Disease Control and Prevention (CDC) has urged all travellers going to Guinea and Tanzania to avoid catching the fatal virus by taking necessary precautions. The US CDC has decided to send The National Center for Emerging and Zoonotic Infe…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/us-cds-warns-of-marburg-virus-outbreak-facts-on-transmission-symptoms-severity/photostory/99235887.cms", "urlToImage": "https://static.toiimg.com/photo/99235982.cms", "publishedAt": "2023-04-04T08:13:56Z", "content": "It takes 2 to 21 days from the infection to the onset of symptoms.\r\nThe early signs are high fever, severe headache, severe malaise, muscle aches and pains. \r\nOn the third day of the infection, the p… [+366 chars]"}, {"source": {"id": null, "name": "Ptinews.com"}, "author": "", "title": "Strong link found between lithium in drinking water and risk of autism diagnosis - Press Trust of India", "description": "Read more about HEADLINE at PTI. Find out more Breaking News and Latest News Headlines from India and around the world HEADLINE word to be replaced by the headline", "url": "https://www.ptinews.com//news/health-and-lifestyle/strong-link-found-between-lithium-in-drinking-water-and-risk-of-autism-diagnosis/544075.html", "urlToImage": "", "publishedAt": "2023-04-04T08:01:48Z", "content": "New Delhi, Apr 4 (PTI) Higher levels of lithium in household tap water used for drinking by pregnant mothers could affect an important molecular pathway involved in neurodevelopment and autism, incre… [+539 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals how microbiome might affect pancreatic cancer outcomes - ETHealthWorld", "description": "The microbiome is a term used for the collection of microbes, including microorganisms like bacteria, that live on or in the human body.", "url": "https://health.economictimes.indiatimes.com/news/industry/study-reveals-how-microbiome-might-affect-pancreatic-cancer-outcomes/99233953", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99233953,imgsize-15132,width-1200,height=765,overlay-ethealth/industry/study-reveals-how-microbiome-might-affect-pancreatic-cancer-outcomes.jpg", "publishedAt": "2023-04-04T07:45:00Z", "content": "Washington: Despite advances in pancreatic cancer treatment, only around 9 per cent of patients live beyond five years. Researchers have failed to identify genetic distinctions that explain why some … [+2691 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Health Desk", "title": "Kolkata man becomes first person in world to catch fungal infection from a plant; Know more - India TV News", "description": "The 61-year-old from Kolkata has become the first man in the world to have been infected by fungus from a plant.", "url": "https://www.indiatvnews.com/health/kolkata-man-becomes-first-person-in-world-to-catch-fungal-infection-from-a-plant-know-more-2023-04-04-860281", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/04/whatsapp-image-2023-04-04-at-12-1680592329.jpeg", "publishedAt": "2023-04-04T07:28:01Z", "content": "A mycologist specializing in plants from Kolkata has made medical history as the first person to be diagnosed with a plant fungal disease. The 61-year-old individual was found to be infected with Cho… [+2242 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saumya Rastogi", "title": "'It felt like the only thing I could control': People share their struggles with compulsive cleaning - The Indian Express", "description": "\"Often associated with a person's intense fear of being contaminated by germs and disease-causing bacteria and viruses, compulsive cleaning is marked by an excessive urge to clean or engage in cleaning rituals,\" said Rohini Rajeev, senior psychotherapist", "url": "https://indianexpress.com/article/lifestyle/health/compulsive-cleaning-causes-symptoms-covid-19-treatment-8532386/", "urlToImage": "https://images.indianexpress.com/2023/04/compulsive-cleaning.jpg", "publishedAt": "2023-04-04T07:00:46Z", "content": "In college, Divya Rehani, a 28-year-old entreprenuer, had a constant urge to clean her surroundings. Even a speck of dust or dirt made her feel uneasy. Talking about the time, she said that she was g… [+7101 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Diabetes Symptoms Are Related To How Well You Sleep; Steps On How To Improve Your Slumber To Manage Blood Suga - Times Now", "description": "Diabetics have regular issues maintaining blood sugar levels and can suffer from irregularities like sleep apnea, insomnia, and restless leg syndrome. Doctors say if proper treatment is not given, it may become difficult to conduct any daily activities. Read …", "url": "https://www.timesnownews.com/health/diabetes-symptoms-are-related-to-how-well-you-sleep-steps-on-how-to-improve-your-slumber-to-manage-blood-sugar-article-99233563", "urlToImage": "https://static.tnn.in/thumb/msid-99233563,updatedat-1680591478260,width-1280,height-720,resizemode-75/99233563.jpg", "publishedAt": "2023-04-04T06:57:58Z", "content": "Highlights RCB Vs MI, IPL 2023: Virat Kohli, Faf du Plessis demolish MI to seal 8-wicket win for RCB"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "Brain Function Changes During Dieting: Study - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-In the long term, these findings could help develop drugs to prevent this amplification and help to maintain reduced body weight after dieting", "url": "https://bwhealthcareworld.businessworld.in/article/Brain-Function-Changes-During-Dieting-Study/04-04-2023-471594", "urlToImage": "http://static.businessworld.in/article/article_large_image/1635486369_fHhQY3_Screenshot_20211029_105910_Google.jpg", "publishedAt": "2023-04-04T06:57:11Z", "content": "In the long term, these findings could help develop drugs to prevent this amplification and help to maintain reduced body weight after dietingResearchers from the Max Planck Institute for Metabolism … [+2179 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals certain substances in urine, blood may predict kidney disease progression - ETHealthWorld", "description": "The kidneys are a pair of bean-shaped organs that help clean your blood and remove waste from the body. AKI occurs when your kidneys stop working properly, which can cause waste to build up in your blood, making it hard for the body to balance fluids.", "url": "https://health.economictimes.indiatimes.com/news/industry/study-reveals-certain-substances-in-urine-blood-may-predict-kidney-disease-progression/99231437", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-99231437,imgsize-5458,width-1200,height=765,overlay-ethealth/industry/study-reveals-certain-substances-in-urine-blood-may-predict-kidney-disease-progression.jpg", "publishedAt": "2023-04-04T06:05:00Z", "content": "Washington: Researchers at Johns Hopkins Medicine discovered that higher levels of certain biomarkers in urine and blood can predict a patient's risk of developing chronic kidney disease in a new stu… [+3036 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustan Times}", "title": "5 Foods To Enhance Blood Circulation - Hindustan Times", "description": "5 Foods To Enhance Blood Circulation", "url": "https://www.hindustantimes.com/web-stories/lifestyle/5-foods-to-enhance-blood-circulation-101680580431741.html", "urlToImage": null, "publishedAt": "2023-04-04T06:03:07Z", "content": "By Mehak PalPublished Apr 04, 2023\r\nHindustan TimesLifestyle"}, {"source": {"id": null, "name": "Eletsonline.com"}, "author": null, "title": "Over 500 Oncologists from across the country come together for ONCO-CON 2023 | eHealth Magazine eHealth Magazine - Elets", "description": "In an initiative to bring together leading oncologists from across the country in the fight against Cancer, Max Institute of Cancer Care.", "url": "https://ehealth.eletsonline.com/2023/04/over-500-oncologists-from-across-the-country-come-together-for-onco-con-2023/", "urlToImage": "https://ehealth.eletsonline.com/wp-content/uploads/2023/04/ONCO-CON-2023-new.jpg", "publishedAt": "2023-04-04T05:20:03Z", "content": "In an initiative to bring together leading oncologists from across the country in the fight against Cancer, Max Institute of Cancer Care, Vaishali organised the biggest Oncology event in the city tod… [+2154 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Tightly twisted core of stem of SARS-CoV-2 spike protein made its variants fit: Study - EastMojo", "description": "Researchers from Pennsylvania State University, US, said that the Omicron variant's stem is as rigid as it can get. This could mean, they said in a study, that newer vaccines may be effective for longer than the ones targeting the original variant", "url": "http://www.eastmojo.com/health/2023/04/04/tightly-twisted-core-of-stem-of-sars-cov-2-spike-protein-made-its-variants-fit-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2023/02/Untitled-design-4-7.png?fit=1920%2C1080&ssl=1", "publishedAt": "2023-04-04T05:10:00Z", "content": "New Delhi: A ‘tighter’ core of the stem of the SARS-CoV-2 spike protein could be the reason for the enhanced fitness of the virus’s mutant strains, according to a new research.\r\nResearchers from Penn… [+3067 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Healthy Lifestyle Tips: 6 Food Items You MUST Replace in Your Kitchen With Healthier Alternative - India.com", "description": "<b>You can practise healthy living by switching to these six more nutritional alternatives in your kitchen - CHECK HERE:</b>", "url": "https://www.india.com/lifestyle/healthy-lifestyle-tips-6-food-items-you-must-replace-in-your-kitchen-with-healthier-alternative-5979246/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/04/Healthy-lifestyle-tips.jpg", "publishedAt": "2023-04-04T04:53:56Z", "content": "You can practise healthy living by switching to these six more nutritional alternatives in your kitchen - CHECK HERE:\r\nHealthy Lifestyle Tips: 6 Food Items You Must Replace in Your Kitchen With Healt… [+2769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vegetarian Diet: 5 Foods Rich In Vitamin B12 For Vegetarians - NDTV Food", "description": "Vitamin B12 deficiency can cause a range of issues including fatigue, lethargy and weakness. Thus, it is ideal to maintain good levels of this essential vitamin in the body.", "url": "https://food.ndtv.com/health/vegetarian-diet-5-foods-rich-in-vitamin-b12-for-vegetarians-3918373", "urlToImage": "https://c.ndtvimg.com/2023-04/ggpkd3og_milk_625x300_04_April_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-04-04T04:30:44Z", "content": "A healthy and balanced diet can go a long way in maintaining a fit body and mind. Every food in our diet has an important role to play, especially the micronutrients including vitamins and minerals. … [+2875 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Minimally processed foods boost dietary quality, while ultra-processed harm it, study finds - News-Medical.Net", "description": "Researchers performed a cohort study among female and male health professionals in the United States between 1986 and 2010.", "url": "https://www.news-medical.net/news/20230404/Minimally-processed-foods-boost-dietary-quality-while-ultra-processed-harm-it-study-finds.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_743941_16805796240893023.jpg", "publishedAt": "2023-04-04T04:11:00Z", "content": "In a recent article published in the Journal of the Academy of Nutrition and Dietetics, researchers performed a cohort study among female and male health professionals in the United States of America… [+4744 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "Sangati Jogwar", "title": "6 foods that increase bloating and acidity - OTV News", "description": "Certain foods like milk and cauliflower though rich in vitamins and nutrients can cause bloating and acidity.", "url": "https://odishatv.in/news/health/6-foods-that-increase-bloating-and-acidity-200749", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/IMAGE_1680509733.webp", "publishedAt": "2023-04-04T02:35:11Z", "content": "Bloating and acidity are common problems that usually trigger when you eat spicy or fried foods. However, many times even simple food items can cause such symptoms and then you end up wondering what … [+2313 chars]"}, {"source": {"id": null, "name": "Hippocraticpost.com"}, "author": "Hippocratic Post", "title": "Getting to the root of hair loss - The Hippocratic Post", "description": "Getting to the root of hair loss: Leading trichologist, Eva Proudman FIT IAT helps patients get to the root of hair loss and explains the", "url": "https://www.hippocraticpost.com/mental-health/getting-to-the-root-of-hair-loss/", "urlToImage": "https://www.hippocraticpost.com/wp-content/uploads/2023/04/Shutterstock_2184689679.jpg", "publishedAt": "2023-04-03T23:47:37Z", "content": "Getting to the root of hair loss: Leading trichologist, Eva Proudman FIT IAT helps patients get to the root of hair loss and explains the role that stress can play in this upsetting condition.\r\nHair … [+5779 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Local non-profit recognizes adolescent and young adult cancer awareness month - News 8 WROC", "description": "The local non-profit 13Thirty is recognizing adolescent and young adult cancer awareness month.", "url": "https://www.youtube.com/watch?v=D_C6W7x-lN8", "urlToImage": "https://i.ytimg.com/vi/D_C6W7x-lN8/maxresdefault.jpg", "publishedAt": "2023-04-03T21:53:35Z", "content": null}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Acid Reflux Despite PPI Use in a Woman Losing Weight - Medscape Reference", "description": "A 63-year-old woman has persistent acid reflux, intermittent epigastric pain, and unintended weight loss, plus a history of infiltrating lobular carcinoma of the breast. What's causing her symptoms?", "url": "https://reference.medscape.com/viewarticle/988413", "urlToImage": "https://img.medscape.com/thumbnail_library/ps_230327_colonoscopy_colon_cancer_800x450.jpg", "publishedAt": "2023-04-03T20:37:17Z", "content": "Editor's Note:The Case Challenge series includes difficult-to-diagnose conditions, some of which are not frequently encountered by most clinicians but are nonetheless important to accurately recogniz… [+2051 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Hannah Docter-Loeb", "title": "What to know about weed and sleep - The Washington Post", "description": "Can marijuana help you sleep better? Here's what the science says about THC, CBD, edibles, frequency, insomnia and what works.", "url": "https://www.washingtonpost.com/wellness/2023/04/03/weed-sleep-marijuana-cbd/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KGKH6UMPWZGZ5GMMSDONF6I3GY.jpg&w=1440", "publishedAt": "2023-04-03T18:18:00Z", "content": "Comment on this story\r\nMany people say they turn to marijuana or CBD products as a way to help them sleep. But whether that edible, swallowed pill or inhaled hit soothes you to sleep may depend large… [+7168 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shreeja Bhattacharya", "title": "How Endometriosis Impacts Sex And Here's What You Can Do - News18", "description": "Menstruation, sexual activity, and bowel movements are frequently painful for women with endometriosis.", "url": "https://www.news18.com/lifestyle/how-endometriosis-impacts-sex-and-heres-what-you-can-do-7457581.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/untitled-design-93-168054467616x9.png", "publishedAt": "2023-04-03T17:58:39Z", "content": "There are a lot of issues women face during intercourse. Some are worried about vaginal dryness, and some experience chronic pain and irritation while having sex. These can sometimes be a symptom of … [+2291 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Coming Soon: Early Warning System To Predict Future Pandemics - odishabytes - OdishaBytes", "description": "London: COVID-19 caught the world by surprise like never before. With the coronavirus and its variants bringing the planet to a standstill for the better part of two years, researchers have been trying to develop a technology that could predict the next globa…", "url": "https://odishabytes.com/coming-soon-early-warning-system-to-predict-future-pandemics/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2023/04/pandemic-prediction.webp", "publishedAt": "2023-04-03T16:38:43Z", "content": "London: COVID-19 caught the world by surprise like never before.\r\nWith the coronavirus and its variants bringing the planet to a standstill for the better part of two years, researchers have been try… [+1987 chars]"}, {"source": {"id": null, "name": "Becker's Hospital Review"}, "author": "Paige Twenter", "title": "Some SARS-CoV-2 variants are resistant to Paxlovid's main ingredient - Becker's Hospital Review", "description": "As Paxlovid is", "url": "https://www.beckershospitalreview.com/infection-control/some-sars-cov-2-variants-are-resistant-to-paxlovids-main-ingredient.html", "urlToImage": "https://www.beckershospitalreview.com/templates/beckers/assets/images/bhr-new-logo.png", "publishedAt": "2023-04-03T14:12:06Z", "content": "As Paxlovid is \"blunting SARS[-CoV-]2 disease pathogenesis,\" there are multiple transmissible coronavirus variants circulating resistant to the antiviral's main ingredient, according to a study publi… [+1441 chars]"}, {"source": {"id": null, "name": "Pharmaceutical Technology"}, "author": "GlobalData Healthcare", "title": "Latest WHO Covid-19 vaccine guidance may decrease future demand - Pharmaceutical Technology", "description": "The World Health Organisation (WHO) has revised its recommendations for the use of Covid-19 vaccines following a meeting of SAGE.", "url": "http://www.pharmaceutical-technology.com/comment/covid-vaccine-demand/", "urlToImage": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/24/2023/04/Shutterstock_1742536169-2.jpg", "publishedAt": "2023-04-03T09:51:15Z", "content": "The World Health Organisation (WHO) has revised its recommendations regarding the use of Covid-19 vaccines following a meeting of the agencys Strategic Advisory Group of Experts on Immunisation (SAGE… [+2674 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Urinary Tract Infection: Can UTI get complicated and need hospitalisation? - Hindustan Times", "description": "Appropriate antibiotics are selected based on the stage of Urinary Tract Infection and the health condition of the patient but can it lead to hospitalisation? | Health", "url": "https://www.hindustantimes.com/lifestyle/health/urinary-tract-infection-can-uti-get-complicated-and-need-hospitalisation-experts-answer-101680505088857.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/03/1600x900/Fsd_oCNWAA0fJqE_1680505305774_1680505337685_1680505337685.jfif", "publishedAt": "2023-04-03T07:14:55Z", "content": "Urinary Tract Infection is usually treated with medical intervention and medication however, did you know that there are some cases where UTI can get complicated and require hospitalisation as well? … [+3468 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Apoorva Patil", "title": "Lasers And Sweeper Spacecraft To Tackle The Space Debris According To NASA Report - Indiatimes.com", "description": "Just like out of a science fiction novel, the latest news from NASA will leave you feeling like living in the future. According to the report, the American Space Agency is planning to use lasers and sweeper spacecrafts to clear out space debris. Our planet ha…", "url": "https://www.indiatimes.com/explainers/technology/lasers-and-sweeper-spacecraft-to-tackle-the-space-debris-according-to-nasa-report-596490.html", "urlToImage": "https://im.indiatimes.in/content/2023/Mar/spacejunk_641953619d671.png", "publishedAt": "2023-04-03T06:10:48Z", "content": "Just like out of a science fiction novel, the latest news from NASA will leave you feeling like living in the future. According to the report, the American Space Agency is planning to use lasers and … [+4362 chars]"}, {"source": {"id": null, "name": "Newspatrolling.com"}, "author": "pankaj@bansal", "title": "66% of Indians tested have elevated levels of homocysteine in blood: Tata 1mg Labs - NewsPatrolling", "description": "High homocysteine level is a risk factor for atherosclerosis and coronary artery disease NEW DELHI / 30th March 2023: India accounts for about 60% of the global heart disease cases despite having less than 20% of the global population, according to public hea…", "url": "https://newspatrolling.com/66-of-indians-tested-have-elevated-levels-of-homocysteine-in-blood-tata-1mg-labs/", "urlToImage": null, "publishedAt": "2023-04-03T06:08:16Z", "content": "High homocysteine level is a risk factor for atherosclerosis and coronary artery disease\r\nNEW DELHI / 30th March 2023: India accounts for about 60% of the global heart disease cases despite having le… [+4196 chars]"}]}