{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Association of frailty with the incidence risk of cardiovascular disease and type 2 diabetes mellitus in long-term cancer survivors: a prospective cohort study - BMC Medicine - BMC Medicine", "description": "Background Comorbidities among cancer survivors remain a serious healthcare burden and require appropriate management. Using two widely used frailty indicators, this study aimed to evaluate whether frailty was associated with the incidence risk of cardiovascu…", "url": "https://bmcmedicine.biomedcentral.com/articles/10.1186/s12916-023-02774-1", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12916.jpg", "publishedAt": "2023-02-24T15:56:10Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Prohormones Guide – Everything You Need to Know About Prohormones - Deccan Herald", "description": "Prohormones: The Complete Guide to Everything You Need To Be Aware of About Prohormones If you've thought of taking anabolic steroids but have been frightened due to the negative side consequences, then you could have heard that prohormones could be the most …", "url": "https://www.deccanherald.com/brandspot/pr-spot/prohormones-guide-everything-you-need-to-know-about-prohormones-1194620.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1194620-1677246937.png", "publishedAt": "2023-02-24T13:55:37Z", "content": "Prohormones: The Complete Guide to Everything You Need To Be Aware of About Prohormones\r\nIf you've thought of taking anabolic steroids but have been frightened due to the negative side consequences, … [+35520 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Altai Balance Reviews Consumer Reports [UPDATED] - The Tribune India", "description": "When your blood sugar level is too high, this condition is known as high blood sugar (HYPERGLYCEMIA). It primarily affects people with diabetes and can be dangerous if left untreated. Blood sugar that is too low can also occur in diabetics.", "url": "https://www.tribuneindia.com/news/impact-feature/altai-balance-reviews-consumer-reports-updated-482744", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/2/2023_2$largeimg_819097847.png", "publishedAt": "2023-02-24T13:04:00Z", "content": "When your blood sugar level is too high, this condition is known as high blood sugar (HYPERGLYCEMIA). It primarily affects people with diabetes and can be dangerous if left untreated. Blood sugar tha… [+10514 chars]"}]}