{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Experiments with nematodes find they need a nap to consolidate odor memories - Phys.org", "description": "A team of biomedical researchers from the University of California, San Francisco, San Jose State University and the University of Pennsylvania has found that nematodes need sleep in order to consolidate their odor memories by remapping olfactory synapses. In…", "url": "https://phys.org/news/2023-06-nematodes-nap-odor-memories.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/experiments-with-nemat.jpg", "publishedAt": "2023-06-06T14:15:19Z", "content": "A team of biomedical researchers from the University of California, San Francisco, San Jose State University and the University of Pennsylvania has found that nematodes need sleep in order to consoli… [+2394 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Kashish Sharma", "title": "Listening To Sad Music? It Might Be Good For Your Mental Health | TheHealthSite.com - TheHealthSite", "description": "Connectedness provided by sad music can sometimes make a person sit with uncomfortable emotions like nostalgia and longing and can help them confront these feelings. TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/listening-to-sad-music-it-can-have-health-benefits-983103/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/sad-music.jpg", "publishedAt": "2023-06-06T13:58:00Z", "content": "While music produces a personal and unique experience for every listener, research has shown that sad music can impact a persons mental health by providing a sense of connectedness.\r\nConnectedness pr… [+2606 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Tim Mcgraw Keto Gummies (Customer Exposed) Scam Alert Melissa McCarthy Keto Gummies? Is It Real Or Fake? Read Herbal Effortless Way for Fats Loss? - mid-day.com", "description": "Dieting is very difficult for any food lover and they will surely accept the fact that it puts a full stop on all your favorite dishes and forces you to go for undoubtedly healthy food that is surely not tasty to have.", "url": "https://www.mid-day.com/brand-media/article/tim-mcgraw-keto-gummies-customer-exposed-scam-alert-melissa-mccarthy-keto-23290809", "urlToImage": "https://images.mid-day.com/images/images/2023/jun/Tim-Gummies-0606_d.jpg", "publishedAt": "2023-06-06T13:19:00Z", "content": "Dieting is very difficult for any food lover and they will surely accept the fact that it puts a full stop on all your favorite dishes and forces you to go for undoubtedly healthy food that is surely… [+9386 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Breastfeeding children for longer period leads to better results in their school: Study - ETHealthWorld", "description": "Research has suggested that children who are breastfed for a longer period of time have better educational outcomes later in life. However, these are scarce, and most have not taken into account potential factors that could influence outcomes, such as the fac…", "url": "https://health.economictimes.indiatimes.com/news/industry/breastfeeding-children-for-longer-period-leads-to-better-results-in-their-school-study/100797955", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100797955,imgsize-15316,width-1200,height=765,overlay-ethealth/industry/breastfeeding-children-for-longer-period-leads-to-better-results-in-their-school-study.jpg", "publishedAt": "2023-06-06T13:00:40Z", "content": "Washington: Researchers found children who have been breastfed for a longer period of time appear to achieve slightly better results in their school GSCEs at the age of 16 when compared to non-breast… [+4346 chars]"}, {"source": {"id": null, "name": "Nutritioninsight.com"}, "author": null, "title": "Mediterranean diet may lower brain age and improve cognitive health, study finds - Nutrition Insight", "description": "06 Jun 2023 --- Following a green Mediterranean diet, which is higher in dietary polyphenols and lower in red and processed meats, could reduce the risk of neurological conditions by lowering weight and brain age. The lifestyle intervention also decreased liv…", "url": "https://www.nutritioninsight.com/news/mediterranean-diet-may-lower-brain-age-and-improve-cognitive-health-study-finds.html", "urlToImage": "https://article.innovamarketinsights360.com/articleimgs/article_images/638216503861840861pexels-maarten-van-den-heuvel-2284166.jpg", "publishedAt": "2023-06-06T12:25:35Z", "content": "06 Jun 2023 --- Following a green Mediterranean diet, which is higher in dietary polyphenols and lower in red and processed meats, could reduce the risk of neurological conditions by lowering weight … [+5155 chars]"}, {"source": {"id": null, "name": "DailyO"}, "author": "Dristi Sharma", "title": "Monday Blues are becoming fatal! Study shows the severest of heart attacks happen on Monday - DailyO", "description": "A recent study presented at the British Cardiovascular Society Conference revealed that the most severe forms of heart attacks are more likely to occur on Mondays compared to other days of the week.", "url": "https://www.dailyo.in/lifestyle/monday-blues-are-becoming-fatal-study-shows-the-severest-of-heart-attacks-happen-on-monday-39967", "urlToImage": "https://akm-img-a-in.tosshub.com/sites/dailyo//resources/202306/moday-heart-attack-photo060623041359.png", "publishedAt": "2023-06-06T11:55:00Z", "content": "Monday Blues exist for a good reason, guys. If there's a single day in the week that we absolutely detest and it gives us those Sunday Scaries, it's undeniably Monday. Now, there is a new study that … [+3459 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Gardening, cycling may help ‘fight off’ genetic risk of Type 2 diabetes - The Siasat Daily", "description": "Sydney: Indulging in moderate-to vigorous-intensity physical activity like gardening, dancing, and cycling could lower the risk of Type-2 diabetes, even in people with a high genetic risk of developing the medical condition, new research has revealed. The stu…", "url": "https://www.siasat.com/gardening-cycling-may-help-fight-off-genetic-risk-of-type-2-diabetes-2608250/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/06/gardening.jpg", "publishedAt": "2023-06-06T11:37:00Z", "content": "Sydney: Indulging in moderate-to vigorous-intensity physical activity like gardening, dancing, and cycling could lower the risk of Type-2 diabetes, even in people with a high genetic risk of developi… [+2221 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Business Standard", "title": "Amyloidosis disease: Understanding the diagnosis, symptoms and treatments - Business Standard", "description": "Amyloidosis Centre in India: Amyloidosis is a rare disease whose cause is still not found. In May this year, India got its first amyloidosis centre at Amrita Hospital in Kerala", "url": "https://www.business-standard.com/health/amyloidosis-disease-understanding-the-diagnosis-symptoms-and-treatments-123060600622_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-05/26/full/1621995881-8625.jpg", "publishedAt": "2023-06-06T11:04:33Z", "content": "Unsubscribe to continue\r\nThis is a subscriber only feature Subscribe Now to get daily updates on WhatsApp"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Tim Smith", "title": "Advanced Brain Aging Observed in Older Type 1 Diabetes Patients Compared to Those Without - MD Magazine", "description": "This research supports the notion that brain morphology may be related to acceleration in the aging process for middle-aged and older-aged adults who have a long history of type 1 diabetes.", "url": "https://www.hcplive.com/view/advanced-brain-aging-observed-older-type-1-diabetes-patients-compared-to-those-without", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/bd2accf57531fd8e6c495d7af41932c7d9fadf0a-300x300.png?fit=crop&auto=format", "publishedAt": "2023-06-06T11:02:48Z", "content": "Advanced brain aging can be observed in those who have type 1 diabetes and no signs of Alzheimers disease or related degeneration, according to recent findings, compared to individuals without type 1… [+4404 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Menopausal vascular fat may protect against dementia later in life: Study - ETHealthWorld", "description": "During the menopause transition, women usually experience vascular or fat tissue inflammation, which may manifest as thoracic PVAT with higher density, meaning it is of lower quality.", "url": "https://health.economictimes.indiatimes.com/news/industry/menopausal-vascular-fat-may-protect-against-dementia-later-in-life-study/100792442", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-100792442,imgsize-14684,width-1200,height=765,overlay-ethealth/industry/menopausal-vascular-fat-may-protect-against-dementia-later-in-life-study.jpg", "publishedAt": "2023-06-06T10:40:00Z", "content": "Pittsburgh: A study added to the evidence that the menopausal transition is a critical time for women and their doctors to focus on heart health, which protects their brain health. Findings of the st… [+3953 chars]"}, {"source": {"id": null, "name": "Clevelandclinic.org"}, "author": "capasa", "title": "Are Migraines Hereditary? - Health Essentials", "description": "After learning your grandparent had migraines, you’re now wondering if there’s a chance you’ll have them, too. In fact, genetics may play a role in the development of migraines — but not always.", "url": "https://health.clevelandclinic.org/are-migraines-hereditary/", "urlToImage": "https://health.clevelandclinic.org/wp-content/uploads/sites/3/2023/06/person-Headache-pain-Couch-1284370009-770x533-1.jpg", "publishedAt": "2023-06-06T10:30:00Z", "content": "After mentioning your migraine to your aunt, they mention that your grandmother used to experience them, too.\r\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps … [+7603 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Close contact between mother and premature baby may boost infant's survival Study - The Week", "description": "A method of care involving skin-to-skin contact between a mother and her prematurely born baby may improve the child's chances of survival significantly, according to a review of studies conducted in India.", "url": "https://www.theweek.in/news/health/2023/06/06/close-contact-between-mother-and-premature-baby-may-boost-infant.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2022/images/2023/2/little-leg-infant-legs-baby-child-shut.jpg", "publishedAt": "2023-06-06T10:26:56Z", "content": "A method of care involving skin-to-skin contact between a mother and her prematurely born baby may improve the child's chances of survival significantly, according to a review of studies conducted in… [+2941 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Trends in the prevalence of individual health risk factors: how has the mortality risk changed over time? - News-Medical.Net", "description": "Researchers explored the prevalence of health risk factors and their correlation with all-cause mortality.", "url": "https://www.news-medical.net/news/20230606/Trends-in-the-prevalence-of-individual-health-risk-factors-how-has-the-mortality-risk-changed-over-time.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_750198_16860470130999627.jpg", "publishedAt": "2023-06-06T10:26:00Z", "content": "In a recent study published in the PLOS ONE Journal, researchers explored the prevalence of health risk factors and their correlation with all-cause mortality.\r\nStudy: Is anyone truly healthy? Trends… [+4769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lung Cancer Pill Significantly Lowers The Risk Of Death After Surgery: Study - NDTV", "description": "Impressive outcomes from a lung cancer drug have been reported in recently published research over the weekend.", "url": "https://www.ndtv.com/feature/lung-cancer-pill-significantly-lowers-the-risk-of-death-after-surgery-study-4098586", "urlToImage": "https://c.ndtvimg.com/2020-12/1pt4hlk_lung-cancer_625x300_02_December_20.jpg", "publishedAt": "2023-06-06T10:10:58Z", "content": "The biggest cause of cancer-related death worldwide is lung cancer.\r\nThe patients of lung cancer, which is the 2nd most common cancer worldwide and one of the leading causes of death, have good news … [+1676 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Longjam Dineshwori", "title": "Shirodhara:Uses And Benefits Of This Ayurvedic Therapy | TheHealthSite.com - TheHealthSite", "description": "Struggling with stress anxiety headaches or sleep problems? Shirodhara can come to your rescue.  Get to know more about this Ayurvedic therapy. TheHealthSite.com", "url": "https://www.thehealthsite.com/ayurveda/shirodhara-uses-and-benefits-of-this-ayurvedic-therapy-983134/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/Shirodhara.jpg", "publishedAt": "2023-06-06T10:00:00Z", "content": "Shirodhara aids in increasing attention by clearing poisons from the brain.\r\nStruggling with stress, anxiety, headaches or sleep problems? Shirodhara can come to your rescue. Get to know more about t… [+5029 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Medi Cramp Review: MediCramp Best Magnesium Supplements For Leg And Muscle - Deccan Herald", "description": "If you often suffer from painful and annoying muscle spasms, you might need more magnesium in your body. Magnesium is a mineral that helps your muscles relax and function properly. But how do you get enough magnesium? You might think that eating healthy foods…", "url": "https://www.deccanherald.com/brandspot/sponsored/medi-cramp-review-medicramp-best-magnesium-supplements-for-leg-and-muscle-1225334.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%20Medi%20cramp-1225334-1686045492.png", "publishedAt": "2023-06-06T09:44:57Z", "content": "If you often suffer from painful and annoying muscle spasms, you might need more magnesium in your body. Magnesium is a mineral that helps your muscles relax and function properly.\r\nBut how do you ge… [+23785 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Zotrim Reviews: Weight Loss Supplement Dosage, Benefits, Ingredients Report Updated - Deccan Herald", "description": "Zotrim Reviews 2023: Best Hunger Control Pills - Is It A Safe Way to Lose Weight? Some people find it hard to lose weight. They need to watch what they eat and exercise more often. One of the biggest problems for losing weight is eating too much snacks and un…", "url": "https://www.deccanherald.com/brandspot/sponsored/zotrim-reviews-weight-loss-supplement-dosage-benefits-ingredients-report-updated-1225328.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%20151-1225328-1686057453.png", "publishedAt": "2023-06-06T09:24:04Z", "content": "Zotrim Reviews 2023: Best Hunger Control Pills - Is It A Safe Way to Lose Weight?\r\nSome people find it hard to lose weight. They need to watch what they eat and exercise more often.\r\nOne of the bigge… [+22300 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Covid variant, severity determines cardiac dysfunction later - The Siasat Daily", "description": "New York: Patients infected with Beta and Delta Covid-19 variants, and those who required hospital stays for the infection, are more likely to experience heart issues associated with long Covid, according to a recent study. The study, published in the Europea…", "url": "https://www.siasat.com/covid-variant-severity-determines-cardiac-dysfunction-later-2608078/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/06/9465Covid-19-Virus.jpg", "publishedAt": "2023-06-06T08:52:00Z", "content": "New York: Patients infected with Beta and Delta Covid-19 variants, and those who required hospital stays for the infection, are more likely to experience heart issues associated with long Covid, acco… [+2271 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "New test seen as lifesaver as it can detect ovarian cancer in early stages - Geo News", "description": "Effective non-surgical testing for early-stage ovarian cancer has been elusive for more than five decades, expert says", "url": "https://www.geo.tv/latest/491502-new-test-seen-as-lifesaver-as-it-can-detect-ovarian-cancer-in-early-stages", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2023-06-06/l_491502_014907_updates.jpg", "publishedAt": "2023-06-06T08:35:30Z", "content": "After exhaustive research, scientists have succeeded in developing a test that can help oncologists diagnose deadly ovarian cancers earlier as well as faster than the current diagnostic methods. \r\nTh… [+2258 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Sudha Sundaram", "title": "How to optimize early oncology discovery within precision therapies - Labiotech.eu", "description": "Learn how nRavel, a pre-clinical AI-based discovery and development tool can help unravel cancer complexity.", "url": "https://www.labiotech.eu/partner/precision-medicine-nravel-early-oncology-discovery/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2023/06/Screenshot-2023-06-01-at-10.12.1635-1.png", "publishedAt": "2023-06-06T08:02:58Z", "content": "Precision medicine involves tailoring a therapeutic to a patients disease. Here, we delve into the critical role played by the quality of the samples, the data, and the analysis in the development of… [+8311 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Jigyasa Sahay", "title": "5 Wholegrains to Boost Heart Health - India.com", "description": "Healthy hearts requires healthy dietary practices and whole grains make up for a super healthy ingredient to add in everyday meal.", "url": "https://www.india.com/webstories/health/5-wholegrains-to-boost-heart-health-6093539/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/06/grains-1.jpeg", "publishedAt": "2023-06-06T07:52:34Z", "content": "Whole grains are one of the best foods to add for a heart healthy diet\r\nOats: Rich in dietary fibers, it has properties to reduce cholesterol.\r\nAmaranth: Contains tocotrienols and squalene compounds,… [+629 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Is binge watching OTT content impacting your teen’s mental health? - Mint Lounge", "description": "It is time to have a gentle discussion with your kids if they are addicted to OTT platforms, and are showing signs of body dissatisfaction, academic loss and low self-esteem", "url": "https://lifestyle.livemint.com/relationships/raising-parents/binge-watching-ott-content-teen-mental-health-111686028650592.html", "urlToImage": "https://images.livemint.com/img/2023/06/06/1140x641/erik-mclean-U-Vu_r6qyyU-unsplash_1686028702911_1686028725913.jpg", "publishedAt": "2023-06-06T07:38:24Z", "content": "Todays generation, whether its children or young adults, is obsessed with gadgets. The teenagers, especially, are hooked onto OTT platforms, often leading to a serious addiction. Around four to five … [+2589 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Snigdha Behera", "title": "Heart Disease: Know all the risk factors to prevent a heart attack - India TV News", "description": "Some heart disease risk factors and symptoms in women can differ from those in men. Here are the risk factors and symptoms of heart disease in women that you should know", "url": "https://www.indiatvnews.com/health/heart-disease-know-all-the-risk-factors-to-prevent-a-heart-attack-2023-06-06-874511", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/06/healthhh-1686034014.jpg", "publishedAt": "2023-06-06T07:02:56Z", "content": "Coronary heart disease is the most common cause of heart attack, which can be life-threatening. Fortunately or unfortunately, the biggest risk factors of heart disease are in your control. Knowing ab… [+2417 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Blisters To Skin Tags; 5 Warning Signs Of Diabetes On Your Skin That You Should Not Ignore - Jagran English", "description": "Diabetes The total number of people living with diabetes is projected to rise to 643 million by 2030 and 783 million by 2045 Scroll down to know more", "url": "https://english.jagran.com/lifestyle/blisters-to-skin-tags-warning-signs-of-diabetes-on-your-skin-that-you-should-not-ignore-10081343", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/diabetes-on-skin1686035197975.jpg", "publishedAt": "2023-06-06T07:02:00Z", "content": "Diabetes is one of the most hazardous diseases affecting millions of people across the world. This disease is a major cause of blindness, heart attacks, strokes, stroke and lower limb amputation. The… [+2337 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "How to take care of fitness in your 40s, what are the health risks involved - Hindustan Times", "description": "Want to adopt healthy habits to increase your chances of enjoying a vibrant and active life as you age? Here's how to take care of your fitness in your 40s | Health", "url": "https://www.hindustantimes.com/lifestyle/health/tips-on-how-to-take-care-of-fitness-in-your-40s-what-are-the-health-risks-involved-101686027768270.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/06/1600x900/jon-tyson--L13YfTlIY4-unsplash_1686028858166_1686028896347.jpg", "publishedAt": "2023-06-06T06:00:15Z", "content": "Taking care of your health becomes increasingly important as you enter your 40s as this is a pivotal decade where preventive measures and lifestyle choices can greatly impact your overall well-being.… [+5555 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Study finds memory killer cells may improve survival chances of melanoma patients - News9 LIVE", "description": "Certain T cells of the immune system, called tissue-resident memory cells, form locally in the skin and other tissues and protect against infections  they have previously encountered", "url": "https://www.news9live.com/health/study-finds-memory-killer-cells-may-improve-survival-chances-of-melanoma-patients-2167432", "urlToImage": "https://images.news9live.com/wp-content/uploads/2023/04/skin-pixabay.jpg", "publishedAt": "2023-06-06T05:58:39Z", "content": "Certain T cells of the immune system, called tissue-resident memory cells, form locally in the skin and other tissues and protect against infections they have previously encountered\r\nOur skin has lon… [+2246 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Priyanka Munshi", "title": "Garlic To Cinnamon; 4 Herbal Remedies To Maintain Healthy Blood Pressure Levels - Jagran English", "description": "Herbal treatments for example have been used for centuries to boost cardiovascular health by lowering blood pressure enhancing blood circulation and improving overall cardiovascular health", "url": "https://english.jagran.com/lifestyle/garlic-to-cinnamon-4-herbal-remedies-to-maintain-healthy-blood-pressure-levels-10081327", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/hypertnsion1686029756529.jpg", "publishedAt": "2023-06-06T05:33:00Z", "content": "Hypertension is a frequent medical disorder that can have catastrophic consequences. Herbal treatments, for example, have been used for centuries to boost cardiovascular health by lowering blood pres… [+2125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Experts weigh in on Iranian man’s claims to have survived on cold drinks for the last 17 years - The Indian Express", "description": "Dr Santosh Pandey, naturopath and acupuncturist, Rejua Energy Centre, Mumbai concurred and said that carbonated soft drinks contains mostly caffeine and are sweetened with sugar or high-fructose corn syrup", "url": "https://indianexpress.com/article/lifestyle/health/iranian-man-claims-cold-drinks-17-years-does-not-eat-food-experts-8645983/", "urlToImage": "https://images.indianexpress.com/2023/06/cola_1200_wikimedia-commons.jpg", "publishedAt": "2023-06-06T05:20:49Z", "content": "For the last 17 years, an Iranian man, reportedly, has been surviving on just cold drinks, according to TheMirror, which quoted local Iranian media. Gholamreza Ardeshiri has claimed that he does not … [+3603 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Nikita Toppo", "title": "PCOS Diet: 5 Easy Breakfast Recipes To Stay Healthy - Slurrp", "description": "PCOS is a common problem among women of reproductive age that causes irregular menstrual periods, the growth of facial hair, weight gain, and even infertility. But by making a few changes in the diet, it can be prevented or reversed. If you are also suffering…", "url": "https://www.slurrp.com/article/pcos-diet-5-easy-breakfast-recipes-to-stay-healthy-1686026420071", "urlToImage": "https://images.slurrp.com/prodarticles/nmk9l0fpbyn.webp", "publishedAt": "2023-06-06T05:07:04Z", "content": "PCOS is a common problem among women of reproductive age that causes irregular menstrual periods, the growth of facial hair, weight gain, and even infertility. But by making a few changes in the diet… [+2978 chars]"}, {"source": {"id": null, "name": "Diabetes.co.uk"}, "author": null, "title": "Dark chocolate linked to good brain health - Diabetes.co.uk", "description": "Regularly eating dark chocolate is associated with better brain health, new research has demonstrated. A study by the universities of Harvard and Columbia has found that certain compounds in dark chocolate can improve cognition. Otherwise known as flavanols, …", "url": "https://www.diabetes.co.uk/news/2023/jun/dark-chocolate-linked-to-good-brain-health.html", "urlToImage": "https://www.diabetes.co.uk/wp-content/uploads/2023/06/chocolatefromastranger-1000x600.jpg", "publishedAt": "2023-06-06T05:03:45Z", "content": "Regularly eating dark chocolate is associated with better brain health, new research has demonstrated.\r\nA study by the universities of Harvard and Columbia has found that certain compounds in dark ch… [+2089 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Experts investigate the potential impacts of a midwifery education app - News-Medical.Net", "description": "An international research team from Tanzania and Japan created a smartphone app and conducted a pilot study of how the app might be used to improve midwives' knowledge and skills in Tanzania. Their study focused on the app's potential effects on the learning …", "url": "https://www.news-medical.net/news/20230606/Experts-investigate-the-potential-impacts-of-a-midwifery-education-app.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Maternal_Health-620x480.jpg", "publishedAt": "2023-06-06T04:47:00Z", "content": "An international research team from Tanzania and Japan created a smartphone app and conducted a pilot study of how the app might be used to improve midwives' knowledge and skills in Tanzania. Their s… [+4208 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Tavishi Dogra", "title": "Smog To Suffering: Link Between Pollution And Respiratory Diseases | TheHealthSite.com - TheHealthSite", "description": "Air pollutants are linked to respiratory health issues: What sources are responsible for their release into the atmosphere? TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/smog-to-suffering-link-between-pollution-and-respiratory-diseases-983042/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2022/12/Cold-Weather-Can-Be-Dreadful-For-People-With-Lung-Conditions.jpg", "publishedAt": "2023-06-06T04:41:00Z", "content": "Air pollutants are linked to respiratory health issues: What sources are responsible for their release into the atmosphere?\r\nThe combustion of fossil fuels or industrial operations releases the colou… [+3336 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Adults with regular, healthy sleep schedule have lower risk of death: Study - Hindustan Times", "description": "The study emphasises on the need of maintaining a consistent sleep schedule to lower the risk of death. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/adults-with-regular-healthy-sleep-schedule-have-lower-risk-of-death-study-101686023852142.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/06/1600x900/sleep_getty_images-iStockphoto_1641046481543_1686024176022.jpg", "publishedAt": "2023-06-06T04:06:44Z", "content": "A new study, which will be presented at the SLEEP 2023 annual meeting, emphasises that individuals should keep a consistent sleep schedule with a regular bedtime and wake time, in addition to receivi… [+2091 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Premature aging linked to disadvantaged neighbourhoods and depression symptoms - Medical Dialogues", "description": "Feeling depressed and living in a deprived urban neighbourhood could be making you age faster, according to a new study led by researchers at McMaster University. The findings, showed that living...", "url": "https://medicaldialogues.in/mdtv/psychiatry/videos/premature-aging-linked-to-disadvantaged-neighbourhoods-and-depression-symptoms-112511", "urlToImage": "https://medicaldialogues.in/h-upload/2023/06/06/211307-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px-2023-06-06t140404170.jpg", "publishedAt": "2023-06-06T04:00:24Z", "content": "Feeling depressed and living in a deprived urban neighbourhood could be making you age faster, according to a new study led by researchers at McMaster University. The findings, showed that living in … [+1645 chars]"}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "10 Unusual Symptoms of Rheumatoid Arthritis That Shouldn't Be Ignored | TheHealthSite.com - TheHealthSite", "description": "Check out the 10 less common symptoms of Rheumatoid Arthritis (RA). TheHealthSite.com", "url": "https://www.thehealthsite.com/diseases-conditions/10-unusual-symptoms-of-rheumatoid-arthritis-that-shouldnt-be-ignored-983027/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/Arthritis-5.jpg", "publishedAt": "2023-06-06T03:21:00Z", "content": "Rheumatoid Arthritis Unusual Symptoms: 7 Less Common Signs That Shouldn't Be Ignored\r\nCheck out the 10 less common symptoms of Rheumatoid Arthritis (RA).\r\nRheumatoid arthritis (RA) is a chronic infla… [+3869 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "What Is Intermittent Fasting? Know Health Benefits Of This Diet Plan For Quick Weight Loss - Jagran English", "description": "Weight Loss Tips There are several ways to practise intermittent fasting for significant health benefits and weight loss Scroll down to know more", "url": "https://english.jagran.com/lifestyle/what-is-intermittent-fasting-know-health-benefits-of-this-diet-plan-for-quick-weight-loss-10081303", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/intermittent-fasting1686020100112.jpg", "publishedAt": "2023-06-06T02:50:00Z", "content": "There are several diet plans that promise significant weight loss within a short period of time. One such popular weight loss diet plan is Intermittent Fasting, which means that you do not eat for so… [+2182 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Kitchen remedies for thick hair - msnNOW", "description": "Remember that maintaining a healthy lifestyle with a balanced diet, regular exercise, and proper hair care practices are essential for overall hair health.", "url": "https://timesofindia.indiatimes.com/life-style/beauty/kitchen-remedies-for-thick-hair/articleshow/100767145.cms", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1cbalm.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=471&y=224", "publishedAt": "2023-06-06T02:30:00Z", "content": "While there are no kitchen remedies that can magically make your hair thicker, there are some natural ingredients you can use to promote hair health and potentially improve the appearance of thicknes… [+2023 chars]"}, {"source": {"id": null, "name": "Timesofindia.com"}, "author": "Kritika Pushkarna", "title": "8 zinc-rich vegetables that are a must in daily diet - Recipes", "description": "Zinc is an essential mineral that plays a crucial role in various bodily functions, including immune system support, cell growth and division, wound healing, and metabolism. Here is a list of 8 veggies that are known to be high in this mineral.", "url": "https://recipes.timesofindia.com/web-stories/8-zinc-rich-vegetables-that-are-a-must-in-daily-diet/photostory/100775750.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100775754,imgsize-132886,width-900,height-1200,resizemode-6/100775754.jpg", "publishedAt": "2023-06-06T02:30:00Z", "content": "Zinc is an essential mineral that plays a crucial role in various bodily functions, including immune system support, cell growth and division, wound healing, and metabolism. Here is a list of 8 veggi… [+44 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Building a \"vaccine library\" to prevent future pandemics - EurekAlert", "description": "The Institute for Drug Discovery led by Humboldt Professor Jens Meiler is to receive 1.9 million dollars (1.77 million euros) for the development of vaccines. The international Coalition for Epidemic Preparedness Innovations (CEPI) will fund computer-aided va…", "url": "https://www.eurekalert.org/news-releases/991447", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/0a6b918a-5fca-448a-9c4a-9428467d90f2/Rendition/thumbnail/Content/Public", "publishedAt": "2023-06-06T02:02:09Z", "content": "image: Humboldt Prof. Jens Meiler and project manager Dr. Clara T. Schoeder analyze protein structures. Photo: Swen Reichholdview more \r\nCredit: Swen Reichhold/Leipzig University\r\nSocial upheavals su… [+2800 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Mosaic Mutations Reveal New Insights into Bipolar Disorder - Neuroscience News", "description": "Researchers unearthed new understandings about the genetic mechanisms behind bipolar disorder (BD).", "url": "https://neurosciencenews.com/mosaic-genetics-bipolar-23398/", "urlToImage": "https://neurosciencenews.com/files/2023/06/bipolar-moseic-genetics-neurosicence.jpg", "publishedAt": "2023-06-05T21:53:55Z", "content": "Summary: Researchers unearthed new understandings about the genetic mechanisms behind bipolar disorder (BD).\r\nThe team focused on mosaic variants – new mutations occurring during developmental stages… [+7748 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Sarah Glinski", "title": "What Is A Yeast Infection? Symptoms, Causes And Treatment - Forbes", "description": "", "url": "https://www.forbes.com/health/family/yeast-infection/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/x/https://www.forbes.com/health/wp-content/uploads/2023/06/yeast-infection.jpeg.jpg", "publishedAt": "2023-06-05T20:47:15Z", "content": null}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "Unveiling the Side Effects of Papaya: Separating Fact from Fiction - Sportskeeda", "description": "Papaya, also known as the \"fruit of angels,\" is a tropical delight cherished for its vibrant flavor, juicy texture, and numerous health benefits.", "url": "https://www.sportskeeda.com/health-and-fitness/unveiling-side-effects-papaya-separating-fact-fiction", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/06/a0ed6-16859950735977-1920.jpg", "publishedAt": "2023-06-05T20:36:00Z", "content": "Papaya, also known as the \"fruit of angels,\" is a tropical delight cherished for its vibrant flavor, juicy texture, and numerous health benefits. Packed with essential nutrients, vitamins, and enzyme… [+3406 chars]"}, {"source": {"id": null, "name": "Precisionmedicineonline.com"}, "author": "https://www.facebook.com/*", "title": "Early Adopters Share Experiences With Grail Cancer Test as Firm Faces New Clinical Questions - Precision Medicine Online", "description": "Real-world and trial data shored up evidence that the company's multi-cancer detection assay can guide follow-up assessment of patients with a positive result.", "url": "https://www.precisionmedicineonline.com/molecular-diagnostics/early-adopters-share-experiences-grail-cancer-test-firm-faces-new-clinical", "urlToImage": null, "publishedAt": "2023-06-05T19:39:29Z", "content": "NEW YORK Several early adopters of Grail's blood-based multi-cancer screening test, Galleri, shared their experiences implementing the assay clinically and studying it observationally at the annual m… [+7170 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Erika Watts", "title": "Scientists find 16 genes that increase risk for heart attacks in women - Medical News Today", "description": "Scientists have found genetic links for a condition associated with an increased risk of a type of heart attack primarily affecting women.", "url": "https://www.medicalnewstoday.com/articles/scientists-find-16-genes-that-increase-risk-for-heart-attacks-in-women", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/06/young-woman-wall-heart-health-732x549-thumbnail.jpg", "publishedAt": "2023-06-05T16:26:32Z", "content": "<ul><li>Researchers looked into the genetics behind Spontaneous Coronary Artery Dissection (SCAD), a condition that can be life threatening. </li><li>Spontaneous Coronary Artery Dissection can lead t… [+6853 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Hysterectomy: A Safe Treatment Option For Women With Cervical Cancer, Says Study - Zee News", "description": "Covid-19 Spread In Over 70 Percent US Household Started With A Kid, Says Study Sexual health and quality of life are very important considerations for patients undergoing cancer treatment, said Dr Lori Brotto, a professor of obstetrics and gynaecology at Univ…", "url": "https://zeenews.india.com/health/hysterectomy-a-safe-treatment-option-for-women-with-cervical-cancer-says-study-2618012", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/06/05/1214243-cervical-cancer.jpg", "publishedAt": "2023-06-05T15:29:21Z", "content": "A simple hysterectomy, a surgical procedure where the uterus and cervix is removed, is a safe treatment option that can improve quality of life for women with early-stage, low-risk cervical cancer, a… [+2615 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "DH Web Desk", "title": "IBA terms WHO's guidelines on non-sugar sweeteners 'not scientifically rigorous' - Deccan Herald", "description": "The World Health Organization (WHO) had recently announced that non-sugar sweeteners including aspartame and stevia do not necessarily assist in weight loss but instead pose an increased risk of certain diseases. It had also advised people against the uncheck…", "url": "https://www.deccanherald.com/national/iba-terms-whos-guidelines-on-non-sugar-sweeteners-not-scientifically-rigorous-1225003.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/06/05/spoon-1225003-1685974625.jpg", "publishedAt": "2023-06-05T14:17:05Z", "content": "The World Health Organization (WHO) had recently announced that non-sugar sweeteners including aspartame and stevia do not necessarily assist in weight loss but instead pose an increased risk of cert… [+1964 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "studio18", "title": "Ecdysterone - Results, Benefits, Side Effects, and Customer Reviews - Firstpost", "description": "Ecdysterone, also referred to as beta-ecdysterone, is an organic substance present in various plants and animals, which means this is an all-natural steroid.", "url": "https://www.firstpost.com/health-supplement/ecdysterone-results-benefits-side-effects-and-customer-reviews-12692052.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/06/Ecdysterone-1.jpg", "publishedAt": "2023-06-05T13:26:20Z", "content": "What better than having boosted stamina and muscle strength in no time, and that too with all the natural ingredients? This sounds off because natural ingredients take very long to show results, but … [+43061 chars]"}, {"source": {"id": null, "name": "VOGUE India"}, "author": "Anjan Sachar", "title": "Bloated stomach? Here's what nutritionists want you to know - VOGUE India", "description": "A bloated stomach is one of those health concerns that leaves even the fittest of us lost. But what causes bloating? How to reduce it? An expert decodes", "url": "https://www.vogue.in/content/feeling-bloated-lately-heres-what-nutritionists-want-you-to-know", "urlToImage": "https://assets.vogue.in/photos/647de10e400272c18df90670/16:9/w_1280,c_limit/Snapinsta.app_328821765_858124852116121_5516527992435760001_n_1080.jpg", "publishedAt": "2023-06-05T13:23:44Z", "content": "A bloated stomach is one of those health concerns that leaves even the fittest of us lost. Is my period near? Did I eat too much for dinner? Is this what acid reflux feels like? Did I eat something t… [+3216 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Trimtone Review: Appetite Suppressant, Fat Burner, Weight Loss Pills, Side Effects - Deccan Herald", "description": "Trimtone is a natural product that helps women lose weight. It has 5 main ingredients that make women burn fat, eat less and lose weight fast. This is a real Trimtone review with pictures of before and after results and stories of women who lost weight with T…", "url": "https://www.deccanherald.com/brandspot/sponsored/trimtone-review-appetite-suppressant-fat-burner-weight-loss-pills-side-effects-1225076.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201031-1225076-1685970043.jpg", "publishedAt": "2023-06-05T13:00:43Z", "content": "Trimtone is a natural product that helps women lose weight. It has 5 main ingredients that make women burn fat, eat less and lose weight fast.\r\nThis is a real Trimtone review with pictures of before … [+14420 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Micronutrient deficiency: Foods to include in your diet to get most micronutrients - Indiatimes.com", "description": "Vitamin and mineral deficiency can bring in the risk of many diseases. Here are some foods you must include in your diet.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/micronutrient-deficiency-foods-to-include-in-your-diet-to-get-most-micronutrients/articleshow/100765678.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100765744,width-1070,height-580,imgsize-889454,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-05T12:30:00Z", "content": "How to make Raw Mango Salad for weight loss"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes Management: Factors Other Than Diet That Affect Your Blood Sugar Levels - NDTV", "description": "Diabetes: Several factors can affect your blood sugar levels in more ways than one. Here's a list of these.", "url": "https://www.ndtv.com/health/diabetes-management-factors-other-than-diet-that-affect-your-blood-sugar-levels-4096041", "urlToImage": "https://c.ndtvimg.com/2021-11/5lgnne0g_diabetes_625x300_12_November_21.jpg", "publishedAt": "2023-06-05T12:29:11Z", "content": "Diabetes: Not drinking enough water can affectyour blood sugar levels\r\nDiabetes is a chronic condition in which diabetics have to follow interventions to maintain healthy blood sugar levels. Diet is … [+2625 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Shreya Goswami", "title": "5 Health Hazards Of Using Mango Ripening Powder - Slurrp", "description": "Summer is the time to enjoy mangoes in India, but every consumer should also beware of mango ripening powder. Used to accelerate the ripening process of mangoes as well as other fruits and vegetables, these artificial ripeners are chemicals that can cause ple…", "url": "https://www.slurrp.com/article/5-health-hazards-of-using-mango-ripening-powder-1685964669177", "urlToImage": "https://images.slurrp.com/prodarticles/faz5lzjdc79.webp", "publishedAt": "2023-06-05T11:43:05Z", "content": "The Harmful Impact Of Calcium Carbide \r\nThe use of artificial ripening agents, including calcium carbide, has raised concerns due to potential health risks. Calcium carbide itself is a hazardous subs… [+2655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Ayurveda alert: A ‘soothing laxative’ to keep constipation at bay - The Indian Express", "description": "While changing your diet and increasing your physical activity level are the easiest ways to treat and prevent constipation, there are a number of Ayurvedic remedies that can help you.", "url": "https://indianexpress.com/article/lifestyle/health/aragwadha-ayurvedic-remedy-benefits-constipation-8641928/", "urlToImage": "https://images.indianexpress.com/2023/06/aragwadha.jpg", "publishedAt": "2023-06-05T11:30:36Z", "content": "Whether due to diet, an unhealthy lifestyle, dehydration, pregnancy, or certain medications, constipation — a condition characterised by infrequent bowel movement or difficulty in passing stool — has… [+4408 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "A new study finds eye drops can slow nearsightedness progression in children - Tech Explorist", "description": "Eye drops show promise in slowing nearsightedness progression in children.", "url": "https://www.techexplorist.com/new-study-finds-eye-drops-slow-nearsightedness-progression-children/61333/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/eye-drops.jpg", "publishedAt": "2023-06-05T09:45:55Z", "content": "Eye drops have emerged as a promising solution for slowing down the progression of nearsightedness (myopia) in children. Traditional corrective measures like glasses and contact lenses provide immedi… [+3391 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Breastfeeding Diet: 5 Superfoods To Include In Your Diet For Your Lactation Period - Jagran English", "description": "Breastfeeding Diet For New Mothers Lactation is the process of producing breast milk during which the new mothers should be extra careful of what they consume Scroll down to know more", "url": "https://english.jagran.com/lifestyle/breastfeeding-diet-superfoods-to-include-in-your-diet-for-your-lactation-period-10081198", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/breastfeeding-diet1685958242960.jpg", "publishedAt": "2023-06-05T09:41:00Z", "content": "Motherhood is a magical phase during which a mother takes care of her newborn baby with utmost devotion. During the post-pregnancy phase, the new mother needs to be extra careful of her health as it … [+2235 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Ozempic Side Effects for Weight Loss | Ozempic Weight Loss Side Effects - Deccan Herald", "description": "If you want to lose a lot of weight, PhenQ is the best diet pill for you. It is made by Wolfson Berg Limited, a company that has a good reputation in making supplements. PhenQ has helped almost 200,000 people get rid of extra fat in one year. The company says…", "url": "https://www.deccanherald.com/brandspot/sponsored/ozempic-side-effects-for-weight-loss-ozempic-weight-loss-side-effects-1224965.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201022-1224965-1685953599.jpg", "publishedAt": "2023-06-05T08:24:16Z", "content": "If you want to lose a lot of weight, PhenQ is the best diet pill for you. It is made by Wolfson Berg Limited, a company that has a good reputation in making supplements. PhenQ has helped almost 200,0… [+22605 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Pratik Kumar", "title": "Anti-Malaria Month: What India Exactly Needs To Eliminate Malaria By 2030 - Indiatimes.com", "description": "Malaria has been one of India’s long-standing public health problems. Through this open letter, I call for urgent action and your participation in the fight against malaria. The Government of India remains committed to eliminating malaria. In 2016, India intr…", "url": "https://www.indiatimes.com/explainers/news/anti-malaria-month-what-india-exactly-needs-to-eliminate-malaria-by-2030-604893.html", "urlToImage": "https://im.indiatimes.in/content/2022/Oct/2_63550d23c70cf.jpg", "publishedAt": "2023-06-05T07:55:49Z", "content": "Malaria has been one of Indias long-standing public health problems. Through this open letter, I call for urgent action and your participation in the fight against malaria. The Government of India re… [+2145 chars]"}, {"source": {"id": null, "name": "Thenewsmill.com"}, "author": "ANI", "title": "Children with drug-resistant epilepsy survive longer after cranial surgery: Study - TheNewsMill", "description": "According to a study, the survival rate in children with drug-resistant epilepsy (DRE) was highest following cranial epilepsy surgery and lowest when treated simply with antiseizure medicines.The findings of the study were published in The Lancet Child and Ad…", "url": "https://thenewsmill.com/2023/06/children-with-drug-resistant-epilepsy-survive-longer-after-cranial-surgery-study/", "urlToImage": "https://thenewsmill.com/wp-content/plugins/wonderm00ns-simple-facebook-open-graph-tags/fbimg.php?is_home=0&is_front_page=0&object_type=post&post_id=100318&object_id=100318&img=https%253A%252F%252Fthenewsmill.com%252Fwp-content%252Fuploads%252F2023%252F06%252Fchildren-with-drug-resistant-epilepsy-survive-longer-after-cranial-surgery-study.jpg", "publishedAt": "2023-06-05T06:35:01Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Uddipta Banerjee", "title": "Can ragi substitute milk and other dairy products? - The Indian Express", "description": "Can ragi substitute milk and other dairy products?", "url": "https://indianexpress.com/web-stories/food/can-ragi-substitute-milk-and-other-dairy-products/", "urlToImage": "https://images.indianexpress.com/2023/06/cropped-Untitled-design-2023-06-02T123214.213-1.jpg", "publishedAt": "2023-06-05T06:27:49Z", "content": "For most people, calcium is synonymous with milk and many milk products. \r\nBut, did you know that cereal grains like ragi, also known as finger millet, are also a rich source of calcium and can even … [+881 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Spinach To Bitter-gourd, 5 Green Juices To Control Diabetes - News18", "description": "Bitter gourd contains an insulin-like compound called Polypeptide-p or p-insulin which has been shown to control diabetes naturally.", "url": "https://www.news18.com/lifestyle/spinach-to-bitter-gourd-5-green-juices-to-control-diabetes-8001343.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/06/untitled-design-2023-06-05t105558.106-168594276816x9.jpg", "publishedAt": "2023-06-05T05:30:12Z", "content": "Giving our bodies the vital nutrients and vitamins they need is crucial for optimal health and physical well-being. Due to their high vitamin content, experts stress how important it is to include ve… [+2578 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Profile and quality of life of the adult population in good health according to the level of vitality: European NHWS cross sectional analysis - BMC Public Health - BMC Public Health", "description": "Background The World Health Organization’s definition of health highlights the importance of mental and physical wellbeing and not only disease state. However, lack of awareness on the burden of impaired vitality and its impact on the quality of life of the g…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-023-15754-0", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2023-06-05T04:46:08Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "Typhoid Cases Increasing In India: Alert Issued To States Over Sudden Outbreak | TheHealthSite.com - TheHealthSite", "description": "Take a quick look at the top 5 diseases that are expected to spread in India in the coming weeks. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/alert-issued-in-india-over-top-5-diseases-ncdc-warns-against-sudden-outbreak-982754/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/06/Typhoid.jpg", "publishedAt": "2023-06-05T03:33:00Z", "content": "Alert Issued In India Over Top 5 Diseases: NCDC Warns Against Sudden Outbreak\r\nTake a quick look at the top 5 diseases that are expected to spread in India in the coming weeks.\r\nWith covid cases sett… [+2032 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Swati Chaturvedi", "title": "Brain Tumours: Everything You Need To Know About the Condition - News18", "description": "DR. G. Vamshi Krishna Reddy, Director, Oncology Services, Consultant Medical Oncologist & Hemato Oncologist, Yashoda hospitals Hyderabad discusses everything about brain tumours", "url": "https://www.news18.com/lifestyle/brain-tumours-everything-you-need-to-know-about-the-condition-7998775.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/06/untitled-design-2023-06-03t090910.430-168576364216x9.png", "publishedAt": "2023-06-05T02:44:18Z", "content": "Brain tumours are formed when the normal brain cells change into abnormal cells due to various genetic mutations and form a mass which can damage the normal brain or cause pressure symptoms because o… [+3694 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hollywood Actor Suffers Side Effects Of Covid Vaccine? | So Is Covid Vax Safe? Watch This Report - India Today", "description": "The Centre has refuted media reports that the Indian Council of Medical Research (ICMR) and Central Drugs Standard Control Organisation (CDSCO ) had admitted...", "url": "https://www.youtube.com/watch?v=gAxyBMnT8NI", "urlToImage": "https://i.ytimg.com/vi/gAxyBMnT8NI/maxresdefault.jpg", "publishedAt": "2023-06-05T02:39:05Z", "content": null}, {"source": {"id": null, "name": "B2bchief.com"}, "author": "B2BChief", "title": "Grief may increase risk of heart problems shows new study | Health - B2BCHIEF", "description": "Losing loved ones may have a significant impact on both psychological and physical health. The University of Arizona researched the influence of grief on heart function and discovered that intense grieving might induce a significant increase in blood pressure…", "url": "https://b2bchief.com/grief-may-increase-risk-of-heart-problems-shows-new-study-health/", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/03/550x309/grief_1685774860659_1685774869364.jpg", "publishedAt": "2023-06-04T22:05:34Z", "content": "Losing loved ones may have a significant impact on both psychological and physical health. The University of Arizona researched the influence of grief on heart function and discovered that intense gr… [+3733 chars]"}]}