{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "Free Press Journal"}, "author": "Swapnil Mishra", "title": "Mumbai: City doctors witness spike in upper respiratory tract infections - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/mumbai/mumbai-city-doctors-witness-spike-in-upper-respiratory-tract-infections", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-09/23e5683f-aac9-4e8b-8912-fa5dc539c33c/Doctors_For_Men_732x549_thumbnail.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-09-16T18:21:17Z", "content": "Doctors in Mumbai have once again noticed a spurt of viral infections over the last 10 days, especially those causing upper respiratory tract infections. This comes after the city witnessed heavy rai… [+3585 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Research: Dozens of gut bacteria associated with multiple sclerosis - ThePrint", "description": "Washington [US], September 16 (ANI): An international research consortium led by UC San Francisco scientists has shown significant differences between the gut bacteria profiles of multiple sclerosis (MS) patients and healthy individuals, as well as between MS…", "url": "https://theprint.in/science/research-dozens-of-gut-bacteria-associated-with-multiple-sclerosis/1131740/", "urlToImage": null, "publishedAt": "2022-09-16T18:13:47Z", "content": "Washington [US], September 16 (ANI): An international research consortium led by UC San Francisco scientists has shown significant differences between the gut bacteria profiles of multiple sclerosis … [+5676 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Repeated infections associated with increased risk of some neurodegenerative diseases: Study - ThePrint", "description": "Washington [US], September 16 (ANI): Infections treated with speciality hospital care in early and mid-life are associated with an increased subsequent risk of Alzheimer’s (AD) and Parkinson’s diseases (PD), but not amyotrophic lateral sclerosis (ALS), accord…", "url": "https://theprint.in/health/repeated-infections-associated-with-increased-risk-of-some-neurodegenerative-diseases-study/1131736/", "urlToImage": null, "publishedAt": "2022-09-16T18:13:31Z", "content": "Washington [US], September 16 (ANI): Infections treated with speciality hospital care in early and mid-life are associated with an increased subsequent risk of Alzheimer’s (AD) and Parkinson’s diseas… [+1881 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Neuropsychiatric symptoms in AD: the search for mechanisms - Nature.com", "description": "New work building on the results of genome-wide association studies in Alzheimer disease has identified molecular mechanisms that are shared with some psychiatric disorders. The study leveraged ‘omics data and has the realistic potential to elucidate unknown …", "url": "https://www.nature.com/articles/s41582-022-00721-x", "urlToImage": null, "publishedAt": "2022-09-16T17:25:24Z", "content": "<li>Steinberg, M. et al. Point and 5-year period prevalence of neuropsychiatric symptoms in dementia: the Cache County Study. Int. J. Geriatr. Psychiatry23, 170177 (2008).\r\nArticle \r\nGoogle Scholar \r… [+1348 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Q&A: Severe asthma treatment with biologics remains safe during COVID-19 pandemic - Healio", "description": "Patients who received biologic treatment for asthma did not experience higher SARS-CoV-2 infection rates than the general population, according to a study published in The Journal of Allergy and Clinical Immunology: In Practice. Also, the use of biologics in …", "url": "https://www.healio.com/news/allergy-asthma/20220916/qa-severe-asthma-treatment-with-biologics-remains-safe-during-covid19-pandemic", "urlToImage": "https://www.healio.com/~/media/slack-news/allergy_asthma/stock-photos/womangettingashot_stock_1200x630.jpg", "publishedAt": "2022-09-16T16:42:17Z", "content": "Patients who received biologic treatment for asthma did not experience higher SARS-CoV-2 infection rates than the general population, according to a study published in The Journal of Allergy and Clin… [+6603 chars]"}, {"source": {"id": null, "name": "Clinical Trials Arena"}, "author": "GlobalData Healthcare", "title": "Study underscores the relationship between social conditions and heart disease - Clinical Trials Arena", "description": "Social determinants of health have inspired a growing body of work on the influence of race, gender and socioeconomic status (SES) on health outcomes. A recent publication by Corwin and colleagues in", "url": "https://www.clinicaltrialsarena.com/comment/social-conditions-cvd/", "urlToImage": "https://www.clinicaltrialsarena.com/wp-content/uploads/sites/22/2022/09/featured-image-4.jpg", "publishedAt": "2022-09-16T14:38:52Z", "content": "Social determinants of health have inspired a growing body of work on the influence of race, gender and socioeconomic status (SES) on health outcomes. A recent publication by Corwin and colleagues in… [+4154 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Talk With Your Hands? You Might Think With Them Too! - Neuroscience News", "description": "Constraining hand movements affects the processing of object-meaning, a finding which supports the theory of embodied cognition.", "url": "https://neurosciencenews.com/embodied-cognition-21421/", "urlToImage": "https://neurosciencenews.com/files/2022/09/thinking-gestures-neurosicences.jpg", "publishedAt": "2022-09-16T14:33:44Z", "content": "Summary: Constraining hand movements affects the processing of object-meaning, a finding which supports the theory of embodied cognition.\r\nSource: Osaka Metropolitan University\r\nHow do we understand … [+5736 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Severe Allergic Rhinitis symptoms may worsen Academic Productivity - Medical Dialogues", "description": "Academic productivity is worsened by allergy symptoms and allergic rhinitis in young individuals as...", "url": "https://medicaldialogues.in/ent/news/severe-allergic-rhinitis-symptoms-may-worsen-academic-productivity-99195", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/12/185389-allergic-rhinitis.jpg", "publishedAt": "2022-09-16T14:30:59Z", "content": "Academic productivity is worsened by allergy symptoms and allergic rhinitis in young individuals as per a recent study that was published in The Journal of Allergy and Clinical Immunology: In Practic… [+2181 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Simple blood test predicts neurotoxic complications of CAR-T cell therapy - Medical Dialogues", "description": "Although Cell-based immunotherapy or CAR-T cell therapy has revolutionized the treatment of several...", "url": "https://medicaldialogues.in/oncology/news/simple-blood-test-predicts-neurotoxic-complications-of-car-t-cell-therapy-99153", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/02/184858-untitled-design-26.jpg", "publishedAt": "2022-09-16T14:30:47Z", "content": "Although Cell-based immunotherapy or CAR-T cell therapy has revolutionized the treatment of several cancers, it is fraught with risk of a range of side effects, some of which affection brain function… [+4972 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Cumulative high BP is better for predicting cardiovascular and death risk in type 2 diabetes patients:... - Medical Dialogues", "description": "Australia: Cumulative systolic blood pressure (SBP) may better predict major cardiovascular events...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/cumulative-high-bp-is-better-for-predicting-cardiovascular-and-death-risk-in-type-2-diabetes-patients-jacc-99196", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/11/180476-blood-pressure.jpg", "publishedAt": "2022-09-16T14:30:45Z", "content": "Australia: Cumulative systolic blood pressure (SBP) may better predict major cardiovascular events in type 2 diabetes patients compared with traditional BP measures, a recent study in the Journal of … [+2768 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Early aggressive hydration in acute pancreatitis results in fluid overload without improving outcomes:... - Medical Dialogues", "description": "Researchers have found in a randomized trial that early vigorous hydration led to a greater...", "url": "https://medicaldialogues.in/gastroenterology/news/early-fluid-resuscitation-against-acute-pancreatitis-may-result-in-fluid-overload-in-patients-nejm-99191", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/24/123499-saline.jpg", "publishedAt": "2022-09-16T14:30:13Z", "content": "Researchers have found in a randomized trial that early vigorous hydration led to a greater incidence of fluid overload without improving clinical outcomes in patients with acute pancreatitis. The fi… [+2129 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Tirzepatide achieves blood sugar control and weight-loss goals faster than existing diabetes drugs - Medical Dialogues", "description": "Tirzepatide lowers blood sugar and supports weight loss better than other drugs for type 2 diabetes...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/tirzepatide-achieves-blood-sugar-control-and-weight-loss-goals-faster-than-existing-diabetes-drugs-99212", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/16/185715-diabetes.jpg", "publishedAt": "2022-09-16T14:30:00Z", "content": "Tirzepatide lowers blood sugar and supports weight loss better than other drugs for type 2 diabetes (T2D) was established by in phase 3 SURPASS trials published in 2021.\r\nThe latest analyses of the S… [+4829 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "7 lifestyle habits you must change to reduce risk of diabetes - DNA India", "description": "Here are seven bad habits that can cause you to develop diabetes.", "url": "https://www.dnaindia.com/lifestyle/photo-gallery-diabetes-7-lifestyle-habits-you-must-change-to-reduce-risk-of-diabetes-2985708", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/09/16/2539218-untitled-design-2022-09-16t193423.127.jpg", "publishedAt": "2022-09-16T14:05:00Z", "content": "Many diseases are brought on by a lack of critical macro and micronutrients, which can also have an impact on general health. Numerous studies have revealed that a healthy eating, vegan diet, and lea… [+287 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "7 lifestyle habits to reduce risk of dementia in people with diabetes - Hindustan Times", "description": "In adults with type 2 diabetes, a combination of seven healthy lifestyle habits, including sleeping seven to nine hours per day, exercising regularly, and having frequent social interaction, was related with a decreased risk of dementia. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/7-lifestyle-habits-to-reduce-risk-of-dementia-in-people-with-diabetes-101663336621089.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/16/1600x900/pjimage_1642139269415_1663336700320_1663336700320.jpg", "publishedAt": "2022-09-16T14:02:04Z", "content": "In adults with type 2 diabetes, a combination of seven healthy lifestyle habits, including sleeping seven to nine hours per day, exercising regularly, and having frequent social interaction, was rela… [+4155 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Severe Vitamin B12 Deficiency Presenting as Pancytopenia, Hemolytic Anemia, and Paresthesia: Could Your B12 Be Any Lower? - Cureus", "description": "Although severe vitamin B12 deficiency is rare in the United States, recent increases in the adoption of vegan lifestyles have led to a significant rise in the rates of B12 deficiency, along with its hematologic and neurologic sequelae, the latter of which is…", "url": "https://www.cureus.com/articles/113016-severe-vitamin-b12-deficiency-presenting-as-pancytopenia-hemolytic-anemia-and-paresthesia-could-your-b12-be-any-lower", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_1.png", "publishedAt": "2022-09-16T13:54:32Z", "content": "Although severe vitamin B12 deficiency is rare in the United States, recent increases in the adoption of vegan lifestyles have led to a significant rise in the rates of B12 deficiency, along with its… [+17276 chars]"}, {"source": {"id": null, "name": "African.business"}, "author": "apofeed", "title": "Ghana Declares End of Marburg Virus Disease Outbreak - African Business", "description": "Download logoGhana today declared the end of the Marburg virus disease outbreak that was confirmed nearly two months ago. It was the first time the highly", "url": "https://african.business/2022/09/apo-newsfeed/ghana-declares-end-of-marburg-virus-disease-outbreak/", "urlToImage": "https://www.africa-newsroom.com/files/large/59428943ec1d539", "publishedAt": "2022-09-16T13:36:05Z", "content": "Download logoGhana today declared the end of the Marburg virus disease outbreak that was confirmed nearly two months ago. It was the first time the highly infectious haemorrhagic fever was detected i… [+3372 chars]"}, {"source": {"id": null, "name": "Longevitylive.com"}, "author": "Dr. Taheera Hassim", "title": "Dr Taheera Hassim Explains How To Prepare For A Healthy Menopause - Longevity LIVE - Longevity LIVE", "description": "Dr Taheera Hassim says many women are ill prepared for the onset of menopause. She explains what they need to know and do to stay healthy.", "url": "https://longevitylive.com/anti-aging/dr-taheera-hassim-explains-how-to-prepare-for-a-healthy-menopause/", "urlToImage": "https://longevitylive.com/wp-content/uploads/2014/07/shutterstock_62580226.jpg", "publishedAt": "2022-09-16T13:29:20Z", "content": "Women are often so caught up in everyday life that we overlook caring for ourselves. If you have been under prioritizing your health and are entering menopause, you need to take the time to reflect, … [+5872 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Mainland China reports first imported monkeypox case - Devdiscourse", "description": "The person concerned entered Chongqing city in transit from abroad, and showed symptoms such as a skin rash during their quarantine period for COVID, according to the statement.  Around 90 countries where monkeypox is not endemic have reported outbreaks of th…", "url": "https://www.devdiscourse.com/article/health/2181139-mainland-china-reports-first-imported-monkeypox-case", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_23_10_1033124.jpg?width=920&format=jpeg", "publishedAt": "2022-09-16T13:07:39Z", "content": "Mainland China's southwestern municipality of Chongqing reported one case of the monkeypox virus infection on Friday in one individual who arrived in the country from abroad, marking the country's fi… [+1062 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Amritha K", "title": "Coronavirus Residues Might Be Causing Long COVID: New Study - Boldsky", "description": "A new study has suggested that leftover Coronavirus residues might be responsible for long COVID, or the post-COVID condition that persists in some people even weeks, months, and years after the disease has occurred. Read more on Coronavirus Residues Might Be…", "url": "https://www.boldsky.com/health/wellness/coronavirus-residues-might-be-causing-long-covid-new-study-142344.html", "urlToImage": "https://www.boldsky.com/img/2022/09/covidresiduesmightbecausinglongcovid-page-001-1663332096.jpg", "publishedAt": "2022-09-16T12:46:40Z", "content": "A new study published in the Clinical Infectious Diseases journal has suggested that leftover Coronavirus residues might be responsible for long COVID, or the post-COVID condition that persists in so… [+2693 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Pooja Malhotra Shares Habits That Maybe Killing Your Metabolism Restricting Further Weight Loss - NDTV Doctor", "description": "Pooja Malhotra throws light on habits that may be killing your metabolism.", "url": "https://doctor.ndtv.com/living-healthy/are-you-doing-everything-to-lose-weight-but-it-isn-t-working-maybe-these-habits-are-killing-your-metabolism-3092570", "urlToImage": "https://i.ndtvimg.com/i/2017-12/asian-sesame-chicken-salad_620x330_71513058027.jpg", "publishedAt": "2022-09-16T12:32:58Z", "content": "Weight loss is almost on everyone's to-do list. Sometimes, we go to any extent to get rid of those extra kilos. Whether it's following a strict diet or performing exercising every single day, there's… [+3435 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Testo Max Review 2022: Is CrazyBulk Testo-Max Worth Buying? Expert's Report - Deccan Herald", "description": "Testo Max is a supplement for people who want to build muscle. This natural way to increase testosterone does just that. Steroids that build muscle are not needed. It is a great way to boost testosterone levels. Elements that raise testosterone levels and giv…", "url": "https://www.deccanherald.com/brandspot/pr-spot/testo-max-review-2022-is-crazybulk-testo-max-worth-buying-expert-s-report-1145691.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/gfhngh.jpg", "publishedAt": "2022-09-16T12:13:30Z", "content": "Testo Max is a supplement for people who want to build muscle. This natural way to increase testosterone does just that. Steroids that build muscle are not needed. It is a great way to boost testoste… [+6401 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Alpha Strength Review (USA): (Ingredients, Side Effects) Read Complaints | Is Alpha Strength a Scam? - Deccan Herald", "description": "Alpha Strength is a new supplement by New Alpha Nutrition. It naturally, easily, and effectively raises free \"t\" levels by 440% or more. It could be the most effective natural product available for men over 40 with erectile dysfunction, poor libido, and low t…", "url": "https://www.deccanherald.com/brandspot/pr-spot/alpha-strength-review-usa-ingredients-side-effects-read-complaints-is-alpha-strength-a-scam-1145688.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/rsthdfgh.jpg", "publishedAt": "2022-09-16T12:02:54Z", "content": "Alpha Strength is a new supplement by New Alpha Nutrition. It naturally, easily, and effectively raises free \"t\" levels by 440% or more. It could be the most effective natural product available for m… [+9849 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Akshita Arora", "title": "Does Monkeypox Affect A Person's Heart Health? - Asiana Times", "description": "A 31-year-old male patient with confirmed monkeypox infection developed acute myocarditis several days after the onset of skin lesions, according to a report published September 2, 2022, in the Journals of the American College of Cardiology (JACC). It has bee…", "url": "https://asianatimes.com/does-monkeypox-affect-a-persons-heart-health/", "urlToImage": "https://asianatimes.com/wp-content/uploads/2022/09/Untitled-design-2-36.png", "publishedAt": "2022-09-16T11:52:30Z", "content": "A 31-year-old male patient with confirmed monkeypox infection developed acute myocarditis several days after the onset of skin lesions, according to a report published September 2, 2022, in the Journ… [+2286 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Akshita Arora", "title": "Experts Say Simple Lifestyle Changes To Cut The Risk Of Cancer Before 50 Age - Asiana Times", "description": "A recent study found that the number of people under the age of 50 with cancer has increased dramatically around the world. Early-stage cancer cases appear to be on the rise due to factors such as alcohol use, sleep deprivation, obesity, smoking and consumpti…", "url": "https://asianatimes.com/experts-say-simple-lifestyle-changes-to-cut-the-risk-of-cancer-before-50-age/", "urlToImage": "https://asianatimes.com/wp-content/uploads/2022/09/Asiana-Times-Live-News-Analysis.png", "publishedAt": "2022-09-16T11:42:18Z", "content": "A recent study found that the number of people under the age of 50 with cancer has increased dramatically around the world. Early-stage cancer cases appear to be on the rise due to factors such as al… [+2167 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "“Boon For Diabetes”: Nutritionist Explains Tulsi’s Effects On Insulin - NDTV Doctor", "description": "Nutritionist Lovneet Batra calls Tulsi a “boon for diabetes” in her recent Instagram Stories.", "url": "https://doctor.ndtv.com/living-healthy/boon-for-diabetes-nutritionist-explains-tulsi-s-effects-on-insulin-3136853", "urlToImage": "https://c.ndtvimg.com/2022-07/d6e6rvho_high-fiber-foods-for-diabetes_625x300_08_July_22.jpg", "publishedAt": "2022-09-16T11:31:42Z", "content": "Diabetes, an extremely common ailment, is a health condition that is hugely impacted by the food you consume. High blood sugar levels from diabetes can damage your nerves, eyes, kidneys, and other or… [+2235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "How do blood pressure and diabetes damage the liver and kidney? - The Indian Express", "description": "Diabetes and hypertension are closely interlinked by similar risk factors such as vascular dysfunction and inflammation, arterial remodelling, atherosclerosis, dyslipidemia and obesity, says Dr Aarti Ullal, Consultant Endocrinologist, Global Hospital, Parel, …", "url": "https://indianexpress.com/article/lifestyle/health-specials/how-do-blood-pressure-and-diabetes-damage-the-liver-and-kidney-8155521/", "urlToImage": "https://images.indianexpress.com/2022/08/bp.jpg", "publishedAt": "2022-09-16T11:31:01Z", "content": "When the pressure exerted by the blood on the wall of the arteries is higher than normal, it is called hypertension. Higher the blood pressure, greater is the risk of stroke, heart disease, kidney an… [+2909 chars]"}, {"source": {"id": null, "name": "Mmnews.tv"}, "author": "MM News Staff", "title": "Drinking lemon juice water on hot food maybe harmful to body - MM News", "description": "The health benefits of lemon need no separate introduction. Lemons are an excellent source of vita...", "url": "https://mmnews.tv/drinking-lemon-juice-water-on-hot-food-maybe-harmful-to-body/", "urlToImage": "https://mmnews.tv/wp-content/uploads/2019/10/Lemon-water.jpg", "publishedAt": "2022-09-16T11:26:24Z", "content": "The health benefits of lemon need no separate introduction. Lemons are an excellent source of vitamin C and flavonoids, which are antioxidants.\r\nIt is loaded with several essential nutrients that hel… [+1115 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Mehmet Sarıusta", "title": "What You Need to Know About Cancer Disease » Expat Guide Turkey - Expat Guide Turkey", "description": "Some important information about cancer that has become our nightmare. With the discovery of antibiotics in the last century, the average human lifespan has increased by about 30 years, people have be", "url": "https://expatguideturkey.com/what-you-need-to-know-about-cancer-disease/", "urlToImage": "https://expatguideturkey.com/wp-content/uploads/2022/09/uPH8hQnKqSl9Qc7N-636026175156118220.jpg", "publishedAt": "2022-09-16T11:25:29Z", "content": "Some important information about cancer that has become our nightmare.\r\nWith the discovery of antibiotics in the last century, the average human lifespan has increased by about 30 years, people have … [+4940 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Gorilla Flow Reviews [EXPOSED SCAM Gorilla Flow] Must Read About Customer Review! - Deccan Herald", "description": "Gorilla Flow Reviews The most common symptom of prostate cancer is the need to urinate frequently, especially during night time. Other symptoms include pain in the lower back, pain while ejaculating and blood in the semen. In some cases, men with enlarged pro…", "url": "https://www.deccanherald.com/brandspot/pr-spot/gorilla-flow-reviews-exposed-scam-gorilla-flow-must-read-about-customer-review-1145668.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/xfgng.png", "publishedAt": "2022-09-16T11:18:29Z", "content": "Gorilla Flow ReviewsThe most common symptom of prostate cancer is the need to urinate frequently, especially during night time. Other symptoms include pain in the lower back, pain while ejaculating a… [+9382 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Kajal Rajput", "title": "Monkeypox in India: ICMR conducts study on first fatal case of monkeypox from Kerala - Medical Dialogues", "description": "\"This is the first fatal case of Monkeypox reported from India. This case highlights the importance...", "url": "https://medicaldialogues.in/news/health/monkeypox-in-india-icmr-conducts-study-on-first-fatal-case-of-monkeypox-from-kerala-99214", "urlToImage": "https://medicaldialogues.in/h-upload/2021/08/03/158460-icmr.jpg", "publishedAt": "2022-09-16T11:00:29Z", "content": "New Delhi: The first fatal case of monkeypox in India highlights the importance of maintaining a high index of suspicion to diagnose the viral disease in those presenting with atypical manifestations… [+3447 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "US warns monkeypox could mutate to resist antiviral drug - The Week", "description": "US health officials are warning against overuse of the lone drug available to treat monkeypox, saying that even a small mutation in the virus could render the pills ineffective. The Food and Drug Administration updated its guidance this week for Tpoxx, which …", "url": "https://www.theweek.in/news/health/2022/09/16/us-warns-monkeypox-could-mutate-to-resist-antiviral-drug.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/7/2/vial-containing-the-monkeypox-vaccine-and-a-syringe-ap.jpg", "publishedAt": "2022-09-16T10:35:02Z", "content": "US health officials are warning against overuse of the lone drug available to treat monkeypox, saying that even a small mutation in the virus could render the pills ineffective.\r\nThe Food and Drug Ad… [+3950 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Is it really healthy to restrict protein intake for kidney transplant recipients? - Times Now", "description": "According to conventional wisdom, patients with kidney disease must consume a low protein diet. With their recent study on the relationship between protein intake and skeletal muscle mass in kidney transplant recipients, scientists from Osaka Metropolitan Uni…", "url": "https://www.timesnownews.com/health/is-it-really-healthy-to-restrict-protein-intake-for-kidney-transplant-recipients-article-94246037", "urlToImage": "https://static.tnn.in/thumb/msid-94246037,imgsize-100,width-1280,height-720,resizemode-75/94246037.jpg", "publishedAt": "2022-09-16T10:22:25Z", "content": "Chronic kidney disease patients have been shown to have induced sarcopenia as a result of chronic inflammation, hypercatabolism, decreased nutrient intake, and decreased physical activity, all of whi… [+46 chars]"}, {"source": {"id": null, "name": "Contentmediasolution.com"}, "author": null, "title": "Wockhardt Hospitals, Mira Road Conducts PCOS Awareness Campaign - Content Media Solution", "description": "Polycystic ovary syndrome (PCOS) is not only a matter of concern for women of the", "url": "https://contentmediasolution.com/education/wockhardt-hospitals-mira-road-conducts-pcos-awareness-campaign/", "urlToImage": "https://contentmediasolution.com/wp-content/uploads/2021/05/cropped-website_logo_transparent_background.png", "publishedAt": "2022-09-16T10:19:29Z", "content": "Polycystic ovary syndrome (PCOS) is not only a matter of concern for women of the reproductive age group but even for young teens. Currently, a large number of young teens are getting diagnosed with … [+3350 chars]"}, {"source": {"id": null, "name": "Worldnationnews.com"}, "author": "https://www.facebook.com/worldnationnews", "title": "Biologic Drugs Continue To Be The Rheumatological Treatment Of Choice - World Nation News", "description": "Advances have made it possible to dramatically scale up new therapies to treat autoimmune conditions. Photo: Shutterstock.", "url": "https://worldnationnews.com/biologic-drugs-continue-to-be-the-rheumatological-treatment-of-choice/", "urlToImage": "https://worldnationnews.com/wp-content/uploads/2022/09/Biologic-drugs-continue-to-be-the-rheumatological-treatment-of-choice.png", "publishedAt": "2022-09-16T10:11:13Z", "content": "Medical advances continue to expand and improve therapy for each condition triggered by this system.\r\n Advances have made it possible to dramatically scale up new therapies to treat autoimmune condit… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Unhealthy Is Frozen Food? Here's Why You Should Avoid Them - NDTV", "description": "In this article, we discuss reasons why you should avoid consuming frozen food.", "url": "https://www.ndtv.com/health/how-unhealthy-is-frozen-food-heres-why-you-should-avoid-them-3345517", "urlToImage": "https://c.ndtvimg.com/2019-10/rgsj9oc_frozen-foods-_625x300_25_October_19.jpg", "publishedAt": "2022-09-16T09:51:22Z", "content": "Frozen Food: Frozen foods range in unhealthiness in terms of how they are prepared and stored\r\nFrozen foods are a wide array of foods. Frozen foods can include uncooked veggies, ready-to-eat main cou… [+3306 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Bilateral Parainfectious Optic Neuritis in Young Patient - Cureus", "description": "Parainfectious optic neuritis arises from infectious aetiology either from pathogen direct invasion or after an infectious disease which can be immunologically mediated demyelination of optic nerve or, from inflammation of optic disc vasculature. We report a …", "url": "https://www.cureus.com/articles/110801-bilateral-parainfectious-optic-neuritis-in-young-patient", "urlToImage": "https://assets.cureus.com/uploads/figure/file/430369/article_river_7bef0b60184f11edb55ac57e7a256835-Picture1.png", "publishedAt": "2022-09-16T09:10:41Z", "content": "Optic neuritis is an inflammatory optic neuropathy that causes visual impairment and is associated with demyelinating inflammatory disease and infectious aetiologies. It typically affects patients be… [+10792 chars]"}, {"source": {"id": null, "name": "Theweeklymail.com"}, "author": "Abhilasha", "title": "Dengue Prevention Tips: Try These 5 Simple Tips To Keep Dengue Mosquitoes Away From Home - The Weekly Mail", "description": "Dengue Prevention Tips Dengue's havoc is once again increasing in the country. After the smoky rainy season, you many states are battling with mosquitoes. Dengue mosquito usually bites during the day. So know what can be done to avoid it.", "url": "https://theweeklymail.com/dengue-prevention-tips-try-these-5-simple-tips-to-keep-dengue-mosquitoes-away-from-home", "urlToImage": "https://theweeklymail.com/uploads/images/202209/image_750x500_63243a066b108.jpg", "publishedAt": "2022-09-16T08:58:54Z", "content": "Dengue Prevention Tips: Every year there are many such parts of the country, which definitely come in the grip of mosquito-borne diseases once in a year. Especially after monsoon. There are many dise… [+2303 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "US Researchers Develop Method To Identify Future SARS-Cov-2 Mutations | World - Ommcom News", "description": "Washington: US researchers have developed a method to evaluate how future mutations to SARS-CoV-2 can affect recognition by antibodies used in rapid antigen tests, according to the National Institutes of Health (NIH).As new variants of the SARS-CoV-2", "url": "https://ommcomnews.com/world-news/us-researchers-develop-method-to-identify-future-sars-cov-2-mutations", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/09/16141931/efc15f2fff6797aa8e304af3a10ea3c4-2-e1663318208792.jpg", "publishedAt": "2022-09-16T08:50:20Z", "content": "Washington: US researchers have developed a method to evaluate how future mutations to SARS-CoV-2 can affect recognition by antibodies used in rapid antigen tests, according to the National Institute… [+1077 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Maryland: UMD Researcher Develops Nasal COVID Vaccine - India Education Diary", "description": "Getting that jab—more accurately, a succession of them—has been the main weapon against serious COVID-19 complications since late 2020, but if a University of Maryland researcher succeeds, all those needles could give way to a few quick sniffs.Xiaopi", "url": "https://indiaeducationdiary.in/university-of-maryland-umd-researcher-develops-nasal-covid-vaccine/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Maryland.png?fit=1024%2C512&ssl=1", "publishedAt": "2022-09-16T08:46:00Z", "content": "Getting that jabmore accurately, a succession of themhas been the main weapon against serious COVID-19 complications since late 2020, but if a University of Maryland researcher succeeds, all those ne… [+2337 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "US CDC launches monkeypox vaccine equity program - ETHealthWorld", "description": "Tribal governments and local non-governmental organisations, can partner together and begin submitting requests to access monkeypox vaccine through the programme.", "url": "https://health.economictimes.indiatimes.com/news/pharma/us-cdc-launches-monkeypox-vaccine-equity-program/94237784", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94237784,imgsize-19358,width-1200,height-628,overlay-ethealthworld/us-cdc-launches-monkeypox-vaccine-equity-program.jpg", "publishedAt": "2022-09-16T05:45:00Z", "content": "Los Angeles: The US Centers for Disease Control and Prevention has launched the Monkeypox Vaccine Equity Pilot programme to support innovative, non-traditional ways to address disparities in monkeypo… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Should diabetics add a dose of healthy fats, protein to their fruit bowl? - The Indian Express", "description": "One approach for a person with diabetes to choose safe and suitable fruit is to check their glycaemic index (GI) levels", "url": "https://indianexpress.com/article/lifestyle/health/diabetics-fruits-fats-protein-blood-sugar-spike-glycaemic-load-8138725/", "urlToImage": "https://images.indianexpress.com/2022/09/diabetes_fruit_200_gettu.jpg", "publishedAt": "2022-09-16T05:20:51Z", "content": "Fruits are extremely nutritious, but those with diabetesmust exercise caution while having them. This is because eating certain fruits can raise blood sugar levels which can be detrimental to their h… [+6338 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Commonly used prostate cancer treatment rewires engine of prostate tumors: Research - Medical Dialogues", "description": "Drugs like enzalutamide that inhibit male hormones from activating the androgen receptor have been...", "url": "https://medicaldialogues.in/mdtv/oncology/videos/commonly-used-prostate-cancer-treatment-rewires-engine-of-prostate-tumors-research-99216", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/16/185709-blur-background-42.jpg", "publishedAt": "2022-09-16T03:45:09Z", "content": "Isra Zaman\r\nB.Sc Life Sciences, M.Sc Biotechnology, B.Ed"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Saumya Kalia", "title": "HPV Vaccines Can Save People's Lives. Why Is Awareness, Access Still So Low? - The Swaddle", "description": "The immunization challenges with cervical cancer are reflective of systemic anxiety around women’s sexual and menstrual health.", "url": "https://theswaddle.com/hpv-vaccines-can-save-peoples-lives-why-is-awareness-access-still-so-low/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/09/150922_hpv-editorial.gif", "publishedAt": "2022-09-16T02:10:39Z", "content": "Zeisha was 29 when her gynecologist told her about the human papillomavirus (HPV) vaccine. She paid Rs. 10,480 for one dose of Gardasil 9, the only vaccine available in a private hospital near her ho… [+14617 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Vitamin D3 drops in kids, doctors advise few hours under Sun - The New Indian Express", "description": "Survey finds deficiency root cause of progressive myopia in children", "url": "https://www.newindianexpress.com/cities/bengaluru/2022/sep/16/vitamin-d3-drops-in-kids-doctors-advise-few-hours-under-sun-2498736.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/9/16/w600X390/vitamin_D.JPG", "publishedAt": "2022-09-16T01:17:00Z", "content": "BENGALURU: Limited outdoor activities and minimal exposure to sunlight due to the pandemic, which confined people to their homes in the past two-and-half years, has led to Vitamin D3 deficiency, whic… [+3500 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Healthy older people show greater mental well-being but poorer cognition than younger adults - News-Medical.Net", "description": "The young and old could learn a thing or two from each other, at least when it comes to mental health and cognition.", "url": "https://www.news-medical.net/news/20220915/Healthy-older-people-show-greater-mental-well-being-but-poorer-cognition-than-younger-adults.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Abstract_medicine_background-Hilch-1000_f0a8c263e6e04ed18dfcc5ef27c17907-620x480.jpg", "publishedAt": "2022-09-16T00:15:00Z", "content": "The young and old could learn a thing or two from each other, at least when it comes to mental health and cognition.\r\nIn a new study, published September 12, 2022 in Psychology and Aging, researchers… [+3404 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Jay Croft", "title": "CDC to Test Community Sewage for Polio Virus - WebMD", "description": "The CDC is planning to test sewage in communities deemed at risk for polio since a case was discovered in Rockland County, New Jersey, in July. The virus has been detected in wastewater samples in several nearby communities.", "url": "https://www.webmd.com/a-to-z-guides/news/20220915/cdc-tests-community-sewage-for-polio", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/news/2022/07_2022/polio_vaccine/1800x1200_polio_vaccine.jpg", "publishedAt": "2022-09-15T23:54:36Z", "content": "Sept. 15, 2022 -- Polio was one of the most feared diseases in the United States, annually paralyzing thousands of people, until it was declared eliminated by vaccination in 1979.\r\nNow, the CDC is pl… [+1613 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "New evidence that air pollution contributes substantially to lung cancer - The Lancet", "description": "Data from a breakthrough study in understanding how air pollution can lead to lung\ncancer, presented at the European Society of Medical Oncology congress on Sept 9–13,\n2022, promise to revolutionise the field of oncology and approaches to public health.", "url": "https://www.thelancet.com/journals/lanonc/article/PIIS1470-2045(22)00569-1/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/31289642-44ce-4225-8848-bfd8eea2dad7/fx1.jpg", "publishedAt": "2022-09-15T22:37:34Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Nanoplatforms in Imaging-Guided Brain Tumor Treatment - AZoNano", "description": "An article published in the journal Advanced Drug Delivery Reviews presented a summary of state-of-art near-infrared contrast agents (CAs) and optical imaging-guided therapies for brain tumor imaging.", "url": "https://www.azonano.com/news.aspx?newsID=39682", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39682_16632616476114276.jpg", "publishedAt": "2022-09-15T17:10:00Z", "content": "Malignant brain tumors are cancerous growth in the brain with the possibility of spreading to other parts of the central nervous system (CNS). Brain tumors are highly invasive and have devastating co… [+6270 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Joyce Meyer Keto Gummies And Blake Lively Keto Gummies Reviews Exposed Risk Alert 2022 - The Tribune India", "description": "Joyce Meyer Keto Gummies Blake Lively Keto Gummies are recommended fat burners that effectively help to shed stubborn pounds in a miraculous way. Basically, these are chewable candy bear gummies that support your internal, and external well-being along with r…", "url": "https://www.tribuneindia.com/news/brand-connect/joyce-meyer-keto-gummies-and-blake-lively-keto-gummies-reviews-exposed-risk-alert-2022-432082", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1527554353.jpg", "publishedAt": "2022-09-15T17:06:00Z", "content": "Joyce Meyer Keto Gummies Blake Lively Keto Gummies are recommended fat burners that effectively help to shed stubborn pounds in a miraculous way. Basically, these are chewable candy bear gummies that… [+8327 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "282 People Has Been Receiving Treatment For H1N1 Flu In Tamil Nadu - The Hans India", "description": "A total of 282 people have tested positive for H1N1 influenza and are currently receiving treatment...", "url": "https://www.thehansindia.com/tamilnadu/282-people-has-been-receiving-treatment-for-h1n1-flu-in-tamil-nadu-761870", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/09/15/1312494-tamil-nadu.jpg", "publishedAt": "2022-09-15T16:45:00Z", "content": "According to Health Minister Ma. Subramanian on Thursday, a total of 282 people have tested positive for H1N1 influenza and are currently receiving treatment throughout the State.\r\nThe Minister state… [+1334 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "U.S. seeing decline in monkeypox new case growth, CDC says - Devdiscourse", "description": "U.S. Centers of Disease Control and Prevention (CDC) Director Rochelle Walensky said on Thursday she was cautiously optimistic over a decline in the growth of new monkeypox cases, but that some areas of the country are still experiencing a rise in infections.", "url": "https://www.devdiscourse.com/article/health/2180046-us-seeing-decline-in-monkeypox-new-case-growth-cdc-says", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_07_2021_07_31_53_3427505.jpg?width=920&format=jpeg", "publishedAt": "2022-09-15T16:27:07Z", "content": "U.S. Centers of Disease Control and Prevention (CDC) Director RochelleWalensky said on Thursday she was cautiously optimistic over a decline in the growth of new monkeypox cases, but that some areas … [+2132 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Topical ointment made from tree sap found to be effective in treating skin wound infections - Medical Xpress", "description": "A team of researchers affiliated with multiple institutions in the U.K. and Australia has developed a nontraditional ointment to treat skin wound infections based on a molecule found in the sap of a Queensland blushwood tree. The study is published in the jou…", "url": "https://medicalxpress.com/news/2022-09-topical-ointment-tree-sap-effective.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/topical-ointment-made.jpg", "publishedAt": "2022-09-15T14:50:01Z", "content": "A team of researchers affiliated with multiple institutions in the U.K. and Australia has developed a nontraditional ointment to treat skin wound infections based on a molecule found in the sap of a … [+2482 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Alcohol's single dose enough to permanently alter brain, cause addiction: Study - Hindustan Times", "description": "Findings of a new study imply that even a single drinking incident might lay the foundation for alcohol addiction and permanently alter brain by changing the shape of the nerve cells | Health", "url": "https://www.hindustantimes.com/lifestyle/health/alcohols-single-dose-may-be-enough-to-permanently-alter-brain-cause-addiction-study-101663251825010.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/15/1600x900/52e85cd8-4647-11ec-8579-24eef716c065_1637003544932_1663252721334_1663252721334.jpg", "publishedAt": "2022-09-15T14:41:28Z", "content": "Even a single exposure to alcohol may permanently change the shape of nerve cells and lead to addiction, according to a study conducted in animals.\r\nNeurons or nerve cells are the fundamental units o… [+2756 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Some of the Most Common Medications Can Cause Permanent Side Effects in Children - SciTechDaily", "description": "A new study has found that early exposure to antibiotics can cause permanent asthma and allergies. A recent study demonstrates that early exposure to antibiotics destroys beneficial bacteria in the digestive system and can cause asthma and allergies. The rese…", "url": "https://scitechdaily.com/some-of-the-most-common-medications-can-cause-permanent-side-effects-in-children/", "urlToImage": "https://scitechdaily.com/images/Prescription-Medication-Concept.jpg", "publishedAt": "2022-09-15T13:52:28Z", "content": "The new study provides strong evidence that antibiotics cause unwanted immune responses.\r\nA new study has found that early exposure to antibiotics can cause permanent asthma and allergies.\r\nA recent … [+3397 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Biotics 8 Reviews: Beware Of The Ingredients And Interactions Before Buying It - The Tribune India", "description": "Live bacteria called probiotics are beneficial to health in the general and the digestive system in particular. Typically, people associate germs with the development of illnesses. But there are both beneficial and dangerous germs all over the body. Because t…", "url": "https://www.tribuneindia.com/news/brand-connect/biotics-8-reviews-beware-of-the-ingredients-and-interactions-before-buying-it-432042", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_2045326034.jpg", "publishedAt": "2022-09-15T11:45:00Z", "content": "Live bacteria called probiotics are beneficial to health in the general and the digestive system in particular. Typically, people associate germs with the development of illnesses. But there are both… [+10625 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Nerve Renew Review: Beware Of The Ingredients And Interactions Before Buying It - The Tribune India", "description": "Aging is unavoidable, but the consequences can be rather distressing. People's bodies become less capable of supporting an active lifestyle as they age. Even simple tasks like climbing stairs and walking in the park might become difficult as we age. When it c…", "url": "https://www.tribuneindia.com/news/brand-connect/nerve-renew-review-beware-of-the-ingredients-and-interactions-before-buying-it-432041", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_408688186.jpg", "publishedAt": "2022-09-15T11:42:00Z", "content": "Aging is unavoidable, but the consequences can be rather distressing. People's bodies become less capable of supporting an active lifestyle as they age. Even simple tasks like climbing stairs and wal… [+10271 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Two things to watch out for if you are experiencing hair loss - The Indian Express", "description": "Hair fall and loss of volume could be a result of an underlying health condition, or it could be caused by dietary deficiencies", "url": "https://indianexpress.com/article/lifestyle/life-style/experiencing-hair-loss-hair-fall-thinning-diet-health-8095999/", "urlToImage": "https://images.indianexpress.com/2022/08/Getty-hair_loss_1200-1.jpg", "publishedAt": "2022-09-15T10:20:12Z", "content": "Hair falland hair loss have become quite common among both men and women. Many people have been losing large clumps of hair on a daily basis, resulting in low self-esteem, panic, stress and more hair… [+1279 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stress At Work? Follow These 7 Tips To Relax Yourself Mentally & Physically While At Work - NDTV", "description": "Work Stress: In this article, we list tips that can help you lower your work stress and improve your physical and mental health.", "url": "https://www.ndtv.com/health/stress-at-work-follow-these-7-tips-to-relax-yourself-mentally-physically-while-at-work-3345512", "urlToImage": "https://c.ndtvimg.com/2022-09/t1h977to_work-place_625x300_07_September_22.jpg", "publishedAt": "2022-09-15T10:00:06Z", "content": "Work Stress: Engaging with colleagues can help reduce work stress and improve mood\r\nIt's normal to have some stress, especially when a deadline or difficult assignment is pending. However, if work st… [+3499 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Prognostic Biomarker for Heart Failure Identified - Technology Networks", "description": "According to a study, bloodstream levels of endotrophin, a protein fragment, can be used to predict outcomes in patients with a common form of heart failure.", "url": "https://www.technologynetworks.com/diagnostics/news/new-prognostic-biomarker-for-heart-failure-identified-365708", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/365708/new-prognostic-biomarker-for-heart-failure-identified-365708-640x360.jpg?cb=20220915", "publishedAt": "2022-09-15T09:09:28Z", "content": "Bloodstream levels of a protein fragment called endotrophin can be used to predict outcomes in patients with a common form of heart failure, according to a study co-led by researchers at the Perelman… [+5098 chars]"}, {"source": {"id": null, "name": "Adgully.com"}, "author": "Adgully Bureau", "title": "Elda Health launches first Ad campaign on menopause - Adgully", "description": "Elda Health, India’s first and only full-stack, one-stop digital FemTech health start-up catering to women during their menopausal and pre-menopausal years, is urging women to #PressPlay on conversations around menopause.", "url": "https://www.adgully.com/elda-health-launches-first-ad-campaign-on-menopause-122709.html", "urlToImage": "https://www.adgully.com/img/800/202209/elda.png.jpg", "publishedAt": "2022-09-15T08:15:00Z", "content": "Elda Health, India’s first and only full-stack, one-stop digital FemTech health start-up catering to women during their menopausal and pre-menopausal years, is urging women to #PressPlay on conversat… [+1937 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "These 3 zero-calorie sweeteners raise risk of heart disease | Mint - Mint", "description": "A recent study conducted by The BMJ shows that the people who were higher consumers of artificial sweeteners had an increased risk of cardiovascular disease, including stroke compared to the non-consumers.", "url": "https://www.livemint.com/science/health/these-3-zero-calorie-sweeteners-raise-risk-of-cardiovascular-disease-11663223671891.html", "urlToImage": "https://images.livemint.com/img/2022/09/15/600x338/Artificial_sweeteners_1663228946927_1663228947129_1663228947129.jpg", "publishedAt": "2022-09-15T08:03:31Z", "content": "We have often seen people use artificial sweeteners to reduce calorie intake. But are these artificial sweeteners really helpful?  A recent study conducted by The BMJ shows that the people who were h… [+4513 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Asian News International", "title": "Women’s mental health more sensitive to exercise than men’s during pandemic - The Siasat Daily", "description": "Women are more likely than men to report experiencing stress, which shows that they have a lower stress tolerance", "url": "https://www.siasat.com/womens-mental-health-more-sensitive-to-exercise-than-mens-during-pandemic-2413026/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/09/life-style-waking.jpg", "publishedAt": "2022-09-15T03:10:00Z", "content": "New York : According to recent research from Binghamton University, the State University of New York, women’s mental health during the COVID-19 pandemic was more likely to be impacted by physical act… [+2851 chars]"}]}