{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "US may face more monkeypox cases before numbers go down - ThePrint", "description": "Washington [US], July 23 (ANI/Xinhua): The United States may see more cases of monkeypox before the numbers go down, Director of the Centers for Disease Control and Prevention (CDC) Rochelle Walensky said on Friday. “With the scale-up of testing, with the sca…", "url": "https://theprint.in/world/us-may-face-more-monkeypox-cases-before-numbers-go-down/1052208/", "urlToImage": null, "publishedAt": "2022-07-23T13:13:04Z", "content": "Washington [US], July 23 (ANI/Xinhua): The United States may see more cases of monkeypox before the numbers go down, Director of the Centers for Disease Control and Prevention (CDC) Rochelle Walensky… [+1903 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "'Dracula on the move': Video of bat swarming stuns netizens - The Indian Express", "description": "The viral video that shows a swarm of bats flying together was reportedly shot in Cueva de los Murciélagos in Mexico.", "url": "https://indianexpress.com/article/trending/trending-in-india/video-of-bat-swarming-stuns-netizens-8047750/", "urlToImage": "https://images.indianexpress.com/2022/07/bats-mexico.jpg", "publishedAt": "2022-07-23T12:52:36Z", "content": "Bats are one of the most fascinating mammals in the world. A viral video of the nocturnal creatures flying in a large group has only added to the mystique that surrounds them.The undated video, recor… [+2766 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Manzoor-ul-Hassan", "title": "Children at risk of developing long COVID: Study - NewsBytes", "description": "There is a link between children who contracted COVID-19 and subsequently showed signs of long COVID, a recent study found", "url": "https://www.newsbytesapp.com/news/world/new-study-about-long-covid-in-children/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l74420220723135900.jpeg", "publishedAt": "2022-07-23T11:38:08Z", "content": "Children at risk of developing long COVID-19: Study\r\nWritten byManzoor-ul-Hassan\r\nJul 23, 2022, 05:08 pm2 min read\r\nThere is a link between children who contracted COVID-19 and subsequently showed si… [+2240 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "WHO will most likely declare Monkeypox a global health emergency: Report | Mint - Mint", "description": "In recent weeks, pressure has been increasing from scientists and public health experts for the WHO and national governments to take more action on Monkeypox", "url": "https://www.livemint.com/news/world/who-will-most-likely-declare-monkeypox-a-global-health-emergency-report-11658571360863.html", "urlToImage": "https://images.livemint.com/img/2022/07/23/600x338/Monkeypox_1658542920498_1658574692305_1658574692305.jpg", "publishedAt": "2022-07-23T11:14:24Z", "content": "The World Health Organisation (WHO) may designate Monkeypox a global health emergency even though the global body's expert group is split over the decision, reported news agency Reuters, quoting sour… [+2343 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "PTI", "title": "Depression: low serotonin may not be the cause – but antidepressants still work - ThePrint", "description": "London, Jul 23 (The Conversation) A recent study found inconsistent evidence linking the neurotransmitter serotonin to depression. In an article for The Conversation, the authors of the study concluded that it is impossible to say that taking SSRI antidepress…", "url": "https://theprint.in/world/depression-low-serotonin-may-not-be-the-cause-but-antidepressants-still-work/1052031/", "urlToImage": null, "publishedAt": "2022-07-23T11:01:15Z", "content": "London, Jul 23 (The Conversation) A recent study found inconsistent evidence linking the neurotransmitter serotonin to depression.\r\n In an article for The Conversation, the authors of the study concl… [+4935 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "PTI", "title": "Polio in New York – an infectious disease doctor explains this exceedingly rare occurrence - ThePrint", "description": "Virginia (US), Jul 23 (The Conversation) The first case of polio in the US since 2013 was announced by New York state health officials on July 21 this year. The US resident had not been vaccinated. Polio was a common cause of paralysis in children before safe…", "url": "https://theprint.in/world/polio-in-new-york-an-infectious-disease-doctor-explains-this-exceedingly-rare-occurrence/1052027/", "urlToImage": null, "publishedAt": "2022-07-23T11:00:42Z", "content": "Virginia (US), Jul 23 (The Conversation) The first case of polio in the US since 2013 was announced by New York state health officials on July 21 this year. The US resident had not been vaccinated.\r\n… [+4684 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Monkeypox claims new victims: the outbreak in men who have sex with men - Infectious Diseases of Poverty - Infectious Diseases of Poverty - BioMed Central", "description": "Monkeypox has a very prominent regional epidemic. It has been confined to Western and Central African countries. Sporadic cases found in countries outside Africa generally have a history of sojourn in endemic areas. However, the recent multinational outbreak …", "url": "https://idpjournal.biomedcentral.com/articles/10.1186/s40249-022-01007-6", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/40249.jpg", "publishedAt": "2022-07-23T10:26:06Z", "content": null}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Effectiveness of indoor residual spraying on malaria control: a systematic review and meta-analysis - Infectious Diseases of Poverty - Infectious Diseases of Poverty - BioMed Central", "description": "Background Indoor residual spraying (IRS) is one of the key interventions recommended by World Health Organization in preventing malaria infection. We aimed to conduct a systematic review and meta-analysis of global studies about the impact of IRS on malaria …", "url": "https://idpjournal.biomedcentral.com/articles/10.1186/s40249-022-01005-8", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/40249.jpg", "publishedAt": "2022-07-23T10:26:06Z", "content": null}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "How to prevent kids from getting infected with monkeypox - CNBCTV18", "description": "While adults can receive the Jynneos vaccine, a vaccine for smallpox, for prevention, children are at higher risk of both contracting the disease and developing severe symptoms as a result.", "url": "https://www.cnbctv18.com/healthcare/how-to-prevent-children-from-getting-infected-with-monkeypox-14228522.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/05/MONKEYPOX-GERMANY-1019x573.jpg", "publishedAt": "2022-07-23T09:48:00Z", "content": "MiniWhile adults can receive the Jynneos vaccine, a vaccine for smallpox, for prevention, children are at higher risk of both contracting the disease and developing severe symptoms as a result."}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Should Diabetic People Consume Pineapple? Here Is What You Should Know - News18", "description": "Consuming pineapples in moderation will cause no harm to diabetic patients", "url": "https://www.news18.com/news/lifestyle/should-diabetic-people-consume-pineapple-here-is-what-you-should-know-5600029.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/shutterstock_1403484713-165856388016x9.jpg", "publishedAt": "2022-07-23T09:30:59Z", "content": "Pineapples are one of those fruits that can give you an instant punch of freshness and tanginess with just a bite. The juicy fruit is low in calories and can be enjoyed guilt-free. But people with di… [+1849 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Reading: Vitamin B6 supplements could reduce anxiety and depression - India Education Diary", "description": "Taking high-dose Vitamin B6 tablets has been shown to reduce feelings of anxiety and depression by new research.Scientists at the University of Reading measured the impact of high doses of Vitamin B6 on young adults and found that they reported feeli", "url": "https://indiaeducationdiary.in/university-of-reading-vitamin-b6-supplements-could-reduce-anxiety-and-depression/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/01/download.png", "publishedAt": "2022-07-23T09:28:03Z", "content": "Taking high-dose Vitamin B6 tablets has been shown to reduce feelings of anxiety and depression by new research.\r\nScientists at the University of Reading measured the impact of high doses of Vitamin … [+3223 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "Dr. Saurabh Pokhariyal", "title": "Can diabetes and high blood pressure lead to kidney failure? - Free Press Journal", "description": "", "url": "https://www.freepressjournal.in/health/can-diabetes-and-high-blood-pressure-lead-to-kidney-failure-2", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-07/44e11469-f708-46a4-bb86-0e47f73d8b11/KIDNEY_2.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-07-23T09:26:00Z", "content": "Healthy kidneys in a human body are responsible for the filtering of excess fluid and waste from blood. However, diabetes and high blood pressure can have a significant impact on the functioning of t… [+3241 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Primary Isoniazid Mono-Resistant Pulmonary Tuberculosis in a COVID-19-Positive Male: World's First Case of Its Kind in the Present Pandemic - Cureus", "description": "The coronavirus disease 2019 (COVID-19) pandemic has resulted in numerous rare presentations of common diseases. The diseases that were prevalent for a long time like tuberculosis (TB) have been reported in cases of COVID-19. The reports of drug-sensitive, mu…", "url": "https://www.cureus.com/articles/104695-primary-isoniazid-mono-resistant-pulmonary-tuberculosis-in-a-covid-19-positive-male-worlds-first-case-of-its-kind-in-the-present-pandemic", "urlToImage": "https://assets.cureus.com/uploads/figure/file/405332/article_river_9e02f140fe0411ecb590b529010f129d-apm7r-l56ex.png", "publishedAt": "2022-07-23T08:52:18Z", "content": "Tuberculosis (TB) is a major public health problem and has been known for ages [1]. Nearly one-fourth of the worlds population is infected with Mycobacterium tuberculosis (MTB) [1]. Thereby making it… [+9514 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "New York Times", "title": "What to know about Marburg virus disease - Moneycontrol", "description": "Ghana announced the country’s first outbreak of Marburg virus disease after two people who were not related died June 27 and 28.", "url": "https://www.moneycontrol.com/news/health-and-fitness/what-to-know-about-marburg-virus-disease-8874421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/Collage-Maker-19-Jul-2022-12.33-PM-770x435.jpg", "publishedAt": "2022-07-23T08:34:29Z", "content": "Ghana announced the countrys first outbreak of Marburg virus disease after two people who were not related died June 27 and 28. Word of a new outbreak of a lethal disease caused by viral infections a… [+5382 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Is there a link between diabetes and frozen shoulder? - The Indian Express", "description": "When sugar attaches to collagen, it becomes sticky, restricting mobility and causing your shoulder to stiffen", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-frozen-shoulder-link-relation-health-8044098/", "urlToImage": "https://images.indianexpress.com/2022/07/frozen-shoulder.jpg", "publishedAt": "2022-07-23T07:50:03Z", "content": "“Frozen shoulder is a disorder that causes stiffness and discomfort in the shoulder joint. Frozen shoulder, also known as adhesive capsulitis, occurs when the connective tissue around the shoulder jo… [+4698 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Weight loss tips: Wear THIS to shed lose extra kilos and get fit, suggests study! - Zee News", "description": "Millions of people worldwide believe that fitness trackers, pedometers and smart watches motivate them to exercise more and lose weight, according to a new study by Australian researchers. The findings of the research were published in Lancet Digital Health.", "url": "https://zeenews.india.com/health/looking-to-lose-weight-wear-this-to-shed-lose-extra-kilos-and-get-fit-control-type-2-diabetes-blood-sugar-blood-pressure-2488794", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/07/23/1068518-activity-tracker-pixabay.jpg", "publishedAt": "2022-07-23T07:47:30Z", "content": "Adelaide (Australia): Millions of people worldwide believe that fitness trackers, pedometers and smart watches motivate them to exercise more and lose weight, according to a new study by Australian r… [+2503 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Want to boost happy hormones? Try these amazing nutrition hacks - Hindustan Times", "description": "Feeling low? You may want to try these amazing nutrition tricks shared by an expert that could activate those happy hormones and make you feel much better about the world around you. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/want-to-boost-happy-hormones-try-these-amazing-nutrition-hacks-101658559867322.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/23/1600x900/happy_hormone_thumb_1658560764203_1658560773138_1658560773138.jpg", "publishedAt": "2022-07-23T07:22:15Z", "content": "There are days when you feel so miserable that you just can't force yourself out of the bed, and on others you are ready to face the world with much enthusiasm and energy. As the scientific evidence … [+2761 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Food Items to Increase Collagen Level in body - News18", "description": "Instead of using supplements, it is advised to increase the collagen level in a natural way", "url": "https://www.news18.com/news/lifestyle/5-food-items-to-increase-collagen-level-in-body-5598649.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/untitled-1-23-164251140816x9.jpg", "publishedAt": "2022-07-23T06:45:52Z", "content": "Collagens are broken into amino acids, which help in improving skin cells.\r\nOur skin cells undergo wear and tear regularly due to many reasons. The environmental factors like scorching sun, air pollu… [+2304 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Diet Plan For Weight Gain: 5 Foods To Gain Weight in a Healthy Way - India.com", "description": "If you're looking for the best diet plan to gain weight, you've come to the right place. Read on to know about foods that you should add in your diet for healthy weight gain.", "url": "https://www.india.com/lifestyle/weight-gain-diet-plan-5-foods-to-gain-weight-in-a-healthy-way-5529935/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/07/WhatsApp-Image-2022-07-23-at-12.12.31-PM.jpeg", "publishedAt": "2022-07-23T06:45:34Z", "content": "Weight Gain Hacks: If you think bulking up on junk food or white foods like pastries, cookies, ice cream will help you gain weight quickly, then its not. These calorie-dense foods will undoubtedly he… [+2103 chars]"}, {"source": {"id": null, "name": "IWMBuzz"}, "author": "Pretesh Dbritto", "title": "The Lancet study reveals the amount of alcohol to drink - IWMBuzz", "description": "Check out how much people should drink alcohol and at what limit", "url": "https://www.iwmbuzz.com/lifestyle/the-lancet-study-reveals-the-amount-of-alcohol-to-drink/2022/07/23", "urlToImage": "https://www.iwmbuzz.com/wp-content/uploads/2022/07/the-lancet-study-reveals-the-amount-of-alcohol-to-drink.jpg", "publishedAt": "2022-07-23T06:15:08Z", "content": "If you occasionally consume alcohol and are wondering how much alcohol is healthy for you, this news will undoubtedly be of assistance. Alcohol use according to age was the subject of recent studies.… [+1829 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Could pollution increase the risk of diabetes in embryos? - Mint Lounge", "description": "New research has found that early exposure to environmental pollution could lead to diabetes later in life", "url": "https://lifestyle.livemint.com/health/wellness/could-pollution-increase-the-risk-of-diabetes-in-embryos-111658550723152.html", "urlToImage": "https://images.livemint.com/img/2022/07/23/1140x641/julia-koblitz-jpv1XVDRWn0-unsplash_1658552963926_1658552975497_1658552975497.jpg", "publishedAt": "2022-07-23T05:37:38Z", "content": "The School of Public Health and Health Sciences' Alicia Timme-Laragy, an associate professor, studies the effects of early life exposures to two common per- and polyfluoroalkylated substances (PFAS) … [+2659 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Study warns against FOODS that can increase breast cancer risk by 20% - Times of India", "description": "Breast cancer is the second most common cancer in women after skin cancer. Besides genetic or family history of cancers, age, obesity and other non-modifiable risk factors, your lifestyle also plays a significant role in increasing or reducing your risk of br…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/study-warns-against-foods-that-can-increase-breast-cancer-risk-by-20/photostory/93052940.cms", "urlToImage": "https://static.toiimg.com/photo/93052958.cms", "publishedAt": "2022-07-23T05:30:00Z", "content": "When it comes to carbohydrates, you must note that there are three main types of carbs: Sugars, starches and fiber.\r\nSugars are also called simple carbohydrates, found in common 'unhealthy' foods suc… [+787 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Avocados and Bananas may reduce high-salt effect in women than in men: Study - Times Now", "description": "When the association was analysed according to sodium intake (low/medium/high), the relationship between potassium and blood pressure was only observed in women with high sodium intake, where every 1 gram increase in daily potassium was associated with a 2.4 …", "url": "https://www.timesnownews.com/health/avocados-and-bananas-may-reduce-high-salt-effect-in-women-than-in-men-study-article-93067229", "urlToImage": "https://static.tnn.in/thumb/msid-93067229,imgsize-100,width-1280,height-720,resizemode-75/93067229.jpg", "publishedAt": "2022-07-23T05:18:09Z", "content": "In the midst of Sushmita Sen, Lalit Modi's romance, here's a look at latter's super luxurious London home"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers in US developing fast, efficient COVID-19 biosensor - ETHealthWorld", "description": "Researchers from the School of Science at IUPUI are working to create a new biosensor that could meet the future COVID-19 testing requirements for speed and efficiency in order to help tackle this issue.", "url": "https://health.economictimes.indiatimes.com/news/medical-devices/researchers-in-us-developing-fast-efficient-covid-19-biosensor/93066947", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93066947,imgsize-79708,width-1200,height-628,overlay-ethealthworld/researchers-in-us-developing-fast-efficient-covid-19-biosensor.jpg", "publishedAt": "2022-07-23T05:15:00Z", "content": "Indiana: Health professionals are increasingly ready for a future in which COVID-19 variations develop, surge, and fade similarly to seasonal flu as the BA.5 omicron variant spreads. The ability to i… [+4191 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Nasal sprays will be essential to tackle COVID-19 variants, study says - EastMojo", "description": "Washington: Intranasal vaccines for COVID-19 will be critical to protect people against the emerging variants of concern of the SARS-CoV-2 virus,", "url": "http://www.eastmojo.com/coronavirus-updates/2022/07/23/nasal-sprays-will-be-essential-to-tackle-covid-19-variants-study-says/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/07/Untitled-design-2022-07-14T135929.758.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2022-07-23T05:10:56Z", "content": "Washington: Intranasal vaccines for COVID-19 will be critical to protect people against the emerging variants of concern of the SARS-CoV-2 virus, according to a study.\r\nResearchers at the University … [+4617 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "The Effect of Structured Education Training Program on Oral Health Awareness Among School-Going Children of Central India: A Cross-Sectional Study - Cureus", "description": "Background\n\nIn order to curb the ever-increasing load of diseases related to the oral cavity, there is a call for generating organized school-based oral health education and training programs. It is proposed that there will be an emphasis on the primary care …", "url": "https://www.cureus.com/articles/104661-the-effect-of-structured-education-training-program-on-oral-health-awareness-among-school-going-children-of-central-india-a-cross-sectional-study", "urlToImage": "https://assets.cureus.com/uploads/figure/file/405279/article_river_66292e40f91f11ecbe23b7d7b72295ad-Sh-Graph-1.png", "publishedAt": "2022-07-23T04:57:57Z", "content": "Background\r\nIn order to curb the ever-increasing load of diseases related to the oral cavity, there is a call for generating organized school-based oral health education and training programs. It is … [+32897 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "Canada confirms 681 infections of monkeypox; 331 reported from Quebec - Business Standard", "description": "The Public Health Agency of Canada PHAC has updated the number of confirmed cases of monkeypox in the country to 681", "url": "https://www.business-standard.com/article/international/canada-confirms-681-infections-of-monkeypox-331-reported-from-quebec-122072300103_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/21/full/1653135173-5251.jpg", "publishedAt": "2022-07-23T04:04:00Z", "content": "The Public Health Agency of Canada (PHAC) has updated the number of confirmed cases of monkeypox in the country to 681.\r\nThe cases included 331 from Quebec, 288 from Ontario, 48 from British Columbia… [+2360 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Boost your immunity with amla this monsoon; know many ways of consuming it - Hindustan Times", "description": "Amla is the perfect immunity-booster to prevent seasonal infections this monsoon. Here are various ways of consuming this potent fruit. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/boost-your-immunity-with-amla-this-monsoon-know-many-ways-of-consuming-it-101658545829611.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/23/1600x900/amla_murabba_1635674409263_1658545918429_1658545918429.jpg", "publishedAt": "2022-07-23T03:16:58Z", "content": "Amla or Indian gooseberry, considered a powerful and rejuvenating fruit in Ayurveda, is one of the most effective immunity-boosters in all seasons. The sweet and sour fruit has high levels of antioxi… [+2260 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Thousands of monkeypox vaccine appointments booked quickly in NYC - CBS New York", "description": "New York City opened up another round of monkeypox vaccine appointments Friday, and once again, they were booked within minutes. CBS2's Alecia Reid explains ...", "url": "https://www.youtube.com/watch?v=ln8XeylK56I", "urlToImage": "https://i.ytimg.com/vi/ln8XeylK56I/hqdefault.jpg", "publishedAt": "2022-07-23T03:16:34Z", "content": null}, {"source": {"id": null, "name": "The Shillong Times"}, "author": "Agencies", "title": "Portugal starts vaccination against Monkeypox - The Shillong Times", "description": "Lisbon, July 22 : Portugal started the vaccination for those who had contact with the confirmed cases of the Monkeypox virus, said the Portuguese Directorate-General of Health (DGS).The Portuguese Health authority on Thursday had confirmed a total of", "url": "https://theshillongtimes.com/2022/07/23/portugal-starts-vaccination-against-monkeypox/", "urlToImage": "https://theshillongtimes.com/wp-content/uploads/2022/07/Monkeypox.jpg", "publishedAt": "2022-07-23T03:02:40Z", "content": "Lisbon, July 22 : Portugal started the vaccination for those who had contact with the confirmed cases of the Monkeypox virus, said the Portuguese Directorate-General of Health (DGS).\r\nThe Portuguese … [+538 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Potential target for Type 1 diabetes treatment: A new pathway to the regeneration of insulin in pancreatic stem cells could mean a major breakthrough toward new therapies for Type 1 and Type 2 diabetes - Science Daily", "description": "Scientists have discovered a pathway to the regeneration of insulin in pancreatic stem cells, a major breakthrough toward new therapies to treat Type 1 and Type 2 diabetes. Using the pancreas stem cells of a type 1 diabetic donor, researchers were able to eff…", "url": "https://www.sciencedaily.com/releases/2022/07/220722082419.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-07-22T23:43:19Z", "content": "A world-first study by Monash University, in Melbourne, Australia has discovered a pathway to the regeneration of insulin in pancreatic stem cells, a major breakthrough toward new therapies to treat … [+3287 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "This is Now (July 22, 2022) - Hawaii News Now", "description": "The state Department of Health has identified three additional cases of monkeypox in the state.This brings the total number of cases in Hawaii to 11.Accordin...", "url": "https://www.youtube.com/watch?v=wTnP_7X3Kqs", "urlToImage": "https://i.ytimg.com/vi/wTnP_7X3Kqs/maxresdefault.jpg", "publishedAt": "2022-07-22T23:08:25Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Yes, BA.5 omicron subvariant of COVID-19 is more likely to reinfect people - FOX54 News Huntsville", "description": "BA.5 is now the dominant COVID-19 subvariant in the United States. Here’s why it’s capable of causing more reinfections, according to experts.", "url": "https://www.youtube.com/watch?v=-1mV3XaiHRY", "urlToImage": "https://i.ytimg.com/vi/-1mV3XaiHRY/hqdefault.jpg", "publishedAt": "2022-07-22T22:48:32Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: A new spray coating to protect surfaces from viruses, bacteria - The Indian Express", "description": "The sprayable coating \"can prevent the surface spread of infection from bacteria and viruses, including Covid-19, over a sustained period\", the University of Sydney said in a press release.", "url": "https://indianexpress.com/article/explained/explained-spray-coating-protect-surfaces-viruses-bacteria-8046328/", "urlToImage": "https://images.indianexpress.com/2022/07/surface.jpg", "publishedAt": "2022-07-22T22:45:40Z", "content": "At the beginning of the pandemic, before it became widely accepted that respiratory particles are the primary mode of transmission of Covid-19, the focus was on transmission via contact with surfaces… [+1627 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Plants That Help Control Blood Sugar - Nation World News", "description": "Sugar is an important substance for the functioning of various organs, such as muscles or the brain, thanks to the fact that it is an important source of", "url": "https://nationworldnews.com/plants-that-help-control-blood-sugar/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/07/Plants-that-help-control-blood-sugar.jpg", "publishedAt": "2022-07-22T21:46:13Z", "content": "Sugar is an important substance for the functioning of various organs, such as muscles or the brain, thanks to the fact that it is an important source of energy.\r\nHowever, when its levels are not mai… [+3283 chars]"}, {"source": {"id": null, "name": "Global Citizen"}, "author": null, "title": "Celebrities, Scientists & Nobel Winners Call for Price Caps on 'Life-Saving' HIV Drug - Global Citizen", "description": "“Access to life-saving science cannot and must not be dependent on the passport you hold.”", "url": "https://www.globalcitizen.org/en/content/open-letter-hiv-prevention-injectable-prep/", "urlToImage": "https://media.globalcitizen.org/thumbnails/6a/a0/6aa0b154-a1f4-41a3-9ef3-eee38ca9cc34/hiv-medication-south-africa.jpg__1500x670_q85_ALIAS-hero_image_crop_subsampling-2.jpg", "publishedAt": "2022-07-22T20:22:48Z", "content": "Public figures across various fields and industries signed an open letter on Tuesday, calling on the British drug company ViiV Healthcare to ensure equitable global access to its newly developed HIV … [+5460 chars]"}, {"source": {"id": null, "name": "News.cn"}, "author": "", "title": "Indian state sees rising trend in swine flu cases - Xinhua", "description": "", "url": "https://english.news.cn/20220723/54ed994a4a214e9d93522abfdbb604b2/c.html", "urlToImage": null, "publishedAt": "2022-07-22T17:34:15Z", "content": "MUMBAI, July 22 (Xinhua) -- India's western state of Maharashtra has seen a rising trend in swine flu infection with seven deaths and 142 cases reported so far this year, officials said on Friday.\r\n … [+670 chars]"}, {"source": {"id": null, "name": "Rsna.org"}, "author": null, "title": "Pulmonary Light-Chain Deposition Disease | RadioGraphics - RSNA Publications Online", "description": null, "url": "https://pubs.rsna.org/doi/10.1148/rg.220123", "urlToImage": "https://pubs.rsna.org/na101/home/literatum/publisher/rsna/journals/covergifs/radiographics/cover.png", "publishedAt": "2022-07-22T17:09:36Z", "content": "Can't sign in? Forgot your username?\r\nEnter your email address below and we will send you your username\r\nIf the address matches an existing account you will receive an email with instructions to retr… [+17 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "U.S. Salmonella outbreak linked to pet turtles - CBS Pittsburgh", "description": "A salmonella outbreak has been linked to small turtles, the CDC said.", "url": "https://www.youtube.com/watch?v=uSiyz8q9BCI", "urlToImage": "https://i.ytimg.com/vi/uSiyz8q9BCI/hqdefault.jpg", "publishedAt": "2022-07-22T17:02:00Z", "content": null}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Sakina Fatima", "title": "Third in Gulf, Qatar reports first case of monkeypox - The Siasat Daily", "description": "Qatari Ministry of Public Health on Friday announced the registration of the first confirmed case of “monkeypox”", "url": "https://www.siasat.com/third-in-gulf-qatar-reports-first-case-of-monkeypox-2375170/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/07/IMG_20220722_193610_1200_x_900_pixel.jpg", "publishedAt": "2022-07-22T16:47:00Z", "content": "Doha: The Qatari Ministry of Public Health on Friday announced the registration of the first confirmed case of monkeypox in the country, becoming the third Gulf country to report the disease after th… [+2851 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "The Neurological Disorders Causing the Biggest Health Burden ... - Latest Tweet by World Health - LatestLY", "description": "The latest Tweet by World Health Organization states, 'The neurological disorders causing the biggest health burden are: 🔹#dementia 🔹epilepsy 🔹meningitis 🔹migraine 🔹#stroke Brain health conditions emerge throughout life &amp; are characterized by disrupt…", "url": "https://www.latestly.com/socially/world/the-neurological-disorders-causing-the-biggest-health-burden-latest-tweet-by-world-health-organization-3984495.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/10/World-Health-Organisation-784x441.jpg", "publishedAt": "2022-07-22T16:40:38Z", "content": "The neurological disorders causing the biggest health burden are:#dementiaepilepsymeningitismigraine#stroke\r\nBrain health conditions emerge throughout life &amp; are characterized by disruptions in n… [+653 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Rachel Ann Tee-Melegrito", "title": "Cholesterol ratios: How to calculate them - Medical News Today", "description": "Cholesterol ratios assess a person’s risk of cardiovascular diseases, such as coronary artery disease (CAD), using blood test results.", "url": "https://www.medicalnewstoday.com/articles/cholesterol-ratio-calculator", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/06/eat_and_calculate_cholesterol_ratios_732x549_thumb.jpg", "publishedAt": "2022-07-22T16:21:46Z", "content": "Several formulas, which health experts call cholesterol ratios, calculate important cholesterol indicators for more accurate measurements of a persons risk of stroke and heart attack.\r\nCholesterol is… [+7760 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Vaccines alone aren't enough to combat AMR, claims new WHO report USA - English - USA - PR Newswire", "description": "/PRNewswire/ -- A recent report published by the World Health Organization (WHO) identified vaccines as \"highly effective tools in combating AMR\". Despite...", "url": "https://www.prnewswire.com/in/news-releases/vaccines-alone-aren-t-enough-to-combat-amr-claims-new-who-report-898889794.html", "urlToImage": null, "publishedAt": "2022-07-22T16:20:00Z", "content": "The Global Hygiene Council (GHC) calls for the use of hygiene practices, such as handwashing, alongside vaccinations to prevent the spread of infectious diseases and reduce the impact of antimicrobia… [+2559 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "(ANALYSIS) W.H.O Set to Release First Vaccine In Africa To Curb Malaria - TVC News Nigeria", "description": "Executive Director, Health Emergency Initiative, Paschal Achunine  discuss as W.H.O set to release first vaccine In Africa to curb malaria. #IfeanyiOkowa #ap...", "url": "https://www.youtube.com/watch?v=7NFw52hxLno", "urlToImage": "https://i.ytimg.com/vi/7NFw52hxLno/hqdefault.jpg", "publishedAt": "2022-07-22T15:40:39Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "How much should you WALK to reduce your risk of heart disease - Times of India", "description": "Heart diseases have become extremely prevalent in today's world. It accounts for nearly 17.9 million deaths each year, as per the World Health Organization (WHO). However, as concerning as heart disease sounds, it is as preventable. The simplest way to curb y…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/how-much-should-you-walk-to-reduce-your-risk-of-heart-disease/videoshow/93058943.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/93058943/size-2086203/93058943.jpg", "publishedAt": "2022-07-22T15:06:46Z", "content": "Heart\r\n diseases have become extremely prevalent in today's world. It accounts for nearly 17.9 million deaths each year, as per the World Health\r\n Organization (WHO). However, as concerning as heart … [+484 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Transcranial direct current stimulation improves post-stroke dysphagia: Study - Medical Dialogues", "description": "China: The height and considerable positive impact of transcranial direct current stimulation (tDCS) ...", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/transcranial-direct-current-stimulation-improves-post-stroke-dysphagia-study-96401", "urlToImage": "https://medicaldialogues.in/h-upload/2021/02/26/148705-257497web.jpg", "publishedAt": "2022-07-22T14:15:45Z", "content": "China: The height and considerable positive impact of transcranial direct current stimulation (tDCS) on improving post-stroke dysphagia were recently established by a new study published in Archives … [+3102 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "Was Infected With Monkeypox And Coronavirus Simultaneously, Claims US Man. Read Details - India.com", "description": "Monkeypox has been entrenched for decades in parts of central and western Africa, where diseased wild animals occasionally infect people in rural areas in relatively contained epidemics.", "url": "https://www.india.com/health/was-infected-with-monkeypox-and-coronavirus-simultaneously-claims-us-man-read-details-5528891/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/07/Monkeypox-1.jpg", "publishedAt": "2022-07-22T14:04:22Z", "content": "New Delhi: A man in California, US has claimed that he was infected with coronavirus and monkeypox at the same time, according to a report by WION. Mitcho Thompson said he developed lesions on his bo… [+1956 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Scientists discover clue to contain Lassa virus infection - Daijiworld.com", "description": "New York, Jul 22 (IANS): US researchers have identified the role of a protein that plays a critical role in the progression of Lassa fever, majorly seen in West Africa.\r\nLassa fever is an acute viral haemorrhagic illness, similar to Ebola, that infects people…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=981754", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-07-22T13:57:36Z", "content": "New York, Jul 22 (IANS): US researchers have identified the role of a protein that plays a critical role in the progression of Lassa fever, majorly seen in West Africa.\r\nLassa fever is an acute viral… [+2166 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Amrit B.L.S.", "title": "Alzheimer’s Research in Turmoil as Sleuths Cast Doubt on Field-Defining Paper - The Wire Science", "description": "A 2006 study published in Nature set the stage for years' and millions of dollars' worth of Alzheimer's research. The paper's images may have been doctored.", "url": "https://science.thewire.in/the-sciences/alzheimers-study-manipulation-controversy/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/07/22162441/38730047881_74298cf370_k.jpg", "publishedAt": "2022-07-22T11:55:38Z", "content": "An artist’s impression of what brain inflammation due to Alzheimer’s disease might look like. Illustration: NIH Image Gallery/Flickr, CC BY-NC 2.0\r\n<ul><li>A 2006 study published in Nature set the st… [+9442 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Monkeypox vaccine: EMA recommends Imvanex as virus cases spike | Mint - Mint", "description": "Imvanex is currently authorised in the EU for the prevention of Smallpox in adults", "url": "https://www.livemint.com/news/world/monkeypox-vaccine-ema-recommends-imvanex-as-virus-cases-spike-11658488436069.html", "urlToImage": "https://images.livemint.com/img/2022/07/22/600x338/monkeypox_sampling_1658402347598_1658488842838_1658488842838.jpg", "publishedAt": "2022-07-22T11:22:28Z", "content": "The European Medicines Agency (EMA) on Friday informed that it has recommended the approval of Imvanex for the prevention of Monkeypox.  Imvanex, developed by Bavarian Nordic and currently being used… [+2858 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "StoryTailors", "title": "Maharashtra reports 9 cases of Monkey Fever: Know Symptoms, precautions and treatment - CNBCTV18", "description": "While some patients recover within 1-2 weeks, nearly 10-20 percent of patients suffer from the second wave of symptoms instead. Along with fever, patients then start to present “signs of neurological manifestations, such as severe headache, mental disturbance…", "url": "https://www.cnbctv18.com/news/nine-cases-of-monkey-fever-in-maharashtra--check-symptoms-precautions-and-treatment-14217182.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/06/monkeypox-non-african-1019x573.jpg", "publishedAt": "2022-07-22T10:45:00Z", "content": "MiniWhile some patients recover within 1-2 weeks, nearly 10-20 percent of patients suffer from the second wave of symptoms instead. Along with fever, patients then start to present signs of neurologi… [+158 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "ANI", "title": "Is Alzheimer's linked to your gut health? - Mint Lounge", "description": "According to a recent study, people with gut disorders like IBS stand at a greater chance of diagnosing with Alzheimer's disease", "url": "https://lifestyle.livemint.com/health/wellness/is-alzheimer-s-linked-to-your-gut-health-111658398381983.html", "urlToImage": "https://images.livemint.com/img/2022/07/21/1140x641/iStock-1173531508_1632132381196_1658401793037_1658401793037.jpg", "publishedAt": "2022-07-22T06:34:34Z", "content": "The chances of developing Alzheimer's disease may be higher in people with gut disorders, according to a new study conducted by Edith Cowan University.\r\nThe study has confirmed the link between the t… [+3628 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "What is Monkeypox | Detailed information on Monkeypox - Times of India", "description": "Everything you need to know about Monkeypox", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-a-z/monkeypox/diseasearticle/93043217.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/24487812.cms", "publishedAt": "2022-07-22T06:18:59Z", "content": "While clinically less severe than smallpox, monkeypox is a viral zoonosis, a virus that spreads from animals to people. It has symptoms that are comparable to those of smallpox. Monkeypox has replace… [+1666 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "High cholesterol: Two painful sensations to watch out for in your arm - Times of India", "description": "Raised cholesterol levels increase the risks of heart disease and stroke, as per the World Health Organization. Furthermore, a third of ischaemic heart disease is attributable to high cholesterol worldwide, says the global health agency.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/high-cholesterol-two-painful-sensations-to-watch-out-for-in-your-arm/photostory/93000970.cms", "urlToImage": "https://static.toiimg.com/photo/93000985.cms", "publishedAt": "2022-07-22T05:27:18Z", "content": "It is important that we maintain a balanced level of cholesterol in the body, since it can cause fatty build-ups in the arteries, leading to reduced blood flow to the arms and legs. This condition is… [+709 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Swollen Ankles Could Indicate Underlying Heart Disease, Check Details - News18", "description": "Early detection of heart ailment can prevent a heart attack or stroke", "url": "https://www.news18.com/news/lifestyle/swollen-ankles-could-indicate-underlying-heart-disease-check-details-5600575.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-8-5-165209713816x9.png", "publishedAt": "2022-07-22T05:18:34Z", "content": "Early detection of heart ailment can prevent a heart attack or stroke.\r\nHeart diseases grow over time and long before you develop major cardiac issues, you may have early indications or symptoms. Cer… [+1928 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "How to beat bloating: Nutritionists suggest tips - Hindustan Times", "description": "From the causes of bloating to the dietary changes we should initiate in order to beat the condition – know it all from the experts here. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/how-to-beat-bloating-nutritionists-suggest-tips-101658465700107.html", "urlToImage": "https://images.hindustantimes.com/img/2022/07/22/1600x900/b_1658465722644_1658465735539_1658465735539.jpg", "publishedAt": "2022-07-22T05:00:01Z", "content": "Bloating is a common issue faced by many of us. It is the condition of the stomach feeling full. Bloating can happen due to multiple reasons from constipation to small intestine bacteria outgrowth. S… [+3707 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "When 'just a cough' can turn out to be stage-4 Lung cancer - Times Now", "description": "Lung cancer is the most common form of cancer with an increasing number of people succumbing to it each year across the world. While spotting it can be a challenge with most cases diagnosed only at the last stage, managing the lung cancer symptoms can be quit…", "url": "https://www.timesnownews.com/health/when-just-a-cough-can-turn-out-to-be-stage-4-lung-cancer-article-93042508", "urlToImage": "https://static.tnn.in/thumb/msid-93042508,imgsize-100,width-1280,height-720,resizemode-75/93042508.jpg", "publishedAt": "2022-07-22T03:43:54Z", "content": "In the midst of Sushmita Sen, Lalit Modi's romance, here's a look at latter's super luxurious London home"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study may help overcome some obstacles to the development of nanoparticle-based drugs - News-Medical.Net", "description": "Using nanoparticles to deliver cancer drugs offers a way to hit tumors with large doses of drugs while avoiding the harmful side effects that often come with chemotherapy.", "url": "https://www.news-medical.net/news/20220721/Study-may-help-overcome-some-obstacles-to-the-development-of-nanoparticle-based-drugs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/PLGA_nanoparticles_for_delivery_of_drugs-620x480.jpg", "publishedAt": "2022-07-22T00:28:00Z", "content": "Using nanoparticles to deliver cancer drugs offers a way to hit tumors with large doses of drugs while avoiding the harmful side effects that often come with chemotherapy. However, so far, only a han… [+6658 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Peptide 'fingerprint' enables earlier diagnosis of Alzheimer's disease - ANI News", "description": "Washington [U.S], July 21 (ANI): Neurodegenerative diseases like Alzheimer's disease or Parkinson's disease are caused by folding errors (misfolding) in proteins or peptides, i.e. by changes in their spatial structure. This is the result of minute deviations …", "url": "https://www.aninews.in/news/health/peptide-fingerprint-enables-earlier-diagnosis-of-alzheimers-disease20220721225449", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/gut201720222022072109165120220721171605.jpg", "publishedAt": "2022-07-21T17:27:57Z", "content": "Washington [U.S], July 21 (ANI): Neurodegenerative diseases like Alzheimer's disease or Parkinson's disease are caused by folding errors (misfolding) in proteins or peptides, i.e. by changes in their… [+3385 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Prior Omicron infection protects against BA.4 and BA.5 variants - Nature.com", "description": "Catching an earlier version of SARS-CoV-2 — particularly Omicron — provides some immunity against the two fast-spreading lineages.", "url": "https://www.nature.com/articles/d41586-022-01950-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-01950-2/d41586-022-01950-2_23277926.jpg", "publishedAt": "2022-07-21T15:17:56Z", "content": "People queue at a COVID-19 test site in New York City last month, when the BA.4 and BA.5 subvariants were taking hold.Credit: John Smith/VIEWpress/Getty\r\nThe Omicron BA.4 and BA.5 subvariants of SARS… [+3883 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Suggests Improving Critical Illness Communication for Advanced Cancer Patients - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. By focusing on critical illness dialogues between patients with advanced cancer and their doctors, a quality improvement effort at the Dartmouth Cancer Center has increased these crucial communications by…", "url": "https://www.latestly.com/agency-news/health-news-study-suggests-improving-critical-illness-communication-for-advanced-cancer-patients-3979063.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/07/6hy6h6yhyh6yh2022072112062920220721143030-588x441.jpg", "publishedAt": "2022-07-21T14:44:19Z", "content": "Lebanon [US], July 21 (ANI): By focusing on critical illness dialogues between patients with advanced cancer and their doctors, a quality improvement effort at the Dartmouth Cancer Center has increas… [+3739 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Moderate statin and ezetimibe combo non inferior to high-intensity statin monotherapy in ASCVD: RACING... - Medical Dialogues", "description": "South Korea: A moderate-intensity statin with ezetimibe combination therapy among patients with...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/moderate-statin-and-ezetimibe-combo-non-inferior-to-high-intensity-statin-monotherapy-in-ascvd-racing-trial-96346", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/14/125493-statins-2.jpg", "publishedAt": "2022-07-21T14:39:14Z", "content": "South Korea: A moderate-intensity statin with ezetimibe combination therapy among patients with atherosclerotic cardiovascular disease (ASCVD) is non-inferior to high-intensity statin monotherapy, ac… [+2918 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Alpha, Delta, Omicron: With newer COVID variants, study reveals how symptoms continue to change - Times of India", "description": "Unlike any other disease, COVID-19 has been highly unpredictable. With wide-ranging symptoms, long COVID complications and new emerging variants, SARs-CoV-2 virus has really impacted our lives in the most grievous ways.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/alpha-delta-omicron-with-newer-covid-variants-study-reveals-how-symptoms-continue-to-change/photostory/93028572.cms", "urlToImage": "https://static.toiimg.com/photo/93028603.cms", "publishedAt": "2022-07-21T12:30:00Z", "content": "The respiratory system is classified into two main parts: Upper and lower respiratory systems.\r\nThe upper respiratory tract consists of the nose, nasal cavity and the pharynx, whereas the lower respi… [+794 chars]"}]}