{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Ingrid Fadelli", "title": "Study sheds new light on the origins of sound-evoked activity in the mouse visual cortex - Medical Xpress", "description": "Recent studies have found that brain regions previously thought to only process a specific type of sensory stimuli, such as the visual cortex, can also be affected by other sensory stimuli. This might suggest that these brain regions are in fact multi-sensory…", "url": "https://medicalxpress.com/news/2023-01-sound-evoked-mouse-visual-cortex.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/study-sheds-new-light-1.jpg", "publishedAt": "2023-01-27T14:30:01Z", "content": "Recent studies have found that brain regions previously thought to only process a specific type of sensory stimuli, such as the visual cortex, can also be affected by other sensory stimuli. This migh… [+4990 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Natural but effective ways to burn fat - Indiatimes.com", "description": "Being overweight and obese highly increases the risk of having diabetes, heart disease, and other chronic conditions.​", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/natural-but-effective-ways-to-burn-fat/photostory/97373620.cms", "urlToImage": "https://static.toiimg.com/photo/97373639.cms", "publishedAt": "2023-01-27T14:30:00Z", "content": "Good health and physical fitness are integral to a disease-free and productive life. Being of a healthy weight is one of the most vital aspects because being overweight and obese highly increases the… [+828 chars]"}, {"source": {"id": null, "name": "Modernretina.com"}, "author": null, "title": "Study examines why episodes of low blood sugar worsen eye disease in people with diabetes - Modern Retina", "description": "Patients diagnosed with diabetic retinopathy may be particularly vulnerable to periods of low glucose, and keeping glucose levels stable should be an important part of glucose control.", "url": "https://www.modernretina.com/view/study-examines-why-episodes-of-low-blood-sugar-worsen-eye-disease-in-people-with-diabetes", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/modernretina/21f1d529037512b3dcba991d378f4e44d339c058-6553x4430.jpg?fit=crop&auto=format", "publishedAt": "2023-01-27T14:26:25Z", "content": "People with diabetes who experience periods of low blood sugar a common occurrence in those new to blood sugar management are more likely to have worsening diabetic eye disease.\r\nNow, researchers at … [+4819 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Winter Drinks: Boost Your Energy Levels With This Turmeric-Cinnamon Premix - NDTV", "description": "Nutritionist Pooja Malhotra states that this energy-boosting drink will kick away laziness and give you an immediate boost of energy.", "url": "https://www.ndtv.com/health/winter-diet-boost-your-energy-levels-with-this-turmeric-cinnamon-premix-3729566", "urlToImage": "https://c.ndtvimg.com/2021-09/3slploe_gulkand_625x300_27_September_21.jpg", "publishedAt": "2023-01-27T13:27:25Z", "content": "The winter season and laziness go hand in hand. Most of us end up skipping working out and often become victims of overeating in the chilly months. This combination is indeed harmful to the body. But… [+1799 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Children's 'rushed' immune response makes them susceptible to COVID reinfection: Study - ETHealthWorld", "description": "The immune system has two modes. The innate immune system is the first line of defence, comprising physical barriers such as skin and mucosal surfaces that block viruses from entering. The innate immune system is also composed of cells that make chemicals to …", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/childrens-rushed-immune-response-makes-them-susceptible-to-covid-reinfection-study/97378819", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97378819,imgsize-63348,width-1200,height-628,overlay-ethealthworld/children-s-rushed-immune-response-makes-them-susceptible-to-covid-reinfection-study.jpg", "publishedAt": "2023-01-27T13:14:00Z", "content": "Melbourne: Scientists have found that children's immune systems, unlike those of adults, do not remember the virus and do not adapt, and so when exposed to SARS-CoV-2 again, their body still treats i… [+3473 chars]"}, {"source": {"id": null, "name": "PMLiVE"}, "author": null, "title": "MIT researchers develop AI model to detect future lung cancer risk - PMLiVE", "description": "Lung cancer is the leading cause of cancer in the US, accounting for 1.7 million deaths globally in 2020", "url": "https://www.pmlive.com/pharma_news/mit_researchers_develop_ai_model_to_detect_future_lung_cancer_risk_1485972", "urlToImage": "https://www.pmlive.com/__data/assets/image/0006/1453227/Clinical_development.jpg", "publishedAt": "2023-01-27T13:12:03Z", "content": "A team of researchers from the Massachusetts Institute of Technology (MIT) has developed an artificial intelligence (AI) model that is able to detect future lung cancer risk.\r\nThe assessment tool, kn… [+2281 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Can 'No-needle' COVID-19 protection be achieved with inhaled aerosol vaccines? - News-Medical.Net", "description": "In this piece, ACROBiosystems talk about inhaled aerosol vaccines, providing a breakdown of how they work, their efficacy and whether 'no-needle' COVID-19 protection is possible.", "url": "https://www.news-medical.net/whitepaper/20230127/Can-No-needle-COVID-19-protection-be-achieved-with-inhaled-aerosol-vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/appnotes/ImageForAppNote_4361_16748035671671689.jpg", "publishedAt": "2023-01-27T13:12:00Z", "content": "The global COVID-19 pandemic is in its third year. The effects of the pandemic have been far-reaching and are still being felt worldwide, affecting every country to varying degrees. Lockdowns, social… [+8391 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study suggests brief exposure to air pollution has rapid impacts on brain - ETHealthWorld", "description": "The peer-reviewed findings, published in the journal Environmental Health, show that just two hours of exposure to diesel exhaust causes a decrease in the brain's functional connectivity - a measure of how The study provides the first evidence in humans, from…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-suggests-brief-exposure-to-air-pollution-has-rapid-impacts-on-brain/97378651", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97378651,imgsize-6538,width-1200,height-628,overlay-ethealthworld/study-suggests-brief-exposure-to-air-pollution-has-rapid-impacts-on-brain.jpg", "publishedAt": "2023-01-27T12:59:00Z", "content": "Washington: A new study has shown that common levels of traffic pollution can impair human brain function in only a matter of hours. The study was the first to show in a controlled experiment using f… [+2044 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Parkinson's disease: The first symptom that may appear prior to tremors or muscle stiffness - Times of India", "description": "Parkinson's disease is a neurodegenerative condition that not only takes a toll on your nervous system, but also affects the parts, including the brain, that function with the help of the nerves. It is therefore characterized by unintended movements such as s…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/parkinsons-disease-the-first-symptom-that-may-appear-prior-to-tremors-or-muscle-stiffness/photostory/97376490.cms", "urlToImage": "https://static.toiimg.com/photo/97376528.cms", "publishedAt": "2023-01-27T12:30:00Z", "content": "For the study, a microphone was used in a soundproof booth to record the speech of healthy and Parkinson's patients.\r\nProf. Kipras Pribuiis said, \"So far, our approach is able to distinguish Parkinso… [+676 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Team Health Shots", "title": "5 causes of a missed period apart from unsafe sex - Health shots", "description": "It is natural to have tension after unsafe sex. But here are some other causes of missed periods as well, which you should be aware of.", "url": "https://www.healthshots.com/intimate-health/menstruation/5-causes-of-missed-period-apart-from-unsafe-sex/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/01/27151207/missed-period.jpg", "publishedAt": "2023-01-27T12:00:41Z", "content": "Every woman’s menstrual cycle is different, on average, women get periods every 28 days. This cycle can be either longer or shorter. While irregular or shorter period cycles are a few period issues, … [+2839 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Cervical health awareness month: Bringing care closer to prevent and reduce the chances of cervical cancer - Express Healthcare", "description": "Dr Vishal Sehgal, President, Portea Medical emphasises that while an affordable and accessible vaccine can address the burden of cervical cancer in India provided the other barriers are also addressed alongside. This can be done through mass awareness campaig…", "url": "https://www.expresshealthcare.in/news/cervical-health-awareness-month-bringing-care-closer-to-prevent-and-reduce-the-chances-of-cervical-cancer/437881/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2023/01/New-Project-13-3.jpg", "publishedAt": "2023-01-27T11:58:53Z", "content": "Dr Vishal Sehgal, President, Portea Medical emphasises that while an affordable and accessible vaccine can address the burden of cervical cancer in India provided the other barriers are also addresse… [+4220 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers identify an unexpected driver of cancer immunotherapy resistance - News-Medical.Net", "description": "A research team from the LKS Faculty of Medicine, the University of Hong Kong (HKUMed) has identified an unexpected driver of cancer immunotherapy resistance: the harmful effect of chronic Type I Interferon signaling on tumor-killing CD8+ T cells.", "url": "https://www.news-medical.net/news/20230127/Researchers-identify-an-unexpected-driver-of-cancer-immunotherapy-resistance.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/174318220-620x480.jpg", "publishedAt": "2023-01-27T11:57:00Z", "content": "A research team from the LKS Faculty of Medicine, the University of Hong Kong (HKUMed) has identified an unexpected driver of cancer immunotherapy resistance: the harmful effect of chronic Type I Int… [+3412 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Active Keto Gummies Reviews (Side Effects) Shark Tank ACV Keto Gummies in USA! - Deccan Herald", "description": "Introduction: - Active Keto Gummies Review", "url": "https://www.deccanherald.com/brandspot/pr-spot/active-keto-gummies-reviews-side-effects-shark-tank-acv-keto-gummies-in-usa-1185138.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p16-1185138-1674818052.png", "publishedAt": "2023-01-27T11:14:12Z", "content": "Introduction: - Active Keto Gummies Review\r\nYou probably didn't know this, but Active Keto Gummies are a great tool that may assist you out if you're following a ketogenic diet. Keto Gummies not only… [+10104 chars]"}, {"source": {"id": null, "name": "Newslivetv.com"}, "author": null, "title": "Is Liver Detox Effective? Get This Test Done to Know if it’s Working - News Live", "description": "You can take many measures to protect your liver against damage and diseases. However, it is also essential to keep tabs on the status of your liver health is", "url": "https://newslivetv.com/is-liver-detox-effective-get-this-test-done-to-know-if-its-working/", "urlToImage": "https://newslivetv.com/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-27-at-3.06.00-PM.jpeg", "publishedAt": "2023-01-27T10:47:27Z", "content": "You can take many measures to protect your liver against damage and diseases. However, it is also essential to keep tabs on the status of your liver health is also necessary. You can do this by getti… [+4838 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Update 83: The Global Influenza Outbreak - What we are doing and what it means for pandemic influenza - World Health Organization", "description": "To create awareness on the current influenza outbreak, what is being done to manage it, what the public and policy makers need to know and do, and what it means for both seasonal influenza and pandemic influenza. There are 2 EPI-WIN webinars available on this…", "url": "https://www.who.int/publications/m/item/update-83-the-global-influenza-outbreak-what-we-are-doing-and-what-it-means-for-pandemic-influenza", "urlToImage": "https://www.who.int/images/default-source/departments/global-influenza-programme/feature-stories/gisrs-anniversary/171204-sadygalieva-sveta_1.tmb-1200v.jpg?sfvrsn=19711832_1", "publishedAt": "2023-01-27T10:34:41Z", "content": "Overview \r\nTo create awareness on the current influenza outbreak, what is being done to manage it, what the public and policy makers need to know and do, and what it means for both seasonal influenza… [+515 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Uneasiness in these body parts might be due to heart problem - Indiatimes.com", "description": "Uneasiness in the form of a burning sensation in the chest or stomach is an indication of a heart related problem though it is nearly impossible to tell it distinctly whether it is related to heart or is it a gastrointestinal issue.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/uneasiness-in-these-body-parts-might-be-due-to-heart-problem/photostory/97369852.cms", "urlToImage": "https://static.toiimg.com/photo/97369934.cms", "publishedAt": "2023-01-27T10:30:00Z", "content": "This is another sign of heart disease though it is distantly related to the condition. \r\n\"This kind of leg pain, which is felt when you exercise and stops when you stop, can be a sign of peripheral v… [+183 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Neuronal molecule makes prostate cancer more aggressive: Research - ThePrint", "description": "Washington [US], January 27 (ANI): Prostate cancer is the second most common cancer and the second leading cause of cancer death among American men. Now, researchers have discovered critical molecular players that drive prostate cancer to progress into a high…", "url": "https://theprint.in/science/neuronal-molecule-makes-prostate-cancer-more-aggressive-research/1338344/", "urlToImage": null, "publishedAt": "2023-01-27T10:18:10Z", "content": "Washington [US], January 27 (ANI): Prostate cancer is the second most common cancer and the second leading cause of cancer death among American men. Now, researchers have discovered critical molecula… [+3343 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Mycelial nutrient transfer promotes bacterial co-metabolic organochlorine pesticide degradation in nutrient-deprived environments | The ISME Journal - Nature.com", "description": "The ISME Journal - Mycelial nutrient transfer promotes bacterial co-metabolic organochlorine pesticide degradation in nutrient-deprived environments", "url": "https://www.nature.com/articles/s41396-023-01371-7", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41396-023-01371-7/MediaObjects/41396_2023_1371_Fig1_HTML.png", "publishedAt": "2023-01-27T10:14:18Z", "content": "<li>Mohn WW, Mertens B, Neufeld JD, Verstraete W, de Lorenzo V. Distribution and phylogeny of hexachlorocyclohexane-degrading bacteria in soils from Spain. Environ Microbiol. 2006;8:608.\r\nCAS \r\nGoogl… [+13254 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/prashasti-sudhakarzeemedia-esselgroup-com/", "title": "Health Tips: Skipping Dinner Can Cause Sleep Deprivation, Here's Why You Should Never Miss Dinner - Watch Vid - India.com", "description": "Skipping dinner can be bad for your health and may even make you gain weight because it deprives your body of essential nutrients that it requires. Know the disadvantages of skipping dinner in the video.", "url": "https://www.india.com/video-gallery/health-tips-skipping-dinner-can-cause-sleep-deprivation-heres-why-you-should-never-miss-dinner-watch-video-5871304/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/dinner-skipping.jpg", "publishedAt": "2023-01-27T10:11:28Z", "content": "Skipping dinner can be bad for your health and may even make you gain weight because it deprives your body of essential nutrients that it requires. Know the disadvantages of skipping dinner in the vi… [+649 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Deepali Verma", "title": "Green Juice To Herbal Teas Winter Drinks To Stay Hydrated - Slurrp", "description": "Adding a variety of beverages to your daily routine in the winter is a great way to break up the monotony. To keep things flavorful and interesting throughout the week, you can alternate between various hot and warm beverages.", "url": "https://www.slurrp.com/article/green-juice-to-herbal-teas-winter-drinks-to-stay-hydrated-1674807894715", "urlToImage": "https://images.slurrp.com/prodarticles/uk2l8ls5kh.webp", "publishedAt": "2023-01-27T09:55:22Z", "content": "Your body can suffer greatly from the harsh winter cold, which can leave your skin parched and your body dehydrated. We frequently disregard the importance of sufficient hydration, despite the fact t… [+3939 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Male alcohol use has a significant negative influence on IVF outcomes - Tech Explorist", "description": "This particular study highlights the importance of expanding fertility and prepregnancy messaging.", "url": "https://www.techexplorist.com/male-alcohol-use-significant-negative-influence-ivf-outcomes/56452/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/ivf.jpg", "publishedAt": "2023-01-27T09:38:31Z", "content": "Increasingly, couples struggling with fertility turn to assisted reproductive techniques to have children, including in vitro fertilization (IVF). Despite the demonstrated influence of preconception … [+2952 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "Here are five PCOS management tips for women - Firstpost", "description": "Exercise regularly and take a healthy diet. This can help to regulate your insulin and blood sugar levels. It even helps you to lose weight", "url": "https://www.firstpost.com/living/here-are-five-pcos-management-tips-for-women-12056512.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/09/PCOS_Centre-1-e1674811434213.jpg", "publishedAt": "2023-01-27T09:24:07Z", "content": "PCOS (polycystic ovary syndrome) is a hormone imbalance that affects a number of women. PCOS has a variety of symptoms that include irregular or heavy periods, pimples, weight gain (especially around… [+2013 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET CIO", "title": "People dying from cardiovascular disease up by 6.2 per cent in pandemic's first year in US: Study - ETCIO", "description": "The biggest increases in the overall number of CVD-related deaths were seen among Asian, Black and Hispanic people, populations most impacted in the early days of the pandemic, and brought to focus increasing structural and societal disparities. \"People from …", "url": "https://cio.economictimes.indiatimes.com/news/business-analytics/people-dying-from-cardiovascular-disease-up-by-6-2-per-cent-in-pandemics-first-year-in-us-study/97364762", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97364762,imgsize-2066124,width-1200,height-628,overlay-etcio/people-dying-from-cardiovascular-disease-up-by-6-2-per-cent-in-pandemic-s-first-year-in-us-study.jpg", "publishedAt": "2023-01-27T09:00:00Z", "content": "California: The number of people dying from cardiovascular disease (CVD) in the US escalated during the first year of the COVID-19 pandemic by 6.2 per cent, according to a study. The rise in the numb… [+4640 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study: Slower memory decline in older adults linked to healthy lifestyle - ETHealthWorld", "description": "Memory continuously declines as people age, but evidence from existing studies is insufficient to assess the effect of a healthy lifestyle on memory in later life. And given the many possible causes of memory decline, a combination of healthy behaviours might…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-slower-memory-decline-in-older-adults-linked-to-healthy-lifestyle/97369777", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97369777,imgsize-1333314,width-1200,height-628,overlay-ethealthworld/study-slower-memory-decline-in-older-adults-linked-to-healthy-lifestyle.jpg", "publishedAt": "2023-01-27T09:00:00Z", "content": "Washington [US]: A healthy lifestyle, in particular a healthy diet, is associated with slower memory decline, finds a decade-long study of older adults in China, published in The BMJ. Even for carrie… [+4569 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Nutritionist on benefits of 'bad cholesterol', best oils for heart health - Hindustan Times", "description": "Nutritionist Bhakti Kapoor in her Instagram post says 'LDL is innocent' and while it is often termed as a bad cholesterol, it is very important for our body. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/nutritionist-on-benefits-of-bad-cholesterol-suggests-best-oils-for-heart-health-101674809479004.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/27/1600x900/h_1671275024049_1674809724799_1674809724799.jpg", "publishedAt": "2023-01-27T08:57:33Z", "content": "Cholesterol, the waxy substance, is needed by our body for several functions including cell building and repair, producing bile and hormone production. However, high levels of cholesterol in blood is… [+3187 chars]"}, {"source": {"id": null, "name": "Lexology"}, "author": "Sonia Hickey", "title": "COVID-19 Vaccine Injuries Have Largely Been Ignored - Lexology", "description": "There’s growing momentum around the acknowledgement of vaccination injuries despite them being ignored by big pharma, the medical profession, and…", "url": "https://www.lexology.com/library/detail.aspx?g=8a1d16a8-07ec-41bc-8033-aaf1b38e448e", "urlToImage": "https://www.lexology.com/images/share/lexology-social-media.png", "publishedAt": "2023-01-27T08:49:07Z", "content": "There’s growing momentum around the acknowledgement of vaccination injuries despite them being ignored by big pharma, the medical profession, and governments around the world, including our own.\r\nAs … [+7294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Is wearing dirty clothes an early sign of dementia? - The Indian Express", "description": "As dementia progresses, patients may have difficulty with self-care tasks such as bathing and dressing, said Dr Rakesh Lalla, consultant-interventional neurology, at Fortis Hospital, Kalyan", "url": "https://indianexpress.com/article/lifestyle/health/wearing-dirty-clothes-early-sign-dementia-alzheimers-agnosia-8401037/", "urlToImage": "https://images.indianexpress.com/2023/01/demenia_1200_getty.jpg", "publishedAt": "2023-01-27T08:40:41Z", "content": "Memory loss is considered to be one of the earliest signs of Alzheimer’s disease and other forms of dementia. However, the US’ National Institute on Aging (NIA) also lists hygiene changes, including … [+3881 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Consistent High-fat Diet can Reduce Brain`s Ability to Regulate Calorie Intake: Study - Zee News", "description": "Regularly eating a high-fat/calorie diet could reduce the brains ability to regulate calorie intake.", "url": "https://zeenews.india.com/health/consistent-high-fat-diet-can-reduce-brains-ability-to-regulate-calorie-intake-study-2566311", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/27/1146224-obesity-fat-pixabay.jpg", "publishedAt": "2023-01-27T08:31:55Z", "content": "Regularly eating a high-fat/calorie diet could reduce the brain's ability to regulate calorie intake. New research in rats found that after short periods of being fed a high-fat/high-calorie diet, th… [+3585 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Health Desk", "title": "EXPLAINED: Chronic stress activates behavioural problems like loss of pleasure, sadness & depression - India TV News", "description": "Chronic unpredictable stress is widely used to study the impact of stress exposure in animal models, and in this case that included things like restraint, prolonged wet bedding in a tilted cage and social isolation.", "url": "https://www.indiatvnews.com/health/explained-chronic-stress-activates-behavioural-problems-like-loss-of-pleasure-sadness-depression-2023-01-27-842618", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/depression-1674808080.jpg", "publishedAt": "2023-01-27T08:29:17Z", "content": "It's clear that chronic stress can impact our behaviour, leading to problems like depression, reduced interest in things that previously brought us pleasure, and even PTSD. Now scientists have eviden… [+2789 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Non-Surgical Management of Knee Arthritis Patients - News18", "description": "Dr Samarth Arya, Consultant Orthopaedics, Joint Replacement & Robotic Surgery, Sparsh Hospital, Bengaluru shares non-surgical therapies for knee arthritis", "url": "https://www.news18.com/news/lifestyle/non-surgical-management-of-knee-arthritis-patients-6928009.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/elderly-man-sitting-sofa-home-touching-his-painful-knee-people-health-care-problem-concept-unhappy-senior-man-suffering-from-knee-ache-home-167480112816x9.jpg", "publishedAt": "2023-01-27T08:09:00Z", "content": "Knee arthritis is a common condition that affects millions of people worldwide. It is characterized by the degeneration of the cartilage in the knee joint, which can lead to pain, stiffness, and diff… [+3369 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Ruchika Sharma", "title": "Cervical cancer vaccine CERVAVAC to be available in small quantity in 2023, increased next year: Adar... - Medical Dialogues", "description": "Talking about the rollout programme of the vaccine, Poonawalla said that it would be done through government programmes this year.", "url": "https://medicaldialogues.in/news/industry/pharma/cervical-cancer-vaccine-cervavac-to-be-available-in-small-quantity-in-2023-increased-next-year-adar-poonawalla-106198", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/21/188683-adar-poonawalla-new.jpg", "publishedAt": "2023-01-27T07:45:33Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Planning For Pregnancy? Here Are Key Considerations To Keep In Mind - News18", "description": "Dr Reshma M A, Ayurvedic Gynaecologist and Fertility Specialist, Ayurgynae, BTM Layout, Bengaluru shares a pregnancy planning checklist", "url": "https://www.news18.com/news/lifestyle/planning-for-pregnancy-here-are-key-considerations-to-keep-in-mind-6928633.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/smiling-young-woman-with-pregnancy-test-167480449616x9.jpg", "publishedAt": "2023-01-27T07:29:45Z", "content": "According to Ayurveda, pregnancy is best when it is planned, rather than accidental. Therefore, it is crucial to prepare both the mother and fathers bodies and minds well in advance. Ayurveda focuses… [+2034 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by PTI", "title": "'Coldspots' discovered in Covid virus, may help antibodies fight future variants: Study - India TV News", "description": "The antibodies blocked virus infection in laboratory experiments, even to the latest variants of concern, and protected from disease in preclinical models, the study said.", "url": "https://www.indiatvnews.com/news/world/covid-virus-coldspots-discovered-will-help-antibodies-fight-future-variants-study-2023-01-27-842589", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/covid-ap5-1674803850.jpg", "publishedAt": "2023-01-27T07:29:33Z", "content": "Scientists have discovered regions on the coronavirus which do not change, or 'coldspots', and that antibodies specific for these coldspots may help fight future coronaviruses, according to a new stu… [+1765 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Thyroid and You: 5 Foods That Can Help You With Thyroid Management - News18", "description": "Ms Edwina Raj, Head – Clinical Nutrition Dietics, Aster CMI Hospital, Bengaluru talks about thyroid, hypothyrodism and foods that can benefit you from these key nutrients essential for your thyroid function", "url": "https://www.news18.com/news/lifestyle/thyroid-and-you-5-foods-that-can-help-you-with-thyroid-management-6928561.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/shutterstock_2106395975-167480446216x9.jpg", "publishedAt": "2023-01-27T07:28:08Z", "content": "The thyroid is a butterfly-shaped gland that is located on the front of our neck below the adams apple. This gland produces hormones that help in regulating our metabolism, growth, and developmental … [+4722 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Managing severe hypoglycaemia in patients with diabetes | DMSO - Dove Medical Press", "description": "Considerable challenges remain as not all patients have access to diabetes technologies and newer glucagon formulations to reduce and prevent hypoglycaemia.", "url": "https://www.dovepress.com/managing-severe-hypoglycaemia-in-patients-with-diabetes-current-challe-peer-reviewed-fulltext-article-DMSO", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-27T07:10:56Z", "content": "Introduction\r\nHypoglycaemia is the most common and severe complication of type 1 diabetes mellitus (T1DM).1 It interferes with daily activities, poses a source of fear for diabetic individuals and th… [+60677 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Probes Risk Of Stroke From Pfizer Covid Vaccine Booster Dose - NDTV", "description": "Earlier this month, US health officials said they had detected the possible link to ischemic strokes in people over age 65 who received the newer booster shots.", "url": "https://www.ndtv.com/world-news/us-probes-risk-of-stroke-from-pfizer-covid-vaccine-booster-dose-3728209", "urlToImage": "https://c.ndtvimg.com/2021-12/h2vt31vo_pfizer-afp_625x300_01_December_21.jpg", "publishedAt": "2023-01-27T06:33:37Z", "content": "US plans to study whether there is any increased risk of stroke from the booster dose.\r\nNew data from one US Centers for Disease Control and Prevention (CDC) database shows a possible stroke risk lin… [+1957 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Priyanka Munshi", "title": "5 Best Food Items To Keep Your Blood Sugar Levels In Check - Jagran English", "description": "", "url": "https://english.jagran.com/lifestyle/5-best-food-items-to-keep-your-blood-sugar-levels-in-check-10062692", "urlToImage": "https://imgeng.jagran.com/images/2023/jan/diabetes1674802125049.jpg", "publishedAt": "2023-01-27T06:32:44Z", "content": "DIABETES IS one of the health conditions with the highest risk; yes, you heard that right. The only thing a diabetic person is aware of are the consequences of this. So if it is not treated well, hig… [+1743 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhika Singh", "title": "31 tips to boost your family’s emotional and physical well-being - The Indian Express", "description": "Good emotional, mental and physical health can significantly enhance family relationships.", "url": "https://indianexpress.com/article/parenting/31-tips-to-boost-your-familys-emotional-and-physical-well-being-8407380/", "urlToImage": "https://images.indianexpress.com/2023/01/Family-time.jpg", "publishedAt": "2023-01-27T06:28:07Z", "content": "Has the impact of the past two years created a strain in your family? Is there a growing distance among family members? Often enough, you might find a family member in a mood slump, irritable, unhapp… [+2989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lifetime achievement award for Pune NIV scientist Professor Atanu Basu - The Indian Express", "description": "Professor Basu who heads the electron microscopy and pathology division at ICMR-NIV has been instrumental in setting up the country’s first dedicated virus electron microscopy and cryo-electron microscopy facilities.", "url": "https://indianexpress.com/article/cities/pune/pune-niv-scientist-professor-atanu-basu-lifetime-achievement-award-8407311/", "urlToImage": "https://images.indianexpress.com/2023/01/atanu-basu-2.jpg", "publishedAt": "2023-01-27T06:26:21Z", "content": "Professor Atanu Basu, scientist at the Indian Council of Medical Research National Institute of Virology (ICMR-NIV), Pune, has been selected for the lifetime achievement award for his outstanding con… [+2322 chars]"}, {"source": {"id": null, "name": "IndiaCSR"}, "author": "India CSR", "title": "Covid vaccines and Sudden Arrhythmic Death Syndrome (SADS) are not connected I India CSR - IndiaCSR", "description": "There is no credible evidence globally that COVID vaccines, regardless of the type, are responsible for sudden deaths, also known", "url": "https://indiacsr.in/covid-vaccines-and-sudden-arrhythmic-death-syndrome-sads-are-not-connected/", "urlToImage": "https://indiacsr.in/wp-content/uploads/2023/01/Covid-vaccines-and-Sudden-Arrhythmic-Death-Syndrome-SADS-are-not-connected.jpg", "publishedAt": "2023-01-27T06:05:51Z", "content": "There is no credible evidence globally that COVID vaccines, regardless of the type, are responsible for sudden deaths, also known as sudden cardiac death or Sudden arrhythmic death syndrome (SADS).\r\n… [+3738 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Adity Saha", "title": "PGIMS Rohtak Gynaecologist Dr Vani Malhotra bags award for research on Hepatitis B pregnant patients - Medical Dialogues", "description": "Rohtak: In recognition of her outstanding research on preventing vertical transmission of hepatitis B in pregnant patients, Dr Vani Malhotra, professor of obstetrics & gynecology, PGIMS, Rohtak,...", "url": "https://medicaldialogues.in/news/health/doctors/pgims-rohtak-gynaecologist-dr-vani-malhotra-bags-award-for-research-on-hepatitis-b-pregnant-patients-106189", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/07/185124-award-post.jpg", "publishedAt": "2023-01-27T05:15:18Z", "content": "Rohtak: In recognition of her outstanding research on preventing vertical transmission of hepatitis B in pregnant patients, Dr Vani Malhotra, professor of obstetrics &amp; gynecology, PGIMS, Rohtak, … [+3660 chars]"}, {"source": {"id": null, "name": "Drugdiscoverynews.com"}, "author": "Dan Samorodnitsky, PhD", "title": "A new gene therapy for inherited blindness - Drug Discovery News", "description": "Neuroscientists safely delivered a critical gene that improved vision for two patients with Leber congenital amaurosis.", "url": "https://www.drugdiscoverynews.com/a-new-gene-therapy-for-inherited-blindness-15603", "urlToImage": "https://s3.amazonaws.com/lmg-drugdiscoverynews/assets/articleNo/15603/aImg/39978/1800x900-5-m.jpg", "publishedAt": "2023-01-27T05:02:28Z", "content": "Leber congenital amaurosis (LCA) is one of the most common forms of inherited blindness worldwide. Visual defects resulting from LCA arise from a variety of genetic mutations that block the biochemic… [+5193 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Benefits of telemedicine for healthcare outweigh its operating costs - News-Medical.Net", "description": "Telemedicine and virtual appointments have become more popular in routine health and wellness since the COVID-19 pandemic began.", "url": "https://www.news-medical.net/news/20230126/Benefits-of-telemedicine-for-healthcare-outweigh-its-operating-costs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Telemedicine-620x480.jpg", "publishedAt": "2023-01-27T04:12:00Z", "content": "Telemedicine and virtual appointments have become more popular in routine health and wellness since the COVID-19 pandemic began.\r\nCal State Fullerton assistant professor of management David Cho co-au… [+1384 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Isra Zaman", "title": "Running to escape everyday stresses may eventually cause exercise dependence instead of mental wellbeing: ... - Medical Dialogues", "description": "A study published in Frontiers in Psychology investigated whether the concept of escapism can help us understand the relationship between running, wellbeing, and exercise dependence.  Escapism can...", "url": "https://medicaldialogues.in/mdtv/psychiatry/videos/running-to-escape-everyday-stresses-may-eventually-cause-exercise-dependence-instead-of-mental-wellbeing-study-106195", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/27/199719-why-sudden-increase-in-melioidosis-cases-in-india-1500-900px.jpg", "publishedAt": "2023-01-27T03:30:26Z", "content": "A study published in Frontiers in Psychology investigated whether the concept of escapism can help us understand the relationship between running, wellbeing, and exercise dependence. \r\nEscapism can r… [+1671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Thing we learnt today: There is a ‘perfect way’ to eat an apple - The Indian Express", "description": "\"A healthy gut helps to digest the food better, maintain the body’s immune system, gives protection from pathogenic diseases, and helps in the synthesis of vitamins,\" said registered dietitian Garima Goyal", "url": "https://indianexpress.com/article/lifestyle/health/healthiest-part-eating-apple-benefits-8404288/", "urlToImage": "https://images.indianexpress.com/2023/01/apple_1200_pixabay.jpg", "publishedAt": "2023-01-27T02:50:51Z", "content": "We all know the famous adage, that an apple a day keeps the doctor away. But turns out, that you also need to also eat it the right way for it to work its wonders on your health! Intrigued? So were w… [+3360 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Sian Ferguson", "title": "PID vs. Endometriosis: Symptoms, Diagnosis, Treatment - Healthline", "description": "Pelvic inflammatory disease is a treatable condition. Endometriosis cannot be cured, but with the right medication, many people manage their symptoms well.", "url": "https://www.healthline.com/health/pid-vs-endometriosis", "urlToImage": "https://post.healthline.com/wp-content/uploads/2022/12/young-woman-lying-on-bed-1200x628-facebook-1200x628.jpg", "publishedAt": "2023-01-26T22:10:26Z", "content": "Although PID and endometriosis have similar symptoms, they are two different conditions.\r\nPelvic inflammatory disease (PID) is a bacterial infection of the reproductive organs.\r\nEndometriosis is spec… [+6916 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Season of birth may be associated with risk for adult-onset asthma - Healio", "description": "People born between January and June in Finland experienced a higher risk for adult-onset asthma than people born later in the year, with a stronger risk among people with atopic asthma, according to a letter published in Asthma. Led by Anni Koskinen, MD, PhD…", "url": "https://www.healio.com/news/allergy-asthma/20230126/season-of-birth-may-be-associated-with-risk-for-adultonset-asthma", "urlToImage": "https://www.healio.com/~/media/slack-news/allergy_asthma/infographics/2023/01_january/aa0123koskinen_ig7_web.jpg", "publishedAt": "2023-01-26T20:22:50Z", "content": "People born between January and June in Finland experienced a higher risk for adult-onset asthma than people born later in the year, with a stronger risk among people with atopic asthma, according to… [+4353 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Persistent tumor mutation burden linked with therapeutic response to immunotherapy - News-Medical.Net", "description": "Cancer experts have tried, sometimes unsuccessfully, to use the total number of mutations in a tumor, called the tumor mutation burden (TMB), to predict a patient's response to immunotherapy.", "url": "https://www.news-medical.net/news/20230126/Persistent-tumor-mutation-burden-linked-with-therapeutic-response-to-immunotherapy.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Melanoma-620x480.jpg", "publishedAt": "2023-01-26T19:06:00Z", "content": "Cancer experts have tried, sometimes unsuccessfully, to use the total number of mutations in a tumor, called the tumor mutation burden (TMB), to predict a patient's response to immunotherapy. Now, in… [+8930 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rhythma Kaul", "title": "Bivalent vaccines more effective against Covid than monovalent ones: Study - Hindustan Times", "description": "Bivalent Covid-19 vaccines provide significantly better protection than their monovalent counterparts against severe disease and death from infections caused by Omicron sub-variants, data from two recent reports published in the New England Journal of Medicin…", "url": "https://www.hindustantimes.com/india-news/bivalent-vaccines-more-effective-against-covid-than-monovalent-ones-study-101674756634243.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/26/1600x900/A-health-care-worker-inoculates-a-beneficiary-with_1674756629014.jpg", "publishedAt": "2023-01-26T18:10:33Z", "content": "Bivalent Covid-19 vaccines provide significantly better protection an edge in efficacy of around 37 percentage points than their monovalent counterparts against severe disease and death from infectio… [+5592 chars]"}, {"source": {"id": null, "name": "Healthgrades.com"}, "author": "https://www.healthgrades.com/contributors/rashida-ruwa-rn", "title": "HIV Tongue and Oral Symptoms, Treatments, and More - Healthgrades", "description": "Find out how HIV can affect the tongue. This article also looks at other oral symptoms, treatment options, and more.", "url": "https://www.healthgrades.com/right-care/hiv/hiv-tongue", "urlToImage": "https://dims.healthgrades.com/dims3/MMH/8472ba5/2147483647/strip/true/crop/732x384+0+82/resize/1200x630!/quality/75/?url=https%3A%2F%2Fucmscdn.healthgrades.com%2F1a%2F52%2Fb2f937f4903c7ac48af6dacc3feb%2Fhg-tongue-checkup-732x549-thumbnail.jpg", "publishedAt": "2023-01-26T17:35:51Z", "content": "HIV can affect the tongue in numerous ways. This includes symptoms such as thrush, mouth sores, and hairy leukoplakia. These may occur alongside other oral symptoms.\r\nWhen HIV affects the tongue, you… [+4400 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Rhea Varghese", "title": "Women, do you feel extremely stressed out? Know how to manage stress without risking your heart's health - Times Now", "description": "According to scientific studies, women are at more risk of developing a major heart condition due to excessive stress. Knowing how to keep it in check can go a long way in keeping yourself and your heart healthy.", "url": "https://www.timesnownews.com/lifestyle/stress-management-tips-for-women-how-to-manage-stress-for-healthy-heart-article-97356864", "urlToImage": "https://static.tnn.in/thumb/msid-97356864,imgsize-100,updatedat-1674750776006,width-1280,height-720,resizemode-75/97356864.jpg", "publishedAt": "2023-01-26T16:32:56Z", "content": "Fire-Boltt's introduces a Unique Collection of Smartwatches for the offline market: Saturn, Talk 3, and Ninja-Fit"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Clarissa Brincat", "title": "SSRIs and 'emotional blunting': What happens in the brain? - Medical News Today", "description": "A new study hypothesizes that common antidepressants may lead to 'emotional blunting' by impacting the process of reinforcement learning.", "url": "https://www.medicalnewstoday.com/articles/why-might-antidepressants-dampen-our-emotions", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2023/01/emotional_blunting_Stocksy_txpd793569eFOc300_Medium_2236116_Thumb.jpg", "publishedAt": "2023-01-26T16:24:55Z", "content": "An unwanted side effect of SSRIs, especially though not only in people taking them for a long time, is a diminished emotional response to both unpleasant and pleasurable events, referred to as emotio… [+6504 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Staff", "title": "Scientists develop artificial skin for robots that can feel things humans can’t - Firstpost", "description": "Building upon previously developed artificial skin, researchers at Singapore’s Nanyang Technological University have developed a new artificial skin that can sense a wider variety of stimuli than normal, making it much more complex and capable than regular hu…", "url": "https://www.firstpost.com/world/singapore-scientists-create-artificial-skin-for-robots-that-more-capable-than-human-skin-12053662.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/01/Of-skin-and-bones_-Scientists-develop-artificial-skin-for-robots-that-can-feel-things-humans-cant.jpg", "publishedAt": "2023-01-26T15:30:20Z", "content": "A team of researchers and scientists at the Nanyang Technological University in Singapore are all set to make robots more capable than humans. The researchers claim that they have developed artificia… [+2040 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Kartikeya Kohli", "title": "Mini-dose glucagon may prevent exercise-associated hypoglycemia in patients with type 1 diabetes - Medical Dialogues", "description": "Canada: Mini-dose glucagon with or without a 50% reduction in CSII (continuous subcutaneous insulin infusion) basal delivery rate may decrease exercise-associated hypoglycemia (EAH) incidence in...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/mini-dose-glucagon-may-prevent-exercise-associated-hypoglycemia-in-patients-with-type-1-diabetes-106133", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/25/199476-glucagon.jpg", "publishedAt": "2023-01-26T14:30:53Z", "content": "Canada: Mini-dose glucagon with or without a 50% reduction in CSII (continuous subcutaneous insulin infusion) basal delivery rate may decrease exercise-associated hypoglycemia (EAH) incidence in pati… [+2347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Are dry fruits beneficial for health? - The Indian Express", "description": "Are dry fruits beneficial for health?", "url": "https://indianexpress.com/web-stories/wellness/are-dry-fruits-beneficial-for-health/", "urlToImage": "https://images.indianexpress.com/2023/01/dry-fruits-1.jpg", "publishedAt": "2023-01-26T13:16:04Z", "content": "Raisins have been shown to increase powerful metabolically active hormones (e.g., GLP-1) which have a good effect on pancreas. Longer clinical studies, although few, show similar data."}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruby Khanna", "title": "Pelvic Floor Exercises for Men: Do They Work? - Sportskeeda", "description": "Pelvic floor exercises for men are as beneficial as they are for women. Yes, you heard that right.", "url": "https://www.sportskeeda.com/health-and-fitness/pelvic-floor-exercises-men-do-they-work", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/215a9-16747360861812-1920.jpg", "publishedAt": "2023-01-26T12:55:13Z", "content": "Pelvic floor exercises for men are as beneficial as they are for women. Yes, you heard that right.\r\nAlso called kegel exercises, pelvic floor workouts are important and offer a plethora of benefits. … [+4122 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study reveals cancer cells can alter their size to survive medication - ETHealthWorld", "description": "Researchers at The Institute of Cancer Research in London used biochemical profiling technology and mathematical analysis to demonstrate how genetic variations affect cancer cell growth and how these variations might be taken advantage of by future therapies.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/study-reveals-cancer-cells-can-alter-their-size-to-survive-medication/97349922", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97349922,imgsize-15902,width-1200,height-628,overlay-ethealthworld/study-reveals-cancer-cells-can-alter-their-size-to-survive-medication.jpg", "publishedAt": "2023-01-26T12:31:00Z", "content": "London: Researchers have found that cancer cells can alter their size to survive medication therapy or other environmental stressors.Researchers at The Institute of Cancer Research in London used bio… [+4588 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Why your French bulldogs and Shih Tzus need extra care - Mint Lounge", "description": "", "url": "https://lifestyle.livemint.com/relationships/pets/why-your-french-bulldogs-and-shih-tzus-need-extra-care-111674721779276.html", "urlToImage": "https://images.livemint.com/img/2023/01/26/1140x641/pugs_and_shih_tzus_unsplash_1674722132189_1674722140171_1674722140171.jpg", "publishedAt": "2023-01-26T08:56:10Z", "content": "Recently, there has been an increase in demand for French bulldogs and Shih Tzus. It could be due to how adorable these breeds appear, as well as the fact that their small size makes it easier to car… [+3986 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by PTI", "title": "Covid infection could damage foetuses of pregnant women, claims a study - India TV News", "description": "Oxygen, nutrients and metabolic products are exchanged between mother and child in the placenta. Attached to the uterine wall, this organ forms such a strong barrier against the coronavirus that only 3 per cent or fewer of foetuses whose mothers test positive…", "url": "https://www.indiatvnews.com/health/covid-infection-could-damage-foetuses-of-pregnant-women-claims-study-2023-01-26-842354", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/pregnant-1674720370.jpg", "publishedAt": "2023-01-26T08:07:41Z", "content": "Foetuses and placentas of pregnant women, especially those infected with COVID-19 at earlier points in the pandemic, were found to bear a greater risk of experiencing growth impairment or vascular le… [+3565 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Prerna Targhotra", "title": "Gut Health: 5 Natural Herbs To Help Better Your Digestion - Jagran English", "description": "", "url": "https://english.jagran.com/lifestyle/gut-health-natural-herbs-to-help-better-your-digestion-10062585", "urlToImage": "https://imgeng.jagran.com/images/2023/jan/herbsforguthealth1674719716413.jpg", "publishedAt": "2023-01-26T07:50:17Z", "content": "THE SAYING 'Health is wealth' is a golden rule that we all should abide by for our health and lifestyle. Following a strict daily diet which includes skipping the bare minimum quantities of food lead… [+1980 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Genetic Cancer: Cancers Can Run In The Family | Know Everything You Need To From An Expert - SHOWSHA", "description": "Can you inherit cancer? Yes, you can. Research indicates that certain cancers can run in the family. Here's all you need to know about genetic cancer, its ca...", "url": "https://www.youtube.com/watch?v=F_7LDOfU7DA", "urlToImage": "https://i.ytimg.com/vi/F_7LDOfU7DA/maxresdefault.jpg", "publishedAt": "2023-01-26T07:30:04Z", "content": null}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Booster dose of Covishield offers best immune response: study - EastMojo", "description": "New Delhi: A booster dose of Covishield offers the best immune response, irrespective of whether the primary doses were of Covishield or Covaxin,", "url": "http://www.eastmojo.com/national/2023/01/26/booster-dose-of-covishield-offers-best-immune-response-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/06/1433px-SII_Covishield_Bangalore_BESTpedia.jpg?fit=1433%2C1080&ssl=1", "publishedAt": "2023-01-26T04:30:00Z", "content": "New Delhi: A booster dose of Covishield offers the best immune response, irrespective of whether the primary doses were of Covishield or Covaxin, according to a new study conducted in India and publi… [+4563 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": "SMSala", "title": "WHO plans to establish a TB Vaccine Accelerator Council - Rising Kashmir", "description": "The adverse impact of the COVID-19 pandemic on tuberculosis (TB) services has brought the urgency of vaccine development efforts into sharp focus as it was discussed at a high-level panel on tuberculosis at the World Economic Forum, Dr. Tedros Adhanom Ghebrey…", "url": "http://risingkashmir.com/who-plans-to-establish-a-tb-vaccine-accelerator-council-dcbbe16a-66fb-4e68-8833-4cb727556688", "urlToImage": "http://admin.risingkashmir.com/Source/News/eedcc323-ad40-4912-aae5-2add45c8576f.jpg", "publishedAt": "2023-01-25T21:11:15Z", "content": "The adverse impact of the COVID-19 pandemic on tuberculosis (TB) services has brought the urgency of vaccine development efforts into sharp focus as it was discussed at a high-level panel on tubercul… [+5206 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Sneha Santuka", "title": "Top Sources of Potassium That Can Help Control High Blood Pressure - Sportskeeda", "description": "Including sources of potassium in your diet is extremely beneficial, especially for people suffering from high blood pressure or hypertension.", "url": "https://www.sportskeeda.com/health-and-fitness/top-sources-potassium-that-can-help-control-high-blood-pressure", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/e4c10-16746663337624-1920.jpg", "publishedAt": "2023-01-25T19:30:00Z", "content": "Including sources of potassium in your diet is extremely beneficial, especially for people suffering from high blood pressure or hypertension.\r\nWhen you consume more potassium, the body excretes more… [+4167 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Female, male hearts respond differently to stress hormone - mid-day.com", "description": "The findings may have implications for human heart disorders like arrhythmias and heart failure and how different sexes respond to medications, according to the study published in Science Advances", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/female-male-hearts-respond-differently-to-stress-hormone-23266849", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/heats-istock_d.jpg", "publishedAt": "2023-01-25T14:17:00Z", "content": "The findings may have implications for human heart disorders like arrhythmias and heart failure and how different sexes respond to medications, according to the study published in Science Advances\r\nR… [+1969 chars]"}]}