{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "Stoptb.org"}, "author": null, "title": "For four days, the anciente city of Varanasi (INDIA) becomes the brain and heart of the global TB response. - Stop TB Partnership", "description": "GENEVA, SWITZERLAND - For the first time ever, the Stop TB Partnership Board will meet in person during the World TB Day, in India - the country with the highest TB Burden and at the same time - the", "url": "https://www.stoptb.org/news/four-days-anciente-city-of-varanasi-india-becomes-brain-and-heart-of-global-tb-response", "urlToImage": null, "publishedAt": "2023-03-19T21:33:59Z", "content": "GENEVA, SWITZERLAND - For the first time ever, the Stop TB Partnership Board will meet in person during the World TB Day, in India - the country with the highest TB Burden and at the same time - the … [+4619 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Priyanka Rudrappa", "title": "Karnataka steps up measures to tackle measles resurgence - Hindustan Times", "description": "In Karnataka, measles cases were reported at 4.18 per 1 million population in 2021. The incidence has doubled in 2022 to 8.52 per 1 million population, according to a health department official | Bengaluru News", "url": "https://www.hindustantimes.com/cities/bengaluru-news/karnataka-steps-up-measures-to-tackle-measles-resurgence-101679253196732.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/19/1600x900/Health-officials-in-Karnataka-are-rushing-to-contr_1679253195519.jpg", "publishedAt": "2023-03-19T19:13:16Z", "content": "Amid a spike in measles cases across several states, health officials in Karnataka are rushing to control the outbreak and achieve the deadline of eliminating the disease by 2023.\r\nHealth officials i… [+7306 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Streptococcus Group G of Unknown Source as a Rare Cause of Endogenous Endophthalmitis - Cureus", "description": "Endogenous endophthalmitis occurs in the setting of an intraocular infection secondary to the spread of bacterial, viral, or fungal pathogens with a high likelihood of permanent vision loss if left untreated. This case describes a 33-year-old male with numero…", "url": "https://www.cureus.com/articles/142998-streptococcus-group-g-of-unknown-source-as-a-rare-cause-of-endogenous-endophthalmitis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/577943/article_river_0310e550bc8311edbf72cdff36123563-endogenous-endo-1.png", "publishedAt": "2023-03-19T17:44:08Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Symptoms In H3N2 Virus Similar To What We See In Covid: Doctor - NDTV", "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News", "url": "https://www.ndtv.com/", "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png", "publishedAt": "2023-03-19T17:17:28Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Satata Karmakar", "title": "H3N2 Virus Spreading Rapidly In India: Delhi Put On High Alert Govt Issues Fresh Advisory | TheHealthSite - TheHealthSite", "description": "The government has issued a COVID-like advisory in 6 Indian states. These states are Kerala Karnataka Tamil Nadu Telangana Maharashtra and Gujarat. TheHealthSite.com", "url": "https://www.thehealthsite.com/news/h3n2-live-updates-delhi-on-high-alert-after-11-months-old-tests-positive-in-gurugram-962906/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2023/03/H3N2-Live-Updates.jpg", "publishedAt": "2023-03-19T16:40:23Z", "content": "H3N2 Live Updates: Delhi On High Alert After 11-Months-Old Tests Positive In Gurugram\r\nThe government has issued a COVID-like advisory in 6 Indian states. These states are Kerala, Karnataka, Tamil Na… [+1379 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Memories might be lost if two crucial brain areas fail to sync: Research - ANI News", "description": "Many unique groups of neurons connected inside and across crucial areas of the brain aid in learning, remembering, and retrieving memories. A recent study led by the universities of Bristol and Heidelberg showed that if these neuronal assemblies fail to sync …", "url": "https://www.aninews.in/news/health/memories-might-be-lost-if-two-crucial-brain-areas-fail-to-sync-research20230319205305", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230319142518.jpg", "publishedAt": "2023-03-19T15:23:00Z", "content": "Bristol [UK], March 19 (ANI): Many unique groups of neurons connected inside and across crucial areas of the brain aid in learning, remembering, and retrieving memories. A recent study led by the uni… [+2366 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Vitamin A may reduce pancreatitis risk: Research - ANI News", "description": "A diet high in vitamin A or its analogues may help prevent children and young adults with acute lymphoblastic leukaemia (ALL) from developing painful pancreas inflammation during chemotherapy.", "url": "https://www.aninews.in/news/health/vitamin-a-may-reduce-pancreatitis-risk-research20230319205058", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230319152040.jpg", "publishedAt": "2023-03-19T15:20:00Z", "content": "Cincinnati [US], March 19 (ANI): A diet high in vitamin A or its analogues may help prevent children and young adults with acute lymphoblastic leukaemia (ALL) from developing painful pancreas inflamm… [+3189 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Research suggests blood immune cells can proliferate - ThePrint", "description": "Liege [Belgium], March 19 (ANI): A cell’s ability to multiply and divide is necessary for life, resulting in the evolution of complex creatures from a single cell. It also allows worn-out cells to be replaced by a small number of “stem” cells, which subsequen…", "url": "https://theprint.in/science/research-suggests-blood-immune-cells-can-proliferate/1456450/", "urlToImage": null, "publishedAt": "2023-03-19T15:17:14Z", "content": "Liege [Belgium], March 19 (ANI): A cell’s ability to multiply and divide is necessary for life, resulting in the evolution of complex creatures from a single cell. It also allows worn-out cells to be… [+2851 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Key role identified for nervous system in severe allergic shock - ThePrint", "description": "North Carolina [US], March 19 (ANI): An abrupt drop in blood pressure and body temperature is a key feature of the severe allergic reaction known as anaphylaxis, causing people to faint and, if untreated, potentially die. That response has long been attribute…", "url": "https://theprint.in/health/key-role-identified-for-nervous-system-in-severe-allergic-shock/1456449/", "urlToImage": null, "publishedAt": "2023-03-19T15:17:11Z", "content": "North Carolina [US], March 19 (ANI): An abrupt drop in blood pressure and body temperature is a key feature of the severe allergic reaction known as anaphylaxis, causing people to faint and, if untre… [+2629 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Here's how cancer cells repair DNA damage - ThePrint", "description": "Daejeon [South Korea], March 19 (ANI): A team of scientists led by Dr Kei-ichi TAKATA from the Institute for Basic Science’s Center for Genomic Integrity (CGI) discovered a new type of DNA repair mechanism that cancer cells use to recover from next-generation…", "url": "https://theprint.in/health/heres-how-cancer-cells-repair-dna-damage/1456436/", "urlToImage": null, "publishedAt": "2023-03-19T15:16:38Z", "content": "Daejeon [South Korea], March 19 (ANI): A team of scientists led by Dr Kei-ichi TAKATA from the Institute for Basic Science’s Center for Genomic Integrity (CGI) discovered a new type of DNA repair mec… [+4893 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Physical activity can help patients with Parkinson’s disease improve their quality of life: Research - ThePrint", "description": "London [UK], March 19 (ANI): Physical activity can improve both the quality of life and the severity of movement-related symptoms in Parkinson’s disease patients. According to the preliminary Cochrane review of available research, any type of organised exerci…", "url": "https://theprint.in/health/physical-activity-can-help-patients-with-parkinsons-disease-improve-their-quality-of-life-research/1456417/", "urlToImage": null, "publishedAt": "2023-03-19T15:15:42Z", "content": "London [UK], March 19 (ANI): Physical activity can improve both the quality of life and the severity of movement-related symptoms in Parkinson’s disease patients. According to the preliminary Cochran… [+5085 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "Suffering from bloating problems? Include these in your diet - NewsBytes", "description": "Often associated with gas, indigestion, and constipation, bloating is a common problem \\that can cause discomfort in your tummy and make it feel full or bigger than usual", "url": "https://www.newsbytesapp.com/news/lifestyle/5-foods-that-can-help-with-bloating/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l96420230206184205.jpeg", "publishedAt": "2023-03-19T14:50:05Z", "content": "Suffering from bloating problems? Include these in your diet\r\nMar 19, 2023, 08:20 pm2 min read\r\nOften associated with gas, indigestion, and constipation, bloating is a common problem among people tha… [+2368 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Erin Marie", "title": "Fitness Expert Shares 4 Top Healthy Snacks - Health Digest", "description": "In an interview with Health Digest, Rachel MacPherson, an ACE-CPT and certified exercise nutritionist, shared her top four favorite go-to healthy snacks.", "url": "https://www.healthdigest.com/1229691/fitness-expert-shares-4-top-healthy-snacks/", "urlToImage": "https://www.healthdigest.com/img/gallery/fitness-expert-shares-4-top-healthy-snacks/l-intro-1678967131.jpg", "publishedAt": "2023-03-19T14:00:00Z", "content": "For those who enjoy a snack following dinner, MacPherson says whole-grain ricotta toast is one option that's not only healthy but also versatile. \"You can top it either savory or sweet,\" she says. \"F… [+1114 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "8 foods that can help boost health naturally - Indiatimes.com", "description": "Here’s a list of natural foods that you should have throughout the week.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/8-foods-that-can-help-boost-health-naturally/photostory/98771648.cms", "urlToImage": "https://static.toiimg.com/photo/98771657.cms", "publishedAt": "2023-03-19T13:30:00Z", "content": "When it comes to living a healthy lifestyle, we often get stuck between two thoughts 'stick to diet' and 'binge on junk food'. As per experts, it is important to have a balance of everything, so that… [+340 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Hrishita Chatterjee", "title": "The Possible Connection between Mental Health and Oral Health — Transcontinental Times - Transcontinental Times", "description": "UNITED STATES: A study that was conducted in order to examine the relation between mental health and oral health and that was later presented at the 52nd Annual Meeting and Exhibition of the AADOCR in association with the 47th Annual Meeting of the CADR held …", "url": "https://www.transcontinentaltimes.com/connection-mental-health-oral-health/", "urlToImage": "https://media.transcontinentaltimes.com/2023/03/Oral-Health.jpg.webp", "publishedAt": "2023-03-19T13:12:55Z", "content": "UNITED STATES: A study that was conducted in order to examine the relation between mental health and oral health and that was later presented at the 52nd Annual Meeting and Exhibition of the AADOCR i… [+1630 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Dr Medha Gupta", "title": "Expert Explains Mesothelial Cancer, The Deadliest Of All - Boldsky", "description": "Mesothelial cancer, or mesothelioma, is a cancer of the body tissues that cover the organs. The mesothelium is a layer of tissues that lines and protects almost all major organs in the body. Read more here.", "url": "https://www.boldsky.com/health/what-is-mesothelial-cancer-causes-symptoms-risks-and-treatment-145117.html", "urlToImage": "https://www.boldsky.com/img/1200x60x675/2023/03/mesothelialcancer-1679227393.jpg", "publishedAt": "2023-03-19T13:05:09Z", "content": "Mesothelial cancer, or mesothelioma, is a cancer of the body tissues that cover the organs. The mesothelium is a layer of tissues that lines and protects almost all major organs in the body.\r\nCancer … [+5683 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Surbhi Kapila", "title": "What is making young hearts weak? - Hindustan Times", "description": "Experts blame Covid-19, WFH-induced stress and excessive workouts for the alarming rise in heart attacks among young people. Give your life a healthy, holistic overhaul, they advise. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/what-is-making-young-hearts-weak-101679229482814.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/19/1600x900/The-number-of-people-suffering-from-heart-attacks-_1679229961861.jpg", "publishedAt": "2023-03-19T12:38:02Z", "content": "When actor Sushmita Sen revealed on Instagram that she had suffered a massive heart attack, she left her fans and industry peers in shock. Despite having an active lifestyle, the 47-year-old had 95% … [+5199 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "UTI can also affect children: Know the symptoms and how to avoid urinary tract infections - Health shots", "description": "Urinary tract infections can also affect kids. Here are some ways that will help you keep urinary tract infections in children at bay.", "url": "https://www.healthshots.com/preventive-care/family-care/uti-in-children-heres-how-to-keep-urinary-tract-infection-in-kids/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/03/19090746/UTI-2.jpg", "publishedAt": "2023-03-19T12:30:58Z", "content": "Urinary tract infections (UTIs) don’t just affect adults, they can affect kids too! A UTI is a common, short-term sickness that can be painful and uncomfortable for your infant, child, or toddler, an… [+3313 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Health Desk", "title": "Hibiscus for heart health: Benefits that you should know to avoid diseases - India TV News", "description": "Hibiscus is a heart-protective food that offers numerous benefits. It can lower blood pressure, reduce cholesterol levels, reduce inflammation, and provide antioxidant protection. Incorporating hibiscus into your diet can be an excellent way to support heart …", "url": "https://www.indiatvnews.com/health/hibiscus-for-heart-health-benefits-that-you-should-know-to-avoid-diseases-2023-03-19-855591", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/03/hiibiscus-1679129099.jpg", "publishedAt": "2023-03-19T12:30:01Z", "content": "Hibiscus, commonly known as \"gudhal\" in Hindi, is a popular flowering plant that belongs to the Malvaceae family. This plant is known for its beautiful flowers, which are used for decorative purposes… [+2245 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "Yoga for seniors can help regain strength, as per study - Sportskeeda", "description": "Yoga has been shown to be an effective way for seniors to regain strength and maintain their overall health.", "url": "https://www.sportskeeda.com/health-and-fitness/yoga-seniors-can-help-regain-strength-per-study", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/03/977e7-16792244798946-1920.jpg", "publishedAt": "2023-03-19T12:18:00Z", "content": "Yoga has been shown to be an effective way for seniors to regain strength and maintain their overall health. As we age, it's common to experience a loss of muscle strength, which can lead to many hea… [+3388 chars]"}, {"source": {"id": null, "name": "Boldsky.com"}, "author": "Amritha K", "title": "How Are The Symptoms Of Heart Attack Different In Women? Six Major Signs - Boldsky", "description": "In contrast to men, women can develop heart attack symptoms that are often more subtle and harder to detect. Read more on how are the symptoms of heart attack different in women.", "url": "https://www.boldsky.com/health/symptoms-of-heart-attack-different-in-women-145116.html", "urlToImage": "https://www.boldsky.com/img/1200x60x675/2023/03/-heartattackdifferentinwomen-1679226528.jpg", "publishedAt": "2023-03-19T12:00:18Z", "content": "A major problem in diagnosing women with heart disease is the lack of recognition of symptoms that may be related to the disease or that are not classified as classic heart symptoms.\r\nIn contrast to … [+3085 chars]"}, {"source": {"id": null, "name": "Morungexpress.com"}, "author": null, "title": "Can HIV self-test help India end AIDS? - Morung Express", "description": "New Delhi, March 19 (IANS) Testing is paramount to identify HIV cases, and making self-testing a national policy can certainly pave the way for ending AIDS in India, health experts contended on Sunday.", "url": "https://www.morungexpress.com/", "urlToImage": "https://morungexpress.com/uploads/2023/03/64609661_1679223373_2a2df53fc093861be89f4b468547136b.jpg", "publishedAt": "2023-03-19T11:00:26Z", "content": "New Delhi, March 19 (IANS) Testing is paramount to identify HIV cases, and making self-testing a national policy can certainly pave the way for ending AIDS in India, health experts contended on Sunda… [+4669 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Female Healthcare: 5 Key Diagnostic Tests Women Over 30 Must Consider - Zee News", "description": "We have all heard that age doesn`t matter if your heart is full of life, while it may be true in some sense, one needs to be attentive about their age and address the complexities it brings into life. They become more susceptible to a multitude of diseases wa…", "url": "https://zeenews.india.com/health/female-healthcare-5-key-diagnostic-tests-women-over-30-must-consider-2585504", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/03/19/1169875-screening-tests-for-women.jpg", "publishedAt": "2023-03-19T10:32:12Z", "content": "Women's Heath: We have all heard that \"age doesn`t matter if your heart is full of life,\" while it may be true in some sense, one needs to be attentive about their age and address the complexities it… [+5763 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Thomas Page", "title": "A UK program will sequence the genomes of 100,000 newborn babies - CNN", "description": "A pioneering scheme testing for hundreds of rare genetic conditions could prevent untold pain and misery for babies and their families in the UK.", "url": "https://www.cnn.com/2023/03/19/health/newborn-genomes-programme-uk-genomics-scn-spc-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230301153134-20230301-decoded-genomics-pagetop.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-19T09:45:00Z", "content": "The UK is set to begin sequencing the genomes of 100,000 newborn babies later this year. It will be the largest study of its kind, mapping the babies complete set of genetic instructions, with potent… [+11858 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Emine Saner", "title": "Chew slowly, keep moving and eat 30 plants a week: 12 rules for gut health - The Guardian", "description": "What to eat, when, how to do it properly – and what to avoid. Experts lay out the food habits that will make a real difference to your health", "url": "https://www.theguardian.com/lifeandstyle/2023/mar/19/chew-slowly-keep-moving-and-eat-30-plants-a-week-12-rules-for-gut-health", "urlToImage": "https://i.guim.co.uk/img/media/457e3072dea9cab2f30a8af641cb60fec0902677/268_660_4686_2813/master/4686.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7404646efe06ac917bf10edd9c5f3480", "publishedAt": "2023-03-19T09:05:00Z", "content": "When we think about gut health, we tend to focus on food. Food is just one part of it, and I think people either engage in food-blaming, or think they need to eat all these expensive things, says nut… [+11442 chars]"}, {"source": {"id": null, "name": "SHINE"}, "author": null, "title": "Local experts make breakthrough in cancer treatment - SHINE News", "description": "Local scientists and medical experts have uncovered why hot CAR-T immunotherapy has a poorer effect", "url": "https://www.shine.cn/news/metro/2303197461/", "urlToImage": "https://obj.shine.cn/files/2023/03/19/d9082e9e-e3e5-43e8-bcdc-030d324dfd5b_0.jpg", "publishedAt": "2023-03-19T08:15:00Z", "content": "Local scientists and medical experts have uncovered why hot CAR-T immunotherapy has a poorer effect on solid cancers than blood diseases.\r\nThe CAR-T, or Chimeric Antigen Receptor T-Cell Immunotherapy… [+1787 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Shreeja Bhattacharya", "title": "From Reducing Stress to Active Lifestyle, Tips to Improve Fertility - News18", "description": "If you are unable to conceive, talk to your physician first about the issue and if there are any lifestyle changes that you need to adopt.", "url": "https://www.news18.com/lifestyle/from-reducing-stress-to-active-lifestyle-tips-to-improve-fertility-7326691.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/03/untitled-design-2023-03-19t134125.911-167921352116x9.png", "publishedAt": "2023-03-19T08:12:39Z", "content": "Infertility affects 186 million people globally, according to a new study by the Harvard Medical School. In a large number of cases, no proper reason can be found for the problem. Some factors that c… [+2546 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "High Sugar, Fat Diet Linked With Chronic Liver Disease: Study - Zee News", "description": "Seasonal Flu: Dengue Returns As The Seasons Change While Influenza Is Still Rampant  Fatty liver disease is a global health epidemic, said Kevin Staveley-O`Carroll, MD, Ph.D., professor in the department of surgery, one of the lead researchers.", "url": "https://zeenews.india.com/health/high-sugar-fat-diet-linked-with-chronic-liver-disease-study-2585430", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/03/19/1169766-sugar-diet.jpg", "publishedAt": "2023-03-19T07:19:58Z", "content": "The University of Missouri School of Medicine has discovered a link between high-fat, high-sugar Western diets and the development of non-alcoholic fatty liver disease, the leading cause of chronic l… [+2280 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study suggests how combination of drugs help to reduce lung tumors - ThePrint", "description": "La Jolla (California) [US], March 19 (ANI): Personalization of cancer treatments has long been a goal–finding the right drugs that work for a patient’s specific tumour based on specific genetic and molecular patterns. Many of these targeted therapies are high…", "url": "https://theprint.in/science/study-suggests-how-combination-of-drugs-help-to-reduce-lung-tumors/1455497/", "urlToImage": null, "publishedAt": "2023-03-19T07:14:51Z", "content": "La Jolla (California) [US], March 19 (ANI): Personalization of cancer treatments has long been a goal–finding the right drugs that work for a patient’s specific tumour based on specific genetic and m… [+4431 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "H3N2 may not pose threat but caution must - Times of India", "description": "Adaptation and survival are the essential evolutionary paradigms applicable to the host and pathogen. The recent spurt in viral cases results from a n", "url": "https://timesofindia.indiatimes.com/city/lucknow/h3n2-may-not-pose-threat-but-caution-must/articleshow/98769218.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-98769204,width-1070,height-580,imgsize-793278,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-03-19T06:49:00Z", "content": ""}, {"source": {"id": null, "name": "Slurrp.com"}, "author": null, "title": "7 Reasons Why You Should Avoid Prepackaged Food - Slurrp", "description": "7 Reasons Why You Should Avoid Prepackaged Food 7 Reasons Why You Should Avoid Prepackaged Food By Vidushi Singh Pre-packaged foods are quick", "url": "https://www.slurrp.com/web-stories/7-reasons-why-you-should-avoid-prepackaged-food/", "urlToImage": "https://images.slurrp.com/webstories/wp-content/uploads/2023/03/19121139/cropped-IMG_1355.jpg", "publishedAt": "2023-03-19T06:45:35Z", "content": "Trans fat, which comes from hydrogenated oil, is added to pre-packaged food to extend its shelf life, which is  linked to heart disease, stroke, and heart attacks."}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Utsa Ganguly", "title": "Detox Juices Made By Blending Fruits And Vegetables May Have Adverse Effects. See What Experts Say - ABP Live", "description": "There are people who also consider detox juices as a way of losing weight and getting the necessary nutrient intake. Though this may seem to be a shortcut, it may have long-term ill effects.", "url": "https://news.abplive.com/lifestyle/detox-juices-made-by-blending-fruits-and-vegetables-may-have-adverse-effects-see-what-experts-say-1589229", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/18/daa8de1b825d679dc33d8f88bbd968621679119333401557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-03-19T06:19:00Z", "content": "New Delhi: Most of us consume juices on a daily basis considering them to be a healthy option. We tend to blend different fruits and vegetables to make a variety of detox juices or smoothies as healt… [+5365 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "How To Control Diabetes Naturally- Try these drinks?P2 - ఇండియా హెరాల్డ్ గ్రూప్ అఫ్ పబ్లిషర్స్ ప్రై లిమిటెడ్ - India Herald Group of Publishers P LIMITED ", "description": "health : How To Control Diabetes Naturally- Try these drinks?P2\nThe secret to managing either prediabetes or diabetes is understanding how to naturall", "url": "https://www.indiaherald.com/Health/Read/994580948/How-To-Control-Diabetes-Naturally-Try-these-drinksP", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/how-to-control-diabetes-naturally-try-these-drinksp65a4d0fe-7e1a-4d5d-8a84-7ded91b6fe9a-415x250-IndiaHerald.jpg", "publishedAt": "2023-03-19T06:12:49Z", "content": "How To Control diabetes Naturally- Try these drinks?P2\r\nThe secret to managing either prediabetes or diabetes is understanding how to naturally lower your blood sugar levels. Take into account doing … [+1257 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "How to use raisins to make chutneys, cookies and payasam - Mint Lounge", "description": "Fry, ferment or use them uncooked to add a hint of sweetness in a variety of dishes", "url": "https://lifestyle.livemint.com/food/cook/how-to-use-raisins-to-make-chutneys-cookies-and-payasam-111679200299453.html", "urlToImage": "https://images.livemint.com/img/2023/03/19/1140x641/raisin_recipes_for_chutney_cookies_1679202020559_1679202031965_1679202031965.jpg", "publishedAt": "2023-03-19T05:32:05Z", "content": "A handful of raisins added to hot ghee and fried on a low flame until plump and a few shades darker, transferred over payasam, make for the most delicious garnish, along with cashew nuts, of course. … [+5257 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Delhi witnesses rise in H3N2 virus, COVID cases; experts urge to remain cautious - Economic Times", "description": "Amid the country witnessing a slight increase in the H3N2 and COVID-19 cases, cases have also been surging in the National Capital. With the patients lining up at the hospital once again over COVID and H3N2, experts urged people to stay alert and asked to tak…", "url": "https://economictimes.indiatimes.com/news/india/delhi-witnesses-rise-in-h3n2-virus-covid-cases-experts-urge-to-remain-cautious/videoshow/98767778.cms", "urlToImage": "https://img.etimg.com/thumb/msid-98767778,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-03-19T05:15:00Z", "content": "Amid the country witnessing a slight increase in the H3N2 and COVID-19 cases, cases have also been surging in the National Capital. With the patients lining up at the hospital once again over COVID a… [+435 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study suggest new strategy to treat cause of sudden cardiac arrest in athletes - ANI News", "description": "Scientists from the University of Utah Health have corrected abnormal heart rhythms in mice by restoring healthy levels of a protein that heart cells require to connect with one another. GJA1-20k is a protein that is underproduced in people with arrhythmogeni…", "url": "https://www.aninews.in/news/health/study-suggest-new-strategy-to-treat-cause-of-sudden-cardiac-arrest-in-athletes20230319103947", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230319050940.jpg", "publishedAt": "2023-03-19T05:09:00Z", "content": "Washington [US], March 19 (ANI): Scientists from the University of Utah Health have corrected abnormal heart rhythms in mice by restoring healthy levels of a protein that heart cells require to conne… [+4229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Do you often feel lightheaded or dizzy? Add these foods to your diet - The Indian Express", "description": "\"The usual parameter is the rule of 15:15 which means eating or drinking a snack with 15 grams of carbohydrates and waiting for 15 minutes,\" Garima Goyal, a dietitian, shared", "url": "https://indianexpress.com/article/lifestyle/health/feel-light-headed-dizzy-often-8242785/", "urlToImage": "https://images.indianexpress.com/2021/09/GettyImages-dizziness-1200.jpg", "publishedAt": "2023-03-19T03:40:17Z", "content": "While many tend to ignore feelings of lightheadedness or dizziness, it’s crucial to pay attention to the same as they can be signals of certain other health conditions. According to Garima Goyal, a d… [+3252 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Snake venom may help prevent Parkinson’s and Alzheimer’s - Indiatimes.com", "description": "Soon, snake venom could help treat neurodegenerative disorders like Parkinson’s disease and Alzheimer’s. Researchers from the Institute of Advanced S", "url": "https://timesofindia.indiatimes.com/city/bengaluru/snake-venom-may-help-prevent-parkinsons-and-alzheimers/articleshow/98765522.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-03-19T02:40:00Z", "content": ""}, {"source": {"id": null, "name": "News18"}, "author": "Swati Chaturvedi", "title": "Are Heart Attacks At 60 Becoming As Routine As Diabetes At 35? Experts Answer - News18", "description": "Aging is a major factor in the decline in cardiovascular health, which increases the risk of cardiovascular disease (CVD) in older persons", "url": "https://www.news18.com/lifestyle/are-heart-attacks-at-60-becoming-as-routine-as-diabetes-at-35-experts-answer-7327555.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/01/untitled-design-32-167283101116x9.png", "publishedAt": "2023-03-19T00:36:39Z", "content": "Heart attacks at the age of 60 are becoming as routine as diabetes at 35. With the rapid rise in unhealthy lifestyle choices such as sedentary habits, unhealthy eating, and smoking, heart disease is … [+4967 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Neha Madaan", "title": "'Covid may hit cognitive skills up to 18 months post recovery' - Indiatimes.com", "description": "Covid infection could affect the cognitive abilities of patients even up to 4-18 months after recovery, a recent study by the Laboratory of Neural Cir", "url": "https://timesofindia.indiatimes.com/city/pune/covid-may-hit-cognitive-skills-up-to-18-months-post-recovery/articleshow/98764334.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-98764341,width-1070,height-580,imgsize-27546,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-03-19T00:20:00Z", "content": ""}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Bald eagles are threatened by avian influenza - Earth.com", "description": "Bald eagles are threatened by avian influenza • Earth.com", "url": "https://www.earth.com/news/bald-eagles-are-threatened-by-avian-influenza/", "urlToImage": "https://cff2.earth.com/uploads/2023/03/18143954/Bald-eagle-scaled.jpg", "publishedAt": "2023-03-18T20:42:52Z", "content": "After their near extinction in the 1960s, bald eagle populations rebounded significantly – a phenomenon considered by many scientists a massive conservation success story. However, a recent study led… [+2788 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "It's #EndometriosisAwarenessMonth. Did You Know? 190 Million Women & Girls of ... - Latest Tweet by World - LatestLY", "description": "The latest Tweet by World Health Organization states, 'It's #EndometriosisAwarenessMonth. Did you know? 190 million women &amp; girls of reproductive age is affected by endometriosis globally. #WomensHealth Chatbot on @Viber 📱 keeps you informed on the risks…", "url": "https://www.latestly.com/socially/world/its-endometriosisawarenessmonth-did-you-know-190-million-women-girls-of-latest-tweet-by-world-health-organization-4964257.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/10/World-Health-Organisation-784x441.jpg", "publishedAt": "2023-03-18T19:04:17Z", "content": "It's #EndometriosisAwarenessMonth. \r\nDid you know? 190 million women &amp; girls of reproductive age is affected by endometriosis globally. #WomensHealth Chatbot on @Viber keeps you informed on the r… [+595 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Ikaria Lean Belly Juice Reviews 2023 (Critical Customer Latest Weight Loss Update) Official Website! Any Negative Review & Side Effects! - mid-day.com", "description": "Ikaria Lean Belly Juice Real Reviews by the customer - Read my personal Ikaria Lean Belly Juice Review about the official website, negative reviews, weight loss, taste, benefits, drawbacks and conclusion & availability in Australia.", "url": "https://www.mid-day.com/brand-media/article/ikaria-lean-belly-juice-reviews-2023-critical-customer-latest-weight-loss-updat-23275987", "urlToImage": "https://images.mid-day.com/images/images/2023/mar/Ikaria-Lean-Belly1_d.jpg", "publishedAt": "2023-03-18T15:43:00Z", "content": "Ikaria Lean Belly Juice Real Reviews by the customer - Read my personal Ikaria Lean Belly Juice Review about the official website, negative reviews, weight loss, taste, benefits, drawbacks and conclu… [+20411 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Influenza superfoods: Down with flu? Include these 5 superfoods in your diet for easy recovery - Indiatimes.com", "description": "As per various media reports, this influenza virus spreads through the eyes, nose and mouth. Symptoms of fever, cold, cold, headache, body ache, diarrhoea etc., can be seen in a patient suffering from influenza, and most of these symptoms are quite similar to…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/influenza-superfoods-down-with-flu-include-these-5-superfoods-in-your-diet-for-easy-recovery/photostory/98757921.cms", "urlToImage": "https://static.toiimg.com/photo/98757924.cms", "publishedAt": "2023-03-18T15:30:00Z", "content": "The world has already seen the mayhem created by the deadly coronavirus, and now there have been several cases of influenza variant H3N2 that are increasing day by day. As the death tally goes up due… [+1069 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "[Fast Check] South Africa Tim Noakes Gummies Dischem Alert (Keto Extreme Fat Burner Tim Noakes) Tim Noakes Keto Gummies 2023 Za Reports - mid-day.com", "description": "Tim Noakes Gummies & Keto Extreme fat burner tim noakes South Africa Dischem Keto ZA Alert Let’s Keto Gummies Top Selling.", "url": "https://www.mid-day.com/brand-media/article/fast-check-south-africa-tim-noakes-gummies-dischem-alert-keto-extreme-fat-23275981", "urlToImage": "https://images.mid-day.com/images/images/2023/mar/Southh-Africa-Tim1_d.jpg", "publishedAt": "2023-03-18T15:09:00Z", "content": "Tim Noakes Gummies &amp; Keto Extreme fat burner tim noakes South Africa Dischem Keto ZA Alert Lets Keto Gummies Top Selling.\r\nEveryone considers fat as their ultimate enemy in the course of weight l… [+10134 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Researchers Find New Genes Linked With Schizophrenia Risk - NDTV", "description": "A recent cross-cultural study reveals two previously unknown genes linked to schizophrenia.", "url": "https://www.ndtv.com/feature/researchers-find-new-genes-linked-with-schizophrenia-risk-3872678", "urlToImage": "https://i.ndtvimg.com/i/2017-09/schizophrenia_650x400_71504628772.jpg", "publishedAt": "2023-03-18T12:54:21Z", "content": "The study demonstrates that risk is shared by all races.\r\nA new study has linked schizophrenia, a mental disorder in which people interpret reality abnormally, with two newly discovered genes. Also a… [+1947 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Paroxysmal kinesigenic dyskinesia: Causes, symptoms, treatment - Hindustan Times", "description": "The movement disorder, paroxysmal kinesigenic dyskinesia, is a neurologic condition. Here are its causes, symptoms and treatment | Health", "url": "https://www.hindustantimes.com/lifestyle/health/paroxysmal-kinesigenic-dyskinesia-causes-symptoms-treatment-101679142473478.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/18/1600x900/ahmad-odeh-KHipnBn7sdY-unsplash_1679142869624_1679142888907_1679142888907.jpg", "publishedAt": "2023-03-18T12:41:12Z", "content": "The movement disorder paroxysmal kinesigenic dyskinesia (PKD) is caused by abrupt voluntary movements where the disease is characterised by outbreaks of chorea that dissipate within minutes and may r… [+2547 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Here’s what your urine colour is telling you about your health - Indiatimes.com", "description": "There are many other causes of colour change in urine, including the foods you eat, the medications you take, and certain medical disorders.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/heres-what-your-urine-colour-is-telling-you-about-your-health/photostory/98756829.cms", "urlToImage": "https://static.toiimg.com/photo/98756860.cms", "publishedAt": "2023-03-18T12:30:00Z", "content": "As a means of eliminating waste and excess water that the body does not require, urine serves a crucial purpose in the body. Urine passes via the urinary system, a pathway that contains kidneys that … [+511 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Explainers", "title": "Explained: The killer fungus wiping out the frog species - Firstpost", "description": "The fungus named Batrachochytrium dendrobatidis affects the keratin in the skin of amphibians, resulting in skin infections and lesions. A 2019 study has said that the fungal infection is to blame for the reduction of 39 per cent of frog species across the wo…", "url": "https://www.firstpost.com/explainers/explained-the-killer-fungus-wiping-out-the-frog-species-12313642.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2023/03/AP23072420992206-1.jpg", "publishedAt": "2023-03-18T12:28:38Z", "content": "The worst fungus to ever infect wildlife is back, and it’s causing another epidemic!\r\nIt is expanding across Africa and killing out or driving to the verge of extinction hundreds of amphibian species… [+3740 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "5 tips to keep seasonal flu at bay amid rise of influenza cases - DNA India", "description": "The symptoms of Covid and H3N2 virus are almost the same. Symptoms such as headache, muscle pain, fatigue, sore throat, runny nose, cough, fever, phlegm in the throat, diarrhea, difficulty in breathing have been observed in the cases reported so far.", "url": "https://www.dnaindia.com/health/report-5-tips-to-keep-seasonal-flu-at-bay-amid-rise-of-influenza-cases-h3n2-covid-19-3030774", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/03/18/2579839-untitled-design-2023-03-18t171533.884.jpg", "publishedAt": "2023-03-18T12:22:47Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Mar 18, 2023, 05:52 PM ISTThese days, Coronavirus and Influenza virus 'H3N2 virus' together have created panic in India. Where Co… [+2977 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Ruchika Mishra", "title": "New study uncovers role of beta cells in development of diabetes - Sportskeeda", "description": "Millions around the world suffer from the chronic disease of diabetes. High blood glucose level results from improper insulin production or utilization.", "url": "https://www.sportskeeda.com/health-and-fitness/new-study-uncovers-role-beta-cells-development-diabetes", "urlToImage": "https://staticc.sportskeeda.com/editor/2023/03/ac9e7-16791411477576-1920.jpg", "publishedAt": "2023-03-18T12:20:00Z", "content": "Millions around the world suffer from the chronic disease of diabetes. High blood glucose level results from improper insulin production or utilization.\r\nAccording to a recent study by scientists at … [+3359 chars]"}, {"source": {"id": null, "name": "B2bchief.com"}, "author": "B2BChief", "title": "Stress may not directly cause infertility but affects fertility | Tips to manage | Health - B2BCHIEF", "description": "Most couples’ lives are built around conception and reproduction after a few years of being together and as a result, if faced with challenges while conceiving, it can lead to emotional and mental stress in both spouses. A stress reaction can be triggered by …", "url": "https://b2bchief.com/stress-may-not-directly-cause-infertility-but-affects-fertility-tips-to-manage-health/", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/18/550x309/pexels-vera-arsic-984949_1679137634506_1679137655793_1679137655793.jpg", "publishedAt": "2023-03-18T12:16:30Z", "content": "Most couples’ lives are built around conception and reproduction after a few years of being together and as a result, if faced with challenges while conceiving, it can lead to emotional and mental st… [+4230 chars]"}, {"source": {"id": null, "name": "Finnoexpert.com"}, "author": null, "title": "Her doctor said her illness was all in her head. This scientist was determined to find the truth. - Finnoexpert", "description": "Taped above a tidy wooden desk in the corner of her bedroom, right at eye level, is a piece of paper that Marlena Fejzo has saved for 24 years.", "url": "https://finnoexpert.com/2023/03/18/her-doctor-said-her-illness-was-all-in-her-head-this-scientist-was-determined-to-find-the-truth-2/", "urlToImage": "https://www.boston.com/wp-content/uploads/2023/03/00FEJZO-PROFILE10-lfjc-superJumbo-6415a8e58da3f.jpg", "publishedAt": "2023-03-18T12:12:34Z", "content": "Health \r\n It was so devastating what happened to me that I dont want that to happen to anyone else, Marlena Fejzo said of her experience with hyperemesis, and of her doctors dismissal of the conditio… [+16334 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Evolution of cardiac therapies - ETHealthWorld", "description": "Cardiac interventions like angioplasty with stent placement don't pose major challenges in 80% of indicated patients. Nevertheless, the same procedure in a patient with heart pumping dysfunction, coexisting other organ dysfunctions (liver, kidney or lung issu…", "url": "https://health.economictimes.indiatimes.com/news/industry/evolution-of-cardiac-therapies/98755363", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98755363,imgsize-486016,width-1200,height-628,overlay-ethealthworld/evolution-of-cardiac-therapies.jpg", "publishedAt": "2023-03-18T11:17:00Z", "content": "By Dr Sharath Reddy AnnamNew Delhi: Medical science is ever changing and has been evolving rapidly for the last two decades. These evolutionary innovations are transforming solutions for critical pro… [+6532 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Pooled Prevalence of Long COVID-19 Symptoms at 12 Months and Above Follow-Up Period: A Systematic Review and Meta-Analysis - Cureus", "description": "Current data suggests that coronavirus disease 2019 (COVID-19) survivors experience long-lasting problems. It is not yet understood how long these symptoms last. The goal of this study was to compile all the data that was currently available to evaluate COVID…", "url": "https://www.cureus.com/articles/143288-pooled-prevalence-of-long-covid-19-symptoms-at-12-months-and-above-follow-up-period-a-systematic-review-and-meta-analysis?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/572438/article_river_bef95fd0b78911ed84c1495166705538-Figure-1.png", "publishedAt": "2023-03-18T11:10:52Z", "content": "\"Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has.\"\r\nMargaret Mead"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "HPV infection and HPV-related cancers a silent killer - ETHealthWorld", "description": "HPV is a causative agent both in men and women for warts, and precancerous lesions that may even progress to Genital, Oro-pharyngeal, and Anal cancer. It is a highly infectious agent with no symptoms of infection virus causes cancerous changes in genital orop…", "url": "https://health.economictimes.indiatimes.com/news/industry/hpv-infection-and-hpv-related-cancers-a-silent-killer/98752605", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98752605,imgsize-6602,width-1200,height-628,overlay-ethealthworld/hpv-infection-and-hpv-related-cancers-a-silent-killer.jpg", "publishedAt": "2023-03-18T10:15:00Z", "content": "By Dr Praveen V GokhaleNew Delhi: Human Papilloma Virus (HPV) is the most common viral infection of the reproductive tract responsible for cancers and mortality in men and women.\r\nHPV is a causative … [+2120 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "IANS", "title": "Know Ways In Which Women Can Effectively Contribute To Their Overall Wellbeing - ABP Live", "description": "Regular exercise has been shown to regulate hormonal balance in women. It can also help reduce the levels of cortisol, the stress hormone that can contribute to hormonal imbalances.", "url": "https://news.abplive.com/lifestyle/know-ways-in-which-women-can-effectively-contribute-to-their-overall-wellbeing-1589327", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/18/369671cb04fa625c62b79409c72f72db1679134123424557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-03-18T10:09:25Z", "content": "New Delhi: Gone are the days when women wanted to be frail and petite. There have been various stereotypes associated with women's fitness - women shouldn't lift heavy weights, women shouldn't do ver… [+5123 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Jessica Rendall", "title": "How a Lack of Sleep Can Hurt Your Heart - CNET", "description": "As if you needed another reason to toss and turn. Here's how sleep and heart health are linked, and what you can do about it.", "url": "https://www.cnet.com/health/sleep/how-a-lack-of-sleep-can-hurt-your-heart/", "urlToImage": "https://www.cnet.com/a/img/resize/9974bdf53b8a2fd371a1a5b684de7b714df3daa8/hub/2023/03/17/c00fae6c-d382-4ab5-8376-cb8793783a7f/gettyimages-1333959783.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2023-03-18T10:00:00Z", "content": "It's 2 a.m., and you're clammy and flustered, legs pretzeled between the sheets. You know you have to wake up in five hours, so you start taking deep breaths of the stale air that, even in its stilln… [+4940 chars]"}, {"source": {"id": null, "name": "Microbiozindia.com"}, "author": null, "title": "H3N2 vs H1N1: What's the Difference Anyway? - Microbioz India", "description": "The term", "url": "https://microbiozindia.com/h3n2-vs-h1n1-whats-the-difference-anyway/", "urlToImage": "https://microbiozindia.com/wp-content/uploads/2023/03/Influenza_March-23.jpg", "publishedAt": "2023-03-18T08:57:05Z", "content": "The term “variant” is used to describe influenza viruses that have been detected in humans but are more commonly found in pigs. In July of 2011, influenza A H3N2 variant viruses were discovered in hu… [+3296 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Physical signs you are way more stressed than you realise - Times Now", "description": "Stress comes in various ways. Defined as a feeling of being overwhelmed or unable to cope with mental or emotional pressure, stress does have mental and physical consequences. Read on to know the physical signs that you may make signs that make you way more s…", "url": "https://www.timesnownews.com/health/physical-signs-you-are-way-more-stressed-than-you-realise-article-98752199", "urlToImage": "https://static.tnn.in/thumb/msid-98752199,updatedat-1679128343378,width-1280,height-720,resizemode-75/98752199.jpg", "publishedAt": "2023-03-18T08:32:23Z", "content": "26:30\r\nBullet Proof Vests, Cars, Illegal Weapon &amp; Midnight Chase In Amritpal's Case, What's More? | Newshour"}, {"source": {"id": null, "name": "News9live.com"}, "author": null, "title": "Less expensive approach developed to isolate nanobodies against Covid: Study - News9 LIVE", "description": "COVID-19 continues to mutate and elude us despite a bevy of vaccines, monoclonal antibodies, and antivirals", "url": "https://www.news9live.com/health/covid-19/less-expensive-approach-developed-to-isolate-nanobodies-against-covid-study-au288-2078881", "urlToImage": "https://images.news9live.com/h-upload/2023/01/04/599241-ezgifcom-gif-maker-2023-01-04t124800264.jpg", "publishedAt": "2023-03-18T08:20:10Z", "content": "Covid virus (Photo credit: Pixabay)\r\nCOVID-19 continues to mutate and elude us despite a bevy of vaccines, monoclonal antibodies, and antivirals\r\n<ul><li>Nanobodies can squeeze into parts of the SARS… [+4191 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "H3N2 Surge In India | Who Is More At Risk Of Getting Infected With The Virus? | EXPLAINED - SHOWSHA", "description": "After the devastating Covid-19 pandemic, India is currently witnessing a surge in viral infections caused by H3N2. While anyone can get infected with this vi...", "url": "https://www.youtube.com/watch?v=Um02llhzYJk", "urlToImage": "https://i.ytimg.com/vi/Um02llhzYJk/maxresdefault.jpg", "publishedAt": "2023-03-18T07:30:05Z", "content": null}, {"source": {"id": null, "name": "5dariyanews.com"}, "author": "https://www.facebook.com/5DariyaNewspaper", "title": "National Vaccination Day celebrated at Aryans - 5 Dariya News", "description": "To promote the importance of vaccines and the role they play in improving public health, National Vaccination day was celebrated by Aryans College of Pharmacy & Aryans Institute of Nursing, Rajpura, Near Chandigarh. Dr. Suresh Kumar, Faculty, Dept.", "url": "https://www.5dariyanews.com/", "urlToImage": "https://www.5dariyanews.com/Uploads/2023/03/18/en-news-10485061-1-large.jpg", "publishedAt": "2023-03-18T05:21:28Z", "content": "To promote the importance of vaccines and the role they play in improving public health, National Vaccination day was celebrated by Aryans College of Pharmacy &amp; Aryans Institute of Nursing, Rajpu… [+944 chars]"}, {"source": {"id": null, "name": "Rediff.com"}, "author": "rediffGURU Dr KARTHIYAYANI MAHADEVAN", "title": "Does Protein Powder Harm Kidneys? - Rediff.com", "description": "'Digesting protein is hard work for the metabolic system. The more natural the protein is, the easier it is to digest,' explains Dr Karthiyayani Mahadevan.", "url": "https://www.rediff.com/getahead/report/rediffguru-dr-karthiyayani-mahadevan-does-protein-powder-increase-risk-of-kidney-disease/20230318.htm", "urlToImage": "https://im.rediff.com/getahead/2023/mar/14protein.jpg", "publishedAt": "2023-03-18T04:48:54Z", "content": "'Digesting protein is hard work for the metabolic system. The more natural the protein is, the easier it is to digest,' explains Dr Karthiyayani Mahadevan.\r\nDo you have health-related queries?\r\nOur e… [+4757 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Association of warm or cold air temperatures with lung function in young infants - EurekAlert", "description": "About The Study: Long-term heat and cold exposure from the second trimester until four weeks after birth was associated with newborn lung volumes, especially among female newborns, in this study of 343 mother-child pairs. The findings suggest an association b…", "url": "https://www.eurekalert.org/news-releases/982987", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-03-18T02:02:50Z", "content": "About The Study: Long-term heat and cold exposure from the second trimester until four weeks after birth was associated with newborn lung volumes, especially among female newborns, in this study of 3… [+1553 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "'Set up genome sequencing facilities for H3N2 virus in Gujarat' - Times of India", "description": "Speaking during a discussion in the assembly on the increasing cases of H3N2 influenza, senior Congress leader Arjun Modhwadia on Friday demanded that", "url": "https://timesofindia.indiatimes.com/city/ahmedabad/set-up-genome-sequencing-facilities-for-h3n2-virus-in-gujarat/articleshow/98744562.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-98744570,width-1070,height-580,imgsize-1234559,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-03-18T00:00:00Z", "content": ""}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shahid Akhter, ET HealthWorld", "title": "Massive funding for antiviral research is the need of the hour, not only on vaccines but also on drugs: Dr W.. - ETHealthWorld", "description": "There are now 8 billion human beings. We live tightly packed. Every year, there are 5 billion individual airplane rides. We fly around like bats, and we live together. And there are a lot of us. And that's perfect for microorganisms; they're adapting to us, s…", "url": "http://health.economictimes.indiatimes.com/news/industry/massive-funding-for-antiviral-research-is-the-need-of-the-hour-not-only-on-vaccines-but-also-on-drugs-dr-william-a-haseltine/98744139", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98744139,imgsize-983244,width-1200,height-628,overlay-ethealthworld/massive-funding-for-antiviral-research-is-the-need-of-the-hour-not-only-on-vaccines-but-also-on-drugs-dr-william-a-haseltine.jpg", "publishedAt": "2023-03-17T22:54:00Z", "content": "Shahid Akhter, editor, ETHealthworld, spoke to Dr. William A. Haseltine, Chair and President, ACCESS Health International, to identify the public health vulnerabilities and how to improve our level o… [+5750 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "PCR Detection Kit for qualitative detection of Influenza A/Influenza B/Human Adenovirus/2019-nCoV - News-Medical.Net", "description": "Tianlong’s PCR detection kit can be utilized for the detection of influenza A virus (Flu-A), influenza B virus (Flu-B), human adenovirus (HAdV), and novel coronavirus (2019-nCoV).", "url": "https://www.news-medical.net/PCR-Detection-Kit-for-Qualitative-Detection-of-Influenza-AInfluenza-BHuman-Adenovirus2019-nCoV", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/equipments/ImageForEquipment_6589_1678448910861225.jpg", "publishedAt": "2023-03-17T20:30:50Z", "content": "Symptoms of respiratory viral infections caused by SARS-CoV-2, human adenovirus, and influenza can often be similar and challenging to distinguish.\r\nA positive outcome for one disease does not imply … [+2143 chars]"}]}