{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "COVID-19 during pregnancy increases major health risks: Study - ETHealthWorld", "description": "This study provides the most comprehensive evidence to date suggesting that COVID-19 is a threat during pregnancy: Emily R. Smith", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-19-during-pregnancy-increases-major-health-risks-study/97085064", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97085064,imgsize-21168,width-1200,height-628,overlay-ethealthworld/covid-19-during-pregnancy-increases-major-health-risks-study.jpg", "publishedAt": "2023-01-18T08:30:00Z", "content": "Washington: According to new research published in BMJ Global Health, pregnant women infected with the virus that causes COVID-19 have 7 times increased chance of dying and a considerably increased r… [+2956 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Alberta study shows COVID long-haulers face stigma alongside lingering symptoms - India Education Diary", "description": "High levels of stigma experienced by some COVID long-haulers are associated with more intense symptoms, reduced physical function and loss of employment due to disability, according to newly published research from a Lancet medical journal. Specialis", "url": "https://indiaeducationdiary.in/university-of-alberta-study-shows-covid-long-haulers-face-stigma-alongside-lingering-symptoms/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Alberta.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2023-01-18T07:30:58Z", "content": "High levels of stigma experienced by some COVID long-haulers are associated with more intense symptoms, reduced physical function and loss of employment due to disability, according to newly publishe… [+5570 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weight Loss: 7 Aerobic Exercises You Can Perform At Home In Winter - NDTV", "description": "Continue reading as we share ways in which you can practice aerobic exercises indoors.", "url": "https://www.ndtv.com/health/weight-loss-7-aerobic-exercises-you-can-perform-at-home-in-winter-3701215", "urlToImage": "https://c.ndtvimg.com/2022-05/kdv8mbfo_running-or-jumping-rope-for-weight-loss_625x300_13_May_22.jpg", "publishedAt": "2023-01-18T07:08:31Z", "content": "Jumping rope is a quick and effective aerobic exercise perfect for indoor workout\r\nExercises that are aerobic or \"with oxygen\" improve cardiovascular fitness. A minimum of 30 minutes of cardiovascula… [+3220 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "5 Lifestyle Changes That Will Help To Lower Bad Cholesterol In Our Body During Winters - ABP Live", "description": "We all need some cholesterol in our bodies to function, but having too much can clog the arteries and contribute to future health concerns, including heart disease.", "url": "https://news.abplive.com/lifestyle/5-lifestyle-changes-that-will-help-to-lower-bad-cholesterol-in-our-body-during-winters-1576025", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/16/0d8833f364491e65a49bf020e43416581673871944341557_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-18T06:30:00Z", "content": "New Delhi: Winters can raise the risk of a variety of diseases and health disorders, owing to our sedentary lifestyle throughout the season, as well as the fact that we consume more high-calorie food… [+2870 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Getty Images", "title": "Hair follicle transplants can help heal your scars, says study - Hair follicles carry scar healing potential - Economic Times", "description": "A recent study found that by receiving hair follicle transplants, skin scars started to act more like healthy skin such as producing new blood vessels, cells, collagen, and even expressed genes found in healthy unscarred skin. The research could result in mor…", "url": "https://economictimes.indiatimes.com/news/science/hair-follicle-transplants-can-help-heal-your-scars-says-study/hair-follicles-carry-scar-healing-potential/slideshow/97081819.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97081819,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-18T06:29:00Z", "content": "Updated: 18 Jan 2023, 12:03 PM IST\r\nA recent study found that by receiving hair follicle transplants, skin scars started to act more like healthy skin such as producing new blood vessels, cells, coll… [+3535 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Washington University In St. Louis Shows Gut Bacteria's Negative Impact On Brain Health - India Education Diary", "description": "A growing pile of evidence indicates that the tens of trillions of microbes that normally live in our intestines — the so-called gut microbiome — have far-reaching effects on how our bodies function. Members of this microbial community produce vitami", "url": "https://indiaeducationdiary.in/washington-university-in-st-louis-shows-gut-bacterias-negative-impact-on-brain-health/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Washington-University-in-St.Louis_.jpg?fit=910%2C560&ssl=1", "publishedAt": "2023-01-18T06:27:18Z", "content": "A growing pile of evidence indicates that the tens of trillions of microbes that normally live in our intestines the so-called gut microbiome have far-reaching effects on how our bodies function. Mem… [+5890 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "ANI", "title": "Researchers suggest effects of resistance training in older adults - The Statesman", "description": "Exercise has been found to balance oxidants like free radicals that accumulate in cells and damage DNA, regulate the inflammatory response, and improve the mechanism by which cells defend themselves against these stressors.", "url": "https://www.thestatesman.com/lifestyle/researchers-suggest-effects-of-resistance-training-in-older-adults-1503147768.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2020/09/LIFESTYLE.jpg", "publishedAt": "2023-01-18T06:14:00Z", "content": "A protein response that takes place at the cellular level as a result of ageing includes a balance between oxidants and antioxidants, low-grade inflammation, and is the cause of many medical conditio… [+4546 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Exposure to salmonella was linked with colon cancers: Study - Hindustan Times", "description": "Salmonella infection was connected to colon cancers that started earlier and expanded larger, according to the researchers, who included a team led by Jun Sun from the University of Illinois Chicago. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/exposure-to-salmonella-was-linked-with-colon-cancers-study-101674020887669.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/_77c169e4-e528-11e6-9542-52468f740e4a_1674021147642_1674021147642.jpg", "publishedAt": "2023-01-18T05:54:54Z", "content": "A recent study linked colon cancer risk and exposure to salmonella bacteria.\r\nThe findings of the study were published in the journal Cell Reports Medicine.\r\nSalmonella infection was connected to col… [+2166 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Sharon Dasari", "title": "Fight cervical cancer the right way - The New Indian Express", "description": "As the month of January is celebrated as Cervical Health Awareness Month globally, CE speaks to experts about how to stay aware to stay safe", "url": "https://www.newindianexpress.com/cities/hyderabad/2023/jan/18/fight-cervical-cancer-the-right-way-2538747.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/12/14/w600X390/cancer.jpg", "publishedAt": "2023-01-18T05:48:00Z", "content": "HYDERABAD: January, the first month of the year, celebrating prosperity and peace, is also recognised as Cervical Cancer Awareness month. As the World Health Organisation (WHO) declares this as an op… [+5520 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "7 foods to boost your sex drive and improve sexual stamina - check list - Zee News", "description": "Food to improve libido Check out the list of food that can boost your sex life: Walnuts Rich in omega-3s and zinc, walnuts are excellent for improving your libido. Walnuts are also known to improve fertility by boosting sperm quality and vitality.", "url": "https://zeenews.india.com/health/7-foods-to-boost-your-sex-drive-and-improve-sexual-stamina-check-list-2562772", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/18/1142916-sex-drive-apple.jpg", "publishedAt": "2023-01-18T05:18:24Z", "content": "In our modern fast-paced yet sedentary and stressful lives, sex drive, libido, and sexual performance often go for a toss, thus affecting our intimate relationship. While one needs to visit a medical… [+2294 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Remedies, yogasnas to take care of your bones and joint health in winters - India TV News", "description": "A balanced diet with a rich amount of Vitamin D, and Vitamin C, Omega 3 fatty acids, ginger, soya bean, fatty fish, green vegetables, nuts and seeds, plenty of water, and other collagen supplements will be helpful in joint and bones care during winter season.", "url": "https://www.indiatvnews.com/health/remedies-yogasnas-to-take-care-of-your-bones-and-joint-health-in-winters-2023-01-18-840173", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/bones-health-1674017574.jpg", "publishedAt": "2023-01-18T04:54:16Z", "content": "Winter is here and with temperature dipping every single day, it is getting harder for people to manage bones and joint pain. This increased joint pain during winter is due to the increased inflammat… [+2474 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Lung Health: 5 Warning Signs of Respiratory Health You Should NOT Ignore - India.com", "description": "<b>Lung Health: It is important to be aware of the early signs of lung disease to receive treatment before the symptoms worsen or possibly become life-threatening.</b>", "url": "https://www.india.com/health/lung-health-5-warning-signs-of-respiratory-health-you-should-not-ignore-5858780/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/Lung-Health.jpg", "publishedAt": "2023-01-18T04:53:35Z", "content": "Lung Health: It is important to be aware of the early signs of lung disease to receive treatment before the symptoms worsen or possibly become life-threatening.\r\nLung Health: 5 Warning Signs of Respi… [+2065 chars]"}, {"source": {"id": null, "name": "Diagnostic and Interventional Cardiology"}, "author": "milla1cf", "title": "RNA Will Help Treat and Diagnose Ischemic Stroke - Diagnostic and Interventional Cardiology", "description": "January 17, 2023 — Ischemic stroke, or cerebral infarction, ranks first in prevalence among diseases that lead to death or disability. Therefore, the search for new ways of its treatment and prevention or early diagnosis remains one of the main tasks of moder…", "url": "https://www.dicardiology.com/content/rna-will-help-treat-and-diagnose-ischemic-stroke", "urlToImage": "http://www.dicardiology.com/sites/default/files/Ischemic%20Stroke.png", "publishedAt": "2023-01-18T04:06:40Z", "content": "January 17, 2023  Ischemic stroke, or cerebral infarction, ranks first in prevalence among diseases that lead to death or disability. Therefore, the search for new ways of its treatment and preventio… [+2067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Can diabetics and weight-watchers have dates, dried fruits and raisins? - The Indian Express", "description": "Dried fruits contain about two/third carbohydrates, have a low protein content and a high amount of fibre. A moderate intake of raisins and nuts is fine for an active and fit person with or without diabetes, says Dr Anoop Misra, Chairman, Fortis CDOC Hospital…", "url": "https://indianexpress.com/article/lifestyle/health-specials/diabetics-weight-watchers-dates-dried-fruits-and-raisins-8388395/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200.jpg", "publishedAt": "2023-01-18T03:40:47Z", "content": "An Indian patient of mine has been living in Saudi Arabia and gets a check-up done from time to time whenever he is here. This time he asked me, Doc, dates are very popular there. Can I take them? I … [+3616 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/video-desk/", "title": "Health Tips: Add These Foods In Your Kids Diet For Proper Functioning And Growth Of Brain | Watch Video - India.com", "description": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that kids eat meals that are very nourishing and brain-boosting …", "url": "https://www.india.com/video-gallery/health-tips-add-these-foods-in-your-kids-diet-for-proper-functioning-and-growth-of-brain-watch-video-5857925/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/brain_booster_foods_for_kids.jpeg", "publishedAt": "2023-01-18T03:30:05Z", "content": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that… [+828 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US reports 26000 weekly child Covid-19 cases - Daijiworld.com", "description": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and the Children's Hospital Association.\r\nThis is a decrease from …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1040844", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-01-18T02:50:12Z", "content": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and th… [+1025 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Survey reveals physical and mental problems among health workers during pandemic - EurekAlert", "description": "Stress, burnout, pain and poor sleep were some of the most frequent symptoms reported by nursing and other staff who care for patients in a study conducted by researchers at the Federal University of São Carlos in São Paulo state, Brazil.", "url": "https://www.eurekalert.org/news-releases/976881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-18T02:03:28Z", "content": "Poor physical and mental health was frequent among Brazilian health workers employed in the public sector during the COVID-19 pandemic, according to a study by researchers at the Federal University o… [+8242 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Researchers reveal genetic predisposition to immunity against new variants of COVID-19 - EurekAlert", "description": "An international team including researchers from the HSE University Faculty of Biology and Biotechnology has found a link between certain genetic features of the immune system and one's ability to effectively resist new waves of COVID-19. Thus, an individual'…", "url": "https://www.eurekalert.org/news-releases/976819", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/6d4bda93-9dde-49f8-8a15-c44d37a18d6a/Rendition/thumbnail/Content/Public", "publishedAt": "2023-01-18T02:03:28Z", "content": "image: Validation of ORF1ab epitopes immunogenicity in a subset of convalescent HLA-A*01:01\r\nand HLA-A*02:01 carriers. True positive rates for the ORF1ab epitope set in the comparison groupsview more… [+4476 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Why Hyaluronic Acid Should Be Your Skin's Best Friend In Winters? - News18", "description": "To maintain a strong skin barrier and keep skin looking healthy, it's important to use products that contain natural ingredients like hyaluronic acid (HA)", "url": "https://www.news18.com/news/lifestyle/why-hyaluronic-acid-should-be-your-skins-best-friend-in-winters-6855181.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/hyaluronic-acid-165898903416x9.jpg", "publishedAt": "2023-01-18T01:58:40Z", "content": "As the temperatures drop, our skin can become more sensitive and prone to dryness and irritation. Winter weather, with its cold winds, low humidity, and indoor heating, can leave skin feeling dry, fl… [+3481 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "SARS-CoV-2: Was it a bio-weapon or natural pandemic? - ThePrint", "description": "Hanoi [Vietnam], January 18 (ANI): The SARS-CoV-2, better known as COVID-19 is mired under controversy about whether it was a man-made disaster or a natural pandemic, writes Thu Dao, a Hanoi-based journalist and worked as a content manager and strategist at F…", "url": "https://theprint.in/world/sars-cov-2-was-it-a-bio-weapon-or-natural-pandemic/1320605/", "urlToImage": null, "publishedAt": "2023-01-18T01:13:34Z", "content": "Hanoi [Vietnam], January 18 (ANI): The SARS-CoV-2, better known as COVID-19 is mired under controversy about whether it was a man-made disaster or a natural pandemic, writes Thu Dao, a Hanoi-based jo… [+4541 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "News Direct", "title": "Best Appetite Suppressants (2023) Top Hunger Control Pills That Work - Yahoo Finance", "description": "Review the best appetite suppressants of 2023 and find the most effective OTC hunger control pills for men and women looking to burn fat and lose weight...", "url": "https://finance.yahoo.com/news/best-appetite-suppressants-2023-top-235217381.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/OBZw6CjY40lnBbnck1DzjA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/news_direct/d83ce988446c5ba6c229fc76311c611c", "publishedAt": "2023-01-17T23:52:17Z", "content": "Review the best appetite suppressants of 2023 and find the most effective OTC hunger control pills for men and women looking to burn fat and lose weight naturally without harmful side effects.\r\nNew Y… [+40354 chars]"}, {"source": {"id": null, "name": "Healthday.com"}, "author": "Denise Mann", "title": "Could Hearing Aids Lower Your Odds for Dementia? - Tulsa World", "description": "TUESDAY, Jan. 17, 2023 (HealthDay News) -- Could losing your hearing as you age be a harbinger of dementia?", "url": "https://consumer.healthday.com/hearing-loss-2659100762.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/3/93/39327cc9-4305-57f4-892f-69c576e480c0/63c6ed17551b6.image.jpg?crop=600%2C315%2C0%2C42&resize=600%2C315&order=crop%2Cresize", "publishedAt": "2023-01-17T23:30:00Z", "content": "TUESDAY, Jan. 17, 2023 (HealthDay News) -- Could losing your hearing as you age be a harbinger of dementia?\r\nMaybe, suggests new research that found that older people who had trouble hearing were mor… [+4371 chars]"}, {"source": {"id": null, "name": "Seeking Alpha"}, "author": "Lane Simonian", "title": "Anavex: Drug Treatments For Early Alzheimer's Disease (NASDAQ:AVXL) - Seeking Alpha", "description": "Anavex 2-73/blarcamesine at high concentrations in early Alzheimer's disease leads to improvements in cognition. Click here to see our take on AVXL stock.", "url": "https://seekingalpha.com/article/4570438-anavex-drug-treatments-for-early-alzheimers-disease", "urlToImage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1381637603/image_1381637603.jpg?io=getty-c-w750", "publishedAt": "2023-01-17T22:10:00Z", "content": "leonid_tit\r\nThis is my first installment examining drugs and drug candidates for Alzheimers disease. In the next article, I will examine potential treatments for moderate to severe Alzheimers disease… [+11185 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "WEF 2023: India in advanced stage to deliver global plan for new TB vaccine by 2025, says health minister | Mint - Mint", "description": "The health minister said that Tuberculosis caused 1.6 million deaths globally in 2021, making it the world's leading cause of death from infectious disease, before COVID-19 surpassed it.", "url": "https://www.livemint.com/news/india/wef-2023-india-in-advanced-stage-to-deliver-global-plan-for-new-tb-vaccine-by-2025-says-health-minister-11673983203832.html", "urlToImage": "https://images.livemint.com/img/2023/01/17/600x338/Mansukh_Mandaviya_1671753892949_1673991062311_1673991062311.jpg", "publishedAt": "2023-01-17T21:41:31Z", "content": "Health Minister Mansukh Mandaviya has said that India is fully prepared and in an advanced stage for taking global plan for approving a new TB vaccine by 2025 and making it available to adults &amp; … [+3204 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Dr Nieman", "title": "Almonds: Food for fitness - The Hans India", "description": "New study finds eating almonds promotes muscle   recovery and reduces fatigue from exercise", "url": "https://www.thehansindia.com/life-style/health/almonds-food-for-fitness-778019", "urlToImage": "https://assets.thehansindia.com/h-upload/2023/01/17/1330224-alo.jpg", "publishedAt": "2023-01-17T20:12:59Z", "content": "Engaging in exercise promotes a healthful lifestyle, but even when performed correctly, exercise causes fatigue and muscle damage. Recovery from exercise is important because it leads to muscle gain … [+5008 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Essential childhood immunization in 43 low- and middle-income countries: Analysis of spatial trends and socioeconomic inequalities in vaccine coverage - PLOS", "description": "Dr. Anna Dimitrova and colleagues analyse spatial trends and socioeconomic inequalities in vaccine coverage for essential childhood immunization across 43 low- and middle-income countries.", "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004166", "urlToImage": "https://journals.plos.org/plosmedicine/article/figure/image?id=10.1371/journal.pmed.1004166.g004&size=inline", "publishedAt": "2023-01-17T19:18:45Z", "content": "Abstract\r\nBackground\r\nGlobally, access to life-saving vaccines has improved considerably in the past 5 decades. However, progress has started to slow down and even reverse in recent years. Understand… [+53832 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Lindsay Modglin", "title": "Normal Blood Sugar Levels By Age – Forbes Health - Forbes", "description": "", "url": "https://www.forbes.com/health/body/normal-blood-sugar-levels/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/x/https://www.forbes.com/health/wp-content/uploads/2023/01/blood_sugar.jpeg.jpg", "publishedAt": "2023-01-17T19:17:10Z", "content": null}, {"source": {"id": null, "name": "Food Dive"}, "author": null, "title": "The next move in organic vitamin c - Food Dive", "description": "Organic ingredients bring added value to natural immune products moving away from synthetic vitamin c.", "url": "https://www.fooddive.com/spons/the-next-move-in-organic-vitamin-c/639775/", "urlToImage": "https://www.fooddive.com/imgproxy/rTfzfFn-1YywVM12CQqO3Cxou6ygbrGWaCy_imlf0ZI/g:ce/rs:fill:770:364:0/bG9jYWw6Ly8vZGl2ZWltYWdlLzEwNDB4NjE2X0FydGljbGVfSGVyb18xLmpwZw.jpg", "publishedAt": "2023-01-17T17:49:21Z", "content": "Vitamin c, or ascorbic acid, is a vital nutrient for the human body to maintain normal function. Vitamin c has been known for its health benefits in energizing the body, boosting immunity, and provid… [+7043 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Comparison of Efficacy and Safety of Low-Dose Versus High-Dose Dexamethasone in Hospitalized COVID-19 Patients: A Meta-Analysis - Cureus", "description": "The aim of this study is to compare the efficacy and safety of low-dose and high-dose dexamethasone in hospitalized coronavirus disease 2019 (COVID-19) patients. The current meta-analysis was conducted in compliance with Preferred Reporting Items for Systemat…", "url": "https://www.cureus.com/articles/133886-comparison-of-efficacy-and-safety-of-low-dose-versus-high-dose-dexamethasone-in-hospitalized-covid-19-patients-a-meta-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/534261/article_river_3f48e5e0903211ed8b059d622138fb22-Capture.png", "publishedAt": "2023-01-17T17:43:40Z", "content": "Patients with critical coronavirus disease 2019 (COVID-19) are characterized by hypoxemia and pulmonary inflammation that often leads to the use of mechanical ventilation and high-flow oxygen [1]. Th… [+14204 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Smartphone App Can Significantly Improve Memory Recall - Neuroscience News", "description": "A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer's disease. The app mimics the function of the hippocampus, constructing and maintaining m…", "url": "https://neurosciencenews.com/hippocamera-app-memory-22271/", "urlToImage": "https://neurosciencenews.com/files/2023/01/memory-phone-app-neurosicence.jpg", "publishedAt": "2023-01-17T16:44:21Z", "content": "Summary: A new smartphone app, dubbed HippoCamera helps to significantly improve memory recall and could have applications for improving memory for those suffering from Alzheimer’s disease. The app m… [+9304 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "Does Psoriasis Increase Lung Cancer Risk? - DocWire News", "description": "A study sought any causal relationship between psoriasis and lung cancer after observational studies proposed an association between the two.", "url": "https://www.docwirenews.com/pocn-hem-onc/does-psoriasis-increase-lung-cancer-risk/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2023/01/DoctorChestXray-scaled.jpg", "publishedAt": "2023-01-17T16:33:28Z", "content": "Following observational studies that suggested an association between psoriasis and lung cancer risk, researchers performed Mendelian randomization analyses and a meta-analysis of genetic datasets to… [+1787 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "AI-based analysis of ultrasound images and videos predicts gestational age more accurately: Study - Medical Dialogues", "description": "USA: Artificial intelligence (AI) models hold the potential to empower trained ultrasonography operators to determine gestational age (GA) with higher accuracy compared to conventional fetal...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/ai-based-analysis-of-ultrasound-images-and-videos-predicts-gestational-age-more-accurately-study-105356", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/06/196587-fetal-biometry.jpg", "publishedAt": "2023-01-17T14:30:43Z", "content": "USA: Artificial intelligence (AI) models hold the potential to empower trained ultrasonography operators to determine gestational age (GA) with higher accuracy compared to conventional fetal biometry… [+3552 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Diabetic Retinopathy associated with Higher Risk of DFU & Amputation in diabetes Patients - Medical Dialogues", "description": "France: According to a study published in Diabetes/Metabolism  Research and Reviews, in type 2 diabetes patients, diabetic retinopathy  independently relates to foot ulcers and amputation incidence...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/diabetic-retinopathy-associated-with-higher-risk-of-dfu-amputation-in-diabetes-patients-105521", "urlToImage": "https://medicaldialogues.in/h-upload/2022/12/30/195609-psychosocial-stress-and-stroke-14.jpg", "publishedAt": "2023-01-17T14:30:42Z", "content": "France: According to a study published in Diabetes/Metabolism Research and Reviews, in type 2 diabetes patients, diabetic retinopathy independently relates to foot ulcers and amputation incidence in … [+2070 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Meditation alters gut microbes in Buddhist monks for better mental health - Daijiworld.com", "description": "New Delhi, Jan 17 (IANS): Gut microbes found in Buddhist monks have been linked to lower risks of anxiety, depression and even cardio-vascular disease, thus lowering the risk of mental ill-health as they grow older.\r\nA study, published in the open access jour…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1040733", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-01-17T14:15:52Z", "content": "New Delhi, Jan 17 (IANS): Gut microbes found in Buddhist monks have been linked to lower risks of anxiety, depression and even cardio-vascular disease, thus lowering the risk of mental ill-health as … [+2046 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Potential treatment target for hepatoblastoma identified during new research - ETHealthWorld", "description": "The fact that liver transplantation with its associated lifelong immunotherapy and risk for secondary malignancies is considered a viable option for severe hepatoblastoma speaks to the critical clinical need for more effective therapeutic options for hepatobl…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/potential-treatment-target-for-hepatoblastoma-identified-during-new-research/97061175", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97061175,imgsize-75980,width-1200,height-628,overlay-ethealthworld/potential-treatment-target-for-hepatoblastoma-identified-during-new-research.jpg", "publishedAt": "2023-01-17T14:15:00Z", "content": "Washington [US]: Although rare compared to adult liver cancers, hepatoblastoma is the most common pediatric liver malignancy, and its incidences have been on the rise. In a novel study appearing in T… [+4089 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Blood leukocyte transcriptional modules and differentially expressed genes associated with disease severity and age in COVID-19 patients | Scientific Reports - Nature.com", "description": "Scientific Reports - Blood leukocyte transcriptional modules and differentially expressed genes associated with disease severity and age in COVID-19 patients", "url": "https://www.nature.com/articles/s41598-023-28227-6", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-023-28227-6/MediaObjects/41598_2023_28227_Fig1_HTML.png", "publishedAt": "2023-01-17T14:03:57Z", "content": "<li>Arunachalam, P. S. et al. Systems biological assessment of immunity to mild versus severe COVID-19 infection in humans. Science369, 12101220. https://doi.org/10.1126/science.abc6261 (2020).\r\nArti… [+27070 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "5 common myths related to sugar - Firstpost", "description": "All cells require sugar, but cancer cells even require other nutrients to survive, like amino acids and fats, so it’s not just about sugar.", "url": "https://www.firstpost.com/living/5-common-myths-related-to-sugar-that-you-may-have-heard-of-12002732.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/sugar-export.jpg", "publishedAt": "2023-01-17T13:51:09Z", "content": "Most of us like to eat sugar, whether it is in the form of mithai, chocolate, cookies or even the sugar in your tea. But no matter how much we say we can’t live without our daily dose of sugar, its c… [+2266 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "PRNewswire", "title": "Indian Researchers from ACTREC Discover Novel Therapeutic Agent for a Host of Diseases - Benzinga", "description": "Research from India's Tata Memorial Centre suggests that free radicals (ROS) generated upon mixing two nutraceuticals—resveratrol and copper—can help ameliorate various diseases by inactivating cell-free chromatin", "url": "https://www.benzinga.com/pressreleases/23/01/n30439533/indian-researchers-from-actrec-discover-novel-therapeutic-agent-for-a-host-of-diseases", "urlToImage": null, "publishedAt": "2023-01-17T13:39:00Z", "content": "Research from India's Tata Memorial Centre suggests that free radicals (ROS) generated upon mixing two nutraceuticalsresveratrol and coppercan help ameliorate various diseases by inactivating cell-fr… [+4047 chars]"}, {"source": {"id": null, "name": "Shiawaves.com"}, "author": "Ghanadian", "title": "Amid poor infrastructure and increasing number of camps, cholera worsened in northern Syria - Shia Waves - ShiaWaves | Shia World News", "description": "Cholera disease continues to spread in the regions of northern Syria, in light of the delay in the arrival of vaccines to the regions, amid the poor infrastructure and the large number of camps. A few", "url": "https://shiawaves.com/english/news/89711-amid-poor-infrastructure-and-increasing-number-of-camps-cholera-worsened-in-northern-syria/", "urlToImage": "https://shiawaves.com/english/wp-content/uploads/sites/4/2023/01/12-2.jpg", "publishedAt": "2023-01-17T13:17:11Z", "content": "Cholera disease continues to spread in the regions of northern Syria, in light of the delay in the arrival of vaccines to the regions, amid the poor infrastructure and the large number of camps.\r\nA f… [+1004 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Revive Daily Reviews Urgent Updated 2023 - Deccan Herald", "description": "Are you struggling to fall asleep, staying asleep or getting up refreshed? Do your morning walks feel like climbing the mountain? Do you find yourself staring at the wrinkles in front of the mirror shaking your confidence? The body wears out with age, and we'…", "url": "https://www.deccanherald.com/brandspot/pr-spot/revive-daily-reviews-urgent-updated-2023-1181992.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181992-1673961040.png", "publishedAt": "2023-01-17T13:10:40Z", "content": "Are you struggling to fall asleep, staying asleep or getting up refreshed? Do your morning walks feel like climbing the mountain? Do you find yourself staring at the wrinkles in front of the mirror s… [+24969 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "SonoVive Reviews (2023 Updated) Real Facts Based On Customer Testimonials - Deccan Herald", "description": "SonoVive is an organic formula designed to help support healthy hearing. It is made up of natural ingredients that help support the well-being and wellbeing of the body. It is also an ideal supplement since it is completely natural which is beneficial to the …", "url": "https://www.deccanherald.com/brandspot/pr-spot/sonovive-reviews-2023-updated-real-facts-based-on-customer-testimonials-1181988.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181988-1673960173.png", "publishedAt": "2023-01-17T12:56:13Z", "content": "SonoVive is an organic formula designed to help support healthy hearing. It is made up of natural ingredients that help support the well-being and wellbeing of the body. It is also an ideal supplemen… [+33422 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "ADHD and mental health are strongly correlated: Research reveals - Hindustan Times", "description": "According to recent research, persons with high levels of attention-deficit hyperactivity disorder (ADHD) symptoms are more likely to experience anxiety and depression than adults with high levels of autistic features. This finding comes from psychologists at…", "url": "https://www.hindustantimes.com/lifestyle/health/adhd-and-mental-health-are-strongly-correlated-research-reveals-101673959008305.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/17/1600x900/ADHD_thumb_1636122946907_1673959389701_1673959389701.jpg", "publishedAt": "2023-01-17T12:49:28Z", "content": "According to new research led by psychologists at the University of Bath in the UK, adults with high levels of attention-deficit hyperactivity disorder (ADHD) symptoms are more likely to experience a… [+6220 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Claritox Pro Reviews - 2023 Reports, Amazon, Dizziness - Deccan Herald", "description": "Why are people talking about Claritox Pro This Year? Are you a person who has climbed the top of a building, and as you gazed down at the ground, you noticed your head spinning? When you look down from a stairwell five or six storeys higher and you are incred…", "url": "https://www.deccanherald.com/brandspot/pr-spot/claritox-pro-reviews-2023-reports-amazon-dizziness-1181985.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181985-1673959532.png", "publishedAt": "2023-01-17T12:45:32Z", "content": "Why are people talking about Claritox Pro This Year?\r\nAre you a person who has climbed the top of a building, and as you gazed down at the ground, you noticed your head spinning? When you look down f… [+33456 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Quietum Plus Reviews: Amazon, Tinnitus, Consumer Reports, Ingredients - Deccan Herald", "description": "Quietum Plus: Your search stops hear! Hearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern life it's obvious that this problem isn't reserved for the elde…", "url": "https://www.deccanherald.com/brandspot/pr-spot/quietum-plus-reviews-amazon-tinnitus-consumer-reports-ingredients-1181979.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181979-1673958573.png", "publishedAt": "2023-01-17T12:29:33Z", "content": "Quietum Plus: Your search stops hear!\r\nHearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern li… [+31006 chars]"}, {"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "Cancer in India: A status report - INSIGHTSIAS - Insights IAS", "description": "GS Paper 2 Syllabus: Issues Relating to Development and Management of Social Sector/Services relating to Health   Source: IE   Direction: The article tries to find out the reasons behind high cancer incidence and mortality in India despite the progress in can…", "url": "https://www.insightsonindia.com/2023/01/17/cancer-in-india-a-status-report/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2023/01/can-1024x554.jpg", "publishedAt": "2023-01-17T12:13:34Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you must not take vitamin D3 and B12 deficiencies ‘lightly’ - The Indian Express", "description": "“Vitamin D and B12 are micronutrients needed for the development and various functions of our body,\" said Dr Paritosh Baghel, Senior Consultant-Internal Medicine, SL Raheja Hospital Mahim - A Fortis Associate", "url": "https://indianexpress.com/article/lifestyle/health/why-you-need-to-take-vitamin-d3-and-vitamin-b12-deficiency-seriously-8385331/", "urlToImage": "https://images.indianexpress.com/2023/01/VitB12_Getty1200_Health.jpg", "publishedAt": "2023-01-17T12:00:57Z", "content": "Are you experiencing body aches, brain fog, fatigue, hormonal imbalance, brittle nails, muscle weakness, or memory loss? These are signs telling you that you must immediately get your vitamin D3 and … [+3217 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Significance of Interleukin 23 in Systemic Lupus Patients | BTT - Dove Medical Press", "description": "IL23 has higher levels in serum of SLE patients & is correlated to activity of SLE especially lupus nephritis. IL23 a potential biomarker or therapeutic target", "url": "https://www.dovepress.com/significance-of-interleukin-23-in-systemic-lupus-patients-relation-to--peer-reviewed-fulltext-article-BTT", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-17T11:56:26Z", "content": "The Plain Language Summary\r\nAutoimmune diseases occur when your immune system attacks your own body. Systemic lupus erythematosus (SLE) is one of these autoimmune diseases which can affect different … [+25473 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "This Winter-Special Plum Juice May Help You Shed Extra Kilos - NDTV Food", "description": "Juices are power-packed with essential vitamins. The plum juice is rich in antioxidants and can be a great addition to your weight loss diet.", "url": "https://food.ndtv.com/food-drinks/this-winter-special-plum-juice-may-help-you-shed-extra-kilos-3699918", "urlToImage": "https://c.ndtvimg.com/2023-01/37efg9cg_plum-juice_625x300_17_January_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-01-17T11:35:48Z", "content": "In order to lose weight, it is imperative to follow a healthy lifestyle. This includes having a regular fitness routine and following a nutrient-rich diet. While losing weight is often viewed as a hu… [+2328 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Srishti Magan", "title": "Indians remain wary of booster doses as Covid wanes and side-effect worries rise - Business Insider India", "description": "In a national survey conducted by LocalCircles, 50% of citizens said that they were hesitant to take a third or Covid booster dose. As of now, only 20% of", "url": "https://www.businessinsider.in/india/news/indians-remain-wary-of-booster-doses-as-covid-wanes-and-side-effect-worries-rise/articleshow/97053825.cms", "urlToImage": "https://www.businessinsider.in/photo/97053825/indians-remain-wary-of-booster-doses-as-covid-wanes-and-side-effect-worries-rise.jpg?imgsize=15974", "publishedAt": "2023-01-17T11:30:00Z", "content": "A new Covid-19 vaccine from the Serum Institute of India called Covovax on Tuesday received approval from the Drugs Controller General of India (DCGI) to be used as a heterologous booster.A heterolog… [+6911 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Maternal Risk Factors Associated With Neonatal Outcome in Primiparous, Machala, Ecuador - Cureus", "description": "Introduction\n\nThe resulting neonatal, weight of the newborn (NB) is considered as a health indicator since the nutritional status of the neonate can have repercussions on the growth and development of the child until adulthood. Secondly, preterm delivery is a…", "url": "https://www.cureus.com/articles/132858-maternal-risk-factors-associated-with-neonatal-outcome-in-primiparous-machala-ecuador", "urlToImage": "https://public.cureus.com/fallback/new_default_article_image_3.png", "publishedAt": "2023-01-17T11:01:01Z", "content": "Introduction\r\nThe resulting neonatal, weight of the newborn (NB) is considered as a health indicator since the nutritional status of the neonate can have repercussions on the growth and development o… [+22542 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UC San Diego Study Finds Cause for Mysterious Cases of Epilepsy in Children - India Education Diary", "description": "Epilepsy is present in 4% of the population, and is among the most common brain disorders in children. Modern medicine can prevent most seizure recurrences, but approximately 20% of patients do not respond to treatment.In these cases, the reason may", "url": "https://indiaeducationdiary.in/uc-san-diego-study-finds-cause-for-mysterious-cases-of-epilepsy-in-children/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/brain-drawing-graphic-pixabay-1200.jpg?fit=1024%2C536&ssl=1", "publishedAt": "2023-01-17T10:45:14Z", "content": "Epilepsy is present in 4% of the population, and is among the most common brain disorders in children. Modern medicine can prevent most seizure recurrences, but approximately 20% of patients do not r… [+4093 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "An Apple Juice A Day Keeps The Belly Fat Away - New Study Claims - NDTV Food", "description": "You can actually eat your way to a flat tummy, according to a recent study. It claims that apple juice can \"significantly\" reduce belly fat within weeks.", "url": "https://food.ndtv.com/weight-loss/an-apple-juice-a-day-keeps-the-belly-fat-away-new-study-claims-3699706", "urlToImage": "https://c.ndtvimg.com/2023-01/rgjmfpho_apple-juice_625x300_17_January_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-01-17T10:40:47Z", "content": "Anyone struggling with belly fat would know how difficult it is to get rid of it. Crunches, planks and other stomach exercises work, but it gets too much for us, sometimes. Only if we didn't have to … [+2811 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Toxic brain foods: THESE 5 foods can weaken your memory and focus - Zee News", "description": "Our diets can have a significant effect on the structure and health of our brains. A diet that supports brain health can help the short- and long-term functions of the brain. When you look closely you will find how dietary adjustments can significantly enhanc…", "url": "https://zeenews.india.com/health/toxic-brain-foods-these-5-foods-can-weaken-your-memory-and-focus-2562564", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/17/1142751-toxic-foods-for-brain.jpeg", "publishedAt": "2023-01-17T10:30:23Z", "content": "Brain healthy foods: Our diets can have a significant effect on the structure and health of our brains. A diet that supports brain health can help the short- and long-term functions of the brain. Whe… [+2492 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Can We Use Machine Learning To Predict the Spread of Brain Tumors? - Technology Networks", "description": "Researchers have created a computational model that uses machine learning to fully analyze a patient’s tumor and better predict glioblastoma multiforme progression.", "url": "https://www.technologynetworks.com/informatics/news/can-we-use-machine-learning-to-predict-the-spread-of-brain-tumors-369234", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369234/can-we-use-machine-learning-to-predict-the-spread-of-brain-tumors-369234-640x360.jpg?cb=20230117", "publishedAt": "2023-01-17T09:38:47Z", "content": "Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.\r\nGlioblastoma multiforme (GBM) is a brain cancer with an av… [+2544 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Ranita Ray", "title": "Sea Moss Is The Boss Of Superfoods In 2023! Know Why! - Slurrp", "description": "Sea moss has been known as a storehouse of nutrients and health benefits. Recently, it caught the attention of health experts and enthusiasts due to its natural properties. From boosting gut health, energy and digestive health to aiding in sleep, inflammation…", "url": "https://www.slurrp.com/article/sea-moss-is-the-boss-of-superfoods-in-2023-know-why-1673946218119", "urlToImage": "https://images.slurrp.com/prodarticles/fwfnta50zff.webp", "publishedAt": "2023-01-17T09:22:21Z", "content": "In 2023, several health-granting foods, natural ingredients, edibles, and potables are rising and continue to do so. This shift is triggered by the significant change among people towards their healt… [+3284 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Best Natural Ways to Lower Diabetes : How To Prevent Type-2 Diabetes - mid-day.com", "description": "Diseases or health hazards have become a standard part of people's lives these days, among which blood sugar or diabetes is relevant.", "url": "https://www.mid-day.com/brand-media/article/best-natural-ways-to-lower-diabetes-how-to-prevent-type-2-diabetes-23265918", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Glucoredi12_d.jpg", "publishedAt": "2023-01-17T09:16:00Z", "content": "Diseases or health hazards have become a standard part of people's lives these days, among which blood sugar or diabetes is relevant.\r\nFrom the elders to the now modern youth, everyone has to stay on… [+7922 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Clinico-epidemiological profile of COVID-19 patients | IJGM - Dove Medical Press", "description": "We conducted a preliminary analysis of the clinical and epidemiological characteristics of the suspected omicron cases in the early part of the surge.", "url": "https://www.dovepress.com/clinico-epidemiological-profile-of-covid-19-patients-with-omicron-vari-peer-reviewed-fulltext-article-IJGM", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-17T07:53:36Z", "content": "Introduction\r\nThe recent emergence of the omicron variant has become a cause of global concern. Omicron was first identified in South Africa1 and on 25th November 2021. WHO designated B.1.1.529 (Omic… [+17196 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Brie Schmidt", "title": "Could Your Hormones Be The Reason Behind Your Dry Eyes? - Health Digest", "description": "Dry eyes, as the name implies, occur when the eyes lack lubrication from tears. Symptoms can include redness, blurred vision, light sensitivity, and stinging.", "url": "https://www.healthdigest.com/1166484/could-your-hormones-be-the-reason-behind-your-dry-eyes/", "urlToImage": "https://www.healthdigest.com/img/gallery/could-your-hormones-be-the-reason-behind-your-dry-eyes/l-intro-1673625660.jpg", "publishedAt": "2023-01-17T04:58:00Z", "content": "Hormones affect nearly every part of the body, including the eyes. As WebMD explains, several types of hormone fluctuations can trigger dry eye syndrome. One hormone that plays a role in tear product… [+1345 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Alka Jain", "title": "‘Antibodies wane over time’: US expert calls for need to stop Covid transmission | Mint - Mint", "description": "The antibodies wane over a period of time, hence Eric Feigl-Ding, an epidemiologist and health economist, referred to the need of stopping Covid transmission.", "url": "https://www.livemint.com/news/world/antibodies-wane-over-time-us-expert-calls-for-need-to-stop-covid-transmission-11673920905746.html", "urlToImage": "https://images.livemint.com/img/2023/01/17/600x338/Covid_1673922863790_1673922865089_1673922865089.jpg", "publishedAt": "2023-01-17T02:42:48Z", "content": "A top US scientist has said that each wave reminds people of Covid is not over yet', while individuals claiming the achievement of herd immunity as they develop antibodies against the coronavirus inf… [+2480 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "An Unusual Simultaneous Occurrence of Diabetes and Hypothyroidism in a Periodontitis Patient: A Case Report - Cureus", "description": "Periodontal disease, diabetes mellitus, and hypothyroidism are commonly prevalent non-communicable diseases afflicting the human population all over the world, with the added burden on the health care system increasing the overall morbidity. It has been seen …", "url": "https://www.cureus.com/articles/128682-an-unusual-simultaneous-occurrence-of-diabetes-and-hypothyroidism-in-a-periodontitis-patient-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/509452/article_river_6081bc0072dc11ed945a310ebdcf4945-Fig-1.png", "publishedAt": "2023-01-17T02:33:05Z", "content": "Periodontal disease, diabetes mellitus, and hypothyroidism are commonly prevalent non-communicable diseases afflicting the human population all over the world, with the added burden on the health car… [+14965 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers discover toolkit for RNA sequencing analysis using pantranscriptome - ANI News", "description": "To acquire insight into the degree to which genes are \"turned on\" and perform tasks in the body, a person's RNA landscape must be mapped to a standard reference. However, when the reference does not provide enough information to allow for correct mapping, res…", "url": "https://www.aninews.in/news/science/researchers-discover-toolkit-for-rna-sequencing-analysis-using-pantranscriptome20230116223244", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230116165525.jpg", "publishedAt": "2023-01-16T17:04:10Z", "content": "California [US], January 16 (ANI): To get an insight into the degree to which genes are \"turned on\" and perform tasks in the body, a person's RNA landscape must be mapped to a standard reference. How… [+5255 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Steroids Australia - Legal Steroids for sale in Australia Online (UPDATED) - The Tribune India", "description": "Bodybuilding, sculpting, and general fitness have always been important to men. Men seeking to enhance their physiques have become increasingly reliant on steroids. The use of anabolic steroids in Australia is only permitted with a doctor's approval. You may …", "url": "https://www.tribuneindia.com/news/brand-connect/steroids-australia-legal-steroids-for-sale-in-australia-online-updated-470970", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1212672484.jpg", "publishedAt": "2023-01-16T16:09:00Z", "content": "Bodybuilding, sculpting, and general fitness have always been important to men. Men seeking to enhance their physiques have become increasingly reliant on steroids. The use of anabolic steroids in Au… [+17405 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Cytecare Hospitals starts diabetes screening clinic in Bengaluru - BSI bureau", "description": "Focusing on younger patients who are at risk", "url": "https://www.biospectrumindia.com/news/98/22486/cytecare-hospitals-starts-diabetes-screening-clinic-in-bengaluru.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/2-22486.jpeg", "publishedAt": "2023-01-16T14:58:45Z", "content": "Often referred to as the Diabetes Capital of the World, India accounts for over 18 percent of the global diabetes burden. Alarmingly, more than 50 per cent of people are unaware of their diabetic sta… [+1498 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Introduction to antimicrobial resistance - Royal Society Of Chemistry", "description": "What is antimicrobial resistance (AMR) and why is it such an urgent challenge? What are researchers and governments doing to address it and what needs to don...", "url": "https://www.youtube.com/watch?v=J3SViVUUpD8", "urlToImage": "https://i.ytimg.com/vi/J3SViVUUpD8/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGBEgcigdMA8=&rs=AOn4CLAFyAR0jDkB8VqU2n1-dpOzzXhQyw", "publishedAt": "2023-01-16T14:38:30Z", "content": null}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Alpilean Reviews (2023) CLINICAL TEST Leaks The Truth Behind Dangerous Side Effects - mid-day.com", "description": "Have you ever wondered why some people seem to lose weight effortlessly while others struggle to shed even a few pounds? The answer may lie in the Alpine Ice Hack or in other words, core body temperature.", "url": "https://www.mid-day.com/brand-media/article/alpilean-reviews-2023-clinical-test-leaks-the-truth-behind-dangerous-side-23265801", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Alpine123121312_d.jpg", "publishedAt": "2023-01-16T13:06:00Z", "content": "Have you ever wondered why some people seem to lose weight effortlessly while others struggle to shed even a few pounds? The answer may lie in the Alpine Ice Hack or in other words, core body tempera… [+37846 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Dianabol Pill | How Many Dianabol Tablets Should I Take a Day - Deccan Herald", "description": "Imagine the possibility of building muscles faster than you thought was possible without worrying about negative consequences that are caused by illegal bodybuilding supplements. D-Bal MAX is a blend of natural components that have been shown to boost testost…", "url": "https://www.deccanherald.com/brandspot/pr-spot/dianabol-pill-how-many-dianabol-tablets-should-i-take-a-day-1181623.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181623-1673871706.png", "publishedAt": "2023-01-16T12:21:46Z", "content": "Imagine the possibility of building muscles faster than you thought was possible without worrying about negative consequences that are caused by illegal bodybuilding supplements.\r\nD-Bal MAX is a blen… [+32208 chars]"}]}