{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Exploring mechanisms underlying consciousness problems - ThePrint", "description": "Liege [Belgium], September 22 (ANI): Researchers at the University of Liege in Liege, Belgium, led a Human Brain Project (HBP) study that looked at novel methods that could enable patients with severe brain damage or who were in a coma discern between two dif…", "url": "https://theprint.in/features/exploring-mechanisms-underlying-consciousness-problems/1139196/", "urlToImage": null, "publishedAt": "2022-09-22T17:17:09Z", "content": "Liege [Belgium], September 22 (ANI): Researchers at the University of Liege in Liege, Belgium, led a Human Brain Project (HBP) study that looked at novel methods that could enable patients with sever… [+4163 chars]"}, {"source": {"id": null, "name": "Bizzbuzz.news"}, "author": "Sreeja Ramesh", "title": "A herculean task lies ahead for India to end AIDS by 2030 - Bizz Buzz", "description": "Even though it has been more than 5 years since the HIV and AIDS (Prevention and Control) Bill was...", "url": "https://www.bizzbuzz.news/eco-buzz/a-herculean-task-lies-ahead-for-india-to-end-aids-by-2030-1169082", "urlToImage": "https://www.bizzbuzz.news/h-upload/2022/09/22/1595379-aids.jpg", "publishedAt": "2022-09-22T17:04:12Z", "content": "Forty years since the first AIDS cases were reported in the world, and 35 years since the first case was reported in India, HIV still threatens one and all. Today, the world is off track from deliver… [+5342 chars]"}, {"source": {"id": null, "name": "Medicinematters.com"}, "author": null, "title": "EASD 2022 | Microalbuminuria in pregnancy forecasts adverse outcomes | medwirenews.com - medwireNews", "description": "Women with type 1 diabetes who have microalbuminuria at the time of pregnancy have an increased risk for adverse pregnancy outcomes in the short term and for diabetes complications in the long term, shows research.", "url": "https://diabetes.medicinematters.com/easd-2022/pregnancy/microalbuminuria-pregnancy-forecasts-adverse-outcomes/23526784", "urlToImage": "https://nemo-assets-live.public.springernature.app/static/version/img/mmdiabetes-favicons/apple-touch-icon.png", "publishedAt": "2022-09-22T17:03:13Z", "content": "medwireNews: Women with type 1 diabetes who have microalbuminuria at the time of pregnancy have an increased risk for adverse pregnancy outcomes in the short term and for diabetes complications in th… [+2475 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Miriam E. Tucker", "title": "Type 1 Diabetes Cases Poised to Double Worldwide by 2040 - Medscape", "description": "Most people with existing and new-onset type 1 diabetes are adults, and much of the increase is expected in low- and middle-income countries.", "url": "https://www.medscape.com/viewarticle/981233", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220922_diabetes_girl_800x450.jpg", "publishedAt": "2022-09-22T16:57:50Z", "content": "STOCKHOLM, Sweden The number of people living with type 1 diabetes worldwide is expected to double by 2040, with most new cases among adults living in low- and middle-income countries, new modeling d… [+5014 chars]"}, {"source": {"id": null, "name": "Lbl.gov"}, "author": "ssuh", "title": "Indoor Air-Cleaning Strategies Are Key to Minimizing Virus Spread - Lawrence Berkeley National Laboratory (.gov)", "description": "In a recent review in the journal Indoor Air, researchers at Berkeley Lab presented a thorough review of the state of the science for several key strategies to reduce airborne infection risk using building controls.", "url": "https://newscenter.lbl.gov/2022/09/22/indoor-air-cleaning-strategies/", "urlToImage": "https://newscenter.lbl.gov/wp-content/uploads/2022/09/Indoor-Air-Cleaning-Video-Screen-Shot-2.jpg", "publishedAt": "2022-09-22T16:33:48Z", "content": "Along with vaccines, masks, and testing, indoor air hygiene and building engineering controls will be key to slowing the spread of airborne, highly infectious variants of COVID-19.\r\nIn a recent revie… [+3336 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "Research identifies new treatment target for CNS injury and neurological disease - Labiotech.eu", "description": "Researchers in the U.K. have identified a potential target for drugs to treat long-term neurological conditions like Alzheimer’s Disease.", "url": "https://www.labiotech.eu/trends-news/research-treatment-target-cns-injury-neurological-disease/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2021/06/alzheimers-disease-biogen-amyloid-aducanumab.jpg", "publishedAt": "2022-09-22T16:31:41Z", "content": "Researchers in Birmingham in the U.K. have identified a potential target for drugs to treat long-term neurological conditions like Alzheimers Disease and foster nerve regeneration in central nervous … [+3321 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Steve Stiles", "title": "Add PCSK9 Inhibitors to Statins at Primary PCI: EPIC-STEMI - Medscape", "description": "The powerful LDL-lowering agents aren't being used to their fullest potential, but giving them early to STEMI patients along with high-intensity statins would help amend that, researchers say.", "url": "https://www.medscape.com/viewarticle/981234", "urlToImage": "https://img.medscape.com/thumbnail_library/ps_220921_alirocumab_injection_800x450.jpg", "publishedAt": "2022-09-22T16:28:15Z", "content": "It's best to have patients on aggressive lipid-lowering therapy before discharge after an acute ST-segment elevation myocardial infarction (STEMI), so why not start it right away even in the cath lab… [+9499 chars]"}, {"source": {"id": null, "name": "Neurologylive.com"}, "author": "Marco Meglio", "title": "Potential Increased Risk for Guillain-Barré Syndrome in Pediatric Patients Observed Following COVID-19 Vaccination - Neurology Live", "description": "From the pre-COVID period to 6 weeks after vaccination, the reporting rate of GBS was significantly different, regardless of whether Brighton criteria was applied to the analysis. The authors noted that passive surveillance limitations warrant further analysi…", "url": "https://www.neurologylive.com/view/potential-increased-risk-guillain-barr-syndrome-pediatric-patients-following-covid-19-vaccination", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/neurolive/56ae8dd044b9e4c52fa5a8806fc27adac339f847-300x300.png?fit=crop&auto=format", "publishedAt": "2022-09-22T16:08:37Z", "content": "Findings from the Vaccine Adverse Event Reporting System database showed that among pediatric patients, there is an increased prevalence of Guillain-Barré syndrome (GBS) 6 weeks after they received P… [+3625 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Becky McCall", "title": "Could Cold Exposure, Especially Shivering, Combat Type 2 Diabetes? - Medscape", "description": "Ten days of daily 1-hour shivering sessions at 10°C led to significant drops in blood glucose, lipid levels, and blood pressure as well as changes in glucose tolerance, shows a novel study.", "url": "https://www.medscape.com/viewarticle/981221", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220922_shivering_winter_800x450.jpg", "publishedAt": "2022-09-22T16:03:05Z", "content": "STOCKHOLM, Sweden Shivering upon repeated short exposures to cold improves glucose tolerance, decreases fasting blood glucose and lipid levels, and markedly reduces blood pressure, show new study res… [+7828 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Uniindia News Service", "title": "Sugar-coated pouches in body fluids can help detect cancer - United News of India", "description": "Kolkata, Sep 22 (UNI) Detection of the cancer microenvironment may soon become much easier with the help of a new molecular biosensor recently developed by a team of scientists, according to official sources.", "url": "http://www.uniindia.com/sugar-coated-pouches-in-body-fluids-can-help-detect-cancer/east/news/2827853.html", "urlToImage": "", "publishedAt": "2022-09-22T15:32:00Z", "content": "More News22 Sep 2022 | 11:17 PMGangtok, Sep 22 (UNI) Rowan Ainsworth, Kolkata-based Consul General of Australia, called on Sikkim Governor Ganga Prasad at Rajbhawan here on Thursday, according to Raj… [+900 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Annie Lennon", "title": "Drinking 4 cups of tea daily may reduce type 2 diabetes risk - Medical News Today", "description": "New research suggests that drinking 4 or more cups of tea—such as green tea, oolong tea, and black tea—a day was linked to a 17% lower risk of developing type 2 diabetes.", "url": "https://www.medicalnewstoday.com/articles/drinking-4-cups-of-tea-daily-may-reduce-type-2-diabetes-risk", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/09/tea-pot-diabetes-risk-facebook-1200x628.png", "publishedAt": "2022-09-22T15:31:51Z", "content": "<ul><li>Researchers investigated the effects of drinking different types of teasuch as green tea, oolong tea, and black teaon diabetes risk. </li><li>They found that drinking 13 cups of tea decreased… [+5491 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Micro-level social structures and the success of COVID-19 national policies - Nature.com", "description": "A dynamic network model using data from ten European countries indicates that differences in micro-level social interactions can explain a substantial part of variations in the success of national pandemic policies.", "url": "https://www.nature.com/articles/s43588-022-00314-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs43588-022-00314-0/MediaObjects/43588_2022_314_Fig1_HTML.png", "publishedAt": "2022-09-22T15:05:22Z", "content": "Physical interaction network model\r\nCOVID-19 mainly spreads from person-to-person in interactions with close physical proximity. Consequently, one ideally needs to build a physical contact network-ba… [+21785 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "BIHAP improves glucose regulation in patients with insulin-dependent diabetes after total pancreatectomy - Medical Dialogues", "description": "Researchers have found in a new study that the use of bihormonal  artificial pancreas (BIHAP) among...", "url": "https://medicaldialogues.in/surgery/news/bihap-improves-glucose-regulation-in-patients-with-insulin-dependent-diabetes-after-total-pancreatectomy-99487", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/21/185960-aorn13293-fig-0006-m.jpg", "publishedAt": "2022-09-22T15:00:44Z", "content": "Researchers have found in a new study that the use of bihormonal artificial pancreas (BIHAP) among patients who developed diabetes after pancreatectomy was linked to significantly increased time in e… [+2805 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Oral capsule and colonic administration both demonstrate similar advantages for C. difficile infection - Medical Dialogues", "description": "Minnesota: In a prospective trial published in the Journal of Clinical Gastroenterology and...", "url": "https://medicaldialogues.in/gastroenterology/news/oral-capsule-and-colonic-administration-both-demonstrate-similar-advantages-for-c-difficile-infection-99458", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/27/184401-fecal-microbiota-transplantation.jpg", "publishedAt": "2022-09-22T15:00:44Z", "content": "Minnesota: In a prospective trial published in the Journal of Clinical Gastroenterology and Hepatology, fecal microbiota transplantation (FMT) administered through oral capsule or colonic administrat… [+3214 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Noninvasive CT scan before coronary angiography improves satisfaction, outcomes in patients with prior... - Medical Dialogues", "description": "The trial found that a pre-procedure noninvasive CT scan is beneficial in patients with prior CABG...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/noninvasive-ct-scan-before-coronary-angiography-improves-satisfaction-outcomes-in-patients-with-prior-cabg-bypass-ctca-99481", "urlToImage": "https://medicaldialogues.in/h-upload/2022/01/08/167909-coronary-ct-angiography.jpg", "publishedAt": "2022-09-22T15:00:28Z", "content": "The trial found that a pre-procedure noninvasive CT scan is beneficial in patients with prior CABG needing invasive coronary angiography.USA: A noninvasive CT scan before invasive coronary angiograph… [+2149 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Oseltamivir Associated With Improved Outcomes for Younger Patients with Influenza - Medical Dialogues", "description": "Oseltamivir is tied with improved outcomes for younger patients  with influenza according to a...", "url": "https://medicaldialogues.in/pediatrics-neonatology/news/oseltamivir-associated-with-improved-outcomes-for-younger-patients-with-influenza-99482", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/21/185964-download-65.jpg", "publishedAt": "2022-09-22T15:00:17Z", "content": "Oseltamivir is tied with improved outcomes for younger patients with influenza according to a recent study published in the JAMA Pediatrics.Oseltamivir is recommended for all children hospitalized wi… [+2455 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Dr Subhaprakash Sanyal", "title": "Chronic Myeloid Leukaemia: Uncommon cancer of white blood cells - Firstpost", "description": "The most common form of treatment that has also received great success in CML patients is through Tyrosine kinase inhibitors", "url": "https://www.firstpost.com/health/chronic-myelogenous-leukaemia-a-cancer-of-the-bone-marrow-11312421.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/02/cancer.jpg", "publishedAt": "2022-09-22T14:42:52Z", "content": "We have grown to understand the term Leukaemia as a form of cancer that starts in the blood or blood-forming tissues. There are multiple types of leukaemia, those that are chronic and then those that… [+4081 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Chanchal", "title": "Does sitting for long hours, inactive lifestyle increase risk of heart diseases? | Mint - Mint", "description": "Does sitting for long hours and living an inactive lifestyle increase the risk of heart diseases? Explain experts", "url": "https://www.livemint.com/news/sitting-for-long-hours-inactive-lifestyle-multiple-heart-diseases-11663855849470.html", "urlToImage": "https://images.livemint.com/img/2022/09/22/600x338/FILES-GERMANY-HEALTH-VIRUS-LABOUR-HOME-OFFICE-0_1637640494532_1663856485111_1663856485111.jpg", "publishedAt": "2022-09-22T14:40:21Z", "content": "What does sitting for long hours and leading an inactive lifestyle do to your heart? The World Health Organization (WHO) had said that physical inactivity is a leading cause of disease and disability… [+3883 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Global COPD prevalence, deaths and disability-adjusted life-years declined in recent years - Healio", "description": "COPD prevalence, death and disability-adjusted life-year rates around the world were lower in 2019 than in 1990, researchers reported in The BMJ. Researchers conducted a systematic analysis of data from the Global Burden of Disease Study 2019 for 204 countrie…", "url": "https://www.healio.com/news/pulmonology/20220922/global-copd-prevalence-deaths-and-disabilityadjusted-lifeyears-declined-in-recent-years", "urlToImage": "https://www.healio.com/~/media/slack-news/pulmonology/misc/infographics/2022/pulm0922safiri_graphic_01.jpg", "publishedAt": "2022-09-22T13:56:52Z", "content": "COPD prevalence, death and disability-adjusted life-year rates around the world were lower in 2019 than in 1990, researchers reported in TheBMJ. \r\nResearchers conducted a systematic analysis of data … [+2926 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Study finds Alzheimer's disease risk connected to newly discovered protein - Times of India", "description": "According to a new USC study, a mutation in a newly discovered small protein is connected to a significant increase in the risk for Alzheimer's disease, expanding the known gene targets for the disease and presenting a new potential avenue for treatment. The …", "url": "https://timesofindia.indiatimes.com/videos/news/study-finds-alzheimers-disease-risk-connected-to-newly-discovered-protein/videoshow/94379977.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-94379977,imgsize-59196.cms", "publishedAt": "2022-09-22T13:51:13Z", "content": "Sep 22, 2022, 07:21PM ISTSource: ANIAccording to a new USC study, a mutation in a newly discovered small protein is connected to a significant increase in the risk for Alzheimer's disease, expanding … [+588 chars]"}, {"source": {"id": null, "name": "DairyReporter.com"}, "author": "dairyreporter.com", "title": "Consuming dairy slashes risk of type 2 diabetes - study - DairyReporter.com", "description": "Italian researchers have discovered that eating certain animal products including dairy could reduce the risk of developing the chronic disease.", "url": "https://www.dairyreporter.com/Article/2022/09/22/consuming-dairy-slashes-risk-of-type-2-diabetes-study", "urlToImage": "https://www.dairyreporter.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/dairyreporter.com/news/r-d/consuming-dairy-slashes-risk-of-type-2-diabetes-study/15788379-1-eng-GB/Consuming-dairy-slashes-risk-of-type-2-diabetes-study.jpg", "publishedAt": "2022-09-22T13:47:00Z", "content": "Limiting consumption of animal products is a common advice that health practitioners extend to patients at risk of developing type 2 diabetes (T2D), but new research has discovered that eating certai… [+1379 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Best Bulking Steroids Review (Get Rid of Body Fat and Rebuild Your Muscle with The Best Bulking Steroids for Men and Women) - Deccan Herald", "description": "Get the maximum anabolic strength with zero side effects For certain persons rebuilding a hard muscle mass may be a simple matter, but for most of us (ordinary people), it is a relentless and very soul-destroying struggle. It is a \"hard\" process requiring dis…", "url": "https://www.deccanherald.com/brandspot/pr-spot/best-bulking-steroids-review-get-rid-of-body-fat-and-rebuild-your-muscle-with-the-best-bulking-steroids-for-men-and-women-1147328.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/gfnvnb.jpg", "publishedAt": "2022-09-22T13:21:05Z", "content": "Get the maximum anabolic strength with zero side effects\r\nFor certain persons rebuilding a hard muscle mass may be a simple matter, but for most of us (ordinary people), it is a relentless and very s… [+21448 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "D-Bal Max Review (Best Natural Bodybuilding Supplement with Zero Side Effects) - Deccan Herald", "description": "Is it really worth the money? An objective review of the popular supplement D-Bal Max will help to form a more complete and objective opinion and pictures about its effectiveness and its effects on the user’s organism.  The review will give clear answers on w…", "url": "https://www.deccanherald.com/brandspot/pr-spot/d-bal-max-review-best-natural-bodybuilding-supplement-with-zero-side-effects-1147320.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Sgzdf.jpg", "publishedAt": "2022-09-22T13:04:02Z", "content": "Is it really worth the money?\r\nAn objective review of the popular supplement D-Bal Max will help to form a more complete and objective opinion and pictures about its effectiveness and its effects on … [+23212 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Keys to keeping your brain healthy - EurekAlert", "description": "Things slow down for a lot of us as we get older. But your brain can stay healthy longer with a little effort.", "url": "https://www.eurekalert.org/news-releases/965496", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-22T12:32:57Z", "content": "Your brain is pretty fabulous. Around 100 billion nerve cells work together to keep you nimble and quick in your thinking.\r\nBut just like the rest of the body, your brain may not be quite as vigorous… [+4190 chars]"}, {"source": {"id": null, "name": "Cornell.edu"}, "author": null, "title": "Discovery illuminates how Parkinson's disease spreads in the brain | Cornell Chronicle - Cornell Chronicle", "description": "Aggregates of a protein spread in the brains of people with Parkinson’s disease through a cellular waste-ejection process, suggests a new study led by Weill Cornell Medicine researchers.", "url": "https://news.cornell.edu/stories/2022/09/discovery-illuminates-how-parkinsons-disease-spreads-brain", "urlToImage": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/istock-1328467745-parkinsons-neuron-1280x720_0.jpg?itok=e5k8Jbrk", "publishedAt": "2022-09-22T12:27:26Z", "content": "Aggregates of the protein alpha-synuclein spread in the brains of people with Parkinsons disease through a cellular waste-ejection process, suggests a new study led by Weill Cornell Medicine research… [+4280 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Pooja Biraia Jaiswal", "title": "Understanding gyneacological cancers and infertility among women - The Week", "description": "Gyneacological cancers refers to cancerous outgrowths in woman's reproductive organs", "url": "https://www.theweek.in/news/health/2022/09/22/understanding-gyneacological-cancers-and-infertility-among-women.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/2020/images/2022/7/2/cancer-patient-hospital-shut.jpg", "publishedAt": "2022-09-22T12:27:16Z", "content": "On July 25 this year, Lancet published a series on gyneacological cancers. In its summary, the journal noted that gynaecological cancers are among the most prevalent cancers in women worldwide. In vi… [+5333 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Limiting Protein Intake May Help Control Obesity, Diabetes: Study - News18", "description": "In the study, the effects of protein and calorie restriction diets in humans were compared.", "url": "https://www.news18.com/news/lifestyle/limiting-protein-intake-may-help-control-obesity-diabetes-study-6013627.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/untitled-design-3-49-166384806716x9.png", "publishedAt": "2022-09-22T12:01:52Z", "content": "Limiting protein intake can help manage metabolic syndrome, including some of its symptoms like diabetes, obesity, and high blood pressure (hypertension), claims a study conducted by researchers in B… [+1997 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keto Gummies For Weight Loss [Keto ACV Gummies] Scam or Legit Do Keto Gummies Work? - The Tribune India", "description": "Minerals, vitamins, and mixed natural components are crucial for your body's proper growth and operation. While most people obtain the appropriate amount of nutrients by eating healthfully, certain people require a slight nutrient boost. Supplements can help …", "url": "https://www.tribuneindia.com/news/brand-connect/keto-gummies-for-weight-loss-keto-acv-gummies-scam-or-legit-do-keto-gummies-work-434286", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1003603292.png", "publishedAt": "2022-09-22T11:50:00Z", "content": "Minerals, vitamins, and mixed natural components are crucial for your body's proper growth and operation. While most people obtain the appropriate amount of nutrients by eating healthfully, certain p… [+8074 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Canada confirms 1,379 monkeypox cases - ETHealthWorld", "description": "The provinces are waiting for the National Advisory Committee on Immunization to provide guidance on if and how to start a second-dose strategy which is expected in the coming weeks", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/canada-confirms-1379-monkeypox-cases/94373609", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94373609,imgsize-24766,width-1200,height-628,overlay-ethealthworld/canada-confirms-1-379-monkeypox-cases.jpg", "publishedAt": "2022-09-22T10:30:00Z", "content": "Ottawa: Canada has confirmed 1,379 cases of monkeypox, including 38 hospitalisations, the Public Health Agency of Canada said.Of the confirmed cases, 667 are from Ontario, 515 from Quebec, 150 from B… [+582 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan, Dr Chand Wattal", "title": "Monkey pox arrives in India-Sir Ganga Ram Hospital Research - Medical Dialogues", "description": "A research that was recently released by researchers from Institute of Clinical Microbiology and...", "url": "https://medicaldialogues.in/mdtv/medicine/videos/monkey-pox-arrives-in-india-sir-ganga-ram-hospital-research-99484", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/22/186078-why-sudden-increase-in-melioidosis-cases-in-india.jpg", "publishedAt": "2022-09-22T10:27:05Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Blood clot risk remains for year after Covid in those who aren't hospitalised - Times Now", "description": "Covid-19 infection increases the risk of potentially life-threatening blood clots for at least 49 weeks or almost a year, even in those who do not get hospitalised, researchers have warned.", "url": "https://www.timesnownews.com/health/blood-clot-risk-remains-for-year-after-covid-in-those-who-arent-hospitalised-article-94374160", "urlToImage": "https://static.tnn.in/thumb/msid-94374160,imgsize-100,width-1280,height-720,resizemode-75/94374160.jpg", "publishedAt": "2022-09-22T10:19:03Z", "content": "Pandemic may have led to an additional 10,500 cases of heart attacks, strokes, and other blood clot complications such as deep vein thrombosis in England and Wales in the UK in 2020 alone, a study sa… [+2 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study on over 1,600 patients suggests simple intervention to increase breast cancer cure rates: Director, Ta.. - ETHealthWorld", "description": "\"The trial in women undergoing breast cancer surgery involved the injection of a commonly used drug around the tumour, on the operating table, just before surgery The injection requires no additional expertise, is inexpensive, and can result in saving up to 1…", "url": "https://retail.economictimes.indiatimes.com/news/diagnostics/study-on-over-1600-patients-suggests-simple-intervention-to-increase-breast-cancer-cure-rates-director-tata-memorial-centre/94371826", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94371826,imgsize-15464,width-1200,height-628,overlay-ethealthworld/study-on-over-1-600-patients-suggests-simple-intervention-to-increase-breast-cancer-cure-rates-director-tata-memorial-centre.jpg", "publishedAt": "2022-09-22T09:15:00Z", "content": "Mumbai: A study on over 1,600 patients suggests a simple intervention to increase breast cancer cure and survival rates, said Dr Rajendra Badwe, Director of Tata Memorial Centre (Tata Cancer Hospital… [+4778 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Shutting Down \"Backup Genes\" Leads to Ovarian Cancer Remission in Mice - Technology Networks", "description": "Researchers have used a machine learning algorithm to find weaknesses in mouse models of ovarian cancer. Cells delete DNA when they become cancerous, so the researchers targeted the \"backup plans\" running critical cell functions, leading to remission.", "url": "https://www.technologynetworks.com/cancer-research/news/shutting-down-backup-genes-leads-to-ovarian-cancer-remission-in-mice-365859", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/365859/shutting-down-backup-genes-leads-to-ovarian-cancer-remission-in-mice-365859-640x360.jpg?cb=20220922", "publishedAt": "2022-09-22T08:49:55Z", "content": "The way that tumor cells enable their uncontrolled growth is also a weakness that can be harnessed to treat cancer, researchers at the University of Michigan and Indiana University have shown.\r\nTheir… [+3474 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Dr Kaustubh Mahajan", "title": "Manage your spinal cord injury pain with 5 lifestyle changes - Health shots", "description": "Do you have spinal cord injury? If so, here's an essential guide for you that can help manage your pain.", "url": "https://www.healthshots.com/preventive-care/self-care/5-lifestyle-tips-to-manage-spinal-cord-injury-pain/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/09/22124634/spinal-cord-injury.jpg", "publishedAt": "2022-09-22T08:45:07Z", "content": "People suffering from spinal cord injury usually face difficulty transitioning to everyday life. This is mainly because spinal cord injuries can dramatically affect the quality of life and even hampe… [+4679 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Malaria spike linked to amphibian die-off: Study - Hindustan Times", "description": "Some frogs, salamanders and other amphibians eat hundreds of mosquito eggs each day. Mosquitoes are a vector for malaria. Scientists wondered, could the crash in amphibians have influenced the rise in malaria cases? | Health", "url": "https://www.hindustantimes.com/lifestyle/health/malaria-spike-linked-to-amphibian-die-off-study-101663835306513.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/22/1600x900/pjimage_18_1663835363815_1663835363994_1663835363994.jpg", "publishedAt": "2022-09-22T08:31:46Z", "content": "A new study links an amphibian die-off in Costa Rica and Panama with a spike in malaria cases. The study demonstrates the importance of biodiversity to human health.\r\nThe study, published in the jour… [+3685 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Tips to balance hormones for smooth, pain-free periods - Times Now", "description": "An imbalance between estrogen and progesterone levels causes a harrowing time every month for some women when they have periods. From stomach pain to heavy bleeding, backache, headache, severe cramps, diarrhoea, and even constipation, it is a really tough tim…", "url": "https://www.timesnownews.com/health/tips-to-balance-hormones-for-smooth-pain-free-periods-article-94369882", "urlToImage": "https://static.tnn.in/thumb/msid-94369882,imgsize-100,width-1280,height-720,resizemode-75/94369882.jpg", "publishedAt": "2022-09-22T07:40:35Z", "content": "JMI Admissions 2022: Jamia Millia to release first merit list on Sept 26 on jmicoe.in, detailed schedule here"}, {"source": {"id": null, "name": "India.com"}, "author": "Ipsita Bhattacharya", "title": "EXCLUSIVE: Can Alzheimer`s disease be prevented? Symptoms, causes and treatment for this dementia - what do... - Zee News", "description": "September is the month when the international campaign takes place to raise awareness about the disease. Recently on September 21, countries also observed World Alzheimers Day. These are all dedicated to raising awareness about Alzheimers and dementia.", "url": "https://zeenews.india.com/health/exclusive-can-alzheimers-disease-be-prevented-symptoms-causes-and-treatment-for-this-dementia-what-doctor-says-2513009", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/22/1093516-old-woman-demntia-pixa.jpg", "publishedAt": "2022-09-22T07:09:41Z", "content": "World Alzheimer's Month: September is the month when the international campaign takes place to raise awareness about the disease. Recently on September 21, countries also observed World Alzheimer's D… [+3256 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Parina Taneja", "title": "Vitamin D Deficiency: These 5 alarming signs can put you at risk; know symptoms and treatment - India TV News", "description": "Vitamin D Deficiency: The deficiency of this vitamin can have an adverse effect on the brain and hair which are clearly visible. According to research, 70 to 90 per cent of the people of India are suffering from vitamin D deficiency.", "url": "https://www.indiatvnews.com/health/vitamin-d-deficiency-5-alarming-signs-put-you-at-risk-know-symptoms-and-treatment-latest-health-news-2022-09-22-810480", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/09/vitamin-d-deficiency-1663828761.jpg", "publishedAt": "2022-09-22T06:49:28Z", "content": "Vitamin D Deficiency: Most people in our country are suffering from vitamin D deficiency. Many people don't even know that they are deficient. In such a situation, it becomes very important to unders… [+2706 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dengue: The Threats Around Dengue & Measures - NDTV", "description": "Dengue: As cases are on a daily rise, here is what you need to know.", "url": "https://www.ndtv.com/health/dengue-the-threats-around-dengue-measures-3366920", "urlToImage": "https://i.ndtvimg.com/i/2015-07/washing-hands_650x400_41435948313.jpg", "publishedAt": "2022-09-22T06:32:12Z", "content": "Dengue: Maintaining personal hygiene and keeping your surroundings clean can lower risk\r\nAs the COVID-19 pandemic winds down, it leaves behind a sense of unease and worries among the general populati… [+5055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Cancer in the under 50s is rising, globally – why? - The Indian Express", "description": "What we are exposed to in early life can affect our risk of developing cancer later in life, and this review of cancer trends looks at how these factors might be affecting early-onset cancers", "url": "https://indianexpress.com/article/lifestyle/health/cancer-in-the-under-50s-is-rising-globally-why-8164544/", "urlToImage": "https://images.indianexpress.com/2022/09/cancer-cover.jpg", "publishedAt": "2022-09-22T06:30:06Z", "content": "We know what we need to do to reduce our risk of getting cancer, right? Wear SPF, stop smoking, avoid processed foods, keep fit, lose weight and get enough sleep.But what if much of what causes cance… [+4018 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Ignite Amazonian Sunrise Drops Review: Truth Revealed About Ignite Weight Loss Drops! - Deccan Herald", "description": "High blood pressure, fatigue, lack of sleep, shortness of breath, diabetes, cardiovascular issues, and even depression are all co-morbidities of obesity. These risk factors accumulate as you struggle with your weight, fighting a losing battle every day.", "url": "https://www.deccanherald.com/brandspot/pr-spot/ignite-amazonian-sunrise-drops-review-truth-revealed-about-ignite-weight-loss-drops-1147220.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Picture1_344.jpg", "publishedAt": "2022-09-22T06:21:05Z", "content": "High blood pressure, fatigue, lack of sleep, shortness of breath, diabetes, cardiovascular issues, and even depression are all co-morbidities of obesity. These risk factors accumulate as you struggle… [+9884 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Common Gene Variant 'APOE' Present in 3% of the World's Population Linked to COVID-19 Mortality: Nature Study - The Weather Channel", "description": "More than 6.5 million people have lost their lives across the globe due to COVID-19. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-09-22-common-gene-variant-linked-to-covid-19-mortality", "urlToImage": "https://s.w-x.co/in-covid_infection.jpg", "publishedAt": "2022-09-22T05:51:20Z", "content": "In a significant find, a Nature study has linked a gene called 'APOE' with COVID-19-related deaths. And Retrospective analysis suggests that 3% of people on Earth (at least 230 million) have copies o… [+3177 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "PAHO says Brazil, Dominican Republic, Haiti, Peru at very high risk for polio as vaccination dwindles - ETHealthWorld", "description": "Regional vaccine coverage for polio has fallen to about 79%, the lowest since 1994, PAHO said.", "url": "https://health.economictimes.indiatimes.com/news/industry/paho-says-brazil-dominican-republic-haiti-peru-at-very-high-risk-for-polio-as-vaccination-dwindles/94366479", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94366479,imgsize-20406,width-1200,height-628,overlay-ethealthworld/paho-says-brazil-dominican-republic-haiti-peru-at-very-high-risk-for-polio-as-vaccination-dwindles.jpg", "publishedAt": "2022-09-22T05:45:00Z", "content": "Mexico: The Pan American Health Organization (PAHO) on Wednesday said Brazil, the Dominican Republic, Haiti and Peru are at very high risk for the reintroduction of polio, as dwindling vaccination ra… [+1957 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA  Web Team", "title": "Feeling lethargic: 5 reasons why you always feel tired - DNA India", "description": "If you feel like you are always tired, fatigue is probably a symptom of some other condition.", "url": "https://www.dnaindia.com/lifestyle/report-feeling-lethargic-5-reasons-why-you-always-feel-tired-2987101", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/09/22/2540631-tiredness.jpg", "publishedAt": "2022-09-22T03:35:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Sep 22, 2022, 12:46 PM ISTFeeling fatigued can be a major impediment to your lifestyle. Not only it keeps you low on energy, but … [+2414 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "ABC of rabies in Kerala - The New Indian Express", "description": "Rabies mortality rate in Kerala has seen a spike this year. If fatality rate was 6-8 on average in the previous years, it saw a spurt in 2022", "url": "https://www.newindianexpress.com/states/kerala/2022/sep/22/abc-of-rabies-in-kerala-2500629.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/7/25/w600X390/Rabies_deaths.jpg", "publishedAt": "2022-09-22T01:04:00Z", "content": "Rabies mortality rate in Kerala has seen a spike this year. If fatality rate was 6-8 on average in the previous years, it saw a spurt in 2022\r\nChildren under the age of 15 form 40% of victims of bite… [+3634 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Protection against omicron (B.1.1.529) BA.2 reinfection conferred by primary omicron BA.1 or pre-omicron SARS-CoV-2 infection among health-care workers with and without mRNA vaccination: a test-negative case-control study - The Lancet", "description": "Health-care workers who had received two doses of mRNA vaccine and had previous BA.1\ninfection were subsequently well protected for a prolonged period against BA.2 reinfection,\nwith a third vaccine dose conferring no improvement to that hybrid protection. If\n…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00578-3/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a7bd6d8c-3a3a-4e4a-a6a9-253bb45449ad/gr1.jpg", "publishedAt": "2022-09-21T22:32:32Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Severe COVID-19 caused by “senile” interferon response in older patients, researchers suggest - EurekAlert", "description": "Researchers in Germany have discovered that age-dependent impairments in antiviral interferon proteins underlie the increased susceptibility of older patients to severe COVID-19. The study, published today in the Journal of Experimental Medicine (JEM), shows …", "url": "https://www.eurekalert.org/news-releases/965491", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/79bb1d0f-de65-432e-8b11-d0af51a6da45/Rendition/thumbnail/Content/Public", "publishedAt": "2022-09-21T21:25:22Z", "content": "image: 5 days after infection, SARS-CoV-2 antigen (brown staining) is dispersed throughout the lung tissue of aged mice, leading to severe disease and death.view more \r\nCredit: © 2022 Beer et al. Ori… [+4745 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Sharma", "title": "Swine flu and dengue cases rising in India, govt warns | Mint - Mint", "description": "More than 1,455 cases of swine flu with 30 deaths have been reported this year in India", "url": "https://www.livemint.com/news/india/swine-flu-and-dengue-cases-rising-in-india-govt-warns-11663777634830.html", "urlToImage": "https://images.livemint.com/img/2022/09/21/600x338/dengue_1663777845002_1663777856540_1663777856540.jpg", "publishedAt": "2022-09-21T19:42:05Z", "content": "NEW DELHI : India is being buffeted by cases of swine flu and dengue that are threatening to become an outbreak just as it seeks to close the chapter on the covid pandemic. The country has reported m… [+1939 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Digestive Herbs For Gut Health - Slurrp", "description": "These herbs are perfect for gut health.", "url": "https://www.slurrp.com/article/digestive-herbs-for-gut-health-1663783777005", "urlToImage": "https://images.slurrp.com/prodarticles/rzquy7pnw2p.webp", "publishedAt": "2022-09-21T18:19:08Z", "content": "We have unproductive digestive systems as a result of daily work stress, a sedentary lifestyle, and bad eating habits including eating irregularly, eating too much, or eating on the go, which causes … [+2819 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Coffee intake associated with low liver stiffness but not steatosis - Medical Dialogues", "description": "USA: A new study published in Clinical Gastroenterology and Hepatology Journal found that coffee is...", "url": "https://medicaldialogues.in/gastroenterology/news/coffee-intake-associated-with-low-liver-stiffness-but-not-steatosis-99426", "urlToImage": "https://medicaldialogues.in/h-upload/2022/04/01/173372-coffee.avif", "publishedAt": "2022-09-21T15:00:31Z", "content": "USA: A new study published in Clinical Gastroenterology and Hepatology Journal found that coffee is linked to low liver stiffness according to controlled attenuation parameter (CAP) measurements in U… [+2466 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Vilobelimab may reduce mortality in patients with severe COVID-19 pneumonia - Healio", "description": "Treatment with vilobelimab reduced mortality at 28 to 60 days in patients with severe COVID-19 pneumonia without increasing infections, according to data presented at the European Respiratory Society International Congress.Vilobelimab (InflaRx) is a first-in-…", "url": "https://www.healio.com/news/pulmonology/20220921/vilobelimab-may-reduce-mortality-in-patients-with-severe-covid19-pneumonia", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/rheumatology/c/covid_19_3.jpg", "publishedAt": "2022-09-21T13:55:04Z", "content": "Source/Disclosures\r\n Source: Vlaar APJ, et al. ALERT 3: COVID and Interstitial Lung Diseases. Presented at: European Respiratory Society International Congress; Sept. 4-6, 2022 (hybrid meeting). \r\nDi… [+3617 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Non-communicable diseases cause 74% of global deaths: WHO - Medical Xpress", "description": "Non-communicable diseases like heart disease, cancer and diabetes are responsible for 74 percent of deaths globally and cracking down on risk factors could save millions of lives, the WHO said Wednesday.", "url": "https://medicalxpress.com/news/2022-09-non-communicable-diseases-global-deaths.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/death.jpg", "publishedAt": "2022-09-21T13:44:04Z", "content": "Non-communicable diseases like heart disease, cancer and diabetes are responsible for 74 percent of deaths globally and cracking down on risk factors could save millions of lives, the WHO said Wednes… [+4198 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Adults with type 2 diabetes reach HbA1c target faster with tirzepatide than semaglutide - Healio", "description": "Adults with type 2 diabetes assigned tirzepatide achieved glycemic targets in a shorter time than those taking 1 mg semaglutide or titrated insulin degludec, according to an analysis of SURPASS-2 and SURPASS-3 data. \nIn findings presented at the European Asso…", "url": "https://www.healio.com/news/endocrinology/20220921/adults-with-type-2-diabetes-reach-hba1c-target-faster-with-tirzepatide-than-semaglutide", "urlToImage": "https://www.healio.com/~/media/slack-news/endocrinology/infographics/et0922viljoen_easd_graphic_01_web.jpg", "publishedAt": "2022-09-21T13:23:09Z", "content": "We were unable to process your request. Please try again later. If you continue to have this issue please contact customerservice@slackinc.com.Back to Healio\r\nAdults with type 2 diabetes assigned tir… [+3429 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Arpita Sarkar", "title": "Seven Healthy Steps To Reduce Risk Of Dementia In People With Type 2 Diabetes! - Woman's Era", "description": "Womansera magazine is a platform for women to get latest info and tips on fashion, beauty, health and relationship advice. Subscribe to India's No.1 women's magazine!", "url": "https://womansera.com/seven-healthy-steps-to-reduce-risk-of-dementia-in-people-with-type-2-diabetes/", "urlToImage": "https://womansera.com/wp-content/uploads/2022/09/sugar.jpg", "publishedAt": "2022-09-21T13:07:22Z", "content": "Many people make various kinds of jokes about people’s wrong minds. But dementia is an example of how dangerous delusions can be. A report published by the ‘Lancet’ newspaper says that by the year 20… [+1812 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Dwaipayan Sengupta", "title": "25 Best fruit and vegetable juices for healthy and glowing skin - PINKVILLA", "description": "Check Out Our List Of The 25 Best Fruit And Vegetable Juices That Contribute To Healthy And Glowing Skin", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/25-best-fruit-and-vegetable-juices-for-healthy-and-glowing-skin-1191408", "urlToImage": "https://englishst.pinkvilla.com/english/images/2022/09/408794069_fruit-and-veggie-juices-lead-image_1280*720.jpg", "publishedAt": "2022-09-21T11:03:55Z", "content": "When it comes to skincare, you might think expensive skincare products would make your skin glow. However, apart from factory-made moisturizers and acids, did you know that natural fruit and vegetabl… [+12048 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Portugal announces preventive vaccination against monkeypox for priority groups - ETHealthWorld", "description": "The preventive vaccination logistics strategy will be managed at the level of each region, after identifying eligible citizens in a specialist consultation,\" said the health authority", "url": "https://health.economictimes.indiatimes.com/news/industry/portugal-announces-preventive-vaccination-against-monkeypox-for-priority-groups/94350457", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-94350457,imgsize-43356,width-1200,height-628,overlay-ethealthworld/portugal-announces-preventive-vaccination-against-monkeypox-for-priority-groups.jpg", "publishedAt": "2022-09-21T10:45:00Z", "content": "Lisbon: Portugal's Directorate-General for Health (DGS) has announced a preventive vaccination for the most vulnerable groups against monkeypox.Priority groups include people who are at \"increased ri… [+581 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Dr M Gopinath talks about heart in very young, young, and old people - Zee News", "description": "This article is for educational purposes only. Please consult a qualified doctor before taking any decisions regarding recommendations in the article or for more information.) References: 1. Types of Heart Disease in Children [Internet] [Updated May 11, 2017].", "url": "https://zeenews.india.com/health/dr-m-gopinath-talks-about-heart-in-very-young-young-and-old-people-2512552.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/21/1093104-dr.gopinath.jpg", "publishedAt": "2022-09-21T04:56:15Z", "content": "Heart in very young people\r\nThe heart is generally healthy in very young people with all the muscles of the heart receiving appropriate blood flow, heart valves working in perfect rhythm as well as s… [+3715 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "New theory suggests Alzheimer’s might be an autoimmune condition - EastMojo", "description": "The pursuit of a cure for Alzheimer’s disease is becoming an increasingly competitive and contentious quest with recent years witnessing several important", "url": "http://www.eastmojo.com/health/2022/09/21/new-theory-suggests-alzheimers-might-be-an-autoimmune-condition/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2020/05/medic_563423_1920-3.jpg?fit=1920%2C1280&ssl=1", "publishedAt": "2022-09-21T03:50:00Z", "content": "The pursuit of a cure for Alzheimers disease is becoming an increasingly competitive and contentious quest with recent years witnessing several important controversies.\r\nIn July 2022, Science magazin… [+6533 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "France approves Omicron-adapted vaccines for booster shot - indiablooms", "description": "Paris: The French national health authority (HAS) approved three bivalent mRNA vaccines against the Covid-19 Omicron variants for a booster shot during the vaccination campaign starting on October 18.", "url": "https://www.indiablooms.com/health-details/H/11967/france-approves-omicron-adapted-vaccines-for-booster-shot.html", "urlToImage": "https://www.indiablooms.com/health_pic/2022/2294b9f30f5d53cc81693d6f67dc9031.jpg", "publishedAt": "2022-09-21T03:49:55Z", "content": "Paris: The French national health authority (HAS) approved three bivalent mRNA vaccines against the Covid-19 Omicron variants for a booster shot during the vaccination campaign starting on October 18… [+917 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Nine test +ve for dengue, three contract swine flu - The Tribune India", "description": "Nine persons tested positive for dengue and three were found infected with swine flu on Tuesday.", "url": "https://www.tribuneindia.com/news/ludhiana/nine-test-ve-for-dengue-three-contract-swine-flu-433749", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_1108343448.jpg", "publishedAt": "2022-09-21T01:13:00Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+505 chars]"}]}