{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "Medscape"}, "author": "Marilynn Larkin", "title": "COPD Patients at Higher Risk of Death 1 Year After Surgery - Medscape", "description": "Patients with chronic obstructive pulmonary disease are 26% more likely to die after elective surgery and to incur increased healthcare costs, compared with peers without the condition, researchers say.", "url": "https://www.medscape.com/viewarticle/987144", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_230118_senior_spirometry_800x450.jpg", "publishedAt": "2023-01-18T21:30:11Z", "content": "Patients with chronic obstructive pulmonary disease (COPD) are more likely to die within a year of undergoing elective surgery and to incur higher healthcare costs than similar patients without COPD,… [+5966 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Lana Dykes", "title": "Yoga, Cognitive Behavioral Therapy Improves Patient-Reported Outcomes in Fibromyalgia, IBS - MD Magazine", "description": "Improved patient-reported outcomes were observed in patients who used mind-body interventions, such as cognitive behavioral therapy and yoga, and were effective for managing IBS and fibromyalgia.", "url": "https://www.hcplive.com/view/yoga-cognitive-behavioral-therapy-improves-patient-reported-outcomes-in-fibromyalgia-ibs", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/2b2ce48b37c5ba6d8f37eaaddcc03fc3ca2a67b0-5933x3955.jpg?fit=crop&auto=format", "publishedAt": "2023-01-18T19:14:50Z", "content": "Mind-body interventions (MBIs), specifically cognitive behavioral therapy (CBT) and yoga, were shown to improve patient-reported outcome measures in patients with fibromyalgia (FM) and irritable bowe… [+3672 chars]"}, {"source": {"id": null, "name": "Health.com"}, "author": "https://www.facebook.com/Health/", "title": "What Is the Green Mediterranean Diet—And Should You Try It? - Health.com", "description": "The green Mediterranean diet is a newer take on the standard Mediterranean diet that is based on similar foods but scales even further back on meat in favor of plant-based foods. It may help lower blood pressure, reduce insulin resistance, and increase loss o…", "url": "https://www.health.com/green-mediterranean-diet-7095181", "urlToImage": "https://www.health.com/thmb/nzztz11gigygmRyPw3WbIfLwWSw=/1731x0/filters:no_upscale():max_bytes(150000):strip_icc()/Health-Stocksy-2745204-b627dfabd9764e75ad313076b0ae1197.jpg", "publishedAt": "2023-01-18T17:59:27Z", "content": "Stocksy/Cameron Whitman\r\nYouve probably heard of the standard Mediterranean diet, but a green versionknown simply as the green Mediterranean dietis a newer concept that has steadily gained momentum i… [+7138 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Nuclear remodelling contributes to cardiac dysfunction during ageing - Nature.com", "description": "A new study shows that age-dependent nuclear remodelling in cardiomyocytes (via age-related loss of nuclear lamins) contributes to cardiac dysfunction through a process that is conserved in flies, mice and nonhuman primates.", "url": "https://www.nature.com/articles/s41569-023-00832-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41569-023-00832-y/MediaObjects/41569_2023_832_Figa_HTML.png", "publishedAt": "2023-01-18T17:36:10Z", "content": "Ageing is associated with a progressive decline in organ function, including the heart. However, the detailed mechanisms of age-related cardiac functional decline are unclear. A new study shows that … [+391 chars]"}, {"source": {"id": null, "name": "Utah.edu"}, "author": null, "title": "What Is Blepharitis, and What Can You Do About It? - University of Utah Health Care", "description": "John A. Moran Eye Center optometrist Deepika Bagga, OD, explains the latest approaches to managing blepharitis, including prescription medications, at-home remedies—and even the Mediterranean diet.", "url": "https://healthcare.utah.edu/healthfeed/postings/2023/01/what-is-blepharitis.php", "urlToImage": "https://healthcare.utah.edu/healthfeed/postings/2022/images/blepharitis.jpeg", "publishedAt": "2023-01-18T17:24:31Z", "content": "Jan 18, 2023 10:00 AM\r\nAuthor: \r\n John A. Moran Eye Center\r\nAs a dry-eye expert, John A. Moran Eye Center optometrist Deepika Bagga, OD,has decades of experience caring for patients with blepharitis.… [+2850 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Tight transmission bottlenecks may limit the evolution of SARS-CoV-2 variants - News-Medical.Net", "description": "A new study describes that tight transmission bottlenecks restrict the evolution of SARS-CoV-2 in the transmission chain. SARS-CoV-2 is the causative pathogen of the COVID-19 pandemic.", "url": "https://www.news-medical.net/news/20230118/Tight-transmission-bottlenecks-may-limit-the-evolution-of-SARS-CoV-2-variants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736149_16740605509243859.jpg", "publishedAt": "2023-01-18T17:11:00Z", "content": "A study published in Nature Communications describes that tight transmission bottlenecks restrict the evolution of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) in the transmission cha… [+4035 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Sagar Puri", "title": "Apple Health Benefits: This Red fruit helps in reducing Cholesterol- Know why you should eat it everyday - Zee News", "description": "Here are some of its benefits 1. Apple helps in Reducing Cholestrol According to a study eating 2 apples can helps in reducing Cholestrol levels. In human studies, consuming up to two to three medium-sized apples resulted in a decrease in total cholesterol le…", "url": "https://zeenews.india.com/health/apple-health-benefits-this-red-fruit-helps-in-reducing-cholesterol-know-why-you-should-eat-it-everyday-2563108", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/18/1143195-apple-health-benefits.jpg", "publishedAt": "2023-01-18T17:04:01Z", "content": "There is a quote that 'an apple a day keeps the doctor away'. Apples are the second most consumed fruit worldwide due to their health benefits. They play a significant role in the overall dietary int… [+2199 chars]"}, {"source": {"id": null, "name": "Advisory.com"}, "author": null, "title": "4 ways to boost your immune system this winter - The Daily Briefing", "description": "", "url": "https://www.advisory.com/daily-briefing/2023/01/18/immune-system", "urlToImage": null, "publishedAt": "2023-01-18T15:53:06Z", "content": "As the weather gets colder, more Americans will start getting sick with the flu or Covid-19. Here are four ways health experts say you can help improve your immune system to better protect against ge… [+4674 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Sneha Santuka", "title": "Hepatitis B: Signs, Symptoms & Causes - Sportskeeda", "description": "A virus is responsible for causing hepatitis B, which is a liver infection (HBV). Some forms of this infection are chronic and may result in cirrhosis or even liver cancer.", "url": "https://www.sportskeeda.com/health-and-fitness/hepatitis-b-signs-symptoms-causes", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/b462e-16740545492741-1920.jpg", "publishedAt": "2023-01-18T15:48:59Z", "content": "A virus is responsible for causing hepatitis B, which is a liver infection (HBV). Some forms of this infection are chronic and may result in cirrhosis or even liver cancer.\r\nThe five different types … [+4339 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Dr. V Ravi", "title": "Cervical Cancer Awareness Month 2023: Understanding The Importance Of Regular Screenings - NDTV Doctor", "description": "In certain cases, HPV doesn't always cause symptoms, and here the only way to be sure of the cervical cancer status is through regular screening.", "url": "https://doctor.ndtv.com/womens-health/cervical-cancer-awareness-month-2023-understanding-the-importance-of-regular-screenings-3704213", "urlToImage": "https://i.ndtvimg.com/i/2017-12/cervical-cancer-prevention_650x400_51513849002.jpg", "publishedAt": "2023-01-18T15:39:09Z", "content": "Just like how the pink colour represents breast cancer, Teal draws attention to the second most common malignant Cervical Cancer amongst women.\r\nOver 99% of cervical cancer cases are caused by Human … [+3980 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Pure Neuro Reviews [2023 Urgently-Updated] Amazon, Coupon Code, Ingredients, Miracle - Deccan Herald", "description": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions such as thinking memory, memory, learning social cognition,…", "url": "https://www.deccanherald.com/brandspot/pr-spot/pure-neuro-reviews-2023-urgently-updated-amazon-coupon-code-ingredients-miracle-1182334.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p21-1182334-1674056303.png", "publishedAt": "2023-01-18T15:38:23Z", "content": "Brains of humans are perhaps the most remarkable product of evolutionary biology to today. It's comprised of a complicated neural network that controls the sensory, cognitive and behavioral functions… [+26798 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marlene Busko", "title": "Nitrite Food Additives May Increase Risk of Type 2 Diabetes - Medscape", "description": "Greater intake of nitrites from food additives was tied to greater risk of developing type 2 diabetes, in a French study, but some experts question the findings.", "url": "https://www.medscape.com/viewarticle/987095", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230118_sodium_nitrate_800x450.jpg", "publishedAt": "2023-01-18T15:29:34Z", "content": "Consuming a large amount of nitrites from food additives versus none was associated with a greater risk of developing type 2 diabetes in the NutriNet-Santé study in France, researchers report.\r\nHowev… [+6511 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Wellness Wednesday: Busting health myths - News4JAX The Local Station", "description": "Dominique Landry, certified personal trainer and founder of Fit Enough, joins us to answer your biggest health questions and debunk myths about fitness.", "url": "https://www.youtube.com/watch?v=Vv7D7Dg7LoA", "urlToImage": "https://i.ytimg.com/vi/Vv7D7Dg7LoA/maxresdefault.jpg", "publishedAt": "2023-01-18T15:29:08Z", "content": null}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Keto Excel Keto Gummies Australia Reviews 2023: Chemist Warehouse Exposed Hidden Dangers! - The Tribune India", "description": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies Australia help the body through ketosis and fasting. This i…", "url": "https://www.tribuneindia.com/news/brand-connect/keto-excel-keto-gummies-australia-reviews-2023-chemist-warehouse-exposed-hidden-dangers-471559", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1685757973.png", "publishedAt": "2023-01-18T15:25:00Z", "content": "Being overweight can be a difficult reality for many people. With the help of modern technology, however, there is now hope for those who are struggling with their weight. The Keto Excel Keto Gummies… [+9254 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Aislinn Antrim", "title": "Study: Increased Coffee Consumption May Reduce Severity of Non-Alcoholic Fatty Liver Disease in Patients With Type 2 Diabetes - Pharmacy Times", "description": "Individuals with higher caffeine levels were less likely to have liver fibrosis, while higher levels of non-caffeine coffee components were associated with reduced fatty liver index scores.", "url": "https://www.pharmacytimes.com/view/study-increased-coffee-consumption-may-reduce-severity-of-non-alcoholic-fatty-liver-disease-in-patients-with-type-2-diabetes", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/13003e3ce26d4b8eb963d06cb9d5be4560e1d92a-986x810.png?fit=crop&auto=format", "publishedAt": "2023-01-18T15:24:48Z", "content": "Caffeine, polyphenols, and other natural products found in coffee may help reduce the severity of non-alcoholic fatty liver disease (NAFLD) among overweight individuals with type 2 diabetes, accordin… [+2584 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Biomarkers Predicting Poor Prognosis in Covid-19 Patients: A Survival Analysis - Cureus", "description": "Introduction\r\n\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importance. The objective of this study is to determine the relat…", "url": "https://www.cureus.com/articles/132461-biomarkers-predicting-poor-prognosis-in-covid-19-patients-a-survival-analysis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/527759/article_river_4d90f260886611eda03ce7ff2d482aa6-cox.png", "publishedAt": "2023-01-18T15:11:24Z", "content": "Introduction\r\nWith the spread of the Covid-19 pandemic and its overwhelming impact on health systems in several countries, the importance of identifying predictors of severity is of paramount importa… [+35617 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Synogut Reviews: Amazon, Where to Buy, Pills, Price - Deccan Herald", "description": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and poor digestive systems. The reason for this is mostly due to…", "url": "https://www.deccanherald.com/brandspot/pr-spot/synogut-reviews-amazon-where-to-buy-pills-price-1182322.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p18-1182322-1674054168.png", "publishedAt": "2023-01-18T15:02:48Z", "content": "People are increasingly choosing ready-to-eat foods over healthy food choices and a growing population, the world is experiencing an health crisis. People all over the world have bloating issues and … [+34754 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Back Pain Breakthrough Reviews: Dr. Steve Young Help You? - Deccan Herald", "description": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasional stiffness or ashes it is important to know that your body…", "url": "https://www.deccanherald.com/brandspot/pr-spot/back-pain-breakthrough-reviews-dr-steve-young-help-you-1182321.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p17-1182321-1674053743.png", "publishedAt": "2023-01-18T14:55:43Z", "content": "If you've been a victim of your body due to stiffness, pain or lack of energy, it's not the responsibility. It's not your fault. to be living like this. It can occur to everyone. If you have occasion… [+20743 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "All Day Slimming Tea Reviews: Herbal Tea Helps in Weight Loss! - Deccan Herald", "description": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people continue to overlook how important the practice of maintain…", "url": "https://www.deccanherald.com/brandspot/pr-spot/all-day-slimming-tea-reviews-herbal-tea-helps-in-weight-loss-1182319.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p16-1182319-1674053444.png", "publishedAt": "2023-01-18T14:50:44Z", "content": "There is never an issue that maintaining regular dental hygiene is a great way to keep dental issues from developing, such as gum disease and dental cavities. However, a significant portion of people… [+31612 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jessica Braun Gervais", "title": "Flu Statistics – Forbes Health - Forbes", "description": "", "url": "https://www.forbes.com/health/body/flu-statistics/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/x/https://www.forbes.com/health/wp-content/uploads/2023/01/flu_statistics.jpeg.jpg", "publishedAt": "2023-01-18T14:39:43Z", "content": null}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Body Dissatisfaction primary cause of eating disorders at any age including during perimenopause - Medical Dialogues", "description": "Eating disorders are stereotypically associated with adolescents and young adults. Growing evidence, however, suggests that these conditions can occur at any time during a woman's lifespan,...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/body-dissatisfaction-primary-cause-of-eating-disorders-at-any-age-including-during-perimenopause-105794", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/18/198649-untitled-design-2023-01-18t114638036.jpg", "publishedAt": "2023-01-18T14:30:43Z", "content": "Eating disorders are stereotypically associated with adolescents and young adults. Growing evidence, however, suggests that these conditions can occur at any time during a woman's lifespan, including… [+3077 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Albuminuric diabetic kidney disease may increase risk of Diabetic Foot Ulcer by two to three folds - Medical Dialogues", "description": "France: According to a recent research paper  published in the Journal of Diabetes And its Complications, the researchers  have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/albuminuric-diabetic-kidney-disease-may-increase-risk-of-diabetic-foot-ulcer-by-two-to-three-folds-105691", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/16/198355-diabetic-foot-ulcer.jpg", "publishedAt": "2023-01-18T14:30:25Z", "content": "France: According to a recent research paper published in the Journal of Diabetes And its Complications, the researchers have concluded that in type 2 diabetes (T2D) patients, albuminuric Diabetic Ki… [+3330 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Inclisiran treatment in high-risk patients provides sustained reductions in LDL-cholesterol: ORION-3 - Medical Dialogues", "description": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/inclisiran-treatment-in-high-risk-patients-provides-sustained-reductions-in-ldl-cholesterol-orion-3-105746", "urlToImage": "https://medicaldialogues.in/h-upload/2021/09/14/160388-ldl-c.jpg", "publishedAt": "2023-01-18T14:30:15Z", "content": "USA: In patients with high cardiovascular risk and elevated LDL cholesterol, twice-yearly inclisiran provided early reductions in LDL cholesterol and was well-tolerated over four years in the ORION-3… [+3795 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Amyl Guard Reviews: Ingredients, Customer reviews, Worthy Supplement to Buy or Scam? - Deccan Herald", "description": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same! Are you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredient that will aid you in losing weight without having to make…", "url": "https://www.deccanherald.com/brandspot/pr-spot/amyl-guard-reviews-ingredients-customer-reviews-worthy-supplement-to-buy-or-scam-1182310.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p14-1182310-1674051198.png", "publishedAt": "2023-01-18T14:13:18Z", "content": "Are you looking to shed weight without all the hassle? Amyl Guard promises to do the same!\r\nAre you trying to lose weight, but don't want to follow an extreme diet? Amyl Guard claims to be an ingredi… [+28672 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Threshold control method could aid in future non-pharmaceutical intervention relaxation policy making - News-Medical.Net", "description": "Governments around the world used a variety of techniques known as nonpharmaceutical interventions, or NPIs, to control the spread of COVID-19.", "url": "https://www.news-medical.net/news/20230118/Threshold-control-method-could-aid-in-future-non-pharmaceutical-intervention-relaxation-policy-making.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Influenza-620x480.jpg", "publishedAt": "2023-01-18T14:01:00Z", "content": "Governments around the world used a variety of techniques known as nonpharmaceutical interventions, or NPIs, to control the spread of COVID-19. These NPIs include mandated mask-wearing, social distan… [+3044 chars]"}, {"source": {"id": null, "name": "Nationalturk.com"}, "author": "Yusuf", "title": "How Dangerous Is The BF.7 Variant? - NationalTurk English", "description": "At the beginning of December, China dropped its strict anti-corona measures. Since then, the virus has spread rapidly. According to unofficial estimates, almost 250 million people could have been infe", "url": "https://www.nationalturk.com/en/how-dangerous-is-the-bf-7-variant/", "urlToImage": "https://i0.wp.com/www.nationalturk.com/en/wp-content/uploads/2023/01/BF.7-variant.jpg", "publishedAt": "2023-01-18T13:55:29Z", "content": "At the beginning of December, China dropped its strict anti-corona measures. Since then, the virus has spread rapidly. According to unofficial estimates, almost 250 million people could have been inf… [+4624 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "How To Unlock Your Hip Flexors [Reviewed] Legit DVD Videos or Scam? - Deccan Herald", "description": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our hip is the most powerful and important muscle that connects t…", "url": "https://www.deccanherald.com/brandspot/pr-spot/how-to-unlock-your-hip-flexors-reviewed-legit-dvd-videos-or-scam-1182303.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p12-1182303-1674049612.png", "publishedAt": "2023-01-18T13:46:52Z", "content": "Unlock Your Hip Flexors Program claims to reveal the secret of hip flexibility that hasn't yet been discovered by any doctor or medical professional yet. According to the program's creator that our h… [+29622 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Turmeric milk to herbal tea; try these healthy drinks to stay hydrated in winters - India TV News", "description": "As a result of the cold temperatures, we forget to drink water because our thirst cues are weaker, and we consequently feel dehydrated. Here are 5 winter beverages that will help you stay hydrated.", "url": "https://www.indiatvnews.com/health/turmeric-milk-to-herbal-tea-try-these-healthy-drinks-to-stay-hydrated-in-winters-health-tips-2023-01-18-840347", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/er-1-1674048782.jpg", "publishedAt": "2023-01-18T13:45:07Z", "content": "Winter season concerns include dry and dull skin, but we often overlook the need for proper hydration. We fail to drink enough water in winter due to the low temperatures, and as a result, we get deh… [+2971 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Ultraviolet light emitting devices leads to cell death, cancer-causing mutations in human - ANI News", "description": "There may be greater public health risks associated with the ultraviolet nail polish drying equipment used to cure gel manicures than previously realised. These ultraviolet (UV) light-emitting devices were studied by researchers at the University of Californi…", "url": "https://www.aninews.in/news/science/ultraviolet-light-emitting-devices-leads-to-cell-death-cancer-causing-mutations-in-human20230118185532", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230118132431.jpg", "publishedAt": "2023-01-18T13:25:00Z", "content": "San Diego (California) [US] January 18 (ANI): There may be greater public health risks associated with the ultraviolet nail polish drying equipment used to cure gel manicures than previously realised… [+6093 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Sunflowers use an internal clock to bloom at optimal times - Earth.com", "description": "Sunflowers use an internal clock to bloom at optimal times • Earth.com", "url": "https://www.earth.com/news/sunflowers-use-an-internal-clock-to-bloom-at-optimal-times/", "urlToImage": "https://cff2.earth.com/uploads/2023/01/18052252/Sunflowers-scaled.jpg", "publishedAt": "2023-01-18T13:01:34Z", "content": "Sunflower heads consist of hundreds of tiny florets. Due to the way sunflowers grow, the youngest florets are in the center of the flower face and the most mature one at the edges, forming a spiral p… [+2630 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Reducing calories may result in greater weight loss than intermittent fasting - Hindustan Times", "description": "According to recent research 'time-restricted eating patterns' - known as intermittent fasting - are popular, rigorously designed studies have not yet determined whether limiting the total eating window during the day helps to control weight. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/reducing-calories-may-result-in-greater-weight-loss-than-intermittent-fasting-study-reveals-101674044355696.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/istockphoto-1190114524-612x612_1667128302204_1674046040650_1674046040650.jpg", "publishedAt": "2023-01-18T12:52:50Z", "content": "According to a research, the number and quantity of meals were more important predictors of weight gain or reduction than the interval between meals. The findings of the study were published in the J… [+4504 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "High BMI could diminish Vitamin D effects: Study - Hindustan Times", "description": "The study, by researchers from Brigham and Women's Hospital, US, is a new analysis of data from the VITAL trial.", "url": "https://www.hindustantimes.com/health/high-bmi-could-diminish-vitamin-d-effects-study-101674042951768.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/18/1600x900/125535c6-ba53-11ec-9361-7d60ea16730d_1649763520875_1674043502431_1674043502431.jpg", "publishedAt": "2023-01-18T12:26:51Z", "content": "Scientists have uncovered new evidence that vitamin D may be metabolised differently in people with an elevated body mass index (BMI), diminishing the impact of supplementation in such individuals, a… [+3967 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the impact of maternal hypertension and mental disorders on neonatal outcomes? - News-Medical.Net", "description": "Researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.", "url": "https://www.news-medical.net/news/20230118/What-is-the-impact-of-maternal-hypertension-and-mental-disorders-on-neonatal-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_736094_16740431646153003.jpg", "publishedAt": "2023-01-18T12:25:00Z", "content": "In a recent study published in the Journal of Affective Disorders, researchers explored the impact of maternal hypertension and mental disorders on harmful neonatal outcomes.\r\nStudy: The effect of ma… [+5872 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Study explores effects of dietary choline deficiency on neurologic and system-wide health - ETHealthWorld", "description": "Choline, an essential nutrient produced in small amounts in the liver and found in foods including eggs, broccoli, beans, meat and poultry, is a vital ingredient for human health. A new study explores that deficiency in dietary choline adversely affects the b…", "url": "https://retail.economictimes.indiatimes.com/news/diagnostics/study-explores-effects-of-dietary-choline-deficiency-on-neurologic-and-system-wide-health/97092703", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97092703,imgsize-19094,width-1200,height-628,overlay-ethealthworld/study-explores-effects-of-dietary-choline-deficiency-on-neurologic-and-system-wide-health.jpg", "publishedAt": "2023-01-18T12:18:00Z", "content": "Washington: Choline, an essential nutrient produced in small amounts in the liver and found in foods including eggs, broccoli, beans, meat and poultry, is a vital ingredient for human health. A new s… [+3037 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Potential breakthrough in preventing secondary cancers? | WION Shorts - WION", "description": "Israeli scientists believe they’ve discovered a way to prevent cancerous cells from entering blood and moving around the body causing secondary tumours. The ...", "url": "https://www.youtube.com/watch?v=hkgKPdEIT2A", "urlToImage": "https://i.ytimg.com/vi/hkgKPdEIT2A/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4Ac4FgAKACooCDAgAEAEYZSBWKE0wDw==&rs=AOn4CLDJuSblzXSarUMMVwkV9_ddYSweVA", "publishedAt": "2023-01-18T12:14:17Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Resurge Reviews [2023 Updated] Work For Weight Loss? Read - Deccan Herald", "description": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this. Furthermore the weight loss market is exploding and you will find an abundance of appetit…", "url": "https://www.deccanherald.com/brandspot/pr-spot/resurge-reviews-2023-updated-work-for-weight-loss-read-1182281.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p9-1182281-1674043886.png", "publishedAt": "2023-01-18T12:11:26Z", "content": "Many people across the world are working to build the ideal physique or lose some weight but aren't able to get their hands on the most effective way to accomplish this.\r\nFurthermore the weight loss … [+24508 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Dolly Parton CBD Gummies REVIEWS Shark Tank REVEALED SCAM Or Legit? - mid-day.com", "description": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.", "url": "https://www.mid-day.com/brand-media/article/dolly-parton-cbd-gummies-reviews-shark-tank-revealed-scam-or-legit-23266101", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Dolly-Parton-CBD-Gummies1_d.jpg", "publishedAt": "2023-01-18T12:05:00Z", "content": "Dolly Parton CBD Gummies are cutting-edge methodology to alleviate your pain and discomfort without any negative impact on your health.\r\nThey are made with all the natural ingredients which are organ… [+7740 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Vitamin D deficiency: Study hints at possible risk of muscle loss with age - Times Now", "description": "At the start of the study, none of the participants lost muscle mass with age – however, over the next four years, people who had vitamin D deficiency were 70 per cent more likely to suffer from muscle mass loss. Experts also took other factors into considera…", "url": "https://www.timesnownews.com/health/vitamin-d-deficiency-study-hints-at-possible-risk-of-muscle-loss-with-age-article-97089354", "urlToImage": "https://static.tnn.in/thumb/msid-97089354,imgsize-100,updatedat-1674040024488,width-1280,height-720,resizemode-75/97089354.jpg", "publishedAt": "2023-01-18T11:07:19Z", "content": "Vitamin D is known as the sunshine nutrient for a reason it earns the title due to the way the body makes it."}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Nervogen Pro Reviews Urgent Update Amazon, Walmart - Deccan Herald", "description": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lead to nerve pain and other chronic issues. Neuropathy is comm…", "url": "https://www.deccanherald.com/brandspot/pr-spot/nervogen-pro-reviews-urgent-update-amazon-walmart-1182245.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p6-1182245-1674039509.png", "publishedAt": "2023-01-18T10:58:29Z", "content": "Peripheral neuropathy is an atypical condition that is experienced by a large number of people. It is possible for nerve pain as an indication of fatigue or anxiety. If it is not addressed it can lea… [+28970 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Okinawa Flat Belly Tonic Reviews: Amazon, GNC, Recipe and Official Website - Deccan Herald", "description": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each person is the strength. No matter what your race, color or sex or…", "url": "https://www.deccanherald.com/brandspot/pr-spot/okinawa-flat-belly-tonic-reviews-amazon-gnc-recipe-and-official-website-1182240.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p5-1182240-1674038974.png", "publishedAt": "2023-01-18T10:49:34Z", "content": "The manner in which look is defined has changed over the years. While the criteria for attractiveness for both genders change constantly however, the only thing that stays at the center of each perso… [+33130 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "ADHD more important predictor of anxiety, depression than autism: Study - Times of India", "description": "Science News: LONDON: Scientists have found that ADHD is more predictive of poor mental health outcomes in adults than other neurodevelopmental conditions, like aut.", "url": "https://timesofindia.indiatimes.com/home/science/adhd-more-important-predictor-of-anxiety-depression-than-autism-study/articleshow/97088698.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-97089033,width-1070,height-580,imgsize-12716,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-01-18T10:32:00Z", "content": ""}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "Meditation Alters Gut Microbes In Buddhist Monks For Better Mental Health - ABP Live", "description": "To reach this conclusion, the researchers analysed the stool and blood samples of 37 Tibetan Buddhist monks from three temples and 19 secular residents in the neighbouring areas.", "url": "https://news.abplive.com/lifestyle/meditation-alters-gut-microbes-in-buddhist-monks-for-better-mental-health-1576361", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/01/18/c1e1a7b773fe45ab852eff36d66fcefa1673981515270556_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-01-18T10:30:00Z", "content": "Gut microbes found in Buddhist monks have been linked to lower risks of anxiety, depression and even cardio-vascular disease, thus lowering the risk of mental ill-health as they grow older. A study, … [+2163 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "GlucoBerry Reviews: MD/PROCESS Blood Sugar Supplement Work? Urgent Update - Deccan Herald", "description": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by many people as treatments to control their blood sugar level…", "url": "https://www.deccanherald.com/brandspot/pr-spot/glucoberry-reviews-md/process-blood-sugar-supplement-work-urgent-update-1182225.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1182225-1674037104.png", "publishedAt": "2023-01-18T10:18:24Z", "content": "GlucoBerry is one of the most efficient supplements for health due to its herbal components. The combination of safe ingredients gives the organs the essential nutrients. Vitamin tablets are used by … [+31558 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "How your first brush with COVID warps your immunity - Nature.com", "description": "The immune system responds more strongly to the strain of a virus that it first met, weakening response to other strains. Can this ‘imprinting’ be overcome?", "url": "https://www.nature.com/articles/d41586-023-00086-1", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-023-00086-1/d41586-023-00086-1_23924362.jpg", "publishedAt": "2023-01-18T10:16:53Z", "content": "During the summer of 2022, with the Omicron coronavirus variant running rampant, friends and relatives of immunologist Bob Seder kept asking him if they should postpone their COVID-19 boosters and wa… [+14876 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research shows that exercise promotes a molecular profile in muscle - ANI News", "description": "A recent paper published in the Journal of Physiology deepened the case for the youthfulness-promoting effects of exercise on ageing organisms, building on previous work done with lab mice nearing the end of their natural lifespan that had access to a weighte…", "url": "https://www.aninews.in/news/health/research-shows-that-exercise-promotes-a-molecular-profile-in-muscle20230118154058", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230118093330.jpg", "publishedAt": "2023-01-18T10:10:00Z", "content": "Washington [US], January 18, (ANI): A recent paper published in the Journal of Physiology deepened the case for the youthfulness-promoting effects of exercise on ageing organisms, building on previou… [+3917 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "ProMind Complex Reviews Urgent Update amazon - Deccan Herald", "description": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of our lives, but they also shape us into who we're present da…", "url": "https://www.deccanherald.com/brandspot/pr-spot/promind-complex-reviews-urgent-update-amazon-1182218.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p1-1182218-1674035897.png", "publishedAt": "2023-01-18T09:57:13Z", "content": "The memories we have are among the most valuable thing we have throughout our lives. We connect with our history, present and the present through the memories we have. They aren't just a an aspect of… [+33361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Here’s why you should switch to millets: Study shows refined flour builds up cholesterol in your heart - The Indian Express", "description": "“Eating refined grains is akin to consuming sugars and oils. This is because the removal of bran and fibres increases the glycemic index of the grains. There should be an effort to reduce the amount of simple carbohydrates from the diet, especially when carbo…", "url": "https://indianexpress.com/article/health-wellness/heres-why-you-should-switch-to-millets-study-shows-refined-flour-builds-up-cholesterol-in-your-heart-8389609/", "urlToImage": "https://images.indianexpress.com/2023/01/millets.jpg", "publishedAt": "2023-01-18T09:14:22Z", "content": "What we have known has now been proved clinically, that refined grains are bad for your heart health. In fact, a study of 2,099 Iranian individuals has shown that consumption of refined grains milled… [+2984 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "COVID-19 during pregnancy increases major health risks: Study - ETHealthWorld", "description": "This study provides the most comprehensive evidence to date suggesting that COVID-19 is a threat during pregnancy: Emily R. Smith", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-19-during-pregnancy-increases-major-health-risks-study/97085064", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-97085064,imgsize-21168,width-1200,height-628,overlay-ethealthworld/covid-19-during-pregnancy-increases-major-health-risks-study.jpg", "publishedAt": "2023-01-18T08:30:00Z", "content": "Washington: According to new research published in BMJ Global Health, pregnant women infected with the virus that causes COVID-19 have 7 times increased chance of dying and a considerably increased r… [+2956 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Alberta study shows COVID long-haulers face stigma alongside lingering symptoms - India Education Diary", "description": "High levels of stigma experienced by some COVID long-haulers are associated with more intense symptoms, reduced physical function and loss of employment due to disability, according to newly published research from a Lancet medical journal. Specialis", "url": "https://indiaeducationdiary.in/university-of-alberta-study-shows-covid-long-haulers-face-stigma-alongside-lingering-symptoms/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/University-of-Alberta.jpeg?fit=600%2C400&ssl=1", "publishedAt": "2023-01-18T07:30:58Z", "content": "High levels of stigma experienced by some COVID long-haulers are associated with more intense symptoms, reduced physical function and loss of employment due to disability, according to newly publishe… [+5570 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Health Desk", "title": "Remedies, yogasnas to take care of your bones and joint health in winters - India TV News", "description": "A balanced diet with a rich amount of Vitamin D, and Vitamin C, Omega 3 fatty acids, ginger, soya bean, fatty fish, green vegetables, nuts and seeds, plenty of water, and other collagen supplements will be helpful in joint and bones care during winter season.", "url": "https://www.indiatvnews.com/health/remedies-yogasnas-to-take-care-of-your-bones-and-joint-health-in-winters-2023-01-18-840173", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/bones-health-1674017574.jpg", "publishedAt": "2023-01-18T04:54:16Z", "content": "Winter is here and with temperature dipping every single day, it is getting harder for people to manage bones and joint pain. This increased joint pain during winter is due to the increased inflammat… [+2474 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Anoop Misra", "title": "Can diabetics and weight-watchers have dates, dried fruits and raisins? - The Indian Express", "description": "Dried fruits contain about two/third carbohydrates, have a low protein content and a high amount of fibre. A moderate intake of raisins and nuts is fine for an active and fit person with or without diabetes, says Dr Anoop Misra, Chairman, Fortis CDOC Hospital…", "url": "https://indianexpress.com/article/lifestyle/health-specials/diabetics-weight-watchers-dates-dried-fruits-and-raisins-8388395/", "urlToImage": "https://images.indianexpress.com/2023/01/dates_200.jpg", "publishedAt": "2023-01-18T03:40:47Z", "content": "An Indian patient of mine has been living in Saudi Arabia and gets a check-up done from time to time whenever he is here. This time he asked me, Doc, dates are very popular there. Can I take them? I … [+3616 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/video-desk/", "title": "Health Tips: Add These Foods In Your Kids Diet For Proper Functioning And Growth Of Brain | Watch Video - India.com", "description": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that kids eat meals that are very nourishing and brain-boosting …", "url": "https://www.india.com/video-gallery/health-tips-add-these-foods-in-your-kids-diet-for-proper-functioning-and-growth-of-brain-watch-video-5857925/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/brain_booster_foods_for_kids.jpeg", "publishedAt": "2023-01-18T03:30:05Z", "content": "Brain-Booster Foods: Your diet has a big impact on the structure and functionality of your brain, an organ that uses a lot of energy and needs specific nutrients to stay healthy. It is essential that… [+828 chars]"}, {"source": {"id": null, "name": "Telesurenglish.net"}, "author": "teleSUR/gsd-MS", "title": "Tuberculosis Vaccine Accelerator Council Initiative - WHO - teleSUR English", "description": "A high-level round table on tuberculosis was held at the World Economic Forum in Davos.", "url": "https://www.telesurenglish.net/news/Tuberculosis-Vaccine-Accelerator-Council-Initiative---WHO-20230117-0020.html", "urlToImage": "https://www.telesurtv.net/__export/1674010836156/sites/telesur/img/2023/01/17/cgmeifangzhang.jpg_1810791533.jpg", "publishedAt": "2023-01-18T03:09:12Z", "content": "World Health Organization (WHO) Director-General Tedros Adhanom Ghebreyesus announced Tuesday at the World Economic Forum Davos 2023 a plan to create a new Tuberculosis Vaccine Accelerator Council. \r… [+1828 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "US reports 26000 weekly child Covid-19 cases - Daijiworld.com", "description": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and the Children's Hospital Association.\r\nThis is a decrease from …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1040844", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2023-01-18T02:50:12Z", "content": "Los Angeles, Jan 18 (IANS): Nearly 26,000 child Covid-19 cases were reported in the US in the week ending January 12, according to the latest report by the American Academy of Pediatrics (AAP) and th… [+1025 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "5 toxic brain foods to avoid, according to a Harvard nutritionist #Shorts - CNBC Make It", "description": "Did you know that changing your diet could also have an impact on your mood and mental well-being? :leafy_green: Dr. Uma Naidoo suggests avoiding these 5 foo...", "url": "https://www.youtube.com/watch?v=qAtLVJu5qZg", "urlToImage": "https://i.ytimg.com/vi/qAtLVJu5qZg/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYNyAlKH8wDw==&rs=AOn4CLChySLoAM2qW0sTwezYcb4jcpp2Sw", "publishedAt": "2023-01-17T17:00:26Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Some Ayurvedic swaps to help you manage PCOS better - The Indian Express", "description": "\"The Ayurvedic approach to treating PCOS includes dietary changes like consuming a balanced and nourishing diet, increasing the intake of bitter and astringent vegetables and more,\" said r Yogini Patil, BAMS and nutritionist", "url": "https://indianexpress.com/article/lifestyle/health/ayurvedic-swaps-to-help-manage-pcos-better-8168682/", "urlToImage": "https://images.indianexpress.com/2022/09/PCOS-1.jpg", "publishedAt": "2023-01-17T13:30:37Z", "content": "Polycystic ovarian syndrome (PCOS) is a hormonal (endocrine) disorder that can lead to irregular periods, excess body hair, skin issues, weight gain, and also anxiety. As such, it is essential to kee… [+3590 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Thyroid Awareness Month | What Every Woman Should Know About Thyroid Disorders - SHOWSHA", "description": "Do you know women are more prone to thyroid issues and can suffer from it irrespective of their age? That’s why, in this thyroid awareness month, it’s import...", "url": "https://www.youtube.com/watch?v=HwblTcwlPds", "urlToImage": "https://i.ytimg.com/vi/HwblTcwlPds/maxresdefault.jpg", "publishedAt": "2023-01-17T13:30:05Z", "content": null}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Quietum Plus Reviews: Amazon, Tinnitus, Consumer Reports, Ingredients - Deccan Herald", "description": "Quietum Plus: Your search stops hear! Hearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern life it's obvious that this problem isn't reserved for the elde…", "url": "https://www.deccanherald.com/brandspot/pr-spot/quietum-plus-reviews-amazon-tinnitus-consumer-reports-ingredients-1181979.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1181979-1673958573.png", "publishedAt": "2023-01-17T12:29:33Z", "content": "Quietum Plus: Your search stops hear!\r\nHearing loss can be a major factor in your life, whether caused by genetics, aging or the effects of noise pollution. With the increasing pressures of modern li… [+31006 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers use MRI data to predict brain tumor progression - ANI News", "description": "Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.", "url": "https://www.aninews.in/news/science/researchers-use-mri-data-to-predict-brain-tumor-progression20230117172550", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230117075802.jpg", "publishedAt": "2023-01-17T11:55:00Z", "content": "Washington [US], January 17 (ANI): Researchers at the University of Waterloo have created a computational model to predict the growth of deadly brain tumours more accurately.Glioblastoma multiforme (… [+2216 chars]"}, {"source": {"id": null, "name": "Punekarnews.in"}, "author": "Rahul Dolare", "title": "Alcoholic Cardiomyopathy: Binge drinking may be hurting your heart - Punekar News", "description": "Punekarnews.in is the first and only English language hyper-local news portal of Pune and Pimpri Chinchwad. It was launched in July 2014.", "url": "https://www.punekarnews.in/alcoholic-cardiomyopathy-binge-drinking-may-be-hurting-your-heart/", "urlToImage": "https://www.punekarnews.in/wp-content/uploads/2020/03/alcohal.jpg", "publishedAt": "2023-01-17T06:52:30Z", "content": "Authored by Dr. Pradeep Kumar D, Sr. Consultant – Interventional Cardiology, Aster CMI Hospital, Bangalore\r\nPune, 17 Janauary 2023: A vast majority of people consider binge drinking to be harmless an… [+5739 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Brie Schmidt", "title": "Could Your Hormones Be The Reason Behind Your Dry Eyes? - Health Digest", "description": "Dry eyes, as the name implies, occur when the eyes lack lubrication from tears. Symptoms can include redness, blurred vision, light sensitivity, and stinging.", "url": "https://www.healthdigest.com/1166484/could-your-hormones-be-the-reason-behind-your-dry-eyes/", "urlToImage": "https://www.healthdigest.com/img/gallery/could-your-hormones-be-the-reason-behind-your-dry-eyes/l-intro-1673625660.jpg", "publishedAt": "2023-01-17T04:58:00Z", "content": "Hormones affect nearly every part of the body, including the eyes. As WebMD explains, several types of hormone fluctuations can trigger dry eye syndrome. One hormone that plays a role in tear product… [+1345 chars]"}]}