{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": null, "name": "NewsBytes"}, "author": null, "title": "5 health benefits of lotus root - NewsBytes", "description": "Also called kamal kakdi, lotus root is actually the root of the lotus plant, which grows underwater in muddy ponds. This super-healthy and nutritious vegetable looks like squash.", "url": "https://www.newsbytesapp.com/visualstories/lifestyle/5-health-benefits-of-lotus-root", "urlToImage": "", "publishedAt": "2022-11-06T18:32:08Z", "content": "Helps manageblood pressure\r\nThe high quantity of potassiumpresent in lotus roots makes them a great vasodilator and ensures a balance of fluids in the body. It also relaxes the blood vessels.\r\nLotus … [+784 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Harshita Malhotra", "title": "Benefits Of Feta Cheese For Weight Loss - Slurrp", "description": "Do you know feta cheese healthier than other types of cheese?", "url": "https://www.slurrp.com/article/benefits-of-feta-cheese-for-weight-loss-1667758410504", "urlToImage": "https://images.slurrp.com/prodarticles/7k8fnya49rm.webp", "publishedAt": "2022-11-06T18:23:39Z", "content": "Feta is still thought to be a reasonable option to eat in moderation because it has less fat than many other kinds of cheese. It is also simpler to digest because it is typically made with milk from … [+1458 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Somita Pal", "title": "5 children trek up Himalayan base camp to raise funds for cancer - Hindustan Times", "description": "Mumbai: A 11-year-old boy, Neev Shah, saw the struggle of a cancer patient’s family up and close when his maternal uncle succumbed to the disease four months back | Mumbai news", "url": "https://www.hindustantimes.com/cities/mumbai-news/5-children-trek-up-himalayan-base-camp-to-raise-funds-for-cancer-101667758046285.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/06/1600x900/8b2c1eb2-5dfd-11ed-8e23-5469c5b8902c_1667758044700.jpg", "publishedAt": "2022-11-06T18:07:25Z", "content": "Mumbai: A 11-year-old boy, Neev Shah, saw the struggle of a cancer patients family up and close when his maternal uncle succumbed to the disease four months back. When the mother of his friend Krisha… [+2206 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Namrata Devikar", "title": "Punekars in sick bay due to sudden drop in mercury levels - Hindustan Times", "description": "There is an about 20% increase in viral infections like cough, cold and fever. The majority of patients are children and senior citizens, says doctor", "url": "https://www.hindustantimes.com/cities/pune-news/punekars-in-sick-bay-due-to-sudden-drop-in-mercury-levels-101667757792547.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/06/1600x900/e0a0897e-5dfc-11ed-8f96-a5c1f3470f4c_1667757790814.jpg", "publishedAt": "2022-11-06T18:03:12Z", "content": "With temperatures dropping to as low as 12.7 degree Celsius on Sunday the coldest day in November so far according to the weather department several doctors are reporting an increase in Asthma cases … [+1832 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Dogs with bone cancer can be treated using 'click' chemistry: Study - ANI News", "description": "California and Denmark researchers received Novel Prize in Chemistry for developing \"click\" chemistry, a method for linking molecules like LEGOs that could be a more effective manner of transferring medications to cancer tumours.", "url": "https://www.aninews.in/news/science/dogs-with-bone-cancer-can-be-treated-using-click-chemistry-study20221106230506", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221106172238.jpg", "publishedAt": "2022-11-06T17:35:00Z", "content": "Washington [US], November 6 (ANI): California and Denmark researchers received Novel Prize in Chemistry for developing \"click\" chemistry, a method for linking molecules like LEGOs that could be a mor… [+5317 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research finds poor health outcomes related to substance use disorders - ANI News", "description": "Individuals with a history of hospitalisation for substance use disorders had considerably worse results following the onset of a wide range of physical health illnesses, according to experts from the UK and Czechia.", "url": "https://www.aninews.in/news/health/research-finds-poor-health-outcomes-related-to-substance-use-disorders20221106230429", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221106173419.jpg", "publishedAt": "2022-11-06T17:34:00Z", "content": "Washington [US], November 6 (ANI): Individuals with a history of hospitalisation for substance use disorders had considerably worse results following the onset of a wide range of physical health illn… [+4485 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study examines temporal effects of pre-existing CKD, other medical conditions on COVID-19 outcomes - News-Medical.Net", "description": "Individuals with chronic kidney disease (CKD) are vulnerable to developing severe forms of COVID-19, and acute kidney injury is a common complication of COVID-19.", "url": "https://www.news-medical.net/news/20221106/Study-examines-temporal-effects-of-pre-existing-CKD-other-medical-conditions-on-COVID-19-outcomes.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Pandemic-620x480.jpg", "publishedAt": "2022-11-06T17:31:00Z", "content": "Individuals with chronic kidney disease (CKD) are vulnerable to developing severe forms of COVID-19, and acute kidney injury is a common complication of COVID-19. A recent analysis examined the tempo… [+1299 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Divya", "title": "Top 7 Foods That Are Bad for Cholesterol - Sportskeeda", "description": "Our body cells contain cholesterol, which is a waxy, fat-like molecule.", "url": "https://www.sportskeeda.com/health-and-fitness/top-7-foods-that-are-bad-cholesterol", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/19c66-16677547862048-1920.jpg", "publishedAt": "2022-11-06T17:13:33Z", "content": "Our body cells contain cholesterol, which is a waxy, fat-like molecule. It is made by the liver, plays a role in the synthesis of hormones and vitamins, and aids in the prevention of cell deteriorati… [+4574 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Experts discover secret to people's viral resistance. Here's why its important | Mint - Mint", "description": "After screening the immune systems of women who were exposed to hepatitis C (HCV) through contaminated anti-D transfusions given more than 40 years ago in Ireland, researchers have discovered a secret", "url": "https://www.livemint.com/news/world/experts-discover-secret-to-people-s-viral-resistance-here-s-why-its-important-11667752280147.html", "urlToImage": "https://images.livemint.com/img/2022/11/06/600x338/821eb618-4fcf-11ed-9c66-3477b4c7a0de_1666284071306_1666284071306_1667753172549_1667753172549.jpeg", "publishedAt": "2022-11-06T16:55:19Z", "content": "In a groundbreaking discovery, researchers from Trinity College Dublin have found the secret that may help to explain why some people are able to resist viral infections. The research which was publi… [+4351 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Dietary fiber promote inflammation in gut: Research - ANI News", "description": "According to researchers, a type of dietary fibre called inulin, which is used in health supplements and have certain anti-inflammatory properties, can also promote an allergy-related type of inflammation in the lung and gut, as well as other parts of the bod…", "url": "https://www.aninews.in/news/lifestyle/food/dietary-fiber-promote-inflammation-in-gut-research20221106221129", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221106164036.jpg", "publishedAt": "2022-11-06T16:45:32Z", "content": "Washington [US], November 6 (ANI): Researchers have discovered that a dietary fiber known as inulin, which is used in health supplements and has some anti-inflammatory qualities, can also encourage a… [+5493 chars]"}, {"source": {"id": null, "name": "Hcplive.com"}, "author": "Connor Iapoce", "title": "Immediate Use of ECMO Did Not Improve Outcomes in Patients with Cardiogenic Shock - MD Magazine", "description": "Patients with early VA-ECMO use saw comparable outcomes to those who initially received conservative therapy for hemodynamic stabilization.", "url": "https://www.hcplive.com/view/immediate-use-ecmo-did-not-improve-outcomes-cardiogenic-shock", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/hcplive/7d310b8ee6f953f6b38a041a6803e9d3b83a4fa8-300x300.jpg?fit=crop&auto=format", "publishedAt": "2022-11-06T16:34:01Z", "content": "The immediate implementation of veno-arterial extracorporeal membrane oxygenation (VA-ECMO) in adults with rapidly deteriorating or severe cardiogenic shock was not associated with improved clinical … [+3934 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "Importance of a workout regime to check diabetes - Mathrubhumi English", "description": "Physical activity or a regular workout regime is a key element in managing type 2 diabetes. Until recently studies showing the significance of exercise to manage diabetes were very less. However, now we can see that there is plenty of research highlighting th…", "url": "https://english.mathrubhumi.com/features/health/workout-regime-to-check-diabetes-1.8023515", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.8023536:1667751564/jogging.jpg?$p=0b2ed40&f=16x9&w=1080&q=0.8", "publishedAt": "2022-11-06T16:20:29Z", "content": "Physical activity or a regular workout regime is a key element in managing type 2 diabetes. Until recently studies showing the significance of exercise to manage diabetes were very less. However, now… [+5785 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Monkeypox mostly spreads before symptoms appear, study suggests - Medical Xpress", "description": "People with monkeypox can spread the virus up to four days before symptoms appear, with more than half of transmissions potentially taking place during this period, a UK study estimated Tuesday.", "url": "https://medicalxpress.com/news/2022-11-monkeypox-symptoms.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/monkeypox-4.jpg", "publishedAt": "2022-11-06T15:50:01Z", "content": "People with monkeypox can spread the virus up to four days before symptoms appear, with more than half of transmissions potentially taking place during this period, a UK study estimated Tuesday.\r\nWhi… [+2810 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Team Health Shots", "title": "Asthma can affect even your sex life! Know how to reduce your triggers - Health shots", "description": "With rising pollution levels comes a spike in asthma cases, and this could even hamper your sex life. Know the causes and what you can do to avoid it.", "url": "https://www.healthshots.com/intimate-health/sexual-health/asthma-can-affect-even-your-sex-life-know-how-to-reduce-your-triggers/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/06205310/inhaler.jpg", "publishedAt": "2022-11-06T15:29:32Z", "content": "Worsening air quality due to pollution levels can make something as basic as breathing a struggle for those with asthma. Breathing problems can affect a person’s quality of life in a huge way. But di… [+2396 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals genetic predisposition for Lupus may protect against COVID-19 infection - ANI News", "description": "Researchers suggested that genetic predisposition for systemic lupus erythematosus (SLE) may be protective against severe COVID-19 infection.", "url": "https://www.aninews.in/news/science/study-reveals-genetic-predisposition-for-lupus-may-protect-against-covid-19-infection20221106204110", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221106150430.jpg", "publishedAt": "2022-11-06T15:11:00Z", "content": "London [UK], November 6 (ANI): Some genetic variations may give protection against the effects of viral infection while increasing the likelihood of developing autoimmune disorders.A study published … [+2109 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Private interests in endorsing fluoride-supplemented high-carbohydrate nutritional guidelines - News-Medical.Net", "description": "Prominent organizations including the World Health Organization and U.S. Department of Agriculture (USDA) have dismissed low-carbohydrate diets that prevent tooth decay in favor of recommending high-carbohydrate diets which rely on fluoride and food fortifica…", "url": "https://www.news-medical.net/news/20221106/Private-interests-in-endorsing-fluoride-supplemented-high-carbohydrate-nutritional-guidelines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Carbohydrate-620x480.jpg", "publishedAt": "2022-11-06T14:49:00Z", "content": "Prominent organizations including the World Health Organization and U.S. Department of Agriculture (USDA) have dismissed low-carbohydrate diets that prevent tooth decay in favor of recommending high-… [+3185 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Aditi Yadav", "title": "Vitamin D3 and Omega-3 supplementation fails to improve cardiac function: VITAL trial - Medical Dialogues", "description": "United states: A study published in the Journal of the American Heart Association, JAHA, has concluded that in adults aged ≥50 years, there is no significant effect of vitamin D3 and Omega-3 fatty...", "url": "https://medicaldialogues.in/diet-nutrition/news/vitamin-d3-and-omega-3-supplementation-fails-to-improve-cardiac-function-vital-trial-101714", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/02/189782-untitled-design-74.jpg", "publishedAt": "2022-11-06T14:30:54Z", "content": "United states: A study published in the Journal of the American Heart Association, JAHA, has concluded that in adults aged 50 years, there is no significant effect of vitamin D3 and Omega-3 fatty aci… [+4050 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Low dosage of corticosteroid may improve prognosis of idiopathic pulmonary fibrosis: BMC - Medical Dialogues", "description": "A new study conducted by Keisuke Anan and team showed that in individuals with acute exacerbation of idiopathic pulmonary fibrosis (AE-IPF), early corticosteroid dosage lowering was linked to a...", "url": "https://medicaldialogues.in/pulmonology/news/low-dosage-of-corticosteroid-may-improve-prognosis-of-idiopathic-pulmonary-fibrosis-bmc-101717", "urlToImage": "https://medicaldialogues.in/h-upload/2020/07/10/131519-steroids.jpg", "publishedAt": "2022-11-06T14:30:46Z", "content": "A new study conducted by Keisuke Anan and team showed that in individuals with acute exacerbation of idiopathic pulmonary fibrosis (AE-IPF), early corticosteroid dosage lowering was linked to a good … [+2353 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "AI Improves accuracy of SPECT imaging for CAD - Medical Dialogues", "description": "Several recent discoveries show that the accuracy of diagnosing coronary artery disease and predicting patient risk is improved with the help of artificial intelligence (AI) models developed by...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/ai-improves-accuracy-of-spect-imaging-for-cad-101832", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/28/189142-untitled-design-73.jpg", "publishedAt": "2022-11-06T14:30:38Z", "content": "Several recent discoveries show that the accuracy of diagnosing coronary artery disease and predicting patient risk is improved with the help of artificial intelligence (AI) models developed by scien… [+7072 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Low weight gain in women with gestational diabetes linked with better postpartum metabolic profile - Medical Dialogues", "description": "Belgium: In women with gestational diabetes mellitus (GDM) and excessive gestational weight gain, the researchers observed higher rates of neonatal hypoglycemia, macrosomia, and instrumental...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/low-weight-gain-in-women-with-gestational-diabetes-linked-with-better-postpartum-metabolic-profile-101084", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/20/188572-gestational-diabetes.jpg", "publishedAt": "2022-11-06T14:30:30Z", "content": "Belgium: In women with gestational diabetes mellitus (GDM) and excessive gestational weight gain, the researchers observed higher rates of neonatal hypoglycemia, macrosomia, and instrumental delivery… [+2732 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Jacinthlyn Sylvia", "title": "Hyperbaric oxygen therapy improves symptoms and QOL in kids with persistent post-concussion syndrome - Medical Dialogues", "description": "A new study conducted by Amir Hadanny and team shows that even years after injury, hyperbaric oxygen therapy (HBOT) improves quality of life, symptoms, cognitive performance, and behavioral...", "url": "https://medicaldialogues.in/neurology-neurosurgery/news/hyperbaric-oxygen-therapy-improves-symptoms-and-qol-in-kids-with-persistent-post-concussion-syndrome-101314", "urlToImage": "https://medicaldialogues.in/h-upload/2021/04/28/151708-oxygen-cylinder.jpg", "publishedAt": "2022-11-06T14:30:27Z", "content": "A new study conducted by Amir Hadanny and team shows that even years after injury, hyperbaric oxygen therapy (HBOT) improves quality of life, symptoms, cognitive performance, and behavioral function … [+2348 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Pretreatment with heparin reduces risk of coronary artery occlusion and mortality in patients with STEMI - Medical Dialogues", "description": "Sweden: Pretreatment with heparin reduces the risk of coronary artery occlusion in ST-segment elevation myocardial infarction (STEMI) patients without increasing the risk of significant bleeding,...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/pretreatment-with-heparin-reduces-risk-of-coronary-artery-occlusion-and-mortality-in-patients-with-stemi-101718", "urlToImage": "https://medicaldialogues.in/h-upload/2022/10/31/189367-heparin.jpg", "publishedAt": "2022-11-06T14:30:20Z", "content": "Sweden: Pretreatment with heparin reduces the risk of coronary artery occlusion in ST-segment elevation myocardial infarction (STEMI) patients without increasing the risk of significant bleeding, acc… [+2406 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr Ishan Kataria", "title": "Ocular manifestation of Monkeypox infection: JAMA Ophthalmology - Medical Dialogues", "description": "A 27-year-old White man presented with a recent onset of  malaise, chills, night sweats, and sore throat with difficulty swallowing. He  also reported redness of his right eye with watery...", "url": "https://medicaldialogues.in/ophthalmology/cases/ocular-manifestation-of-monkeypox-infection-jama-ophthalmology-101719", "urlToImage": "https://medicaldialogues.in/h-upload/2022/09/10/185311-monkeypox.jpg", "publishedAt": "2022-11-06T14:30:19Z", "content": "A 27-year-old White man presented with a recent onset of malaise, chills, night sweats, and sore throat with difficulty swallowing. He also reported redness of his right eye with watery discharge. He… [+3948 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Researchers find ways immunotherapy affects COVID-19 outcomes - ThePrint", "description": "Cincinnati [US], November 6 (ANI): Researchers in a recent study provided more information on the connection between COVID-19 severity and immunotherapy for cancer patients. The research was led by a University of Cincinnati researcher and Trisha Wise-Draper,…", "url": "https://theprint.in/health/researchers-find-ways-immunotherapy-affects-covid-19-outcomes/1201227/", "urlToImage": null, "publishedAt": "2022-11-06T14:13:25Z", "content": "Cincinnati [US], November 6 (ANI): Researchers in a recent study provided more information on the connection between COVID-19 severity and immunotherapy for cancer patients.\r\nThe research was led by … [+2639 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Shravani Dali", "title": "Surgical removal and reduction of mechanical stimulation may prevent recurrent epulis - Medical Dialogues", "description": "Fibrous epulis is a common tumor-like lesion of the gingiva, appearing in interdental papilla as a result of local irritation.The association between clinicopathologic characteristics and the...", "url": "https://medicaldialogues.in/dentistry/news/surgical-removal-and-reduction-of-mechanical-stimulation-may-prevent-recurrent-epulis-101853", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/04/189917-download-53.jpg", "publishedAt": "2022-11-06T14:00:30Z", "content": "Fibrous epulis is a common tumor-like lesion of the gingiva, appearing in interdental papilla as a result of local irritation.The association between clinicopathologic characteristics and the relapse… [+2047 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Pioglitazone reverses hair loss in patient with cicatricial alopecia: Case report - Medical Dialogues", "description": "USA: In a recent case study published in JAAD Case Reports, the researchers from the USA have described an exceptional case of hair regrowth with oral pioglitazone, topical minoxidil foam, topical...", "url": "https://medicaldialogues.in/dermatology/news/pioglitazone-reverses-hair-loss-in-patient-with-cicatricial-alopecia-case-report-101783", "urlToImage": "https://medicaldialogues.in/h-upload/2022/11/04/189912-cicatricial-alopecia.jpg", "publishedAt": "2022-11-06T14:00:19Z", "content": "USA: In a recent case study published in JAAD Case Reports, the researchers from the USA have described an exceptional case of hair regrowth with oral pioglitazone, topical minoxidil foam, topical cl… [+2966 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "High blood sugar levels may worsen course and prognosis of COPD regardless of diabetes status - Medical Dialogues", "description": "CHINA: Chronic obstructive pulmonary disease (COPD) characterized by progressive partially reversible airflow obstruction and airways inflammation is leading cause of mortality globally. Further...", "url": "https://medicaldialogues.in/medicine/news/high-blood-sugar-levels-may-worsen-course-and-prognosis-of-copd-regardless-of-diabetes-status-101846", "urlToImage": "https://medicaldialogues.in/h-upload/2020/03/03/125125-copd.jpg", "publishedAt": "2022-11-06T13:45:11Z", "content": "CHINA: Chronic obstructive pulmonary disease (COPD) characterized by progressive partially reversible airflow obstruction and airways inflammation is leading cause of mortality globally. Further acut… [+3936 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Arathy Radhakrishnan", "title": "Myths about migraine: Here's what you need to know! | DH Latest News, DH NEWS, Diseases & Remedies, Health & Fitness, Latest News, NEWS, Life Style, Health , Migraine, symptom, therapies, headache, Brain activity - East Coast Daily (English)", "description": "Headache is a relatively common symptom, and headache disorders are among the most prevalent nervous system illnesses, with a general population frequency of 48.9%. The majority of people therefore li", "url": "https://www.eastcoastdaily.in/2022/11/06/myths-about-migraine-heres-what-you-need-to-know.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/11/images-9.jpg", "publishedAt": "2022-11-06T13:23:00Z", "content": "Headache is a relatively common symptom, and headache disorders are among the most prevalent nervous system illnesses, with a general population frequency of 48.9%. The majority of people therefore l… [+3299 chars]"}, {"source": {"id": null, "name": "Mja.com.au"}, "author": null, "title": "Endometriosis and gut disorders: a missing genetic link? - MJA Insight", "description": "Although it’s early days, it’s hoped that this genetic discovery could help with earlier diagnosis of endometriosis in the future", "url": "https://insightplus.mja.com.au/2022/43/endometriosis-and-gut-disorders-a-missing-genetic-link/", "urlToImage": "https://insightplus.mja.com.au/wp-content/uploads/2022/11/endometriosis-2022.jpg", "publishedAt": "2022-11-06T13:22:55Z", "content": "IN clinical practice, endometriosis and gastrointestinal disorders such as irritable bowel syndrome commonly coexist. Recent studies have confirmed that women with endometriosis have a higher risk of… [+5989 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Cancer cells exposed to high viscosity move better: Study - ThePrint", "description": "Washington [US], November 6 (ANI): In order to increase their invasiveness and encourage metastases, cancer cells that are exposed to high-viscosity environments modify the way they travel. The studies offered fresh areas to focus on when creating potential c…", "url": "https://theprint.in/science/cancer-cells-exposed-to-high-viscosity-move-better-study/1201150/", "urlToImage": null, "publishedAt": "2022-11-06T13:13:38Z", "content": "Washington [US], November 6 (ANI): In order to increase their invasiveness and encourage metastases, cancer cells that are exposed to high-viscosity environments modify the way they travel. The studi… [+3065 chars]"}, {"source": {"id": null, "name": "Herzindagi.com"}, "author": "Lakshita Singh", "title": "Oral Sex Can Increase Risk Of Cancer; Here's How To Prevent It - HerZindagi English", "description": "In addition to smoking and alcohol, oral sex may also increase the risk of throat cancer.", "url": "https://www.herzindagi.com/health/oral-sex-can-cause-cancer-how-to-prevent-it-article-213045", "urlToImage": "https://images.herzindagi.info/image/2022/Nov/oral-sex-cancer-cases-hpv.jpg", "publishedAt": "2022-11-06T11:43:28Z", "content": "A commonly performed act of foreplay, oral sex is linked to an increased risk of contracting oral HPV (Human Papilloma Virus), which can result in throat cancer. \r\nAfter contracting HPV infection, it… [+2444 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Effect of Statin Therapy on Mortality and Recurrence of Intracerebral Hemorrhage in Patients With Spontaneous Intracerebral Hemorrhage - Cureus", "description": "Statins can play an essential role in the tertiary and primary prevention of cardiovascular events by reduction of cholesterol in a stroke patient. This meta-analysis aims to assess statin therapy's effect on mortality and recurrence of Intracranial Hemorrhag…", "url": "https://www.cureus.com/articles/123852-effect-of-statin-therapy-on-mortality-and-recurrence-of-intracerebral-hemorrhage-in-patients-with-spontaneous-intracerebral-hemorrhage", "urlToImage": "https://assets.cureus.com/uploads/figure/file/486650/article_river_c2bc2df056c211edaced99f02e393731-Figure-4-3-.png", "publishedAt": "2022-11-06T11:22:28Z", "content": "Intracerebral hemorrhage (ICH) is the second most common cause of stroke, followed by an ischemic stroke. Nearly 15% of all acute strokes are caused by ICH, which has a high case fatality rate [1]. T… [+14882 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Rachel Hosie", "title": "I intermittent fast and want to build lean muscle. A dietitian said to eat a high-protein diet and a wider var - Business Insider India", "description": "A 30-year-old man submitted an average day of eating to be reviewed for Insider's Nutrition Clinic.He told Insider he does intermittent fasting and wants to", "url": "https://www.businessinsider.in/science/health/news/i-intermittent-fast-and-want-to-build-lean-muscle-a-dietitian-said-to-eat-a-high-protein-diet-and-a-wider-variety-of-foods-/articleshow/95338330.cms", "urlToImage": "https://www.businessinsider.in/photo/95338330/i-intermittent-fast-and-want-to-build-lean-muscle-a-dietitian-said-to-eat-a-high-protein-diet-and-a-wider-variety-of-foods-.jpg?imgsize=1739078", "publishedAt": "2022-11-06T11:00:00Z", "content": "Austin, 30, submitted his eating routine to Insider's Nutrition Clinic, where qualified dietitians and nutritionists offer advice on readers' eating habits.\r\nHe told Insider he wants to \"get shredded… [+3701 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Cirrhosis of the Liver: A Case Report and Literature Review of a Rare Case Presentation of Autoimmune Hepatitis With Systemic Sclerosis - Cureus", "description": "Systemic sclerosis (SSc) is a chronic systemic disease that affects the skin, heart, lungs, kidneys, gastrointestinal tract, and musculoskeletal system. Although gastrointestinal involvement has been reported in approximately 90% of scleroderma patients, live…", "url": "https://www.cureus.com/articles/115974-cirrhosis-of-the-liver-a-case-report-and-literature-review-of-a-rare-case-presentation-of-autoimmune-hepatitis-with-systemic-sclerosis", "urlToImage": "https://assets.cureus.com/uploads/figure/file/472801/article_river_bf0c6dc04fae11ed877a35287562aef7-Figure-1.png", "publishedAt": "2022-11-06T10:29:05Z", "content": "Systemic sclerosis (SSc) is a rare chronic disorder of unknown etiology, characterized by diffuse fibrosis and generalized vascular abnormalities in the skin, joints, and internal organs, leading to … [+13822 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Akanksha Agnihotri", "title": "5 ways that chronic stress leads to weight gain - Hindustan Times", "description": "Stress can be one of the reasons for your recent weight gain. Check out five ways that chronic stress leads to an increase in weight.  | Health", "url": "https://www.hindustantimes.com/lifestyle/health/5-ways-that-chronic-stress-leads-to-weight-gain-101667727203724.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/06/1600x900/gettyimages-155098423-612x612_1667728603826_1667728612207_1667728612207.jpg", "publishedAt": "2022-11-06T10:05:51Z", "content": "Consuming more calories is not the only factor that contributes to the obesity epidemic. Stress could be one of the culprits. Long-term \"chronic\" stress actually increases your appetite, despite the … [+1962 chars]"}, {"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "Epilepsy: symptoms, diagnosis, treatment and prognosis - Emergency Live International", "description": "Epilepsy is a neurological disorder that can affect people of all ages. The distinguishing feature of this disease is the recurrence of...", "url": "https://www.emergency-live.com/health-and-safety/epilepsy-symptoms-diagnosis-treatment-and-prognosis/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2022/11/EPILESSIA_attacco-epilettico-1.jpg", "publishedAt": "2022-11-06T08:42:59Z", "content": "Information passes from the brain to the nerves via neurons (nerve cells) and constitutes brain activity; this is an electrochemical process that can be followed by means of an electroencephalograph,… [+11651 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Growing motor neurons guided by 'love-hate relationship' with blood vessels - Hindustan Times", "description": "Motor neuron connections are formed during fetal development. This process of wiring the nervous system is exquisitely precise, with cells making trillions of connections that reach throughout the body. And yet the genetic process that directs this developmen…", "url": "https://www.hindustantimes.com/lifestyle/health/growing-motor-neurons-guided-by-love-hate-relationship-with-blood-vessels-research-101667723079765.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/06/1600x900/_4ed80454-3353-11e9-a008-8caaddb25592_1667723140607_1667723140607.jpg", "publishedAt": "2022-11-06T08:27:58Z", "content": "A new collaborative study shows how blood vessel genes play a critical role in motor neuron development by telling blood vessels to get out of the way. The discovery has implications for understandin… [+3924 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pregnancy associated with breast cancer can be aggressive: Key concerns - ETHealthWorld", "description": "As more women are delaying their childbearing age, the incidence of PABC is on the rise. There is a need to create awareness among women about breast examina...", "url": "https://www.youtube.com/watch?v=c9wG13_b3Kc", "urlToImage": "https://i.ytimg.com/vi/c9wG13_b3Kc/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4Af4EgAKABYoCDAgAEAEYZSBlKGUwDw==&rs=AOn4CLCzUKcp-7SloPKB9SlnMECebtaC0Q", "publishedAt": "2022-11-06T08:19:27Z", "content": null}, {"source": {"id": null, "name": "THE WEEK"}, "author": "Pooja Biraia Jaiswal", "title": "THE WEEK seminar: Experts agree on need to be vigilant against breast cancer - The Week", "description": "Breast cancer is highly preventable and highly curative", "url": "https://www.theweek.in/theweek/specials/2022/11/04/the-week-seminar-experts-agree-on-need-to-be-vigilant-against-breast-cancer.html", "urlToImage": "https://www.theweek.in/content/dam/week/magazine/theweek/specials/images/2022/11/4/58-A-panel-discussion-on-breast-cancer-held-by-THE-WEEK.jpg", "publishedAt": "2022-11-06T07:40:00Z", "content": "Breast cancer has surpassed cervical cancer as the most prevalent cancer in India. As a woman gets older, there is a higher chance of her getting breast cancer. A mammogram is recommended once in a f… [+1952 chars]"}, {"source": {"id": null, "name": "Northeast Now"}, "author": "NE NOW NEWS", "title": "How stress affects sex drive: 7 daily activities to improve your sexual life - Northeast Now", "description": "New Delhi:  Stress can affect the sexual performance and sperm health of a man, leading to infertility, said a latest study. According to the study, men who reported higher stress levels were more likely to have lower sperm counts and less sperm motility. It …", "url": "http://nenow.in/lifestyle/how-stress-affects-sex-drive-7-daily-activities-to-improve-your-sexual-life.html", "urlToImage": "https://nenow.in/wp-content/uploads/2022/11/Sex-drive.jpeg", "publishedAt": "2022-11-06T07:19:20Z", "content": "New Delhi:  Stress can affect the sexual performance and sperm health of a man, leading to infertility, said a latest study. According to the study, men who reported higher stress levels were more li… [+2220 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Women's Health: What is Preterm Labour? Know its signs, symptoms and risk factors - DNA India", "description": "Preterm Labour: The earlier premature birth happens, the greater the health risks for your baby.", "url": "https://www.dnaindia.com/health/report-women-s-health-what-is-preterm-labour-know-its-signs-symptoms-risk-factors-2999725", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/11/06/2551925-pregnancy.jpg", "publishedAt": "2022-11-06T07:05:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Nov 06, 2022, 12:54 PM ISTPreterm labour happens after week 20 and before week 37 of pregnancy when regular contractions cause you… [+1854 chars]"}, {"source": {"id": null, "name": "Healthdigest.com"}, "author": "Sabika Hassan", "title": "How To Ease Sciatic Nerve Pain At Home - Health Digest", "description": "Sciatica is a condition that causes severe inflammation or aches due to pressure on the sciatic nerve. These are some of the remedies you can try at home.", "url": "https://www.healthdigest.com/1082187/how-to-ease-sciatic-nerve-pain-at-home/", "urlToImage": "https://www.healthdigest.com/img/gallery/how-to-ease-sciatic-nerve-pain-at-home/l-intro-1667397983.jpg", "publishedAt": "2022-11-06T07:00:00Z", "content": "Sciatic nerve pain, also known as sciatica, is a condition that causes severe inflammation or aches due to pressure on the sciatic nerve, as per Mayo Clinic. This nerve extends from the lower back to… [+990 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Mutations have made monkeypox 'smarter': Indian-origin scientists - ETHealthWorld", "description": "The findings of the study, published in the Journal of Autoimmunity, can help in modifying the existing drugs used to treat monkeypox or developing new medicines that can counter the mutations thus reducing symptoms of the disease and curbing the spread of th…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/mutations-have-made-monkeypox-smarter-indian-origin-scientists/95331918", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95331918,imgsize-328126,width-1200,height-628,overlay-ethealthworld/mutations-have-made-monkeypox-smarter-indian-origin-scientists.jpg", "publishedAt": "2022-11-06T06:30:00Z", "content": "New York: Monkeypoxmutations have enabled the virus to grow stronger and smarter, evading antiviral drugs and vaccines in its mission to infect more people, a team of Indian-American scientists have … [+2650 chars]"}, {"source": {"id": null, "name": "Evertise.net"}, "author": null, "title": "Amarose Skin Tag Remover Where To Buy? Price Legit or Scam - Big News Network", "description": "Amarose Skin Tag Remover Where To Buy Price Legit or Scam", "url": "https://evertise.net/amarose-skin-tag-remover-where-to-buy-price-legit-or-scam/", "urlToImage": "", "publishedAt": "2022-11-06T06:24:00Z", "content": "Amarose Skin Tag Remover, also known as Amarose Mole Remover, has recently received a lot of attention and appreciation for its innovative solution, which is backed up by hundreds of customer reviews… [+12221 chars]"}, {"source": {"id": null, "name": "Mims.com"}, "author": "N/A", "title": "Donor hypertension worsens graft survival, function in kidney recipients | Latest news for Doctors, Nurses and Pharmacists | Cardiology - MIMS", "description": "Kidney transplant recipients from living donors with hypertension are at significantly increased risk of renal allograft loss compared to those from n...", "url": "https://specialty.mims.com/topic/donor-hypertension-worsens-graft-survival--function-in-kidney-recipients", "urlToImage": "https://pubmiddleware.mims.com/resource/image/7604C375-C253-40DE-876E-A5C900B225B7/OriginalThumbnail/THUMBNAIL_Fotolia_78207345.kidneytransplant.jpg", "publishedAt": "2022-11-06T04:00:04Z", "content": "Kidney transplant recipients from living donors with \r\nhypertension are at significantly increased risk of renal allograft loss compared to those from normotensive living donors, reveals a study. Mor… [+1462 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Simran Arora", "title": "Are you a heart patient? Study names the foods that can help you live longer - Times Now", "description": "An analysis published in the Journal of the American College of Cardiology involving 905 people with an average age of 67 years evaluated heart patients with cardiovascular conditions stemming from various causes. The study noted that the levels of omega-3 fa…", "url": "https://www.timesnownews.com/health/are-you-a-heart-patient-study-names-the-foods-that-can-help-you-live-longer-article-95328879", "urlToImage": "https://static.tnn.in/thumb/msid-95328879,imgsize-100,width-1280,height-720,resizemode-75/95328879.jpg", "publishedAt": "2022-11-06T02:41:55Z", "content": "Some of the best ways of increasing the intake of omega-3s are by adding seeds to salads, oatmeal, and smoothies or by snacking on nuts."}, {"source": {"id": null, "name": "DAWN.com"}, "author": null, "title": "NIH issues flu advisory - Newspaper - DAWN.COM - DAWN.com", "description": "Checkout for the Latest and Top News from Pakistan and around the world", "url": "https://www.dawn.com/", "urlToImage": "http://www.dawn.com/_img/social-default.jpg", "publishedAt": "2022-11-06T02:07:38Z", "content": "Imran's nephew says party submitted application at police station but personnel didn't provide them with any receipt for the same.\r\nUpdated06 Nov, 202209:40am\r\nThe winner of the Super 12 contest in A… [+1406 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Sriram Natarajan", "title": "How to leap away from leptospirosis - Deccan Herald", "description": "Leptospirosis is a significant public health problem in India and outbreaks of leptospirosis are increasingly being reported in states such as Kerala, Gujarat, Tamil Nadu, Maharashtra and Karnataka and the union territory of Andaman and the Nicobar Islands, e…", "url": "https://www.deccanherald.com/sunday-herald/sunday-herald-melange/how-to-leap-away-from-leptospirosis-1158985.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/11/06/file7ndft9getklwvslcjq2-1158985-1667676601.jpg", "publishedAt": "2022-11-05T19:21:32Z", "content": "Leptospirosis is a significant public health problem in India and outbreaks of leptospirosis are increasingly being reported in states such as Kerala, Gujarat, Tamil Nadu, Maharashtra and Karnataka a… [+3364 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Pregnancy After Cardiac Surgery - Cureus", "description": "Women with native heart valve disease who are considering getting pregnant should have a complete risk estimation to determine whether an intervention is required prior to becoming pregnant and, if so, to determine when it should be performed and what kind of…", "url": "https://www.cureus.com/articles/120981-pregnancy-after-cardiac-surgery", "urlToImage": "https://assets.cureus.com/uploads/figure/file/488654/article_river_82648090586111ed9dfe07c4ed91cb36-nidhi-prisma-final.png", "publishedAt": "2022-11-05T18:19:18Z", "content": "Heart disease affects pregnant women between 1% and 4% of the time. Heart disease is the main factor in indirect obstetric fatalities, complicating more than 1% of pregnancies and contributing to 15%… [+31137 chars]"}, {"source": {"id": null, "name": "Times of San Diego"}, "author": "Debbie L. Sklar", "title": "San Diego COVID-19 Hospitalizations Fall to 129 Patients - Times of San Diego", "description": "The number of people in San Diego County hospitalized with COVID-19 has decreased by five to 129, according to the latest state data released Saturday.", "url": "http://timesofsandiego.com/health/2022/11/05/san-diego-covid-19-hospitalizations-fall-to-129-patients/", "urlToImage": "https://timesofsandiego.com/wp-content/uploads/2020/05/Coronavirus-patient--scaled-e1590617830538.jpg", "publishedAt": "2022-11-05T17:40:43Z", "content": "A medical staff member treats a patient suffering from the coronavirus disease COVID-19 in the Intensive Care Unit at Scripps Mercy Hospital in Chula Vista. REUTERS/Lucy Nicholson\r\nThe number of peop… [+5124 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Gold Coast Keto Gummies Australia Is it Scam EXPOSED Price Ingredients & Side Effects! - The Tribune India", "description": "Coast Keto Gummies are tasty and lucrative gummies that may help with unnecessary fat storage in the body as well as obesity symptoms.&nbsp; These Keto Gummies promote healthy weight loss without compromising your fitness. These highly effective fat burners a…", "url": "https://www.tribuneindia.com/news/brand-connect/gold-coast-keto-gummies-australia-is-it-scam-exposed-price-ingredients-side-effects-448016", "urlToImage": "https://www.tribuneindia.com/content/images/Logo_eng.png", "publishedAt": "2022-11-05T16:52:00Z", "content": "Coast Keto Gummies are tasty and lucrative gummies that may help with unnecessary fat storage in the body as well as obesity symptoms.  These Keto Gummies promote healthy weight loss without compromi… [+6808 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers reveal how immune memory cells are stored in bone marrow - ANI News", "description": "Study found how immune memory cells are stored in the bone marrow at around one single cell per hour for several weeks after immunization.", "url": "https://www.aninews.in/news/health/researchers-reveal-how-immune-memory-cells-are-stored-in-bone-marrow20221105194725", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221105141706.jpg", "publishedAt": "2022-11-05T14:17:00Z", "content": "Melbourne [Australia], November 5 (ANI): Researchers revealed the way vaccines work and how they produce immune cells that have a long lifespan--often for decades. These immune cells offer both a pro… [+4180 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "What to eat and avoid while battling dengue fever - Firstpost", "description": "To anyone who is recovering from dengue, any kind of spicy food is a big no.", "url": "https://www.firstpost.com/living/from-papaya-to-pomegranates-what-to-eat-and-avoid-while-battling-dengue-fever-11577971.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/11/Dengue.jpg", "publishedAt": "2022-11-05T13:35:27Z", "content": "Dengue fever cases are on the upsurge in the country, therefore it’s critical to strengthen your immune system properly to avoid getting the disease. The bite of an infected mosquito, primarily an Ae… [+2782 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Scientists find out how organic compound affects drug-resistant bacteria - ANI News", "description": "Scientists suggested how an organic molecule affects bacteria that are resistant to drugs and have found that it can suppress and destroy a pathogen that can cause significant disease or, in some circumstances, death.", "url": "https://www.aninews.in/news/health/scientists-find-out-how-organic-compound-affects-drug-resistant-bacteria20221105185555", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20221105132520.jpg", "publishedAt": "2022-11-05T13:25:00Z", "content": "Portsmouth [England], November 5 (ANI): Researchers have found out how an organic chemical impacts bacteria that are drug-resistant and discovered that it can inhibit and kill a pathogen that can res… [+2973 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "Chikungunya: PGI Chandigarh records 287 cases till now, 230 cases in October alone - News9 LIVE", "description": "Areas like Khuda Lahora, Dhanas, Nayagaon, Khuda Ali Sher, Burail, Mohali, have reported the largest number of chikungunya cases in the city", "url": "https://www.news9live.com/health/health-conditions/chikungunya-pgimer-chandigarh-records-287-cases-till-now-230-cases-in-october-alone-206172", "urlToImage": "https://media.news9live.com/h-upload/2022/11/05/578276-unsplash.jpg", "publishedAt": "2022-11-05T13:10:32Z", "content": "The Postgraduate Institute of Medical Education and Research (PGIMER), Chandigarh tested 287 positive cases of chikungunya this year, with 230 cases found in October alone, reported the Indian Expres… [+2161 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Satyam Shaw", "title": "New Study Shows Two Monoclonal Antibodies Neutralising The Majority Of SARS-CoV-2 Variants And Omicron Subvariants. - Asiana Times", "description": "Researchers have recently developed and characterised two monoclonal antibodies (NA8 and NE12) that have neutralising efficacy against the main SARS-CoV-2 variants of concern and target the receptor-binding region of the severe acute syndrome coronavirus type…", "url": "https://asianatimes.com/new-study-shows-two-monoclonal-antibodies-neutralising-the-majority-of-sars-cov-2-variants-and-omicron-subvariants/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/11/ImageForNews_702719_16432179802561048.webp", "publishedAt": "2022-11-05T10:57:04Z", "content": "Researchers have recently developed and characterised two monoclonal antibodies (NA8 and NE12) that have neutralising efficacy against the main SARS-CoV-2 variants of concern and target the receptor-… [+6414 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Erin Prater", "title": "Scientists made mini brains and infected them with coronavirus. What they saw could explain Long COVID - Fortune", "description": "An “excessive number” of synapses were eliminated during the course of the disease, “more than you would expect to see in a normal brain,” the authors wrote.", "url": "https://fortune.com/well/2022/11/05/mini-brain-organoids-covid-infection-neurologic-symptoms-synapses-long-covid-pruning-stroke-depression-anxiety-memory-migraines-parkinsons-alzheimers-tremor-headache-confusion-brain-fog-mood-disorder/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2022/11/GettyImages-1207111660.jpg?resize=1200,600", "publishedAt": "2022-11-05T09:30:00Z", "content": "In a new study published in Molecular Psychiatry, researchers from Sweden and a Harvard-affiliated hospital in Boston tried to find out by creating brain organoids, or miniature brains about the size… [+3114 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Arushi Bidhuri", "title": "High levels of uric acid can be dangerous: 5 Tips to control it - Health shots", "description": "High levels of uric acid can lead to gout, which can be painful and dangerous. Here are 5 tips to keep your uric acid levels in check.", "url": "https://www.healthshots.com/how-to/high-levels-of-uric-acid-can-be-dangerous-5-tips-to-control-it/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2022/11/04184313/uric-acid.jpg", "publishedAt": "2022-11-05T08:00:27Z", "content": "It goes without saying that eating the right goods can make or break your health! It is necessary to include the right kinds of food in your diet to keep health problems at bay. This also stands true… [+3211 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Lucy Gornall", "title": "Why does my back hurt? The 6 everyday postures causing you pain and how to fix it... - The US Sun", "description": "SUFFERING from back pain? You’re certainly not alone getting those painful twinges.  Research commissioned by Mind Your Back, a national campaign to help manage and prevent back pain, has reve…", "url": "https://www.the-sun.com/health/6606576/everyday-postures-causing-back-pain/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/11/shot-young-businessman-suffering-back-483709623-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-11-05T08:00:00Z", "content": "SUFFERING from back pain? Youre certainly not alone getting those painful twinges. \r\nResearch commissioned by Mind Your Back, a national campaign to help manage and prevent back pain, has revealed th… [+4567 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Canada confirms 1,444 monkeypox cases - ETHealthWorld", "description": "Second doses of the monkeypox vaccine are rolling out in the country. The National Advisory Committee on Immunization recommended monkeypox vaccine to be used as a preventative, two-dose vaccine for those at risk of exposure, with the second dose, only for pe…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/canada-confirms-1444-monkeypox-cases/95317499", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-95317499,imgsize-602627,width-1200,height-628,overlay-ethealthworld/canada-confirms-1-444-monkeypox-cases.jpg", "publishedAt": "2022-11-05T07:55:00Z", "content": "Ottawa: Canada has confirmed 1,444 cases of monkeypox, including 42 hospitalisations, the Public Health Agency of Canada has said.Of the confirmed cases, 688 are from Ontario, 525 from Quebec, 179 fr… [+839 chars]"}, {"source": {"id": null, "name": "Mathrubhumi.com"}, "author": "Mathrubhumi", "title": "US records 730 deaths from flu this season - Mathrubhumi English", "description": "Los Angeles: There have been at least 1.6 million illnesses, 13,000 hospitalisations, and 730 deaths from flu so far this season in the US, according to the latest estimates from the US Centers for Disease Control and Prevention (CDC).Flu activity continues t…", "url": "https://english.mathrubhumi.com/features/health/flu-deaths-increase-in-us-1.8020028", "urlToImage": "https://english.mathrubhumi.com/image/contentid/policy:1.4581906:1667633373/image.png?$p=aeb1590&f=16x9&w=1080&q=0.8", "publishedAt": "2022-11-05T07:31:18Z", "content": "Los Angeles: There have been at least 1.6 million illnesses, 13,000 hospitalisations, and 730 deaths from flu so far this season in the US, according to the latest estimates from the US Centers for D… [+549 chars]"}, {"source": {"id": null, "name": "Newsclick.in"}, "author": null, "title": "More Equitable Sharing of COVID-19 Vaccines Would Have Saved a Million Lives: Study - NewsClick", "description": "It had been widely assumed that the disparity in vaccine distribution led to a loss of lives during the pandemic. But the new research has come out with an estimate of the global loss, which could be helpful in planning for future pandemics.", "url": "https://www.newsclick.in/More-Equitable-Sharing-COVID-19-Vaccines-Would-Have-Saved-Million-Lives-Study", "urlToImage": "https://www.newsclick.in/sites/default/files/2021-11/Vaccine%20covid%2019.png", "publishedAt": "2022-11-05T06:36:56Z", "content": "A million lives might have been saved if the distribution of COVID-19 vaccines would have been more equitable with lower-income countries in 2021, says a research paper published recently in Nature M… [+3415 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "We May Finally Know How Many Nerve Endings Are in The Human Clitoris - ScienceAlert", "description": "The human clitoris is a scientific iceberg, both physically and figuratively.", "url": "https://www.sciencealert.com/we-may-finally-know-how-many-nerve-endings-are-in-the-human-clitoris", "urlToImage": "https://www.sciencealert.com/images/2022/11/HumanHandHolding3DPrintedModelOfHumanClitoris.jpg", "publishedAt": "2022-11-05T05:00:44Z", "content": "The human clitoris is a scientific iceberg, both physically and figuratively.\r\nIn the past, research on our species' clitoris has been superficial at best, and even the tiny bit that we think we know… [+3333 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Ashwagandha Gummies (Exposed 2022) Best Ashwagandha Gummies Benefits Review Don't Buy Before Read - Deccan Herald", "description": "Ashwagandha Gummies Reviews: what to expect If you're looking to slim down and reduce your weight in a safe and healthy way, Ashwagandha Gummies are the perfect solution. Loaded with all-natural ingredients and super slimming effects, these gummies are perfec…", "url": "https://www.deccanherald.com/brandspot/pr-spot/ashwagandha-gummies-exposed-2022-best-ashwagandha-gummies-benefits-review-dont-buy-before-read-1159572.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/hfgh-1159572-1667623002.jpg", "publishedAt": "2022-11-05T04:36:42Z", "content": "Ashwagandha Gummies Reviews: what to expectIf you're looking to slim down and reduce your weight in a safe and healthy way, Ashwagandha Gummies are the perfect solution. Loaded with all-natural ingre… [+8784 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Experts across countries reach consensus on ending Covid as public health threat - EastMojo", "description": "London: Although some governments have moved on, specific efforts and resources are still required to save lives as SARS-CoV-2 continues to circulate", "url": "http://www.eastmojo.com/coronavirus-updates/2022/11/05/experts-across-countries-reach-consensus-on-ending-covid-as-public-health-threat/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/07/covid-4947212_1280.jpg?fit=1280%2C853&ssl=1", "publishedAt": "2022-11-05T03:10:00Z", "content": "London: Although some governments have moved on, specific efforts and resources are still required to save lives as SARS-CoV-2 continues to circulate among us, a new study has said.\r\nFocus on saving … [+4972 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Teens' Brains Develop Differently Depending on if They're Night Owls or Early Birds - ScienceAlert", "description": "It's 11 pm on a weeknight and your teenager still has their bedroom light on.", "url": "https://www.sciencealert.com/teens-brains-develop-differently-depending-on-if-theyre-night-owls-or-early-birds", "urlToImage": "https://www.sciencealert.com/images/2022/11/TeenStaresAtTabletWithBlanketPulledOverTheirHead.jpg", "publishedAt": "2022-11-05T02:06:22Z", "content": "It's 11 pm on a weeknight and your teenager still has their bedroom light on. You want them to get enough sleep for school the next day, but it's a struggle.\r\nOur new research shows what happens to t… [+4921 chars]"}, {"source": {"id": null, "name": "Braintumourresearch.org"}, "author": null, "title": "Neural Migration and Medical Devices - Brain Tumour Research", "description": "Read this week's research update from Brain Tumour Research including neural migration and medical devices.", "url": "https://www.braintumourresearch.org/media/news/news-item/2022/11/05/neural-migration-and-medical-devices", "urlToImage": null, "publishedAt": "2022-11-05T01:02:03Z", "content": "Research: \r\nThe Proteins That Help Brain Cancer Cells Migrate. During brain development, neurones have to migrate long distances through complex environments until they reach their final destination.… [+2510 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Helicobacter pylori eradication for primary prevention of peptic ulcer bleeding in older patients prescribed aspirin in primary care (HEAT): a randomised, double-blind, placebo-controlled trial - The Lancet", "description": "H pylori eradication protects against aspirin-associated peptic ulcer bleeding, but\nthis might not be sustained in the long term.", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01843-8/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/df4140fc-4fd9-405b-b2e5-395cea1d15a6/gr1.jpg", "publishedAt": "2022-11-03T23:35:40Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}]}