{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "Emergency-live.com"}, "author": "Cristiano Antonino", "title": "How to keep your kidneys healthy? - Emergency Live International", "description": "Kidney health: chronic kidney disease is a progressive reduction in the kidney's ability to eliminate waste and affects 10% of the population", "url": "https://www.emergency-live.com/health-and-safety/how-to-keep-your-kidneys-healthy/", "urlToImage": "https://www.emergency-live.com/wp-content/uploads/2022/02/dialisi-funzione-renale-1.jpg", "publishedAt": "2022-03-14T09:23:39Z", "content": "It is a “silent” disease and, in its early stages, does not present any specific symptoms indicating a malfunction of the kidneys\r\nIn order to be diagnosed, it therefore requires the full attention o… [+2213 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "High BMI in upper teens a risk for severe COVID-19: Study - ANI News", "description": "Gothenburg [Sweden], March 14 (ANI): A new study led by the University of Gothenburg has found that men with a high body mass index (BMI) in their upper teens have an elevated risk of severe COVID-19 and can require hospitalisation later in life.", "url": "https://www.aninews.in/news/health/high-bmi-in-upper-teens-a-risk-for-severe-covid-19-study20220314144854", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Capturffffe120220314091805-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-14T09:18:00Z", "content": "ANI | Updated: Mar 14, 2022 14:48 IST\r\nGothenburg [Sweden], March 14 (ANI): A new study led by the University of Gothenburg has found that men with a high body mass index (BMI) in their upper teens h… [+3398 chars]"}, {"source": {"id": null, "name": "The Star"}, "author": "Alastair Ulke", "title": "Rising Covid strain BA.2 - nicknamed 'stealth omicron - detected in third of sampled cases in Sheffield - The Star", "description": "The coronavirus pandemic is “not over”, health chiefs have warned amid concern about the highly contagious ‘Stealth Omicron’ strain.", "url": "https://www.thestar.co.uk/health/coronavirus/rising-covid-strain-ba2-detected-in-third-of-sampled-cases-in-sheffield-3609535", "urlToImage": "https://www.thestar.co.uk/webimg/b25lY21zOjUzZDMyZGIwLWIxZGMtNGY2ZS05NWY4LTM3MmIxMGM4NjA0Yzo0ZjA4ZmEzMS04MWVlLTQ4ZjQtYjIxNC0wZTg3NWZhMjgzNWM=.jpg?width=2048&enable=upscale", "publishedAt": "2022-03-14T08:50:00Z", "content": "The Omicron sub-variant, officially called BA.2, is now dominant across England, analysis shows.\r\nBA.2 accounted for 57 per cent of cases in England in the last week of February, up from a quarter ju… [+2033 chars]"}, {"source": {"id": null, "name": "Nature World News"}, "author": "Louise Franco", "title": "Scientists Reverse Aging and Extend Lifespan of Mice in a New Study - Nature World News", "description": "Cellular rejuvenation has stopped and reversed the biological aging of mice in the new research. The aging process or cellular degeneration seemed to have stopped on mice that became the subject of a successful new anti-aging study on cellular rejuvenation th…", "url": "https://www.natureworldnews.com/articles/49887/20220314/scientists-reverse-aging-process-extend-lifespan-mice-new-study.htm", "urlToImage": "https://1471793142.rsc.cdn77.org/data/images/full/58690/mouse.jpg", "publishedAt": "2022-03-14T08:33:22Z", "content": "The aging process or cellular degeneration seemed to have stopped on mice that became the subject of a successful new anti-aging study on cellular rejuvenation therapy. Scientists were able to partia… [+3196 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "AI companion tells stories to aid memory recollection, boost confidence in people with dementia - News-Medical.Net", "description": "Researchers at the National Robotarium, hosted by Heriot-Watt University and the University of Edinburgh, are developing an artificial intelligence (AI) companion that will aid memory recollection, boost confidence and combat depression in people living with …", "url": "https://www.news-medical.net/news/20220314/AI-companion-tells-stories-to-aid-memory-recollection-boost-confidence-in-people-with-dementia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2022/3/nani-chavez-EKHB_4kEYzw-unsplash.jpg", "publishedAt": "2022-03-14T06:40:00Z", "content": "Researchers at the National Robotarium, hosted by Heriot-Watt University and the University of Edinburgh, are developing an artificial intelligence (AI) companion that will aid memory recollection, b… [+4520 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How People Self-Diagnosed Themselves for COVID-19 During 3rd Wave - News18", "description": "Fortunately, the third wave of the pandemic was milder, and so were the symptoms", "url": "https://www.news18.com/news/lifestyle/how-people-self-diagnosed-themselves-for-covid-19-during-3rd-wave-4869017.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/omicron-164437573016x9.jpg", "publishedAt": "2022-03-14T06:18:19Z", "content": "Although Covid-19 cases are dropping in numbers daily, it has been advised not to get sloppy as the Omicron variant is still at large. Fortunately, the third wave of the pandemic was milder, and so w… [+2013 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "IANS", "title": "Scientists reverse ageing in women, increase fertility with antiviral drugs - IBTimes India", "description": "Results showed that antiviral drugs could indeed reverse the process in mouse and human egg cells and return to their former youthful selves", "url": "https://www.ibtimes.co.in/scientists-reverse-ageing-women-increase-fertility-antiviral-drugs-846555", "urlToImage": "https://data1.ibtimes.co.in/en/full/770317/all-you-need-know-about-covid-vaccination-pregnant-women.jpg", "publishedAt": "2022-03-14T06:12:10Z", "content": "Are Covid vaccines safe for pregnant women\r\nIn a major breakthrough, Israeli scientists claim to have extended women's fertility by successfully reversing the ageing mechanism in eggs using antiviral… [+2078 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Severe Mental Illnesses Increase Risk of Cardiovascular Diseases, Claims New Study - News18", "description": "The new study was conducted on about 6 lakh people and was published in the Journal of American Heart Association.", "url": "https://www.news18.com/news/lifestyle/severe-mental-illnesses-increase-risk-of-cardiovascular-diseases-claims-new-study-4872248.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-2-54-164723798216x9.png", "publishedAt": "2022-03-14T06:05:39Z", "content": "People suffering from severe mental illnesses such as Schizophrenia and Bipolar disorder are at an increased risk of cardiovascular disease at a younger age, says a study conducted by scientists in t… [+2015 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus symptoms: New research finds signs of COVID-19 in fully vaccinated - Times of India", "description": "Coronavirus vaccines have helped us cope better with the COVID-19 crisis and have alleviated the adverse effects of the SARs-COV-2 virus. It has proved to be a boon during these baneful times and helped us tackle severe COVID infections.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-symptoms-new-research-finds-signs-of-covid-19-in-fully-vaccinated/photostory/90169155.cms", "urlToImage": "https://static.toiimg.com/photo/90169175.cms", "publishedAt": "2022-03-14T05:30:00Z", "content": "With the emergence of new COVID variants, immunity from vaccines and that from natural infection seems to have diminished considerably. The heavily mutated Omicron is said to be milder than the previ… [+854 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Alternative to antibiotics may prevent recurrent UTIs - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-03-14T05:00:06Z", "content": ""}, {"source": {"id": null, "name": "Raillynews.com"}, "author": null, "title": "Hereditary Kidney Diseases Are Underrecognized - RaillyNews", "description": "Hereditary Kidney Diseases Are Not Recognized Enough - More than 500 million people in the world, and one out of every 7 people in our country, have kidney disease. Nephrology Specialist Prof. Dr. Gülçin Kantarcı, “World Kidney", "url": "https://www.raillynews.com/2022/03/hereditary-kidney-diseases-are-poorly-recognized/", "urlToImage": "https://rayhaber.com/wp-content/uploads/2022/03/Kalitsal-Bobrek-Hastaliklari-Yeterince-Taninmiyor.jpg", "publishedAt": "2022-03-14T02:45:53Z", "content": "Hereditary Kidney Diseases Are Underrecognized\r\nThere is kidney disease in more than 500 million people in the world and in one of every 7 people in our country. Nephrology Specialist Prof. Dr. Gülçi… [+4155 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weighing yourself or measuring yourself: What’s a more accurate way to assess weight loss? - Times of India", "description": "Even though they are following the same diet and fitness routine, no visible changes are observed, leading to disappointment.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weighing-yourself-or-measuring-yourself-whats-a-more-accurate-way-to-assess-weight-loss/photostory/90167639.cms", "urlToImage": "https://static.toiimg.com/photo/90167667.cms", "publishedAt": "2022-03-14T01:30:00Z", "content": "BMI chart is the most standardised method to determine the ideal body weight of a person in comparison to their height. It is a more accurate way to track your progress. The problem with this method … [+355 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "A treatment for hip osteoarthritis without surgery thanks to regenerative medicine - Code List", "description": "The regenerative medicine is responding to many of the challenges posed by current medicine, especially in the treatment of some diseases. Today we have a innovative therapy cell that allows to treat the hip arthrosis by way of simple and without surgery. Thi…", "url": "https://codelist.biz/2022/03/14/a-treatment-for-hip-osteoarthritis-without-surgery-thanks-to-regenerative-medicine/", "urlToImage": "https://estaticos-cdn.prensaiberica.es/clip/bf5e260a-c6b3-4afc-8295-ad32f7c31476_16-9-aspect-ratio_default_0.jpg", "publishedAt": "2022-03-14T01:06:26Z", "content": "The regenerative medicine is responding to many of the challenges posed by current medicine, especially in the treatment of some diseases. Today we have a innovative therapy cell that allows to treat… [+4893 chars]"}, {"source": {"id": null, "name": "The Sun Daily"}, "author": null, "title": "Females more prone to long Covid - The Sun Daily", "description": "LONG Covid is a persistent state of ill health after Covid-19 infection, which continues for more than three months and cannot be explained by alterna...", "url": "https://www.thesundaily.my/home/females-more-prone-to-long-covid-14-03-MD8948943", "urlToImage": "https://www.thesundaily.my/binrepository/480x320/0c0/480d250/none/11808/RSLJ/pexels-photo-8088435_2231021_20220314074333.jpg", "publishedAt": "2022-03-14T00:00:00Z", "content": "LONG Covid is a persistent state of ill health after Covid-19 infection, which continues for more than three months and cannot be explained by alternative diagnosis.\r\nPatients with long Covid reporte… [+2766 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Unnikrishnan S", "title": "Obesity adds to risk of Covid, say experts - The New Indian Express", "description": "Although some people find it hard to lose weight due to various reasons, diet and physical activities play vital roles in making a difference, according to doctors.", "url": "https://www.newindianexpress.com/states/kerala/2022/mar/14/obesity-adds-to-risk-of-covid-say-experts-2429783.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/3/14/w600X390/Obesity_add.jpg", "publishedAt": "2022-03-13T23:14:00Z", "content": "THIRUVANANTHAPURAM: With the government easing Covid restrictions, health experts are urging people to maintain a healthy weight as obesity and potbelly associated with it are considered to be major … [+2215 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Include these foods in your diet if you have depression and anxiety - Play Crazy Game", "description": "Depression, as many are already aware, is a chronic psychiatric illness whose symptoms are deep sadness, loss of interest, lack of mood and mood swings. It can often be confused with anxiety and can even lead the patient to have suicidal thoughts. Read more: …", "url": "https://playcrazygame.com/2022/03/14/include-these-foods-in-your-diet-if-you-have-depression-and-anxiety/", "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/03/depressao.jpg", "publishedAt": "2022-03-13T23:12:05Z", "content": "Depression, as many are already aware, is a chronic psychiatric illness whose symptoms are deep sadness, loss of interest, lack of mood and mood swings. It can often be confused with anxiety and can … [+3544 chars]"}, {"source": {"id": null, "name": "Switzer.com.au"}, "author": null, "title": "The commonest cause of death in women: Cardiovascular disease - Switzer", "description": "For too long there has been a false notion that heart disease is typically only a disorder of males.", "url": "https://switzer.com.au/the-experts/dr-ross-walker/the-commonest-cause-of-death-in-women-cardiovascular-disease/", "urlToImage": "https://switzer.com.au/wp-content/uploads/ECG.jpg", "publishedAt": "2022-03-13T21:50:23Z", "content": "One week after the death of the two cricketing legends, Rodney Marsh and Shane Warne, a prominent and well respected female Labor politician, Kimberley Kitching died suddenly at exactly the same age … [+5923 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Know the signs of dehydration and avoid health problems - Play Crazy Game", "description": "Although it is said that it is important to drink two liters of water a day, this amount can still increase with the habits of each one. For example, people who exercise frequently may need more water in their body, as well as those who live in hot environmen…", "url": "https://playcrazygame.com/2022/03/14/know-the-signs-of-dehydration-and-avoid-health-problems/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/conheca-os-sinais-de-desidratacao.jpeg", "publishedAt": "2022-03-13T21:43:58Z", "content": "Although it is said that it is important to drink two liters of water a day, this amount can still increase with the habits of each one. For example, people who exercise frequently may need more wate… [+1697 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "What to eat to sleep well? - Play Crazy Game", "description": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other. Between dimming the lights (and also the brightness of the tablet), av…", "url": "https://playcrazygame.com/2022/03/14/what-to-eat-to-sleep-well-2/", "urlToImage": "https://i0.wp.com/www.cenariomt.com.br/wp-content/uploads/2022/03/food-g424a820c5_1920.jpg?fit=1920,1272&ssl=1", "publishedAt": "2022-03-13T21:21:56Z", "content": "What to eat to get a good sleep? THE preparation until the moment you lie down in bed can be decisive for a excellent night of sleep or a chain of hours rolling from one side to the other.\r\nBetween d… [+927 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Know what is decompensated diabetes, its symptoms and how to treat it - Play Crazy Game", "description": "Diabetes is a disease that directly interferes with blood sugar circulation. Because it is a silent disease, that is, people do not immediately perceive its effects, it is usually identified late. In that sense, the decompensated diabetes this is when the dis…", "url": "https://playcrazygame.com/2022/03/14/know-what-is-decompensated-diabetes-its-symptoms-and-how-to-treat-it-2/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/saiba-o-que-e-diabetes-descompensada-scaled.jpg", "publishedAt": "2022-03-13T20:59:58Z", "content": "Diabetes is a disease that directly interferes with blood sugar circulation. Because it is a silent disease, that is, people do not immediately perceive its effects, it is usually identified late.\r\nI… [+1877 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Learn about the diseases caused by high blood pressure - Play Crazy Game", "description": "High blood pressure is a condition in which there is an increase in the pressure that the blood makes when circulating through the arteries for a continuous time. However, this disease is present in the daily lives of thousands of Brazilians and can have diff…", "url": "https://playcrazygame.com/2022/03/14/learn-about-the-diseases-caused-by-high-blood-pressure/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/Saiba-quais-sao-as-doencas-causadas-pela-pressao-alta-scaled.jpg", "publishedAt": "2022-03-13T19:32:00Z", "content": "High blood pressure is a condition in which there is an increase in the pressure that the blood makes when circulating through the arteries for a continuous time. However, this disease is present in … [+1906 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "Should public health measures like masking continue beyond the pandemic? Data on viral infections shows their benefits - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "Calgary, Mar 13: Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However, surprisingly little attention has been paid to the remarka…", "url": "https://www.dailyexcelsior.com/should-public-health-measures-like-masking-continue-beyond-the-pandemic-data-on-viral-infections-shows-their-benefits/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/03/9-18.jpg", "publishedAt": "2022-03-13T19:29:47Z", "content": "Calgary, Mar 13: Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However… [+6011 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Obesity does not improve! – ARNAUD DRIJARD - Code List", "description": "The new report from the World Obesity Federation came out, and what it mentions is quite alarming. The situation is critical and is a threat to many we know: -Obesity rates are likely to double by 2030, with the highest increases in the lowest-income countrie…", "url": "https://codelist.biz/2022/03/13/obesity-does-not-improve-arnaud-drijard/", "urlToImage": "https://www.record.com.mx/sites/default/files/columnista/tcolumnistas/Arnaud%20Drijard.jpg", "publishedAt": "2022-03-13T17:50:28Z", "content": "The new report from the World Obesity Federation came out, and what it mentions is quite alarming. The situation is critical and is a threat to many we know:\r\n-Obesity rates are likely to double by 2… [+5133 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kevin R Stone", "title": "Arthritis: Prevention, Treatment, and Cures - Times of India", "description": "Arthritis is a silent, insidious, and painful joint disorder that ruins many lives. In the US, it’s the most common cause of disability. The good news is, we have learned that many cases of arthritis...", "url": "https://timesofindia.indiatimes.com/blogs/the-stone-clinic/arthritis-prevention-treatment-and-cures/", "urlToImage": "https://static.toiimg.com/imagenext/toiblogs/photo/blogs/wp-content/uploads/2022/03/Stone-clinic.png", "publishedAt": "2022-03-13T16:14:48Z", "content": "Arthritis is a silent, insidious, and painful joint disorder that ruins many lives. In the US, its the most common cause of disability. The good news is, we have learned that many cases of arthritis … [+6132 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Terri-Ann Williams", "title": "I’m a nutritionist and here’s six ways to cut back on sugar and blast belly fat fast... - The US Sun", "description": "", "url": "https://www.the-sun.com/health/4884251/nutritionist-ways-cut-back-sugar-lose-belly-fat/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/03/NINTCHDBPICT000710551081-1.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-03-13T15:43:20Z", "content": "WHO doesn't love sugar? Whether it's with a cuppa, the jam on your scone or that 11am chocolate biscuit, it is truly delicious.\r\nBut consuming too much sugar increases your risk of being overweight, … [+4925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: All you need to know about the next normal that experts are preparing for - Times of India", "description": "The pandemic has been with us for three years almost and it is here to stay. With a substantial number of cases still coming up, there is no end in sight, but, it cannot be denied that the number of cases have decreased and so has the intensity of the current…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-all-you-need-to-know-about-the-next-normal-that-experts-are-preparing-for/photostory/90170727.cms", "urlToImage": "https://static.toiimg.com/photo/90170989.cms", "publishedAt": "2022-03-13T13:30:00Z", "content": "The director of the National Institute of Allergy and Infectious Diseases. Dr. Anthony Fauci categorizes the pandemic into five phases. The first being the pandemic itself, in which the entire world … [+841 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Heather Newgen", "title": "Here's What a Migraine Feels Like, Say Physicians — Eat This Not That - Eat This, Not That", "description": "Migraines can be more than just an inconvenience, they can be seriously debilitating and lay you up for days. Here's how to help prevent one.", "url": "http://www.eatthis.com/news-heres-what-a-migraine-feels-like-say-physicians/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/01/woman-covid-migraine.jpg?quality=82&strip=all", "publishedAt": "2022-03-13T12:46:07Z", "content": "Anyone who's had a migraine knows that sickening stomach feeling that can cause you to stay in bed for hours because you're too nauseous to move. Migraines can be more than just an inconvenience, the… [+4483 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Harriet Whitehead", "title": "How to sleep: The high protein foods you may need to avoid before bed - Express", "description": "SLEEPING through the night is not something everyone is always able to do, and there is a lot of advice to be found around improving your quality of sleep, and adopting healthy sleep routines. This may include avoiding high protein foods straight before bed.", "url": "https://www.express.co.uk/life-style/health/1579886/how-to-sleep-avoid-high-protein-foods-steak-chicken-before-bed", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579886.jpg", "publishedAt": "2022-03-13T12:23:02Z", "content": "The charity adds: “Diet is also multifaceted. It isn’t just one food; instead, it is cumulative, affected by when, what, and how much we eat throughout a day and over weeks, months, and years.\r\n“Indi… [+460 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Philip Lewis", "title": "Cancer affects dietary habits. Here's how customised nutrition helps in recovery - Global Circulate", "description": "For patients with cancer, good nutrition is crucial, as consuming the right staples can help improve treatment outcomes and quality of life", "url": "https://globalcirculate.com/cancer-affects-dietary-habits-heres-how-customised-nutrition-helps-in-recovery/", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/12/cancer-640.jpg", "publishedAt": "2022-03-13T10:36:47Z", "content": "For patients with cancer, good nutrition is crucial, as consuming the right staples can help improve treatment outcomes and quality of life\r\nCancer can take a major toll on a person and often affects… [+4885 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Patients with severe COVID-19 who are treated with ECMO may experience lung recovery: Research - ANI News", "description": "New Delhi [India], March 13 (ANI): A new study led by The Society of Thoracic Surgeons has found that some patients with severe COVID-19 who are treated with extracorporeal membrane oxygenation (ECMO) might experience significant lung recovery and return to n…", "url": "https://www.aninews.in/news/health/patients-with-severe-covid-19-who-are-treated-with-ecmo-may-experience-lung-recovery-research20220313155206", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Capture120220313102111-thumbnail-154x87-70.jpg", "publishedAt": "2022-03-13T10:22:00Z", "content": "ANI | Updated: Mar 13, 2022 15:52 IST\r\nNew Delhi [India], March 13 (ANI): A new study led by The Society of Thoracic Surgeons has found that some patients with severe COVID-19 who are treated with ex… [+4633 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Izzie Deibe", "title": "High blood pressure symptoms: The six signs your hypertension could be serious - Express", "description": "HIGH BLOOD PRESSURE, also known as hypertension, increases your risk of heart attack and stroke. Here are the six signs your blood pressure could be serious.", "url": "https://www.express.co.uk/life-style/health/1578199/high-blood-pressure-symptoms-signs-hypertension-emergency-evg", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1578199.jpg", "publishedAt": "2022-03-13T10:15:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "What is Nordic Diet and how does it help prevent cardiovascular diseases - Times of India", "description": "Nordic diet refers to a healthy diet which consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognized as extremely healthy, tasty, and sustainable.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/what-is-nordic-diet-and-how-it-helps-prevent-cardiovascular-diseases/photostory/90183708.cms", "urlToImage": "https://static.toiimg.com/photo/90183720.cms", "publishedAt": "2022-03-13T09:57:30Z", "content": "Nordic diet refers to a healthy diet that consists of berries, veggies, fish, whole grains and rapeseed oil. It has been recognised as extremely healthy, tasty, and sustainable. The diet is adapted t… [+814 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Music combined with auditory beat stimulation can reduce anxiety: Study - Hindustan Times", "description": "Anxiety has been steadily increasing, particularly in the adolescent and young adult populations, over recent decades. Studies have previously shown that listening to music can reduce anxiety, perhaps even more effectively than some anti-anxiety medications. …", "url": "https://www.hindustantimes.com/lifestyle/health/music-combined-with-auditory-beat-stimulation-can-reduce-anxiety-study-101647164819972.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/13/1600x900/Mp3_player_1646369764673_1647164921069.jpg", "publishedAt": "2022-03-13T09:50:18Z", "content": "Treatments integrating music and auditory beat stimulation are effective in reducing anxiety in some patients, a recent study suggested.\r\nThe study by Adiel Mallik and Frank Russo of the Ryerson Univ… [+3009 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Diabetes symptoms: Blurred eyesight is a sign - Verve Times", "description": "Diabetes UK says: “No individual is the same. The symptoms you experience won’t exactly match those of another person.“However, the most common symptoms experienced by many people with diabetes are increased thirst, increased urination, feeling tired", "url": "https://vervetimes.com/diabetes-symptoms-blurred-eyesight-is-a-sign/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1579832.jpg", "publishedAt": "2022-03-13T09:41:13Z", "content": "Drinking more water is important for glucose control because it allows the body to flush any excess sugar.\r\nCarbohydrate intake should also be managed efficiently, as the body breaks downs down the n… [+307 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Changes to Calorie Intake, Physical Activity Does Not Prevent Long-term Weight Gain: Research - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. Small changes to calorie intake and physical activity levels do not prevent long-term weight gain better than monitoring alone, according to a trial done by researchers.", "url": "https://www.latestly.com/agency-news/health-news-changes-to-calorie-intake-physical-activity-does-not-prevent-long-term-weight-gain-research-3467574.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/03/bjkbbbbbbbbbbbbbbbbbbbbbbbbbbbkkkkkkkkkkkkkkkkkkkkkkkkkkk20220313092145-588x441.jpg", "publishedAt": "2022-03-13T09:38:21Z", "content": "Washington [US], March 13 (ANI): Small changes to calorie intake and physical activity levels do not prevent long-term weight gain better than monitoring alone, according to a trial done by researche… [+2451 chars]"}, {"source": {"id": null, "name": "Amp.dev"}, "author": null, "title": "Protein consumption from multiple sources may lower risk of High BP - PTC News", "description": "The following markup is a basic AMP page.", "url": "https://amp.dev/documentation/guides-and-tutorials/start/create/basic_markup/", "urlToImage": "https://amp.dev/static/img/sharing/docs-guide-600x314.png", "publishedAt": "2022-03-13T09:31:05Z", "content": "Toggle Sidebar\r\nToggle SidebarThe following markup is a basic AMP page.\r\n&lt;!doctype html&gt;&lt;htmlamplang=\"en\"&gt;&lt;head&gt;&lt;metacharset=\"utf-8\"&gt;&lt;scriptasyncsrc=\"https://cdn.ampproject… [+2805 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Why masking, physical distancing, hand-washing should continue in post-Covid world? - Mint", "description": "Following the onset of the pandemic in March 2020, many regions around the world reported a dramatic decrease in demand for acute healthcare services, including urgent care visits to emergency departments and inpatient hospital stays", "url": "https://www.livemint.com/science/health/why-masking-physical-distancing-should-continue-in-the-post-covid-world-11647160979678.html", "urlToImage": "https://images.livemint.com/img/2022/03/13/600x338/d7adc534-a99a-11ea-b9f9-151bdea23004_1591642513641_1647162256331.jpg", "publishedAt": "2022-03-13T09:07:54Z", "content": "Public health measures, such as masking and physical distancing, that have been a high-profile part of the COVID-19 response for the past two years are now beginning to lift. However, surprisingly li… [+6353 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "Man who Had Stroke Developed Black Hair on Tongue, Read about the Peculiar Condition - News18", "description": "Black Hairy Tongue is known as lingua villosa nigra. It gives the tongue a dark, furry appearance.", "url": "https://www.news18.com/news/buzz/man-who-had-stroke-developed-black-hair-on-tongue-read-about-the-peculiar-condition-4868675.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/untitled-design-2022-03-13t133802.133-164715902816x9.jpg", "publishedAt": "2022-03-13T08:10:39Z", "content": "A recent report has highlighted the bizarre medical condition known as black hairy tongue or BHT. The case came to light when a man visited a dermatology clinic after the top of his tongue became coa… [+2417 chars]"}, {"source": {"id": null, "name": "MyLondon"}, "author": "Helena Vesty, Lucy Williamson", "title": "The signs you might have an unhealthy gut - and what you can do about it - My London", "description": "Trillions of bacteria live in our guts - and it's important to keep them happy", "url": "https://www.mylondon.news/news/health/problem-poos-disturbed-sleep-bad-23349439", "urlToImage": "https://i2-prod.mylondon.news/news/health/article22789549.ece/ALTERNATES/s1200/1_woman-g9fc9add5f_1920.jpg", "publishedAt": "2022-03-13T08:00:00Z", "content": "When you're gut is happy and healthy, the rest of your body will usually follow suit. There have also been demonstrated links between gut health and mood, mental health, endocrine disorders, skin con… [+3430 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "COVID-19 now less deadly than flu, says an expert - Zee News", "description": "Covid-19 now could be less deadly than flu in the UK, infectious diseases expert Professor Paul Hunter said, although he warned another variant could still change this.", "url": "https://zeenews.india.com/health/covid-19-now-less-deadly-than-flu-says-an-expert-2444861", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/03/13/1022483-covid-19-severe-symptoms.png", "publishedAt": "2022-03-13T07:44:13Z", "content": "London: Covid-19 now could be less deadly than flu in the UK, infectious diseases expert Professor Paul Hunter said, although he warned another variant could still change this. According to the Daily… [+1154 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Philip Lewis", "title": "Researchers re-engineer red blood cells to trigger immune system against Covid : The Tribune India - Global Circulate", "description": "IANSToronto, March 12Researchers have teamed up to modify red blood cells to transport viral agents which can safely trigger the immune system to protect the body against SARS-CoV-2, creating a promising new ve", "url": "https://globalcirculate.com/researchers-re-engineer-red-blood-cells-to-trigger-immune-system-against-covid-the-tribune-india/", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/3/2022_3$largeimg_1462968674.jpg", "publishedAt": "2022-03-13T06:53:40Z", "content": "IANS\r\nToronto, March 12\r\nResearchers have teamed up to modify red blood cells to transport viral agents which can safely trigger the immune system to protect the body against SARS-CoV-2, creating a p… [+1391 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Video Desk", "title": "Mental Health Tips: How Can Students Calm Their Exam Results Anxiety And Stress? Watch - India.com", "description": "Stressing and panicking  over exam results is a very normal phenomenon and is seen is seen in almost every student who has taken a test or exam. So, in this video, we will be suggesting you a few tips to soothe and calm down your stress and anxiety levels. Wa…", "url": "https://www.india.com/video-gallery/mental-health-tips-how-can-students-calm-their-exam-results-anxiety-and-stress-watch-5276077/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/HOW-to-deal-with-exam-anxiety.jpg", "publishedAt": "2022-03-13T06:45:00Z", "content": "Mental Health Tips: CBSE is soon going to declare the results of class 10th and 12th Term 1 exams. However, the confirmed date of the same is not yet officially revealed. While some students are eage… [+748 chars]"}, {"source": {"id": null, "name": "Docwirenews.com"}, "author": null, "title": "The BNT162b2 mRNA Covid-19 vaccine does not impair sperm parameters - DocWire News", "description": "Reprod Biomed Online. 2022 Jan 31:S1472-6483(22)00041-4. doi: 10.1016/j.rbmo.2022.01.008. Online ahead of print.ABSTRACTRESEARCH QUESTION: Does the", "url": "https://www.docwirenews.com/abstracts/the-bnt162b2-mrna-covid-19-vaccine-does-not-impair-sperm-parameters/", "urlToImage": "https://www.docwirenews.com/wp-content/uploads/2019/04/docwire_og_image.jpg", "publishedAt": "2022-03-13T06:00:00Z", "content": "Reprod Biomed Online. 2022 Jan 31:S1472-6483(22)00041-4. doi: 10.1016/j.rbmo.2022.01.008. Online ahead of print.\r\nABSTRACT\r\nRESEARCH QUESTION: Does the BNT162b2 COVID-19 vaccine affect sperm paramete… [+1638 chars]"}, {"source": {"id": null, "name": "Boston Herald"}, "author": "Dr. John De Jong", "title": "Keeping an eye on bird flu outbreak - Boston Herald", "description": "If this H5N1 strain truly became a serious public health concern, the authorities would make sure that the public was well aware of the prevalence and risk and further precautions would be implemen…", "url": "https://www.bostonherald.com/2022/03/13/keeping-an-eye-on-bird-flu-outbreak/", "urlToImage": "https://www.bostonherald.com/wp-content/uploads/2022/03/AP21007404919305.jpg?w=1024&h=683", "publishedAt": "2022-03-13T05:21:22Z", "content": "My cousin lives in a more rural area and raises chickens primarily as pets, but he and his wife do consume the eggs and share some with their friends and neighbors. He informs me that there seems to … [+2562 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "3 Daily Habits That Help Prevent Cancer Without You Realizing It - Code List", "description": "The Cancer It is one of the main causes of death worldwide, since around 10 million deaths are registered annually, and although the various types of this condition can appear due to a mixture of factors, and sometimes it is even inevitable due to genetics, b…", "url": "https://codelist.biz/2022/03/13/3-daily-habits-that-help-prevent-cancer-without-you-realizing-it/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/3/12/f1280x720-35364_167039_5050.jpg", "publishedAt": "2022-03-13T02:37:20Z", "content": "The Cancer It is one of the main causes of death worldwide, since around 10 million deaths are registered annually, and although the various types of this condition can appear due to a mixture of fac… [+2507 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Difference between animal and plant protein and which is healthier - Times of India", "description": "When talking about protein intake, we normally assume animal meat as the basic source of protein and are unaware of the fact that there are several veg foods that are rich in protein too! The main difference lies in the fact that plant protein has fewer amino…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/difference-between-animal-and-plant-protein-and-which-is-healthier/photostory/90176314.cms", "urlToImage": "https://static.toiimg.com/photo/90176327.cms", "publishedAt": "2022-03-13T02:30:00Z", "content": "Vegetables are full of vitamins and minerals and have lesser calories than meat or egg. However, they don’t contain as much protein per serving as meat. In addition, the proteins that they do contain… [+432 chars]"}, {"source": {"id": null, "name": "Opticflux.com"}, "author": "William Reid", "title": "The Brain-Boosting Foods That Will Help You Get The Most From Your Cerebral Cores, According To Harvard Expert - Optic Flux", "description": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren't eating enough of premised on her experience with hundreds of individuals – consuming them may enhance your mood, enha…", "url": "https://www.opticflux.com/the-brain-boosting-foods-that-will-help-you-get-the-most-from-your-cerebral-cores-according-to-harvard-expert/16782/", "urlToImage": "https://www.opticflux.com/wp-content/uploads/2021/12/louis-hansel-phEaeqe555M-unsplash-scaled.jpg", "publishedAt": "2022-03-12T22:24:16Z", "content": "Dr. Uma Naidoo, a psychiatrist, cognitive health researcher, and dietitian proposed a variety of brain-boosting food types that people aren’t eating enough of premised on her experience with hundreds… [+1945 chars]"}, {"source": {"id": null, "name": "VENTS Magazine"}, "author": "RJ Frometa", "title": "Does Whey Protein Help in Building Muscles? - - VENTS Magazine", "description": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some pl", "url": "https://ventsmagazine.com/2022/03/12/does-whey-protein-help-in-building-muscles/", "urlToImage": null, "publishedAt": "2022-03-12T21:58:06Z", "content": "Does Whey protein help in building muscles? The answer is yes, but it is important to know the facts before using them. A good source of protein is dairy, but it is also recommended to include some p… [+3724 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "Eating Lentils, Grains And Nuts Add 10 Years To Your Life, Says Study - Indiatimes.com", "description": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a longer life-span - marking an improvement of 10 years than th…", "url": "https://www.indiatimes.com/technology/science-and-future/eating-lentils-nuts-extend-life-study-564154.html", "urlToImage": "https://im.indiatimes.in/content/2022/Mar/FBImage18-copy_6229e96c2c834.jpg", "publishedAt": "2022-03-12T20:51:25Z", "content": "Have you eaten grains and lentils lately? If not, now's the time to make these ingredients a part of your daily diet. A new study claims that eating lentils and whole grains everyday is linked to a l… [+2028 chars]"}, {"source": {"id": null, "name": "Vaxbeforetravel.com"}, "author": null, "title": "Poliovirus Outbreak Confirmed in Israel - Vax-Before-Travel", "description": "The WHO Europe reported on March 10, 2022, a case of circulating vaccine-derived poliovirus type 3 (cVDPV3) was confirmed in an unvaccinated young girl in Israel. The three-year-old girl developed acute flaccid paralysis and, upon testing of her stool, poliov…", "url": "https://www.vaxbeforetravel.com/2022/03/12/poliovirus-outbreak-confirmed-israel", "urlToImage": "https://www.vaxbeforetravel.com/sites/default/files/styles/article_metadata/public/jerusalem-5272123.jpg", "publishedAt": "2022-03-12T19:51:40Z", "content": "(Vax Before Travel)The WHO Europe reported on March 10, 2022, a case of circulating vaccine-derived poliovirus type 3 (cVDPV3) was confirmed in an unvaccinated young girl in Israel. The three-year-ol… [+1132 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Know everything about Cervical Cancer - Rising Kashmir", "description": null, "url": "https://www.risingkashmir.com/displaynews.aspx?news=102429", "urlToImage": "https://www.risingkashmir.com/userfiles/image/s_637826770727623748_download_-_2022-03-12T234737.883.jpg", "publishedAt": "2022-03-12T18:29:18Z", "content": "Cervical Canceris a type of cancer that occurs in the cells of the cervix —the lower part of the uterus that connects to the vagina. Various strains of the Human Papilloma virus (HPV),a sexually tran… [+13393 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Agencies", "title": "COVID vaccination benefits cancer patients, claims study - India TV News", "description": "The results showed that most cancer patients had seroconverted, meaning they developed antibodies after receiving the vaccine. Overall, 71.3 per cent of patients seroconverted after the first dose, 90.3 per cent after the second. There were, however, differen…", "url": "https://www.indiatvnews.com/health/covid-vaccination-benefits-cancer-patients-claims-study-2022-03-12-764078", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-2022-03-12t234348-1647108833.jpg", "publishedAt": "2022-03-12T18:20:34Z", "content": "It has been unclear if cancer patients considered immunocompromised could prevent or lessen the risk of COVID-19 infection through vaccination. Moffitt Cancer Center researchers have put together one… [+2600 chars]"}, {"source": {"id": null, "name": "Rising Kashmir Daily English Newspaper"}, "author": null, "title": "Healthy eating and diet tips for women - Rising Kashmir", "description": "Rising Kashmir: Leading English newspaper in Jammu and Kashmir", "url": "https://www.risingKashmir.com/", "urlToImage": "https://www.risingkashmir.com/userfiles/image/safe_imagenow.png", "publishedAt": "2022-03-12T18:17:05Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Losartan off the market: how to proceed if you need the drug | Health - Play Crazy Game", "description": "disclosure Losartan has been withdrawn from the market Sanofi Medley's announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among patients who use the drug to treat high blood pressure or hear…", "url": "https://playcrazygame.com/2022/03/12/losartan-off-the-market-how-to-proceed-if-you-need-the-drug-health/", "urlToImage": "https://i0.statig.com.br/bancodeimagens/6h/2r/5w/6h2r5ws8vnhqfdcbzv91fy3w0.jpg", "publishedAt": "2022-03-12T17:14:25Z", "content": "disclosureLosartan has been withdrawn from the market\r\nSanofi Medley’s announcement that it is preventively withdrawing all its products with the active ingredient Losartan has raised doubts among pa… [+5007 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "Glaucoma: Cause, symptoms, treatment and prevention - Verve Times", "description": "Glaucoma is a group of eye diseases that can cause vision loss and blindness. Though the cause is not entirely known, many people with glaucoma have high eye pressure. Excess fluid builds up inside the eye, and the pressure eventually damages the opt", "url": "https://vervetimes.com/glaucoma-cause-symptoms-treatment-and-prevention/", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JhVBi2U5wmR7Zka2tPkypZ-1200-80.jpg", "publishedAt": "2022-03-12T16:59:08Z", "content": "Glaucoma is a group of eye diseases that can cause vision loss and blindness. Though the cause is not entirely known, many people with glaucoma have high eye pressure. Excess fluid builds up inside t… [+10572 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Dexamethasone at discharge for COVID-19 does not reduce readmission, mortality - Healio", "description": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\n      Cheng-Wei Huang, MD, a physician at Kaiser Permanente Los An…", "url": "https://www.healio.com/news/infectious-disease/20220311/dexamethasone-at-discharge-for-covid19-does-not-reduce-readmission-mortality", "urlToImage": "https://www.healio.com/~/media/slack-news/infectious-disease/misc/other/steroids_shutterstock.jpg", "publishedAt": "2022-03-12T16:02:18Z", "content": "Continued use of dexamethasone after hospital discharge was not associated with a reduction in readmission or mortality among patients with COVID-19, researchers reported in JAMA Network Open.\r\nCheng… [+1958 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Impact of prior underinsurance on cervical cancer screening among Davidson County, Tennessee, women diagnosed with invasive cervical cancer, 2008–2018 - BMC Women's Health - BioMed Central", "description": "Introduction We sought to investigate the association between insurance coverage history and cervical cancer screening among Davidson County, Tennessee, women diagnosed with incident cervical cancer. Methods We reviewed medical records of women diagnosed with…", "url": "https://bmcwomenshealth.biomedcentral.com/articles/10.1186/s12905-022-01638-9", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12905.jpg", "publishedAt": "2022-03-12T15:08:22Z", "content": null}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Understand what is Acanthosis Nigricans that causes dark spots on the skin - Play Crazy Game", "description": "We all know that all it takes is small changes in our bodies for us to be aware of symptoms. After all, it is important to identify potential diseases and conditions as early as possible. So if you've ever wondered what are dark spots on skin, know that there…", "url": "https://playcrazygame.com/2022/03/12/understand-what-is-acanthosis-nigricans-that-causes-dark-spots-on-the-skin/", "urlToImage": "https://escolaeducacao.com.br/wp-content/uploads/2022/03/manchas-na-pele.jpg", "publishedAt": "2022-03-12T15:00:18Z", "content": "We all know that all it takes is small changes in our bodies for us to be aware of symptoms. After all, it is important to identify potential diseases and conditions as early as possible. So if you’v… [+1845 chars]"}, {"source": {"id": null, "name": "Oswego Daily News"}, "author": null, "title": "Oswego County Health Department Offers Opportunities To Vaccinate Pets - Oswego Daily News", "description": "The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative measures are subject to change depending on COVID-19 virus activity and resp…", "url": "https://oswegocountytoday.com/news/oswego-county-health-department-offers-opportunities-to-vaccinate-pets/", "urlToImage": "https://i0.wp.com/oswegocountytoday.com/wp-content/uploads/2017/03/rabies-princess.jpg?fit=1200%2C1114&ssl=1", "publishedAt": "2022-03-12T14:58:12Z", "content": "File photo 2017: Princess didnt flinch as she got her shot.\r\nOSWEGO COUNTY The Oswego County Health Department has announced its rabies clinic schedule for 2022. The schedule and any preventative mea… [+3291 chars]"}, {"source": {"id": null, "name": "Omegaunderground.com"}, "author": "Laila Azzahra", "title": "X Important Strategies for Preventing UTIs - Omega Underground", "description": "Urinary tract infections range from uncomfortable to painful, so it’s best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of…", "url": "https://omegaunderground.com/x-important-strategies-for-preventing-utis/", "urlToImage": "https://omegaunderground.com/wp-content/uploads/2022/03/X-Important-Strategies-for-Preventing-UTIs-01.jpeg", "publishedAt": "2022-03-12T14:22:09Z", "content": "Urinary tract infections range from uncomfortable to painful, so its best to avoid them at all costs. The good news is, most UTIs are easily preventable with the help of a few important strategies.\r\n… [+4740 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "New study sheds light on how blood clots are formed during wound healing - The Siasat Daily", "description": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing. The research was published in the journal, 'Science Advances'. The research examined the behaviour of platelets at a wound site, s…", "url": "https://www.siasat.com/new-study-sheds-light-on-how-blood-clots-are-formed-during-wound-healing-2289858/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/blood-clots-_mar12.jpg", "publishedAt": "2022-03-12T13:40:00Z", "content": "Dublin: New research led by RCSI University of Medicine and Health has revealed how blood clots are formed during wound healing.\r\nThe research was published in the journal, ‘Science Advances’.\r\nThe r… [+1910 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Researchers say damage to inner ear system can predict fall risk among Alzheimer's patients - Big News Network", "description": "A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients well-documented higher risk of falling", "url": "https://www.bignewsnetwork.com/news/272382578/researchers-say-damage-to-inner-ear-system-can-predict-fall-risk-among-alzheimer-patients", "urlToImage": "https://cdn.bignewsnetwork.com/ani1647088213.jpg", "publishedAt": "2022-03-12T11:27:00Z", "content": "Washington [US], March 12 (ANI): A recent research has revealed that damage to the inner ear system that controls balance is a major factor in patients' well-documented higher risk of falling.\r\nThe s… [+3959 chars]"}, {"source": {"id": null, "name": "Uniindia.com"}, "author": "Superadmin", "title": "Covid causing lot of serious kidney issues: Expert - United News of India", "description": "", "url": "https://www.uniindia.com/story/Covid-causing-lot-of-serious-kidney-issues-Expert", "urlToImage": "https://www.uniindia.com/public/default-image/default-730x400.png", "publishedAt": "2022-03-12T10:43:00Z", "content": "Oscar nominated 'Writing..."}]}