{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Ambrish Mithal", "title": "Why your fatty liver can lead to Type 2 diabetes. So get that LFT and ultrasound done - The Indian Express", "description": "Fat in the liver increases insulin resistance. As insulin resistance increases, the pancreas tries to overcome it by working harder and gradually gets fatigued, accelerating the development of Type 2 diabetes. Once people have diabetes, they have an even grea…", "url": "https://indianexpress.com/article/lifestyle/health-specials/fatty-liver-type-2-diabetes-lft-and-ultrasound-done-8374385/", "urlToImage": "https://images.indianexpress.com/2023/01/fatty-liver_200_getty.jpg", "publishedAt": "2023-01-11T02:08:56Z", "content": "Doctor, my diabetes control is much better but my liver tests are abnormal, said the 50-year-old overweight woman. I am very worried. What should I do about it? Her reports showed a mild elevation of… [+5305 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Can diets reverse or delay aging? - News-Medical.Net", "description": "A new study published in the journal Science aimed to summarize the commonly studied anti-aging dietary interventions and their impact on human health and longevity.", "url": "https://www.news-medical.net/news/20230110/Can-diets-reverse-or-delay-aging.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735420_16734027057264675.jpg", "publishedAt": "2023-01-11T02:06:00Z", "content": "Studies from the early 1990s that analyzed the impact of reduced food intake on life span in rats indicated delayed development and increased adult life span in such animals. Other works by Walford, … [+8880 chars]"}, {"source": {"id": null, "name": "National Institutes of Health"}, "author": null, "title": "Nutrition, Health, and Your Environment - National Institute of Environmental Health Sciences", "description": "The mission of the National Institute of Environmental Health Sciences is to discover how the environment affects people in order to promote healthier lives.", "url": "https://www.niehs.nih.gov/health/topics/nutrition/index.cfm", "urlToImage": "https://www.niehs.nih.gov/health/assets/images/dad_showing_son_fruit.jpg", "publishedAt": "2023-01-11T02:03:45Z", "content": "Introduction\r\nWhat we eat is considered an environmental factor that influences health, in positive and negative ways. Healthy diets with an optimal balance of nutrients help people accomplish daily … [+20610 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UNF study finds dual COVID and flu vaccination reduces infection rates - EurekAlert", "description": "University of North Florida Brooks College of Health faculty recently published a study showing dual COVID-19 and seasonal influenza vaccinations are associated with reduced infection rates and can be an effective strategy to reduce the contagious respiratory…", "url": "https://www.eurekalert.org/news-releases/976144", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-11T02:03:29Z", "content": "Jacksonville, Fla. – University of North Florida Brooks College of Health faculty recently published a study showing dual COVID-19 and seasonal influenza vaccinations are associated with reduced infe… [+1898 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "School garden-based interventions can improve blood sugar, reduce 'bad' cholesterol in children - Science Daily", "description": "School garden-based interventions can improve metabolic parameters such as blood sugar and cholesterol in children, according to a new study.", "url": "https://www.sciencedaily.com/releases/2023/01/230110150951.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-11T01:34:34Z", "content": "School garden-based interventions can improve metabolic parameters such as blood sugar and cholesterol in children, according to a new study from UTHealth Houston.A cluster randomized controlled tria… [+3236 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New study links hearing loss with dementia in older adults: Findings highlight potential benefit of hearing aid - Science Daily", "description": "A new study has found that older adults with greater severity of hearing loss were more likely to have dementia, but the likelihood of dementia was lower among hearing aid users compared to non-users.", "url": "https://www.sciencedaily.com/releases/2023/01/230110150943.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-01-11T01:30:06Z", "content": "A new study led by researchers at the Johns Hopkins Bloomberg School of Public Health found that older adults with greater severity of hearing loss were more likely to have dementia, but the likeliho… [+3060 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Nanopore-based sensing device can provide volume information about tau and tubulin proteins - News-Medical.Net", "description": "Tau and tubulin proteins are one of the leading causes of many neurodegenerative diseases, such as Alzheimer's and Parkinson's.", "url": "https://www.news-medical.net/news/20230110/Nanopore-based-sensing-device-can-provide-volume-information-about-tau-and-tubulin-proteins.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/detail_of_microscope_lenses_observing_a_slide_with_sample_wells_in_the_laboratory-angellodeco_e84c7a54b30247a0a1ad679809f0b548-620x480.jpg", "publishedAt": "2023-01-11T00:35:00Z", "content": "Tau and tubulin proteins are one of the leading causes of many neurodegenerative diseases, such as Alzheimer's and Parkinson's. Most of neurodegenerative disease progression is related to the aggrega… [+2775 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Eileen Bailey", "title": "Knee, Hip Replacement: Hydrogel Injection May Help Reduce Infections - Healthline", "description": "Researchers say a new hydrogel injection may help prevent infections following knee or hip replacement, reducing the need for antibiotics and additional surgery", "url": "https://www.healthline.com/health-news/knee-hip-replacement-new-hydrogel-injection-may-help-reduce-infections", "urlToImage": "https://post.healthline.com/wp-content/uploads/2023/01/after-knee-surgery-732x549-thumbnail.jpg", "publishedAt": "2023-01-11T00:27:59Z", "content": "<ul><li>Researchers say they are developing a hydrogen injection that can help treat infections after knee or hip replacement surgery.</li><li>They hope the treatment can help reduce the need for ant… [+5715 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Anticancer drugs offer new hope for treatment of sepsis - News-Medical.Net", "description": "Research led by the IGC reveals how these drugs limit inflammation, positioning them as potential treatments for sepsis.", "url": "https://www.news-medical.net/news/20230110/Anticancer-drugs-offer-new-hope-for-treatment-of-sepsis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/9/By_royaltystockphoto_d68ea3ab1d0440e8ab54454b7f5609db-620x480.jpg", "publishedAt": "2023-01-10T23:55:00Z", "content": "Research led by the IGC reveals how these drugs limit inflammation, positioning them as potential treatments for sepsis.\r\nThe study, published in eLife, reveals that this class of drugs used in cance… [+3626 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Nancy Schimelpfening, MS", "title": "Can Drinking 1 Soda a Day Really Increase Your Risk of Hair Loss? - Healthline", "description": "New research suggests that the number of sugary drinks young men consume may be contributing to the onset of male pattern hair loss.", "url": "https://www.healthline.com/health-news/can-drinking-1-soda-a-day-really-increase-your-risk-of-hair-loss", "urlToImage": "https://post.healthline.com/wp-content/uploads/2023/01/soda-drink-can-732x549-thumbnail.jpg", "publishedAt": "2023-01-10T22:59:49Z", "content": "<ul><li>A new study suggests there may be a link between soda consumption and male pattern hair loss.</li><li>Even one soda per day could be a problem, say the authors.</li><li>However, experts say t… [+5504 chars]"}, {"source": {"id": null, "name": "India New England"}, "author": "India New England News", "title": "Frequent use of antibiotics may increase risk of inflammatory bowel disease - India New England", "description": "New Delhi– Frequent use of antibiotics may increase the risk of inflammatory bowel disease (IBD) — Crohn’s disease and ulcerative colitis — in people over the age of 40, a […]", "url": "https://indianewengland.com/frequent-use-of-antibiotics-may-increase-risk-of-inflammatory-bowel-disease/", "urlToImage": "https://indianewengland.com/wp-content/uploads/2021/05/Pills.jpg", "publishedAt": "2023-01-10T22:26:33Z", "content": "New Delhi– Frequent use of antibiotics may increase the risk of inflammatory bowel disease (IBD) — Crohn’s disease and ulcerative colitis — in people over the age of 40, a new study has shown.Accordi… [+2272 chars]"}, {"source": {"id": null, "name": "Jwatch.org"}, "author": null, "title": "How the Gut Microbiome Can Affect Motivation to Exercise - NEJM Journal Watch", "description": "NEJM Journal Watch reviews over 250 scientific and medical journals to present important clinical research findings and insightful commentary", "url": "https://www.jwatch.org/na55694/2023/01/10/how-gut-microbiome-can-affect-motivation-exercise", "urlToImage": null, "publishedAt": "2023-01-10T21:45:09Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Richard Harth", "title": "X-ray light reveals how virus responsible for COVID-19 covers its tracks, eluding the immune system - Phys.org", "description": "The COVID-19 pandemic, caused by the SARS CoV-2 virus, continues to threaten populations around the world, after killing over 1 million Americans. In recent weeks, XBB.1.5, the most transmissible variant to date, has started to sweep across the country.", "url": "https://phys.org/news/2023-01-x-ray-reveals-virus-responsible-covid-.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/x-ray-light-reveals-ho.jpg", "publishedAt": "2023-01-10T20:53:05Z", "content": "The COVID-19 pandemic, caused by the SARS CoV-2 virus, continues to threaten populations around the world, after killing over 1 million Americans. In recent weeks, XBB.1.5, the most transmissible var… [+9477 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Acceptance of Covid vaccines increased globally: Study - Daily Pioneer", "description": "Acceptance of COVID-19 vaccines increased globally, from 75.2 per cent in 2021 to 79.1 per cent in 2022, according to a survey in 23 countries that represent more than 60 per cent of the world's population.\n\nThe study underlines a wide variability among count…", "url": "https://www.dailypioneer.com/2023/world/acceptance-of-covid-vaccines-increased-globally--study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2023-01-10T18:53:32Z", "content": "Acceptance of COVID-19 vaccines increased globally, from 75.2 per cent in 2021 to 79.1 per cent in 2022, according to a survey in 23 countries that represent more than 60 per cent of the world's popu… [+1870 chars]"}, {"source": {"id": null, "name": "Plos.org"}, "author": null, "title": "Booster vaccination protection against SARS-CoV-2 infections in young adults during an Omicron BA.1-predominant period: A retrospective cohort study - PLOS", "description": "Jiayue Wan and colleagues estimate the impact of COVID-19 booster doses on SARS-CoV-2 infection in a vaccinated population of young adults during an Omicron BA.1-predominant period.", "url": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004153", "urlToImage": "https://journals.plos.org/plosmedicine/article/figure/image?id=10.1371/journal.pmed.1004153.g002&size=inline", "publishedAt": "2023-01-10T18:50:25Z", "content": "Abstract\r\nBackground\r\nWhile booster vaccinations clearly reduce the risk of severe Coronavirus Disease 2019 (COVID-19) and death, the impact of boosters on Severe Acute Respiratory Syndrome Coronavir… [+52314 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Links COVID-19 Infection – and Vaccination – to a Debilitating Heart Condition - SciTechDaily", "description": "Smidt Heart Institute researchers show the risk of developing postural orthostatic tachycardia syndrome, or POTS, is five times higher after COVID-19 than after vaccination. A team of investigators from the Smidt Heart Institute at Cedars-Sinai has published …", "url": "https://scitechdaily.com/new-research-links-covid-19-infection-and-vaccination-to-a-debilitating-heart-condition/", "urlToImage": "https://scitechdaily.com/images/Human-Heart-Anatomy-1.jpg", "publishedAt": "2023-01-10T18:26:59Z", "content": "ByCedars-Sinai Medical CenterJanuary 10, 2023\r\nPostural Orthostatic Tachycardia Syndrome (POTS) is a disorder that affects the autonomic nervous system and is characterized by an abnormal increase in… [+5441 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Kaitlin Vogel", "title": "Millennials Have Higher Stroke Death Rates Than Past Generations - Healthline", "description": "A recent analysis shows that stroke deaths will rise among millennials, reversing a 40-year decline. Researchers suggest the increase in stroke-related deaths may be attributed to obesity, diabetes, and lifestyle factors.", "url": "https://www.healthline.com/health-news/stroke-death-rates-increasing-among-millennials", "urlToImage": "https://post.healthline.com/wp-content/uploads/2023/01/male-hospital-bed-phone-732x549-thumbnail.jpg", "publishedAt": "2023-01-10T18:25:14Z", "content": "<ul><li>A recent analysis shows that stroke fatalities will rise among millennials, reversing a 40-year decline.</li><li>Researchers suggest that increased stroke-related deaths may be attributed to … [+6794 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Ceramides start to accumulate in muscle during aging, finds study - News-Medical.Net", "description": "A study carried out at the University of Helsinki and école Polytechnique Fédérale de Lausanne in Switzerland found that during aging, ceramides, a class of fat molecules called sphingolipids, start to accumulate in muscle, impairing its function.", "url": "https://www.news-medical.net/news/20230110/Ceramides-start-to-accumulate-in-muscle-during-aging-finds-study.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/shutterstock_499282837_f18bafe030744de991560feceed98d20-620x480.jpg", "publishedAt": "2023-01-10T17:44:00Z", "content": "A study carried out at the University of Helsinki and école Polytechnique Fédérale de Lausanne in Switzerland found that during aging, ceramides, a class of fat molecules called sphingolipids, start … [+3365 chars]"}, {"source": {"id": null, "name": "B92"}, "author": null, "title": "Post-Covid autopsies confirm some gloom suspicions - B92", "description": "", "url": "https://www.b92.net/eng/news/society.php?yyyy=2023&mm=01&dd=10&nav_id=115180", "urlToImage": "https://www.b92.net/news/pics/2023/01/10/5715371763bd968aabfb2986632243_640x360x005215.jpg", "publishedAt": "2023-01-10T16:43:00Z", "content": "It is well known that Covid 19 is defined as a respiratory infection. However, the effects of the new coronavirus are not limited to one organ.\r\nSource: hayat.baTuesday, January 10, 2023 | 17:43\r\nPos… [+1875 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Why gardening could save your life: Having a green thumb could keep cancer away, benefits mental health - Study Finds", "description": "A new study reports that gardening could help reduce the risk of cancer, boost mental health and bring communities together.", "url": "https://studyfinds.org/benefits-of-gardening/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2020/04/AdobeStock_196915933.jpeg", "publishedAt": "2023-01-10T16:39:50Z", "content": "BOULDER, Colo. — Studies often point to the amazing benefits from spending time outside and connecting with nature. Here’s one more fantastic reason to put the smartphone down and enjoy the great out… [+5133 chars]"}, {"source": {"id": null, "name": "Clinicaladvisor.com"}, "author": "Kristin Della Volpe", "title": "COVID-19 Update: Long COVID Rehab, Post-Vaccine Myocarditis, and Home Test-to-Treat Program - Clinical Advisor", "description": "Recent COVID-19 updates include a successful pacing program for people with post exertion long COVID symptoms, a blood marker for post-vaccine myocarditis, and the first home test-to-treat program.", "url": "https://www.clinicaladvisor.com/home/topics/infectious-diseases-information-center/covid-19-rehabilitation-myocarditis-test-to-treat/", "urlToImage": "https://www.clinicaladvisor.com/wp-content/uploads/sites/11/2021/08/COVID19.Virus_.Cell_G_1301762970.jpg", "publishedAt": "2023-01-10T15:59:00Z", "content": "Recent updates on COVID-19 include a successful rehabilitation pacing program for people with post-exertional symptom exacerbation (PESE) as the result of physical, cognitive, or emotional exertion i… [+7903 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds how retirement plans affect cognitive performance in older people - ANI News", "description": "Researchers from the State University of New York's Binghamton University found that early retirement can hasten cognitive impairment in older people.", "url": "https://www.aninews.in/news/science/study-finds-how-retirement-plans-affect-cognitive-performance-in-older-people20230110204453", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230110151435.jpg", "publishedAt": "2023-01-10T15:23:10Z", "content": "New York [US], January 10 (ANI): Researchers from the State University of New York's Binghamton University found that early retirement can hasten cognitive impairment in older people.To understand ho… [+6698 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Pimavanserin administration does not notably impact severity of obstructive sleep apnea - Medical Dialogues", "description": "USA: A single pimavanserin dose does not significantly impact arousal threshold or obstructive sleep apnea (OSA) severity, a recent study published in Annals of the American Thoracic Society has...", "url": "https://medicaldialogues.in/pulmonology/news/pimavanserin-administration-does-not-notably-impact-severity-of-obstructive-sleep-apnea-105349", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/09/197103-obstructive-sleep-apnea-2.jpg", "publishedAt": "2023-01-10T14:30:44Z", "content": "USA: A single pimavanserin dose does not significantly impact arousal threshold or obstructive sleep apnea (OSA) severity, a recent study published in Annals of the American Thoracic Society has show… [+2753 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Another pandemic is coming – and the only answer Westminster has is lockdown - The Telegraph", "description": "Might it be better to create a long-term surge capacity to accommodate pandemics than to rely solely on the methods we used last time?", "url": "https://www.telegraph.co.uk/news/2023/01/10/another-pandemic-coming-answer-westminster-has-lockdown/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2023/01/10/TELEMMGLPICT000321588049_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay", "publishedAt": "2023-01-10T14:00:00Z", "content": "I was born in 1970, and grew up in an era that, though few recognised it at the time, was very unusual and fortunate in its lack of significant pandemics. Whereas there were major pandemics in 1889-9… [+3831 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Daphne Clarance", "title": "Myths about diabetes that need to be busted - India Today", "description": "There are several misconceptions about diabetes that should be fact-checked. Expert busts some myths about this lifestyle disease.", "url": "https://www.indiatoday.in/health/story/myths-about-diabetes-that-need-to-be-busted-2319750-2023-01-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/untitled_design_-_2023-01-10t180850.985-sixteen_nine.png?VersionId=0VAeMmi5wTdHTwSey.fB7OMAYUWO3_OK", "publishedAt": "2023-01-10T13:39:26Z", "content": "By Daphne Clarance: India is known as the diabetes capital of the world. With close to 80 million people who suffer from diabetes, this number is expected to rise up to 135 million by 2045. Diabetes,… [+2598 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Sonali Acharjee", "title": "Five health trends that will dominate 2023 - India Today", "description": "From cervical cancer prevention to optimum mental health and going traditional with food, the big focus areas in the New Year", "url": "https://www.indiatoday.in/india-today-insight/story/five-health-trends-that-will-dominate-2023-2319773-2023-01-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/story_of_the_day_3-sixteen_nine.jpg?VersionId=kVyTfGmvD.VfCxRKqsD2MPPvxumCvLnV", "publishedAt": "2023-01-10T13:13:48Z", "content": "The Covid pandemic put India and the worlds focus back on health like no other disease in recent times. Mental health has emerged as a critical aspect of overall wellbeing even as the rise in cases o… [+4314 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Shivangani Singh", "title": "5 Drinks to Boost your Hemoglobin Levels - The Quint FIT", "description": "Anemia is a disease that is caused due to low levels of hemoglobin and it can be common among women. But there are several foods that can help manage hemoglobin levels. Here are a few juice recipes", "url": "https://www.thequint.com/fit/5-drinks-to-boost-your-hemoglobin-levels", "urlToImage": "https://images.thequint.com/thequint%2F2022-08%2Fc48b5664-73d5-48d1-960b-decc16695f7d%2Fthree_fruit_juice_glasses_surrounded_by_colorful_fruits_picture_id453010753__1_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-01-10T13:05:53Z", "content": "Hemoglobin is a protein found in the blood that is used to transport oxygen in the blood and iron is the mineral that is essential for the proper functioning of the hemoglobin protein. \r\nHemoglobin i… [+667 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Alpine Ice Hack Recipe Reviews (TRUTH Revealed) Weight Loss Method Alpilean Diet 2023 - mid-day.com", "description": "This is the latest update about the Alpine Ice Hack Recipe. It reveals important information about the Alpine ice hack diet method every consumer should know.", "url": "https://www.mid-day.com/brand-media/article/alpine-ice-hack-recipe-reviews-truth-revealed-weight-loss-method-alpilean-diet-2023-23264797", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Alpienlie12_d.jpg", "publishedAt": "2023-01-10T13:00:00Z", "content": "This is the latest update about the Alpine Ice Hack Recipe. It reveals important information about the Alpine ice hack diet method every consumer should know.\r\nAre you looking for an all-natural way … [+12780 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Sneha Das", "title": "All about frostbites: Causes, symptoms, prevention, and more - NewsBytes", "description": "Frostbite is a condition when your skin and underlying tissues freeze and gets cold, inflamed, hard, pale, and numb", "url": "https://www.newsbytesapp.com/news/lifestyle/all-about-frostbites-causes-symptoms-prevention/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l61220230109182529.jpeg", "publishedAt": "2023-01-10T12:49:21Z", "content": "All about frostbites: Causes, symptoms, prevention, and more\r\nJan 10, 2023, 06:19 pm3 min read\r\nFrostbite is a condition when your skin and underlying tissues freeze and gets cold, inflamed, hard, pa… [+2473 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mental Health: Here's How You Can Boost Happy Hormones Through Simple Lifestyle Changes - NDTV", "description": "Mental health: Here's a list of lifestyle changes that can aid in the sufficient production of these hormones.", "url": "https://www.ndtv.com/health/heres-how-you-can-boost-happy-hormones-through-simple-lifestyle-changes-3677122", "urlToImage": "https://c.ndtvimg.com/2022-04/qltocro8_mental-health_625x300_19_April_22.jpg", "publishedAt": "2023-01-10T12:45:00Z", "content": "Mental Health: Vitamin D can help manage symptoms of depression\r\nWe all wish for happiness since it's a wonderful emotion that can consume your mind and body, causing you to laugh or even cry, and it… [+4775 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "Role of HPV vaccines for prevention of cervical cancer - Express Healthcare", "description": "Dr Hemant Tongaonkar, Senior Director-Urologic & Gynaecologic Oncosurgery & Head-Surgical Oncology, Nanavati Max Super Speciality Hospital, Mumbai talks about the preventive vaccines that have been developed for prevention of HPV infection and consequently ce…", "url": "https://www.expresshealthcare.in/news/role-of-hpv-vaccines-for-prevention-of-cervical-cancer/437640/", "urlToImage": "https://www.expresshealthcare.in/wp-content/uploads/2023/01/New-Project-15.jpg", "publishedAt": "2023-01-10T12:37:13Z", "content": "Dr Hemant Tongaonkar, Senior Director-Urologic &amp; Gynaecologic Oncosurgery &amp; Head-Surgical Oncology, Nanavati Max Super Speciality Hospital, Mumbai talks about the preventive vaccines that hav… [+4351 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Hoard up on these magic nuts! Having almonds daily can speed up metabolic recovery after strenuous exercis - Economic Times", "description": "Almonds provide a unique nutrient and polyphenol mixture that supports metabolic recovery.", "url": "https://economictimes.indiatimes.com/magazines/panache/hoard-up-on-these-magic-nuts-having-almonds-daily-can-speed-up-metabolic-recovery-after-strenuous-exercise/articleshow/96885209.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96885296,width-1070,height-580,imgsize-78134,overlay-etpanache/photo.jpg", "publishedAt": "2023-01-10T12:37:00Z", "content": "WASHINGTON: Eating almonds daily has been found to support metabolic recovery following strenuous exercise by increasing beneficial fat by 69 per cent, according to a new study. The researchers concl… [+4179 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Eating fast food is associated with liver disease - Tech Explorist", "description": "Risk of liver damage is highest for those with obesity or diabetes.", "url": "https://www.techexplorist.com/eating-fast-food-associated-liver-disease/55909/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/01/Eating-fast-food.jpg", "publishedAt": "2023-01-10T12:22:39Z", "content": "Fast food (FF) consumption is highly prevalent and associated with high caloric intake and a greater risk of diabetes. Little is known about the impact of fast food consumption on NAFLD risk in healt… [+3751 chars]"}, {"source": {"id": null, "name": "Bharattimes.co.in"}, "author": null, "title": "Engage in regular sex, eat nutritious diet: Expert on how to increase chances of pregnancy in 30s - English Bharat Times", "description": "Women who want to have children can improve their odds after age 30. We all know that a woman's fertility can decline as she ages. Females are born with a", "url": "https://eng.bharattimes.co.in/engage-in-regular-sex-eat-nutritious-diet-expert-on-how-to-increase-chances-of-pregnancy-in-30s/", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/01/10/1139726-pregnant-woman-pixabay.jpg", "publishedAt": "2023-01-10T12:08:00Z", "content": "Women who want to have children can improve their odds after age 30. We all know that a woman’s fertility can decline as she ages. Females are born with a certain number of eggs and as they get older… [+4928 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Diabetes control: Try THESE 6 exercises that help lower your sugar level - DNA India", "description": "To control diabetes, you can do many types of exercises in your routine, these include jogging running, yoga and many other types of workouts.", "url": "https://www.dnaindia.com/health/report-diabetes-control-try-these-6-exercises-that-help-lower-your-sugar-level-3016033", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/01/10/2565703-untitled-design-2023-01-10t172626.019.jpg", "publishedAt": "2023-01-10T12:00:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Jan 10, 2023, 06:25 PM ISTExercise is very helpful in keeping the body healthy. It not only makes you healthy but also agile. Exe… [+3009 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Keto & ACV Gummies (Scam Warning) For 2023 Best Offers Slim Keto Gummies Don't Buy Before Explore This - Deccan Herald", "description": "Keto & ACV Gummies  Review A change in outlook was brought on by the individual's worsening health problems, which in turn weakened their sense of confidence. The combination of her genetic tendency, the drugs she was taking, and her sadness led her to consum…", "url": "https://www.deccanherald.com/brandspot/pr-spot/keto-acv-gummies-scam-warning-for-2023-best-offers-slim-keto-gummies-don-t-buy-before-explore-this-1179645.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/P9-1179645-1673350529.png", "publishedAt": "2023-01-10T11:35:29Z", "content": "Keto &amp; ACV Gummies  Review A change in outlook was brought on by the individual's worsening health problems, which in turn weakened their sense of confidence. The combination of her genetic tende… [+12771 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Steroids South Africa: Where To Buy Anabolic Steroids For Sale Online South Africa - Deccan Herald", "description": "Where can I purchase legal steroids in South Africa Are you looking for safe and efficient supplements that can boost your performance? Steroids that are legal South Africa offers a variety of bodybuilding and sports products. The notion of steroids brings im…", "url": "https://www.deccanherald.com/brandspot/pr-spot/steroids-south-africa-where-to-buy-anabolic-steroids-for-sale-online-south-africa-1179643.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179643-1673350320.png", "publishedAt": "2023-01-10T11:32:00Z", "content": "Where can I purchase legal steroids in South Africa Are you looking for safe and efficient supplements that can boost your performance? Steroids that are legal South Africa offers a variety of bodybu… [+30556 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/lifestylestaff/", "title": "Diabetes Prevention: 8 Essential Steps For Diabetics to Stay Safe During COVID Times - India.com", "description": "People with underlying medical illnesses including diabetes, heart problems, hypertension, respiratory diseases, kidney troubles, etc. are even more at risk of contracting Covid.", "url": "https://www.india.com/health/diabetes-prevention-8-essential-steps-for-diabetics-to-stay-safe-during-covid-times-5847324/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-10-at-4.47.45-PM.jpeg", "publishedAt": "2023-01-10T11:21:25Z", "content": "People with underlying medical illnesses including diabetes, heart problems, hypertension, respiratory diseases, kidney troubles, etc. are even more at risk of contracting Covid.\r\nDiabetes Prevention… [+3302 chars]"}, {"source": {"id": null, "name": "Mid-day"}, "author": null, "title": "Research reveals how obesity increases the chance of dementia - mid-day.com", "description": "The researchers found the overall trend of declining BMI was associated with a higher risk of developing dementia. However, after further exploration, they found a subgroup with a pattern of initial increasing BMI followed by declining BMI, both occurring wit…", "url": "https://www.mid-day.com/lifestyle/health-and-fitness/article/research-reveals-how-obesity-increases-a-chance-of-dementia-23264721", "urlToImage": "https://images.mid-day.com/images/images/2023/jan/Dementia Health Research_d.jpg", "publishedAt": "2023-01-10T11:12:00Z", "content": "The researchers found the overall trend of declining BMI was associated with a higher risk of developing dementia. However, after further exploration, they found a subgroup with a pattern of initial … [+3169 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "New Study Develops Support For Home Cancer Testing - India Education Diary", "description": "Australia has one of the highest rates of bowel cancer in the world, so regular colonoscopies are recommended for people at higher risk.A new study has found that screening for bowel cancer using at-home faecal immunochemical tests could help to redu", "url": "https://indiaeducationdiary.in/new-study-develops-support-for-home-cancer-testing/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2023/01/GettyImages-1352861391.jpg?fit=1024%2C675&ssl=1", "publishedAt": "2023-01-10T10:47:51Z", "content": "Australia has one of the highest rates of bowel cancer in the world, so regular colonoscopies are recommended for people at higher risk.\r\nA new study has found that screening for bowel cancer using a… [+3786 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "MD Marketing", "title": "Cancer Vaccine Breakthrough: Harvard Scientists Develop way to develop to kill Cancer with tumour cells - Medical Dialogues", "description": "Cancer Vaccine Breakthrough: Harvard Scientists Develop way to develop to kill Cancer with tumour...", "url": "https://medicaldialogues.in/photo-stories/cancer-vaccine-breakthrough-harvard-scientists-develop-way-to-develop-to-kill-cancer-with-tumour-cells-200", "urlToImage": "https://medicaldialogues.in/h-upload/2023/01/10/197288-amp-stories-cover.jpg", "publishedAt": "2023-01-10T10:24:09Z", "content": "Cancer Vaccine Breakthrough: Harvard Scientists Develop way to develop to kill Cancer with tumour cells\r\nIn what can be termed as a major breakthrough, Harvard Researchers have developed a way to har… [+1626 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Fish And Foods That Improve Memory And Strengthen The Brain - Nation World News", "description": "Not only should older people strengthen their brains; Studies have proven that exercise and taking care of a healthy diet significantly reduce cognitive", "url": "https://nationworldnews.com/fish-and-foods-that-improve-memory-and-strengthen-the-brain/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2023/01/Fish-and-foods-that-improve-memory-and-strengthen-the-brain.jpeg", "publishedAt": "2023-01-10T09:57:54Z", "content": "Not only should older people strengthen their brains; Studies have proven that exercise and taking care of a healthy diet significantly reduce cognitive abilities and memory in adulthood.\r\nIn theory,… [+2636 chars]"}, {"source": {"id": null, "name": "Kalinga TV"}, "author": "Shraddha Suman", "title": "Warning signs of dementia you should not ignore - Kalinga TV", "description": "Dementia is a term used to describe a group of symptoms affecting memory, thinking and social abilities severely enough to interfere with your daily life. It isn't a specific disease, but several diseases can cause dementia.Though dementia generally", "url": "https://kalingatv.com/health/early-warning-signs-of-dementia-and-symptoms-to-look-out-for/", "urlToImage": "https://kalingatv.com/wp-content/uploads/2023/01/warning-signs-of-dementia.jpg", "publishedAt": "2023-01-10T09:26:48Z", "content": "Dementia is a term used to describe a group of symptoms affecting memory, thinking and social abilities severely enough to interfere with your daily life. It isn’t a specific disease, but several dis… [+5921 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ozempic Crisis: Life-Saving Diabetes Drug Ozempic In Short Supply in Australia - The Project", "description": "Australia’s peak medical body is calling on the government to quarantine supplies of a life-saving diabetes drug which is in dangerously short supply. Celebr...", "url": "https://www.youtube.com/watch?v=d4CzZTdtsMw", "urlToImage": "https://i.ytimg.com/vi/d4CzZTdtsMw/maxresdefault.jpg", "publishedAt": "2023-01-10T07:36:48Z", "content": null}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": "Bhawana Bisht", "title": "Why Late-Stage Cervical Cancer Diagnoses In Older Women Alarming? - SheThePeople", "description": "Globally, cervical cancer is considered to be the fourth most common cancer among women. Over six lakh cases of cervical cancer diagnosis were reported in 2020 alone, and the number has only increased with time. For the undiagnosed, the state is much worse. W…", "url": "https://www.shethepeople.tv/us/women-cervical-cancer-diagnoses/", "urlToImage": "https://www.shethepeople.tv/wp-content/uploads/2016/05/cervical-cancer.jpg", "publishedAt": "2023-01-10T07:02:06Z", "content": "Globally, cervical cancer is considered to be the fourth most common cancer among women. Over six lakh cases of cervical cancer diagnosis were reported in 2020 alone, and the number has only increase… [+4348 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Indranil Biswas", "title": "What is the Code Red Diet? - Sportskeeda", "description": "The Code Red Diet claims to help you lose 10 pounds per month without any meal replacement, shakes, fat loss pills, fat loss foods, or exercise.", "url": "https://www.sportskeeda.com/health-and-fitness/what-code-red-diet", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/4eae7-16733303496009-1920.jpg", "publishedAt": "2023-01-10T06:12:41Z", "content": "The Code Red Diet claims to help you lose 10 pounds per month without any meal replacement, shakes, fat loss pills, fat loss foods, or exercise. It was invented by Cristy Nickel, a popular wellness c… [+4048 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Yash Manchanda", "title": "Sleep Disorders – Common Types, Symptoms, Treatments - Sportskeeda", "description": "Sleep disorders are a category of medical conditions that make it difficult to sleep well on a regular basis.", "url": "https://www.sportskeeda.com/health-and-fitness/sleep-disorders-common-types-symptoms-treatments", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/01/903d2-16732820731776-1920.jpg", "publishedAt": "2023-01-10T03:00:00Z", "content": "Sleep disorders are a category of medical conditions that make it difficult to sleep well on a regular basis. Sleep disorders, whether caused by a medical condition or excessive stress, are becoming … [+4986 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Differences in gut microbiome linked to risk of death in COVID-19 patients with respiratory failure - EurekAlert", "description": "Research published in Nature Communications shows that the composition of gut microbiota and the metabolites they produce can predict the trajectory of respiratory function and death in patients with severe COVID-19. This suggests that the gut microbiome has …", "url": "https://www.eurekalert.org/news-releases/976090", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-10T02:02:32Z", "content": "In early 2020, Bhakti Patel, MD, a pulmonary and critical care specialist at the University of Chicago Medicine, and Matthew Stutz, MD, who was a critical care fellow at the time, had an idea for a r… [+7478 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study suggests that long-COVID is associated with physical inactivity - News-Medical.Net", "description": "In a recent study published in the Scientific Reports journal, researchers in Brazil assessed the association between post-acute sequelae of coronavirus disease 2019 (COVID-19) (PASC) and physical inactivity.", "url": "https://www.news-medical.net/news/20230109/Study-suggests-that-long-COVID-is-associated-with-physical-inactivity.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_735258_16733138724763793.jpg", "publishedAt": "2023-01-10T01:25:00Z", "content": "In a recent study published in the Scientific Reports journal, researchers in Brazil assessed the association between post-acute sequelae of coronavirus disease 2019 (COVID-19) (PASC) and physical in… [+5239 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "High Sodium Levels Linked to Increased Biological Aging, Drinking Enough Water May Help - The Epoch Times", "description": "People have long sought the secret to living a longer and healthier life, and researchers believe they’ve discovered ...", "url": "https://www.theepochtimes.com/health/drinking-water-may-decrease-biological-aging-but-the-amount-matters_4966621.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2023/01/06/woman-drinking-water--1200x800.jpeg", "publishedAt": "2023-01-09T20:10:15Z", "content": "People have long sought the secret to living a longer and healthier life, and researchers believe theyve discovered part of that equation. It could be as simple as drinking enough water.\r\nA new study… [+5358 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Biological characteristics, biosafety prevention and control strategies for the 2022 outbreak of monkeypox - Medical Xpress", "description": "Monkeypox is a zoonotic disease caused by the monkeypox virus (MPXV), which is a potential biological warfare agent of bioterrorism and poses the greatest threat to the world's public biosafety and health after variola virus (VARV). While the coronavirus dise…", "url": "https://medicalxpress.com/news/2023-01-biological-characteristics-biosafety-strategies-outbreak.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/biological-characteris-1.jpg", "publishedAt": "2023-01-09T17:35:23Z", "content": "Monkeypox is a zoonotic disease caused by the monkeypox virus (MPXV), which is a potential biological warfare agent of bioterrorism and poses the greatest threat to the world's public biosafety and h… [+1638 chars]"}, {"source": {"id": null, "name": "Neurologyadvisor.com"}, "author": "Maria Arini Lopez, PT, DPT", "title": "Triglyceride-Glucose Index Scores Predict Recurrent Stroke, Mortality in T2DM - Neurology Advisor", "description": "In a cross-sectional analysis, researchers investigated the association between TyG index and clinical prognosis of acute ischemic stroke in patients with T2DM.", "url": "https://www.neurologyadvisor.com/topics/stroke/triglyceride-glucose-index-scores-predict-recurrent-stroke-mortality-t2dm/", "urlToImage": null, "publishedAt": "2023-01-09T15:47:00Z", "content": "Triglyceride-glucose (TyG) index scores strongly correlated with the incidence of recurrent ischemic stroke and all-cause death in patients with acute ischemic stroke and type 2 diabetes mellitus (T2… [+3676 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers give insights into pathology of new type of dementia, LATE - ANI News", "description": "LATE, also known as limbic predominant age-related TDP-43 encephalopathy, is a recently identified type of dementia that impairs social, cognitive, and memory abilities. LATE is a separate condition with its own risks and causes, albeit it sometimes coexists …", "url": "https://www.aninews.in/news/health/researchers-give-insights-into-pathology-of-new-type-of-dementia-late20230109195136", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109142115.jpg", "publishedAt": "2023-01-09T14:21:00Z", "content": "California [US], January 9 (ANI): LATE, also known as limbic predominant age-related TDP-43 encephalopathy, is a recently identified type of dementia that impairs social, cognitive, and memory abilit… [+2875 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Bat Attacks, Bites Three Siblings in Mexico Village; Two Die of Rabies - LatestLY", "description": "Hospital officials said that though the trio got bitten by the bat on December 1 in their home in the city of Palo de Lima, but it took the family 20 days to go to the nearest health centre.", "url": "https://www.latestly.com/world/bat-attack-bite-three-siblings-in-mexico-village-two-die-of-rabies-4690318.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/01/DE845F30-3E94-430F-9764-1BC1D749337A-784x441.jpeg", "publishedAt": "2023-01-09T12:03:23Z", "content": "Mexico, January 9: In a tragic incident reported from Mexico, two young siblings died just days apart from rabies after being bitten by a bat. The 8-year-old girl died this Saturday and became the se… [+1759 chars]"}, {"source": {"id": null, "name": "Harvard School of Engineering and Applied Sciences"}, "author": null, "title": "Calculating the Success of COVID Booster Shots | Harvard Medical School - Harvard Medical School", "description": "Mathematical model predicts long-term effectiveness in different patient populations", "url": "https://hms.harvard.edu/news/calculating-success-covid-booster-shots", "urlToImage": "https://hms.harvard.edu/sites/default/files/teaser-images/750-COVID-graph-GettyImages-1300827033.jpg", "publishedAt": "2023-01-09T12:00:00Z", "content": "This article is part of Harvard Medical Schools continuing coverage of COVID-19.\r\nResearchers have designed a mathematical model that can predict the course of vaccine-induced immunity against COVID-… [+2077 chars]"}, {"source": {"id": null, "name": "Shethepeople.tv"}, "author": "Rudrani Gupta", "title": "Mental Health And Weight Gain: Why Can’t People Look Beyond My Body? - SheThePeople", "description": "Imagine you came across two people in a public place. One is neatly dressed while the other is smelly and dishevelled. Next to whom would you sit? Most of you would say the neat one because it is a human tendency to choose what looks good. But would you ever…", "url": "https://www.shethepeople.tv/personal-stories/mental-health-and-weight-gain/", "urlToImage": "https://www.shethepeople.tv/wp-content/uploads/2021/04/Mental-health.jpg", "publishedAt": "2023-01-09T11:54:50Z", "content": "Imagine you came across two people in a public place. One is neatly dressed while the other is smelly and dishevelled. Next to whom would you sit? Most of you would say the neat one because it is a h… [+3872 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arthritis Management: Follow These 7 Tips In Winter If You Have Arthritis - NDTV", "description": "Below we list tips that will help you manage arthritis through the winter season.", "url": "https://www.ndtv.com/health/arthritis-follow-these-7-tips-for-winter-if-you-have-arthritis-3668015", "urlToImage": "https://c.ndtvimg.com/2022-10/bgdbifj8_world-arthritis-day-2022_625x300_12_October_22.jpg", "publishedAt": "2023-01-09T11:43:46Z", "content": "The cold weather might worsen arthritis symptoms\r\nThere may be some truth to the urban legend that painful joints might be a sign of a change in weather. Winter weather can be particularly difficult … [+4053 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Crossfire Keto Reviews LEGIT or SCAM Read It First Before Buying - The Tribune India", "description": "Crossfire Keto Capsules are a great way to lose weight. It makes people feel fuller and less hungry. It allows the body to burn fat efficiently without using too much energy.", "url": "https://www.tribuneindia.com/news/brand-connect/crossfire-keto-reviews-legit-or-scam-read-it-first-before-buying-468873", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_452409297.png", "publishedAt": "2023-01-09T10:16:00Z", "content": "Crossfire Keto Capsules are a great way to lose weight. It makes people feel fuller and less hungry. It allows the body to burn fat efficiently without using too much energy.\r\nHow can you lose weight… [+11637 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Lipozene Review 2023: Does Lipozene Work? Read Side Effects, Dosage, Before & After (Update) - The Tribune India", "description": "People often go to great lengths to maintain and improve their health. After all, who wants to suffer through illnesses and diseases? Doctors and experts consider weight to be an important indicator of overall health. There is good evidence that suggests that…", "url": "https://www.tribuneindia.com/news/brand-connect/lipozene-review-2023-does-lipozene-work-read-side-effects-dosage-before-after-update-468865", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_616458848.jpg", "publishedAt": "2023-01-09T10:00:00Z", "content": "Introduction\r\nPeople often go to great lengths to maintain and improve their health. After all, who wants to suffer through illnesses and diseases? Doctors and experts consider weight to be an import… [+16395 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Past brain injury may be linked to an increased risk of FTD: Study - ThePrint", "description": "Kuopio [Finland], January 9 (ANI): According to a study by the University of Eastern Finland, past traumatic brain damage may increase the risk of frontotemporal dementia. Frontotemporal dementia (FTD) is one of the most common causes of dementia in working-a…", "url": "https://theprint.in/health/past-brain-injury-may-be-linked-to-an-increased-risk-of-ftd-study/1305760/", "urlToImage": null, "publishedAt": "2023-01-09T09:15:13Z", "content": "Kuopio [Finland], January 9 (ANI): According to a study by the University of Eastern Finland, past traumatic brain damage may increase the risk of frontotemporal dementia.\r\nFrontotemporal dementia (F… [+1762 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study reveals benefits of eating almonds for people who work out daily - ANI News", "description": "According to a study published in the journal Frontiers in Nutrition', participants of both sexes who ate 57g almonds every day for one month had a greater amount of the beneficial fat 12,13-dihydroxy-9Z-octadecenoic acid (12,13-DiHOME) in their blood immedia…", "url": "https://www.aninews.in/news/health/study-reveals-benefits-of-eating-almonds-for-people-who-work-out-daily20230109144214", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20230109091155.jpg", "publishedAt": "2023-01-09T09:12:00Z", "content": "Los Angeles [US], January 9 (ANI): Eating almonds every day may be the ideal new year's resolution for those who exercise on a regular basis.According to a study published in the journal Frontiers in… [+3821 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Prostate 911 Reviews: PhytAge Labs Prostate Health Supplement Legit or Scam? - Deccan Herald", "description": "Inflamed prostate affects many aging men. The constant urge to pee, the inability to empty the bladder completely, poor sleep quality, and chronic urinary infections are common symptoms of a malfunctioning prostate system. Some men opt for dangerous and expen…", "url": "https://www.deccanherald.com/brandspot/pr-spot/prostate-911-reviews-phytage-labs-prostate-health-supplement-legit-or-scam-1179237.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179237-1673253106.png", "publishedAt": "2023-01-09T08:31:46Z", "content": "Inflamed prostate affects many aging men. The constant urge to pee, the inability to empty the bladder completely, poor sleep quality, and chronic urinary infections are common symptoms of a malfunct… [+10620 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Christina Jackson", "title": "Circadian Clock Proteins Seized by Liver Cancer - Genetic Engineering & Biotechnology News", "description": "A direct link between circadian clock proteins to liver cancer uncovered.", "url": "https://www.genengnews.com/topics/cancer/circadian-clock-proteins-seized-by-liver-cancer/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2023/01/Jan_1_2023_PNAS_HCC_clockliver.jpg", "publishedAt": "2023-01-09T08:00:32Z", "content": "Hepatocellular carcinoma (HCC) is the third leading cause of cancer-related deaths globally. While chemotherapy, surgery, and liver transplants have helped some patients, targeted treatments for HCC … [+4011 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Awareness of COPD and Its Risk Factors Among the Adult Population of t | COPD - Dove Medical Press", "description": "Awareness of COPD and Its Risk Factors Among the Adult Population of the Aseer Region, Saudi Arabia", "url": "https://www.dovepress.com/awareness-of-copd-and-its-risk-factors-among-the-adult-population-of-t-peer-reviewed-fulltext-article-COPD", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2023-01-09T07:07:48Z", "content": "Introduction\r\nChronic obstructive pulmonary disease (COPD) is generally characterized by the presence of chronic bronchitis or emphysema that can lead to airway obstruction.1 It is a disease of the a… [+34507 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Swelling in Joint Could be a Sign of Arthritis: Advice by 10 Best Orthopedics - Deccan Herald", "description": "New Delhi (India), January 07: Dr. Karun Jain, MBBS, D'Ortho, MS (Ortho), MCh Ortho (UK), Senior Orthopedic, Sports Injury & Joint Replacement Surgeon, Pushpanjali Medical Centre & Shri Mahaveer Ortho Clinic, Delhi", "url": "https://www.deccanherald.com/brandspot/pr-spot/swelling-in-joint-could-be-a-sign-of-arthritis-advice-by-10-best-orthopedics-1179207.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/p2-1179207-1673241357.png", "publishedAt": "2023-01-09T05:15:57Z", "content": "New Delhi (India), January 07: Dr. Karun Jain, MBBS, D'Ortho, MS (Ortho), MCh Ortho (UK), Senior Orthopedic, Sports Injury &amp; Joint Replacement Surgeon, Pushpanjali Medical Centre &amp; Shri Mahav… [+9311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Rajesh Parikh", "title": "Why prevention remains the best strategy against BF.7, other variants - The Indian Express", "description": "Unfortunately, the virus has so far always been a step ahead of us. So we cannot be certain of what it will do next and when. We should always be prepared for the worst case scenario while hoping for the best.", "url": "https://indianexpress.com/article/explained/explained-health/why-prevention-remains-the-best-strategy-against-bf-7-other-variants-coronavirus-8369231/", "urlToImage": "https://images.indianexpress.com/2023/01/testing-1.jpg", "publishedAt": "2023-01-09T01:00:23Z", "content": "Given that the BF.7 variant that is dominant in China has greater immune escape potential and a shorter incubation period, the Indian government has made testing mandatory for travellers from certain… [+5471 chars]"}]}