{"status": "ok", "totalResults": 61, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Verify | The oral polio vaccine given in 1950's is still effective - WHAS11", "description": "For years, global health officials have used billions of drops of a vaccine to wipe out polio in countries that regularly have cases.For more Verify content ...", "url": "https://www.youtube.com/watch?v=xPdEnIb6KjE", "urlToImage": "https://i.ytimg.com/vi/xPdEnIb6KjE/hqdefault.jpg", "publishedAt": "2022-08-22T22:01:48Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Decrease Your Risk of Cognitive Decline and Dementia – Avoid These 8 Controllable Risk Factors - SciTechDaily", "description": "A new study finds that dementia risk might be more determined by lifestyle rather than age. According to recent Baycrest research, adults without dementia risk factors like smoking, diabetes, or hearing loss had brain health comparable to that of those who ar…", "url": "https://scitechdaily.com/decrease-your-risk-of-cognitive-decline-and-dementia-avoid-these-8-controllable-risk-factors/", "urlToImage": "https://scitechdaily.com/images/Exploding-Brain-Dementia-Concept.jpg", "publishedAt": "2022-08-22T20:38:12Z", "content": "ByBaycrest Centre for Geriatric CareAugust 22, 2022\r\nThe study found that each of the risk factors led to a decrease in cognitive performance of up to three years.\r\nA new study finds that dementia ri… [+3986 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Covid-affected children too at risk of neurological, psychiatric disorders - Daily Pioneer", "description": "It’s not that coronavirus has affected just the mental health of adults across nations in the long term. Covid survivor children too are at an increased risk of neurological and psychiatric conditions such as cognitive deficit, insomnia, ischaemic stroke, ner…", "url": "https://www.dailypioneer.com/2022/india/covid-affected-children-too-at-risk-of-neurological--psychiatric-disorders.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-08-22T18:32:56Z", "content": "Its not that coronavirus has affected just the mental health of adults across nations in the long term. Covid survivor children too are at an increased risk of neurological and psychiatric conditions… [+1944 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Dr. Catherine Schuster-Bruce", "title": "What is your risk of catching monkeypox in public? We asked 7 experts to rate different activities, from gym w - Business Insider India", "description": "Seven experts estimated the risk of catching monkeypox in certain settings, from the gym to concerts.Generally, the risk of catching monkeypox for the average", "url": "https://www.businessinsider.in/science/health/news/what-is-your-risk-of-catching-monkeypox-in-public-we-asked-7-experts-to-rate-different-activities-from-gym-workouts-to-dance-parties/articleshow/93716759.cms", "urlToImage": "https://www.businessinsider.in/photo/93716759/what-is-your-risk-of-catching-monkeypox-in-public-we-asked-7-experts-to-rate-different-activities-from-gym-workouts-to-dance-parties.jpg?imgsize=467204", "publishedAt": "2022-08-22T17:58:00Z", "content": "As monkeypox continues to spread at an unprecedented rate in the US, researchers have been racing to work out exactly how the virus is transmitted, and if it's different from what we previously thoug… [+4759 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Study reveals how mosquitoes possess bizarre sense of smell - DNA India", "description": "According to a recent study, the unconventional way mosquitoes analyse odours may help explain why they are so good at finding humans to bite. The findings of the study were published in the journal Cell. If you've ever sprayed yourself head to toe in bug rep…", "url": "https://www.dnaindia.com/india/video-study-reveals-how-mosquitoes-possess-bizarre-sense-of-smell-2978648", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/22/2532232-2200000003.jpg", "publishedAt": "2022-08-22T17:13:23Z", "content": null}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Will Rising Monkeypox Cases Lead to HIV? Can The Virus Spread From Humans to Dogs? Top ICMR Scientist Answers - India.com", "description": "According to a recent study in The Lancet, the Monkeypox virus may spread from humans to dogs, Dr Pragya Yadav, a senior scientist at ICMR-NIV, Pune said.", "url": "https://www.india.com/health/will-rising-monkeypox-cases-lead-to-hiv-can-monkeypox-virus-spread-from-humans-to-dogs-top-icmr-scientist-answers-faqs-5587527/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/Collage-Maker-03-Aug-2022-11.56-AM-1.jpg", "publishedAt": "2022-08-22T16:34:53Z", "content": "New Delhi: The rising Monkeypox cases have raised the concerns of other sexually trasmitted diseases, with HIV being the top fear. A top scientist of the Indian Council of Medical Research-National I… [+2247 chars]"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Deep brain stimulation shows efficacy for treatment-resistant depression - Healio", "description": "Deep brain stimulation to the superolateral branch of the medial forebrain bundle was an efficacious therapy for those with treatment-resistant depression, researchers reported in Molecular Psychiatry. \n      Christopher R. Conner, MD, PhD, a neurosurgery fel…", "url": "https://www.healio.com/news/psychiatry/20220822/deep-brain-stimulation-shows-efficacy-for-treatmentresistant-depression", "urlToImage": "https://www.healio.com/~/media/slack-news/psychiatry/misc/other/brain-3d_shutterstock.jpg", "publishedAt": "2022-08-22T16:28:25Z", "content": "Deep brain stimulation to the superolateral branch of the medial forebrain bundle was an efficacious therapy for those with treatment-resistant depression, researchers reported in Molecular Psychiatr… [+2170 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "Sudden rise in Dengue cases in India, what are numbers in different states? | Zee News - Zee News", "description": "Increase in Dengue cases among several parts of India. Every year, the monsoon is one weather that gives rise to a number of vector-borne diseases. The primary way that the viral illness is spread to humans is through a mosquito bite. Watch video on Zee News", "url": "https://zeenews.india.com/video/news/sudden-rise-in-dengue-cases-in-india-what-are-numbers-in-different-states-2500367.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/22/00000003_43.jpg", "publishedAt": "2022-08-22T16:10:01Z", "content": "Increase in Dengue cases among several parts of India. Every year, the monsoon is one weather that gives rise to a number of vector-borne diseases. The primary way that the viral illness is spread to… [+34 chars]"}, {"source": {"id": null, "name": "Healthpolicy-watch.news"}, "author": "https://www.facebook.com/HealthPolicyWatch", "title": "Open Access 240 Compound Collection Launched In Fight Against Infectious And Mosquito-Borne Illnesses For World Mosquito Day - Health Policy Watch", "description": "To mark World Mosquito Day, 20 August, the Global Health Priority Box has been launched to provide free access to 240 compounds to stimulate research into new", "url": "https://healthpolicy-watch.news/open-access-compound-world-mosquito-day/", "urlToImage": "https://i0.wp.com/healthpolicy-watch.news/wp-content/uploads/2022/03/7921286872_ab54d61d33_o.jpg", "publishedAt": "2022-08-22T16:05:53Z", "content": "Aedes aegypti mosquito can spread Zika fever, dengue, and other diseases.\r\nTo mark World Mosquito Day, 20 August, the Global Health Priority Box has been launched to provide free access to 240 compou… [+3610 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Antibiotic resistance? Scientists looking to weaponise our immune systems to kill superbugs, bacteria - Times Now", "description": "Mankind's hopes of victory over microbes rode into rough weather due to the mutations within various microbe genera that allowed it to develop antibiotic resistance. One can keep finding newer, more potent drugs and the microbes find more ways to subvert them…", "url": "https://www.timesnownews.com/health/antibiotic-resistance-scientists-looking-to-weaponise-our-immune-systems-to-kill-superbugs-bacteria-article-93714967", "urlToImage": "https://static.tnn.in/thumb/msid-93714967,imgsize-100,width-1280,height-720,resizemode-75/93714967.jpg", "publishedAt": "2022-08-22T15:44:49Z", "content": "FIR against water meter readers, private companies indulging in corrupt practices: Saurabh Bhardwaj tells DJB officials"}, {"source": {"id": null, "name": "Medscape"}, "author": "Marlene Busko", "title": "Blood Pressure TTR Predicts Cardiovascular Outcomes in Diabetes - Medscape", "description": "In patients with type 2 diabetes and hypertension,\ttime in target range for systolic blood pressure may be useful to assess blood pressure control and guide treatment to reduce cardiovascular risk.", "url": "https://www.medscape.com/viewarticle/979553", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_220817_measuring_blood_pressure_800x450.jpg", "publishedAt": "2022-08-22T15:42:28Z", "content": "A 1-unit standard deviation increase in TTR was associated with decreased risks of the primary outcome (hazard ratio [HR], 0.83; P = .0026), all-cause mortality (HR, 0.83; P = .018), cardiovascular d… [+352 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | UK to Use Lower Dose of Monkeypox Vaccine to Stretch Supply - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   British health authorities will begin offering eligible people just a fraction of the normal monkeypox vaccine dose to stretch supplies by about five times, in line with similar decisions to extend avail…", "url": "https://www.latestly.com/agency-news/world-news-uk-to-use-lower-dose-of-monkeypox-vaccine-to-stretch-supply-4112187.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "publishedAt": "2022-08-22T15:30:11Z", "content": "London, Aug 22 (AP) British health authorities will begin offering eligible people just a fraction of the normal monkeypox vaccine dose to stretch supplies by about five times, in line with similar d… [+2616 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "Researchers at IIT Bombay and AIIMS make breakthrough discovery in Klebsiella bacteria - EdexLive", "description": "A dangerous bacteria called Klebsiella pneumoniae is a major cause of hospital-acquired infection", "url": "https://www.edexlive.com/news/2022/aug/22/researchers-at-iit-bombay-and-aiims-make-breakthrough-discovery-in-klebsiella-bacteria-30644.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2022/8/22/w600X390/Copy_of_Copy_of_Red_and_Pink_Strong_and_Bold_Earthquake_Crisis_Hub_Twitter_Post.png", "publishedAt": "2022-08-22T15:17:00Z", "content": "What is Klebsiella pneumoniae? And how dangerous is it? Researchers at the Indian Institute of Technology Bombay (IIT-B) and All India Institute of Medical Sciences (AIIMS) have been studying this ba… [+2147 chars]"}, {"source": {"id": null, "name": "Easterneye.biz"}, "author": null, "title": "Tingling, prickling feet? A doctor explains when you should head to the hospital - EasternEye - Eastern Eye", "description": "‘Pins and needles,’ (paresthesia) is an uncomfortable sensation of tingling, prickling, itching, or crawling of skin – usually felt in… Continue reading Tingling, prickling feet? A doctor explains when you should head to the hospital", "url": "https://www.easterneye.biz/tingling-prickling-feet-a-doctor-explains-when-you-should-head-to-the-hospital/", "urlToImage": "https://www.easterneye.biz/wp-content/uploads/2022/08/iStock-157586048-scaled.jpg", "publishedAt": "2022-08-22T15:11:00Z", "content": "Many people don’t initially recognise that their symptoms could be deadly.\r\niStock\r\nBy: \r\n Kimberly Rodrigues\r\nPins and needles, (paresthesia) is an uncomfortable sensation of tingling, prickling, it… [+4938 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "High NLR with diabetes predicts poor prognosis in CAD patients undergoing PCI: Study - Medical Dialogues", "description": "China: Type 2 diabetes presence with elevated neutrophil to lymphocyte ratio (NLR) may worsen...", "url": "https://medicaldialogues.in/diabetes-endocrinology/news/high-nlr-with-diabetes-predicts-poor-prognosis-in-cad-patients-undergoing-pci-study-97842", "urlToImage": "https://medicaldialogues.in/h-upload/2022/01/07/167722-pci-procedure.jpg", "publishedAt": "2022-08-22T14:30:34Z", "content": "China: Type 2 diabetes presence with elevated neutrophil to lymphocyte ratio (NLR) may worsen clinical outcomes in coronary artery disease (CAD) patients undergoing percutaneous coronary intervention… [+2792 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Smart contact lenses may screen and diagnose cancer - Medical Dialogues", "description": "Scientists from the Terasaki Institute for Biomedical Innovation (TIBI) have developed a contact...", "url": "https://medicaldialogues.in/oncology/news/smart-contact-lenses-may-screen-and-diagnose-cancer-97852", "urlToImage": "https://medicaldialogues.in/h-upload/2022/08/13/183180-contact-lens.jpg", "publishedAt": "2022-08-22T14:30:05Z", "content": "Scientists from the Terasaki Institute for Biomedical Innovation (TIBI) have developed a contact lens that can capture and detect exosomes, nanometer-sized vesicles found in bodily secretions which h… [+4251 chars]"}, {"source": {"id": null, "name": "Mumbailive.com"}, "author": null, "title": "Joint Pain on The Rise In Young Adults: Doctors - Mumbai Live", "description": "Joint pain is not just limited to older people anymore There is a rise in joint pain among young adults including those who have recovered from COVID 19 A large number of youngsters are complaining of bone and joint problems It is imperative to take care of y…", "url": "https://www.mumbailive.com/en/health/joint-pain-on-the-rise-in-young-adults-reveals-doctors-74844", "urlToImage": "https://www.mumbailive.com/images/media/images/joint_pain_1661169254290.jpg?bg=d9dad5&crop=275%2C154.38596491228068%2C0%2Cnull&fit=crop&fitToScale=w%2C1368%2C768&fm=webp&h=606.3157894736842&height=183&w=1080&width=275", "publishedAt": "2022-08-22T14:00:00Z", "content": "Joint pain is not just limited to older people anymore. There is a rise in joint pain among young adults, including those who have recovered from COVID-19. A large number of youngsters are complainin… [+2278 chars]"}, {"source": {"id": null, "name": "Thecardiologyadvisor.com"}, "author": "Emily Estrada", "title": "Dapagliflozin Linked to Consistent Reductions in CV and Kidney Outcomes in T2D - The Cardiology Advisor", "description": "A study was conducted to determine the efficacy and safety of dapagliflozin when taken with CV medications in patients with type 2 diabetes and HF, kidney disease, or both.", "url": "https://www.thecardiologyadvisor.com/home/topics/metabolic/dapagliflozin-linked-to-consistent-reductions-in-cv-and-kidney-outcomes-in-t2d/", "urlToImage": "https://www.thecardiologyadvisor.com/wp-content/uploads/sites/17/2022/08/white-pills_G_1333433193.jpg", "publishedAt": "2022-08-22T13:56:00Z", "content": "Treatment with the sodium-glucose cotransporter 2 (SGLT2) inhibitor dapagliflozin has demonstrated consistent reductions in risk for cardiovascular (CV) death/ hospitalization for heart failure (HF) … [+4325 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "DR Congo confirms new case of Ebola linked to 2018 outbreak - Al Jazeera English", "description": "Since 1976, the Democratic Republic of Congo has recorded 14 outbreaks of Ebola.", "url": "https://www.aljazeera.com/news/2022/8/22/dr-congo-confirms-new-case-of-ebola-linked-to-2018-outbreak", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/01/WEB-MAP-DRCONGO-BENI.jpg?resize=1200%2C675", "publishedAt": "2022-08-22T13:39:45Z", "content": "A new case of Ebola virus infection has been confirmed in the city of Beni in eastern Democratic Republic of Congo, according to the countrys National Institute for Biomedical Research.\r\nThe announce… [+689 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists begin phase 2 clinical trials of lupus pill - News-Medical.Net", "description": "Lupus is an autoimmune disease that attacks organs and can be fatal. There's no cure, so current treatments aim to limit damage and ameliorate symptoms.", "url": "https://www.news-medical.net/news/20220822/Scientists-begin-phase-2-clinical-trials-of-lupus-pill.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/5/3d_rendered_illustration_-_molecules-Sebastian_Kaulitzki-2000_3f4ba59f12944a08a08f3d596bed291c-620x480.jpg", "publishedAt": "2022-08-22T13:31:00Z", "content": "Lupus is an autoimmune disease that attacks organs and can be fatal. There's no cure, so current treatments aim to limit damage and ameliorate symptoms. Some of these therapies have to be injected, s… [+5132 chars]"}, {"source": {"id": null, "name": "Apdirect.in"}, "author": null, "title": "Wastewater surveillance advocated for COVID tracking - ApDirect", "description": "More civic bodies keen to participate in the process as it is efficient and inexpensive, says Rakesh Mishra", "url": "https://apdirect.in/wastewater-surveillance-advocated-for-covid-tracking-249882.html", "urlToImage": "https://th-i.thgim.com/public/incoming/n75x6y/article65797780.ece/alternates/LANDSCAPE_615/IMG_IMG_HY21RAKESH_MISHR_1_1_QSA3MUHO.jpg", "publishedAt": "2022-08-22T13:18:14Z", "content": "More municipal corporations across the country are now willing to participate in the wastewater surveillance of identifying COVID prevalence in the population and variants in circulation as it has pr… [+3264 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "COVID-19 mRNA Vaccines Associated with a Decreased Risk of Death in Patients with Heart Failure, Reports New Study - The Weather Channel", "description": "Among 101,786 heart failure patients, the researchers found that receiving an mRNA vaccine was not associated with an increased risk of worsening heart failure. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-08-22-covid-mrna-vaccines-associated-with-lower-risk-of-death", "urlToImage": "https://s.w-x.co/in-vaccine_29.jpg", "publishedAt": "2022-08-22T12:42:18Z", "content": "A study, presented at ESC Congress 2022, found that the vaccines were not associated with an increased risk of worsening heart failure, venous thromboembolism or myocarditis in heart failure patients… [+1823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Can lack of sleep put you at a greater risk for diabetes? - The Indian Express", "description": "“Lack of sleep causes stress in the body which leads to increased secretion of the cortisol hormone, also known as the stress hormone. An increase in cortisol levels contributes to increased blood sugar levels,” Dr Narendra explained", "url": "https://indianexpress.com/article/lifestyle/health/lack-of-sleep-deprivation-diabetes-sleeping-disorders-8099974/", "urlToImage": "https://images.indianexpress.com/2022/08/diabetes_1200_getty-1.jpg", "publishedAt": "2022-08-22T12:00:23Z", "content": "Sleep deprivation a condition of not getting adequate duration and/or quality of sleep — has been linked to a host of health ailments, both mild and severe. According to a study published in the Nati… [+5517 chars]"}, {"source": {"id": null, "name": "Elle.in"}, "author": null, "title": "Are PCOD And PCOS The Same? Experts Weigh In - ELLE India", "description": "Are PCOD and PCOS the same? We got in touch with two experts to understand the differences between PCOD and PCOS and bust some myths.", "url": "https://elle.in/pcod-and-pcos-difference/", "urlToImage": "https://elle.in/wp-content/uploads/2022/08/Untitled-design-2022-08-10T170918.944.png", "publishedAt": "2022-08-22T11:51:13Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Coronavirus: Older Adults And The Mental Health Effects of COVID-19 - NDTV Doctor", "description": "Covid-19: In this article, we discuss the psychological effects of coronavirus on senior citizens.", "url": "https://doctor.ndtv.com/emotions/coronavirus-older-adults-and-the-mental-health-effects-of-covid-19-3275740", "urlToImage": "https://c.ndtvimg.com/2020-10/cm65a2lk_yoga-generic-senior-citizens-exercise-generic-istock-photo_625x300_16_October_20.jpg", "publishedAt": "2022-08-22T11:45:19Z", "content": "The last two years have not only been difficult; many people have lost loved ones. The coronavirus outbreaks that swept across India and the world had the greatest impact on the elderly and those wit… [+5515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Does Monkeypox Spread?: Health Ministry's \"Know How\" Video - NDTV", "description": "There has been a growing call for swift action action to stop the spread of of monkeypox since the World Health Organisation declared it a global health emergency last month.", "url": "https://www.ndtv.com/india-news/how-does-monkeypox-spread-health-ministrys-know-how-video-3275655", "urlToImage": "https://c.ndtvimg.com/2022-07/pousd8n_monkeypox-india-afp-650_625x300_26_July_22.jpg", "publishedAt": "2022-08-22T11:38:53Z", "content": "Monkeypox is transmitted when an individual has prolonged contact with an infected person\r\nThere has been a growing call for swift action action to stop the spread of of monkeypox since the World Hea… [+2129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Cancer deaths related to behavioral risk factors, study says - The Indian Express", "description": "Researchers found 34 risk factors, with smoking, drinking and obesity taking the lead. Smoking alone was responsible for some 33.9% of cancer cases", "url": "https://indianexpress.com/article/lifestyle/health/cancer-deaths-related-to-behavioral-risk-factors-study-says-8104379/", "urlToImage": "https://images.indianexpress.com/2022/08/pexels-ave-calvar-martinez-5072316.jpg", "publishedAt": "2022-08-22T11:00:39Z", "content": "Cancer deaths could be prevented by controlling risk factors such as tobacco consumption, alcohol consumption, and high BMI, a new study by the British journal Lancet has concluded.Buy Now | Our best… [+1526 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is the prevalence of bacterial co-infections during COVID-19? - News-Medical.Net", "description": "Researchers evaluated the characteristics and prevalence of bacterial co-infections with the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) infections.", "url": "https://www.news-medical.net/news/20220822/What-is-the-prevalence-of-bacterial-co-infections-during-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_722926_16611632963032177.jpg", "publishedAt": "2022-08-22T10:24:00Z", "content": "In a recent paper posted to the medRxiv* preprint server, researchers evaluated the characteristics and prevalence of bacterial co-infections with severe acute respiratory syndrome coronavirus 2 (SAR… [+5357 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Dietary allergies can be reversed in mice by targeting microbiome: Study - ThePrint", "description": "Washington [US], August 22 (ANI): According to a study, several people with dietary allergies have minimal symptoms when they are exposed to triggering foods, others have potentially catastrophic effects. Butyrate, a bacterial chemical produced by healthy mic…", "url": "https://theprint.in/features/dietary-allergies-can-be-reversed-in-mice-by-targeting-microbiome-study/1094167/", "urlToImage": null, "publishedAt": "2022-08-22T10:13:59Z", "content": "Washington [US], August 22 (ANI): According to a study, several people with dietary allergies have minimal symptoms when they are exposed to triggering foods, others have potentially catastrophic eff… [+4223 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "Monkeypox Can Linger On Common Household Items: CDC - odishabytes - OdishaBytes", "description": "New Delhi: Even though two monkeypox patients sharing a home said they disinfected surfaces, washed their hands several times a day and showered regularly, researchers found the virus on 70% of high-contact areas 20 days after their symptoms began, including …", "url": "https://odishabytes.com/monkeypox-can-linger-on-common-household-items-cdc/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2022/07/monkeypox1658480459816.jpeg", "publishedAt": "2022-08-22T10:07:29Z", "content": "New Delhi: Even though two monkeypox patients sharing a home said they disinfected surfaces, washed their hands several times a day and showered regularly, researchers found the virus on 70% of high-… [+1512 chars]"}, {"source": {"id": null, "name": "Vnexpress.net"}, "author": "Le Nga", "title": "Vietnam to monitor entrants from monkeypox areas for 21 days - VnExpress International", "description": "People entering Vietnam from areas with monkeypox outbreaks will be monitored and suspected carriers quarantined, the health ministry said Monday.", "url": "https://e.vnexpress.net/news/news/vietnam-to-monitor-entrants-with-monkeypox-risks-for-21-days-4502554.html", "urlToImage": "https://vcdn-english.vnecdn.net/2022/08/22/z3ht6g4pbfm7jjwkprv2ovjiwy1652-6966-1451-1661159535_1200x0.jpg", "publishedAt": "2022-08-22T09:41:22Z", "content": "Risk factors include making contact with people infected or suspected to be infected with monkeypox, or having had sexual intercourse with multiple partners, within 21 days before the first symptoms … [+1617 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health-Care Workers In India Prepare For Monkeypox Spread - IndianExpressOnline", "description": "Cases of monkeypox have been reported by 90 countries so far. While the virus does not spread as easily as SARS-CoV-2, governments are concerned. India has s...", "url": "https://www.youtube.com/watch?v=OqWfjRsvB2k", "urlToImage": "https://i.ytimg.com/vi/OqWfjRsvB2k/hqdefault.jpg", "publishedAt": "2022-08-22T09:30:07Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Rare type of liver cancer found in mice: Study - Hindustan Times", "description": "The German-Israeli team discovered that precursors of degenerate liver cells are where cHCC/CCA develops. Hepatocellular carcinoma, on the other hand, most likely results from damaged mature liver cells.", "url": "https://www.hindustantimes.com/science/rare-type-of-liver-cancer-found-in-mice-study-101661159048236.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/22/1600x900/32091e86-5d7f-11ec-a699-ff3e8015d447_1639556299511_1661159248981_1661159248981.jpg", "publishedAt": "2022-08-22T09:09:40Z", "content": "Researchers from the German Cancer Research Center (Deutsches Krebsforschungszentrum, DKFZ) and the Hebrew University in Jerusalem have discovered the cell of origin of mixed liver/biliary duct carci… [+3135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Here's how smoking harms the heart, clots blood and causes brain strokes - The Indian Express", "description": "Stopping tobacco consumption halves cardiovascular risk within a year and practically nullifies it by the third year. Deferring the decision to stop can be fatal, as a sudden cardiac death can strike without warning, says cardiologist K. Srinath Reddy﻿", "url": "https://indianexpress.com/article/lifestyle/health-specials/how-smoking-harms-heart-clots-blood-brain-strokes-8104668/", "urlToImage": "https://images.indianexpress.com/2022/08/no-smoking-1200.jpg", "publishedAt": "2022-08-22T09:02:00Z", "content": "A recent publication in the medical journal Lancet reported that 44.4 per cent of global cancer deaths are attributable to three risk factors smoking, excessive alcohol consumption and a high body ma… [+6760 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Inflammation Triggered by Injury or Illness: When Recovery Goes Awry - SciTechDaily", "description": "New research findings reveal how recovery progresses following inflammation triggered by injury or illness. New findings offer insight into recovery after inflammation caused by a wide range of injuries or acute illnesses. Scientists defined common healthy tr…", "url": "https://scitechdaily.com/inflammation-triggered-by-injury-or-illness-when-recovery-goes-awry/", "urlToImage": "https://scitechdaily.com/images/Blood-in-Patient-With-Inflammation.jpg", "publishedAt": "2022-08-22T09:00:49Z", "content": "ByHarvard Medical SchoolAugust 22, 2022\r\nA new study provides critical clues on what differentiates a good inflammatory recovery from a bad one.\r\nNew research findings reveal how recovery progresses … [+11919 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Know how poor muscle health impacts your immunity - Zee News", "description": "Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune system even more so to prevent minor infections from turning into more …", "url": "https://zeenews.india.com/health/know-how-poor-muscle-health-impacts-your-immunity-2500156", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/08/22/1080662-exercise.png", "publishedAt": "2022-08-22T08:37:05Z", "content": "New Delhi: Building and maintaining a robust immune system is important for leading healthy, wholesome lives, and this is true now more than ever. People with chronic illnesses need a healthy immune … [+3701 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Curious About Lifestyle Diseases? Here’s How You Can Combat Them - News18", "description": "These tips and tricks will help you avoid and curb lifestyle-related health issues, note them down and thank us later.", "url": "https://www.news18.com/news/lifestyle/curious-about-lifestyle-diseases-heres-how-you-can-combat-them-5791465.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/untitled-design-2022-08-22t132849.313-166115533216x9.png", "publishedAt": "2022-08-22T08:02:33Z", "content": "Spending long hours at the desk, less physical activity, stress, smoking and a host of other concerning lifestyle habits have become the new norm. These concerns are grouped together among a cluster … [+1997 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Janvi Kapur", "title": "6 Ways to Balance Your Physical and Mental Health - Sportskeeda", "description": "Your mental health has a physical element, too. Although the mind and body are often viewed as being separate, their wellness is closely related.", "url": "https://www.sportskeeda.com/health-and-fitness/ways-balance-mental-health-physical-health", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/08/7320b-16610043996292-1920.jpg", "publishedAt": "2022-08-22T08:02:32Z", "content": "Your mental health has a physical element, too. Although the mind and body are often viewed as being separate, their wellness is closely related. Good mental health can positively affect your physica… [+4959 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "WHO shares simple tips to reduce risk of diabetes, heart disease | Mint - Mint", "description": "As per WHO, noncommunicable diseases (NCDs), including heart disease, stroke, cancer, diabetes and chronic lung disease, are collectively responsible for almost 70 percent of all deaths worldwide.", "url": "https://www.livemint.com/science/health/who-shares-simple-tips-to-reduce-risk-of-diabetes-heart-disease-11661150931384.html", "urlToImage": "https://images.livemint.com/img/2022/08/22/600x338/HEALTH-EBOLA-WHO-0_1661154301616_1661154301616_1661154320065_1661154320065.JPG", "publishedAt": "2022-08-22T07:46:47Z", "content": "The World Health Organization (WHO) in the Western Pacific Region has shared four health tips to protect against noncommunicable diseases (NCDs) such as diabetes, heart disease, stroke and cancer. Th… [+2767 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Mudra Saini", "title": "Monday Mind Talks: Know about Post-traumatic stress disorder and strategies to cope with PTSD anxiety - PINKVILLA", "description": "Dr Satish Kumar CR, Consultant - Clinical Psychology, Manipal Hospital Old Airport Road is here today to provide insight on this disturbing disorder while suggesting effective strategies to cope with this anxiety", "url": "https://www.pinkvilla.com/lifestyle/health-fitness/monday-mind-talks-know-about-post-traumatic-stress-disorder-and-strategies-cope-ptsd-anxiety-1180267", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/social_15_3.jpg?itok=ABMaxlDp", "publishedAt": "2022-08-22T06:57:04Z", "content": "PTSD (Post Traumatic Stress Disorder) is a disorder that is defined as the failure to recuperate after witnessing a distressing event. The condition can stay for months or can even last for years. Th… [+2690 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Philippa Martyr", "title": "Five Drugs That Changed the World (and What Went Wrong) - The Wire Science", "description": "Each of these five drugs have brought some incredible benefits. But they’ve usually also come with a legacy of complications.", "url": "https://science.thewire.in/health/five-drugs-that-changed-the-world-and-what-went-wrong/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/08/22122057/jan-antonin-kolar-KERVbxLVLiY-unsplash.jpg", "publishedAt": "2022-08-22T06:54:39Z", "content": "Photo: Jan Antonin Kolar/Unsplash\r\nIts hard to measure the impact of any one drug on world history. But here are five drugs we can safely say made a huge difference to our lives, often in ways we did… [+5813 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "WHO", "title": "WHO publishes first guideline for Ebola disease therapeutics - Devdiscourse", "description": "“We have seen incredible advances in both the quality and safety of clinical care during Ebola outbreaks,” said Dr Janet Diaz, lead of the clinical management unit in WHO’s Health Emergencies programme.", "url": "https://www.devdiscourse.com/article/health/2151358-who-publishes-first-guideline-for-ebola-disease-therapeutics", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/17_03_2021_17_22_30_747099.jpg?width=920&format=jpeg", "publishedAt": "2022-08-22T05:46:39Z", "content": "The World Health Organization (WHO) has published its first guideline for Ebola virus disease therapeutics, with new strong recommendations for the use of two monoclonal antibodies. WHO calls on the … [+5067 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Sugar substitutes impact gut microbiome - The Siasat Daily", "description": "Non-nutritive sweeteners have made the claim that they can provide all the sweetness of sugar without any calories since the late 1800s.", "url": "https://www.siasat.com/sugar-substitutes-impact-gut-microbiome-2395374/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/08/avav.jpg", "publishedAt": "2022-08-22T05:36:00Z", "content": "Weizmann: Non-nutritive sweeteners have made the claim that they can provide all the sweetness of sugar without any calories since the late 1800s. Researchers who published their findings in the jour… [+3503 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Sri Lanka reports nearly 50,000 dengue cases in 2022 - ETHealthWorld", "description": "According to the National Dengue Control Unit (NDCU), 49,941 people have been admitted to hospitals for dengue treatment in the past eight months. Half the cases were reported from the Western province, comprising Colombo, Gampaha and Kalutara districts, Xinh…", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/sri-lanka-reports-nearly-50000-dengue-cases-in-2022/93693916", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-93693916,imgsize-179546,width-1200,height-628,overlay-ethealthworld/sri-lanka-reports-nearly-50-000-dengue-cases-in-2022.jpg", "publishedAt": "2022-08-22T04:50:00Z", "content": "Colombo: Sri Lanka reported nearly 50,000 cases of dengue in the first eight months of 2022, local media reported.According to the National Dengue Control Unit (NDCU), 49,941 people have been admitte… [+787 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Healthy Breakfast Ideas: 5 Nutritionist-Recommended Food Tips To Kick-Start The Day - NDTV Food", "description": "\"The right breakfast can do both - meet your nutritional needs and keep your energy levels high,\" states nutritionist Anjali Mukherjee.", "url": "https://food.ndtv.com/food-drinks/healthy-breakfast-ideas-5-nutritionist-recommended-food-tips-to-kick-start-the-day-3274448", "urlToImage": "https://i.ndtvimg.com/i/2017-06/fruit-bowl-620x350_620x350_81498544158.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-08-22T04:35:01Z", "content": "By now, we all know how important it is to have a wholesome breakfast. A fulfilling meal in the morning, loaded with every essential nutrient, helps refuel us and kick-start the day. Besides, a whole… [+3375 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Early Blood Tests Can Predict Death From Traumatic Brain Injury: Study - News18", "description": "Blood tests taken on the day of a traumatic brain injury (TBI) can predict which patients are likely to die or survive with severe disability, allowing clinicians to make decisions earlier on the possible treatment of TBI, says a new study.", "url": "https://www.news18.com/news/buzz/early-blood-tests-can-predict-death-from-traumatic-brain-injury-study-5796247.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/blood-test-166114007616x9.png", "publishedAt": "2022-08-22T03:49:34Z", "content": "Blood tests taken on the day of a traumatic brain injury (TBI) can predict which patients are likely to die or survive with severe disability, allowing clinicians to make decisions earlier on the pos… [+1460 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "Meat, Fish Or Vegetables: This Is The Diet With The Highest Risk Of Hip Fracture - Nation World News", "description": "Research from the University of Leeds in the United Kingdom, published in the journal BMC Medicinehas examined the risk of hip fracture in occasional meat", "url": "https://nationworldnews.com/meat-fish-or-vegetables-this-is-the-diet-with-the-highest-risk-of-hip-fracture/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/Meat-fish-or-vegetables-this-is-the-diet-with-the.jpg", "publishedAt": "2022-08-22T00:56:06Z", "content": "Research from the University of Leeds in the United Kingdom, published in the journal BMC Medicinehas examined the risk of hip fracture in occasional meat consumers; Pescatarians, people who eat fish… [+4862 chars]"}, {"source": {"id": null, "name": "Hardwoodparoxysm.com"}, "author": "Shannon Bailey", "title": "Science, blind people can return to corneal vision with pig collagen - Hardwood Paroxysm", "description": "It will be possible to return to the vision again. A Swedish research team has created an artificial cornea made of pig collagen. Thanks to a new", "url": "https://hardwoodparoxysm.com/science-blind-people-can-return-to-corneal-vision-with-pig-collagen/", "urlToImage": "https://www.notizie.it/wp-content/uploads/2022/08/Cornea-collagene-maiale.jpg", "publishedAt": "2022-08-21T23:43:55Z", "content": "It will be possible to return to the vision again. A Swedish research team has created an artificial cornea made of pig collagen. \r\nThanks to a new innovative study Performed by a Swedish research te… [+1344 chars]"}, {"source": {"id": null, "name": "Dovepress.com"}, "author": "Dove Press", "title": "Letter for the article Acupuncture Based on Regulating Autonomic Nerve | JPR - Dove Medical Press", "description": "Letter for the article Acupuncture Based on Regulating Autonomic Nerves for the Prevention of Migraine Without Aura: A Prospective, Double-Dummy, Randomized Controlled Clinical Trial", "url": "https://www.dovepress.com/acupuncture-based-on-regulating-autonomic-nerves-for-the-prevention--2-peer-reviewed-fulltext-article-JPR", "urlToImage": "https://www.dovepress.com/assets/img/addon/og_logo.png", "publishedAt": "2022-08-21T20:23:10Z", "content": "Dear editor\r\nI read with great interest the study protocol by Zhou et al1 investigating the role of acupuncture in managing migraines without aura. Migraines are debilitating for patients and it is g… [+4185 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "'Testing only way to confirm swine flu infection; follow precautions advised for Covid': Epidemiologist Dr Lancelot Pinto - The Indian Express", "description": "In 2020, Maharashtra had witnessed 129 swine flu cases with three deaths; the next year, it recorded 387 cases and two deaths due to the infection.", "url": "https://indianexpress.com/article/cities/mumbai/testing-confirm-swine-flu-infection-precautions-covid-epidemiologist-8103775/", "urlToImage": "https://images.indianexpress.com/2022/08/swine-flu-1200-1.jpg", "publishedAt": "2022-08-21T18:09:48Z", "content": "Maharashtra is witnessing a big jump in swine flu cases this year. In 2020, the state had witnessed 129 swine flu cases with three deaths; the next year, it recorded 387 cases and two deaths due to t… [+4826 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Try these natural ways to reduce your cholesterol levels - Times Now", "description": "Eating certain food and beverages can increase your bad cholesterol and reduce the good cholesterol which then becomes harmful for the body. Here, take a look at how you can naturally lower your cholesterol levels.", "url": "https://www.timesnownews.com/health/try-these-natural-ways-to-reduce-your-cholesterol-levels-article-93695211", "urlToImage": "https://static.tnn.in/thumb/msid-93695211,imgsize-100,width-1280,height-720,resizemode-75/93695211.jpg", "publishedAt": "2022-08-21T16:23:18Z", "content": "Soluble fibres are the ones that get dissolved in water but they cant be digested by the human body. Including these fibres can help the good bacteria in the gut which can eventually work to lower th… [+26 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "An episode of diabetic ketoacidosis may increase outpatient mortality risk - Medical Dialogues", "description": "New Zealand: A recent study in Acta Diabetologica reported a significant outpatient mortality risk...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/an-episode-of-diabetic-ketoacidosis-may-increase-outpatient-mortality-risk-97841", "urlToImage": "https://medicaldialogues.in/h-upload/2020/01/29/123634-ketoacidosis.jpg", "publishedAt": "2022-08-21T15:45:59Z", "content": "New Zealand: A recent study in Acta Diabetologica reported a significant outpatient mortality risk following an episode of diabetic ketoacidosis (DKA) with most deaths due to macrovascular or infecti… [+2215 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr.Niharika Harsha B", "title": "Hypertension among COVID-19 patients associated with poor prognosis, finds study - Medical Dialogues", "description": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to...", "url": "https://medicaldialogues.in/medicine/news/hypertension-among-covid-19-patients-associated-with-poor-prognosis-finds-study-97833", "urlToImage": "https://medicaldialogues.in/h-upload/2022/07/21/181401-hypertension.jpg", "publishedAt": "2022-08-21T14:30:56Z", "content": "A new investigation revealed that in-hospital mortality and adverse outcomes in COVID-19 are due to hypertension, but angiotensin-converting enzyme inhibitors (ACEIs)/angiotensin receptor blockers (A… [+2142 chars]"}, {"source": {"id": null, "name": "Eastcoastdaily.in"}, "author": "Mary Sushma", "title": "Make Chai healthier and tastier with these add ons | DH Latest News, DH NEWS, Ingredients, Latest News, NEWS, Food , Make Chai healthier and tastier with these add ons, healthier Chai add ons, tastier Chai add ons - East Coast Daily (English)", "description": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to y", "url": "https://www.eastcoastdaily.in/2022/08/21/make-chai-healthier-and-tastier-with-these-add-ons.html", "urlToImage": "https://www.eastcoastdaily.in/wp-content/uploads/2022/08/chai-lovers-wallpaper.jpg", "publishedAt": "2022-08-21T12:11:00Z", "content": "The arrival of the monsoon season has been declared, and with it come cough, cold, and flu symptoms. The easiest method to protect yourself against seasonal infections is to make some adjustments to … [+1324 chars]"}, {"source": {"id": null, "name": "Globalonlinemony.com"}, "author": "facebook.com/DrDurgesh.kukmar.sisodiya", "title": "Cerebral Cortex of Developing Human Brain Mapped Using High-Quality MRI Scan Data | Global Online Money - Global Online Money", "description": "Scientists have efficiently mapped the floor of the cerebral cortex of the younger human mind in impressively excessive decision. The mapping, executed", "url": "https://globalonlinemony.com/cerebral-cortex-of-developing-human-brain-mapped-using-high-quality-mri-scan-data-2/", "urlToImage": "https://i.gadgets360cdn.com/large/horizon_worlds_avatar_facebook_mark_zuckerberg_thumb_1660995749153.jpg", "publishedAt": "2022-08-21T11:15:53Z", "content": "Scientists have efficiently mapped the floor of the cerebral cortex of the younger human mind in impressively excessive decision. The mapping, executed utilizing high-quality magnetic resonance imagi… [+2787 chars]"}, {"source": {"id": null, "name": "mindbodygreen.com"}, "author": null, "title": "This Antioxidant-Packed Turmeric Supplement Has 10X The Power Of Golden Milk - mindbodygreen", "description": "Meet turmeric potency+.", "url": "https://www.mindbodygreen.com/articles/dont-have-time-to-make-golden-milk-this-supplement-is-even-more-potent", "urlToImage": "https://mindbodygreen-res.cloudinary.com/image/upload/c_fill,w_1200,h_800,g_auto,q_85,fl_lossy,f_jpg/org/5299iii02jzst7f8g.jpg", "publishedAt": "2022-08-21T11:12:31Z", "content": "\"Our turmeric root extract (Acumin) is clinically shown to protect turmeric's bioactive curcuminoids (including curcumin) and to be up to 10 times more bioavailable than other common forms of turmeri… [+1345 chars]"}, {"source": {"id": null, "name": "Nationworldnews.com"}, "author": "https://www.facebook.com/nationworldnews1", "title": "This Is One Of The Best Foods To Lose Weight According To Science - Nation World News", "description": "if we talk foods to lose weightThe avena This is one to keep in mind, as it is a very complete hydrate, protein, satiating and Very useful for both losing", "url": "https://nationworldnews.com/this-is-one-of-the-best-foods-to-lose-weight-according-to-science/", "urlToImage": "https://nationworldnews.com/wp-content/uploads/2022/08/This-is-one-of-the-best-foods-to-lose-weight.jpg", "publishedAt": "2022-08-21T09:40:35Z", "content": "if we talk foods to lose weightThe avena This is one to keep in mind, as it is a very complete hydrate, protein, satiating and Very useful for both losing weight and increasing muscle mass, Because o… [+2374 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Do you know brain gathers threat cues and turns them into fear? Study reveals - ANI News", "description": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGRP is a protein that permits neurons in two distinct sections…", "url": "https://www.aninews.in/news/health/do-you-know-brain-gathers-threat-cues-and-turns-them-into-fear-study-reveals20220821145906", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20220821091036.jpg", "publishedAt": "2022-08-21T09:29:00Z", "content": "Washington [US], August 21 (ANI): Salk Institute researchers have found that a biochemical pathway that combines potentially dangerous sights, sounds, and odours into a single message: Be afraid. CGR… [+3698 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Expert Recommends Getting Tested If One Suffers From Respiratory Problem To Identify Covid-19 Or Seasonal F - News18", "description": "The monsoon season diseases have signs of high fever, fatigue, and joint and muscle pain, which are also the same indications for Covid-19.", "url": "https://www.news18.com/news/lifestyle/expert-recommends-getting-tested-if-one-suffers-from-respiratory-problem-to-identify-covid-19-or-seasonal-flu-5784289.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/shangai-covid-lockdown-reuters-166045796916x9.jpg", "publishedAt": "2022-08-21T07:37:00Z", "content": "Amid the spike in Covid-19 cases across Delhi, the national capital has also seen a rise in seasonal flu cases recently. In addition to seasonal flu, cases of dengue and chikungunya have also rapidly… [+1860 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Massive Review Shows Vitamin D Really Does Seem to Ease Depressive Symptoms - ScienceAlert", "description": "Our bodies need the right amount of vitamin D to function as normal – both physically and mentally – and there's a growing amount of evidence out there linking a lack of vitamin D with depression.", "url": "https://www.sciencealert.com/massive-review-shows-vitamin-d-really-does-seem-to-ease-depressive-symptoms", "urlToImage": "https://www.sciencealert.com/images/2022/08/CapsulesInHand.jpg", "publishedAt": "2022-08-21T06:00:58Z", "content": "Our bodies need the right amount of vitamin D to function as normal both physically and mentally and there's a growing amount of evidence out there linking a lack of vitamin D with depression.\r\nNow a… [+3162 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Hannah Getahun", "title": "A biotech company wants to take human DNA and create artificial embryos that could be used to harvest organs f - Business Insider India", "description": "An Israeli firm wants to replicate a successful mouse embryo experiment with human cells.The company, Renewal Bio, wants to use the technology to make humanity", "url": "https://www.businessinsider.in/international/news/a-biotech-company-wants-to-take-human-dna-and-create-artificial-embryos-that-could-be-used-to-harvest-organs-for-medical-transplants/articleshow/93687772.cms", "urlToImage": "https://www.businessinsider.in/photo/93687772/a-biotech-company-wants-to-take-human-dna-and-create-artificial-embryos-that-could-be-used-to-harvest-organs-for-medical-transplants.jpg?imgsize=748766", "publishedAt": "2022-08-21T04:37:00Z", "content": "A biotechnology company based in Israel wants to replicate a recent experiment that successfully created an artificial mouse embryo from stem cells — only this time with human cells.\r\nScientists at W… [+2318 chars]"}]}