{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Over 1,000 monkeypox cases reported from 29 non-endemic countries: WHO - The Federal", "description": "More than 1,000 confirmed cases of monkeypox have been reported from 29 countries that are not endemic for the disease and the risk of the virus becoming established in non-endemic countries is “real”, the World Health Organization (WHO) has said.", "url": "https://thefederal.com/news/over-1000-monkeypox-cases-reported-from-29-non-endemic-countries-who/", "urlToImage": "https://thefederal.com/wp-content/uploads/2021/12/WHOChief.jpg", "publishedAt": "2022-06-09T14:27:54Z", "content": "More than 1,000 cases of monkeypox have been reported from 29 countries that are not endemic to the disease and the risk of the virus becoming established in non-endemic countries is real, the World … [+3720 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Are diet sodas safer than regular soft drinks? Here's all you need to know - Times of India", "description": "One such food item that most of 'diet conscious' people opt for is diet soda. But is diet soda actually good for your health? Read on to know.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/are-diet-sodas-safer-than-regular-soft-drinks-heres-all-you-need-to-know/photostory/92088408.cms", "urlToImage": "https://static.toiimg.com/photo/92088639.cms", "publishedAt": "2022-06-09T13:30:00Z", "content": "Thus, at the end of the day, it cannot be conclusively said that one is better than the other, as each has its own pros and cons. Regardless of which one you choose, you need to keep in mind that non… [+269 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "Onmanorama Staff", "title": "Nisha Varghese, the only Indian to undergo the trial of miracle drug for cancer | Lifestyle Health | English Manorama - Onmanorama", "description": "Nisha became one of the first four patients in the world who was ready to experiment with a new experimental drug called dostarlimab to treat rectal cancer.", "url": "https://www.onmanorama.com/lifestyle/health/2022/06/09/nisha-varghese-indian-undergo-trial-miracle-drug-cancer.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/health/images/2022/6/9/nisha-varghese-new-c.jpg", "publishedAt": "2022-06-09T12:30:16Z", "content": "Shall we try this?When Dr. Andria Sarsi of Memorial Sloan Kettering Cancer Center told this to Nisha Varghese, she felt a ray of hope. Nisha became one of the first four patients in the world who was… [+1095 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ayushman Kumar", "title": "Why arrhythmia should not be ignored in younger people? - Moneycontrol", "description": "Cases of Sudden Arrhythmic Death Syndrome (SADS) is on the rise among those under 40 years of age, say leading cardiologists. India needs retrospective studies and government-led health initiatives that combine data from public and private hospitals for arrhy…", "url": "https://www.moneycontrol.com/news/india/why-arrhythmia-should-not-be-ignored-in-younger-people-8665321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/Heart-health-770x433.jpg", "publishedAt": "2022-06-09T11:58:14Z", "content": "A significant number of people dying young due to sudden heart attacks has once again brought back the spotlight on heart ailments being on the rise in India.\r\nNot just heart attacks, other cardiovas… [+5435 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Global acute hepatitis cases in kids rises to 700, ten deaths: WHO - Ahmedabad Mirror", "description": "Mysterious case of acute hepatitis in kids has infected about 700 children in 34 countries and claimed 10 lives, according to the World Health Organization (WHO).\n\nThe cause behind the liver disease that was first reported in the UK in April, remains unknown,…", "url": "https://www.ahmedabadmirror.com/global-acute-hepatitis-cases-in-kids-rises-to-700-ten-deaths-who/81834976.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1654773907707.jpg-org", "publishedAt": "2022-06-09T11:27:56Z", "content": "Mysterious case of acute hepatitis in kids has infected about 700 children in 34 countries and claimed 10 lives, according to the World Health Organization (WHO).\r\nThe cause behind the liver disease … [+2087 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Dengue emergency in Singapore: Experts blame climate change, new strain, more mosquitoes - Down To Earth Magazine", "description": "Traditional peak dengue season has just begun and Singapore has already recorded more than 13,000 dengue cases this year", "url": "https://www.downtoearth.org.in/news/health/dengue-emergency-in-singapore-experts-blame-climate-change-new-strain-more-mosquitoes-83222", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-06-09/0.68225100_1654769814_singapore.jpg", "publishedAt": "2022-06-09T10:42:10Z", "content": "Traditional peak dengue season has just begun and Singapore has already recorded more than 13,000 dengue cases this yearSingapore is facing a ‘dengue emergency’, having recorded more than 13,000 case… [+4914 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Meat-eaters, study links your food with irreversible vision loss; know about it - Times of India", "description": "If you are a meat eater, this might bother you. For those who love having meat, they can develop vision issues, a study has found. While meat is definitely the best source of protein for the body, it wreaks havoc when consumed in the wrong manner.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/meat-eaters-study-links-your-food-with-irreversible-vision-loss-know-about-it/photostory/92103647.cms", "urlToImage": "https://static.toiimg.com/photo/92103858.cms", "publishedAt": "2022-06-09T10:30:00Z", "content": "Trichinella is a parasite that is present in wild animals like bear and pork products. These parasites easily come inside a human body if the person consumes undercooked or raw meat of the animal inf… [+363 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Great tips and info for Weight Loss - BollyInside", "description": "This list is about the Great tips and info for Weight Loss. We will try our best so that you understand this list Great tips and info for Weight Loss. I", "url": "https://www.bollyinside.com/articles/great-tips-and-info-for-weight-loss/", "urlToImage": "https://www.bollyinside.com/articles/wp-content/uploads/sites/4/2022/06/Great-tips-and-info-for-Weight-Loss.jpg", "publishedAt": "2022-06-09T10:17:37Z", "content": "This list is about the Great tips and info for Weight Loss. We will try our best so that you understand this list Great tips and info for Weight Loss. I hope you like this list Great tips and info fo… [+6929 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Even moderate drinkers are at risk of developing alcohol problems if they binge drink: Study - ThePrint", "description": "Texas [US], June 9 (ANI): According to a new study by researchers at The University of Texas at Austin, moderate drinkers who binge alcohol have a considerably higher chance of developing alcohol issues than those who drink the same amount overall but don’t b…", "url": "https://theprint.in/features/even-moderate-drinkers-are-at-risk-of-developing-alcohol-problems-if-they-binge-drink-study/989949/", "urlToImage": null, "publishedAt": "2022-06-09T10:15:22Z", "content": "Texas [US], June 9 (ANI): According to a new study by researchers at The University of Texas at Austin, moderate drinkers who binge alcohol have a considerably higher chance of developing alcohol iss… [+3031 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Shruti Wilson", "title": "What to eat and what not to read in case of diarrhea, otherwise you can die! - News Track English", "description": "Like colds and fever, diarrhea is also a common problem, although it is also considered a serious problem. Its outbreak is highest during the summer and rainy season. At the same time, the main reason behind this is considered to be dirt. During this, abdomin…", "url": "https://english.newstracklive.com/news/what-to-eat-and-what-not-to-read-in-case-of-diarrhea-otherwise-you-can-die-ta303-1233412-1.html", "urlToImage": "https://media.newstrack.in/uploads/health-lifestyle/health-tips/Jun/09/big_thumb/food_62a1b5375ec8d.JPG", "publishedAt": "2022-06-09T10:03:46Z", "content": "Like colds and fever, diarrhea is also a common problem, although it is also considered a serious problem. Its outbreak is highest during the summer and rainy season. At the same time, the main reaso… [+2619 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Type 1 Diabetes on Rise Among Children Below 14 Years, Finds Study - News18", "description": "The study also reflected that every year around 15,900 fresh cases are being reported in the same age group.", "url": "https://www.news18.com/news/lifestyle/type-1-diabetes-on-rise-among-children-below-14-years-finds-study-5332759.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/bossy-kid-164181080016x9.png", "publishedAt": "2022-06-09T09:51:50Z", "content": "Indian Council of Medical Research (ICMR) has issued new measures for the management of Type 1 diabetes. A recent study found a surge in Type 1 diabetes cases among children in India. As per the data… [+1568 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Is your diet making you fat? Hear from the expert - Times Now", "description": "When it comes to weight loss, following a diet fad may help achieve weight loss goals – however, those are not particularly sustainable. Once out of it, weight may increase drastically – and as a result, one may feel stuck in the cycle of weight gain and weig…", "url": "https://www.timesnownews.com/health/is-your-diet-making-you-fat-hear-from-the-expert-article-92102103", "urlToImage": "https://static.tnn.in/thumb/msid-92102103,imgsize-100,width-1280,height-720,resizemode-75/92102103.jpg", "publishedAt": "2022-06-09T09:45:27Z", "content": "Ultra-low-calorie diet plans, in a nutshell, do more harm than good. In the long run, these teach poor practices that may weaken the gut, bones, fertility and even result in nutrient deficiencies."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Study discovers when a person is most likely to be diagnosed with psychiatric effects post COVID infection - Times of India", "description": "A new study has found when these mental health complications are most likely to be diagnosed.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-study-discovers-when-a-person-is-most-likely-to-be-diagnosed-with-psychiatric-effects-post-covid-infection/photostory/92097716.cms", "urlToImage": "https://static.toiimg.com/photo/92097751.cms", "publishedAt": "2022-06-09T08:30:00Z", "content": "Lauren Chan, co-author of the study from OSU’s College of Public Health and Human Sciences, said: “For people who have had COVID, if you’re feeling anxiety, if you’re seeing some changes in how you’r… [+700 chars]"}, {"source": {"id": null, "name": "Womansera.com"}, "author": "Arpita Sarkar", "title": "Five Eating Habits You Should Avoid Just After Exercise! - - Woman's Era", "description": "Womansera magazine is a platform for women to get latest info and tips on fashion, beauty, health and relationship advice. Subscribe to India's No.1 women's magazine!", "url": "https://womansera.com/five-eating-habits-you-should-avoid-just-after-exercise/", "urlToImage": "https://womansera.com/wp-content/uploads/2022/06/yoga.jpg", "publishedAt": "2022-06-09T08:16:51Z", "content": "People are now paying attention to physical exercise to keep the body well. But to maintain good health, you should not only exercise regularly, but you should also eat moderately. The benefits of ex… [+2023 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Believe it or not: More screen time on phone can shorten lifespan, say researchers - WION", "description": "As eyes are constantly exposed to the world, their immune defenses are strong in comparison to other organs. When these defenses become overactive due to the heavy light exposure through the phone every day, it can disrupt internal body processes. This can al…", "url": "https://www.wionews.com/science/believe-it-or-not-more-screen-time-on-phone-can-shorten-lifespan-say-researchers-486461", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/06/09/269268-mobile-phone.jpg", "publishedAt": "2022-06-09T07:33:49Z", "content": "If you love to spend time in surfing or checking out different things on the phone regularly, it's time to rethink. Researchers have suggested that spending long hours on the phone can shorten the li… [+2129 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "5 everyday foods that are harming your liver - Hindustan Times", "description": "From excess alcohol consumption, overdosing on medicines, to eating a diet high on sugar and calories, there are many ways we may be burdening our liver. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/5-everyday-foods-that-are-harming-your-liver-101654759089246.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/09/1600x900/liver_foods_thumb_1654759761918_1654759779025.jpg", "publishedAt": "2022-06-09T07:32:21Z", "content": "Liver is regarded as the chemical factory of our body as it works round-the-clock to maintain chemical levels in the blood and plays a crucial role in removing toxins from the body. The largest singl… [+2831 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "6 Steps to Prevent Weight Gain Post Bariatric Surgery - News18", "description": "Obesity is a condition involving abnormal or excessive fat accumulation that has a negative effect on overall health.", "url": "https://www.news18.com/news/lifestyle/6-steps-to-prevent-weight-gain-post-bariatric-surgery-5329009.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/waistline-165383377116x9.png", "publishedAt": "2022-06-09T06:39:14Z", "content": "Bariatric surgery is one of the most effective methods to lose weight for a long period, according to health experts. It is also one of the best options available to deal with obesity through surgery… [+1852 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Study: Alcoholism relapse may driven by release of immune protein in brain - Hindustan Times", "description": "The discovery, reported online on June 6, 2022, in Molecular Psychiatry, illuminates the molecular details of the brain's response to alcohol withdrawal, and suggests that the immune protein, colony-stimulating factor 1 (CSF1), could be a target of future tre…", "url": "https://www.hindustantimes.com/lifestyle/health/study-alcoholism-relapse-may-driven-by-release-of-immune-protein-in-brain-101654755989123.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/09/1600x900/_5f8f345c-c36f-11e7-a621-6b23f0f703d9_1654756044535.jpg", "publishedAt": "2022-06-09T06:29:38Z", "content": "According to a new study from scientists at Scripps Research, the anxiety that occurs during withdrawal from excessive alcohol use, and contributes to relapse, may be driven in part by the release of… [+4449 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Monkeypox: As Ghaziabad girl tests negative, here are the symptoms that led to testing for the virus - Times of India", "description": "A young girl from Ghaziabad, who was suspected to be having monkeypox infection, has tested negative, the Ghaziabad health department confirmed on Tuesday. A private hospital to which the girl was admitted had suspected her to have contracted the viral infect…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/monkeypox-as-ghaziabad-girl-tests-negative-here-are-the-symptoms-that-led-to-testing-for-the-virus/photostory/92086014.cms", "urlToImage": "https://static.toiimg.com/photo/92086154.cms", "publishedAt": "2022-06-09T05:30:00Z", "content": "The common symptoms of monkeypox are: fever, headache, swelling of lymph nodes, back pain, muscle ache, listless, and rashes on face, palm and soles. Rashes can also be found on oral mucous membranes… [+157 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "Beetroot juice may aid people with coronary heart disease – study - The Guardian", "description": "Research suggests a daily glass reduces harmful inflammation by boosting nitric oxide levels", "url": "https://amp.theguardian.com/society/2022/jun/09/beetroot-juice-coronary-heart-disease-nitric-oxide-levels", "urlToImage": null, "publishedAt": "2022-06-09T05:00:00Z", "content": "Heart diseaseResearch suggests a daily glass reduces harmful inflammation by boosting nitric oxide levels\r\nA daily glass of beetroot juice could reduce harmful inflammation in people with coronary he… [+4083 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Obesity lowers the age for knee replacements - Medical Dialogues", "description": "A recent research found that more than half of Australians who underwent knee replacement for...", "url": "https://medicaldialogues.in/mdtv/orthopaedics/videos/obesity-lowers-the-age-for-knee-replacements-94216", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/09/178273-ananya-30.jpg", "publishedAt": "2022-06-09T05:00:00Z", "content": "A recent research found that more than half of Australians who underwent knee replacement for osteoarthritis were obese, thereby increasing their risk of having the operation at a younger age, especi… [+996 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Tapatrisha Das", "title": "Covid Pneumonia: Symptoms, treatment and prevention - Hindustan Times", "description": "From symptoms to prevention to treatment – here's all that you need to know about covid Pneumonia. Know from the expert here. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/covid-pneumonia-symptoms-treatment-and-prevention-101654750128535.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/09/1600x900/c_1654750170733_1654750180755.jpg", "publishedAt": "2022-06-09T04:52:06Z", "content": "Since the last two years of the inception of the coronavirus, it has showed a varied spectrum of presentation. It also has an array of symptoms sometimes asymptomatic, sometimes having common cold to… [+2398 chars]"}, {"source": {"id": null, "name": "Zawya.com"}, "author": "Renee Maltezou and Angeliki Koutantou", "title": "Greece detects first case of monkeypox infection - ZAWYA", "description": "Monkeypox is a rare viral infection similar to human smallpox", "url": "https://www.zawya.com/en/life/health/greece-detects-first-case-of-monkeypox-infection-bmmipmtl", "urlToImage": "https://static.zawya.com/version/c:MDdiOTZlMjEtYjk3My00:Mzc1NTQ2/health-monkeypox.JPG", "publishedAt": "2022-06-09T04:51:37Z", "content": "ATHENS: Greece has detected its first case of the rare monkeypox virus infection in a traveler, according to initial tests, the country's national health agency EODY said in a statement on Wednesday.… [+332 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Monkeypox outbreak: UK upgrades disease severity to leprosy, plague level - DNA India", "description": "UK Health Security Agency has laid a legislation, which makes monkeypox a notifiable infectious disease under the Health Protection Regulations 2010.", "url": "https://www.dnaindia.com/world/report-monkeypox-outbreak-uk-upgrades-disease-severity-to-leprosy-plague-level-2959047", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/06/09/2202595-fotojet-2022-06-09t100140.612.jpg", "publishedAt": "2022-06-09T04:22:00Z", "content": "Monkeypox outbreak has become a matter of grave concerns across the globe. The United Kingdom has reported over 300 cases of the monkeypox disease.\r\nWhile designating monkeypox as a notifiable diseas… [+2486 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Easy lifestyle changes you can do to prevent heart diseases - Times Now", "description": "Ischaemic heart disease is responsible for nearly 20 percent of deaths, the largest across the globe. And the numbers just keep increasing.", "url": "https://www.timesnownews.com/health/easy-lifestyle-changes-you-can-do-to-prevent-heart-diseases-article-92088344", "urlToImage": "https://static.tnn.in/thumb/msid-92088344,imgsize-100,width-1280,height-720,resizemode-75/92088344.jpg", "publishedAt": "2022-06-09T04:08:52Z", "content": "No delay in Monsoon progress; Delhi-NCR, northwest India to get respite from heat conditions after June 15: IMD"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Nandita Mohan", "title": "Should patients with class I obesity Have weight-loss surgery done? - Medical Dialogues", "description": "Weight-loss surgery improves or puts into remission type 2 diabetes, reduces heart attacks and...", "url": "https://medicaldialogues.in/mdtv/diabetes-endocrinology/videos/should-patients-with-class-i-obesity-have-weight-loss-surgery-done-94215", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/09/178271-ananya-24.jpg", "publishedAt": "2022-06-09T04:00:00Z", "content": "Weight-loss surgery improves or puts into remission type 2 diabetes, reduces heart attacks and stroke and results in significant and durable weight loss, but a new study finds outdated guidelines iss… [+1139 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Ashima Sharda Mahindra", "title": "Why women over 40 gain weight and what they can do to lose it - Times Now", "description": "Blame it on the hormones, since as you age, the body’s estrogen levels drop and this change leads to a lethargic and inactive metabolism.", "url": "https://www.timesnownews.com/health/why-women-over-40-gain-weight-and-what-they-can-do-to-lose-it-article-92094979", "urlToImage": "https://static.tnn.in/thumb/msid-92094979,imgsize-100,width-1280,height-720,resizemode-75/92094979.jpg", "publishedAt": "2022-06-09T03:42:42Z", "content": "WB HS Result 2022 date, time: West Bengal, WBCHSE 12th result releasing tomorrow on wbresults.nic.in"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New study into sepsis could save children’s lives around the world - News-Medical.Net", "description": "A clinical study examining new ways of treating children with sepsis - using vitamin C and steroids alongside antibiotics - could save children's lives around the world.", "url": "https://www.news-medical.net/news/20220608/New-study-into-sepsis-could-save-childrene28099s-lives-around-the-world.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Children_playing_sunset_-_Zurijeta_8c5bdac77e44431bb1bfec67b9c87208-620x480.jpg", "publishedAt": "2022-06-09T02:49:00Z", "content": "A clinical study examining new ways of treating children with sepsis - using vitamin C and steroids alongside antibiotics - could save children's lives around the world.\r\nThe University of Queensland… [+2899 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Black Americans bear the Brunt of Fentanyl 'Epidemic' in Washington - News18", "description": "Fentanyl -- sold in powder form and cheap to manufacture, so often used as an additive in other drugs such as heroin -- began flooding the market in 2014", "url": "https://www.news18.com/news/world/black-americans-bear-the-brunt-of-fentanyl-epidemic-in-washington-5336833.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/pjimage-2022-06-09t075721.820-165474174816x9.jpg", "publishedAt": "2022-06-09T02:30:32Z", "content": "Lorando Duncan wears long-sleeved shirts because his arms bear scars he doesnt like to show: those of the drugs he has been injecting into his veins for decades.\r\nBorn in the US capital Washington 65… [+4825 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANSlife", "title": "Seven underrated food items that are great for you - Onmanorama", "description": "Many of these superfoods are often so underappreciated that their benefits are not widely known. It's time to make a change.", "url": "https://www.onmanorama.com/food/features/2022/06/08/seven-underrated-food-items-that-are-great-for-you.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/food/features/images/2022/6/8/healthy-food.jpg", "publishedAt": "2022-06-09T02:29:17Z", "content": "Humans are becoming more aware of what they consume and how it affects them as the world becomes more health conscious. The food we eat have a direct impact on our mental and physical health. Some bi… [+3291 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Genes that make you taller could protect from heart disease, study by US govt agency finds - ThePrint", "description": "Conducted by a team from the US Department of Veteran Affairs’ Million Veteran Program, the study was published in the journal PLOS Genetics last week.", "url": "https://theprint.in/health/genes-that-make-you-taller-could-protect-from-heart-disease-study-by-us-govt-agency-finds/988335/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/06/Genetics.jpg", "publishedAt": "2022-06-09T01:30:45Z", "content": "New Delhi: The genetic code that make humans taller could protect you from cardiovascular disease, but increase the risk for nerve-related diseases, according to a study of genetic and medical data o… [+3390 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chikungunya outbreak under control at Dehugaon: Officials | Cities News - The Indian Express", "description": "Dr Mahendra Jagtap, state entomologist, told The Indian Express that as many as 12 teams were included in the container surveys and fogging activity.", "url": "https://indianexpress.com/article/cities/pune/chikungunya-outbreak-under-control-at-dehugaon-officials-7959837/", "urlToImage": "https://images.indianexpress.com/2021/11/dengue-1200.jpg", "publishedAt": "2022-06-09T01:12:39Z", "content": "NEARLY 44 cases of chikungunya, one dengue and 17 cases of dengue-chikungunya co-infection have been reported since the last fortnight at Vitthalwadi area in Dehugaon. According to the health authori… [+603 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Rosewood leaves for drug to treat osteoporosis in postmenopausal women - The Federal", "description": "Two government research institutes have teamed up to develop a novel medicine that prevents bone breakdown, stimulates new bone formation and reduces bone turnover markers in patients of osteoporosis, especially postmenopausal women. Bone Markers are indicato…", "url": "https://thefederal.com/health/rosewood-leaves-for-drug-to-treat-osteoporosis-in-postmenopausal-women/", "urlToImage": "https://thefederal.com/wp-content/uploads/2022/06/iStock-1279445349.jpg", "publishedAt": "2022-06-09T01:00:04Z", "content": "Two government research institutes have teamed up to develop a novel medicine that prevents bone breakdown, stimulates new bone formation and reduces bone turnover markers in patients of osteoporosis… [+2330 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Getting fully vaccinated against COVID-19 during pregnancy helps protect young infants - News-Medical.Net", "description": "New research offers evidence that getting a second or third dose of the COVID-19 vaccine in the final stages of pregnancy offers protection for infants against SARS-CoV-2 infection (the virus that causes COVID-19 illness).", "url": "https://www.news-medical.net/news/20220608/Getting-fully-vaccinated-against-COVID-19-during-pregnancy-helps-protect-young-infants.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2022-06-08T23:21:00Z", "content": "New research offers evidence that getting a second or third dose of the COVID-19 vaccine in the final stages of pregnancy offers protection for infants against SARS-CoV-2 infection (the virus that ca… [+2335 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "IIT ISM scientists develop adsorbent to remove Arsenic from ground water - Daily Pioneer", "description": "In a research the scientists of the IIT (ISM)&nbsp; have succeeded in development of an absorbent that helps in removal of Arsenic from groundwater.\n\nA four-member team of researchers led by Dr. S.R. Samadder, Associate professor of Environment Science Engine…", "url": "https://www.dailypioneer.com/2022/state-editions/iit-ism-scientists-develop-adsorbent-to-remove-arsenic-from-ground-water.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-06-08T18:47:57Z", "content": "In a research the scientists of the IIT (ISM)  have succeeded in development of an absorbent that helps in removal of Arsenic from groundwater.\r\nA four-member team of researchers led by Dr. S.R. Sama… [+1615 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Kayla Garritano", "title": "4 Eating Habits That Slow Your Metabolism After 50, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "No one looks forward to it, but as you get older, you develop a slow metabolism. It's inevitable, but here's how you can help ease the process.", "url": "http://www.eatthis.com/eating-habits-slow-metabolism-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/media/images/ext/541148657/woman-on-scale-frowning.jpg?quality=82&strip=all", "publishedAt": "2022-06-08T17:44:21Z", "content": "Our bodies naturally slow down as we age, regardless of how old we are. No matter who tells you otherwise, in your 50s, you are still young and young at heart. However, you'll start to see some chang… [+3029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Hypertension, prostate cancer, and other tests that are a must for men over 40 - The Indian Express", "description": "International Men’s Health Month: Over 80 per cent of people with hypertension do not have any symptoms and the only way to figure it out is by evaluation, says a doctor", "url": "https://indianexpress.com/article/lifestyle/health/international-men-health-month-tests-men-over-40-health-evaluation-7956758/", "urlToImage": "https://images.indianexpress.com/2022/06/GettyImages-heart-health-checkup-1200.jpg", "publishedAt": "2022-06-08T16:10:48Z", "content": "June is observed as International Mens Health Month, prompting men around the world to prioritise their health and look for signs and symptoms signalling health issues, which can be taken care of bef… [+3302 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Monkeypox vaccination begins — can the global outbreaks be contained? - Nature.com", "description": "Some countries have begun to use smallpox vaccines to protect people exposed to the monkeypox virus. But researchers see challenges ahead.", "url": "https://www.nature.com/articles/d41586-022-01587-1", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-01587-1/d41586-022-01587-1_23134732.jpg", "publishedAt": "2022-06-08T14:35:11Z", "content": "A man receives a vaccine at a monkeypox clinic in Montreal, Canada, on 6 June.Credit: Christinne Muschi/Reuters\r\nAs global monkeypox cases continue to rise, public-health officials and researchers ar… [+9287 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Transcranial stimulation lowers BP in patients with resistant hypertension, study shows - Medical Dialogues", "description": "Resistant or refractory hypertension is high blood pressure that does not respond to aggressive...", "url": "https://medicaldialogues.in/cardiology-ctvs/news/transcranial-stimulation-lowers-bp-in-patients-with-resistant-hypertension-study-shows-94152", "urlToImage": "https://medicaldialogues.in/h-upload/2022/06/08/178162-cardio.jpg", "publishedAt": "2022-06-08T14:01:16Z", "content": "Resistant or refractory hypertension is high blood pressure that does not respond to aggressive medical treatment, defined as daily administration of at least three classes of antihypertensive drug (… [+4947 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "COVID battle: A shot in the arm for India’s traditional medicine system - The Federal", "description": "India is a hub of rich and diverse knowledge and practice of classical medical philosophy, one of the oldest medical sciences in the world", "url": "https://thefederal.com/features/covid-battle-a-shot-in-the-arm-for-indias-traditional-medicine-system/", "urlToImage": "https://thefederal.com/wp-content/uploads/2019/10/drop-picture-id155422270-1.jpg", "publishedAt": "2022-06-08T13:47:21Z", "content": "Since December 2019, the world has been recuperating from a significant unexpected challenge of novel Coronavirus disease (COVID-19), caused by the SARS-CoV-2 virus. Declared a pandemic by World Heal… [+5064 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "Visceral leishmaniasis and HIV coinfection: WHO publishes new guideline with region-specific treatment recommendations - World Health Organization", "description": "<p>The World Health Organization (WHO) has published new treatment recommendations for visceral leishmaniasis in patients who are coinfected with the human immunodeficiency virus (HIV). The guideline targets visceral leishmaniasis in East Africa and South-Eas…", "url": "https://www.who.int/news/item/08-06-2022-visceral-leishmaniasis-and-HIV-coinfection-WHO-publishes-new-guideline-with-region-specific-treatment-recommendations", "urlToImage": "https://www.who.int/images/default-source/departments/ntd-library/leishmaniasis/nigatu-abebe-hiv-vl-patient-leishmaniasis-research-treatment-centre-university-gondar-ethiopia-dndi.tmb-1200v.jpg?sfvrsn=36aae4fa_1", "publishedAt": "2022-06-08T12:27:39Z", "content": "The World Health Organization (WHO) has published new treatment recommendations for visceral leishmaniasis in patients who are coinfected with the human immunodeficiency virus (HIV). The guideline ta… [+6719 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Doctor reveals a fool-proof plan to manage knee pain during summers - Hindustan Times", "description": "Did you know the hot temperature during summer can impact your joints? Yes, you have heard it right! One’s knee pain can worsen during those sunny days and steal your peace of mind. Follow these health tips by the doctor and do not ignore your knee pain | Hea…", "url": "https://www.hindustantimes.com/lifestyle/health/doctor-reveals-a-fool-proof-plan-to-manage-knee-pain-during-summers-follow-these-6-health-tips-101654677621544.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/08/1600x900/pexels-andrea-piacquadio-3760275_1654677780871_1654677807315.jpg", "publishedAt": "2022-06-08T08:55:32Z", "content": "Summers not only lead to gastrointestinal issues but also joint problems and as the mercury soars, one may have knee pain due to various reasons like dehydration as one is losing more fluid, even whe… [+2831 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Male fertility: Bad habits that can harm men's reproductive health - Hindustan Times", "description": "Attention men! If you want to improve your sperm count and boost your fertility, here are a few modifications, recommended by doctors, that you need to do in your lifestyle so as to not harm your reproductive health. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/male-fertility-tips-correct-these-bad-habits-that-can-harm-a-man-s-sperm-count-and-reproductive-health-101654675777697.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/08/1600x900/pexels-ketut-subiyanto-4746725_1654675988140_1654676009819.jpg", "publishedAt": "2022-06-08T08:30:33Z", "content": "If you're in your mid-thirties and living a carefree lifestyle with little regard for your health, your odds of fathering a child are likely to be dwindling as researchers believe that once a male ap… [+7452 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Consuming Whey Protein Can Manage Type 2 Diabetes? Here's What Study Says - News18", "description": "Results from continuous glucose monitoring revealed that glucose levels were much better controlled when taking the whey supplement before meals.", "url": "https://www.news18.com/news/lifestyle/consuming-whey-protein-can-manage-type-2-diabetes-heres-what-study-says-5332543.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/untitled-design-2-61-164458579316x9.png", "publishedAt": "2022-06-08T07:38:30Z", "content": "According to research findings published in the BMJ Open Diabetes Research &amp; Care journal, consuming small quantities of whey protein before meals is beneficial for controlling blood sugar levels… [+2793 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Side Effects of Cherries: How Eating Fresh Drupe in Excess Can Be Harmful For Health - India.com", "description": "Cherry is high in potassium and magnesium, as well as vitamins A, K, C, and B6. However, no food is completely free of negative effects, no matter how mild, and cherries are no exception. So today we will tell you side effects of having these reddish tiny fru…", "url": "https://www.india.com/health/side-effects-of-cherries-how-eating-fresh-drupe-in-excess-can-be-harmful-for-health-5440825/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/06/WhatsApp-Image-2022-06-08-at-12.45.23-PM-1.jpeg", "publishedAt": "2022-06-08T07:37:20Z", "content": "Cherry is a reddish tiny fruit with a juicy texture that almost everyone enjoys. It’s chock-full of antioxidants! Cherry is high in potassium and magnesium, as well as vitamins A, K, C, and B6. Howev… [+1873 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Allergic To Dust? 12 Superfoods To Reduce Symptoms - NDTV", "description": "Allergies can cause a lot of discomfort, especially dust allergies which are very common and frequent. Here are 12 foods you need to add to your diet to reduce your symptoms and increase your immunity.", "url": "https://www.ndtv.com/health/allergic-to-dust-12-superfoods-to-reduce-symptoms-3046280", "urlToImage": "https://c.ndtvimg.com/2022-03/se0s7s58_cinnamon-for-men-_625x300_10_March_22.jpg", "publishedAt": "2022-06-08T07:16:55Z", "content": "Adding cinnamon to your diet can increase your immunity and also reduce allergy symptoms\r\nDust allergy refers to a reaction caused by the body upon inhaling dust mites that are present in the dust. T… [+3368 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "What is Alzheimer's disease? Know About the Risk Factors - News18", "description": "Although there is no cure for Alzheimer’s yet, early diagnosis and treatment can help slow the progression of the disease and may improve the quality of life.", "url": "https://www.news18.com/news/lifestyle/what-is-alzheimers-disease-know-about-the-risk-factors-5328871.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/brain-165159283416x9.png", "publishedAt": "2022-06-08T07:09:46Z", "content": "Alzheimers is a progressive neurologic disorder that hits memory and thinking skills. Alzheimers disease is the most common cause of dementia. It affects an individuals ability to function independen… [+1536 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Best Benefits of Yoga - Entertainment Bollyinside - BollyInside", "description": "This list is about the Best Benefits of Yoga. We will try our best so that you understand this list Best Benefits of Yoga. I hope you like this list Best", "url": "https://www.bollyinside.com/articles/best-benefits-of-yoga/", "urlToImage": "https://www.bollyinside.com/articles/wp-content/uploads/sites/4/2022/06/Best-Benefits-of-Yoga.jpg", "publishedAt": "2022-06-08T05:54:37Z", "content": "This list is about the Best Benefits of Yoga. We will try our best so that you understand this list Best Benefits of Yoga. I hope you like this list Best Benefits of Yoga. So lets begin:\r\nTable of Co… [+9116 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Covid precautions - The Tribune India", "description": "The sudden surge in coronavirus cases in parts of the country during the past few days has led to increased monitoring and advisories being put out to be on alert, but a key difference this time round that should come as a relief is the low severity of the di…", "url": "https://www.tribuneindia.com/news/editorials/covid-precautions-401895", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_1333172879.jpg", "publishedAt": "2022-06-08T00:38:00Z", "content": "The sudden surge in coronavirus cases in parts of the country during the past few days has led to increased monitoring and advisories being put out to be on alert, but a key difference this time roun… [+1741 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Common Cognitive & Behavioural Changes Post Brain Surgery - ETHealthWorld", "description": "There are many physical changes post the brain surgery like swelling in the brain post the procedure, dizzy spells or getting confused about the whereabouts. Such episodes can occur in brief intervals during the recovery; however, the benefits of the operatio…", "url": "https://health.economictimes.indiatimes.com/news/industry/common-cognitive-behavioural-changes-post-brain-surgery/92066368", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-92066368,imgsize-215043,width-1200,height-628,overlay-ethealthworld/common-cognitive-behavioural-changes-post-brain-surgery.jpg", "publishedAt": "2022-06-07T23:27:00Z", "content": "by Dr Harish NaikBrain surgery, which is one of the complicated procedures can have an overwhelming impact on a patient's emotional state. Like any treatment, it is not unusual to feel worse post the… [+3692 chars]"}, {"source": {"id": null, "name": "Boing Boing"}, "author": null, "title": "New diabetes drug helped obese people without the disease lose incredible amounts of weight - Boing Boing", "description": "The headline sounds like a snake oil ad, but Tirzepatide, a newly-approved drug to treat Type 2 diabetes, has been shown to help people without the disease lose dozens of pounds over just sixteen m…", "url": "https://boingboing.net/2022/06/07/new-diabetes-drug-helped-obese-people-without-the-disease-lose-incredible-amounts-of-weight.html", "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/06/shutterstock_534119647-1-scaled.jpg?fit=1200%2C800&ssl=1", "publishedAt": "2022-06-07T22:55:22Z", "content": "The headline sounds like a snake oil ad, but Tirzepatide, a newly-approved drug to treat Type 2 diabetes, has been shown to help people without the disease lose dozens of pounds over just sixteen mon… [+1223 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Dearth of ART Drugs Leaves 13,000 Manipur Residents Living with HIV/AIDS in Precarious Position - News18", "description": "According to sources, State AIDS Control Society (SACS) was unable to procure the crucial medicine and maintain a buffer stock", "url": "https://www.news18.com/news/india/dearth-of-art-drugs-leaves-13000-manipur-residents-living-with-hivaids-in-precarious-position-5329759.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/world-aids-vaccine-day-2-165276557716x9.jpg", "publishedAt": "2022-06-07T18:16:54Z", "content": "Close to 13,000 people living with HIV/AIDS in the north-eastern state of Manipur are in a hazardous situation with the life-saving antiretroviral therapy (ART) drugs out of stock since April.\r\nAccor… [+1193 chars]"}]}