{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Rearview Mirror: All weather scramble - Bangalore Mirror", "description": "Fact is the rainfall has been scanty: with the sunshine, unseasonal blue skies dotted with patches of clouds one could say the weather of late is reminiscent of any season but the monsoon that usuall", "url": "https://bangaloremirror.indiatimes.com/bangalore/others/rearview-mirror-all-weather-scramble/articleshow/101053242.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-102728,msid-101053232/101053232.jpg", "publishedAt": "2023-06-17T00:30:00Z", "content": "The southwest monsoon has set in over Kerala\r\n, at least that is what reports have been saying; that the annual watering of life in this part of the planet has begun.Fact is the rainfall has been sca… [+4315 chars]"}, {"source": {"id": null, "name": "msnNOW"}, "author": null, "title": "Health Experts Weigh In: Coconut Sugar vs Sugar - Which is Healthier? - msnNOW", "description": "This article provides an overview of the nutritional value of coconut sugar compared to regular sugar, as well as advice from three experts on its use in various diets. The experts provide insight into the nutrient content of coconut sugar, its potential heal…", "url": "https://www.msn.com/en-us/health/ask-professionals/expert-answers-on-coconut/hp-coconut-nutrition", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1aBVpg.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-06-16T21:42:22Z", "content": "© Provided by Getty Images\r\n Coconut image\r\nM.Sc in Nutrition and PG Diploma in Nutrition &amp; Spcl Dietitian · 1 years of experience · India\r\n<ul><li>Coconut sugar is also know as palm sugar as the… [+1499 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Mitchel L. Zoler, PhD", "title": "New Dialysis Technique Boosts Survival in Kidney Failure - Medscape", "description": "High-dose hemodiafiltration led to substantially better survival of patients with end-stage kidney disease compared with conventional hemodialysis after a median 30 months in a large, prospective study.", "url": "https://www.medscape.com/viewarticle/993344", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230616_dialysis_patient_clinic_800x450.jpg", "publishedAt": "2023-06-16T19:48:26Z", "content": "High-dose hemodiafiltration (HDF) produced substantially better survival compared with conventional, high-flux hemodialysis in people with end-stage kidney disease (ESKD) in CONVINCE, a randomized, m… [+5497 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Abnormalities in neurodevelopment can lay foundations for Alzheimer's disease: Study - ANI News", "description": "Neurogenesis, or the development of neural cells from stem cells, begins in the foetus at 5 weeks gestation and is nearly complete by 28 weeks. It is a complicated process with intricate processes.", "url": "https://www.aninews.in/news/science/abnormalities-in-neurodevelopment-can-lay-foundations-for-alzheimers-disease-study20230616235313", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230616181911.jpg", "publishedAt": "2023-06-16T18:23:00Z", "content": "Paris [France], June 16 (ANI): Neurogenesis, or the development of neural cells from stem cells, begins in the foetus at 5 weeks gestation and is nearly complete by 28 weeks. It is a complicated proc… [+4668 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Pearl Steinzor", "title": "Asthma Morbidity, Mortality Linked to Extreme Weather Events, Study Finds - AJMC.com Managed Markets Network", "description": "Women and children are the most susceptible to adverse asthma outcomes due to climate change, according to one study.", "url": "https://www.ajmc.com/view/asthma-morbidity-mortality-linked-to-extreme-weather-events-study-finds", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/8feded854832dc61bb64a82311f1905fe5c6e415-425x282.jpg?fit=crop&auto=format", "publishedAt": "2023-06-16T18:10:16Z", "content": "The effects of extreme weather events have been linked to increased asthma morbidity and mortality, especially among women and children. This adds context to the severity of climate change as a criti… [+3843 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study finds how prevalence of metabolic linked to fatty liver disease is increasing - ANI News", "description": "According to a study presented Friday at ENDO 2023, the Endocrine Society's annual meeting in Chicago, the percentage of adults with metabolic-associated fatty liver disease (MAFLD), the major global cause of liver disease, is growing.", "url": "https://www.aninews.in/news/science/study-finds-how-prevalence-of-metabolic-linked-to-fatty-liver-disease-is-increasing20230616232803", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230616174409.jpg", "publishedAt": "2023-06-16T17:58:00Z", "content": "Chicago [US], June 16 (ANI): According to a study presented Friday at ENDO 2023, the Endocrine Society's annual meeting in Chicago, the percentage of adults with metabolic-associated fatty liver dise… [+2197 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Rapid Rx Quiz: Severe Asthma Treatment - Medscape Reference", "description": "Are you up-to-date on the latest research on severe asthma treatment, including effective biologics and factors associated with higher asthma biologic adherence? Test yourself with this quick quiz.", "url": "https://reference.medscape.com/viewarticle/993128", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230606_mother_holding_asthma_inhaler_for_daughter_800x450.jpg", "publishedAt": "2023-06-16T17:40:12Z", "content": "Nearly 400 million people globally have asthma, a chronic inflammatory disorder. This common airway issue is characterized by chest tightness, coughing, shortness of breath, tissue remodeling, variab… [+686 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Mitchel L. Zoler, PhD", "title": "Anabolic-Steroid Withdrawal Regimens Show Promise in Men - Medscape", "description": "Researchers study men taking illegal self-treatments bought online to help them tackle side effects experienced when they stop taking anabolic steroids. The former seem to work to restore hormone levels.", "url": "https://www.medscape.com/viewarticle/993334", "urlToImage": "https://img.medscape.com/thumbnail_library/dt_230616_steroid_abuse_word_cloud_800x450.jpg", "publishedAt": "2023-06-16T17:35:07Z", "content": "Men who illicitly used anabolic-androgenic steroids to bulk up and then turned to illegal, web-based regimens for treating their steroid withdrawal complications have provided important clues for new… [+4836 chars]"}, {"source": {"id": null, "name": "Organiser.org"}, "author": "WEB DESK", "title": "Study suggests adherence to global health recommendations lowers risk of cancer - Organiser", "description": "Researchers found people who follow global Cancer Prevention Recommendations are less likely to develop the disease. The study was published in the", "url": "https://organiser.org/2023/06/16/179225/world/study-suggests-adherence-to-global-health-recommendations-lowers-risk-of-cancer/", "urlToImage": "https://organiser.org/wp-content/uploads/2023/06/whatsapp-image-2023-06-16-at-1.14.42-pm.jpeg", "publishedAt": "2023-06-16T17:32:49Z", "content": "Researchers found people who follow global Cancer Prevention Recommendations are less likely to develop the disease.\r\nThe study was published in the peer-reviewed scientific journal ‘Cancer.’ Newcast… [+3018 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Where did the time go? A quick look at how we perceive time - msnNOW", "description": "Two theories suggest age and attention levels affect perception of time. While aging processes less visual info, high-alert situations process more. Mixing up routines and paying active attention can slow time down. \"Time blindness\" associated with ADHD, but …", "url": "https://www.hindustantimes.com/lifestyle/art-culture/why-time-seems-to-fly-by-the-science-behind-perception-and-attention-during-the-pandemic-and-in-everyday-life-101686933947482.html?utm_source=microsoft-ht", "urlToImage": "https://static-entertainment-eus-s-msn-com.akamaized.net/sc/c6/519670.jpg", "publishedAt": "2023-06-16T16:45:47Z", "content": "Do you feel like you dont know where the days go? Wake up, and its time for bed again; make a few calls, and its 5 pm. Begin the week, and in a blink, its ended. \r\nIs it the pandemic? Is it the exten… [+3330 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Experts Bring In Use Organoids To Learn About Autism - India Education Diary", "description": "Microglia cells, which play a major role in the immune system of the brain, are difficult to study. Researchers have now succeeded in modelling the development of the brain and its immune system using organoids. With these miniature models of groups", "url": "https://indiaeducationdiary.in/experts-bring-in-use-organoids-to-learn-about-autism/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2023/06/csm_230516_20230428_Schaefer_AH_754750_0c6e94008e-1024x640.webp", "publishedAt": "2023-06-16T16:37:13Z", "content": "Microglia cells, which play a major role in the immune system of the brain, are difficult to study. Researchers have now succeeded in modelling the development of the brain and its immune system usin… [+5236 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "The Economist", "title": "The idea of “holobionts” represents a paradigm shift in biology - Hindustan Times", "description": "These meta-organisms are made up of animals, plants, and the microbiota that live on and inside them", "url": "https://www.hindustantimes.com/science/the-idea-of-holobionts-represents-a-paradigm-shift-in-biology-101686929414379.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/16/1600x900/Biology_1686929641219_1686929641409.jpg", "publishedAt": "2023-06-16T15:41:16Z", "content": "How many cells are there in a human being? It sounds like a question from a nerdy pub quiz. It is also a profound philosophical inquiry. One answer is around 37trn. This is the number, in a typical a… [+18128 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Long COVID linked to persistent inflammation • Earth.com - Earth.com", "description": "Long COVID linked to persistent inflammation • Earth.com", "url": "https://www.earth.com/news/long-covid-linked-to-persistent-inflammation/", "urlToImage": "https://cff2.earth.com/uploads/2023/06/16093338/Long-COVID2-scaled.jpg", "publishedAt": "2023-06-16T15:40:53Z", "content": "A team of researchers led by the Allen Institute for Immunology and the Fred Hutchinson Cancer Center has recently found that an overactive and prolonged inflammatory response could be at the root of… [+4323 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study discovers correlation between vitreous human biomarkers, Alzheimer's disease - ANI News", "description": "A new study from Boston Medical Centre discovered a link between biomarkers in the vitreous humour of the eye and pathologically verified instances of Alzheimer's disease (AD) and Chronic Traumatic Encephalopathy (CTE) in post-mortem brain and eye tissue.", "url": "https://www.aninews.in/news/science/study-discovers-correlation-between-vitreous-human-biomarkers-alzheimers-disease20230616210623", "urlToImage": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20230616151517.jpg", "publishedAt": "2023-06-16T15:36:00Z", "content": "Washington [US], June 16 (ANI): A new study from Boston Medical Centre discovered a link between biomarkers in the vitreous humour of the eye and pathologically verified instances of Alzheimer's dise… [+2875 chars]"}, {"source": {"id": null, "name": "Newswise"}, "author": "University of Eastern Finland", "title": "Childhood Light Activity Beats MVPA for Inflammation - Newswise", "description": "Increased sedentary time from childhood through young adulthood worsened low-grade inflammation in a new follow-up study.", "url": "https://www.newswise.com/articles/childhood-light-activity-beats-mvpa-for-inflammation", "urlToImage": "https://www.newswise.com/assets/new/img/newswise-logo-square.jpg", "publishedAt": "2023-06-16T15:35:00Z", "content": "Increased sedentary time from childhood through young adulthood worsened low-grade inflammation in a new follow-up study. However, the results also showed that light physical activity (LPA) may compl… [+5203 chars]"}, {"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "“Promising” trial results suggest chikungunya vaccine could be within reach - Gavi, the Vaccine Alliance", "description": "A phase 3 trial suggests the VLA1553 chikungunya vaccine candidate is safe, well tolerated and provokes strong antibody responses in 99% of recipients.", "url": "https://www.gavi.org/vaccineswork/promising-trial-results-suggest-chikungunya-vaccine-could-be-within-reach", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2023/Header/pexels-chokniti-khongchum-2280571_h1.jpg", "publishedAt": "2023-06-16T15:20:33Z", "content": "A vaccine against debilitating chikungunya disease has come a step closer as the results of a large human trial suggest a leading candidate provokes a strong immune response in 99% of participants an… [+4320 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Need for state-specific policies to seize rapidly rising epidemic of metabolic non-communicable diseases: ICMR study - ThePrint", "description": "New Delhi [India], June 16 (ANI): There is a need for urgent state-specific policies and interventions to arrest the rapidly rising epidemic of metabolic non-communicable diseases (NCDs) in India, according to a study conducted by the Indian Council of Medica…", "url": "https://theprint.in/health/need-for-state-specific-policies-to-seize-rapidly-rising-epidemic-of-metabolic-non-communicable-diseases-icmr-study/1629718/", "urlToImage": null, "publishedAt": "2023-06-16T15:14:21Z", "content": "New Delhi [India], June 16 (ANI): There is a need for urgent state-specific policies and interventions to arrest the rapidly rising epidemic of metabolic non-communicable diseases (NCDs) in India, ac… [+2609 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'We have been forgotten': People in northern Peru grapple with dengue outbreak • FRANCE 24 - FRANCE 24 English", "description": "Families bid farewell to loved ones who died of dengue fever, others remain hospitalised while health brigades fumigate homes in the northern Peruvian towns ...", "url": "https://www.youtube.com/watch?v=0le-tPNgPYo", "urlToImage": "https://i.ytimg.com/vi/0le-tPNgPYo/maxresdefault.jpg", "publishedAt": "2023-06-16T15:02:36Z", "content": null}, {"source": {"id": null, "name": "Psychiatric Times"}, "author": "D. Blake Woodside, MD, MSc, FRCPC", "title": "Neuromodulation in Anorexia Nervosa and Bulimia - Psychiatric Times", "description": "How can procedures like repetitive transcranial magnetic stimulation and deep brain stimulation help in the treatment of eating disorders?", "url": "https://www.psychiatrictimes.com/view/neuromodulation-in-anorexia-nervosa-and-bulimia", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/psychtimes/dafb7f417529351db96cab3a5879525183bb21c6-2000x2900.jpg?fit=crop&auto=format", "publishedAt": "2023-06-16T15:01:06Z", "content": "The eating disorders anorexia nervosa (AN) and bulimia nervosa (BN) are serious medical illnesses. AN has one of the highest mortality rates of any psychiatric illness, and high rates of development … [+6467 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Mayo Clinic Minute: Can testicular cancer affect fertility? - Mayo Clinic", "description": "It's a common concern among men who are diagnosed with testicular cancer. Will I be able to have children in the future?So what are the effects of testicular...", "url": "https://www.youtube.com/watch?v=qr2TH1-s3eQ", "urlToImage": "https://i.ytimg.com/vi/qr2TH1-s3eQ/maxresdefault.jpg", "publishedAt": "2023-06-16T14:57:06Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Benefits of honey for skin: 3 ways to add shahad in your beauty routine - Hindustan Times", "description": "Here are 3 strategies for maximising the benefits of honey and improving your beauty routine. | Fashion Trends", "url": "https://www.hindustantimes.com/lifestyle/fashion/benefits-of-honey-for-skin-3-ways-to-add-shahad-in-your-beauty-skincare-routine-101686925498291.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/16/1600x900/C7zdyYRV4AED8bC_1686926449427_1686926468918.jfif", "publishedAt": "2023-06-16T14:44:52Z", "content": "Honey or shahad is a natural ingredient that offers numerous benefits for the skin and it has been used for centuries as a beauty treatment due to its moisturising, soothing and antibacterial propert… [+3595 chars]"}, {"source": {"id": null, "name": "Odishatv.in"}, "author": "IANS", "title": "Ayurveda tips to keep your kidneys healthy & strengthen renal system - OTV News", "description": "Although renal transplants and kidney dialysis are the two most common treatment options for kidney failure or chronic kidney disease, they have their own side effects. The kidney may get rejected by the patient's body during a transplant or there may be chan…", "url": "https://odishatv.in/news/lifestyle/ayurveda-tips-to-keep-your-kidneys-healthy-strengthen-renal-system-207223", "urlToImage": "https://images.odishatv.in/uploadimage/library/16_9/16_9_5/recent_photo_1686926213.webp", "publishedAt": "2023-06-16T14:39:40Z", "content": "It might be scary to get diagnosed with chronic kidney disease (CKD) or worse, kidney failure. However, experts suggest that if you find the disease in its early stages, certain steps can be taken to… [+3109 chars]"}, {"source": {"id": null, "name": "Ophthalmologytimes.com"}, "author": "Sheryl Stevenson", "title": "SOE 2023: A look at current treatment options for diabetic macular oedema - Ophthalmology Times Europe", "description": "Dr Ala Moshiri provides an overview of current treatment options for diabetic macular oedema.", "url": "https://europe.ophthalmologytimes.com/view/soe-2023-a-look-at-current-treatment-options-for-diabetic-macular-oedema", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ophtimeeurope/1211a6cd9a41f7b2d7a7cd9ff62155f42282cac6-1280x720.png?fit=crop&auto=format", "publishedAt": "2023-06-16T14:15:48Z", "content": "Ala Moshiri, MD, PhD, discusses the various treatment options for patients with diabetic macular oedema with Sheryl Stevenson, group editorial director, during the 2023 European Society of Ophthalmol… [+3292 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Lucknow’s KGMU announces special OCD-screening clinic for school kids - Hindustan Times", "description": "King George's Medical University (KGMU) is offering a special clinic for screening obsessive compulsive disorder (OCD) in school-going children during vacations. The department runs the child and adolescent clinic on Monday, Wednesday and Friday. OCD is a men…", "url": "https://www.hindustantimes.com/cities/lucknow-news/special-clinic-at-kgmu-for-children-with-ocd-screening-available-during-vacation-time-and-regular-opd-for-symptoms-101686924466049.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/16/1600x900/For-representation-only--HT-File-Photo-_1686924462237.jpg", "publishedAt": "2023-06-16T14:07:45Z", "content": "Parents can visit a special clinic at the King Georges Medical University (KGMU) if their child suffers from obsessive compulsive disorder (OCD) \r\nFor representation only (HT File Photo)\r\nSince it is… [+1509 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Eric W. Dolan", "title": "Psychedelic drugs like LSD could enhance the effects of brain simulation - PsyPost", "description": "New research provides evidence that LSD alters the effects of brain stimulation and produces different and potentially larger changes in brain activity. The preliminary findings suggest that psychedelic drugs and brain stimulation may have a synergistic effec…", "url": "https://www.psypost.org/2023/06/psychedelic-drugs-like-lsd-could-enhance-the-effects-of-brain-simulation-165838", "urlToImage": "https://www.psypost.org/wp-content/uploads/2023/06/psychedelic-brain-image-1.jpg", "publishedAt": "2023-06-16T13:25:42Z", "content": "New research provides evidence that LSD alters the effects of brain stimulation and produces different and potentially larger changes in brain activity. The preliminary findings suggest that psychede… [+5370 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Jennifer Gershman, PharmD, CPh, PACS", "title": "First RSV Vaccines Are Approved and Others Are on the Horizon - Pharmacy Times", "description": "Adult and maternal RSV vaccines reveal positive findings.", "url": "https://www.pharmacytimes.com/view/first-rsv-vaccines-are-approved-and-others-are-on-the-horizon", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/7fa10bdbb0a01b29761b0ec6c8f91c6c4d560ac9-8798x3591.jpg?fit=crop&auto=format", "publishedAt": "2023-06-16T13:01:02Z", "content": "Respiratory syncytial virus (RSV) is a common respiratory virus that affects children and adults.1 Transmission occurs through contact with respiratory droplets from infected people and contaminated … [+21585 chars]"}, {"source": {"id": null, "name": "Iqvia.com"}, "author": null, "title": "Precision Medicine Oncology - IQVIA", "description": "<p>Precision oncology is becoming mainstream in clinical practice and research, driving the development of high-technology diagnostics and innovative treatments. Targetable molecular alterations enable treatment individualism and lead to increase of treatment…", "url": "https://www.iqvia.com/events/2023/06/precision-medicine-oncology", "urlToImage": "https://www.iqvia.com/-/media/iqvia/iqvia-logo-blue-bg.png", "publishedAt": "2023-06-16T12:50:02Z", "content": "Kriti Jindal is a Client Service manager in the Global Oncology team at IQVIA London. She has been a part of this team for 4 years. Kriti is a specialist in IQVIA’s syndicated oncology patient data. … [+707 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Hunter Focus Reviews: Worth It Or A Waste Of Money? - Deccan Herald", "description": "Do you need a brain booster supplement? Do you feel tired in your mind? With no energy and a lot of stress? Do you have trouble focusing and you are always feeling anxious? Hunter Focus Reviews: This means that your daily life is too hard and you need somethi…", "url": "https://www.deccanherald.com/brandspot/sponsored/hunter-focus-reviews-worth-it-or-a-waste-of-money-1228341.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201093-1228341-1686918938.jpg", "publishedAt": "2023-06-16T12:35:38Z", "content": "Do you need a brain booster supplement?\r\nDo you feel tired in your mind?\r\nWith no energy and a lot of stress?\r\nDo you have trouble focusing and you are always feeling anxious?\r\nHunter Focus Reviews: … [+18440 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Ada Kohli", "title": "How To Avoid Blackheads and Whiteheads - Hindustan Times", "description": "Here are a few ways to avoid blackheads and whiteheads.", "url": "https://www.hindustantimes.com/web-stories/lifestyle/how-to-avoid-blackheads-and-whiteheads-101686904186455.html", "urlToImage": null, "publishedAt": "2023-06-16T12:28:30Z", "content": "By Ada KohliPublished Jun 16, 2023\r\nHindustan TimesLifestyle"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Uddipta Banerjee", "title": "What happens when you give up sugar for a month? - The Indian Express", "description": "What happens when you give up sugar for a month?", "url": "https://indianexpress.com/web-stories/wellness/what-happens-when-you-give-up-sugar-for-a-month/", "urlToImage": "https://images.indianexpress.com/2023/06/cropped-Untitled-design-2023-06-15T124446.873-1.jpg", "publishedAt": "2023-06-16T12:08:46Z", "content": "Ankita Ghoshal Bisht, dietician in charge, Primus Super Speciality Hospital listed the changes one might see in his/her body:\r\nImproved blood sugar levels \r\nCutting out sugar can help stabilise your … [+726 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "IANS", "title": "Universal donor stem cell therapy to help treat degenerative brain diseases - DTNEXT", "description": "The team at Beckman Research Institute of City of Hope in California used a technique that allowed engineered hypoimmunogenic cells from a healthy donor to be transplanted into a humanised disease...", "url": "https://www.dtnext.in/lifestyle/wellbeing/universal-donor-stem-cell-therapy-to-help-treat-degenerative-brain-diseases-718848", "urlToImage": "https://dtnext-prod.s3.ap-south-1.amazonaws.com/h-upload/2023/06/16/741173-patnajune8socialnewsxyzbiharsdeputychiefministertejashwiyadavonthursdayclaimedthatbjpleaderswerecluelessonhowtocounterastrongoppositionunityinthecountryreactingtobjpclaims10.jpg", "publishedAt": "2023-06-16T12:00:28Z", "content": "NEW YORK: US scientists have developed universal donor stem cells that could one day provide lifesaving therapy to children with lethal brain conditions, such as Canavan disease, as well as to people… [+2041 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "D-Bal Max Reviews: Natural Bodybuilding Supplement! - Deccan Herald", "description": "D-Bal Max: This article will help you to know more about D-Bal Max and how well it works. It will also tell you about its effects on your body. We know that changing your body shape and building muscles is very hard and takes a lot of time and effort. If you …", "url": "https://www.deccanherald.com/brandspot/sponsored/d-bal-max-reviews-natural-bodybuilding-supplement-1228337.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/93-1228337-1686916336.jpg", "publishedAt": "2023-06-16T11:52:16Z", "content": "D-Bal Max: This article will help you to know more about D-Bal Max and how well it works. It will also tell you about its effects on your body. We know that changing your body shape and building musc… [+16391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Drawbacks of low progesterone levels - The Indian Express", "description": "Drawbacks of low progesterone levels", "url": "https://indianexpress.com/web-stories/wellness/drawbacks-of-low-progesterone-levels/", "urlToImage": "https://images.indianexpress.com/2023/03/progesterone.jpg", "publishedAt": "2023-06-16T11:37:58Z", "content": "According to nutritionist Lovneet Batra, women with low progesterone levels experience irregular periods, low libido, anxiety, waking up at night, bone loss, and fibrocystic breasts (painful, lumpy b… [+7 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "Sonali Sharma", "title": "5 health benefits of eating bhel puri - DNA India", "description": "Here are 5 potential health benefits of eating bhel puri", "url": "https://www.dnaindia.com/web-stories/lifestyle/5-benefits-of-bhel-puri-1686911953850", "urlToImage": null, "publishedAt": "2023-06-16T10:49:51Z", "content": "Jun 16, 2023, 04:19PM IST"}, {"source": {"id": null, "name": "PMLiVE"}, "author": null, "title": "Genetically altered vaccines developed to help eradicate polio - PMLiVE", "description": "The vaccines have been prevented from mutating into a dangerous form that can cause outbreaks", "url": "https://www.pmlive.com/pharma_news/genetically_altered_vaccines_developed_to_help_eradicate_polio_1493425", "urlToImage": "https://www.pmlive.com/__data/assets/image/0006/1453227/Clinical_development.jpg", "publishedAt": "2023-06-16T10:42:35Z", "content": "Researchers have genetically altered oral polio vaccines to significantly reduce the likelihood of the weakened virus mutating into a dangerous form that can cause outbreaks and paralysis.\r\nPolio is … [+2301 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "HyperGH 14x Reviews: Effects, Ingredients, and Where To Buy? - Deccan Herald", "description": "HyperGH 14x Reviews: Human Growth Hormone (HGH) is important for making and keeping your muscles strong. It can also help you look younger and healthier. But getting growth hormone shots can be risky, expensive, or even illegal depending on where you live. Th…", "url": "https://www.deccanherald.com/brandspot/sponsored/hypergh-14x-reviews-effects-ingredients-and-where-to-buy-1228312.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201089-1228312-1686911936.png", "publishedAt": "2023-06-16T10:38:56Z", "content": "HyperGH 14x Reviews: Human Growth Hormone (HGH) is important for making and keeping your muscles strong. It can also help you look younger and healthier. But getting growth hormone shots can be risky… [+17331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "Steps to reduce risk of oesophageal cancer - The Indian Express", "description": "Steps to reduce risk of oesophageal cancer", "url": "https://indianexpress.com/web-stories/wellness/steps-to-reduce-risk-of-oesophageal-cancer/", "urlToImage": "https://images.indianexpress.com/2023/03/OESOPHAGEAL.jpg", "publishedAt": "2023-06-16T10:34:45Z", "content": "Quit smoking: If you smoke, talk to your doctor about strategies for quitting. Medications and counselling are available to help you quit. If you dont use tobacco, dont start."}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Aayushi Gupta", "title": "International Men’s Health Week: 7 tips millennial men can follow to improve fertility - Health shots", "description": "Improving male fertility can be a shared responsibility. While it's important to consult with healthcare professionals for personalized advice, here are 7 basic tips that may help women support their partner's reproductive health.", "url": "https://www.healthshots.com/preventive-care/reproductive-care/7-tips-to-improve-male-fertility/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/16153046/Sperm.jpg", "publishedAt": "2023-06-16T10:30:39Z", "content": "In the journey towards building a happy and healthy family, reproductive health plays a vital role for both women and men. While women are often the focus of discussions surrounding fertility and rep… [+6039 chars]"}, {"source": {"id": null, "name": "Clevelandclinic.org"}, "author": "schneik4", "title": "How Uterine Fibroids Affect Your Digestive System - Health Essentials", "description": "Uterine fibroids can cause pelvic pain and bleeding between your periods — but did you know, depending on their size and location, they can also cause other issues like constipation?", "url": "https://health.clevelandclinic.org/can-uterine-fibroids-cause-digestive-problems/", "urlToImage": "https://health.clevelandclinic.org/wp-content/uploads/sites/3/2023/06/Uterine-Fibroids-GI-Problems-1468775991-770x533-1.jpg", "publishedAt": "2023-06-16T10:30:00Z", "content": "If you have uterine fibroids, youre already dealing with pelvic pain, discomfort and bleeding between your periods.\r\nCleveland Clinic is a non-profit academic medical center. Advertising on our site … [+3792 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "IANS", "title": "Climate change may engender new 'deadly virus', scientists warn UK govt | Lifestyle Health | English Manorama - Onmanorama", "description": "The government's Science, Innovation and Technology Committee was informed of a 'highly likely' arrival of Crimean-Congo haemorrhagic fever (CCHF) due to climate change.", "url": "https://www.onmanorama.com/lifestyle/health/2023/06/16/climate-change-may-engender-new-deadly-virus-scientists-warn-uk-govt.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/women/images/2023/2/28/medical-test-c.jpg", "publishedAt": "2023-06-16T10:03:46Z", "content": "London: UK's scientists have warned about a new 'deadly virus' that kills nearly every second patient, as the country's government attempts to prepare for new pandemics.\r\nThe government's Science, In… [+1788 chars]"}, {"source": {"id": null, "name": "Dnpindia.in"}, "author": "Aparna Singh", "title": "Explore the benefits of sprouted moong, increases bone density and good for heart - DNP INDIA ", "description": "Sprouted moong is a desi snack which is considered very healthy. It is included in the morning breakfast in many homes. But do you know why", "url": "https://www.dnpindia.in/current-affairs/explore-the-benefits-of-sprouted-moong-increases-bone-density-and-good-for-heart/248252/", "urlToImage": "https://www.dnpindia.in/wp-content/uploads/2023/06/Sprouted-Moong.webp", "publishedAt": "2023-06-16T10:00:33Z", "content": "Sprouted moong is a desi snack which is considered very healthy. It is included in the morning breakfast in many homes. But do you know why sprouted moong is so beneficial, what nutrients are found i… [+1897 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "Sanskar Tiwari", "title": "Are You in Stress? You Should Take These Steps to Overcome the Stress - News Track English", "description": "In today's fast-paced world, stress has become an inevitable part of our lives. Whether it's work pressure, personal problems, or the constant hustle and bustle, stress can take a toll on our mental and physical well-being. However, there are steps you can ta…", "url": "https://english.newstracklive.com/news/are-you-in-stress-you-should-take-these-steps-to-overcome-the-stress-emc-sc53-nu384-ta384-1280785-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Jun/16/big_thumb/Are-You-in-Stress-You-Should-Take-These-Steps-to-Overcome-the-Stress_648c2d8138a72.jpeg", "publishedAt": "2023-06-16T09:40:44Z", "content": "In today's fast-paced world, stress has become an inevitable part of our lives. Whether it's work pressure, personal problems, or the constant hustle and bustle, stress can take a toll on our mental … [+4945 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Altered gut bacteria might be early sign of Alzheimer's disease: Study - Hindustan Times", "description": "A study says people in early stages of Alzheimer's disease have assortment of bacteria in their intestines that differs from the gut bacteria of healthy people. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/altered-gut-bacteria-might-be-early-sign-of-alzheimers-disease-study-101686907347303.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/06/16/1600x900/brain_ageing_2_1667568611071_1686907620620.jpg", "publishedAt": "2023-06-16T09:31:19Z", "content": "According to a study conducted by researchers at Washington University School of Medicine in St. Louis, people in the early stages of Alzheimer's disease -- after brain changes have begun but before … [+5860 chars]"}, {"source": {"id": null, "name": "openPR"}, "author": "Worldwide Market Reports", "title": "Workable Strategic Report on Renal Cancer Market Demographic Trends, New Developments, Company Performance and - openPR", "description": "Renal Cancer Market 2023 is expected to experience robust growth offering market players a profitable opportunity to expand their presence in acknowledging economies and increase their revenue streams To strengthen their position and enhance their market shar…", "url": "https://www.openpr.com/news/3091659/workable-strategic-report-on-renal-cancer-market-demographic", "urlToImage": "https://cdn.openpr.com/W/6/W616750899_g.jpg", "publishedAt": "2023-06-16T09:29:05Z", "content": "Renal Cancer Market\r\nRenal Cancer Market 2023 is expected to experience robust growth, offering market players a profitable opportunity to expand their presence in acknowledging economies and increas… [+5720 chars]"}, {"source": {"id": null, "name": "Tripuratimes.com"}, "author": null, "title": "Covid pandemic increased diabetes among children, pregnant women - Tripuratimes", "description": "Covid pandemic increased diabetes among children, pregnant women", "url": "https://tripuratimes.com/ttimes/covid-pandemic-increased-diabetes-among-children-pregnant-women-8145.html", "urlToImage": "https://tripuratimes.com/backoffice/NewsImages/8145.jpg", "publishedAt": "2023-06-16T09:24:23Z", "content": "New York, Jun 06, 2023, IANS \r\nNew York, June 16 (IANS) The number of children diagnosed with Type-2 diabetes continued to rise in the year after the Covid-19 pandemic began, according to research.\r\n… [+2538 chars]"}, {"source": {"id": null, "name": "Indulgexpress.com"}, "author": "Deepika Rathod", "title": "Effects of stress: How it disturbs your gut bacteria - indulgexpress", "description": "Stress and headaches are linked to a disrupted gut-brain axis", "url": "https://www.indulgexpress.com/life-style/mind-and-body/2023/jun/16/effects-of-stress-how-it-disturbs-yourgut-bacteria-50049.html", "urlToImage": "https://images.indulgexpress.com/uploads/user/imagelibrary/2023/6/16/original/PhotoCreditsPexels.png", "publishedAt": "2023-06-16T08:53:00Z", "content": "Of late, people have started noticing brain fog issues with loss of concentration, which is affecting their day-to-day life. Stress, headaches, vertigo, brain fog, and other cognitive disturbances ca… [+4498 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eat These Foods To Reduce Sugar Cravings For Diabetics - NDTV", "description": "Read on as we list some foods you can add to your daily diet to boost overall health and reduce sugar cravings.", "url": "https://www.ndtv.com/health/eat-these-foods-to-reduce-sugar-cravings-for-diabetics-4126403", "urlToImage": "https://c.ndtvimg.com/2022-01/qmf6egto_sugar-cravings_625x300_07_January_22.jpg", "publishedAt": "2023-06-16T08:49:16Z", "content": "Sugar cravings can sometimes be a result of poor or inadequate diet\r\nConsuming too much sugar can lead to a cycle of sugar cravings and addiction, which can be difficult to break. When we consume sug… [+3213 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "The Conversation", "title": "What is a hernia? Are you at risk? - Moneycontrol", "description": "Hernia causes: Hernias, characterised by tissues or organs bulging through a weakened muscular wall, can occur at birth or later in life due to various factors. Inguinal hernias are the most common type, while femoral, umbilical, hiatus, and incisional hernia…", "url": "https://www.moneycontrol.com/news/health-and-fitness/what-is-a-hernia-are-you-at-risk-10808351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/How-to-treat-Hernia-770x433.jpg", "publishedAt": "2023-06-16T08:30:59Z", "content": "Pope Francishas had an operation this week to remove a hernia, which his surgeon said had been causing him increasingly frequent pain. This planned surgery was to remove a type of hernia caused by sc… [+4508 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "12 unhealthy lunch habits that increase your risk for life-threatening diseases - Indiatimes.com", "description": "​There are several factors that determine our health and one of these is good eating habits. On one hand, we are extremely careful about diet but unfortunately, on the other hand, we do not take care of our eating habits. These habits increase our risk of lif…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/12-unhealthy-lunch-habits-that-increase-your-risk-for-life-threatening-diseases/photostory/101040350.cms", "urlToImage": "https://static.toiimg.com/photo/101040493.cms", "publishedAt": "2023-06-16T08:30:00Z", "content": "Consuming unhealthy foods like sugary beverages, and processed food increases the risk of cancers like colorectal cancer. Unhealthy food causes obesity which is a risk factor for 13 cancers like meni… [+242 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Hope for Alzheimer’s: Can a new test on iron and glutathione levels hold the key to early diagnosis? - The Indian Express", "description": "Our team with clinical studies on Alzheimer’s patients has shown that iron deposition in the hippocampus along with decrease in the levels of the antioxidant glutathione in the same area of the brain is one of the important factors of the disease, says Dr Pra…", "url": "https://indianexpress.com/article/health-wellness/hope-for-alzheimers-new-test-on-iron-and-glutathione-levels-key-to-early-diagnosis-8666418/", "urlToImage": "https://images.indianexpress.com/2023/06/alzheimers.jpg", "publishedAt": "2023-06-16T07:19:08Z", "content": "The recent approval of three drugs to prevent cognitive decline in Alzheimers patients came as a ray of hope for many but could there be other factors at play? Dr Pravat Mandal, senior scientist and … [+5824 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Apple Cider Vinegar Pills for Weight Loss Quickly - Deccan Herald", "description": "Apple Cider Vinegar Pills for Weight Loss Quickly: Some companies make diet pills that they say can help you lose weight and be healthy. But they do not have to show anyone that their pills work or are safe before they sell them. This is not true. So we check…", "url": "https://www.deccanherald.com/brandspot/sponsored/apple-cider-vinegar-pills-for-weight-loss-quickly-1228263.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/90-1228263-1686899320.jpg", "publishedAt": "2023-06-16T07:06:50Z", "content": "Apple Cider Vinegar Pills for Weight Loss Quickly: Some companies make diet pills that they say can help you lose weight and be healthy. But they do not have to show anyone that their pills work or a… [+19621 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Common Diet Misakes That Are Negatively Affecting Your Overall Health - NDTV", "description": "NDTV.com: India, Business, Bollywood, Cricket, Video and Breaking News", "url": "https://www.ndtv.com/news", "urlToImage": "https://cdn.ndtv.com/common/images/ogndtv.png", "publishedAt": "2023-06-16T07:00:31Z", "content": "If you're a climate change warrior or know people doing incredible work, submit your entries &amp; we'll share the most innovative stories globally."}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dr Rajiv Lochan", "title": "Explained: Elevated Liver Enzymes And End Stage Liver Disease - Indiatimes.com", "description": "Liver enzymes are proteins produced by the liver that play a vital role in various metabolic functions. When these enzymes are elevated, it is an indication of liver damage or inflammation. If left untreated, this damage can progress and result in irreversibl…", "url": "https://www.indiatimes.com/explainers/news/explained-elevated-liver-enzymes-and-end-stage-liver-disease-606113.html", "urlToImage": "https://im.indiatimes.in/content/2023/Jun/Untitled_648beb14944d1.png", "publishedAt": "2023-06-16T06:01:50Z", "content": "Liver enzymes are proteins produced by the liver that play a vital role in various metabolic functions. When these enzymes are elevated, it is an indication of liver damage or inflammation. If left u… [+5548 chars]"}, {"source": {"id": null, "name": "Healthshots.com"}, "author": "Healthshots", "title": "7 weight loss benefits of pineapple - Health shots", "description": "Pineapple can be a helpful addition to a weight loss diet due to several reasons. Here are some potential weight loss benefits of eating pineapple regularly.", "url": "https://www.healthshots.com/web-stories/5-weight-loss-benefits-of-pineapple/", "urlToImage": "https://images.healthshots.com/healthshots/en/uploads/2023/06/14131653/pineapple.jpg", "publishedAt": "2023-06-16T05:44:49Z", "content": "Pineapple can be a helpful addition to a weight loss diet due to several reasons. Here are some potential weight loss benefits of eating pineapple regularly.\r\nPineapple is relatively low in calories … [+1287 chars]"}, {"source": {"id": null, "name": "Slurrp.com"}, "author": "Nikita Toppo", "title": "5 Weight Loss Edible Oils Perfect To Burn Belly Fat - Slurrp", "description": "When it comes to oils, many people think they are the biggest enemy of weight loss. However, not all of them fall into that category. When used in moderation, these oils support the overall health of the body. So, here are five healthy oils that can become a …", "url": "https://www.slurrp.com/article/sesame-and-more-5-weight-loss-edible-oils-perfect-to-burn-belly-fat-1686892315956", "urlToImage": "https://images.slurrp.com/prodarticles/mqsdfjt08bm.webp", "publishedAt": "2023-06-16T05:36:50Z", "content": "When considering weight loss, it is important to note that cold-pressed oils are better than processed or refined oil. Unlike processed or refined oils, they are extracted from fruits, seeds, or nuts… [+343 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Is Poha healthier than Rice? Here's what the nutritionists say - Times of India", "description": "Poha, a flattened rice dish commonly consumed in India, has gained popularity as a healthier alternative to regular rice. While both Poha and rice are derived from the same grain, there are some notable differences in their nutritional profiles. Health expert…", "url": "https://timesofindia.indiatimes.com/life-style/food-news/is-poha-healthier-than-rice-heres-what-the-nutritionists-say/photostory/101022874.cms", "urlToImage": "https://static.toiimg.com/photo/101036272.cms", "publishedAt": "2023-06-16T05:35:57Z", "content": "Poha, a flattened rice dish commonly consumed in India, has gained popularity as a healthier alternative to regular rice. While both Poha and rice are derived from the same grain, there are some nota… [+244 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sushmita Srivastav", "title": "How to get rid of cellulite naturally: With regular exercise, healthy diet, targeted treatment, patience - Moneycontrol", "description": "How to get rid of cellulite naturally: Cellulite is a complex condition influenced by various factors such as genetics, hormones, and lifestyle choices. Regular exercise, healthy diet, dry brushing, massage therapy, topical treatments, and advanced medical pr…", "url": "https://www.moneycontrol.com/news/health-and-fitness/how-to-get-rid-of-cellulite-naturally-with-regular-exercise-healthy-diet-targeted-treatment-patience-10805861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/How-to-get-rid-of-cellulites-in-the-arm-770x433.jpg", "publishedAt": "2023-06-16T04:11:59Z", "content": "Cellulite, the dimpled appearance of the skin usually found on the thighs, hips, and buttocks, is a common concern for many people. It is important to understand that cellulite can appear on skin reg… [+4624 chars]"}, {"source": {"id": null, "name": "Safetyandhealthmagazine.com"}, "author": null, "title": "Good sleep can support your weight loss journey, experts say - Safety+Health Magazine", "description": "Need help sticking to your diet and exercise plan? A good night’s sleep may help, new research shows.", "url": "https://www.safetyandhealthmagazine.com/articles/good-sleep-can-support-your-weight-loss-journey-experts-say", "urlToImage": "https://www.safetyandhealthmagazine.com/ext/resources/images/news/nutrition/alarm-clock-weights.jpg?height=635&t=1686923554&width=1200", "publishedAt": "2023-06-16T04:00:00Z", "content": "Need help sticking to your diet and exercise plan? A good nights sleep may help, new research shows. \r\nAmerican Heart Association researchers examined the sleep habits of 125 adults who met criteria … [+873 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Light Pollution Special Issue - EurekAlert", "description": "Light pollution is increasing around the globe, both in its intensity and geographic extent. Researchers are documenting its impact on ecosystems, human health, and culture, while warning that the wasted light has financial costs, environmental impacts, and i…", "url": "https://www.eurekalert.org/news-releases/992188", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-06-16T02:01:17Z", "content": "Light pollution is increasing around the globe, both in its intensity and geographic extent. Researchers are documenting its impact on ecosystems, human health, and culture, while warning that the wa… [+2980 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Education", "title": "How our immune system fights disease: Explained - Times of India", "description": "Learning with TOI News: The immune system protects our body from harmful invaders like bacteria, viruses, and pathogens. It recognizes foreign substances named antigens that", "url": "https://timesofindia.indiatimes.com/education/learning-with-toi/how-our-immune-system-fights-disease-explained/articleshow/100620910.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-100620836,width-1070,height-580,imgsize-19772,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-16T00:30:00Z", "content": "Top 10 most in-demand jobs of 2023 and beyond"}, {"source": {"id": null, "name": "Healio"}, "author": null, "title": "Study: Administer cefuroxime antimicrobial prophylaxis within 60 minutes prior to incision - Healio", "description": "Cefuroxime surgical antimicrobial prophylaxis should be administered within 60 minutes prior to incision to maximize risk reduction for surgical site infection in patients undergoing surgery, according to published results.      Rami Sommerstein, MD, and coll…", "url": "https://www.healio.com/news/orthopedics/20230615/study-administer-cefuroxime-antimicrobial-prophylaxis-within-60-minutes-prior-to-incision", "urlToImage": "https://www.healio.com/~/media/slack-news/stock-images/orthopedics/i/infection_in_joint.jpg", "publishedAt": "2023-06-15T19:35:51Z", "content": "Key takeaways:\r\n<ul><li>Cefuroxime antimicrobial prophylaxis should be administered within 60 minutes prior to incision to reduce risk for surgical site infection.</li><li>Administration within 10 to… [+1883 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "COVID-19 susceptibility mechanism discovered using a newly created tool - News-Medical.Net", "description": "Researchers have discovered a mechanism for COVID-19 susceptibility using a newly created tool. The tool, GASPACHO, captures dynamic changes in gene expression along the innate immune response, allowing researchers to identify genes and molecular pathways ass…", "url": "https://www.news-medical.net/news/20230615/COVID-19-susceptibility-mechanism-discovered-using-a-newly-created-tool.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Intensive_Care-620x480.jpg", "publishedAt": "2023-06-15T16:50:00Z", "content": "Researchers have discovered a mechanism for COVID-19 susceptibility using a newly created tool. The tool, GASPACHO, captures dynamic changes in gene expression along the innate immune response, allow… [+6192 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by India TV Lifestyle Desk", "title": "Mango shake or banana shake, which is better? Know what Ayurveda says - India TV News", "description": "Not all fruits are suitable for consumption with milk. From Ayurveda perspective, only those that are sweet in nature and fully ripe can be combined with milk.", "url": "https://www.indiatvnews.com/lifestyle/food/mango-shake-or-banana-shake-which-is-better-know-what-ayurveda-says-2023-06-15-876191", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/06/asa-1686843708.jpg", "publishedAt": "2023-06-15T15:52:06Z", "content": "When the soaring heat is just on our heads, what's better than a refreshing drink? Summers are known for its seasonal fruits like mango, lychee, watermelon and more. However, out of all the choices, … [+2219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "An Indian gel to heal diabetic foot ulcers? - The Indian Express", "description": "PGIMER, Chandigarh tests its efficacy in a new study. ‘Esmolol has a beneficial effect in reducing oxidative stress that may improve wound healing. The findings indicate that topical esmolol may be an appropriate addition to standard care protocols for treati…", "url": "https://indianexpress.com/article/health-wellness/an-indian-gel-to-heal-diabetic-foot-ulcers-8664829/", "urlToImage": "https://images.indianexpress.com/2023/06/diabetes-2.jpg", "publishedAt": "2023-06-15T12:10:06Z", "content": "Can a new foot gel, thats awaiting a rollout, work on diabetic foot ulcers? A study by the Post Graduate Institute of Medical Education and Research (PGIMER), Chandigarh, has found that an esmolol hy… [+5007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "shweta sandilya", "title": "How to deal with fibromyalgia? - The Indian Express", "description": "How to deal with fibromyalgia?", "url": "https://indianexpress.com/web-stories/wellness/how-to-deal-with-fibromyalgia/", "urlToImage": "https://images.indianexpress.com/2023/05/fibromyalgia-1.jpg", "publishedAt": "2023-06-15T10:08:50Z", "content": "One can improve sleeping patterns by avoiding coffee at night, keeping the room at a cool, comfortable temperature and turning off electronic devices before sleeping."}]}